[{"rating": 5.0, "review": "It's perfect. Having owned the Logitec Revue and a Sony SMP-100, I'm pretty familiar with set top boxes acting like smart TV's. The Logitec Revue's best feature was its keyboard. However, I'm not sure if Logitec stopped providing updates but after some time, it would freeze on me and the only way to reset was to pull the plug. The Sony SMP-100 was DLNA compliant so it allowed me to stream my personal media. However, the media didn't always work (buffer, audio sync, etc). TV WATCHING:  I was a little hesitant with this as I didn't see anywhere that it was DLNA compliant, but I bought it mostly for my daughters to watch Netflix and play games. Best purchase ever! The Fire TV is fast. No loading and with my cable internet service, it works beautifully at 1080p. The voice search is amazing. My daughters used to ask me to search for stuff because they (4 and 5 years old) can't spell. Those days are gone. I taught them how to use the voice search once and it finds everything they look for. Sometimes, they don't even watch anything they just shout at the TV to see what it'll bring up. Best of all, I can 'throw' stuff from my Kindle Fire HDX to the TV. So if my daughters want to watch a show, I can be in any other room in the house, search for the show on my Kindle, and just throw it on the TV for the girls to watch. Don't even have to get out of bed.GAMES: This isn't a console. I own a gaming PC and a PS4 and this is leagues behind those. But, that's ok, because gaming is just a 'bonus'. But it is an awesome bonus. Sev Zero (I bought the game pad too) is a pretty good tower defense game. For the girls, they love Rayman. Sonic is another good addition to the mix as it's simple enough to play and looks great on my 50 inch TV. The Fire TV handles everything. Even when suspending an app and going to a movie, it doesn't lag or freeze, it just works.BONUS: Even though the device doesn't say it DLNA compliant, the Plex app is available for the Fire TV and it is perfect. I can stream all of my home movies, pictures, music and other media type and it streams it flawlessly. It's not selective like my Sony SMP-100. Whether it was MKV or DIVX or MP4, it all worked as if I was watching something off of Netflix or Amazon Prime.OVERALL: I bought the Fire TV for my daughters but it has become an integral part of our TV watching routine. I didn't think such a simple thing like voice search was gonna be so important but it's not only fun for my daughters but convenient for me as I don't have to stop washing dishes or cooking dinner to find something for them to watch. Also, the games are pretty entertaining. Even the translation from tablet to game pad was done well. The controller is responsive and works like it's supposed to. Design wise, it's a little big for my daughter's hands but maybe Amazon will come out with a 'mini' version sometime in the future. (Or design it more like a Playstation controller? One can wish.) Amazon got it right and this is one of my favorite purchases. My daughters love it so much they don't even bother using Netflix anymore as the voice search only works for Amazon's content.", "verified": true, "helpfulness": "4/5", "author": "LilDawgz"}, {"rating": 4.0, "review": "Love it.  Wish voice search would also work in apps.  It's very time consuming typing items into the Youtube, vimeo, & Netflix search bar.", "verified": true, "helpfulness": "1/1", "author": "Joshua L"}, {"rating": 5.0, "review": "BEST EVER SCREW CABLE BILLS!!!!!!!", "verified": true, "helpfulness": "3/4", "author": "Michael Holloway"}, {"rating": 5.0, "review": "I love the voice search option. When I first purchased it, I didn't think I would use that feature at all. Now, it's so convenient, I can search by movie, TV show, or actor. There may be other ways but those are the ones I've tried. If you are on the home page, it will auto shut off after a while of non use. If you have paused a movie or just stopped it, it will go to a screen saver mode but the little box will stay on (I would rather it auto shut off after so long no matter what and saved some energy). I have my parental controls all set up so the boys can't get in there and buy movies or watch something they shouldn't....need my pin for that. There have only been two times that there was a movie we wanted to watch that wasn't available. One was Cloudy With a Chance of Meatballs 2 (like 6/2014) and the other was Hunger Games: Catching Fire 8/2014. Otherwise, we have watched through Prime or rented. Highly recommend!", "verified": true, "helpfulness": "1/1", "author": "Lisa M Brackenridge"}, {"rating": 5.0, "review": "First of all I would like to say that I've bought everything that there is on the market - Apple TV, most of the Roku products, Chromecast, some Android solutions, TiVO and tried and tried, until I got THE REAL DEAL - Fire TV.1. Best ever \"out of the box\" experience.2. Quicker than anything else I have tried3. Voice search (could be better)4. The way it handles the content. Videos, apps, games, books5. Streaming - more or less excellent.6. Media streaming from other devices like Mac, iPad or Android devices. EDIT (You'll need an app for that - I am using AirPlay/DLNA Receiver PRO http://www.amazon.com/gp/product/B00LAT7QV6/ref=oh_aui_d_detailpage_o03_?ie=UTF8&psc;=1, works IMMEDIATELY! )7. Integration with Kindle Fire HD - sweet!!!8. Remote - simple, yet best experience I have ever had. One thing I can point out here is that I would like to see headphones on the remote as with Roku, but...All I can do now is buy more of those - period!Thanks Amazon!EDIT 1:1. Remote - after using it A LOT :), I could imagine having some backlight on the remote and a proposal for the developers at Amazon - try to do something with the click wheel - like volume up and down for an example...2. Initially I thought that Fire TV is fast. I have to correct myself here and say that it is even faster than I thought! It is soon smooth and works really, really nicely... Other companies can only learn here.3. Voice search - somehow it is improving over time, or is it just me!?", "verified": true, "helpfulness": "6/6", "author": "Thunderhawk"}, {"rating": 4.0, "review": "I've been using this for a little while now and parts of it are great, while other parts are lacking.Speed - 5/5 - this box is sooo much faster than the Blu-ray player I was using.  I started to count the seconds after the video was selected before it started playing, so that I could compare it to the player.  The video started almost immediately - I couldn't even get past 1!Interface - 2/5 - When browsing, the interface is a bit clunky and could really use some refinement.  It is a side-scroll, and when you select the next item, it jumps over and increases in size.  It is a bit jarring, and it gave me a headache after just a short time (I wish companies would learn that not everything needs to be animated!).  The aforementioned player had everything laid out in a nice, neat grid.  I could see 15-20 items in my watch list (or whatever category I was looking at), and then go to the next page.  The Fire TV makes you go through everything, *one-by-one*.  I have a watch list so that I don't have to remember what I want to watch; when I browse, it would be nice to see other options all at once.Set-up - 5/5 - I followed the on-screen instructions, and was up and running in a very short time.  It's in the bedroom of my apartment, but the signal I get is very strong.A/V quality - 5/5 - The picture is crystal clear and sounds good through the TV.Remote - 4/5 - The remote is unique and the different buttons do different things depending on the app, like the Fast-forward/reverse in Amazon Instant or Netflix.  It would be nice if it was all the same across the board.", "verified": false, "helpfulness": "5/5", "author": "Jehane"}, {"rating": 5.0, "review": "I bought 2 of these, one for myself and one for my father. and they are an amazing piece of machine. small and compact and works very fast. would love to see more software implemented in it like mp3 video playback from USB, but other then that is great.", "verified": true, "helpfulness": "1/1", "author": "R. Ras"}, {"rating": 4.0, "review": "What set's this device apart from other streaming devices is the smoothness of the control.  It just feels very right.", "verified": true, "helpfulness": "1/1", "author": "lpeters82"}, {"rating": 5.0, "review": "Great device - very intuitive.  I love that it comes preprogammed with my Amazon Prime info.  It even recognizes my Texas accent when I use the voice recognition feature.", "verified": true, "helpfulness": "1/1", "author": "Kay Parker"}, {"rating": 4.0, "review": "so much to choose from ! enjoying Netflix & huluplus as well as mlb.tv.Playing the music from Amazon Prime from my tablet to the soundbar is cool..only issue is I need to call my at&t; sevice as some of the content buffers too long telling me I need a faster download speed ? works fine with most but I might have to upgrade on my internet service for all of the programming on the Amazon Fire TV to be available to watch..had about a month & still finding more interesting programming available & the music is to be available without playing thru device soon ? overall satisfied & hoping they add even more in the future.", "verified": true, "helpfulness": "1/1", "author": "Fred Soria"}]