[{"rating": 5.0, "review": "It was very ease to hook up, and being a prime member I have been enjoying a lot of free movies....", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Lorena"}, {"rating": 2.0, "review": "Most time it's hard to get the show u want to see", "verified": true, "helpfulness": "0/0", "author": "Roderick Colebrook"}, {"rating": 4.0, "review": "I love the Fire TV.  The voice remote is very nice, however it only searches for a show, it doesn't respond to play. I like that it connects to your prime membership account and everything is saved for you.  I didn't give it five stars because it only mirrors it's own products and I wish I could mirror my Apple products and I would like the voice remote to be able to respond to more commands.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 3.0, "review": "We enjoy Amazon Fire TV, but have trouble playing regular shows that we like from my Kindle Fire to the TV.(Example:  recently broadcast Castle, Elementary episodes).  We took my Kindle to Best Buy (where we bought the fire TV),but they didn't know how to get the show that plays on my kindle fire onto our main TV.  Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "DL"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "R.Nunez"}, {"rating": 3.0, "review": "Need more apps", "verified": true, "helpfulness": "0/0", "author": "Cesarz"}, {"rating": 3.0, "review": "Not what I expected. Does not have as many movies to watch.  Prime members pay too much for what can do", "verified": true, "helpfulness": "0/0", "author": "Mike Stone"}, {"rating": 5.0, "review": "This was amazing .. I was a bit apprehensive at first to use it !! I not tecy! Found it easy to use and love the TONS OF CHOICES !!", "verified": true, "helpfulness": "0/0", "author": "JoAnna Ignace"}, {"rating": 5.0, "review": "I didn't know whether I would like Amazon Fire TV as much as Apple TV but I love it.  It was easy to set up and the voice command really works. I would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "JoAnn"}]