[{"rating": 5.0, "review": "love using it to watch Netflix and You tube on my large screen tv and control from my iphone.Want to buy one for each TV!", "verified": true, "helpfulness": "1/1", "author": "SANJAY DHAR"}, {"rating": 2.0, "review": "Yes, it is cheap like they give out razors for the cheap...so they can get you on the blades that you would constantly have to payWhy would they technically stop you from playing whatever videos you have on your media? That was low ball way to control what you watch on your TV!Do you know why I love the Samsung Tablet and do not buy the Apple IPad or the Kindle fire? Because they (Apple and Kindle) do not allow you to insert ad SD card. Cause they want you be held hostage to their contents.So Chromecast is a FAIL in my book.I am sure someone is going to come out with a device that you can broadcast whatever from your tablet to your TV Anything  you have on your property is yours and you should be able to watch it on your TV. You don't need these Nosey Poseys permission. and then this would go the way of the Do Do bird.", "verified": true, "helpfulness": "0/2", "author": "Phoenix \"AZ\""}, {"rating": 5.0, "review": "I love this little stick. I have a older flat screen in my bedroom so it works perfectly with it. I only wish they would put more apps on it.", "verified": true, "helpfulness": "1/1", "author": "bryan drake"}, {"rating": 4.0, "review": "Prefer IE but had to install GOOGLE CHROME - now run two browsers because wife is more comfortable with IE.Product itself works fine though did have problems getting router to recognize it. Once up and ready to cast GREAT!UPDATE 10-13-2013 WORKED WELL BEFORE INITIAL REVIEW ABOVE - There must be a software problem in the APP because tried to castlast night ad got errors on PC and on Chromecast via TV that can't access internet. NOTHING HAS CHANGED on my system. Tried uninstall and reinstall APP and reset of chromecast and still indicates no internet access. I have uninstalled CHROME browser and will continue to work on the problem but right now I'm fed up!", "verified": true, "helpfulness": "1/2", "author": "JimBob"}, {"rating": 5.0, "review": "This is a great product for people who don't have/ don't want to pay $100 for apple tv or roku or you don't have a gaming system. Not only does Netflix and Youtube play effortlessly, any other video in a tab can play full screen. Fantastic invention from a fantastic innovative company.", "verified": true, "helpfulness": "1/2", "author": "Sheriffe J. Oliver"}, {"rating": 5.0, "review": "Pros: Easy to install and high quality display on TV.Cons: Beside of YouTube and Netflix, can't hook up others using iPhone and iPad.", "verified": true, "helpfulness": "1/1", "author": "Jun Wu"}, {"rating": 4.0, "review": "If you use Netflix or even Hulu Plus on your mobile devices, this device cannot be beat for its price.", "verified": true, "helpfulness": "0/2", "author": "Eddy Mar"}, {"rating": 2.0, "review": "I couldn't get it to work.  The chromecast people had me do this and that, but nothing helped.  They said theywould connect me with a more expert expert, and/or send me a replacement because maybe the one I hadwas defective.  But they did neither, and I'm sitting here with nothing to show for what I paid.", "verified": true, "helpfulness": "0/3", "author": "catsfugue \"catsfugue\""}, {"rating": 5.0, "review": "Bought this little thing to see how it would work with Netflix. Setting up was real easy and streaming movies was flawless, even got subtitle that I couldn't get with my Sony blue-ray DVD player.", "verified": true, "helpfulness": "0/1", "author": "y."}, {"rating": 4.0, "review": "I had expected it to broadcast everything from my Chrome browser, but it does not seem to do so.It is very easy, however, to set up for broadcasting YouTube and Netflix streaming videos from my smartphone.I would say it is worth the $35 I paid.", "verified": true, "helpfulness": "0/1", "author": "Don in Florida"}]