[{"rating": 1.0, "review": "It Sounded like a good idea, unfortunately the hype writers and the designers seem to have been working from a different scriptOne of my many complaints is that once it is plugged in, it sits there and consumes around 500Kbps of bandwidth WHILE IDLEthat may be a good thing if you have a really FAST connection and unlimited data usage, BUT some of us have less than ideal conditions, and that 500K represents a significant part of the available bandwidth,Second major gripe,I could NOT get it to connect to the wi-fi router I wanted to use, and once I let connect to the one IT wanted, there doesn't seem to be any practical way to reconfigure it to a different routerand the straw that broke the camel's backOnce I got it hooked up and tried to use it, playback was so slow and choppy that it was worse than useless`YMMV,  but that's what I learned in trying to get it to work", "verified": true, "helpfulness": "3/6", "author": "grouchy"}, {"rating": 4.0, "review": "I hooked the Chromecast up to a Toshiba 20 inch TV in our bedroom. I didn't want to have anything complicated like a DVR or computer in the BR, which is what I use elsewhere in the house. I've watched several programs on Netflix and some high and low quality videos off YouTube, and I can say the playback if impressive. The Toshiba is 1080P and the picture never froze up or pixalated in any way.I've got an ASUS wireless N300 network, with nothing set up to give priority to the Chromecast device. So what I'm getting in the way of performance should be \"typical\" for me at least. Most of my devices are wired gigabyte ethernet, so the wireless capacity is pretty open most of the time. Will have to test it with simultaneous laptop and phone usage to see if the performance suffers.One thing to note is if you're running a PC with less than Windows 7, Chromecast for Windows won't work. That is something not mentioned in the Amazon ad. Plus it only runs on the 2.4 Ghrz frequency and not the 5 ghrz used on dual band networks. So it is possible to get interference from devices running on the 2.4 frequency. We have a home phone using that frequency, but it's not used very often and shouldn't pose a problem.I'd give the device a 5 if there were more apps, or if you could stream your own content from within your network. I think that was originally supposed to be possible, but it seems to have gotten yanked in the final product. Perhaps it'll come later, and they just wanted to get it out on time.", "verified": true, "helpfulness": "0/1", "author": "Riledup \"Jim\""}, {"rating": 5.0, "review": "Works as advertised with all of my Apple devices.  One time setup took only minutes.  Just introduce Chromecast to your wi-fi network and away you go.", "verified": true, "helpfulness": "0/1", "author": "Roland CAputo"}, {"rating": 5.0, "review": "Great way to watch Netflix, Youtube, and listen to Google Music, and I feel like there is so much more potential with the Google Chromecast when more features are added.  \"Casting\" a chrome browser tab is pretty snappy right now, although a little laggy, and kind of weird to browse on the laptop while it is being displayed on the tv.  Overall, Netflix, Youtube and google music are worth the $35, but I would bet there's more to come (ie. Picasa, Google plus, etc.)", "verified": true, "helpfulness": "0/1", "author": "M. pantera \"MP\""}, {"rating": 5.0, "review": "This is awesome.  I like it better than the Apple TV.  I certainly hope more apps are able to work with it soon - this is a great way to watch video or listen to audio from a tablet or laptop. That said, it IS limited in sources you can view from.The setup was soooooooo simple.  I read the (rather sparse) instructions in the box, and asked my 11 year old to see if she could follow the directions to set it up.  She did, no issues.  wonderful design.  Great job, Google.Amazon, get on this train! Get support for this in your Video app for Android! it's sweet.", "verified": true, "helpfulness": "0/1", "author": "SM777"}, {"rating": 5.0, "review": "Very easy install and setup. Netflix app works great (my new favorite Netflix app.) the Chrome browser cast to the TV with ease and a very good picture for watching Hulu Plus etc. My only 2 complaints are the limited apps and the fact that the only Chrome browser that can cast to the TV is from your computer, I wanted to use the Chrome browser on my Android tablet which is much easier to use for casting to the TV than a bulky laptop.Update: now that they have added Hulu Plus I'm very happy. I like the Netflix and Hulu Plus apps much better than the apps on my smart TV. Well worth the money and if they add the mobile Chrome browser to chromecast it would be awesome!", "verified": true, "helpfulness": "0/1", "author": "Mark R. \"Biker Mark\""}, {"rating": 4.0, "review": "Works well with Galaxy S4, and Kindle Fire. Only 3 apps available, but more than sufficient for our bedroom use. Inexpensive way to see Netflix streaming (Apple TV in our living room.) It was worth the wait to receive it. ALSO, our 'Prime' membership is well worth the annual fee. We use it all year long.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Worked fine with my very old single band wireless router but then I bought a dual band and it stopped working.  I learned that Chromecast does not work with 5.0 ghz so I disabled that band.  Even so I could not see the Chromecast in my iphone's wifi settings (which you need to do to set up Chromecast).  I spent 2 hours on the phone with my wireless router support to get my router to recognize Chromecast, but they couldn't make it work.  My advice is to check whether your wireless router is compatible with Chromecast before you invest the money.  Must add that I've been using roku for a few years and I like it very much.  Regrettably, I will return the Chromecast.  Update: Google decided I had a defective item and its tech agreed to a warranty replacement.  The warranty replacement dept has contacted me and is dragging its feet.  Device going back to amazon tomorrow.", "verified": true, "helpfulness": "2/3", "author": "Laurie Bennett"}, {"rating": 5.0, "review": "It works well for me, only a pity it is not more versatile! I'm hoping future updates will include wider use of this nifty device.", "verified": true, "helpfulness": "0/1", "author": "Ikey G"}, {"rating": 1.0, "review": "The device stopped working with Netflix and Google team can't even fix the issue, neither can Netflix team. Keep away from it, apple TV is far better. The price diff may be high but that is the difference between quality and cheap products.", "verified": false, "helpfulness": "0/1", "author": "Siva"}]