[{"rating": 4.0, "review": "I love this product. It compliments by Fire TV perfectly. I don't see either product as a replacement for the other, but rather a great compliment. With Fire TV you can't search youtube through your phone, which is what we primarily use the Chromecast for. For $35 dollars though, this is a steal and you cannot go wrong.", "verified": true, "helpfulness": "0/0", "author": "Eric P"}, {"rating": 4.0, "review": "This is great for what it is but does have some limitations. You can't easily stream existing media from your laptop for example, and it's nearly impossible to use it with a hotel wireless that requires you to authenticate on a web page. If you want to do that - you need to bring your own mini wireless hotspot (there are some designed to work in hotel environments that can repeat out to a hotel wireless.)", "verified": true, "helpfulness": "0/0", "author": "Walt"}, {"rating": 5.0, "review": "Works well like described. I bought it as a gift for my grandparents. Works well for them and its pretty easy to setup they say.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"C&A;\""}, {"rating": 5.0, "review": "I really use it all days and my kids are in love with this device.It's a really nice gadget to my LCD screen.", "verified": true, "helpfulness": "0/0", "author": "Mauricio Aguilar"}, {"rating": 5.0, "review": "How can you go wrong for the money?And with more features being added all the time it just keeps getting better and better!", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Chromecast is small, so you can bring it anywhere. I used it to stream HBO GO(which is perfect for chromecast) on TVs when I go places without HBO. One issue is that it doesn't always stream videos from some other sites perfectly (if the video isn't compatible, audio won't work.) It is really easy to set up, and with the Chrome browser, it is very easy to stream.  Overall, I am very satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "angela"}, {"rating": 1.0, "review": "i found out  that chromecast won't work with prime movies after i bought it. it only works with limited players", "verified": false, "helpfulness": "1/2", "author": "mike"}, {"rating": 4.0, "review": "Google Chrome worked as it said it would. It works well with Netflix and Hulu. The only problem I had with it was it didn't work with Amazon Prime videos.", "verified": true, "helpfulness": "0/1", "author": "Denise Carter"}, {"rating": 4.0, "review": "I bought this because I have a TV in my bedroom that isn't a smart TV and a bluray player that doesn't have built in wifi, and I wanted to be able to watch Netflix in that room. For that purpose, Chromecast is excellent. Set up was easy, and it streams Netflix flawlessly. I've also used it to play YouTube videos on the TV and that also works very well. My only complaint is that it can't do more. For example, I'd like to be able to use my Amazon Prime account and stream videos from that like I can on my smart TV downstairs. I know google is adding more features and as they do, I may upgrade this to a 5 star. It does what it does very well, but loses one star because I wish it could do more. For the price though, it works well and I would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "BigJohnStud"}, {"rating": 5.0, "review": "This product surely surpass all my expectation.It is so flexible,and everyday I discover more ways to connect to this product,Every home should have one of these.Its a product that I cant live without.on its way to the future of wireless connection on all mediaThanks", "verified": true, "helpfulness": "0/0", "author": "Stephen P. Ocampo"}]