[{"rating": 5.0, "review": "Very intuitive, I only use it to stream Sling TV and it works well.  EASY setup, amazon nailed that aspect of the player, I am not a computer whiz and it walked me right through the set up instructions.  Like how it \"falls asleep\" after 30 minutes to save energy and the only thing you need to do to \"wake it up\" is to push one of the buttons on the remote and it turns on my TV as well.  Only have used the voice recognition a couple of times and it worked perfectly.  I bought it with Sling TV and got it at half price which was nice.  Very nice toy to go with my TV, one has to be a fool to pay for cable.", "verified": true, "helpfulness": "0/0", "author": "portmanduck"}, {"rating": 5.0, "review": "Incredible little box, and the remote is fantastic! No more line of sight required, as it is Bluetooth. If I had to mention any downside is that the Fire TV, values speed over quality and Netflix shows begin looking like horrible YouTube videos that were recorded using a cheap feature phone, but alas, I can put the blame on my lousy Internet connection. Still, a little extra buffering would be appreciated.", "verified": true, "helpfulness": "0/0", "author": "Jose Oscar Evia Munoz \"Excel junkie\""}, {"rating": 5.0, "review": "LOVE LOVE LOVE!!!", "verified": true, "helpfulness": "0/0", "author": "Amie Ciesliga"}, {"rating": 5.0, "review": "I love Amazon Fire TV. help me to save a lots of money.", "verified": true, "helpfulness": "0/0", "author": "Juanita Zenteno"}, {"rating": 3.0, "review": "Limited space, slows all other devices down that's connected to the same wifi,and, I'ts missing some enjoyable apps that are available on the Roku", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "I love it, but wish there was connectivity between this and my Echo.", "verified": true, "helpfulness": "0/0", "author": "Brandon Maas"}, {"rating": 4.0, "review": "Would definitely give this 5 stars IF it had cheaper pay content!  I spend so much money per year with Amazon (Prime member for several years now) & for some reason everything I want to watch has a high price to pay.  Redbox charges $1.25 for new releases, and on FireTV, it is like $14.99 for a new release.  Also, why can I watch a new release on my computer through Prime Instant Video, but FireTV asks me to pay for the same movie via my tv?  I'm confused! HELP!  Otherwise, the device is small & works awesome!  Thanks!!", "verified": true, "helpfulness": "1/2", "author": "DUB"}, {"rating": 5.0, "review": "its dam nice try it youll love it", "verified": true, "helpfulness": "0/0", "author": "joseph benenati"}, {"rating": 5.0, "review": "We save money by not having dish or cable, and get all the shows we want on Fire TV or Netflix through this TV box! It's been almost a year and I'm still happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Olivia Williams"}, {"rating": 5.0, "review": "I previously was streaming Netflix and Amazon videos via a Sony Blu-Ray player that had internet connectivity.  That was OK, but it passed through a Sony server (from content provider to me), and I think that system was the weak link:  many times, my programming was unavailable when the Sony server went down, even though I clearly was still connected to the internet.  I wasn't using wireless, by the way.  I was connecting directly through Ethernet cable from a Time-Warner modem.  Video quality was just \"OK,\" and the interface was comparatively clunky.Because the price was attractive and the reviews were generally good, I decided to switch to the Amazon Fire TV box.  Wow!  I'm really happy I did, and wish I'd done so long ago.  It has a great interface.  I perceive the picture quality to be improved over what I earlier experienced with the Sony system, probably because of superior speed.  The Fire TV is remarkably small, easily installed, but powerful.  [Note that I opted to purchase the Fire TV vs. the Fire Stick because I want to stream via Ethernet, rather than wireless network, although the Fire TV accommodates wireless connection, too.] The Amazon remote is wonderfully designed -- small, sleek, streamlined, with a minimum of buttons.  It offers many Apps I now use regularly (NetFlix*, HBO Go*, Mahogany, PBS Video, Smithsonian Channel, TED TV, History, YouTube, Sling, Showtime Anytime*, CBS News), plus dozens more you can load.  [Note:  (*) in my list means use of the particular App requires subscription fees].", "verified": true, "helpfulness": "0/0", "author": "agathokles \"agathokles\""}]