[{"rating": 4.0, "review": "I am NOT reviewing the Chromecast, which I want. (I don't NEED one because I can hook my laptop to my non-smart HDTV with an HDMI cable, or use my smart Blu-Ray player to watch streaming content.) Rather, I'm \"reviewing\" all of these resellers who are offering the $35 Chromecast for an incredibly low-low price ranging from $69.95 to $149.99 (and they even let you pay for the SHIPPING)!The news is talking about how the Chromecast sold out within less than 24 hours. Hmmm-- would anyone care to guess WHY it sold out so quickly? That's right, it's because a bunch of greedy scum-sucking low-life resellers bought it up so they could resell it for 2-to-4.2857 times the original price.I give the Chromecast a rating of plus 5 stars (even though I haven't tried one yet).I give the greedy, slime-ball, bottom-dwelling, opportunistic resellers a rating of minus 10 stars-- especially the ones who are \"just starting up\" (yeah, they opened up shop TODAY after they bought up all the available Chromecasts, and they'll probably mysteriously close up shop next week when the Chromecast is once again available from Amazon and Best Buy).Amazon should be absolutely ASHAMED of itself for giving these dishonest, disreputable resellers a platform from which to RIP OFF anyone who's stupid enough to order from them!Edit: OK, I upgraded my rating from 1 to 4 stars, since my 1-star rating was due to utter disgust at these resellers-- one of whom is now offering the Chromecast for $999.99! I can't give the product a 5-star rating yet, but I'll edit my \"review\" again after I'm finally able to pick one up at Best Buy and have tested it thoroughly.", "verified": false, "helpfulness": "40/175", "author": "Michael S."}, {"rating": 5.0, "review": "So the Chromecast came to my office today (Amazon is always best on shipping). Within 5 minutes it was setup (go to webpage or app). Within 10 minutes of getting it we had 5 different devices connected and casting to it (iphone, s2, HTC Dna, Chromebook Pixel, and Mac Mini). Everyone on the same network as the Chromecast can see it and control it (not just the person who started it). We took turns adding our next youtube clip, Google Play song, or Netflix show. Seemless integration between switching content from all different devices.This is a game changer and apps are stupid to not jump on this bandwagon. Thank you google for once again innovating at a LOW price point!", "verified": true, "helpfulness": "274/352", "author": "Dean"}, {"rating": 4.0, "review": "So the way Chromecast is primarily intended to work is as a client for cloud-based services like Netflix that have been enhanced to specifically support the device. In those cases the cloud service is able to use whatever proprietary compression and DRM google has implemented to be able to stream at 1080p directly to your Chromecast.You start a movie on your phone and when you say \"cast this to my TV\" it doesn't start broadcasting from the phone, it simply sends a command to the Chromecast telling it to connect to Netflix (or wherever) and continue streaming the same content. This is great for performance and battery life on your phone, but it does mean that what's actually going on is not exactly what it might look like at first.However if your stream is coming from a local device in your house, such as casting a Chrome web browser tab or sending a local video file to it, then it appears that it will only do 720p quality video.Still a very useful gadget, but it's not currently usable as a local \"dumb\" WiFi to 1080p HDMI adapter unless it's pulling its data from an outside cloud provider. You can't send your own 1080p content to it.Of course it's new and much of this might be subject to change.G.", "verified": true, "helpfulness": "53/69", "author": "Gavin Scott"}, {"rating": 2.0, "review": "I was excited for the release of this product.  I was able to get a pre-release version of it. What was being touted was that it was an alternative to cable, however once I got it, I realized this was wholly untrue, I was disappointed at the lack of functionality that it had.You can't replace cable with the Chromecast. No basic cable channels. That truthfully wasn't that big of a surprise, however there isn't even Hulu. There's not Amazon. There's not local media. There's no original content. No gaming. There are basically no services... yet. It's a $35 AirPlay dongle.Also it doesn't support ANY apps.And it no longer comes with free Netflix, as Netflix canceled their contract with Google today.So overall, quite disappointed.", "verified": false, "helpfulness": "6/84", "author": "Ted Zyzanski"}, {"rating": 5.0, "review": "Just got the unit in the mail and set it up.  Set up is a breeze: you plug it in to HDMI, plug in the USB for power (either to the TV or to the included USB power plug), connect to its ad-hoc network via the chromecast app and then it's good to go.Content is currently limited to: Google Play media, YouTube, Netflix, and tabs from Chrome browsers on Windows, Mac, and Chromebook (Pixel only at this time).  Pandora is coming but not available yet.  Content must come from the internet at current and does not support local file streaming (except in a loophole where you can load local files in to a chrome tab, those will be streamed).The streaming functions work really well, there's a small small delay since the device acts as a remote more or less.  Web browsing, which is in beta form, is noticeably laggy.  Slower than direct streaming (e.g. WiDi, AirPlay or Miracast) but that's due to again, it working more like a remote.  It all works very well and if you have any experience with AirPlay from iOS/Mac you'll be used to how it works from an end user standpoint.  Technically it works differently as again AirPlay streams from device to AppleTV or similar device, Chromecast doesn't send content from the phone to the Chromecast directly but instead allows the Chromecast device to pull the content from the internet/cloud.  The negative of this is no direct mirroring and limits functionality to application specific implementations BUT it allows the device to be turned off or removed from the network or other tasks to be done on the device.  So it's an interesting comparison.So what's not so good: It's limited to 2.4GHz wireless, which is slower and more congested than 5GHz spectrum.  It does support 802.11 N at least.  The selection of content/apps needs work, but it's brand new and will get better - hopefully.But here's the great thing.  It only costs $35.  Not only that, but if you ordered soon enough it comes with 3 months of Netflix for new OR existing customers (although limited to one code per account so if you buy multiples you'll get multiple codes but can only personally use one of them).  When you factor that in you're getting $23.97 of a service you're probably already paying for.  The puts the net cost of the device at just $11.03 plus tax.  Eleven Dollars!!  If you weren't lucky enough to order by then - it's not as good a deal but the device is still worth $35.  If you only use this thing a small handful of times, just to quickly stream a chrome tab up on your TV or to watch a youtube video it's worth it.  But with how well this has been selling I imagine we'll be seeing more apps support it soon.Pros:+++ Cost - $35 or $11 depending on when you ordered++ Cross platform (Android 2.3 or higher, iOS 6 or higher, Chrome for Windows, Mac, Chromebook)+ Easy setup+ Small/portable (just need to bring the USB power and the device)+ includes HDMI extension, usb cable, and usb power supply (amazing for the cost)Cons:- Limited content for now (no local content either)Overall, again it's not perfect.  I'd love to have seen 5GHz wireless support and I want more content/apps and I'd love to see some direct streaming or an easy way to get photos streamed (I hear you can do videos but haven't tested yet).  But for $11 I'll bet on the future of the device.-= Notes on content source =-I've seen on forums that people have questions about streaming from your device or the playback of local files.  Chromecast, in the current form, does NOT support streaming of local content.  The source for all content must be online, your phone/tablet is used for content discovery and control/credentials ONLY.  There's a loop hole to this in that local files can apparently be opened in a chrome tab and then displayed via Chromecast but this is an exception (see: [...]See the image on this post for a visual representation: [...]-= Notes on power source =-Also for clarity, the pictures that Google uses to show the device plugged in to the TV neglect to show the USB cable attached for power.  HDMI is not capable of supplying enough power and as such you need to use the included USB cable to power the device (some TVs have a USB port for debugging/update purposes that can be used).  Some reviewers are pointing out that HDMI can power it but it cannot.  HDMI only supplies 5V @ 50mA, you'd need roughly 10 times that power (5V @ 500mA) to power this.  The included charger is rated for 5V @ 800mA which goes a long way to supporting that HDMI alone cannot power the device.  As a side note: MHL ports could power the device but I can't find any confirmation that this supports MHL.To some of you this may seem trivial/obvious but I've had more than one friend ask for clarification about this so I thought it might be of important note here.  They did a good job of explaining this at the press event but apparently not as well elsewhere.-= Notes on comparison =-Roku/PS3/360/AppleTV/etc - This isn't meant to compete directly with these, yet.  Content is too limited for now.  This is changing and should get better.  A key distinction is the mechanics of it.  While it presents itself as something similar to AirPlay it functions as more of a hybrid between AirPlay and using a remote app (Roku, SmartGlass, Remote, etc) on your smart device.  Essentially the content comes from the internet/cloud - the device is used for content discovery and control of the content but the content comes from the internet.  Another key distinction is cost.  Even at Roku's cheapest this is still 80% cheaper (after netflix cost factored out).  Even if this is the full $35, it's still roughly 1/3 the cost of Apple TV.If you already have one, or more, of the devices (I do) the utility of this device is a little more limited in terms of uniqueness but there's one very very key difference, one I'm excited for, and some unique overlaps.  With Roku or PS3, your account (e.g. Netflix) has to be tied into the device.  So someone visiting has to sign in on their account or use your account.  This isn't ideal.  But with Chromecast as long as they're signed in on their device (Android/iOS) they can connect to wireless and see the Chromecast and then stream from their own account.  This makes it a perfect device for visitors and will ultimately replace my use of a Roku in my guest room for this EXACT reason.  While AppleTV with AirPlay rivals this it has two drawbacks: it's iOS only and doesn't allow the streaming device to be used for anything else or to have the screen turned off.  The cross platform nature alone is a notable distinction and again a welcome idea for guests.  The fact that with Chromcast your phone/tablet can do other things or have their screen turned off will save battery.So while the distinctions aren't as explicit - arguably on the face it functions much like a cross platform Apple TV would in certain cases - the subtle differences add to it.  Content discovery (and account info) come from the iOS/Android device but do not require that device to be on/active/present to continue streaming and can be picked up/resumed from another device.  Again, these issues don't exist with Roku/PS3 but in those cases your account has to be used on the Roku/PS3 - Chromecast allows for easy user swapping and multiuser control.  So while it's hard, on the face, to see the distinction it's there.  It's that overlap of features included in a single device that drives this as a unique thing.  While it may not be much, for the few dollars it costs it could be of use in those specific scenarios.  If you already have multiple devices (e.g. AppleTV and PS3) and don't see specific use in that distinction or cross platform nature then it's likely not for you but I'd bet for $11 you'll find some use for it.-= Questions =-If you have any questions about the device, technology, experience or anything I can try and test let me know in the comments and I'll do my best to answer as soon as possible.", "verified": false, "helpfulness": "384/472", "author": "William B Partridge \"William B Partridge\""}, {"rating": 3.0, "review": "I don't have it, and wont be getting it. It appears to be another canned apps streaming device. I had Google TV. Content was limited on google tv, and streaming from chrome tabs is in beta, and reported not to work very well. You also need a minimum i3 equivalent CPU. Streaming from a cell phone is cool. Perhaps in a year or two when you can truly stream the web, I will get an unlimited data plan on Tmobile and watch all the web video I want with it. Until then, I still have the cord to the cable internet provider, and my WHDI stick that lets me stream anything I want from my laptop to my HDTV.", "verified": false, "helpfulness": "1/76", "author": "JoeSchmoe"}, {"rating": 4.0, "review": "Edit:  Yay!  It works now!  Bumping the review up to four stars.  After two days of troubleshooting, I reconfigured it from a Windows 7/Chrome box.  I'd been configuring it from a Mac in Chrome.Girls always tell me, \"It's not you.  It's me.\"  Read about my issues with ChromeCast.  Maybe it's not ChromeCast.  Maybe it's me.I bought one today (7/25/13) at Best Buy.  They thought I was making it up, until I showed them a picture from another BB store. Then they went on a 20 minute treasure hunt for it, so that was fun.  We all cheered for the guy who found it and I put in a nice word with the store manager.Pros:-Small.-Looks cool.  Has an LED to let you know when it's powered up and ready to go.-Easy setup.  Make sure to install the ChromeCast extension for the Chrome browser.-Casting a Chrome browser tab works seamlessly.-Works seamlessly with YouTube, in Chrome (Win 7, Mac).-Three months free Netflix makes the price a no-brainer.  (Oops, MADE the price a no-brainer.)Cons:-I have not been able to get it to work with Netflix.  I've tried casting from iPhone, Win 7, Mac, and Kindle Fire HD.  The Netflix optimized playback in Chrome and the stand-alone apps all connect to ChromeCast, but report a generic \"having trouble\" error.  You can tell because ChromeCast switches to a Netflix background.  It knows you're trying to play Netflix.  I've reported the error to Google and hopefully they'll fix it.-Instructions aren't helpful.  It's two pages of setup and ten pages of legal/warranty/license stuff.-The HDMI plug bends easily.  I bent mine a bit removing it, after I wrote this review.  Don't man-handle this device.Neutral:-Requires USB power for my TV bought in Dec 2012.  Comes with a nice little USB power cord and plug, if no USB power is available on your TV.  People complaining about this are looking for an excuse to complain.-Chrome browser casting works, but loses resolution.  Other reviews have pointed out casting a browser tab is at 720p, not 1080p.  I'm casting from one identical 24\" monitor to another.  The ChromeCast screen is noticeably fuzzy.-Casting a Chrome tab redirects the volume to the new tab.  For example, when I cast Pandora, the songs are no longer heard on my Win 7 box.  I'm sure this is by design.  Struck me as interesting.Overall:-I'm disappointed.  If even one of the four devices worked with Netflix, I'd give it four stars.  Don't hop on the bandwagon, just yet.  Fix the Netflix issue.  Add Amazon Instant.  I'll hold on to mine, until it works as advertised.  With the three months of Netflix, I'm out like $15.  No big deal.", "verified": false, "helpfulness": "34/61", "author": "foo monkey"}, {"rating": 5.0, "review": "Will a Kindle Fire HD work with Chromecast?? Love my Kindle Fire HD Chromecast would be a great addition and less expensive than Roku", "verified": false, "helpfulness": "3/34", "author": "Anon."}, {"rating": 1.0, "review": "Dear Amazon.com;Please put in place Amazon Review Integrity Check (ARIC) to filter out \"Shadow/Mole\" reviews.We, your loyal customers and sellers that have come to depend on true/honest experience of actual users, badly need such mechanism.And we need it like yesteryear.Failure to implement a filter cast a serious doubt on the credibility of Amazon review system.Playing with a Demo product at launch event does not reflect true end-user experience.  As Demo products are almost always specifically setup to project what the company want you to see for marketing purposes.A review should reflect one's direct/personal experience.  Not a second-hand story from some blog, Fanboyz/girlz opinion, or worst, a paid mole.A good starting point should be having a mandatory field for reviewers to indicate product purchase date, length/level of use, etc.I eagerly look forward to seeing some sort of Review Quality Control Mechanism (RQCM) rolled out soon.Sincerely;Concerned Customer", "verified": false, "helpfulness": "108/431", "author": "Bkonline"}, {"rating": 5.0, "review": "I've been a Chromecast user very much since 'day one'. As a 'cable cutter' person, I rely on various streamers or devices with streaming features to bring content onto our screens.  Chromecast didn't replace or displace our Roku, PS3/PS4, or our Blu-ray players with streaming capabilities and so forth but there are times and situations when you don't have access to any of the above and then a Chromecast should come in handy and the price is low enough to get one and keep in as a backup, just in case. And there are some very interesting capabilities that, if further developed (see my experience with playing off a NAS device) could turn the Chromecast into a revolutionary solution overtime. Should also work well as a first time streamer for anyone who doesn't want to spend a lot to try streaming.Our Chromecast is currently attached to the 'main', large TV in the living room. I am using mostly to cast Youtube and Twitch streams and, occasionally for Netflix._____________________________________________________Here you have it, a quick FAQ on 'day one' or rather 'hours one and two'. I will update this as I use it more, literally 'as we go'.Q: What can I do with Chromecast?A: I was able to stream Netflix, Pandora, Google Music, Google Play movies or YouTube, stream content off my own HDD and perform some limited browsing.Q: Could a Chromecast completely replace an already installed Roku or PS3, Xbox, Blu-ray player, media hub or whatever streaming solution?A: Not at this moment. There's a lot more content available through the other 'streamers'. Roku has thousands of channels including Netflix and Youtube, the PS4 and Xbox and have both YouTube and Netflix and lots more including Amazon Prime and some basic browsers. I expect that Chromecast will quickly add many more services soon so time will tell.Q: Will a Chromecast ever fully replace a larger or more expensive streaming device?A: Probably not or rather not immediately, but it's a good, inexpensive, entry-level streaming solution and it's likely to get better.Q: Is it equally easy to use it off a Mac/iOS as it is off an Android/PC?A: I am sorry, I did not test it on a Mac/iOS device.Q: What are the best uses for Chromecast?A: Anyone who doesn't already have some streaming device attached to their TV could use the Chromecast if the TV has an HDMI port. It could also be used on 'bedroom' TVs if they don't already have access to a streamer. It could prove itself most valuable while on the road for as long as Wi-Fi is available and you can actually access the TV's features and HDMI ports (good luck with hotel Tvs).Q: Is content truly limited to the services currently supported through apps such as Netflix, Twitch or Youtube?A: Not exactly. You can also stream whatever content you have stored locally and just about anything you can get playing on your Chrome.Q: Will Chromecast suck up all the data off my phone's data plan if I use my phone to control streaming?A: Probably not. In my case, once I told my Netflix app running on my phone that I wanted to watch on the TV, it started to stream Netflix directly to the Chromecast/TV off our Wi-Fi router, treating the phone basically as a remote control.Q: How do I setup my Chromecast?A: You go to a provided URL with your browser and the Chromecast will be added to your Wi-Fi network.Q: Does the Netflix app on my phone need an update to work with Chromecast?A: The odds are it's updated already.Q: Does the Chromecast power itself off the HDMI?A: With HDMI 1.3 I need to power it off the TV's USB port. If your TV doesn't have one, it comes with a USB charger powered off an AC outlet. I wasn't able to test with HDMI 1.4 yet.Q: Are all needed wires and a power adapter included with the Chromecast?A: Yes.Q: Does my TV need to support Wi-Fi?A: No, it's the Chromecast that talks to your Wi-Fi router. The TV simply gets the stream through the HDMI port.Q: Can I use my phone to turn my TV on/off once the Chromecast is attached?A: I couldn't find that option yet.Q: Can I stream whatever is in my Chrome browser to the TV?A: I tried and it's pretty decent. Of course, it depends on how your other hardware involved performs: computer, router.Q: Can I stream from sources other than the Web, such as another computer or a NAS on my home network?A: I just made it work, from a Windows 7 PC by placing file's path into the browser's address and it worked with a video file that was on an NAS (HDD on my home network).Q: Do I absolutely need a phone or tablet to set up and run Chromecast?A: No, you can do it off your PC as well but I believe you need a Chrome browser.Q: Can I return the Chromecast if it doesn't work for me?A: Amazon will let you return anything that's defective for free but you may have to pay for shipping if you return something because you don't like it.Q: What are Chromecast's best features?A: Low price, easy installation, easy to move it from one TV to another.Q: What are Chromecast's main shortcomings?A: Not as many streaming sources as Roku or a Google-enabled TV but that there are more almost every day.Q: Can I use it if Wi-Fi is not an option?A: An Ethernet adapter is now available as a separate purchase.", "verified": true, "helpfulness": "0/0", "author": "Cthulhu \"Cthulhu\""}]