[{"rating": 5.0, "review": "The Amazon Fire TV works great.  I liked it enough to put another one in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like it!  I really do like Amazon Fire TV.  However I am near constantly irate at the 'Recommended For You' carp.  There is no reason to continuously recommend movies that I HAVE FRACK'N WATCHED. There needs to be bucket to send titles of movies that I have watched AND for monies that I will NEVER watch.  Then, and probably only then, will I have any idea about the 39990 other movies offered in the Fire TV advertisements.", "verified": true, "helpfulness": "0/2", "author": "Warren R. Johnson"}, {"rating": 2.0, "review": "A few findings about Fire TV, which is basically designed to push  Amazon content, and steer to you the apps they want. In addition, Amazon gets all your play history (e.g. from Netflix, YouTube, etc.) so they can try to sell you more stuff.The much-touted voice search only works with Amazon content. E.g. you cannot use voice search in Netflix or any other appFire TV does not warn you about app permissions. They are listed in a separate menu, but if you expect a warning like in Google Play, it's not thereMusic, Videos and picture gallery only work with Amazon content. You may have a huge music collection, but only what you bought from Amazon can be played.Device rooting is blocked, taking control of the device from you. E.g  you cannot play movies from USB drivesBy default, you can only install apps in the Amazon App Store (you can sideload, but it's not easy)To give you an idea of the direction the product is taking ,updates past 51.1.4.0_user_514006420 will block downgrades; updates past 51.1.1.0_user_511070220 will not allow rootingWhile the hardware is good, the software is too locked down. It will be nice to have a home screen with all the main apps, as you have in Apple TV, and more open app market as with Google Play. While promoted as more general player (think Roku), it is not, and will only fragment more your collection between different online services (Google, Amazon, Apple and others) and your off-cloud media.", "verified": true, "helpfulness": "3/5", "author": "Pablo \"Pablo\""}, {"rating": 5.0, "review": "wE ARE TOTALLY ENJOYING IT.", "verified": true, "helpfulness": "0/1", "author": "John J. Troy \"zia4ever\""}, {"rating": 3.0, "review": "Bought this for my grand daughter.  The description doesn't say that you have to buy Amazon Prime subscription at $99 per year to get the most out of this.  It's either buy the prime, or purchase most movies and games.", "verified": true, "helpfulness": "1/1", "author": "KimG"}, {"rating": 2.0, "review": "First, let me state that I am a HUGE Amazon customer and I love Amazon.  And, I am a father of 4 wonderful kids 12 and under.  As an Amazon customer, Fire TV is great EXCEPT that the parental controls are \"all or nothing\" and do not integrate with your Amazon Instant Video parental controls.  What this means is that you have to set a pin on the Fire TV upon setup.  This pin restricts access to ALL video, hence, if your kid wants to watch anything, including rated G shows, PG shows, etc. you have to put in the pin.  This means I have to put in the pin every time they want to watch something, anything.  Even the Roku will at least recognize what content I have restricted on Amazon Instant Video and will lock it down but not the FireTV.  Amazon dropped the ball on this one and it is one of the few times I have been disappointed with an Amazon product.  Seem like there are a lot of folks complaining about this so I have returned the Fire TV and will buy it once Amazon rectifies this.", "verified": true, "helpfulness": "2/3", "author": "NJB"}, {"rating": 1.0, "review": "There's a nonfunctional usb slot that literally serves no purpose. My roku allowed me to plugin a thumb drive to play movies. Can't do it with this. And NO YOUTUBE! That is outrageous. Furthermore, I just spent a very frustrating  hour trying to play a movie from MyCloud with no success. I wish I could give this NO stars!", "verified": true, "helpfulness": "5/10", "author": "Darkjet"}, {"rating": 5.0, "review": "I don't even know where to begin with how fabulous and how much I love this device / gadget / amazing product.  I've poured over the reviews, done my research and have been using the device for about a week now.  I'd like to focus my review on practical points and comments to address some of the negative comments I've read.  I could care less if this box has the \"personality\" of the Roku. Someone actually rated the box lower because of it's aesthetics. Srsly?  It's a small, black, discreet box that streams video.  I'm sure it can be personalized with some colorful wrapping paper or crafts if the 'Black' is too dull.  (lol)Moving on... Overall I will say, GO AMAZON!!  I love this site, I love this product and they stand behind anything they sell. Finding troubleshooting answers to anything is easy (unlike navigating Yahoo! for instance). This product is straight-forward and puts it's money where it's mouth is.  If you want to buy something fast, sleek and powerful that delivers, to turn your regular HD TV into a 'Smart TV,' stream content, music, games and dump your cable company, than this is what you want.  End of story.  But, here are a few points:~ I have a 2007 Samsung TV with 30mbps internet connection.  It's important to check that your TV has compatible resolution output to what the box (Fire TV) needs to operate.  1080p or 720p.  Otherwise, the picture won't work.~ You need an HDMI cable (doesn't come with the box). preferably a 'high speed' HDMI cable.~ The speed of your internet connection (min 18mbps; ideal is 30mbps) will play a huge factor in whether you have buffering issues or not.  Don't blame it on the box.  The box is lightening fast.  It's the connection and the quality of your modem / wireless router that determines the streaming quality. The box has a quad-core processor.  Again, it's not the box that is slow or causing lagging in the streaming connection.  But, it does need to be positioned optimally to get a good signal. Not in a cabinet.~ The wireless router has to support the frequency of the box. The higher the quality of the router, the better the quality of the picture.~ It's helpful to routinely clear the cache of the router (just unplug the back of the router for about 30 secs. it's like a re-start on your phone or computer). This keeps things from getting clogged up.~ There are amazing apps on this.  They have these meditation / sleep aid apps such as \"Calming Fire Scene,\" or \"Beach app\" (with sounds of waves), Green Garden Waterfalls - and all of them are customizable, with sleep timers and you can set them to music if you want or just listen to the basic sound of fire crackling, waves, streams... They can be purchased with Amazon Coins, so they are essentially free.  I think i started with 500 coins from some music purchase I made. Then with some of them you can actually earn coins with a purchase.  I love them for background noise, meditation, while reading or ambiance.~ I have had some issues with these utility apps (meditation apps) not always loading correctly.  When that happened I went to settings, then cleared the cache / data and it was fine. This has only happened once.~ I really appreciate how interactive this site is with regard to reviews of Fire TV and tips that ppl are leaving. It's very helpful so I wanted to go into a bit more depth to share my experiences in case this can be helpful to someone else.~ I made the decision to go with the Fire TV vs the Fire Stick for a couple of reasons:  (1)  A review by a woman titled, \"I'm a non-technie\" who said she had zero technical skills and even she was able to set this up and get it working with no problem! (thank you Arizona woman)(2) The stick is a good deal for sure but if you really want a smooth streaming experience you need the guts, speed  & processor of the box (along with a decent internet speed.) And it has 8GB storage so you can load the apps and not interfere with data transfer.  Or, keep several GB's open for gaming. (i would recommend 30mbps & up if you want to game.)The only other thing i'll say is: I can't believe how much there is to watch on here.  I've read about some ppl complaining about this or that, the cost to rent a movie (if you're not a Prime member), or what have you. But, my goodness, btwn TED Talks, PBS, Smithsonian, YouTube (luv), Netflix, Hulu Plus, Crackle, HBO GO, Showtime Anytime.... if you can't find something to watch, or some current show like Justified, Downtown Abbey, the Hunger Games... I mean, c'mon. Really?  Cable per month is $170.  Spring for the $2.99 to rent a movie if you don't want to get off your couch to go to Redbox for $1.50. Or, you can rent movies from the local library for free, if you really want to save money.  I figure that even *if* I rented one movie per day for a whole year I'd still spend less than a monthly cable subscription.  I plan to dump my cable except for the internet and have at it.  I can read the news online. Between smart phones, online content and Amazon Fire TV what more does one need?!I'm super impressed with the product Amazon has delivered here. If they continue to maintain the high levels of customer service which I have experienced I think Amazon Prime / Fire TV could be a real contender.  Move over TWC. Watch out Comcast... there's a new player in town!!", "verified": true, "helpfulness": "4/5", "author": "Beth E."}, {"rating": 5.0, "review": "I will let family and friends know about amazon fire tv", "verified": true, "helpfulness": "0/1", "author": "david missouri jr"}, {"rating": 5.0, "review": "Wonderful I love the number of movie and TV shows that I Am able to watch. It was easy to hook up and install. I love it !!", "verified": true, "helpfulness": "0/0", "author": "Dorothy M. Hall"}]