[{"rating": 1.0, "review": "it was broken when I received it it must have been somebody else's return", "verified": true, "helpfulness": "0/0", "author": "dixon e allen"}, {"rating": 4.0, "review": "This is a pretty neat gadget. It came in a little box and was ready for set-up right away. Installation took no more than 5 minutes. After plugging it in to my television, I downloaded the application from the Google play store and was able to set it up and sync it very very quickly.It has been very useful when working as I can easily screen cast my laptop monitor, phone screen, or any other compatible device right to my television for easier viewing.It has been great, but had to knock of one star for recent complications. After a few months, it seems it takes a little longer to cast the screen, and sometimes it can get a bit tricky.Just always make sure that your devices are connected to the same network that your chromecast is or it will not be discoverable.I definitely would recommend this product to anyone interested in something like this. I even received Google play credit, 2 free months of Hulu Plus, and other available offers at the time of set-up. It really is great; I even bought one for my brother in law and sister in law.", "verified": true, "helpfulness": "0/0", "author": "Tracy Rawlins"}, {"rating": 5.0, "review": "We love having Netflix on our TV now! And YouTube!!!", "verified": true, "helpfulness": "0/0", "author": "Pamela A Reinitz"}, {"rating": 5.0, "review": "I'm pleased", "verified": true, "helpfulness": "0/0", "author": "Roni Lev"}, {"rating": 3.0, "review": "It works as designed, but this is one of the most unnecessary devices I've ever bought in my life.I DO NOT recommend it.", "verified": true, "helpfulness": "0/1", "author": "Hamed Sidibe"}, {"rating": 2.0, "review": "Ok product. Fire stick is much better for the money.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Ruffini"}, {"rating": 5.0, "review": "Works like a charm. Need to plug/unplug once in a while when it's stuck but no complaints", "verified": true, "helpfulness": "0/0", "author": "Monikhs \"puzzled\""}, {"rating": 3.0, "review": "Would not work with my Verizon tablet only with my phone. Couldn't make any calls if I was watching Netflix as it was basically the remote controller for the Chromecast. I ended up returning it and got the Amazon firestick.", "verified": true, "helpfulness": "0/0", "author": "Jeephers"}, {"rating": 5.0, "review": "Great value", "verified": true, "helpfulness": "0/0", "author": "Greg Diddel"}, {"rating": 5.0, "review": "My son had no cable. They love this device.", "verified": true, "helpfulness": "0/0", "author": "taralilli"}]