[{"rating": 5.0, "review": "Fantastic.  Easy to set up and easy to use. I Loveit", "verified": true, "helpfulness": "0/0", "author": "jfranz"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "sasha jackson"}, {"rating": 5.0, "review": "I cut the cable cord and don't miss it at allworks great", "verified": true, "helpfulness": "0/0", "author": "Steve Rusnak"}, {"rating": 5.0, "review": "Wayyyyyy better than Apple TV! I was an Apple fan for years, I have Apple iPhone, iPod, TV. It wasn't until recently that I tried Amazon TV just for the heck of seeing what it is. I must say, this little box is beyond your wildest imagination. Forget about Netflix and their outdated movies, and Apple TV is technologically behind when compared to Amazon TV. I mean come on, the Amazon TV has a microphone so you can speak your selection instead of taking 6 hours to type something on a keyboard that's alphabetically, not like your computer keyboard. With Amazon TV, you can search a movie within seconds by just speaking into the remote, and if you got Amazon prime, chances are very high you'll find what your looking for! Loves, loves, loves this little box <3", "verified": true, "helpfulness": "0/0", "author": "Betty"}, {"rating": 5.0, "review": "I give this 5 stars because I have no comlaints. I did not use it. I did not even unbox it. I called Amazon Customer Support to ask if this device was compatible with Kodi. I was told by a tech person that it is not and that if I sideloaded Kodi the warranty would be nullified.That settled that, so, I returned it.If there are folks out there who have successfuly installed Kodi, please, I do not need to know about it. Do not bother me with comments about spreading misinformation. This is a true account of what Amazon Customer Support told me. If you don't like it, bother them, not me.I returned it and bought something else.", "verified": true, "helpfulness": "0/5", "author": "Francisco"}, {"rating": 5.0, "review": "We also have roku but we think that this is better. Our Roku device broke after a few months and we've been using our Amazon Fire TV long before we had Roku.We just hope you could include the Drama Fever or Viki app for Asian customers. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Ernie and Lucy"}, {"rating": 3.0, "review": "I'm an Apple guy... mother made me buy this for my father... you're lucky to get 3 stars.  I'll keep it at that.", "verified": true, "helpfulness": "0/3", "author": "Scott D."}, {"rating": 1.0, "review": "Very unhappy with the Fire,I got the gaming controller and set a password,and my grandson (7 year old) unkowingly racked up my account playing the goat simulartor.  I didn't think I had to watch him play the game,since I had a password,where as Apple won't let anything be spent unless you use a password that entails using my credit card.  Very disappointed.  Switching to Apple.  And I WAS very happy with Fire.", "verified": true, "helpfulness": "0/1", "author": "elizabeth"}, {"rating": 1.0, "review": "Went back to Apple TV don't need extra box around the TV", "verified": true, "helpfulness": "0/1", "author": "MiraK"}, {"rating": 4.0, "review": "I love the program & having access to it; however, I was disappointed that my Internet does not run fast enough to use the program properly. I can watch stuff but the picture is kinda blurry, not sharp & I can't watch more than 2 episodes without having to stop & go back at a later time. Of course, that's not your fault.", "verified": true, "helpfulness": "0/0", "author": "Prissy's Mom"}]