[{"rating": 4.0, "review": "I was expecting to be able to do more with my phone that is why it isn't rated higher.  You can stream from your laptop or notepad devices.  Limited apps on phone - and you have to pay for most of them.  I like google tv better. For overall operation.I guess I got this for streaming and being easily moved from tv to tv so - in the future I may think differently.", "verified": true, "helpfulness": "0/0", "author": "Terry Overbo"}, {"rating": 2.0, "review": "Not as advertized. Difficult to get it to work. Could not even get it to work. They need to back to the drawing board on this one.", "verified": true, "helpfulness": "0/0", "author": "Marcia Carey"}, {"rating": 1.0, "review": "Dont like it - I cant use it with my Modem - Its not what I wanted - bad choice", "verified": true, "helpfulness": "0/0", "author": "shyamala"}, {"rating": 3.0, "review": "Too little support at the moment. Can only screencast from PC and not mobile device.Easy to set up though.", "verified": true, "helpfulness": "0/0", "author": "Amos Hoe Hong Hua"}, {"rating": 5.0, "review": "Bought one for every room then cancelled my cable. All it needs is Amazon Prime video app & it's perfect.", "verified": true, "helpfulness": "0/0", "author": "Gabryyl Pierce \"Book & Movie Junkie\""}, {"rating": 5.0, "review": "I love it. I was really surprised how easy it was to set up and get it working. Amazing little piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Louis Porter Jr."}, {"rating": 5.0, "review": "Love it !!! Very easy to install, it took me less than 5 Min and we where watching NetFlix, No longer need to pay for the gold membership through my Xbox, that saves me $ 46.00 a year, Plus The HD is Crystal Clear, would highly Recomend. Every body would have one of these if they knew how great it works.", "verified": true, "helpfulness": "0/0", "author": "Jeff McFarland"}, {"rating": 1.0, "review": "The worste thing I ever spent my money on!!!!! YOU CAN ONLY USE THIS WITH YOUTUBE AND NET FLEX!!!  I wish I knew that before I bought it! I went and bought the hdmi cable that goes straight to my iphone 5 and I can stream through anything on the net even watch movies ! Don't waste ur money on this chrome garbage!!", "verified": true, "helpfulness": "1/4", "author": "Shak"}, {"rating": 4.0, "review": "step by step instructions were easy and fast. we were very satisfied with how easy it was to use this product.", "verified": true, "helpfulness": "0/0", "author": "ramon medrano"}, {"rating": 4.0, "review": "Love this! Only problem is sometimes volume will just stop. So have to unplug it..and plug it back in. Stinks in the middle of a movie. But other than that? Its great!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kim Brown"}]