[{"rating": 1.0, "review": "Not worth the money. It lasted exactly two days after the warranty expired. Will not be purchasing another one. Thank goodness I own an Apple TV, which is over four years old, and has never given me any problems. If you want quality for the same price, buy Apple TV.", "verified": true, "helpfulness": "0/1", "author": "kiki \"kiki\""}, {"rating": 5.0, "review": "easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "meli"}, {"rating": 5.0, "review": "This is an outstanding product. I have not missed the overpriced, junk Chanel cable TV for a single minute. My tTV quality has never been better. Thank you Fire TV", "verified": true, "helpfulness": "0/0", "author": "Kathy Gurney"}, {"rating": 5.0, "review": "It works great.  I wish I would of gotten sooner.", "verified": true, "helpfulness": "0/0", "author": "PFD"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "S.M"}, {"rating": 5.0, "review": "So glad I heard about this.  Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Marilyn Hartman"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "noel brenes"}, {"rating": 5.0, "review": "This system is the first to satisfy all my criteria for a proper remote, and a proper voice search.I can find much more content with fire tv due to its superior user interface than I was able to find with either my Samsung or Sony smart tv using amazon prime and the tv user interface.", "verified": true, "helpfulness": "1/1", "author": "Dennis"}, {"rating": 5.0, "review": "Easy to set up and use.  Gives other options when there's nothing on regular satellite.  Have viewed some good movies.", "verified": true, "helpfulness": "1/1", "author": "Carol Beane"}, {"rating": 5.0, "review": "I think it's pretty amazing.  Being a Prime member, it's easy to find Prime eligible movies.  The size is amazing.  Good bye WII.. you clunky dust catcher! Hello tiny little Amazon Fire TV.  Does what it says. I've had no issues. Easy to set up and connect. Love the ergonomic little remote.  Its a good buy, Don't pass it up.  NOW>>> I\"m dying for an ECHO but I'm not sure they communicate.. hopefully soon!", "verified": true, "helpfulness": "0/0", "author": "Barbara Langford \"B Langford\""}]