[{"rating": 5.0, "review": "Love it, canceled my cable and got Netflix", "verified": true, "helpfulness": "0/0", "author": "Kaylan Johnsen"}, {"rating": 4.0, "review": "Like the product just haven't used it very much.", "verified": true, "helpfulness": "0/0", "author": "FREDERICK.YOUNG"}, {"rating": 5.0, "review": "Works absolutely perfectly. I love it! So easy to move from room to room and connect from any device. If your tv doesn't have a USB input, you'll have to use the wall adapter to power the device.", "verified": true, "helpfulness": "0/0", "author": "Stephen DiGregoria"}, {"rating": 5.0, "review": "I understand people's frustration, but I agree with that you should be aware of its purpose before making up your mind for purchasing it. I got one on a recent travel and loved from the very first moment. I have a SmartTV and casting works better on the Chromecast than on the TV. The setup is very easy, so if you can read at all, you should have no issues. They could and probably will have more compatible apps, but come on, we're talking about a 35 dollars device.", "verified": false, "helpfulness": "0/0", "author": "Carina Carvalho"}, {"rating": 5.0, "review": "Love it !!! Easy to work and just what I needed!", "verified": true, "helpfulness": "0/0", "author": "Nancy Lynn"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Enuchiebay"}, {"rating": 5.0, "review": "works awesome.", "verified": true, "helpfulness": "0/0", "author": "Unnat Shrestha"}, {"rating": 5.0, "review": "This is a great way to easily connect all my devices (iPad, iPhone, HP Chromebook and HP Windows laptop to the big screen.", "verified": true, "helpfulness": "0/0", "author": "Mark Parkison"}, {"rating": 4.0, "review": "Good purchase.  Clear streaming quality.", "verified": true, "helpfulness": "0/0", "author": "Sealya"}, {"rating": 1.0, "review": "Bought this so we wouldn't have to constantly fiddle with cables to hook laptop up to TV. First parts of setup only took seconds. The last bit took hours. It only worked half the time and in the end, physically hooking up the laptop each time amounted to much less work and frustration than using chromecast. It doesn't work with all the things we wanted to watch anyways. One of my few returns in a decade.", "verified": true, "helpfulness": "0/0", "author": "BOK"}]