[{"rating": 5.0, "review": "Outstanding product the family is getting lots of enjoyment from it... very easy to use...you cannot go wrong getting it...", "verified": true, "helpfulness": "0/0", "author": "Orie K. Barnett"}, {"rating": 3.0, "review": "I purchased this so that I could stream items from my computer or laptop to my tv in my living room; however, the wi-fi signal is not strong enough in that room for the stream to last more than a few seconds.It works in my bedroom where I have the wireless router, and I have a gaming router and top of the line cable internet connections.Even with the signal booster, it won't work in my living room. My appleTV is in my living room and works like a charm, I just wanted to do some streaming with chrome that I can't do with apple (due to the age of the system).It's okay, if the only place you want something to stream on your tv in the room with the router.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Gentry"}, {"rating": 5.0, "review": "Easy to setup and use. Not to mention the price. The SDK is released so hopefully can stream a lot more content. Love it.", "verified": true, "helpfulness": "0/0", "author": "RC"}, {"rating": 5.0, "review": "Easy to set up, affordable price.  Limited in apps, but YouTube and Netflix work fine.  Gets hot and that is worry-some.  The Chromecast comes with an A/C adapter if the TV does not power its USB port.", "verified": true, "helpfulness": "0/0", "author": "CHERYL CUNNINGHAM"}, {"rating": 1.0, "review": "Video would freeze or transmit without sound. Stationed my laptop directly in front of TV and it still froze. Returned for credit.", "verified": true, "helpfulness": "0/0", "author": "John Heinl"}, {"rating": 2.0, "review": "I guess if you want to stream YouTube or Hulu or Netflix it works ok. I haven't tried photos yet. I was hoping it would have same video quality as straight HDMI running through laptop. I have lots of movies in many formats, including .mp4 in both 720 and 1080p I either run through my Playstation or straight from laptop with HDMI, which is best. I was hoping to eliminate plugging in HDMI cable or loading files on Playstation and run straight to Chromecast. I tried and was very disappointed in quality. It was anything but HD quality and it has terrible lag. So I probably will keep it for a while to see if any updates will address this issue, but will probably end up selling it.", "verified": true, "helpfulness": "0/0", "author": "SK"}, {"rating": 4.0, "review": "i can't complain very much because of the great price, you can 3 chrome casts for the same price of a apple tv. but their aren't many apps yet, soon they will have more apps, and i will give it five stars, but it's not their yet.", "verified": true, "helpfulness": "0/0", "author": "E Wehman"}, {"rating": 3.0, "review": "The item does work well.  It does work with the apps from my Ipad and smartphone.  I could not find an app that would just run any type of video that I played.  I could do that on my desktop from google chrome web browser, but the quality is deminished.  If I could have an app that would run any video from any web page then I would give a 5 star.", "verified": true, "helpfulness": "1/1", "author": "Shane"}, {"rating": 5.0, "review": "I got this for my TV and it works well with the apps that are designed for it. I was able to stream from my phone with a press of a button. Setup for simple as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Neat gadget.  Didn't change my life though.  Good gift if you are need something for a techie and not really sure what to get.", "verified": true, "helpfulness": "0/0", "author": "Mark J Van Horn"}]