[{"rating": 1.0, "review": "I used my MACBook Pro, using Chrome, to view my browser-desktop to a TV 10ft away. I then streamed a video on YT, just to test the response. I got disconnected every time and when I was connected, the video was choppy. I'm in the process of returning it. Better get a 50ft HDMI cable or Airplay/Air-Mirror using ATV like I do.", "verified": true, "helpfulness": "1/3", "author": "Jack Sparrow"}, {"rating": 1.0, "review": "This niffy device works as advertised, however...The inconvenience for having to control it through the phone or laptop is rather annoying and slow to respond.  Tab view from Chrome is very flimsy (currently still in experimental stage).  Have to go to different websites and and play from within the websites, there isn't any center control panel for doing everything.  Slow to download and slow to start playing.  Probably due to the minimum hardware they could stick in a small form factor.I'm trading this in for a Roku which should offer more (minus YouTube), plus a remote.  Nobody should be stuck without a way to quickly control their TV-connected devices.", "verified": true, "helpfulness": "4/7", "author": "BenEngineer"}, {"rating": 3.0, "review": "Installation was seamless and works out of the box! The viewing experience is great but apart from Youtube/Netflix/HBO I can't watch push any other content to the TV (say ESPN3 or videos embedded on a webpage). My PS3 has got all the apps so I wonder why I should squander money for this!?", "verified": true, "helpfulness": "1/1", "author": "Sunny"}, {"rating": 5.0, "review": "This device allows streaming from your android phone or computer with Google chrome and the Chromecast extension installed. With your computer you are able to stream a web browser tab which means basically anything. You can click and drag movie files into Google Chrome. The video is very very slightly choppy if you do it like that, but I don't know of many other things that allow streaming that easy. The other main use I have is streaming Pandora throughout the house via receiver and being able to control the volume from your phone. I would love to see Soundcloud and 8tracks support.One thing to note is this device runs a LOT better if it is always plugged in because your phone apps will always see it that way.You can stream avi and mp4 files via Google Chrome. (mkv do NOT work yet with default settings and extensions) Setup is SUPER EASY.", "verified": true, "helpfulness": "1/1", "author": "Komatchi"}, {"rating": 3.0, "review": "Chrome caste is a great idea but its not completely what it advertizes to accomplish.Nentfix streaming is immediate as the buffer gets 100% of the info.HBO GO stops after 4 minutes and chrome caste need to buffer again. after being stopped 4 times watching a Movie I decided it not worth it.Have not tries other features yet", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "In theory the chromecast sounds like an awesome device for the money, but in actual use it in no way compares to an Apple TV, roku, or xbox.  First, it is buggy. I get regular crashes, stalls, and lag. With the current firmware update, netflix will play one video, and then no longer is able to connect, requiring a reset.Second, the usage model is much less convenient than other netflix or youtube apps. Instead of a lean back experience where you can just let one video play after another, you have to actively select each video on your phone or tablet. Personally I want to just start my youtube subscription feed and watch videos passively, or just let show after who's play on netflix.Save the $30 and get another full featured device.", "verified": true, "helpfulness": "0/1", "author": "KevinC"}, {"rating": 5.0, "review": "The design is incredibly compact, performance is consistent, and the UI is as simple as can be. I can clearly see this is the first generation of a shrinking (physically) product line which is going to demonstrate repeatedly the capabilities of manufacturing and Google design to amaze and entertain us. I have high hopes Google.. get to work! =)", "verified": true, "helpfulness": "0/0", "author": "Jonathan Ortony"}, {"rating": 5.0, "review": "Chromecast is the future of media consumption. It is extremely easy to set up and use, will buy another soon!", "verified": true, "helpfulness": "0/0", "author": "Tom Ellis"}, {"rating": 5.0, "review": "This is my second chromecast, it was in prime so bought in from amazon :)More apps supported and hoping for even more. Just the kind of device i wanted to stream my stuff on TV without any remote or keyboard. Love this device", "verified": true, "helpfulness": "0/0", "author": "saurav sen"}, {"rating": 5.0, "review": "It does what it says it will. I can finally use Netflix on the main TV! And the ability to use my ipod/computer as a remote is so convenient.Be sure you have an extra USB plug to power it if your HDMI port is older, and sometimes it does get glitchy stopping and starting videos on Youtube. Other than that, just plug it in, power it up, log it on to your wireless network, and pick your movie!", "verified": true, "helpfulness": "0/0", "author": "goingverbal"}]