[{"rating": 5.0, "review": "Problems with the billing of the free prime.Danville three times $99 been created it twice $99 member of prime for 2or3 years.Made serval calls told her it would be taking care of at the end of the 30 daysHave always found the Amazon people very helpful and honest.Charles Lee Wilson", "verified": true, "helpfulness": "0/0", "author": "Charles Wilson"}, {"rating": 5.0, "review": "Works as described, I set it up in about 10 min. Plugged in power, added the HDMI cable to my receiver and entered my wi-fi password and was up and running!", "verified": true, "helpfulness": "0/0", "author": "Ben Cross \"benphoto\""}, {"rating": 2.0, "review": "Works great as long as you are not using the Plex app, which unfortunately is something I use a lot with TBs of movies off a home Plex media server.  With the AFTV hardware specs, you would expect the box to just fly when streaming local network content.  And it does just that...that is when it works.  I have 3 AFTVs and they all have the same issue. For no reason at all the Plex application will be unable to play videos after working just fine minutes before. Sometimes clearing the cache will resolve the issue, other times I have to completely uninstall and then reinstall the Plex app.  In the most severe cases, when Plex starts to act up, the entire unit will stop streaming movies regardless of the source, i.e. Amazon, NetFlix, etc.  When that happens, I have to reset the unit to factory defaults and then reinstall everything.  I have kept Plex off one of the three units after having to factory reset it for the 5th time and now it never experiences any lock up issues.  Plex runs just fine off my Roku 2, so it is definitely something with the very outdated Plex app version that runs on the AFTV.  These issues remain even with the AFTV Plex update from 12/31/14.  Too bad, if it were not for that, I would give this product 6 stars.Update 1/8/15:  Got on the forums and figured out how to sideload Kodi (formally known as XMBC) and it absolutely screams on the AFTV.  I have had zero issues streaming local media server content using the AFTV with Kodi and all of the lockup issues, etc. went away.  Since Kodi is not an officially Amazon sanctioned app (despite Plex being an offshoot of XMBC), it does not show up on the AFTV home screen.  For the sake of irony, I also sideloaded Llama and set it up to start Kodi whenever the Plex app is selected :)  If you don't mind a little more setup to get Kodi running how you want it (Kodi is much more customizable than Plex), this may be the solution for you as well if you are having Plex related issues on AFTV.  I can honestly say this has kept me from selling off all 3 AFTVs and switching to Roku 3s.", "verified": true, "helpfulness": "0/1", "author": "ieblj01"}, {"rating": 5.0, "review": "It real good!", "verified": true, "helpfulness": "0/0", "author": "M. Larson \"MNHawk\""}, {"rating": 5.0, "review": "Good quality hardware and excellent Prime shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Allen Treco"}, {"rating": 4.0, "review": "Loving it so far. Only use when we are at our home away from home so not used daily.", "verified": true, "helpfulness": "0/0", "author": "Terri \"Terri Donahue\""}, {"rating": 4.0, "review": "Great to have Amazon Prime, but the apps need work.  The voice search device works very well.  Having trailers to watch is preferable to not having them with Netflix.  There do seem to be less TV series available compared to Netflix.  Biggest drawback is the limited apps and very hard to add any apps you want that aren't provided by Fire TV.  For example, you cant get Epix or Encore and you can try to sideload apps from Google Play, but the apps dont work well if you add them that way.  Amazon has their own app store so maybe the device is not compatible with Google Play apps, but many of the apps I wanted arent even an option at the Amazon app store.  Overall its a good purchase and hopefully it will get better over time.", "verified": true, "helpfulness": "0/0", "author": "SDfamily"}, {"rating": 5.0, "review": "Better than I expected! Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "jennie bergstresser"}, {"rating": 5.0, "review": "I had been very happy with my Roku devices and I left the Fire TV sitting next to my bed while I procrastinated about setting it up.  Meanwhile, the picture wasn't very crisp on the TV and the sound seemed to be coming through an echo chamber.  I thought I needed a new TV and I would wait and hook up the Fire TV when I got it.Then the Roku stopped working and I hooked up the Fire TV only to discover a very crisp picture and clear sound.  I don't need a new TV, my problem was the Roku.Needless to say, I am super happy with my Fire TV.  Just great.", "verified": true, "helpfulness": "0/0", "author": "DS \"Say something about yourself!\""}, {"rating": 5.0, "review": "I've never used a streaming device until I got this unit (and the Fire TV Stick, which I got for $19, which I didn't really care for). I got this Fire TV on sale for $69 and love it. I have it hardwired to my network hub near the TV, so I don't use the wireless. I could never get a good wireless signal with my Fire TV stick, which is why I chose to get the main Fire TV unit. Hardwired, this thing works great. No buffering, easy to use, and great quality video. Easily pairs with Netflix, Pandora, etc. and works flawlessly. Note that the voice search only works with Amazon Instant Video. So, if you are using Netflix on the Amazon Fire TV you still have to search for shows/movies the old fashioned way. I don't really use it to play any games on it (I have consoles/computer for that), but I did play The Game of Life with my mom over the holidays using the Fire TV. Very simple controls and fun. I also linked my Amazon Fire TV with my Amazon Cloud account to view photos, which is nice when you want to use your TV as a digital photo frame. I was pleasantly surprised that my photos taken with a 1 megapixel camera back in 2004 looked great (of course this is probably more attributed to the TV than the Fire TV of course). Still cool though. Overall, I'm very happy with this gadget. Good job, Amazon!As I play around with the Amazon Fire TV more, I'll update my review.", "verified": true, "helpfulness": "1/1", "author": "Robert Pruneda \"Sharkbait\""}]