[{"rating": 5.0, "review": "Works great- Love it", "verified": true, "helpfulness": "0/0", "author": "Mary Chelton"}, {"rating": 3.0, "review": "Initial setup was easy, but once tried to cast from my Asus memo the problem starts.  I tried to cast youtube to my TV throught Chromecast.  Initially it may start casting, however,  after a couple of minutes of play, you started to see lags on the TV and sounds starts to break.  It will continue for a couple of minutes then it quits out automatically.  The youtube still plays on the Asus memo but the Chromecast shows no connection on TV.  This happens all the time as if Chromecast cannot keep up with the transmitted information and falls behind then it eventually tried to quit.", "verified": true, "helpfulness": "0/0", "author": "J. Wey"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Preston Tucker \"bigg prez\""}, {"rating": 5.0, "review": "This is fu#@&n; awesome!! you should def go for it.", "verified": true, "helpfulness": "0/0", "author": "Elias Gomez"}, {"rating": 3.0, "review": "Works as described when it will connect to wireless network. Constantly says can't be found by chromecast app so you can't screen cast or mirror phone screen. Always works with YouTube and netfix apps, but issues with screen mirroring and network connectivity are enough to want to return. Googles no help they blame it on your wireless setup even though I changed all setting as requested.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This device is great. As soon as I plugged it in it picked up my WiFi signal right away. Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 1.0, "review": "Could not get mine to synch.", "verified": true, "helpfulness": "0/0", "author": "Susan W"}, {"rating": 5.0, "review": "Best with the lgg2", "verified": true, "helpfulness": "0/0", "author": "nick"}, {"rating": 5.0, "review": "A+++", "verified": true, "helpfulness": "0/0", "author": "Neil Taylor"}, {"rating": 2.0, "review": "didn't live up to what I thought it would. You can't transfer anything like pictures or home video from your computer.", "verified": true, "helpfulness": "0/0", "author": "HONEST ABE"}]