[{"rating": 5.0, "review": "I find myself using this device more and more. I stream everything to my tv or my car stereo. I even bought one for our break room tv at work so my employees can stream stuff from their phones on break. Also saved on cable to that tv since the employees prefer this method.", "verified": true, "helpfulness": "0/0", "author": "Kvo Clai"}, {"rating": 3.0, "review": "Sometimes it works properly, sometimes it doesn't. Most of the time, the videos I attempt to watch stop and act as if they are buffering. It sort of ruins the whole idea of the product which I purchased to use instead of connecting my laptop to my TV via HDMI. I thought it might have been an issue with my router but then my router stopped working and I replaced it. This didn't solve the problem.", "verified": false, "helpfulness": "0/0", "author": "Print out of Oyster smiling"}, {"rating": 5.0, "review": "It works great!  I use my tablet and it mirrors the screen to my TV.  So happy I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Mariann Eppolito"}, {"rating": 4.0, "review": "It's awesome if you're trying to watch youTube videos on your TV... but it stinks because you can't beam everything from your screen.", "verified": true, "helpfulness": "0/0", "author": "Linh Huynh"}, {"rating": 5.0, "review": "i luv this thing. I'll give 6 stars if I can. This thing make your phone a multi-taker. Once you chrome cast something from your phone, you can do something else with your phone without effecting the tv. And the most important thing, it does not drain your phone's battery. And yes this thing stream hd and 5.1 surround sound if the material comes with it!!! This thing also work with third party app that allows u to stream website with video content;)  Screw smart tv, this make your tv smart and so much user friendly in scrolling videos in YouTube and Netflix on your smartphone or iPad than a tinky remote control that comes with tv.", "verified": true, "helpfulness": "0/0", "author": "hung c."}, {"rating": 4.0, "review": "Excellent if you are mainly watching YouTube very frequent. Not a mirroring device for you mobile.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchase for my son.  Great device!", "verified": true, "helpfulness": "0/0", "author": "Johnny L  Dorsey"}, {"rating": 4.0, "review": "Does what it says it will do", "verified": true, "helpfulness": "0/0", "author": "Moises Martinez"}, {"rating": 1.0, "review": "I bought this thing for Christmas and it doesn't work properly. It has such potiential but it is still in beta? I am very unhappy with it. We have tried in in several rooms and different electronics and it onlt works part time at best.", "verified": false, "helpfulness": "0/0", "author": "Justyn"}, {"rating": 5.0, "review": "Best streaming stick option on the market. Unlike the FireTV stick, you can power it through your TV's USB (instead of plugging into the wall). Streams WatchEspn near flawlessly, much better than FireTv Stick.", "verified": true, "helpfulness": "0/0", "author": "Matthew H. Walker"}]