[{"rating": 3.0, "review": "I had high hopes for this device.  I dropped my cable a few months ago and without a large antenna I can't get any local channels, let alone anything else.  I have a Wii that allows me to access Netflix as well as Amazon and Hulu Plus.  It was really the major channels, ABC, CBS, NBC, I wanted.  But Chromecast doesn't support Amazon or the major channels.  So it is very frustrating.I'm not happy that Amazon and the other channels don't use Flash as their plug in.  If they did,then I would be able to get the channels I want.Perhaps in the future Chromecast will support other plug in's.  I'll be giving this to someone that doesn't have a Wii or PS so needs a Chromecast to access Netflix.", "verified": false, "helpfulness": "0/0", "author": "CSC"}, {"rating": 5.0, "review": "My son was very pleased when he opened this gift.  He had really been wanting one of these.  Hs loves techno gadgets.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Ging"}, {"rating": 2.0, "review": "Do not buy this device if you want to cast web pages to your TV from you mobile device.  It does not work and, if you search the fine print, you will see they say it is not supported.After installing it.. and firing up my mobile Chrome app... nothing.. no \"cast\" icon.  Found you have to install an extension... okay... installed it just fine on my PC (in my office)... so I tried to install it on the Chrome app on my mobile device.  Epic Fail... error message says something like \"your device is not supported by this extension.\"Just great... dig more digging and found a forum... first thing on the forum is the intro post...\"How do I cast from Chrome browser to my TV? (Heads up: casting from Chrome mobile browser isn’t currently supported)\"This device gets two stars only because the setup is as simple as the advertising says.... And Netflix / YouTube played about as well as they do on all my other devices... So basically, it's a worthless little gizmo to me.  I already have Netflix and Hulu and a dozen other streaming apps on just about every electronic device I own.  I bought this because I wanted to cast my web browsing onto my tv... why web browse on a 4\" x 6\" mobile device screen, if I could cast it to my TV?  Well, that small detail is not on the main page of Chromecast, nor was it mentioned in the TV advertising.  Which I thought, at the time, this would be the perfect device.So I am very disappointed this information was so \"glossed over\", this would be an awesome little device if it really did what I expected it to do... and from all of the other postings I found all over the web... I am not alone.  :)  Also found a lot of forum posting for people having issues casting pages from their PC's and Mac's too.  Not sure what to make of that, as I skimmed over them looking for mobile issues.Sad to say I already knew this and fell for it anyway, but, the real lessons here are, sometimes, you get exactly what you pay for... and you should always do your own research independent of advertising, both TV and company websites.  I got bit by my own enthusiasm and trust in the Google brand, and failed to follow my own advice.So now, I'm trying to decide if I want to return it, or hang on to it and see if Google can really come through... since their forum mentions \"not currently supported\", maybe it will be in the future... or maybe I am letting Google fool me twice...  That would be really sad, as I had such high hopes for a very reasonably priced device..", "verified": false, "helpfulness": "1/2", "author": "BottomBracket"}, {"rating": 5.0, "review": "The Chromecast fulfilled our expectations.The suggestion is that more emphatically stated that access is through youtube or netflix' apps", "verified": true, "helpfulness": "0/0", "author": "Margarita"}, {"rating": 5.0, "review": "Item very good lam please the w as y it work will recommend it 2 any one and the price is good", "verified": true, "helpfulness": "0/0", "author": "dale benjamin"}, {"rating": 1.0, "review": "No streaming Radio at allThe number of apps is smallcomplete waste of my time and effort to even use this", "verified": false, "helpfulness": "0/1", "author": "Winter"}, {"rating": 5.0, "review": "It made a tv i barely used very useable. I always debated getting a roku or a apple tv since i wouldn't use that tv much, but the chromecast was an impulse buy. Especially since it came with 3 months of free netflix, even if you already had it.", "verified": true, "helpfulness": "0/0", "author": "Moteon"}, {"rating": 5.0, "review": "Our family uses this product multiple times a week. Easy to run from a tablet or from our lap top computer.", "verified": true, "helpfulness": "0/0", "author": "James O."}, {"rating": 4.0, "review": "I am using this in a hotel, it works greatAs hotel having wifi hotspot confirmation dialog, not the open wifi, i have to do some arrangements to make it work.Works great with ipad & nexus 7 tablets.It will be good if they allowed to mirror entire mobile or laptop (same like apple TV)", "verified": true, "helpfulness": "0/0", "author": "Arivoli \"Arivoli\""}, {"rating": 2.0, "review": "The wireless is intermittent, keeps dropping, reconnectingVery few supported apps, and everything works through Chrome browser alone, limiting functionality. (In other words, Google monopoly is no better than Microsoft monopoly)Try hulu, or youtube, you get error messages. Hulu detects and says - upgrade to huluplus to play on tv.With a cable, I can connect my laptop or any device to my tv (as a monitor) and watch what I like.I have apple tv, and thought that was bad (see my reviews). This is worse, but I guess you get what you pay for, this is 1/3 of the cost of apply tv (35 vs 100)", "verified": true, "helpfulness": "0/0", "author": "minacel \"minacel\""}]