[{"rating": 2.0, "review": "I resisted buying one of these devices until now. My experience with \"Google stuff\" has been mediocre, at best. Typically anything \"Google\" (Android phone and Google TV as two examples) is shipped with uninstallable bloatware when it arrives and continues to be loaded with more bloatware over time to the point where it becomes unusable. Fortunately, this device doesn't really directly run or support apps, so hopefully google doesn't find a way to muck it up in the future (although they are probably working on this now).I bought this for the sole purpose of sharing my laptop screen on the TV as my wife and I are house shopping, and doing so in the living room is much more convenient than being huddled around a laptop or desktop monitor. For that, it does an OK job, but I think I would have been better off just getting a wireless HDMI adapter. The desktop it displays on my TV is not sized properly for my TV and there is no setting to change that, so it extends a bit beyond the borders of my (75\") TV, making browser tabs impossible to see in full screen mode. This is just poor application development in my opinion.Much like Microsoft has always done (in true Orwellian fashion), Google has apparently made it difficult to use this with browsers other than Chrome. I am migrating away from using Chrome so this isn't a plus for me. I see there are ways to use it with other browsers, but I really have no more patience for hacks and kludges anymore - I want something that just works and works well and I don't want to have to mess around re-engineering it to get it to do what it should have done in the first place.What Chromecast does well out of the box as far as desktop/laptop support is concerned, is \"display one Chrome tab\" to the TV. That said, I found the desktop Chrome extension to be surprisingly weak and unimpressive. I have seen flashlight apps with more options/features. If I want to display my whole desktop (who would want to do that other than everyone?), I have to actually navigate to the \"display entire desktop\" which, apparently, after almost 2 years is still in beta, and experimental? Really? Add to the annoyance that it takes me 6, yes, six clicks to do this, several of which are completely redundant. Again, really?I noticed that there is a lag between my display and the TV, so sound doesn't sync properly and there is supposedly a \"tweak\" or \"workaround\" for that. I don't need sound for my purposes and, frankly, I don't want to have to apply a tweak or workaround to a commercially released product... I want a product that works properly and is easy to use. Is that really too much to ask for these days??? I imagine buying a google car that has delayed throttle, brakes, steering and horn, and being told \"there's a workaround for that\".I was originally going to give this 3 stars, but when I think about how unfinished and buggy the Chrome extension is, and how it really lacks any features (you can't even resize the display to match your TV, I really can't justify giving this more than 2 stars.Come on Google, you can do better than this...but you probably won't.", "verified": true, "helpfulness": "1/2", "author": "just me"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Thomas Andriano"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "John Paoloni"}, {"rating": 5.0, "review": "I have one, bought for my mom. Works great for streaming hulu, Netflix.", "verified": true, "helpfulness": "0/0", "author": "Dylan"}, {"rating": 5.0, "review": "as expected", "verified": true, "helpfulness": "0/0", "author": "STEVE VALENTI"}, {"rating": 1.0, "review": "This device is supposed to connect your mobile devices to your TV for mirroring screens from source to destination or simply casting \"IF\" you have an internet connection. Fairly easy to set-up and start casting but impossible to keep a connection live for longer than 5 minutes without receiving the message: \"Cast Connection Stopped.\" Tried different routers, tried Google forums and their solutions to no avail. Wait till Google devises a solution that works without an internet connection.", "verified": false, "helpfulness": "1/1", "author": "Helton"}, {"rating": 5.0, "review": "I love my Chromecast, adds more functionality to my Smart TV. Go Google!For those wondering, it does come with a USB power dongle, that powers the Chromecast by USB. People might get confused that it doesn't, due to Amazon suggesting to combine the order with a USB power dongle. Not necessary.It also comes with a regular power box to plug the USB cord into an outlet if your TV's USB ports are full. The Chromecast's other side plugs right into HDMI. There is also an HDMI extender, but its only a few inches, as it's for those with TVs that the USB is behind the TV and they want their TV as close to the wall as possible (ie. mounted).The trend with TVs is the streaming, and Chromecast is a solid competitor it it's own unique way, as other products use DLNA, or actual technical streaming.I occasional get the buffering message, thus temporarily pausing the content streaming, but that only occurs when the source's resources are being used up on other things, or when the medium (Wi-Fi) is incurring large amounts of bandwidth usage.Final thoughts, this is good for casting tabs, connecting with Android smartphones, and VideoStream from Google Chrome browser. When you open the box, it will feel like when you are opening your Apple iPhone box for the first time, clearly the manufacturer's is taking a page out of Apple's product packaging, which was successful nonetheless.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 1.0, "review": "Chromecast was poorly planned by Google. As a fan of Google I was excited when it was announced but have been very disappointed. It does not stay connected to the network, if you try to cast HBOGo it freezes constantly. I have an excellent network connection and no other device acts like chromecast, and gives me the problems chromecast gives me. I wouldn't recommend this to anyone!", "verified": true, "helpfulness": "1/1", "author": "A. R. Steele \"True Conservative\""}, {"rating": 5.0, "review": "Every time are more app that support it. I love it.", "verified": false, "helpfulness": "0/0", "author": "Yilliam"}, {"rating": 3.0, "review": "I was hoping for more of a Apple TV/Roku but it's really more of a wifi connection to plug into your display.  You need a iphone or Andriod device to stream content from.  For what it is it's fine but I returned it.", "verified": true, "helpfulness": "0/0", "author": "Phil M."}]