[{"rating": 1.0, "review": "I have an 802n wireless router and have no problems with smart tv or 3 wii's which this was replacing one of, but this fire tv lags alot. Netflix buffers so it's not as bad. I'm very disappointed in this item because I have amazon prime and no access to it besides pc's. If hardwiring this item, then it is great.", "verified": true, "helpfulness": "3/6", "author": "C. Pouliot \"Handy Man\""}, {"rating": 1.0, "review": "I'm an avid Amazon lover, and belong to PRIME so this thing really was right up my ally.  From day 1 - the programs would stall and get stuck.  I always just thought it was the quality of my wifi.  I ended up getting a better speed of wifi and the problem still existed.  It did not happen with my Samsung Smart DVD - so the coverage was fine.When I finally realized it was a defective unit (oh by the way they name it FIRE because it's hot like FIRE when it's on) I tried to return it and i was 2 days outside the return window so I called Amazon and they allowed the return.I got my return receipt and they deducted $20 for \"restocking fee\" (did I mention it was defective?  I hope none of you end up with this unit since it was \"restocked\") and they charged me $9 for return shipping.I was not informed of any of this when I called to get authorization.I did live chat today to resolve the issue and they agreed to refund only $9 of my \"restocking\" fee.  I found that to be shortsighted and worthy of a crappy review.", "verified": true, "helpfulness": "7/11", "author": "D. DuBois"}, {"rating": 1.0, "review": "Maybe we got a dud or maybe it didn't work or perhaps we didn't have it installed correctly - it didn't work!  We sent it back and received 98% of the money back.", "verified": true, "helpfulness": "3/6", "author": "Louise E. Hayes"}, {"rating": 5.0, "review": "The designers and creators of this unit packed a huge amount of ease of use, very well built (and packaged) piece of equipment. Voice recognition works VERY well, and best-in-class at the time I wrote this review (June 2014). Easy set-up, requiring very little instruction. Note that set-up was fast, and worked well immediately.Amazon, like Apple, packaged this product beautifully, showing pride of all phases, and the best of American product superiority ( although not all was manufactured in the USA. Highly recommended. As stated, documentation was minimal - a bit more clarity on (of all things) putting the batteries in the remote would have been appreciated, but only a minor inconvenience.", "verified": true, "helpfulness": "0/0", "author": "Florida-Brian \"Fl-Bri\""}, {"rating": 4.0, "review": "This streamer works  well and has a nice small footprint . Audio control a great plus and the list of programming is terrific", "verified": true, "helpfulness": "0/0", "author": "Richard A. Diekman \"rapid reader\""}, {"rating": 4.0, "review": "We have both the Fire and a Roku. We use it primarily for Netflix over Comcast internet. There is no difference in buffering, I am sure that is an issue with Comcast. This is easy to use with a nice user interface. The voice control is great if you know exactly what you are looking to watch. We tried a Roku stick and had to send it back due to frequent buffering issues. This is by far a better unit.", "verified": true, "helpfulness": "0/0", "author": "kentrosi \"kentrosi\""}, {"rating": 5.0, "review": "Easy to set up, easy to use and the voice activation works very well.Just another great product from a very good company.", "verified": false, "helpfulness": "0/0", "author": "nancyallenfort"}, {"rating": 5.0, "review": "Better than having an Xbox or Sony Playstation in your bedroom.  I put Velcro on it and put it on the back of my wall tv.  Finding shows with the voice recognition remote is awesome.  Got this with the free 30 trial.  Will be keeping it.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 4.0, "review": "First, I'm 68 and usually have one of my sons hook up any new equipment. But when my fire came in I decided I'd try it myself and it was easy. The only thing that stumped me was turning it off and on. I got on Amazon chat and 'talked' to a very nice person who explained that I could either unplug it when done or just let it go to 'sleep' in about 30 minutes.  I've used it several times mostly on hulu plus and am very pleased with the quality. I have a history of my streaming buffering forever or not loading at all and the fire seems to do well. And  yes, my internet is fast enough for streaming.  I do agree with some other reviewers on two negative things. One it's hard to find the Amazon Prime (free) videos and a big one for a librarian the list should be alphabetical. You'll find season one of something on 'page' 4 and then several pages later find season 4 and several more season 2. This really needs to be straightened up so If I want to watch free  prime the 3 seasons of say Falling Skies they are together, not all over the place.  After that, I'm really pleased with my fire. One question, is there any way to add another site to its lineup?", "verified": true, "helpfulness": "0/0", "author": "Jeanne Griffith \"Jeanne\""}, {"rating": 4.0, "review": "It really needs to be integrated with Amazon Prime Music as soon as possible, it is noticeably absent. Also I suggest better advertising to the Indy development community to get use of the game controller, with a steady stream of new games.", "verified": true, "helpfulness": "0/0", "author": "Eric R"}]