[{"rating": 1.0, "review": "Not impressed, the ads show all the wonderful things it can allegedly do, but with iOS it has extremely limited use. I am not a Netflix or YouTube user so it is essentially useless to me. Hopefully more apps will be created to use it...Setup was not too bad, I had a problem with my network 'seeing' the device but it was a setting on my router.", "verified": true, "helpfulness": "0/2", "author": "Tech Support \"Norm\""}, {"rating": 4.0, "review": "great product for the price, but limited functionality. works well but  only youtube or netflix will work on it. sad", "verified": true, "helpfulness": "0/0", "author": "vic"}, {"rating": 3.0, "review": "I have a Roku 3 and love it.  I wanted a second one for the other room, but I thought...I'll give the Chromecast a shot, for 25$ I'm not expecting much.  Well, it's a bit flaky at times.  Some of the apps from Android and/or Apple tend to be a bit unstable on the Chromecast.  The sound sometimes isn't synced with the video properly.  There aren't that many apps availabe for the Chromecast either.  All things considered, the Chromecast works pretty good for what it is.  But I love my Roku more than this item.", "verified": true, "helpfulness": "0/0", "author": "RyanP"}, {"rating": 5.0, "review": "Not only does it work as well and as easy as advertised,  the picture quality exceeded expectations. I would recommend this item to everyone.", "verified": true, "helpfulness": "0/2", "author": "Pj"}, {"rating": 3.0, "review": "Streaming data to your big screen tv... a great idea.  Great for Netflix and  UTube.  Would like to stream my photos from my C:/ but doing so is very cumbersome.  Have not really mastered the technique.  Also issuing commands from your tablet to the Chromecast seems prone to fail.  I keep getting a \"time out\"  then a \"unable to issue command to this device 160001.  failure.However having better luck with my NetBook.  I will get back to you should the situation improve.", "verified": true, "helpfulness": "0/0", "author": "Dannie C. Kemp"}, {"rating": 1.0, "review": "How disappointing to purchase a new 39\" Flatscreen and Chromecast only to spend over an hour with customer support who finally tell me the product is defective!", "verified": false, "helpfulness": "0/2", "author": "Preston"}, {"rating": 5.0, "review": "Great as a gift or when out of town! Love it. Easy to set up and use. Bought one for myself too!", "verified": true, "helpfulness": "0/0", "author": "shauna"}, {"rating": 3.0, "review": "The hookup was easy (added the extender cable to get better reception)It would have been greater if it could work with your browser not just Hulu plus,  netflix and YoutubeNot so easy to disengage once you start  a movie in netflix. Either Netflix is the issue or Chromecast is because once you switch it back to your tablet and go back to browsing movies the Netflix thinks its still running the first movie. Then you have to  cycle off the Chromecast hdmi port to disengage the casted movie .But for $35 it is nice not to need an HDMI cable connected.", "verified": true, "helpfulness": "0/0", "author": "Robert P Belhumeur"}, {"rating": 2.0, "review": "I am over age 30. I dunno how to make this work.Several sentences of instructions are worthless as I do not speak 'computerwonk'.I thought maybe I just plug it in, and it would work.", "verified": true, "helpfulness": "1/8", "author": "purchaser"}, {"rating": 3.0, "review": "Pretty basic here.  If you want internet on a non internet tv this is a cheap way to go.  Personally I like my vizio box better", "verified": true, "helpfulness": "0/0", "author": "Todd Thiede \"Todd M. Thiede #1 amazon best seller\""}]