[{"rating": 5.0, "review": "Definitely recommend anyone get this....it's only going to get better! Easy to set up, everything just works, and the quality is great!", "verified": true, "helpfulness": "0/0", "author": "Shaya Klechevsky"}, {"rating": 5.0, "review": "Nice device that just works. Getting 3 months of Netflix made it a no brainer. I'm looking forward to other companies coming on board and adding more value.  I have mine connected to a HDMI port on my receiver.  I don't understand Google saying that your best speakers are on your TV.  Really ?? I don't think I've heard any TV speaker that sound that good, get the audio into your home theater setup where it belongs.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "After 3 hours of trying to connect to my WiFi I called Google for support. They said I may have received a bad device and would escalate my support call to hardware...never heard back from them, it's been weeks!", "verified": true, "helpfulness": "3/6", "author": "Ryan \"MacGeek\""}, {"rating": 2.0, "review": "Pros:Casting Netflix and YouTube is great.Low cost.Cons:Poor WiFi quality. The only device at home(I have a lot of WiFi devices) constantly complaining about the WiFi signal strength.Except casting Netflix and YouTube, the casting Chrome tab is unusable with serious time lag.Conclusion: The device is good for watching Netflix and YouTube on TV if that's all you want.", "verified": true, "helpfulness": "2/4", "author": "Michael X."}, {"rating": 5.0, "review": "Does what I expected and a great price, Very straight forward piece of technology. Another step away from being connected to cable. KISS formula", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can stream content from any HDTV - and for only $35. Easy install, simple setup. What's not to like?", "verified": true, "helpfulness": "0/0", "author": "Ed Bonza"}, {"rating": 1.0, "review": "Pbbbbbbbbbt!  I had to get a new wireless router.  Call tech support three times.  The interface is un-friendly.  And the streaming still freezes.", "verified": true, "helpfulness": "2/4", "author": "Jeff M. \"Swing-Blues Dancer/Instructor\""}, {"rating": 5.0, "review": "While there aren't many apps available yet, it's a great device to be able to stream youtube/netflix onto your TV. Having the 3 months of netflix certainly didn't hurt either.", "verified": true, "helpfulness": "0/0", "author": "L. Tai"}, {"rating": 4.0, "review": "It's early, so I am hopeful it will become better as the months go by.  Currently, I am not 100% sold on it due to a few main concerns of mine.> Because it streams from your device over the internet to your HDMI - the battery drain on your device crushes it.  I expected some of this, but I had not expected it to drain this badly.> Although I can view Netflix, YouTube, and some things from Chrome (the browser) I am disappointed I cannot view my Android phone Gallery.  I have a lot of photos and videos of my kid on my phone, and find it a pain to have to upload everything on my phone to the internet just to then display on my TV for people to see them.  I am hoping this will get adjusted also.", "verified": true, "helpfulness": "0/0", "author": "Sly-Dawgg \"Designer\""}, {"rating": 4.0, "review": "I wanted to \"cast screens\" to my TV, and it does that very well. The YouTube and Netflix play is a bonus, though I already could do that with my \"smart\" TV. I'm happy.", "verified": true, "helpfulness": "0/0", "author": "James M. Thompson"}]