[{"rating": 5.0, "review": "I expected a piece of junk BUT was glad to find different..  The Chromecast is easy to use, inexpensive and a great tool for recreation and business.  Who would have \"thunk it\"", "verified": true, "helpfulness": "0/0", "author": "kenneth turner"}, {"rating": 4.0, "review": "I've been playing with it since I got it. I'm very happy with it when watching YouTube videos but can't find other - free - videos to watch with Chromecast. It would make me very happy if it supported Hulu (not Hulu Plus) which I don't think it does. I'll keep playing with.", "verified": true, "helpfulness": "0/0", "author": "mary haveman"}, {"rating": 1.0, "review": "I tried everything, but still did not work.  I do not know how to return this item, it seems there is no simple guideline in returning or replacing this item. I want it replaced.", "verified": true, "helpfulness": "0/0", "author": "Nestor Gellada"}, {"rating": 3.0, "review": "Needs more apps that can be viewed! Too limited to only netflix and you tube. Expand the apps offered, please!", "verified": true, "helpfulness": "0/0", "author": "Ayon D. Walters"}, {"rating": 4.0, "review": "While my Wi-Fi reception shows 4 bars (on my laptop); the Chromecast dongle losses reception from the laptop which is less than 5 feet away. 90 percent of the time, in order to get recognition I need to reset the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "David L. Miller"}, {"rating": 5.0, "review": "Nice product. Works perfect. You can handle it to set up on any TV you want with no complication at all.", "verified": true, "helpfulness": "0/0", "author": "Sandor"}, {"rating": 5.0, "review": "Just an aswsome gadget to directly play anything from your device on your tv, simple but very effective and just a lot of fun.", "verified": true, "helpfulness": "0/0", "author": "Bas van Eijk"}, {"rating": 1.0, "review": "It shorted out my HDMI input board on my tv !The repair bill is $350.00 ! dollars. That's ten times the cost of the device.  Not only do I want my mobey back but I'd appreciate some compensation to help pay for the repsir needed to my LCD 52 inch Sony Bravia", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 5.0, "review": "Works great! Small and out of the way. Your phone is the remote. Cant beat the price. Very pleased with the performance", "verified": true, "helpfulness": "0/0", "author": "roystd1"}, {"rating": 5.0, "review": "Great item  for the family and college kids does have some loading times but it is a reliable item to have", "verified": true, "helpfulness": "0/0", "author": "mike bor"}]