[{"rating": 4.0, "review": "I own a roku; Apple TV and now a chromecast. When you by a mobile device you are buying into a platform and I feel google will get all there ducks in a row. Roku has tons of different channels and games but doesn't have watchESPN or YouTube. Apple TV has YouTube, AirPlay and wachESPN and HBO go but no where near the channels that Roku has and you are unable to queue videos with Apple TV which is a killer feature chromecast has. I see a future in chromecast where you will have options to all the channels (including watchESPN and HBO go and others apps like spotify and radio). Chromecast has the ability to become both Apple TV and Roku but combined and that's why the platform matters. And why I am buying into the chromecast platform.", "verified": true, "helpfulness": "6/8", "author": "Michael Hannah"}, {"rating": 3.0, "review": "Good product, but nobody wants to by content from Google Play when we have already built up our libraries through amazon and itunes. Also, the media selection is way better on amazon and itunes. Just do yourself a favor and pay a little more for the better experience of a Roku or Apple TV. That is all.", "verified": false, "helpfulness": "3/22", "author": "Ryan"}, {"rating": 1.0, "review": "Does not work with iPhone or iPad iOS. Google should have noted that iOS access is not available for setup at this time. Need a wireless Laptop, Notebook running Windows 7 or 8 or an Android device to setup Chromecast. Cannot be setup using iOS devices.", "verified": true, "helpfulness": "33/147", "author": "TonyG"}, {"rating": 3.0, "review": "Why on earth would this Google product not work with one of, if not their most popular laptop? I see it says support for the chromebook \"coming soon\" That's bogus! I bought it specifically to stream from my Chromebook! And I still haven't received any sort of code for 3 free months of Netflix, even though I ordered the first day, right after it was announced.", "verified": true, "helpfulness": "3/8", "author": "RH"}, {"rating": 3.0, "review": "Here are my thoughts after one day of use.Installation:I have a TV that doesn't have HDMI 1.4 (i believe it can draw power from a 1.4 device, not sure though). Connected the USB to my TV and it powered up.Installed the Chromecast app on my RAZR. I got the device to go from Step0->Step1 where a 4-letter ID shows up but my RAZR immediately reported an error (saying the communication failed). I just couldn't get it to work with my phone. I finally picked up my laptop. I was able to go from Step1->Step2 where I provided the 4-letter ID. The Chromecast device had serious trouble connecting to my network (I have 2 routers with different names but it wouldn't connect to either of the two routers). After dabbling with the device (turn off, turn on) and the app (restart the app) it finally did connect (although there were no logical set of steps that I could come up with).Use of Chromrcast:First i installed the Chromecast extension and tired out a youtube video. It should be noted that the chromecast device does not mirror the screen but rather works very similarly to the way youtube works with smart-tvs. It sends the appropriate information to the chromecast device and then you are free to turn off the device if you would like. However, this would not allow you to pause/rewind/ff the program you are watching. This is different than the experience that I have with my panasonic tv which allows me to control the programming even after the device has been turned off. This was a little bit of disadvantage.Netflix worked similarly too (thanks for the 3 months of free subscription!) and I found having to go to the device that started the programming to control ff/rewind/pause etc. Not a problem but definitely not an optimal experience as watching the program from an in-built app.Amazon instant video (and I really wanted this to work because I have a prime membership) doesn't work. You can cast a tab from chrome onto the screen. The movie will play too on the screen but it stutters big time. This is because in this case the screen is being mirrored as opposed to youtube and netflix which support the native mode. I hope this feature is included as part of instant video. I wasn't expecting this to work (but was desperately hoping it would!) but this is an observation.I also tried playing movies from my hard drive thro the chrome browser. I saw three issues. a) it only plays some formats even if your laptop is capable of playing more formats. b) video stutters thro. c) There was no audio. Not sure why the browser muted it and did not allow an option to unmute.Video quality (netflix and youtube): In one word, excellent. No stutters, no pixelation (at least 10 feet away). The audio quality is good as well although I do not know if this is 7.1 quality. I haven't tried installing this onto my receiver directly but definitely plan on doing that soon.Still hoping for more streaming apps (especially Amazon, are you listening!) and using an device (not just the one that started the program) to control the programming using the chromecast app. Rather use the app as a simple remote (a touch-pad type remote) would be nice.I must add though that I had no issues installing and updating the Chromecast device from a Samsung-S3. Not sure what the issue with Razr was.", "verified": true, "helpfulness": "5/9", "author": "Harish \"Engineer, Photographer and Electronics enthusiast\" \"Harish\""}, {"rating": 5.0, "review": "The apps are great on both my Nexus 7 (2013) and Windows 8 laptop. Youtube and Netflix both play video in 1080p and using your device as a remote is almost as responsive as a real remote. I did have some issues with the youtube app on my laptop; sometimes a video ad would play on my laptop and when the ad was done I would no longer have control over the video that was being played on the Chromecast.The function to automatically turn on the tv did not work for either my tv, which is a few years old, or my parent's tv, which is a few weeks old.The laptop screen share essentially works as a wireless hdmi cable, but it has a few expected flaws. Initially, my router was upstairs and I was testing on my middle floor, and it was impossible to screen share a video. It was far too laggy and glitchy (testing on South Park Studios and HBO Go). I then moved the router down to the middle floor and placed it near my tv, and the performance was greatly improved to the point where I was able to stream video. Even though the performance was improved, I would rather just stream video with a cable under most circumstances. The screen sharing resolution is also maxed out at 720p. Hopefully more content providers will make their own apps, which clearly perform better than the screen sharing.The Chromecast is nice for laptops/desktops and incredible for mobile devices. The ability to starting playing a video, then turn off your screen or start doing something else is not possible with just a hardwired connection (for mobile).There are a few things that I still haven't tested, such as multiple mobile devices queueing up a Youtube playlist, but overall for only $35 I highly recommend it. Google has publicly released the SDK, so it's only going to get better.", "verified": true, "helpfulness": "6/8", "author": "M. Schindhelm"}, {"rating": 5.0, "review": "I usually don't browse the web during work hours but Wednesday was such a slow day I just had to go to my favorite weblog, Lifehacker, in the afternoon to read the latest articles just to pass the time and that's when I found out Google unveiled the Chromecast that day and it was available to purchase from Amazon.I immediately login to my Amazon account and buy a Chromecast while it was still in stock, just 2 hours before they removed the Netflix offer, and my only regret is not ordering more than one unit. It's a good thing I didn't wait to place my order after work!I've always wanted to stream content from my laptop to my TV without having to use an HDMI cable or buy a set-top box that requires me to use another remote and I wasn't ready to spend hundreds of dollars to upgrade my laptop and buy a WiDi dongle so $35 for the Chromecast was a no-brainer for me.", "verified": true, "helpfulness": "1/4", "author": "Raffiki77"}, {"rating": 5.0, "review": "First off this device is great at what it is supposed to to.  At its heart it basically mirrors a tab from your internet browser to your tv.  Any content that you can play on your browser you can watch on your tv.  In addition it has a few apps netflix and youtube but from using these I have found that the only advantage of using the built in functionality over the in tab version is that with the app you can close your browser or navigate to different pages while watching your content.  Additionally, this device is great at watching local content through plex. Some people have complained that you need to be 20 feet away to stream content and that is not true. You only need to be 20 feet away for the initial set up but after that you can cast videos to your chromcast from anywhere where you have a connection you your wi-fi.  It has some limitations but for the price point, even without the netflix promotion, this is a great device for cord cutters who what to easily stream content to their tv.", "verified": true, "helpfulness": "4/5", "author": "Rakesh Patel"}, {"rating": 5.0, "review": "I received this yesterday.  It took all of 3 minutes to install.  The installation on PC is performed from a downloaded EXE.  Your system WiFi is momentarily disconnected from your local WiFi and connects to the Chromecast dongle.  From there the setup configures the Chromecast to connect to your PC's formally in use WiFi SSID. After setup your PC is returned back to its normal WiFi connection.  The process is amazingly smooth.So far I have \"cast\" from a PC notebook, Kindle Fire, IPad, and S3 phone.  Chromecast takes queues from Apple with the in-App \"cast\" button.  Multiple Chromecast dongles are supported from the cast button, so you can cast to several TVs or rooms from a single device. Any application that had the cast button works great.  So far Netflix, YouTube, and the Chrome browser have cast buttons.  Netflix works great on this product from every device I tried.  Video playback appears equal to more expensive devices like Xbox or PS3.  My receiver indicated only stereo playback from Netflix and not surround sound.For YouTube the cast button is built into the videos.  Casting a video from the video cast button and not the browser cast button produces finer video playback.  When casting from the browser, the active tab is cast without frame, buttons, or URL address bar.  You will not see the mouse moving around on the Chromecast screen but highlighting text is mirrored to the TV.  Using the ctrl + and ctrl - buttons (to change browser zoom) on my PC also changed the zoom of the browser on the Chromecast.  Silverlight and QuickTime video where hit or miss (mostly miss) but Google has indicated they are not supported.  Because casting stays on the App or browser tab being cast this has great potential for business presentation use.Chromecast is able to display local network content and websites.  Using the Chrome browser I was able to browse local file shares, like my freenas (using the url: file://freenas/) and play local videos in MKV and MP4 but not WMV.  Local video playback was choppy on high bit rates videos (1-2GB) and smoother at lower rates (200-400 mb).  I suspect that Chromecast apps will correct this in the future.  Mp3 audio files played from the browser cast and sounded amazing.Chromecast connected on my 2.4 ghz WiFi.  The WiFi signal strength is displayed on screen prior to casting a source.  WiFi signal strength was on the week side, most likely a limitation of the small form factor and no external antenna.  I added an Asus repeater (RT-N12) to the room and this corrected the signal strength issue.I have read that the dongle can power off of the HDMI port alone but that was not the case with my Pioneer 7.1 Receiver.Overall this product is a no brainer at $35.  This product has huge potential especially as new apps are introduced.", "verified": true, "helpfulness": "2/3", "author": "ALLDWL"}, {"rating": 2.0, "review": "I'm not sure what GOOGLE is up to...Here is a USB type stick that has a few APPS on it and allows you to bring in Netflix, You Tube and a few other APPS on your TV.  So what.Most TV's already have the same APPS.  For $49 to $59, you can also buy a Blu-Ray DVD player (lower-end models) and enjoy NetFlix, You Tube and a slew of others.ROKU USB sticks allow me to add or delete APPS with ease.  My Sony TV does the same.Here is where GOOGLE really stuck it to customers:They offered 3 months of NEXFLIX free along with your $35.00 purchase of the GOOGLE CHROMECAST MEDIA PLAYER.  However, the next evening, they recinded the offer, affecting thousands of customers that had already purchased it online.The USB stick needs a cord and power from the wall so it gets no points for being user-friendly.  Plus, while they claim you can stream material directly from your laptop or smartphone, it sadly has a range of just 20 feet on a wireless basis.Stay with ROKU or Apple or better yet, go grab a Panasonic Blu-Ray DVD player which is loaded with the same APPS plus a dozen others plus can play your Blu-Rays at the same time.A lously and sub-standard launch.  Not worth the $35.00 despite the demand.  That demand will quickly end.", "verified": true, "helpfulness": "7/30", "author": "IFLYMAUI"}]