[{"rating": 2.0, "review": "A friend recommended this product. Said it was easy to hook up and watch free streaming tv & movies. Except for watching YouTube movie clips... Waste of money.", "verified": true, "helpfulness": "0/0", "author": "Kennth Brown"}, {"rating": 4.0, "review": "The chromecast is a brilliant idea and even during setup it works flawlessly, however the amount of applications out there that support it and the circumstance that there is no development kit for desktop applications means that there are way too few opportunities to use it right now.", "verified": true, "helpfulness": "0/0", "author": "Joscha"}, {"rating": 5.0, "review": "Love how easy chromecast is and how versatile it is.  Many apps have been added as well.  My in laws have it and I was sold by how much they like it.", "verified": true, "helpfulness": "0/0", "author": "Kathryn V. Wilson"}, {"rating": 5.0, "review": "Excellent,  easy to use and install. Simple, economic and yet very useful item for making a tv into a smarttv", "verified": true, "helpfulness": "0/0", "author": "Oscar Ruffinelli"}, {"rating": 5.0, "review": "This is one of the best new gadgets I have purchased in ages. The ease of use is perfect and the portability is THE BEST. I plan on buying more just for travelling and possibly  gifts for college kids or teens as more families opt OUT of cable and satellite Tv due to cost. I use Netflix and hulu plus with ease. GREAT GADGET and multi-uses for devices", "verified": true, "helpfulness": "0/0", "author": "TAMARA"}, {"rating": 5.0, "review": "Use it every day. Media players were going for three times as much and this does the job perfectly and no cords hanging out. Can't wait to see what other applications they make it compatible to", "verified": true, "helpfulness": "0/0", "author": "Jose J. Luna"}, {"rating": 5.0, "review": "well worth the money, excited for new apps to be developed. On another note, I am using this in Canada and it works fine with netflix and the like", "verified": true, "helpfulness": "0/0", "author": "Tarek Mavani"}, {"rating": 5.0, "review": "This is a very economical and attractive device for streaming. Of course it is limited in its use. Wish it could stream everything you are doing on the laptop. Of course, for the price it is too much to ask.", "verified": true, "helpfulness": "0/0", "author": "Umapathi K. Reddy \"UKR\""}, {"rating": 5.0, "review": "Google Chromecast is easy to use. The install was self explanatory and a snap. I was watching Netflix within 10 minutes on my HD TV.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Bonner"}, {"rating": 5.0, "review": "I brought this to go along with my Chromebook and android phone. This chrome cast is amazing! I can watch hulu, YouTube and amazon on my TV. Also I can broadcast other websites on the TV through chrome cast. Great Product!", "verified": true, "helpfulness": "0/0", "author": "E.Navarrete"}]