[{"rating": 2.0, "review": "I admire Google advertisement this Google Chromecast on U-tube, and order from Amazon to try.Installation is easy. (1star).However, set-up is not easy.First try on Samsung Tab; supported with Android operation system, it works fine. (1 star).Second try on I-Phone, it bother me, because Google chromecast does not connect with i-phone.Keep try and try different device name. Finally, I give up.Quality of product; I think Google should do more testing their products more reliable with different devices are not used Android operation system, before sell to public.About function ability, Google Chromecast just a device to connect mobile devices with big screen TV, (similar function as using air play built-in i-phone 5), Google Chromecast  is also not device let customer browse on internet website, as smartTV adapter as Roku, Neo, Stick...etc. It is slave device is controlled by a mobile device. Google chrome cast has limited use with some service as U-tube, Netflix, ..etc , not for all service internet providers.", "verified": true, "helpfulness": "0/0", "author": "TuRau \"Movie lover\""}, {"rating": 4.0, "review": "I love it..I thought it would be difficult to operate, but it turned out to be really easy. And it also doesn't take up any space.", "verified": true, "helpfulness": "0/0", "author": "Kiesha Ivey"}, {"rating": 5.0, "review": "It was exactly what I was expecting. Works flawlessly for youtube, netflix and google had added photographs that works really great.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Vidal"}, {"rating": 5.0, "review": "I was surprised that I had to plug it to the wall since it is USB I thought it would be powered by the TV. It works very well if you use Netflix and YouTube a lot of which I do. It can show anything you want but the supported apps is where its best value is. They will get more sites I'm hoping soon it seems to be expanding in that direction. Its worth the money if you have a HD TV that doesn't receive the internet.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "Excellent. Does what it is says on the box. You can use it to watch endless YouTube videos on your tv while controlled from any device.", "verified": true, "helpfulness": "0/0", "author": "t4coffee"}, {"rating": 2.0, "review": "I was unable to get any audio out from the Chromecast. It was suggested on the internet to unplug it and plug it back in. Upon unplugging it the gold part came off leaving just bare wires. Maybe it's a great device but mine was poorly made.", "verified": true, "helpfulness": "0/0", "author": "Holland Rhodes"}, {"rating": 5.0, "review": "Great thing easy to setup and works amazing!! I use it everyday and watch YouTube and Netflix with it and wow its a great item to have", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 5.0, "review": "Best $35 spent to date. We don't have cable, and we don't need it. Run internet content from your smartphone via apps or anything you can get using Google from your laptop. This product and technology does not disappoint!", "verified": true, "helpfulness": "0/0", "author": "E.C."}, {"rating": 3.0, "review": "While this works as advertised most of the time, it often has difficulty connecting to the network, and I've tried it with three different wireless routers.  I mainly dislike how laggy the control is.  Press pause and wait wait wait...PAUSE.  I understand why it's slow but that doesn't make me like it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Raven"}, {"rating": 3.0, "review": "This has potential, but it's really only useful to me if I'm wanting to show something on youtube.  I'd like to be able to mirror the laptop screen and watch anything, but that's not what this does.  Heck, even watching Amazon Prime would be nice.", "verified": true, "helpfulness": "0/0", "author": "bathtub-gin"}]