[{"rating": 3.0, "review": "I would like to watch some of the free televisions shows and movies but can't get access to them.  I shouldn't have to pay for every movie I watch.However I do like the concept of the Amazon fire tv, it's very easy to hook up and they have new movies that can be rented for a small fee.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works so amazingly... It's lightning fast and I am very pleased. I would buy this for each TV in my house.", "verified": true, "helpfulness": "0/0", "author": "William Pearcy"}, {"rating": 4.0, "review": "Very good item. Better than Apple TV. Tks", "verified": true, "helpfulness": "0/0", "author": "rpimentajr"}, {"rating": 5.0, "review": "I wish I knew about this a long time ago.  There are so many movies, shows, games etc. to choose from.  My family is very happy with the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "KA, Horsham"}, {"rating": 4.0, "review": "I bought this fire tv as a gift for my parents on Christmas. Since my parents are older they do not have an Xbox or ps4 like I do and did not have a smart tv. Since I have a console I have access to the internet and to apps like Prime an Netflix. My parents did not but now its been about 2 weeks and they love the gift. The remote is easy to use and straight forward. I would have given this review a 5 but for some reason there is not an Off switch for the fire tv box. I don't know yet if the box gets turned off by accident how the device will start up when turned back on. Will say that the initial start up if the device is fast only if you have fast internet. My parents did not and the device too about 30 to 40 minutes to download the software then the software had to install and once it started had to download the apps like prime and Netflix but afterwards was easy to use. Overall would suggest to buy the product only if the person buying it doesn't have a smart tv or a gaming console.", "verified": true, "helpfulness": "1/1", "author": "Brittney Corona"}, {"rating": 5.0, "review": "Wow.  I was pleasantly surprised by this device.  I have an Apple TV and a NetGear 300SL, but neither of them would play Amazon Prime videos.  I've been playing them from my iPad thru the Apple TV, but that was not a very easy way to do it and I frequently experienced hangs and drops.  The Amazon Fire TV is very fast and the interface is very intuitive.  The speech search feature works well and is definitely more convenient than typing on the Apple screen \"matrix\".  I haven't explored all the features yet, but so far, I'm very pleased. Setup was very easy... it even knew who I was and logged me into my Amazon Prime account when I first connected without my intervention... a nice touch.", "verified": true, "helpfulness": "0/0", "author": "Howard M. Smith"}, {"rating": 5.0, "review": "Amazing. Replaces cable for me.", "verified": true, "helpfulness": "0/0", "author": "Leigh Hebson"}, {"rating": 5.0, "review": "Purchased for our 2nd TV and is just great. Inexpensive (got it while on sale), absolutely intuitive remote, beautiful picture, pretty good menu. It would be perfect if you could customize the menu or if Prime was listed seperarely. Almost got the stick, but got this due to the better remote being included, which is fun to use for amazon content, but not super helpful since it doesnt work for all apps. Also using for netflix which works well.", "verified": true, "helpfulness": "0/0", "author": "strangeways"}, {"rating": 3.0, "review": "It's good for the membership price, but still ends up costing a fortune long term anytime you want to add something halfway decent to your music, Movies or programming. Also the screensavers aren't in high def and the high def doesn't seem to come in very well compared to just basic antennae television, but maybe I'm doing something wrong.", "verified": true, "helpfulness": "0/0", "author": "Aminah777"}, {"rating": 5.0, "review": "Bought this to watch Netflix and Hulu Plus and Amazon Prime movies on my TV. I got it and installed it in about 10 minutes, connected it to my wireless and activated my prime account (automatic because I ordered it on Amazon Prime) and my hulu account and my netflix. The picture is incredible. I did have a problem. For some reason my TV's HDMI port would not pickup any sound. So I tried a few things with no luck. I ended up ordering a digital sound cable and a digital to analog audio converter. Both items with tax cost me about $17.81 on Amazon. Same items at radio shack over $40.00's. I got these items in connected my amazon fire tv box via the digital audio cable to the digital to analog audio converter box and that box to my surround sound box and it works beautifully. I highly recommend it. Just know you may need the 2 extra items as I did.", "verified": true, "helpfulness": "1/1", "author": "Kellie Quinn"}]