[{"rating": 2.0, "review": "Very limited use in fact, haven't gotten it to work yet. . .it shouldn't be this hard to \"plug and play\" but it is.  I'm sure once I get it going I can give a better review but for now other devices I bought are working better and are easier to setup.", "verified": true, "helpfulness": "0/1", "author": "OZ4"}, {"rating": 5.0, "review": "Woked perfectly out of the box. I just used to watch nba league pass on my tv and met my expectations.", "verified": true, "helpfulness": "1/1", "author": "Tadeu Wolff"}, {"rating": 4.0, "review": "It does a great job of casting to the tv from my table and laptop. I like the fact that I can move it to whatever tv I chose to watch.", "verified": true, "helpfulness": "0/0", "author": "barbara mccullum"}, {"rating": 2.0, "review": "I've tried the boxee box, roku3, and this.  I would have to say this comes in a distant second to the roku3, but I like it better than the boxee.  I really think the roku3 is easier to maneuver, and it has it's own remote. I don't like that I have to use my phone to control the chromecast, but some might appreciate that fact.  Hopefully they can get more support, I would love to see PlayOn support.", "verified": true, "helpfulness": "1/1", "author": "Random"}, {"rating": 1.0, "review": "When I purchased this item I configured it in 5 mins with no problem, but after a while it stop connecting to my network. Surprisingly, there are so many people there at the forums with the same problem so that means there is a defect in the product.It end up in the trash.", "verified": true, "helpfulness": "0/1", "author": "Daniel Gutierrez Cabrero"}, {"rating": 2.0, "review": "Typical cheap Google hardware. It's buggy, and doesn't always pick up the videos that I'm trying to cast. Casting a chrome tab is marginal at best - stick to the apps. As long as you want to stay within the required list of apps. You can't cast just anything, remember.Even though its cheap, get an Apple TV or a Roku 3", "verified": true, "helpfulness": "0/1", "author": "Ian Bouchard"}, {"rating": 1.0, "review": "At first we were really happy that we could stream to our waiting room TV with whatever content our patients wanted to watch. But then my receptionist noticed her computer was acting up. So we called our IT company and they remoted into her computer. Turns out there were over one thousand viruses and they traced it back to the Chromecast software. BEWARE!! We have state of the art antiviral software in our office, but it still managed to corrupt our files. Now we have IT working to see if it invaded our server and the 7 other computers in our office. This is a nightmare!!!", "verified": true, "helpfulness": "1/6", "author": "Poolak Zand"}, {"rating": 1.0, "review": "I called and waited forever for customer service when this failed to work, and they told me that they had a lot of problems with it and that I should use the extender for a stronger signal, which worked for a bit, but it's too heavy and now I have a $30 piece of junk that won't stay in the HDMI socket.And now it can't be returned.So if it doesn't work for you all the time in the first week, without the extender, I advise you to return it right away and wait for the next model, because reconnecting gets tired very quickly.", "verified": true, "helpfulness": "0/0", "author": "Petorius \"Petorius\""}, {"rating": 5.0, "review": "Easy to install.Easy to use.Works perfectly on my Tvs.The best way to make your tv smart.Excelent deal.", "verified": true, "helpfulness": "0/0", "author": "Marcio de Paiva Alves"}, {"rating": 5.0, "review": "Setup of the chromecast is easy and quick. We subscribe to Hulu, netflix, Plex Pass, and of course Amazon Prime so we have tons of content we usually send to the roku to watch. The chromecast is faster to load as we always have our phones on us (sometimes you have to hunt for the roku remote.), and we have the option to play youtube vids. If you look around you can find programs to cast HTML5 embedded vids to chromecast also. The only reason we keep comcast at this point is for newer shows we watch and dont want to go steal. Will be getting one for every TV in the house.", "verified": true, "helpfulness": "1/1", "author": "James T. Freeman \"mojofrojo\""}]