[{"rating": 5.0, "review": "It's worth the cost", "verified": true, "helpfulness": "0/1", "author": "Roger"}, {"rating": 5.0, "review": "I strongly recommend this product to anyone.", "verified": true, "helpfulness": "0/1", "author": "Jean G."}, {"rating": 5.0, "review": "As advertised.", "verified": true, "helpfulness": "0/1", "author": "Jacob Privette"}, {"rating": 5.0, "review": "Once you know, you Chrome Cast.  Makes internet to tv videos a breeze!", "verified": true, "helpfulness": "0/1", "author": "David H. Jenkins \"Waveout\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Udi"}, {"rating": 5.0, "review": "The Chromecast is a great product. Setup is very easy. Streaming is straight forward either from your phone or computer with the Chrome plugin. The services offered are expanding although the most used for us are Netflix, Youtube, and the computer. For $35, this is a no-brainer purchase. I also just bought the Amazon Fire Stick so we'll see how that compares. Only annoying thing for me is my TV's USB port doesn't provide power so I had to get a longer cable to plug it into the wall.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "I bought this and a Roku Stick at about the same price.  Since I like the idea of the mirroring concept on my TV, I bought the Chromecast thinking it had a competitive advantage.  With my one-time use of Chromecast, the mirroring seems to be only if the selected downloaded app allows it.  It won't mirror everything on your handheld device, nor will it mirror every app downloaded.  The fact that you have to have a handheld also makes it more painful to use.  I prefer the Roku Stick, with it's remote just for the sake of simplicity.  I'll keep the Chromecast, but I don't think I'll use it much, if at all.", "verified": true, "helpfulness": "0/0", "author": "mom"}, {"rating": 5.0, "review": "get its cheap and works great. I watch youtube videos on my TV all the time now.", "verified": true, "helpfulness": "0/0", "author": "James P. Knapp"}, {"rating": 3.0, "review": "BEWARE OF GOOGLE HELP LINE ! I couldn't get the cast icon to load on my Venue 7 tablet. I called the help line and within 10 minutes they were telling me that someone was stealing my Identity. They even faked some screens to look like my ip address was being compromised. I'm computer savvy and knew the i.p. address they were showing me wasn't mine. Then when they think they've got you hoodwinked and afraid they try to sell you Identity Theft Protection for $226.00 a year.  They were scamming me for a third party service that i didn't need. A call that should have taken 5 minutes took 65 minutes. I am very disappointed with Google.", "verified": true, "helpfulness": "1/2", "author": "Logan"}, {"rating": 5.0, "review": "This is working great. Dropped cable entirely.", "verified": true, "helpfulness": "1/1", "author": "P. Petti"}]