[{"rating": 5.0, "review": "Love this little box. We tried a Roku and were not happy with the interface, picture quality and the apparent lack of buffering. The Fire TV seems to have these things mastered. I have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Suzanne DeFrancisco"}, {"rating": 4.0, "review": "Streaming is great! Great Value. My only negative comment would be that I think it should be able to connect to Internet...Aamzon, for shopping online!", "verified": true, "helpfulness": "0/0", "author": "CV"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Zedong P."}, {"rating": 2.0, "review": "ok it's fast but it don't read my external hard drive. Disney apps don't work.", "verified": true, "helpfulness": "0/5", "author": "Fitzgerald S. Michael"}, {"rating": 3.0, "review": "I have no idea if it works yet or how it works at all.  Apparently the few minutes it takes to set it up doesn't include a trip to your favorite electronics store to get the HDMI cable you need to hook this thing up.Thanks Amazon, for being so cheap as to not include the HDMI cord needed to hook it up.  Are you kidding me?!!!!It's like being sold a car with out a set of keys.  This is why consumers get irate with manufacturers Why on earth would you sell somebody something with a vital piece missing and not mention that anywhere that I can see in the ad's.... Because you can I guess.", "verified": true, "helpfulness": "2/6", "author": "SeanG"}, {"rating": 4.0, "review": "Worth to buy in terms of Video 1080p experience. No hiccups while watching...it supports mostly amazon store apps. It doesn't support google play, you may have to find a different to add any android apps manually.USB port is available but you can't playback using that. Eventually, it is waste. Just showing USB is port there.", "verified": true, "helpfulness": "3/5", "author": "kula"}, {"rating": 5.0, "review": "Amazing! Its very fast, lots of variety and little to no buffering. Very satisfied", "verified": true, "helpfulness": "0/1", "author": "Kristin Sotir"}, {"rating": 5.0, "review": "Luv it , with the free music on prime and the Amazon cloud storage for photos and video along with Amazon prime Netflix Hulu plus it's well worth it", "verified": true, "helpfulness": "0/0", "author": "Will morris"}, {"rating": 5.0, "review": "Easy setup. Microphone is the best feature.", "verified": true, "helpfulness": "0/1", "author": "Steven Mann"}, {"rating": 5.0, "review": "This unit worked right out of the box and is a welcome addition to my entertainment system. I am still learning all the capabilities of the system. Voice search is outstanding.", "verified": true, "helpfulness": "0/0", "author": "Donald McBride"}]