[{"rating": 5.0, "review": "I read a lot of negative reviews, I am submersed in the Amazon ecosystem so I don't have an issue with that. To start off, shipping speed was very fast- less than 48 hours and it was here! The packaging was similar to the style that package their Kindle fire HDX in, you know very compact and every single piece covered in plastic- so that's an A+ on packaging. It was very simple to setup, basically plug and play, note there is a 20 to 30 minute software update. I read a lot of complaints about that but how is it different from the exact same thing my Roku, Apple TV, and Sony players do when I initially set them up. Once your player updates you are greeted with a cartoon man explaining the player and controls- definite A+ there. The player was already registered to me so I didn't have to sign in to a million channels and apps like I did with all the other players, another bonus. Now for the interface, it's beautiful and simple to navigate. The remote is light and slim lined with an outstanding microphone built in. The player itself is fast, doesn't overheat, and has an amazing range as well superior streaming speeds. So far this has been an outstanding experience. I will have to agree with the other members and say it is overpriced, especially when you consider it doesn't even come any AV jacks or HDMI cable. One note, it has a USB slot to view videos or photos- definitely a needed feature. Anyway, thanks to all the reviews y'all write, I really do read them when making a decision on purchasing a product.", "verified": true, "helpfulness": "4/4", "author": "Impulse Buyer"}, {"rating": 5.0, "review": "I bought the Fire primarily to watch prime videos on my TV. The set up was easy and fast. The worst part was trawling through all of the cables for my other components and keeping the cats from batting the batteries under the sofa. The voice recognition works perfectly.  I was watching my favorite video in ten minutes.", "verified": true, "helpfulness": "4/4", "author": "Jo \"Bookish\""}, {"rating": 3.0, "review": "1) remote is bluetooth not IR - it means that you can't use your universal/logitech harmony remote with it...2) can't access your music/playlists on Amazon?! there's no app for it :-)", "verified": true, "helpfulness": "2/7", "author": "S. Lakhani"}, {"rating": 2.0, "review": "I was taken in by the faster processor and the hope for the better graphics it should provide.  I thought my MLB.tv and NHL.tv apps would be significantly improved.  Unfortunately, there is no way to know as they are not supported - only NBA.  Really Amazon?  It works great for Amazon Prime content but if you want to watch out-of-market baseball or hockey games buy something else.  Games are not of interest to me as I use a dedicated gaming console (XBox One).  Bottom line, Roku 3 is a better choice for sports.", "verified": true, "helpfulness": "4/13", "author": "Bob Kern"}, {"rating": 5.0, "review": "When your looking at streaming content to cut the cord or just to enjoy movies/shows on your schedule there are a few choices of devices.  The Fire TV is the newest device and joins Roku, Apple TV, and Chromecast.  When selecting a device you should start with what content you will watch.  If you want Netflix or Hulu Plus any of the devices will work.  However if you have Amazon content (including Prime) then your down to Roku or Fire TV.  Roku is a very good general content box but I really like the job that was done to make the Fire TV easy to use.  Starting with the setup you connect your power cable, connect the HDMI cable, configure wireless and your on your way.  Searching is another place where this product excels.  You can press a button and say what your looking for.  The Fire TV will then display content to match your request.  Only thing I wish this could do is search Netflix as well as Amazon.  So far every search I have done has worked well.  I have searched for actors and titles and found what I wanted.  Picture quality is also very good.  I also have a Roku and the picture quality seems clearer and sharper on the Fire TV (This is just my observation).  I am very happy with the Fire TV and would recommend it to someone that wants an easy to use device to watch Amazon content (as well as Netflix and Hulu Plus).  If I have a wish it is that Amazon continues to add other content.  The one thing Roku has over this device is the large amount of possible content from various sources.", "verified": true, "helpfulness": "2/2", "author": "S. Rice"}, {"rating": 5.0, "review": "Amazed on how fast it was delivered. It was a two second set up and is amazing. Everything thing I need and wanted! I would recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "I used the Amazon Locker for delivery again, as I did for the HDX.Love the simple packaging of the FireTV (and game controller).  I unboxed it, plugged it in, and had it running in 5 minutes. The box is very slim and blends in with my TV console, very low profile. The quick tutorial video was nice but not needed as I have had a Roku for a few years.  The FireTV was already sync'd with our Prime account so I was off to the races immediately, noticing all of the free Prime movies and TV shows I have been used to.First, I downloaded media apps: Netflix, Hulu Plus, Pandora, TuneIn Radio, YouTube, All FitnessTV, AOL On, Daily Burn, Fit You, PostTV, and HuffPost Live.  (I set up a free 7 day trial on Hulu but might not keep it).All of the apps loaded quickly and worked just fine.  The selection is somewhat limited but I remember when Roku only had a dozen apps and now there are thousands so I figure Amazon will be there within a year.Next, I downloaded some video games: Minecraft, Badland, PBA Bowling, Asphalt 8, The Walking Dead: The Complete First Season, and Sev Zero.  I am not a \"gamer\" but I did buy the Amazon FireTV Game Controller so I could play casually and add social type games that we can play on the TV when friends are over.  The graphics of the games are great and it's nice that they stream...I can just switch between them with a click rather than ejecting a cartridge or CD (as was the case with Nintendo and Xbox).  So, now I can play games with quality graphics without spending $$$ on a game console that is more suited to gamer geeks.  The Walking Dead game is awesome, and I have enjoyed Badland.  Sev Zero looks great but I suck at the shooter games so will need some practice.  But overall, good stuff.VoiceSearch: This was awesome.  Every actors name that I could think of instantly popped up with their portfolio of work when I said their name.  Movies and TV shows worked perfect too.  I did get frustrated when using the remote to locate \"Genres\" so I could watch a documentary but couldn't find it, so I pressed the voice search button and said \"documentaries\" and boom, it pulled up all documentaries from both Amazon Prime and Hulu Plus.  Awesome.Pandora:  I've started listening to Pandora again, the nice thing is the app can play in the background if you do other stuff.  I like TuneIn Radio and haven't got to use it yet but I am glad it's offered.  I also noticed iHeart Radio is offered and a few other music related apps.  Not to mention all of my Amazon music that's loaded to the cloud.HBO GO: I use HBO GO on my Kindle Fire HDX, so I have no reason to believe the app won't be available soon for the FireTV.  If HBO GO (Kindle Tablet Edition) is available on the Fire HDX, then it will be available for FireTV, surely.The overall use is very responsive and quick, like the HDX.  The ability to show your Kindle screen on the TV is great too.  Definitely take advantage of the game controller since this is an added bonus that other streaming boxes don't offer.  I highly recommend this and it is a MUST HAVE FOR PRIME MEMBERS.  Get the most out of your Prime membership!", "verified": true, "helpfulness": "3/3", "author": "My $0.02"}, {"rating": 5.0, "review": "Before I say how I feel about this device I would like to say that I have an XBOX ONE, Playstation4, and a very beefy PC for gaming.I have been nothing but impressed with this device, I originally got the Fire TV as a device to put in my living room to stream media and as a stepping stone for my 5 year old son and my 2 year old daughter into the gaming world but they ended up having to fight me for playing time haha. I downloaded The Walking Dead for my Fire TV and have been blown away by the performance and visuals, yes they are not as good as one of the new consoles or even the last generation console but for $99 it cant be beat. I see a very bright future for this device in the market and unless Apple TV and Roku step it up they have no shot, keep in mind I own a Apple TV and have owned a Roku XD. Strangely enough the only game I have not been impressed by is the one that Amazon released that comes free if you purchase the Fire TV controller I believe its called SEV Zero, in my opinion that game sucks but it has received great reviews so maybe its just not my thing. The one thing that has bothered me but I have only seen it happen in one game is I had to map the controller buttons myself and this happened for Dead Trigger 2 but once I did that everything was fine. I will also say that the Speech feature is great and ridiculously fast, it will find whatever you ask for as long as you are doing the search inside of Amazon almost instantly. As of right now the search feature does not work with other apps like Netflix of HULU and so on.If you are thinking about buying this then buy it you wont be disappointed.", "verified": true, "helpfulness": "4/4", "author": "Carl K."}, {"rating": 5.0, "review": "So easy to set up.  Easy to use.  I have Netflix in the family room already and  wanted something different in my room.  Each product has  some differences in what you can watch.  Glad I got it.  Would recommend.", "verified": true, "helpfulness": "0/0", "author": "fran racin"}, {"rating": 3.0, "review": "I went to Best Buy and spent a good bit of time playing with the demo, and also asking the very cute (female) Amazon rep many questions.  In general, it's a good start for this device, but Amazon has several improvements to make.1.  The main thing is the voice feature, which is supposedly a main hallmark.  Problem is it will only work with Amazon content, and maybe Hulu Plus.  I said \"Gary Busey\", and several of his movies popped up, then there was this option to see content from other sources, but only Hulu Plus showed up.  The rep explained that Amazon will need to work with other providers (Netflix, Crackle) and I guess get permission for the voice to work with their \"apps\".  This is a definite turn off.  Now whether the rep was correct or not, I don't know, but she said she was hired by Amazon to demonstrate the Fire and other devices.2.  The interface is fine, but it's nothing to write home about.  The unit defaults to Amazon content and you have to go to \"Apps\" to see other providers, which that's not the end of the world, but again, it shows it's biased to Amazon.  If you don't have Amazon Prime, well, you have to go to the apps section.3.  I tried the Crackle app, and found that I prefer the Roku interface much more.  Also found out that the Amazon remote's \"return\" or \"back\" button doesn't work with Crackle, so if you're previewing a movie and want to go back one step, it won't do it.4.  As far as aesthetics, the box, well... is a box.  The remote was good size, felt good in the hand, and is aesthetically pleasing.So really, if you buy this device, you need to have Prime.  If I decide to get Prime (for entertainment and shipping), I will most likely buy the Fire, but for now, I'll wait to see if the voice feature is expanded.  After playing with the device for a good while, my final verdict was \"Hmmm, I'll think about it\".", "verified": false, "helpfulness": "0/0", "author": "Chris"}]