[{"rating": 4.0, "review": "I love it. Voice detection is awesome, streaming is not a problems, blazing speed.  It would be a five star if had VUDU to stream.", "verified": true, "helpfulness": "0/0", "author": "Ernesto Cortez"}, {"rating": 5.0, "review": "We purchased this product for a television that the kids use in the basement that does not have cable. It works fantastic and they really are enjoying using it along with the video game controller for games. We were surprised with the features that are able to be accessed with this.  My only complaint is the same I have I with the kindles, which is the parental control features. Our children are 16,11 and 9. Setting up individual profiles or enacting the parental control features significantly limits all access, including access to amazon shopping, which my older kids love to use for perusing clothes, books, etc. We are very cautious about the programming our children watch, but also have boundaries set with them. Ideally it would be nice to be able to restrict content based on the shoes parental ratings. Similar to the apple products.  Overall, this works fantastic and video streams instantly. Thinking of getting the fire stick for our larger living room tv too to access prime movies etc.", "verified": true, "helpfulness": "0/0", "author": "Heather M."}, {"rating": 5.0, "review": "Works like a champ.  Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  Really easy to use and navigate.", "verified": true, "helpfulness": "0/0", "author": "Rogelio Velazquez"}, {"rating": 5.0, "review": "Love this for movies and TV shows.  May reduce my satellite package.  Great for gaming too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works fine.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 3.0, "review": "It's okay, but I can never watch a show all the way through without the little \"spinning arrow\".  Finding programs I want to watch is a challenge- unless I want to pay additional charges! What do we get with Prime? Not much from what I see. it was easy to set up. I'll keep it, but I have to say that it's not the best it can be. Picture and sound quality are good, but constant buffering is annoying.", "verified": true, "helpfulness": "0/0", "author": "A. B. Peters"}, {"rating": 5.0, "review": "It is easy to use and friendly.  Though larger than apple TV it is intuitive and easier to use.  You also get free channels.", "verified": true, "helpfulness": "0/0", "author": "Krishna M Natrajan"}, {"rating": 5.0, "review": "Great for the price", "verified": true, "helpfulness": "0/0", "author": "Keyona"}, {"rating": 5.0, "review": "I love my amazon Fire TV. The remote is a lot more user friendly vs Apple TV. I love the voice feature on the remote as well. The Amazon Fire TV never freezes, never buffers, is fast to load, offers more apps than Apple TV. I like the way the menus are laid out.  I wish amazon prime had a larger selection of free movies andTv shows now that I have them so easily accessible on my TV, I watch more than I did when I was streaming through my apple products! I only use my apple tv for air play", "verified": true, "helpfulness": "0/0", "author": "Michelle Keenan"}]