[{"rating": 3.0, "review": "Google Chromecast works, but it can be frustrating trying to get your computer or smartphone to communicate reliably when you are trying to watch something. Commands sometimes seem to take an eternity to get through from the source to the TV. So say you need to pause for whatever reason, you press pause on the computer...and nothing happens. Press it again, nothing happens. Close out whatever you were watching entirely, and the TV JUST KEEPS GOING. It just doesn't work well. So three stars.", "verified": false, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "I bought this, then subsequently got a Roku, thinking it would offer me \"more.\"  But if you don't need more...  You don't. This gives me all I want at less than half the price.  Do your research; depending on your wants/needs, this product may do the job, with one less remote to clutter your coffee table.", "verified": true, "helpfulness": "2/2", "author": "Redcat"}, {"rating": 1.0, "review": "Useless to play content on Smart TV. The setup was easy but the streaming is so choppy and unwatchable.  Very disappointed. We bought a Roku 3 and the streaming quality is unbelievably great! I dont understand the 5 star reviews. Amazon loses credibility once again.", "verified": true, "helpfulness": "1/4", "author": "Amazonina"}, {"rating": 5.0, "review": "OMG!!! Why can't everything work as simplyand intuitively as Google's Chromecast??SO easy to set up and use with your Chrome browser and all the Chromecast apps.I am ordering one of these for every TV in the house!Thank you, Google!!!", "verified": true, "helpfulness": "0/0", "author": "Susan M Gardner"}, {"rating": 4.0, "review": "works great but no 4.1 sound", "verified": true, "helpfulness": "0/0", "author": "Richard Simpson"}, {"rating": 5.0, "review": "Great product for cast screen but I prefer Roku 3", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 5.0, "review": "Works Great and Good Price!", "verified": true, "helpfulness": "0/0", "author": "Michael F. Griswold"}, {"rating": 5.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "Rigel R. G. \"rigel\""}, {"rating": 4.0, "review": "Three stars seems too harsh, but four stars feels a little generous.The Good:It's cheap. You can stream movies and music to your TV without having to shell out $100 for an Apple TV, or other device.Decent integration. Netflix, ESPN, and others automatically sync to the Chromecast.Plex Media Server - If you have a media collection, you can install Plex, and be able to very easily manage everything and play it directly through the Chromecast easily.The Bad:Whenever I turn on my TV and receiver, it takes anywhere between 1-5 minutes for the Chromecast to actually \"boot\" and start displaying anything on the TV.The connection to the Chromecast occasionally cuts out. This doesn't happen daily, but at least 1-3 times per week. It also sometimes seems to get confused when media is trying to connect to it, requiring you to stop casting, recast, then stop casting again, before the device refreshes and actually lets you stream whatever you had in your app or browser again.Bottom Line:It's an inexpensive device with a few quirks that could use a little bit more polish. The utility it provides, though, is far greater than whatever issues it has, and for $25-35, it works well enough to be worth the purchase. If you have a decent amount of media on your computer, if you watch a lot of Netflix, or ESPN, this is a viable alternative to AppleTV at a much cheaper price. Overall, recommended.", "verified": true, "helpfulness": "0/0", "author": "Henry Mayson"}, {"rating": 2.0, "review": "I was excited about the possibilities of this product but found it very sluggish and too complicated to do simple features.  Back to dragging my HDMI cord from the computer to the TV for better clarity/speed and versatility.  Simple.", "verified": true, "helpfulness": "0/0", "author": "RPCTMC \"caton98\""}]