[{"rating": 1.0, "review": "Yet ANOTHER box, yet another remote that ONLY works with the Fire.  No DLNA, no Vudu.  There is no need for a quad core processor other than using it as marketing propaganda.  If you have Roku, Apple TV, Chromecast, Xbox, PS3 you have no need for this product.  Roku for $49 is a better deal.", "verified": true, "helpfulness": "33/159", "author": "Todd"}, {"rating": 1.0, "review": "Any TV you get these days has some sort of preloaded apps for watching Netflix, etc. Amazon Prime members should get a heavy discount as we already pay $99 a year! I can already access amazon from my TV and watch prime movies and shows, as can most people, so this has no appeal to me especially at $100! I can also stream content straight from my PC to my tv, not sure what amazon is thinking here! It also comes with no HDMI cable and the gaming controller is another $40! Not to mention I have all these games on my phone/tablet that I can HDMI into my TV and play if I'm that desperate.I was hoping it offered a lot more, very disappointed with this.", "verified": false, "helpfulness": "31/154", "author": "OFF2theGYM"}, {"rating": 5.0, "review": "This is the best streaming player I've ever purchased. Sleek and fast.  No issues with this product! The gaming on this is better quality than any of my android devices, plus the fire gaming controller is a great product in conjunction with the Fire TV!  I will purchased one for every TV in my house now that I've had the chance to compare this to my Roku 3 and Apple TV.  Fire has changed the streaming market!", "verified": true, "helpfulness": "12/14", "author": "rrrdddxxx"}, {"rating": 2.0, "review": "Received Fire TV today, really for the Showtime app. Be warned, there are only 6 cable providers that are eligible for this service!!! Charter and WOW!, which I have both, are not included. So if you buy hoping for Showtime, better check what providers are  offered. VERY LIMITED.", "verified": true, "helpfulness": "10/23", "author": "sagetek"}, {"rating": 3.0, "review": "How can you have a new streaming TV box without including HBOGO?  I hope this changes soon as the rest of the features do sound promising.", "verified": false, "helpfulness": "5/32", "author": "N V"}, {"rating": 5.0, "review": "Saw this release and knew I had to have it.  Easy setup out of box, sleek, slim and very well designed, small and solid.  Once connected to the TV, you watch a short intro video and download the latest software updates and you are set.  Instantly connected to my new dual band router and loaded all my Amazon Prime watch lists.  I bought these solely for the speed upgrade compared to the ROKU 2 and wanted to utilize the routers full wireless speed for HD.  I can tell you, this device is lightning fast and I am very pleased, in fact, I bought two of them.  I no longer have to sit and watch my TV say \"loading\", \"loading\", and \"loading\" while I wait around.  If you're looking for speed, this is your device, hands down, worth every penny.There are many negative reviews for this device from Video aficionados, but let's be honest, this is a sub $100.00 HD, High speed wireless, optical ready, simple device that an average person can afford.  You can't compare this device to higher end devices and call things fair.  If you read through the specs BEFORE you buy and run a comparison, it's clear and foretold that HBO Go is NOT supported.  I see many people bought this device, then complained it didn't offer enough apps, when the apps supported were all on Amazons site to read BEFORE you purchase.  So, for those that bought this knowing the limitations, you have no room to complain as you simply didn't ready before you bought.  Not a fair review to state this when it's right on the page.Bottom line:  If you want a small, good looking, simple device that streams HD over dual band wireless with a simple interface and well-designed menu, this is for you.  I will probably buy two more....", "verified": true, "helpfulness": "63/72", "author": "M. T. Clark \"M T C\""}, {"rating": 5.0, "review": "Got mine today at lunch and Amazon notified me with a text that it was delivered (Thanks Amazon). Ran home from work, unboxed, plugged it in, and it worked as advertised. Software upgraded right away (took about 5 minutes) and after that it was up and running. The tutorial video that played on initial setup was really nice. Long enough to tell you the features but not long enough to be annoying.After playing with it for about an hour I am pretty darn impressed. It's fast! The menus are MUCH easier to navigate than my Roku (I have the 2nd gen Roku), the voice search worked really well, and did I mention that it's really fast.I'll mess around with it for the next few weeks and then update my review if need be...however, seems that Amazon nailed this one.**UPDATE**After using my Kindle Fire TV for a couple of weeks now my 5 star review stands. It's great. It's fast, the voice search works really well, and the menus are well thought out and easy to navigate. ALSO, for all the detractors claiming that \"Without HBO GO this is worthless\"...Amazon just signed a huge multi-year deal with HBO. A TON of HBO original content will be coming to Prime and therefore you can watch it for free with a Prime membership and not need a cable provider. This deal also states that the HBO GO App will be available on the Kindle Fire TV by the end of this year. So with a cable provider you'll be able to watch all of the newest shows. Boom. Buy one, you won't regret it.", "verified": true, "helpfulness": "24/28", "author": "Amazon Customer \"Coleman\""}, {"rating": 5.0, "review": "My First Week with the FIRE TVThe Fire TV is the biggest in terms of real estate but has the lowest profile compared to AppleTV and Roku.  FireTV can play my big three, namely, Netflix, Amazon Video and YouTube.  This is the reason why I have Rokus and AppleTVs because my older Rokus (XD & Lite) doesn't have YouTube and AppleTV doesn't have Amazon Video (although recently you can now Airplay Amazon to AppleTV).As a gaming console:Of all the three, the FireTV has the biggest potential to grab a bigger bite off the gaming consoles' meal (Although AppleTV can easily do this with an update with their vast library of apps and games in the iTunes Appstore).  Roku is more of a dedicated movie player setup box as they don't have their own app store.Remote control:What's not to love with the Fire TV's remote control.  Roku's remote is a bit confusing compared to AppleTV's minimalistic aluminum stick.  The Fire TV's remote is the clear winner here.  The center wheel doesn't have any arrows but you know instinctively when to go up or down, left or right.  I hate AppleTV's wheel as it too small and difficult to use specially if you have a large thumb.  You can even point on the opposite direction and the box will respond.Voice Search:It works!  It is nice that Amazon didn't load it with too much AI - no Siri here.  It is just plain voice search.  Even Ozzy Osborne can use it.  Now he can have a remote control that can understand him without becoming paranoid.  It works by pressing and holding the microphone button on top of the remote while you speak, when you release it starts to process it.  Almost instant you get an answer.Games:No Angry Birds - wait that is ancient!  You can load it up with Pocket Minecraft (6.99$), Sonic, Rayman, and more.  As of now there is not a lot in the selection I see and most of them needs the 40$ Xbox type controller.  Check out \"Badlands\", it is a great game for the FireTV using the FireTV remote.Game controller:If you purchase the FireTV game controller, you also get the multiplier  tower defense game Sev Zero for free, which is not a shoddy game at all.  You also get 1,000 free coins that you can use to buy apps and games at the appstore.Speed:No question, it is as smooth as butter.  It is one speedy box.  If you press and hold, it scrolls down, up, forward in one swift motion.  The way it handles the resolution is like Roku, it plays almost immediately beginning with a low res picture and gradually stepping up to high def as it buffers up.Photos:I downloaded Amazon Cloud Drive Photos from iTunes for iPhone which includes a free 5 Gig space.  After uploading the photos, it is ready to be viewed on the FireTV.  It includes a slideshow feature using Ken Burns.  I noticed it cuts a lot around the pics when it does the Ken Burns slideshow.  You have an option to use your own pics for the screensaver.What is not in the box:The Fire TV is shipped without an HDMI cable so make sure to order one if you don't have any spare.  A game controller is also a separate purchase if you want to take advantage of the setup box's game feature.Quick specs compared:Fire TV- Voice search on remote- Quad-core- MIMO- 2 Gig memoryAppleTV- No voice search- Single-core- Dual band- 512 MB memoryRoku 3- No voice search but has an audio out- Dual-core- MIMO- 512 MB memoryCons:- I don't subscribe to HBO but I know it is a deal breaker to many.- Optical output only for audio.  I connect my Roku (older models have a 3.5mm audio out) to a projector and home theater speaker system (without an optical input).  At least even the Roku 3 has a stereo output on the remote itself that I can connect to a portable speaker.  The FireTV will need an adapter if you don't have optical input on your speakers.- Voice search only works on Amazon's own content line-up.  Will not include Netflix, Hulu, etc.", "verified": true, "helpfulness": "75/86", "author": "Nuknuk"}, {"rating": 3.0, "review": "I was very interested in purchasing the Amazon Fire TV until I called Amazon to find out how many Apps the Voice Control worked with. Their answer: Amazon only. That's only one of all the Apps listed. The description gives the impression that it works with all of them. I think I'll wait until they figure out how to make it work with the others. When they figure that out, I'll definitely buy one - maybe two.", "verified": true, "helpfulness": "3/18", "author": "FREDERICK WINE"}, {"rating": 4.0, "review": "Having received my Fire TV today, I've been trying it out for the past couple of hours.Setup was a no brainer. It required an update immediately so it did take about 15 minutes to have it in action but the process was very simple.The image quality (movies and games) is excellent. I've tried several movies from Amazon Prime and they look and sound nearly Blu Ray quality as far as I can tell.Navigation is very straightforward and it's generally easy to find anything you're looking for. Installation of games and apps goes very smoothly and generally pretty quickly.The remote works very well. I haven't played with the voice search feature much yet, but when I have tried it, it worked well. The buttons on the remote are well thought out and I prefer it to the Apple TV remote.I only have one gripe. As far as I can tell, there's no way to limit the list of movies and tv shows to what is available for Amazon Prime members. This makes it very inconvenient to find things that are free to watch. There are some categories that are limited to Prime (Most Popular on Prime, For Kids on Prime) I want to be able to just see what's available for Prime or at least be able to see by category what's available for Prime. I'm sure this isn't an oversight. I suspect Amazon wants to force us to look at everything and be tempted to buy/rent things but if they really want to compete with Netflix, they'll understand that we pay for our Prime membership to be able to watch free movies conveniently. A workaround is to do your searching on the web and then search specifically on the device.Perhaps I just haven't found the way to search for Prime available content. I hope that's the case or I will really be disappointed.Update 7/21/2014:The latest software upgrade as significantly improved the device for Amazon Prime members - addressing most of my original complaints.Now that there is an entire section dedicated to Prime content, it is much easier to find things without having to wade through pay to view content. I wouldn't mind seeing more 'categories' to search through, but don't want to diminish the improvement.It's still not possible to search and return only Prime content. I think it should be possible to tell the device (when you search) that you only want returns from what is available for free to Prime members.The new 'Music' option looks intriguing but seems to have no purpose at this point. Not sure why it was added, but I hope it grows into a useful feature given the new Prime Music package.I would also like to see some sort of DLNA feature added. As one who rips all content that I buy (blu rays, dvds, cds) to a computer on my Network, I would very much like to be able to stream this material to the FireTV. Adding support for a connected USB device is not a solution for me. I have no intention of keeping two copies of all this material.", "verified": true, "helpfulness": "7/319", "author": "Gregory P. Baker"}]