[{"rating": 5.0, "review": "I own or have owned a lot of streaming devices that have come out and this one has some great potential to be one of the best streaming boxes out there!  I have a Roku 3 and a jail-broken Apple TV (2nd gen) and thought that nothing would get me to switch over from the Apple TV, well so far the Apple TV is sitting disconnected on a shelf.  The UI is not as easy to navigate as the Apple TV, but it is a lot nicer looking than the Roku 3 UI.  My wife has had no issues with getting to the right location for the movies for our daughter, then it is really very easy.  The response of the system is so fast, no lag at all and the voice search is nice if you are looking for a movie or show that is on Amazon's service.  I see a lot of the negative reviews about not being able to play local media with the Fire TV.  I have a Plex server set up and purchased the Plex app from the Amazon App Store and stream my movies right across with no issues, so now I have Amazon Prime, Netflix and my local media all on one device.  Yes, I know the Roku 3 could do this, but my wife hates that UI, she is starting to like the Fire TV's UI.  I have had only one issue with my system and that was the voice search would not work on it after a couple of days, called tech support as I had done all of the unplug it and wait for 1 minute reboots and every other trick that I could and thought that I had a defective remote or unit.  The tech support had me pull the batteries from the remote and it fired right back up without any issues and the next day the system told me that the batteries needed to be replaced, so I guess that I got a bad set of batteries with my unit.  So far I really like this set top box!", "verified": true, "helpfulness": "2/2", "author": "Sivart"}, {"rating": 5.0, "review": "Provides a very fast stable PLEX Media Client for streaming media from a PLEX Server. The unit will turn on the TV to the correct input (using HDMI CEC).As an added bonus the box supports Netflix, Hulu, Amazon Prime Video (obviously), I have heard Amazon is working to bring HBO GO to the box.I would highly recommend this box to any cordcutter, especially if you use PLEX.", "verified": true, "helpfulness": "4/6", "author": "kspahr"}, {"rating": 5.0, "review": "I gave this five stars because I was impressed by the speed of the menus, the voice search, and the ability for games on it.I had the Apple TV for almost 2 years just for Netflix and stuff and my main problem with it was it's horrible slowness and the ugliness of the menu's. Amazon's Fire TV does a great job with these things.The Controller: Apple TV's tiny and flimsy controller (which had those horribly annoying button batteries) always annoyed me. Fire TV's remote is a remote I can actually hold in my hand and takes batteries I actually have in my house.Lastly, the selling point for me was the ability to have games on it especially Sonic (one of my favorites from when I was a kid).For $99, it's not a bad system at all and beats it's competitors in all ways.", "verified": true, "helpfulness": "4/5", "author": "Jimmy"}, {"rating": 3.0, "review": "I am not great with tech. So if this question sounds stupid, I'm sorry.If I have fire TV do I still need DIRECTV? Can I still have DirecTV or do I just use fire TV for all the TV I need?Thanks.", "verified": false, "helpfulness": "0/23", "author": "SALLIEB"}, {"rating": 4.0, "review": "I can't yet give it five stars, but already love everything that this system can do.  Voice search is great (but still needs to work for all apps) and the sound/video quality is excellent.  I've got a roku, multiple Xbox and PCs for use with my various TVs and I already find myself gravitating to using the Amazon Fire TV because of how well it works.Wish list for me to give it five stars includes1. Voice search for all apps2. Android app for controlling Fire TV3. DLNA support4. More app/game selection5. Amazon MP3 integration (both on Fire TV and control from Amazon MP3 app on android)", "verified": true, "helpfulness": "3/3", "author": "camper 2"}, {"rating": 4.0, "review": "The software update took 4 tries with unplugging, re-plugging, going through the menu to finally start downloading, which took about an hour.  I checked my connection speed and the problem was with Amazon, not my high speed internet.  I used the voice search for a movie and it responded accurately right away-but when I showed the function to my husband, after several tries and several bizarre responses to the same movie title request, I gave up and used the manual controls.  I started the movie for him and had another problem with a slow connection on Amazon's end.  I've encountered this from time to time on my Kindle, have checked online and see that Amazon has been having some issues with slow connections.  Theirs is also the only page that has also been loading very slowly on my computer today.  Once I finally got a decent connection from them, the movie played with no problems.  The remote is easy to use and small, as is the main box.  Connecting to the TV set was easy as was plugging in the FireTV box.  It would be nice if Amazon included the high-speed HDMI cable with the purchase but it was cheap and easy to find on their web page.", "verified": true, "helpfulness": "3/3", "author": "H. Johnson"}, {"rating": 5.0, "review": "Was in the market for a streaming device. Reluctant initially when there are cheaper dongle versions available.So far, I am very happy with the purchase.  Kids had a blast playing with Riptide game.  They deprived me much time over the weekend to experiment with the device.  Will keep updating this review as I spend more time with Amazon Fire TVPros:  Love the bluetooth connectivity. It is nicely hidden behind the wall mounted TV.  hint: duck tape :)  This is not just a streaming device, but also a gaming console.  As an occasional gamer, I am hoping this box is sufficient to scratch my gaming itchCons:  None yet.", "verified": true, "helpfulness": "3/3", "author": "Silva"}, {"rating": 5.0, "review": "hi theredid it have some language in this tv box some Japaneses Arabic France chines etc.thanks for all", "verified": false, "helpfulness": "0/10", "author": "Haidar H. Alwan"}, {"rating": 3.0, "review": "I was so excited!  The way that its described I thought for sure it would be just as good or better than my Roku 2, boy was I sadly mistaken.  I cant get the WWE NETWORK and that is an app I pay for monthly so that is a must have.  When I first plugged it in it was making strange static noises on my tv, but then straightened out when the menu came up.  That is really my only problem with it.  The voice search was pretty cool, and I had no problem with Hulu and Netflix, but if they do not pick up WWE I am returning this.", "verified": true, "helpfulness": "3/16", "author": "italy61901"}, {"rating": 5.0, "review": "My Amazon Fire TV is... amazing.  Extremely fast and the voice recognition is superb.  Only once has it failed to recognize a verbal request.  No more hunting and pecking for letters a la Apple TV.  And much, much faster in the processing.  Very pleased. So pleased, in fact, that I just bought another one for my brother for his birthday.", "verified": true, "helpfulness": "5/6", "author": "BillG"}]