[{"rating": 5.0, "review": "An absolute gem of a device! Transformative in my household and one step closer to shedding the shackles of my overlord Comcast", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 3.0, "review": "Having a hard time linking it to my router.", "verified": true, "helpfulness": "0/0", "author": "Shane M."}, {"rating": 4.0, "review": "Such a great product. Very easy to setup and easy to use. Lots of options to cast content from to Chromecast. I hear the Wifi is a bit picky but I have it inches form the Wifi router and it works like a charm. On a dual antenna 150mbps each, I can cast content from my Plex server via Wifi to Chromecast which also obviously connected via wifi.I use my Chromecast connected to a power outlet and not powered by my TV. The amount of energy it consumes is low enough to keep it always on. Plus when powered using the power supply the chances of unexpected behavior, like wifi not strong enough while playing video etc, is lower.I have one major complaint though. If I watch high quality videos for a long time, the Chromecast overheats and freezes. The solution is to power cycle it and give it a few minutes to cooldown.", "verified": true, "helpfulness": "0/0", "author": "aaridici \"Arda\""}, {"rating": 5.0, "review": "Fine idea, fine execution", "verified": true, "helpfulness": "1/1", "author": "mmddyyyy"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "iftihal mahfaud,iftihal mahfaud,iftihal mahfaud,if"}, {"rating": 4.0, "review": "I love my chrome cast, granted there are areas where there can be some improvements made, such as the lag with the screen casting, but aside from that, I use mine regularly....works as it should, so I'm good....", "verified": true, "helpfulness": "0/0", "author": "Yvonne"}, {"rating": 2.0, "review": "Great when it works, but much of the time it is not detected on my mobile phone.  Casting from desktop is more reliable.", "verified": true, "helpfulness": "0/0", "author": "C. Ngo \"NomadSoul\""}, {"rating": 5.0, "review": "Absolutely Love Chromecast or this wouldn't have been the third one I've purchased. With the price being so reasonable having one in each tv is a necessity!", "verified": true, "helpfulness": "0/0", "author": "Thomas sullivan"}, {"rating": 3.0, "review": "I have a FireTV Stick and Dellcast along with this.  The Chromecast is the wierdest one to use, hardest to set up and just in general do stuff.", "verified": true, "helpfulness": "0/0", "author": "Posterchild63"}, {"rating": 5.0, "review": "Gets the job done and makes life easier. Purchased 2 of these for each TV in my home. Highly recommend making the leap!", "verified": true, "helpfulness": "0/0", "author": "Tranquil"}]