[{"rating": 3.0, "review": "its a great product but hate the delay when you use the extension to connect to the tv.. its frustrating", "verified": true, "helpfulness": "0/0", "author": "edwin w waldron"}, {"rating": 4.0, "review": "Again, works great with natve apps (hulu +, HBOGO, Netflix and YouTube.  Tried casting Amazon videos from my Mac and they come out jerky.  Hope this can be resolved at some point. I assume more native sources are coming????", "verified": false, "helpfulness": "1/1", "author": "stephanie matamoros"}, {"rating": 5.0, "review": "This is a fantastic device! Great bargain. Easy to use. Compact, unobtrusive. I would definitely recommend this for anyone to purchase.", "verified": true, "helpfulness": "0/0", "author": "D. Torgersen"}, {"rating": 4.0, "review": "It adapts videos to the internet speed. It always try to show the best resolution. But it still needs an app to watch your personal files (videos, pictures). It practically works only with youtube and some other not so good. And the best are not free.", "verified": true, "helpfulness": "0/0", "author": "astrodarwin"}, {"rating": 5.0, "review": "This item was a gift for my boyfriend and he loves it. Great for watching movies together with our family. Well packaging and it arrived on time.", "verified": true, "helpfulness": "0/0", "author": "MARIAN I CORTES LOPE"}, {"rating": 5.0, "review": "Works great. This is the 2nd one I have purchased. Simple to set up. seamless video transition from phone to tv. love it.", "verified": true, "helpfulness": "0/0", "author": "ctleslie"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player worked well with cell phone, tablet and laptop. I am highly recommended.  easy to setup too.", "verified": true, "helpfulness": "0/0", "author": "Shirley D Kao"}, {"rating": 4.0, "review": "The Chromecast streams well, crisply and clearly.  It warms up pretty quickly, but similarly cools down quickly - not sure what effect that would have on its longevity.Currently just using it for chrome tab casting and YouTube casting on mobile.  Hopefully they'll come out with the SDK soon, so that, say, VLC incorporates the casting into their streaming capability.", "verified": true, "helpfulness": "0/0", "author": "Michael Daniel Samson"}, {"rating": 4.0, "review": "I WAS VERY PLEASE THANKS LA LA LA LA LA LA LA LARoll over image to zoom inGoogle Chromecast HDMI Streaming Media Playerby Google", "verified": true, "helpfulness": "0/0", "author": "Norma  Cruz"}, {"rating": 5.0, "review": "simple install,, plugged into hdmi & powered from tv,, downloaded software, joined netflix and all worked great !!,, ordered same for my daughters family & my 11 year old grand daughter installed it from packaged instructions.", "verified": true, "helpfulness": "0/0", "author": "fishman*thomas"}]