[{"rating": 5.0, "review": "It came in  a box. I opened it. I connected it to my television and it worked just fine with out any problems at all. I enjoy the voice feature and the speed of this little box of surprises which I watch very often. I ask for the actor or the name of the film that I can't find and it  gets it all the time right with the voice feature. The speed with this box is amazing for the price. This is quality at its finest when it comes to this product.", "verified": true, "helpfulness": "0/0", "author": "Eddie"}, {"rating": 5.0, "review": "Really enjoying Fire TV. Easy to set up and easier to use. Works great! Small enough to conceal behind wall mounted TV and remote works awesome without typical line of sight restrictions.", "verified": true, "helpfulness": "0/0", "author": "John C. Wilt"}, {"rating": 3.0, "review": "I got this thing today and set it all up. First of all, the apps are not all available for some reason and some failed to even download. the interface is o.k., but I think Amazon needs to do a little more homework on this. I also have Apple tv and Roku 3. Roku wins hands down..", "verified": true, "helpfulness": "0/3", "author": "Rob"}, {"rating": 5.0, "review": "Amazon Fire offers great streaming experience from Amazon Prime, very good voice recognition, and slick hardware. The user interface is very nice and the remote too. Streaming is uninterrupted and smooth with HD. The technology offered in Fire offers excellent value for the price, and is quite impressive. Really good product technology wise.", "verified": true, "helpfulness": "0/0", "author": "Dan & Tal"}, {"rating": 2.0, "review": "While I like the Amazon Fire TV, PLEASE AMAZON GIVE US A SOFTWARE FIX TO TURN THIS BOX OFF!!!!!  It does not turn off on its own. I have to continually go to it after it has stayed on all day and finally unplug it. Please fix it!", "verified": true, "helpfulness": "0/2", "author": "bmbutler \"bmbutler\""}, {"rating": 4.0, "review": "Easy set up. Still learning and exploring what i can do with Fire TV. Very happy so far. May look into buying one of the manuals/ books being sold to get the most from the Fire TV", "verified": true, "helpfulness": "0/0", "author": "randall osburn"}, {"rating": 1.0, "review": "not a fan first of all it shows all kinds of apps you can get but what they don't tell u is most of them don't work without cable!!! and it is constantly going out!!!!! so basically I paid over 100.00 for nothing very unhappy with this product!!!!", "verified": true, "helpfulness": "3/13", "author": "melissa ireton"}, {"rating": 5.0, "review": "I didn't think it would be better than Apple TV, but it is.  Nicely built and screams quality.  I might get another one for my bedroom since the wifi works excellent and fast.", "verified": true, "helpfulness": "0/0", "author": "S. Rupp \"InnoFish\""}, {"rating": 4.0, "review": "Love it.... Easy to set up and it's perfect for Netflix!!! The only problem I have is that it Doesn't have a lot of good tv watchin apps...like the cw, nbc and cbs.... Waitin for Hulu and Netflix the put the new shows on is a little annoying... Can you guys please get more apps!!", "verified": false, "helpfulness": "0/2", "author": "Edward"}, {"rating": 1.0, "review": "THIS ONE ONLY LASTED A MONTH!!!!! THE SECOND IS STILL WORKING , BUT I GOT A 2 YEAR WARRENTY. I ALSO BOUGHT A 3RD ONE FOR BACK UP. I WOULD LIKE TO REPLACE THIS 1ST ONE AND REPLACE IT. I ONLY USE AMAZON FIRE!", "verified": true, "helpfulness": "1/16", "author": "CRCV"}]