[{"rating": 2.0, "review": "This is near useless. I do not like wires showing so I gave it a try. I could only stream from Google Chrome, so there was little point to using it. I went back to a wire after using this product. Nice idea but they limited themselves unnecessarily.", "verified": true, "helpfulness": "1/1", "author": "TruRev"}, {"rating": 5.0, "review": "I am glad that this item came along when it did, gave me freedom from wires and other hookups. Now just look for the Chromecast box and watch to your hearts content..", "verified": true, "helpfulness": "0/0", "author": "Greg Martin"}, {"rating": 3.0, "review": "More formats than youtube are wished (as media players, text pages, games demonstration from PC).Where can I find info about next generations of ChromeCast?", "verified": true, "helpfulness": "0/0", "author": "Vitaly Barsky"}, {"rating": 5.0, "review": "Easy to setup, works as advertized. Hulu & YouTube work great. I'm hoping they'll release more apps that work with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Neil Moreton"}, {"rating": 4.0, "review": "I am a college professor, and I bought this for one primary purpose: to cast presentations on my Chromebook to a classroom projector. And for that, it works quite well. (I can't guarantee it will work with all projector systems, but it works well with mine.) Of course, I also use my Chromecast with increasing frequency to stream video to my tv with Netflix, Youtube, and, yes, even Amazon Prime (through my web browser). Set up is incredibly easy, the device is small and portable, and it is a great way to increase the capability of your tv.BUT, there are some limitations that potential customers need to be aware of (ones that I wish I knew before getting the device).-- First, the device cannot recognize more than one wi-fi network. That means that if you go to a friend's house to use your Chromecast (or in my case, go from using it at home to using it at work), you will have to physically reset the device each time you change networks. Not a huge deal - just a matter of pressing a button down and going through a few minute set-up process. But it is at least a bit of a pain.-- Second, as a frequent traveler, I was excited to use this at hotels. Problem is that Chromecast cannot access the kind of wi-fi most hotels use (the kind where you log in through a \"Welcome\" screen). To use Chromecast in a hotel, you basically lhave to find another wi-fi source besides the hotel's (i.e., a phone hot-spot).Third, depending on your internet speed (mine is relatively slow to average) , you might have to trade-off between choppy video playback and lower quality resolution. That is, the Chromecast allows you to choose what resolution (great, good, medium) you want for video playback, and the lower your resolution, the less choppy the streaming. So, it may well be a trade-off.Honestly, none of these problems are huge problems, which is why I still give the device four stars. The first two have workarounds, and the third is tolerable. And considering all that this small and inexpensive device allows you to do, I think the benefits outweigh the limitations.", "verified": false, "helpfulness": "2/2", "author": "Kevin Currie-Knight"}, {"rating": 4.0, "review": "Love the idea of broadcasting Youtube to my not smart tv, but i have some problems trying to connect with my ihpone or ipad, had to look on internet for the fix but Still have to set it up as New all the time... Maybe is my router", "verified": true, "helpfulness": "0/0", "author": "JLAEC"}, {"rating": 3.0, "review": "I bought this to cast from an ipad which doesn't work. I have it three stars bc when it works with my PC then it's ok but that varies too.", "verified": true, "helpfulness": "0/0", "author": "Willis E Weirich"}, {"rating": 5.0, "review": "Works well bringing online content to the television. More choices than ever. Easy to use and to set up. More apps please.", "verified": true, "helpfulness": "0/0", "author": "James M. Williams"}, {"rating": 4.0, "review": "Love this but my only complaint is that when I try to watch netflix or Hulu it won't keep playing the next episodes. I have to select it each time. Overall very satisfied with my purchase and like the convenience of being able to move it from room to room with no problems.", "verified": true, "helpfulness": "0/0", "author": "Ashley Lang"}, {"rating": 4.0, "review": "This is my second, and i really do like them. Yes you need to use the plug, but for the time for setup and the cost it really cant be beat. The reason i only gave 4 stars is the lack of Amazon support on the device. I understand Google wants to keep a competitor off the device, but if Google play is so much better, why not push innovation and invite all parties to the game ?", "verified": true, "helpfulness": "0/0", "author": "Drew G"}]