[{"rating": 5.0, "review": "So far, I really like this device. I already have two Roku's and I like them fine too, but the verbal search on this is much nicer, plus the price is the same. I also git an additional year added to my Prime for purchasing. The Fire TV seems to have many more options. I am still in the experimental stage, so I will update as needed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have been an Apple TV user for two years now and the thing I hate the most about the Apple TV is the stupid remote! We wanted a third Apple TV for our guest house but I had also been looking at the Fire TV as an option to try after buying a Samsung Note three and loving android. I went for the Amazon Fire TV when it went on sale for around $80.00 I figured why not give it a try. Set up was so easy an old person could do it. (Saying a child could do it doesn't work since they figure everything out faster than us older folks) Once it was up and running and I had downloaded the apps I wanted like Netflix and Youtube. I went and played around. The first thing I noticed is that I love the remote! It's not stupid and small like the Apple remote. It has a home button, Apple doesn't. So if you want to go to the home screen on the apple TV from Netflix you literally have go back through everything you clicked on. You don't have to point the Fire TV remote at the little box like you do with the apple and I really like that. So far the Fire remote is way better than the Apple remote.  Now I do have two complaints with the Fire TV. First, Amazon didn't separate the free shows from the ones you have to pay for. I don't feel like sifting through show after show looking for one that interests me and that I don't have to pay for. Because of this I only use the Fire TV for Netflix. My second complaint is the big one. The buffering doesn't work all that well. I am stationed overseas and have to use a VPN to access American stuff like Netflix. The VPN does slow down my internet speed but the Apple doesn't have a problem with it. It sometimes takes a while to load but then it's good to go. THe Fire TV starts sooner but then skips and the sound cuts out. It doesn't always do this but it does it often enough to be annoying.  I love the Fire TV's remote enough to tolerate some periodic buffering problems.This is an update. After talking with Amazon about my issues with the Fire TV, they recommended that I clear the application history. I also discovered that the HDMI cable I was using was defective. After changing the HDMI cable and clearing the app history our Fire TV is working great! It is faster than our Apple TV and I still prefer the Fire remote over the Apple remote by a mile!  We are now contemplating buying another Fire TV for our bedroom.I will say the common complaint about Amazon mixing the free content in with the pay content is annoying. The alternative is to use the Apple TV and then you know you have to pay for it all. I changed my star rating of the Fire TV  from four to five stars.", "verified": true, "helpfulness": "2/2", "author": "aaron keller garrett"}, {"rating": 5.0, "review": "I have a very capable receiver (Denon 5800), but it is old (circa 2001) and does not have HDMI connections. My television has a VUDU app and an optical audio out that allows audio pass through for Dolby Digital Plus, but the VUDU app does not support captions. My Roku 3 supports captions, but does not allow audio pass through without HDMI, making the old Pro Logic the best I can get with that device without buying a new receiver. Amazon Fire TV to the rescue: HD 1080p video via HDMI connection to the television; Dolby Digital Plus surround via optical audio connection to the receiver; captions that are size and style adjustable. Fire TV thus extends the usefulness of my receiver (170 watts per channel to all 7 channels) by at least a decade.Amazon customer reviews are a good source for helping one make up his/her mind, but the best information on Fire TV is Amazon's own advertising on the product page, which is factual without exaggeration. I'm a happy customer.", "verified": true, "helpfulness": "1/1", "author": "Larry A. Deforest \"Larryde\""}, {"rating": 5.0, "review": "As a retired Broadcast Engineer, I have owned this streaming device for a few months now. It replaced the outdated 2nd generation Apple TV device. Their is simply NO comparison between the two. Amazon Fire TV also puts Roko to shame. In addition to extremely fast movie load times, the optical out provides enhanced 5.1 Dolby Digital audio over the Apple optical output.If you own a new not so Smart TV that only provides stereo audio to the small built in speakers, (forget the home theatre experience!), this Amazon Fire TV makes watching movies way better than going to ANY movie theatre. My only regret is not buying it sooner!", "verified": true, "helpfulness": "0/0", "author": "Frank D"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "rodney"}, {"rating": 4.0, "review": "Was told this came with 1 year amazon prime. Since I am already a prime member, I was thinking they would extend it when my current membership ended. Customer service just informed me I would have to pay again then apply for a refund. Kinda a hassel. Seems like it would be simpler to just automatically extend it. Love the fire tv.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super good integration with Amazon content. So easy to view photos stored in Amazon. So easy to find Amazon tv and movies. And oh.. so FAST! I am watching more and more Amazon tv now...", "verified": true, "helpfulness": "0/0", "author": "Hoho"}, {"rating": 5.0, "review": "Easy install, easy operation. LOTS of free movies with Amazon Prime!Just be sure you have a fast, reliable internet connection.", "verified": true, "helpfulness": "0/0", "author": "John Chester"}, {"rating": 4.0, "review": "Love the interface but eats data plans like a hungry lion! Takes several, many times, more data Gbs even to watch Hulu or Netflix through it than through my Apple TV. Nasty emails from Cox cable cartel about data overages. Amazon says they do not have a fix yet. It streams everything, including Hulu and Netflix at the highest possible rate with no control like you can at Hulu and Netflix to save data.", "verified": true, "helpfulness": "0/0", "author": "Gerald Naekel"}, {"rating": 5.0, "review": "What an awesome device. I'm a busy person who loves to watch what I want, when I want. Amazon Fire is amazing. The set up is a breeze. The introduction was informative and its pretty easy to use. I love that my account was already hooked up. I don't know what I was doing before I had this. Way to go guys!!", "verified": true, "helpfulness": "0/0", "author": "Alexis"}]