[{"rating": 4.0, "review": "We bought one to see how it compared to our old Roku2. Streams load faster and don't seem to require the \"warmup\" period we experienced on the Roku where it took a bit for the streams to clear up and and display at full resolution. It's faster. The UI could use a bit of streamlining, but it's really pretty simple to use. Plus, we're able to get stable streams via WiFi, whereas with the Roku we needed to bypass wireless and go with an Ethernet connection. All in all I like it.My complaint has to do with Ultraviolet support. Because of the ability to convert old DVDs and Blu-Rays to HD online versions, we've converted most of our discs to Ultraviolet. We'd watch them on our Roku using the Vudu app, and they looked and sounded great, and it was really convenient.Unfortunately, the Flixster app on the Fire TV won't play in HD, and that's proving to be a real source of frustration. I contacted Flixster, and they said that ability might come in the future, but there doesn't seem to be a good idea about when. I'd appreciate it if Amazon would make this a priority.", "verified": true, "helpfulness": "0/2", "author": "Solkar"}, {"rating": 4.0, "review": "A really great product. Just wish there were more of the recent movies and tv shows available on Prime. Great in every other way!", "verified": true, "helpfulness": "0/0", "author": "Stephan"}, {"rating": 4.0, "review": "WonderfulSlim, Fast, voice search, expandable with Android apps (like airtight to make airplay target, xbmc to make it full media center), remote control, games.AwfulNetwork disconnects, if you have parental control checked and network disconnects you are locked as setting up network requires parental control, which itself requires network connectivity, usb can not be used for external storage, OOB experience is bad as it requires a full update, no power off so sometimes amazon firetv wakes up in the middle of night and because of hdmi CEC switches the LED tv.Still 4 star as it's all in one (netflix, huluplus, airplay target, games, xbmc) and has bluetooth remote so I can hide the console inside a cabin.", "verified": true, "helpfulness": "1/1", "author": "Nugeek"}, {"rating": 5.0, "review": "I currently have in my house:1) XBOX 3602) ChromecastAnd now -- Amazon Fire TVThis allows me to have streaming capability in three (3) rooms in my house and also to compare each device.1) Xbox -- have had for quite awhile and enjoy using it as it is very easy to use -- allows me to stream Amazon Prime and Netflix -- and also play games.2) Chromecast -- very inexpensive device that allows me to control it through my smartphone. Allows me to stream Netflix -- but not Amazon Prime.3) Amazon Fire TV -- absolutely love this device -- quick and easy to setup and unless I am just imagining it -- it works ALOT faster than my other devices. Netflix seems to load faster and quality \"seems\" better -- but again maybe I am just imagining it? Regardless, the Amazon Fire device definitely moves faster in terms of start-up and navigation throughout. Finally, the voice search feature is AWESOME -- it is very cool to be able to say \"Robert DeNiro\" and then have everything he has ever been in pop-up on-screen!", "verified": true, "helpfulness": "1/2", "author": "Charlieb909"}, {"rating": 4.0, "review": "Simple set up and first operation.intuitive controls.Good selection of Amazon Prime movies and Netflix series.Would be nice if it would link to HBO 2 GO", "verified": true, "helpfulness": "0/0", "author": "John H."}, {"rating": 5.0, "review": "Finally someone has designed a streaming system with me on mind. No letter by letter spelling. No jumping between screens.  I say the name of a movie, a TV series, an actor and my choices pop up INSTANTLY!  Amazon you did it right.  Thanks.", "verified": true, "helpfulness": "1/1", "author": "John R McNown"}, {"rating": 4.0, "review": "I'm a big fan of Amazon. When Fire T.V. came out I bought one on the day it came out. I wanted to see if it was as good if not better than my beloved Roku's (I currently own 4 of them). Fire T.V. has some nice features that I like such as: voice search (however, it's limited to amazon content only), parental controls, it's fast and my kids love the gaming features.The biggest issue I have is with the interface. It not very well organized. Searching through Amazon content alone is tedious, even more so if it's not Amazon content. I prefer Amazon's app on Roku. Just my opinion, but I feel it's a lot more organized and easier to search. I don't always have something in mind I'm looking for, so the voice feature on the Fire T.V. doesn't help me much in that respect. I want an easier way to browse ALL the prime content, just to see if there's something on there I want to watch. It's something I can do on the Roku, but not the Fire T.V.  Lastly, I buy all my digital movies from Amazon Video. I currently own over 80 digital movies. I was really surprised (and disappointed) that Amazon didn't incorporate the special deals feature from their app on Roku to the Fire T.V. I frequently browse and purchase from there.Overall I'm happy with my purchase, though I still prefer my Roku to the Fire T.V. My kids certainly love the Fire T.V for it's voice search and games, and that's important to me and my wallet! While I think the interface needs better organization for content (everything else is superb), I'm confident Amazon will get that worked out.", "verified": true, "helpfulness": "6/6", "author": "Tj Hack"}, {"rating": 5.0, "review": "Easy to setup and use.  Very strong wifi reception-even picks up neighbors signal who lives a good 100 yards from me.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "I use this as my primary media streamer now (was using jailbroken apple tv) easily runs Plex and has great user interface. I tried all the other streamers (Boxee Box, Roku - all versions, WD, Chromecast) and what I found I liked the most was the 'Ken Burns' effect on the apple tv screen saver. None of the others had a good implementation of it but the Amazon Fire TV does. Its now my media streamer and I am free of the apple bondage.", "verified": true, "helpfulness": "0/0", "author": "John Ramsey"}, {"rating": 5.0, "review": "It's everything promised and more.  I am really impressed with the way the voice search works.  I've never used anything better.  Order one, you'll love it!", "verified": true, "helpfulness": "0/0", "author": "Native Daughter"}]