[{"rating": 5.0, "review": "very happy use it all the time recommend it to people who wants to see the movies using there ipad and stuff", "verified": true, "helpfulness": "0/0", "author": "veronica amezcua"}, {"rating": 5.0, "review": "I love this product, it makes not having a smart TV tolerable. This product works exactly as as described. Thanks!", "verified": true, "helpfulness": "0/0", "author": "amazongod"}, {"rating": 5.0, "review": "I love Chromecast, it makes it easy to watch or even read things on your television and its much cheaper than the alternatives.", "verified": true, "helpfulness": "0/0", "author": "SG"}, {"rating": 5.0, "review": "What a magnificent piece of technology, easy setup, works with my samsung gs3, my nexus 7 and my desktop pc, can finally use hbo go on my tv! netflix, hulu, youtube! this device is just great! love it, if you're thinking about getting it! don't think too much just get it!", "verified": true, "helpfulness": "0/0", "author": "Peedro"}, {"rating": 1.0, "review": "I just got this today and I am incredibly disappointed. The way it is advertised, it sounds similar to a roku. It most certainly is not. You don't download apps to the device and conveniently play use them through that. Here is how it really works. First, you download netflix and hulu onto your phone, then you download the chromecast app. Then you run the netflix app, and then you press the stream button and it plays to your tv. If you want to use it through your computer you can't use anything that uses silverlight (netflix and hulu) so there is that. The stream quality is also pretty terrible. Basically save the money and buy a 10 dollar hdmi cord or spend the extra 20 bucks and buy a roku.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It does NOT stream everything, at least not yet.  Check it out well before you buy to make sure it does what you want.", "verified": true, "helpfulness": "0/1", "author": "David Tipton"}, {"rating": 5.0, "review": "Works very well. Fun to play with, but not a complete necessity if you already have a DVD player or TV that can stream. I use this on my older LCD while my New one has a PS3 hooked to it that does essentially the same thing.", "verified": true, "helpfulness": "0/0", "author": "Dan P."}, {"rating": 5.0, "review": "I was a bit disappointed at first that Chromecast would only work with netflix and youtube, but now that more applications have arrived I am able to 'cast' my downloaded videos from my PC to my TV", "verified": true, "helpfulness": "0/0", "author": "Ross W Darlinig"}, {"rating": 5.0, "review": "Love this. Complicated to set up since there are no instructions, but if you google it you can find out exactly how it should be used. It is so convenient!", "verified": true, "helpfulness": "0/0", "author": "Jenna Beach"}, {"rating": 5.0, "review": "Plug and Play has been a standard term since the post-AOL dial up days.  Chromecast is the perfect example.  Real quick...My dad was to receive Netflix as an Xmas present from my sister.  Obviously, he needed someway to \"...get the movies from the computer to the TV.\" as dad would most likely put it.  Hmm, time for the kids to solve this one.After using my friend Google, I confidently bought the Chromecast, as all the reviews suggested.  Fast forward to Xmas morning when dad opens up his Netflix present and the Chromecast.  The conversation went something like this:Dad:  I already have a flash drive, but this Netthing sounds pretty cool.Us:  It's not a flash drive, dad.Dad:  Sure it is.  It looks like one.Us:  That's the thing that lets you watch Netflix on your TV.Dad:  There's movies in this flash drive?Anyway, dad likes to research things and a few days later I found him behind the TV.  He had managed to figure out not only where to plug in the Chromecast \"flash drive\" and had gotten to the update menu.  I was impressed.Bottom line.  It does everything it says.  Even parents can figure it out :)", "verified": true, "helpfulness": "0/0", "author": "JediGuitarist"}]