[{"rating": 4.0, "review": "Great device, useful when you don't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Angel"}, {"rating": 3.0, "review": "It work ok but i prefer a roku because it has a remote control giving a better experience in your living room.", "verified": true, "helpfulness": "0/0", "author": "emontilla"}, {"rating": 5.0, "review": "I originally bought this because the Blu Ray player that I use for streaming Netflix does not support alternate audio for Netflix, so when I wanted to watch a foreign film or Anime, I couldn't get the alternate subtitles or English version. So now I just play it on my tablet and stream it through Chromecast, works like a dream. I was on the fence about this or Apple TV, but I chose this because I have more Android type devices at home.I was pleasantly surprised to find that my Apple devices work with Chromecast for a number of devices as well. It is a great way to stream Youtube, Netflix, etc... from your tablet to your TV, way more useful than you think. I was a little bummed they put out the Google play promotional credit a couple weeks after I bought it, but c'est la vie.", "verified": true, "helpfulness": "0/0", "author": "Matthew R"}, {"rating": 5.0, "review": "I was just about to complain that the only thing you can’t do with the Chromecast was show what’s on your computer screen. The last update fixed that. I’ve got three of these so far and they are working great and are easy to use. If you have an Android devise and a HDTV this is a must have.", "verified": true, "helpfulness": "0/0", "author": "Andrew Arnold"}, {"rating": 5.0, "review": "Another great blow to the evil cable companies. Love using this. Very simple", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "As expected from Google.. Delivering the best", "verified": true, "helpfulness": "0/0", "author": "Jitendra G."}, {"rating": 4.0, "review": "Good Value and quick shipping", "verified": true, "helpfulness": "0/0", "author": "Frank Keiser"}, {"rating": 5.0, "review": "Chromecast is the best of all the TV streaming devices for several good reasons. One, it is not limited in any way regardless of what device you have. Apple TVs can only be used by an iOS device or MAC which is just another case in point of Apple's overly proprietary devices. Roku players aren't limited by device either but they lie about the other players in comparisons, they cost a lot more, and they want you to use the little remote that the player comes with as opposed to using your phone, tablet, or computer to control the device like Chromecast. I recommend no other streaming devices. Chromecast is the best because it does a lot more than the Apple TVs and has the same functionality that the Roku player does at the fraction of the cost. And as I said earlier, Roku has untrue facts in their comparison on their website and that was enough in and of itself not to buy one.", "verified": false, "helpfulness": "0/0", "author": "Grant Frazier"}, {"rating": 5.0, "review": "My entire entertainment center now revolves around my Chromecast.I had bought a smart tv that had apps built in, but it became quickly apparent that the tv manufacturer was not interested in keeping the software up to date or expanding their offerings in terms of services.  This is where the Chromecast is brilliant - the providers themselves are interested in getting on your tv and they'll keep their software up to date on your mobile devices.  Things like Netflix, Pandora, Rdio work fantastically with the Chromecast.Would love to see Amazon finally allow Amazon Prime Video work on Chromecast, though.", "verified": true, "helpfulness": "0/0", "author": "Brian O'Connor"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Mario Alberto"}]