[{"rating": 5.0, "review": "For $35 you eliminate those wires fluctuating in the room. Long life to Google and Apple. It was very easy to add the chromecast and in a few minutes I was watching a movie from Netflix. I hope Amazon join the Google Chromecast soon. Amazon has some streamline movies that I would like to watch with Chromecast.", "verified": true, "helpfulness": "2/3", "author": "\"Sam\" Twain \"Samuca\""}, {"rating": 3.0, "review": "Purchased this to display video and item on big screen tv at shows and such. Works great for item that at run in the Chrome browser like web sites and web streaming. Not good for showing desktop apps. in fact wont show most.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"Jeff\""}, {"rating": 5.0, "review": "Took me five minutes to set up. Was streaming YouTube in less than 10 min. Netflix streaming works really well - even better than through our hacked TiVo Series 3 (which has issues with some codecs). Let's see, $600 for a TiVo Roamio Pro (which I will probably do someday) or $35 for a Chromecast - it'll do for now.The only disappointment is that there is no support for the Silverlight plugin, so no native streaming of Amazon Instant Video. I read that if I disable the plugin and force Chrome to play back AIV using Flash, streaming will work - but I haven't tried it.Edit - Not all Netflix streams will play. A lot of content on their system uses Silverlight as well. And simply disabling Sliverlight DOES NOT work to force playback by a supported codec.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"jkellyca\""}, {"rating": 5.0, "review": "This is a cool little toy. I already have one but I bought this as a gift.  And it is freaking awesome.  Just a few years ago things similar to this was just about $100 and now it's just barely $30. Awesome device and works like a charm.", "verified": true, "helpfulness": "1/1", "author": "41reviews"}, {"rating": 5.0, "review": "This item is excellent item.We can watch internet broadcast by TV together.It is good and reasonable price to us.", "verified": true, "helpfulness": "0/0", "author": "keyrancats"}, {"rating": 3.0, "review": "This thing is awesome but its lacking one major major issue for ipad/iphone users. You can only cast from the YouTube and Netflix app. When you're on a laptop you can cast straight from google chrome. But the ipad/iphone chrome browser will not let you install the \"cast\" extension. But the Netflix and YouTube apps work flawlessly for casting. Apparently you can cast just about anything from a laptop on chrome though but I haven't tried it yet. I want to slam it on the star rating for not fully supporting us ipad users but I'm still goin 3 stars because its so easy to use and set up and like I said it works flawlessly. I'm assuming google will do an update to their chrome browser app (not the \"chromecast\" app, FYI the chrome cast app is just used to link the device to the tv).Pros: super easy set up, flawless syncing and playing on supported appsCons: can't cast on the chrome browser using an ipad or iphoneWould I recommend: YesNote: crossing fingers hoping google will update their chrome browser app with the \"cast\" extension", "verified": false, "helpfulness": "3/4", "author": "Robert Young"}, {"rating": 4.0, "review": "As a fan of Google TV from the beginning, I have to say that I was intrigued by the idea of the Chromecast.  It basically sets up the idea that apps for your TV don't actually have to be powered by your TV or a device connected to your TV, but instead, powered by your smart phone, tablet or Chrome browser.  This allows for the cost of the streaming device to be significantly reduced, instead of the higher priced Google TV and Apple TV devices of the past few years.The Chromecast is essentially this:  a device that responds to commands from various apps on your smart phone, tablet or Chrome browser.  These commands tell the Chromecast to begin to pull the stream from your wireless router.  Some reviews I have seen incorrectly stated that the Chromecast is just a wireless HDMI device which relies on the tablet, smart phone or other originating device to actually play content, and then mirror it on the TV screen.  This is not the case, except for when you are using a Chromebook Pixel to mirror what you are doing in Chrome.When not mirroring, the Chromecast does great!  Just as good as a Google TV or Apple TV device.  However, when mirroring on a Chromebook Pixel, video lags tremendously, so don't think you are going to be able to watch all sorts of alternative streaming sites that aren't supported directly, just because you can mirror your device.That being said, more and more apps are being added to the support list every month!The only other downfall I see is that you still have to switch inputs on your TV to use it.  After being babied by the integration with regular TV that Google TV affords, I myself do not wish to use a Chromecast in its current form.  However, for those that have cut the cable already, and don't watch regular HD broadcast TV, then it's a perfect fit!I gave it 4 stars due to the lack of a coaxial input for regular broadcast TV to be integrated (as Google TV does) which requires you to switch inputs, as well as due to the fact that it lags so much when mirroring content with a Chromebook Pixel.", "verified": true, "helpfulness": "0/0", "author": "Josh D."}, {"rating": 5.0, "review": "I recently purchased this as a gift for my sister for Christmas.  It came quickly without any concern.  She was thrilled to open it this morning.  We haven't set it up yet, but it seems to be extremely easy to use.  She doesn't have cable TV at home so this will help her enjoy content directly from her laptop to her TV.", "verified": true, "helpfulness": "0/1", "author": "Jacob Schneeberger"}, {"rating": 5.0, "review": "My husband wanted this for Christmas, and he says that it is a snap to use.  Very easy to stream from computer to TV screen.", "verified": true, "helpfulness": "0/1", "author": "Kirstjen B. Lorenz"}, {"rating": 4.0, "review": "All things considered, I really rather like my Chromecast.  It's definitely a keeper.Setup is insanely easy and painless.  If you dread adding new electronic gadgets or accessories, installing this or that, and so on, Chromecast is for you.  Setup just...works.  It's clear, concise, and correct.You WILL need a spare HDMI port on your TV, and a nearby USB or AC outlet for power.Performance is a mixed bag.On apps that support Chromecast natively (YouTube, Google Play, etc) performance is excellent.  Nice HD picture, good audio, the works.  Very pleased.The tabcasting function however is, bluntly, garbage.  If it works at all, it's inconsistent, flaky, and prone to lockups, bluescreens, program shutdowns, etc.  When it does \"work\", the audio is frequently out of sync with the video by several seconds, and only the lowest quality video settings even come close to resolving the issue.  Pixels the size of hams, here we come.", "verified": false, "helpfulness": "1/1", "author": "G. Boulton"}]