[{"rating": 5.0, "review": "I love chrome cast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Poor product, Money well wasted. I bought 2. Wish I knew better. the device works but very limited.", "verified": true, "helpfulness": "0/1", "author": "Kenneth Mullins"}, {"rating": 5.0, "review": "Gave this as a gift to my new son in law...They love it...It was a little confusing to get it connected to everything, but now up and running.", "verified": true, "helpfulness": "0/0", "author": "SANDI D."}, {"rating": 5.0, "review": "rules", "verified": true, "helpfulness": "0/0", "author": "Cactus Pete \"Uh , What ?\""}, {"rating": 1.0, "review": "While the product \"might\" work as advertised, I'm unable to find out as \"real\" support for problems is non existent! All that seems to be available is a peer group website for questions with NO real help desk services available. Totally unsatisfactory!!! I only give this product one star!Rod Murray", "verified": true, "helpfulness": "0/0", "author": "Rod Murray"}, {"rating": 5.0, "review": "Absolutely love this little thing. Attached it to my living room TV, returned that ridiculous, oversized $18 a month Comcast DVR cablebox, and now just Chromecast everything I'm interested in watching from my home computer. Done!", "verified": true, "helpfulness": "0/0", "author": "D.Lockhart \"drlockhart\""}, {"rating": 5.0, "review": "easy to install.change your TV, PC/mac and life largely.", "verified": true, "helpfulness": "0/0", "author": "Takanori Eguchi"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Michelle Machaka"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own two Chromecasts. For the price, you can't beat the usefulness and functionality. I can now stream my local and paid content to any TV in the house from any smartphone or tablet that happens to be nearest to me.The latest update to the Chromecast app on my smartphones also allows me to mirror my device's entire screen. So in the event that the app I'm using doesn't support Chromecasting, I can always just mirror my entire device.Another huge plus is CEC support. When casting from my phone, the Chromecast will actually automatically switch my TV's input to the right one, and will even turn the TV on if it isn't already on.I plan on having one of these in every room of the house. Best $35 I've ever spent.", "verified": true, "helpfulness": "0/0", "author": "reiththestud"}]