[{"rating": 4.0, "review": "Great option to make dumb TVs smart.  There are some apps that I wish were compatible (Sling being one of them) but for the money, it is a great little tool to leverage if you are cord cutting or just looking for other ways to share content on a screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "my daughter love this", "verified": true, "helpfulness": "0/0", "author": "Michele Florence \"mim\""}, {"rating": 5.0, "review": "I love these chrome casts.  they are pretty basic for streaming but do the job as i need. bought a few more even!", "verified": true, "helpfulness": "0/0", "author": "chinarican"}, {"rating": 5.0, "review": "Nice, for streaming.", "verified": true, "helpfulness": "0/0", "author": "Aaronio"}, {"rating": 1.0, "review": "it only works with chrome which constinly crashes and google does not respond to repeated complaints that it crashes how can you enjoy a device that can not keep a stable link", "verified": false, "helpfulness": "0/1", "author": "Ryan sherman"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Helder C."}, {"rating": 5.0, "review": "Very functional and works fine for me", "verified": true, "helpfulness": "0/0", "author": "Keysha C"}, {"rating": 4.0, "review": "Love it....great price....now i have a smart tv.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Rothchilds"}, {"rating": 3.0, "review": "Needs Ethernet integration to work reliably.  Less than perfect wireless reception makes it very choppy.  Using your smartphone as a remote is a lot less convenient than it sounds, especially with an android phone (and you would think it would be more seamless with Google's mobile OS).  The software and content availability are pretty amazing, though.  Can't say how it compares to Roku or Apple TV, but it is FAR superior to \"Smart\" TV or DVD player software.", "verified": true, "helpfulness": "0/0", "author": "Charles Cone"}, {"rating": 5.0, "review": "One of the few products of this type that work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "acharya"}]