[{"rating": 3.0, "review": "I loved it at first until I seen that you can only stream YouTube media on it.", "verified": true, "helpfulness": "0/2", "author": "jon hutchinson"}, {"rating": 5.0, "review": "What a wonderful device for those of you (the majority) that have an HDMI TV input but no smart TV.  Just plug it in and watch YouTube and other Google programs on your HD TV.  But wait.....it gets better.  Install the Local Cast free application and it connects too.  Then you can project anything showing on your phone or tablet onto your TV whether it is Google compatible or not. View photos or watch programs", "verified": true, "helpfulness": "1/1", "author": "arnold"}, {"rating": 5.0, "review": "Bought 7 for family and friends.", "verified": true, "helpfulness": "0/0", "author": "Groat"}, {"rating": 4.0, "review": "I love this Chromecast stick. It works like a charm and it works on all my TVs. I really only need it for one TV, which lacks a smart device of some kind. It connects quickly and the cast icon shows up on all supported apps. I even watched an entire movie from my computer on the TV that was not from an app but a web page.That said, I would give it a 5 star rating if Google and Amazon knew how to play nice together. I refuse to buy any more Amazon movies until Amazon decides to finally support Android tablets. Whatever the issue between Google and Amazon, they need to get o-v-e-r it already.", "verified": true, "helpfulness": "0/0", "author": "JDT \"reader1958\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "tom lewis"}, {"rating": 4.0, "review": "It is amazing", "verified": true, "helpfulness": "0/0", "author": "Ash Kuso"}, {"rating": 3.0, "review": "This device is only good as long as you use the apps that support it- Youtube and I forget what else. There is an annoying lack if you're trying to cast any website that doesn't support Chromecast. It's great when using the supported apps, however I'm not impressed with the limited selection. It would be a great improvement if they could resolve the lag issue for site that don't support Chromecast.", "verified": true, "helpfulness": "0/1", "author": "A. Paul"}, {"rating": 5.0, "review": "This was a gift for my son-in-law and he is very happy with it.  There was a problem while it was still under warranty, and the warranty was honored, a replacement sent right away.....very good service.", "verified": true, "helpfulness": "0/0", "author": "Grandma Biggie"}, {"rating": 5.0, "review": "This is a great product. Small, no wires needed with my TV. HD quality is great. Netflix and Youtube on Chromecast work WAY better than the integrated products with my Samsung TV!", "verified": true, "helpfulness": "0/0", "author": "Z. Horan"}, {"rating": 5.0, "review": "This thing is awesome", "verified": true, "helpfulness": "0/0", "author": "Toob"}]