[{"rating": 5.0, "review": "Only complaint I have is this device doesn't have more application.It was install fast and easy, after installation you can use any device like smartphone or tablets under same WiFi.Best money I have ever spent. Thanks Google.", "verified": true, "helpfulness": "0/0", "author": "Amazonian"}, {"rating": 5.0, "review": "Love it. Replaced my Apple TV. Definitely recommend this to anyone looking for computer or any other device for that matter streaming to an HDTV.", "verified": true, "helpfulness": "0/1", "author": "Dimitri S."}, {"rating": 4.0, "review": "Please YouTube and NetFlex great. Would give it 5 stars if I can play my own video from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "PKJ \"PKJ\""}, {"rating": 1.0, "review": "Apple TV is $100 but its actually worth it. This thing is $35 and its waste of money. Reason why is because it freezes... only works for netflix and youtube, and you'll always have problem controlling whatever you're watching... by the time it pauses you're already back to your seat ready to watch again.Do Not Waste YOUR MONEY!", "verified": true, "helpfulness": "1/2", "author": "Daniel"}, {"rating": 5.0, "review": "In the past I ran a multiroom Logitech Squeezebox setup, with a 4TB NAS for all my music files. However, it was confusing to operate and needed to be completely rebuilt every 4 - 6 months when the receivers lost their network connectivity. Then, along came my new Google Chromecast and I can't believe how well Google have solved this problem.The setup is one of the easiest I have ever experienced for any electronic device, EVER. Seriously, it's that well though through.After plugging it in to the HDMI port on my stereo receiver, we now send music (from Google Play), YouTube videos, Movies, etc to it from a previously retired Android tablet that is now mounted on a cabinet door in the kitchen. My wife loves how easy it is to operate and how flawlessly it always just works.Frankly, I resent the fact that this is yet another area in my life that I am handing over to Google, but you cannot deny that they have come along into this entirely new market sector and just solved it so elegantly. Fantastic device.Negatives:  1) I wish you could have multilple Chromecasts in multiple rooms and sync them.  2) I wish you could cast a browser tab from an Android device like you can with a desktop chrome browser  3) The number of services / apps that support Chromecast are currently small, but growing.For this kind of money, you really can't go wrong.", "verified": true, "helpfulness": "2/3", "author": "Jason Shapiro \"Jay Shapiro\""}, {"rating": 1.0, "review": "After following the simple and clear instructions to connect this to my network, and entering my complex wifi password several times and rebooting everything several times, I still can't connect this to my network. It is going back.The TV commercials make it look like you can use this to put you computer/tablet/phone screen on the TV with a wave of your hand. I'm not sure what it does that my perfect Roku can't do better.The forums and the chromecast support point to router issues. All my stuff is right, 2.4 ghz network like they say, but they have a number of routers listed that won't work with this.Dude, it's a network. How hard can it be??", "verified": true, "helpfulness": "1/2", "author": "J. Holmes \"wirewizard\""}, {"rating": 4.0, "review": "The Chromecast is fine, but I never got my promotional code for my 3 months of Netflix even after I got an email saying I would receive it. Now I can't figure out how to get it. Bummed since that was my motivation for buying this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"soul4real\""}, {"rating": 4.0, "review": "Does what it says it does.  Only problem is that it doesn't do much of anything like a Roku or WD TV Live because of Google and their restrictions.  It would be really nice to use say Plex Media Server with it or even Amazon VOD but we can't because Google is being psycho with the apps it allows.", "verified": false, "helpfulness": "0/0", "author": "Ryan Peters \"Ryan\""}, {"rating": 5.0, "review": "Definitely love it. Works like a charm. I can stream anything I want from my browser now without having to deal with crap smart tv anymore.", "verified": true, "helpfulness": "0/0", "author": "Xuming Xu"}, {"rating": 1.0, "review": "I bought this so that I could stream Netflix Super HD content to my front room, to replace a PS3 I was planning to sell that was currently performing the same purpose.I connected it to my network and enabled UPnP in my router, but Netflix videos were extremely pixelated and were clearly using a low bitrate. When I used Netflix's \"Example Short 23.976\" diagnostic video to see what was going on, I found that my streaming speed would never get close to the 5800kbps of Super HD (that my PS3 located inches away was currently providing), and instead topped out at ~3000kbps and would not go higher.In addition, sometimes the bitrate would \"lock\" at an extremely low value (usually around 250kbps) and would look absolutely terrible. Sometimes tracking through a title would fix this, but not always.I contacted Google's Chromecast support, who informed me that my unit \"does not seem to be defective\" and suggested \"moving (your) router closer to the Chromecast\". Given that I was able to stream Super HD content to both my PS3 and a laptop in that location without issue, this was not going to happen. It is my belief that my Chromecast was either defective or just sucked, and given the generally positive reviews posted here and elsewhere then I can only conclude the former.I am returning the unit to Amazon for a refund.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}]