[{"rating": 3.0, "review": "Be sure to verify that this will work on the platforms you want to watch - it has limitations!", "verified": false, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 5.0, "review": "If you want to stream videos and be able to pause etc... use videostream. You put it on your pc. Its a chrome extension. Also download it on your phone for use as a remote.", "verified": true, "helpfulness": "0/0", "author": "kellen"}, {"rating": 3.0, "review": "Great product but, don't use this device with Comcast as your ISP. Comcast seems to be slowly trying to find ways to ruin your viewing experience by interrupting the connection while streaming anything! We were forced to get a new Comcast cable box and watching anything on Chromecast is a nightmare. Chromecast + Comcast = Disappointment", "verified": false, "helpfulness": "0/1", "author": "Lydia"}, {"rating": 5.0, "review": "Streams everything smoothly, and occasionally I get Chromecast offers in the form of free movie rentals or free months of Google Play Music.  I really have no complaints, everything works great.", "verified": true, "helpfulness": "1/1", "author": "Ryan Kennedy"}, {"rating": 2.0, "review": "did not work not compatible with os", "verified": true, "helpfulness": "0/0", "author": "irene m gusciora"}, {"rating": 4.0, "review": "I think it works better then Roko.", "verified": true, "helpfulness": "1/1", "author": "Nyrican55"}, {"rating": 5.0, "review": "LOVE LOVE LOVE~!!!!", "verified": true, "helpfulness": "0/0", "author": "loopymcgee"}, {"rating": 5.0, "review": "So easy to set up, we were convinced we were missing something. You literally just plug it in and it is ready. This is amazing! Quick and responsive!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works Great! Needs more apps that are compatible.", "verified": true, "helpfulness": "0/0", "author": "KimKBestFriend11"}, {"rating": 1.0, "review": "Total POS! Sure stream something. Don't think about pause, review, rewind.Device totally fails to the degree you must de-power device and start your content from the beginning without the capability to fast forward to previous location. Chromecast is complete crap. Don't waste even 35$. Doesn't do anything useful.Complete garbage", "verified": true, "helpfulness": "0/0", "author": "Mr. Continental \"You are correct...I AM very handsome.\""}]