[{"rating": 5.0, "review": "Honestly, I doubted a lot before buying the Chromecast, but now that I have one, is really fun, I watch YouTube videos, series and more, in my TV, just using my smartphone or tablet as a \"content chooser\". I really recommend this product, it worth the 35 bucks.", "verified": true, "helpfulness": "0/0", "author": "Mauricio G. Morra"}, {"rating": 5.0, "review": "Great little device. Now I can put all my media from my phone onto my TV easily. That includes the free movies I get from Google, the music I have, the television seasons I have, the internet pages!", "verified": true, "helpfulness": "0/0", "author": "T.O."}, {"rating": 5.0, "review": "Best Amazon Prime purchase ever!", "verified": true, "helpfulness": "0/0", "author": "Kristen Karmatika"}, {"rating": 5.0, "review": "Not much to add to the other 30K+ reviews here, but this is a nice little inexpensive device that allows you to stream media over the TV. It's quick to set up, so you'll be watching in minutes.", "verified": true, "helpfulness": "0/0", "author": "SET67"}, {"rating": 5.0, "review": "Best device for cast", "verified": true, "helpfulness": "0/0", "author": "Carlos Meilicke"}, {"rating": 5.0, "review": "We love chromecast! If you have netflix or hulu it's totally worth it! We actually purchased a second one to go in our other tv because we love it so much!", "verified": true, "helpfulness": "0/0", "author": "EandP"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Esteban Hernandez"}, {"rating": 4.0, "review": "There is simply nothing out there quite like the Google Chromecast. It's a brilliant and cheap way to get smart apps onto your older TV, and comes highly recommended.Pros:+ Works flawlessly+ It's easy to set up and use+ Lots of apps+ It's so cheap!Cons:- No remote control- Still some apps missingA great instant upgrade, but you are going to want to compare with what Amazon has to offer with full features here: http://amzn.to/1aQc2Ww", "verified": false, "helpfulness": "0/0", "author": "Stann"}, {"rating": 5.0, "review": "LOVE this! It makes watching my netflix shows so much better, rather than watching on my computer! I love being able to listen to pandora or watch YouTube videos on my TV while getting ready or doing home workouts, too!", "verified": true, "helpfulness": "0/0", "author": "Abby"}, {"rating": 3.0, "review": "Crashes ALOT!!!", "verified": true, "helpfulness": "0/0", "author": "Timothy F Hicks"}]