[{"rating": 3.0, "review": "I have other streamers in my house hold, and they are all equipped with guides to operate them- Not schematic like Google chrome-", "verified": true, "helpfulness": "0/0", "author": "Jocasso45"}, {"rating": 5.0, "review": "I finally managed to get rid of Xbox live and their crazy expensive $60 a year because they had a bit of a lock on the netflix market.$30 - $35 one time, and it can come with me, and show you tube ect much easier.Very worth it.", "verified": true, "helpfulness": "0/0", "author": "gman"}, {"rating": 2.0, "review": "Half the time it doesn't sync with my tablet or laptop.  And you are very limited as to what media you can access. I guess not too bad considering it's $35.  You'll need a USB port on your TV or an adapter to power it from and ac OUTLET, so don't let the pics of it alone fool you.", "verified": true, "helpfulness": "0/1", "author": "Drexel Lake"}, {"rating": 5.0, "review": "I was an early adopter - preordering two Chromecasts!  I have had a wonderful experience throughout the months.  I use PLEX to setup a home media server and with Chromecast I can watch movies and shows through Plex directly on my TV without any hassle.  No more cords to worry with!  Just be sure that you have a pretty strong wi-fi signal in your house.  I have noticed a few hiccups using it in areas where the wi-fi signal wasn't as strong.  Having the ability to mirror your screen has opened up the doors to be able to stream content through websites as well!Highly recommended!", "verified": true, "helpfulness": "1/1", "author": "Best Game Ever"}, {"rating": 5.0, "review": "I can't wait for more applications to be added but I have the Chromecast device on two of my TVs.  I find the device nice to have since I am always on my laptop or tablet anyways it just makes everything that much easier.", "verified": true, "helpfulness": "0/0", "author": "kalpers"}, {"rating": 5.0, "review": "If you watch a lot of YouTube or Netflix I highly recommend this for getting it to your t.v.. I used to watch some you tube from my play station but this is far and away easier to navigate and use. Simple to set up and just works, from my iPad and cell phone", "verified": true, "helpfulness": "0/0", "author": "Doug \"Doug\""}, {"rating": 5.0, "review": "Simple and effective.  Seemless play on any TV that you can hook it up to.  Download the app, set it up, and your off to the races.  I use it a lot for Netflix and YouTube... innovative design and seemless linking.  I've experienced no lag or dropped synchronization.  It even has nice screensavers when it's not in use.  I've thoroughly used it.I wish it had more apps to synch with, but I haven't tried Google Play.  I also wish it was self powered and didn't require the extra plug in device to USB or a wall socket... makes it look a little funky, but that's all minimal.Buy one... for $30 bucks you're kidding yourself if you don't think its worth it.", "verified": true, "helpfulness": "1/1", "author": "Chaveso"}, {"rating": 5.0, "review": "I own 3 of these. There is no reason to not buy one. It's $35! Thank you Google. It's the best and most affordable device in it's class!", "verified": true, "helpfulness": "0/0", "author": "jenny yau lai"}, {"rating": 5.0, "review": "This program works well with my apple products.  It is a good product for the money and easy to use.  I don't like it as well as the apple TV, but it works good.", "verified": true, "helpfulness": "0/0", "author": "Everett Rudluff"}, {"rating": 1.0, "review": "I'm pretty good with most straight forward set-ups of computer and/or audio related products.  In this case, the product could NOT be set up to ever stream anything. Not YouTube, not Pandora, nada. I verified the proper WiFi connections, tried re-installation, tried online support, tried phone support, tried everything.  So I tried another new Google Chrome...sorry, but 0 for 2. Unfortunately for me, nothing but a very frustrating experience.", "verified": true, "helpfulness": "0/0", "author": "D.M. Beverly Hills"}]