[{"rating": 5.0, "review": "best investment of 35$ ever", "verified": true, "helpfulness": "0/0", "author": "Sanc"}, {"rating": 4.0, "review": "I love it! Easy to set up and to use. I only wish it didn't have a cord. Other than thatLOVE LOVE LOVE", "verified": true, "helpfulness": "0/0", "author": "Megan F."}, {"rating": 5.0, "review": "I have 3 of these on all the major TV in my house and could not live without them.  We use them to stream movies, music, pictures, and YouTube almost daily.", "verified": true, "helpfulness": "0/0", "author": "Chuck T."}, {"rating": 3.0, "review": "It works good but some times it disconnects with my youtube and stops playing the video. and some times it creates its own playlist with my previous videos , which is very annoying. There are lot of bugs need to be fixed in this. But this is well worth the money. I gave 3 star because, as a software and search giant I expect them to fix these kind of bugs.", "verified": true, "helpfulness": "0/0", "author": "Reddy"}, {"rating": 5.0, "review": "Use it all the time!  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Julie A. Nelson"}, {"rating": 5.0, "review": "kool", "verified": true, "helpfulness": "0/0", "author": "Amazonbuyer"}, {"rating": 5.0, "review": "LOVE this product!! the streaming is really really good, especially with youtube videos. Netflix from time to time will freeze up, but that may have just been my WIFi signal. This is a really really good product to have though and for the price its a crazy good value", "verified": true, "helpfulness": "0/0", "author": "Adrian Landers"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Maykol"}, {"rating": 5.0, "review": "We love this. Makes it so we can use our Netflex on the tv.", "verified": true, "helpfulness": "0/0", "author": "LaDonna"}, {"rating": 4.0, "review": "Amazing product, very easy to set-up. Four stars because it's limited to viewing YouTube and Netflix only so far. Cannot use with your browser (for iPhone), etc...", "verified": true, "helpfulness": "0/0", "author": "Al Al"}]