[{"rating": 5.0, "review": "would like an affordable HBO product soon?????", "verified": true, "helpfulness": "0/0", "author": "janet mcneil"}, {"rating": 5.0, "review": "No issues", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "Love it every thing work well I download my game to it  I just have one question How can I find acontroller that's work with fire TV and my game I down load fromm my phone", "verified": true, "helpfulness": "0/0", "author": "Michelle Middleton"}, {"rating": 4.0, "review": "I do like the product but I had to return it because the video streaming is restricted outside the United States.", "verified": true, "helpfulness": "0/0", "author": "John K. Jablonsky \"sadisticsurfer\""}, {"rating": 5.0, "review": "It works!", "verified": true, "helpfulness": "0/0", "author": "Diogenes"}, {"rating": 1.0, "review": "Very very bad!!!", "verified": true, "helpfulness": "0/3", "author": "Andrii K"}, {"rating": 5.0, "review": "i luv my Fire TV", "verified": true, "helpfulness": "0/0", "author": "sailorman11"}, {"rating": 1.0, "review": "Would not work with my plasma television because the HDMI plug was made prior to a certain date.  However, nothing is written about this in the description.  I had to find out the hard way.", "verified": true, "helpfulness": "0/1", "author": "3dlovely"}, {"rating": 5.0, "review": "What a great addition to your entertainment center. I have used a number of other devices for access to Netflix and Hulu and streaming content as well as Xbox and Wii apps for browsing the web. Nothing compares to the Amazon Fire TV with a Prime subscription, no where near it for access to all of the right apps and download of thousands of others instantly.  games run smoothly, the device is very fast and Prime Movies and Music are fantastic in HD.I wonder if you had one Prime membership, could you purchase another Fire TV box and use it in another room on the same account, or do you need two Prime memberships ?I also wish there was a compatible web browser.  I have not found a way to search internet aside from YouTube.  This would be a very convenient addition.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fairly easy to figure out. Probably real easy if you got a manual with it :) Does have an issue getting started when watching a streamed movie. But once you get past that it runs great.", "verified": true, "helpfulness": "0/0", "author": "John \"trkrhelp\""}]