[{"rating": 5.0, "review": "This was a gift, but haven't heard anything bad about it yet.", "verified": true, "helpfulness": "0/4", "author": "Trish"}, {"rating": 3.0, "review": "UPDATE 2: I bought this unit in August 2014. It's June now, and unit is broken. The remote started acting up a few days ago: it will work for a while, then just stop working. The Fire TV box itself shuts itself down randomly (to restart, I have to unplug the power cord, then plug back in). I called customer service, which agreed to send me a new remote at no cost. I hope that fixes the problem, but I'm thinking the problem is with the box, too. I expected better build quality. Thus, I'm taking off a star.UPDATE: I've been using Fire TV for about a week now, and my initially lukewarm impression has improved significantly. Playback of Amazon Prime videos is much smoother than it was initially, and I think I'm also seeing improvement on Netflix. The problem I had with Crackle seems to have been a one-off glitch. I haven't used Fire TV for games or other apps, so I can't say anything about those yet.******** Original************Since there are more than 8,000 reviews already, it seems pointless to add another, but I thought I would give my initial impressions anyway.I just received my unit. Set up was relatively easy, including connecting the unit to my sound bar. I was connected to my Amazon Prime account without me having to enter the information, too. That was nice.So far, though, I've been a little disappointed with the download speed. Amazon Prime videos take a fair amount of time to load, although once loaded, you can access them instantaneously--I started one video, but decided to look at something else after a few minutes. When I went back to the first video, the play back started immediately.On Netflix the loading time isn't any different than Google Chrome, and may even be a bit slower. I also tried to watch a video on Crackle, but it would not load (I waited a good five minutes). I have no idea what the problem is--could be with Crackle--but still, not what I expected.I'm hoping, after some use, things will speed up. As for now, I'm not seeing that much advantage using Fire TV over Google Chrome (which I've put on my second TV). If anything, using Google Chrome with my iPad is more convenient.", "verified": true, "helpfulness": "3/3", "author": "Nematoda"}, {"rating": 5.0, "review": "Have only had it for a few weeks, but I love it!Just wish it had more of the tv shows on Prime (Dexter, for one).Hoping that will come as it gains more users.I am over 50 and installed it myself - easy to do!", "verified": true, "helpfulness": "2/2", "author": "Geralyn L Hunt"}, {"rating": 1.0, "review": "No HBO GO = 1 star", "verified": false, "helpfulness": "3/15", "author": "Brian"}, {"rating": 1.0, "review": "Why are people even buying this crap? It streams apps like every other device does, however it can't even play .vob format video which is the DVD standard for the past 25 years! So basically I can't play any of my 1900 movies I have spent years accumulating. Boxee still kicks every other media player out theres butt, and it's so old. Is it too much to ask for to be able to play all media formats?", "verified": false, "helpfulness": "2/13", "author": "Michael Masjuan"}, {"rating": 5.0, "review": "This is a God send.  My ps3 was abused by years of Netflix and Hulu use, then this angelic item came.  The Fire Tv is fast, well laid out, and small.  It fits the bill of a living room entertainment box perfectly and I cannot suggest a better unit to you than this one.  I have Hulu plus, Netflix , Vudu, and Amazon prime running to mine.I also own two competitors units with similar functions to the Fire Tv.  Neither can touch its speed, price or functionality.  Buy one, you will not regret it.", "verified": true, "helpfulness": "2/2", "author": "187"}, {"rating": 4.0, "review": "It's nice. I wish there were more current shows for free, but there is a wide selection.", "verified": true, "helpfulness": "0/0", "author": "B.Reavis"}, {"rating": 5.0, "review": "Great product!!! Fast, reliable and reasonably priced! An Amazon home run!", "verified": true, "helpfulness": "0/0", "author": "JRB"}, {"rating": 1.0, "review": "I can't tell you how many times I've had to completely wipe out this box to get it to work properly--too many times!  It seems to be the only solution.  And every time I have to re-download and re-login to every app.  #HugeHassleSave your money.  There are better streaming devices on the market with far fewer bugs, far more (and better) apps, better support, and, most importantly, a far BETTER CUSTOMER EXPERIENCE!!!!I regret ever purchasing the two that I have.  Amazon has really disappointed me on this on, and I am a HUGE Amazon fanatic.  I feel like Amazon rushed a half-a$$ed product to market to not get left behind by the competition.The specs are amazing and they SHOULD mean the Fire TV is a superior device, but that isn't the case.  I'm going back to my crappy Boxee TVs from Walmart.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Vernon S. Pelow"}]