[{"rating": 3.0, "review": "Setup was a bit difficult, and now that it's installed, I can't always get it to work properly. When it does, I can get the same results from either my Tivo or my blu ray player.", "verified": true, "helpfulness": "0/2", "author": "M. Kenneth Sweetman"}, {"rating": 1.0, "review": "Took me many tries to make it to work. Not a very user-friendly setup. Not too many applications available. I was hoping that I would be able to use a browser to project the contents but it does not support that. I still love my Apple TV.", "verified": true, "helpfulness": "0/4", "author": "Arif M. Mahmood"}, {"rating": 5.0, "review": "is great, you can cast from every devise in your home and is easy to install, also, actually works with netflix (I live in central america)", "verified": true, "helpfulness": "0/0", "author": "jason melendez castro"}, {"rating": 3.0, "review": "The additional step of the PC or smart phone app makes it awkward when selecting a Netflix program. It gives great HD pictures to my LCD/LED TV screen. It works through a WI-FI setup.", "verified": true, "helpfulness": "1/1", "author": "Doug C. \"Retired from Air Force. I'm dyslectic and enjoy audible books in that printed copy is difficult for me to read.\""}, {"rating": 3.0, "review": "Easy set up and works well with netflex.Looking forward to the added function of streaming from my computer that is promised.", "verified": true, "helpfulness": "0/0", "author": "Ronald C King"}, {"rating": 5.0, "review": "Awesome product.  Now I can stream any internet content from any of my devices to my TV.  Thanks to google.", "verified": true, "helpfulness": "0/0", "author": "Jas"}, {"rating": 5.0, "review": "It is perfect to stream video. I wouldnt use it when your tv is too far from your wireless router... If you plan on viewing your own video just drag and drop the video on a chrome browser.... if you are streaming video just alt+tab to hide it from your computer screen so you wont see both screen", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 5.0, "review": "This is a slick device that is easy to setup -in typical Google style- and works great. Can hardly wait for more apps to support it.", "verified": true, "helpfulness": "0/0", "author": "Brian Seburn"}, {"rating": 2.0, "review": "It's very limited to what you can do and displaying chrome browser works but not stable.Can't even push your movies or music to it", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 2.0, "review": "I am hopeful that the technology will come along to be able to Chromecast Hulu and Amazon from my PC to the TV.", "verified": true, "helpfulness": "0/0", "author": "Missy"}]