[{"rating": 2.0, "review": "Slow and hard to set up if you have to set up more than once", "verified": true, "helpfulness": "0/1", "author": "ROBERT LOOMIS"}, {"rating": 4.0, "review": "Really cool little device that saves you the hassle of dealing with an HDMI cable in order to get what's on your computer on to your TV screen. The streaming is not always seamless. I'm often unable to pause what I'm watching and have to restart the app and even have to turn off the TV at times in order to regain connectivity and not lose my place. I hope they will keep releasing updates to improve.", "verified": false, "helpfulness": "1/1", "author": "Sarah Shelton"}, {"rating": 1.0, "review": "Did not like it! Waste of money! It does not work correctly on my s3, only buy if you want to stream youtube. Very dissapointed with my purchase. Id like if it worked with my s3", "verified": true, "helpfulness": "0/1", "author": "Glen"}, {"rating": 4.0, "review": "Muito bom o produto.", "verified": false, "helpfulness": "0/1", "author": "João Paulo Ivamoto"}, {"rating": 4.0, "review": "Great Product ..AAAAA ++++++", "verified": true, "helpfulness": "0/1", "author": "AtoZ247 \"nana\""}, {"rating": 5.0, "review": "It's pretty handy to have. Hook this joker up to anything with HDMI in, and you can watch netflix, youtube, etc. You can use your smart phone as a remote and do other things while the chromecast streams your shows/movies.You can also use it to stream your browser (chrome only I believe)", "verified": true, "helpfulness": "1/1", "author": "Timothy A. Beach"}, {"rating": 4.0, "review": "My second most used streaming option. I wish it had some native apps (mainly Google apps) so I wouldn't need to cast everything, but that is only a minor inconvenience. I find that I prefer a set top box with a GUI for most streaming, but for Google Play Music I find the Chromecast to be fantastic. I use my Chromecast 90% of the time for streaming music. The other 10% is pretty much YouTube vids.", "verified": true, "helpfulness": "0/1", "author": "Rm1985"}, {"rating": 5.0, "review": "Works amazingly. Awesome device lets you stream common apps like Netflix from any smartphone that is on the same Wifi network that the Chromecast is attached to. From a PC you can stream anything you want from the Chrome browser. If you don't buy this you are an IDIOT.", "verified": true, "helpfulness": "1/1", "author": "Troy G."}, {"rating": 5.0, "review": "easy set up, doesnt mess up TV reception, use with google nexus 7.", "verified": true, "helpfulness": "0/1", "author": "george l. garcia"}, {"rating": 5.0, "review": "Works Perfect and avoid the HDMI cables.", "verified": true, "helpfulness": "0/1", "author": "A.E.A \"ALBERTO\""}]