[{"rating": 1.0, "review": "The WiFi connection is poor and it has lots and long buffer interruptions getting streaming data. I had a Sony BlueRay player in the same location and on the same TV and I cannot recall 1 tenth as many buffer interruptions. For the same monies, you would be better off using the Sony Blue Ray player and you can play your CDs.The Fire must spend all the processing effort on speech understanding, but it is no use on Netflix which uses a text menu. Using the speech feature always goes to a new service I don't have and don't want to pay for. I'm no sure how to verbally redirect the search.I'm looking for a way to cut cable/satellite and get all my local channels and use the internet access to get shows I want to see without paying $80 a month for TV and another $60 dollars for high speed internet. If I could drop the reoccurring TV cost that would be great.", "verified": true, "helpfulness": "2/5", "author": "PJC"}, {"rating": 5.0, "review": "Eselente", "verified": true, "helpfulness": "0/0", "author": "gregorio guzman"}, {"rating": 5.0, "review": "Great movie system.  Love the large selection of movies.", "verified": true, "helpfulness": "0/0", "author": "Roger M"}, {"rating": 5.0, "review": "I installed this at home and cut the cable.  I really like the voice search.", "verified": true, "helpfulness": "0/0", "author": "S.D.E."}, {"rating": 5.0, "review": "Works better than I expected. I love it. Smile I got it from Amazon.", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 5.0, "review": "Purchased two of them and have not had a bit of trouble with either one. Extremely satisfied!", "verified": true, "helpfulness": "0/0", "author": "John A. Galizia \"pd_blues\""}, {"rating": 4.0, "review": "One of the best", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "This thing works awesome!  Perfect digital quality and sound!  Super easy to hook up!I'm glad I got one and highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 2.0, "review": "I bought this for my wife, and she hates it because the service is spotty.  Half the time we get sound and a frozen picture, the other half she gets sound but no picture.  She's given up and just watches on demand tv through cable.", "verified": true, "helpfulness": "0/2", "author": "dave dunn"}, {"rating": 5.0, "review": "Wonderful selection of Movies to watch", "verified": true, "helpfulness": "0/0", "author": "Gary"}]