[{"rating": 5.0, "review": "I am not sure how many chromecasts I have bought; it is my favorite gift for my friends and relatives.The more I used it, the more I believe in it that it will take over the TVs all over the globe.I am watching more progs and movies, and many more stuff coming to it via other apps.", "verified": true, "helpfulness": "0/0", "author": "Dr. Mohamed J. Alhassan"}, {"rating": 5.0, "review": "This was the best purchase. We cancelled our cable and are streaming netflix, huluplus, and YouTube through our tablets, iPads, and phones. I just wish it had more apps that worked with it but we are very pleased with chromecast so far.", "verified": true, "helpfulness": "0/0", "author": "sparkygirl87"}, {"rating": 5.0, "review": "Gift-this is amazing and my husband loves it!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "John G. Waclawsky"}, {"rating": 4.0, "review": "We were looking for a replacement to our Roku. We were getting tired of the Roku rebooting every night. The Chromecast works well but the thing we don't care for is having to have apps loaded onto a personal device instead of having them on the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "BraMas"}, {"rating": 5.0, "review": "This little gadget is awesome! We can watch Netflix or Amazon Prime movies on our Tv without the price of an Apple TV, Roku or similar  gadget.", "verified": true, "helpfulness": "0/0", "author": "J McGurk"}, {"rating": 5.0, "review": "Very convenient. Pairs especially well with Mezzmo. Has done everything I need. Just wish Spotify would let you stream to it. Spoticast will have to do for now.", "verified": true, "helpfulness": "0/0", "author": "D. Nabor \"one_disturbed_psycho\""}, {"rating": 1.0, "review": "Never could get the code you needed.", "verified": true, "helpfulness": "0/1", "author": "Skip McMurray"}, {"rating": 5.0, "review": "Continues to amaze. Absolutely worth every penny. Especially in comparison to roku or apple TV. I mean, it's $25 bucks!?", "verified": true, "helpfulness": "0/0", "author": "draloysius"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "austin hammer"}]