[{"rating": 5.0, "review": "I love Chromecast. I already had a smart TV when I got it. I was planning to use it from the developer perspective. However, I found myself using is as user, mostly from Plex and from YouTube. It is so fast compared with my Samsung Smart TV. Sometimes, in a middle a conversation, if I want to share a video, it was nearly impossible. Now, I am able to do it very quickly. In the beginning, I was concerned about it just use 2.4Ghz Wifi - I live in an apartment with more than 25 other WiFis competing with mine. To be honest, until now it was a problem but I believe I am still planning to get the new Ethernet adapter to avoid any future problem. A fully recommended product. I use it with a Nexus 9 tablet. From the developer perspective, I am still working to test it from Android and iOS devices, not a huge bump yet.", "verified": true, "helpfulness": "0/0", "author": "Lucas Lopez"}, {"rating": 2.0, "review": "Plain and simple Roku is a better product, more of everything to select from when you are searching for content on your TV.", "verified": true, "helpfulness": "0/0", "author": "Jim D. Farmer"}, {"rating": 5.0, "review": "One of the nest things I have bought in the last few years! So many options besides what the original instructions tell you.", "verified": true, "helpfulness": "0/0", "author": "frank metsaars"}, {"rating": 5.0, "review": "Works Great! Easy to install and setup.", "verified": true, "helpfulness": "0/0", "author": "L. Boyer"}, {"rating": 5.0, "review": "Worked like a charm! I'd recommend it!!!", "verified": true, "helpfulness": "0/0", "author": "Rogelio"}, {"rating": 5.0, "review": "Great price, on this right around Christmas 2014, I got one and bought another one. Great price and as always fast shipping !! Once you follow the directions and have wifi, your good to go !!", "verified": true, "helpfulness": "0/0", "author": "Danny L. Cox"}, {"rating": 5.0, "review": "works great!!!", "verified": true, "helpfulness": "0/0", "author": "cottonpicker"}, {"rating": 5.0, "review": "Love my chrome cast.  Works very well with a smart TV: when I am on my tablet and click the broadcast to chrome cast button (top right, square with a wireless sign) it automatically switches my TV to the correct input, and POW! We're watching YouTube videos.Only downside, but it's not a surprise at all is that with chrome cast you're limited to using youtube and a chrome browser.  I'm hopeful the next streaming media player will be more versatile and all around useful.", "verified": true, "helpfulness": "0/0", "author": "Joel E Stewart"}, {"rating": 5.0, "review": "I had computer connected to my big tv to do any internet related activities. Now with chromecast its so much easier to play anything, i dont use my comp anymore. Works great. Ones in a while it disconnects but connects right back in. Worth the 35 bucks. Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Kutashi"}, {"rating": 4.0, "review": "When it's working 85% of the time, I love it. It's small, its convenient/transferable, and its easy. It's a bit buggy, however. Sometimes it will cause the TV to turn on at random, other times the TV will refuse to recognize it. I find that if I unplug and replug all the Chromecast parts, it reboots and works again, but that is not a given. You will need to have an updated OS on at least one of your devices to download the Chromecast app and get this started. But once it is set up, you can watch/listen to Netflix, Youtube, Pandora, etc, from any device.I do wish there was a quick way to stream from Amazon. I don't see the point in buying a separate device for Amazon streams. I see online that there is a possible work around but haven't tried it yet.", "verified": true, "helpfulness": "0/0", "author": "Alice in Wonderland"}]