[{"rating": 5.0, "review": "Never thought I would own a streaming device, but we finally got it together and cut our cable and couldn't be happier! No more plugging in a laptop to HDMI to watch on TV and fooling around with audio or second screen shenanigans any longer. Sound quality is excellent on this device, remote is spot on and quick, even if you block it. Has a neat screen saver, short info/instructional video (not sure why this upset so many people, kind of silly). Device is much smaller than I pictured, which I am really happy with because it takes up hardly any space and you can put it anywhere except inside a compartment (which we don't have anyhow).Between Amazon Prime Video and Netflix, we have a lot to watch and are patiently awaiting other shows to come. Only thing they could add would be more content. Unfortunately, since we cut ties with cable, we cannot get some content that we would like to, but that comes with the territory.", "verified": true, "helpfulness": "3/3", "author": "Duke74"}, {"rating": 5.0, "review": "Just received Amazon Fire TV today.1. YOU MUST HAVE OR PURCHASE a HDMI cable to connect your Amazon Fire to your television setConnect the HDMI cable from the TV to the Amazon Fire. I have a 60\" smart TVConnect the power cord to the Amazon fire and plug into the electrical wall outletTurn on the TV, step by step menu appearsMy Amazon Fire had to download some software upgrades which took less than 5 minutesFrom unboxing to using took a total of less than 10 minutesI tried the movies, tv shows, ESPN, Showtime all excellentI have game controller on order, however you can still play games with the remote. I tried the new Ripdtide 2 game and it was completely amazing graphicsKids will surely love this featureI used my 7\" kindle Fire HDX and transfered HDX content to the main tv with easePhotos uploaded to the Amazon Cloud very clear and vibrantI set up a watchlist so I can keep track of the movies I want to watch later, very easyMy movies that I have purchased from Amazon show up in their own locationAmazon Prime as wellSet up my favorite radio stations with easewhen you have inactivity for a couple minutes the unit activates gorgeous screen saving rotating wallpaper. Better than having a painting hanging on the wall,I have 150 mbps internet and I do NOT have any cable TV or Satellite TV service. Everything I watch from local news to movies, to yahoo, to Netflix, to Amazon Prime has enough content to last a lifetimeI cannot see how anyone could rate the Amazon Fire less than 5 stars. This is the most advanced piece of home technology in the entire world and it will only get better with more services, applications, shows etc.I gladly pay for netflix and Amazon Prime and save the $100+ a month cable tv bill for other things.I would gladly shake Jeff Bezos hand and tell him that his team has created a truly state of the art device that is simple to useAnd yes I tried the voice command! Gary Busey movies popped right up as advertisedIf people are writing bad reviews there is a good chance they do not even own this.Cannot wait to get the controllers and play the new gamesBravo to Amazon for this product.This is the most amazing device I have ever owned", "verified": true, "helpfulness": "62/69", "author": "Bradford Page"}, {"rating": 2.0, "review": "Yes I did order this. I also own 3 Apple TVs and a Google Chrome. I bought this because it is fast, supports Dolby surround, and would supplement the lacking features of our Apple TVs (Amazon and Showtime primarily.) Much to my displeasure Showtime only works with AT&T;, Brighthouse, Centurylink, Grand, Optimum, Time Warner, & Verizon. SERIOUSLY...no DirecTv, Dish, or Comcast (the largest cable providers.) Who is negotiating these deals at Amazon? No HBOGo with the benefits of Dolby Surround. No Netflix integrated mic search features. Amazon is a smart company, the fact that this has been in production for so long, yet Amazon's leadership couldn't negotiate and secure key feature deals is ridiculous! This is going back to ASAP so that it doesn't become a $99 paperweight. I'll keep the Amazon Basics HDMI and buy a Roku 3!!", "verified": true, "helpfulness": "4/11", "author": "T. Pitcher \"pitchert23\""}, {"rating": 5.0, "review": "I have some cognitive impairment and mobility challenges from lupus, and I was able to set up Fire TV really easily.  The batteries go in the remote; the hdmi cable goes where it goes, and the power plugs in where it plugs in.  The interface is simple and intuitive, and you can get everywhere with the home button, the directionals, back, and select.  The only painful part for me/my hands was logging into my wireless network via the onscreen qwerty keyboard.The screens are responsive with virtually no latency, thanks to the quad core processor and 2 gb ram.  And video streaming is also very smooth.  I have only been using this a day, but I haven't had it pause to buffer yet.  I have a Chromecast in my son's room, a recent model Mac Mini in the living room, an older C2D Mac Mini in my room with Boxee on it, and a Raspberry Pi, and they all buffer at some point during just about every movie.  I stayed in a vacation home with a Roku 2 last summer, and it was great, but it also had to buffer a lot.  We also have three game consoles that have streaming video apps, and they buffer, too.  I think the Fire's secret may be its wifi card.  I am sure that, at some point, my ISP will find a way to slow it down.So, yeah, I am giving the Fire TV four stars for doing exactly what I need it to do.  I had come to Amazon to get another Chromecast, but I saw this and thought it would probably be better suited to what I need in my bedroom (I need my husband to be able to watch a tv show without my help - he is completely tech-challenged and cannot work the Dish remote - too many buttons).The reason it doesn't get five stars is that there aren't yet enough content apps.  There is a manga channel, a documentary channel, an art house channel, along with Crackle and Flixter and Plex (Plex is a for pay service that lets you stream your home content).  There is plenty to watch if you are a Prime member (I am - and I appreciated having that already set up on my Fire TV - Thank you, Amazon!) I am also a Dish subscriber, with HBO and a Hopper.  I have apps for those directly on some of my devices.  I can get them on the internet on the tbs I have hooked up to computers.  I can even blast them over to my Chromecast from my tablets.  But they aren't on Fire TV, and none of my tablets will screencast to Fire TV.  Soon as they are, this is a five star device for me.I read in Entertainment Weekly that HBO and Amazon Prime have come to an understanding that will make lots and lots of HBO shows available through prime, which will also make them available through Fire TV.  For the ones that are not, HBOGO will have an app for this.  Between that news and my son's enjoyment of an eight dollar (as opposed to 40 to 60 dollars) platformed on this thing, I am adding a star.", "verified": true, "helpfulness": "2/2", "author": "Elie 3173"}, {"rating": 3.0, "review": "This is amazing. I love it, I can't wait for my controller. The only thing missing is Aereo integration.  That's what's make the roku slightly better.", "verified": true, "helpfulness": "1/4", "author": "Nerissa Schultz"}, {"rating": 5.0, "review": "Amazon does it again! I received this as a gift and am absolutely thrilled that I can finally replace my roku device.", "verified": false, "helpfulness": "1/1", "author": "David T. Henigson"}, {"rating": 5.0, "review": "It was so easy to set up, it was already linked to my Amazon Prime account. So far so good.", "verified": true, "helpfulness": "2/2", "author": "AZLIBERTARIAN"}, {"rating": 5.0, "review": "Pros: It does exactly what it saysVideo on demand looks great on itSetup was super easySurround sound works!Cons: cant see prices easily or distinguish between free video and paid.  Even free videos show a price to buy below, but it's still not very clear.Can't search by season/ episode numberI would like an easy to access \"go away\" button for stuff I don't care about.", "verified": true, "helpfulness": "3/4", "author": "Low Blood Sugar"}, {"rating": 5.0, "review": "Love this thing as a supplement to my more serious (read nerdy if you must) gaming devices (PS3, PC).My favorite functionality would have to be loading up some Pandora, playing my favorite Nerdcore music station, then loading up one of the smaller (would be crappy on tablet but feels nice and responsive on game controller) indie-esque games. Super Daddio 2 is surprisingly fun. The little guy looks like he's bouncing to the beat!", "verified": true, "helpfulness": "3/4", "author": "Ni Doubt"}, {"rating": 5.0, "review": "WOW i cant say enough good things about the Fire TV. It is by far the best set top box available. I bought a Roku last year and used it only for a few hours. The Fire TV blows Roku out of the water. Also since Plex is available on Fire TV I no longer need to have a HTPC hooked up to my TV. Fire TV is now my primary source of entertainment", "verified": true, "helpfulness": "3/5", "author": "Sheeplover \"I'm Me\""}]