[{"rating": 5.0, "review": "Amazing just amazing!!", "verified": true, "helpfulness": "0/1", "author": "Austin Vine"}, {"rating": 5.0, "review": "i like this alot but i didnt know it only works on certain apps that you install on your phone so yeah it was kinda waist of money on my end but it works and easy set up so read before you buy this lol  but its still a good product", "verified": false, "helpfulness": "0/0", "author": "ki"}, {"rating": 5.0, "review": "Good for what it is. I use it to play podcasts from Pocketcasts on my android device to my TV. Streams smoothly.Haven't founf any music apps that will cast to my TV. I use Jetaudio for music.", "verified": true, "helpfulness": "0/0", "author": "V. Maharaj"}, {"rating": 5.0, "review": "Great Item, was recommended by one of my supervisors  now I'm recommending it to anyone who like to stream those dodger games and netflix to your TV easy set,", "verified": true, "helpfulness": "0/0", "author": "Erik Perez"}, {"rating": 5.0, "review": "Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Stephen Doerbecker"}, {"rating": 5.0, "review": "i absolutely love my Chromecast! i use it every day non stop! i actually downsized my cable channels and cable service because i have Hulu Plus and Netflix.  The only issue i have with it is sometimes it doesnt want to connect to my wireless internet however after sitting there for about a half hour and resetting all the internet connections it comes back on. (:", "verified": false, "helpfulness": "0/0", "author": "Kyle R."}, {"rating": 3.0, "review": "can't do much, don't need it on newer smartTV", "verified": true, "helpfulness": "0/0", "author": "XT"}, {"rating": 3.0, "review": "its pretty good... sometimes randomly gives me problems when trying to cast youtube videos..  i wish you could cast your screen to it.. the closest thing so far is just one tab at a time in the chrome browser..", "verified": true, "helpfulness": "0/0", "author": "Derrick"}, {"rating": 1.0, "review": "I didn't realize the player needed to be within 20 ft. of my router, so it did not work on the TV I bought it for.  My router is about 50 ft. and on another floor from this TV, so the Chromecast as it is was useless to me.  I returned it.", "verified": true, "helpfulness": "1/3", "author": "Marion Bartholomew"}, {"rating": 1.0, "review": "This an absolute piece of junk. Need AC power and doesn't stream fluidly using Googles own browser and Apps. WiFi reception is weak. Stick to Apple TV or something else", "verified": true, "helpfulness": "0/2", "author": "blondiegeek"}]