[{"rating": 1.0, "review": "I bought this to use with my PC Windows 7.  It doesn't work!!!  It's too slow.  It won't ork with Amazon Prime movies even with Adobe Flash or Hulu even at he lowest resolution setting.  Chromecast is even more worthless than Chrome!", "verified": false, "helpfulness": "0/0", "author": "Poli Sci \"davidb\""}, {"rating": 3.0, "review": "The price is awesome I love being able to stream anything my phone can. BUT the controls suck and a lot of the time I cannot pause netflix/YouTube because the controls completely disappear or just don't respond", "verified": false, "helpfulness": "1/1", "author": "ryan neufeld"}, {"rating": 3.0, "review": "I'm disappointed with the lack of ability to cast content from my laptop.  There are many advertised apps but not for laptops or pcs.  This should have been stated in the description.  If you're using a laptop, you must cast from the websites of your desired video content.  The only 2 websites I've had success with are Netflix and youtube.  Huluplus and MLB.tv are not usable.  MLB.tv. was one of the main reasons I bought this.  I feel duped.  :(  On the plus side it was easy to set up.  Sure glad I didn't spend too much on this.", "verified": true, "helpfulness": "0/0", "author": "B. L. Brown"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "ziggy"}, {"rating": 5.0, "review": "This is the second one I buy . Love it youtube netflix hulu any video on any webpage can be viewed on any tv cant beat the price", "verified": true, "helpfulness": "0/0", "author": "danny guerra"}, {"rating": 5.0, "review": "what this does is to stream from any device to the TV, it does not have any type of memory to add / download applications, the applications are downloaded into your device, Iphone, android phone, tablet and works with chrome if you install an extension,  I use ubuntu but i know it should work with windows and OSX, works great and does its job, it can be better but its a great and inexpensive option", "verified": true, "helpfulness": "0/0", "author": "Tantor"}, {"rating": 3.0, "review": "Ok product", "verified": true, "helpfulness": "0/0", "author": "Denny Birch"}, {"rating": 5.0, "review": "excelent!", "verified": true, "helpfulness": "1/1", "author": "Jesus"}, {"rating": 5.0, "review": "Great product Fast Shipping!!", "verified": true, "helpfulness": "0/0", "author": "Ronnie Higgs"}, {"rating": 1.0, "review": "I bought this to be able to stream my slingbox to my TV.  Sadly, you need to actually stream from your phone to the chromecast (but I knew this going in and I already had the iPhone slingbox app).  Even knowing this, I had no idea how buggy and non-usable this is.  The stream, which runs fine on the phone, stutters terribly on the TV.  After a quick google search, I found out that this is a known issue because it looks like slingbox incorporation with the chromecast was poorly done.Now that the main reason I bought this was a failure, we decided to just stream a video file from our laptop to the TV.  I got the Chromecast Extension for Chrome to push MP4 files from the laptop to the TV.  This worked better than the slingbox, with only a noticeable stutter once every ~15 seconds until roughly 5 minutes into the video, it began to stutter to no end.You get what you pay for with this device, sadly for me, this $35 of garbage is not worth the time of my $2000 TV.", "verified": true, "helpfulness": "0/0", "author": "Brent F."}]