[{"rating": 5.0, "review": "I must admit, I'm a tech geek.  Our Fire TV box arrived on Saturday, and I couldn't wait to get it playing.  It took me longer to get it out of the box, than it did to get it up and running!  Seriously, plug in the HDMI cable (not included) to the TV and the box, plug in power, and watch a show!  The Fire comes pre-programmed with your Amazon Prime account info, so there's no logging into anything.  The box includes a neat little video that explains how things work with the Fire.  Was watching House of Cards 10 minutes after opening the box!The voice search WORKS!  It does make searching for that show so much easier than typing all the on screen letters in.  Downloaded the Netflix app, and now can stream all my shows from one place! I have not looked at or even thought about any of the game apps available.  I am not a 'gamer'.  I might play a card game, or tetris like game, but that is about the extent of my gaming.  I did order two controllers (which are on back order until May) for the kids to play with.IF something changes, I'll update my review...for right now, I couldn't be happier with this.", "verified": true, "helpfulness": "3/3", "author": "6rmstds \"7rmstds\""}, {"rating": 4.0, "review": "Unit performs as advertised. It's extremely fast, movies seem to stream immediately without buffering. Very responsive, and the voice activated search works perfectly.", "verified": true, "helpfulness": "1/1", "author": "Lenster"}, {"rating": 4.0, "review": "The FireTV is a 'good' connected TV type device.I have used an own a number of similar devices including early and late model Western Digital boxes, Apple TV, Roku, Chromecast as well as Samsung BlueRay, Vizio TVs etc. so I'm familiar with what to expect - but the FireTV is (not surprisingly) perhaps the slickest of them all. Purchasing through Amazon meant that the setup was a breeze (account already configured) and everything just 'works'. Packaging was excellent for both the device and the controller.The device itself is solid and nicely quality and the remote is clean and discrete.The user interface is good but nothing stellar (Apple TV and Roku have clean interfaces too) - I was hoping perhaps for something more groundbreaking ... I don't know what though :-(The extra power is evident in both the smoothness of the interfaces and also in game play - it makes it OK even for use with the controller.The Apps are fine, everything that you would typically expect in a connected device, but again, nothing particularly jumps out although the speech driven search is very good and means less time trying to peck at the onscreen keyboard.Overall - I would recommend this over other devices just because of its ease of setup, smoother operation, speech capability and game play that exceeds other devices. The only reason for taking off one star is the price ... with the controller added this is well above other connected TV device prices and that sets the expectation higher, and I don't think it quite delivers at that higher level.Perhaps Amazon could put some sweeteners in the purchase like some free movies and, at least mentally, bring the bundled price with controller under $100.", "verified": true, "helpfulness": "3/3", "author": "P. Knightbridge \"old geek\""}, {"rating": 2.0, "review": "They need to address a way to control this product via IP or IR. I would like to add this to my Home Theater system but with no way to control via IR or IP it is impossible to integrate with higher end control systems. Deal breaker for me.", "verified": true, "helpfulness": "2/4", "author": "Craig Cooley"}, {"rating": 5.0, "review": "I read all the other reviews and looked at the comparison chart between the Roku and Amazon Fire and bought the Fire.  It was just as everyone said - easy to install, I was watching tv within minutes.  I love the ability to use the voice activation feature to search for shows.  My husband is a technophobe and even he can operate this!", "verified": true, "helpfulness": "2/2", "author": "Beancounter"}, {"rating": 5.0, "review": "i dont own this product but i dont see the information that im looking for. does it have a web browser?", "verified": false, "helpfulness": "2/6", "author": "aaron"}, {"rating": 5.0, "review": "I really like this product. It is a good upgrade from Logitec Revue. It was easy to install and will be enjoyed.", "verified": true, "helpfulness": "0/0", "author": "Gary Mitchell"}, {"rating": 5.0, "review": "Very fast video display for Prime videos. No waiting. The only App that seems to not be well done is You Tube.", "verified": true, "helpfulness": "0/0", "author": "James L. Wood"}, {"rating": 2.0, "review": "Does not work with Comcast Showtime. Voice activation only works with Amazon selections. Not well with netflix or others. Apple TV is a better choice at this time. Very limited app selections.", "verified": true, "helpfulness": "2/6", "author": "Libby's Pal"}, {"rating": 4.0, "review": "Right now I got rid of my cable TV and stream data over the internet. I LIKE FIRE TV!!..Unlike my Blu-ray ( with DVD), which costed me more than $99, Fire TV is very reliable with my Modem and Router....HOWEVER, I would like to be able to program more than 1 movie at a time. Especially sequels, or TV shows that has more than 1 episode or continuation. Like Spiderman I and II. Smurfs I and II, HOUSE..... Crackle TV, let you see continuing episodes of all the 3 Stooges. However, they have the same commercials.", "verified": true, "helpfulness": "1/3", "author": "WILLIAM"}]