[{"rating": 4.0, "review": "Desktop sharing is good.Sharing just a browser window is good.Everything else, I like Apple TV better.Good to buy if you are a Andriod user.", "verified": true, "helpfulness": "0/0", "author": "Subash Sunderrayappan"}, {"rating": 3.0, "review": "I purchased Chrome and found that it is really limited.  The only options are Netflix and YouTube.  No Hulu Plus or any other options.  I have 2 Apple TV's and I get 20+ options which include Netflix, YouTube, Hulu Plus, iTunes, my computer, my personal movies, and the list goes on.  If your interest is only YouTube and Netflix, then get it.  Otherwise, don't.", "verified": true, "helpfulness": "1/1", "author": "Donia"}, {"rating": 5.0, "review": "Works great! Even after I rooted it.The only negative:I think Google needs to catch up to the competition and let us stream media from our tablets and phones.Right now you can only send an approved link to it, and it streams directly from the web. (Like Youtube or Hulu)", "verified": true, "helpfulness": "0/0", "author": "Kousaka-san"}, {"rating": 4.0, "review": "I don't think we have master all the capabilities of this device but what we have we are happy about. =)", "verified": true, "helpfulness": "0/0", "author": "Lindy Hall"}, {"rating": 5.0, "review": "This is such a great product!! I haven't had any issues with it and when I stream things on to my television, it is instant.", "verified": true, "helpfulness": "0/0", "author": "Robin Banks"}, {"rating": 5.0, "review": "Very easy to setup and install on any device. Works great with Pandora and YouTube. I can pull it up on my phone and still continue to use my phone and it turns the volume down whilei am on the phone.", "verified": true, "helpfulness": "0/0", "author": "Samantha Alexander"}, {"rating": 1.0, "review": "It does not work well. The screen stops all the time. It was a total waste. The manual is too brief.", "verified": true, "helpfulness": "1/3", "author": "joseph \"joseph\""}, {"rating": 5.0, "review": "I bought this on black Friday and was disappointed with the limited functionality, but with the addition of plex, it's easy to cast almost all my media onto my TV. Unfortunately there's no way that I know of to cast amazon MP3.Setting it up was a breeze. Integration with Android is very good; with chrome a bit less so - sometimes there's a little lag in starting up a YouTube video, for example. Nevertheless,  love this thing.", "verified": true, "helpfulness": "0/0", "author": "puppyplus"}, {"rating": 5.0, "review": "I love it! I use it with Netflix an HBO to go mostly, it is well spent money an a bargain in my opinion.", "verified": true, "helpfulness": "0/0", "author": "vern quillin"}, {"rating": 5.0, "review": "Very good HD quality. But very limited with apps on apple products. I wish I could browse with I pad google chrome! With the desktop google chrome use loose the remote control!", "verified": true, "helpfulness": "0/0", "author": "Dosman"}]