[{"rating": 5.0, "review": "Works great. My roku died and I won't miss it. This is fast and has better picture than roku and is more stable. I just wish their search would look across you different services.", "verified": true, "helpfulness": "0/0", "author": "B. Wooten"}, {"rating": 5.0, "review": "We love Fire TV.  Amazon Prime can't be beat!  We are streaming faster than ever and have really enjoyed soooo many movies and TV shows.  Very easy to navigate.  Set up was a breeze.  Basically plug it in.  The voice remote is fabulous.", "verified": true, "helpfulness": "0/0", "author": "Q"}, {"rating": 5.0, "review": "Love itUse it all the time", "verified": true, "helpfulness": "0/0", "author": "Jose Salazar"}, {"rating": 5.0, "review": "Had problems with the shipping. I also had to pay an additional $7.55 in postage that pissed me off. But, I have to admit that I love my Fire TV. Super easy to hook up and works perfect. I love the voice command remote. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Nancy Barber"}, {"rating": 5.0, "review": "Love it !!!!!", "verified": true, "helpfulness": "0/0", "author": "Jo Ann Fromherz"}, {"rating": 1.0, "review": "bought this for free movies...what a damn disappointment! I still gotta rent em? who the hell is the brains behind this scam?", "verified": true, "helpfulness": "2/7", "author": "Timothy Waugh"}, {"rating": 5.0, "review": "So glad I got this...I love it", "verified": true, "helpfulness": "0/0", "author": "C. Wills \"chawaii50\""}, {"rating": 5.0, "review": "Dose this come with the tv... plez answer", "verified": false, "helpfulness": "0/1", "author": "yanelys martinez"}, {"rating": 4.0, "review": "It works as advertised. The UI is quick and well designed. The one thing it really needs is the ability to set a minimum bitrate for streaming. My internet connection is marginal for streaming HD, but can easily handle it with a little buffering. Unlike YouTube, Netflix, etc, I can't set the minimum bitrate, so the bitrate I can watch Amazon streamed stuff is at the mercy of their algorithm, which prioritizes no pauses over high quality.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Spence"}, {"rating": 3.0, "review": "Overall I am pleased but wish there were more recent movies among the free ones.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]