[{"rating": 5.0, "review": "Good to have", "verified": true, "helpfulness": "0/0", "author": "Richard Whit-mer \"Richard W\""}, {"rating": 5.0, "review": "i bought 2 of these as i have gotten rid of cable and im using only hulu and netflix (along with amazon instant video with a fire tv box).  it took maybe 5 minutes to set up & for it to do its software updates etc.  i am thinking of purchasing a 3rd so i can use all 3 tv's that i have but i may just leave the fire tv in the living room and put that chromecast on the 3rd tv.", "verified": true, "helpfulness": "1/1", "author": "neil taylor"}, {"rating": 3.0, "review": "The chromecast is hit or miss with my router. Be sure to check yours against their list", "verified": true, "helpfulness": "1/1", "author": "Kelly L. Perez"}, {"rating": 5.0, "review": "Arrived as expected, great product as described, as soon as I received it I started to use it with my Ipad and Samsung S5 with great performance", "verified": true, "helpfulness": "0/0", "author": "Randall Barrantes Serrano \"R's\""}, {"rating": 5.0, "review": "So cool. I have a roku which I still use for netflix and prime but this is great for streaming from other sites and works excellently.", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "This is a must have item. If you don't believe me, come to my house, remove the one in my husband's TV and wait 5 minutes until the \"OMG WHAT IS WRONG WITH MY CASTER THING\" starts.... you'll be giving it back before you know it, because he needs it to live. And this is a man who needs very little, in fact, his list of needs goes as follows:Food. Fluids. A tv, his phone, and this thing. Sure, he LIKES other things, but does he need them? Nope. Does he need this? Yes.... yes he does. I learned this last night when I had removed the Chromecast to watch LoTR downstairs, casting from my Galaxy s4 to a Samsung Smart TV that doesnt have Google Play (where I happen to own LoTR movies). My husband had been napping, so I figured he wouldn't even notice. Boy was I wrong. Right at \"We must join with Him, Gandalf. We must join.... \" I heard \"OMG MY CASTER IS GONE!!\" There might have been some adult male crying. I can't be sure. Regardless- I'm ordering another one. Because life can't be lived without this CASTER. Evidently.", "verified": true, "helpfulness": "2/2", "author": "Random Mom"}, {"rating": 5.0, "review": "very nice!", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 5.0, "review": "As usual great product by Google.  Only complain is that no chromecast addon available on mobile version of chromecast browser.", "verified": true, "helpfulness": "0/0", "author": "Sumon Roy"}, {"rating": 3.0, "review": "I've got it plugged into the back of my Yamaha stereo receiver and use it to link my HDTV with my Nexus 7 2013.I watch Netflix on the tablet or game while I'm doing video editing on my desktop PC.I used it to play Anodyne and Broken Sword 1 on my tablet, worked okay, but would crash sometimes.The good:-Streams Netflix fairly well-You can mirror a Nexus 7 2013 OK with itThe bad:-No support for Amazon instant viewing (that's more Amazon's fault than Google due to the lack of an Amazon android app)-Noticeable lag on Chromecast mirror feature-Prone to crashing sometimes using the mirror feature", "verified": true, "helpfulness": "0/0", "author": "Titus from Texas"}, {"rating": 4.0, "review": "Works well and when not in use it automatically scrolls through beautiful wallpaper's. The only user interface comes from an external source ie: mobile device, tablet or laptop. This is not a stand alone unit, must be used in conjunction with existing device.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Boland"}]