[{"rating": 5.0, "review": "Very happy with my kindle fire I still have the Kindle Fire and the Kindle Fire the latest one.", "verified": true, "helpfulness": "0/1", "author": "Sonja Hall"}, {"rating": 4.0, "review": "I love having the Amazon Fire TV and it's programming and software is really good but the darn thing stopped turning off and the only way I could turn it off is to unplug it but then in order to use it I have to plug it back in and wait for it to reload!!! I expected better from Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 4.0, "review": "Slow playback on 3d content", "verified": true, "helpfulness": "0/2", "author": "Serkan Polat"}, {"rating": 4.0, "review": "I was skeptical at first.  I previously used a Chromecast, Roku, and home built PC to stream my media.  After several months of use, the Amazon TV is now my favorite device.  I use it with Plex to cast my local media to my TV.  Amazon TV is fast, responsive, and turns on quickly.  In my several months of ownership I have only reset it one time.  In contrast I kept resetting my Roku device almost every other day.  This is a great solution if you don't have a SmartTV and want to stream your Plex local media.  I rarely use the Amazon services, but use it now and then to catch some of the HBO shows on Prime.  It would be a perfect 5 star if it allowed you to use the voice search on all apps.", "verified": true, "helpfulness": "1/1", "author": "Rivers8"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "buster"}, {"rating": 5.0, "review": "It's user friendly and it works seamlessly. We've only had it for a couple of weeks but there haven't been any problems so far. We cut the cable cord 5 months ago and haven't regretted it. It's so much faster and sharper than the gaming system we were using for Netflix and Hulu. Now that we've added Amazon prime, there's even more to watch if we want too. I love having Youtube that doesn't buffer on our tv. The music stations are great too. If you have a Bose sound system and have problems getting it to \"talk\" to the Fire TV call them up and they'll be happy to help you.", "verified": true, "helpfulness": "0/0", "author": "M. Kolias"}, {"rating": 5.0, "review": "Better than netflix especially for Prime members", "verified": true, "helpfulness": "0/0", "author": "A. Bell"}, {"rating": 5.0, "review": "Bought this to replace my under-powered OUYA to run XBMC/KODI plus it being discounted to $79.99 was a steal!!! Using  this everyday  for  viewing pictures (Amazon now offers unlimited storage for photos), watching Amazon instant videos, and run XBMC.Only negative...it needs a native Youtube app...other than that...can't ask for more.....I wonder if Amazon will send an OTA update to Lollipop for this box", "verified": true, "helpfulness": "0/0", "author": "DANNY"}, {"rating": 5.0, "review": "Installed and set up the unit in about 15 minutes.  Love the variety of entertainment and educational programming available with my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Daniel L. McKeeman"}, {"rating": 4.0, "review": "It's certainly the best out there right now. I will probably buy a second one soon.", "verified": true, "helpfulness": "0/0", "author": "James"}]