[{"rating": 5.0, "review": "Bought both the Fire TV and Fire Stick.  They're both good, but if I had to do it over again I'd get two Fire TV sets and avoid the stick.  The ability to use a blue tooth headset and the 2GB capacity make the Fire TV a winner.  I've got HD smart TVs and the picture is even better with the Fire TV.  Well worth the money.  With all of the apps you can add (Netflix, Hulu, HBO now - soon to be available) and the Prime TV content I don't miss cable at all. The 2 GB and dual core processor help with buffering issues that frequently occur with streaming services.  I rarely have disruptions.", "verified": true, "helpfulness": "0/0", "author": "janet van-y"}, {"rating": 5.0, "review": "As an old Fart who is not really computer oriented, it was simple, fast and easy to set up, even for me!!!  And when coupled with Prime, wow, good thing I am semi-retired, cause it use it quite frequently.", "verified": true, "helpfulness": "0/0", "author": "Ron Hungarter"}, {"rating": 5.0, "review": "Great product! Easy access to thousands of tv shows and movies! Simple to install and use and many great benefits as an Amazon Prime member! Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Tony A. Rohrer"}, {"rating": 5.0, "review": "I love my new Fire TV, but very disappointed that I wasn't told a new one was coming out in a months.  I do my research and it never fails I will be behind the times again.  I hope it's not that much better.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The hardware is quite good and the prime and netflix movies play without any hiccups. However, the other services are buggy, inconsistent, and need big time updating. Trying to get tech information from amazon is damn near impossible. Slick marketing videos are helpful for the mentally shallow, and technically challenged, but what about the people who have the skills to actually use this hardware for more than Netflix streaming? As an example where's the tech info to tell you about the implementation of Android? There's a usb port on the back of the unit. What can you do with it?This unit has a lot of potential, but without any information about it, except from the marketing department, I'm very frustrated with the state of the unit. If I'm going to be locked in to the hardware, the least Amazon could do is provide real tech info, and it would be nice to have  more info on system improvements, including when they will upgrade the os to lollipop.That being said, the fire tv has the potential to replace my satellite, especially if I can ala carte the channels I want instead of the packages directv forces me to buy. It's a better alternative to Apple or roku, but it needs lots of improvement.", "verified": true, "helpfulness": "0/0", "author": "Richard Maly"}, {"rating": 2.0, "review": "Like the little controller, but VERY disappointed in it's reverse/fast forward function.  Balky and doesn't work well.  Makes me sorry I didn't go with Roku...", "verified": true, "helpfulness": "0/1", "author": "Susan Dasse"}, {"rating": 5.0, "review": "The Amazon Fire Tv is awesome!", "verified": true, "helpfulness": "0/0", "author": "samples"}, {"rating": 1.0, "review": "Waste if money.", "verified": true, "helpfulness": "1/8", "author": "mike talton"}, {"rating": 5.0, "review": "I love my Fire TV.  The packaging that it came in was so nice it made the whole experience pleasant.  I felt like I bought something very expensive but at a decent price great job.  Hooking it up was very easy and so was the set up.  The only thing that I was upset about was the fact that the HDMI cable that you need to use fire tv is not included.  Why sell something with a piece missing.  I don't think the HDMI Cable would break the bank for Amazon to include it.  The voice recognition on the remote is very good considering Suri can't understand a word I say whenever I use it, I have never had an issue with the remote.  I am very happy with my Fire TV and you will be also.", "verified": true, "helpfulness": "1/1", "author": "Angel"}, {"rating": 5.0, "review": "This box is outstanding... Read Mr Hardin's detailed reviews and bought it. Had the fire stick but was getting alot of breakup of stream getting to annoying this box with quad core CPU runs like a champ I highly recommend", "verified": true, "helpfulness": "1/1", "author": "Robert R. Rooks"}]