[{"rating": 5.0, "review": "Greatest thing since (dare I say it) sliced bread. At first finding movies I wanted to see was not so easy but by looking under prime videos on the Amazon web site, it got easy. I really do like it & the voice search really makes it all the easier. I would recommend to anyone & I prefer it to the other like products IE: vodo etc", "verified": true, "helpfulness": "0/0", "author": "Ronald S. Clements"}, {"rating": 4.0, "review": "Great product. One suggestion would like to see greater separation, clarity between included amazon prime items and extra cost selections.", "verified": true, "helpfulness": "0/0", "author": "Samuel A Bell"}, {"rating": 5.0, "review": "I love it,  buying one for all my TV's", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Villarreal"}, {"rating": 5.0, "review": "This the 2nd Amazon Fire TV unit we have bought.  Totally love this! Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Tammy Kreger \"t_bar_tx\""}, {"rating": 5.0, "review": "Amazon Fire TV is even better than expected. Programing from Amazon, Netflix,  access to many, many video games -these are just some of the features available. If I could give this product more than five stars, I would.", "verified": true, "helpfulness": "0/0", "author": "john kimmel"}, {"rating": 5.0, "review": "Better than expected, a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Fraser Hill"}, {"rating": 5.0, "review": "Want something to supplement your expensive cable subscription and give you stuff you actually WANT to watch? Want to cut the cord to cable? Get a Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Joshua Henson \"Deo gratias\""}, {"rating": 5.0, "review": "I got rid of my cable, I love this thing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing my son got for the holidays.", "verified": true, "helpfulness": "0/0", "author": "Thomas Carlos"}, {"rating": 5.0, "review": "Had problem at first but after relocating wifi works great", "verified": true, "helpfulness": "0/0", "author": "Alan Eisman"}]