[{"rating": 4.0, "review": "very good product, colud be better if add more channel to enjoy the whole internet. Very useful, try it, very good.", "verified": true, "helpfulness": "0/0", "author": "Silvia Prieto"}, {"rating": 5.0, "review": "good as expected. No issues till now.Easy to install and got connected from all my devices, iphones and laptops", "verified": true, "helpfulness": "0/0", "author": "Prasanna"}, {"rating": 3.0, "review": "waiting for more vendors to partner with google to make this an everyday used itemworth the cost and hope for more content", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Hardy"}, {"rating": 5.0, "review": "I'm in love with our Chromecasts. I have one in our kitchen and bathroom. Makes it easy to connect to Netflix, Hulu Plus and Plex!", "verified": true, "helpfulness": "0/0", "author": "Mallory"}, {"rating": 5.0, "review": "for the price, this is once great little piece of equipment............have one on both family room and bedroom tvs...easy peasy", "verified": true, "helpfulness": "0/0", "author": "P. Sanders \"patcsan\""}, {"rating": 4.0, "review": "Extremely simple to use if you know how to use an iPhone, iPad, Android, etc.  It's capabilities are constantly expanding, as new apps are added.  The moment they add Spotify, I'll tack on a fifth star.", "verified": true, "helpfulness": "0/0", "author": "Dan Webster"}, {"rating": 5.0, "review": "Very easy to install and set up. Can stream from several devices.. mac laptop, iPhones. Good instructions.Loving it !!!", "verified": true, "helpfulness": "0/0", "author": "Srinivas R. Damalcheruvu"}, {"rating": 5.0, "review": "I love my Chromecast. The best thing about it is it's portability. Unlike the Apple TV that has a bunch of wires to connect, this plugs simply and seamlessly into the TV. I only bought one and I can plug it into my bedroom TV and three take it to the living room quickly and easily.", "verified": true, "helpfulness": "0/0", "author": "TheBooks"}, {"rating": 3.0, "review": "I wish I had read some of the reviews. This came quickly and will possibly work on my netbook. I bought this intending to use with my ipad. Wish I had read the reviews. As my daughter purchased one and loves it, I decide to get one for myself. She has a Mac though and it works great with that. The mobile app for chrome for the ipad does not support the chromecast. Wasn't aware of that. :( My netbook is slow so the streaming for this might now work well. Will have to test it out. I have a smart TV so I don't need this for netflix or any other apps that I can access on my TV. Will probably keep this so if my daughter will let me use her Mac I can access sites via chrome. Hopefully there will be an update for mobile chrome that will allow us to use this on the ipad.", "verified": true, "helpfulness": "0/0", "author": "Vlrech"}, {"rating": 5.0, "review": "This is amazing. I can stream movies and apps through my TV using my phone, tablet, and laptop. This works wonders compared to always HDMII hooking up my laptop", "verified": true, "helpfulness": "0/0", "author": "Zach Brannan"}]