[{"rating": 1.0, "review": "This is just another venue for pay-per-view movies.  Very disappointed.", "verified": true, "helpfulness": "1/4", "author": "Darrel Morrison"}, {"rating": 5.0, "review": "With my new LCD HD tv, the Amazon Fire TV was the right option to compliment my basic cable service. So many options when I am not watching live sports. The apps you can download just brings more options to your entertainment.", "verified": true, "helpfulness": "0/0", "author": "aljaksn"}, {"rating": 5.0, "review": "We have enjoyed Fire TV very much!!! It was easy to set up, it is easy to use, and we are very happy!", "verified": true, "helpfulness": "0/0", "author": "M. Dennis \"momofthree\""}, {"rating": 3.0, "review": "It's a whole lot of tv!! Too much. Flip channels for hours and they charge for anything new", "verified": true, "helpfulness": "0/0", "author": "jane"}, {"rating": 5.0, "review": "Exceeded my expectations for watching movies and gaming. Grandkids loved it.", "verified": true, "helpfulness": "0/0", "author": "Deborah K Sicks"}, {"rating": 4.0, "review": "Very happy with my new fire tv. Better than apple tv for sure and with prime it's still the best deal and cheaper than Netflix plus more benefits with prime too", "verified": true, "helpfulness": "0/0", "author": "Kristin"}, {"rating": 5.0, "review": "Voice search is amazing & like the small size..", "verified": true, "helpfulness": "0/0", "author": "Anthony J."}, {"rating": 4.0, "review": "Glitches sometimes", "verified": true, "helpfulness": "0/0", "author": "jarrod speer"}, {"rating": 5.0, "review": "Great job Amazon! Such awesome things packed in such a small product. Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "AdamZ"}, {"rating": 4.0, "review": "Enjoying the Fire Tv unit after challenging and 1 hour install that required assistance from tech support because of required software upgrade to make Netflix work properly.  My issue is that there was no automatic process for an upgrade like many Tech products on the market today nor were there easy troubleshooting hints on the screen that should have pointed me to a software upgrade.  I continually got a message when trying to use Netflix that it was awaiting a download of Netflix and should be available in a few minutes??  But looking beyond that we are happy with the product beyond some confusion on the Instant Videos that I thought were free because of my Prime membership but talking to Amazon today cleared it up a little bit but the access process is not that intuitive and would expect more instruction.", "verified": true, "helpfulness": "0/0", "author": "Donald L Averill Jr"}]