[{"rating": 5.0, "review": "Chromecast rules.", "verified": true, "helpfulness": "0/0", "author": "M. Templeton"}, {"rating": 5.0, "review": "plugs into hdmi.  power it by usb.  link it to your wifi.  set it up through your phone.  start casting.", "verified": true, "helpfulness": "0/0", "author": "Mobo"}, {"rating": 5.0, "review": "Fun toy. Makes tv far more accessible to phone media", "verified": true, "helpfulness": "0/0", "author": "Doc2Star"}, {"rating": 5.0, "review": "This was delivered within a day and a half. Makes watching Netflix a breeze.", "verified": true, "helpfulness": "0/0", "author": "Phyllis Mifflin \"Phyllis M\""}, {"rating": 5.0, "review": "Works", "verified": true, "helpfulness": "0/0", "author": "Cezary Koldys"}, {"rating": 1.0, "review": "I would not recommend purchasing or using Chromecast.  Even though it only cost $35, it was a waste of that money.  Unless you plan to cast from your phone, and only your phone (there are very limited sites you can do this with) this is not the right product to use.  Casting from a computer rarely works, and it depends on the day whether or not the device casts from any other device at all.  this is not an internet issue, as there are no other issues with slowness or inability for the internet to work on my other devices at the time I am trying to use Chromecast.  So far, it has been more frustrating than anything, and we plan to stop even trying.  As mentioned, you do not know from one day ot the net if it will work, and once it does, it only works for about 2 shows before it freezes up or stops running altogether.  Try another option.", "verified": true, "helpfulness": "0/0", "author": "jaime midtbo"}, {"rating": 5.0, "review": "Worked amazing!", "verified": true, "helpfulness": "0/0", "author": "Bronco"}, {"rating": 5.0, "review": "The best!", "verified": true, "helpfulness": "0/0", "author": "Paul in Oregon"}, {"rating": 3.0, "review": "works ok", "verified": true, "helpfulness": "0/0", "author": "MDEMAR"}, {"rating": 4.0, "review": "Great tool to have especially if travelling to places with TV stuck with stations you do not enjoy", "verified": true, "helpfulness": "0/0", "author": "E.M."}]