[{"rating": 5.0, "review": "tv must have hdmi input and a usb input, logs on thru google chrome and works beautifully. right now hard to buy.", "verified": true, "helpfulness": "0/0", "author": "robert a schroeck"}, {"rating": 5.0, "review": "Awesome gadget! It exceeded my expectations. Very, very easy to configure and to operate. The program for my Android was not available in my country and I have to download the apk apps from outside the Play Store. It shouldn't be restricted for any country.", "verified": true, "helpfulness": "0/0", "author": "Eric Javier Espino"}, {"rating": 5.0, "review": "great way to get netflix on the big screen. Note it needs a usb for power.  Software on line.  great", "verified": true, "helpfulness": "0/0", "author": "Lance LeBaron"}, {"rating": 5.0, "review": "Love it! Hopefully we'll get more companies supporting it soon but for now it's great to stream Netflix and youtube!", "verified": true, "helpfulness": "0/0", "author": "Oliver Acevedo"}, {"rating": 5.0, "review": "Received it Friday.  Plugged it into the TV, configured it for my network and started streaming YouTube and Netflix.  Watched about 4 hours Friday night and several more over the weekend.  It does what it's supposed to do and what Google says it will do.  I'm hoping there will be more services getting on board with the Chromecast.  I'll order 2 more for the rest of the TVs in my house.", "verified": true, "helpfulness": "0/0", "author": "Robert J Schulz"}, {"rating": 5.0, "review": "I could stream YouTube flawlessly to my non-smart TV and also use the Chrome browser to stream other types of media.There is a lot of potential for this product; looking forward to future support for other apps.", "verified": true, "helpfulness": "0/0", "author": "Alan M Wong"}, {"rating": 5.0, "review": "The Google Chromecast was easy to setup. In just a few simple steps I had it working with no issue. You need to use an Android device or PC to set it up after that you can use Netflix on your IPAD. It works great.", "verified": true, "helpfulness": "0/0", "author": "Kevin M."}, {"rating": 5.0, "review": "Have been using it for a week and an awesome product for the price. Worked seamlessly from my PC and for Netflix/YouTube. Waiting for the iOS app.", "verified": true, "helpfulness": "0/0", "author": "Balaji Sekar"}, {"rating": 5.0, "review": "SO easy to hook up and download !!! My family and friends are soooooo jealous. This gadget is a perfect \"Christmas stocking stuffer.\" Surely by then they will be off backorder !!!!", "verified": true, "helpfulness": "1/2", "author": "CRC"}, {"rating": 5.0, "review": "This is perfect for casting movies and videos directly to my tv i use it constantly, and all from my phone how terrific is that!", "verified": true, "helpfulness": "0/0", "author": "danny green"}]