[{"rating": 3.0, "review": "Not bad, however it needs a remote, but I recommend you spend the cash and get Apple TV! Nothing compares to Apple in design and ease of use!", "verified": true, "helpfulness": "0/1", "author": "Joel turner"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "The Heat Is ON"}, {"rating": 5.0, "review": "WORKS WELL, NO STREAMING DELAY", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I purchased this at the beginning of the year, and now 7 months later, it does not work.  This was a complete waste of money.  I only used it a handful of times, so i'm not sure why it would have broken.  It has not even been moved out of the TV since we bought it.  Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Do not buy a chromecast device.  Yes, it can work, if you are willing to re-install everything each time you want to use it.  If it doesn't drop the wireless connection within the first few minutes, it will not let you cast from a laptop.  When it works, it is fine, however, it works so seldom that it is virtually useless.", "verified": false, "helpfulness": "0/3", "author": "Oneoldguy"}, {"rating": 5.0, "review": "Bought this product for my friend for her birthday and she obsoletely love it. She uses it mostly for watching Netflix by projecting it from her phone into her nice flat screen TV. I have roku in my living room and I love it a lot, but I am considering buying Chromecast for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Estella Ilesanmi"}, {"rating": 5.0, "review": "all ok!", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 5.0, "review": "I think this works just as well as Apple TV, and now with Plex media server it makes it even better.", "verified": true, "helpfulness": "0/0", "author": "Denver"}, {"rating": 4.0, "review": "Easy to install for even the more 'remedial' computer person.  Now we can stream our Netflix!!", "verified": true, "helpfulness": "0/0", "author": "Jamie Halverson"}, {"rating": 5.0, "review": "My son is thanking me everyday for this gift that I gave to him. He is really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "LINDA CYMBALA"}]