[{"rating": 5.0, "review": "I bought 2 of these - one for the kitchen TV, and one for a guest bedroom TV that doesn't have a satellite connection. They are easy to set up and connect to WiFi. I have an old cell phone which I keep charged and connected to my WiFi for guests to use Netflix when they are here.", "verified": true, "helpfulness": "0/0", "author": "Janet E. Puncheon \"jp\""}, {"rating": 5.0, "review": "Good for laptop to TV viewing and presentation", "verified": true, "helpfulness": "0/0", "author": "Ralph Atansuyi"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Allen R."}, {"rating": 5.0, "review": "Very cool product! razonable price and very functional.", "verified": true, "helpfulness": "0/0", "author": "Luis Rosales"}, {"rating": 3.0, "review": "I bought this Chromecast thinking i could play my downloaded movies and view my pictures and home movies. You are not able to play downloads movies but can stream thru netflix. I also can not view my home movies or pictures directly from my phone but can thru google+. I also have to broadcast my SSID, this will not work if you don't. I even got it set up and working then stopped broadcasting like others mentioned in comments but it will stop working. I can use my laptop with the chromecast plug in installed in Chrome and view web pages but not able to do that from my phone, at least i haven't figure out how yet. Youtube is supported and can easily view from laptop or phone. Since i don't have a netflix subscription i only use this when viewing pictures or i want to look at websites on a bigger screen. Would be nice if the software would be updated so i can stop broadcasting my SSID.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Orlando Cole"}, {"rating": 1.0, "review": "It didn't do what I expected it to do.I sold it on ebay", "verified": true, "helpfulness": "0/1", "author": "Smooth"}, {"rating": 5.0, "review": "This makes your TV a Internet TV at a fraction of the cost of buying one with this option. My friend spent a lot of money on his new internet TV and is jealous he didn't just get one of these. We use it often and is simple to install and use. For $30 delivered you won't find a better price. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Mike Karnes"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Jose Infante"}, {"rating": 5.0, "review": "Very good product.", "verified": true, "helpfulness": "0/0", "author": "André Luiz da Silva"}]