[{"rating": 1.0, "review": "Bought this expecting that I could use it in place of and HDMI cable.  Not even close.  Just about the only thing it does well is cast youtube videos and that is just a redundance since I have a smart TV.  I try to cast hulu and the play screen just apears black on the screen.  I thought this would be a wireless version of a HDMI cable but it is far from that.  Looks like I'm back to hooking up my laptop to my home theater system.  Thats the only reason I don't just watch netflix and hulu through my TV because I can't get surround sound.", "verified": false, "helpfulness": "0/2", "author": "Dustin"}, {"rating": 3.0, "review": "Good, but it can not be turned off. Must be disconnected. It took overheats. grave failure", "verified": true, "helpfulness": "0/1", "author": "Oscar D."}, {"rating": 5.0, "review": "Awesome seller! Fast shipping. Items are as described. Very happy. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Scorps53 \"RipVanWinkle\""}, {"rating": 4.0, "review": "We really love this product. Works extremely well and Google has offered plenty of incentives since we've purchased it - free movies, subscriptions and credits. Only criticism would be a lack of channels (apps) but I'm sure that will change with time. Plenty of kids apps which is what we primarily use it for.", "verified": true, "helpfulness": "0/0", "author": "J. Ganan"}, {"rating": 5.0, "review": "awesome I love it .", "verified": true, "helpfulness": "0/0", "author": "Taiba"}, {"rating": 1.0, "review": "Chromecast sucks. It would be awesome, if it worked. In the course of a 45 minute show I get the \"this video won't load\" error at least twice. That's not counting the 5 to 10 times the video stops to buffer. Hulu, Netflix, etc. play fine on my TV apps and playstation. The only time I get errors or buffer pauses is when using chromecast. It would be an awesome device if it worked as well as EVERY OTHER DEVICE IN MY HOUSE. Seriously, chromecast is the only video source that does this. Yes, I realize buffering is the weird uncle of our video streaming society that no one talks about, but it is a constant interruption with chromecast. I have yet to watch even one show or movie, on any platform,  using chromecast without a buffer pause. Literally, every time I use it I have to restart whatever I'm watching. Maybe I got a bum unit, but my observations have been made by many other reviewers. I'll throw this chromecast into the box with my zip drive, laser discs, and betamax and wait for Google to release hardware that works.", "verified": true, "helpfulness": "0/1", "author": "Helixx"}, {"rating": 4.0, "review": "Have had few problems, I could not download the extension to android but now the chromecast app has mirror to TV feature.", "verified": true, "helpfulness": "0/0", "author": "Deborah"}, {"rating": 5.0, "review": "Plug and play. down load some apps and watch. its that simple.", "verified": true, "helpfulness": "0/0", "author": "nghiem u ho"}, {"rating": 4.0, "review": "i couldnt be happier streaming all my shows and controlling it directly from my bed.", "verified": true, "helpfulness": "0/0", "author": "Oscar Berrios"}, {"rating": 5.0, "review": "Great!!!!  Only needs the option of a remote to be perfect!!", "verified": true, "helpfulness": "0/0", "author": "Roberto Delgado"}]