[{"rating": 4.0, "review": "Better have good internet connection.  Flakes out sometimes when using iPhone or iPad devices.  However, that could be a cause of internet issues just figured out we had from high-speed provider.  I will say that it kinda stinks that you cant stream anything you want to the device.  You are restricted to YouTube, Hulu and anything from your browser.  The took away the ability to stream without hacking the thing to death local files.  That sucks........It would be so easy for Google to let that feature work as I believe they would have a difficult time keeping them in stock.  I own 5 of them and give them to clients etc.....", "verified": true, "helpfulness": "0/0", "author": "Tyler Spore"}, {"rating": 4.0, "review": "The chromecast has been a good addition to our home.  Setup was really easy to do and follow.  It works great streaming netflix and youtube videos from any computer in the house.  I love being able to use streaming music stations as well to send music to my sound system using any device that has the chrome browser.  One issue that I have run into and should note is that when using other video streaming services the video stream can stutter and is not as clear as netflix and youtube.  This is more of an issue when trying to push the video from a wireless connected device.  It seems this is a problem with my wireless network not having enough room or bandwidth to play video using a wireless connection from the internet to my computer and then using the same wireless connection stream it to the chromecast which can only be used with a wireless connection.  A computer wired to the internet and then pushing video to the chromecast using the wireless connection smooths out most of these issues.  Overall for the money you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Fievel"}, {"rating": 4.0, "review": "It's fairly easy set up. I love that I can stream things like Google Play on the tv but I can't wait until there are more apps available.  Cool device/technology!", "verified": true, "helpfulness": "0/0", "author": "Andrea Hancock"}, {"rating": 5.0, "review": "I really love this little guy!  I have a HD TV with a great picture but no apps. Every time we want to watch Netflix or Amazon Prime we have to drag the laptop over to the TV and balance it on the rocking chair and hope no one trips over the HDMI cables, then run to it every time we need to pause. pain in the butt! Now with the Google Chromecast we have Netflix, Amazon Prime, Hulu (haven't tried this one yet), and YouTube always there when we want it. The unit is small, about the size of a lighter, and plugs into an HDMI port, it also needs power and comes with a wall plug or USB. My TV (like most) have some extra HDMI and a USB on the side so it makes a small loop to the HDMI and USB right next to each other, take up about the same space as a deck of cards. You can barely see it when looking at the TV and definitely nothing to trip on. Setup was very easy, You use a laptop to point it to your wireless. You then queue up what you want to watch on TV using a laptop or Android phone but it communicates straight with the wireless so the video isn't streaming through the laptop or phone. You can then use the laptop or phone to pause, put more movies in the queue, or change the volume.", "verified": true, "helpfulness": "0/0", "author": "Frank N. Arthur III"}, {"rating": 5.0, "review": "I have a Roku and bought this to  supplement it. Chromecast is great! One thing I didn't know, I can cast my entire desktop to the TV, so I use this to show others when they ask how to do something with a computer.", "verified": true, "helpfulness": "0/0", "author": "AprilWhine"}, {"rating": 5.0, "review": "Great product. Still alittle limited to content but has tons of potential.  Well worth the $$$$. wifi works great and picture quality is awesome.", "verified": true, "helpfulness": "0/0", "author": "William Franklin"}, {"rating": 4.0, "review": "Works well with my PC and my iPhone 4.  I'm disappointed that it only works with Hulu, Netflix and YouTube from the iPhone.", "verified": true, "helpfulness": "0/0", "author": "R. V. Byrd \"Bob\""}, {"rating": 5.0, "review": "Great device, especially given the potential once the SDK opens.  Right now it's adequate for netflix streaming, and great to use in a chrome tab for spotify.", "verified": true, "helpfulness": "0/0", "author": "Alex Land"}, {"rating": 3.0, "review": "Disappointed that it only works with Netflix and YouTube. Expected it to work with Amazon Prime. Hopefully it will be less limited in the future. Works OK with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 3.0, "review": "I purchased this to use with my MacBook Pro, running OS 10.6.8. When I went to set it up, it told me I needed OS 10.7. If I upgrade to 10.7, I will have to upgrade over $1,000 worth of software. So, I bought a Google tablet, Samsung Nexus 10. This enabled me to set it up, but I could not cast from Chrome Tabs, because that app does not exist. I could cast from YouTube, Netflix, but not Chrome Tabs. So, I tried my Mac and I can cast from Chrome Tabs from it, even running OS 10.6.8. It works well, but I can't give it a 5, because I can't believe they require me to use my laptop to cast Chrome Tabs. I would love to be able to cast those tabs from my tablet, as it is a lot less to have in my lap. Oh well, maybe someday.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]