[{"rating": 5.0, "review": "Received one yesterday. I setup the device on Android phone. It was easy and straightforward. YouTube and Netflix were up running in no time. One thing you may pay attention is that the device only supports 2.4G Wi-Fi. If you have a dual band router, usually you will see two SSIDs on your phone. For example, NETGEAR and NETGEAR-5G. Connect with NETGEAR. Hope it helps.", "verified": false, "helpfulness": "1/1", "author": "Cheng"}, {"rating": 4.0, "review": "First and foremost, it works!  Though it has a limited sampling of services available, it's Google and I'm sure they'll improve it in due time.I'd like to state for the record, that I use [...] to do a lot of my casting and the Chrome tab streaming feature has yet to disappoint.  Just make sure that if you are going to use it that you either don't have a ton of web traffic going on or purchase Connectify Hotspot, ([...] there is a 30% sale going as of this writing,) and put it on the PC you're going to be using most to stream to the Chromecast.  If you plan on using this in a hotel just do yourself a favour right now and go purchase that software and get it all set up before you leave.All that said, my only real big gripes with the item right now are that you can't stream from an Android device and certain services, (read Amazon streaming!,) don't work with it at this time.  I hold faith in Google that they will open these gates a little at a time and find the best solution for everyone.Seriously though, go buy it and Connectify Hotspot and it'll cost you a whopping $65 for something this portable. Yeah, totally worth it!", "verified": false, "helpfulness": "1/1", "author": "Michael Hopfensperger"}, {"rating": 5.0, "review": "Very easy to install and easy to use with iOS or android device.  Turned my phone into a remote. Very glad I bought it.", "verified": true, "helpfulness": "1/1", "author": "Kindle Kid"}, {"rating": 3.0, "review": "I love the price (only $35!), but early reports/articles said this would be AirPlay compatible, which it most definitely is not.  I see now the description is much clearer about what is supported and what is not.  The $99 AppleTV is far more useful with IOS devices (obviously what I have).I really hope this product takes off and Android users get something that is more equivalent to the AppleTV.  It is definitely a really good start.  I would *LOVE* if this actually had AirPlay support so I could give presentations off my iPad wirelessly.  There's always the hope for a firmware update. ;-)", "verified": true, "helpfulness": "0/1", "author": "Nem"}, {"rating": 3.0, "review": "I just received the Chromecast expecting to be able to \"cast\" anything I was viewing in my Android tablet's Chrome browser to my TV via my WiFi network. I also expected the tablet to act as the remote, allowing start, stop, fast forward and reverse of the displayed video.But, so far, you get this functionality on Android devices ONLY if using Youtube, Netflix or Google Movie apps. The mobile Chrome browser does not support Chromecast, so you can't cast videos from generic web pages. That's a huge deficiency, IMHO.If you use a Windows or Mac PC, you can add a Chromecast extension to the Chrome browser and then you get the ability to cast any web page to your TV. Control of the video is from the PC, so you need to have the PC near the TV. If that's the case, Chromecast is just a glorified HDMI cable. So here's where there's room for improvement: it would be great if you could set up your PC to cast to your TV but still be able to use your Android phone or tablet as the remote control.Pros:Inexpensive.When used with a full PC and Chrome browser, can view any web page on your TV via WiFi.Also can view video and photos stored on your Android or PC device.Cons:Use with Android devices limited to a few apps (YouTube, Netflix, Google Play).Chrome mobile needs to be updated to support Chromecast extension so that any web page can be cast to the TV.No external Remote included so you need to be near the \"casting\" source to control videos, etc.", "verified": true, "helpfulness": "25/30", "author": "Amazon Customer"}, {"rating": 4.0, "review": "**UPDATE**I orginally had the chromecast plugged into an extension cord via the charging block, which created a bit of an eye sore with the cableing. But, I somehow remembered there was a USB port in the back of my cable box (yes, I still subscribe to cable, Time Warner nonetheless...) In any case, I gave it a shot, and voila! It actually powers the device. I thought it would power down once I turned off the cable box, but nope, apparently the box continues to supply power even when the box is off. So now I dont have to route the power cable and extension cord just to power it. I should also add that i have the chromecast plugged into a HDMI switch, since my tv only has 2 HDMI ports. And it works just fine this way as well. </update>**start original review**First, what is with all the 1 or 2 star reviews saying it doesnt do much? Did you people not do your research on what this can/cannot currently do? Yes, app support is minimal right now, but they told you that it only supports Netflix, YouTube and google play vids right now, and that tab casting is still in Beta! Anyway...onward to my reivew-Finally received this after waiting a month and a half here on Amazon. Set up couldnt have been more straightforward. Plug Chromecast into HDMI port. Plug in the power (either to an available USB port or outlet). Go to the chromecast set up webpage to download the setup. Follow the on screen instructions. Start casting!I dont subscribe to Netflix, so I'm really banking on other app support soon. But I did try out youtube and a bunch of sites that offer streaming video, such as ESPN, Hulu, Aereo and sites of various tv stations (MTV, CW, etc) on my laptop using the Chrome browser. Also tested out youtube from my iphone. All cast without a problem. I dont know why I was surprised that even the audio was casting through the device, but it was! which is great so i dont have to connect the laptop thru my sound system.Must admit the picture quality is not where I would like it, but hoping that'll change once apps start supporting it. Also, as some have mentioned, Amazon streaming is not supported right now, at least in full screen. You can cast the tab and watch it in the browser, but once you try to full screen it, it doesnt work.All in all, you can't lose for $35. Here's to hoping other popular apps jump on board soon, and google allows casting local videos!", "verified": true, "helpfulness": "1/1", "author": "B. Huang"}, {"rating": 3.0, "review": "I wanted something that would let me stream Netflix offerings to my TV in a simple way and at a reasonable price. This device does that, but with a couple of stumbles along the way.First, set-up didn't work properly the first time, which was a little alarming for a device that is highly touted for its simple installation. I suspect it was a local network problem. I repeated the process and got the connection working on the second try.I set up device control on both a recent Android phone and on a year-old iPad. Since you control the TV display from your wireless device (pause/resume, forward/back, subtitles and so forth) rather than your standard remote, there is lag time in making changes because you have to wake your controller up and let it figure out the current state of your Netflix stream before you can, for example, pause the stream. A couple of times my iPad has lost all playback control completely, and I had to power-cycle the device to get it to connect with the Netflix controllers correctly. Maybe I am unwittingly doing something that messes up the connection, or maybe not. Still, a properly designed control system should make it impossible for a new user of the technology to march in the wrong direction.A caution: if your HDTV is an older one (say 2007 or before), it may have only one HDMI port on the back. If so, and if that port is given over to a cable box connection, you will need an HDMI switch to accommodate both your cable feed and the Chromecast device. Or you can use a set of standard cords to get the cable signal into your TV, freeing up the HDMI attachment point. In the worst case, you can just unplug the one and plug in the other when you need to switch feeds.You can't beat the price, but I'm wondering if I will end up with something better (Roku?) to replace this as time goes by. We'll see.[Edited after posting to correct typos.]", "verified": true, "helpfulness": "0/0", "author": "David Wilson"}, {"rating": 3.0, "review": "I didnt do too much in depth research before ordering my Chromecast. I just heard all the buzz about it, and everyone comparing it to Apple TV. Im a little disappointed in its functionality at this time. Thought I know it will get better...out of the box, its no where near as functional as Apple TV and I dont even see how people can compare the two. And I hate Apple.Right now, you only get youtube, netflix (to which I dont subscribe), and Chrome tab casting from a computer. Not very exciting.Set up was very slick thought. Couldnt have been easier, and I liked how they designed the set up and installation.", "verified": true, "helpfulness": "0/0", "author": "Troy Carroll"}, {"rating": 5.0, "review": "Have been impressed by this gadget.  Works fast and doesn't stream as some others do.  Clear and simple instructions to follow for an easy setup .", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 2.0, "review": "To complecated to use. I gave it away. I will stick to Roku for my needs with Streaming vidio shows.", "verified": true, "helpfulness": "0/5", "author": "tmd60"}]