[{"rating": 1.0, "review": "Chromecast could not deal with my WiFi setup I guess, so it did not work in my home wifi net. Also, the setup process is horrible. I mean, the setup software creates an ad-hoc network without even asking your permission for it!!!! I had other connections/downloads running at the same", "verified": true, "helpfulness": "0/1", "author": "Marcelo"}, {"rating": 5.0, "review": "What an awesome concept.... Turns almost any newer television set into a 'smarter' tv.... thank you so much!", "verified": true, "helpfulness": "0/0", "author": "Kathrynne Krause"}, {"rating": 4.0, "review": "Works well.  I would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Brett Thomas"}, {"rating": 5.0, "review": "This is a game changer. I don't have cable so I run my TV off computer or tablet. This lets me use my tablet as a remote control so I don't have to get up and pause the video on my computer to answer the phone. I binge on Netflix since I got this thing.", "verified": true, "helpfulness": "0/0", "author": "Kristin P Noreen"}, {"rating": 4.0, "review": "Works well, the fact that it can't get power from the HDMI port is a bit obnoxious, dropping Google a star because they decided to turn netflix into an \"app\" rather than just letting you cast the page (which you can sometimes cause to happen by accident if you know what you're doing) the reason this is a negative is because it doesn't play the next episode automatically, and if you happen to want to get stoned and watch 11 minute cartoons endlessly forever you have to manually select each one which is kind of obnoxious.", "verified": true, "helpfulness": "0/1", "author": "Clockwork"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "Excelente product, looking forward for the next purchase.", "verified": true, "helpfulness": "0/0", "author": "Sergio Bertarelli Jr."}, {"rating": 5.0, "review": "The best purchase I made in 2014.", "verified": true, "helpfulness": "0/0", "author": "Vince Paul Calvo"}, {"rating": 3.0, "review": "It was difficult to get it installed, back and fore. At the end it works, but would be great if it was more easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Welcome to the future. Google 4 life.", "verified": true, "helpfulness": "0/0", "author": "Rexzon Hizon"}]