[{"rating": 2.0, "review": "To start on a positive note: it is a very nicely executed little box, build quality comparable to an Apple TV. The box has sufficient horsepower do deliver a snappy user experience, the remote feels really nice and thanks to Bluetooth does not require you to point at the TV. The software is very clean and stylish... and will work just fine if all you want to do is consume Amazon content.Now to the drawbacks: the software is extremely limited. Actually, one cannot just install any Android app. Not even any app from the Amazon app store. Basically none of the apps I would be interested in can be installed in a clean way. Or in other words: If you go with this box, you will need more boxes from other content providers. Think again, this is not a terrible idea: I have 3 HDMI ports. 1 goes to the BluRay player, one to the gaming console and one to a streaming box. But this one port will go to the box that promises delivers the maximum available content. And sorry, that's not a Fire TV. Amazon, start embracing an open world.", "verified": true, "helpfulness": "0/3", "author": "BB"}, {"rating": 2.0, "review": "I ended up buying this because I needed to view my Kindle fire screen on a tv. I have a Fire HDX and Amazon removed the ability to just plug your Kindle into your tv with an hdmi cable on this model. (Thanks, Amazon, well played) I have great internet service but being able to mirror my tablet screen is spotty at best. You can easily waste up to 20 mins trying to connect. Or you have to unplug and replug.  Viewing TV shows and movies is fine but I much prefer the format of my Roku over this. There are channels not available on the Fire that I get on the Roku such as HBOGo and the Fox network channel. Not all that happy with this product, will primarily use my Roku.", "verified": false, "helpfulness": "1/4", "author": "Gummibear"}, {"rating": 3.0, "review": "It's okay but need more shows.", "verified": true, "helpfulness": "0/1", "author": "Herrera3811"}, {"rating": 2.0, "review": "Easy to install and work. Until I cancelled my prime membership. Now Home is not available and my wifi is suddenly poor.  I can still get my Netflix and Hulu plus on my I pad. Could not find a number to call.  The advice on line didn't do much. Disconnect power then turn back on and that was the advice.  I even re entered the password to wifi. It only said try again later.  Tired of trying. Bought crap yet again.", "verified": false, "helpfulness": "0/3", "author": "elizabeth zbikowski"}, {"rating": 5.0, "review": "Every bit as easy to set up as was promised. Was a little concerned about whether or not the unit could get a clean signal off of my old router, being as how it was so small.  Not to worry. Works a heck of a lot better than the wireless blue ray player that I could sometimes get to work with Netflix. Can not imagine it working any better.  The voice search is just great. Also love the way it interacts with the Fire HDX I got my wife for Christmas. The thing takes up just about NO room. The physical size just baffles me, considering what it can do.  I haven't tried every thing out yet, but I am REALLY impressed!!", "verified": true, "helpfulness": "0/0", "author": "Tombodian"}, {"rating": 5.0, "review": "I would choose this device over an Apple TV, only cause I feel that there are a lot more apps to choose from. Only issue I have with it so far is that their app search is a bit confusing.", "verified": true, "helpfulness": "0/0", "author": "Chong"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "chris menard"}, {"rating": 5.0, "review": "I am in the process of familiarizing myself with everything it will do, but thus far, I really like it.", "verified": true, "helpfulness": "0/0", "author": "Mary J. Wilson"}, {"rating": 5.0, "review": "Anazon I love you like a love song.", "verified": true, "helpfulness": "0/0", "author": "Erin Oliver \"Erin Oliver-Warren\""}, {"rating": 5.0, "review": "My Hubby and I were very pleased with the arrival of our Fire TV.  The box was all pre registered.  Hooking it up to our TV was simple.  We have WI FI and the longest part of the installation was typing in the password.  In less than 10 minutes I would say we went from box to watching the welcome video.  It gave us a quick walk through and went over how to use the remote.  Very impressive.We are using this for our Prime account only.  But this box can be used for more.  I am impressed with all the movies and shows available in all genres.  I look forward to many hours watching all the goodies.  I highly recommend getting a Fire TV box  it is $99.00 well spent.  Just don't forget to purchase the HDMI cable to connect the box to your TV.  It is not included.", "verified": true, "helpfulness": "0/0", "author": "Silver Fox"}]