[{"rating": 5.0, "review": "I bought this for my downstairs living room, and I was not able to use it for almost a month because my older sister marathoned a show with it,which got so bad that I almost returned it, so I guess thats a good thing? My only complaint is that it does not automatically go to the next episode.", "verified": true, "helpfulness": "0/0", "author": "S. Ahmed"}, {"rating": 1.0, "review": "Item broke a few months after I bought it. Worked fine in the beginning, but didn't seem to have a solid connection and would not work properly until the whole prong stayed in the tv while I was trying to get reception. Just enough time had elapsed so I couldn't ask for a refund. Learned my lesson to return it the minute it starts not operating properly.", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 5.0, "review": "Warning... If you have slow internet (less than 4 megs) it will slow your other devices down if not unplugged when not in use.", "verified": true, "helpfulness": "0/0", "author": "Cameron H."}, {"rating": 5.0, "review": "For the cost of this, it is a wonderful device!We currently have a PS3 and a Sony Blu ray player that are all capable of playing Netflix movies, but nothing to play videos from Google so I thought I would give this a shot.  In my mind this blows all other digital streaming devices out of the water!  So easy to use, to configure, everything!I had this installed in less then ten minutes, and had taught my wife how to use it within the next 15 minutes.  The engineering behind this is incredible!", "verified": true, "helpfulness": "0/0", "author": "Jacob"}, {"rating": 1.0, "review": "I came home after work today and found that the chromecast update today used close to 25GB of data totally wiping out my monthly data allotment. If you use this you want to have unlimited data or else it will suck you dry!", "verified": false, "helpfulness": "0/0", "author": "Terry Petty"}, {"rating": 5.0, "review": "I bought 4 of these, one in each room. I use my android phone to cast youtube movies, vevo music videos, or just listen to podcast via Doggcatcher. I'm sure more cool apps will become available, AllCast is a promising application that allows me to stream all my media files on my phone, as well as my home media server. Love it!", "verified": true, "helpfulness": "0/0", "author": "Robert Novotny"}, {"rating": 3.0, "review": "we can't play all videos from a phone. Only youtube. even chrome browser videos are not playing in tv. better to have a apple tv.", "verified": true, "helpfulness": "0/0", "author": "Venkat Reddy Dayam"}, {"rating": 3.0, "review": "I'm about done with this thing. When it works, it works great. But OFTEN it just doesn't show up in my Netflix app. I have to restart my Nexus, the chromecast or both. Or it loses connection so that trying to pause becomes extremely frustrating. For my purposes, just casually watching a movie, it turns in to a thirty minute frustration. Roku boxes in our house never have these issues.", "verified": true, "helpfulness": "0/0", "author": "Anonymouse Amazon Customer"}, {"rating": 3.0, "review": "The device works alright most of the time when casting, but sometimes we pause on our device app and the video continues to play on the television. Also, it isn't unusual for the Chromecast app to show that there are no Chromecasts available, so we have to unplug the device and plug it in again to refresh. It's a bit frustrating. I thought I could use the Chrome browser app and cast from it, but either I'm wrong or I just can't get it to work. Too bad....it was a great concept aside from the fact that I have to use my mobile device.", "verified": true, "helpfulness": "0/0", "author": "LegsDiamond"}, {"rating": 5.0, "review": "You can do alot with this little device! And there is a work around to watch Amazon videos (although this may change in the future where you will not need a work around) this can do a lot with little effort, and it looks great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Murlo\""}]