[{"rating": 5.0, "review": "I have a smart TV, but Chromecast is much simply and faster to use for viewing Youtube and Netflix.  The apps on my smart TV is not so smart.", "verified": true, "helpfulness": "1/1", "author": "Color Magic"}, {"rating": 3.0, "review": "The item works just fine. I wig the \"opening\" menu had all streaming companies (Hulu is not listed where Netflix is) in one place.", "verified": true, "helpfulness": "0/0", "author": "Randall E. Hurt \"truh\""}, {"rating": 2.0, "review": "I thought it would link my laptop, or pc, to the TV.  It does ONLY if it is google stuff.  Not what I expected.  I want to access all the videos on my pc and laptop, not just google related videos.", "verified": true, "helpfulness": "0/1", "author": "F. Lum"}, {"rating": 5.0, "review": "Great little device & it was just $35. I also have to comment after reading some peoples ridiculous reviews. There are certain things that are out of Chromecast device/app control. For example you can't force companies to have their services available right away. I'm happy we already have things like Netflix, Plex, YouTube, Vevo, etc. Also if the video is choppy blame it on your connection because mine was just fine! -I'm getting HD video quality. Naive people should refrain themselves from posting reviews!", "verified": false, "helpfulness": "0/0", "author": "Michael Peixoto"}, {"rating": 4.0, "review": "Good product, but has WAYYY.... more potential and very affordable. i would like to be able to stream what ever i like from my laptop or phone, not just selected app like youtube, google or netflix", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Cool device works great! Was pretty easy to set up and seems to work pretty well with our Android phones and iPad2 tablet.", "verified": true, "helpfulness": "0/0", "author": "Karen Watkins-Kaehler"}, {"rating": 4.0, "review": "An excellent item for those without smart televisions, a cheap one as well. Hopefully with time the library of supported apps will expand. At the date of this posting, the device does not support amazon prime streaming app directly. It does link with netflix, however. Once more apps are developed to link with the chromecast, it will definitely be worth a five star review, especially at this price.", "verified": true, "helpfulness": "1/1", "author": "David B."}, {"rating": 5.0, "review": "This thing is great. You can stream video to your TV from a bunch of different apps on your Android phone or tablet, iPhone and iPad as well.  You don't really need it if you already have a Roku box or Apple TV since they basically stream the same content.  The biggest benefit of the Chromecast that the Roku and Apple TV can't do is stream anything from a chrome browser on your computer.  Download the Chromecast extension to your Chrome browser and you can stream any tab to your TV.  Sound is trasferred as well.", "verified": true, "helpfulness": "7/8", "author": "Christopher"}, {"rating": 2.0, "review": "Easy enough to install.  Both android and ipad/ipod will control.  Only 720P resolution on my 1080P tv.  Would like if more apps existed for this like amazon prime movies.  Resolution does not seem as nice on Netflix as using our gaming device's netflix application.-Update: TV with device does now work in 1080p mode.  Had big issue when we changed our WIFI device at home where I could not get the WIFI reconfigured with the Chromecast APP on my Android phone or tablet.  Finally got our IPAD to connect to reconfigure.  This was miserable and wasted a ton of time.  Can't seem to stream any of your own music with the Google music player and can only stream music purchased from the Google play store.", "verified": true, "helpfulness": "0/0", "author": "BRMHAM"}, {"rating": 4.0, "review": "This is easy to set up and works with any TV with an extra HDMI input. Wifi works perfect. Netflix, HBO to go, you tube so far...need an app that wil share web pages from iPad and photo slide show app.", "verified": true, "helpfulness": "0/0", "author": "Frank A. Bowdon"}]