[{"rating": 5.0, "review": "Web content streaming is the reason I'm purchasing this ! Hope it works well with streaming movies which my Roku can't do", "verified": true, "helpfulness": "2/100", "author": "Steven Randolph"}, {"rating": 5.0, "review": "I can play MKV 1080 PNetflixHuluyou name it you can play it without any issue good Job google keep it coming an the best thing is SDK for the Chromecast lot of benefits.", "verified": true, "helpfulness": "15/128", "author": "Fazzy"}, {"rating": 4.0, "review": "So I have no idea why Amazon decided to remove my 1500+ Helpful Review. I have had this product for weeks so I was able to give more than just a short term insight. In fact, I like the idea of it so much that I ordered two additional through Amazon yesterday before they sold out (Google only gave me one to test with).Anyway, I was contacted by fellow Amazon shoppers to repost it - so here it is:I want to provide an honest review with an actual understanding of what and how the product works having had it for a couple weeks, without violating my NDA.Look - you can give your \"Review\" once you have in your hands. Make assumptions based off an uneducated guess or incorrect information just looks stupid, I'm sorry.What it Is:It's a HDMI dongle that is powered by Chrome OS that is designed for Streaming.How it Works:You have to connect to the same Wi-Fi network for it to work. Once it's setup you'll see the Chromecast logo and a basic Home Screen with some of the first apps available for Chromecast. A lot of development is going into it, so expect to see more apps from the Google Play store work with your TV. See your phone/tablet/computer more of a remote, rather than an actual streaming device.I only tested on the iOS side (I don't have a Droid) and I can tell you that it works very well. It is NOT like Apple's AirPlay where your screen is mirrored, but rather uses \"the Cloud\" to access your content. It works smoother than AirPlay because it doesn't require buffering from your device, but rather directly to the TV. The only \"syncing\" that occurs is the Cloud communicating to the Chromecast where you're at. For example: I'm watching a Netflix movie and I'm at 1:06:17. I hit the Square button with the wi-fi looking icon called \"Cast\" and it syncs it to my Chromecast. This is only different for web-browsing through the currently Beta Chrome Tab Cast, where it'll show exactly what you're looking on Chrome, onto your TV. It's less functional than straight up mirroring like the Apple TV, but it works. You can't switch between apps and have that show on the screen. This is particularly useful in web-based presentations or while you check your email and your friends are watching Netflix.Battery Drain on Mobile Devices:Because of the way Chromecast works, it's streaming information from the Cloud vs. from your device. I noticed very little increase in the usage of battery on my iPhone 5 and my Macbook Air running Mountain Lion OSX.Support for Streaming Services:Right now, Streaming Service support is limited. Netflix, Google Services (Google Play, YouTube) and Web-based Streaming is allowed. I had issues trying to load Hulu the past couple days, telling me that my browser was unsupported, but I'll update once I get a chance.Power Adapter:The power adapter is an optional requirement. In fact, most modern TV's with HDMI 1.4 or higher spec are supported. The Chromecast can draw power from the HDMI port it's plugged into. If your TV doesn't support that, there's also a USB cable and power adapter included in the box. I have a 2012 LG LED and a 2013 Lenovo 27\" Monitor with HDMI input and the ports power it with no cable.All in all, I feel like it's still a huge work in progress. The SDK will allow for some exciting developments, and I'm happy to say that Google has committed to support this device for quite some time. It gives me piece of mind that this won't become out of date each year.That being said, it's only $35. What a steal for a device that really brings value to any TV.", "verified": true, "helpfulness": "7/186", "author": "Jasper Lynn"}, {"rating": 5.0, "review": "I almost got the Google TV, and cables to connect my Nexus 7 and Smartphone to my TV ... this products eliminated all that.", "verified": false, "helpfulness": "6/98", "author": "PeleKoolaid"}, {"rating": 5.0, "review": "All the other reviews cover the best features of this product, many of the reviews mention that you cant stream local content (i.e. films, music, ect you may have downloaded and wish to play on the tv? Cant use the chromecast to do that). This won't be a flaw for long; Google is releasing Chromecast SDK, this will allow independent developers to make apps for the chromecast. Streaming local content is going to be wanted and you can anticipate independent developers to quickly start producing app to allow you to stream your local content.Chromecast on its own in an excellent product. Chromecast SDK will allow its usefulness and convenience to grow exponentially. There is zero reason to not purchase this product, unless your TV lacks an HDMI connector port.", "verified": false, "helpfulness": "28/141", "author": "Techweeniie"}, {"rating": 2.0, "review": "If you are actually accessing Youtube through your hand held device than this device(Chromecast) is not worth it you can access Youtube through a 3rd party application now & play videos via Roku. The issue is alot of videos cannot be played this way due to the owner of the video wont allow it, copyright infringement.", "verified": false, "helpfulness": "9/379", "author": "Amazon Customer"}, {"rating": 3.0, "review": "As a Roku and AppleTV user, I'm excited to see this one come too and purchased it within an hour of hearing about it.Can't give it 5 stars or 1 star til I use it.One thing I noticed is that the box includes a USB power hub and cord, but all the pictures show it without one attached.Do some TVs have powered HDMI ports and the cord is only needed with ones that don't?  If so, I'm guessing I'm using the power cord.  Oh well, that's why I have a 15 plug power strip in the bottom of the TV cabinet.", "verified": true, "helpfulness": "6/153", "author": "William Jay Horsley"}, {"rating": 5.0, "review": "This is sick - How can you review without testing the product. OH MY GOD THIS IS GREAT - I was always wondering how come there is great products with 1 star now i got the answer", "verified": false, "helpfulness": "11/119", "author": "Jonathan"}, {"rating": 1.0, "review": "I do NOT own this product but am seeing only 5 star reviews, based on minimal marketing info from Google!  I've seen the announcement of the device, and a little bit more.  Unable to understand what does this product deliver that Roku does not today.  For a price of $100/-, Roku delivers much more than this thingamajig at a price of $35/-.  And this thingy keeps the device (Laptop/Tablet/Smartphone) engaged to stream content.  All it is doing is picking up the selection from the device, and playing it from the Cloud to the thingy, and then sending it through HDMI to the TV.  Meaning, if my device is out of battery, I can't use this thing?  And, yes, there's software to download to control the Pause and Play, Reverse and Forward.  Roku has that avaialble as a separate physical and practical Remote Control (and device based remote control software too) and has much more content than just what Google is offering here!  And it still needs power through an adapter (yes, I know HDMI has no possibility of power yet, but) and we go through all that fuss and still get only YouTube/NetFlix/Pandora?  All that Google is doing is to come up with a piece of hardware and sign up partnerships for content that are not Google.  I don't get it.  Seems like a 'me-too' product from Google.  Underwhelming!", "verified": false, "helpfulness": "33/1", "author": "P. Rishi"}, {"rating": 3.0, "review": "While I did order this product and am happy to do so, I am disappointed the marketing materials make it appear as though the dongle is powered through the HDMI connection.  It is not.  The dongle needs to be plugged in any time you're using it.  The pictures they released do not show this at all.That being said, if the product works as indicated it should be a fantastic product with an amazing price point.  Apple TV is around $100 and their apps are nothing special right now.", "verified": true, "helpfulness": "85/357", "author": "John Ho \"hocash\""}]