[{"rating": 5.0, "review": "Our household purchased one of these the day they became available and we have yet to be disappointed.  We were so pleased that a few weeks later, we purchased a second one for our bedroom television.Here's the thing - my household is no stranger to tech - everything is \"smart\" - smart TV, smart blu-ray, PS3, PS4, Xbox, Wii, Tivo, the list goes on.  We have many options available to us if we want to watch, for example, Netflix.  The same is true of some DNLA media.What makes this different is, first, the price.  At $35 a pop ($25 if you happen to find a good sale), this is far and away the cheapest way to \"upgrade\" your aging television and bring it into the smart age.  For instance, although we do own a SmartTV, the second one is your basic HD flat panel, and not equipped with smart technology.  For people who do not have other \"smart\" tech available, or who cannot afford it, the chromecast can easily bring your television into this decade and allow them to watch content on their television, versus their computer (so long as they have a working wi-fi connection in their home).Second, there are few devices that stream various apps, like Netflix and HBO Go (previously only available for direct TV stream through an Xbox or Samsung television), so seamlessly and without stuttering.  My Tivo, for instance, hates Netflix for some reason, and it's so slow to load on that device that the frustration is not worth it.  I have found NO other devices that allow one to stream YouTube to your television with such precision and so easily.  Most devices allow you to log in, perhaps look at your subscriptions, but searching is a chore.  On the chromecast, you simply find a video you wish to watch (using your computer, tablet, phone, or any other android device) press the \"cast\" button, and you're done. Moreover, this device is still being developed and new apps become available all the time.Third, ease of use.  Extremely simple to set up and casting is a breeze.  It's as easy as pressing a button (for those apps and websites that are chromecast compatible).Fourth, DNLA.  The PS3 has long had DNLA capability (the ability to simply stream your own content to your television), but the PS4, as of this writing, does not.  Xbox has always been finicky with what it will allow you to stream, and other devices have issues because they do not always have the right video/audio codecs needed to translate your content.  Using the Chromecast, and the Plex app, DNLA streaming is a breeze.Fifth, portability.  It's about the size of a flash drive.  Simple to just unplug the device, take it to another room, and use it on another television.  When coupled with content (like your youtube subs, or media you have stored with Plex) stored in the cloud, it makes your media accessible virtually anywhere.It's not without it's problems, however.  Tab casting (using it to \"cast\" an entire Google Chrome browser tab to the television) is still very buggy and often crashes on my browser.  It's also slow and tends to have issues with video and audio sync.  Also, I have occasionally had issues where, when using an Android tablet to play youtube videos, the device will stop responding mid-video and just stop playing the content, forcing a reload of the app on my tablet.  (The latter problem seems to have been resolved).In all, I am confident that as the device continues to be developed, any major issues, like tab casting, will be resolved with time.  I can say, without hesitation, that this is one of the best, and most economical, tech purchases we have ever made.", "verified": true, "helpfulness": "0/0", "author": "Aurania"}, {"rating": 5.0, "review": "This works great with my nexus 7.  It streams youtube and netflix.  The only downside is not alot of apps that works with it.  For the price, it works great with a TV or Projector.", "verified": true, "helpfulness": "0/0", "author": "Simpleofmind"}, {"rating": 5.0, "review": "Love mine. Easy install with a tv that is a few years old. Easy to control from phone, laptop, ipad. I am really hoping for more integration in the future, especially a spotify integration. Would buy again. Already bought one for my mom.", "verified": true, "helpfulness": "0/0", "author": "K. Cyr"}, {"rating": 5.0, "review": "This works great for watching netflix on my HDTV while using my smartphone as a remote. It is easy to setup. Hopefully google with partner with more content providers to make it more usefull.", "verified": true, "helpfulness": "0/0", "author": "N. Kosh"}, {"rating": 2.0, "review": "I bought the Chromecast player because I wanted to get rid of cable for good. I was excited about the idea of watching my favorite shows on my TV instead of on my computer monitor. When I received the stick, it was very easy to set up. However, when I went to actually use it I found out that I needed to have Windows 7 or above on my computer. My computer is fairly old in technological terms, so I went for the option to use my Android phone. My phone has limited memory, which is another review altogether, so I was having to download apps to make the stick work, and some of the network TV shows weren't available on my device. I gave up on it and was going to give it to a friend who has a better Android phone. She also ran into the problem of having to download several apps onto her phone to make it work.The idea is good, and I'm sure that if you have the newest and best technology out there, you will not have any problem with using it. However, be sure to read everything you can about it before buying it, because it just might not work.On the other hand, AMAZON did an awesome job with the return/refund process. I printed the return UPS label, stuck it to a return envelope and took it to UPS for pickup. No cost. I asked for the instant refund, and , to my surprise, it WAS instant. I had the money back in my bank account within an hour. So, kudos to Amazon for making this part of this disappointing purchase easy.", "verified": true, "helpfulness": "1/1", "author": "Karen Bozell"}, {"rating": 5.0, "review": "Nothing is as simple and effective as the Chromecast. I can listen to music from my phone, my kids can watch Minecraft youtube videos from their devices, or I can cast a tab from my computer browser to my TV. This is something every TV should have!", "verified": true, "helpfulness": "0/0", "author": "Clay"}, {"rating": 4.0, "review": "You must use Google Chrome browser to use this. It works fine for You Tube and Craftsy. However there is some incompatibility between Chrome and Netflix on a Mac. Netflix works fine on my Apple TV", "verified": true, "helpfulness": "0/0", "author": "microtute"}, {"rating": 5.0, "review": "I havent had any major issues beside the occasional inability to control rewinding when playing a show in netflix but understand that you are wirelessly streaming so it makes up for it. For 30 bucks you cant have too many complaints.", "verified": true, "helpfulness": "0/0", "author": "Andrew Gundran"}, {"rating": 5.0, "review": "This is jest what the Doctor ordered for my Lake home we have some cable but not many stations so this runes though our Wi-Fi and works like a charm, ease to install and has not missed a beat, starts on my cell phone and then runs on its own, Can't beat that !!!!", "verified": true, "helpfulness": "0/0", "author": "EverClear"}, {"rating": 3.0, "review": "Obviously, there are a lot of reviews of this product. I didn't take the time to read all of the other 16,000+ review, however the pluses and minuses appear to have been thoroughly covered.My two cents: if you do not absolutely NEED a wireless connection, spend about $12 on a 25 foot HDMI to HDMI cable and simply plug your laptop or computer into your TV.", "verified": true, "helpfulness": "1/1", "author": "Martin A."}]