[{"rating": 5.0, "review": "I love not having to put my laptop next to the tv and hooking up hdmi cords to play stuff on the tv. I have never owned a roku or any other streaming device so when i found this at it's cheap price I wanted to try it out. If using one of the supported apps it does not tie up your computer. I can play shows from netflix and not have to have it running full screen. The only time you have to run full screen is Chrome mirroring which I had read and expected. Great little device, very easy set up.Set up is really simple and in a matter of 10 minutes you're up and running. What I really like about Chromecast is that once you set it up its done, that's it! You name your device and no more back tracking or resetting.", "verified": true, "helpfulness": "0/0", "author": "Johnny Molina"}, {"rating": 5.0, "review": "Have been flinging TV shows from apps on my android cell phone to chromecast to watch on my HDTV. It's so easy and so great, I find it hard to believe it's so inexpensive.", "verified": true, "helpfulness": "0/0", "author": "xlamp \"xlamp\""}, {"rating": 5.0, "review": "it is a great product, i use netflix a lot and this is perfect match for it... i wish more apps for more interaction with  the device.", "verified": true, "helpfulness": "0/0", "author": "Jiin"}, {"rating": 4.0, "review": "Easy to set up and does a nice job of sending  media from your laptop to your TV. I missed some episodes of a program and was able to find them online and easily watch them on my TV.The only thing I noticed is that there was a slight delay in the transmission of the program that caused the dialog to be a little off as it played.", "verified": true, "helpfulness": "0/0", "author": "Douglas Kriehn"}, {"rating": 5.0, "review": "Do explain why you liked or disliked it.Do compare to similar products or services and share how long you've used this product.Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.Don't describe your seller or shipping experience (you can do that at amazon.com/feedback).Don't include promotional content of any kind or reviews written in exchange for compensation.", "verified": true, "helpfulness": "0/0", "author": "Csokmai Tamás"}, {"rating": 5.0, "review": "excelente.....!!!!", "verified": true, "helpfulness": "0/0", "author": "Celcimar"}, {"rating": 5.0, "review": "Works absolutely slick and easy. Just plug it into your TV, download Chromecast on your tablet, iPad, iPod, etc and control your streamed shows right on your TV's we use it all the time. . . Way faster than my TV with wi-fi built into it. We use this instead of the \"smart\" part of a smart TV.", "verified": true, "helpfulness": "0/0", "author": "T. Niemuth \"Tiffifox\""}, {"rating": 3.0, "review": "it fine i don't have much problems with it expect when i watch movies though google chrome it can not keep up then disconnects b its self other then that it works great with youtube Hulu Netflix and when i just want surf the web on a big screen its great highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Brayan"}, {"rating": 1.0, "review": "Does not even set up I would give it a zero if i could.", "verified": true, "helpfulness": "0/1", "author": "Michael Bailey"}, {"rating": 5.0, "review": "I had initially bought a chromecast when they first came out for the exceptional price, but now I bought a used one for almost half the cost and its still a steal! I have a Belkin N150  router  (separate review) that works with the device half the time, unfortunately for me it seems to like to disconnect from the internet but still broadcast wifi. The chromecast is a fantastic device when you have a good home infrastructure to support it as I used to have!", "verified": true, "helpfulness": "0/0", "author": "Chris Kubilus"}]