[{"rating": 5.0, "review": "Ver y useful if you have a tv that is not a smart tv", "verified": true, "helpfulness": "0/0", "author": "manuel"}, {"rating": 5.0, "review": "The Chromecast is a great way to watch content from my PC on my TV, but I knew from reading other reviews and info about the device that there were limits. It is designed to work with the Chrome browse and not other browsers but that is by design as they are both Google products. There will be niche \"sticks\" for various content providers coming and some already exist. Amazon's stick will be available to play Amazon videos, Hulu, etc. Again, these were known before I bought the Chromecast. The device has worked flawless for me so far and have not experienced any delays in the data moving from my PC to the TV, but even if it happens on occasion, for the price of the Chromecast and the functionality it brings, I am willing to endure momentary hickups. Setup was easy regarding having the TV and PC recognize the stick.The issue I had with setting it up was with the security settings on my wireless router. I have an extra level of security by listing only specific mac addresses as being able to use my network.  Neither on the box nor on the stick itself is the mac address listed so I had to do a bit of extra to find out the stick's mac address and then configure my security settings to permit it to connect to my network.  Though it was a need of my wireless router, it would have made it easier for me if he mac address was printed on the stick itself.", "verified": true, "helpfulness": "0/0", "author": "Fremont California Amazon customer"}, {"rating": 5.0, "review": "It was a good product before screen casting.  Now it is great, I can cast tv shows and movies right from my internet browser in addition to running the other apps it has like Netflix, YouTube and Hulu. It is portable and simple to set up. Great product.", "verified": true, "helpfulness": "0/0", "author": "Thomas Tartamella"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 4.0, "review": "Very easy to install and works great. The best part is no wires running from the computer to the TV.", "verified": true, "helpfulness": "0/0", "author": "Michael B. Purdy"}, {"rating": 5.0, "review": "Just stick it at the back of your TV, and enjoy.", "verified": true, "helpfulness": "0/0", "author": "James Y"}, {"rating": 4.0, "review": "Still get a little lag when doing anything besides casing netflix, youtube...yata yata.  The mirror desktop function is still in beta for a reason.  If they can smooth out the remote desktop type stuff to minimize more lag its worth 5 stars.  Netlix and youtube work well and easy though.", "verified": true, "helpfulness": "0/0", "author": "Mike P"}, {"rating": 5.0, "review": "Love this !", "verified": true, "helpfulness": "0/0", "author": "Karla"}, {"rating": 5.0, "review": "Was not very happy when I first got this. It just didn't seem to do what I wanted it to which was basically play movies and videos from my computer or phone to my television. Originally this could only be done using the chrome browser and frankly it was so laggy it was virtually worthless! So I left the thing hooked up to the tv and let it dangle shrugging it off as a bad investment. As time passed however, more software became available and many of the lagging issues faded away to where It has actually become useful and I not only no longer regret buying this but have become increasingly happy with it.", "verified": true, "helpfulness": "0/0", "author": "R. Krantz"}, {"rating": 1.0, "review": "Pretty slick and works well with Droid phone.  A complete nightmare to try and use with an iphone.  Gave mine away to a droid user, if that tells you anything.  HUGE DISAPPOINTMENT AND A WASTE OF MY TIME AND MONEY.", "verified": true, "helpfulness": "0/1", "author": "jbnonc"}]