[{"rating": 5.0, "review": "I have a plex media center at home and I like to use netflix as well.I've bought 3 of these now, gave my first to my sister who had no way of streaming her netflix other than to a Wii connected to a junk tv.  Gave the second one as a white elephant gift.  Kept the third one after plex became available to use.  Streams plex great, along with google play music, youtube, netflix, simply awesome and for only $35.  I've got some roku boxes that I'm thinking of replacing with more chromecasts.  I would recommend this to anyone with a smart phone (to use as a remote), an HDTV with an available HDMI port who wants to stream video to your tv extremely easy.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I liked the price ( flat $35.00) and it works great so far. Had it a couple of months now. Easy access to Youtube Netfliks and others.", "verified": true, "helpfulness": "0/0", "author": "Diane Grzelewski"}, {"rating": 2.0, "review": "I am a walking Google advertisement. This product is not good. The thing it does well is make your TV a monitor. Don't use it to stream movies. AND- I have stock in Google!", "verified": true, "helpfulness": "0/0", "author": "SoCal"}, {"rating": 4.0, "review": "This is a great unit, I rated it 4 stars, as every unit I received, seemed to have some scrapes on it. Not sure what that was about.Anyway, for the price, it works great, don't expect anything less from Google. This unit will stream whatever you throw at it, as long as there is an app that works with it.Mirroring feature could use some work, little choppy, but otherwise great.", "verified": true, "helpfulness": "0/0", "author": "Turner D"}, {"rating": 2.0, "review": "I did have some problems with setting this up.  After installing this on my TV, I installed the chromecast app on my Samsung S4. I followed the instruction on the TV screen. But my S4 could not find any chromecast.  I tried the chromecast on another TV in a different room and the same thing happened. Finally I got out my ipad, installed the app and it did find the chromecast and I could complete the setup. I could control the chromecast with my ipad and my S4 after that.My TV does not have an USB port. So I had to use the included power supply. I noticed that the body of the chromecast was very hot to the touch. I keep the unit unplugged until I want to use it.  It seems like a lot of trouble.  I am considering getting a new TV. Maybe plugging into the TV USB port will be better.  I will update if and when I get that new TV.Casting from the ipad or from my S4 works easily.  I did try to use my pc to cast to the chromecast. If I used youtube or netflix, it was easy since the chromecast icon is there on the youtube/netflix screen. Picture was full screen and audio was clear.But when I went to  sites like NBC or CW to watch a TV program, it was very different. The icon is in the upper right corner of the search bar. When you click it to cast, the whole pc screen is seen on the TV, like the headings, etc and not just the video screen.  NBC allows you to change video size. When I switch between normal and huge, that change is seen on the TV (still with all the headings and other misc stuff). But when I switch to full screen, video blanks out on the TV (but all that misc stuff is still seen). Since the icon to cast is on the search bar and not on the video screen, I have no way to \"recast\" the full screen on to the TV. Also I have no audio. I did connect my headphones to the pc and got audio that way. But not from my TV.I did try the option to auto resize the browser to best fit the receiver. That did not help.update: It is no longer working on my PC. I just tried to cast netflix to my TV but the cast icon was gone. I checked on my ipad and on my smart phone and it was still set up there, but my PC could not see it. I decided to send it back.  I ordered a roku 3. I hope that works out better.", "verified": true, "helpfulness": "1/1", "author": "LocalBoy"}, {"rating": 5.0, "review": "This unit is extremely good for streaming Netflix.  The setup is almost intelligence-insultingly simple, and it's a snap to connect with an iDevice and be up and running in no time.The only drawback is that it will only work with a DHCP-enabled network; if you don't use DHCP, it won't work.", "verified": true, "helpfulness": "0/0", "author": "Ima Pseudonym \"alias7\""}, {"rating": 2.0, "review": "I've tried Chromecast on OSX and Windows and still can only get YouTube to have any consistent performance. No love for Amazon Prime or Netflix. One of these days these tech companies will come into the 21st century. I don't really care which OS, app, or service I am using. I just want the damn thing to work. But instead it will be yet another useless dongle in my Drawer of Useless Dongles. And It certainly makes it harder to get enthused about the Next Cool Thing that is supposed to make my life easier.", "verified": false, "helpfulness": "0/1", "author": "Althea L. Turner"}, {"rating": 5.0, "review": "that's all its good for, and that's fine, that's why I bought it. you can stream tabs but its not worth it to try", "verified": true, "helpfulness": "0/0", "author": "nathan"}, {"rating": 5.0, "review": "Works well without too much effort to setup. Simple to cast from a mobile device and stream from Netflix, Hulu, Youtube(At least from my iOS devices I use) Does not work as well sharing a tab/desktop from a computer/laptop and the better the laptop to better the performance of course.I wish it was 5G compatible. I think that would really help the speed for tab/desktop casting from the Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Nathan Sharkey"}, {"rating": 2.0, "review": "I dislike it because it is not like a typical streamer . It is Stupid and I wish I did not buy it", "verified": true, "helpfulness": "0/2", "author": "Lenora"}]