[{"rating": 5.0, "review": "I love watching movies, but I usually have to buy or rent them. Now, I can watch them quicker and cheaper by streaming them from the internet. I love my Google Chromecast. I use it all the time. For $30, it pays for itself the first week you use it!", "verified": true, "helpfulness": "0/0", "author": "Michael DeNobile"}, {"rating": 5.0, "review": "I only use it for netlix (about the only thing is it good for) but it works great. It is so easy ot move from room to room allowing all your Tv's access to netflix from the touch of a button on you phone/tablet/computer. Works amazingly with all my tv's and i have never had any problems.Hint:Make sure your phone and the ChromeCast are set up on the SAME wireless internet or the Chromecast will not pick it up.I would recommend this product to anyone!!!", "verified": true, "helpfulness": "0/0", "author": "blake"}, {"rating": 5.0, "review": "The office was quickHe reached the promised productI highly tested and works well In future buy you anotherNo quality problem", "verified": true, "helpfulness": "0/1", "author": "Gustavo U."}, {"rating": 5.0, "review": "This little Chromcast is wonderful....I stream from my Galaxy or my tablet.....love it!!  You've got to try this thing out!!!", "verified": true, "helpfulness": "0/0", "author": "Debra Carfagno"}, {"rating": 1.0, "review": "I live in an apartment and couldn't get the chrome cast to connect to the internet. It's a waste of money unless you have a very strong wi fi connection", "verified": true, "helpfulness": "0/0", "author": "Jeff Graves"}, {"rating": 2.0, "review": "This is a neat toy, but that is it.  It's a neat TOY!  I wanted it because I am a gadget kind of guy and like little stupid things most people don't.  My wife is just starting to, not so much understand this but live and love me at the same time.  I would have rather bought a new blu-ray or two instead of this again.  Since I have a MacBook Pro, you needed to load CHROME the browser on my device and couldn't use safari.  It's to proprietary to itself and Google.  Cool but not handing them out for Xmas or anything because for what it does and makes you load Chrome for it to work, just not that cool.", "verified": true, "helpfulness": "0/0", "author": "Kevin Goff"}, {"rating": 4.0, "review": "I get the idea now -  this is media stream stick, not a PC mirroring device.  That has plusses and minuses.The plus:  You get just the content (or whatever is on your PC/tablet/phone).The minus:  You can't control the content remotely, or at least not without your tablet of phone sitting in front of you.I thought I could get away with an app called Remote Droid Server - which turns my phone into a remote for my desktop or notebook.  That didn't work at all.  Chromecast would have to mirror my PC in order for me to see where my mouse is at any given time.Still, I'm very pleased to be able to watch or listen to anything in my living that's on my tablet, phone or PC.  It's not the same as watching TV, but we don't watch much TV anyway.", "verified": true, "helpfulness": "0/0", "author": "Richard Walton"}, {"rating": 3.0, "review": "This google chromecast does not work with my iPhone 5s. It will not connect and I do not know why.  I followed all procedures.", "verified": true, "helpfulness": "0/0", "author": "Deon"}, {"rating": 5.0, "review": "I really love it.  Easy to install, can control it with iPhone and with my Nexus tablet, works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Rafael A. Solorzano"}, {"rating": 5.0, "review": "Is such a great item that every person with a smartphone should have, it's easy to set up and you feel too confortable when you use it", "verified": true, "helpfulness": "0/0", "author": "Lwis"}]