[{"rating": 4.0, "review": "Great Value and overall performance.  I imagine this stretched out my basement TV purchase by 3-4 years because I love my Plasma Screen and now can get Netflix on it.  I've had this about 12 months and have two minor gripes: - Sometimes (25%)  I have to reset it to get Netflix to work - Hope more apps will be featuring ability to Cast.", "verified": true, "helpfulness": "0/0", "author": "Jill"}, {"rating": 5.0, "review": "This worked great", "verified": true, "helpfulness": "0/0", "author": "john dsouza"}, {"rating": 5.0, "review": "very convenient when you don't have a smart TV or cable TV at all.  easy and quick set-up procedure, plus there are plenty of apps that are now compatible to use and broadcast data from any mobile device or computer. all that is really needed to have connection is wi-fi (internet access) and you will have a good time", "verified": true, "helpfulness": "1/1", "author": "Yessenia Ramos"}, {"rating": 5.0, "review": "So easy to set up!", "verified": true, "helpfulness": "0/0", "author": "A. Gehrke \"Ashley\""}, {"rating": 3.0, "review": "I'm sure this will eventually be a great product to have and for the price, I don't really feel like I got a bad deal.  The fact that it's still a beta and is very limited in what it can do.  It's great if you're trying to stream Netflix - you really can't beat it for that!  It's kind of picky when it comes to what kind of chrome browser you can stream.We originally bought it so we could watch my cousin's WNBA games from their online streaming site - it doesn't work... there's just something about the site and it's components that chrome won't send it to Chromecast.Our Roku does a lot more, but you also pay a LOT more for it - unlike most products that get worse with age, this one will probably get better because more will be made available!", "verified": true, "helpfulness": "0/0", "author": "Lexi C"}, {"rating": 5.0, "review": "awesome prime video to tv", "verified": true, "helpfulness": "0/0", "author": "wesley"}, {"rating": 5.0, "review": "Best gadget ever! Full HD", "verified": true, "helpfulness": "0/0", "author": "Beatriz Feo Perez"}, {"rating": 5.0, "review": "So much fun!  Makes sharing so easy!  Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey D. Reikofski"}, {"rating": 1.0, "review": "The only thing that streams with no problem are the YouTube videos which I can already watch on my Google TV. Everything else streams slow and keeps buffering. Garbage I don't like it as it won't work as well as you want it to. Go for the Roku you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Luis Melendez \"LUMEL\""}, {"rating": 3.0, "review": "Great when it works.Using the chromecast extension between multiple devices is very irritating. It is difficult to disconnect or stop a video from playing even when the application is closed, and the connection is not easily established for some video providers (like amazon instant video).", "verified": true, "helpfulness": "0/0", "author": "Mv. Danj"}]