[{"rating": 5.0, "review": "I love this gadget!!!", "verified": true, "helpfulness": "0/0", "author": "Tawodi Dekanogia"}, {"rating": 3.0, "review": "I loved it when it first came out, but it quickly revealed itself to be a one-trick pony.As a miracast/similar receiver, it works great, but when you have something like the FireTV Stick available for just a few dollars more, why buy this when the FireTV does everything that this done and so much more?", "verified": true, "helpfulness": "0/0", "author": "Mr. Splashy Pants"}, {"rating": 4.0, "review": "Have to reboot once a week because it's not available to cast from my phone.", "verified": true, "helpfulness": "0/0", "author": "B. Patel"}, {"rating": 5.0, "review": "Very useful for casting movies, etc from my Android phone", "verified": true, "helpfulness": "0/0", "author": "Robert M. \"bobnbeau\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "sam2"}, {"rating": 3.0, "review": "I did not purchase this from Amazon, but received it as a gift, however, I felt I must leave a review of it anyway.  This is not a very user friendly device and is not intuitive, I guess I was spoiled by AppleTV.  I found that the controls were very slow to respond and setup was quite a bit more than effortless.  I have well higher than a gigabit internet connection and this thing lagged severely.I gave it three stars because, once you get acquainted with the chromecast's quirks, it does have decent features.  However, I did replace it with another AppleTV due to stability and ease of use Apple provides.  I understand that the Apple product costs a bit more, but I feel the difference is worth the upgrade.", "verified": false, "helpfulness": "0/0", "author": "EBATX"}, {"rating": 3.0, "review": "After plugging it in 6 different times it quit working. When it worked it was nice. Has ti have internet though.", "verified": true, "helpfulness": "0/0", "author": "Kevin \"1vandyfan\""}, {"rating": 1.0, "review": "VERY LIMITED", "verified": true, "helpfulness": "0/0", "author": "marvin levy"}, {"rating": 1.0, "review": "Horrible waste of time piece of crap device won't even connect and I have a brand spanking new phone a LG G3 no reason why it shouldn't connect to chrome cast. Waste of 30 and 2 hours of my time DONOT BUY", "verified": true, "helpfulness": "0/1", "author": "sierra"}, {"rating": 5.0, "review": "It works so well I bought another one for my other TV!", "verified": true, "helpfulness": "0/0", "author": "D. Chmielewski"}]