[{"rating": 5.0, "review": "Great device to convert your TV into a SMART TV. With google chrome, it even enables browsing on bigger screens and in bigger group streaming", "verified": true, "helpfulness": "0/0", "author": "Pradeep"}, {"rating": 5.0, "review": "Do need higher speed CPUs to Cast the best as the computer is doing most of the work before casting to the TV", "verified": false, "helpfulness": "0/0", "author": "Cathy Overland"}, {"rating": 1.0, "review": "I liked this well enough until it stopped working. Apparently it has a one year warranty. Google's web site is very easy if you want to buy something. However, if you want to contact them for a warranty item, their web site is an endless loop of legalese. I don't like the Chromecast well enough to wade through all that crap. I wonder if Apple makes something like this?", "verified": true, "helpfulness": "0/0", "author": "B. Moesser"}, {"rating": 5.0, "review": "It does not work with every channel, it is good for netflix, and i think YouTube, but it doesn't work to send Amazone  shows to TV", "verified": true, "helpfulness": "0/0", "author": "Online Logistics California"}, {"rating": 1.0, "review": "The Media Player did not work in Vietnam. Best to inform buyers which countires the device has been modified for use in.", "verified": true, "helpfulness": "1/3", "author": "Mark Conroy"}, {"rating": 2.0, "review": "What a waste. In order to watch Amazon Prime you have to disable to the Silverlight Plug-in. After you do this the movies look blurry. NOT what I was looking for. Are you going to come out with an App to use, Amazon???? Or am I returning this?", "verified": true, "helpfulness": "1/2", "author": "boX"}, {"rating": 4.0, "review": "Only works with limited programs. If you use Netflix a lot this is great for you I do t and their aren't many other programs that accept it yet.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "So, my advice is DO NOT BUY  For now, my $35 is wasted.  Mine stopped working i can not use it any more, does not just work. Whenever i plug it in the tv, all i get is no video.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this device. It streams everything perfectly and developers are starting to support it with 3rd party apps. I no longer watch cable TV and will eventually cancel due to the superiority, ease of use and simplicity of this device. I use it with a Nexus 5 phone and a Nexus 7 tablet, with seamless integration across all platforms. Google is really taking it to Apple with superior technology that automatically syncs along all platforms. A++ device. Just ordered another one for living room.", "verified": true, "helpfulness": "0/0", "author": "D. Cohen"}, {"rating": 4.0, "review": "how does it work? you have to click the cast button. but where is the cast button? i couldnt find thecast button.  so i had to disconnect the chromecast and do a little research.  i finally found thecast button extension in google's store. the chromecast works fine now although i have occasionalreception problems which i attribute to a lack of power on the part of my computer. so the beginningwas not sterling and not a five star performance, but so far i am satisfied for the price i paidfor it.", "verified": true, "helpfulness": "0/0", "author": "anthony chatham"}]