[{"rating": 5.0, "review": "This is a awesome product. It works just as well as it is advertised. even my wife & 3 yr. old granddaughter can find shows with it.", "verified": true, "helpfulness": "0/1", "author": "M. J. Burnett"}, {"rating": 5.0, "review": "Nice little device. Easy to set up easy to use. The voice feature is pretty cool as well. Bluetooth streaming is Awesome! Our little fire box is hidden away. Love the picture! The menu requires a bit of a learning curve, but not bad. Try it. You  won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Whovian"}, {"rating": 5.0, "review": "Love it love it,just needs more free movies and tv shows.Especially like older movies.For 99 dollars a year there needs to be a lot more free movies.I mean come on Netflix and Hulu do it for 7.99 .The two day shipping is worth it though.", "verified": true, "helpfulness": "0/0", "author": "Jesse Guerrero"}, {"rating": 5.0, "review": "Went from multiple devices that does some things to one does it all", "verified": true, "helpfulness": "0/1", "author": "B. Chambers"}, {"rating": 5.0, "review": "Fast and simple to set up and use.", "verified": true, "helpfulness": "0/1", "author": "MM"}, {"rating": 4.0, "review": "This is a gift, so I can't rate it.  I got it mostly from the great reviews.", "verified": true, "helpfulness": "0/1", "author": "Curious \"Le\""}, {"rating": 5.0, "review": "Great product!  I've been a Prime member for quite some time and this is the best way to view and browse Amazon movies.  The screen saver is assume!", "verified": true, "helpfulness": "0/1", "author": "Frank Abell"}, {"rating": 3.0, "review": "well, honestly, I can't say much about it because I don't have one.  However,  the advertising for sure impelled me to become a quick believer and buy one, right on the spot. I am thinking, this streamer seems so unique and can offer me huge benefits. This is wonderful. But then, I started to think- how different is this one  from the others, the long list of streamers.  The advertising it is saying it is - may be it  is. I don't know.What about then  the Blue ray Discs/DVD Players?  what are the benefits from getting those instead? At least , they have the option to place a disc and are a lot less than $100, now. But, they are bulky and  can't  play games. The Amazon Fire TV does. you just need to buy the controller and there you have your PS2,3,4...or whatever for a lot less price.Sorry, I am taking your time with my rambling  but I just don't know what to get, yet.", "verified": false, "helpfulness": "0/5", "author": "Johnny \"beto\""}, {"rating": 5.0, "review": "I have had at least 6 other streaming devices and this one is superior to them all. Fast and efficient.", "verified": false, "helpfulness": "0/1", "author": "Brian Gonzalez"}, {"rating": 5.0, "review": "Works great with Hulu Plus. Setup easy. Remote simple and straight foward.", "verified": true, "helpfulness": "1/1", "author": "jeffrey Schultz"}]