[{"rating": 5.0, "review": "Works well, and more and more apps and services are gaining support for it.  I have purchased additional ones for all the tvs, as apps like netflix work way better on chromecast than the built in application on the tv.", "verified": true, "helpfulness": "0/0", "author": "Reid M"}, {"rating": 5.0, "review": "Absolutely love chromecast! Can now cast my laptop videos and phone to tv without losing access to using the laptop or phone! Can cast one tab and keep working or browsing internet! Youtube is great on this little gem. can cast a whole playlist and access the playlist from any device. its awesome! will be buying another for each room in my house!", "verified": true, "helpfulness": "0/0", "author": "jenna cotton"}, {"rating": 4.0, "review": "Great for all apps but issues when using from a laptop to cast with a video stream from a website", "verified": true, "helpfulness": "0/0", "author": "Elin Rhodus"}, {"rating": 1.0, "review": "I purchased this product, it arrived within two days but doesn't work.  Apparently it's not compatible with my Linksys WRT1900AC wireless router.  Google website says to contact Linksys for support.  I contacted Linksys and was told it would cost me $29.99 for the tech support since my router is out of its 90 day complimentary assisted support.  I was also told there were no guarantees that they could resolve the connectivity issue, but I would have to pay the fee regardless.  I'll be contacting Amazon to get a refund.  There are also numerous other LInksys routers listed on the Google website that might not be compatible.  I recommend you check this out before purchasing Chromecast for yourself.", "verified": true, "helpfulness": "0/0", "author": "DelaBob"}, {"rating": 5.0, "review": "LOVE IT BOUGHT 4 MORE", "verified": true, "helpfulness": "0/0", "author": "Driver"}, {"rating": 5.0, "review": "Couldn't be happier. Easy setup on TV. Works super easy with both Android and IOS.", "verified": true, "helpfulness": "0/0", "author": "DSY \"DSY\""}, {"rating": 5.0, "review": "AMAZING. I have now purchased one for each of my bedrooms. The only feature I wish they would add is the ability to turn OFF your televisions. If your TV has HDMI-CEC support, you can turn your TV on and it will turn to the correct input for you. There is just no way of turning it off at this point even though CEC supports this ability.", "verified": true, "helpfulness": "0/0", "author": "M. Murri"}, {"rating": 3.0, "review": "It's not bad. It doesn't work with Amazon Prime so I basically just use it for Netflix, Pandora, and Youtube. It can be used with a laptop with googlechrome, so that's nice.It cuts out a lot though. It's better now that I've plugged the chromecast into the extension it came with, but if I'm streaming from my ipad and leave Netflix to do other things (while still wanting Netflix to be playing) the \"casting\" screen will disappear and lose communication with my ipad. So I'll have to put it in airplane mode and exit out of the app a few times before it'll load with the casting screen (and that's if it disappears and I want to pause/stop it). If it starts to load and the screen disappears, I have to unplug the chromecast to get it to work.All in all it's not bad, but given the choice I probably wouldn't buy it again.", "verified": true, "helpfulness": "0/0", "author": "Tory Paulson"}, {"rating": 3.0, "review": "It works but don't expect it to stream video without lag or stuttering.", "verified": true, "helpfulness": "0/0", "author": "PeeKay \"PeeKay\""}, {"rating": 5.0, "review": "I love it so easy to use works great", "verified": true, "helpfulness": "0/0", "author": "Elaine Gackle"}]