[{"rating": 2.0, "review": "too much jitter - too much fidgeting with devices - i'm a techie and I slowly wound down my usage to zero and then packed it away.  Get a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Giving up\""}, {"rating": 4.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Katie Owen"}, {"rating": 3.0, "review": "Plan and simple  It doesn't work but amazon replaced with a new one", "verified": true, "helpfulness": "0/0", "author": "ppx"}, {"rating": 5.0, "review": "Works as you'd expect. Know that it requires power to it via a power cord so make sure you have that and a spare HDMI port in your TV.", "verified": true, "helpfulness": "0/0", "author": "Anna L."}, {"rating": 5.0, "review": "This is soooo cooool.", "verified": true, "helpfulness": "0/0", "author": "Scott R Parent"}, {"rating": 1.0, "review": "Did not work for me.  I returned it", "verified": true, "helpfulness": "0/0", "author": "T. Stewart \"Tom\""}, {"rating": 5.0, "review": "Great addition to your TV. Contritely l continuously being improved my Google. Beautiful pictures displayed when not in use.", "verified": true, "helpfulness": "0/0", "author": "Mohammad Alhassani"}, {"rating": 4.0, "review": "works great most of the time had some issues where needed to reset but not very often so good product I recommend", "verified": true, "helpfulness": "0/0", "author": "Gil"}, {"rating": 2.0, "review": "It works, but it's slow as molasses to respond to commands.  For example, say you're watching netflix and want to pause it... you open the app and the netflix app is slow to respond, but after a couple seconds it allows you to press pause.  It now takes at least 3-5 seconds before that command actually gets relayed to the device and actually pauses the video.Another problem is that since it doesn't have a remote and your phone or ipad is the device this is actually a pretty significant drawback.  A phone call comes in, and you can't pause the show because you would need to switch to the netflix app to pause it, but you don't have time to do that because the app is so slow.Do yourself a favor and get the fire stick instead.  The dedicated remote alone would be worth it, but it's so much more responsive as well.", "verified": false, "helpfulness": "0/0", "author": "Andrew Case"}, {"rating": 4.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Luis Polo Ferro"}]