[{"rating": 5.0, "review": "The Chromecast launched with only a few major partners, specifically Netflix and YouTube. With it's extremely simple set-up, I was streaming from both services on my iPhone within about 5 minutes. Tons of new content providers are prepared to come on board too, including Pandora and Hulu Plus. I used to run a dedicated home theater pc to run various media through my TV, and I was able to unplug it the moment I set up my Chromecast.Even better, anyone connected to your Wifi network can throw their own compatible content to your TV, creating a fun queue of your friends' favorite videos and music (especially once Pandora enters the fray).It's also great because you can cast your Google Chrome tabs to the TV as well, displaying them on the big screen. I use that regularly when I have to watch videos or webcasts for class.Do yourself a favor and pick up a Chromecast for yourself. It's half the price of a Roku with far more exciting potential. Even as a potentially unfinished product at the moment, it's more than worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Mike K \"kranzmonkey\""}, {"rating": 5.0, "review": "Awesome. Worth 35 bucks for YouTube alone. Tons of potential. More apps coming soon (Pandora and Hulu). Control from my phone or iPad. Cool.", "verified": true, "helpfulness": "0/0", "author": "barry"}, {"rating": 5.0, "review": "The Google Chromecast is a great streaming device for the money, provided you understand its capabilities. For iOS users, it will only stream Netflix and Youtube at the moment. This is great, as I basically only needed to have Netflix streamed to another TV in my house that is rarely used. With the Netflix app, its very easy to send video to the TV. My 3 year old daughter can even do it.Chrome tab casting is a good plus. It's currently in beta, but you are able to show contents of a chrome tab from your computer on your TV. This is great, as there is a lot of great flash video content i'm now able to display on TV as well.", "verified": true, "helpfulness": "0/0", "author": "Kassim Rasoulian \"DJ K-Dubb\""}, {"rating": 5.0, "review": "One of the best product I have used. Direct streaming through PC/tablet/smart phone with only 35 dollar, this is greatest bargain you could get for the similar product. Easy to use and install. The only issue here is that not much 3rd party application could apply on it now. It will required more time to complete the peripheral application, which gives this a great potential value and possibility in future.", "verified": true, "helpfulness": "0/0", "author": "K. Lin \"KT.L\""}, {"rating": 1.0, "review": "Easy to hook-up, but picture constantly freezes when streaming from Chrome. Can't watch anything from my computer. Like they say,\"you get what you pay for\"!!!", "verified": true, "helpfulness": "7/11", "author": "Vince"}, {"rating": 5.0, "review": "Works great. No delays in loading a video even on a slow DSL line. Seemless integration with Netflix and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Mikhail Edel"}, {"rating": 5.0, "review": "This thing is awesome! It needs more apps like amazon Instant video, hbogo, and huluplus, but I love it. Netflix, google play, and YouTube stream flawlessly from my phone. The chromecast is easy to set up and a dream to use.", "verified": true, "helpfulness": "0/0", "author": "Barbara A. Gross"}, {"rating": 5.0, "review": "Very simple setup, high quality Youtube and Netflix streaming, and most sites worked pretty well throwing the Chrome tab to the TV.", "verified": true, "helpfulness": "0/0", "author": "Jon G Hook"}, {"rating": 2.0, "review": "I have two Roku boxes to do most of my streaming, but Google has blocked them from having a YouTube channel. I bought a Chromecast solely because I wanted a cheap and easy solution for streaming YouTube videos on my TV, and this seemed to fit that bill perfectly.The initial setup was very easy. I got it connected to my wifi network and tested streaming from both my laptop and my Nexus 7, and everything was working fantastically for several hours. Then I made the mistake today of unplugging the device to move it to the living room. I was able to reconnect my Nexus to the Chromecast, but every time I try to launch a YouTube video the Chromecast disconnects. I can watch the videos on the Nexus itself, and I've never had a connection problem in that room with any other device, so it's obviously not a problem with my wifi.I've fought with this thing for an hour now, and I'm sure if I invest another hour searching Google and troubleshooting I may finally get it working again. But if I were any less tech saavy, this would be boxed back up for return. I can't complain too much for $35, but I'm also not going to be able to recommend it to anyone.", "verified": true, "helpfulness": "1/1", "author": "Mike Robertson"}, {"rating": 4.0, "review": "TV near router - it works great.  exactly like you would expect.TV two rooms away from router- it doesn't get a good wi-fi signal.  The ROKU box hooked up to that same TV does great.  Laptops, Android phones, and other wireless devices work great in that room also.  I couldn't stream anything.  Even casting a picasa web slide show from chrome on a wired pc, it would only display every 7th or 8th picture.It's great, assuming you use it near your router.", "verified": false, "helpfulness": "0/0", "author": "G"}]