[{"rating": 5.0, "review": "Got a second one after my toddler broke the first. Works fine and is easy to use. Very convenient. If only i could stream prime on it but i know thats not chromescats fault. Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!  Still playing with it a bit, but it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jimmy E."}, {"rating": 5.0, "review": "I am very happy excellent product, attention and speed of delivery", "verified": true, "helpfulness": "0/0", "author": "Jonathan luenga"}, {"rating": 5.0, "review": "Quick turnaround for this. I like the casting, easy to use even before I read the quick start. Wants to be unplugged from power when HEMINGWAY is removed from the display.", "verified": true, "helpfulness": "0/0", "author": "mahatmacoat01"}, {"rating": 1.0, "review": "Does not work.  The code needed does not show up and I can't place the code on the system to activate the device.  I can only hear the voice on the TV and picture does not show up on the TV.", "verified": true, "helpfulness": "0/0", "author": "d Aslam"}, {"rating": 5.0, "review": "Wow, chromecast is a lot of fun especially with the app musicmatch because you can sing along to your favorite songs I'd recommend it to anybody who loves to sing along with the radio but forgets two thirds of the words and comes up with something completely ridiculous!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Contemplated going with the Apple TV and I'm super happy I didn't. Thirty dollars is way more acceptable and this thing is AMAZING.", "verified": true, "helpfulness": "0/0", "author": "Cassie"}, {"rating": 2.0, "review": "I was so excited for this thing to make it easy to watch shows while still being able to use my computer for work. When it works, it's awesome! Unfortunately, it almost never works. It's actually almost more frustrating that it will start to work and then disconnect or buffer. I have spent so much time fiddling and googling to figure it out, and it seems to me like the product just doesn't work that well. I'll be buying an Apple TV instead.", "verified": true, "helpfulness": "0/0", "author": "Debbie Lee"}, {"rating": 5.0, "review": "Best ever.", "verified": true, "helpfulness": "0/0", "author": "kajiday"}, {"rating": 5.0, "review": "Thanks for the good service and quality of their product, they are actually recommending.", "verified": true, "helpfulness": "0/0", "author": "amadeo pettinaroli"}]