[{"rating": 2.0, "review": "At the moment (until Amazon fixes the problem) I will give this a one star rating. First, the remote control drains batteries unlike anything I have ever seen. I need to replace batteries every 2-3 days in this and then it works again. This is a huge problem since the only way to operate the Amazon TV is with a remote. Second, when I try to \"return\" the item (which I am actually only asking for a replacement remote at the present time) I can not do so with the ease that Amazon usually provides. It will not allow me to request a replacement; rather, I must speak with a customer service rep. I chose to do this via email and was sent a reply (fast enough) that I must call in to customer service (??? really???). Since I only have until Jan 31st to return or replace this item this is frustrating because I need time to receive the replacement remote to see if it will have the same problems/issues that I am currently experiencing.Additionally, the app choices are minimal at best. There are quite a few apps I would like to try out, but they are unavailable on my Fire TV or my Fire Stick TV (which I have had no problems with so far). They are only available on my Fire HDX. Now THAT is unacceptable! Another thing that has frustrated me is the fact that I would like to have Disney XD and some other children's apps on the TV but I cannot do so unless I am a cable subscriber with those channels already in my line-up on a paid subscription service. Well, what is the whole point of Fire TV then? I do not have cable! And lastly, the PBS kids videos are free for the first few seasons and then I have to pay for additional seasons. Plus, there are only a select few that are full-length versions, the rest are clips. Well, that is kind of dumb.So, in summary, Amazon really needs to make all apps available to the Fire TV instead of limiting them to my HDX. Add way more choices. And make returning or replacing this box as easy as everything else you sell.*Note - I paid $64 for the Fire TV and $19 for the Fire Stick TV on lightning deal promotion and a Prime Member promotion**Update** 1/5/2015: Okay, I bought a Roku 3 today because I plan on returning this Fire TV to Amazon due to the faulty remote (and they expect me to call in and wait 45 minutes to \"trouble-shoot\" when they could easily just send me another one). So I am adding another star to this product (which makes two stars now) because I have been able to make a comparison with the Roku 3.First, the Roku 3 remote control beats Amazon's Fire TV and the TV Stick hands down. It is a little thicker (does not feel like cheap plastic as Amazon's does), has a glossy finish vs matte for the Fire TV (which just feels better in my opinion), and can be used as a controller for games and has buttons similar to a Wii remote (which is much better than the Fire's flat buttons that are not labeled and are difficult to press). I wanted a game controller (another $40) for the Fire TV but they are out of stock for the next month according to the website.Second, and the reason I upped a star for the Fire, Roku 3 has crappy apps with hardly anything decent for kids (which is the main reason I purchased this to begin with). Amazon has a larger selection even though I do not feel it is large enough - especially in the educational app section. A problem I ran into when trying to purchase apps is that almost all of them (if not all) were compatible with my HDX, but hardly any of them were compatible with the Fire TV or the Stick. That was enough to make me not raise this review to 3 stars rather than just the 2 that it currently gets from me.A great thing Amazon has done, however, (and I mean GREAT) is make a kids account available so that only the child's apps show up when they turn the tv on. That is awesome considering the sights that are on the apps. For that, I would actually reconsider returning this since there are no better options out there for children as far as I can tell. But the problem still exists with the remote and the lack of apps available for this device in comparison to what Amazon actually has available in the app store. I have faith that this will get better in time, but I suppose there will be a new device released when all these issues are fixed and this one would be useless then anyway (since it almost is now).", "verified": true, "helpfulness": "0/2", "author": "stars in dreamland"}, {"rating": 4.0, "review": "Product is fast and works great, wish that they had apps for major TV networks. Would buy again.", "verified": true, "helpfulness": "1/2", "author": "Edward A Schramm Jr"}, {"rating": 5.0, "review": "Bought Fire TV to upgrade from our Roku.  Overall I like the more polished interface of the Fire TV, especially the voice search and episodes in a season just start automatically after finishing one.  It's all the little things that make the Fire TV a better streaming box for our family.", "verified": true, "helpfulness": "0/0", "author": "Christian F. Wolff"}, {"rating": 5.0, "review": "Great addition to my TV", "verified": true, "helpfulness": "1/2", "author": "Cathy Boyle"}, {"rating": 5.0, "review": "Still getting acquainted with it,  Can't figure out some of the Pandora features.", "verified": true, "helpfulness": "0/1", "author": "Yvonne Argyle"}, {"rating": 3.0, "review": "This wasn't the device I was hoping for.Pros - I did find a few things appealing1) Nice and fluid GUI interaction, (clearly sufficient CPU/Ram for great user experience)2) Nice looking GUI3) great for your kids to access Netflix4) Voice search is effective for Amazon's OS to find apps and things in Amazon Prime apps (cannot search within apps, so don't expect that)5) screen mirroring app is built into the OS6) you can side load apps (over the network) if you really need something.Cons - There are a few things in particular that made me less than enthusiastic about the device.1) There is no direct Amazon store or Google play built into the Fire TV.2) There is not the same level of integration on the Fire TV that you would normally get with other Android devices.3) The remote is horrible for any of the built in games.4) The recent lock down of the Fire TV would really make it a no go for just about anyone I know. (for get rooting it)5) There the gamepad is overpriced since you really don't have many gaming options in the first place.6) Amazon Free Time is the only way to make this device a true youngster friendly device (so be prepared to sign over more of your life to Amazon (prime + free time + any other apps you want that are deemed friendly by Amazon)I recommend side loading a few apps that you may really want and getting a wireless usb keyboard and/or usb keyboard.Do, misunderstand this review, it's not all bad. In fact it's decent, but in my opinion, I find it all to be too in flexible)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device. Wife hasn't turned it off yet!", "verified": true, "helpfulness": "0/1", "author": "Bill Worden"}, {"rating": 5.0, "review": "Best one out there better then chromecast and Roku", "verified": true, "helpfulness": "1/2", "author": "Affordable Security Locksmith & Alarm"}, {"rating": 4.0, "review": "Got this for Xmas as a gift, really have enjoyed the Fire TV, surfing movies that actually let you view trailers prior to renting, a big plus in my opinion.", "verified": true, "helpfulness": "0/1", "author": "mark holland"}, {"rating": 4.0, "review": "The Amazon fire TV is great for using services like Netflix, and Prime, however I am disappointed that the only way to watch shows from cable TV is by purchasing them from Amazon. I would love to see integration of the cable TV apps such as Fox Now, and CBS in order to allow those of us with a cable subscription access to old episodes. Roku has made an effort to do this by rolling out the Fox Now app to their devices. Besides this the amazon Fire TV is a great product and I would highly suggest it!", "verified": true, "helpfulness": "0/0", "author": "Harrison Allen"}]