[{"rating": 4.0, "review": "I like how you can quickly display on your tv what is showing in your Chrome browser or YouTube, but I've noticed that it does not stream 720/1080 resolution video on YouTube very well, it can be choppy.  My broadband is not the problem, I have Comcast 60MB/s Blast. I also have a DOCSIS 3.0 modem and my wireless router works perfectly fine so it has anything to do with my wifi connections.  I think at the HD resolutions the Chromecast just can't handle the amount of HD data to stream wirelessly?  For example, I'd be watching a YouTube video on my tablet just fine at full 1080 resolution with zero lag, but at the same time on my tv with the Chromecast it is chopping the video up like broccoli.  I guess I'll have to play around with it more with the HDMI extender, but I still wish it could handle HD content better.  Still, for $30(what I paid) it's a pretty cool toy.", "verified": true, "helpfulness": "0/0", "author": "SlickBuyer"}, {"rating": 5.0, "review": "Very cool product. It has glitches- but it is still worth it. Makes my annoyingly in the middle of the room HDMI cable unnecessary!", "verified": true, "helpfulness": "0/0", "author": "Miss Pixie"}, {"rating": 2.0, "review": "Google doesn't offer the extension for my Galaxy S 3 phone.  I tried one movie on google play and it failed to load.  Google gave me my money back but it certainly wasn't what I was looking for.  Works well on you tube but that's about all.", "verified": true, "helpfulness": "0/0", "author": "John Phillips \"Deerman\""}, {"rating": 4.0, "review": "i won't talk about what it is, since a plethora of folks already talk about it.what i am going to talk about, is how to use this unit CORRECTLY for the best possible results, and not a single reviewer from the first page got it right.this unit pretty much plays contents in one of the two ways: rendering natively, or mirroring.when possible, always use native rendering. like youtube, select the chromecast you want see from and then you could shutdown your computer/phone and the video will keep streaming since it is, afterall, rendered on the chromcast unit. i saw reviewer amazed by battery life when using method. to which i must say... dun.. this is like instead of using computer A to watch the video, now i use computer B to do it while i am impressed by the battery life of the computer A, which is now not doing a thing and can be completely powered down, and throw in the trashcan.what i am going to talk about in detail, is how to stream a single video file (such as avi, mkv and etc) on your big screen. reviewers all said the tab casting is horrible, oh well, if you know nothing about it works, then expect horrible results.let's review what it actually does: the moment you click tabcast, it actually  encodes your tab content and send to your router, your router then send this packet of UDP information (unless you specify TCP), the chromecast then decodes the packet and redisplay the image and sound.obviously the encoding scheme cannot be too brilliant since a high compression scheme would require more work to compression and De-compress, so the only other thing you could improve is the bandwidth. unfortunately, the chrome-cast only support 2.4ghz b/g/n. so here is what you have to do if you want to stream a native content on to the TV without a media server like PLEX to trans-code the content.1. use Ethernet on the host computer when possible. Gig Ethernet is order of magnitude faster than even the best AC product in a real life scenario. i am not going to spend time explaining but any electrical engineer should be able to tell you that.2. move all your other wireless device to 5G range if possible.3. start doing tab cast on that Ethernet connected device. note, you need to use WIFI connection to setup the chrom-cast initially, and then it is reachable from all other networks (should you allow the routing). for everyone who does not do advanced networking in your home. this means you can reach chromcast pretty much from your router's 2.4G, 5G or physical port.  make sure both your host computer and router supports Gigabite Ethernet (and gigabite swithcm if you have one in between), and make sure you use a decent N router that provides at least 300 Mbps advertised speed for 2.4G (not combined speed).4. if possible reduce the distance between the chromcast device and your router. this will help BIG times as speed of N could drops to 20% of what it could just over 2 walls.if you did just that, you will be amazed.what if... your host device is like MBA or the so called \"ultra books\" that doesn't have a wired access? or it is not physically possible? well, then you need to make sure you moved yourself to a 5G range and free as much times lot (basally how WIFI works) as possible for your device and chromcast (so you take the 5G freq and chrome uses 2.4G).if you are completely limited to 2.4G freq and have a crappy router (maybe some came with your ISP) and the router is on a different floor as you are, then you could basically forget about doing the mirroring.", "verified": true, "helpfulness": "0/1", "author": "Sean Li \"Sean\""}, {"rating": 1.0, "review": "Chromecast convinced me that Google is not ready to be a product company. I use Chrome and Gmail, Google Earth, and have an android phone.I was really looking forward to playing with the Chromecast, but it would not talk to my WIFI.  Now, my pc's, laptops, Kindles, printers, and Roku all talk to my WIFI very easily.  But Chromecast has a large list of WIFI's for which the Chromecast is incompatible and it may requires settings that the user cannot reset, but have to be reset by the cable company.  I read some blogs where one person worked 1 1/2 days to fix the WIFI connection. It is also not clear that the Chromecast will work with a network that has a VPN running on it.  It is clear from the blogs that running Chromecast through a VPN may not work, but the error message that we received stated  that the connection may be failing due to an active VPN on the network.  Well we run a VPN on our network many hours per day.Lastly the Help offered online for Chromecast was very weak compared to typical tech products of the current day.  Lots of help is available via blogs and YouTube but not from Google.If the player works out of the box for you then you are probably set, but I wish that Google had made the Chromecast work for all of the major WIFI routers, had better help support, was clear on whether a VPN can be present or not.I sent mine back and will buy another Roku (which is one of my favorite tech products) for my upstairs TV.", "verified": true, "helpfulness": "1/2", "author": "Malcolm Jones"}, {"rating": 5.0, "review": "Every now and again something comes along that does more than you expect.  Sending CSI episodes from the CBS site to the living room TV as well as YouTube videos is a major convenience.  Setup couldn't be easier.", "verified": true, "helpfulness": "0/0", "author": "Howard Beale"}, {"rating": 1.0, "review": "I bought the Chromecast right when it came out. I instantly loved it. It worked flawlessly. Netflix, Google music, youtube, sharing tabs using Google Chrome on a laptop -- it all worked perfectly. I *used* to absolutely love the Chromecast. However, since receiving numerous updates for the Chromecast (which cannot be prevented and cannot be reverted), my Chromecast is now broken. After watching more than 5 minutes of Netflix, my phone will loose contact with the Chromecast. The only temporary fix is to power cycle the Chromecast -- RIDICULOUS! I've tried this with a friend's (different) Chromecast and phone as well -- same problem. I really wish that Google's Google TV team didn't touch the Chromecast after launch...it *was* a perfect product. Now it's useless.", "verified": true, "helpfulness": "2/3", "author": "Malcolm"}, {"rating": 5.0, "review": "I like this better than my Roku. I seem to use it most for YouTube and Netflix. YouTube isn't available for my first gen Roku yet.", "verified": true, "helpfulness": "0/0", "author": "Rick E."}, {"rating": 4.0, "review": "I was given this for Christmas and I wanted one pretty bad.  My main application was to use it to stream You Tube videos to my TV because I watch a lot of \"how to\" videos there and its nice to NOT be on the computer all the time.  It is VERY easy to set up.  The video quality is really good, especially on you tube.I gave it a 4 star rating because streaming video from the web using \"google cast\" off the chrome browser is really choppy.  Its clearly marked that this is in beta but I expected a bit more from google in that regard.  Again, that's not the main reason that I like it.  It does work really well with plex as well.", "verified": false, "helpfulness": "0/0", "author": "Robert"}, {"rating": 1.0, "review": "My smartphone does practically everything except shoot toilet paper out. The reason I dislike the chromecast is it requires my smart phone to run yet another application, which is slow, and is not easy to use.Affordable - I'll give you that.But I went back to my OLD Roku.", "verified": true, "helpfulness": "1/1", "author": "Heitah"}]