[{"rating": 4.0, "review": "I love Kindle Fire, so I jumped on getting Fire TV. I think it is much better than Roku and Apple TV (which I also have). I love how it integrates with my KF tablet, which I use all day long for movies, TV, and music.I wish many of the apps that I run on my KF would work on Fire TV.I also cannot believe Amazon did not include an app for Amazon Cloud (Music) player. Even Roku has that!!The Fire TV has a digital audio app which would be perfect.I am also missing my other apps, like PogoPlug, SlingMedia, Simpsons, FIOS mobile, IMDB (an Amazon company), TED talks, and join.me. Some I could see might be a challenge with Fire TV, but really no Amazon Cloud Player. I hope that gets fixed quickly.Besides Amazon movies and the \"talk feature\", the best thing is the app. PLEX - which is like Amazon Video combined with my local Video library, just wish the \"talk feature\" could search inside it as well. There is a YouTube app that is not bad. Much better than anything on Roku or Apple TV.", "verified": true, "helpfulness": "1/1", "author": "do-not-ask-me \"do-not-ask-me\""}, {"rating": 4.0, "review": "I had the chromecast but gave it away after receiving the fire tv. It was very easy to set up and enjoy streaming through plex. I also love the fact that when I am watching a series on netflix it just continues because on the chromecast you have to go back to the controller on your ipad or phone whatever you are using as a controller and go to the next episode. I would have given it 5 stars if it had HBO go.", "verified": true, "helpfulness": "1/1", "author": "ianthe"}, {"rating": 5.0, "review": "Got this set up in 5 min and we were watching it right after. My 6 year old can maneuver through all the options to watch or play whatever he wants. Really like this. Totally worth the money.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Nate"}, {"rating": 5.0, "review": "I bought a new curved Samsung 55\" Ultra HD Smart TV and decided on a whim to order the Fire TV as well.  It is amazing to use.  So easy.Disclaimer:  I had a professional install my new TV because it's up high in a hard to access spot.  So I can't speak to the install.", "verified": true, "helpfulness": "0/0", "author": "SherryG of Tulsa \"sherryg_ok\""}, {"rating": 5.0, "review": "It's easy to use, mobile...I can take it from the living room into the bedroom without any trouble.  It streams fast...much better than dish that drops!", "verified": true, "helpfulness": "0/0", "author": "Sherrie Goetze"}, {"rating": 5.0, "review": "OK so I generally don't write reviews.  I don't get all technical and spew forth on the merits of whatever...I will say this, though...  this thing is full of the awesome!  With tech specs far and away from the others in the pack of streaming devices, I fell in love with my Fire TV.  So did my son.  In fact, we fell SO in love with it that we even ordered the game controller.Let the others say it in huge essays, extolling the virtues and merits of this awesome device...  I will keep it simple and say that, if you plan on buying any streaming device THIS is the one to get!", "verified": true, "helpfulness": "1/1", "author": "Selina Harvey"}, {"rating": 1.0, "review": "You better have a good wifi! or it will just pause for as much or more than 5 at a time.  So much for the viewing experience??????", "verified": true, "helpfulness": "6/21", "author": "Kelly"}, {"rating": 5.0, "review": "Amazing product. It took all of about a minute to set up. I was really happy to see my video library show up and play flawlessly, Netflix is much easier to navigate than my previous blu-ray setup. Best entertainment money I've ever spent. Keep the great products coming.", "verified": true, "helpfulness": "0/0", "author": "Gerald Rawson"}, {"rating": 4.0, "review": "If I were to rate the device on its own merits it would be a 5 star device. What I mean is that all of the features are there from Amazon. The speed is amazing. I mean, if you're coming from an Apple TV or Roku you will be blown away by how fast the menus fly by, how quickly things load (especially on a wired connection...almost instantaneous high HD), and how quick everything just...works! In fact, the machine is so fast, and it's such a change from my old Roku 2, that I find myself accidentally skipping over things, as I'm more accustomed to a device that takes a few moments to load or go to the next option.The set-up was fast and easy, though I wish there would've been an option to skip the tutorial. For new users and people new to streaming boxes, I'm sure it's very helpful. For someone like me, it's just an annoying part of the set-up that keeps me from streaming. It's a very, very minor issue, though, and only occurs one time, during the initial set-up, so it's not worth docking any points for.The voice-search is perfect, and I haven't had any tests where the Fire TV didn't correctly pick up what I said. It must pull the information from IMDB (and Amazon company), as you are able to say things like \"Jack Bauer\" and Fire TV shows you all the options for watching the Fox show \"24.\" It picks up on characters, even if you don't know the actor's names! Incredible.As many people have mentioned, the voice search does NOT currently work with anything other than some Hulu support and Amazon's own collection of material. This is NOT Amazon's fault, though, and is NOT a limitation of the box. They have already stated that Netflix support and support from other providers (Crackle, etc) is coming. That support is not handled by Amazon, though. It's up to Netflix and the other companies to develop the necessary programs to recognize and utilize Fire TV's voice search. As soon as those companies jump on board, Fire TV will have the best, easiest and fastest universal search for media on the market.The gaming I can test right now is limited, as the controller is currently out of stock, but Asphalt 8 works amazingly well, the game loads fast, looks great, and I can't wait to get the controller so I can play Deus Ex and The Walking Dead.Finally, the second screen function works perfectly with my Kindle Fire HDX. Flinging back and forth media works without a hitch, and once again...it's fast! I tested it out with the new GI Joe movie (just because it was featured in the new release section on the home screen), and the second the movie started on the Fire TV the second screen icon on my Fire HDX appeared, allowing me to view the actors in the scene, music, and I was able to beam the movie right to the tablet when I went to the kitchen to make some food, then back to the TV once I was back in the living room. Perfect. Flawless. Fast.Love this box, and as soon as the other developers of content get their programs compatible with the Fire TV's search and voice search abilities, this will be the best option for anyone interested in having a great media player. Cannot wait for future updates and innovations.Well done, Amazon!", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "No glitches whatsoever. Plug and play all the way. I plugged in the power, plugged in the Internet, and plugged in the HDMI cable connected to the TV, and boom... worked like a charm!  Thing of beauty.Yes, it is programmed to give preference to Amazon Prime content over Netflix or others, but since I'm a Prime member, it's absolutely perfect for me.  Also, I can watch Bloomberg business videos in it.  That's a huge plus because I really like Bloomberg.This thing is awesome!", "verified": true, "helpfulness": "0/0", "author": "Jazon Samillano"}]