[{"rating": 1.0, "review": "I was so excited to get this Media Player.  However, my excitement soon turned to frustration.  After several hours of trying to connect with my Kindle HD I called KIndle and was told that it was not compatible with the Chromecast.  I then tried to connect with my labtop.  This to was not fruitful. I called Google and requested help.  After about an hour of talking to someone on the telephone I was told that he really could not help me.So, after having the devise for over a month Ihave still not able to get it to work.  A real disappointment.", "verified": true, "helpfulness": "3/8", "author": "Karen K."}, {"rating": 3.0, "review": "I do not use a laptop. So I was depending on my Kindle Fire (and desktop computer) to use this Chromecast device. I searched the literature, Google said android devices and tablets would work. Kindle Fire is an android device (tablet) so I thought it would work. I could not set up, so called Google and they told me my Kindle Fire does not work with Chromcast. I do not have an android phone and will probably never get one. I am disappointed, Chromecast is a nifty product. I have an older Roku player, there is an app for Roku that works well with my Kindle Fire. I will probably update my Roku player.", "verified": true, "helpfulness": "3/4", "author": "Grampsgeorge \"Grampsgeorge\""}, {"rating": 4.0, "review": "Had some trouble with set up because I live in Canada, but other that that it works well. I would recommend it.", "verified": true, "helpfulness": "0/1", "author": "Clayton Dreger"}, {"rating": 4.0, "review": "Setup was a bit more challenging than I expected.  Initially I plugged the device in behind my TV and it couldn't find it.  I then plugged it into a side port and after 4-5 attempts it did connect and I was able to stream a TV show.  Tip if you have been watching on lower res on a laptop it will look BAD on a 42\" TV.The Good:I tested it with a non-standard streaming site and it worked brilliantly.Sound quality is as good as your TV or sound system (no tinny echos from my laptop and no lag with between the audio and video.)The video quality is completely dependent on your source 320p looks awful, 720 looks broadcast quality,Hulu works fineThe Bad:The power plug is rectangular and doesn't fit into european round receptacles.Plugging it into the side of the TV isn't attractive.The Meh:When you first turn it on you have to wait approx 1 min for it to be \"Ready to cast\"  until it syncs you must wait.The Ugly:The power indicator light makes a VERY bright night light (it didn't wake me up but I did make me unplug it to get to sleep).Casting a normal webpage works but the text is miniscule.  Using your browser's zoom helps but isn't perfect.  150% was good for me.AmazonPrime uses a video type that isn't currently supported.", "verified": true, "helpfulness": "0/0", "author": "C. Johnson"}, {"rating": 2.0, "review": "I have WD TV Live box so I can pretty much use any service including Netflix and Youtube. With my android phone it is even easier to control WD TV Live. For me the only reason to buy Chromecast was to use Chrome browser's tab casting function. I have an I7 extreme laptop with 16 gb of ram and 250 GB SSD, so I can guarantee you that it is no slouch. I have a net gear router and have had no trouble streaming anything from the internet before. The problem with this device is that the tab casting is terrible. The video is choppy and the sound is out of sync.PROSBest device on the market for  Youtube and Netflix.Small SizeConsJust another disappointment after Miracast.Apple has had Airplay for ages and us Android users still can't get it.The collection of APPS is 4.It supports 4 APPS.That's it, just 4 apps.", "verified": false, "helpfulness": "1/1", "author": "Twain Mark \"gc\""}, {"rating": 1.0, "review": "Chromecast does not work with the Gateway supplied by ATT for their U-Verse DSL service. The Gateway is a Motorola VNG510.Chromecast requires a wireless router that supports UPnP (Universal Plug and Play) to make the wireless connection. The Motorola VNG510 does not support this feature for security reasons.Only way a Chromecast will work is to go into the Gateway's set up and disable wireless security. THIS IS NOT A GOOD IDEA.Google, please update the Chromecast firmware to allow it to connect to a wireless network using the normal SSID and PASSWORD protocol.", "verified": true, "helpfulness": "2/7", "author": "Balticbeau"}, {"rating": 5.0, "review": "One of the greatest thing ever invented since the caveman discovered the fire! The most inexpensive way to make an older HD tvs(like my Panasonic \"50 plasma) get with the program to the rest of the modern and more highly advance tv sets out there.  It plays well with my android phone and HP touchpad(with Android OS - dual boot). It took me awhile to receive this item due to Amazon running out of stock, but I  only paid $35 compare to others selling for more on their site.  Highly recommended, you'll be glad you did!", "verified": true, "helpfulness": "0/0", "author": "G. Banez"}, {"rating": 3.0, "review": "Google Chromecast HDMI Streaming Media PlayerWorks as advertised: Streams videos from Google Play, YouTube and Netflix.  No local streaming from Android (yet [fingers crossed]) and I haven't tested the  PC > Chrome browser streaming yet (will update once I have my laptop from work), however I do know that the PC and Chromecast communicate directly (ad-hoc) so a PC without Wifi is unable to stream (doesn't use the Router).Hoping for a more open development environment as Google needs to approve the app or concept (not exactly sure) and be on a whitelist.Still not as open an a Raspberry Pi on XBMC, but for the less-techy users this is great and super simple to setup.  I live in Canada so it was difficult to obtain the Chromecast app for Android, but it is possible with some searching.Giving it 3 stars because MANY other products can do what the Chromecast does and I would update to 5 stars when more apps are supported, hoping (doing a lot of hoping) that console emulators get the casting feature (ie: SuperGNes) or simple cast what you have on the Android device (also compatible on IOS but I have no need for that as I am Android user)!", "verified": true, "helpfulness": "0/0", "author": "Derek"}, {"rating": 5.0, "review": "I ordered a Chromecast and tried it out at my dad's house. He liked it so much that he kept it and I just ordered another one for myself Great for streaming YouTube, Netflix, and any content in a Chrome browser tab to a TV from a PC, laptop, tablet, or phone connected to the same network.", "verified": true, "helpfulness": "0/0", "author": "D.R. Schmidt"}, {"rating": 5.0, "review": "Love it .. was easy to set up with both my galaxy and laptop .. within 10 minutes I was able to cast with both .. onlything I didnt like was the wait ..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]