[{"rating": 1.0, "review": "After  two months, and multiple attempts at downloading all manner of programs, we have just given up and are waiting for our tech friend to show up and make it work.", "verified": true, "helpfulness": "0/1", "author": "Keivn J. Mccloskey"}, {"rating": 5.0, "review": "If you own a smartphone, have Wi-Fi and modern HD TV at home you will love it. Set up was easy just plug it in, install on your phone and connect to enter a wifi password.I have been wa trying free PBS programming in YouTube.More all's will be compatible soon but even now I can stream my video collection using Twonky and a new android app called Avia. Very simple and straight forward n", "verified": true, "helpfulness": "0/0", "author": "R. Muller"}, {"rating": 3.0, "review": "Works well with things that have casting ability such as You Tube, Netflix and Pandora. However, when trying to cast a web page (which is a beta phase function) it fails miserably. I get a mostly pink screen with a ghost like effect of the words, pictures etc.", "verified": true, "helpfulness": "0/0", "author": "V. R. Ingalls"}, {"rating": 5.0, "review": "The item works great and it's nice to be able to just stream from my iPhone anytime. Well worth $30", "verified": true, "helpfulness": "0/0", "author": "Charles Matthew Dabney"}, {"rating": 2.0, "review": "When the Chromecast works, it is great.  However, it has to be re-setup every time there is an interruption I  the power or the internet.  Further, the setup is straightforward if the device responds as it should.  Notice the word \"if\" as this is rarely the case.  Most often, 45 minutes is spent cycling through the same process until it finally cooperates.", "verified": true, "helpfulness": "0/0", "author": "Christopher Shadrick"}, {"rating": 4.0, "review": "Worked without any problems when paired with my son's computer and HDTV.  Arrived promptly, and was able to take advantage of Amazon's Christmas special (with a reduced price and free movies from Google Play).  Great deal.", "verified": true, "helpfulness": "0/0", "author": "Mililani Guy \"Mililani Guy\""}, {"rating": 5.0, "review": "Great buy and I am so happy I have this now. I will recommend this to friends, family , and others", "verified": true, "helpfulness": "0/0", "author": "James C. Jones Jr. \"King\""}, {"rating": 1.0, "review": "It's $35 to do what your blue ray player already does.  Total waste of time. Pandora will connect but no sound. No real support with chromecast for these problems except their website of painfully obvious answers that don't work. The google music app doesn't work well either so I can't enjoy music through it at all. I kept telling myself it must be me but after reading some of the other reviews and fooling with it for a week, I'm finished!I'm boxing mine up and returning it. I'd rather literally flush $35 downtown he toilet than to give this product revenue after all the hype.", "verified": false, "helpfulness": "0/2", "author": "Keith"}, {"rating": 5.0, "review": "This is a really useful product that allows you to very simply plug into the back of your TV, and stream HD video, movies etc... from your computer, laptop, tablet or phone. right to your HDMI TV. It comes with everything you need to get started. The only thing you will need to do prior to getting started is to download the Chromecast app on the device you wish to stream from; then just plug in the Chromecast and your ready to go!Remember: download the app first!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this for my husband for Christmas.  It was highly recommended to us.  It is a really neat gift for someone that likes gadgets….and my husband loved it!  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "A. Freeman"}]