[{"rating": 2.0, "review": "Waste of money! I returned this since it did not do one thing my Panasonic Viera smart TV app, or the Verizon Fios mobile app, already did. However, if one does not have cable or smart TV, it will work.", "verified": true, "helpfulness": "0/0", "author": "DAVKONE \"gadget fun\""}, {"rating": 5.0, "review": "Given the price, it was a no-brainer to get a couple of these.  I don't use it a lot but very handy when I need to.", "verified": true, "helpfulness": "0/0", "author": "Tahoe Steve"}, {"rating": 5.0, "review": "Great product, works fast off of my wifi, and i think my favorite feature on it is the ability to watch you tube videos and listen to your Pandora app. I would recommend this product to anyone!!", "verified": true, "helpfulness": "0/0", "author": "Mike Siemer PhD"}, {"rating": 4.0, "review": "I use this from Sony Xperia M, I am not able to stream much of the contents using Plex media server list few of the contentsI own a EZ cast too, even though the quality is little on the down side can pretty much play most of the contents online.-Battery drains fast-unable to play much probably of format restrictions and DRM", "verified": true, "helpfulness": "0/1", "author": "U-day"}, {"rating": 4.0, "review": "Good, Just as described!", "verified": true, "helpfulness": "0/0", "author": "Jin chen"}, {"rating": 5.0, "review": "Best tv device ever", "verified": true, "helpfulness": "0/0", "author": "Mario G. Ramos"}, {"rating": 3.0, "review": "It worked right out of the box for about a year and all of a sudden there is an error stating can't find Chromecasts. My device is shown on the TV and all the connections are arranged just like the tutorial. Using an Ipad like before is useless. Last week, I casted from my Imac, now it says device missing. Thank goodness it was a gift as its throwaway fodder now.", "verified": false, "helpfulness": "0/0", "author": "G. Cernicky \"pingeyez2\""}, {"rating": 4.0, "review": "I love having this thing to stream whatever I want! It's so convenient. The only thing that sucks is my internet provider and sometimes it's really laggy, but I'm pretty sure that it's the internet and not the Chromecast. Definitely a must have!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "LOVE IT! works with android or iPhone. Never an issue with it. Great price and love it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jess"}, {"rating": 5.0, "review": "I love this item!", "verified": true, "helpfulness": "0/0", "author": "Joel Lara"}]