[{"rating": 5.0, "review": "I've tried Miracast, Apple TV, PS3, various DLNA players. This beats them all, hands down.Once you pair it with Plex so you can stream local media, it becomes a fantastic addition to the TV, without any of the ugly set top box nonsense.", "verified": true, "helpfulness": "0/0", "author": "R. Horn"}, {"rating": 4.0, "review": "Works great for Netflix and Youtube from iPad, iPhone and computer, but tab casting is limited to computer.  Therefore, not as much access to other media services conveniently, but it does help to have the lower price tag.", "verified": true, "helpfulness": "0/0", "author": "Terry Farrell"}, {"rating": 4.0, "review": "I feel that its a very nice item to have these days. We can now play anything from our iPad Air and even our phones onto our TV. Just Awesome...The ONLY thing I haven't been able to figure out is how to play with chrome browser in the laptop.We did try a couple of times - it isn't that simple atleast thru my laptop. I am confident that if its possible - we will figure it out :-)Otherwise, I would have given this 5 stars....", "verified": true, "helpfulness": "0/0", "author": "Seshu A. Saatuluri \"Seshu Acharya\""}, {"rating": 3.0, "review": "What can I say about the Chromecast that you don't already know or have read in another review?  Hmmm, let's see.  Well, first of all, the price, form factor, and ease of use can't be beat.  However, as an iOS user, there's definitely room to grow.  At least Google did the smart thing and made sure their device works on all platforms, not just Android, but I can't help but think that it's not getting the app support that it really needs.To me, every single application, and yes, even iOS (despite their pushing of Airplay and the much more expensive Apple TV) should support the ChromeCast.  There should be a way to just have that cast icon pop up all over the place.  Alas, on my iPhone, there's only a few places I get the benefit - Netflix, YouTube...Maybe an occasional other video app or two.  But honestly I think I've only used this thing with those two apps so far.  So, if you're someone who uses Netflix and YouTube a lot, and tends to always pull stuff up on your phone or tablet, and then wants to show it off to the room, I can see how this would be a fun device.When company is over, and we want to share a funny YouTube clip or allow others, this device has been a lot of fun there.  Anyone who logs into your wifi network can cast up from their device, making it sort of an interactive experience.  This has been one of my favorite features of the device, and one I didn't even think I'd use much.Finally, and this was a surprise, I love the HDMI-CEC that steals the input when I start casting.  If I had to manually switch to the TV input this device was plugged into every time I wanted to use it, I'd use it a LOT less.  The fact that casting automatically switches the input (because my AVR and TV support it), it's way sleek.  Something I had no idea was possible before I bought this, but something I really love now that I have.For the cash, I'm glad I bought this thing -- But I'd probably have been a lot happier if it was even 10 bucks cheaper.", "verified": true, "helpfulness": "0/0", "author": "BDP \"BDP\""}, {"rating": 1.0, "review": "I thought this was going to be like Apple TV. But it's not at all. It had terrible graphics and constantly freezes while watching a movie on my Mac book pro. Don't buy this. You're better off buying Apple TV. Don't waste your money!!", "verified": true, "helpfulness": "0/0", "author": "SN"}, {"rating": 4.0, "review": "I'm amazed what this delivers for under $40.I didn't think watching YouTube on TV would be a great feature but I use it all the time. It's excellent to create a playlist of College Humor or Key and Peele (I like comedy) and just sit back and let it play.They recently added Crackle which has a decent library of free TV shows and movies, along with a fun new webisode series \"Comedians in Cars Getting Coffee\". I anxiously await more apps.", "verified": true, "helpfulness": "0/0", "author": "zach phillips"}, {"rating": 5.0, "review": "just love it and I can cast my kids' favourite youtube content to my big screen TV.  Every family should have it.", "verified": true, "helpfulness": "0/0", "author": "ce zhang"}, {"rating": 4.0, "review": "This is a cool concept, but it would be nice to have a remote to control the current playback without having to use my mobile device. Looks like the new HDMI stick from Roku has a remote...might have to try that soon too.", "verified": true, "helpfulness": "0/0", "author": "Paul Carter \"cartpauj\""}, {"rating": 3.0, "review": "I was so excited to receive this after hearing how great it is. The setup was easy and was watching netflix and youtube videos from iphone to TV quickly which was cool. But then it stopped working and even after restarting the devices it still was not working. Also I was told you could stream video and other sites with chrome browser.  I installed the extension on my chrome browser pc and casted a tab to the TV. It would cast the tab but would not play any video or on some sites the video worked but not the audio. That was the main reason I bought this so to me it was not worth the money. Also, my tv is a smart tv already so didn't need this for a streaming player. I bought it just to cast tabs which is still in the works I guess because it was not great.", "verified": true, "helpfulness": "0/0", "author": "David B"}, {"rating": 5.0, "review": "I LOVE this device! Its very easy to send Netflix and YouTube from my phone to the Chromecast. If one person casted a video from their phone, you can pause and stop it from yours! Both YouTube and Netflix stream in a very high quality even though I have a slow internet connection (Comcast). For $35 the value is incredible!", "verified": true, "helpfulness": "0/0", "author": "Lenny"}]