[{"rating": 2.0, "review": "Pros: It's cheap. That's the only reason it gets 2 instead of 1 star.Cons:1. It sucks.2. If you stream youtube from your smartphone (I have the Nexus 4, which is currently the best Google-designed android available), the chromecast glitches out if you try to change what you're watching, or even stop what you're watching. Even after closing youtube, it continues to play on the TV.3. When you stream from your computer (I have a very powerful laptop with a 3rd generation ivy-bridge Core i7 processor), the video and sound are often not in sync, and the video gets choppy, despite the router, laptop, and chromecast being in the same room.4. The chromecast software on google chrome constantly glitches and either fails to stream, or streams but doesn't stop streaming when you tell it to.5. It does not stream in 1080p. Maximum is 720p.6. It ONLY streams from chrome, so if you have videos or music on your computer, it won't stream that.7. It won't stream Pandora from your phone.8. It WILL NOT stream music or video from your phone's memory!!!! It will ONLY stream music you have on the google play cloud. So if you put MP3s on your phone, it won't let you play them. You must first upload all your music to the google play cloud, then stream it to listen to it, which means using up your bandwidth and data.So it doesn't stream pandora from your phone or play music directly off your phone, which severely limits its usefulness if you just want to put on some music while wandering around the house.9. There is a 1-2 second delay between your computer actions and video compared to the stream on the TV. So when you tell it to stream to the tv, you have to turn off your laptop screen to avoid being distracted by two different videos, and your mouse movements and scrolling have a long delay before the TV shows what you did.OVERALL conclusion,I REALLY badly wanted to like this device, but it is very clear that Google rushed it and released an unfinished, unrefined product. Very disappointing.I am going to return it.", "verified": true, "helpfulness": "1/11", "author": "Unavailable"}, {"rating": 5.0, "review": "Amazing product from google and works great on all aspects more than i expected.. Any flaws is totally accepted and i am sure google will definitely shape it the best.. Thanks Amazon for free 3-months netflix subscription", "verified": true, "helpfulness": "1/3", "author": "Podaangu.."}, {"rating": 1.0, "review": "OK, it says it will work with an iDevice of your choice, but really, it's made for Android devices - Googles bread and butter.When trying to activate the product from an iPhone, you'll get a splash screen saying the an iOS app will available soon for Chromecast and then it didn't do any kind of activation.  I won't say the advertising was intentionally deceptive, but its limitations on an iDevice were very muted.Either way, the small number of available channels even for an Android device are small. I'll be sticking with ROKU HD UFN.", "verified": true, "helpfulness": "6/19", "author": "William Hargraves"}, {"rating": 5.0, "review": "I just received my Chromecast and immediately hooked it up.  It was very simple and I am enjoying movies through Netflix.  I can't wait until there are more sources - like Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Margaret Hoffman"}, {"rating": 4.0, "review": "Wow! this HDMI stick is really nice to use for streaming stuff like Netflix and Youtube. If you use Chrome on your Mac or PC, you can do more things than people who use it to streaming stuffs for their smartphones. Google should do some more stuff to it to make it even better such as, the ability to mirror for phone, more apps, and customizable wallpaper of course.", "verified": true, "helpfulness": "0/0", "author": "vanna"}, {"rating": 1.0, "review": "Bought this from Best Buy primarily to use with iPad and iPod, knowing that the app(s) for them are not out yet and that I might have a little wait. However, I thought I'd set it up on my Windows laptop to check it out. Despite the Google site info indicating that Chromecast works as long as you have the Chrome browser installed, it apparently does not work with WinXP, browser or not. First, I get the LARGE note on screen that \"we suggest you not use this device.\" No reason, just don't use this device. Took a little looking on the Google pages to see that they really want Win7 or higher. Google needs to make this clearer in their literature. Same thing with the iPad; Chrome is installed, but Chromecast just won't work with the iPad.I'll update this once the iPad app is out and I can set it up.", "verified": false, "helpfulness": "8/19", "author": "Spoon"}, {"rating": 5.0, "review": "Great things have written about this.I wanted to highlight one point, since Google didn't mention it during launch.Chromecast works with Ubuntu 12.04. You need to have chrome browser 28.x.x or higher and have Chromecast extension installed.It was easy to setup. Both video and sound plays on your TV.", "verified": false, "helpfulness": "2/3", "author": "Zaha"}, {"rating": 5.0, "review": "This was so easy to set up and use, I can't compare it to anything else!  This is a fantastic toy, and a great tool for people doing webinars or business presentations - just plug in, configure network (pretty automatic) and go.For $35, you gotta play with this thing.  You'll love it!", "verified": true, "helpfulness": "1/2", "author": "pl21046"}, {"rating": 4.0, "review": "I have bought several steaming media devices from Netgear Neo200, LG Smart Media Player, and GoogleTV units. This is the best of them all for the price you can't beat it. I have SMART TVs as well with Youtube and Netflix built in, however things just work better with the ChromeCast.I would buy another when it is available. I bought one for my mom and now she is able to display her favorite video content from her computer to the TV easily.Definitely worth the money, wish it was more readily available.", "verified": true, "helpfulness": "0/0", "author": "hluong"}, {"rating": 1.0, "review": "the reset button trips immediately when inserted into the port.. I have to remove it to re-set.Tried 2 different, empty ports on new a Hitachi tv.", "verified": true, "helpfulness": "7/12", "author": "Frank Maassen"}]