[{"rating": 3.0, "review": "Exactly what I wanted:* fast, responsive* Netflix, Amazon Video* Plex works flawlessly between this and my iPad/iPhone devices* remote doesn't require pointing and the keys feel great* worked perfectly from the startUpdated 2015-06-22The Plex client is really out of date.  It can only output stereo sound, which requires transcoding for all video, causing stutter.  The stutter may be due to other issues but it's hard to tell with such an old client that can't even sign into the Plex service.In addition Amazon has rejected the Kodi app (formerly XBMC) so there's no alternative to the Netflix/Amazon Video/etc paid content ecosystems if Kodi and Plex are broken.  That is frustrating and I will not be buying another FireTV and will look to sell my current unit in favor of a Kodi box.", "verified": true, "helpfulness": "1/1", "author": "Teodor Zlatanov \"Теодор Златанов\""}, {"rating": 2.0, "review": "I purchased the Amazon Fire TV device in hopes of drastically upgrading my search method from the Roku 1. Fire TV's remote does not disappoint. Speak into it and seconds later, you get your search results. The only problem is that, if you're using Fire TV to watch Netflix, HuluPlus, or any other non-Amazon app/site, you still have to highlight and choose each individual letter to generate a search title. In other words, at any time you speak into the Fire TV's remote, it takes you back to only Amazon content. Another thing I found totally by accident was that some of Fire TV's movies are in full screen mode. Really, Amazon, is it even necessary to encode any movies in full screen mode anymore?? Two movies that I watched on Fire TV, \"Brokeback Mountain\" and \"The Avengers\" were in full screen. On Roku, even using Amazon's channel, they were in widescreen. I called Fire TV tech support and found out there was no way of changing a movie's view from full screen to widescreen. To complete my discontent with Fire TV is that there isn't Redbox streaming on it. So, given the remote's inability to work across all apps/channels, the fact that not all of Roku's apps are included, and the inconsistency in display and the lack of options for changing that, I'll be taking the device back to the store for a refund. I'll put up with the less expensive Roku for now.", "verified": false, "helpfulness": "1/4", "author": "Kyle O. Nelson \"knmusic\""}, {"rating": 5.0, "review": "I was surprised to see how easy it was to set up this box. I think it took 5 minutes and I am over 65. Searching is so quick with the voice recognition. You can put in the name of the movie or TV show, or ask for all movies with a certain actor in them. Even my husband can use!", "verified": true, "helpfulness": "2/2", "author": "F. Dwyer"}, {"rating": 3.0, "review": "I bought the Fire TV primarily to provide an easy way to stream Amazon Prime free video and buy movies/tv from Amazon. In the past we have done this using a laptop.TL;DR: It works well for finding and playing Amazon content. For Netflix, it is terrible. Not only won't it find the netflix content via voice search, but the content itself stutters when streaming.As an experiment, I watched the first episode of MadMen from Netflix using the Fire TV and then the second episode using the Apple TV, again via Netflix. Apple streamed the episode perfectly. Fire TV stuttered and often degraded down to almost standard definition. Start times were also worse.Maybe this is a netflix implementation issue, but as a user of he box, it hardly matters who is responsible.On the other hand, if you buy a movie from Amazon, it streams brilliantly.We have 75 megabit/second Verizon FIOS.Another consideration if you are considering this purchase and already have an Apple TV, the price differential between Amazon and Apple has largely disappeared. Used to be that Amazon would charge you a buck less for a movie than Apple and a few bucks less to buy a TV series. Now the pricing seems to be the same. So no real reason to switch away from the Apple TV.The free Amazon catalog is really no better than the free Netflix catalog. That is, neither is great if you are over the age of 15.The Apple TV is a superior product  if you are just looking to buy content a la carte and get access to HBO go and Netflix. Yes, I know the Apple TV has less memory and less processing power, but frankly, it streams netflix without glitches, so that is good enough. I don't spend that much time scrolling left and right in the menu screens to care if Amazon can do that a little faster.I have no opinion of the Fire as gaming console. I don't play games and my 11 yr old finds our PS 3 to be completely adequate.The feels like another Amazon 1.0. Good enough for now but expect it to get much better in the future. I really can't recommend this product, especially if you own an iPhone to control your Apple TV. The built in remote for the Apple TV is a bit primitive.", "verified": true, "helpfulness": "0/3", "author": "Andrew Erlichson"}, {"rating": 2.0, "review": "Unfortunately Amazon forgot how to do CS.  The product loses it memory after being turned off. Called in twice to and spoke with Customer Service folks, first time women thought it was user issue, second time had problem they felt problem was beyond them and  turned over to developers, waited 5 days no call.Called third time and CS agent explained someone souhld have called to let me know the 19th was date they will call will call, it is the 19th and no call plan to talk with management on this issue. Amazing when this folks released kindle they were top of any issues. Now they have gone stone stupid.", "verified": true, "helpfulness": "1/4", "author": "Bob McArthur"}, {"rating": 5.0, "review": "Great streaming device. Also the gaming ability of the system is a fun break from just movie watching. Love it.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my new Amazon Fire  tv...it was easy to connect.  I can listen to music...watch movies...play games...that's all I have discovered so far.  I am pleased with my purchase. Amazon fan for life!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Let me count the ways....er,not really.  Fire TV is easy to use and not at all difficult to set up.  I love the search by voice, but can't seem to get the hang of slinging something from my computer.  I'll work on it though.  Also high on my \"like\" list is the remote control.  Aside from having that apple-style navigation ring, the remote is simple (right,left,up,down) and it's not crammed with button like the VCR or Satellite remote.  I would have liked the addition of a volume button, but having the TV remote close by solves that \"technical hurdle\".  Besides, you need the old remote nearby to switch from HDMI1 to HDMI2 to start the Fire TV.  The major attribute of the remote is its size.  Small enough not to be just another remote and easy to learn the button location to operate it without looking down to find your button.So, if you crave having a good experience with new technology  I give it a solid five stars.", "verified": true, "helpfulness": "2/2", "author": "John Murrow"}, {"rating": 5.0, "review": "Now I forget the Apple TV , easy to use, with game! My son love this a lot , up to now no any complain .", "verified": true, "helpfulness": "2/2", "author": "ST"}, {"rating": 4.0, "review": "Let me start off by saying that I'm no techie... I have 2 Roku boxes that I have never been able to make work satisfactorily so I was looking for something that would be a no-brainer as far as set up and then would do what we wanted...I purchased the Fire TV for my disabled husband, thinking it would be something that would make life (and entertainment) a little easier and broader for him. After installing it and giving it a try, here is my initial review.It comes right out of the perfectly sized, very small box with everything that SHOULD have been in there, actually there.It was simple enough to plug in an HDMI cable and, off it went.It detected our WIFI network easily and I was able to figure out the simple remote functions to enter our password.But then a software update was required. And it took about 15 minutes. And then the system locked up and ultimately required me to shut down the TV and unplug the Fire TV box to reset everything. Then, after playing the welcome video a 2nd time, it did finally take us to Fire TV's UI.Maybe I'm doing something wrong with a setting and just haven't figured out what/how it needs to be changed but I really don't like that, as an Amazon Prime member, I have to navigate past purchase buttons for various shows/movies to get to the \"Watch Other Ways\" free viewing that we're entitled to. I would be much happier (and might have given that last star) if it defaulted to the Free viewing for Prime accounts rather than making me work for it. I'm assuming (and I haven't tested this, thankfully) that if hubby didn't remember to move over several icons that the system would be happy to take my money for an episode of a series or a movie viewing that we should pay nothing for. But, as I said, I can't confirm that it would be the case.For us, the size of the typeface on the icons (purchasing the episodes or watching other ways) is too small. The TV is probably about 15 feet away from where hubby watches and we both had trouble reading what each icon said. I guess that, with use, you would get used to both the order of the icons and what each says since they appear to stay the same but it would be nice to be able to make the information zoom so it was easier to read.I like the shape of the remote and the finish on it -- the shape fits nicely into my hand and the material is fairly non-slip.The voice search function works very well for us. Since we don't subscribe to Netflix anymore, I don't know if the voice searching will also seek out content there or not but it's not really an issue that's high on our list like it appears to be for many other reviewers.We're going to give the unit a good try and then I'll update my review if anything changes my opinion.", "verified": true, "helpfulness": "2/2", "author": "icebean"}]