[{"rating": 2.0, "review": "Not a fan. The audio doesn't sync well with video. Quality isn't nearly as good as what we get when we use Airplay on our AppleTV (even on the exact same video in the same browser on the same computer).", "verified": true, "helpfulness": "0/1", "author": "AnonCanadian"}, {"rating": 5.0, "review": "This is a simple device to set up and use.  The ability to find great content on phone, tablet, or laptop and send it to the big screen is excellent.  Also, much faster to start watching Netflix than the smart DVD player with its Netflix app.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "extremely well priced even taking EU VAT into account, plus it work like a charm in Ireland got 3 of them in total...", "verified": true, "helpfulness": "0/0", "author": "Darren Tobin"}, {"rating": 4.0, "review": "It works as it should. Install was easy. Only problem was when ATT replaced my router and I had to \"Passcode\" two cell phones, two computers, a netbook, a tablet, two kindles the AppleTV, and the chromecast device. Only problem now is learning how to use the Chromecast effectively.", "verified": true, "helpfulness": "0/0", "author": "Andris E. Revalds"}, {"rating": 5.0, "review": "Great product, Google does it again!Very easy to setup and it world flawlessly with YouTube.Roll on more compatible apps!", "verified": true, "helpfulness": "0/0", "author": "Chris Gawley"}, {"rating": 5.0, "review": "I am impressed by the performance over my wifi network.  I have tried the chromecast browser extension on both my chromebook and macbook.  Some services like youtube, hulu plus and netflix offer direct support that is high quality.  I have tried youtube and could see the difference. (I don't have netflix or hulu plus at this time.)  I have also tried casting a full screen browser window of an Amazon Prime video. Amazon Prime videos streaming doesn't directly support the chromecast (yet), but the chromecast browser plugin works well.  The color is a bit different and there is some latency between my computer's screen and the chromecast.  But the quality is still decent and I have seen no stuttering.  If and when amazon prime offers native support for the chromecast, I am sure it will be much better.  One limitation to be aware of is that audio from video sources that require plugins like silverlight does not come through.  So far this is not a big deal for me.", "verified": true, "helpfulness": "0/0", "author": "Darcy K. Parker"}, {"rating": 4.0, "review": "Will give it 5 stars when they release more apps, as it stands it's a very good streaming device for YouTube, and music for a great price.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 4.0, "review": "Still missing other apps to cast. It doeas what it says, but could be better. Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Roberto"}, {"rating": 5.0, "review": "Excellent just excellent it could have better features but in the end and most of the time is the only thing you are going need to stream your favorites shows", "verified": true, "helpfulness": "0/0", "author": "Luis Munarriz"}, {"rating": 1.0, "review": "good idea but no good with restrictions on using appWhat is point when u cannt play or view anything from computer  unless it is viewed throu chrome", "verified": true, "helpfulness": "0/0", "author": "nanda"}]