[{"rating": 5.0, "review": "Excelent, just what I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Enrique E."}, {"rating": 5.0, "review": "Absolutely love my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Strebler"}, {"rating": 5.0, "review": "Chromecast rocks. Easy to use and fast", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 4.0, "review": "Works great for the apps that are compatible but wish it was compatible with more of my apps.", "verified": true, "helpfulness": "0/0", "author": "K Wood"}, {"rating": 5.0, "review": "Love it...! Easy to install and easy to use!", "verified": true, "helpfulness": "0/0", "author": "jkim023"}, {"rating": 1.0, "review": "image quality was extremely poor...had to buy and sign up for a number of apps to get netflicks etc...i pulled it out...", "verified": true, "helpfulness": "0/0", "author": "Joseph Giampetroni"}, {"rating": 3.0, "review": "works OK ,but have had some trouble with pairing and streaming at times. it will not pair with my nook and will stop working and I have to reboot everything.", "verified": false, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 2.0, "review": "I don't know what happened. Some how i could not able to cast the videos from my chrome browser of my PC. somehow, the google chrome got crashed after installed this chromecast. i am not able to use any of these stuff", "verified": true, "helpfulness": "0/0", "author": "Nagendra Kumar Kolisetty"}, {"rating": 5.0, "review": "Love it! Amazing how it converts a regular TV in a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Chromcast does not work very well with Chrome browser. Isnt that a bummer? When you cast your browser, there is a significant delay, which is very annoying. I have gone and tried to change the settings and adjust the speeds but this only helped a little. I prefer to connect the old way (with cables between the computer and the TV) when casting the Chrome browser. I would give it a 1 star, but it works great with Netflix and YouTube so far.", "verified": true, "helpfulness": "0/0", "author": "Kipchirchir Bitok"}]