[{"rating": 5.0, "review": "I wasn't sure about this but I ordered it anyway (for $30) and was satisfied enough to buy another.  Sure it has no remote and it's not as cool as a roku (no amazon prime) but what do you expect for the price?  I haven't had much luck casting from my laptop but it could be the laptop's fault.  A great, cheap, help for those unwilling to keep cable.", "verified": true, "helpfulness": "0/0", "author": "Mackhouse"}, {"rating": 4.0, "review": "Great device, do everything that offer, the only inconvenient what I found is it can not play MKV files and need some external server device to do transcoding", "verified": true, "helpfulness": "0/0", "author": "Gustavo"}, {"rating": 5.0, "review": "System Gave as a gift to my GS. He likes very much and says it works well", "verified": true, "helpfulness": "0/0", "author": "Mickey"}, {"rating": 5.0, "review": "Yes, there are hundreds of different ways to achieve what his little device does. However, none that I can afford or that takes up this little space. Easy to set up and makes my binge watching of all my favorite Netflix shows as easy as hitting play.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works, I love it.  I hardly watch TV, but when I do, I know the Chromecast won't let me down!", "verified": true, "helpfulness": "0/0", "author": "Jared"}, {"rating": 1.0, "review": "Tried using it with hbogo.  Terrible connectivity.  Trying to use apps and a dedicated network just doesnt work very well.  Not sure what to try next.", "verified": false, "helpfulness": "0/1", "author": "David Arth"}, {"rating": 1.0, "review": "Don't waste your money!  Not many channels and very limited use. Must have somewhere with wifi. Cannot just push from iPad. Save your money and get an AppleTV!", "verified": true, "helpfulness": "0/2", "author": "Iowa Commuter"}, {"rating": 2.0, "review": "I have had this device for nearly a year and only successfully streamed through it once in my own home. Trying to use it while traveling has been a bust with constant connectivity problems and messages to consult my router settings or contact or my internet provider. By the same token, I have begun taking my Roku with me and am yet to encounter a problem. It is simply a more user friendly and dependable device. Would like to compare to the Amazon Fire TV device next. Save your money on the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Ed Thompson \"thompsef\""}, {"rating": 2.0, "review": "Don't be fooled by this product only certain apps can be streamed to your TV. It is not user friendly in my opinion and it was a pain in my keester to set-up.", "verified": true, "helpfulness": "1/1", "author": "Ryan Fitzgerald"}, {"rating": 4.0, "review": "hgreat", "verified": true, "helpfulness": "0/0", "author": "Gerald S."}]