[{"rating": 4.0, "review": "It works perfect and as advertised. After installing extension in my Chrome browser and the app on my Galaxy S4 phone & 10.1 Tablet, I could stream Netflix, Pandora, YouTube and Chromecast from the PC's Chrome browser.BUT... to what ends??All our TV's, Blu-Ray players or Game consoles have Netflix, Pandora, Hulu, etc... So I really don't need to do it from the phone. Google REALLY needs to get more apps and \"castable\" content. Being able to Chromecast a page from a web browser is good and was one of may main reasons for ordering (besides just to play with a new toy), but when watching video from a website, unless its playing in an embedded media player, you wont get it to the TV. When the videos open the player in a separate window, you're toast. Google needs to get Chromecast working with all these web media players - then you'll have something.But it was very easy to setup - it works - its cool - its only $35. I'm glad I have it and will see what additional content continues to become available that maybe I don't have on my Smart TV's.", "verified": true, "helpfulness": "0/0", "author": "alandw"}, {"rating": 1.0, "review": "I was disappointed with this product. I have high speed internet and wifi but chromecast was slow and hardly played.", "verified": true, "helpfulness": "0/0", "author": "J. Taylor"}, {"rating": 5.0, "review": "Don't have satellite or cable so only movies or shows I watch are via Netflix or  YouTube. This is great, it's easy to install and to use", "verified": true, "helpfulness": "0/0", "author": "MagsSDN"}, {"rating": 5.0, "review": "The setup was fast and easy.  YouTube content was easy to render and none of my kids had any problem using their smartphone to control things.", "verified": true, "helpfulness": "0/0", "author": "patgries"}, {"rating": 5.0, "review": "I've had this now for about 1-2 weeks and I must say it is a bang for  your buck, i can use my phone to cast any netflix/hbo go content i want, i also have movies on my laptop and all i do is open them in google chrome and cast google chrome to my chromecast, instant movie sharing, no lag whatsoever.", "verified": true, "helpfulness": "0/0", "author": "Bmcsky"}, {"rating": 3.0, "review": "I have a regular LED TV and I didn’t want to spend a lot to get a streaming player so I purchase this item instead. Great purchase for the price, and I can stream Netflix, Youtube and search the web with easy. It was a bit confusing at first trying to use the Chrome OS and has a lot of room from improvement, but great deal for a streaming device that only cost $35.", "verified": true, "helpfulness": "0/0", "author": "Theodore Bagwell"}, {"rating": 5.0, "review": "To point out, I myself didn't need this, I use my Xbox 360 to stream Netflix and stuff along with my PC and other devices that I own, and I'm sure other stuff I watch wouldn't stream right for it. This was a Christmas gift for my mother, who likes watching Netflix and listening to Pandora but would rather watch movies on her TV than her PC. This was perfect for her; she wanted something simple to use, saves space and doesn't require much technical know-how to setup, and it's people like this who would probably benefit most from this. The Chromecast is about the size of a USB flash drive and is powered by connecting the included micro-USB connecter that can be plugged directly into the TV's USB port or into an outlet with the included adapter (I've heard it can be powered through some HDMI ports but it wouldn't for mine so I can't say as far as that goes). Note that it doesn't come with a remote, but you can use a smartphone, tablet or computer to control it (Android, Apple, Windows, etc.) and if you're using a computer to control it, you'll need the Chrome web browser to do so. Set-up is simple and takes only a few minutes.Once set-up, any of the supported apps can be streamed to the device in seconds, we've so far only used Netflix, Youtube and Pandora but they've all worked exactly as advertised. One cool perk with this is no matter what you're streaming from; phone, tablet or pc, you're not restricted to staying on that tab to continue streaming, you could continue to use the device while it runs (my mother loves to play time management games while she watches stuff on Netflix). The only issue we've encountered while using this is when streaming from her pc, sometimes it won't connect with the Chromecast immediately. We'd end up restarting the computer to get it to connect, we're not 100% sure why this is but we guess it's either because of Windows 8 or it's the computer itself (streaming from my phone and tablet works fine) but it's something to be aware of.We've been using it since Christmas and so far it's lived up to our expectations.  It does exactly what my mother wants it for, there's no excess menus or anything to go through to get what she wants, no bulky wires or gear around her room nor having to directly connect her pc to the TV, and she can use it without asking me for help ( she actually to it over to an auntie's house and used it there, didn't even need to ask me how to operate it.) While anyone who's interested in using it or would just like to have it could find use for it ( someone like me wouldn't need it, but wouldn't mind using it.), I see this more for anyone looking for a small, inexpensive device that can stream from some of their favorite sites like Netflix, Hulu Plus, Youtube and the like, but note that you may have a harder time streaming from sites that aren't initially supported by Google ( no Amazon Prime Video yet, and if you're like me and stream anime from sites like Dubhappy, you may be out of luck...), though you might be able to find a quick fix for that and I just haven't found it yet, or it does and you have to do something specific for it, I couldn't say.But I digress, if you want something simple to set-up and use, that streams your favorite services, and is cheap and space friendly, go with Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "JD Ford"}, {"rating": 5.0, "review": "It was a new item for me and therefore it took me some time to install it. I am having some buffering problem with this.", "verified": true, "helpfulness": "0/0", "author": "Anika Export"}, {"rating": 5.0, "review": "Have had no problems and it's great for casting stuff off the computer and onto your TV.  Also great at keeping the NSA apprised of what you are watching.  Win win, no?", "verified": true, "helpfulness": "0/0", "author": "Lynchphile \"LYNCHPHILE\""}, {"rating": 5.0, "review": "chromecast was a bit of a pain to set up, but once we got it figured out its been easy to use and very handy. we can play youtube videos on our big screen tv from either our smart phones or from our computer. this device works very well.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}]