[{"rating": 5.0, "review": "Talk about convenience!I LOVE this device.When our PS3 died, my kids were more upset about losing access to Netflix on the TV.Installed the Chromecast, Showed my 5 year-old how to use it once and She hasn't had any trouble since.And they keep releasing more and more apps for it.I can't wait to see what comes out next.", "verified": true, "helpfulness": "0/0", "author": "Brett Fieber"}, {"rating": 5.0, "review": "works but messes up a lot", "verified": true, "helpfulness": "0/0", "author": "jamal farhan"}, {"rating": 4.0, "review": "I got mine as a gift last year and didn't really use it much at first, but then more apps enabled casting, higher quality content became more common (turn it on when YouTube is live streaming the Coachella music festival) and it soon became very handy to have around.  Sure it doesn't add anything new to your connected tv and/or blu-ray player, but it's so much easier to use.  YouTube, WatchESPN, and Vudu are probably the three I use most.  Now I've bought one as a gift for someone else.", "verified": false, "helpfulness": "1/1", "author": "Lori"}, {"rating": 1.0, "review": "This was an awesome purchase until it stopped working for no apparent reason. I have only had it for a few months and used it barely once a week. I've tried it on several different tv's and it just won't work anymore. I will not be purchasing a new one. I hear the amazon fire stick is easier to use and more reliable.", "verified": true, "helpfulness": "0/1", "author": "Haley"}, {"rating": 5.0, "review": "One of the new electronic, communications toys.  Works well, love to see my laptop screen on the TV", "verified": true, "helpfulness": "0/1", "author": "Herb J \"Purchaser\""}, {"rating": 2.0, "review": "Because of the write up drying this works with android tablets and phones I bought it, tried to hook it up only to find out  while Youtube(and I suppose other video sites) work, it can't stream from my chrome browser. Maybe  certain NEWER android devices work, but my Galaxy Nexus nor my Asus tablet work with this.  I wanted to stream from Chrome but can't get the extension on them.  Big letdown.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "better be sure your wifi signal is remarkably strong.", "verified": true, "helpfulness": "0/0", "author": "andree"}, {"rating": 1.0, "review": "I wish I could give this a better review!!!!!!! After hearing all the great things about this product, I went out on Black Friday to purchase it and bring it home to find it won't connect with my home wifi. Why won't it connect you might ask? Because this thing needs to be within a certain distance of a router with zero interference. 10-15 feet precisely. My set up for my entertainment is on the floor below the router, but directly below it. It wouldn't connect, try after try and after discovering that you have to be borderline next to the router for this damn thing to work! I am extremely upset that this product doesn't have the capability to work throughout my house, you know like my phone and google tablet do, but I won't buy this product again until they make better! by far the biggest letdown by a product ever!", "verified": false, "helpfulness": "3/4", "author": "Stephen"}, {"rating": 4.0, "review": "Works great.  Automatically switches TV to chrome input. Audio works seemlessly.", "verified": true, "helpfulness": "0/0", "author": "Ray P. Smith"}, {"rating": 5.0, "review": "Simplest and best TV streaming experience there is.", "verified": true, "helpfulness": "0/0", "author": "Hunter J. Freyer"}]