[{"rating": 5.0, "review": "Game changer, fastest instant video player I have seen or used. By the time you click on something to watch it is already playing.", "verified": true, "helpfulness": "2/4", "author": "Nicole Jarrett"}, {"rating": 5.0, "review": "I Just Love i! There's no other thing like the AmazonFire TV! I sure know you love it too ;)", "verified": false, "helpfulness": "2/4", "author": "Kiel Henry"}, {"rating": 5.0, "review": "Definitely has a great wifi connection and easy to set up  it seems that there are more charges than I expected when trying to view shows.  Even with prime membership, so many extra charges.  at this point not sure if it is better than a smart although with the Fire it can be used with any TV as long as it is HD.  It is much cheaper than buying a smart tv", "verified": true, "helpfulness": "3/4", "author": "DrP"}, {"rating": 5.0, "review": "I have a Roku already and have been pleased with it.But I bought the Fire TV because of YouTube. So I can switch between the two devices and my viewing enjoyment  is doubled.Extremely easy to set up .Intuitive,actually.Glad I have it,and now I can watch all the MST3k movies I want,on YouTube.Good product.I am waiting on the gaming remote until the next version is released.Thanks,amazon!", "verified": true, "helpfulness": "3/3", "author": "ellafan"}, {"rating": 3.0, "review": "I still prefer my Apple TV because of its more extensive content and seamless ability to stream music from iTunes. However, if you're not an Apple consumer and don't care about non-Prime content you should seriously consider Amazon Fire TV. The Amazon Fire is fast and its voice-recognition feature is excellent.", "verified": true, "helpfulness": "4/8", "author": "JD \"zippity do dah\""}, {"rating": 5.0, "review": "Better than anything else I've tried. Kids love apps. Amazon Instant video really delivers. Feels solid. Voice recognition actually works.", "verified": true, "helpfulness": "3/4", "author": "Eugene Evans"}, {"rating": 5.0, "review": "Very glad I waited to purchase a streaming player. Works as advertised! Easy to get started, quick downloads, easy to navigate. Voice remote a definite plus. Great package in a small box.", "verified": true, "helpfulness": "4/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good. I love how easy it is to use. The ability to talk and say what I want to see is of great delight to me. It sure does beat looking from place to place to find what I want", "verified": true, "helpfulness": "3/3", "author": "sheila smith"}, {"rating": 3.0, "review": "Before I purchased this I had a Roku 2 XS and enjoyed it very much. After a few years it started having issues playing some channels (even after factory reset).I bought the Fire in hopes of finding something faster and better. Well I got half of that. The Fire is amazingly fast, has some nifty features and plays games. However, it was missing several channels that I watched on the Roku with no apparent way to add them.I also found the interface to be slightly cumbersome for TV. It felt more like an Android app that I should be scrolling with my hand on a touch device.Ultimately the extra channels on the Roku are more important to me than the extra speed. So I am returning this in favor of a Roku 3.", "verified": true, "helpfulness": "3/4", "author": "Averum"}, {"rating": 5.0, "review": "I am completely satisfied with this purchase, the device runs fast and efficient and is a great media player. I love that it comes pre-configured and is ready to go once you hook up HDMI and power. It does not yet support HBO GO, but taking them at their word I will let them keep the 5 star rating. While I have a Chromecast, I feel this device works better and functions like a media player should. Plus I can make use of all the Amazon Instant Video purchases I have already made.", "verified": true, "helpfulness": "3/3", "author": "Chris"}]