[{"rating": 4.0, "review": "I was looking for a device to watch videos on my TV, and when I got an offer as an Amazon Prime member, that made my decision for me. It was easy to install and works perfectly. When I use it, I pull the HDMI plug out of my cable (DVR) box, pop it in to the Fire TV box and I'm all set. If you want to see if a film is free for Prime members, just click on \"other ways to watch\".  Very happy with my purchase so far. Anxious to try viewing photos, etc on the TV screen.", "verified": true, "helpfulness": "1/1", "author": "C. Brown \"cndrn\""}, {"rating": 1.0, "review": "I can not access any content due to geographical restrictions. It's been a total disappointment. fraud to me. And the prime billing was applied before the free month.", "verified": true, "helpfulness": "3/16", "author": "Amaury Rodriguez"}, {"rating": 2.0, "review": "Is very cool, BUT i live in South America and a LOT OF APPS doesn't work here, I just can play Netflix and VEVO. Thats too bad...", "verified": true, "helpfulness": "0/11", "author": "Hueveling \"LEGGELING\""}, {"rating": 5.0, "review": "So much better than our old Roku! Love the voice search capability and everything else it offers. Streams very well, even with our slow, crummy connection. MUCH better than Roku ever did. Good buy and we don't regret the purchase.", "verified": true, "helpfulness": "0/0", "author": "I Love A Bargain!"}, {"rating": 4.0, "review": "I love my Fire TV, I can watch movies any time I want.  It's simple and great!", "verified": true, "helpfulness": "0/3", "author": "Raylene H."}, {"rating": 4.0, "review": "Looks good so far, but where is the OFF button?", "verified": true, "helpfulness": "1/6", "author": "gkj"}, {"rating": 3.0, "review": "I bought this item about a month ago when I decided to discontinue cable. I did some research comparing Fire TV to Roku 3 and Apple TV.  I was impressed by the fast processor and increased storage, but was aware that the number of apps is fewer than competitors. I decided to go ahead and get the Fire TV.The layout is very heavy on Amazon content, which maybe makes sense since it's an Amazon product, but in my opinion it's too heavy on Amazon content.  Maybe it's on purpose to distract from the fact that the app selection is poor.  My kids have older Roku units in their bedrooms and they get far more app selection than the Fire TV.  There is no TED talk app, which is very disappointing.  The selection of news apps is not good.Of the apps that are available, many of them are not user friendly.  The Netflix app is not even the most up version. You can't search by genre, which I find to be very limiting.  The same is true for Amazon Prime content. Hulu plus app works ok, but the search feature leaves something to be desired.Another big disappointment is the fact you can't even play your Amazon music on Amazon Fire TV! The pictures of apps lead one to think there is an Amazon Music app, but there is not.Fire TV is not ready for prime time, and therefore I feel it is overpriced at $99. Hopefully apps will be made more user friendly, and the app selection will be expanded greatly.", "verified": true, "helpfulness": "9/12", "author": "Amazon Customer \"Mama\""}, {"rating": 5.0, "review": "Better than I expected and the voice search really works !!!", "verified": true, "helpfulness": "1/2", "author": "N1r@K \"Karin L M G\""}, {"rating": 2.0, "review": "No TV included. Also, no Fire. Very misleading. Two Thumbs Down.", "verified": false, "helpfulness": "3/41", "author": "A concerned citizen."}, {"rating": 5.0, "review": "After trying 4 different streamers, this one is marvelous. Fast, no buffing at all, instant movie display on my tv, easy to set it up. In other words, I stopped watching regular tv with my Amazon Fire TV I got everything I need. /Thank you guys for a wonderful job.", "verified": true, "helpfulness": "1/2", "author": "Ralph Molina"}]