[{"rating": 5.0, "review": "It is everything that I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "Ronald Hunter"}, {"rating": 4.0, "review": "Love IT!  I just wish there was more apps for web browsing.", "verified": true, "helpfulness": "0/0", "author": "Milagros"}, {"rating": 5.0, "review": "Love love love this!!! My daughter and I both enjoy Amazon Fire TV. I am a Prime member, so I do recommend that you sign up for Prime membership to get the full enjoyment of this.", "verified": true, "helpfulness": "0/0", "author": "TNShop"}, {"rating": 5.0, "review": "Best streaming system yet!", "verified": true, "helpfulness": "0/0", "author": "Linda house"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "It is about what I expected, the streaming quality is good.Packaging and looks of device/remote were great.Have had issues though; out of the box Netflix would not launch, had to remove and re-add/update.The remote has a cool voice feature that only works with Amazon Prime media. You can't use it to search for Netflix shows/movies. This leaves a awkward search experience, plus getting to Netflix from the home screen could be a bit easier. Simular frustration with YouTube application, has not worked after a couple updates.Looks like Amazon did great with their own hardware and OS but they need to have higher level of quality from third party applications.", "verified": true, "helpfulness": "0/0", "author": "Christopher W. Johnson"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "This is so cool!  No longer having to watch the same old re-played movies and TV re-runs - what a great thing.  Tons and tons of alternative programming.  We love it.", "verified": true, "helpfulness": "0/0", "author": "JML"}, {"rating": 5.0, "review": "Love it!  Can now get rid of the overpriced junk that is the selection of the cable company!", "verified": true, "helpfulness": "0/0", "author": "Nettie Morano"}, {"rating": 5.0, "review": "I love the Amazon Fire, I use it all the time. Can't wait for more shows on Fire.", "verified": true, "helpfulness": "0/0", "author": "Deedee"}]