[{"rating": 5.0, "review": "Very Good!!", "verified": true, "helpfulness": "0/0", "author": "Helder Vasconcelos"}, {"rating": 4.0, "review": "Needs more apps to work with... But overall very good.", "verified": true, "helpfulness": "0/0", "author": "unik15"}, {"rating": 5.0, "review": "Got it all plugged in and we started watching movies and things off the internet! Its fun and easy to use, if you install some of the free apps.", "verified": false, "helpfulness": "0/0", "author": "Phenerot"}, {"rating": 5.0, "review": "I bought it as an apple tv alternative since I own a FreeNAS server and just wanted to use for the Plex media server to watch movies and tv shows. I launch the Plex media server app through the iPhone 4S and stream to chromecast whala !!! I also carry the chromecast with me when we go visit friends or family members to keep the kids entertained, streaming videos from my FreeNAS server at my house. The Plex app streams directly from the server to the chromecast, not from server to iPhone, then from iPhone to chromecast.", "verified": true, "helpfulness": "0/0", "author": "tono-sty"}, {"rating": 3.0, "review": "I want to love this product, I really do. And I think I would if I wasn't trying to use it in my apartment on my university's internet - it just doesn't work since you have to log in to the internet with your campus key and password. I think if I was using this at home, I would absolutely love it. Just be wary if you're getting it for a dorm or hotel or anywhere that you don't control the wi-fi yourself!", "verified": true, "helpfulness": "0/0", "author": "Spencer Erbe"}, {"rating": 2.0, "review": "DOES NOT WORK WITH APPLE AIRPORT", "verified": false, "helpfulness": "0/2", "author": "TIM DULAINE"}, {"rating": 4.0, "review": "Use it all the time. Works great", "verified": true, "helpfulness": "0/0", "author": "Staci Quincey"}, {"rating": 5.0, "review": "Love the chromecast! Super easy setup for me (I am not tech savvy) and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am not sure how many chromecasts I have bought; it is my favorite gift for my friends and relatives.The more I used it, the more I believe in it that it will take over the TVs all over the globe.I am watching more progs and movies, and many more stuff coming to it via other apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was the best purchase. We cancelled our cable and are streaming netflix, huluplus, and YouTube through our tablets, iPads, and phones. I just wish it had more apps that worked with it but we are very pleased with chromecast so far.", "verified": true, "helpfulness": "0/0", "author": "sparkygirl87"}]