[{"rating": 1.0, "review": "This thing sucks man, don't waste your money. Maybe I have a faulty model or something but it just doesn't work right. 9 times out of 10 when I try and cast the video to the Chromecast it will pop up on the TV for a second and reset itself. It's extremely frustrating. I did a factory reset on the unit a few times but it still acts up. They need to fix some bugs with this thing big time", "verified": true, "helpfulness": "39/50", "author": "Taylor"}, {"rating": 3.0, "review": "Convenient be able to send your videos from your android to your TV. Don't expect HD quality - except for the screen saver that displays before your video is loaded. Needs more development but a good start.", "verified": true, "helpfulness": "0/0", "author": "Visionary800"}, {"rating": 4.0, "review": "For $35, it's the best thing in wireless HD streaming since, erm .. MK809 II PCTV dongle. The convenience of wireless streaming coupled with sturdiness of Google's software makes is all the more enjoyable. The minimalistic design of the box and the cheap device itself, is a treat to look at. Feels quite premium!BUT what makes it less than stellar are the (IMO unnecessary business/product) limitations imposed by Google on how and what could be streamed. I could not play my local AVI files through the Chrome browser (with Chromecast extension). MKV files played video without the audio. I'm sure there are other issues as well.Definitely a deal breaker for those looking to replace their existing dongles or WDTV's for local video playback. However, since this little monster packs lot of power in terms of its Hardware, I'm hopeful of Google will sooner or later remove these irritants to make Chromecast what it really should be - a truly inexpensive, truly multimedia, portable device.", "verified": true, "helpfulness": "0/0", "author": "Rahul Joshi \"a.k.a Raw\""}, {"rating": 5.0, "review": "I have a Chromecast for every TV in my house. It will be the Ultimate device once Amazon supports it.", "verified": true, "helpfulness": "0/0", "author": "sammyboy405"}, {"rating": 5.0, "review": "I bought this device for less than $40 bucks.  It is completely worth it.  It plugs into an HDMI port on more modern televisions.  It does not work on old boob tubes as far as I know.  I used it Saturday night and we played music from youtube all night directly on my tv.  No dragging our WII from my room or the PS3 from the game room.  It is also smooth uninterrupted play.  I did not see one time our song freezing so it could buffer.  I would definitely recommend this product to friends!  I am also definitely going to buy it as a Christmas gift for people this Christmas!  I have tried Netflix, no problems, and I have not tried Hulu Plus yet, which was actually the main reason I bought it.  I hate watching my shows on my laptop.  I like being cozy on my couch.  The controller (my phone) was easy to install and easy to use.  A+++++", "verified": true, "helpfulness": "0/0", "author": "Christina Chornomud"}, {"rating": 5.0, "review": "We take turns picking music/random videos on youtube from the couch. I'm excited for google to officially release the api so more apps to come out.", "verified": true, "helpfulness": "0/0", "author": "Duffman"}, {"rating": 5.0, "review": "This device easy to set up and easy to use. My only drawback is use of an app on a phone for things like Netflix. Once one's phone goes to the lock screen after starting a movie or during viewing, he or she has to go all the way back in to the app just to pause the movie. For this reason I sometimes find it's just easier to use an app built in the TV, because it's faster to just grab the remote and press pause. Not a deal breaker for me though. I just hope in the future more apps support the use of this device like Amazon Prime. It's also great for streaming youtube videos to my TV. That's where it gets the most use from me.", "verified": true, "helpfulness": "0/0", "author": "C. Murua \"Muru\""}, {"rating": 4.0, "review": "It meets expectations.  Google should come up with some other devivec in near by future... ...thank you ! Ok ....", "verified": true, "helpfulness": "0/0", "author": "masterkepu"}, {"rating": 5.0, "review": "I was afraid our Internet connection might be too slow because we have trouble loading  YouTube videos on the PC, but this works flawlessly with Netflix and our wifi.  Best electronic device ever for such a low price.  Easy to install and access via iPad, iPhone or PC.", "verified": true, "helpfulness": "0/0", "author": "Russell Schussler"}, {"rating": 5.0, "review": "Great gadget to have. But limited apps available. YouTube and Netflix only. Would have been great if it streams most if not all the tablets functions. Can't stream own photos and videos that sucks. Lose connection with TV often. Has to restart all the time.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]