[{"rating": 5.0, "review": "I love my Chromecast, I stream from it constantly from my phone and sometimes from my work laptop when I want to view on a larger screen. I've recommended it to many people. I also love how small and easy to set up it is.", "verified": true, "helpfulness": "0/0", "author": "A. Kugali"}, {"rating": 5.0, "review": "Happy I purchased this item.  Makes it easy to watch movies, tv shows and more.  Easy setup and easy to use. High definition movies are great!!!", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Alfonso"}, {"rating": 1.0, "review": "Let me first say that I love my Roku 3 and would highly recommend it ! Now for this Chromecast - I specifically got this for a our smaller flat panel (32\") tv so we could \"cast\" using my little Samsung Chromebook. Chromecast from a Chromebook - should have no problem there, right, WRONG !  I can only cast Youtube, everything else is very choppy, starts and stops, disconnects. Initially I could also cast Netflix, now that too is gone. Here is what is so ironic, I can cast from my old Gateway computer, anything - anytime  no matter where the \"cast\" icon is, either the on screen (as in Youtube) or the tab cast icon (in the upper right corner) again no problem but from a CHROMEbook to a CHROMEcast forget it.  And as far as the customer support goes, forget that also ! They don't seem to understand that all my other devices work fine AND I can cast from my old computer. Like I first said pay a little more and get the Roku !!", "verified": true, "helpfulness": "0/0", "author": "Mark D Twain \"boating nutz\""}, {"rating": 5.0, "review": "One of my friends was going on and on about his Chromecast. Everytime he pointed out one of the features my response was \"Yeah, my Roku does that.\"A few weeks later I was having a get together at my place, and the only real area of the house that has a good audio setup (for music) is the surround sound in the living room. Roku doesn't (or rather, didn't at the time) have a spotify channel. I figured it was time to check out Chromecast.This worked amazingly well for running spotify on the TV, but I admittedly haven't really used it for anything else....but for the price I paid it was still a bargain if I only ever use it for that one function.", "verified": true, "helpfulness": "0/1", "author": "Joshtalgia"}, {"rating": 5.0, "review": "OnDemand is cool & DVR is awesome.  Chromecast is THE BEST!!YouTube, Pandora, HBO Go...this list goes on.And, it's cheap.If you don't own one of these, you probably still watch VHS tapes.", "verified": true, "helpfulness": "0/0", "author": "Adrian Mendoza"}, {"rating": 2.0, "review": "Low framerate and very laggy when casting to the chromecast.Since it doesn't support very much internally, this really has very little use.Our Roku 3 is 3x the cost and 10x the performance.If you have a very limited budget, this might be okay, but you'd probably be better off just watching on your computer.", "verified": true, "helpfulness": "0/0", "author": "Josh-D. S. Davis \"xaminmo\""}, {"rating": 3.0, "review": "I opened the box and installed the Chromecast unit.  I got the software connection but was unable to 'cast' anything to my TV.  While I'm sure there is nothing wrong with the unit, my expectations were that it was mostly plug and play.  My real complaint would be with the directions -- there's very little!", "verified": true, "helpfulness": "1/1", "author": "G. Targee"}, {"rating": 5.0, "review": "stream netflix from your phone to the TV, works great, also streams you tube, doesn't do amazon prime except via tab casting", "verified": false, "helpfulness": "0/0", "author": "Cara A. Oliver"}, {"rating": 5.0, "review": "Wow! This is a must in every home! Simple to set up, priced right. Watch all your Netflix and YouTube and more on your big screen TV.", "verified": true, "helpfulness": "0/0", "author": "Kerrplunk1"}, {"rating": 3.0, "review": "It does what it's supposed to do with some limitations, i.e. Google Play will not play \"side loaded\" music to Chromecast.  That's OK with me as I don't know why I need to play music on my TV anyway.", "verified": true, "helpfulness": "0/0", "author": "Gideon T. Carter, III"}]