[{"rating": 5.0, "review": "I found this really helpful because the 2 things that I use the most are NetFlix and YouTube. There is an added value to this, my phone is the control. I have this set up to my VIZIO M401i-A3 40-Inch 1080p 120Hz Smart LED HDTV and I am using Chromecast because the control for the tv sucks. With the ability to use my phone as the control I have all the control in the world and all the apps that I need.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The video at best on youtube and even then starts and then stops without reason that I could find. The product may need more work asm it just don't work for me.", "verified": true, "helpfulness": "0/0", "author": "John Lain"}, {"rating": 2.0, "review": "I expected a plug and go scenario (wireless without having to plug into power source.  Issue with streaming to chrome", "verified": true, "helpfulness": "0/0", "author": "Ana Christian"}, {"rating": 5.0, "review": "THIS WORKS THE WAY IT SHOULD I THINK THAT THIS DEVICE WILL REPLACE MOST PEOPLES CABLE IN THE FUTURE SO LOOK OUT XFINITY.", "verified": true, "helpfulness": "0/0", "author": "Aaron Scates"}, {"rating": 4.0, "review": "It works well but for some reason won't stream some media from time to time. It might be a software issue and it's still getting better.  Just don't understand why they don't have a media player from Google.", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 4.0, "review": "I really like this product. Perfect for watching netflix and youtube videos. I use my chromecast more then my cable box", "verified": true, "helpfulness": "0/0", "author": "Tiffany M."}, {"rating": 3.0, "review": "I would recommend it to anyone who really enjoys or uses YouTube. It is the best working feature it has. Watching Netflix is a pain in the @ss sometimes, just doesn't work, and when watching YouTube videos, even after closing YouTube and turning (Completely off, not standby) off my iPad the video keeps running sometimes. Besides that, its s cheap nifty way to add some IQ to your TV as long as it has a HDMI port and that you have where to plug the UBS or AC adapter (Because yes, it need juice to function, and it does not come from the HDMI port, so youll have to plug it in the wall or a USB port on the TV etc.).", "verified": true, "helpfulness": "1/1", "author": "Isael Tavarez"}, {"rating": 5.0, "review": "Chromecast is easy to set up and easy to use. We have 2 and it's easy to switch between rooms. Did I mention that it's easy?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This does not work with iPads or Macs as I understood it did.  This is a serious deficiency. Surely Google can do better than that. It also is not really clear that one needs not only the Chrome browser and Chromecast app but also a Chromecast app installed on the Chrome browser.", "verified": true, "helpfulness": "0/1", "author": "camach"}, {"rating": 5.0, "review": "The Chromecast is something I can't see myself living without. I use it to stream my Netflix, Hulu, Youtube, and Pandora! All to my TV! A GREAT BUY.", "verified": true, "helpfulness": "0/2", "author": "Kael Comstock"}]