[{"rating": 2.0, "review": "Is not the thing that I need that I want.Work good but I need to see all my phone or notebook in the tv, not only the things that you can share with the chrome cast.", "verified": true, "helpfulness": "1/2", "author": "Benjamin LagosH."}, {"rating": 5.0, "review": "I love the low prices for movies available for purchase on Google Play store (Korea). Watched a bunch of HD movies for $3 or less. I am going to buy many more HD movies not offered on Netflix in the Google Play store. It's a super deal.", "verified": true, "helpfulness": "0/0", "author": "Seiho Park"}, {"rating": 5.0, "review": "Easy setup. It was installed and running in about 15 minutes.Although I have a smart TV, I especially enjoy casting YouTube, since it's easier to browse my laptop than to type in my search criteria on the TV remote's tiny keypad.", "verified": true, "helpfulness": "0/0", "author": "Thomas R Owens"}, {"rating": 3.0, "review": "This was easy to install and set-up and worked well immediately. Image quality from paired apps and services has been excellent. However, I was very disappointed to find that the Chrome browser on my Nexus tablet doesn't pair with the device. Chrome on the desktop will pair, but the tablet version of the browser doesn't offer the option and this limits its usefulness.", "verified": true, "helpfulness": "1/1", "author": "JB"}, {"rating": 2.0, "review": "We wanted this for our guest room, but it was rather a pain the way it has to be linked to the computer or tablet. There are much easier products to use. We already have a Roku in the front room, just plug it in and follow some easy directions.", "verified": true, "helpfulness": "1/1", "author": "Lisa Haggart"}, {"rating": 3.0, "review": "Great for the price. It has limited apps so it is not that useful yet. Only supports h264 media type so if you have older videos they will need to be converted. Browser playback very limited", "verified": true, "helpfulness": "1/1", "author": "mdpigroaster \"mdpigroaster\""}, {"rating": 5.0, "review": "This works great, I don't need a gaming system to watch netflix on my big screen, wish I had, had one long ago", "verified": true, "helpfulness": "0/0", "author": "desartmirage \"desartmirage\""}, {"rating": 5.0, "review": "Bought this for my parents who do not want to get a smart TV. Being a college student this was a budget Christmas present. I tested it for hours before I gave it to them. They will be using it for Netflix and Pandora, which are some of the only big supported apps right now. They work flawlessly. If you have quality problems, either learn how to use the product correctly or get better Internet. As for the rest, you have to remember... Google has not finished this product. The code for this device is still in Beta, however, it has an enormous amount of potential. Point being said, it works great for supported apps, Tab casting is a little laggy and slow but it should improve with updates. Whenever Google finishes the SDK for this, Then it will definitely be worth it. If you're hesitant now, just wait. Google is a great company and they are nothing like Apple or Microsoft. They give out so much free software that works magnificently. Give them time and this little thing should be fantastic.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "I watch a lot of YouTube and Netflix. It works much better than Apple TV and I believe it already replaced my old-bad-slow cable box in time share.Hopefully Google will support or let someone develop an app that supports local file streaming and subtitles.Great product. Bought 2 more.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Miranda"}, {"rating": 1.0, "review": "I did not like having to install Google Chrome and set up on line.Who knows what Google does with the information they collect in the process and afterwards.Also the setup information is difficult to find and use.", "verified": true, "helpfulness": "3/7", "author": "barbara hocker"}]