[{"rating": 4.0, "review": "The voice recognition works vary well", "verified": true, "helpfulness": "0/0", "author": "Allan Wood"}, {"rating": 5.0, "review": "Awesome little TV box.  Works great wirh prime membership!", "verified": true, "helpfulness": "0/0", "author": "Bradley Krein"}, {"rating": 5.0, "review": "Just love every aspect of Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Barbara Lynch"}, {"rating": 5.0, "review": "Way beyond my expectations...easy installation and access.  The remote, especially with voice search, is great and easy to use.  Lots of contant and choice, especially on Amazon Prime.  Also provides easy access to Netflix, Hulu Plus, etc., simply by downloading \"apps\" like you would on your smart phone.  Really great system. For those who might have questions, you need to maintain your subscription to Netflix, Hulu, etc., and I would recommend subscribing to Amazon Prime ($99/year - ~$8.50/month - on a par with Netflix., etc), but there is still lots of free content available.  I haven't yet spent a lot of time surfing TV shows, but it seems that there are a lot available.  Current shows (like Big Bang Theory, one of my favorites) seem to be available for fee only, probably due to licensing agreements.  But, be that as it may, it will allow me to dump a whole lot of my cable programming, and save me over $100/month.", "verified": true, "helpfulness": "0/0", "author": "steven e. o'neal"}, {"rating": 3.0, "review": "Easy setup. Does not add much to a smart TV. Needs better remote. Comcast does not support, cannot access cable supported apps.", "verified": true, "helpfulness": "0/1", "author": "Gary Rich"}, {"rating": 5.0, "review": "Love it!  Now I'm able to watch my favorite shows and movies at the touch of a button, still figuring out voice commands, but buttons are good.", "verified": true, "helpfulness": "0/0", "author": "jlbl1950"}, {"rating": 5.0, "review": "This device is simply amazing. My husband loves to watch movies and this enables him to choose from thousands of movies.any time he wants. It's very easy to use Just one click of the remote and everything is right there. It's like having a library of movies right in your living room. The nice thing about this also is if you get tired of a movie or get interrupted and can't finish it , you can go back and resume it where you left off. Thanks Amazon for an amazing gadget.", "verified": true, "helpfulness": "0/0", "author": "kathy"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Danielle Frank"}, {"rating": 5.0, "review": "love amazon fire tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Far better than any other movie casting program.  Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "John Davis"}]