[{"rating": 4.0, "review": "When I have been able to get it to work properly, it is fine.  However, I am still trying to figure out how best to use it.  I have a first generation Nexus 7 which is the main way I have been trying to use it with mixed results.  It only works well with Windows 7 and Windows 8 but I am using Windows XP on my computer and this supposedly limits its functionality.  I am surprised that it does not work easily with the Nexus 7 unit since it is also made for Google.I know that this was a hot seller as the Best Buy stores could not keep them in stock so I assume it is just a question of learning its total functionality.", "verified": true, "helpfulness": "1/1", "author": "Elliott D. Novak"}, {"rating": 5.0, "review": "The Chromecast has been a very welcome to my household which consists of me and two roommates.  Each of us has a smartphone and whenever we want to listen to music in the living room, any one of us can just start up Pandora on our phone and cast it to the TV.  The Youtube functionality is pretty neat too: when multiple people are selecting videos on their phones, they enter into a shared queue for the device.  So far, that's all we use it for, but the device is so inexpensive that it was already worth it.  I'm excited for other apps to support or get built for the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Bill M. Cummings"}, {"rating": 5.0, "review": "Love it, Love it, Love it.Getting one for my smart tv.  It just works so much smoother and faster", "verified": true, "helpfulness": "2/3", "author": "Cj Whitty \"Cj\""}, {"rating": 5.0, "review": "This little device is an example what technology should be sold.It is simple, cheap and works just as advertised.No need to waste your money on craps like appleTV or similar devices.The Chromecast works even with my Dell Venue 8 pro using the chrome browser.It's a must have gadget for people that likes watching movies in Netflix.", "verified": true, "helpfulness": "2/3", "author": "Gabriel dos Santos Goncalves"}, {"rating": 4.0, "review": "Would recommend it if you are using it to watch Netflix or YouTube on the large screen. Would suggest you wait and consider Miracast which is a better alternative.", "verified": true, "helpfulness": "1/1", "author": "Audi A4B7"}, {"rating": 5.0, "review": "It comes with very simple, step-by-step instructions and it is very easy to set up and use. It lets me watch internet content on my TV.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "Another great product by Google at a very affordable price. I mainly use it to watch Netflix movies, Youtube videos and my personal Plex media collection. The picture quality is amazing. You do need a fast enough wireless router that can support the throughput of 1080p HD streaming, otherwise your picture quality will suffer. We loved our first Chromecast so much, we bought another one for a different TV set. Switching streaming between the two couldn't be any easier.", "verified": true, "helpfulness": "1/1", "author": "Arthur"}, {"rating": 2.0, "review": "This still has a lot of problems, especially if you want to stream anything other than the apps that are linked, such as Netflix, YouTube, etc. I was hoping to stream my amazon prime videos, but that is still in Beta, and sometimes it works and sometimes it doesn't.", "verified": true, "helpfulness": "0/0", "author": "Tanya Shively"}, {"rating": 5.0, "review": "gives you back your smartphone when you are trying to watch netflix, youtube, hulu, hbo etc.the only major shortfall is the lack of apps that have updated their app to support chromecast. I would guess we see a lot of apps adopt the feature in 2014.", "verified": true, "helpfulness": "0/0", "author": "Jordan L"}, {"rating": 5.0, "review": "I received an email that the shipment would be delayed and completely understood! Really appreciate the communication and I am thrilled with the product! Family members went and bought some for their homes. Again safety of drivers is important to me and did not mind a day or two delay. emails were helpful", "verified": true, "helpfulness": "0/0", "author": "Kyra Burns"}]