[{"rating": 4.0, "review": "You can convert your regular tv in to a smart tv.I think is really awesome and have very good apps, work fine.", "verified": true, "helpfulness": "0/0", "author": "joctan"}, {"rating": 4.0, "review": "Works awesome for Netflix and YouTube.  Streaming via Chrome browser uses too much processing power for my liking.  Hope more apps are released soon so that other video sites (i.e. Amazon Instant) work using Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Haipei Chang"}, {"rating": 3.0, "review": "I got the Google Chrome expecting a feature rich device for turning my older flat creek into a smart TV.  It does that with certain apps and within google chrome but is very limited when running off an ipad.The device sets up easily, and quickly connected to the wifi network.  I was able to sync with my mac and cast within a few minutes.  When casting the tv responds quickly and graphics scale well. I was expecting more ipad apps enabled but suspect that will grow over time.My primary goal was to push espn3 to my TV and it does that well from my Mac but will not from my ipad which has limited my use to my office.", "verified": true, "helpfulness": "0/0", "author": "Needle"}, {"rating": 5.0, "review": "grand Daughter has a Google chrome book and she is enjoying being able to watch netflix and pic's on Tv", "verified": true, "helpfulness": "0/0", "author": "Sharon W"}, {"rating": 5.0, "review": "Great device and is awesome if you want to play music on the TV.  I love it!  Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Michael N \"tennisacer\""}, {"rating": 5.0, "review": "One of the best in its class. Easy to use. You will love it and besides it is only $35", "verified": true, "helpfulness": "0/0", "author": "GM \"GM\""}, {"rating": 4.0, "review": "First, it was simple to install and even simpler to use. I have HDTV and there is no drop in clarity of picture although there is a significant drop in volume which is easy enough to overcome by raising the volume with a different device. Overall I'd give it an A, or a 9 on a scale of 1-10.", "verified": true, "helpfulness": "0/0", "author": "Robert Wilson"}, {"rating": 1.0, "review": "I wanted to attach it to the family room large TV.  I followed the directions installing it, but could not get it to work properly. I detached it. It is not being used, but is in a draw collecting dusk.  A waste of money.", "verified": true, "helpfulness": "0/1", "author": "Thomas Baker"}, {"rating": 5.0, "review": "I was a bit skeptical at first, but thought we'd give it a try.  Wow, super easy to setup and the picture quality and speed is super.", "verified": true, "helpfulness": "0/0", "author": "T. Phipps \"beachbum\""}, {"rating": 4.0, "review": "Several of my friends and family members  have the unit are very pleased with the it .Make sure the T.V. that you are using it on receives a good strong signal from your wireless router on unit wont connect .", "verified": true, "helpfulness": "0/0", "author": "lowdslanding"}]