[{"rating": 1.0, "review": "The unit has difficulty connecting to wireless networks. Use is limited until they get more applications on board. No app yet to support the unit. Hold off until 2014 or so. I think they'll get it right eventually.", "verified": true, "helpfulness": "11/40", "author": "DMDugan"}, {"rating": 4.0, "review": "Bought this one from Google Play couple of weeks ago. Installation part is really easy. Its simple. It works great browser one devices (TV and Phone/Tablets).Few things not aware of before buying this product (its not a product's fault but liwife tions) :- You wont be able to share your screens/ photos/ videos from your cell phone.- You will have to have some minimum configuration on your laptop. (Mine is Core 2 Due- ancient one). So i was not able to run it on my laptop chrome browser.I won't be able to use it from my computer chrome browser- It didnt work with my Netflix app of my cell phone that runs Android 2.3. But it runs fine on my other phone Jelly bean versions 4.2 and 4.3.- My TV didnt have the USB, so i had to use the power cable.It's not a device like Roku or Google TV or Airplay. It has its own area. At this moment only two useful app works for me. Netflix and youtube. video quality of the product is good. wifi reception is also good. I tried Roku 3 on the same place. Roku 3 was unable to pick up wifi signal. This one worked great.update 02/20/2014=======================Got another one replace of the previous one. It is again working correctly. I do not know what will happen after a week. Will it dispense like crazy like previous- dont know.", "verified": false, "helpfulness": "1/3", "author": "msmahfuz"}, {"rating": 1.0, "review": "How can Google be so successful yet fail to realize that maybe, just maybe, they might want to prepare for high demand on a capable streaming device that costs $35! Just like the Nexus 4 you won't be able to buy without waiting until the device is obsolete. Once again another great product from Google that will cease to gain traction because they decided to keep demand way higher than supply. Guess I'll go buy an apple TV.", "verified": false, "helpfulness": "3/51", "author": "R. Mcaleer"}, {"rating": 2.0, "review": "Ordered this item the first day it was released. I was really excited to try it out and I was going to give it as a gift but I never received the package. I'm not sure if it was the carrier that Amazon uses Ontrac 's fault or it was Amazon's, either way I don't have the item. Since Chormecast is backed up for 2- 3 months I will not get a hold of this item till then. This  was the first item I bought through Amazon and I've never experienced anything like this online. With my disappointment with the service, I will probably never be using Amazon again.", "verified": true, "helpfulness": "1/19", "author": "Reagan Rodriguez"}, {"rating": 2.0, "review": "Chromecast1. Setup was easy with Chromecast guiding me to the URL and I was able to download an app and it recognized and configured Chromecast for me very easily. All I had to do was put in the Wifi password.2. Chrome: You need Chrome to make it work on a PC. No PC app, which was very disappointing. Getting to install Google Cast plugin was a nightmare on Mac but very easy on a PC.  The Chrome performance was bad even static webpage text and pictures looked horrible even at the ultra settings. Playing video was a nightmare with huge skipping, static and lag. I tried both Mac and PC. I was able to play mkv movies directly from Chrome but with lag and bad picture quality. Even webpage scrolling lagged.3. Iphone: No Iphone app yet. Netflix and YouTube apps come with Chrome Cast options. It seems to use the native apps while streaming from those apps. Video and audio quality was great.4. I feel handicapped without a remote or a remote app for Iphone, PC or Mac app to use the native YouTube and Netflix apps on Chromecast. Which is seriously a drawback as at times I was staring at the screen and wanted it to show some kind of menu to show me those apps. Heck add a Chromecast remote plugin in Chrome. How hard would that be?5. Basically it's only use for me would be a Youtube and Netflix player. If you have those apps already on your TV then it's of no use in it's current state.6. I wasn't able to review the Android app performance or Google play video/audio performance as I do not own an Android device.7. I don't understand the current positioning of Chromecast product except it tries to add some kind of broken screen mirroring with Chrome. It tries to do the same thing as a laptop connected to a TV using HDMI but fails tremendously at it, with limited functionality and poor performance. The $35 price shows in the performance and limited functionality.Apple TVI own and Apple TV so might be a little biased but I do not have any use for Chromecast. Apple TV performs flawlessly and mirrors the mac screen with no lag no matter what is playing on the screen. A 1080p video runs and streams flawless and any text and images look great and things scroll with no lag. With it's $99 tag it has much better mirroring functionality, which alone is worth the $99 in my opinion, plus it comes with a remote and great video/radio/podcast/espn/news apps.", "verified": false, "helpfulness": "4/11", "author": "RN"}, {"rating": 5.0, "review": "After ordering a Chromecast on launch day I knew before I even plugged it in. At its price point nothing can even come close to touching what this device can do. After an easy setup, I was launching Nextflix and YouTube videos on my TV in no time. Even the chrome to tv feature I find myself using to share pictures and websites with those in my family. My only complaint is that the unit cannot be used from a computer attached to the network via a LAN cable. There is no reason that this cannot be implemented. I'm excited to see where developers will take the API for this awesome device.", "verified": true, "helpfulness": "1/2", "author": "backfire103"}, {"rating": 4.0, "review": "My household does not subscribe to cable television.  So, the Chromecast was a no-brainer for $35.  I was lucky enough to snag one right at launch.  The setup was simple and painless on my iPhone.  I was able to have it setup in just  few moments.  I've really been impressed with the NetFlix streaming from iOS.  My only complaint is that some of the functionality is limited with Windows 8.  The streaming on this platform seems to be limited to the Chrome browser at this time.", "verified": false, "helpfulness": "4/5", "author": "malom"}, {"rating": 5.0, "review": "I was skeptical about how well this device would work.  It plugged right up to my LG HD TV and the install worked as it should with no trouble (that's rare).  I love it, it works perfectly.  What more could you want?", "verified": true, "helpfulness": "1/2", "author": "johnbot"}, {"rating": 4.0, "review": "Why does amazon sell A product that they don't support on their own device?  Get with it Amazon and make an app available that will allow casting to this product. It works great with laptop", "verified": true, "helpfulness": "0/2", "author": "H. D. Hawks \"progressive preacher\""}, {"rating": 5.0, "review": "Within 10 minutes of receiving the item I was watching YouTube on my TV using chromecast. It is very easy to setup . I am very pleased with it. It will only get better with future updates and as more developers get on board.", "verified": false, "helpfulness": "1/2", "author": "Jimmy"}]