[{"rating": 5.0, "review": "This is absolutely what I was looking for.  It connect very easy and the Fire TV was already programmed to my Amazon account so I didn't have to sign up for anything, all I had to do was connect to WiFi and it was ready to use!", "verified": true, "helpfulness": "0/0", "author": "Broc Wallace"}, {"rating": 5.0, "review": "I love this product. It met all my expectations.", "verified": true, "helpfulness": "0/0", "author": "Patti Impens"}, {"rating": 5.0, "review": "I love my Amazon Fire Box.  Best Christmas Gift Ever!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kenzie Collin"}, {"rating": 4.0, "review": "A little confusing to navigate at first but manageable.  I wish there were more free movies and an easier way to search for free Prime movies.  Still a rookie so I may be missing something", "verified": true, "helpfulness": "0/0", "author": "BobnMikesMom"}, {"rating": 5.0, "review": "I loved the concept of it however I could also see it becoming very boring after you have viewed much of the videos that were available. I believe Fire TV will be as good as the content that must constantly be updated and offered on the Amazon Fire TV system. I returned mine because it became defective on or about the 3rd or 4th night of my ownership. I know it is a new venture and another new piece of electronic equipment which inevitably will have some bugs to iron out. It is the very nature of the beast. I will purchase another in the very near future but until that time I hope Amazon is able to revamp the device and to fix all of its little inherent problems.", "verified": true, "helpfulness": "0/0", "author": "DIGITALSHOOTER \"Canon5D-man\""}, {"rating": 4.0, "review": "Way faster than Apple TV. Wide variety of offerings. Would probably have given it 5 stars if it had HBO GO option.", "verified": true, "helpfulness": "0/0", "author": "GoSFGiants51"}, {"rating": 1.0, "review": "This fire tv doesn't work outside the U.S. You should fix that, because i bought it thinking i could watch the Nba league pass, and for my surprise i can't. And prime video as well doesn't work either. I live in El Salvador though.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love this thing.  I love the fact that my kids can play games on this. It is in some ways better than Apple TV but I am heavily invested in Apple TV to give up completely.", "verified": true, "helpfulness": "0/0", "author": "Elvis Polanco"}, {"rating": 5.0, "review": "Best tv box in the market", "verified": true, "helpfulness": "0/0", "author": "krzychu"}, {"rating": 4.0, "review": "Very fast and love the voice search! Wish the set up was a little different and wish they could figure out a way to link all of your subscription apps together.", "verified": true, "helpfulness": "0/0", "author": "Christopher Scott Harris"}]