[{"rating": 3.0, "review": "This is pretty slick, but the interface needs work. You must use Google Chrome as a web browser and it \"casts\" the video to this device and then to you screen. I've been using it with Netflix, which works, but usually requires 2 tries before it works. Still buggy.", "verified": true, "helpfulness": "0/0", "author": "Geoff Ladwig"}, {"rating": 5.0, "review": "This product is very easy to install and use.  I can play youtube videos right from my smart phone.  No wires needed anymore!  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Christy G."}, {"rating": 5.0, "review": "Excellent product. Very good quality, strongly recommended. It's like have a smart tv in your own house. Like it a lot!", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Easy setup, no lag time from phone to what's on the screen. Google is working on new connection like Pandora", "verified": true, "helpfulness": "0/0", "author": "Edward H King"}, {"rating": 3.0, "review": "It was slower to load up Netflix than my PS3, with only two deticated apps to use, and you can't cast your personal pics or videos to tv, its not as great as I thought it would be.", "verified": true, "helpfulness": "0/0", "author": "Dustin"}, {"rating": 5.0, "review": "Super easy to set up. I can watch my netflix movies on my tv's now. Can watch movies from the chrome browser or from the netflix app on my ipad. and what I like about it? the cost! 35 bucks is so worth it.", "verified": true, "helpfulness": "0/0", "author": "Jeanne"}, {"rating": 4.0, "review": "Awesome piece of technology wish it would support more apps like apple iphoto  as it only supports selected apps and although you can use it to see your tv screen you cannot use it to see pop ups as it only displays webpage and not associated content with that webpage. My 20 month old loves it as I use it to play nursery rhymes form you tube.", "verified": true, "helpfulness": "0/0", "author": "vic"}, {"rating": 5.0, "review": "I wish that I could stream video's and everything that is on my computer with Chromcast. Let's home that more is added in the future.", "verified": true, "helpfulness": "0/0", "author": "lefty"}, {"rating": 5.0, "review": "This will allow you to stream directly to the TV.  The price is fantastic.  This allows me to stream media to a not so smart TV.", "verified": true, "helpfulness": "1/1", "author": "Jerry"}, {"rating": 2.0, "review": "beside the fact that i cannot use it in my country (Israel) i understood (quite late) that i cannot streem movies from my tablet/smartphone to the t.v.", "verified": true, "helpfulness": "0/3", "author": "amit shwartz"}]