[{"rating": 5.0, "review": "There is nothing out there that can do this for the price. It's just too bad can only do Netflix and you tube for now.", "verified": true, "helpfulness": "0/0", "author": "jbone"}, {"rating": 4.0, "review": "As of 10/13, the Chromecast is still a bit limited to what it allows you to do, but I expect that to improve with time. As of now, you can cast any Chrome tab from a laptop or desktop computer to your TV, along with YouTube and Netflix. You can do the same from a mobile device, but be aware that you cannot cast a tab from a mobile device. Only YouTube, Netflix and Google Play. Again, I imagine that will change. Setup is easy and for $35 to basically get the Internet on your TV, it's well worth it.", "verified": true, "helpfulness": "0/0", "author": "Bradley Lionel Pecot"}, {"rating": 5.0, "review": "Works perfectly and easily. I just wish more apps would take advantage of it. The app on the top of my personal list isn't Pandora, its Plex.", "verified": true, "helpfulness": "0/0", "author": "Brian J. Vanmeeteren \"even time\""}, {"rating": 5.0, "review": "Although in its product infancy, I appreciate and enjoy the capabilities of the product and am hopeful that Google will expand its capabilities.  While I've a DVD player that provides similar video connection via the internet, the full screen presentation of YouTube video clips of great music and performances was well worth the small investment.  It has already generated a lot of interest and activity among enthusiastic \"rooter\" groups trying to expand its capabilities.", "verified": true, "helpfulness": "0/0", "author": "Ron Texas"}, {"rating": 3.0, "review": "For what it does, streaming Netflix and Youtube, it does quite well.  But not nearly as smoothly as using the Netflix app on the TV or from a computer.  The picture is great but going from episode to episode is a hassle, having to do it from the computer or phone/tablet.  For now I use it for displaying my desktop.  I use my mini-mac or Roku for everything else.", "verified": true, "helpfulness": "0/0", "author": "S. Hicks"}, {"rating": 5.0, "review": "Works well on my TV and surprising how the party sharing (queuing up youtube videos) is such a hit with the kids. The Android interface is much better than the Apple interface (to be expected)Now Google, lets get some people developing other apps.....", "verified": true, "helpfulness": "0/0", "author": "DavidNC"}, {"rating": 4.0, "review": "I bought this because the idea of the dongle that I can transport everywhere and have Netflix at my fingertips seems like an even better way to get the most out of my account. I got it, tried it and LOVED it, but since then it has been collecting dust on my shelf. Because I have a DVD player with wireless capabilities I don't see the need in using it at home. However I am very excited to try it out on the road, in hotels or friend's houses who don't have Netflix access. I think this is a great little thing for people on the go who want to have their apps for streaming at the tips of their fingers. I'm happy I bought it, even if I'm not getting a ton of use from it yet, it works well and seamlessly with my Galaxy S4.", "verified": true, "helpfulness": "0/0", "author": "Danielle M. Edghill \"DaniEdge\""}, {"rating": 4.0, "review": "I am still in the trail of getting it work more often than my media box.It seems depends a lot on the network quality and bandwidth. In update of my wireless to AC at the moment.", "verified": true, "helpfulness": "0/0", "author": "derbop"}, {"rating": 5.0, "review": "I love this, brings your phone (youtube,google apps) to your big screen. I will anxiously wait for more app options to fully view ALL phone or tablet apps!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "When I tried to connect the Google Chromecast to my LCD TV through the HDMI interface the Chromecast couldn't connect to my network!!!  Therefore it didn't work.  I contacted Google through their customer helpline but they couldn't help me either.  I am still waiting for a proper firmware update so that the Chromecast would work with my Sharp LCD TV and my Netgear interfaced wireless home network...!!!", "verified": true, "helpfulness": "1/2", "author": "Capitan"}]