[{"rating": 4.0, "review": "not bad but Ill keep my Roku for additional viewing options. Setup was easy...but wish I could cast what every is in the browser", "verified": true, "helpfulness": "0/0", "author": "William P Smelser"}, {"rating": 1.0, "review": "Good thing this is cheap because it functions so poorly.  The connections are unstable.  That is when it does actually connect.  I have tried on android and ios with same results on multiple devices.  Save your money.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pros:1. Relatively inexpensive ($35) compared to other options (Roku, Apple TV,...)2. Easy to setup (takes only 5 min)3. Can control using multiple devices (smartphone, PC, tablet) on multiple platforms (iOS, Android, Windows)4. Can stream anything on the Chrome browser (duplicating what's on screen)5. Can cue up multiple play items6. Doesn't consume battery on the smartphone (initiate streaming and move on to do other things or even put the phone in suspension mode7. 3rd party apps will continue to make this device more useful and will eventually allow streaming of anything on the PC or phone to the TV8. Tiny footprint that can easily hide away in the back of TV (if the TV has a USB port, then the device can be powered by a USB cable without a power supply connected to the wall outlet)9. Can connect it to an audio device/receiver and stream Spotify or Pandora continuously without turning on the TV- this is a very good feature!10. No additional service fee or subscription fee other than services that you choose to pay for (such as Netflix or Google Play)Cons:1. Doesn't support any local storage media directly (you can connect the storage media to your PC/laptop or smartphone and stream from there if necessary, though)2. No remote controller (you can use your PC/smartphone as a remote, though)3. ... can't think of any more cons!", "verified": true, "helpfulness": "1/1", "author": "Brian Lopp"}, {"rating": 4.0, "review": "It does what it advertises. Would have given 5 stars but still has limited support of apps. Must have a smartphone, tablet or computer to use it. It's video quality is very good and usually only takes a few seconds to start streaming media.", "verified": true, "helpfulness": "0/0", "author": "Justin C Dutton"}, {"rating": 5.0, "review": "Works like a charm, easy to set up I have it linked to multiple devices, tablets, pc, mobile phone.  My 8yr old daughter even set it up herself on her iPad.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "Streaming YouTube, Netflix and other things is so simple with this.  There are a lot of music apps out there that work with it.  I use it from my PC and my Android devices.Nifty little gadget.", "verified": true, "helpfulness": "0/0", "author": "NYC Reader"}, {"rating": 5.0, "review": "I'll keep this short and sweet. If your TV doesn't have a USB port, don't sweat. Plug it into the HDMI port and then plug the ChromeCast power cord into an outlet. The USB hookup is a more sleeker look but not necessary to get the ChromeCast to work.", "verified": true, "helpfulness": "0/0", "author": "Attitude Era Fan4Life"}, {"rating": 4.0, "review": "I bought one of these to supplement my Roku and be able to put the browser on my LCD TV.  i'm generally in agreement with the bulk of other 4 & 5 start reviews - it's good at what it does, possibly a little under powered, but will be a great deal more useful once more apps/sites support it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As untechy a grandma as I am, even I could set this up.  Unfortunatly I have not had much time to view movies I  have wanted to watch. I know when I retire in a few weeks I will have more time HA!!", "verified": true, "helpfulness": "0/0", "author": "Cindy B"}, {"rating": 3.0, "review": "I wanted to use my ipad/samsung touchpad to stream video to my tv. ONLY works with limited apps like youtube big deal. I need it to work with Chrome...but Chrome only works on desktop.Return", "verified": true, "helpfulness": "0/0", "author": "Michael J. Endrizzi \"dreezman\""}]