[{"rating": 5.0, "review": "This device is the simplest way to connect my Android devices to my big screen TV. This takes my basic HDTV and makes it a Smart TV. There are lots of alternatives to this device for streaming YouTube and Netflix but this is the easiest that I have tried. This also allows me to play my Google music on my TV which no other device has allowed me to do.Installation was simple: Plug it into a HDMI port, plug the power cable into a USB port, turn on the TV and follow the on screen instructions with your android device.The quality of the video and sound were excellent on my wireless N network, with only slight buffering at the beginning.I would highly recommend this device to anyone, especially anyone without a smartTV or other alternative already.I look forward to more apps being used with this little device.", "verified": true, "helpfulness": "2/5", "author": "Ben Gepfrey"}, {"rating": 5.0, "review": "I think there is a lot of confusion about what you can do with the Chromecast.It doesn't replace my ROKU, however if i am on the computer and want to cast it up to the tv ... its as easy as a click of the mouse. If i am watching a Youtube video and the wife wants to see it ... we don't have to huddle around the ipad screen ... one click and its cast to the TV. Is any of this new ... not really ... but what is new is the fact that it can be done instantly and with no effort....", "verified": true, "helpfulness": "2/5", "author": "Jason Bechard"}, {"rating": 4.0, "review": "Just wanted to point out to those wondering that this device does indeed work with Kindle Fire HD. Netflix, Youtube, and other features work.", "verified": false, "helpfulness": "109/146", "author": "Joshua Lavoie"}, {"rating": 5.0, "review": "Please vote up this review, because I have read every single one of the 1 star reviews and NONE of them are valid reviews. Vote this to the top so it will drown out all the non-review bad bs!----I have a Chromecast installed on my TV right now. Here is my review:The day before I bought ChromeCast, *I* (a 16 yr software engineer) had spent FOUR HOURS troubleshooting our own YouTube streaming capabilities via XBox 360+PC (via Playon and TVersity) and via the Roku. I finally got it to work, but then I contrasted that to how I unpacked, plugged in and did a little welcome steps and was up and running in literally less than 5 minutes on the Chromecast, with superior quality to boot.***The best news is that my 72 yr-old mother plugged in a Chromecast herself, launched it, set it up, and was using it *WITHOUT ASSISTANCE OR TRAINING* in under 5 minutes, and the same w/ my 7 year-old.***Do you know how gratifying the experience was to both of them?! My 7 yrold couldn't stop laughing and my mom said it was the best technical experience she's ever had. She didn't even need a manual.It's simply a next-level disruptive experience. I have never been able to use iTV as it's Mac-ecosystem only (and we have no apple products in this house), but I want to now, just so I can know how the usability stacks up. ChromeCast is simply the easiest to use video streaming service I have personally used and using a tablet or laptop as the controller is *far* faster (and easier!) than navigating complex menus and touch-typing via a remote (roku) or XBox 360 controller.The kids just had an angry birds competition on the TV for the first time ever using their Galaxy tablets as the controllers. So now Chromecast is competing directly with our XBox 360, at least for web games.The Chromecast is *so* disruptive that my parents would have bought a cheap tablet if they didn't already have laptops and, well, smartphones, just to control it.They didn't want to mess with netflix since it couldnt be streamed on their TV. Now, my dad was like, \"I wonder if I can cancel DirectTV now?\" rut ro Bad comment for someone who's just demoing a device for the first time.", "verified": true, "helpfulness": "459/788", "author": "Theodore R. Smith \"Promote freedom; fight fascism.\""}, {"rating": 4.0, "review": "I read about this in the \"paper\" this morning, it was sold out on amazon and i went to best buy immediately and got one of only 3 left.For $35, roku models being >$50 and apple tv $100 (I have an apple tv gen2) this is a sensational purchase. Granted, more apps and flash support through chrome will be required to make it more versatile, coming from apple I appreciate that any android or apple user can simply connect to my tv and display netflix and anything (sans video) on chrome.3 months of Netflix is also included so it's more like $11 if you're already a subscriber.This can be useful for various reasons, presentations at work, projectors at school, it's so easy to plug and play - the only requirement being wifi. So one Chromecast is theoretically adequate for an entire household also.I've used the basic features: Chrome is great for any browsing that doesn't involve flash (that's up to you how bad that feature is lacking), Youtube videos are all available, and Netflix is top quality. I hear HBO GO will be available soon with Hulu and the like.Apple Tv comparison: No AirPlay. Chrome mirroring lags slightly, but just as much.  No access to iCloud/iTunes music or videos unless you 'somehow' transfer them to google play.Otherwise, one major design 'flaw' is that if your hdmi outlet on the tv is not recent enough, hdmi 1.4, it will need to power itself via USB cable into the tv or the provided power adapter (either is discreet enough).This is a game changer, just be aware it's Google's first release and subsequent software updates will improve the features list.", "verified": false, "helpfulness": "18/25", "author": "Stefan Abels"}, {"rating": 5.0, "review": "PEOPLE WHO HAVE ISSUES CONNECTING TO THEIR HOME WIFI NETWORK-If you have the USB cable connected to your computer on battery, try connecting it to your TV or a wall outlet power source.  I think the power management settings on my computer wasn't giving enough power to connect the Chromecast to my wifi.", "verified": true, "helpfulness": "3/6", "author": "Tim"}, {"rating": 2.0, "review": "I was going to give it a try because of Netflix promotion. Now that it has ended, I will wait to see what sort of complaints people are experiencing with this device. They should have kept the promotion going to boost the device popularity. Anyway, I am in no rush to have this device on my TV now as I already have something that already works. Usually, the first generation have flaw because they haven't perfected the issue yet. Just like their Google TV box that come out with Revue. It has problem with memory and I have to constantly rebooting the device to free up the memory. Occasionally, I have to do a factory reset because Neflix no longer play or connect.All in all I was so excited about this product when I heard the announcement, what they've failed to mention was that the Netflix promo will only last for x number of hours. Two stars for ending the Netflix promotion which would have lured more people in giving this product a try.", "verified": false, "helpfulness": "5/56", "author": "Shawn S."}, {"rating": 5.0, "review": "I received my Chromecast early afternoon 07/25/2013. I ordered it from Amazon on 07/24/2013 a few minutes after it became available. So far the Chromecast is working as expected and as described, I bought it aware of what it can and can't stream. I use it in the master bedroom, where I have no internet or game consoles connected to my TV. Now the wife and I do not have to resort to our phones or tablet to watch a movie together on Netflix or a video from Youtube.My TV is mounted on the wall and extends/swivels outward, so I was worried I would not be able to extend the TV away from the wall If I had to use the wall outlet to power my Chromecast. Luckily for me, the USB port on my TV, which happens to be directly below the HDMI port the Chromecast is using, was able to power the Chromecast (not sure if it will work on every TV).Setup was extremely easy and within minutes I was steaming Netflix movies and Youtube videos. The load time for Netflix movies was not any longer that it usually takes on my PS3 (living room TV), the picture was HD quality and once the movie started, there was no lag or lowering of picture quality at any time. As I continued to watch the movie, I was able to leave the Netflix or Youtube app on my phone, while the movie remained playing on the TV, and I was able to check email and text messages on my phone without causing any issues to the stream. Unfortunately, I do not have a laptop, so I cannot say how the Chromecast works on laptops that steam Chrome tabs.In conclusion, this product is well worth the $35 price tag and I would recommend it for anyone looking to stream content (although limited at the moment) to their TV.If I experience any issues or problems in the future that cause the Chromecast not to work as it was intended, I will make sure to update my review.Thanks for reading and I hope you enjoy this product if you happen to buy it.", "verified": true, "helpfulness": "36/53", "author": "louiep"}, {"rating": 5.0, "review": "Hulu may have to rethink their strategy. No longer is your internet (and streaming movies) contained to your laptop.I somehow lucked out and happened to be at BestBuy as the truck was delivering. Great store rep went to the back and dug one out for me, I wish now I would have bought more after seeing them on Ebay and Amazon for $75+.Chromecast is preforming great with mobile streaming - youtube and FREE netflix (no longer available)Only issue so far is streaming from laptop as there are slight jitters and a 2-3 sec delay. This could be my laptop showing its ageSet up is supper simpleDownload an app for your device (only needed on one, all others detect the device on your network and the option is available immediately), set up on your network and download an extension for laptops and your set.Only from google could come up with something this nice for this price.", "verified": true, "helpfulness": "6/9", "author": "J. Arnette"}, {"rating": 2.0, "review": "When I ordered my Chromecast from Amazon at 7:56PM PST on July 24th, there was absolutely no indication on the website that the Netflix promotion had ended at 5:31PM. Every website, including Google's official website, said that the promotion was valid.Today I logged in to check my order and saw the notice on the product page. This was DEFINITELY not there when I placed the order.\"Please note that the Netflix promotional offer (which was available in limited supply) has now ended. Customers who ordered their Chromecast prior to 5:31 PM PST on July 24, 2013 will receive a Netflix gift code via email within 5 days of their product's ship date.\"Apparently I missed it by ~2.5 hours.I contacted Amazon's famous customer service expecting full well that they would see how shady this is and make things right, but the agent basically told me to get lost and that I was in the wrong.I promptly canceled my order out of sheer principal. I might order it again from either gPlay or Best Buy when it becomes available again.", "verified": false, "helpfulness": "12/43", "author": "LostShootingStar"}]