[{"rating": 5.0, "review": "Amazing, I use it almost daily", "verified": true, "helpfulness": "0/0", "author": "Someone"}, {"rating": 4.0, "review": "So I just went just got a Chromecast yesterday because I have been annoied at connecting my laptop to the TV whenever I want to watch movies/TV shows on the big screen (which is what I basically do every night, so it’s a lot of time).* Set Up: Really easy, only needed half the box worth of devices. Just plug the Chromecast into a free HDMI port on the TV, then plug in the USB to the TV (if available, this is what I did).  The you just follow instructions on the TV.* Netflix and Native Apps: Pretty pleased with both the experience and quality of the app and resulting video. It’s definitely nice to to not need to continually use a device. Unfortunately, Netflix makes you manually go back to the season and choose the next video from that list.* Tab Casting: Slow and unusable for the primary use, casting flash videos from the web to the TV. Everything else lags by around .75-2 seconds (depending on quality of casting), which can be usable, but isn’t great.Annoyances:* You have to use Chrome to get any of these features until developers create extensions for other browsers. Also, Netflix and Youtube only have their UI option for casting video in Chrome, even though I don’t think there is a particular reason to (my guess is Chromecast detection on the local network)* Tab Casting is extremely slow and a CPU hog, unusable for online video* Netflix not supporting non-stop play in either the mobile app or browser* Netflix not keeping the default display* Netflix not having an easy way to just go to the next video in the cast UI in the browser* Youtube not having the ability to queue up videos in the browser (it does in the iOS appSemi-Technical discussion:* Based on my testing of Tab Casting, it seems that tab casting does some optimizations when it can, but the main bottleneck is Flash as the primary method of video distribution. Tab casting seems to use some sort of transcoder which doesn’t take advantages of multiple processors/cores, in addition to Flash Player having the same limitation (and the Flash Player doesn’t seem to take advantage of hardware acceleration, but based on the CPU usage, the transcoder probably does).* Trying to cast a standard full-screen Flash Video (480p Youtube cast at 480p) in Youtube encountered a significant audio/video disconnect, but when changing to the HTML5 experience in Youtube, I cast both the 480p and 720p video (tab cast, as opposed to the native casting) in Standard (480p), High (720p) and Extreme (720p - high bitrate) with any disconnect. Using the native Youtube cast button quality is approximately the same as the Extreme quality, but without needing to consume computer resources, just streaming the raw video to the Chromecast.* I would have to do some more investigation on the file formats/plugins that it supports tab casting from, since it seems like not all are.* * MOV (h.264 & AAC, 720p) - Video Only (Audio plays on laptop)* * MP4 (h.264 & AAC, 720p) - Video/Audio (Same file as above, just renamed)* * Netflix Silverlight - Video Only (Audio plays on laptop)* * AVI (didn’t check format, 480p) - Video Only (Audio plays on laptop)* * MKV (didn’t check format, 1080p) - Video Only (Audio plays on laptop)Note: this was initially written when the Chromecast came out. Since then Netflix continually has changed how post-play works for both the desktop and iOS apps, I'm not sure of the current status of it (I've moved to using my PS4 more often for Netflix, which was the primary use case)", "verified": true, "helpfulness": "0/0", "author": "Remy"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "abdullah"}, {"rating": 5.0, "review": "Best thing since sliced bread. I watch all youtube bushcrafting from my phone to TV.", "verified": true, "helpfulness": "0/0", "author": "Bryan Resch"}, {"rating": 5.0, "review": "It's great to pick out a movie to watch during the slow time on normal telecasting,  not to forget going back and binge watching a seriesthat we didn't  watch originally .", "verified": true, "helpfulness": "0/0", "author": "jeff greenberg"}, {"rating": 2.0, "review": "Don't like the way it works. On a TV.", "verified": true, "helpfulness": "0/0", "author": "Moose"}, {"rating": 5.0, "review": "Love this!! Found out you can download the app \"shoebox\" and get the latest movies streamed through TV. Love this.", "verified": true, "helpfulness": "1/1", "author": "bunny007"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "FRANCISCA ROBIROSA"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Taneka M Gibson"}, {"rating": 4.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Idan Simhon"}]