[{"rating": 5.0, "review": "Great Meadia streamer that you can control from your droid phone, very compact, compared even to a Roku, and others", "verified": true, "helpfulness": "0/0", "author": "Harry J. Kostomiris"}, {"rating": 5.0, "review": "For those like me wanted something to put videos and other internet media on their tv this is a great device. I started with a wireless hdmi device, and it was very pixely. This on the other hand works great. Only issues i've noticed is if you have a slower internet connection, and are streaming from a non youtube/ netflix site (where the player is built into the site)  the video will leg a little bit behind the sound, but to me that is to be expected.For those who are more techsavy and are developers of Mobil platform (windows and android, havent tested IOS and never plan to) this will cause issues like a virtual box would and the easiest way to get around it (in windows) is to go to your nextwork connections -> change adapter settings, and disable all but wifi / ethernetAs for help from chromecast support, it sucks, i suggest just researching how to solve the problem on your own.", "verified": true, "helpfulness": "0/0", "author": "Zigcarruse"}, {"rating": 5.0, "review": "Great item.  Love that I can get Netflix, Hulu, and videos from my ipad and iphone to my TV.  Go Google.", "verified": true, "helpfulness": "0/0", "author": "rocksand"}, {"rating": 5.0, "review": "This was on her wish list and she was surprised to see that we ordered it for her. She really wanted one.", "verified": true, "helpfulness": "0/0", "author": "customer"}, {"rating": 2.0, "review": "i dont like how im not able to watch my phone videos and pictures on my tv with this thats the whole reason I got it", "verified": true, "helpfulness": "0/0", "author": "diana"}, {"rating": 4.0, "review": "I thought when I ordered Chromecast that it would stream any source I can access on my laptop to the TV. But it actually only streams Netflix and YouTube out of the box.  It doesn't (yet) stream Amazon videos, which is the only source of decent  movies since Netflix has gone the mostly-TV route.  There is a fix you can set up on the PC that might allow Amazon to stream through the Chromecast but it takes more knowledge of Windows than I want to acquire.  Amazon, why don't you put out your version of Chromecast for us die-hard movie buffs?", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is probably the cheapest and best device you can buy that connects Netflix to a TV.  The Netflix phone client is really good.  Pandora is really good too.  Only thing Netflix needs to add is automatically going to the next episode.  Pandora needed a screen-saver when they launched, but they quickly added it.  Since it's integrated directly into the normal android clients, it's very good.  Compared to other STBs and smart TVs, that's a much better model.  The apps on my TV are terrible and will probably never get updated.Why only 4 stars?  Youtube is mediocre at best, mainly because Google shows ads and there is no ad-block yet for Chromecast.  I could mod my router to block Youtube ads, but that's too much work.  Casting Chrome to your TV is really bad though.  Latency is terrible.  Also, do not expect to be able to watch local media files because it's just too choppy.  Whether I stream from the laptop or fileserver, it's just not really usable.  You're much better just using a video cable directly connecting your computer to TV.So yeah, if you're looking for a small, cheap, simple device to get Netflix onto a TV with great usability, buy this.  If you're looking for anything else, move along.", "verified": true, "helpfulness": "0/0", "author": "Dave Lo"}, {"rating": 5.0, "review": "This could be used in any room in the house. I am hooked on Netflix and wanted to watch some programs in my bedroom. I have an Wii in the livingroom and my daughter has an Xbox360 in her room. It was cheaper to get this than another gaming console to watch netflix. I can also listen to pandora or youtube. I am very pleased with this seller.", "verified": true, "helpfulness": "0/0", "author": "Rachel Kercheval"}, {"rating": 4.0, "review": "Not perfect though.  It does lose connection more than you'd like and have other glitches but overall its a great product for the money.  I have owned Roku, Xbox and a MacMini hooked into the TV.  This is the best of them since I can use the ipad, iphone or Mac to control the content.  I am buying a second one for my TV in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Marcelo Farjalla"}, {"rating": 3.0, "review": "Easy to set up and use with Netflix and YouTube if you don't have a \"Smart\" tv with those capabilities built in.  It needs to expand it's capabilities to iTunes and the computer desktop with sound.  When they do that I will give them five stars.", "verified": true, "helpfulness": "0/1", "author": "KNITWITNY"}]