[{"rating": 3.0, "review": "I like it. I have only have 2 complaints. One: after you use it for a while, you go to remove it from the TV and it's HOT. It gets really warm after just about 20min of use. Two: it only has a few programs that you can use it with, so you can't go to FB and stream a video from there, you have to use one of the programs that it's designed to use it with. BUT it really works well. I had no issues with it streaming to my TV.", "verified": true, "helpfulness": "0/0", "author": "SantoS"}, {"rating": 4.0, "review": "Feedback Havent used it yet...Christmas Present.  Plan to use it with the new ATV we will buy for Christmas...Thanks DF", "verified": true, "helpfulness": "0/3", "author": "Dan M."}, {"rating": 4.0, "review": "Works well enough. Needs more compatible apps, which I am sure will come with time. Though I understand why, it's sad I also have to plug it in separately for power. I have recommended to various friends who are also enjoying.", "verified": true, "helpfulness": "0/0", "author": "Pablon"}, {"rating": 4.0, "review": "this product is new features. but has great potential. you can stream video from your phone while on the phone making a call, of course only through YouTube for now, and I guess from Netflix but I don't have it I wouldn't know. 30 something dollars is worth it .", "verified": true, "helpfulness": "0/0", "author": "MILTON"}, {"rating": 2.0, "review": "Was expecting to be able to do more with the product, but it did not live to my expectation. Rather disappointing.", "verified": true, "helpfulness": "1/1", "author": "sebastianchu"}, {"rating": 2.0, "review": "On the plus side, it is cheap and came with 3 months of netflix. On the down side, not many apps were supported and mirroring a device via a chrome browser, involves downloading the content to the device you want to mirror, then sending that content back to google, which in turn sends it back to the chromecast. In summary, stick with AppleTV", "verified": true, "helpfulness": "0/0", "author": "Stuart Reilly"}, {"rating": 3.0, "review": "I was expecting it to be something like apple tv, but it is not even close.Good part, you can mirror chrome and bad part you cannot do so on you android device.i recommend this product to others but i do not think it is still in the league of apple tv.", "verified": true, "helpfulness": "1/1", "author": "Vikas"}, {"rating": 1.0, "review": "Well, after a couple hours, two TV sets, a Windows 7 computer, an Android tablet, and two routers at two different houses, I still have yet to set this thing up. This product was released way too early. By the way, you would think a CHROMEcast would work with standard CHROMEbooks, not just the Pixel model, wouldn't you? I think I will return it. I wish I had researched this a little more carefully before buying.", "verified": true, "helpfulness": "2/4", "author": "Andy"}, {"rating": 5.0, "review": "Works great.  Set up could not be easier, plug it into the HDMI port on your tv, plug in the USB power cord, Set up the wi-fi connection and away you go.  So far we've used the Netflix and Play Music Apps.  We've also cast from the Chrome browser on my PC with Plex.  Worked fantastic!  I think I know what I'm getting my family members for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great price and concept - but it only works with netflix and other for-fee services [ unless short clips on youtube is your thing ]  won't work with Amazon Prime.Was able to get it to work with limited value on the Ipad, but no joy on the laptop - and even on the website PC compatibility is BETA.Web support is very poorly organized, as is live support - Google is swamped because they did not properly vet the product, in their rush to get it out before competing products.It is not a Buy right now - unless you already have one of the fee for service vendors, only 1 device or like to own stuff that has limited functionality and don't mind wasting $35 to own it.it's a paperweight, for really small pieces of paper.Update 9.15.13 - Upgraded to Ok [ but still too pricey for what you get] Customer support responded - I needed to shutdown Vipre security and was able to connect - does not work with Amazon Prime. Tested with Break.com and Yahoo.com videoa and was able to watch videos on the TV. So it's still really only useful for YouTube or Netflix. Hopefully Google will get past BETAware on the PC Chrome interface and allow embedded players to work [ like Amazon ]", "verified": true, "helpfulness": "2/5", "author": "statsman"}]