[{"rating": 5.0, "review": "Works like a charm with YouTube, Beyond Pod, and Google Play Media (Movies and Music). I have owned it since it was first available.", "verified": false, "helpfulness": "0/0", "author": "SBJ"}, {"rating": 5.0, "review": "I bought two. one for a Christmas present and I'm glad I did.It came quick, had it hooked up in just a few minutes. I used the wall power supply to the USB cord because my tvdidn't have a USB port. works great!!! everything is of high quality build and looks. they give you what you need. I loaded the app in my phone and tablet in a minute it saw the TV in a second over my WiFi.I've played a movie through Google play from my phone and tablet and they run and look GREAT!!Very Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "David Deponty"}, {"rating": 1.0, "review": "Unfortunately never got it to work.  I tried from several PCs but the Chrome add-in always says \"no cast devices found\".  That's really weird because the Chromecast setup finds the chromecast and is able to configure it.  The chromecast itself says it's connected to the network. I just can't stream anything to it from ANY of my PCs because the add-in for chrome sucks. I've been through the help for Windows 8 and 8.1 users, but nothing in the help section fixed my issues.", "verified": true, "helpfulness": "1/2", "author": "Matt Dotson \"Say something about yourself!\""}, {"rating": 5.0, "review": "The chromecast has access to a lot more apps than it used to. Personally I'm using PLEX on my home computer to stream any of my digital media to my T.V.  which it works great for. It supports anything from an MKV file to an AVI.", "verified": true, "helpfulness": "1/1", "author": "Seth Forbus \"PS3 FANBOY\""}, {"rating": 1.0, "review": "Funny the commercials still give the impression that you can stream your own content (video, photo). Total crap.Already have a wii, playstation, blueray that does everything this thing does plus stores personal files. Google worse than Microsoft.No blocking apps", "verified": false, "helpfulness": "3/5", "author": "gus hosn"}, {"rating": 5.0, "review": "I am not sure how - but the resolution of the netflix streaming is much higher quality than my smart tv app.  My smart tv kept forgetting how to log in.  This makes it much simpler.  Easy setup", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 3.0, "review": "I'm a huge fan of just about everything Google provides but this device has been disappointing so far. Last week I purchased Chromecast. Setup was easy. It took about ten minutes. The first night I watched shows (from Netflix) with absolutely no problems. I came back two nights later and it would not cast Netflix (it said connection error). YouTube  works but no Netflix. I called customer support and they walked me through a number of troubleshooting steps which ended with me resetting the device back to factory settings (which means you have to go through the installation steps again). No luck initially. Thirty minutes later, it started working for no reason.A few days later I tried again. No luck. I called tech support again and this time they said that it's a known problem that they are having with Netflix. They promised to get back to me within 48 hours. Without Netflix support it really doesn't hold it's value (even at such a low price).In fairness to Google, I did more research and confirmed what the last tech support person said. Evidently a firmware to the chromecast was rolled out last week and this is causing the problem.[...]It happens...I'll be glad to revisit this rating when/if they resolve this matter. Until that time, I can't give a good or even average rating if it can't do the one thing I need it to do.***UPDATE 12/31/2013*****A couple of weeks ago, the device started working correctly again. I can only assume either Google or Netflix took some corrective actions on their part (since I changed nothing on my end).*************************", "verified": false, "helpfulness": "0/0", "author": "K Karimi"}, {"rating": 2.0, "review": "Works well with Netflix and Youtube, but doesn't work at all with Amazon Prime. I have had this for three months and it has stopped working already. It has been plugged into our tv the whole time and not moved around. The first time it was removed from the HDMI port the metal sheath covering the HDMI 'tongue' came off. It was reinserted and worked for another three weeks but has since stopped working.", "verified": true, "helpfulness": "0/0", "author": "J. Berky \"Self-Proclaimed Nerd\""}, {"rating": 5.0, "review": "Incredibly simple to use, replaces any other system for watching Internet media, I only wish the Chrome browser broadcasting worked a bit better.", "verified": true, "helpfulness": "0/0", "author": "Alan Hardman"}, {"rating": 5.0, "review": "Does everything I need it to do. YouTube, Netflix, all from my kindle fire with no issues. Only wish I could play my amazon prime videos through the device.", "verified": true, "helpfulness": "0/0", "author": "aichavez"}]