[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Location 2074"}, {"rating": 5.0, "review": "Everything that it is meant to be and more.  Didn't like that it doesn't stream webpages in HD.", "verified": true, "helpfulness": "0/0", "author": "Omar Eissa"}, {"rating": 4.0, "review": "FUNY!!!", "verified": true, "helpfulness": "0/0", "author": "Leandro"}, {"rating": 5.0, "review": "great item to have at home! we just love it!", "verified": true, "helpfulness": "0/0", "author": "Mick"}, {"rating": 5.0, "review": "It's amazing how many things you can do for so little money.", "verified": true, "helpfulness": "0/0", "author": "hg088"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Matt Ahern"}, {"rating": 5.0, "review": "Just about the greatest invention ever!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 3.0, "review": "It took me awhile to connect this to my tv and iPad. But it works. Just need very fast and good wifi connection", "verified": true, "helpfulness": "0/0", "author": "Olya"}, {"rating": 5.0, "review": "It works great: from my android tablet or my house mate's tablet and smart phone we can ask to chromecast to show videos from youtube, netflix etc....and any website that has a specific app for chromecast.Every people in the house can connect to the device: it is not biased to one specific account.To stream the screen of my device sometimes there is a delay. However by doing this I have been even able to watch with only few interraption a movie available online on a foreign TV website that has not specific app for chromecast.It is worth 30-35$.", "verified": true, "helpfulness": "0/0", "author": "Pl"}, {"rating": 3.0, "review": "This is a decent product when it functions properly, but I didn't realize before I bought it how annoying it would be to use. It really should come with a remote control. The app you're using on your phone will often time out, per say, and you'll have to re-connect and such to get control over what's playing on your TV. Would not buy again if I had the choice.", "verified": true, "helpfulness": "0/0", "author": "Bmz"}]