[{"rating": 5.0, "review": "It's awesome-meant my expectations and more", "verified": true, "helpfulness": "0/0", "author": "courtneycox"}, {"rating": 1.0, "review": "Does not support HBOGO on Comcast Xfinity.  This is a deal breaker and I plan on returning it if they let me.", "verified": true, "helpfulness": "0/6", "author": "Mark Taylor \"markdtaylor\""}, {"rating": 3.0, "review": "This is a great product, and works as advertised. With our Prime membership it has vastly opened up the amount of free movies/tv available. We've been satellite/cable bill free for many years now, and this combined with Netflix will be sure to keep it that way.My only complaint: We purchased this on Jan 11 for $99, only to see it listed on Jan 25 for $84. C'mon Amazon -- how about offering loyal customers the same 30 day price guarantee that many other manufacturers selling on Amazon offer for their products? If you don't, the $15 dollars isn't going to make or brake me; but I will remember this the next time I'm looking at Amazon hardware, and be less likely to buy until I'm absolutely sure the price being offered is at bottom. Hardly a recipe for increasing your sales, or your customers' willingness to take a chance on your newest hardware offering.", "verified": true, "helpfulness": "0/1", "author": "B. Chilton \"hiswife\""}, {"rating": 5.0, "review": "Fantastic, now I am set for the summer reruns!  Works as advertised, I had to get help with passwords.", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 1.0, "review": "Very frustrating. I have this hooked up in my bedroom where my Chromecast used to be. I'm using this on Wi-Fi to stream shows through the apps provided, hulu, Showtime,  HBO and the like. All of these apps freeze, buffer or restart  every few minutes. Commercials and ads though,  those play superbly! :/ I will be returning this and going back to Chromecast.", "verified": true, "helpfulness": "0/2", "author": "Jacque"}, {"rating": 4.0, "review": "Everything works fantastic!  One issue, and I think it's a Hulu plus issue, but it will go to an Ad, then blank screen but the sound plays on.  Believe it or not, but this works better than my Apple TV  O_o", "verified": true, "helpfulness": "0/0", "author": "J. Miller"}, {"rating": 3.0, "review": "It does work, it just didn't work that well for me.  I received it as a Christmas gift and it got stuck in a loop trying to update the software and wanting me to register.  I am guessing it was auto-registered to my nephew (who got it for me) and me putting in my info gave it heartburn.I had to get amazon support on the phone and they opened a ticket.  I tried power off/on each day for 2 days, then it was finally resolved (no email or phone call back to me however).The Netflix app seems to have the most problems.  It would get stuck loading at 25% so I'd have to turn it off/on and try again.Lastly, the Wi-Fi isn't the greatest.  It's 10 feet away from my wireless router (in the same room no less) and it still buffers/stutters with showing movies -- again, especially on Netflix.To fix the buffering problem, I got a long network ethernet cable and now, at long last, it is streaming fine -- but now I have a cable going across the room.  Sadness.", "verified": true, "helpfulness": "1/1", "author": "Ohio Guy \"neoguy\""}, {"rating": 5.0, "review": "The unit works great. We subscribe to both \"Prime\" and \"Netfilx\" and it is excellent for both. We used to use a laptop to access \"Prime\" and \"Netflix,\" and this is a HUGE improvement in convenience and functionality. The remote does not need line of sight\" to operate, is easy to operate and has a high quality feel. If you're wondering about the voice recognition, it works and works extremely well. If you're a \"Prime\" subscriber, we highly recommend Fire TV.", "verified": true, "helpfulness": "1/1", "author": "NorseFalconer"}, {"rating": 3.0, "review": "Pictures don't stream smoothly.  After hooking up, I can't use my laptop anymore.  Will not let me get on internet.  I like Roku better.", "verified": true, "helpfulness": "0/3", "author": "Sylvia Tidwell"}, {"rating": 5.0, "review": "Well received but not used frequently so far since we have been gone from home.", "verified": true, "helpfulness": "0/2", "author": "Bob A"}]