[{"rating": 5.0, "review": "Great item. Quick shipping. A++++++", "verified": true, "helpfulness": "0/0", "author": "Daniel Alvarez"}, {"rating": 5.0, "review": "Chromecast totally blew me away, smooth and effortless. All the laptops and smartphones can now push media directly to my big screen tv.", "verified": true, "helpfulness": "0/0", "author": "Pulkit Singhal"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "James Lee Walker"}, {"rating": 5.0, "review": "So easy to set up and you can begin watching movies, listening to music, or any other multimedia in minutes.", "verified": true, "helpfulness": "0/0", "author": "tyler"}, {"rating": 5.0, "review": "Comes with a USB dongle that has to be attached to the unit to power it and luckily my TV has an extra USB for this. Simple to setup, simple to use", "verified": true, "helpfulness": "0/0", "author": "Rage Kage"}, {"rating": 1.0, "review": "didn't get to understand its functionality. I have an apple tv and the only difference is the possibility to use chrome browser on your tv and I think (personally) it's not worthy.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "Absolutely love my Chromecast. This has all but alleviated my need to use a PC connected to my television.  The steady stream of new apps that are compatible with Chromecast is always expanding and for those apps that aren't compatible, you now have the option to stream your phone screen (with audio).  At this price, I don't see a better option out there.", "verified": true, "helpfulness": "0/0", "author": "Clyde Moore"}, {"rating": 1.0, "review": "I just returned mine because it was so awful , your support line wasn't that great either... Every time I tired to use this, I experienced more problems than joy..", "verified": true, "helpfulness": "0/0", "author": "Frank Gonnella"}, {"rating": 4.0, "review": "After much trial-and-error, got this to work using my laptop (Windows). Problem was that my Verizon FIOS router needed adjustments to work with Chromecast, and there was no way to know that. Finally found the suggestion on an Internet technical forum. Called Verizon and the tech made the router adjustments. Also, I believe one must use Chrome as the browser; wouldn't work for me on Firefox or IE. Will be installing another Chromecast on a different TV using a phone and will report back if problems there as well.", "verified": true, "helpfulness": "0/0", "author": "bigeasybound"}, {"rating": 5.0, "review": "Works great, very responsive! I'm a senior person and a tech idiot, yet had no problem with the installation and operation.", "verified": true, "helpfulness": "0/0", "author": "Carol Keisala"}]