[{"rating": 5.0, "review": "This is one of those rare items that actually exceeded my expectations, and as Google brings more services online that can be used with it, my opinion just keeps getting further validation.", "verified": true, "helpfulness": "0/0", "author": "Lance"}, {"rating": 5.0, "review": "Ten minutes after opening the box, we were watching a movie on Netflix. About six minutes of that time was spent picking out a movie. Downloading and installing the Chromecast app and setting up the device on the wireless network was a breeze. We've had no problems with it at all, with the caveat that we've only had it for a week. It doesn't do everything that the streaming media device on our other TV does -- it won't stream content from a local computer hard drive -- but then it cost about $300 less so that seems fair. I would recommend Chromecast to friends and family without reservation.", "verified": true, "helpfulness": "0/0", "author": "Weldon Berger"}, {"rating": 3.0, "review": "Fairly limited and constrained piece of hardware-software.  Once in awhile it doesn't smoothly transition between items streaming (wanting to show the previous video again, for example).  Otherwise, it does what it says, although a nice HDMI cord would do the same and allow much more to stream from my laptop.", "verified": true, "helpfulness": "0/0", "author": "Mark E. Gorman \"Leaf on the Wind\""}, {"rating": 3.0, "review": "bought it, didn't like it compared to Roku and Apple TV, limited services, though it is only $35 bucks. Gave it away for xmas to someone who I thought would like better. They have some work to do but the initial premise is there. If your too cheap to buy a roku box or apple TV than get this for sure.", "verified": true, "helpfulness": "0/0", "author": "Robert Gill \"Bobby\""}, {"rating": 5.0, "review": "this devices is so small and simple to use, gives your the capability to project anything from your pc chrome browser or some apps on phone and tablet...really incredable", "verified": true, "helpfulness": "0/0", "author": "Micheal"}, {"rating": 1.0, "review": "Doe not work smoothly or easily with iPad, iPhone (current update) or iMac. It also have problems in programing since it required codes Apple users never need to use for their Airport wilreless system", "verified": true, "helpfulness": "1/2", "author": "Art Lynch"}, {"rating": 1.0, "review": "I do not understand how this got so many positive reviews when it does NOT support a lot of content: Amazon streaming, iTunes...a lot of content.  Not that I really care but obviously the reviews/feedback are biased.  If you don't have exclusively Google/Android/Netflix and their partners then this gizmo is crap.  Easy and simple, but still crap.  Worth 10 dollars maybe.  Just wait.", "verified": true, "helpfulness": "0/2", "author": "SpenceDog"}, {"rating": 5.0, "review": "It was easy to set up. I use it a lot and love it! I highly recommend it.  Great item!", "verified": true, "helpfulness": "0/0", "author": "Jan Rickman \"JLR\""}, {"rating": 5.0, "review": "I was one of those people who was excited about this cheap little streamer. I got it from amazon and tested it out by following the instruction. For some reason that my device was not able to be found on the home network. I googled for solutions and found many people have the same issue. I then updated the firmware of my router then it works and fix the issue. I tested by broadcasting videos that play in the chrome browser and it works like a charm. Playing netflex from my phone also is another awesome feature. I would recommend this device for people that doesn't have a smart TV and looking for a cheap but quality video streamer.", "verified": true, "helpfulness": "0/0", "author": "Chi-Yu Yen"}, {"rating": 4.0, "review": "Good product, we like it.My family's get to spend more time together.But not many option s as I was expecting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]