[{"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Henry winckelmann"}, {"rating": 2.0, "review": "Love it from a functionality perspective, however it doesn't include VUDU. If I had realized that I probably would've purchased a Roku 3 intsead", "verified": true, "helpfulness": "0/1", "author": "Chris E."}, {"rating": 5.0, "review": "Love the Fire TV!  We are able to view all varieties of programs which we could not access before.  It is easy to set up and to use.", "verified": true, "helpfulness": "0/0", "author": "AZ golfer"}, {"rating": 4.0, "review": "Overall not bad. However, I had a few complaints. 1) sometimes I still need to wait for it to catch up. 2) remote is small with curved bottom, probably to be ergonomic. I have large hands so sometimes its difficult to handle. The curved bottom also makes it difficult to leave on a table to push the buttons. 3) the voice search understands well, but didn't search other apps like hulu and netflix. It searched Amazon only. 4) cannot control download quality feed to manage data usage. 5) little expensive compared to firestick and chromecast.Good things: set up easily, small, relatively fast scrolling and searching.", "verified": true, "helpfulness": "0/0", "author": "doda"}, {"rating": 5.0, "review": "I don't have to use my laptop or my tablet to down stream moovies love this box for moovies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "Adina"}, {"rating": 5.0, "review": "great product tho i wish there was a stand alone hbo app that i could pay only for hbo", "verified": true, "helpfulness": "0/0", "author": "colton"}, {"rating": 2.0, "review": "Giving 3 star not 4 because mirroring content from Android sevices stopped working (tested on Samsung Galaxy S5; Samsung Tablet; Dell tablet) after 1 week of usage,  open a support ticket with amazon and no follow up from them, nor solution of my issue.Also the amount of games plus their prices on the store are way to expensive if compared to other streaming boxesGaming controller are not worthy in the sense that are too expensive vs how much games are available on the platform.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "I switched from my apple Tv to the amazon fire once I ordered Prime and I'm glad I did. The voice control alone has made it worth it. Literally everything seems to operate faster verses the apple tv, streaming, switching interfaces, voice operation, etc. Amazon did a great job with this product.", "verified": true, "helpfulness": "0/0", "author": "Michael I"}, {"rating": 5.0, "review": "I love this thing. I had an Apple TV which was okay. The Fire TV is much better and easier to use.", "verified": true, "helpfulness": "0/0", "author": "Av8rgene"}, {"rating": 5.0, "review": "Amazing steaming device. I own all the main stream including Appletv, roku3, roku stick and Chromecast. By far this the best. The interface is snappy and responsive. The layout of the GUI is good and the voice search is great.The only complaints I have is that the voice search only works for apps and Amazon Prine and purchasable content. Not a deal breaker by any means but it would be nice to open netflix app and then be able to use the voice search.The system works well with Plex apps. The app is far better than the current Roku version, although there is a new roku beta that should get them caught up.Believe me, after owning every platform I wish I had one of these in every room instead of the hodgepodge I have today.", "verified": true, "helpfulness": "0/0", "author": "John Bassett"}]