[{"rating": 5.0, "review": "very fast and stable. I have owned other android mini pc. Most are buggy. By far this is the best by far of a combination of good OS and hardware.", "verified": true, "helpfulness": "0/0", "author": "Liem Nguyen"}, {"rating": 5.0, "review": "one of the best things I have ever bought", "verified": true, "helpfulness": "0/0", "author": "charles hampton"}, {"rating": 5.0, "review": "Simple,Easy, and awesome! Enough said", "verified": true, "helpfulness": "0/0", "author": "JleeinMC"}, {"rating": 5.0, "review": "I love mine! I also am enjoying the new update.", "verified": true, "helpfulness": "0/0", "author": "NEC"}, {"rating": 5.0, "review": "Simply the best there is. I use home theater system and the sound produced from this device beats hands down Apple TV as well as Roku. No comparison.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Smith"}, {"rating": 5.0, "review": "SO FAR. GREAT! The only thing that we watch and don't have on it id Days of our lives. Have been watching it for 43 years.", "verified": true, "helpfulness": "0/0", "author": "Richard Gibson"}, {"rating": 5.0, "review": "no comment no comment", "verified": true, "helpfulness": "0/0", "author": "RANDY RAINEY"}, {"rating": 3.0, "review": "had this for exactly 31 days now its has no sound", "verified": true, "helpfulness": "0/0", "author": "MELVIN W SIMMONS"}, {"rating": 5.0, "review": "Absolutely great product!.  I've had the Amazon Fire TV for six months now with no problems. Far superior to the Apple TV I had been using.Amazon's response to customer requests for easier to locate 'Prime movies only' has helped with that issue and I thank you Amazon. I do think that Amazon's products and services are terrific.I did want to let users know about one issue I have found though. I also have and pay for the Netflix network for free programs (after the monthly charge). But, I have found that if I just voice search a show (which works great otherwise), an Amazon pay fee movie will pop up first, even if the movie is available for free on Netflix.  Kinda tricky. So you might want to check your other free services if you find there is no Prime free service for the particular show you want to watch on Amazon Prime.Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Beverly"}]