[{"rating": 5.0, "review": "This does a good job of what it's designed to do.  Please people, read up first.  there are limitations, as the software and device is essentially a beta.  More and more features with added compatibility will be added.I use this regularly for netflix in my bedroom, and for $35, it makes a great convenient device for this.", "verified": true, "helpfulness": "0/0", "author": "Adam M."}, {"rating": 4.0, "review": "I had some initial difficulties setting it up in my home network. I even tried calling Google support and they responded but giving few suggestions. But it did not work. The device seem to be dependent on the router being used, so google did not have a apt suggestion for the model i had with me (i have cisco linksys E2000 model router). I found a video blog in the net based on which i changed few router settings. I then restarted everything in my house including the router and i was finally able to set it up. Chromecast is really cool for the amount you spend on it. You can stream from your laptop or smart phones if you have netflix and youtube app (it works wth pandora too but i don have pandorawith me). You can then multitask ur device but the video wll still be playing in ur TV. You can also stream video from chrome browser from your laptop but you might at times experiece a delay. Also, multi tasking ability is limited if you are streamingfrom your chromebrowser. Google isaware of it and are working on a fix. Overall, I am kind of satisfied with the product as of now and expecting more updates from google I am giving it a 4 star especially for the value for money it offers. Cheers!!!", "verified": true, "helpfulness": "0/0", "author": "BornToWin"}, {"rating": 5.0, "review": "Remember this can only be used with google chrome.  But it can be used as a desktop extender by putting any one of your google chrome tabs up on the screen.  Very nice feature.  Easy to setup, will be getting one for all tv's in the house and network them all together.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "I use plex at home and now with the ability to cast it on my older HDTV I'm able to get rid of a poor function hdmi extension cable. I may pick up another chromecast for one of my downstairs tv.", "verified": true, "helpfulness": "0/0", "author": "T. Bradley"}, {"rating": 5.0, "review": "The price is right for what you get...... i use it on a second tv.I use a roku 3 on my main tv.....only because im an amazon prime member.......and i can plug headphones into the remote...", "verified": true, "helpfulness": "0/0", "author": "joseph lipari"}, {"rating": 5.0, "review": "I was impressed with the quality of the video as I watched YouTube on my TV set. A whole new way to enjoy the internet.", "verified": true, "helpfulness": "0/0", "author": "John Barker"}, {"rating": 5.0, "review": "Chromecast is a great product that allows you to watch movies on your television without much set up. You need to have an HDMI, USB and power source.", "verified": true, "helpfulness": "0/0", "author": "lrap"}, {"rating": 5.0, "review": "CONNECT WITH EASE VERY USER FRIENDLY. NO PROBLEMS WITH CONNECTING ALL MY DEVICES. HIGHLY RECOMMEND. CRYSTAL CLEAR VIEWING 5 TARS", "verified": true, "helpfulness": "0/0", "author": "DONNY HOOGVLIET"}, {"rating": 4.0, "review": "We ordered this while on an extended vacation, it arrived promptly, installed easily and gave us access to the Netflix and Pandora services we were used to at home.  Google does need to get more apps onto Chromecast and especially get the Chromecast extension for Chrome on the iPad working!", "verified": true, "helpfulness": "0/0", "author": "Robert P. Schmidt \"Bob Schmidt\""}, {"rating": 5.0, "review": "We enjoy watching a streaming movie from time to time and this works perfectly for us. Great price, yes sir.", "verified": true, "helpfulness": "0/0", "author": "John Gibson \"jb-linear-music\""}]