[{"rating": 5.0, "review": "One of the best electronics purchases ever! The ability to just plug this thing in and be able to watch Netflix/Youtube while using my phone as a remote control is almost magical, and this is coming from a tech guy. Mirroring almost any tab from Chrome is also a really neat feature if you want to watch a video from a website that is not supported natively by ChromeCast, such as Amazon or Vimeo.I wish more applications supported ChromeCast but hopefully the situation will continue improving in the future. Still for $35 I would give this product 6 stars if I could.", "verified": true, "helpfulness": "0/0", "author": "Mike K"}, {"rating": 5.0, "review": "I also own a WD TV Play and I prefer the Chromecast for streaming netflix. The apps open fast and is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lazaro Achurra Medina"}, {"rating": 4.0, "review": "Works really well, easy to set up, good buy and would recommend it to anyone who has the right electronics to hook it up to. Watch lots of casted movies and old TV shows, learning other ways to use it with help from the book by Aaron Halbert.", "verified": true, "helpfulness": "0/0", "author": "Randolph"}, {"rating": 5.0, "review": "I like the ease of use. I am having problems getting the TV picture to be full screen and I don't know why. But over all the product works and is easy.", "verified": true, "helpfulness": "0/0", "author": "istrooper64"}, {"rating": 4.0, "review": "Set up was easy and only took a few minutes. Started streaming movies and music and haven't stopped. Inexpensive enough to get one for each tv in our house too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For the price, you can not get a better deal. if you have a laptop or a smart phone, this is perfect. It allow you to stream movies or tv shows to your TV using a service called \"Plex\". Have not had any problems with this. The picture looks great!", "verified": true, "helpfulness": "0/0", "author": "Zachary Warren"}, {"rating": 4.0, "review": "This Itms makes me wonder why i am paying for cable . I watch Netflix and youtube a lot more than i watch my cable ,Overall it is a good product and i am loving it", "verified": true, "helpfulness": "0/0", "author": "Tosin Alude"}, {"rating": 1.0, "review": "it is to most unuseable product I ever purchased. it does not work, it can only cast youtube video. nothing more. you could cast youtube video thru any other player like wd media. google let me down, they made aweful product.", "verified": true, "helpfulness": "2/2", "author": "Nathan Vue"}, {"rating": 4.0, "review": "I bought this as a cheap way to stream Netflix, Hulu and Plex. There are some performance issues with Netflix sometimes, not sure if it's the device or ISP. I have to say the mobile apps tend to work much better than \"chromcasting\" from my laptop browser. Mostly because with the mobile devices(iphone, ipad), we can set-up a stream and then use the device to do something else(yup, multi-screen entertainment, welcome to the new millenium). The laptop you have to set it up in the browser then full-screen to get full screen on the TV. I'm forgetting now if that's Hulu or Netflix.I don't have the plex app on my phone, so I also cast that directly from the browser. As a result I loose some of the fun functionality of the Plex Media Player, but it works fine.Overall I'd say \"it works fine\" is a good description. And for that price, I'd say that's pretty good.", "verified": true, "helpfulness": "0/0", "author": "claybob"}, {"rating": 5.0, "review": "I LOVE my Chromecast and give it 5 stars! Set up was a piece of cake!  Anybody could do it! I am able to essentially turn my TV into a Smart TV. I can use my iPad, iPhone, or laptop to control whatever I am watching (pause, play, etc.) But you can still use your device to do other things when you are watching something on Netflix, etc. The $35 price point was also a plus!!!", "verified": true, "helpfulness": "0/0", "author": "kbh14"}]