[{"rating": 5.0, "review": "Great inexpensive way to connect your tablet to your TV", "verified": true, "helpfulness": "0/0", "author": "Derek Sloan"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Jesse denison"}, {"rating": 5.0, "review": "It's a great buy and easy to install....", "verified": true, "helpfulness": "0/0", "author": "leoza"}, {"rating": 1.0, "review": "WARNING!!!!!! WARNING!!!!! DO NOT BUY!!!! I REPEAT DO NOT BUY!!!!! HAS NOT WORKED FROM DAY 1!! CONSTANTLY BUFFERING, SKIPPING, AND DISCONNECTING!!! I HAVE YET TO STREAM ONE FULL LENGTH MOVIE FROM MY TABLET FROM MY PHONE OR LAPTOP WITHOUT IT COMPLETELY DISCONNECTING OR REBOOTING. WHEN THIS HAPPENS IT IS A 5 MIN ORDEAL TO GET IT BACK UP AND STREAMING ONLY FOR IT TO DC AGAIN. IT DOES THIS AN AVERAGE OF 10 TIMES THROUGH THE COARSE OF A MOVIE RESULTING IN A LOSS OF AN HOUR. IF YOU HAVE MONEY TO THROW AWAY AND HOURS OF TIME TO WASTE THEN THIS IS THE PERFECT DEVICE FOR YOU. IF YOU DONT HAVE HOURS OF TIME TO BURN OR HAVE A MONEY TREE THEN DO NOT I REPEAT DO NOT BUY THIS HEADACHE CREATING PIECE OF JUNK, TO PUT IT KINDLY.", "verified": false, "helpfulness": "0/1", "author": "Kaliko Trusdell"}, {"rating": 5.0, "review": "I own 4 !", "verified": true, "helpfulness": "0/0", "author": "Manny  Sermeno"}, {"rating": 2.0, "review": "It was better before they neutered it. The \"updates\" cut down on the features. Look it up on the internet for full explanation. I also dislike the way it phones home once a day. I use a HDMI switch as I only have two HDMI inputs to my TV and need five. So my HDMI switch will go to the active device. This means when I am using my Roku or DVD player to stream, the darn Chromescast will phone home and take over. One minute I am watching Netflix via Roku and the next the Chromecast screen saver. Very irritating, Chromecast only phones home once a day so often I never even notice it, but when it does, its a pain.", "verified": true, "helpfulness": "1/1", "author": "TopDog"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Rajiv Tinaikar"}, {"rating": 5.0, "review": "great!", "verified": true, "helpfulness": "0/0", "author": "Westfield S."}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "gary lytle"}, {"rating": 5.0, "review": "All good!", "verified": true, "helpfulness": "0/0", "author": "Anthony B Crosby"}]