[{"rating": 4.0, "review": "I like this product a lot, I just wish I would be able to play a DVD or any other media from my computer on the tv.", "verified": true, "helpfulness": "0/1", "author": "Justin Kreindler \"Avid Traveler\""}, {"rating": 3.0, "review": "The Chromecast is a clever device, but it's essentially the Roku hardware without a remote and without software.  You use your phone as the remote, and download various apps for various services such as Netflix, HBO Go, YouTube, etc.If money is more important than time, and if you like playing with apps, this is a great option.  You'll spend some time on setup and downloading the apps, but for about 1/2 to 1/3 of the cost of Roku, Apple TV, etc.If time is more important than money, spend the extra money and buy the Roku, Apple TV, or something similar.  You'll be able to stream programming almost instantly.", "verified": true, "helpfulness": "24/33", "author": "Reno Dave"}, {"rating": 2.0, "review": "cannot get amazon video to stream via laptop or any other device. Only good for netflix subscribers in my book", "verified": true, "helpfulness": "3/4", "author": "Will Presley"}, {"rating": 5.0, "review": "One of the simplest ways to stream video to your TV.  And it gets better apps all the time.  I love using it with Plex, Hulu, and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"PizzaPanther\""}, {"rating": 5.0, "review": "Best product ...works well with  I pad, nook tablet  and laptop. At least I have tried it with all three. I recommend this product! Great product for a great price.", "verified": true, "helpfulness": "0/0", "author": "Eske"}, {"rating": 3.0, "review": "**Read my update after only 10 days**I picked one of these up rather spur of the moment when I bought a new 1080 HDTV for Christmas and realized my old standard def streaming device would probably look crappy on it.The good:  Sets up and starts working within 5 minutes.  Very simple, if you have any experience with Wi-fi connections already.  And when it's actually showing \"HD,\" it looks fantastic and runs smoothly.The mediocre:  As above, \"when it's actually showing in HD.\"  There's the usual minute or two of buffering I've become used to on streaming Netflix when the picture looks smudged upon first starting up before settling in.  Problem is, depending on any number of factors, it phases in and out of this quality throughout an entire broadcast, and on the 1080 it is painfully obvious and impossible to ignore.  On our second night of use, the buffering with full-on frozen screen watching a slowly rotating progress indicator became so unbearable and lengthy we were forced to give up.This seems to have improved greatly (knock on wood) by rebooting my router and refreshing it, as well as moving it out into the open rather than under the desk.  Here's hoping that's fixed it for good.The bad:  While setting up my new TV, I plugged the Chromecast into the rear HDMI port, brushed against it lightly trying to squeeze past, and the connector bent 45 degrees in the casing.  I had had the thing for 12 hours at this point.  Straightened it out as best I could, plugged it back in, and seems to be functioning fine, thank goodness.  Just be warned, it's a delicate little flower to handle.  I would expect a Google product to be made of sterner stuff.However, overall the good outweighs.  It's so cool to make every smartphone in the house a remote (clarification:  a different device cannot take over an existing cast, but can start its own cast), and to say \"watch this YouTube video\" and cast it onto the screen instead of huddling over the phone.  I'm really hoping this goes somewhere and we see more and cooler applications with it.  I got this instead of a Smart TV and so far no(t many) regrets.10-DAY UPDATE:  Well, yesterday the Chromecast mysteriously stopped being detected by my TV.  No connections had changed, in fact, it had worked fine that very morning.  No amount of unplugging, replugging, switching ports or power sources, or factory resetting would make it detectable.  After talking to Google (who tried to be helpful at least), I got it up and running again on our older TV upstairs, but that didn't change the situation on the big screen which is our main viewing.  The Google rep said that our HDMI port must have \"switched compatibility,\" which sounds like a made-up term for \"we don't know what happened.\"  Again, this TV is literally a day older than the Chromecast, and it had been working perfectly fine up until this moment, or I would say I got a bad device (she tried to blame it on the TV being outdated).They couldn't help me, I'm back to using the old RCA Roku-like device, but I'll hold onto the Cast in case an update comes through or something.  Of course, that will require Google admitting they sent a glitchy device to market prematurely, but I doubt I'll be able to return it since it technically works on one TV.  Very, very, very disappointed.", "verified": false, "helpfulness": "2/2", "author": "Grrgoyl"}, {"rating": 1.0, "review": "I have a chromecast. Its useless because it wont do what I want: Mirror the android desktop so I can use the phone more like a computer including playing local files to the device.. Buy something else if you want this functionality. chromecast only lets you do what helps google make money.. I wouldn't bother picking up a chromecast if I saw one laying in the street. Under the FAQ you read above it states \"Can I cast a tab from Chrome on smartphones and tablets to my TV?Currently Chromecast does not support casting a Chrome tab from smartphones or tablets.\" Google has had ample time to implement this feature, furthermore someone did figure out how to do it early on and google blocked the ap in an extremely consumer unfriendly move. If google changes this policy I will edit this review.", "verified": true, "helpfulness": "1/6", "author": "ricco"}, {"rating": 5.0, "review": "It's as good as I was hoping - and with all the updates Google has made, it's only gotten better", "verified": true, "helpfulness": "0/1", "author": "Mike Budny"}, {"rating": 4.0, "review": "How could you not buy one of these at the price?  Only thing holding me back from a 5 star is the minimal app support.  The Chromecast is getting there though.", "verified": true, "helpfulness": "0/0", "author": "MikeyJ"}, {"rating": 5.0, "review": "When I first got the chromecast I was kinda set back due to the lack of programs, but as time passed and more programs were supported the happier I got with it. Now it supports a variety of programs from youtube to pandora and seems to get more and more. I really can't wait until it allows you to stream media from a local device.", "verified": true, "helpfulness": "0/0", "author": "Cassidy"}]