[{"rating": 5.0, "review": "Once you use it, you will want one on every TV. This is my 3rd. Great for use on vacation to watch movies from my android tablet.Favorite apps- PLEX!!!- Netflex-YoutubeMore apps added often. Still waiting for Slacker Radio Support. Other than that no complaints", "verified": true, "helpfulness": "0/0", "author": "Michael J. Sjaarda"}, {"rating": 4.0, "review": "Chromecast is a great device for broadcasting content from your computer directly to your TV screen.  It was a breeze to set up and easy to connect.  I did have some connection issues because my router wasn't powerful enough to send a clear signal, but I recently upgraded the router and now have no issues at all.  I do wish that the device would operate on the higher frequency 5ghz, not just the 2.5ghz band.", "verified": true, "helpfulness": "0/0", "author": "ATLJC \"JC\""}, {"rating": 5.0, "review": "Love the Chromcast. Cannot beat the price. Can cast from both android and apple devices.", "verified": true, "helpfulness": "0/0", "author": "Seth M. \"Sethwardo\""}, {"rating": 5.0, "review": "It's great to have. Netflix works amazingly. I can send Youtube or other internet videos from my phone or tablet to the TV. Others can add videos to the queue.Cons:Streaming the browser itself still doesn't work that well.", "verified": true, "helpfulness": "0/1", "author": "HB"}, {"rating": 5.0, "review": "Good item and quick  ship by vendor.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "Love it. So much faster than roku.", "verified": true, "helpfulness": "0/0", "author": "marlissa"}, {"rating": 5.0, "review": "Ordered a second one for another room. A must have when you turn off cable! Tho as a warning It is currently not playing nice with kindle fire HD.", "verified": true, "helpfulness": "0/0", "author": "nevadasmith"}, {"rating": 4.0, "review": "Nice device, it's cool to be able to stream the internet from your phone / p.c..", "verified": true, "helpfulness": "0/0", "author": "Ace35 \"Aaron P\""}, {"rating": 5.0, "review": "I love Chromecast! I've had it for just over a year now and new updates keep making it even better to be used with various apps on my phone. It's web streaming is pretty awesome now too, though keep in mind everything is dependant on your wi-fi. I use it most with the following apps on my android smart phone: Netflix, HBO GO, Showtime Anytime, Movieplex Play,  Encore Play, Stars Play, and Real Player, which let's me cast downloaded content. Sadly, Amazon Instant Video does not yet have a cast feature, nor does Xfinity on demand or MAX GO. I'm hoping for updates soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'm still working on this to work.  I will figure it out and have heard good things about it.", "verified": true, "helpfulness": "0/0", "author": "DEM"}]