[{"rating": 1.0, "review": "This is one of those electronic gizmos that you get and you hook it up exactly like the directions say and it doesn't work. So you think, \"Hmmmm I must not have been paying attention.\" So you try it again and it doesn't work. After 30 minutes trying to hook it up using my laptop, I gave up.Then I got my iPhone out and it hooked up fine the 1st time. After it was hooked up there were only 2 apps I could run. Netflix and YouTube.  I already have those on my TV anyway and they run better from the TV. Netflix was a compressed picture and I couldn't get the sound to work and the same with YouTube.Summary, I will never use this. I will however plug it in from time to time to see if there are updates. Save your money.", "verified": true, "helpfulness": "2/4", "author": "Scott Taft"}, {"rating": 5.0, "review": "This works great.  It allows me to use my netbook to push the chrom tab to my tv so that everyone see that tab.  This alows me to go to tv website to push them to the tv.  I am even able to use roll20.net to play pathfinder with my Kids on the TV.", "verified": true, "helpfulness": "0/0", "author": "P. Muniz"}, {"rating": 1.0, "review": "Advertisements sure look like it will work with apple products -- but in reality, only youtube. A funky tech paperweight in my home.", "verified": true, "helpfulness": "6/9", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have enjoyed many movies thru the use of this little Chromecast HDMI Streaming Media Player and the HDMI Pigtail Switch.", "verified": true, "helpfulness": "0/0", "author": "klevans"}, {"rating": 3.0, "review": "Can't view photos and many other things on the TV. I have an iPhone and for now I can only use Netflix and YouTube. I already can get Netflix on the TV, so all this does for now, is YouTube. I guess with that, the $35 price is sort of justified and maybe somewhat overpriced!", "verified": true, "helpfulness": "0/0", "author": "Kashy"}, {"rating": 2.0, "review": "Using with an iPad, it's only really good for YouTube and Netflix. I'm sure they'll add more over time but it doesn't really offer anything that isn't included in any other streaming device. If you already have an Apple TV, Xbox or PS3 there is no need to purchase one of these.Also, there is a problem with the device where the reset button gets stuck. It's such a common problem that Google references it in their troubleshooting. Had this happen several times without even touching the device.", "verified": true, "helpfulness": "0/0", "author": "Mr. Furious \"Temperature rising...vision blurring...rage...taking...over\""}, {"rating": 5.0, "review": "By far the best (cost effective and quality) device to stream youtube and chrome browser. Its pretty fast and works flawless with all the devices connected to the home network. I hope they enhance the casting of the whole browser stream experience instead of casting specific tabs. It already has the \"cast entire screen\" which is in its experimental phase but would love to see the production version of it.", "verified": true, "helpfulness": "1/1", "author": "Yadu"}, {"rating": 3.0, "review": "Windows setup did not work at all on my Windows 8 laptop. Eventually \"not recommended\" method of manual setup through the browser only worked.Streaming capabilities are still limited. Chrome browser tab casting is good for static page only. Any animation not impressive at all.Let's see how soon we may have a better support and new features.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "Works as advertised, and I've used it to stream content from my computer.  With most TVs being 'smart TVs', this product may not be for everyone.  I've hooked it up to an older HDTV set and it looks a lot better than the standalone media player box, plus it doesn't need a separate plug to add to the clutter (as long as there's an available USB port nearby).  I gave it 4 stars since the design means one should think about where the HDMI port is on the TV.  If you only have a side HDMI port available the product will be visible sticking out from the side (not the cleanest of looks).  If your HDMI ports in the back are oriented that it would plug in horizontally instead of vertically, you would need to make sure there's enough clearance for the chromecast to reside (may be an issue for those mounting their TV on the wall).  Additionally, the fact you need a USB port to power it is another consideration since older TVs may lack one.  I hope the functionality continues to expand on this unit, as I've seen (and bought into) a lot of products that work great off the bat, but fizzle once support wanes.", "verified": true, "helpfulness": "1/1", "author": "TerpsFTW"}, {"rating": 5.0, "review": "Cheap and easy to use. It's actually cheaper than buying the HDMI cable for the phone. The install was relatively straight forward.", "verified": true, "helpfulness": "0/0", "author": "Zurg"}]