[{"rating": 5.0, "review": "I'm not a tech savvy reviewer, just a grandma who has wanted a device like this for my bedroom tv. It arrived, I opened, I hooked it up (2 minutes), installed the batteries (they worked), it updated software (8 minutes and I won't complain about software updates because the kindle fire hdx automatically updates it's software and has been improving since the day I got that).  Why did I decide to get this over the competition products? I have been super happy with all of Amazon's kindle products in the past, and I have had every one and I trust Amazon to stand behind their product.  I look forward to future software updates on this device, like I did Apple IPods in the growth of that product. I still have that iPod, but it's really just a \"walkman\" now for when I do my walks with the dogs.", "verified": true, "helpfulness": "207/229", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I have confirmed that the Optek Vista MCE USB Remote allows control/interaction with the FireTV Using a universal remote.  This is a $13 USB Device that you can buy on Amazon and then use to teach your Universal Remote how to control the FireTV.  It will not do Voice Search or the \"Options\" (3 lines) button; but you'll likely have your Fire Remote nearby and I think this makes a big improvement for those using a Universal Remote in their TV Room.", "verified": true, "helpfulness": "3/4", "author": "L. Brucker"}, {"rating": 2.0, "review": "Yes - this device has great specs and loads Netflix and Amazon videos almost instantly but then so does my several year old Roku 2. But - here is what they do not mention in their description and the reason I returned for a refund:1) USB port does not work - it is disabled and there is NO local media playback ability - sure they may add that later but then sell the device when it works. While they claim the device will support MP4, etc they apparently never tell you it is ONLY for streamed movies from their cloud storage or via PLEX (which by the way you have to pay $1 for reduced from $5 as of this review) which must host the videos on an HTPC (or a NAS) running a separate PLEX server app.2) There is no ability to increase local storage on the device for apps or games. If you intend to fill up the Fire TV with tons of channels and apps you are going to be in for a shock not just that the device will fill up quickly but most of the listed storage space is for the Android OS.3) Missing \"to be added later features\". Yes, trust us - we will add them later. Great - then I will think about reordering again later when it works as advertised. A safe kids mode with full parental controls was one of the reasons I picked this up - the current set up is worthless is oh so many ways but wait a month and they will turn that on....sure. Until then let me keep it in a box...no...I'll just send it back.4) Voice search works great - but ONLY works for searching Amazon. Netflix, EPIX and other devs have already said they do not intend to allow the use of the voice search function so what then is the point of a global search that is not global?5) The Fire TV interface is just god-awful and if you thought Windows 8 Metro was annoying wait until you try and navigate your way around this monstrosity. Forget anyone under the age of 10 being able to use the device by themselves without frustration.6) The Netflix interface is about 4 years old - seriously - it is the old VHS box style icon interface that the Roku/WD and even Netflix's web interface had years ago. While old school it is still viewable but half the screen disappears as you scroll through titles with the right half of the screen used to show you the details and synopsis of the movie so you can see only a few titles at a time while simply browsing. Also while in Netflix Kids mode there is an icon top dead center that allows crafty 4 year-olds to simply switch back to the primary Netflix account screen to view all the R rated content they want without a PIN - yeah....great design all around.This device has the ability to be pretty good but as of today it is sorely unfinished and rushed to market with just too many lose ends that need to be tied up. Wait a month or so before ordering or get just an Apple TV, Roku 3 or any other streaming device until they come out with Fire TV version 2.", "verified": true, "helpfulness": "18/27", "author": "That Guy Over There"}, {"rating": 1.0, "review": "I was really looking forward to using what was hyped as an amazing piece of entertainment equipment, but the actual experience falls short.Pros:+ User interface and underlying hardware is fast+ Form factor of the device and remote control is very sleek+ Plays games fairly well, especially for such a small box+ Quality of Amazon videos is very good+ Voice search works quite well+ The device came pre-configured for my Amazon account.  I just plugged it in, updated the software, and away I wentCons:- First and foremost, there is STILL no way to search for only free movies on Prime.- Amazon touts it's 40,000 Prime movies available, but good luck finding them.  There is no categorization by genre.  You are stuck surfing through dumb lists of movies, or using the search function, which almost never returns any Prime movies- Voice search works only on Amazon content.  You cannot use this to search within Netflix, for example- The Amazon FireTV box only comes with 8GB of memory for game and app storage, which is completely inadequate.  There are games available for download that consume almost 2GB for ONE GAME.  Good luck downloading a 1.76GB game, like the racing game featured in the list of top games.Clearly, Amazon is marketing this device as a way to push its video content.  In the help video that automatically plays the first time you use the device, it even offers you a 30 day Prime membership for free to try it out.  However, Amazon has no incentive to help you actually search for and find this free content.  It's clearly evident in the lack of ability to filter search results on free Prime content only.  This is my biggest beef with Amazon, by far.  I want a Netflix-like experience, where my Prime content is sorted by genre, and I can search for free movies only.  Now, if you want to pay for video rentals, by all means buy this device, because it works really well.  If you want it to access your Prime content only, stick to the Roku box you probably already have, because it works just as good.UPDATE:I called customer service, and talked to a guy about how I can search for and access my 40,000 Prime movies.  Well....YOU CAN'T!!!!  According to him, I can only find the Prime movies on the two lists on FireTV that say \"Recently added to Prime\" and \"Top Prime Movies\".  Those lists are 73 items, and 150 items, respectively.  THERE IS NO WAY TO SEARCH OR BROWSE FREE PRIME CONTENT ONLY.  The guy I talked to said this was a very common request for people.  OF COURSE IT IS.  I don't want to pay for video rentals if I just paid for a Prime membership to access free content.  AMAZON COMPLETELY FAILED.  I AM RETURNING THE FIRE TV.", "verified": true, "helpfulness": "2/137", "author": "Geronimo"}, {"rating": 4.0, "review": "I love this product! I can now stream my Amazon Prime content on my tv. Very easy set up, I'm often technically challenged, but this was super easy. The box came loaded with my account info which is really cool. Wish the voice search was integrated for apps but I'll survive. Well worth the expense!", "verified": true, "helpfulness": "3/3", "author": "Mary \"Mary\""}, {"rating": 4.0, "review": "I am not a Minecraft gamer but my kids are. I bought 2 controllers for one fire tv. Did not know that Minecraft PE is not capable of multiple players.I like the slim form, plex capable. My want and need is a sling player and this is complete. I also want a fire tv mount.Thanks", "verified": true, "helpfulness": "5/5", "author": "c.e.mit90"}, {"rating": 5.0, "review": "So far, a great product.  I'll fill you in on my observations shortly.I would like to say though, that I am truly dismayed with the negative reviewsthat have posted about the product so far.  Further, I found many of them baseless.Many negative comments seem to be from people who ordered it without researching it first,or, perhaps they just assumed that it would magically meet their every expectation.I observed a few comparisons to this device, and the Roku LT, and the Roku Streaming Stick.However, since neither of these less expensive models have USB or Ethernet connectivity,that is akin to comparing apples to oranges.One person went so far as to complain that it uses an AC adaptor for power.  What's up with that?Who knows.  What I do know is that the older I get, the more I find thatother people's thought-processes are just plain scary.  ;-)Anyway, on with the review -Note that these observations are entirely subjective.  Your mileage may vary.Cons first - after all, that is what everyone REALLY wants to hear about.1.)  Although I don't use a universal remote, the Fire TV is not compatible with them.  It uses Bluetooth to connect.  Because of this, infrared devices just won't work with it.2.)  How do you turn it off, or restart it?  It doesn't have an obvious way to power it down.  It does go into standby mode though, which is probably as close as you can get.  It doesn't seem to have a reboot function under system settings, either.3.)  Collects usage data, unless you turn it off in System Settings.  Most folks will probably not stumble across this.Pros -1.)  The tech-savvy should be able to do something with the available ADB access.  This may allow 3rd-party software to be installed on the unit.2.)  Remote control is simple, and easy to operate.  It is shaped in such a way that you can easily figure out \"which way is up\",  unlike a number of Sony's remote controls.3.)  The small, low-profile design easily fits just about anywhere.  I'm sure that some folks would disagree, but I prefer this design,  over having a plastic \"stick\" hanging off of the side of my TV.4.)  Menu access is quick, and convenient.  Streaming media loads and stars faster than some of my other devices.5.)  It works very well with my Plex Media Server; I didn't notice any delays, lags, or glitches  when using it to play media from my server.6.)  Setup is a breeze.  As soon as I connected it, and powered it up,  downloaded it's updates, restarted, and I was up-and-running in a matter of minutes.  A relatively short tutorial started playing immediately after the updates.  You can't cancel out of it, but it only lasts 2, possibly 3 minutes.  As with all things, some will find it helpful, and others will not.7.)  Some people reported having issues with the voice command portion of the remote.  I didn't experience any problems with it at all, and it accurately translated every thing I said.  Of course, I have a practically perfect Midwestern accent, which may have something to do with it.  ;-)I am still testing the device, so I may stop back with some updatesover the next few days.  But for now, the Fire TV has met my expectations.*** Update -The USB port will support wireless keyboards.What would be nice is to see an accessible Bluetooth menu,so that you can pair Bluetooth keyboards with the device.", "verified": true, "helpfulness": "8/9", "author": "Tim"}, {"rating": 4.0, "review": "I replaced a Apple TV with a Roku to get Amazon Prime, but having an older Lexicon digital A/V preamp, I was disappointed with the lack of a separate digital audio output.So when I saw that the Fire had one, I ordered it immediately.I am disapointed in this feature. The Dolby Digital Plus data is too new for my older unit to process, and lacking an analog audio output, I now have lost the Pro Logic as well. In this way, the Roku was better. My DISH satellite receiver delivers Dolby Digital through the same optical cable just fine, and yes, I enabled the optical digital port in settings.Perhaps a firmware upgrade by Amazon can fix this.Otherwise the unit is a joy. It is lickety split fast as advertised, has a better wifi receiver than the Apple or the Roku, and the voice search works as advertised.I guess I will keep it, but now grudgingly buy a newer A/V Preamp Processor.UPDATE:Regarding the Audio Connection Issue:The unit started producing digital sound, both on Netflix AND Amazon Prime movies, but only 48K Stereo encoded with Pro Logic. I can not get a 5.1 Dolby Digital signal. Why this didn't work the first time around, I am unable to explain. (Operator error no doubt, LOL).The outcome is that enabling Dolby Digital on the optical digital output on the FIRE and running an optical digital cable to my (NON HDMI equipped) A/V processor allows me to get good quality Pro Logic sound from my A/V preamp/processor, and still get audio to my TV via the HDMI cable. This set up allows us to watch TV without the surround system on when we want to.Regarding Use:This unit is a joy to use. It is wickedly quick and the voice search is remarkable. Picture and sound are quite good. The sound output can be revealing though on older poorly made or poorly remastered sound tracks.We are still getting used to the menu structure. Adding and enabling apps is pretty easy. We added ESPN which required proving you have access through a service provider, in our case DISH. The FIRE puts a code on the screen and a URL to go to. I used my iPad to go to the webpage where it links to a prompt to log in to DISH with username and password (which I already had used in the past). Less than a minute later, ESPN started working.One thing I  have not yet figured out. On the Roku, there was a PRIME INSTANT VIDEO section and you would not see the stuff that isn't free. The menu selections on the FIRE seem to mix PRIME and NON-PRIME together. The PRIME choices are marked as such.I consider this a good purchase, and we will be keeping it. The ROKU goes upstairs to the bedroom TV.", "verified": true, "helpfulness": "2/3", "author": "Dan Albertson"}, {"rating": 5.0, "review": "We decided to get a streaming device and had looked at all the ones on the market but, when we heard that Amazon was coming out with one we waited and we are glad we did. Hook up is fast and easy, just make sure you buy an HDMI cable if you don't already have one there is not one in the box. Understanding how to use it, easy. I love the voice command but, it only works on Amazon movies etc. the remote is also easy to use. Set up took a few minutes it had to download updated software then it was ready to go. Lots I mean lots of movie and tv choices. I was surprised there are a fair amount of game choices and I am sure more will be added.Okay, I know a lot if people are upset about no HBOGO for us it doesn't matter we already have HBO on our Directv. Since we are Amazon Prime members a lot of the movies and tv shows are free.So far we love it! Easy set up, Easy to use, Lots of choices, Fast and if you are an Amazon Prime Member this is the streaming device for you. I should mention also if you like music or videos there are plenty of good choices. Plus Netflix and channels like Hulu. With this we can cancel the movie channels on our Directv and save some money. So far we are very happy with our choice.", "verified": true, "helpfulness": "4/5", "author": "Wendy Balcer"}, {"rating": 4.0, "review": "Its great to see another product in the marketplace challenging the competition.  After investigation this product,is very sexy and seems to hold allot of horses. (fast is good)  Good initial selection of content, including ESPN which is only available via Apple and Roku streamers currently I believe.  But until the content is bolstered to really compare to the 1000+ channels available via Roku it doesn't quite cut it for me.  Just like Apple TV might be right for those heavily invested in Apple infrastructure, this product certainly would be a go for someone who uses amazon exclusively and utilizes a Kindle for integration.  Otherwise, for most people the Roku product line is still the way to go.  I also find it interesting that in the comparison they only list the Roku3.  There are less expensive Roku products that provide most that this box does for less, with much more content including HBO and TWC.  If you are a Time Warner Cable subscriber, until the TWC application is available this is not an option over the competing Roku products since a $50 Roku can replace your cable box, paying for itself in 2-3 months on rental fees!  Still a very nice entry into the market with lots of potential!!!", "verified": false, "helpfulness": "5/8", "author": "Rob Wolfe"}]