[{"rating": 5.0, "review": "Amazing Device it allows me access to my library at Amazon.It has available all the video services I can think of and more.It really could use a Web browser though.Love it.", "verified": true, "helpfulness": "1/1", "author": "Jimmy Lehmkuhl"}, {"rating": 4.0, "review": "The hardware works great, even the voice recognition.  It has yet to misunderstand me.  Apps that used voice search would be very good.  It needs VUDU really badly, in my opinion.  I am still considering the game controller, the games I see I can play on the kindle fire HDX so no reason for it...yet.  It is new so I have high hopes great apps will come.  All in all I gave it 4/5 stars because it is new and while the apps it has are for the most part good to great it needs more for me to give it 5/5.  That being said, I do love it and use it daily.  I may be swayed by the facts I have Netflix, Amazon Prime and Youtube + I cut the cable TV out of my life.", "verified": true, "helpfulness": "0/0", "author": "Slimjimjerry \"Jerry\""}, {"rating": 5.0, "review": "The Fire TV took our experience of streaming services like Amazon Prime and Netflix to a an entirely different level of ease and performance.  We got to these before using the \"apps\" in our smart TV, but this was a clumsy and slow interface despite it being built into the TV's nice bluetooth remote, complete with pullout QWERTY keyboard.There is even Windows 7 PC attached to the TV that we get a lot of use out of for toddler media...youtube, music, and such, but despite its performance and power, it is a pain to deal with a keyboard and mouse.  Also, the PC burns a minimum of 50W all the time unless you put it to sleep, which means tediously waking it up and putting to sleep, or letting it rack up the kWh at the marginal rate of $.35 per that applies out here in the People's Republic.The FireTV seems to run very cool for its small size, and seems to blink off on its own after shutting the TV and soundbar off, yet it comes back to life quasi-instantaneously ready to play.  I have not hooked up our handy killAWatt meter to it to see what it pulls when \"off\" or during various states of playback, but it can't be anything like the last few cable or uverse boxes do, 24/7, whether turned off or not.  The responsiveness of the FireTV is very nice all the time, not just when returning to life.  Anything streamed from Amazon starts and stops, pauses and unpauses just about instantaneously.  Netflix still goes through a loadbar and screen building exercise that is offputting enough that we tend to look for what we want to see on Prime first.As we have no antenna reception and chose to cut the cord on Uverse and Comcast TV bundles for a while, and maybe permanently, we added Hulu+ to fill in the gap, for watching recent network shows...However we have yet to try it, having fallen into watching in HD commercial free series from a few years ago off of Prime or Netflix.  If you don't need to know what happened on last nights episode of network show X as fodder for conversation, you can live this way weirdly relieved of being entirely culturally in synch.", "verified": true, "helpfulness": "1/1", "author": "Ditherer"}, {"rating": 5.0, "review": "I am pleasantly surprised by the rich content available on Amazon Prime and find this device a superior way to enjoy programing in full HD on the big screen tv. The voice search feature is impeccable, very accurate and saves the usual display & peck typing in a alphabetical search field. The controls are user friendly, simple, logical and precise when used from many vantage points in the room.  No complaints! This device has improved my enjoyment and choices for ad free, crystal clear, entertainment. I'm glad I have it!", "verified": true, "helpfulness": "0/0", "author": "Candace B."}, {"rating": 3.0, "review": "Easy setup, great user interfaces.Had sound issues, solved in-menu with the help desk and turning my tv off and on again!still cant play netflix.  netflix.com says \"we are having issues streaming with some devices\"  not a solution, and Amazon aslo does not know what the problem is..my review will go up to 5 stars when its fixed as Netflix is our main viewing, the HULU and Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Voracious Christian Reader"}, {"rating": 5.0, "review": "I'm happy that I purchased the Amazon Fire TV. It was easy to install, doesn't take up much space, and the remote range is so good that I was able to put it on a high shelf out of sight and it still worked. I like it so much I may purchase a second one for another room.", "verified": true, "helpfulness": "0/0", "author": "LadyLia"}, {"rating": 5.0, "review": "After having the FireTV for about a month now, I can confidently recommend this product for most people. Versus the current generation Apple TV, ChromeCast and Roku offerings, the FireTV is the best value due to it's access to a wide variety of content, build quality and advanced features. It's a device I have recommended to my (almost-elderly) parents & my (geeky) friends.Best things about the FireTV: - It is fast - unlike the Roku it does not lag and feels like a high quality product - Has Amazon Prime Video access- if you have prime membership, this is the best accessory you can buy. Lots of great content from Comedy Central and newer movies versus Netflix. - An AppStore with apps & games you actually want - Plex & Showtime AnyTime are the big difference makers IMO.  - If you have local video files on your network, Plex is the way to go. - Voice searchWorst things about the FireTV (which really aren't that bad): - Annoying/long intro video upon the first time you boot up - Larger power adapter versus Apple TV (Yes the little things count) - No HBOGO until late 2014 - Going to be a problem from the folks looking for their Game of Thrones fix this spring** - No chromecast/airplay like feature unless you have an amazon tablet**If you don't need HBOGO right now and don't have a bunch of apple products, stop reading this right now and buy this device. You won't regret it.** See below for ways around thisIf you are an advanced user and/or are on the fence this next section is for you.Before the FireTV, I had 3 Apple Tv 2's in my house that I used to access HBOGO, Hulu+, Netflix & my local media through the infuse application. I had tried Roku's, ChromeCast and other media boxes/home theater pc's and the Apple TV worked best for me. While this has served me well there are obvious drawbacks - lack of 1080p video, limited app selection, no games, etc.... Which led me to trying the FireTV.Because the FireTV is based on android, android apps can be side loaded on the device and many work fine. The steps below will outline how to get started side loading apps to your FireTV. You may want to have a usb keyboard and mouse handy - you'll need them to get a few things running. Any old usb keyboard/mouse you have lying around should work OK.(The following links provide the best directions I have come across during my time with the device and have worked for me and should work for you too, but no promises!)How to sideload applications to the FireTV:1. The first step in loading android apps is getting ADB set up on your machine can be done by following amazon's directions - developer.amazon.com/appsandservices/solutions/devices/fire-tv/docs/connecting-adb2. After that, you can go ahead and proceed with side loading applications, also by following amazon's directions -  developer.amazon.com/sdk/asb/app-install.html3. If you aren't comfortable with working with the command line, and are running windows, you can try this great GUI application to automatically side load applications.  - forum.xda-developers.com/showthread.php?t=2736740Once you are able to send android apps (.apk) files to the FireTV, I recommend:1. Installing MXPlayer to allow .MKV & .AVI video file playback:  sites.google.com/site/mxvpen/download2. If your network drive/computer doesn't support plex, try using ESFileExplorer to navigate to & play back video files - appsapk.com/es-file-explorer/3. AirReceiver which mimics the functionality of airplay on an appletv. Please note this only supports unencrypted video feeds. This is a paid app, buy @ play.google.com/store/apps/details?id=com.softmedia.receiver4. HBOGO android app can be installed and works rather well. It does require a mouse to navigate.5. XBMC - If you know what this, you will want it and yes it works. Download via xbmc.orgFor the cord cutters out there, I've tried installing Aereo & Slingbox with mixed results. Slingbox for tablets loads and opens ok. Using the mouse I was able to accept the terms & conditions and input my user info. Unfortunately it doesn't load the video stream. Other folks have had success apparently, so it may be just me. Aereo side loads & opens fine but I couldn't sign up for a trial as I am 1 town over from being in their current market area. I will update this review if I get any further with either.There are many more apps you may want to try so check out this comprehensive list of app functionality from the reddit.com/r/firetv folks  - docs.google.com/spreadsheets/d/1uD_6cesLVtHwsoWDE9jlKsV9FtlUbQ3KvDQp6N9gbHE/edit#gid=1337307432This list includes information on emulators & roms which I didn't include in this review due to their dubious legality.", "verified": true, "helpfulness": "357/394", "author": "Dave"}, {"rating": 4.0, "review": "Very satisfied with product and experience. Glad I got prime. Works great and add a new dimension to my tv watching.", "verified": true, "helpfulness": "0/0", "author": "JonG"}, {"rating": 1.0, "review": "If it's plugged into anything other than the TV directly there is no audio.  It is plugged into my receiver and I can't get any audio.  The support is terrible.", "verified": true, "helpfulness": "2/8", "author": "Jason Gilbert"}, {"rating": 4.0, "review": "If I'm reviewing just the devices it would be a five.... but as far as the prime services.... I dont like the way they organize seasons of TV shows. The apps available are still lacking.... I purchased mainly because of the deal w hbo", "verified": true, "helpfulness": "0/0", "author": "benjamin crawford"}]