[{"rating": 2.0, "review": "Piece of Boo Boo, doesn't work and never worked.", "verified": true, "helpfulness": "0/0", "author": "monique campbell"}, {"rating": 2.0, "review": "Stopped working after six months. No help from the manufacturer.  It's in the trash now.", "verified": true, "helpfulness": "0/0", "author": "Jimmy b"}, {"rating": 1.0, "review": "That figures... 4 days after the eligible period of return, this craps out on us. Worked fine for 33 days. Couldn't live without it actually and thought this was a steal compared to it's competitors. Nope. Just go to Target or Walmart and get the REAL deal. Chromecast is just a teaser to get you to buy Fire TV or one of their overpriced pads.", "verified": true, "helpfulness": "0/0", "author": "blah"}, {"rating": 5.0, "review": "Opens up a whole new world.", "verified": true, "helpfulness": "0/0", "author": "Gene A."}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "importacionesonline"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player is a great device to have.  It is very easy to set up.  Just plug it in and control it with the device of your choice.  I have set up the app on my iphone, computer and ipad and it works great on all three.  I have Amazon Prime and the streaming is simple to use.  When my grandchildren visit I can stream a movie for them in another room and everyone is happy.  I also have used the Google Chromecast with Netflix.  This device does what it says it does and you will not be disappointed in it's capabilities.", "verified": true, "helpfulness": "1/1", "author": "Gina"}, {"rating": 5.0, "review": "Best $30 I ever spent.", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 4.0, "review": "Couldn't get it to work with our ATT router for the longest time.  Disconnected it for several months.  After some Chromecast app updates, I tried it again and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Hall Of Record"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Don Sullivan"}, {"rating": 5.0, "review": "I love it! I like how the heart turns red when its full and green when its dead. Its so cute and very good loud sound to me when I connect it to my laptop and gives ultra clear sound and stands up on its own or lay it down to sleep while charging. There is a key holder included. I have to lower it sometimes because im afraid to blow the speakers. lol My friends came over and asked where did you get that? They went and each bought a few from this company as well as I did. :)", "verified": true, "helpfulness": "0/0", "author": "Jacquelyn"}]