[{"rating": 5.0, "review": "Nice product. sometimes can be a pain because it doesn't cast everything, like amazon prime, etc...but you can always cast your chrome browser from a laptop and view it that way. Just have to get around it, but overall, love the device and the functionality.", "verified": true, "helpfulness": "0/0", "author": "Ayesha Ghori"}, {"rating": 4.0, "review": "it works perfect if you just use it to play the videos on your TV from youtube. But if you want to cast the tab to the tv it works poor.", "verified": true, "helpfulness": "0/0", "author": "CK"}, {"rating": 4.0, "review": "I found difficulty trying to get Google Pay/Play to work on my iPad (IOS7), Netflicks no problem. No problems with either on W7 Laptop", "verified": true, "helpfulness": "0/0", "author": "Earthman"}, {"rating": 5.0, "review": "Very easy to stream! The visuals are crips and when you're on a good network, it's really a joy to have this device.", "verified": true, "helpfulness": "0/0", "author": "Victor"}, {"rating": 5.0, "review": "It was super easy to set up and has a decent range to the device you are using.  Occasionally there will be problems with loading a show, but I believe that is due to internet connectivity on my cell phone not the Chromecast.  But it!", "verified": true, "helpfulness": "0/0", "author": "Allison Sayre"}, {"rating": 1.0, "review": "Only words for Netflix and Youtube. Don't buy expecting to stream anything else from phone/laptop to TV. Just buy a wireless internet adapter for the smart TV if you have an older one that doesn't have a wireless adapter built in.", "verified": false, "helpfulness": "1/2", "author": "Robert Marcum IV"}, {"rating": 2.0, "review": "It is good when it connects.  But have had some trouble getting up and running and keeping it up and running.", "verified": true, "helpfulness": "0/0", "author": "Nana"}, {"rating": 3.0, "review": "Does not work with my D-Link dual band router, which may be the routers fault, but all my other devices connect so I have to ding Chromecast.My kids would love for it to cast games from their tablets. Seems like this is something that should have been supported at launch.", "verified": true, "helpfulness": "0/0", "author": "Buzz Terrier \"buzzterrier\""}, {"rating": 5.0, "review": "We love them. We use them all the time. We like the app compatibility. It is easy to use from the iPad.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I only wished all media forms were supported... hopefully in the future they will be.It's still a great addition in my growing wireless arsenal.", "verified": true, "helpfulness": "0/0", "author": "Jason F. Hall"}]