[{"rating": 1.0, "review": "I returned this product as I felt cheated. You can't play any desktop videos. You can only play the streaming videos.What really bothered me was that I couldn't use my extended desktop feature with this. When I use normal HDMI cable, I open Netflix in a a new window and drag it to the extended desktop screen that's connected to TV while I still could do my work on the laptop if I wanted to. Long HDMI cable comes at 5-5 dollars. When I pay 35 for something, it better have same features that a cable wire has", "verified": true, "helpfulness": "0/5", "author": "Sandy"}, {"rating": 5.0, "review": "nada mejor, un invento excepcional.. tnks google", "verified": true, "helpfulness": "0/1", "author": "Diego Farfán"}, {"rating": 1.0, "review": "Crap, I bought it to cast tabs and that's exactly what it sucks at!!!!", "verified": true, "helpfulness": "0/7", "author": "Bill"}, {"rating": 5.0, "review": "I read all the great reviews about chromecast online and decided to buy since google hasn't let me down yet...I'd have to say it is way better than i expected....The apps they have available work great and google keeps updating it so it keeps evolving and offering new options...Best bang for your buck!", "verified": true, "helpfulness": "0/0", "author": "Michael Kempf"}, {"rating": 3.0, "review": "I picked up a Chromecast to test it out for clients.  It's okay.  It's a great solution for people who want to stream things like Hulu or Netflix occasionally and don't want to spend very much.  The biggest thing to realize is that the Chromecast itself does not play content, it only receives it.  So in order to watch content you have to connect another device such as a computer, iPhone, Android etc. and stream it from your device to the Chromecast.  For everyday viewing I would find this annoying compared to an AppleTV or Roku where you can just sit down, turn on the TV and navigate to what you want to watch.", "verified": true, "helpfulness": "1/1", "author": "Pharaohman"}, {"rating": 5.0, "review": "Love it--simple to install. If you have Netflix, it's just so easy to cast a movie / tv show up to your TV. And for music, I cast my Spotify browser (wish Spotify itself was compatible...) now if only Amazon Prime worked with the Chromecast...", "verified": true, "helpfulness": "1/1", "author": "Kaitlin"}, {"rating": 5.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cesar T."}, {"rating": 5.0, "review": "Excellent!! I watch Netflex movies with no problem!", "verified": true, "helpfulness": "0/0", "author": "margiemr"}, {"rating": 4.0, "review": "Works well... better than the 1st generation roku box we have.", "verified": true, "helpfulness": "0/0", "author": "silence dogood"}]