[{"rating": 5.0, "review": "I love this!  I am thinking of getting them for every room!  Much better than Roku or any other one!", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 4.0, "review": "I purchased the Amazon Fire TV so I could watch movies and tv shows that I had missed and so far we are enjoying the different programs.  It took a little time to get it hooked up because I have an older TV and did not understand what I needed to do.  Had my grandson come over and it did not take him long to get it going for me.", "verified": true, "helpfulness": "0/0", "author": "Johnnie Mae Roberts"}, {"rating": 5.0, "review": "As soon as the Dish TV promotion I have expires, we are going to go back to just \"over the air\" for our local TV.  With the combination of Amazon Fire and Amazon Prime membership, we are covered with more quality TV than we can watch!", "verified": true, "helpfulness": "0/0", "author": "Greg Gustafson"}, {"rating": 5.0, "review": "Very easy to set up and the performance is really good, I highly recommend this product to anyone.Thanks for a great product", "verified": true, "helpfulness": "0/0", "author": "Dan Smith"}, {"rating": 4.0, "review": "Like the technology but wish I didn't have to pay for additional content outside of season one on most shows.  Also, Prime logo in the corner of offerings should be larger, letting users know what content is available with Prime subscription.", "verified": true, "helpfulness": "0/0", "author": "John T De Vries"}, {"rating": 4.0, "review": "I love the unit, it is small and powerful! The biggest downfall to me is it needs and on and off button either on the remote or on the box, it takes up to three to five minutes to turn off after you switch back to regular tv.  No problem the light just continues to flash then goes off.However I did install a HDMI switch and it works great. Now I can  use my Blue Ray Player and Fire TV with no problem! I do like the choices on the Fire TV, I think Netflix is clearer , I am a Prime Member also. That give you more choices on video too. I would recommend this to anyone who wants to have more choices and a very clear picture.", "verified": true, "helpfulness": "0/0", "author": "Steven Richardson"}, {"rating": 3.0, "review": "The voice search feature is nice.  However, it only allows you to stream hulu if you have a paid subscription to it.  I can stream hulu from my computer and use my tv as a second screen.  Why doesnt this allow you to do that?  A lot of the features are cool, but not executed as well as they could be.  The unit is small and easy to install which is a plus.  It hasnt frozen while streaming yet and the image quality and speed is far superior to netflix.  Netflix froze all the time in my house for the short period when we had it.  I was never able to watch anything without that happening.  The amazon prime library is getting a lot better and there are a lot of good options to watch for free.  However, this has a long way to go before it is a viable replacement to cable/FIOS/Direct TV.", "verified": true, "helpfulness": "0/0", "author": "Shelly8258"}, {"rating": 3.0, "review": "I honestly think this little machine is awesome but I can't honestly give it more than 3 stars only for the fact that both of my Fire TV's keep giving me the low space message. The 8 GB Hard Drive is just not big enough. Amazon needs to upgrade the firmware and add external USB HDD support. I would love to buy and have all 3 Grand Theft Auto games but I can only fit one of them because of no external HDD support. I don't even have many apps on it, only about 5 total that take up almost the entire hard drive! Come on Amazon, get with the times and add extrnal HDD support ASAP.As far as everything else on the Fire TV, I give it 5 stars, it's fast, looks great streaming everything, and runs very smoothly. I love everything about it except the storage problem.I will update my review to 5 stars once we get external HDD support through the USB input.", "verified": true, "helpfulness": "2/2", "author": "CHUMP"}, {"rating": 3.0, "review": "I like that I now have access to sooo many tv shows and movies. But the parental controls are lacking there aren't any gradations. It's either you have it or you don't and I don't like that.  I would love to be able to set it for non-prime shows or rated R programs so that my kids cannot make unauthorized purchases or watch in-appropriate shows.Also I feel like more categorization is needed of their programming. Like Comedy, Horror, Drama etc. and also a Prime Only area where nothing has to be bought.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this is an amazing piece of modern equiptment Now I\"am happy with my living room. you guys just moved up in TV history.", "verified": true, "helpfulness": "0/0", "author": "santiago pena"}]