[{"rating": 4.0, "review": "I have the Chromecast, Roku 3, WD live, 360, and PS3.  Needless to say they each have there positives and flaws. The chromecast is nice because of it portability. However, the app selection are limited.  I was mainly using it it for HBOgo untii Prime add the shows.  Comcast does not allow Roku access to HBOgo, but they do on the Chromecast. I have  not  tried all the other apps, so cannot comment on them.  Hbogo has frozen on my phone Note 3 while it is streaming to the Chromecas.  The movie/show will play just fine except if I stop it. Then I have to go through my phone apps again. The nice thing is it will pick up where it left off.  As to the picture, it is great.  For the price, it is definitely worth it.  I would recommend that when you use it, you keep  your phone/tablet on the charger.If I had to  recommend a product for just streaming netflix, amazon, etc... I would recommend the Chromecast over the Roku 3 based on price alone.  However, I do use my Roku 3 more, because I had  it first and because of  the remote.  If I did not get my Roku 3 for next to nothing, I would  be using the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Johnnnn"}, {"rating": 5.0, "review": "It's about a week under 6 months since I got the Chromecast and I love this thing. I had just gotten a new 60\" TV and a PS4 but that left plenty of room for this little miracle in my tech arsenal. My PS4 does wonders on that new TV, but I still had a bedroom TV that had no cable and no internet streaming services. Call it a first world problem but in my case I just had to solve it. For the price, this device is a steal. When I ordered, it was still a little lacking in terms of the number of apps that supported it. Netflix was of course my main priority and it was present (I believe) from day one. Since then a great deal of apps have been updated with Chromecast support and that library grows larger day by day. Pandora, Netflix, Hulu, and even HBO GO. Newly added apps are Deezer and PBS Kids.You plug the main piece into the HDMI input on your TV and attach the included USB cable to it. If your TV has a USB port, you can sometimes use that to power the Chromecast, but it's got a long enough cord that you can easily use the adapter to plug it into an outlet just like a phone charger. You then tune to that input on your TV and you've got yourself practically the whole internet.It connects to your WIFI network, and you essentially use your desktop or laptop computer, Android (like my phone or tablet), or iOS (like my girlfriend's iPhone) device as the remote. Once you \"cast\" the content to the Chromecast though, it can be hands-off. If you turn the WIFI off on the phone that started the cast (or leave your house entirely), for example, the stream continues. The Chromecast has its own internet connection. The beauty of this is that multiple people can control the device from separate remotes.  It's even easy to move the Chromecast to a different TV - I traveled with it to friends' places with it and used it there. It's a simple case of hooking it up to a new WIFI network.The Chromecast WILL play local content as well, not just internet streaming services. There are various ways of doing this I won't get into, with Google Chrome itself as well as third-party apps on Android that make it very easy.If you're looking for something to \"mirror\" your mobile or desktop device's screen, in general you'll want to look elsewhere (like the Miracast). There are emerging plugins and uses of the Chromecast that allow for this capability but it isn't a stock feature.EDIT: The Chromecast just became *that* much better, because now you CAN mirror your Android screen to the Chromecast - and it's built in.", "verified": false, "helpfulness": "0/0", "author": "Bo Lingen"}, {"rating": 5.0, "review": "Just get it. It works really well and makes watching virtually anything from your computer a breeze. Well done, Google.", "verified": true, "helpfulness": "0/0", "author": "Todd Beard"}, {"rating": 5.0, "review": "Superior product, everyone should own one. I will mention this product to all whom I know.Thanks, W. A. Herman", "verified": true, "helpfulness": "0/0", "author": "William A. Herman"}, {"rating": 4.0, "review": "I have been really enjoying chromecast, and feel it was worth every penny. Casted videos have great quality, it is so easy.", "verified": true, "helpfulness": "0/0", "author": "Rosa Jimenez"}, {"rating": 5.0, "review": "This is a great set top box in a flash drive format. I use it for HBO GO since my smart TV does not include it. But you can stream Chrome tabs to it as well (and Netflix, Youtube, etc.). Just nicely done, works and easy to install.", "verified": false, "helpfulness": "0/0", "author": "PoopScoopGuy \"Chuck\""}, {"rating": 5.0, "review": "love casting from my droid to the tv!!!! great deal can watch so many more shows through you tube and online.", "verified": true, "helpfulness": "0/0", "author": "making it in mass \"hollymass\""}, {"rating": 5.0, "review": "It does exactly what I expected it to do and for such a low price! I only wish there was a way to stream Amazon Prime Instant Video (hint, hint, nudge, nudge).", "verified": true, "helpfulness": "1/1", "author": "Angela Vish"}, {"rating": 5.0, "review": "I thought that this gadget was too good to be true, but I was sooo wrong.  I've been using it for 6  months now with no problems.  I can display Netflix and Youtube videos with no effort at all.  Installation on my Chromebook and my son's Microsoft PC was quick and painless.", "verified": true, "helpfulness": "0/0", "author": "margi_all_music_fan"}, {"rating": 4.0, "review": "I have been wanting a device like this one for years.  I have smart TVs in the livingroom and bedroom, but have never gotten around to wiring the ethernet cables.  I live in a very old house, so going under it is scary and dangerous, especially at my age.  Wiring through the attic would be difficult due to the layout of the house.  I was to the point of considering running the cables outside where they would be slightly visible.Happily Google came to my assistance and solved two of my problems with this one device.  I can now view my recorded movie files and Netflix, etc.  in the bedroom and use the smaller of our Samsung Tab 3 tablets as a remote.  In the bedroom before, I had to turn a light on to see some of the more complex remote operations and the remote on that particular TV is the type that if you punch a wrong button to pause or restart, it goes to live tv and you lose your place on the recording on the USB.  I doubt many people watch movies, etc from a USB stick, but I do, because I live in a very remote area and it's a miracle I even get live tv... ah well.  Anyhow, the Tab 3 makes its own light so that problem is solved as wellBut with the Tab 3, the Videostream app and the Chromecast dongle, I can watch movie files direct from my PC in 720p without bothering anyone else in the family who wants to use the internet.  Of course it does use the internet if I want to watch Netflix or its clones, so with only a 6Mb/s service some time sharing has to be done.Other members of the family that already bought Chromecast dongles report that it works fine for HBO GO, but not for Amazon or Dish Anywhere or Xfinity.  I'm sure one day those will be worked out but I don't use them anyway.", "verified": true, "helpfulness": "0/0", "author": "Edward Scott \"ewscott\""}]