[{"rating": 5.0, "review": "Almost perfect. The iPad does work as a remote control, but is not as easy to start and stop playing a video as Chrome makes it sound. But it all does work.", "verified": true, "helpfulness": "0/0", "author": "pcman \"digital junkie\""}, {"rating": 5.0, "review": "Works like a charm..easy to set up..had it working in just a few minutes...video is perfect!!..fun product..just needs more content..", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Some minor glitches don't outweigh the benefit of this product, especially with a $35 price tag. Definitely recommend this one", "verified": true, "helpfulness": "0/0", "author": "Kristi"}, {"rating": 5.0, "review": "You can't get any better than this! anywhere! I have apple TV and its not anywhere near as easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 4.0, "review": "So, we bought this, as we have been without cable for over a year. We use Nexflix via gaming consoles, but, that is only on one TV. I bought this, as a solution to this issue. The device is dead simple to use. The controls on you phone, tablet, or laptop, are rudimentary: play, pause, rewind 10 minutes, or stop. Thats it. I have heard rumors of someone making an app more like a traditional controller, and that would be great. But, as to this device, it works quite well!", "verified": true, "helpfulness": "1/1", "author": "W. Reed"}, {"rating": 4.0, "review": "This is a neat device.  I have netflix on my 360 and use that primarily before, but after getting this I find I enjoy using chromecast from my phone.  Also I watch a lot more youtube videos with this, Since there is no easy interface for youtube on my other devices I use this a lot.  Really good quality.The only things I have against it are that you have to go to each app to access the apps.  I find there should be a more unified interface that you can access on the phone that mirrors a chromecast interface, similar to (I know I just have to say it) apple tv.  If and when they come out iwth more apps for it, I don't want to have to download a bunch of different apps to access content.Also it could be speedier.  I have a nice home internet connection but sometimes there is drastic delay between my phone and the tv.Other than that is is a device that has a wonderful price, and a lot of potential.", "verified": true, "helpfulness": "0/0", "author": "Daniel Pritchett \"indigo\""}, {"rating": 5.0, "review": "I found these products very informative.  the product lived up to its advertised purpose and the cost was very affordable.", "verified": true, "helpfulness": "0/0", "author": "Vincent Butler"}, {"rating": 1.0, "review": "If you do not have Comcast onternet connectivity, do not buy this product.  I burned $35 on this for nothing.  Very unhappy with it.", "verified": true, "helpfulness": "1/9", "author": "Rocky Phillips"}, {"rating": 5.0, "review": "Works perfectly, but only work with YouTube and Netflix.  The part I love is now I can watch YouTube on my big TV set.", "verified": true, "helpfulness": "0/0", "author": "Chun Wong"}, {"rating": 3.0, "review": "Seamless streaming of YouTube and Netflix.  Initially worked great in streaming HBO GO, but a few weeks in the video started to get choppy (on a 25 mbps connection).  Google still has some work to do on this but for $35 it's an easy buy, no regrets.", "verified": true, "helpfulness": "0/0", "author": "Just Joe"}]