[{"rating": 2.0, "review": "It's wonderful when it works.  But it doesn't stay connected to my Internet router.  I have to unplug & reboot the router several times a day.Chromecast support gave me a list of things to check on the settings on my router.  So, now I'm going to caller the router manufacturer and they said they'd help me check all of the settings.So, it's not as good as I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "jeffwillet"}, {"rating": 5.0, "review": "I read about this in the paper, only to find out it was not available in Canada.....So I ordered one in the States. It works amazingly well. I ended up purchasing 10 more and gave them away as Christmas gifts....No wires, streams movies, Netflix. websites and  I bet a bunch more that I havn't even tried", "verified": true, "helpfulness": "0/0", "author": "Sabine Nassar"}, {"rating": 5.0, "review": "This has completely replaced my home theater PC.  If you utilize this properly you can completely replace cable.  I recommend you search Youtube for tips on using this to its full potential.Now that Google has opened Chromecast to development I think things will only get better for Chromecast owners.Do some research, but the Netflix, Youtube, and Pandora capabilities alone make this a smart buy.  Buy it!", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 4.0, "review": "Great service and fast delivery. I like the idea of streaming bit still lacks lots of features and applications. Google says more is coming. I like songza with all the music you can listen. Looking forward to see how it will develops.", "verified": true, "helpfulness": "0/0", "author": "AKF12"}, {"rating": 5.0, "review": "Not really. But the Samsung BluRay player I own sort of killed its built in wifi and it doesn't work the same connected to an ethernet cable. This works fine. It takes about 15 seconds (or less) for the picture to come in 100% clear. You Tube and Netflix are a dream. Casting web is a bit wonky, but worth it sometimes. I've notice that picture quality is washed out/bright when I cast from a web page rather than cast it from Netflix or YouTube's, built in feature.", "verified": true, "helpfulness": "0/0", "author": "Jon Loftus"}, {"rating": 5.0, "review": "I have bought 3 and they all work just as described. Would buy again. Easy to use and very convenient.", "verified": true, "helpfulness": "0/0", "author": "M. P. Fredrick"}, {"rating": 4.0, "review": "I have given 6 of these to family members and have one myself. It works extremely well. Unfortunately the progress to date in expanding content compatible with Chromecast is disappointing (though at its price point, it's already worth the investment. My main area of impatience is that Chrome for Android does not support it (although Chrome for computers does). Once it works with Chrome for Android, I will give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Nicholas R. Lefevre \"DC Native\""}, {"rating": 5.0, "review": "This is an excellent product that makes life easier for video and movies from your phone or tablet, very practical and easy to install and use, recommended a very good price.", "verified": true, "helpfulness": "0/0", "author": "UN MES POR UNA CAMISETA"}, {"rating": 4.0, "review": "I like my Google Chrome, it is awesome to watch Amazon Prime and HBO Go, but I wish I could play dvds on my computer and stream them on my TV.  Other than that, I would really do love it, simple to use and install.", "verified": true, "helpfulness": "0/0", "author": "Julie E Mero"}, {"rating": 5.0, "review": "This is a great product, one that really enhances the value of having a TV in the house.  Super small (just a touch larger than a USB flash drive) it plugs into the back of the TV and it is indeed super easy to put content from my phone or computer up on the screen.  I actually use it all the time and find it to be one of the few electronic add ons/ gadgets that really is GREAT!", "verified": true, "helpfulness": "0/0", "author": "Maxwell Kraft"}]