[{"rating": 4.0, "review": "Very cool and cheap. Sadly it does not work with a windows phone (that's why i`m giving it 4 stars)", "verified": true, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 3.0, "review": "I was given this device as a gift for Christmas. This is NOT an easy device to set up for those of us that don't have all the latest tech in our homes. You may find that the ONLY devise you have that will be compatible with Chromecast is your cell phone. Do you really want to be tethered to your cell phone to watch Netflix or other streaming media?This is definitely the bleeding edge of technology. Decide before you buy it how much you're willing to bleed.Update 2014-01-08I have now installed the device successfully, first using my Android Cell phone and then using a Samsung tablet. The Netflix picture is very good and much better than the Roku streaming player I used before. Pandora works well using the tablet to control it.So, my conclusion at this point is that the Chromecast is worth the price and have increased my rating from 1 to 3 stars.You should still be aware that the device you intend to use to control it must, itself, be connected to the internet via wi-fi (my main computer is plugged directly to the router by cable and therefor does not qualify). If the device is a Windows devise, it must be running Windows 7 or later. (My notebook computer has Wi-fi but runs XP, so it doesn't work).", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer \"charleytangofoxtrot\""}, {"rating": 5.0, "review": "Very useful device, works well with streaming.. able to stream you tube videos to TV. Wish it had more apps ..", "verified": true, "helpfulness": "0/0", "author": "Girish Hegde"}, {"rating": 4.0, "review": "The Chromecast device is an excellent way to stream Netflix and Pandora to your TV (I use it through my home theater receiver to get surround sound for Netflix movie and it works great), although if you want to cast a tab in the Chrome browser from your computer, be aware that there may be some degradation in video quality and/or lagging.  This is especially true for streaming videos from the internet, through your laptop, and then to Chromecast.Bottom line: the apps that are compatible with Chromecast work great, and more apps are becoming available for this device as time goes on, but if you're looking for a device to stream truly anything you might want to look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Evan"}, {"rating": 4.0, "review": "The \"get started\" instructions for the Chromecast are not included with the device; you can only get instructions online. The instructions were intended to walk us through the set up but were not particularly clear, often using diagrams to indicate how to connect items. Unfortunately, those diagrams were not always definitive and we had to search the \"help\" sections to answer specific questions. Also, understanding how different media connects to our TV via the Chromecast is not clear. This required further investigation and we still have not determined how to broadcast certain types of media to our TV. This is a bit frustrating and the reason for the 4-star rating.Once we got it to work, however, the picture was clear and fairly responsive. We were able to broadcast from a cell phone, iPad and laptop without difficulty. Still have some kinks to work out with different types of media but, otherwise, this is a great little device. Make the instructions easier to follow and this would be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Mom to 4"}, {"rating": 5.0, "review": "This was inexpensive enough that I wanted to check it out even though we already have Apple TVs, a Roku, and TiVos. It's FANTASTIC for YouTube videos. I'm not going to bother with it for Netflix, at least at home, because we have so many other devices that stream Netflix already.It doesn't use a remote. Instead, you cast content to it from a PC, tablet, or smartphone. I've used it with my PC and my iPad. The iPad experience is a little better because it lets you create a queue of videos to show on your TV. I'm not sure why I can't do that from the Chrome browser on my PC. I haven't tried using it with an Android device or any kind of smartphone.I connected it via our Yamaha receiver, and it works great. In fact, the Dolby Digital Plus sound quality is one of the attributes that makes it superior to other methods of streaming YouTube music videos. I'm planning to make a music-video playlist for my next party, for background music.It occurs to me that I might use the Chromecast for Netflix while traveling. It's smaller than other streaming devices, and doesn't require an HTML cable (though it includes a short one for situations where tight space prevents plugging the Chromecast directly into the TV or receiver) or remote, so it would take up less space in luggage.", "verified": false, "helpfulness": "0/0", "author": "jimstoic"}, {"rating": 4.0, "review": "Easy to set up, need good bandwidth to stream well.  Software is still a work in progress, beta support for pushing you pc sceen to the flat screen.", "verified": true, "helpfulness": "0/0", "author": "scott d webster"}, {"rating": 5.0, "review": "This product wouldve gotten only 3 stars before the updates but now is very well supported with hbo go and beyondpod compatability.  Its a shame I gave it to my sister a week before it was updated. Very happy with my foku 3 tho", "verified": true, "helpfulness": "0/0", "author": "floiran pagan"}, {"rating": 5.0, "review": "I bought it to  give it as a birthday present to a friend of mine. He says that it is a very good device because is giving him a lot of enjoyment with his TV.", "verified": true, "helpfulness": "0/0", "author": "Enzo"}, {"rating": 5.0, "review": "It does everything I wanted it for.  Only problem I had was the wireless signal receive strength... seemed a bit weak, but a small adjustment of my AP and all is good.", "verified": true, "helpfulness": "0/0", "author": "Josh Baumann"}]