[{"rating": 5.0, "review": "The Chromecast is the missing link of my media viewing experience. I can kick off movies from my Nexus 7, laptop or phone, it was super easy to setup and looks amazing. I fully plan to get another for my bedroom!", "verified": true, "helpfulness": "0/1", "author": "Zac A"}, {"rating": 1.0, "review": "Done. I wanted this for exactly one thing my Roku won't do, streaming webpage video to my TV. Sometimes it works... sometimes. More often it sporadically, increasingly freezes. The desktop Chrome browser app complains about network performance issues, or not, usually there's no message at all, when my other devices consistently show 5-12mbps at the site of the device. Forget this.", "verified": true, "helpfulness": "46/60", "author": "Marston"}, {"rating": 5.0, "review": "This small device is pretty easy to install and also provide HD videos. Hope more app can cast on HDTV. Strongly recommend", "verified": true, "helpfulness": "0/1", "author": "JING GUO"}, {"rating": 2.0, "review": "The device does not support 5ghz channels. Jesus.The device sometimes allows you to connect, other times it does not. It is simply unstable.It only provides 720p video so you should be aware that it is not an alternative to devices such as the WDTV live, rather it is useful for showing your laptop or tablet's screen on the TV, and to stream music, etc.I bought it to stream music through Google Play as I knew it was deficient as a video player prior to purchase. Trying to use it for just that purpose, I unfortunately have to make about 10 connection attempts each time before it is able to work. And then it will occasionally disconnect, forcing me to repeat the process.It seems to have a horrible wireless card, which is a shame because the device is otherwise pure genius. It is very useful when it is working.", "verified": true, "helpfulness": "1/2", "author": "Brian"}, {"rating": 1.0, "review": "Very disappointed.  Bought this only to find out that it doesn't work with the Motorola RAZR Maxx even though it is an android,or windows Xp.  Amazon needs to find out and publish what exact systems their products work with before selling them.  Will be returning this.  Its worthless to me.  Wish it wasn't.", "verified": true, "helpfulness": "3/7", "author": "Russ Baker"}, {"rating": 3.0, "review": "Chromecast is a brilliant concept but lacks the ability to \"cast\" most animated web content. You start Google Chrome (with the Chromecast extension enabled) and there is no problem in getting web pages to display on the television as long as the content is \"static.\" web pages that have various type of imagery available such as .pdf, and most video animated formats such as weather in motion, film clips of news events, movies, etc. do NOT display. Only U-Tube and Netflix display properly. Amazon movies and  Amazn TV do not work. Until Chromcast is better able to \"cast\" the web I would give it a 3 star rating.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I've been using Chromecast for a couple of weeks now with mixed results. For example, \"casting\" a web page containing video of our pastor's sermon from a week ago resulted in stuttering video and audio and dropped \"casts\" so many times today that we gave up and just watched it on the laptop.On the other hand, using the Chromecast button to watch TV episodes via Netflix and miscellaneous videos via YouTube has been quite successful. So we're still making up our minds whether this gadget will have a permanent place in our TV watching.We also will need to have our Harmony remote reprogrammed so we can quickly navigate to HDMI 2. Right now that involves switching to the \"laptop/PC\" preprogrammed setting on the Harmony, then finding the separate TV remote in order to select HDMI 2. So for us, being technologically un-savvy when it comes to Harmony programming, that will be an extra expense, since it's annoying to keep that separate TV remote around.It's kind of annoying to have a separate power cord hanging down the front of our entertainment center. There's no way to move the entertainment center away from the wall to slip the cord behind (the thing weighs several hundred pounds). I know, small potatoes when it comes to complaints! Overall, for $35, it seems like a good value for the money, as long as we keep the Netflix membership.Speaking of Netflix membership, I was under the impression when I ordered the Chromecast that it came with 3 months of free Netflix membership. I was supposed to get a confirmation email along with the \"your order has shipped!\" email. It never came. So I called Amazon.com today and, after 35 minutes on the phone with a customer service rep, was informed that I had missed the deadline for that promotion by four days. Yet it was still being advertised in various places long after. Irritating, but my own fault for not reading the fine print. Buyer beware!UPDATE: I brought my Chromecast to a Hilton hotel in Denver, CO, and plugged it into the back of the LG TV in HDMI 1. I then spent half an hour on the phone with the hotel chain's Internet tech support, trying to get the Chromecast and my laptop to recognize each other. But because you have to jump through some hoops when you log on to the hotel's wi-fi, and those hoops can't be jumped through by the Chromecast, there was no way to get the Chromecast and the laptop to be on the same wavelength, so to speak. We got them both online, but one couldn't see the other because tech support had to manually get the Chromecast online using its MAC ID (which has nothing to do with being on either a MAC or a PC, I found out). So don't expect to use your Chromecast in hotel TVs, unless you're using a wi-fi network that demands absolutely nothing in the way of a browser login.", "verified": true, "helpfulness": "0/1", "author": "J. Mertes \"AZShopaholic\""}, {"rating": 2.0, "review": "Has your computer ever fallen off your WiFi network? Have you ever experienced slowdowns with file transfers over WiFi? Have you ever tried using a game console over WiFi, given up and switched to a wired connection? Have you ever lived in a densely populated area, used a WiFi scanner and realized that there are dozens of other wireless networks in your neighborhood, all interfering with each other?On paper it's a decent idea: A little stick that you plug into your TV and then wirelessly throw content to it from a computer, phone or tablet. If you live in the middle of nowhere, have no WiFi interference and a perfect WiFi signal in your living room, you'll probably love Chromecast. But if any of the WiFi problems above sound familiar, you're going to have a bad time with Chromecast.For most of us, WiFi is unreliable for streaming hours of content and this device does not handle network connectivity issues well. It will sometimes stop playing after a couple of minutes, or the controls on your phone might lose their connection (so you can't stop or pause the video that's still playing.) Until there's a model that can use a wired network connection for streaming (this thing has a USB port on the back, so it *could* support a wired upgrade if Google made one), and the casting apps more gracefully recover from any errors - Chromecast is very difficult to recommend.", "verified": false, "helpfulness": "3/4", "author": "Chris \"Chris\""}, {"rating": 5.0, "review": "There are increasing numbers of options when it comes to casting computer content to your TV, and many of them are good, but most of them are good in different ways and/or for different reasons.  Chromecast is one of those products that is great due to ease of use and price, particularly for those who benefitted from the 3 months of netflix.  But even without the free netflix, it's an inexpensive way to get content from your computer to your TV.  No, it's not terribly well supported at this point, but it has a LOT of room for growth (and support is claimed to be coming from many content providers), and at this price, there is really no barrier to entry.  It's simple to setup, and quality is great when using supported media streams.  Quality isn't so great in some of the current hacky/beta solutions like screen casting from chrome, but improvements are coming.Right now, it's a Netflix caster and kind of a toy, but it's a cheap one, and one which has some very incredible potential as it develops.  Being able to cast web views alone will be worth it once they get the quality/consistency up a bit with software patches.I use other streamers for most of my local content right now (Roku, PS4, XBMC and/or Plex depending on the mood/room/content/etc), but I can see Chrome covering much of the ground that these others cover once the API opens up.  It's a pretty easy buy \"recommend\" for anyone interested in technology.", "verified": true, "helpfulness": "0/1", "author": "P. Jones"}, {"rating": 5.0, "review": "Ive been streaming media on my iPad and iPhone. So to make use of my TV I opted to get the chromecast over the more expensive options. I have been extremely pleased with the HD quality video and the ease of use.Set up was quite easy. It plugs into your HDMI on your TV and powers throughy a USB on the TV or the supplied power adapter. You go to the setup online amd it will walk you through the setup on your wifi network and you will be off and running.It took a bit of getting used to using the iPad or iPhone to control what I'm watching but overall its simple to use and the best bang for the buck.", "verified": false, "helpfulness": "0/3", "author": "K. P. Lelonis \"chia_mnky\""}]