[{"rating": 5.0, "review": "wonderful", "verified": true, "helpfulness": "0/0", "author": "Valmir Ferreira da Cruz"}, {"rating": 2.0, "review": "I don't care for the fact the interface is the device you are using. I like apple TV because it comes with its own interface. As a result, I never use my chromecast.", "verified": true, "helpfulness": "0/0", "author": "M. Cossin"}, {"rating": 5.0, "review": "Ecxelent!!!", "verified": true, "helpfulness": "0/0", "author": "silvia noya"}, {"rating": 5.0, "review": "Great little device for the price.  We use it to stream Netflix from our tablet and it works great.  It would be nice to have a remote control and control it directly on the tv without a second device (Roku?) but for the price it's hard to beat this gadget.", "verified": true, "helpfulness": "0/0", "author": "chris price"}, {"rating": 3.0, "review": "sometimes it doesn't cast to the TV.  Then when you unplug to reset you have to reconfigure it on your phone.  not happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Daniel Butera"}, {"rating": 1.0, "review": "Video cuts in and out. Laggy and choppy video when it's actually working. Audio also randomly cuts out", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 4.0, "review": "Really like this little add-on. It works reliably and makes viewing computer videos so easy. Now I want one that projects whatever is on my screen including spreadsheets or word documents!  :)", "verified": true, "helpfulness": "0/0", "author": "Terrie"}, {"rating": 5.0, "review": "I absolutely love using this. It is easy to setup and it is very easy to use. I mainly use this to cast Pandora and Netflix onto the TV. I cast Pandora when we have a party or when I am cooking or cleaning. I love being able to watch Netflix on the TV now instead of just the computer of my iPhone. It makes it great for the whole family. Also, I love the backdrop when you are casting nothing because it shows amazing pictures of art works, places to go, current news for the day and you can also have it use your own pictures that you choose. You can pick and choose what you want on your backdrop screen which is a great feature. Sometimes I like to just watch the backdrop screen because I have found things to put on my bucket list and I have also come across amazing works of artwork, where it has inspired me to paint certain object or in certain styles, since I am also an artist.", "verified": true, "helpfulness": "0/0", "author": "Miller"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Omar"}, {"rating": 5.0, "review": "Best buy in a long time!", "verified": true, "helpfulness": "0/0", "author": "Vinnie Orozco"}]