[{"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/0", "author": "Deng-Bo"}, {"rating": 5.0, "review": "The Best deal, this device is worth more than 100$.I use this device everyday and for everything, I cast everything from my mobile .Bottom-line--> You save a lot ($)", "verified": true, "helpfulness": "0/0", "author": "sridhar \"Sridhar\""}, {"rating": 1.0, "review": "Great video but sound had a lot of static, returned the item.", "verified": true, "helpfulness": "0/0", "author": "fabien"}, {"rating": 1.0, "review": "Piece of garbage.  It can't find the \"cast\" extension which I downloaded for the chrome browser, and just gives error messages such as \"unable to cast to device\".  I've read everything I can find to make this thing work and it just stalls out, showing \"connecting\" on my TV screen interminably.  Unfortunately, by the time I tried using it, it was out of its very short warranty period. Very unhappy with google.", "verified": true, "helpfulness": "0/0", "author": "Kathi \"Kayaks\""}, {"rating": 2.0, "review": "Compared to other streaming devices like the Roku or Apple TV this is pretty limited.  There isn't nearly as much in the way of programming like with the other products.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I`ts exctly as the apple tv", "verified": true, "helpfulness": "0/0", "author": "Eli Rubinstein Lustig"}, {"rating": 5.0, "review": "Bought this for my dad. He loves it.", "verified": true, "helpfulness": "0/0", "author": "Alex Stathis"}, {"rating": 5.0, "review": "Exactly what I wanted at a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "William T. Musil"}, {"rating": 1.0, "review": "Do you want to install every app that is on your Roku or FireTV on your cell phone? If so, this is the device for you. No remove, and no apps. Anything you do, you must do from another device. Wanna watch newsey? Download that to your iphone, because that is the only way you are going to see it.", "verified": true, "helpfulness": "0/1", "author": "Chuck Baker"}, {"rating": 5.0, "review": "It's super super quality item I ever had. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Hassan"}]