[{"rating": 2.0, "review": "I'm a huge Amazon fan and believe they have created the ultimate online shopping service, backed by great customer service to date. I say to date, since history has shown most - unfortunately - slip away from the core values that got them to where they are. I further qualify by stating that I'm not a big \"online\" fan when it comes to shopping, trust and so forth, though Amazon has made life easier and earned my loyalty and trust. With this said, I had high expectations for Amazon Fire TV and a couple weeks in my family and I find ourselves disappointed. The device itself is super friendly, highly functional and inexpensive. This is the only reason for two stars. However, the content is poor and nearly everything requires purchase - even as a Prime Member which I will likely drop again. I don't see the value with Prime for shopping (2 day free shipping for $99???), nor am I seeing value now having Amazon TV. I'd say roughly 80%-90% of the content is unrecognizable (B-type programming that never made it to TV, the big screen, etc.) or ancient, and of the more current programs - such as Modern Family - they require purchase. I'm like most and loath my cable company. Horrific value, content and service is a joke. My hopes were Amazon TV would be the answer. My further hope is that Amazon will take reviews like this to heart and find creative ways to enhance content and overall value without charging for nearly anything current or of quality. Come on Amazon, you're number one and can do better!!!", "verified": true, "helpfulness": "0/1", "author": "Consumer"}, {"rating": 4.0, "review": "Could of had some help setting it up.I got it going now!", "verified": true, "helpfulness": "0/0", "author": "Wanda S."}, {"rating": 4.0, "review": "I like it , but with broadband, has a lot of buffering", "verified": true, "helpfulness": "0/0", "author": "tom fool"}, {"rating": 1.0, "review": "Great disappointment, I already have these feathers from my cable provider @ NO Extra cost.P.S I am Not in to gaming", "verified": true, "helpfulness": "2/5", "author": "Pieter Keppel"}, {"rating": 5.0, "review": "I cancelled cable over 2 years ago, I have used WD Live, Roku, and Chromecast.  FireTV blows them out of the water, 10x faster that all the others, And Amazon had really beefed up there prime as well as purchase content.  It has Plex and Netflix which I use in addition to prime.  Plus tons of other channels.  Fantastic product and service", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "We got the Fire TV stick for one of our TV's and the Fire TV for our other TV. We are Amazon Prime members and we subscribe to Netflix so we get everything we want without having to pay for service from a TV provider like DirecTV or Dish. Saved tons of money!", "verified": true, "helpfulness": "0/1", "author": "Steve  McCullough \"Steve Mc2\""}, {"rating": 4.0, "review": "Good Value - Goodbye cable company!", "verified": true, "helpfulness": "0/0", "author": "Jocko"}, {"rating": 5.0, "review": "The only thing I don't like about it is you have to pay for a lot of the movies. I feel more of them should be free.", "verified": true, "helpfulness": "0/0", "author": "Camille"}, {"rating": 3.0, "review": "receivedc timely, but did not fill the bill that i was looking for.  and i havent used it enough to really give a good rating for.", "verified": true, "helpfulness": "0/0", "author": "James G."}, {"rating": 5.0, "review": "Easy to use, and very good for watching tv", "verified": true, "helpfulness": "0/0", "author": "James / Katrina"}]