[{"rating": 5.0, "review": "Love this if you're heavy Youtube user like us.  Also love the option to watch shows and movies via Google Play.  Initially thought about getting a Roku but Roku has no Youtube so that eliminated that choice.  Very simple and easy to use.  Love it for what it does.  Love it even more for the $35 price", "verified": true, "helpfulness": "0/0", "author": "K lee"}, {"rating": 3.0, "review": "maybe it's my network, but the Chromecast buffers a lot.  I love the idea, and set up is easy, plus the interface from ipad is easy.  But just need to address the lags.", "verified": true, "helpfulness": "0/0", "author": "John H. Sosbee"}, {"rating": 3.0, "review": "Works as advertised for Netflix and Chrome browser. I wish it could show the full screen of my laptop so I could use it for work as well (powerpoint, etc.)", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "its a very good product works very well just that it might heat up if used for too long that why i gave it a 4", "verified": true, "helpfulness": "0/0", "author": "daniel funtes"}, {"rating": 3.0, "review": "I'm hoping that this item improves and meets its full potential. At the moment it doesn't support as many applications as it could. For instance, Amazon Instant does NOT work because it uses Microsoft Silverlight, which for one reason or another doesn't stream to the television. Unfortunately I didn't find this out until right before I tried to start a movie.Netflix works pretty well. Streaming from a browser tab can be laggy. There's a delay between what happens on the computer and on the TV. Also, it's nice that you can \"cast\" a tab, and then use other tabs on your computer, but you can't make the cast tab full-screen if you want to switch to other tabs. So if you want to multitask (or say allow someone to watch a movie while you use your computer) then they would be forced to watch it in its embedded state (not full-screen).Like I said - I think this product has enormous potential. I'm sure there are a lot of ropes and hoops they have to jump through so they don't encroach on property rights and stuff like that. Hopefully it continues to improve. It would be a great value for the price.", "verified": true, "helpfulness": "0/0", "author": "Pat Mulligan"}, {"rating": 1.0, "review": "I was really excited when Chromecast came out.  The problem is they have not expanded support beyond Netflix, YouTube, Google Music, and Google TV.  It is now sat unused for the past 3 months.", "verified": false, "helpfulness": "7/9", "author": "J. Ryan"}, {"rating": 2.0, "review": "I cant do anything other than show chrome on the tv and watch youtube.  I dont have a netflix account.  When are we going to see Hulu or Amazon Prime Video?  Needs more support immediately.", "verified": true, "helpfulness": "1/1", "author": "Scuba Steve"}, {"rating": 5.0, "review": "This was up and running in my apt if about 5 mins.  Very easy and for the price it's def worth it.  Hoping other apps will be able to use this soon but for now between the Chrome browser, YouTube, and Netflix, I don't have a lot of need for much else...", "verified": true, "helpfulness": "0/0", "author": "Madee Bee \"Mads\""}, {"rating": 5.0, "review": "Amazing product. Easy to use. My only complaint right now is hulu+ does not have a cast button in their online player (like Netflix).", "verified": true, "helpfulness": "0/0", "author": "C. A. Wuthrich"}, {"rating": 5.0, "review": "Awesome product!! really convenient. You can cast your whole laptop screen via chrome. It is not just limited to YouTube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ajaypal Singh"}]