[{"rating": 1.0, "review": "seems to be no reasonable way to limit content so I cannot give this to my family -- waste of my money.", "verified": true, "helpfulness": "1/4", "author": "Ron Rabe"}, {"rating": 3.0, "review": "I want to love this, but I have metered internet and this things eats GBs like crazy!  I only get 15GB/month and this devise has used 8GB in 12 days and I haven't watched a single movie on it yet!!! I have to keep it unplugged!Amazon, I have free, unmetered internet time every night.  I need to be able to set the time frame for this guy to check for and download its updates. I live on a ranch in the middle of nowhere, so I pay a lot of money for very little internet access and I need to use it wisely!", "verified": true, "helpfulness": "0/0", "author": "Sophie"}, {"rating": 5.0, "review": "Loved how easy it was to set up and get running. No problems from day one.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Fire TV paid for itself in the first month and will continue saving me money by slashing my cable bill!  With apps for Hulu Plus, PBS, Smithsonian and Amazon content, who NEEDS cable?  And I love Pandora!It was extremely easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Melanie Hunt"}, {"rating": 1.0, "review": "I hate that it made me sit through a stupid tutorial that I couldn't back out of before I could do anything.  The tutorial should be an option for people who need it, not mandatory to watch when you first turn on the unit.  It had a lot of repeated info and was really dumbed down and slow.  What if you've installed these before?  Yes, you still can not back out of watching the idiotic tutorial.  Update: Oh yeah, I forgot to say anything about how it works.  It works fine.  My only other experience with streaming media players is using a wii for netflix and prime movies.  This is better for that as I would expect since that's its primary job.  You can read other peoples reviews more details.  I just wanted to point out something that bugged me and could easily be fixed in the future with a quick and easy option at the beginning.", "verified": true, "helpfulness": "3/13", "author": "Stianazon \"Stian Nilsen NYC\""}, {"rating": 4.0, "review": "OK, amazon. You win. I have the chromecast and love it, but can't use my android phone to cast amazon prime videos. And since you refuse to make an app for non-fire android devices, you've forced me into buying this.  And it is a great device. Well made, quick and easy to use. Far far better than the netflix interface on my blu-ray. Also very glad it has wired ethernet instead of relying only on wifi. Bluetooth remote is cool, but I REALLY wish that the remote had a volume button for my TV. That seems like a major oversight and an easy thing to do. Now I need to hold two remotes instead of just the slick little one that comes with the fire.", "verified": true, "helpfulness": "0/1", "author": "A. Schuetz \"dabbler\""}, {"rating": 3.0, "review": "Need more games especially for little girls.  I have tons of movie on vudu player and can't watch any on amazon. I tried connecting my flixter account with vudu that didn't work.  The amazon fire tv is actually for my kids and they really want to watch vudu player if anyone has any recommendations.  More of the kindle fire games should be on fire tv especially since u have a controller....... HELLOERRRR ;). Other than that it will do for now.  It's good for when my daughter or son have sleep overs though", "verified": true, "helpfulness": "0/1", "author": "Demika Moore"}, {"rating": 3.0, "review": "okay quality fast shipping", "verified": true, "helpfulness": "0/2", "author": "Jeffrey Jenson"}, {"rating": 2.0, "review": "The device itself is perfect. However it used 50gb of data in 5 days. I'm waiting for people to realize why their next bill is 1000$. Best of luck sent mine back. #techsavvy", "verified": true, "helpfulness": "0/4", "author": "Joseph J. Gilbert Jr. \"Joe\""}, {"rating": 5.0, "review": "Love this.  Have on bedroom tv so I cn watch my favorite movies while my husband watches sports.", "verified": true, "helpfulness": "0/0", "author": "M&Mlover"}]