[{"rating": 3.0, "review": "I bought this so we could watch things on the TV that we would normally stream on the laptop and connect to the TV. It works, but the streaming is delayed so the picture is not as clear and looks shakey. I would rather continue plugging in the laptop to the TV because the clarity is better and there is no delay to make the picture blurry or shakey.", "verified": true, "helpfulness": "1/1", "author": "Kara"}, {"rating": 5.0, "review": "You probably have an Xbox or Roku or Playstation or some kind of device streaming video, but they definitely aren't $35 and certainly don't have the portability of a Chromecast.More apps are getting supported, but really, who needs more than Netflix, YouTube, Hulu Plus and HBO Go for streaming video? If you said, \"me!\"...go outside.If you have a Tablet, Smartphone, Laptop or Desktop already pre-loaded with the above mentioned services, you are crazy not to get a Chromecast for your spare TV. Great Device, great price, can't wait to see what Google develops for Chromecast in the future!", "verified": true, "helpfulness": "0/0", "author": "Jimmy Worrell"}, {"rating": 4.0, "review": "Chromecast is great.  The only set back I have noticed is that it does not seem to stream Amazon prime which may become a major issue in the future.", "verified": true, "helpfulness": "0/0", "author": "Anil K Mehta"}, {"rating": 1.0, "review": "The Chromecast only wants to work if your version of Windows is 7.  Vista will act like it setup correctly and even function to cast video, but it creates conflicts with your home network and router. Creating duplicate IP addresses and causing all internet traffic to cease flowing.If this product is to be useful it needs to setup on many versions of Windows.", "verified": true, "helpfulness": "1/3", "author": "T. Neuland \"home office\""}, {"rating": 4.0, "review": "I love the simplicity of this product..price was right, it works fine and has the potential to do more..I was offered free shipping and that was a good deal, though I live 30 minutes from the distribution center and it took two days to get here as it's shipped by FEDEX to Memphis TN and then sent by USPS back to where I live in the south Nashville area...didn't quite make sense..wish there was a check box I could use as I live near a shipping center...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a must have inexpensive upgrade for every TV in the house. The cast functionality is superior to Smart TV features that come on TVs these days because it works with your smartphone or tablet and you're already using those devices while watching TV. With HBO, YouTube, Netflix, Play Store, and Hulu content, there's more than enough content available.", "verified": true, "helpfulness": "1/1", "author": "Amanda Cobell"}, {"rating": 5.0, "review": "This unit, which sells for cheap, does everything I expected and more. Everything on youutube and Netflix, where I watch most of my tv is castable. Anything I can render in Chrome I can cast, either the tab or the full screen. Resolution automatically sets for the tv. I like the fact that I don't need to use a clunky search function like on my roku. I just surf the web and cast anything I find. Another plus is that the Chromecast sets up an additional wifi, which lets me watch my cast and surf on my Chromebook at the same time. Finally, upgrades come along periodically that expand functionality. It's a great product.", "verified": true, "helpfulness": "0/0", "author": "ralph silva"}, {"rating": 5.0, "review": "No more huddling in front of a laptop or cell phone to show friends YouTube videos! I can't wait for Chromecast to come out with more compatible apps. You can surf the web on it through a connected laptop as well, just download the app from Google Play. It is a little laggy. I'm sure there is more to come in the future! Very excited about this. Can stream Netflicks from ANY WiFi connected phone! Pretty cool little device. Only thing I didn't realize is that it also has to be plug into an outlet or USB port if you TV has one. Super easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "i dont have Netflix on my tv in my bedroom.  Now i do!!!!!!  love it and i recommend this product", "verified": true, "helpfulness": "0/0", "author": "Chris Anderson"}, {"rating": 5.0, "review": "It works fast and fluid, simple but powerfull and it works in iOS and android. For that price what else could you ask for?", "verified": true, "helpfulness": "0/0", "author": "Juan Felipe Ardila"}]