[{"rating": 5.0, "review": "http://itunesboss.com/?ref=9xlLWfgQc", "verified": false, "helpfulness": "0/1", "author": "Angel Núñez"}, {"rating": 3.0, "review": "EZ OUT OF BOX. PROBLEM IS MY CABLE INTERNET PROVIDER ISN'T ON THE LIST TO ACTIVATE A LOT OF THE APPS FOR DIFFERENT CHANNELS LIKE PBS HISTORY, A AND E...YOU GET THE DRIFT. BUT FOR THE SERVICES THAT DOES WORK IT IS AMAZING AND SIMPLE. THE VOICE SEARCH DOES WORK BUT BE CAREFUL BECUASE YOU GET EXACTLY WHAT YOU ASK FOR. IT IS A VERY NEAT MEDIA TOY AND WORTH THE PRICE JUST BECAUSE IT IS EASY TO USE.", "verified": true, "helpfulness": "0/0", "author": "GARLAND D RICHARDS"}, {"rating": 5.0, "review": "First Amazon shipped this item extremely fast, I got it a day earlier than expected. I've had many media streaming devices. This one by far is the easiest to set up and the speed and flow of this device is flawless.", "verified": true, "helpfulness": "0/0", "author": "Poppa Bear"}, {"rating": 5.0, "review": "Easy to set-up, easy to use.", "verified": true, "helpfulness": "0/0", "author": "ohio"}, {"rating": 4.0, "review": "I absolutely love my Fire TV. I bought it a few months ago just to see how it would compare to the Apple TV and Roku and I am not disappointed. I am impressed at the amount of updates that have come out since it was released. It's missing some features that could make this perfect though.- Support for DTS, DTS-HD, Dolby TrueHD, etc. Power users don't want their videos to be transcoded. We pay good money for our receivers and want them to play the raw codecs from our streams.- Customization. This is huge. I don't use a lot of the menus on the Fire TV and would like to hide them. I used to root for this, but my root was killing the performance so I decided to go back to the vanilla OS. I also would like more themes and options for organizing my home menu. Take a look at Kodi. I want my watchlist, recents, and apps all on the same home menu, or a grid based system.- More formats for external storage. This feature did just become available recently, but the strict use of FAT32 is a turn off for most users. Since this is based on Android/Linux I at least expected support for ext3/4.- 802.11ac. Hoping to see this in the FTV 2.- Unified watchlist. I know that Amazon wants to promote their content, but if they really want users to switch from their current set-top boxes to the FTV, they need to provide features that make it an incredible experience that no other device has. The ability to go to one watchlist menu and see all of my films and shows organized together is something that I have been wanting to see in streaming devices for years. To also be able to filter these by app, genre, etc. would greatly be appreciated as well.- More voice search integration with third party apps. Really hope that Amazon makes this a higher priority with developers as it's one of its best features.It really is a joy to use this device and I trust Amazon to pull through with more features in the future. The amount of updates that have been put through in the past few months is monumental compared to the Apple TV and Roku. I really hope Amazon puts more effort into making the Amazon App Store friendlier, as it really lacks when compared to the Google Play Store.The future of this device is definitely a bright one, as I've given up hope for the Roku and Apple TV and am unsure about Android TV.", "verified": true, "helpfulness": "0/0", "author": "stpalm"}, {"rating": 5.0, "review": "I bought this so that I could have a tv in my room without having to run cable all of the way to the other end of the house.  I enjoy being able to enjoy netflix, and have just started using the prime streaming service an I am finding new apps.  It suits my needs with one exception, and that is not a fire tv issue.  Some of the apps still require that you have a cable subscription in order to be able to use them.  That is a bit much if your intention is to \"cut the cable cord\".  However, as I said that is an issue with certain apps, not the fire tv, itself.", "verified": true, "helpfulness": "0/0", "author": "Holly"}, {"rating": 2.0, "review": "My son and I gave the Amazon Fire TV a try for a while now and ended up replacing it with a Roku 3.  The voice feature never worked right because it doesn't appear to do well with accents.  We were not impressed with the game app feature because too many of the games on our Kindles don't interface with Fire TV.  This is especially true of several workout apps I like to use.  I was not impressed with the streaming channels selection.  While Hulu Plus and Netflix are there I was disappointed to find I had to use Flixter instead of VUDU.  That made my son unhappy because of the number of movies and shows we have on VUDU.  It does work good with Amazon Prime Instant Video, but my son and I simply don't use that as much as we do the other 3 services.  Another strike against the Fire TV is the limited number of streaming channels available.  I have several specialty streaming channels I enjoy via Roku that are not available via Fire TV and, according to Amazon Customer Support, won't be available at any time in the foreseeable future.Overall we found it slightly better than a Roku 2 and definitely superior to Apple TV and Chrome, but lacking compared to Roku 3 based on the need of me and my son.", "verified": true, "helpfulness": "0/1", "author": "Sentinus"}, {"rating": 2.0, "review": "I was under the impression that I could get more apps for more viewing choices. I haven't been able to watch a baseball or hockey game since I've had Amazon Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Jennifer Riley"}, {"rating": 5.0, "review": "So easy to set up. Worth every penny. I am enjoying listening to new music as well as music that I had previously purchased thru Amazon.  So many movies to choose from. Being a PRIME member gives me even more choices of movies, TV series,  and more. Forget about paying the high cost of cable. I haven't checked out HuluPlus, Amazon Instant Video, WatchESPN, IHeartRadio, Netflix, PANDORA and others yet. The remote is so simple to use, no unnecessary buttons to deal with. Press the mike button, say what music or movie you want, and there it is. I am very satisfied with this purchase. Everything you need for setup comes in the box, except the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Joretha \"summer\""}, {"rating": 5.0, "review": "Big bang  for your buck. Nice to watch our pictures on your TV. The voice recognition is very good.", "verified": true, "helpfulness": "0/0", "author": "Laurel Lampert"}]