[{"rating": 2.0, "review": "I don't know im disappointed maybe it's my wi-fi with weak signal and i have to purchase one with a stronger connection. With that being said since I have purchased this product it lags,stops and loads every few seconds impeding my enjoyment of what I am viewing. I used it two or three times and it has been back in the box since.", "verified": true, "helpfulness": "0/1", "author": "Davis fermin"}, {"rating": 5.0, "review": "When there is nothing else on worth watching I turn to this and either youtube videos or netflix. Worth the money spent.", "verified": true, "helpfulness": "0/0", "author": "N. Greco"}, {"rating": 5.0, "review": "Good stuff!", "verified": true, "helpfulness": "0/0", "author": "Shopperx"}, {"rating": 1.0, "review": "This some bulls*** right here. I expected a receiver for casting from my android to any HDMI receiver. Android is Google so I figured why not use Chromecast. It seems logical to me to expect the most functionality between similarly paired devices from the same manufacturer. Apparently, I expected to much. That said, there is nothing I like about this device.#1 reason to NEVER EVER purchase this device: It requires an internet connection in order to function.#2 it will not connect from behind a proxy, like that used by every hotel on planet earth.#3 If you disable GPS on your cellular you cant connect to the Chromecast because NO_GPS_DATA_AVAILABLEI can keep going... like you cant tether Chromecast to the cellular device which the signal cast from.It's like Google purposely made this Chromecast device suck buy blocking everything it should do.Save your money, Chromecast is not worth it. There are better implementations of screen casting out there.", "verified": true, "helpfulness": "1/1", "author": "the86r"}, {"rating": 5.0, "review": "I was really impressed of how item was shipped to me, I really like the wrapping as well... 5stars", "verified": false, "helpfulness": "0/1", "author": "crystal lopez"}, {"rating": 5.0, "review": "bought 3 of these, work great!", "verified": true, "helpfulness": "0/0", "author": "Danny F."}, {"rating": 5.0, "review": "Within the limits of what it is made to do, it is an excellant buy.", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 5.0, "review": "It is what it is.", "verified": true, "helpfulness": "0/0", "author": "Tony C."}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Salvador"}, {"rating": 1.0, "review": "As excited as I was about this it did not work when I tried setting it up overseas. I don't have the time to sit and troubleshoot for an hour, so I will not be using this.", "verified": true, "helpfulness": "0/0", "author": "Holmes"}]