[{"rating": 5.0, "review": "There is still a need for some more apps but I love it. Its super cheap setup was easy and the quality and speed surpassed my expectations.", "verified": true, "helpfulness": "0/0", "author": "NoWay"}, {"rating": 5.0, "review": "As an early adopter of streaming boxes going back to the original Roku Netflix player and including game consoles and an Apple TV for good measure, I have been incredibly surprised by how much I love this device. Because I search for content directly on my phone or MacBook Air there is no fumbling with the Roku's slow menus or listening to the Xbox's fan.  The streaming is rock solid, picture quality and sound are great, and the price seals this as the best way to watch internet TV at home.", "verified": true, "helpfulness": "0/0", "author": "B. Lee"}, {"rating": 5.0, "review": "I love the simplicity of this thing and how it opens up the monitor to a huge selection of video. I've had a bit of tech problems, probably stemming from my set up, but the thing works well otherwise. Fantastic price, too!", "verified": true, "helpfulness": "0/0", "author": "Ted Pastrick"}, {"rating": 4.0, "review": "I bought this without much research because it's fairly inexpensive.  Installation took no time at all.  It allowed me to link both my Chromebook and iPad to my TV.  Ever since the purchase, I've been enjoying Youtube video clips on TV's much larger screen.  However, when I use it to watch Netflix, there's a lag for captions, which is kind of annoying.  Hence, I deduct 1 point.", "verified": true, "helpfulness": "0/0", "author": "Desert Giant"}, {"rating": 5.0, "review": "This little thing is amazing! If you have a smartphone, and who doesn't anymore, and a newer TV, you don't need anything big to play Netflix, hulu, HBO Go, etc.I have a PS3, Wii, Blu-ray player, etc. so I didn't need this for Netflix. I bought it for HBO Go. I have an LG and Xfinity cable, so I needed a way around Xfinity not having a PS3 app for HBO Go.I have tested this with Youtube, Netflix, and HBO Go. I love this little device.I almost bought a $90 system; like Roku or the amazon version. I am so happy I got this. It's $60 cheaper.", "verified": true, "helpfulness": "0/0", "author": "Athena \"Athena\""}, {"rating": 4.0, "review": "We love the google chrome!  We've controlled it using my phone, our tablet, and our laptop so it's very versatile.  We were a little disappointed to find out it won't work on public wifi.  We had some down time at a hotel throughout a wedding weekend and had gotten addicted to the walking dead on netflix.  We were excited to see that the hotel TV had an HDMI port, but the chromecast wouldn't work.  There are currently apps for netflix and HBOGo, which is great.  I am hoping they have one for amazon prime soon.  The only other complaint I have is that it's a little harder to control content with a phone.  For example, it is not easy to rewind or fast forward at all.  Also, occasionally the tv frame will freeze, though the sound keeps going.  In that instance, you can usually stop it and restart it, but I have had to actually restart my phone once or twice.  Also, I'm not sure if this is the case but seemed to be for us - you can't just plug the little thing into the hdmi port - you have to connect a cord and plug it into a usb port for power.", "verified": true, "helpfulness": "0/0", "author": "Ashley Granger"}, {"rating": 3.0, "review": "This of good quality, but seemed limited in availability of movies etc. We rarely were able to use it. It is certainly the least expensive of its kind.", "verified": true, "helpfulness": "0/0", "author": "reekie"}, {"rating": 5.0, "review": "For $35 you get the same features as a product that costs you $100 ( *cough* *cough* *roku* , sorry had some money stuck in my throat).  buy this, and then thank me later.", "verified": true, "helpfulness": "0/0", "author": "Kyle D Robinson"}, {"rating": 4.0, "review": "Prime delivers as usual.  Timely arrival, packaged well, good product.  Works as expected.It does what I expected.  It's more of a toy for me.  I use the Roku 3 primarily.  This onewill be good for attaching to my smaller TV while the main TV and Roku are in use.", "verified": true, "helpfulness": "0/0", "author": "Bill L."}, {"rating": 5.0, "review": "Keeps getting better with the support of more platforms.  Easy to set up and use and I even take it with me when I travel.  Can't beat the price.", "verified": true, "helpfulness": "0/1", "author": "asendic"}]