[{"rating": 1.0, "review": "This device is a big ZERO.  Does not work with a pc, does not work with an ipad, doesn't even work with an android or even two, it does not work i tell you not even one bit", "verified": true, "helpfulness": "0/2", "author": "Robere"}, {"rating": 5.0, "review": "This small inexpensive devise addresses the question of \"how do I play videos off my cell phone to my TV\". I have been enjoying a lot of you tube video's about all kinds of topics that interest me.", "verified": true, "helpfulness": "0/0", "author": "Derrick Douroux"}, {"rating": 1.0, "review": "Has good picture bad but  has major jet Lag would not have purchased this piece of junk! Will try roku or anything!", "verified": true, "helpfulness": "0/1", "author": "Dr.O"}, {"rating": 5.0, "review": "Makes it so easy to listen to tunes through the big speakers of my HiFi or watch shows on the big screen. Setup with your phone to make it connect with your Wi-Fi and then it's ask ready to go. Have had no problems streaming HD even though the such is behind the TV and a good 50 feet/2 rooms away from router. Price is fantastic for all that this let's you do!", "verified": true, "helpfulness": "0/0", "author": "Patrick Freeman"}, {"rating": 5.0, "review": "Hook up to the tv was easy. Not meant to replace cable or satellite, but it gave me more things to watch.", "verified": true, "helpfulness": "0/1", "author": "leftside"}, {"rating": 4.0, "review": "it seems that the unit heats up a lot and then the service gets choppy. It is worth the money for sure.", "verified": true, "helpfulness": "0/0", "author": "cameron cieglo"}, {"rating": 1.0, "review": "Does not interact with my mac book pro..The set up doesn't go through for some reason.I do not recommend this device.", "verified": true, "helpfulness": "0/0", "author": "anna"}, {"rating": 5.0, "review": "The product is pretty easy to be used,  The configuration is very intuitive and its work pretty fine wil both techology (IOS and Android ) devices.And nice work of Amazon, that delivery to me wxactly as agreed in the advertisemnet", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 5.0, "review": "I got this because I hate most of the shows on tv right now. I wanted to watch other things. This is wonderful change. Works great.", "verified": true, "helpfulness": "0/0", "author": "Krystahl \"Krys\""}, {"rating": 1.0, "review": "Extremely limited in it's possibilities. will only work with Google applications. Also not easy to configure. Only good for users of Google docs.", "verified": true, "helpfulness": "0/0", "author": "Víctor Hernández"}]