[{"rating": 5.0, "review": "User friendly, Easy to set up, easy to use, really clear picture quality. Great for Netflix!! Should have got sooner!", "verified": true, "helpfulness": "0/0", "author": "Joseph Medianowsky"}, {"rating": 3.0, "review": "Device works fine.  But - needs a high powered computer and network to stream Web content.  And the app support for the device is rather sad.  Finding myself using this only in situations where I can't get content on Roku (native or via Plex).  So very little use.  I would have been better off buying another Roku and a cable to hook computer up to TV for NBC Sports Live...", "verified": true, "helpfulness": "0/0", "author": "moatl"}, {"rating": 5.0, "review": "I love streaming Netflix and YouTube to my TV.  When Pandora jumped on board and HBO Go, I was feeling fine.  Once we get device mirroring on the Chromecast, I'll have everything.", "verified": true, "helpfulness": "0/0", "author": "David W. Jones, Jr."}, {"rating": 4.0, "review": "In spite of having a more complex audio/video combination of components to contend with, we were able to get the Chromecast working relatively easily. If you are just connecting to a flat panel TV, should be a piece of cake. And the ease of streaming ...nice.", "verified": true, "helpfulness": "0/0", "author": "ruoutside"}, {"rating": 5.0, "review": "If you are a android fan and a dedicated Chrome user like me than its $39 well spent. Adds some really useful features to your TV, but nothing really ground breaking about the device other than the price.", "verified": false, "helpfulness": "0/0", "author": "andrew lukowski"}, {"rating": 1.0, "review": "Repeatedly indicated that the signal quality was poor on a Panasonic TV and the program required that I have Google Chrome installed on my Apple which I did not want.", "verified": true, "helpfulness": "0/0", "author": "ebeas"}, {"rating": 5.0, "review": "I used to use the Wii to watch Netflix but the chromecast is much better. I love that I can control everything from my tablet, so easy to use.", "verified": false, "helpfulness": "0/0", "author": "Patricia Beverlin"}, {"rating": 5.0, "review": "I can stream to my Tv from my Samsung galaxy s2 or my galaxy tab 3. It's better for me than watching it on those devices.", "verified": true, "helpfulness": "0/0", "author": "Robert Dobson \"jesdon\""}, {"rating": 5.0, "review": "Use it to cast chrome tabs to my television and to watch Youtube and use my tablet as the remote.", "verified": true, "helpfulness": "0/0", "author": "The Zeppelin"}, {"rating": 5.0, "review": "Plugged it into the HDMI opening on the side of my Vizio 42-inch screen - switched the remote to HDMI - and from tiny computer screen to giant TV screen, Chrome browser switches my Netflix subscription to the television via Chromecast.  Big screen movies streaming on a big screen - All my favorite television shows streaming without a single commercial. Gotta love it!", "verified": true, "helpfulness": "0/0", "author": "B. Lombard"}]