[{"rating": 5.0, "review": "This technology is amazing, fast and easy to use. Blows Google chrome out of the water!", "verified": true, "helpfulness": "0/0", "author": "A. Chavez \"Mexican Daddy\""}, {"rating": 5.0, "review": "So glad to have it.  I've tried others but so far this one is the best.", "verified": true, "helpfulness": "0/0", "author": "Frederic Delos"}, {"rating": 4.0, "review": "I've just started using the box version.  I like the voice command and hope that it soon expands to more than searches within Amazon but I won't hold my breath.  I particularly like how quickly my choices load, buffer, and play.  Its almost instantaneous and never has there been an issue of the the output exceeding the buffering capacity (I have 3 Mbps).  Previously, using the Amazon Prime service, I would have to wait for the connection to establish and the selection to load.  No more.With the Fire TV, if I am watching a TV series, the next episode is displayed in the bottom right of the screen and can be started with a single click instead of going back to the menu and clicking to the next episode.  I'm sure there are improvements to come and looking forward to them.", "verified": true, "helpfulness": "0/0", "author": "Bonnerauthor"}, {"rating": 5.0, "review": "I bought 3 of these, replacing an Apple TV.  It is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Kelly John Block"}, {"rating": 5.0, "review": "very pleased so far- thought there may be more g-rated movies available but totally happy just the same", "verified": true, "helpfulness": "0/0", "author": "Val Farber"}, {"rating": 2.0, "review": "piece of crap looses WiFi even though signal shows full bars takes forever to load anything like i said P O CRAP", "verified": true, "helpfulness": "0/3", "author": "sam curry"}, {"rating": 5.0, "review": "Amazing TV device.  Very easy set up, almost self installing, all I really needed to do was enter my Amazon Prime ID and password.  Movie and TV episodes are almost unlimited.  Great replay of my Cloud movies, TV shows and music.  Only wish I could upload more music on the basic plan.", "verified": true, "helpfulness": "0/0", "author": "Jim Bowrey"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV is super easy to use. It's very small and the voice commands are great! Just another reason to love Amazon!", "verified": true, "helpfulness": "0/0", "author": "Rtrudeau"}, {"rating": 5.0, "review": "I love it. My wife loves it. My kids enjoying it. This is the best TV box I purchased.Worth every pennies.", "verified": true, "helpfulness": "0/0", "author": "Tuan A. Tran"}]