[{"rating": 3.0, "review": "Fast and Speedy UI compared to my Roku 2XS  Have yet to get a Roku 3 so I can't compare.The major source of content is my media server which runs Plex.  This is a serious issue with the Amazon Fire TV.  PLEX is supported, but there are serious issues with what types of encoding are supported and what capacity they are supported.Every video I play with the Amazon Fire TV get's transcoded, that's even if I select force direct play.  Transcoded files are not the best option for me for two reasons:1. The Quality is degraded from a direct play.2. It forces the my media server to work harder to transcode the files in lieu of just playing them.The 2nd reason seems to cause a serious increase in buffering videos which means that they pause to load, I was experiencing this with my Roku, and it turns out that once I downgraded to a previous version of the PMS software those issues have been mostly fixed for my roku players, which support direct play flawlessly for all my videos.UPDATE: I've Successfully optimized my network and have confirmed that the buffering issue is no longer present.There also seem to be Sound playback issue with the AFTV, I've pulled this form a forum, but have seen the exact same issues in my short time(less than a week) with my new AFTV:\"You can only get DD 5.1 from mp4 files. No DTS from mp4 or mkv files, and no DD from mkv. All you can do right now is uncheck the boxes for DD and DTS so you can at least get 2.0 stereo PCM.\"I think i will hold on to the AFTV, and hope that it will go through the necessary growing pains and update with better firmware that will take care of these issues.  Especially since I got it for such a bargain, but had I paid the full price for it, I'd be returning it.UPDATE: This is still an Issue, files that I can play with DTS, or other surround sound on my Roku, get transcoded on the AFTV.Video Quality is Excellent:I read another review where the reviewer commented on how much better the HD streams from places like Netflix & Hulu looked on the AFTV vs. Roku, and I can attest to this, it's very noticeable IMHO, and a welcome thing considering all these streams are heavily compressed.  I watched the scene from avengers where Thor, Cap, and Iron man fight at night and it looked almost as good as my Direct Play 1080p on my plex  played on my roku of course :-p.  Both Hulu and Netflix have this increased video quality.Man I wish this was the case with the plex app on the AFTV, as I'm sure it would look awesome!One of the other things I don't like about the AFTV, is that in my experience, when you are in other non amazon apps Hulu netflix, plex.. etc, the screen saver doesn't kick in.  This is not a good thing for those of us with Plasmas, as it can result in image retention or worse burn-in.  My Roku invokes the screen saver after the set inactivity threshold is reached this is awesome feature and needs to be implemented on AFTV stat! I would be willing to use my roku for PLEX only and use the AFTV for Netflix & Hulu were it not for this limitation, but alas I will not sacrifice my TV.UPDATE: This seems to have been resolved, and the screen saver is now activating no matter where in the system I am.I'm still getting to know this thing, so i will update this review accordingly.UPDATE: as somethings have been sorted, one of the biggest has not, that being the Surround sound support or lack there of, sound it just as important in watching TV as video, in some cases more so. I'd like to take full advantage of my surround sound setup, even if my system does a great job of simulating surround from a 2channel source.", "verified": true, "helpfulness": "0/1", "author": "BiGg RiE \"-BiGg RiE-\""}, {"rating": 3.0, "review": "I got this because it was the hot new thing and had a game controller.  It's a neat little box but I've since tired of playing the limited number of games and I've found the UI painful to navigate.I had an Apple TV before the Fire TV, and now that I've unplugged the Fire I still use the Apple TV (and I'm not an Apple zealot.)Amazon really needs to work on the UI to make it less painful.  Maybe a massive software update will occur at some point for my existing hardware?", "verified": true, "helpfulness": "1/2", "author": "Mike Schinkel"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "1/1", "author": "audrey ewing"}, {"rating": 1.0, "review": "I pre-ordered the fire stick and once I got it, I was extremely disappointed. It refused to recognize my wifi so I returned it and ordered the Fire TV  -  lightning doesn't strike twice, right? Wrong. The Fire TV set up in seconds and sorta functioned for a while. I have to unplug it and plug it in every time I turn the TV on, and it won't hold the wifi signal for more than five minutes. It also freezes frequently. When I return to a program after turning the Fire TV off and on, it's a crap shoot whether it will reload. These apparently are common problems  and it's amazing no fix has been made.  I've been a big fan of amazon since its early days, and I bought this out of brand loyalty rather than get another Roku . My bad. This is going back. So, what do I do if I get an invitation to buy an early Echo?", "verified": true, "helpfulness": "5/8", "author": "John Robinette"}, {"rating": 5.0, "review": "Fire TV rocks! Purchased a warehouse refurb for $79. Same warranty from AZ as the new ones.Since I was getting tired of tethering my Kindle, this made sense. The remote with voice is really neat. Just went from one episode of Aqua Teen to Saving Private Ryan with just a press on the remote and speaking what I wanted. Pretty cool.Seamless interaction setting up the Fire. Add your wireless, or plug into ethernet Wait for the download/software update. Enter your account credentials to sign into AZ.Select and start playing. Easy.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Second FireTV. In additin with 2 Stick. Execlllent product", "verified": true, "helpfulness": "1/1", "author": "Kenny"}, {"rating": 5.0, "review": "This is such an easy system to use, no more headaches looking for things.  Voice activation works great too.", "verified": true, "helpfulness": "1/1", "author": "Kenneth L Bivens"}, {"rating": 3.0, "review": "As soon as I connected the device I noticed that it can be greatly improved software wise. It should be allowed to function without an internet connection in case you just want to use the Miracast and watch (mirror) videos from your tablet or phone to your TV. The other thing is that it should let you connect first to a browser in order to connect to an internet that requires you to log in on their web page, for example in a hotel room.", "verified": true, "helpfulness": "0/2", "author": "Martin Rivera"}, {"rating": 4.0, "review": "Works as advertised, great device!", "verified": true, "helpfulness": "1/1", "author": "Tom Snyder"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Nmuman"}]