[{"rating": 3.0, "review": "If you have a Roku you are better off than with the chromecast. The only reason I got it is the ability to cast a chrome browser window from the laptop without getting the HDMI canle out.  This works reasonable well, however I noticed some bluriness and also some unaligned audio/video but wouldn't be certain that the chromecast was to blame.", "verified": true, "helpfulness": "0/0", "author": "Matthias607 \"Matthias607\""}, {"rating": 5.0, "review": "It is very easy to set up and use. I don't know how I ever got along without  it.", "verified": true, "helpfulness": "0/0", "author": "Bernard Garcia"}, {"rating": 4.0, "review": "The first week it worked great! But now it constantly buffers ever time I try to stream videos from my laptop and I have to adjust the quality of the video. I suspect it might be my internet connection, but I'm not quite sure.", "verified": true, "helpfulness": "0/0", "author": "GARY HARGIS"}, {"rating": 4.0, "review": "Didn't think it had to be plugged into electric.", "verified": true, "helpfulness": "0/0", "author": "loretta f hawkins"}, {"rating": 3.0, "review": "Chromecast worked great for a couple of day, then the screen became static and unresponsive.", "verified": true, "helpfulness": "0/0", "author": "Mark A. Fairclough"}, {"rating": 5.0, "review": "Amazing utility, unbeatable price. Love it.", "verified": true, "helpfulness": "0/0", "author": "David C. Smith \"Snwpunc\""}, {"rating": 1.0, "review": "If you want to project photos from your phone, this works fine.  If you want to show netflix to a tv, fine (although every dvd player out there does the same thing) If you want to show local video, (video you have ripped from your DVD) on your TV, forget it.  I paid for the movie once when I bought the dvd but now Google thinks I should buy the movie again through Google movie and tv app to show it via Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Theatre Buff \"TB\""}, {"rating": 1.0, "review": "Is stinks that you can't stream Amazon prime video to this device. it also requires you to use your smart devices to use this.. So over all spend more money and get a FireStick.", "verified": true, "helpfulness": "0/0", "author": "andrew"}, {"rating": 2.0, "review": "I have sceptre TV and the apps are streaming good with chromecast. But whenever I mirror cast any other chrome page it is stuttering and is pretty irritating.  Total waste of money !!!", "verified": true, "helpfulness": "0/0", "author": "Santhoshkumar"}, {"rating": 5.0, "review": "Great way to stream videos on TV wirelessly. Everyone in the family loves using it.", "verified": true, "helpfulness": "0/0", "author": "Tunazzina Abedin"}]