[{"rating": 4.0, "review": "Let's face it... there's so many different boxes like this out there, that Amazon really didn't have too much to innovate. I purchased this box for my mother and for her purposes, it has worked out great. She actually likes her Chromecast and FireTV. The only two cons I can name are:1. Does not have Google Play (Obviously), but it would be 100% better with it. Way more app options.2. Search feature only searched Amazon and that's pretty useless with a device like this.If you don't have an Amazon Prime account, then I would select something else; otherwise, this FireTV is pretty rockin' and easy to use (Mom is 70).", "verified": true, "helpfulness": "1/1", "author": "Michael LaPan"}, {"rating": 4.0, "review": "this thing is really tight compared to a roku. its very fast, the picture quality is amazing, the layout are very nice. the layouts are a bit hard to get used to at first, but they are well thought out. i havent tried the games out yet, but they look pretty incredible too, unfortunately my controller wont be here till mid may. my only negative thus far is that the voice feature only searches Amazon, instead of all your apps. sorry Amazon, i dont wanna pay you 2.99 for a New Girl episode I can get for \"free\" on Hulu.", "verified": true, "helpfulness": "1/2", "author": "roberts1678"}, {"rating": 1.0, "review": "Delivered today. Set it up as per the flimsy instructions. Whit light blinking then yellow light same. Nothing happens with the remote-batteries in correctly. All those cudos are false. This thing sucks!", "verified": true, "helpfulness": "6/27", "author": "p \"p\""}, {"rating": 4.0, "review": "so far it,s been fine.The set up was very easy I am a prime member so all my info was on the box when it came.It was delievered in 2 days. the game controller came later 11 days later.so far my family and I are getting use to it and catching up on shows that we are behind on and shows that we liked that were canceled.movies are current and everything is up to date.so far so good.", "verified": true, "helpfulness": "0/0", "author": "paul mcmann"}, {"rating": 4.0, "review": "I had a Roku for a bit over a year - it started locking up all the time so I was looking for a replacement - decided to go with the Amazon Fire TV.  There is a lot to love about it.  It is fast - the video streaming is great - the remote is great.  I have the game controller ordered (on back order)The reason for four stars vs five is that there are a few things missing - it will depend on what Amazon does with it.  There is no DLNA support.  There is a USB port on the device - but zero support for it.  These are two features of the Roku that I used to use a lot.  Hopefully Amazon will rectify these omissions in a update.I would hope that we see a flood of new apps in the near future as developers get on-board.  If the app selection grows and the omissions are fixed - this could easily get a 5 plus star review.", "verified": true, "helpfulness": "0/1", "author": "L. Sweet"}, {"rating": 5.0, "review": "The Amazon Fire is simple but delivers a great experience. The remote is slick and I would recommend this product", "verified": true, "helpfulness": "0/0", "author": "anthony foster"}, {"rating": 5.0, "review": "Works great. Great performance in a small package. Xmbc side load was simple and works great. USB works for wireless keyboard and mouse combo.", "verified": true, "helpfulness": "2/4", "author": "John C."}, {"rating": 5.0, "review": "Works great, love the black sleep look.  The remote is matte black, i love the speaker option.  I hate having to scroll over to each letter when I'm searching for a movie.  Haven't had any issues.", "verified": true, "helpfulness": "1/2", "author": "Daniel Ayala"}, {"rating": 5.0, "review": "Great product, easy to set up and I am tech illiterate. Up and running in ten minutes, ordered second one", "verified": true, "helpfulness": "1/2", "author": "Katy man"}, {"rating": 5.0, "review": "As soon as I saw this, knew that I had to have it!  It is small and super easy to set up.  I am a homebound, handicapped person, who  relies solely on home entertainment.  I must also rely on someone to set things up for me.  I was able to instruct a friend, who is not a techie, how to set things up for me with the Fire from Amazon.  She was able to do this in no time!  I was able to watch the latest movies that were Academy award winners or award nominees and stream from Amazon prime many others immediately that weekend at no additional cost!  I had ordered movies from Amazon many times before, however, this just makes the entire process so much easier!  Thanks Amazon for another big winner!", "verified": true, "helpfulness": "1/2", "author": "J. A. MYERS"}]