[{"rating": 5.0, "review": "If your tv is old and you need a throw device, this is the best choice. But remember, you need a smart device, like a cellphone or a tablet to control it!", "verified": true, "helpfulness": "0/0", "author": "Juliana Henriques e Silva"}, {"rating": 5.0, "review": "It's quite amazing, the capability of this little device.  The set-up is very straightforward;  I can easily imagine even complete Luddites mastering the installation.  Once streaming, it communicates directly with the router, so I can shut off the laptop/PC without affecting the streaming.  (Of course, I can't control (pause, rewind, etc.) the broadcast if the laptop is off!).", "verified": true, "helpfulness": "0/0", "author": "Anna Nguyen"}, {"rating": 4.0, "review": "Love the product but have some problems switching devices or programs at times. Have to log in and out a lot. Only does 720p. You will most likely have to plug it into the wall as the USB port on your average TV doesn't have the power to give fluid playback.Overall, can't beat it for $35 but it's not without it's bugs.", "verified": true, "helpfulness": "0/0", "author": "Michael WIllis"}, {"rating": 1.0, "review": "I purchased Chromecast fully aware of its limitation (can't play certain video formats, can only stream from Chrome browser, etc.). However I was not aware that the only way I will be able to stream ANY local video files without MAJOR \"choppiness\" will be to lower the transmission rate to 480p ... Well that is medieval resolution and unacceptable for this day and age. So beware if you're looking for a streaming of a local content (movies mainly) then probably look for a different device or go back to the HDMI cable as I did ...", "verified": true, "helpfulness": "0/0", "author": "Radimek"}, {"rating": 5.0, "review": "I use it all the time. I really like it.  I can put facebook or HBO go on my TV.  Awesome gadget.", "verified": true, "helpfulness": "0/0", "author": "JON  C VERMILYA"}, {"rating": 5.0, "review": "I gave this to my daughter as one of her Christmas gifts and she was very excited and pleased. She continues to use it often.", "verified": true, "helpfulness": "0/0", "author": "Claudia G. Smoak"}, {"rating": 5.0, "review": "No problems so far with it. Will update if some issue arrises. I really like the auto tv on feature.", "verified": true, "helpfulness": "0/0", "author": "Austin"}, {"rating": 3.0, "review": "As my first streaming device this product seems okay. I'm still getting used to it. Haven't used it as much as I should so I'll need to update review after further use.", "verified": true, "helpfulness": "0/0", "author": "Ajanawilks"}, {"rating": 5.0, "review": "It just works, that's about all I can say. Setup is quite painless and I have never had any problems with functionality. Now that they have opened up development, the possibilities are almost endless.", "verified": true, "helpfulness": "1/1", "author": "Ryan l"}, {"rating": 5.0, "review": "This is my second and I love it. Setup is quick and simple put this in my kids room and works so great. Recently got HBO Go and love it.", "verified": true, "helpfulness": "1/1", "author": "homie23mj"}]