[{"rating": 5.0, "review": "Great device, especially for the cost. Allows you to turn any  with an HDMI port into a basic smart TV with a compatible device.It even gives you instructions.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "Oh man... we love our chromecasts.  We purchased 4 for family at christmas and I have 2 in our home (100% of our TVs).  We have trouble with the app, but this is still a great product. It's a simple solution that should have been resolved years ago. There are other streaming devices, but this is my favorite due to size, easy of installation, and simplification of the product.", "verified": true, "helpfulness": "0/0", "author": "Kat K"}, {"rating": 5.0, "review": "pure shinny chrome! SO SHIINNNYYY", "verified": true, "helpfulness": "0/0", "author": "Keenan Hansen"}, {"rating": 5.0, "review": "Awesome. If you get one, be sure to check out the doodlecast app. Its like pictonary on your TV!", "verified": true, "helpfulness": "0/0", "author": "jessnw86"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "jose hernandez"}, {"rating": 5.0, "review": "Have used it only once but it worked fine.", "verified": true, "helpfulness": "0/0", "author": "joanne minetti"}, {"rating": 2.0, "review": "What a waste of money.  It disconnects all the time, the video quality is terrible when casting from my Galaxy Note 3 to my HDTV.  I get better quality , more consistent streaming from my blu-ray player.  Really can't understand the big fuss.  It would be nice to \"cast\" my laptop to the big screen but I did that better with an HDMI cable and a Bluetooth keyboard.  Really - why did everyone tell me to get this?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Home for the Holidays\""}, {"rating": 5.0, "review": "Love my Chrome cast, the only reason I don't get Amazon Prime streaming is because Amazon does not let one broadcast on Chromecast, and I really don't want another device. Just sayin'.", "verified": true, "helpfulness": "0/0", "author": "Duncan61"}, {"rating": 5.0, "review": "I gave up on my bleary player to get Netflix, etc.  Loving the Chromecast and a fantastic price too", "verified": true, "helpfulness": "0/0", "author": "72nSunny"}, {"rating": 5.0, "review": "Thank you great product  hope to do busniess with again", "verified": true, "helpfulness": "0/0", "author": "Michael Hurlbut"}]