[{"rating": 1.0, "review": "Tried to stream from youtube with this device and it did not work. Not cool Amazon, not cool.", "verified": false, "helpfulness": "1/7", "author": "Hose"}, {"rating": 4.0, "review": "just getting the feel for it", "verified": true, "helpfulness": "0/2", "author": "ALAN D MALCOLM"}, {"rating": 5.0, "review": "I am enjoying the Amazon Fire TV, so easy to hook up and to use, as well as a lot of different movies to watch as well as TV shows. I am really happy I decided to purchase the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "linda j hoyle"}, {"rating": 5.0, "review": "I am hooked  Got this for Christmas  Have an x box and a Roku 3  they are going on craigs list!  This is fast full of movies books games.  Have all the other steaming products beat.  Amazon also has the best customer service!I wish the world ran like amazon", "verified": true, "helpfulness": "0/0", "author": "Gary Felbob \"Papa Bear\""}, {"rating": 2.0, "review": "Update #3 - The remote is the problem with the unit turning off.While the unit is on and the remote has live batteries, they must 'talk' and keep communication open.  In this situation, the unit does not turn off but only sleeps and is ready to go and does not require manually unplugin and restarting.  So, the problem is that that a fresh set of batteries will be eaten/run down in less than a day... it's when the batteries go dead that the main unit then turns off, which requires the manual unplug/replug. (and replacing with a fresh set of batteries)Problem #1 - unit turns itself off.. no means to wake it up except to manually unplug the power supply and reconnect.  Not a friendly useful feature when you just want to sit down and enjoy a show.Problem #2 - EATS BATTERIES - in 1 week of setting this up we've used it about 4 hours to watch Netflix... it drained/ate THREE NEW SETS OF BATTERIES.  I have a battery tester and experimented a bit...  the device seems to be draining the battery at a  fast rate whether the unit is in use or not.At this rate, continuing to buy 8-packs of Duracell would cost around $400 a year for batteries.Obviously not a viable path...Tip - TAKE THE BATTERIES OUT AFTER EVERY CLICKOnce you find the movie you want, take the batteries out.  Our 4th set of batteries has now made it 3 days with this technique and still have a good charge... expect they might last a couple of weeks or more using it this way.To recap how to watch a movie using Fire TV:1) Turn on TV2) Disconnect power from Fire TV - wait 30-60 seconds,3) reconnect power to Fire Tv - wait a 1-2 minutes for start up4) Put batteries in remote  (maybe this should be step #2)5) Search for movie QUICKLY (we're trying to save battery life so, finding a movie via computer ahead of time can save a lot of search/battery life)6) Click Play7) Remove batteries from remote8) Relax and enjoy movie9) Put batteries back in remote if you need to pause the movie10) Repeat steps 7-9 as often as you need to Pause11) When movie is over, Turn off TV12) REMOVE BATTERIES from remoteIt seems like a lot, but it's really pretty fast and can become an automatic habit quickly.WARNING - if you forget to remove the batteries after viewing, be sure to have a fresh set available before sitting down with the family to watch a show.Problem #3 - Terribly limited Channel selection.And if you find an app or other way to get a Major channel like PBS it is missing most of the show programming.  Don't know if that's Amazon's limitation or the app maker (in this case PBS) - there's really no way to know who's applying the limits on apps.  Amazon limits it's searches to only show Amazon results, so it fits that they may be imposing restrictions on the way content is made available by apps.2 stars for a great Box, look and feel.  it looks awesome sitting next to my Roku 3 and wins hands down in the sex appeal rating.Amazon tends to offer great price/value and competes well with other product offerings.  So seeing Fire TV priced higher than the market leader Roku 3 device, and with a lot of beefier hardware features, I thought I was getting something like a Roku 3 on steroids.I love Amazon and buy almost everything from Amazon - great service, great prices.This product is really only suitable to someone who's an Amazon streaming prime fanatic that has no interest in an other providers.  For that tiny market, this is an awesome product.For the rest of us who like other services (Netflix, PBS, and a handful of other streaming tv stations) Fire TV simply doesn't work at all or has limited function.  Fire TV is currently positioned to sell Amazon streaming - it's not well suited for anything else.Fire TV is just a big disappointment.", "verified": false, "helpfulness": "2/6", "author": "Stephen"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "scott hancock"}, {"rating": 4.0, "review": "Easy to use. I hate the fact that it does not automatically f me with the HDMI cable for the he price you have to pay. They recommend a high price cable which takes away the discount price. Seems like Amazon is becoming somewhat greeded. You have to keep a Prime membership for just about everything!", "verified": true, "helpfulness": "0/2", "author": "Elizabeth H."}, {"rating": 5.0, "review": "Easy to install, easy to operate. Great product", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy.  Love it", "verified": true, "helpfulness": "0/1", "author": "Diane L. Hilton"}, {"rating": 5.0, "review": "This is a great device, and I'm giving it 5 stars because it performs admirably.  In fact, I just bought a second.  That said, I have just been disappointed to learn that while the Showtime Anytime app works great on the Kindle Fire HDX with DirecTV as the provider, DirecTV is not even listed as a provider with the Kindle Fire TV device.  Why would DirecTV support an app on one Kindle Fire device and not another?  So unexpected and so disappointing!  Nevertheless, this device does now support HBO GO and thankfully DirecTV is on the provider list.  The Amazon Fire TV is definitely the go to app for streaming capability.  Now if the providers can get it together with Amazon, we'll all be in hog heaven, at least streaming-wise :-)", "verified": true, "helpfulness": "2/3", "author": "J. Hentz \"Judy\""}]