[{"rating": 4.0, "review": "We found out as we were connecting it that it would not work with our router and we had to go buy a new router. We had not expected that according to the advertisement, etc about the simplicity of hooking it up. We also have found that free viewing choices are limited. You may watch a first episode or series for free only to find that subsequent ones require payment. We are still getting used to it. Have not found our favorite creative shows. The voice control is very good so far!", "verified": true, "helpfulness": "0/0", "author": "Sheila K. Harris"}, {"rating": 2.0, "review": "For the money, get something like a google chrome. Cannot get sports radio stations I want, cannot get sport stations I want, very confusing on how to get the ones they offer, Netflix does not work, keeps saying \"unable to process your account at this time\", and it is cheaper to rent a movie from Redbox than through Amazon, and Redbox has more up to date releases.", "verified": true, "helpfulness": "1/6", "author": "Maria"}, {"rating": 4.0, "review": "We view Prime Videos and Netflix, Roku still has the lock on performance with these two content suppliers. The voice search on Fire TV is fantastic and we use it exclusively for Prime. Video performance is also superb on Fire TV for Prime videos. But Netflix has to reload frequently during playback. We have a commercial high-speed wired Internet connection with virtually unlimited bandwidth and so my portal isn't an issue.We own 5 video streaming devices:  Google TV, ChromeCast, Roku, Roku Stick, and Amazon Fire TV. Only the two Roku devices can play videos without buffering delays for both Prime and Netflix (ChromeCast doesn't play nice with Prime because of the never ending childish war between Google and Amazon).Google TV buffers Prime frequently, but streams Netflix perfectly.Fire TV buffers Netflix frequently, but streams Prime perfectly.Roku and Roku Stick stream Prime and Netflix perfectly without any buffering. If Roku had a convenient search feature for Prime and Netflix like Fire TV's Voice Search then it would be the undisputed leader.For ease of use on our main TV, we use Google TV for Netflix and Fire TV for Prime. On our secondary TV in the bedroom we use Roku.Fire TV is an excellent device and if Netflix buffering problems were resolved it would be our streaming device of choice. If they were able to link the voice search to both Prime and Netflix, Amazon would have the market leader, hands down.We have been an early adopter of streaming devices (except Apple TV--we don't use iPhones) and haven't yet found the perfect device for our two video streaming content choices. We've done no testing on HULU and the other 6 million content providers because we don't use them.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Easy to install.  Please be aware, it is not \"live\" streaming video.  But very entertaining and well worth the price. A plus,  easy to carry. About the size of a CD...learning curve for both Amazon and customer, be patient.  Also, we have had difficulty with the voice recognition. Not as easy as Gary Busey makes it look like, but not a major issue, as this happens with most voice recognition devices, we are true Southeners, as such have the same issues with everything...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"aarenn(AprilR)\""}, {"rating": 5.0, "review": "Really like this gem.  Does everything we wanted and more.  Fire TV is especially useful if you have AMAZON Prime.  Literally hundreds of programs and movies to watch for free.  Wi Fi feature works flawlessly.  Would certainly buy again and at current price is a real bargain.  Does anyone \"need\" this gadget?  probably not but it sure is a lot of fun.", "verified": true, "helpfulness": "2/2", "author": "Ed Pie. \"nkdgolf\""}, {"rating": 3.0, "review": "It is a good product, however the search functions suck and the app interfaces need to be revamp for ease of use.", "verified": true, "helpfulness": "0/1", "author": "Eugene"}, {"rating": 4.0, "review": "The menu isn't as friendly as I would like. It is hard to tell when you are just selecting something from prime or another subscription service but my hope is all of that will be resolved soon. Other than that I love it.", "verified": true, "helpfulness": "0/0", "author": "rovermedic \"PJ\""}, {"rating": 5.0, "review": "Amazon Fire TV is easy to use. I have selected some of my favorite educational TV series such as Dalton Abbey and been able to view all of the old ones that I missed! I've even found some new series such as Cranford that I like. I like being able to select a WishList that comes up on the screen for me to view in an instant when I'm ready to watch TV.I'd like to see more award winning movies available and some good exercise videos such as for Tai Chi and Yoga. But so far I am truly enjoying this device! Bravo to Amazon!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Found myself using more then I thought I would. Would recommend to others.  All those who read this  know this already.", "verified": true, "helpfulness": "0/0", "author": "Gina Alvarez"}, {"rating": 5.0, "review": "After moving from a large metropolitan area to a rural area, it was a huge cultural and technology change.  The services are 10-15 years behind.  The cable (on Demand) was never updated with the new episodes of TV shows and we were missing episodes.  I just got tired of the lousy service.  I saw a commercial for the Amazon Fire TV and ordered it.  I have caught up on seasons/episodes of shows I just started watching.  I am very pleased with the Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "K. Fields"}]