[{"rating": 2.0, "review": "Sent it back and went with the Roku. The voice search was nice, but not how it always pushed you to Amazon content at cost, when you had the same available as part of your other subscriptions with Netflix or Hulu.", "verified": true, "helpfulness": "0/1", "author": "Montana Mama \"Julia\""}, {"rating": 5.0, "review": "I LOVE LOVE LOVE the Amazon Fire TV.  Bought it for spare bedroom so my grandson could play games and watch movies.  It is wonderful.", "verified": true, "helpfulness": "0/0", "author": "DS Nichols"}, {"rating": 5.0, "review": "I love it!  It was very easy to install for a techno-phobe!  I enjoy something new every day.", "verified": true, "helpfulness": "0/0", "author": "Many cats \"ZZ\""}, {"rating": 5.0, "review": "This puppy is nice and fast....  I have a Google chromecast as well,  which will lag on Netflix occasionally.....  No such issues with the Amazon Fire Box.....  And the ability to sideloading apps make it an indispensable tool for finding and watching various media. A must have. If you were on the fence about picking one up,  let this review convince you to click that \"add to cart\"  button....", "verified": true, "helpfulness": "0/0", "author": "Edward Nevermann"}, {"rating": 4.0, "review": "Terrific for Amazon Prime Members!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I really wanted to fall in love with this little device.  It has a decent interface, setup is easy but would have been much easier if I could attach a keyboard somehow.I also am extremely disappointed that you cannot by default plug in external USB drives into the Fire TV.  I know this before purchase so I wasn't surprised.  However this device could be a full media TV device.  Now I still have to have a media server.  I've gotten around this for the time being by using Plex Media Server on my current media server and the Plex App on the Fire TV.The voice search actually works well...if you have Amazon content you want to find.  These other apps (read Netflix, Pandora, Plex) need to either be allowed to integrate with voice search or get their apps to do so if it is already allowed.Lastly it would be great if we could customize the home screen and have some sort of date/time show up somewhere.", "verified": true, "helpfulness": "0/0", "author": "gitrdone564"}, {"rating": 5.0, "review": "Works great easy wifi setup!", "verified": true, "helpfulness": "0/0", "author": "jeff howard"}, {"rating": 5.0, "review": "Exceeded my expectations. Very impressimpressed.", "verified": true, "helpfulness": "0/0", "author": "santosh pullala"}, {"rating": 5.0, "review": "Wonderful devise. I had no problem figuring out how to use it and so much to do. The only draw back is I have limited broadband usage (we live in the mountains and must use satellite service and tho I pay more I still am limited) so must pick my programs carefully. There are so many choices it is tempting to binge watch and that would use my time so am enjoying limited usage. If they ever figure out to how to get fiber optics way out here or lower the cost of usage I will be able to use it more. Great devise tho!!!", "verified": true, "helpfulness": "0/0", "author": "Donna from Milo \"chocaluah maker\""}, {"rating": 5.0, "review": "It's great if you have prime account, Netflix, and some other paid subscription.  It's a one stop shop.  I haven't really test this but it would be nice if an external hard drive can be plug in to play various file media format.  This would be a complete package.", "verified": true, "helpfulness": "0/0", "author": "Review it"}]