[{"rating": 5.0, "review": "While I live overseas and have limited access to many of the useful apps on Chromecast, such as Netflix etc., I have been delighted at how easy it was to setup and work on turning my old non-smart tv into one capable of at least displaying Youtube streams.", "verified": true, "helpfulness": "1/1", "author": "Terence"}, {"rating": 5.0, "review": "This couldn't be easier to install.  It does exactly what it says it will do. Stop watching on you computer and move to your TV.", "verified": true, "helpfulness": "1/1", "author": "Christy R."}, {"rating": 5.0, "review": "Bought this for my wife for Christmas, She loves it!! Easy set up, but I still followed a youtube video", "verified": true, "helpfulness": "0/0", "author": "Booky"}, {"rating": 3.0, "review": "Works great on Netflix and YouTube. Does not support streaming from chrome on mobile. Does supportitfron chrome on laptop but was jittery / long delay", "verified": true, "helpfulness": "0/0", "author": "RabbitFood"}, {"rating": 5.0, "review": "I watch way too much stuff on this. More apps in the future too. I used to watch Netflix on my PS3, but this is so compact and a smaller footprint that I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "J. Balancio \"casual listener\""}, {"rating": 5.0, "review": "What can I say?  This device works perfectly,  the price is good, and it's simple to install.  I use it to stream Netflix.", "verified": true, "helpfulness": "0/0", "author": "Rick D"}, {"rating": 5.0, "review": "The best :) , works prefect, i love it, and the upgrades are perfect, worth it, waiting for more aplications", "verified": true, "helpfulness": "0/0", "author": "Diego Serra"}, {"rating": 5.0, "review": "Great little purchase to turn your computer screen into your large TV screen wirelessly and fast with less lag time .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am loving it... We can watch videos from youtube, netflix and many other apps...simply we can cast any tab from google chrome on our computer  to TV>>>> device :)", "verified": true, "helpfulness": "0/0", "author": "kalyani"}, {"rating": 2.0, "review": "If you are looking for a device that allows you to mirror your laptop, smart phone, etc. to a non smart TV then this will work for you. The browser isn't the best, the interaction is limited, and the software is very restrictive. If you want to make you TV a smart TV then I'd recommend looking for something akin to a Roku. save your money.", "verified": true, "helpfulness": "0/0", "author": "A. Davis \"Amazon Warrior\""}]