[{"rating": 5.0, "review": "Best stremar player .fantastic pictures quality.", "verified": true, "helpfulness": "0/0", "author": "TEJASH"}, {"rating": 5.0, "review": "Very nice appliance. Streams without buffering and the HD is very clear.", "verified": true, "helpfulness": "0/0", "author": "Marco P"}, {"rating": 5.0, "review": "We love it. Have had no problems. It's very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jason Lovallo"}, {"rating": 3.0, "review": "Amazon Fire TV was easy to set up.  Disappointed in two items.  1.  The quality of shows that I found listed available are what I would pass in the big pile of DVD movies at Wal-Mart.  Are there some better ones I am missing?  and 2. It would be nice to have a print out available from Amazon Fire of all Movies without having to look them up one by one.  May that is why my number one complaint is what it is.  This looks like a good deal but now I am beginning to wonder if I am missing something.", "verified": true, "helpfulness": "0/0", "author": "James Ramsey"}, {"rating": 4.0, "review": "Packaging for this product was excellent.  On-board welcome video was excellent.  Both manual and voice commands were easy to use. The quad core processor speed is excellent.  Amazon now needs to take Fire TV to the next level by adding entry icons for the major networks.", "verified": true, "helpfulness": "0/0", "author": "Michael R. Hurn"}, {"rating": 3.0, "review": "I am satisfied, actually happy with Amazon Fire for all the same reasons that other reviews state.  However, I am extremely frustrated that Netflix does not work properly.  I re-booted the unit several times, uninstalled and installed the Netflix app many times, cleared the cache, and a bunch of other things to get it to work.  I somehow finally got it to work but the next time I turned on my TV it didn't work.  I was so frustrated trying the same things to resolve the issue that I just don't use it for Netflix.  Netflix was a huge reason why I bought it in the first place so this is very disappointing.", "verified": true, "helpfulness": "0/0", "author": "E. Bae \"Pug Mama\""}, {"rating": 3.0, "review": "The device has some strong hardware. UI and the remote are very responsive. Unsurprisingly it is all about Amazon Prime and watching Amazon videos. The standard Netflix and Pandora all work well but they are tucked away in the corner not to take attention away from the latest Amazon Prime Videos or Music.I am not happy that Amazon makes it hard to launch third party apps that are not available on the Amazon app store. There is no way to put a launcher on the home screen. You must go to Settings -> Applications-> Manage third party apps.  Once you finally make it to that screen you can launch the application. There are some hacks to get third party launchers working from the home screen but it is not an easy task for your average Joe or Jane to do.Amazon has put in features to prevent you from rooting this Android device. Amazon has deployed eFuse in the FireTV. An eFuse is a mechanism in a computer chip’s programming that allows the chip to change its behavior in response to an event. If the FireTV detects an old bootloader with latest software it gets triggered. This will prevent you from rooting your device again. With the destructive nature of the eFuse it feels like I don't own the FireTV, I paid $99 for a lifetime rental from Amazon. This all takes away from the open spirit of Android for me to hack away at it and see what interesting things I can come up with.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Love it.", "verified": false, "helpfulness": "0/0", "author": "Tony Negrete"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Ann P Spruill"}, {"rating": 5.0, "review": "The fire was easy to set up and has proven easy to use.  The picture clarity it provides is very good.", "verified": true, "helpfulness": "0/0", "author": "Frances Thomas"}]