[{"rating": 3.0, "review": "I wanted to use this to cast presentations frommy tablets.  Well you can't cast powerpoints oreven jpegs yet. Supposedly you can do it somewhat fromChrome browser tabs, but one of my tablets is too old to use chromeand the other is too new for the cast extension.I really did not care about playing youtube videoson my tv.  But I would like to play re-runs of showson cbs.com, which are not on hulu, and there isn'ta cbs app that will cast.  It probably would work bycasting it from a browser tab, but that takes me back tothe first problem.", "verified": true, "helpfulness": "0/0", "author": "J. Lane"}, {"rating": 1.0, "review": "I bought this device under the pretense that it would cast audio/video streaming off of the internet from my computer to my TV.  And, it did, right after I bought it, a couple of months ago.  \"It was slick.\"  I bought it to stream ESPN (or any other) sports from my MAC desktop to my TV.  I tried to cast streaming a short time ago, and it wouldn't do it, anymore.  I tried everything imaginable to resolve the malfunction, to no avail.  I called Google Tech Support, they ran me through a series of tests, and finally told me that there was nothing wrong with my device, my equipment, my software, or my internet speed.  The problem was at their end with the software of this BETA version.  It would work okay for YouTube, but I couldn't care less about YouTube and some of that other stuff.  It won't cast my streaming off of the internet, which is why I bought it.  I was told that the engineers would eventually get this problem ironed out, but what good does that do me?  I tried it again, just last night--it still doesn't work.  As far as I am concerned, Google Chromecast is a major failure, and a piece of junk.  And I'm out $35.", "verified": true, "helpfulness": "0/0", "author": "Shellcaptain"}, {"rating": 2.0, "review": "The name implies synergy with the Chrome browser, but casting is not supported on Chrome for Android. It would not connect to our non-broadcast Wi-Fi network SSID. Lack of DLNA support requires installation of third-party media servers, requiring time and additional setup. We already have Netflix and other services available through our TV, DVD player, and WD TV Live Media Player. Chromecast added no new features for our use.", "verified": true, "helpfulness": "0/0", "author": "David A Lieser"}, {"rating": 5.0, "review": "Thank you.It works very well, but unlike hdmi cable where u can have multi screen, this one only allow one screen on TV, but the quality is amazing.", "verified": true, "helpfulness": "0/0", "author": "Neiva"}, {"rating": 4.0, "review": "Great product, easy to use. Mix it with an application like Plex and stream all movies regardless of codex to any screen.", "verified": true, "helpfulness": "0/0", "author": "moonshinee"}, {"rating": 4.0, "review": "I have a setup where all my music that I download is instantly uploaded to Google Play Music which I can stream to my Chromecast connected to my main TV, which is connected to my stereo system. My setup seems complicated, but making music play on my TV was dead simple. This device is something everyone can afford and everyone should have.Pros:Extremely simple to setup and use.Small and unobtrusive design.Works on any screen with HDMICons:SDK not released yet, so a lot of potential waiting to happen.A few issues here and there with disconnecting, but rarely happens.HDMI doesn't power the device, but I'm not so certain it could be.Overall: If you're considering buying this device, do it. It's better and easier than using a Roku, unless you don't have a smartphone or some computer. Any iPhone, Android device, or PC/Mac is able to push content to this device.", "verified": true, "helpfulness": "0/0", "author": "Kraid"}, {"rating": 4.0, "review": "Works for netflix and HBO go but no support for xfinity services is why I did 4 stars. need word.", "verified": true, "helpfulness": "0/0", "author": "2wheels_engine"}, {"rating": 5.0, "review": "I bought this on a whim to see what I could do with it, and at $35 it wasnt too expensive. Fast forwar to today and it's one of the most used items in my home. The wife is always casting netflix  and loves it.", "verified": true, "helpfulness": "0/0", "author": "Ambrose Mazion"}, {"rating": 5.0, "review": "I hardly every write a review, but this one is is highly recommended. I actually hooked it up to a portable projector and it works perfectly. I have moved it to 4 different TVs and have had no problem. You wont go wrong with this one! Like it a lot!", "verified": false, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "Though Google has been FAR too slow rolling out supported platforms, if you use Netflix, you'll love this device! We have two now and though we prefer the Roku 3 for the family room, this is great for the \"extra\" TVs.", "verified": true, "helpfulness": "0/0", "author": "GeeBee \"caffeine-junkied insomniac\""}]