[{"rating": 5.0, "review": "Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Amazon, what a great idea!  But with my learning disability,  new technology has to be compatibly devised!", "verified": true, "helpfulness": "0/0", "author": "Sydney M. Foor"}, {"rating": 4.0, "review": "Wish the next upgrade be voice search across all platforms. Love it and my kids", "verified": true, "helpfulness": "0/0", "author": "Abe"}, {"rating": 4.0, "review": "Had Roku Xd and XS and after one of their updates bricked our Roku (they had me jump through hoops and go back and try to create static addresses, and what not to the point of me taking a good three days of tweaking and it still didn't work) so I said \"f\" it and went fire tv.  Nearly all the same video options (prime, netflix, crackle, nbc sports-via a mirror through my kindle but easily doable if you have both, espn) so I won't miss Roku.", "verified": true, "helpfulness": "1/1", "author": "stayathomedad \"stayathomedad\""}, {"rating": 5.0, "review": "Very good unit", "verified": true, "helpfulness": "0/0", "author": "Sunny Joshi"}, {"rating": 5.0, "review": "Awesome device! I replaced my Apple Tv's w them. I just hope they continue to expand the offerings and keep a pro-consumer approach Apple abandoned along time ago", "verified": true, "helpfulness": "0/0", "author": "Brent Carter"}, {"rating": 5.0, "review": "The Amazon Fire TV was exactly what I ordered, arrived promptly and worked as advertised. It has allowed me utilize all the prime movies as well as movies from all other sources and it easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Carl Yaney"}, {"rating": 5.0, "review": "After three months of use....I am pretty darned pleased with this.  Set up was super easy, selection options are great, no performance lag issues and we really like the voice control remote (big hit with the grandkids).  Perfect for getting some additional use out of my Amazon Prime membership.  My wife, at first, was sceptical....here we go again with yet another electronic \"thing\"....she has since come over to \"the dark side\" and it wasn't just for the cookies.  :)", "verified": true, "helpfulness": "2/2", "author": "zofoman"}, {"rating": 5.0, "review": "I just love this. If you have Amazon you have to have at least one per TV", "verified": true, "helpfulness": "0/0", "author": "James McKeown"}, {"rating": 5.0, "review": "We love fire tv. Voice search works great. We are amazon prime members and use netflix a lot", "verified": true, "helpfulness": "0/0", "author": "JP"}]