[{"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Kathy Holden Proctor"}, {"rating": 3.0, "review": "Would like the Google play store. I should not have to buy apps in different android markets. If o already bought it in Google play why should I have to buy it on the Amazon store", "verified": true, "helpfulness": "0/0", "author": "Donald OClsir"}, {"rating": 5.0, "review": "Very nice investment, played family board games on it and love watching you tube", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love it. Being a long time Amazon Prime member, now I get to use more benefits beyond free shipping. Good range of content for kids and adults included with Prime membership. I've also reduced my cable service which saves me about $50 per month. The fiber optic connection to my home theater system provides very good 5.1 surround sound. Still learning the User Interface,  but my 8 year old has already mastered it. My only wish is for an in/off control function on the remote control.", "verified": true, "helpfulness": "0/0", "author": "Steven G. Testrake"}, {"rating": 5.0, "review": "Awesome love it! Perfect for all entertainment!!!", "verified": true, "helpfulness": "0/0", "author": "Peter Simos"}, {"rating": 2.0, "review": "Not impressed at all with this device. Can watch the stuff from dish on the go which is why I bought it.  For Hulu and Netflix it's ok.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love it, love it, love it!!! So easy even a 50 something year old woman can use it.  I had Apple TV but couldn't use my Amazon Prime.  This does it all.", "verified": true, "helpfulness": "0/0", "author": "EMH"}, {"rating": 5.0, "review": "Great! so easy to use. Tried to see movies on Pc with cable to tv. This is so easy and it used wifi.", "verified": true, "helpfulness": "0/0", "author": "John McDonald"}, {"rating": 5.0, "review": "awesome purchase. Love talking into the microphone. Actually a bit better than apple TV :-). must get primtetime to fully enjoy", "verified": true, "helpfulness": "0/0", "author": "Jonathan G."}, {"rating": 5.0, "review": "Awesome service!", "verified": true, "helpfulness": "0/0", "author": "L. V. Sales \"Dakota Harrison\""}]