[{"rating": 5.0, "review": "fantastic, can't wait for more 3rd party apps to come out.  Right now it's pandora, youtube, hulu plus, and netflix.", "verified": true, "helpfulness": "0/0", "author": "Andrew Woodle"}, {"rating": 5.0, "review": "The Chromecast met my expectations. I did extensive research on the item before I purchased so I knew exactly what I was getting. It has performed exactly as described and I use it on a daily basis to stream Netflix, HuluPlus and sometimes my Chrome browser to my 55\" television. It does everything seamlessly. My tv is actually a smart tv, but the Netflix and Hulu apps tend to lag when played directly from the tv itself. This doesn't happen with the chromecast. I highly recommend the Chromecast to anyone who would like to stream these apps to their tv.", "verified": true, "helpfulness": "1/1", "author": "Miss Understood"}, {"rating": 3.0, "review": "Performs well (with limited interruptions) but not as originally advertised by Google. Notably, Google only belatedly indicated that will not install/operate with Microsoft Vista and can not be installed from a PC hardwired to router. Disappointing that Google did not thoroughly test their product before release.", "verified": true, "helpfulness": "0/0", "author": "Herbert Burstein"}, {"rating": 2.0, "review": "Too complicated set up. For some reason it generated a second Netflix account. I am giving this thing up and have canceled Netflix forever. Will stick with DVDs or nothing.", "verified": true, "helpfulness": "0/1", "author": "Betty T. Belote"}, {"rating": 5.0, "review": "OMG THIS THING IS FUN!!! I chrome cast everything! it works better than wirless tv you should try this its fun", "verified": true, "helpfulness": "0/1", "author": "FLENNER"}, {"rating": 5.0, "review": "It does exactly what I need! I don't have a smart TV, this makes my TV share the internet, videos, & music perfectly.", "verified": true, "helpfulness": "0/0", "author": "BroncoP3t3"}, {"rating": 3.0, "review": "It only works with YouTube or Netflix. I was expecting to could see my favourite videos from the tablet to the TV, but Netflix is not enough. Even though the product works perfectly.", "verified": true, "helpfulness": "0/0", "author": "lanerot"}, {"rating": 4.0, "review": "works well and easy to set-up.  Somewhat limited in its functionality but for the price it does everything expected of it.", "verified": true, "helpfulness": "1/1", "author": "Brandon Bogart"}, {"rating": 5.0, "review": "ItsGreat! It is affordable, inexpensive and portable. I dont wait for more apps for the chromecast, this product has a big future", "verified": true, "helpfulness": "0/0", "author": "someone"}, {"rating": 4.0, "review": "This thing is great so far. I'm using a macbook and i-phone to stream things. Couple of draw-backs for apple users right now: You can't cast the hulu app currently from the i-phone. I have also had some connection issues when casting chrome from my mac-book. However, this is still a relatively new product and they're working out the kinks. I trust google to figure out some of the issues and grant wider access to other streaming app's down the line...for the price, it's been well worth it compared to the other options.", "verified": false, "helpfulness": "0/0", "author": "James Allison"}]