[{"rating": 4.0, "review": "EDIT: 7/2/14 - My box got the update that was promised and I now have prime browsing! I am adjusting the review to four stars. Still one star down due to limited options so far for apps. As an overall ecosystem, it is a bit barren at the moment, but it is certainly the best way to enjoy prime content. I still prefer my Roku for Vudu and 7.1 sound, but even it would only get 4 stars out of me for various little issues it has. I have also come to really enjoy the gaming options available on the FireTV. It is poised to be THE streaming box to have..EDIT: 4/23/14 - Amazon has announced that they will be adding Prime browsing in a future update as well as expanding voice search to other services. I look forward to changing my review and rating when that hits. I trust Amazon on their word so I will keep the FireTV for a while longer. My credit card gives me 90 days return protection. If Amazon has not lived up to their promise, I will try to return it to them, but either way I will not be out my $99... However, I do not believe that will be necessary.I am frustrated and kind of angry...  I expected better. I will give them some time to fix it, but if they don't, it is going back..  I will just copy the text from my help forum post here. Please correct me if my observations are incorrect...So why in the world would the Roku Amazon interface be better than the flagship device from Amazon?Please tell me I have missed this, but where on the FireTV can I browse Prime only content???Say I want to browse SciFi Prime movies.. On the Roku, I select \"Prime Instant Video\" in the app and then go to the genre I am looking for and browse away...On the FireTV, I can only see paid and free content together and I have to click on a movie to see if it is prime or paid?!?! That is a load of excrement!I suppose the only beta testers were with Vine members who are more interested in telling Amazon how great this thing is rather than giving them real feedback (or they just ignored honest ones), which is \"your sit-down interface to prime content stinks\"!! Fix it or I will be sending mine back before the 30 day return window is up...Also, why is my video library, what is supposed to be stuff I OWN, filled with stuff I do not own on FireTV? When I go to \"My Library\", I want to see MY LIBRARY, not a bunch of stuff you want me to buy........ Geez Amazon, really??? I am a big fan, but you have hit a foul on this one.... \"My Library\" on Roku shows my stuff only, as it should....I am not sure how anyone could say this is a good box for prime members...  unless you are the business major who designed it and think you can trick people into buying stuff if you make the \"free\" stuff hard enough to find...Someone please tell me I am just stupid and missed something....  Geez I feel hustled here...Yes, this has the potential to be GREAT, but greed got in the way.. Shame on you Amazon!", "verified": true, "helpfulness": "14/21", "author": "S. Emert"}, {"rating": 1.0, "review": "CAME IN WITH THE BATTERY CASE JAMMED SHUT AND, ASIDE FROM A TEN POUND HAMMER NO WAY TO OPEN IT.  MAYBE ROKU WORKS BETTER", "verified": true, "helpfulness": "6/37", "author": "John Myers"}, {"rating": 5.0, "review": "This will be a short review as I have a couple of days to study and the only competing device is a BluRay player. This device is about as perfect as I have seen for construction, performance and packaging. It installed easily with friendly directions. The only slight problem I had (on my second unit) was opening the battery compartment. Stronger fingernails might have helped.The box it comes in is a rhapsody of design. Beautiful, effective and worth an award by itself.The menus in the Fire TV are intuitive, fast and simple. Video reception of HD material is like playing a DVD. Steady and fast.My main TV has only two HDMI inputs. I need one for DTV, one for BlueRay player and one more for the Fire. I used an HDMI switch MarginMart, Inc. PET0301D HDMI 3-In 1-Out HDMI Auto Switch with 1.5 ft. Cable pigtail which accepts three inputs for one output. I put the BlueRay and the Fire on HDMI2 with the switcher (a marvel itself). Because the Fire is always outputting a signal unless unplugged, it must be in a higher position (2) than the BR (position 1) which actually turns off it not needed. The switcher will input the BR when it is turned on. It switches to the Fire if the BR is off.I purchased a second unit for the TV in my home office. The two units use Bluetooth communication with the remotes so they don't interfere with each other as far as I can see.I also ordered a game controller for both, they are back-ordered for later in the month. I'll play the whizzy Deer Hunter 2014 app. if nothing else. They seem overpriced but will sell anyway for now.From reading the early reviews, it appears Amazon has delivered a knockout blow to the competition. As an engineer who has designed many products over the years, I'm impressed.Later: I neglected to mention the blockbuster voice search function which catches my wife's and my orders flawlessly. This seems limited to searching Amazon content only but for us, extremely useful.Connection to Netflix and Pandora was equally easy and fast. Pandora's menus are perfect and the Fire TV screen saver scenes beyond description. Netflix video was seamless even in HD.The small physical size was easy to hide. Since it uses Bluetooth (not IR) to link unit to remote, it does not need to be visible from your couch.", "verified": true, "helpfulness": "4/5", "author": "John Curtis \"jgcurtis\""}, {"rating": 4.0, "review": "Pro: Nice and fast UI, with all the apps I need. High Wife Acceptance Factor. Good remote.Cons: Useless wifi. What on earth have they used as antennas for this device? I had the even tinier Chromecast in the living room before, which had no streaming problems what-so-ever, but the Amazon FireTV really struggles, and stops to buffer when I'm watching content from Netflix or my Plex Media Server.", "verified": true, "helpfulness": "2/6", "author": "Roy Berg"}, {"rating": 2.0, "review": "I am big Amazon fan. I have and adore my Prime account. My son uses his Kindle far more than any other screen in our household. I've always found Amazon to be very up front and forthcoming about their products and pricing.With all that said, I am very disappointed with the Fire TV. While the device is one slick piece of technology, the interface is skewed horribly toward Amazon content. I subscribe to Netflix and Hulu PLUS in addition to Amazon Prime so imagine my frustration when their key selling feature, voice search, only functions with Amazon content. This should have been disclosed in the description of the feature. Also while using the device I always felt like the interface was forcefully steering me toward making a purchase from Amazon. I paid for the device so I don't feel I need to be up-sold every time I try to get to Netflix so my son can watch something from the Discovery channel. Its almost like the interface is telling me \"But wait, why watch Raging Planet for free on Netflix when you could buy it from Amazon.\"The device has a lot of potential but in its current state does not hold a candle to what Roku offers . First item I purchased from Amazon that I will be returning. Fortunately, my Roku 3 is arriving tomorrow.", "verified": true, "helpfulness": "27/31", "author": "James Wilson"}, {"rating": 5.0, "review": "Works like a charm!  Loads and turns on fast! In just a few seconds it is ready to go.  Easy to use and navigate, now if they would add the ability to rate shows, movies and music, it would be perfect! Netflix loads 2x faster than the PS3 version and better picture quality too.  Doesn't get the picture quality degradation as it tends to do on PS3.  Low power too, the power plug displays 16 watt!  It does get a quite a bit warm, wouldn't run this in a non cool area without a fan cooling it.Will update in the future on how it's going", "verified": true, "helpfulness": "2/5", "author": "Samuel N"}, {"rating": 5.0, "review": "My Fire TV and HDMI cord with ethernet arrived today, and I simply followed the directions.  Voila!  I am now streaming Hulu, Netflix, Amazon Prime, Pandora, and many more.  I believe the entire setup including updates was 15 minutes.  The remote is small, simple, and efficient.  I could not be more pleased.Amazon, I think you hit this one out of the park!", "verified": true, "helpfulness": "5/10", "author": "T. Goodman \"Book Lover of Many Years\""}, {"rating": 2.0, "review": "Like the Specs but hate the in your face buy this buy that interface.Even when you have a Amzon prime membership to play free content you will not know it untill about 3 uneeded clicks in the interface \"Rubish\".There needs to be a future to only show free content supplied by your amazon prime membership in an update or this is a bust for me.Pushing all the paid content in your face is a no go when you have kids in the house even with Parental controls. I see a lawsuit coming in the future for Amazon over child purchases just like Apple. Please update the software to have a kid friendly ecosystem without having to pay for a kid service on the side monthly LOL.If Amazon changes the interface to have a selection of only free content \"Prime membership wise\" I will change my rating, Otherwise they can shove it somewhere.", "verified": true, "helpfulness": "11/16", "author": "Kevin Johnson \"kj\""}, {"rating": 4.0, "review": "It's a pretty good device, running fast and smoothly. But on app side, it's a premature product. I can't believe that it doesn't come with amazon cloud player and kindle reader for example ... I could use the big screen in my bedroom for some reading while listening to my music, right?Anyway, Amazon, to make this into an amazing product, you need to make apps, tons of old and new apps. Don't let your programmers ever go to sleep!!!", "verified": true, "helpfulness": "1/2", "author": "John Hawkins \"johnny\""}, {"rating": 5.0, "review": "This is by far faster more features and better picture than all. One online bit of kit  to rule them all!!!!", "verified": true, "helpfulness": "3/6", "author": "Shane Gates"}]