[{"rating": 4.0, "review": "It plugged in and gave me, a non computerized person, a few missteps but it all installed easily. I was watching different videos from the net fairly quickly.  I can recommend this adapter to anyone that wants to enlarge their options.", "verified": true, "helpfulness": "0/0", "author": "John Spradlin"}, {"rating": 3.0, "review": "Do not recommend. It works great with youtube, but not Amazon.", "verified": false, "helpfulness": "0/0", "author": "Chris White"}, {"rating": 5.0, "review": "Very easy to use. you can watch everything using the chromecast. awesome product.", "verified": true, "helpfulness": "0/0", "author": "baca_ar"}, {"rating": 5.0, "review": "Love this. Easy to install and use. Works on most devices.", "verified": true, "helpfulness": "0/0", "author": "thesingularity24"}, {"rating": 5.0, "review": "Fantastic little gadget. Works great. Many free apps. Not necessary to even have a Netflix or Hulu Plus account, however you get 2 months free of Hulu Plus. Definitely worth buying especially in comparison to cable costs. Media is crystal clear.", "verified": true, "helpfulness": "0/0", "author": "Purpleskye810"}, {"rating": 5.0, "review": "Great, inexpensive, little streaming player!  \"Mirrorcast\" screen mirroring works great!  WiFi connection is never a problem on your home network but sometimes it is a little finicky if you bring it to a different location when first trying to connect it to a new network.  My only real gripe is there is no Amazon Streaming App!!!", "verified": true, "helpfulness": "0/0", "author": "Dr Nick"}, {"rating": 5.0, "review": "AWSOME", "verified": true, "helpfulness": "0/0", "author": "Felipe"}, {"rating": 2.0, "review": "Sticking with my Roku.Not sure what the big deal is with this.  Bought one just to try it out and see if I was missing something.In terms of ease of use . not even close to Roku.It also seems the video quality is not as good.I used Crackle as a test case.  Using my Windows 7 pc as the client.  I was able to start the movie ... and it wasnt the best experience butI did it.  Then I found I could not pause/stop or control the movie playback in anyway!  Very bad.  Had to reset Chromecast to get it to stop playing.I did think it was cute that I could mirror my cell phone output .  In fact it was a better playback experience with Crackle as at least I couldcontrol the playback as it seemed to strictly mirror the phone.  But again the video quality was so so.Maybe I'm not doing the special thing that Chromecast is better at then Roku ?  It is cheaper I suppose but not by much.  Roku is a much better experience ... and I expect the other similar Roku like devices are as well.", "verified": true, "helpfulness": "0/0", "author": "Lawrence S. Cohen \"hillrider\""}, {"rating": 5.0, "review": "Just Awesome!!!", "verified": false, "helpfulness": "0/0", "author": "Jake"}, {"rating": 3.0, "review": "works great for netflix but wont cast without being choppy on anything downloaded above 720p  it only streams 480p and less", "verified": true, "helpfulness": "0/0", "author": "Seth K."}]