[{"rating": 5.0, "review": "Works great. Any youtube videos i watch on my ipad i can now watch on my big 55' HD TV easily. The quality of the stream is very good too. looks great!", "verified": true, "helpfulness": "0/1", "author": "Todd izzo"}, {"rating": 4.0, "review": "Changed my mind!  it does come in handy...Works very well...", "verified": true, "helpfulness": "1/1", "author": "Mark C. in Oakland, CA"}, {"rating": 5.0, "review": "It does what it says, once you allow it it to update it's Firmware, which takes place automatically over the WiFi.Until that happens, it may give you intial lagged responses.But I bought more units after I figured out how to install it properly.", "verified": true, "helpfulness": "3/3", "author": "Zagman \"Commander Z\""}, {"rating": 1.0, "review": "I bought this device to do 3 specific things.1. I wanted to catch up on Breaking Bad through AMC's website and stream it to my TV.  Device said it had \"select web content through Chrome browser.\"  This was not what they were talking about. Doesn't work that way.2.  I thought it would be great to stream International Soccer games that we don't have access to through our cable provider.  This does not give us access to do that.3.  Thought we would be able to watch The World Finals of League of Legends (e sports) on our TV through this.  You definitely don't have access to their streamers (Azubu and others).  They have a youtube channel though, and youtube is listed as a site that you FOR SURE have access to, so that must work, right?  Wrong!  You can not stream live channels through youtube with Chromecast.Bottom Line:  I thought we would be able to move many of the videos and streaming channels that we normally must access on our computers to the comfort of our living room.  Chromecast does not do this.  You get access to Netflix, Google Play, and most of youtube.I am hopeful that they will expand the streaming access soon.", "verified": true, "helpfulness": "3/6", "author": "kamstar"}, {"rating": 5.0, "review": "We are using this for our tv in the bedroom as it is not a smart tv.  We use it for Netflix and it works great!", "verified": true, "helpfulness": "0/0", "author": "Ken Gitter"}, {"rating": 1.0, "review": "Google, though usually a very smart organization, created an HDMI streaming device that does not connect to a 5GHZ network, only a 2.4GHZ which is not strong enough to stream HD effectively. So far, I haven't been able to watch much, and everything including trying to watch a trailer from You Tube goes to an annoying \"Lost Connection\", it gets stuck mid stream and doesn't buffer, so if it doesn't lose the connection, it skips forward to catch up to what is playing on the computer that its streaming from. I'm usually able to watch most things from Apple TV or Amazon Prime direct from the TV, so no big loss for me. I just wanted to toy with the latest tech, but honestly, this is a big disappointment.", "verified": true, "helpfulness": "3/5", "author": "Ric Richardson \"Ric\""}, {"rating": 5.0, "review": "Easy install on wifi network and plug-ins through Chrome and Mac Lion.Streams beautifully 720p without hesitation or interruption of content on Chrome browser from computer.Love it! No regrets.", "verified": true, "helpfulness": "0/1", "author": "Colorado Ric \"-kiric-\""}, {"rating": 5.0, "review": "Now I can watch YouTube on my older, not so smart Visio TV.  It only works with 3 apps at this time, but YouTube was the reason I wanted it and looking forward to more apps that work with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "ThomasOfAustin"}, {"rating": 5.0, "review": "Right off the bat it solves a problem of my accessing Netflix with close captioning with my Tivo. I won't go into those problems here other than to say they disappear after a short time along with the ability to remotely control.Chromecast is easy to setup and easy to control from both my iMac and iPad. I did have less luck with the iPhone 4S that may have been due to the smaller screen, time will tell. It will be very interesting to see where Google takes this in the future but at the price was a worthwhile work around for me short term. I have an original Apple TV and cannot see the effects of the recent upgrade and with rumors of a new version coming next month I may buy that depending on what it has to offer and give the Chromecast away. The recent upgrade on the Apple TV sounds really good. Of course a full blown Apple television would be an interesting development and have the potential of obsoleting both Apple TV and Chromecast.A problem when watching a Netflix TV series the next episode is not just a click away. Need to go back into the app and start over. Got to believe and/or hope this will be fixed in the future.", "verified": true, "helpfulness": "0/0", "author": "W. Weber"}, {"rating": 5.0, "review": "installation couldn't have been easier. Downloaded the software so I'd be ready for it as it joined my home network, resulting in a very quick, simple install. Worked immediately, Can now watch my Netflix stream on my flat screen with subtitles and have been going nuts with it!! Can't wait for more channels to be added to it. Not really interested in You Tube access for my big screen, but may try that out at some point. Great idea and execution.", "verified": true, "helpfulness": "0/0", "author": "Bob \"Saabguy85\""}]