[{"rating": 3.0, "review": "I own the Apple TV and the Chromcast. While I understand the benefit, simplicity, and ease of setup with the Chromecast, I just don't prefer selecting my movies and TV shows with my phone or tablet. My wife and I like to scroll through the shows on the TV, talk about what we want to watch, etc, instead of looking at our phones individually. The Apple TV has both phone/tablet streaming capabilities AND the on screen dashboard.I do love how I just connect it into the back of my TV, power it with the USB jack that is 3 inched away from the HDMI slot, and hide everything back there.  Super clean, and a great idea.  However, their simplicity was taken one step too far by eliminating the dashboard.Any suggestions or corrections and I'd be happy to revise my rating!", "verified": true, "helpfulness": "0/0", "author": "Zach Smith"}, {"rating": 3.0, "review": "It doesn't let you stream your desktop, only a chrome TAB or other apps like YouTube, Netflix, etc. It can be misleading for those that wanted to stream movies that they have on their hard drives. However I found a solution to that problem. it's an app called Plex Media Server. Look it up if you want to stream content from your hard drives.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "If you are watching YouTube, look no further. This is the best media device for your TV, integrating with your laptop or your phone. If you are interested in other video content sites or in streaming from your own media center, then you have limited luck.I am still hopeful of this device's future though!", "verified": true, "helpfulness": "0/0", "author": "Sujit Vasudev"}, {"rating": 3.0, "review": "This little device just allows you to send anything that you are watching on Netflix or on another supported app/ site.Pros: Very nice streaming, doesn't look bad, very small.Cons: Only works with Google Chrome, takes a bit to start up, wish it could be used for watching whatever.", "verified": false, "helpfulness": "0/0", "author": "Edward M."}, {"rating": 5.0, "review": "Really enjoy being able to project things from my iPad to the tv screen. Can even do a slide show of my pictures. And now to be able to use Netflix makes it even more usable.  And so easy to use; just plug it into a HDMI port and plug it in or insert into the USB port for power makes it very usable on any TV, anywhere. Get one....you'll love it.", "verified": true, "helpfulness": "0/0", "author": "Chenme"}, {"rating": 5.0, "review": "I found this super easy to setup, connect to the network, download updates online, and play Hulu, Pandora and YouTube on the TV. You use your iPhone or iPad as the remote control for the TV, which is brilliant. You don't have yet another remote to keep track off with a million inscrutable buttons. And all for $39. A", "verified": true, "helpfulness": "0/0", "author": "Al Sargent"}, {"rating": 4.0, "review": "Excellent way to stream Netflix to your TV. However, oddly this doesn't yet work with the Chrome browser on the iPad.  I assume that feature is on its way, but it's an odd omission from Google.", "verified": true, "helpfulness": "0/0", "author": "David Hennessy"}, {"rating": 1.0, "review": "Isn't this supposed to 'take what's on your tablet and put it on your TV'? That's not at all what it does. Unless you're prepared to download a separate app each for a dozen different websites, it doesn't do that at all. You can't surf the web on your TV with this. You can browse Youtube (unless you find one of the thousands of Youtube videos that isn't authorized for it)... but on my Time Warner Cable subscription, I already get Youtube for free on my TV. I have no idea what advantage this device is supposed to confer. A waste of money.", "verified": false, "helpfulness": "0/3", "author": "Robert B. Madison"}, {"rating": 1.0, "review": "Chromecast would be a fantastic piece of technology at a great cost, *IF* it could playback video that wasn't ludicrously choppy.  Unfortunately, streaming from Google Play, Youtube, and even a file off a computer on the same wireless network (with all other computers and network activity disabled) plays like garbage.", "verified": true, "helpfulness": "0/0", "author": "k polich"}, {"rating": 5.0, "review": "just gave it as a Christmas present. Very easy setup, includes power adapter if your TV doesn't have usb to power it. also comes with a little hdmi extender if it doesn't fit on your TV for some reason....pretty cool, not bad for $35", "verified": true, "helpfulness": "0/1", "author": "andy"}]