[{"rating": 5.0, "review": "easy to setup and install on multiple devises(nook, tablet, phones). great price for intended use at our home instead of cable.", "verified": true, "helpfulness": "0/0", "author": "Rianna"}, {"rating": 1.0, "review": "Terrible product. I have high speed internet and the video playback is still very choppy and starts and stops a lot.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 3.0, "review": "It is a cool idea but it doesn't see much use in our house.  I ended up putting it on my 7 year olds TV because the streaming quality kind of sucks.  I stream from the internet to my tablet to this device, that is a lot of unnecessary latency.  I can get my Roku to stream HD no problem, this I have yet to stream with any kind of quality.", "verified": true, "helpfulness": "0/0", "author": "carpainter69"}, {"rating": 5.0, "review": "Very inexpensive way to stream Netflix, HBO to go, or YouTube videos to the television without having to upgrade my current LCD TV.  Setup was easy for me and has worked very well.", "verified": true, "helpfulness": "0/0", "author": "Mark O'Donal"}, {"rating": 5.0, "review": "It produces superb image and sound. It is very easy to install. For the price you get more that you could expect.New apps should be included", "verified": true, "helpfulness": "0/0", "author": "Victor Maldonado B"}, {"rating": 5.0, "review": "Great little bit of tech, just easy to use and does everything well. It's limitations are well-documented but that's how you get to the $30-35 pricepoint", "verified": true, "helpfulness": "0/0", "author": "Dan J"}, {"rating": 5.0, "review": "An affordable, easy-to-use device for streaming media.Love watching YouTube and Netflix on my TV.Looking forward to more apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device works better than I had expected and is everything I was looking for. I was nervous that the picture quality would be low and pixilated, but everything looks awesome", "verified": true, "helpfulness": "0/0", "author": "Alex Austen"}, {"rating": 5.0, "review": "I'm an Android user, and this device does *almost* everything I need it to do.  I use it with my A/V system:- Stream music from Google Play- Netflix- Hulu- Watch Youtube on the TVFor these purposes, it is an excellent device.  I've used bluetooth streaming boxes for my music in the past, and the chromecast is a far superior solution.  The chromecast saves your phone's battery life by taking over streaming tasks on it's own.  For me this is worth the price on it's own.No, it's not perfect.  It occasionally locks up, and not every Android app supports it.  But as software updates are released, and more developers add support, it gets better every day.Biggest aggravation is lack of Amazon Prime integration.  But Android OS is not the same as Kindle, and Amazon has chosen not to offer services such as Amazon Prime Instant Video on Android devices.  There is nothing to be done about this unless Amazon changes it's hardware business model.It may not have as many \"channels\" as a Roku, but I wouldn't use 90% of those channels anyway.  At $40, the chromecast is dirt cheap for what it does.Oh...and I can pack it in my travel bag and use it on the road--big bonus.", "verified": true, "helpfulness": "0/0", "author": "M. McGinnis"}, {"rating": 5.0, "review": "This is a must have item if you currently subscribe to Hulu Plus or Nextflix. Period. In the not so distant future, the introduction of this device will be seen as a real water shed moment.", "verified": true, "helpfulness": "0/0", "author": "Joel J. Helbig"}]