[{"rating": 4.0, "review": "Great for the technology impaired, but very very restrictive to anyone used to working in the Android environment. If you're getting this for your kids or for your parents/grand parents you can't go wrong. Nice and simple and very clean and easy to understand interface.If you want to have a fully customizable device, or wish to use apps you've already bought before on your phone you're out of luck. Amazon goes out of it's way to block rooting as well.", "verified": true, "helpfulness": "0/0", "author": "Koji"}, {"rating": 2.0, "review": "The user interface is incredible - I wish all cable boxes and TV guides were this fast and easy. But the content is expensive. And don't get suckered into thinking that because you're a Prime member you'll get lots of free content. The Prime selection is extremely limited and is not a feature worth factoring in to your decision. It is mostly gathering dust at my house.  I would not buy this again.", "verified": false, "helpfulness": "2/7", "author": "jkr66stang"}, {"rating": 1.0, "review": "I purchased this and returned it in under 2 weeks. Roku 3 and Roku 4 thrash it in every respect. Totally not worth a buy. Just try a Roku before you settle for this. You will not regret!And the voice search is a gimmick - it only works with Amazon Instant Videos and does not work with premium services such as Netflix! Please do yourself a favor and get a Roku player straightaway!", "verified": true, "helpfulness": "4/14", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great - I use it primarily tp access Netflix on my TV - So simple evev a lug head like me had no problem getting it up and running.  Very simple - great instructions", "verified": true, "helpfulness": "0/0", "author": "C Willis"}, {"rating": 3.0, "review": "Pros: Lightning fast, very responsive remote (many other players don't get this right)Good netflix experienceVoice recognition actually worksEasy setupConsNo 1st party Youtube appYoutube app missing \"My subscriptions\" view.ExpensiveI am looking for three main features in a networked player: Amazon instant video, Netflix and Youtube. I care about the responsiveness of the device and especially the remote. I don't want to press a rubbery button and then wait for three seconds to find out if the device registered it.Unfortunately the Youtube app is restricted to the \"what to watch\" view (what Youtube thinks you should be watching) and is missing the \"My subscriptions\" view (what you want to watch).", "verified": true, "helpfulness": "2/2", "author": "Skelshy"}, {"rating": 2.0, "review": "I purchased this thinking I could use the USB storage option all media players give you. Well it seems Amazon has something up their @$5 to prevent users from playing home videos through a thumb drive. Streaming was fine through Amazone Prime; Netflix was a bit slow; the UI was fairly easy to navigate. Amazon needs to fix this issue. I'm going to trash this and buy a Roku or Google TV. Don't waste your time or your money. Amazon can't even get the basics right.", "verified": true, "helpfulness": "1/5", "author": "Andrew M."}, {"rating": 4.0, "review": "Quirky.  Not as many movies as I'd hoped, but does work as a compliment to my netflix.  Love the voice search and love having a little more variety than I had.  If I can't find it on Netflix, I can usually find it on Amazon.", "verified": true, "helpfulness": "0/0", "author": "D. Strayhorn"}, {"rating": 3.0, "review": "We own two Roku 3's in our household and absolutely love them. We use them exclusively for movies and TV (no gamers here). We wanted to buy another set top box for another room in our house so I thought I'd give this product a chance. I have a lot of faith and trust in Amazon. In almost all cases I think they do it right. However, I don't think this current product is as good as the competition's.Pros1. Interface speed - Navigating and browsing is much, much faster than the Roku 32. Voice command - Not essential, but there is definitely a convenience factor here.Cons1. Excessive stopping/starting with loading - This is the dealbreaker for us. We put the Fire on our main floor and moved the existing Roku 3 to the other location, so we have a straight up comparison here. The Fire seemingly stops out of nowhere in order to load a show further. It's kind of aggravating to be 40 minutes into your favorite show and have to wait 5 in order to finish the last 10.2. Interface usability - Found the Roku 3's interface much easier to use, especially navigating within seasons of a TV show3. Initial picture quality - The first 3 minutes of most programs are grainy and pixelated. Pausing the player doesn't seem to help.Anyway, after reading A LOT of user reviews and opting to purchase the Fire, I would recommend that others buy the Roku 3. If the Fire is $20 or $30 cheaper than the Roku 3, then I would probably recommend the Fire instead.", "verified": true, "helpfulness": "4/6", "author": "fourmileloop"}, {"rating": 5.0, "review": "I got this as a replacement to my Apple TV.  Recently it had been taking too long to load and sometimes would just completely shut down on me.  After using Fire TV for one day, there's a huge difference in speed.  I know people have had complaints about the voice search being insufficient, but that's not a feature I really see myself using.  If you're like me and have been fed up with how slow you other streaming devices are, this one will make you super happy.  As long as it lasts more than the few years my Apple TV did, I'll be glad I made the switch.", "verified": true, "helpfulness": "0/0", "author": "J. L. \"Jenna\""}, {"rating": 1.0, "review": "The Fire TV almost feels like every app is in a beta build. The only thing it does well its Amazon services. The Plex app is horrid. It constantly lags out streaming anything over 45 minutes.  The Hulu Plus app has a slew of problems as well. Won't load video but the audio plays half the time. This is the wort streaming device I've used. Also, it's not on my end. I have an extremely reliable network with 95mb downloads and 45mg uploads.", "verified": true, "helpfulness": "8/13", "author": "Scoops"}]