[{"rating": 5.0, "review": "I ordered my new Fire TV on the first day it was announced and I love it, love it, love it!  The voice feature works perfect and is so cool!  I would strongly recommend the Fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "krpmuffitt \"krplang\""}, {"rating": 3.0, "review": "I have experienced some issues with some of the apps on the Fire TV.  There is a problem with the YouTube app such that you cannot exit the app after starting it.  The only way to get out of it is to reboot the Fire TV.  There are also issues with the Netflix app.  I have a very high speed Internet connection but sometimes there are buffering issues within the Netflix app that cause playback to stop while the app buffers more of the movie or show that you are watching.  The picture quality is great, particular for all of the HD content.", "verified": true, "helpfulness": "0/0", "author": "James H. Schaum"}, {"rating": 5.0, "review": "The Amazon Fire TV has replaced my ouya and Chromecast handily.It has an intuitive GUI and very easy to navigate with the remote or with any Bluetooth joystick.The voice commands work better than one would expect from a first gen device.I hope to side load it with XBMC and make a complete entertainment hub out of the Fire TV", "verified": true, "helpfulness": "0/0", "author": "hollatainment"}, {"rating": 5.0, "review": "Fire TV is a small package with plenty of functionality.  It loads fast, picture quality is on par with any HD output. Navigation via remote is good, voice commands works well also.  Wish Amazon would release more Prime content, especially if they plan on increasing Prime membership fees.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! It was a birthday gift and fell in love instantly! So easy to transport! Very easy to download and figure out how to use", "verified": true, "helpfulness": "0/0", "author": "Katecourt7"}, {"rating": 3.0, "review": "It's not a bad player, but since the voice search at the time of this review only lets you search through Amazon's and Vevo's selections, it doesn't really make it any better than a Roku or Chromecast for the way I use it.  If it would allow you to do a voice search and see where a video is available based on the apps you have installed such as Netflix and Plex and others then this would be a no brainer and get 5 out of 5.  Until then it does what it does very well, just not sure it's worth the extra money for someone who isn't in the amazon ecosystem.", "verified": true, "helpfulness": "1/1", "author": "knowbuddies"}, {"rating": 5.0, "review": "It is great, a lot of entertainment from a little box, not need for super expensive Cable with 400+ channels anymore.", "verified": true, "helpfulness": "0/0", "author": "Enrique Farnot"}, {"rating": 3.0, "review": "Setup was very simple - 5 stars on that. Streaming is fast - 5 stars on that one too. Voice search works pretty good EXCEPT it returned a \"buy it\" selection for the same show that was free with my Netflix subscription. My biggest complaint is the way it displays show/movie descriptions as you scroll through selections. THE FONT IS SO SMALL IT IS DIFFICULT TO READ. Be careful here. If you wear glasses you will absolutely have to have them on in order to read show descriptions. A really stupid oversight in my opinion. Amazon - please give more screen real estate to the show description and increase the font size!", "verified": true, "helpfulness": "2/2", "author": "DAG"}, {"rating": 5.0, "review": "Works great. Easy to install and use.Love the voice to remote feature . Amazon again has came through with a smart product at a reasonable price.", "verified": true, "helpfulness": "1/1", "author": "B. Casey"}, {"rating": 5.0, "review": "I bought a Roku 3 about 6 months ago and it has been a good device. I love Amazons products and their convenience. The Fire TV is the fastest streaming box out there currently 4-16-2014. I have two Kindles and the box will import Amazon Cloud Pics and Files. It would be smart for them to integrate their mp3 player to show cataloged purchases and make it available to use music purchased(bluetooth). This box an excellent product in a quick changing or upgrading technology.The box will be good for years and as it is well constructed. Eagerly we wait for Apple who will upgrade there box later this year. Chrome by Google and Roku are much lesser products.", "verified": true, "helpfulness": "0/0", "author": "packinphish"}]