[{"rating": 5.0, "review": "Would buy again and again. Easy to use and very efficient and surprisingly fast so quiet to, definitely worth every penny.", "verified": true, "helpfulness": "1/1", "author": "Andy Goodrich"}, {"rating": 5.0, "review": "Love using this little guy, sending Google Play music, Youtube and Google Play TV/Movies to my TV is extremely easy. This is exactly what I was looking for to complement my Roku, since I cant connect to Google's products for the most part.", "verified": true, "helpfulness": "1/1", "author": "D. Manna \"E-commerce Expert\""}, {"rating": 1.0, "review": "Promises promises... But still only Netflix as a real content provider. YouTube is for kids. Very disappointing overall. I already had my Mac hooked up by Ethernet but as an early adapter I thought more was coming. Apparently not.", "verified": false, "helpfulness": "3/8", "author": "click"}, {"rating": 2.0, "review": "I own a couple of Rokus, and have purchased and returned two Apple TVs. I'm in a Tivo household, and owned by Time Warner, so I do not have video on demand. I bought Chromecast in order to stream the TWC website and vod programs, but alas, it doesn't work well. The streaming is choppy, as it is on the TWC website (thanks Time Warner), but even worse, there is no audio at all because Chromecast is not compatible with the Silverlight plugin that TWC uses. So the whole thing was pretty much a bust. I'm keeping it because it was so cheap and who know what upgrades will eventually happen. But until then, it's pretty useless compared to the Roku and all the other apps on the Tivo, the Sony Blu-Ray, and the Vizio HDTV. Ah well, so it goes.", "verified": false, "helpfulness": "3/4", "author": "Craig \"Utician\""}, {"rating": 4.0, "review": "This is an awesome device.Easy to install; plug and play.Only disadvantage is it doesn't support Silver sight and QuickTime.", "verified": true, "helpfulness": "1/3", "author": "Ebrahim Munshi \"Ebu\""}, {"rating": 5.0, "review": "This thing works EXACTLY as advertised and I got it on time....go figure, I only needed it to stream Netflix to my flatscreen and it did exactly that", "verified": true, "helpfulness": "0/2", "author": "angry as hell"}, {"rating": 3.0, "review": "It took a while to get it but I did get e-mails advising me of the delivery.  It only supports YouTube and Netflix, I am hoping that it will eventually support playing videos that are already in the device, Amazon Streaming, Hulu, etc.  Once it starts growing I will come back and change my rating, but so far it is only OK.  Another thing that needs to change is that it requires WiFi to the internet, it would be better if it would also work with cell network or WiFi with no internet (i.e., home network and play movies that are in the network).", "verified": true, "helpfulness": "2/3", "author": "Alesia J. Sipes"}, {"rating": 3.0, "review": "**Decided to lower the rating as per my last update: see below**I can understand that many people feel like there is no need for this device since TV sets these days include internet connection. Or Blu Ray, or Playstation3/Xbox.Certainly, this device doesn't do anything besides what other devices do, but what it does, does it in a very nice way for a very affordable price.This device looks like a USB drive at first sight. It is about the same size. It will connect to HDMI connector in a TV and requires also to be connected to an electrical output as well. Of course you need a wi-fi network in your house to use this.There are a couple of ways to set it up. First, you can set it up from an iOS device or from an android device. The apps to do this are only available in certain regional stores, so many countries will not have access to these apps. Setting it up this way is really easy, you follow a few steps on screen to set it up. Once you set it up, the Chromecast starts signaling the wi-fi network that it is ready to receive signal from any device. From your device (smartphone or tablet) you select what you want to see and check a an option to send it to your TV. You can then use your device any way you want, as the broadcast is not a streaming from your device option, the chromecast will receive the information directly from the internet to stream in your TV.You can also set up the chromecast through a laptop, which is really easy. If you do it this way, you don't need to set it up through iOS or android devices. Once the chromecast is ready, the devices will discover the signal on their own. Pretty convenient. This is very convenient for regions where the app for iOS and Android is not available.You will be able to watch Netflix from your region, so don't expect the chromecast to bypass the regional lock on this and other services.I decided to give it 4 starts as I have discovered there are some issues with the audio. The audio suddenly doesn't synch or doesn't play correctly. You need to stop the transmission from your device so the chromecast can refresh, give it a minute or two and play again and it will usually solve the problem. I can imagine this might get improved with revisions to the device software.Update 10/27/13I have been thinkering with the device a little and found several things worth noting.a) You can broadcast from your Chrome browser many streaming services. All you do is install an extension to your browser and there you go, the Chromecast will start showing your browser tab. If you select a complete screen view from the web player you are using, video will cover your TV screen. This is a very neat option.b) If for some reason you manage to bypass streaming services regional locks in your computer or laptop, for example, you find a way to watch US Netflix outside US, when you try to cast it into the Chromecast device, the device will not play. Chromecast downloads directly from the internet and it will recognize region locks.c) Chromecast just plainly doesn't like certain routers. I can't count how many times it just refuses to connect properly, drops connection or loses audio synch. I have done everything I can think of for the last month trying to get it to work, and simply there hasnt been any way to make it maintain a decent connect if the router is more than 3 meters away.If you are serious about streaming video to your TV, this might work for you, but be ready that it may not like your router and this will represent a headache for you to try to fix. On top of that, Google's support is kinda bad in that sense, the technical database they have is pretty limited and they force you to give them a call. I am probably selling this gadget and getting a different option.", "verified": true, "helpfulness": "3/4", "author": "Sixaola"}, {"rating": 2.0, "review": "I have a couple of Roku Hi-Def streamers and a Vizio Co-Star Stream Player. I wanted to try this inexpensive method to get my computer and Ipad on my big screen TV wirelessly. I ordered and received it within a week. It came packaged very nicely with everything you need. A neat feature is you can connect the USB directly to your TV ( if it has an input. If not, it also comes with a power source that plugs into the wall or strip.) to power the gadget. The set-up is straightforward and easy to download Google Chrome from, in my case, a laptop. It synced my laptop to the TV and in short order and I was up in running. I first tried Netflix which was immediately flagged until I installed Silverlight. Okay, that done, I was flagged because the content I was trying to play ( Breaking Bad episode) was not supported. Huh? I tried an Amazon Prime episode of Alpha House and it was cast in whatever less than 480p is, just horrible. It consistently froze and disconnected. The final straw? The app store DOES NOT offer any way to stream your own videos. You are left with an inferior streaming device. As a way to get the internet from your laptop or other device to the TV it does a so-so job, mainly due to the glitches. Roku and the Co-star do a much better job of streaming movies, Netflix, Hulu Plus and Amazon Prime content . Although they cost more, I feel there are better, more versatile alternatives out there.", "verified": true, "helpfulness": "47/62", "author": "E. Lee"}, {"rating": 5.0, "review": "I can't add much to what has already been reviewed. Chromecast sets up in less than 5 minutes. It does what Google claims it will do. Don't expect it to do other than what it is intended. It streams to TV. It is a streaming device not a mirroring device. It accomplishes what it is intended to accomplish in the Google fashion - extremely well. We consumers are benefiting from the Google-Apple competition but this is not an Apple TV CLONE. Read and analyze the reviews written by actual users not those who diss a product because they are loyal to a competing product. Apple TV and Chromecast are two different devices accomplishing the intended purpose of each.", "verified": true, "helpfulness": "2/4", "author": "Kindle Customer \"Vridar\""}]