[{"rating": 5.0, "review": "Best product I ve bought in a long time, it was all I wanted, small size, has an excellent signal, cast with every device, dosn t crash. Just excellent!The shipping was also on time, had no problems at all!", "verified": true, "helpfulness": "0/0", "author": "Claudio Ramos"}, {"rating": 5.0, "review": "Just an invaluable product in today's modern world of gadgetry and personal entertainment. I've experienced very few glitches or hang-ups so far, and it works marvelously with Netflix and YouTube on both Android and Windows 7, which is the bulk of how I use my Chromecast. For $35 this product is a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "Dan Pantz \"djc_77\""}, {"rating": 5.0, "review": "works", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "A great product which adds appreciated functionality to my Android devices.  I watch Netflix/Hulu/YouTube etc on several devices connected to my TV.  I use Chromecast often as it is ready to watch must faster than with my Xbox or PC.  I found the YouTube app with Chromecast allows you to line up a queue of videos.  With all of the content on YouTube you can queue a long list of interesting shows.  I look forward to updates and additional apps that include Chromecast support.", "verified": true, "helpfulness": "0/0", "author": "andy mlodoch"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Catherine"}, {"rating": 5.0, "review": "I plugged it into my audio-video amp, selected the HDMI input and it worked right off the bat.", "verified": true, "helpfulness": "0/0", "author": "Philip B. Spivey"}, {"rating": 5.0, "review": "excellent!", "verified": true, "helpfulness": "0/0", "author": "Hector Santiago"}, {"rating": 4.0, "review": "Works ok, but can't pull a wireless signal very well to continue streaming anything.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Luján"}, {"rating": 5.0, "review": "My laptop doesn't have an HDMI port so I figured I'd give this a try not really knowing much about it. I absolutely love it! It streams everything from my laptop, phone and tablet perfect. Not to mention it was cheaper to buy on amazon than in any store. Definitely worth it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Mathy"}]