[{"rating": 1.0, "review": "Plugged it in, powered it up. \"Will not connect to the internet\" although my Belkin N750 db is on the Chromecast \"OK\" list. Chromecast says if you have a problem, contact Belkin. Great way to pass the buck and leave the impression that they don't care. Spent two and a half hours with Belkin support and they could not get it to work. Just don't buy it. I thought the Google name would be a good thing...it's a bad thing. This thing is going back.", "verified": true, "helpfulness": "0/1", "author": "Patrick T. Long"}, {"rating": 4.0, "review": "Great and works well with YouTube,  however still appear to be a few kinks with some other streaming apps like Vevo.  Hopefully those work themselves out in time.", "verified": true, "helpfulness": "0/0", "author": "Vi_Wolf_King \"Vi_Wolf_King\""}, {"rating": 2.0, "review": "the youtube appl. works sometimes the computer streaming does not work.I would not recommend anyone to buy this unit.", "verified": true, "helpfulness": "0/1", "author": "Ricardo"}, {"rating": 5.0, "review": "I wish this worked with the Amazon Prime streaming video.  Would also be nice if it also allowed streaming of itunes, but that may be too much to ask because of the competing apple product.", "verified": true, "helpfulness": "1/1", "author": "Paul Bowman Root"}, {"rating": 5.0, "review": "I have only used it a couple of times but it does everything it is supposed to do.  And it's simple to use too.  the software download that lets you use it with chrome was easy and connecting with the smart tv is simple too.", "verified": true, "helpfulness": "0/0", "author": "James S. Glinsky"}, {"rating": 5.0, "review": "Easy to set up. Works great. I had some problems with the apps/Chrome \"finding\" the Chromecast consistently, but after checking the online help I found out that Chromecast was certified with a newer firmware version for my particular router (Belkin). I haven't had any more connection problems since I downloaded the newer firmware to my router. Only one thing could make me happier: more apps that support Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product is fantastic...Easy to hookup, and works seamlessly.  Google has a big, big winner here.  I have been using it at my Fathers home and he has a slow internet connection and it still works well.  With high speed internet the quality of picture would be far better.  Give it a try you can;t beat its value.", "verified": true, "helpfulness": "0/0", "author": "J. P. Hesnan \"JP\""}, {"rating": 5.0, "review": "I can send just about anything to my tv now. Netflix and Youtube work great, but there are an ever-growing number of Android apps that can send content to the TV, and I can send any Chrome tab to it as well. I've been very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Hutchind"}, {"rating": 5.0, "review": "I stream the app Avia  to it and it works great .I am watching a lot of movies with it .", "verified": true, "helpfulness": "0/0", "author": "Amado Garcia"}, {"rating": 4.0, "review": "Easy to set up, works well. For $35 it's a great deal. Unfortunately it doesn't work with my desktop PC.  My desktop is wired through the router so I thought it would. However, it works fine with my laptop tablet and phone.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Harris"}]