[{"rating": 5.0, "review": "Thank you it works fine. It is an easy way to watch movies on your TV. I use it often.", "verified": true, "helpfulness": "0/0", "author": "Bubba \"Bubba\""}, {"rating": 4.0, "review": "Works well. Connects easily. It does get hotter than I expected, even when not in use. So, I unplug it whenever I am not using it.", "verified": true, "helpfulness": "0/0", "author": "Sothurnboy"}, {"rating": 5.0, "review": "This does exactly what it says and works smoothly with out any delays or glitches. Purchased on and now have 2 for the other rooms in our home and of course the price is unbeatable. #HappyCustomer", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The Google Chromecast is easy to use and inexpensive, but these two things do not make up for the lack of available channels that Google is offering at this time. If Chromecast were more expensive I would have returned it due to the lack of channels and features it offers at this time. I'll stick it out for now but hopefully Google will be adding more content and functionality soon.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 4.0, "review": "For potential buyers, make sure when you hook up the chromecast  to the TV  please use the USB service port your TV has to power the device. It will keep everything organized and you wont need an open power outlet.Currently the chromecast for what it does, it does well. I can't wait for a lot more apps to be updated.", "verified": false, "helpfulness": "0/0", "author": "Moe Faux"}, {"rating": 5.0, "review": "Very cost effective. Nice product. Would buy more definitely and recommend to all my friends and family when you have a Not-Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Juan Velez"}, {"rating": 5.0, "review": "Awesome product! I bought another one for our bedroom since we were fighting over who gets to use it! $35 well spent!", "verified": true, "helpfulness": "0/0", "author": "Jason Bain \"Jason Bain\""}, {"rating": 5.0, "review": "This little thing is magic.  start netflix and move to chromecast, now you can do what ever you want on the pc and or tablet", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "i cant believe how good this product works and i am recomending this to all my friends and family to buy this", "verified": true, "helpfulness": "0/0", "author": "Raul Escobar"}, {"rating": 5.0, "review": "It was a wonderful gift for my husband even thou now he is not coming out of his man cave. Women, be aware !", "verified": true, "helpfulness": "0/0", "author": "Magdalena Baxter"}]