[{"rating": 5.0, "review": "Excellent picture and very good sound. Easy to setup. Very easy navigation. The only minus is that remote does not self light at night making navigation difficult.", "verified": true, "helpfulness": "0/0", "author": "Alexander K. Girevendulis \"A grev\""}, {"rating": 5.0, "review": "Just got it yesterday. Works great! Setup is essentially \"plug and play\" and was a \"no brainer\" completed in under a minute, including recognizing my wireless Internet connection. Very easy to use. Love the voice activated feature.Hey Amazon team... how about getting your software engineers to create an app for Kindle Fire to act as a \"touch screen\" Fire TV remote.  It would sure make searching such as on YouTube a breeze.", "verified": true, "helpfulness": "2/2", "author": "Just another \"Babyboomer Dreamer\""}, {"rating": 5.0, "review": "We love amazon fire tv! We dropped our satellite and this is all we use now. It saves us a lot of money. The shows are good, we use it to stream netflix too. The customer service has been great when we've had a problem they've fixed it right away.", "verified": true, "helpfulness": "0/0", "author": "K. Barlow"}, {"rating": 5.0, "review": "Wonderful product. I wish the voice search would look at application libraries like Hulu and Netflix, but that's the only think that's lacking.", "verified": true, "helpfulness": "1/1", "author": "CB"}, {"rating": 5.0, "review": "I finally decided to get this when they dropped the price to $84, I am enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "C Butler"}, {"rating": 2.0, "review": "Fast device, compact, but fast means nothing unless you have more variety of apps that take advantage of it.  I still use roku simply cause of more variety, throw in hbo go, starz, encore, better voice function thst allow to find movies beside amazon prime abd you will have a deal breaker top noch streaming monster, this is where it fall short, google tv give me selection from different source, roku give me more variety yiu can have quad cores superb speed and an elegant look sleek design, but it will mean nothing unless you can take full advantage of it. I would like to add this is in no way a gaming machine for one some game may take up a gig or so beside the apps, i had purchase a few game and realize that it was meaningless since i had no space left to download and to constantly delete and install become tedious. so if your looking to play games your better off with a actual game console fire tv is not design for gaming at all. it just a mere media box with limited apps.", "verified": true, "helpfulness": "0/0", "author": "jfeliciano"}, {"rating": 1.0, "review": "Worked great for a few months...loved it.  Now not so much have had it 4 months now ..it locks up...wont connect to internet...wont play movies...a real PIA!", "verified": true, "helpfulness": "4/5", "author": "rsa2"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "jose santos"}, {"rating": 2.0, "review": "The FREE Amazon Prime I got for ordering Amazon Fire, was NOT free.  You had to pay for everything on it.  I didn't know I wouldn't be able to use my HBO GO, as well as other things that I previously had on Roku and can also get with Apple TV.  I'm so sad.  And so is Gary Busey.  The most fun I had was yelling \"Find Gary Busey\".", "verified": true, "helpfulness": "0/4", "author": "Ericka Roush"}, {"rating": 3.0, "review": "For streaming Amazon / Amazon Prime content, there isn't anything better.  The size and shape of this unit is great.  It doesn't get too warm.  And the interface and setup is the best I've ever seen in a consumer device.  And for those who are content to stream videos/movies from Amazon Prime, this little device will do great.But there's a catch for movies streamed from any other source.If you have a media server (like Plex) and want to view videos / movies using a 3rd-party app (NetFlix, Plex, Vevo), it'll work perfectly except for 5.1 / 7.1 audio.  You'll only get 2-channel stereo.Even though it's been available for quite some time, Amazon hasn't updated their base OS to allow 3rd party apps the ability to output anything better than 2-channel stereo.  Until Amazon changes the base OS and 3rd-parties update their software to use it, you're stuck with 2-channel stereo for movies unless you use the built-in Amazon apps.Compared to Roku devices, FireTV is a generation ahead in looks, speed and usability.  But compared to Roku, it's also too Amazon-centric; FireTV locks out the vast majority of 3rd party content leaving you with a severely limited catalog unless you use Amazon exclusively for movies, music and video.  And while the voice feature built into the remote is an effective and useful feature (not just a gimmick), since its unique to the FireTV remote, you can't carry this feature over to your universal remote.THE GOODCrisp and intuitive InterfaceBreathtakingly simple setupVerbal search via the remote helps get to things fasterTHE BADOnly 2 channel audio for movies unless they're streamed from AmazonRemote has voice feature - which can't be migrated to a universal remoteWalled Garden of Amazon-only content is too limiting compared to competition", "verified": true, "helpfulness": "1/1", "author": "dugn"}]