[{"rating": 3.0, "review": "I bought the Chromecast with the intention of giving my Roku 2 to my parents. However, due to video lag, dropped casts and the few apps that currently work with Chromecast (and the fact that my parents can't figure out how to use a Roku), I have both devices installed on my tv. I find myself using the Roku about 2x more often. Hopefully once the list of apps and extensions for Chromecast grows, this will not be the case.", "verified": true, "helpfulness": "0/0", "author": "mona t morgan \"monatara\""}, {"rating": 1.0, "review": "Haven't figured out how to fix a wi-fi problem yet. Working on it. Will have time next week or so.", "verified": true, "helpfulness": "0/0", "author": "Robert  P. Trump"}, {"rating": 5.0, "review": "Easy to install, just followed instruction on screen, can watch all YouTube videos without any problem, way to go. Definitely recommended", "verified": true, "helpfulness": "0/0", "author": "lei lin"}, {"rating": 5.0, "review": "I already have a Roku on my living room tv to stream on. It's the best. However I wanted something for my bedroom tv, for more occasional tv viewing and did not want to spend another $100. Chromecast is awesome! I mostly use it for Netflix and it works like a dream. You can also move it to other TV's after the initial set-up and it's connects immediately. It is well worth the $35 price tag. I use mine with my IPad and you can use it while you stream. In, fact, as I write this, I am also streaming Call The Midwife, lol. Set up was about 5 minutes. I already had the app for netflix. I cannot recommend this device highly enough for a secondary tv. It would probably not have enough features for your primary device.", "verified": false, "helpfulness": "0/0", "author": "J. A. Crowe"}, {"rating": 5.0, "review": "Son loves the fact that he could stream his Anime to his TV now. He loves it and for 35 bucks that is not too shabby.", "verified": true, "helpfulness": "0/0", "author": "Wil Del-Valle"}, {"rating": 5.0, "review": "And this thingy totally did the job. My wife loves to watch trash reality TV online now she can watch them on HDTV, actually don't know if its good or bad now she occupied the TV ALL THE TIME now!!!", "verified": true, "helpfulness": "1/1", "author": "TinKin' \"A nostalgic jazzy tortoise traveling faster than the speed of  light\""}, {"rating": 5.0, "review": "I really am enjoying my google chromecast HDMI! So easy to install! I'm not very tech savy and even I could do it! Now I am enjoying my Netflix by streaming from my tablet !! Great!!", "verified": true, "helpfulness": "0/0", "author": "MARIA"}, {"rating": 1.0, "review": "I went through the setup on this device many many times.  Each time it would detect the wi-fi but it never connected.  The wi-fi status on the laptop would say 'limited'.  I purchased a wi-fi extender and while it helped all my other wi-fi connections it did not help with this device.  I also used the included cable that 'extended' the usb connection cable length.  I returned the device.  I purchased a Roku and it worked perfectly the first time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Fan"}, {"rating": 5.0, "review": "I had it next day. It works perfect and I recommend it to The other buyers. Make sure you have good enternet connection.", "verified": true, "helpfulness": "0/0", "author": "Persiangulf4ever"}, {"rating": 5.0, "review": "I bought this for my mom to turn her living room TV into an internet TV.  You can't beat the price and simplicity of this device.  Control it with your laptop, tablet, or smartphone so you don't need an extra remote lying around.  Not only that but I've found that the touch screen smartphone is a great remote interface.  Actually better than most existing remotes imo.  It was so easy and cheap that I bought her another one for her bedroom.  I take one with me when I travel.  Hook it into hotel TV's and voila, I have internet TV.  Can't say enough about this.  Google did a great job.", "verified": true, "helpfulness": "0/0", "author": "J. FERGUSON"}]