[{"rating": 5.0, "review": "I purchased this item for my son and he really enjoys it.Set up was very easy.", "verified": true, "helpfulness": "0/0", "author": "Gloria Hayenga"}, {"rating": 5.0, "review": "Perfect method to play Youtube video for my son. I tried to play it with Dongle mirroring, but Chromecast is better.", "verified": true, "helpfulness": "0/0", "author": "yukyong"}, {"rating": 5.0, "review": "I just love this invention! It's nice to share a movie with others using the TV instead of having everyone crowd around your iMac or PowerBook.", "verified": true, "helpfulness": "0/0", "author": "J. Gill"}, {"rating": 5.0, "review": "Great product and cheap ! One of my favorite products of all time.", "verified": true, "helpfulness": "0/0", "author": "David Austen Green"}, {"rating": 5.0, "review": "I am so glad I bought this.  I don't even need to buy a smart TV. My only issue is when I stream from google chrome it disconnects sometimes but it also is in the beta version. I don't have any other issues with it I just hope more apps will start making it available to stream off of it.", "verified": true, "helpfulness": "0/0", "author": "Zachary Knorr"}, {"rating": 5.0, "review": "It is extremely useful and very easy to use , I love it .", "verified": true, "helpfulness": "0/0", "author": "Marcelo"}, {"rating": 1.0, "review": "Disappointing ¡!!!!!!!!!!!!! Works with very little.  Yes I streamed that stupid interview movie from YouTube.  Thought that was cool next tried streaming amazon prime instant movies,  nothing but problems,  my computer laptop screen showed on TV but the area in middle of computer where amazon movie was playing would not sure up,  so tried my cell phone,  keep getting messages from Amazon about some stupid amazon app that I needed to download to stream movies from,  after lots of warning messages got it downloaded, guess what still did not work,  so 4 hours later got it to stream using a beta feature of an app on my cell labeled  chromecast.  Acted like a beta feature to do basically what miracast does,  which is what I should have bought instead,  finally got cell screen to show on TV,  movie streaming was choppy,  I was not impressed.  Food was cold wife was pissedMaybe one of amazons fire stick work betterNot sure", "verified": true, "helpfulness": "0/0", "author": "Ann A Watkins"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "carrin moore"}, {"rating": 4.0, "review": "This didn't work on an Olevia 232 we have in the house and that was very disappointing to me. All I've kept hearing is that if your TV has an hdmi port then Chromecast is for you. That's just not true.Setup on my other television was a breeze. I've watched a few shows and videos and it's a great gadget to have.", "verified": true, "helpfulness": "0/0", "author": "yoursmineoursfam"}, {"rating": 5.0, "review": "Easy to install. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "WMCMKM"}]