[{"rating": 3.0, "review": "Having a difficult time locating free movies.", "verified": true, "helpfulness": "0/1", "author": "Vernice"}, {"rating": 5.0, "review": "Awesome!! So easy to just sit down and watch a movie. I already have a Prime membership so there are thousands of movies to watch, music to listen to and tv shows etc.So easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Mary M Moran"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "R. VEGA \"shonye\""}, {"rating": 5.0, "review": "Amazing! Unbelievably easy to set up and use. The speed, video, and sound quality are excellent. The library and entertainment options are great. This is an excellent addition to my entertainment options and has even got me rethinking many of the channels I subscribe to with my satellite provider. I considered making the purchase for a while now and now I can't believe I waited as long as I did before purchasing. I am very satisfied with the purchase and should have done it sooner.", "verified": true, "helpfulness": "1/1", "author": "jimg5"}, {"rating": 5.0, "review": "I am obsessed. We've watched Arrested Development seasons 1-4 (my favorite show ever), Transparent (INCREDIBLE--please bring us the next season, Amazon), and are now watching Louie.My kids watch Thomas and other kids' shows.It couldn't be easier to use. There is literally no set-up. Plug it in and go. TONS of great free content, but the process to purchase content couldn't be faster (literally just a click). Huge, huge selection of great movies and TV shows available--lots for free and anything else for purchase.", "verified": true, "helpfulness": "1/1", "author": "Leda Eizenberg"}, {"rating": 5.0, "review": "Cable tv, your days are numbered", "verified": true, "helpfulness": "1/1", "author": "The siege"}, {"rating": 2.0, "review": "The product works great, and its easier to use/access than smart TVs.  Between differing apps on my electronics, I thought that the Fire TV could be used as a one-stop-shop for all my streaming needs.  However, there's one major flaw that Amazon should warn about in their promotional material - several cable companies, including Charter (my provider) do not allow HBOgo, Showtime anytime, etc. to stream to Fire TV.  Wish I had known that before purchasing.  If Charter ever decides to add Fire TV, I'll change my rating.", "verified": true, "helpfulness": "0/3", "author": "Patrick T. Moore"}, {"rating": 4.0, "review": "Love it! Still learning all the options.Thank you.", "verified": true, "helpfulness": "1/1", "author": "Rodney Palmer"}, {"rating": 5.0, "review": "We got the amazon fire tv to replace our cable service, and have been wondering why we didn't do it sooner ever since. Between amazon prime and Netflix who needs cable? It's saving us hundreds of dollars a year and tons of space", "verified": true, "helpfulness": "1/1", "author": "kiddo"}, {"rating": 5.0, "review": "Very happy with Amazon Fire TV. Fast and easy setup.  Great to have this with my Prime Membership.", "verified": true, "helpfulness": "0/0", "author": "Scott Talley"}]