[{"rating": 5.0, "review": "I am very skeptical on technology and this product google made I am proud to say works AMAZINGLY! !! Going to order a few more when I get back from my deploymentHIGHLY RECOMMENDED TO ANYONE THAT LOVES TECHNOLOGY AND GOOGLE PRODUCTSOne of the BEST purchases I ever made hands down", "verified": true, "helpfulness": "0/0", "author": "angel"}, {"rating": 5.0, "review": "excellent device.", "verified": true, "helpfulness": "0/0", "author": "Loureiro German Ariel"}, {"rating": 4.0, "review": "This product is perfect for what it is, but wish it would be compatible with te sling box app!", "verified": true, "helpfulness": "0/0", "author": "Samantha Pierce"}, {"rating": 5.0, "review": "absolutely love it, although it has a hard time remembering which tablet or ipad to sync to", "verified": true, "helpfulness": "0/0", "author": "ty"}, {"rating": 5.0, "review": "Very good~, easy to use and setup", "verified": true, "helpfulness": "0/0", "author": "Alexey Qian"}, {"rating": 4.0, "review": "Overall this little device is wonderfully convenient with a great user interface and an expanding library of compatible apps.  I give it 4 instead of 5 stars for two reasons:1) It only has HDMI out and no separate audio out.  So you're basically forced to use the substandard speakers that come with tv's unless you buy a device to strip out the audio like this:  http://www.amazon.com/gp/product/B00G9FDJNA/ref=cm_cr_ryp_prd_ttl_sol_152) This guy seems to use a lot of power as it heats up a good bit.  It has to be powered by a separate source as the HDMI won't power it. So you have an additional, awkward cord to deal with.", "verified": true, "helpfulness": "1/1", "author": "Clinton Smith"}, {"rating": 5.0, "review": "This is a great HDMI dongle and that it is powered by Chrome OS and able to stream is even more awesome.Just connect it to a wifi and follow the steps and then let it go to work. It’s like plug and play.Fabulous stuff here.", "verified": false, "helpfulness": "0/0", "author": "Nikifor Olegovich"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "T. Peterson"}, {"rating": 2.0, "review": "It worked perfectly until it gets damaged.  One fine day 3 monts later my Chromecast just stop working.This tiny piece of equipment heats like hell and I supposed that`s what damage it at the end.", "verified": true, "helpfulness": "0/0", "author": "Jose Jurado"}, {"rating": 3.0, "review": "this is kinda cool, but i never use it, and i bought it for hotel rooms, and it doesnt work, not enuff bandwidth.", "verified": true, "helpfulness": "0/1", "author": "Curtis C. Matthews \"pocket96\""}]