[{"rating": 5.0, "review": "The only downside to this device is that you cannot directly connect to the internet. However, with the flip function on the Kindle Fire -- you can watch things streamed on the internet.", "verified": true, "helpfulness": "0/0", "author": "William Robertson"}, {"rating": 3.0, "review": "I've only had the box for a week. The 30 dollar off Amazon VISA is a Good deal. Having to sign up for Sling TV for 3 months to get 50 more dollars off is misleading. Was going to get Sling free for a month anyhow. Sling TV has terrible quality. Do your own investigation on-line about Sling T.V. That has nothing to do with the \" box \" that's Sling's fault.The \" free \" movies on Amazon FIRE are for the most part B movies. There are so many games on the thing I wonder if you're not trying to cater to a gaming segment that I don't even know exists. With Play Station 4 and X Box 1 out there. All able to connect to the internet. So be it. Now, don't get me wrong. The box itself works. I haven't had time to explore everything it does. I know that if you research your own product on-line you will find that Amazon FIRE TV is # 1. I haven't done enough searching on Amazon.com to see just what you have to offer for on-line sales. I know that I will be keeping Netflix. They have some awesome programming. I'm not keeping Sling TV. I'll more than likely keep Prime. Some of what's on Prime is also on Netflix. DUH....that's T.V. right ?", "verified": true, "helpfulness": "1/2", "author": "Timothy J Clark"}, {"rating": 5.0, "review": "It works as I expected it too providing a great value with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Frank W. Gilchrist \"free\""}, {"rating": 5.0, "review": "Anybody knows is possible use Amazon TV with slingbox ?", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "While I've only played with it for an hour or so, my first impressions are it's well worth the price. It's snappy, I actually have a reliable way to watch prime videos on my television now since before I never used this feature of my Prime membershop. As far as looks, I love that it's black (all of my home theater stuff is) and the finish is nice (doesn't reflect the LED from my tv's name badge or the power LED on my subwoofer).And the thing I'm most happy about, I can now be a cord cutter! Some of my shows I watch I can get over the hair with an HD antenna, the rest are all available either for Sling TV, purchase or for prime streaming!I love my Apple TV and don't think I would give it up but this is a nice addition due to the Sling TV option.I've noticed there is one flaw, while viewing a video or any program if you press the home button it dumps you out to the main screen without any confirmation. It would be really nice if, while playing a video, a confirmation came up when pressing the home button.", "verified": true, "helpfulness": "1/1", "author": "Dante's Reviews"}, {"rating": 5.0, "review": "Easy to set up; easy to use; does more than expected", "verified": true, "helpfulness": "1/1", "author": "Timothy Garland"}, {"rating": 4.0, "review": "The Amazon Fire TV is a great device as long as you have Amazon Prime. It is not better than the ROKU 3. If you like Minecraft you can only play it with a bluetooth game controller. Overall it is a good streaming device but at this time it is missing a lot of apps and does not really have much of a game selection.", "verified": true, "helpfulness": "0/0", "author": "michael  case"}, {"rating": 1.0, "review": "Very disappointed.", "verified": true, "helpfulness": "0/4", "author": "aj"}, {"rating": 5.0, "review": "Marvelous.", "verified": true, "helpfulness": "0/0", "author": "sue g rowan"}, {"rating": 4.0, "review": "It set up very easily. I do have buffering issues sometimes still but it is rare. I wish I had access to Fandor through it. But all in all it has been a good choice.", "verified": true, "helpfulness": "0/0", "author": "Mr Toad \"Toady\""}]