[{"rating": 5.0, "review": "I bought this for my Samsung 6 Series. I will cast youtube and netflix using laptop and iphone. Good advantage with youtube is \"No ads in between\".", "verified": true, "helpfulness": "0/0", "author": "Ramakrishna P"}, {"rating": 5.0, "review": "easy to plug in and not worry about. and ganing support every day. biggest strong point is it can be controlled my mutable phones at the same time i had 8 people (7 first time users) actively adding to a single youtube playlist with no issues", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 1.0, "review": "It does not work!! Do not buy it!! If you really want it, ask me I'll send it to you for free!!", "verified": true, "helpfulness": "0/1", "author": "Saadi Reiman"}, {"rating": 5.0, "review": "This is a great product! It makes streaming to my TV much easier than running an HDMI through my apartment.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 2.0, "review": "This product did not do what I was looking for. Tabcasting has a long way to go with the device. So don't plan to go to your favorite stream website and get this running smoothly. It is for applications. Casting your computer to the tv is still a long way off.", "verified": true, "helpfulness": "1/2", "author": "Lee"}, {"rating": 5.0, "review": "I am extremely happy with the Google Chromecast. I use it everyday. It is going to help me save hundreds of dollars per year by dumping my current TV provider. I am looking forward to new apps!", "verified": true, "helpfulness": "0/0", "author": "gmredline"}, {"rating": 5.0, "review": "I was so pleased with my Chromecast that I went out and bought another one for a TV in one of our bedrooms.  Installs in minutes and is so easy to use that my wife (a technology idiot) was even amazed.  You can send a different movie or video to every TV in the house simultaneously and there is no drain on the power of your tablet or phone.  It would definitely be nice if Google expanded its partnership with more companies, like Amazon, and other companies that offer movies.  If you buy one of the several books available that teaches you how to maximize your Chromecast, you will learn how to cast anything on the internet to your Chromecast using the Google Chrome browser.  A definite hit!", "verified": true, "helpfulness": "0/0", "author": "Robert A. Dianella"}, {"rating": 5.0, "review": "Great product, works well. For its price, good product.I got apple TV, works pretty much the same way, but much cheaper", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 4.0, "review": "Easy to install and to use.I use it mostly for Netflix, and I have One little nitpick. When I'm watching a series, I'd like to have a button to finish the current episode and skip to the next episode. This is actually an improvement that would have to be made to the Netflix android app, not the Chromecast itself.", "verified": true, "helpfulness": "0/0", "author": "Franklin Harper"}, {"rating": 5.0, "review": "This turns any HDMI device into a smartphone enabled media center.  It's Google... what more is there to say?  Outstanding.", "verified": true, "helpfulness": "0/0", "author": "Chris Keiser"}]