[{"rating": 5.0, "review": "The best media player available. When I would use to watch moves on my smart TV sometimes the move would pause or disconnect. After upgrading to the Fire TV I have not had any annoying pauses the moves play flawlessly whether it is an amazon video or a Netflix video. The wireless networking is amazing it works better then my computer at getting a signal. The remote is grate the Fire TV can be in a cabinet and it will still work and one of the nice things that I have noticed is that when it is connected to my smart TV the TVs remote will control the Fire TV through the HDMI. Now it would be grate if Amazon could come out with a universal remote that works with all components as well as there Fire TV does.Thanks for a supper product and keep up the good work!!!", "verified": true, "helpfulness": "2/2", "author": "Keith"}, {"rating": 5.0, "review": "Works great. This is my second and a new feature has popped up. It continues to run if there are more stories/episodes  in the item selected. Don't have to keep clicking on the next episode to play. Well packed arrived early (thanks) and works with no problems. My tv has a 1.5 amp usb receptacle so didn't need the provided pwr supply. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Jim \"Jim\""}, {"rating": 5.0, "review": "Gpt this as an XMAS 2014 gift.  Set up was quick!  One snafu... couldn't get to work with my 7.1 until going to get an optical digital audio cable today.  All is well now!  Fios, I'm about to cancel all premium movie channels!", "verified": true, "helpfulness": "0/0", "author": "Rodney A. Harry"}, {"rating": 5.0, "review": "Yes it did. Was registered when I received it since I was a prime subgribter. The only problem was xfifitry or Comcast were not an option for HBO. Why not?", "verified": true, "helpfulness": "0/0", "author": "James Konsti"}, {"rating": 5.0, "review": "Very awesome, better than fruit tv", "verified": true, "helpfulness": "0/0", "author": "Ivan Leony"}, {"rating": 5.0, "review": "WORKS GREAT, LOVE IT.  YOU CAN WATCH JUST ABOUT ANY MOVIE YOU WANT. EVEN THE NEWER ONES.....", "verified": true, "helpfulness": "0/0", "author": "dot5"}, {"rating": 1.0, "review": "Does this play the Vudu movie app?", "verified": false, "helpfulness": "1/8", "author": "Michael Anderson"}, {"rating": 5.0, "review": "Works like a charm", "verified": true, "helpfulness": "0/0", "author": "Stephanie Bautista"}, {"rating": 2.0, "review": "It did OK displaying Amazon content, but content from Netflix and other video providers had noticeable digital blocking and other problems compared to Amazon content, and what I saw from Netflix on other devices. Plus Amazon does not allow loading of apps from Google Play.", "verified": true, "helpfulness": "0/3", "author": "Milton Scritsmier"}, {"rating": 5.0, "review": "I have personally purchased and used Apple TV 3, Roku 3, and Amazon Fire TV. My all-time favorite is AMAZON FIRE TV! I use a Windows-based laptop, so Apple TV's proprietary use is limited for me. Also, there is no Amazon Prime Streaming with the Apple TV, which is a huge letdown. I found that the Roku is awesome for its ability to be used with the built-in headset. You can do your gaming or television watching without disturbance, and without disturbing others around you.Hands-down, though, I LOVE AMAZON FIRE TV. The \"voice search\" is great, and there is very little buffering. What buffering there is will most likely be the fault of your WiFi. And it is nothing a quick reboot won't take care of. I highly recommend this product over all others!", "verified": true, "helpfulness": "0/0", "author": "GracefulGhost \"Quilting Bee\""}]