[{"rating": 5.0, "review": "Great item to stream video, show pictures or display desktop on your big screen television.", "verified": true, "helpfulness": "0/0", "author": "Jeff Laskowski \"j666laz\""}, {"rating": 5.0, "review": "I had been contemplating getting this thing for a while and now I wonder what the heck was I waiting for. I love the ability to stream the contents of my tablet or phone  on my TV.", "verified": true, "helpfulness": "1/1", "author": "Donnie"}, {"rating": 5.0, "review": "Must have at this price", "verified": true, "helpfulness": "0/0", "author": "SANDEEP SAHOO"}, {"rating": 4.0, "review": "Set up was pretty easy. You had to download an app to your phone/tablet, or use a computer. What I failed to understand from the description (I have to admit, I bought on the recommendation of a friend, and didn't spend a lot of time reading the information), is that you have to use a phone/tablet/computer to control the device. This is not a plug-and-play that allows you to go to a netflix app on your tv. You are, for example, going to the netflix app on your phone, but through this device, broadcasting it onto your tv.Since I intended to use this in a guest room, this was not a reasonable option, so it went back. It does work as intended, though.", "verified": true, "helpfulness": "1/1", "author": "Candace L Kludt"}, {"rating": 5.0, "review": "very nice shipped fast", "verified": true, "helpfulness": "0/0", "author": "Cheri Costa"}, {"rating": 1.0, "review": "waste of time for anyone not 100% committed to Android and Samsung.  I have a Samsung TV and it can do all of this already and better than Chrome does it.  It did not provide the extra capability like sharing non-Youtube content from my iPad.  My PC with the Chrome plugin (beta) also failed.  It crashed Chrome so badly that a full machine restart was required.  Maybe good hardware, but TERRIBLE supporting software.", "verified": true, "helpfulness": "0/0", "author": "Ibizarre"}, {"rating": 5.0, "review": "extremely nice product. love it especially since it helped me get rid of all the HDMI cables for playing online videos. Also it lets you project anything on your smartphone or tablet on to the TV.", "verified": true, "helpfulness": "0/0", "author": "Ajay"}, {"rating": 5.0, "review": "I have 3 of these. I use this and a Roku on my TVs and have been able to get rid of cable. I use Windows Media Center and Media Browser to DVR OTA broadcast channels.", "verified": true, "helpfulness": "0/0", "author": "xXTRo"}, {"rating": 5.0, "review": "Works really well for what it does uses your phone or tablet as the remote. The only thing I wish it had is Prime Video, but that is an Amazon issue not Google.", "verified": true, "helpfulness": "0/0", "author": "Distractedfocus"}, {"rating": 2.0, "review": "I'll give it two stars for the concept, ease of use, and of course the price. I enjoy walking in my front door and pressing play on my queued Netflix selection on my phone and having it turn on my TV to start playing said selection. It also has a slideshow of pretty pictures when idle, connects to a few different apps, and plays Netflix decently about half the time (I'm sure some of it is dependent on your ISP, device, TV).In the end though, it has essentially one job to do, and it doesn't do it well. Here's an example: I rent a movie through Google Play, on my Motorola (owned by Google) which runs the latest Android OS (developed by Google), and send it to Google Chromecast for playback. You'd think, with everything being Google, this would be seamless and smooth. Nope. Playback stalls and loads every few seconds then plays double-time to catch up and sound isn't synced most of the time. Unwatchable. So then, I try downloading the movie to my device to cut out the streaming process...just as bad. One final option: fire up the powerful desktop and sync it up through Google Chrome browser. This has a whole other set of problems.It feels unfinished, rushed, most likely due to trying to beat Amazon to the punch with similar products. Speaking of this Amazon-Google war, be sure NOT to find out the hard way if Chromecast plays Amazon Prime movies you just bought.", "verified": false, "helpfulness": "0/0", "author": "Christopher G Wales"}]