[{"rating": 4.0, "review": "Works great and was an easy installation, I would suggest this product to any one trying to link up a tablet etc to your TV", "verified": true, "helpfulness": "0/0", "author": "SA \"steve\""}, {"rating": 5.0, "review": "I have apple TV and sometimes feel that apple TV has slightly better resolution. However, Chromecast is not too bad. The best thing is that I can have something on chromecast, and then have another window where I am working on something else. So the kids can watch TV, while I am working on something else, with everything under my control. Mainly use it for netflix, some browsing, pics from google drive, etc.", "verified": true, "helpfulness": "0/0", "author": "MagicUNC"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player GoogleClick the stars to rate it Google Chromecast HDMI Streaming Media Player GoogleClick the stars to rate it", "verified": true, "helpfulness": "0/0", "author": "jose luis bertran"}, {"rating": 2.0, "review": "This product is advertised by Google as a plug an play type device.  I wanted to stop using my HDMI cable connection to my laptop for laptop viewing on TV and bought it hoping for an easy start.  After two days of trying I gave up and returned it.  I don't want to get on the phone with customer service and I don't want to reset my entire computer because of one device that is advertised as \"simple\".  I even had to restore my computer to a previous system.  I know, I am not the smartest computer guy, but millions of users aren't either.", "verified": true, "helpfulness": "0/1", "author": "Luis G. Navarro \"Luna\""}, {"rating": 4.0, "review": "I use this to mainly watch youtube. I am surprised by the quality of most you tube videos played back by chromecast on my 55\" HDTV. Most videos look nice, though some are very blockyI wish more apps supported chromecast, and wish I cold show play my photos and music too. Hopefully those apps will come soonSetup was a breeze and took less than 5 minutes.", "verified": false, "helpfulness": "0/0", "author": "Alpha Romeo \"Alpha\""}, {"rating": 5.0, "review": "This device truly does everything shown on the TV ad. I love it. It provided a way to watch shows (next day) while my satellite provider argues over rates to pay for blocked channels.", "verified": true, "helpfulness": "0/0", "author": "delia p hibbs"}, {"rating": 5.0, "review": "Works as advertised. New apps being added weekly. Very easy to simply plug and cast! Use the app to connect though....don't try to connect manually.", "verified": true, "helpfulness": "0/0", "author": "Reid Tankersley"}, {"rating": 5.0, "review": "So far, I love this thing! We have a Wii, and used to watch Netflix through it. But now that we have this, I don't anticipate ever using the Wii for Netflix again. Using the Chromecast makes it so much easier! I'm sure the list of apps will continue to grow, and I anticipate that it will allow you to view local media soon. Amazing little gadget!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"westerman\""}, {"rating": 2.0, "review": "I don't love it because I thought it would allow me to mirror my phone screen on to my TV and still use my phone's wireless data connection but it only connects by WI Fi which disables mobile data.  I'm not impressed by this device.", "verified": true, "helpfulness": "0/0", "author": "CottonFog Farm"}, {"rating": 5.0, "review": "Compact and easy to use. I got one for myself and plan on buying more as gifts.I am very satisfied with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Bane"}]