[{"rating": 3.0, "review": "Item has lot's of potential google needs to upgrade with more channels.  It works well. i had  little trouble pair it but i got it to work.", "verified": true, "helpfulness": "1/1", "author": "RUDY IRIZARRY"}, {"rating": 5.0, "review": "Fantastic device. Incredibly easy to install. Only $35. Great for TVs or Bluerays without wireless access. Best gadget of the year!", "verified": true, "helpfulness": "0/0", "author": "C. Kerchner"}, {"rating": 5.0, "review": "I just bought my second Chromecast for my other TV.  This thing is awesome!  I simply gave it to my 11 year old and he got it all set up.  The picture is so much clearer.  I was using a Samsung Blu Ray player before but playback just wasn't working that great and Chromecast did the trick.", "verified": true, "helpfulness": "1/1", "author": "Happy Mom"}, {"rating": 1.0, "review": "Chromecast was pushed out too fast and I as well as many others are owed a quality product. I bought this thing with the intention of using it to play local content and being able to stream what ever I wanted. When I go to a site such as Solarmovie I want to be able to see the movie streamed instead I get a black screen. I paid 100.00 for this when it first was launched on Ebay. I want my monies worth. So far I have no use at all and it has been siting on my desk for months.", "verified": false, "helpfulness": "4/16", "author": "Jon Nagel"}, {"rating": 2.0, "review": "This item, at best, is a 'beta' device.  It needs a lot of tweaking before it will be useful.  While the streaming works well with the native support for YouTube, Pandora and Netflix, trying to stream from your laptop or android device results in jerky unwatchable video. Even tried it with a local file as well.I already have a roku which gives me far more versatility than this item has in terms of quality streaming to my TV.  The only thing I was looking for was a device that would allow streaming to the TV from laptop or android device; in this latter regard the device fails miserably.  The only reason I gave it two stars is that the native supported streams work fairly well.", "verified": true, "helpfulness": "1/3", "author": "SkySurfer \"Bay Area Pilot\""}, {"rating": 4.0, "review": "Does the job as advertised. However not as easy to set up as Google claimed. A USB cable (provided) needs to be connected to the TV. However, once set up works well.", "verified": true, "helpfulness": "1/1", "author": "Street Shooter"}, {"rating": 5.0, "review": "Everything that it's advertised....  so simple and easy to use.  If you're tired of watching movies on your laptop and want to move those movies to your big screen TV, then this is the way to do it.  The only thing that I didn't like is that it requires you to download Google's operating system....  which I do not like because it slows down my laptop.  Other than that...  it's a great product.", "verified": true, "helpfulness": "2/3", "author": "Mockingbird"}, {"rating": 5.0, "review": "Excellent product. Great compliment to my Roku. Does everything I would want. Very easy to set up although I did have some issues setting up my second one. But if you have ever configured something to work on wifi it is nothing hard to get through. I highly recommend this.", "verified": true, "helpfulness": "1/1", "author": "rj"}, {"rating": 3.0, "review": "This item does what its suppose to. Nothing fancy but it works! streams and will display PC via Google chrome.", "verified": true, "helpfulness": "0/0", "author": "Devon Richards"}, {"rating": 5.0, "review": "Easy to set up and use. There are more and more apps supporting Chromecast every day. Using the website it was very easy to setup the device. Now, with the IOS app, setup and using it is even easier.", "verified": true, "helpfulness": "1/2", "author": "jerry550"}]