[{"rating": 2.0, "review": "Still too limited, must improve a lot the content offer and also the streaming abilities. So far you can do much more with a cheap HDMI cable connected at the back of your laptop.", "verified": true, "helpfulness": "0/0", "author": "Daniel BP"}, {"rating": 5.0, "review": "I doubted this idea initially, but it is now the staple viewing device in my house. With a bit more developer support it could be even better, but between YouTube, Netflix, and Plex, all the bases are covered for me. And for $35, it's a steal.I wholly recommend this product, and I'm hoping to see a new version or updates from Google adding more awesome features.", "verified": false, "helpfulness": "0/0", "author": "T. Jackson"}, {"rating": 5.0, "review": "I used to have my PC wired to my tv to watch netflix and youtube videos. This product is great.", "verified": true, "helpfulness": "0/0", "author": "williegomezt"}, {"rating": 5.0, "review": "We offered these as our client holiday gifts this year and they were very positively received with great enthusiasm. Really makes a great anytime gift.", "verified": true, "helpfulness": "0/0", "author": "STEVE"}, {"rating": 3.0, "review": "- My music seems to sporadically pause when using Google Play on an Android Nexus 5 (stock).- Redbull app seems to play sound on phone and on TV.- Songza wont play via Chromecast.- Allcast can't find the Chromecast.Still a \"beta\" product. If you want flawless integration, but an AppleTV or Roku. Google tends to release buggy products early and then work the bugs out as they go.", "verified": true, "helpfulness": "0/0", "author": "Markus"}, {"rating": 5.0, "review": "This little device is great to have around!  I got it for my husband for Christmas!  He plays with it quite a bit!  Also, we gave one as a birthday gift to my neighbor, and he loves it too!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jimaft\""}, {"rating": 5.0, "review": "Setup a TV with the intent of hooking it up to a Chromecast. Ordered Chromecast. It plays Netflix and Youtube flawlessly. Setup was painless. Integration with my phone is a little odd (your chosen output device sticks), but it works well. At $35, can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "Good product for the price. Downfall is that you should unplug it after every use because it become extremely hot. Other than that no problems at all. Very easy to download.", "verified": true, "helpfulness": "0/0", "author": "Busy in Northeast"}, {"rating": 5.0, "review": "This device has not let me down, it is very entertaining, I like it so much that I bought another.", "verified": true, "helpfulness": "0/0", "author": "L. Condiff"}, {"rating": 1.0, "review": "It's not a plug and play device for me. I am not able to make it work so far. It says the problem is in the wireless router but do not want to screw up the wireless router which is life line for the household.", "verified": true, "helpfulness": "0/0", "author": "Sasi Panda"}]