[{"rating": 3.0, "review": "The ChromeCast is nice to have but:1. Currently there are few applications that can broadcast to the ChromCast.2. The streaming quality is not good enough and you need a high speed internet and wi-fi router in order to watch clear movies on your TV (when you broadcast from you Chrome browser).", "verified": true, "helpfulness": "0/1", "author": "Ariel Sh \"ASH\""}, {"rating": 4.0, "review": "Works great from all my devices. I would give it a 5 star, but honestly its just that there are too few apps. I mean the amount of google developers FAR outnumbers the number of apps for this great tech. Maybe there is no money in it or something.", "verified": true, "helpfulness": "0/0", "author": "G. Alderson \"TitanFlyer\""}, {"rating": 3.0, "review": "It is a nice product:1. Casting Youtube videos from my laptop onto my TV is now easy (which was a hassle with my WD TV Live and the remote-controlled on-screen keyboard).2. I like the feature to case a tab while browsing in Chrome. You can easily share web content, pictures, and also music (ex. Grooveshark).3. Netflix works. I can't say it is much faster than with my WD TV Live, but time will tell if it's less prone to bugs.But there are a few disappointments:1. The sync is not very fast (you have to be patient)2. The 2nd Chrome on my laptop wouldn't see the CC anymore. Okay this feature is beta. I had to reboot Chrome in order to have it see my CC again.3. The audio gets micro-cuts. Depending on the type of music you are listening to and your expectations (I am some sort of audiophile...) it can be annoying, so I wouldn't consider that as \"high quality digital sound\".4. @Amazon: when I ordered my Chromecast I recall there was a promotion going on where you were supposed to get a code that would give you $6 to be used on Google Play for a movie rental. I didn't receive any code. Is there anything I can do to get it?", "verified": true, "helpfulness": "0/0", "author": "Adrien H."}, {"rating": 3.0, "review": "It got potential, but need more apps that can cast. I especially hope that it soon will be launched in EU so apps over here will focus on the possibility to cast.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Jensen"}, {"rating": 5.0, "review": "You cant go wrong with this purchase considering the price.  Works like a charm, and provides high quality of HD content", "verified": true, "helpfulness": "0/0", "author": "RBalm"}, {"rating": 4.0, "review": "Once Google adds more features, partners etc., this will be a killer device.  Easy setup, so that is much appreciated. Great to watch HD YouTube clips with on your HDTV.Sometimes YouTube freezes up and the video won't play-- especially if your Que is long.  I have to quit the app, sometimes shut the TV all the way off/down.  Then restart everything.  That is annoying but the only way to unfreeze video that won't play via YouTube.  Playing video via the Chrome browser on a big screen is nice... great for viewing in bed or for items that need to be displayed larger.  Good selection of Media outlets whose videos and podcasts you can view on your HDTV (e.g. CNET, TED, NPR etc.)Once Google adds more partners and apps, this will be a killer media device.  Great Price-- although I got mine on sale at Christmas 2013 (about $29.) I added the service Plexapp and now all my videos, pics etc, can stream to the HDTV. (Plex also lets you view your home ripped/created media on your iOS devices from anywhere.)", "verified": true, "helpfulness": "0/0", "author": "DinkyShop \"Good Stuff, Dinky Prices\""}, {"rating": 2.0, "review": "I was excited about getting my Chromecast and now I am more disappointed with it's limitations. You can stream YouTube, but there are also many other ways to do so and easier. App support is just almost non-existent and this device requires you to use a computer, smart phone or tablet in order to operate. It seems you must use the Chrome browser in order to stream media to your TV and, last but not least, in order to use the fantastic Plex app you must have a subscription which starts at $3.99 (this is well hidden from advertising; very clever on Goggle's part). After using YouTube and Plex, my videos kept stopping and I had to keep restarting the video in my phone or tablet.In my opinion, this is too much of a hassle to operate without video freezing. I will stick to my Roku 3 box which works flawlessly and it is a breeze to set up.", "verified": true, "helpfulness": "0/0", "author": "junin07"}, {"rating": 4.0, "review": "It's a great addition to my tv! Does need to be plugged in, that's the only downside to having it.", "verified": true, "helpfulness": "0/0", "author": "JKTeach"}, {"rating": 1.0, "review": "Not easy to install and required us to slow down our internet connection.We will stick with our Ruko streaming player.", "verified": true, "helpfulness": "2/4", "author": "Rita Beth"}, {"rating": 5.0, "review": "What is product can do may overlap many other products for content streaming, it fits in perfectly where you may not already have a device. Many people already have game consoles or dvd/blu ray players that can stream content, however where this device fits in nicely is bedroom that doesn't have one of these devices.Being able to easily add instant streaming to a TV that doesn't already have it is great. Instead of paying ~$100 more to go from a regular to a smart TV, you can add the chromecast and you're set.Also the ability to go on vacation and just plug this device into the TV and you're all set.", "verified": true, "helpfulness": "0/0", "author": "George B."}]