[{"rating": 5.0, "review": "Great product Fast Shipping!!", "verified": true, "helpfulness": "0/0", "author": "Ronnie Higgs"}, {"rating": 1.0, "review": "I bought this to be able to stream my slingbox to my TV.  Sadly, you need to actually stream from your phone to the chromecast (but I knew this going in and I already had the iPhone slingbox app).  Even knowing this, I had no idea how buggy and non-usable this is.  The stream, which runs fine on the phone, stutters terribly on the TV.  After a quick google search, I found out that this is a known issue because it looks like slingbox incorporation with the chromecast was poorly done.Now that the main reason I bought this was a failure, we decided to just stream a video file from our laptop to the TV.  I got the Chromecast Extension for Chrome to push MP4 files from the laptop to the TV.  This worked better than the slingbox, with only a noticeable stutter once every ~15 seconds until roughly 5 minutes into the video, it began to stutter to no end.You get what you pay for with this device, sadly for me, this $35 of garbage is not worth the time of my $2000 TV.", "verified": true, "helpfulness": "0/0", "author": "Brent F."}, {"rating": 5.0, "review": "Loved the Chromecast... use it mostly with shoebox and it plays the movies and shows  beautifully...", "verified": false, "helpfulness": "1/1", "author": "E.B."}, {"rating": 5.0, "review": "perfecto", "verified": true, "helpfulness": "0/0", "author": "hector estevez"}, {"rating": 5.0, "review": "My daughter got rid of her cable and satellite TV and just uses this. She's had it since last Christmas and loves it!", "verified": true, "helpfulness": "0/0", "author": "Kim Sargent"}, {"rating": 5.0, "review": "Great product, will recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "GK"}, {"rating": 3.0, "review": "Don't expect it to mirror anything.  Makes your iPad or phone into a remote for the few programs that it offers.  Works great for vevo which was really the reason we got it for the game room. It works just don't expect too much.", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 4.0, "review": "very nice gadget. connects your phone/tablet with your tv at a good wireless range. easy to set up.", "verified": true, "helpfulness": "0/0", "author": "FreFlo \"Freddy\""}, {"rating": 3.0, "review": "Really weak antenna. We went through three of these and finally gave up because the antenna was so weak and wasn't TRULY compatible with the apps listed.", "verified": true, "helpfulness": "0/0", "author": "Max's Dad"}, {"rating": 5.0, "review": "I don't use it very often, but it's there when I want to.  Very convenient.", "verified": true, "helpfulness": "0/0", "author": "Nino Brown"}]