[{"rating": 3.0, "review": "Me and the family love this as we can watch a lot of youtube stuff on the tv.Needs more apps especially with the new streaming player that came out from amazon this thing is very limited.", "verified": true, "helpfulness": "0/0", "author": "Robert Martinez"}, {"rating": 5.0, "review": "Excellent device. Very easy to use. Absolutely necessary to have it at home. We are completely satisfied with this purchase.  Thank you very much.", "verified": true, "helpfulness": "0/0", "author": "Irina G."}, {"rating": 3.0, "review": "Have some trouble with this regularly.  Most times it doesn't work very well and I just don't use it. Not recommended.", "verified": true, "helpfulness": "0/0", "author": "KD"}, {"rating": 4.0, "review": "While pink is good in other areas, it is not good when watching a movie. Overall I would like to see this have both bands for wifi and then the issue would be resolved.", "verified": true, "helpfulness": "0/0", "author": "Justin N Krakow"}, {"rating": 5.0, "review": "You can accomplish a lot more things with the Chromecast than with a Roku or apple tv. To top it off, the Chromecast is leagues cheaper than those devices.", "verified": true, "helpfulness": "0/0", "author": "Adrian M."}, {"rating": 4.0, "review": "Works as advertised.  In addition to plugging in to an HDMI slot, I also plug it in to AC power via the provided power cord.  My only real beef is that the unit gets VERY warm, even when not being used.  I suspect it is drawing quite a lot of current, so I don't keep it plugged in continuously.", "verified": true, "helpfulness": "0/0", "author": "Grant"}, {"rating": 5.0, "review": "We all love it. I can stream videos from my tablet or laptop to the TV while working something else on it. Works great with YouTube. You can also share your desktop or anything else to the TV, but it doesn't work good enough yet.Nos encanta. Podemos proyectar videos en la TV desde la tablet o la laptop mientras se trabaja en otras cosas. Trabaja muy bien con YouTube y si bien se puede proyectar el contenido del desktop de la laptop o cualquier otro video, esta aplicación aún no trabaja bien.", "verified": true, "helpfulness": "1/1", "author": "Alvaro"}, {"rating": 5.0, "review": "I use these all over the house for streaming PLEX and Netflix from android phones and android tablets.  Just for reference I have tried AppleTV (also PLEX) and Roku (failure - it didn't even work on half the TV's I have that were about 5 years old). This thing works everywhere and the picture is superb.  Could not possibly be happier with a $35 device!", "verified": true, "helpfulness": "0/0", "author": "R. Burrowes"}, {"rating": 5.0, "review": "I bought the chromecase device a couple of months ago after returning another Miracast device. The device is amazing. Here is what i like about it1. Price: It is the lowest price in the market2. Setup: The setup is extremely easy and it is straightforward3. functionality: When you try to stream a video from Youtube or Netflix, it does not just stream your browser screen, instead there is an app on the device that will connect directly to the service and stream the video. What this enables me to do is to leverage my computer to search (better than any smart tv app) and then turn my computer off once i start the streaming4. Idle state: The chrmoecast will act as a screen saver with very nice nature picture. Sometime i feel like leaving my TV on all the time :)", "verified": true, "helpfulness": "2/3", "author": "Tamer Farag"}, {"rating": 1.0, "review": "spent about 4 hours trying to set it up. no dice. no human to talk with to try to get it to work. Possibly would work with a new tv, new router, although both say supported. basically garbage for me.", "verified": true, "helpfulness": "0/1", "author": "Danny Avram Bennett \"soggydan\""}]