[{"rating": 5.0, "review": "Everything about this unit has met my expectations. Initially it tooks some getting used to because I have been using a Roku player. I expect that Amazon will continue to expand it offering in its app store. I like the units speed and overall operation.", "verified": true, "helpfulness": "0/0", "author": "Rene L. Hogan \"R.L.Hogan\""}, {"rating": 4.0, "review": "NEEDS MORE HD", "verified": true, "helpfulness": "0/0", "author": "michael a gast"}, {"rating": 5.0, "review": "Very pleased with fire tv.", "verified": true, "helpfulness": "0/0", "author": "MOMMA LAMMA"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "marco"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "H.cuddels"}, {"rating": 5.0, "review": "Amazingly easy to set up for a non-technofile.", "verified": true, "helpfulness": "0/0", "author": "Douglas Smith"}, {"rating": 3.0, "review": "question: do I have to have internet service/ wi-fi router for this to work on my tv?", "verified": false, "helpfulness": "1/1", "author": "Monica Alston"}, {"rating": 5.0, "review": "Great device easy to use, plenty of power for a quick interface.", "verified": true, "helpfulness": "0/1", "author": "Osmlady"}, {"rating": 5.0, "review": "This is the best TV viewing equipment I have experienced so far. Can be used wirelessly or with cable from WIFI equipment using Verizon cable services. Have also used this from Time-Warner Cable. Never a skip or loss of video with either service. Well worth the expense of purchase. Very highly recommended.I recommend  subscribing to Amazon Prime. This service provides many cost saving options (purchases from Amazon) and movie picks.", "verified": true, "helpfulness": "1/1", "author": "Dana Dudley \"DanaD\""}, {"rating": 5.0, "review": "\"The Little Black Box\"......Opened a whole new world of entertainment possibilities !!Just one click on the remote, and the world of free movies, favorite TV series, and gaming are waiting to be explored.My family loves Amazon Prime, and \"Fire TV\" Delivers it into our home !Blows Netflix out of the water !!!", "verified": true, "helpfulness": "1/2", "author": "Riveray"}]