[{"rating": 5.0, "review": "Best product ever, can't wait for more apps to take advantage of this. Using it with the Chrome browser is great.", "verified": true, "helpfulness": "0/0", "author": "Thomas Jonas"}, {"rating": 5.0, "review": "We enjoy using our Chromecast! We can play videos easily from our PC or laptop, including Amazon Prime videos. We love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 4.0, "review": "Great product. Easy setup. I just hope that Google allows more compatible Android/iPhone and iPad apps in the very near future.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "There is very little support currently, because Google still hasn't released the SDK. I'm expecting more streaming services to start supporting it when that happens. In the meantime, it works great with youtube and Netflix, which is definitely worth the low price tag.", "verified": true, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 5.0, "review": "The product works very well. i wish there were more options for choosing movies but maybe that will come in the future.", "verified": true, "helpfulness": "1/1", "author": "Brad W. Stacy"}, {"rating": 1.0, "review": "The device is completely unusable. - It is not discoverable from most of the mobile devices. - From Chrome it is discoverable, nut frequently disconnects and works very slowly. - No sound.", "verified": true, "helpfulness": "1/2", "author": "Andrei K."}, {"rating": 4.0, "review": "if you are looking for something play YouTube in your TV, so t he Chromecast is your best choice with HD video quality and it worth the cost, but don't try to compere it with Apple TV that for it's something different", "verified": true, "helpfulness": "0/0", "author": "Hairhem"}, {"rating": 5.0, "review": "Greatest gadget! We dropped our $100 a month satellite service months ago. This is easy to install! And fun to use.", "verified": true, "helpfulness": "0/0", "author": "rural ruth"}, {"rating": 5.0, "review": "It's a very simple and relatively cheap product. I've bought one just to try out and I was surprised at how easy it is to set it up and have it running. It is true there are only a few apps that can be used with Chromecast, but it works with Netflix and Youtube, so if you use those, this item is for you. I believe more apps are probably going to support it if its sales rise. But nonetheless it is a very good replacement for the more expensive Apple TV (which I also own), if you target Netflix. And it presents no difficulties to be controlled by your smartphone or tablet (including IOS devices). Its size is also well thought, as you can hide it behind your TV and no one will ever notice you have it there. That's it: simple, easy and affordable.", "verified": true, "helpfulness": "0/0", "author": "Rodolfo Vaz"}, {"rating": 3.0, "review": "doing the job well on supported apps. the problem is that the range of supported apps is very limited. waiting for google to add support for google+, images, mobile chrome browser and local viedos.", "verified": true, "helpfulness": "0/0", "author": "E.W."}]