[{"rating": 4.0, "review": "Love my chromecast. It has a few bugs when streaming straight from a browser but it's still in Beta mode so you have to expect a few bugs. I'm sure they will resolve issues with time. I use it every night for netflix/hulu from my phone. Makes browsing for, and watching programs easy.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Works just great!", "verified": true, "helpfulness": "0/0", "author": "Lynda Backer"}, {"rating": 5.0, "review": "Absolutely amazing!", "verified": true, "helpfulness": "0/0", "author": "Kelvin Aristy Carpio"}, {"rating": 5.0, "review": "Awesome product! Simple solution to streaming content from your Mac, PC, iOS or Android device. There is the occasional lag when videos are loading. If this happens to you look up the chrome plugins you need to disable and it should fix the problem.", "verified": true, "helpfulness": "2/2", "author": "Alex"}, {"rating": 5.0, "review": "Does exactly what you'd expect and does it very well. We have plenty of devices that perform similar functions, but none are quite as portable and quick to setup as this.", "verified": true, "helpfulness": "0/0", "author": "Nate Johnson"}, {"rating": 5.0, "review": "A very good product but it is a pity the limited number of devices models is useful for. I bought it for a Samsung 2.1 tablet but it failed to work when I turned to a Sony XPeria 10.1 tablet", "verified": true, "helpfulness": "0/0", "author": "Oscar Schwartz"}, {"rating": 5.0, "review": "This works great when my internet connection is strong enough.  I only get 4mb/s so sometimes it lags a little but I just pause the video im watching and get it a minute and then can watch uninterrupted. I'm sure with a faster internet connection there would be no problems.", "verified": true, "helpfulness": "0/0", "author": "Brett Boller"}, {"rating": 4.0, "review": "I wish there were a few more services I could stream using chromecast, mainly the WWE Network, but overall I really enjoy it. It's kinda like magic and makes paying for netflix worth it for people without smart TVs. I'm on the second floor of the house and the wifi signal tends to be pretty weak up here, but I've rarely had problems with chromecast due to this. My only real complaint would be that I don't like to leave it plugged in all the time and unplugging it after I use it every time tends to be a bit tedious. The packaging for this product is amazing though, I even kept the box just because I love the design.", "verified": true, "helpfulness": "0/0", "author": "Duckie"}, {"rating": 5.0, "review": "Chromecast keeps getting better and better.  So easy to stream music or videos, and with my Nexus devices I can mirror the screen as well.", "verified": true, "helpfulness": "0/0", "author": "Mark P."}, {"rating": 5.0, "review": "Awesome buy very happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "Upateric"}]