[{"rating": 5.0, "review": "Had to buy as it was on sale.  will install as soon as my tablet has what I need to benefit its use. busy w/ yard work little time to watch movies", "verified": true, "helpfulness": "0/2", "author": "tompete \"teepee\""}, {"rating": 4.0, "review": "This was packaged well, the instructions were easy to follow, and it works well, but it needs more services to use with an IPad.  You can stream the internet off a laptop but not an IPad.  So it works well; I just want to hook it up to show more than i can at this point.  I like that i can take it with me and watch movies in hotels, etc as well.", "verified": true, "helpfulness": "0/0", "author": "John D. Kuhnlein \"Occ Doc\""}, {"rating": 1.0, "review": "You can't even cast through the google chrome browser on an iPad.  Worthless if you have any game console or smart tv.", "verified": false, "helpfulness": "0/0", "author": "John T. Bird"}, {"rating": 3.0, "review": "I now understand why Google priced it at $35.This is a great device if you don't have an Xbox, PlayStation or smart TV.  Since I have an Xbox and Smart TV that support Netflix and other video streaming apps this device adds very little value.", "verified": true, "helpfulness": "0/0", "author": "Eric Julian"}, {"rating": 3.0, "review": "I knew going into the purchase that this would not work with Amazon Prime, but I am hopeful it will work one day with the service. If you disable Silverlight, it will somewhat work with Prime, but not reliable enough to say it works.Overall setup was easy and the instructions on the Google site are easy to follow and accurate. This works great playing Netflix and other supported apps. From the computer Chrome browser, casting is easy and works well. Not a bad little gadget for the price!", "verified": true, "helpfulness": "0/0", "author": "NC-Andy"}, {"rating": 4.0, "review": "Love it.  Easy setup. Fun.  No cables.  Apps available are growing by the month. Works for any platform of phone.", "verified": true, "helpfulness": "0/0", "author": "PMac"}, {"rating": 5.0, "review": "This product is so easy to set up, its awesome. It makes the processes easy, step by step instructions on the screen. It works seamlessly on my projector and another flight screen TV.", "verified": true, "helpfulness": "0/1", "author": "S. Marrero"}, {"rating": 3.0, "review": "misleading - almost all TV's will require a power cord to be used all the time. Would be better if you could stream anything you viewed on your wireless device instead of just specific apps.", "verified": true, "helpfulness": "0/0", "author": "Paul Hofius"}, {"rating": 4.0, "review": "Just so you're not fooled by the ads, this isn't REALLY a \"just plug in and play\" sort of deal. Depending on the type of tv you have, you might need to plug in the HDMI cable included in the box, and if your wifi connection is anything like mine, might take half the night getting your firewalls to allow the device access. Once finally set up and connected, however, it does exactly what I need it to do. I have a phone to access Netflix and Hulu, and use my Chromebook to cast Amazon Prime/tv channel websites. It probably won't replace Roku/Xbox/Playstation if you have it streaming through there, but it is easier and less space consuming than my hooking my laptop up to the tv.  I'm glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Nerdyesque \"Nerdyesque\""}, {"rating": 3.0, "review": "Does not work with kindle fire HD but does work from android phones for Netflix.  Also good with iPad, iPhone 4S and laptop. Another nice feature is that it can be easily moved between tv's without having to reconfigure casting options. Only four stars because it doesn't work with the kindle...Google needs to address this functionality as they advertise this heavily as being functional with android devises.  Misleading advertising regarding android devises cost the review two stars.", "verified": true, "helpfulness": "0/0", "author": "parent of two"}]