[{"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "Nestor Blanchart \"WEPALE\""}, {"rating": 1.0, "review": "Returned it", "verified": true, "helpfulness": "0/0", "author": "Elyse Bertling"}, {"rating": 5.0, "review": "I don't know what more to say about Chromecast. I love it and I love that more and more companies are supporting it. I use my Chromecast for Twitch.TV, Plex, and YouTube all the time. It also lets you cast an entire page on your browser, so if you want to stream a video to your Chromecast and the video player isn't natively supported, you still can. Good job Google!", "verified": true, "helpfulness": "0/0", "author": "Kev"}, {"rating": 4.0, "review": "Quality good, product as expected", "verified": true, "helpfulness": "0/0", "author": "Carole"}, {"rating": 3.0, "review": "It works great once you get it set up.I learned the hard way during initial setup do not change the name.  After two days of trying to get it to work and googling the problem I found people had problems when changing the name of the chromecast.  But since I exchanged it for a new one I've had no problems and love it.", "verified": true, "helpfulness": "0/0", "author": "Tony Tiller"}, {"rating": 1.0, "review": "SUMMARY:Pros1. Easy to install.2. Streaming performs well.Cons1. Uses a inexcusable amount of data 24x7 even when not in use!!!Explanation of 1-star rating. This product would rate four or five stars EXCEPT for a major defect, which Google knows about but fails to disclose and continues to ignore. That kind of attitude merits a 1-star rating from my viewpoint.Others have discussed most of the pros of this product. So I will address only a con, which for me is a deal-breaker. The product has a bug related to the backdrop feature. . This, to me, is a major defect since it USES ALMOST 10 GB per month EVEN BEFORE ANY STREAMING BY THE USER.If you have an unlimited data this may not be of concern but for those of us who have a data cap, the device is not worth it. All the pretty pictures that are displayed from Google in the background consume an inexcusable amount of data even when the TV is turned off unless you pull the power cord on the Chromecast AND THERE IS NO WAY TO DISABLE IT. I tried a factory reset and did not install the backdrop option but it REAPPEARS ON ITS OWN. This problem has been reported to Google many times by others and Google appears to be ignoring this (Just like they have ignored a bug in their calendar function for the last five years). It is sad to see Google ignoring bugs in its software and products.Another consideration: HDMI connectors are relatively frail. Google has at least supplied an extender dongle. I suggest using it instead of disconnecting the device from you HDMI connection.I bought two of these, and they are going back to Amazon. I'll stick with Rokus from here on out.BTW, if you are returning one of these, be sure to reset it to the factory default so your personal Wi-Fi connection is not on it.1. Works well for streaming3. Sucks data data 24/7Installation went fine but there is a major reported bug that Google does not acknowledge or deign to fix – it continuously streams back drop images even if you don't login. Even a factory reset still ends up with Google Hi-res images being streamed down 24/7.", "verified": true, "helpfulness": "0/0", "author": "Matrixunloaded"}, {"rating": 5.0, "review": "Works beautifully.  I plan to get another one", "verified": true, "helpfulness": "0/0", "author": "TeknikALPC"}, {"rating": 5.0, "review": "so easy to use I have no idea what these other people are talking about. I've hardly ever had a problem with it not connecting and if it doesn't connect u just reset it. takes three seconds!", "verified": true, "helpfulness": "0/0", "author": "jjstar22"}, {"rating": 1.0, "review": "Setup doesn't work.  Spent 6 hours on support forums trying everything, nothing worked.  Though I did manage to crash my router.  Hours on Verizon support, they couldn't help.  Finally found a number for Google, their personal support is just someone (non-USA) reading off a list of obvious things like, \"try turning off your router,\" and \"reset the chromecast.\"  Totally worthless and absurd.  Do not buy if you have Verizon Wi-Fi (the chromecast sees my network, my router sees the chromecast, but can't connect to it).", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Incredibly useful.", "verified": true, "helpfulness": "0/0", "author": "Micha Schwab"}]