[{"rating": 2.0, "review": "As soon as I switch to prime the screen goes from a 32 to 25 inch screen. Meaning that the movie I want to watch I have a hard time seeing since it is now so small.", "verified": true, "helpfulness": "1/2", "author": "Monica von Eggers"}, {"rating": 2.0, "review": "We had higher expectations as far as what we would be able to receive using  just our prime account. Everything else is an add $$ on.", "verified": true, "helpfulness": "1/2", "author": "Pam Minick"}, {"rating": 5.0, "review": "It was so easy to set up. I am so happy with this purchase. Now I can watch NETFLIX right from my TV and I don't have to run it through a gaming system. I was afraid I was going to have to buy a new SmartTV but when I heard about this I was so excited. I bought it on 'Black Friday' so I got a great deal on it. You can't go wrong with this.", "verified": true, "helpfulness": "0/0", "author": "Darla"}, {"rating": 4.0, "review": "Easy to set up and the voice search always gets it right!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "I absolutely love this device!!  Easy to use and access shows and movies!!!", "verified": true, "helpfulness": "0/0", "author": "Alesa Perkins"}, {"rating": 5.0, "review": "After our kindles best investment ever", "verified": true, "helpfulness": "0/0", "author": "michael parrotte"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Susan Mathena"}, {"rating": 3.0, "review": "Love the voice activated part, but I expected for there to be more free movies available thru Amazon Prime. Movies that you can watch on regular TV for free, they want you to pay for. Havent had enough time to make a real decisions so my post may change.", "verified": true, "helpfulness": "0/0", "author": "DD Crab"}, {"rating": 4.0, "review": "I hooked up my Amazon Fire TV over the holidays and am now addicted to Downton Abbey!!  lol...  I tried watching a movie (Hallmark movie) but it kept buffering...maybe it's my internet svc provider but I contacted AT&T; before I even hooked this up and upgraded to their 2nd to fatest internet speed (on their recommendation) but that obviously wasn't enough.  I haven't had any buffering problems watching Downton Abbey but I'm wondering if I'm going to continue to have issues w/ full-length movies.  This may be me and/or my provider and not Amazon's issue but I was disappointed that I couldn't watch the movie I wanted to on Christmas Eve.I'm still exploring this new device and need to figure out how to get sound through my Bose system.  But it's been fun so far and they seem to have a big selection of \"free\" stuff for Amazon Prime members.", "verified": true, "helpfulness": "0/0", "author": "Cindy F."}, {"rating": 5.0, "review": "Works where ever you have wifi, i've used it in 2 different homes we live in.", "verified": true, "helpfulness": "0/0", "author": "LadyEdith"}]