[{"rating": 5.0, "review": "Work perfect, voice activation is awesome!!  Great price and nice compact size!  So much fun, so little time!!  I Highly recommend!!", "verified": true, "helpfulness": "1/1", "author": "Debra \"truvalgal\""}, {"rating": 4.0, "review": "Things that I like:DesignSizeThinnessPerformanceEase of useDislikes :Lack of apps such as HBO Go", "verified": true, "helpfulness": "0/0", "author": "nchetoora"}, {"rating": 5.0, "review": "Received Friday.  Took 3 minutes to install and it was a go.  Used all weekend long.  Enjoyed movies, TV series, and music.  Very simple and easy to navigate thru screens and menus.  VERY HAPPY.", "verified": true, "helpfulness": "1/1", "author": "Jean S G \"JSG\""}, {"rating": 4.0, "review": "4* for Amazon Prime Instant Video use, and responsive interface. 3* for lack of integrated search if you are a Netflix user..Fire TV vs current gen Roku..In most areas I'd consider them comparable players for most users (lots of source options, and intuitive interfaces.  Video/Audio quality is great on both too.Search is much better on Roku compared to Fire TV.  When you search on the Roku, it checks all enabled sources, and will report which you have enabled (accounts), and you can see costs for various options. eg if it is free+available in one place, vs a cost on another vs unavailable elsewhere, it shows you that from a common search screen.  On the Fire TV from the main search it includes Amazon as a source, and it appears they are rolling out some additional sources to be covered, but it is /not/ including/comparing Netflix as an option.  example... Searching House of Cards shows S1, and no S2 both are on Netflix for free (if you are a subscriber). You have to launch the Netflix application, and use it independently, and from there. This is big deal for people that watch a lot of video from both sources, since every single thing you might watch might mean manually searching a few times with Fire TV, and it's always only one search on a Roku.Interface consistency is better on the Roku.  Roku fast-forward/rewind is always the same, for all video sources. On the Fire TV, some sources will use different buttons to move through the video.Both Roku and Fire TV are nicer IMHO than Apple TV in terms of video source options and remotes (don't require line of site, and have more clear functions.For someone that is 100% Amazon prime, and will never use Netflix, Fire TV is a nice fit.  If you subscribe to Netflix, or might someday, I'd give the nod to the Roku 3 (or streaming stick at half the cost) at least until/unless Amazon wisely integrates full (Netflix included!) multi-source search...  I've bought more than one of both brands (also previously used the WD HDTV, Roku 2050, Logitch Goole TV, and Google Chrome Cast)... My most recent order for a streaming player to be used by a friend who uses Netflix was a Roku Streaming Stick...", "verified": true, "helpfulness": "2/2", "author": "Ryan"}, {"rating": 5.0, "review": "Bummer, doesn't YET have all the channels I want from my old Roku 2. However, this thing is fast. It runs Hulu better than the Roku (ff and rw work great), and it runs Netflix correctly (allows you to choose the user each time to enter the channel, important for people with kids). When this thing crashes (it does, just like the Roku) it takes seconds to be back up and running as compared to minutes with the Roku. Installed all sorts of free games and have had fun with them. This is a great start for Amazon in the streaming box business, and I'm sure they'll be the leader in another year or two with this type of entrance.Update 4/22/14: I just noticed that applications are cached for awhile. Certain apps work well with this like Hulu, the app opens instantly if it has already been opened that day. Still, there are a lot of crashes happening, like Hulu timing out, Netflix not wanting to play (played fine after a reset, hasn't had a problem since), etc. The gaming is pretty great for this little streaming unit. Still very happy with the purchase, not going to dock it any stars because compared to the other devices I've used it's still top notch.", "verified": true, "helpfulness": "1/1", "author": "Boo Radley \"Boo Radley\""}, {"rating": 5.0, "review": "I ordered this unit and had it set up to enjoy on the second day after ordering. It is worth every penny to purchase. Combined with Netflix, you can enjoy almost endless entertainment.", "verified": true, "helpfulness": "1/1", "author": "allen"}, {"rating": 3.0, "review": "That is a problem then with the Amazon TV.  My theater room and other systems use RCA (analog) or component hook ups.  I have a ROKU that provides an AV phone jack that lets me run it on any device that has an RCA input.  Since ROKU has the same apps and movies on Amazon and Netflic I don't see the copyright issue?  I still like the Amazon TV but don't like the fact that an RCA connection does not work.", "verified": true, "helpfulness": "2/5", "author": "Gary Smith"}, {"rating": 5.0, "review": "Additional useful for viewing on your TV set has a lot of programming and is very easy to use, its cost is really good, I really liked this purchase", "verified": true, "helpfulness": "1/1", "author": "Pablo E. Ruiz"}, {"rating": 5.0, "review": "I received FireTV as a gift, and I love it! Looking forward to my son getting to explore the game options, and I am thoroughly enjoying the voice search option and all of the movies!", "verified": true, "helpfulness": "1/1", "author": "Sonia L Gates"}, {"rating": 5.0, "review": "Currently I also own: Roku 2 XS, Roku 3, Google TV, Tivo, WD Play. Favorite among those: Roku 3.I've been using Fire TV for 2 weeks and no regrets.Bottom line: If you don't have Amazon Prime, don't bother. Roku 3 would be a better alternative.=======================================================================Pros:====-Blazing performance! No hiccups while browsing User Interface, watching Apps, playing games.-Super-fast and quite accurate Voice search! I was playing Riptide GP 2 on Fire TV and wanted to switch to a movie. While in the game, I pressed the mic on remote, spoke \"The Thomas Crown Affair\" out loud, hit play and movie started. So in 2-3 seconds from an app to watching a \"selected\" movie. Nothing else comes close today. Even though Voice search is currently limited to Amazon Video and Vevo, you can always launch other apps using Voice search rather than browse the screen for them. Voice search is surprising accurate even with background noise.-Since Fire TV is based on Android, App and game selection is bound to grow.-Tons of other features that you can read up, but not as important.Exciting updates coming up...======================-Amazon FreeTime - I have kids and this is a must have feature. I won't go into details since it is not available yet, but if it will be like FreeTime on Kindle Fire, safe controlled environment for kids, I will be very satisfied.-Right now only Amazon Video and  Vevo are integrated to the Voice search. Voice search integration with other Apps will happen too. Should feel more complete with the summer update, which should add mp3s from Amazon and possibly free radio.Cons:====-Limited App selection. I expect this should improve with time. To each his own, but for me if they include Vudu and HBOGo, I am ready to ditch Roku.There is not a single streamer that has superb specs and all features, but Unmatched performance and Voice search alone make this the best the best streamer yet! Some other devices like Roku 3, Google TV have phone apps to cover the voice feature, but nothing beats having a dedicated controller.", "verified": true, "helpfulness": "2/2", "author": "A. Chadha"}]