[{"rating": 5.0, "review": "I love it. I had already been enjoying Amazon \"Prime\" movies & shows using my PS3. Now that I have the \"Fire TV\" there are so many more features, it makes the experience so much better.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "Amazon fire overall good don't buy Hulu won't down load picture stops sound doesn't or it just freezes sometimes good for hours then big bummer", "verified": true, "helpfulness": "0/0", "author": "Denisse R. Pierce"}, {"rating": 2.0, "review": "slow to up load movies music probably related  to  distance of tv downstairs to wifi router  upstairs near computer. unsure if  a more powerful router will make a difference", "verified": true, "helpfulness": "0/1", "author": "joseph george"}, {"rating": 5.0, "review": "Had some trouble getting the app loaded on to the fire TV.  The quality of the HD is far superior to any cable I have seen.", "verified": true, "helpfulness": "0/0", "author": "Ronald E Horn"}, {"rating": 5.0, "review": "If you have the fire tablet this is a must have", "verified": true, "helpfulness": "0/0", "author": "anthony benson"}, {"rating": 5.0, "review": "I tried using my blue ray DVD player to access Amazon Prime.  However, even after getting U-verse, the service through the DVD player was slow and had to stop 20 minutes into a show and stream some more.  After I installed the Fire TV, it works really well with no stopping to download.  I am a girl and I installed it myself.  One word of warning, if your TV has only a couple HDMI ports, you may need a splitter (one in and two out) to hook up the Fire TV. If your Fire TV is going to be a long way from your TV, you will need an HDMI cable.  Neither of these is included with the Fire TV, but Amazon carrie both of these extras at reasonable prices.", "verified": true, "helpfulness": "1/1", "author": "Spete"}, {"rating": 2.0, "review": "the reason i bought this device was so i wouldnt need to use my laptop or get a new tv. So money wise getting this device seem convenient. the need of a credit card even for things are free us not a convenient. The use is very easy.", "verified": true, "helpfulness": "0/1", "author": "felix"}, {"rating": 4.0, "review": "Would like to get HBO Go and Showtime on here.  Also would help if the voice commands would open in Netflix, not just on Amazon.Other then that, great product.  Super simple set up, walks you through everything, works great with wireless wifi and easy to use and navigate with.", "verified": true, "helpfulness": "0/0", "author": "Sheldon Geller"}, {"rating": 1.0, "review": "I purchased it for its ability to stream mlb TV but the application works terribly as it keeps buffering. I've looked at the mlb TV forum and apparently it is a problem across all Amazon fire boxes as there are hundreds of complaints. Amazon has replied that they are looking into it but thus far it is still terrible.", "verified": true, "helpfulness": "2/4", "author": "Janesk"}, {"rating": 5.0, "review": "I love the fire TV with Amazon Prime.  I have no idea how it works without Prime, but I honestly cannot see life without Prime anymore so for me that is not an issue.I am a bit of a streaming connoisseur, and the Fire TV is in a class by itself.  I've tried everything (Chromecast, Roku, Apple TV as well as streaming from several video players) and nothing comes close to the performance or control offered by the Fire TV.  For me if something takes 30 seconds to come up—I’m on to something else.I have a reasonably good network connection (30MB) and have never had a single stutter or lag.  I have heard that the Fire TV is actually anticipating what you want to watch and start pre-caching it--something that absolutely seems to be happening and is greatly appreciated.Installation: Very easy as Amazon is smart enough to know that I ordered a Fire TV to ship to my house so it comes pre-configured to be attached to my account so no trying to put in a complex password through point and click—it’s super easy.  It takes tremendous patience to put an iTunes account code into an apple TV—something that is a non-event with the Fire.  Of course, I wondered what it would be like if I ordered it for me to give to someone else—but since I haven’t done that—I cannot comment.it’s worth noting that Amazon refurbished worked the same way—it came preconfigured with my account just like the standard one.New Vs refurbished: the only difference I could see between the new one I purchased and the refurbished one I purchased was the price.  Both were pristine and worked perfectly.The remote is fantastic as is the control it gives you when watching TV.  I love the ability to skip 10 seconds forward or 10 seconds backward as things are going.  Things dragging as the director is artfully panning the landscape with a long / boring / establishing shot--SKIP IT!  Credits or \"Previously on...\" in the middle of a binge session--SKIP IT!  I got to the point where I know the shows I'm watching and how long they run their credits or intros and I know 3 skips for this one, 5 for this one--no other streaming remote offers this and it is a huge benefit to “keeping in the binge zone”.The free iPhone Fire TV Remote app is a good substitute for the remote performing all functions (including voice) and can easily be used in a pinch for when the remote disappears when it inevitably does.  Of course because it is a touch screen app that you need to unlock your phone, find the app, run it, etc. it’s not the same as the tactile feedback you get on the remote—so don’t lose it!With a broken leg, I ended up watching all 5 seasons of \"The Wire\" in 2 weeks (though I must say I ended up having very weird dreams)— loving every minute of it.  The fact that prime doesn't have commercials, is queueing up the next episode the moment the end credits start and I can skip the boring parts or opening credits with a few clicks means that I end up watching shows with the remote in hand as I enjoy the control.The processor is very fast and I can easily bounce between menus without lag or delay.  In my experience no other streaming box performs as well: Apple TV, Chromecast, Roku, Samsung TV, Dune HD, Oppo—they are all sluggish apps that are unusable—and this thing just flies.When HBO recently made their deal with Apple to give Apple TV an exclusive month subscription for HBO Go, I immediately downloaded it on my apple TV and subscribed (many of the HBO shows I love but not enough to subscribe to the cable version of it)  The interface was so frustrating, the quality was so poor, and the control was so bad--that I have essentially abandoned it (note to self: Cancel it).  I know Fire TV will implement it as an app, eventually, but I hope the experience is patterned after the awesome Amazon one and not just a port of the Apple TV one because it is almost unusable.  Sub Titles?  You can find it with enough digging--but they are virtually unusable.Speaking of HBO, Fire TV does have an HBO app, but it is the old app that requires you to already subscribe to HBO on cable—it isn’t the new HBO go that runs on apple TV.Subtitles: the subtitle function is very easy on amazon prime. Also, once you turn it on—it stays on from show to show so you don’t have to constantly add it if you are in a household or situation where you want subtitles.IMDB credit integration: nothing short of amazing.  Very clean, very fast, and very informative.  This is a huge feature of fire TV and no one comes close to this.  Seemed like a gimmick at first, but I actually find it quite useful.  It actually goes scene by scene and lists the actors and songs that are currently in the scene playing.  You can then pop them up and see other shows they were in—a really great feature that also helps you decide if you want to watch or not.Voice Integration: is another awesome feature that I didn't know I needed until I have it.  Works flawlessly every time and sets a new bar for others to try to measure up.VS. Roku - The interface and speed of Roku was so bad that it lasted all of 5 days in my house and that's just because I was lazy.VS. Apple TV - The apple remote is just lame and you don't realize just how lame until you've used the Fire remote for a while and try to go back and pointing at a keyboard 1 letter at a time again?  Please!  I give up with the Apple TV and there is no need with the fire because you can just talk.  With so much prime content, the Fire TV is head and shoulders above the offering at this point by apple.  Also, with apple TV the navigation is slow and sluggish and I find myself hitting the wrong thing so many times, I have to keep backing up.  A really good indicator is that I can buzz all over the Fire TV without so much as glancing at the remote—-something I can’t seem to do on other remotes.  My usage of the apple TV has dropped down to being used only when I want to play things off of my iPhone.  Apple TV (and especially HBO GO on apple TV) stutters frequently and eventually made me turn it off completely.VS. Chromecast - I admit I’m a bit of an apple snob, so I have a hard time with anything google off the bat.  But it is slow, poorly organized and I just find it not very well thought out. Like many things Google (aside from Search) to me it is a rushed, 80% solution. I have it in a conference room in case visitors need to connect to it to present—but it goes virtually unused.  I did try streaming content and it was slow to start and stuttered.  Not a great purchase.VS. IPad or Kindle Fire - Obviously the iPad is more portable, so if that is what you need—then iPad or Kindle fire is a no brainer. But if I would compare trying to watch on the iPad to watching with the Fire TV—it is a very different experience.  If people think “I have prime on my iPad or Kindle Fire so I don’t need a Fire TV” I think they are wrong.  If you enjoy the content on your iPad or Kindle fire and are watching it but you also have an HD TV—then don’t even think about it—get a fire TV as the user experience is that much better for less than $100 you cannot go wrong.Vs. Built In TV Prime Integration - I actually already had a fire TV when I purchased a new Samsung TV for the bedroom that had built in prime as an app and I used it for all of a few months before breaking down and ordering another (refurbished) fire TV.  It is just too slow and limited compared to the Fire TV and dealing with the TV’s remote to navigate the beyond sluggish menus was an exercise in extreme frustration not to mention that it takes 30 seconds to start up on the TV and is instant on the Fire.Made for Amazon Content: I found that the amazon shows are actually quite good.  The boys love Gortimer and can’t wait for new episodes.  In fact, the boys have all but abandoned traditional TV (they are 10 & 12).  For any kids shows they watch Fire TV or their Kindle Fire and for most everything else—it’s Youtube—they just don’t have the patience for traditional TV anymore.What would I change?  On the Device?  Not much.  Maybe the remote could be sturdier (feels a bit flimsy) Most of what I would change is with Prime itself.  When I see a show I want to watch (The Wire, 24, Suits, Warehouse 13, etc) and they have many seasons included in Prime that I can watch for free—I’m in heaven. Such a great feeling to see 5 seasons waiting for you that are commercial free, HD quality) But, when I get to a show that wants to change $2 a show?  Forget it.  My son wanted to watch Mythology documentaries.  Easy: pick up the remote and say “Greek Mythology” and you get a list of titles.  Then step through each one only for it to be: 2.99 or 4.99 even for things that obviously look old, in SD format, with no previews, nothing.  For me, they might as well be $1,000 as I’m never going to buy them.Give me “Prime Plus”, “Prime-ist”, “Optimus Prime”, “Primate” or “All you can eat Prime” for $10 a month and I’m there in a heart beat.  Or even give me a “Prime Only” setting where I don’t see any of that other crap when I search (maybe it’s there but I haven’t looked) or in the “customers also watched” section and it would be on full time in my house.  All I care about is prime content.Don’t think you are tempting me by showing me things that are a waste of money you are wasting my time.  Only the star’s family is going to waste money @ $3 an episode so don’t waste my cycles showing me things you aren’t wanting to give me for free.In conclusion, my two amazon Fire TVs are a must have and played every day.  I highly recommend this product and I think my above enthusiasm speaks for itself.", "verified": true, "helpfulness": "2/3", "author": "Video Nut"}]