[{"rating": 5.0, "review": "The chromecast is easy to install although a little more difficult to actually program. I was successful using instructionals - YouTube instructions and other web based assistance.  I did at one point have a disconnect between my TV screen and Chromecast.  Google has a forum where you can post any difficulties and get quick responses.  I consulted one of our company IT persons who had similar issue and the fix was to disconnect both the Chromecast and the AC connection; let it rest about 5-10 minutes, reconnect and VOILA !  It's a great device for Netflex and YouTube.  Would highly recommend", "verified": true, "helpfulness": "0/1", "author": "Lynda A Hennessy"}, {"rating": 3.0, "review": "It didn't work with all applications. It works only for you tube and just a few more applications. I was Disappointed.", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 5.0, "review": "I have both Apple TV and Chromecast.  They are equally great but Chromecast was one sixth of the cost. You do the math", "verified": true, "helpfulness": "0/1", "author": "Alex from Los Angeles"}, {"rating": 2.0, "review": "So, there's the deal.  I'd actually give this thing 5 stars if it worked as advertised, but that's not the case with the product I got.  Basically, what happens is after I start streaming - it'll time out for a while in the middle of what I'm watching causing me to lose a few seconds of what I'm watching.  I went through the steps to isolate the issue provided by Google. The basic way I narrowed it down to this device is by using a friend's flawlessly.  Google refuses to replace the device unless I actually pay for another device to be shipped to me and claims that they'll refund me after THEY RECEIVE the flawed device within 14 days.  I refuse to do business like this, esp. considering the fact that it took MUCH longer than 14 for Google to ship the device out to me.  Good luck if you buy one.", "verified": true, "helpfulness": "1/3", "author": "W.Train"}, {"rating": 1.0, "review": "i am an Amazon Prime member and love the movies included with the membership. i thought Chromecast would be great to display them without dragging a wire from my computer to the TV... only to find out it doesn't work with Silverlight.  so the device is useless to me and $30 down the drain.", "verified": true, "helpfulness": "1/6", "author": "Theresa E. Callahan \"Book Monster\""}, {"rating": 1.0, "review": "I'm sure this is an awesone product, however my Plasma tv is about 8 years old and it was not compatable.", "verified": true, "helpfulness": "1/3", "author": "Barbara J Brown"}, {"rating": 5.0, "review": "The Chromecast is a great product! Paired with the PLEX app, it will play just about any video file you throw at it.", "verified": true, "helpfulness": "0/1", "author": "Doug Erdman"}, {"rating": 4.0, "review": "We bought Chromecast with the hope of casting our home entertainment into the future like on TV - swiping the screen of the mobile device and flinging the images onto the television screen. Well, in that respect, we were disappointed. There are limited applications that can be used and simply viewed through Chromecast - HBO Go and YouTube in our household - but there is a promise of more to come. The device utilizes an HDMI port on the TV and we simply have to change the TV input to have it recognize the available mobile devices, when then can be displayed on the TV. Decent enough for $35, but don't expect too much versatility - I was hoping to be able to surf the interwebs easily on my telly, but not quite yet, I guess!", "verified": true, "helpfulness": "0/0", "author": "Bill Markwood"}, {"rating": 1.0, "review": "I got the Chromecast today, and been fighting with it for a while now.First, I connected it to a TV right next to the WLAN AP and tried to connect to it. My Android phone failed in it, but I managed to get my win 7 laptop to connect. It took me half an hour and a WLAN reboot and then it updated itself but seemed to work. Then I could also access it from my Android phone fine and start streaming. For some reason the win 7 laptop doesn't see the device any more though, but that doesn't matter.Now my main grief is we have a large house and have to use WLAN repeaters to extend the network between rooms. It appears Chromecast doesn't work with these. At all.I took the thing upstairs, and hooked it up and it worked fine with my Android phone. Then I installed the program to my win 8.1 tablet and it worked fine. Then I switched user on the tablet so my wife could also use it, and realized I'd have to re-install the program as well. BUT. It doesn't work. The Chromecast setup program sees it and everything seems to be fine, but in Chrome it says Device Missing. And what more, the image from the TV also vanished. When I reboot the Chromecast, it shows the Chrome text there for a while and then nada.Now the funny thing is, after this, it doesn't work at all with my android phone or my login in the tablet.If I bring it downstairs, it works with the phone, no longer with tablet. And I don't need it downstairs.So, it simply seems it won't work with WiFi extenders at all. Probably the first time it did work upstairs for a while it was still seeing the original WiFi signal for a while.Just a heads up - don't get the device if you use range extenders.", "verified": false, "helpfulness": "0/1", "author": "Antti Heikkinen"}, {"rating": 1.0, "review": "I stream 100% of my media using my android phone as a hotspot.  The Chromecast works great for things like Youtube but will not work with plug-ins like silverlight.  Plus the Chromecast app requires (Not optional) you to allow monitoring of your browsing habits or the installation will not complete.  In summary the Chromecast is just another junky gadget plus spyware.", "verified": true, "helpfulness": "0/2", "author": "Ben Davis \"Ben Davis\""}]