[{"rating": 5.0, "review": "What's great about it: Easy setup, easy to use, and Great PriceWhat's not so great: Not many apps....YetManaged to get one of the first batches and SO glad I did. Plugged it in to an available HDMI port for TV and USB port for power, so everything is neatly tucked behind my TV. I tried it with my iPhone and the current available apps, and everything streams flawlessly. But my favorite thing about this is finally being able to view web content on my TV. I have an AppleTV as well as other Apple devices, including a 2010 MacBook Pro. I was disappointed that my Mac is one year too old to be able to mirror my computer screen to my TV. Now, with Google's Chromecast, I can send any tab to my TV. And it's actually better than full mirroring, because you can send a tab of your choice to your TV and continue browsing other tabs (or anything else for that matter) on your computer without disrupting the signal that is being sent to your TV. If you simply mirrored the device, then everything else on your computer screen would be on the TV as well - and this doesn't do that. So it really is PERFECT for me. Well worth the $35 for that feature alone, let alone everything else it does too. And for those that say \"it doesn't have a remote\"... well it isn't supposed to. That's just another benefit. WHO wants to add yet ANOTHER remote? YAY!Pros1.Takes under 30 seconds to connect and start streaming. This does not stream from device, it streams through Wifi, therefore saving battery on your devices. You use the device as a remote.2.I tested using: all worked great!a.Nexus 7b.Laptopc.iPhone3.Streaming Netflix is flawless, but Subtitles do not work on the device. I have contacted Netflix, even though the Chromecast says it will display subtitles, it does not. Netflix has reported this up the chain so hopefully this will be addressed soon.4.Can multitask on the device while streaming Netflix. Does not affect the quality of the streaming.5.Youtube streams flawlessly too, sound is better than I thought it would be.Cons:1.You do have to have power going to the device by usb connection(included), so it’s one extra cord behind TV. I thought I wouldn’t need this., but not a big deal.a.This might be a reason why the TV doesn’t turn on when I play my Netflix? I read somewhere as soon as you connect, it should automatically on tv and switch to that input.2. Limited (for now) to only Netflix, YouTube, Google play media and Chrome browser with extension installed on laptop.3. Can’t access local/personal movies on Google Move & TV4. Can’t play personal music on google play (has to be in the cloud only or purchased from Google) This is my biggest Conflict with the device5. Using the Chromecast extension for browsing in Chrome is quite laggy, but I believe it is still in Beta testing stage. Playing videos from here does not work well at all, even on the lowest video quality setting. I found this as a workaround to play personal movies from computer, but it is very laggy and unwatchable. I don’t know if this is due to my Internet(which is 20gb) or laptop which is only 1 year old?Overall:It’s a good start, but if there is a way we can stream our ‘on- device’ personal movies/music, this I think will be a big step up. I don’t want to post all my recorded videos of my son’s Tball game on youtube. This would be time consuming.But for $35 you can’t really go wrong, with getting 3 months free Streaming Netflix. You can’t get any technology for this price. This is just the beginning of the Chromecast and I believe there will be more apps and programs to work with this. One comes to mind , is Pandora or maybe some games? Rumors are that Pandora is close. I expect the app market for this device to grow fast.I would recommend this to a friend!", "verified": false, "helpfulness": "0/0", "author": "sharmelan"}, {"rating": 3.0, "review": "I used it, like it but it just do not load subtitles", "verified": true, "helpfulness": "0/0", "author": "daniel"}, {"rating": 3.0, "review": "I don't know if my complaint should be with Chromecast, or with Netflix, but the Netflix app on my iPhone frequently looses track of what is playing on my TV.  When that happens, I can't pause, rewind, or save the program for later.", "verified": true, "helpfulness": "0/0", "author": "Jeremy G. Thurman"}, {"rating": 2.0, "review": "i have a roku and would buy another 5 more before another one of these, you're  better off spending a little more", "verified": true, "helpfulness": "0/1", "author": "Michael Cerswell"}, {"rating": 5.0, "review": "Excelente!", "verified": true, "helpfulness": "0/0", "author": "Giuseppe"}, {"rating": 5.0, "review": "Better than any other streaming solution out there.", "verified": true, "helpfulness": "0/0", "author": "Christopher B"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Ann Birdsong"}, {"rating": 4.0, "review": "This is a great concept with a few flaws.First, the pros: - Setup was a breeze.  I was up and running in less than 5 minutes. - Very easy to use.  Apps that support Chromecast streaming always seem to work.  The usability factor is great. - Can stream YouTube, Netflix, etc... directly from your phone to your TV.  Very cool! - Can project Google Chrome tabs or your entire desktop to your TVCons: - Streaming video quality is not as good as other systems.  For example, watching HD TV shows on Netflix through my XBox 360 gives me a crystal clear image with no pixelation.  The same show streamed through my Chromecast tends to pixelate large, dark areas.  If you're watching a show that's well-lit (say, Gladiator) you can't really tell the difference.  But if you're watching something that's a lot darker (say, True Blood) the pixelation in the dark areas drives me nuts. - When sharing your desktop or browser tabs, there is a bit of a delay between your action and the display.  This really only works as a mirror of your work surface, you couldn't use this as a primary display - It's not able to stream video games played on your PC/Mac desktop.  It just displays a black screen.", "verified": true, "helpfulness": "0/0", "author": "Aaron W"}, {"rating": 5.0, "review": "I love it... No issues with any device I have it used it with. More and more apps are using it and Android as wellI would buy again", "verified": true, "helpfulness": "0/0", "author": "Karim McCall"}, {"rating": 5.0, "review": "Nice unit. Works great.", "verified": true, "helpfulness": "0/1", "author": "khedquist"}]