[{"rating": 5.0, "review": "So easy !!!!!", "verified": true, "helpfulness": "0/0", "author": "Janie Morris"}, {"rating": 5.0, "review": "Love it! Thinking about getting rid of my overpriced cable.", "verified": true, "helpfulness": "0/0", "author": "craigdive"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "bigbaddoc"}, {"rating": 5.0, "review": "One the fastest,,,,it way beats apple TV Roku and so on I love this I'm gonna get me one more for my room", "verified": true, "helpfulness": "0/1", "author": "noah"}, {"rating": 4.0, "review": "Enjoying the product but wish it had more apps to choose from like Vudu.", "verified": true, "helpfulness": "1/1", "author": "Paule"}, {"rating": 3.0, "review": "Helpful, but doesn't yield much more functionality for me beyond that of the amazon app that comes preloaded on my vizio tv. I really got it because I felt the amazon games could make the $100 black box worthwhile but alas, game selection is pathetic and lame. Not to mention the price of the sold separately game controller. Perhaps if the game quality and selection improves I could recommend this, but as it is now I would say save your money and get a dedicated gaming system.", "verified": true, "helpfulness": "0/0", "author": "Christopher J. Demarco"}, {"rating": 5.0, "review": "Excellent product. I've been looking for a way to take advantage of Amazon Prime video and this was the answer! Loved it so much I cancelled my Netflix subscription. I don't use the rental feature but I have noticed it is cheaper then Comcast.I own a Chromecast, Apple TV, and Boxee Box and the Fire TV is the best!ProsAmazon Prime Video integration is excellent, you can search by actor, genre, etc. Voice Search is also extremely handySleek LookRemote w/voice search is excellent1080pGreat Wifi ReceptionXBMC compatible (with a little work) - this replaced any need for a home theater PCEasy SetupConsRestricted to Amazons App Store.Not many good appsNo in menu way to turn it off or restart it.Doesn't come with a controller (added cost)No way to really filter just Prime Videos", "verified": true, "helpfulness": "0/0", "author": "Ad A"}, {"rating": 5.0, "review": "Works well. This is my second FireTV and I love them. Even things like Netflix works better on this device than on a laptop. (Uses less bandwidth than a laptop for streaming)", "verified": true, "helpfulness": "0/0", "author": "skypapa63"}, {"rating": 5.0, "review": "I LOVE IT!!! Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 3.0, "review": "Ok, so I'm still on the fence. I can find what I'm looking for fairly quickly. There's lots to choose from on prime, to rent or buy. My problem starts with the remote. So far I have to remove the batteries, put them back in and plug and unplug the box before it will actually turn on and work!!  Really!?!? Is it too much to ask that I press the button and it goes on!!  I checked the troubleshooting section and plug unplug was the answer!!! WOW", "verified": true, "helpfulness": "1/1", "author": "ESK"}]