[{"rating": 4.0, "review": "Took a while to get it to cast, using my computer.  It finally works.  Unable to use it with my apple products.", "verified": true, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/1", "author": "BHARATH CHEKURI"}, {"rating": 5.0, "review": "Great for using Netflix on a stupid TV(non smart TV)", "verified": true, "helpfulness": "0/1", "author": "Joseph K."}, {"rating": 2.0, "review": "Doesn't work with my tablet", "verified": true, "helpfulness": "0/1", "author": "Nicholas Bettano"}, {"rating": 3.0, "review": "It works... but it would be cool if during streaming of TV shows on Netflix it could just play like it does on my computer and automatically go to the next episode. Using Chromecast, it stops and uncasts after every episode so I have to go to the next episode and then recast. Annoying first world problem. If this was fixed I would give it 5 stars but it's such an annoyance to me that I can only muster 3 stars. Sorry Google. Works flawlessly from my phone but seems to drain the battery some.", "verified": true, "helpfulness": "1/1", "author": "Elizabeth K."}, {"rating": 5.0, "review": "Works great with my PC and iphone. I stream all kinds of videos from the internet and can watch them on a bigger screen while I'm working on something else. It's easy to setup, and I've been using it for a few weeks with no problems.", "verified": true, "helpfulness": "0/0", "author": "Jason M. Jewell"}, {"rating": 5.0, "review": "Easy to hook up ,easy to use. We've had so much fun with this. Access to so much. We'll probably be getting a few more, this one keeps moving from room to room.", "verified": true, "helpfulness": "0/0", "author": "marilee siewert"}, {"rating": 1.0, "review": "Installation process is very complicated and didn't work with Comcast internet router.", "verified": true, "helpfulness": "0/1", "author": "MJ999"}, {"rating": 5.0, "review": "Does it come with built-in Wi-Fi?", "verified": false, "helpfulness": "0/2", "author": "Manuel Garcia"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "1/2", "author": "Pablo E."}]