[{"rating": 5.0, "review": "Google Chrome has been wonderful for our family.  We are easily able to stream movies from our iPAds or Samasungs to our TV.  I have a 4 And 5 year old and they can go between shows independently once it is casted.  I was wanting a smart TV, but this is better since the kids can manipulate it.  I will be ordering more for other TVs.We also have Apple TV, but prefer this, and because of the price, I recommend  this to anyone who asks about Apple TV.", "verified": true, "helpfulness": "0/0", "author": "EAIEAI"}, {"rating": 4.0, "review": "I was very pleased that Google came out with such an elegant and simple solution for those of us cord-cutters who don't have cable but like to watch YouTube and such on a large (non-smart) TV. I bought one of these for my brother (who had just gotten his first Android smartphone), and he ended up buying me one the next year, probably since I seemed to excited about him using his.For the most part, this little dongle does exactly what it's supposed to do. It's a bit heavy and clunky for a dongle, and I was disappointed to see that it requires a USB power source, rather than getting power from HDMI as some products do. It also gets a bit warm and has a bright light. All of these are minor gripes, since it just sits on the back of my TV and does its thing. Setup was pretty easy and will take about 5-15 minutes depending on tech level and the device you're connecting it to. I connected my laptop, and android smartphone, and an android tablet.Most content streams well, though there is about a 10-20 second delay at first. I have used it for Pandora, YouTube, Netflix, Google Play Music, and maybe a few other apps. My only major complaint is that, at times, the Chromecast seems to forget that it is streaming and will keep streaming even after I have paused or even closed the app on my phone or tablet. For instance, while playing a Pandora station, I will pause the stream on my tablet and switch apps, only to have the stream keep playing for several seconds, or, in some cases, indefinitely. This really bothers me. Sometimes the Chromecast will seem to forget what channel, station, playlist, video, etc. is streaming. Sometimes album art or other information will be several seconds behind the actual stream when it switches. In most cases, a simple reboot of everything will fix the problem, but it is frustrating, especially since I tend to use Chromecast when I am in a hurry and just want to listen to a quick few songs or watch a short video. For longer streaming sessions, I usually use the apps on my Xbox 360 or plug in my laptop with HDMI.I applaud Google for integrating Chromecast into so many apps and making it work on so many devices, but I feel that some more quality assurance testing would be helpful. I usually stream from my tablet, which is a Nexus 10 with the latest Android software, so I feel that there's really no excuse for bugs in that case. Another small gripe is the image quality. I don't know what kind of compression Google uses, but I notice that the video quality from the Chromecast seems inferior to my Xbox. The colors seem less saturated, and the resolution less sharp. This may be a byproduct of my WiFi network or some setting I've missed, but I feel that, since it's connected via HDMI, I should be getting 1080HD as long as the source provies that (and with YouTube and Netflix, it should be).Anyway, the Chromecast is a great product and very convenient once you get it setup. I think Google has a way to go with working the bugs out, but for $35 or less, it is an easy choice for cord-cutters and Android fans like me. If you already have an Android phone/tablet or a computer with Chrome, and you'd like to watch content on your HDTV without spending hundreds upgrading to a “smart” TV, this is a great option.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Poorly made", "verified": true, "helpfulness": "0/0", "author": "Robert Etheridge"}, {"rating": 5.0, "review": "Limited features but plenty considering size and price and ease of use. Can be very convenient at times.", "verified": true, "helpfulness": "0/0", "author": "Ben R"}, {"rating": 1.0, "review": "horrible!!! item came defective!", "verified": true, "helpfulness": "4/4", "author": "daniel estes"}, {"rating": 5.0, "review": "Works as described.  Good value.", "verified": true, "helpfulness": "0/0", "author": "Ed K Graham III"}, {"rating": 5.0, "review": "A friend recommended this. I am not what I call techie. This was easy to set up, easy to use and, because of it, I discovered that my Roku does the same thing! It was like getting 2 toys at one time when I saw that. Love it.", "verified": true, "helpfulness": "0/0", "author": "Monica Y. Dennis \"Writer, editor, business owner and mom\""}, {"rating": 5.0, "review": "I love our Chromecast.  I love how small it is, how easy it is to connect to a tv, and how it allows me to easily watch anything I want on YouTube.  I watch tons of tutorials on YouTube and that was the main reason I wanted the Chromecast.  It has also worked well for me with Netflix.  At this price point you can afford to get more than one if you have more than one tv.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "love the funnies"}, {"rating": 5.0, "review": "Finally, a solution to cast almost everything on your laptop/mobile on your TV screen. It works 99% of the time and it rarely glitches. Even when it does, switching the TV off and then on again fixes the problem. Great product", "verified": true, "helpfulness": "0/0", "author": "AYR"}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "ginny"}]