[{"rating": 5.0, "review": "It works rather well.  More convenient then using a set top box for Netflix.Best way to get Netflix / Youtube / Etc on the TV I know of.", "verified": true, "helpfulness": "0/0", "author": "Leala"}, {"rating": 5.0, "review": "I love Chromecast. It's easy to use, with any device.It's portable, so I can bring it places with me. I have even used it in a pinch for a presentation. All you need is power, wifi, and a Chromecast App. I can show most anything in chrome browser, so the limitations are few.", "verified": true, "helpfulness": "0/0", "author": "S. McNamara \"bigelectricmac\""}, {"rating": 5.0, "review": "this was easy to set up  and I was able to get into everything I wanted.  picture looks great on my TV and love that I can now use my netflix real time instead of waiting for disks.", "verified": true, "helpfulness": "0/0", "author": "G. Woodhouse"}, {"rating": 3.0, "review": "I have high speed Verizon Fios internet at home.  The Chromecast seems to have a constant delay.  It's really kind of irritating.  But the concept is really good.  It's so easy to \"cast\" a movie.  I just wish the stream would be steadier. Perhaps there is a fix to this that I am unaware of.", "verified": true, "helpfulness": "1/1", "author": "Angela Paradise"}, {"rating": 5.0, "review": "for what this costs and for my streaming needs this was perfect and the set up couldn't have been easier.", "verified": true, "helpfulness": "0/0", "author": "Jane Lin"}, {"rating": 5.0, "review": "I already owned one of these.  Now that more applications work with it, Chromecast is even better!  Highly recommend even if you have a smart-TV.  I don't even use my smart-TV features...I find what I want on Netflix on my iPad and then I fling it to the TV via the Chromecast Icon.", "verified": true, "helpfulness": "1/1", "author": "Lincoln Aux \"Aux\""}, {"rating": 5.0, "review": "Our TV is digital but not internet ready.  It works just fine but watching netflix through my son's old PS3 was bulky at best.  Chromecast makes it a breeze.  Anyone in my family  can control it with our Android phones.", "verified": true, "helpfulness": "0/0", "author": "Todd A Sorensen \"Mulchman\""}, {"rating": 1.0, "review": "I bought this for the TV in my bedroom, as I wanted to watch Netflix in there without paying $100 for Apple TV. Big mistake. The set-up process was supposed to be easy, and I suppose it would've been, had it worked. The problem was that it just would not connect with my wifi. The signal was strong, and i had no issues connecting to any other devices. Upon searching news groups, it turns out that certain routers are not compatible with Chromecast (wtf?) and that some routers need to be reconfigured. I logged into my router to reconfigure it, and some of the required changes are not exactly changes you really want to be making to your router. After making the changes, the chromecast was actually able to cast to my TV....for about 10 seconds,  before buffering for about 1 minute. Then, it disconnected, and when i tried to reconnect it, it could no longer find the chromecast. Sigh.So I repeated the process the next day. And then again the next day. Then, I pulled it out of my TV, put it right back and the box, and prepared to ship it to Amazon.Seems like it has some pretty good reviews here on Amazon, but before purchasing, I would recommend that you do some searches elsewhere to see more reviews, and to see what type of routers are compatible. If your router is not compatible, I wouldnt waste the time or money on this thing. Google has much more work to be done here.", "verified": true, "helpfulness": "0/1", "author": "KD"}, {"rating": 4.0, "review": "Wish it will support target ticket app too. I am satisfied with the overall performance and how easy it is to install", "verified": true, "helpfulness": "0/0", "author": "L. Lau"}, {"rating": 5.0, "review": "After researching various streaming device I gave the Chromecast a try. No remote is needed, as it will operate from a computer or smart phone. Simple to set up. I did using my Android smart phone and the Chromecast app. The quality and packaging of the device is excellent and the price is low. Casting can be done from the computer using the Chrome browser, but I prefer to use my phone. Once connected the device draws most of the needed energy from the wifi connection and the phone is acting as the remote. Broadcast quality is great depending on the quality of the content production.As to available content, there are a limited number of options. Netflix and Hulu plus are main sources, along with some other paid providers. For music there are Pandora and Spotify. I am a You Tube addict and this is available and free. More providers are coming and Google has the financial power to aid development.All in all I highly recomend the product and look forward to more content in the future.", "verified": true, "helpfulness": "0/0", "author": "H in San Diego"}]