[{"rating": 5.0, "review": "I love this device, I am able to watch Netflix, Hulu. I am very happy with my purchase. I received my Chromecast quickly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "still haven't been able to get this thing to working just wasted my money.", "verified": true, "helpfulness": "1/3", "author": "theresa smith"}, {"rating": 1.0, "review": "Couldn't get it to work", "verified": true, "helpfulness": "0/0", "author": "george piper"}, {"rating": 1.0, "review": "Horrible wasn't compatible with my TV last of money and Time.", "verified": true, "helpfulness": "0/0", "author": "Jamara Darby"}, {"rating": 4.0, "review": "After a rocky start I am happy to report my love for Google Chromecast grows with each free movie stream. As I said, a rough start. The constant interruptions with the \"loading\" message was maddening. I racked my brain and burned up the Internet searching  for an answer. Just as I was ready to give up all hope a moment of clarity....is it my WIFI signal that's the problem?  Ordered the Cysco plug-in Wifi extender and voila, almost perfect streaming. I took a chance and it paid off. My only gripe is the lack of compatibility with Amazon Prime Instant movies. Why Amazon why? If this flaw was fixed it would be an almost perfect love.", "verified": false, "helpfulness": "0/0", "author": "J Lapidus"}, {"rating": 5.0, "review": "This is the greatest way to show someone a video from your laptop to your tv. It's so nice not to have everyone crowd around a small screen to see something and being able to show it on  a big screen tv. I would recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Janis"}, {"rating": 1.0, "review": "Most useless piece of crap i ever bought. Wish I could return it and get amazon fire stick. But don't know how. Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "chip lovell"}, {"rating": 1.0, "review": "After an hour of this chromecast not connecting I felt compelled to write a review. We have the amazon fire stick and the chromecast.  We use the fire stick mostly because of the remote and not having to use a device to get things going. We recently bought a tv for the basement and I put the chromecast down there since we use it less. It worked for 22 minutes and then 2ouldnt connect again for over an hour. I'm throwing it in the trash and have another fire stick being mailed as I type. We've had intermittent issues with it in the past but this time was so frustrating I'm done. Done. Done.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "daniel hoyle"}, {"rating": 5.0, "review": "Everything was good", "verified": true, "helpfulness": "0/0", "author": "faiz"}]