[{"rating": 4.0, "review": "I like it for what it offers.  I would like it to have more apps that cast.  Thanks. Very affordable.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Bayer"}, {"rating": 4.0, "review": "Great device.  Wish I could stream what is on my laptop on it though. I am able to stream my browser and things like Netflix,  Spotify and some other things but I would like to stream what I'm doing on my laptop sometimes. It isn't able to do that yet", "verified": true, "helpfulness": "0/0", "author": "Zach Iverson"}, {"rating": 5.0, "review": "This is SO much easier than cords.  You plug it into your TV, download it onto your computer, phone, etc., and you're off and running.", "verified": true, "helpfulness": "0/0", "author": "accep10s"}, {"rating": 5.0, "review": "Now I can watch Netflix on my tablet and on my TV. This is a very good thing. It's easy to install and I am enjoying it a lot.", "verified": true, "helpfulness": "0/0", "author": "J. Brown"}, {"rating": 4.0, "review": "This gadget works pretty good.  There is a delay however between words and video.  I actually am using it for my power point presentations at work.  It works good for that, no excessive wires hanging around.  Over all very happy with this.  For the price you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Mark R. Gouker"}, {"rating": 5.0, "review": "I purchased my first Chromecast days after launch (got lucky and found one at a Best Buy) and have been in love ever since. This purchase was for our 2nd TV, and I'll be buying a third one for my son's room shortly. We also have Roku 3's on 2 of our televisions, and while the Roku 3 is a great device, the Chromecast does enough things better, and a few things the Roku can't, to make it a great complimentary device.The primary reason I purchased the Chromecast was for YouTube streaming to the TV and for playing my Google Play movie/TV purchases, and it does both quickly and flawlessly. (Since the Chromecast came out, Roku had added a YouTube channel that works similarly to the Chromecast, but it doesn't work as fast, doesn't have the queue function from multiple devices and won't play Google movie and TV purchases or rentals). My wife was skeptical about the Chromecast, wondering why we needed it, but is now addicted to using it for her Google Play Music.Speed is the primary reason I give higher marks to the Chromecast over the Roku 3 for several applications, the primary ones being Netflix and Hulu+. It's faster for me to pull up what I want to watch on my phone or tablet and send it to the Chromecast than it is to even open the channel on the Roku 3. We still use both devices, but it depends on the situation. If we're sitting down for a long session in one app, we fire up the Roku. For impromptu watching, the Chromecast works far more quickly for just a video or two. The only negatives I can come up with are that it does get hot after a long streaming session, but I expected that with such a small device, and the app compatibility is still limited, but Google has finally released the develops apk, and new apps are coming in all the time. All I’m waiting for now is Vudu support (coming shortly), and for AMAZON to release a proper Prime Video app for Android with Chromecast support. If both of those happen, I’d probably get rid of the Rokus on our secondary televisions! Seriously, this is the best $35 I’ve ever spent, hands down.", "verified": true, "helpfulness": "0/0", "author": "Paul Tobeck"}, {"rating": 5.0, "review": "What can I say except that this saved me from complete boredom.  I was using the Nintendo Wii to stream, but it wasn't good enough.  The Chromecast adds to the experience with better quality streaming resolution and more options.  It's also a lot more convenient bringing this with me on trips.  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Dave H"}, {"rating": 3.0, "review": "Made my PC freak out and crash. Pc didn't like it so much it rebooted itself to a earlier time and took out Google completely LOL", "verified": true, "helpfulness": "0/0", "author": "Cookie Monster \"CAM\""}, {"rating": 5.0, "review": "It works great. I have only used it with NET FLIX  but I will be trying it on other media soon.", "verified": true, "helpfulness": "0/0", "author": "richard j. zalewski"}, {"rating": 4.0, "review": "This this is awesome, I love it. except for one thing, If you have an older computer, streaming either movies in chrome or video from a streaming site (other than netflix, youtube or apps like that) you're going to have a laggy, interrupted time. It still works, but it is harder to enjoy. Lowering the bitrate, ie quality, will definitely help.Other than that this thing is awesome, beats having a long HDMI cable sticking out of my computer.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}]