[{"rating": 3.0, "review": "If you only want to use to watch amazon then it works great.  If you want to use it to watch your own video library?  Never mind..  it doesn't support that s***,.", "verified": true, "helpfulness": "0/1", "author": "Joseph Jackson"}, {"rating": 5.0, "review": "works fine easy setup", "verified": true, "helpfulness": "0/0", "author": "hasel"}, {"rating": 4.0, "review": "Do yourself a favor and compare the specs for the Amazon Fire TV to all the other set top boxes out there.  The processor speed, the RAM and the extra hard drive space make a big difference.  The only reason I am not giving 5 stars is due to the inability to play movies from my external hard drive.", "verified": true, "helpfulness": "1/1", "author": "Paul Podczervinski"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Merbla"}, {"rating": 5.0, "review": "love my amazon tv - better than roku.", "verified": true, "helpfulness": "0/0", "author": "T. Carter \"Tricialynn\""}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "Debbie Nelson"}, {"rating": 5.0, "review": "My sound system unit has a feature where you can go out to Amazon Video through it.  It was really slow to link in, it constantly checked connection speed, videos would sometimes lag as the buffer filled.  Frustrating.'Thought I'd try this... Fantastic!  No lag whatsoever.  Everything fires up instantaneously.  Watching movie previews or items in my library occurs immediately without waiting for anything to load.The voice command has worked flawlessly and responds well to my wife's voice as well.  It's great to be able to see all the movies an actor has done just by calling out her or his name.I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "R. A. Cook \"The Professor\""}, {"rating": 5.0, "review": "great product. very intuitive. works right out of the box.  So much faster than chromecast. Amazing amount of content. I did not expect the music library to be so rich.", "verified": true, "helpfulness": "0/0", "author": "Algernon S."}, {"rating": 4.0, "review": "Very easy to navigate. The voice feature only works on the amazon menu.", "verified": true, "helpfulness": "1/1", "author": "Mariana P."}, {"rating": 4.0, "review": "Handy way to watch a lot of stuff, unfortunately, there are teaser seasons (1st season or episode is free, then you have to pay for the rest once you're hooked - it's cheaper to by the season on disk, usually). Can't wait to try it hooked to a tv in the hotel when we travel in a few months to see how it fares. Needs to be fairly close to the router to cleanly stream the picture, though.", "verified": true, "helpfulness": "1/1", "author": "Cathy"}]