[{"rating": 5.0, "review": "The product will need an on / off button in the future.It will need a partition for app searches in the voice mode or spell mode.All of the rest is awesome....Fast, fast, fast. Does the job.It is the new standard for sure....back to the set box.", "verified": true, "helpfulness": "0/0", "author": "Jeff J Joy"}, {"rating": 3.0, "review": "First off lets start with the pros of this device:1. ASAP cache is pretty awesome, Prime content starts pretty much instantly.2. The size is perfect, no silly contours or shapes, it also has wired Ethernet which is a huge plus.3. The remote is comfortable and easy to use4. Voice search works great.5. Very powerful box, runs games pretty smoothly.6. Works with other (potentially cheaper) game pads, not just the Amazon FireTV Game padNow the Cons:1. If you don't have an Amazon Prime account don't get this box, you're better off getting a Roku2. No way to turn off the suggestions and videos that are not included in your Prime streaming account. I understand why this is (revenue generating) but at least make it a setting that's buried deep somewhere because it's pretty annoying and really uglies up the interface (try to browse through the Daily Show or Colbert Report videos for example).3. If you subscribe to Netflix you won't benefit from the ASAP cache which is a bummer, but not a deal breaker.4. The voice search ONLY works on videos in Amazon's Prime catalog, it will not search Netflix or other providers.5. If you've purchased a game on Android marketplace you'll need to re-purchase it here (even though on the back end this thing is running Android).If Amazon fixes these cons in an update package this player would be perfect.", "verified": true, "helpfulness": "5/6", "author": "blitzkrieg"}, {"rating": 3.0, "review": "worked super super fantastic for 2 weeks.  Now cannot get it work.  definte 5 stars when working, 0 stars right now.  average out to 3 stars.", "verified": true, "helpfulness": "0/1", "author": "Martin Cardelli \"50th court\""}, {"rating": 5.0, "review": "We are enjoying watching movies and TV shows and is very easy to setup and watch. Great addition to home entertainment.", "verified": true, "helpfulness": "0/0", "author": "Sedonasue"}, {"rating": 3.0, "review": "I like the Amazon Fire TV but I don't like that I can't get Blaze TV.  If I can get Blaze TV I will rate it a 5.", "verified": true, "helpfulness": "1/3", "author": "Vann Powell"}, {"rating": 5.0, "review": "I had streaming box with Netflix installed and love it till I noticed that they run old movies and no current boxoffice ones, once in awhile they would throw a bone and have a some what current movie, so I heard about amazon streaming device and read up on what the tech specs were and it was way ahead of any streaming devices, its uploads fast and I have unlimited newer movies to watch and the extra bonus is I get prime shipping in two days with my subscription.", "verified": true, "helpfulness": "0/1", "author": "surfdogal"}, {"rating": 5.0, "review": "Amazon surpassed my expectations with this jewel. It really is a gadget that anybody without a smart TV should have.", "verified": true, "helpfulness": "1/1", "author": "Neville Soper"}, {"rating": 5.0, "review": "We have the PlayStation 2 that we use to access Net flick or Amazon, there is so much time wasted by waiting for it to up load. I love the ease and the quickness.", "verified": true, "helpfulness": "0/0", "author": "Ryan and Ruth Brown"}, {"rating": 5.0, "review": "Great product--everything I expected and more--this is a great way for anyone to reduce their monthly cable bill. Better than Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Dr. Patrick M. Albano"}, {"rating": 5.0, "review": "We have had this product for a little over a week and we love it. We love the feature that allows you to talk to the remote and tell it what program or show you are looking for. This is much easier then having to type it into the search bar. It also has HBO Go (earlier reviews had said that it did not. It has since been updated).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]