[{"rating": 3.0, "review": "wish you guys had more Clint Eastwood old movies westerns for no cost ,", "verified": true, "helpfulness": "0/1", "author": "Rodger Dale Hundley"}, {"rating": 3.0, "review": "Disappointing can't watch ESPN.", "verified": true, "helpfulness": "0/0", "author": "B.K"}, {"rating": 1.0, "review": "Received one of these for my birthday and wish I could give it back! This is already my second one and it has the same problems the first one had. I go through their reset procedure to start every session and it stills locks up. I upgraded my Wireless thinking it would help and it didn't. The unit just stops video and needs paused and backspaced twice then restart movie so far 11 times in one episode of \"100\". Save your money and use another device.", "verified": true, "helpfulness": "1/3", "author": "retired air force instructor"}, {"rating": 4.0, "review": "I have both the Apple TV and Amazon Fire TV. Don't get me wrong both of the system is good, but if you are looking to use this every day get the Apple TV. But if you are an ESPN Watch type of person, go with the Amazon Fire TV, it doesn't lag as bad as the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Khoa Hoang"}, {"rating": 5.0, "review": "We love it, We didn't want a TV with cable for our kids, just one they can play on and watch movies, and as it turns out they watch youtube most of the time but well worth it.", "verified": true, "helpfulness": "0/0", "author": "Nicky Rosenbluth"}, {"rating": 5.0, "review": "Excellent.  Easy installation and setup.  A little slow at first to understand the menu and options and how the shows are arranged, but soon figured it out and all is well.  I love it.", "verified": true, "helpfulness": "0/0", "author": "CRAIG WELCH"}, {"rating": 5.0, "review": "We enjoy it immensely.  Combined with the Prime Membership, it has given us many a happy movie night!", "verified": true, "helpfulness": "0/0", "author": "Diva Mom"}, {"rating": 3.0, "review": "The movies and tv shows offered free with this purchase and the purchase of Prime, were a great disappointment.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't miss Directv and their $150/month Bill at all.  :o)", "verified": true, "helpfulness": "1/1", "author": "harrison  morton"}, {"rating": 5.0, "review": "Love it! Much less expensive than buying another Smart TV. Very easy to install and use even for the non-tech savvy. The voice command is good and gives many options of what you're looking for. I got the free 30 day trial for Amazon Prime, now I am going to purchase it after the trial. The quality is great as well.", "verified": true, "helpfulness": "0/0", "author": "Amy Briner"}]