[{"rating": 1.0, "review": "This product failed to meet my expectations in so many way! It worked when plugged to my TV but not when plugged to my audio/video system (which works fine with all my other HDMI devices). The setup failed the first few times and then magically worked. At one point, I had a blank screen and a blinking light, with no information on what was going on. Turned out the device had decided to self-update itself, worst UI ever.", "verified": true, "helpfulness": "0/1", "author": "Alok"}, {"rating": 5.0, "review": "No issues setting it up, great way to stream videos without a computer. Impressed with the high quality of the unit and the fact it automatically gives you the highest resolution, awesome little device!", "verified": true, "helpfulness": "0/0", "author": "Boomer"}, {"rating": 1.0, "review": "This is for those of you who do Not have a \"Smart-TV\". And even then, you should have enough memory in your TV to be able to handle data transfer from stick to TV.", "verified": true, "helpfulness": "2/4", "author": "R. Provencio"}, {"rating": 2.0, "review": "Very limited offering. Cannot browse webpages. Can only stream from few specific sources. Eventually I ended up connecting my iPhone with a lightning adapter and it was doing much better job. But for the 35$ wouldn't even bother to return it.", "verified": true, "helpfulness": "0/0", "author": "m"}, {"rating": 5.0, "review": "Awesome piece of technology, No need to connect the laptop anymore, plus I can play music from my phone to the tv.", "verified": true, "helpfulness": "0/0", "author": "gargoyle"}, {"rating": 4.0, "review": "This thing works great, right out of the box. Please note that I have an android phone and it works with many apps but for an iPhone, it only works for Youtube. Sorry not sorry! LOL", "verified": true, "helpfulness": "0/0", "author": "Michael HILL-JACKSON \"MJ\""}, {"rating": 5.0, "review": "Your product didn't work on my tv, but I gave it to my daughter to be used on their HD tv and it works great. Thanks for providing a great product.Sincerely,Teri Salvo", "verified": true, "helpfulness": "0/0", "author": "Teri"}, {"rating": 5.0, "review": "Love this device it just keeps getting better and better. Great way to take your internet services with you. Now has support for Realplayer cloud which allows you to stream local files on your mobile to the Chromecast. Great price and value.", "verified": true, "helpfulness": "0/0", "author": "Dominique Wilson"}, {"rating": 5.0, "review": "Good product for what its built for, Sturdy build quality even tho it starts to get really hot after consistent use. all in all great product with a lot of potential when it get additional app support", "verified": true, "helpfulness": "0/0", "author": "kendell"}, {"rating": 5.0, "review": "I've bought 2 for myself and 1 for my a Christmas gift for a family member. The Chromecast is so fun. I also I have an hdmi cable that I use as a backup when the wifi is spotty. I watch a lot of Youtube videos during the week and Netflix works with Chromecast too. I get to watch movies on my computer and play on my computer at the same time. For the people complaining about not having Amazon Prime and other video services I think they should get Plex. Plex lets you watch movies, tv shows and listen to music on your computer (it's 4 dollars a month and 30 dollars a year). So convenient and I think the screensaver looks cool. Really easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "meow"}]