[{"rating": 1.0, "review": "Two words: don't bother. Poor performance from the get-go, as sound and picture only erratically matched up, and picture routinely froze and jumped around. Watched a few youtube vids and now returning, as this is a disappointing product. Seems like Google's quality standards for their products is diminishing over time, which is a disappointing sign from a company that looked to be different from the rest. Also, the \"feel\" of the product is cheap and Chinese-y. Totally not worth $30; maybe worth a few bucks if you find one at a yard sale.", "verified": true, "helpfulness": "1/4", "author": "Beth Cron"}, {"rating": 5.0, "review": "This little dongle is great. I'm going to buy one for my bedroom tv. Just to watch youtube for a good laugh in bed.", "verified": true, "helpfulness": "0/0", "author": "ROCKWALL"}, {"rating": 4.0, "review": "make sure your TV has enough usb and hdmi ports this is a great gismo that doesn't require a BlueRay or Xbox to stream netflix.", "verified": true, "helpfulness": "0/0", "author": "Byron A. Patterson lll"}, {"rating": 5.0, "review": "Android's answer to the apple tv.  Its easy to setup and easier to use.  It does netflix,pandora and more every day.  also the price is so much less than any competitors", "verified": true, "helpfulness": "0/0", "author": "504forlife \"Proud to swim home!\""}, {"rating": 2.0, "review": "I bought two of these for my grown sons.  Neither were able to use them effectively.  Money lost on this purchase.", "verified": true, "helpfulness": "0/1", "author": "C. George \"Grammy\""}, {"rating": 4.0, "review": "It is great for streaming items like Netflix but I have not had any luck streaming items from my hardrive.", "verified": true, "helpfulness": "0/1", "author": "Shoe Lover"}, {"rating": 5.0, "review": "We love this device. What could be better than the Chromecast?! Easy to use, and a great streaming product. Thank you", "verified": true, "helpfulness": "0/0", "author": "Kyle Chabot-Maltz"}, {"rating": 5.0, "review": "Great little add-on to any TV with an HDMI port. Luckily mine has a USB port as well, so it's easy to eliminate the charger. I use this with Plex and it's the greatest thing ever. The ROKU interface is a bit nicer and doesn't require an Android device, but who doesn't have their phone or tablet around all the time anyway? Definitely worth the $30 I paid for it.", "verified": true, "helpfulness": "0/0", "author": "Dan P \"Dan P\""}, {"rating": 5.0, "review": "I love this product and am shocked that it is so cheap! I stream a lot and this makes it so easy and clean! I hated having to have a bunch of HDMI cords plugged in. The quality is outstanding and the set up is seamlessly easy. The only issue we have had is when setting up the laptop we had to install an addition installer. Phones and tablets take less than 5 minutes before you are ready to use it. I am so impressed with this that I have contacted all my friends about it and some have already ordered and they love it as much as we do!", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 5.0, "review": "When I first saw this chromecast unvailed this summer wanted one bad. Im glad I waited till christmas.  The price dropped on best buy and amazon 5bucks.  It works great if you watch alot of content on youtube.  After the setup wich takes 2mins i was up and running casting videos and showes easly.  Great nich product.  I even was able to case movies off of google play.  I watched Fast 6.  It streamed without a flaw.  I still can't get over the streaming HD quality.  Im a blueray nut and i think nothing else can be visually the same.  It was.. byebye blue ray player.. Sorry i wont' be using you for a while.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]