[{"rating": 4.0, "review": "Shipped on time and connected fine.  I only wish there were more apps that could be streamed.", "verified": true, "helpfulness": "0/0", "author": "Steven Hampton"}, {"rating": 1.0, "review": "This requires usage of computer and it installs too much adware and crap all over computer.  Took forever to find it all in the programs and uninstall everything.  Very inconvenient, it was actually easier to just run an HDMI cable directly from laptop to TV.  Purchased the Fire TV and it is a huge difference!!!", "verified": true, "helpfulness": "0/2", "author": "jill"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Felix Campos"}, {"rating": 3.0, "review": "I think the capability of the device is limited. There are not more applications to used with this device and it is not easy to view photos and videos from the phone because it is very slow to reach them over  cast app.", "verified": true, "helpfulness": "0/1", "author": "Ersan ARIK"}, {"rating": 4.0, "review": "Awesome product, above apple tv I guess, if you have an Ipad or an Iphone it will work great, it also depends on how fast is your internet. It does not have a remote which I think it should. Some times its hard to have the mobile device search for the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Penilla"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/1", "author": "FEFE SHOPPER"}, {"rating": 5.0, "review": "A perfect product, perfect seller", "verified": true, "helpfulness": "0/1", "author": "Majed Almutairi"}, {"rating": 1.0, "review": "It was nice at first but I had to stop using it because it was using so much data just by been connected, I have a limit from my provider so I can't afford using this gadget.", "verified": true, "helpfulness": "0/2", "author": "MIPM"}, {"rating": 1.0, "review": "Don't work good", "verified": true, "helpfulness": "0/4", "author": "Antonio velez"}, {"rating": 5.0, "review": "works flawlessly, easy to setup excellent quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]