[{"rating": 3.0, "review": "It's ok, but I guess I expected a little more from it. It does work well with the sites that already have the chromecast icon on them, like netflix and you tube, but there were sites that I couldn't stream from and they would either freeze or would not show the program properly. I was kinda hoping that it would work with all sites the same. But overall since it is wireless and it is convenient in that way I like it.", "verified": true, "helpfulness": "1/1", "author": "Nousha Jalali"}, {"rating": 5.0, "review": "Much better than apple tv.. doesn't hang and smooth streaming (tw) .. hence my rating pf 5 stars.. ... ..", "verified": true, "helpfulness": "0/0", "author": "Abhishek Gupta"}, {"rating": 5.0, "review": "i love android devices and this one is one of my favorites easy to install and to use plus high quatility product", "verified": true, "helpfulness": "0/1", "author": "Luis Batista \"LBA Import\""}, {"rating": 5.0, "review": "It is still in its early growth stage, and doesn't have as many apps as Roku, but the Chromecast is still the most cost effective way to stream media to your television.  And, once, it matures, and has a lot more apps, it will be the top dog in this medium.", "verified": true, "helpfulness": "0/0", "author": "Mike V"}, {"rating": 5.0, "review": "Totally exceeded my expectations. I was hoping for it to be: \"just ok\". Chromecast was easy to set up and the results, outstanding.", "verified": true, "helpfulness": "0/0", "author": "John L. Moffa"}, {"rating": 4.0, "review": "I switch this between two TV's - neither of which has connectivity for HBO-Go or Netflix.  Reading the directions and setting it up took less than 10 minutes.  Though others see it as a drawback, I prefer that program selection is controlled from my phone or tablet.  It's much easier and more efficient to select the show I want.", "verified": true, "helpfulness": "0/0", "author": "David Bernstein"}, {"rating": 5.0, "review": "these made great Christmas gifts.  The kids like them also.  The only thing I wish they would include is Amazon videos.  Been using the Chrome browser, netflix, and you tube.  The next step is to drop cable.  It is so cool to have the lap top in my lap and send a utube video up to the TV and then continue working on the lap top.  Ot, using the iphone or ipad and just send it up to the tv.  I through away the Roku and RCA gadgets in favor of the Chromecast.", "verified": true, "helpfulness": "0/2", "author": "Paul R. Finnell \"Soilman\""}, {"rating": 5.0, "review": "Easy to hook up.  I connected my phone and tablet.  I wanted it in order to play YouTube on my tv.  It works perfectly.  No more plugging up an hdmi cable from desktop to tv.  Picture and sound are hd.  Also I have not experianced any buffering.  And no commercials.", "verified": true, "helpfulness": "0/0", "author": "RGCJ"}, {"rating": 5.0, "review": "Because of this new device, i hardly use my cable subscriber anymore, and being able to not have to get up out of bed to pause or change what im watching, (like i used to have to do with my iPad adapter) when its cold is a major plus. If you follow the instructions its really easy to set up and starts working instantly", "verified": true, "helpfulness": "0/0", "author": "Rafael Ortiz"}, {"rating": 5.0, "review": "The Chromecast works great. It is very easy to install and very simple to operate. With just a click of the mouse button my laptop projects whatever is on the screen to my tv. It's especially great for streaming Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ricky Pak"}]