[{"rating": 5.0, "review": "Google has done it again. Simple, seamless and very solid construction. For the occasional streamer to the hardcore TV viewer this is the perfect device", "verified": true, "helpfulness": "0/0", "author": "Doc Kal"}, {"rating": 3.0, "review": "Perhaps I should have thought about fidelity and noise when considering a device that uses only Wifi for communication, but perhaps I was simply optimistic. Regardless, the facts are these:I live in canada, which means that for the foreseeable future, I will be using the Chromecast exclusively with my Chrome browser, and no apps.I primarily want to stream local media from my pc, not netflix (I would rather have 1080P Netflix from my xbox, than 720P Netflix from a device that I don't have a remote for).Local media being played through my browser only works correctly with certain filetypes, but stutters and jumps. It's laggy.I've connected my pc through the lan, and that has alleviated much of the issue, but the playback framerate is still not perfect. I can deal with a little blocking or quality loss, but awkward stopping and starting of playback is unacceptable.Having said what I have said, I will be keeping the device, getting updates, and hoping support for canada and everyone improves.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "awesome device for streaming movies and youtube and netflix if you don't have a dedicated box for your tv. hopefully google will add extra features soon", "verified": true, "helpfulness": "0/0", "author": "jaime"}, {"rating": 5.0, "review": "It does what we thought it would do. The only problem was our fire wall needed to be disabled during installation.", "verified": true, "helpfulness": "0/0", "author": "Don Oakland"}, {"rating": 4.0, "review": "Works pretty well, but without the ability to stream whatever you'd like its a crippled device. Currently can only stream netflix, youtube, and google music (well), and chrome tabs (poorly).  Would live to see this device opened up to developers who can unlock its potential.", "verified": true, "helpfulness": "0/0", "author": "udamdirtyape"}, {"rating": 2.0, "review": "Not as compatible as advertised. Will not let you go to full screen if your watching a video in chrome browser", "verified": true, "helpfulness": "0/0", "author": "Hicham Bazzi"}, {"rating": 5.0, "review": "Does everything it claims to well.  So much easier than the Roku and \"Smart\" DVD player I was using.  It is fast, and that counts for a lot. Setup was easy.", "verified": true, "helpfulness": "0/0", "author": "Joshua A. Goettsch"}, {"rating": 1.0, "review": "I wa so looking forward to using this device. After hooking it up we could not get it to work. We then called chromecast  for help.We spent 1 1/2 hours on the phone with the helpline. At the end, the device showed a red light and the help line said it was now broken. She told us the device needed to be within 20 feet of our router. If this is true it certainly wasn't marked on the info I read. I was very disappointed. Will look around for another device  that we might be able to use.", "verified": true, "helpfulness": "0/0", "author": "ELLIE"}, {"rating": 2.0, "review": "I have a Galaxy Tab 2 and trying to get Netflix to work with it is impossible.  If I use my MAC it streams Netflix but with no sound.  Hopefully they come out with an update to fix these issuses, but until then save your money and time!", "verified": true, "helpfulness": "0/0", "author": "G.L."}, {"rating": 5.0, "review": "I have always used cables, adapters and it is not comfortable and it watches awful. With google chrome I solved it. Excellent signal, no cables, high resolution... Cannot ask more!", "verified": true, "helpfulness": "0/0", "author": "Ronald"}]