[{"rating": 5.0, "review": "Well I have owned Chromecast for over a month now and I really love the simplicity of the product.  I have several devices that I use for streaming content to my TV's (Xbox, PC..etc.) and Chromecast is by far the easiest to setup and use. I am anxiously awaiting integration into other applications and would love the ability to send photos or local videos from my phone. For the price I would highly recommend.  It will make a great gift for techies and non techies.  Parents were over visiting and showing YouTube content on their iPad so I had to show them the Chromecast.  They ordered from amazon immediately after my demo.  The best part is when you have friends over and want to share videos from YouTube or Netflix everyone can participate and queue up videos.  Now just need Google to open up the api and allow additional functionality.  Come on Google open er up.", "verified": true, "helpfulness": "1/1", "author": "Jason L"}, {"rating": 1.0, "review": "I wasted 45 minutes trying and retrying to get this device set up. No helpful troubleshooting. Don't waste your time and money?", "verified": true, "helpfulness": "3/5", "author": "Lanny Levin"}, {"rating": 5.0, "review": "Great addition to my electronic selection. When there nothing I want to see on TV I just switch to my Chromecast and pick a movie or an old TV show I can't get on the TV now. Love it.", "verified": true, "helpfulness": "0/0", "author": "Springtime"}, {"rating": 5.0, "review": "Works great with my Nexus 10.  Just downloaded the app, plugged the Chromecast into the TV and was hooked up in 2 minutes.  The video feed looks like HD 99% of the time.  On occaison it will get a little blurry but fix itself.  Typical for wifi-streaming video via Netflix.  Still trying to figure out how or if it's capible of internet browsing.  So far, I have no clue.  I'm sure the google nerds will figure it out.", "verified": true, "helpfulness": "1/1", "author": "M. Hathaway \"Champ JB\""}, {"rating": 4.0, "review": "Setup is a little squirrely.  If you are running a VPN on your setup machine it interferes with setup but not operation.  Once set up is done, works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Donald K. Todd \"Sailorman\""}, {"rating": 4.0, "review": "Works as advertised. Might come back for more if it becomes more flexible as a true streaming player by figuring out how to throw a wider variety of sources and content at the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Alex S."}, {"rating": 4.0, "review": "Apparently Samsung model TVs will only sense this device in one of their usb ports.  So it took 3 tries to get it installed but after that setup was pretty easy.I had intended to use it primarily with my iPad but discovered that currently only You Tube and Netflix are compatible with it.  Stuff I wanted to watch via Safari or Chrome would not cast.", "verified": true, "helpfulness": "0/0", "author": "SemperFi Guy"}, {"rating": 5.0, "review": "Simple to install on your TV -- just plug it in.  Installation on iPad/PC was just as simple -- download and install.  Automatically detected devices.Now I just open my iPad for Netflix, instead of starting xBox, signing in, blah blah blah.  Much smoother and faster.", "verified": true, "helpfulness": "0/0", "author": "DogDaze"}, {"rating": 5.0, "review": "if u have a budget for your frens, what better way than to give them this! worth the money and useful for presentation.", "verified": true, "helpfulness": "0/0", "author": "N.Smith"}, {"rating": 5.0, "review": "We love it so much I am going to purchase another!  It is so nice to be able to have the ipad away from the TV and utilize the TV speakers.", "verified": true, "helpfulness": "0/0", "author": "Tracey"}]