[{"rating": 5.0, "review": "I purchased this unit in order to stream Amazon Prime direct to the HDTV. SUPER Easy Set-Up. The voice activation search feature works very well. I ended up returning the unit only because I decided I'd rather stream Amazon Prime via an Amazon licensed Blu-Ray/DVD Player (only a couple of models available at present) to eliminate one control unit. If you're looking to stream Amazon Prime (and the other services licenced to the device) and you want to \"get it done\" painlessly, this is the unit for you.", "verified": true, "helpfulness": "0/1", "author": "Peter G. Bragg"}, {"rating": 5.0, "review": "The Amazon Fire has essentially eliminated the buffering delay I had grown accustomed to using WII for Netflix.  I love the small footprint and instant response.", "verified": true, "helpfulness": "1/1", "author": "Richard Walton"}, {"rating": 5.0, "review": "You do need to have a high-speed internet to stream things but this is great!  Lots of options to chose from.", "verified": true, "helpfulness": "1/2", "author": "chellig"}, {"rating": 5.0, "review": "wow this is great super entertainment thats easy to use.the picture is fantastic much better than my sat. good movie choices and the games are super!!! i am impressed the speed that movies come up much faster than my blu ray. thank you amazon.", "verified": true, "helpfulness": "0/2", "author": "sweet sue"}, {"rating": 4.0, "review": "I am very satisfied with kindle tv, the only complaint is I can't use amazon video on two devices at once.", "verified": true, "helpfulness": "1/4", "author": "Tiffany H."}, {"rating": 2.0, "review": "I had issues with the first one, had it replaced, saw only marginal improvement.The voice search is first rate, give it a ten.But whenever I watch shows and want to watch another,= in Hulu or Netflix, I'm always asked to pay to watch.  It will not remain in those even thought I've posted my password.  I have to unplug the device every time, start over.  Give this feature a 0.It is much easier to browse both those sites on my computer.  You just get part of what's available on TV.  Give this a 5My picture switches back and forth from bright to gray to bright.  this doesn't happen when I'm watching regular TV.  Give this a 0I would not recommend this item at this time.", "verified": true, "helpfulness": "3/8", "author": "Roy"}, {"rating": 5.0, "review": "Easy setup, menu is simple.remote is very handy  and ican easily find what I want . The watch list menu allows metro program what i want to watch for thenext week or so.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is one device that I all can say is buy it! It's great and the Roku XD and Roku 3 on my other TVs will be replaced ASAP!!! The talk feature works excellent with my system(s).", "verified": true, "helpfulness": "0/0", "author": "Grover D Carson"}, {"rating": 1.0, "review": "No mlb tv which really burns my cookies because bestbuy said it was on there. The free content on prime is hard to find. Anything that you would want to watch you have to pay for which defeats the purpose of cutting the cable. When it's all said and done you would pay more. I returned after a week and only turned it on twice. Once because I was excited to play with it and the other to give it a second chance.", "verified": false, "helpfulness": "3/19", "author": "Gonzo"}, {"rating": 5.0, "review": "This device gives me instant access to Amazon Prime movies and Netflix movies! It works great! It replaces a new Sony DVD player with the same features, however the Sony unit takes forever to access the movies and loses internet access often and must be reconfigured. The Amazon Fire TV unit is instant on and accesses the movies within seconds. In addition, the Photo and Video access to Amazon Cloud allows me to display these on my TV. I do in fact love this device!", "verified": true, "helpfulness": "1/1", "author": "William S."}]