[{"rating": 3.0, "review": "Great picture, Easy hook-up but.... It's what amazon doesn't tell you. lets start with prime music on a iphone if you have prime you can search prime music listen and add it to your library Not on amazonTV. HBO to go Or ShowTime to GO  apps work great on my tablet not on Amazon TV if you have comcast. ESPN works great. This could be a really great device but I think a rush to market will leave them constantly behind. I would also like to see the ability to add apps like Jazzradio.com or other internet sites. Maybe even go farther and allow the amazon TV to be a download app to personal servers on home computers like JRiver.", "verified": true, "helpfulness": "0/0", "author": "David K. Mcgowan \"Deuce Adam\""}, {"rating": 5.0, "review": "Day one, so far its delivering as I had hoped. I bought this Fire TV device to replace the streaming function of my Sony Blu-ray disc player model BDP-55100. I was getting a lot of interrupted streaming in the middle of a movie while using Amazon Prime Video service which I use often as a Prime member (six reboots while watching 'Fury'). I knew this wasn't normal as I had used my service on a newer Sony smart TV (in another room) with no WI-FI streaming issues whatsoever. Not looking to replace my older 'dumb' 55 inch Toshiba due to its excellent picture quality, I thought I would take a chance with the new Fire TV and I'm glad I made the purchase.Hook-up is uber easy and set-up w/Prime account is automatic if you already have one, otherwise the set-up program walks you thru Prime service sign-up if you are so inclined (not mandatory). Bottom line, this little device kicks butt, it just works fast and best of all... NO STREAMING INTERRUPTIONS! Just wish I had gotten a break on price, although I understand you might get a $40 discount (?) if you bundle with a new Prime subscription. That might be a pretty good deal if you can do it, and definitely worth checking into.All-in-all, this box is small, fast, and functional; I'll never need to use the Sony Blu-Ray to stream and won't miss the lousy connection; thanks Amazon Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "gnosisguy"}, {"rating": 5.0, "review": "Great product! I have been using it for a month now and I have nothing bad to say about it. I'm purchasing a second unit for my daughters room.", "verified": true, "helpfulness": "0/0", "author": "Robert Gonzalez"}, {"rating": 5.0, "review": "Best thing we bought all year! Totally worth the money!", "verified": true, "helpfulness": "0/0", "author": "Annie"}, {"rating": 2.0, "review": "I hooked up the Fire TV box yesterday and I'm not impressed.  I have had several Roku boxes for years and recently had the Purple Screen of Death issue with my Roku3, I could get a picture on any of my channels, but when you choose a video it won't play, just audio and a purple screen.  After 2 weeks of research and a long wait for Roku to respond with a fix (which didn't work) I got the Fire TV box.  Fire TV doesn't have nearly the content of Roku which I could live with.  My issue is with HBOGO, which we use a lot to watch their content on our own schedule, not HBO's broadcast schedule.  Fire TV supports HBOGO, unless you have Comcast.  Maybe I missed a disclaimer somewhere that stated this and I missed it, but that's kind of a deal breaker for me.  We'll take the Amazon box to the wekend condo instead of returning it, and I'll hit Best Buy today and get another Roku3 (hope this one will work OK).  I like Amazon and have been a customer since '95 when they pretty much sold only books.  I do notice recently their service has slipped a bit, I don't hang by the curb waiting for the UPS guy, but more and more of our shipments arrive late and that never used to happen, but Amazon is still the best regardless of this not-so-good review!", "verified": true, "helpfulness": "1/1", "author": "mdokr"}, {"rating": 1.0, "review": "The movies rent for more than locals andby the time you pay for all the available channels it is higher than cable.", "verified": true, "helpfulness": "1/2", "author": "Jack Sanders"}, {"rating": 2.0, "review": "I'm disappointed in the parental controls. My Amazon Prime account is set to block mature shows, but the Fire TV ignores those settings. The only parental control option available on the Fire TV is to require a code before every movie. That is a real inconvenience. My PS3 honors my Amazon parental control settings, one would think that the Fire TV , which is an Amazon product would be capable of doing the same.", "verified": true, "helpfulness": "0/0", "author": "David Dresen"}, {"rating": 1.0, "review": "Got it working day 1.  Day 2 it wouldn't turn on at all. Sought technical advice from Amazon. They couldn't solve the problem.  Sending me a new one. No confidence the new one will work.", "verified": true, "helpfulness": "1/2", "author": "Nancy Meyer-Lustman,Ph.D."}, {"rating": 5.0, "review": "Exactly what I wanted; YouTube integration through your phone is neat", "verified": true, "helpfulness": "0/0", "author": "Daniel Richardson"}, {"rating": 5.0, "review": "I love this unit, thinking about another. I highly recommend ..", "verified": true, "helpfulness": "0/0", "author": "Robert Foster"}]