[{"rating": 5.0, "review": "We have used the Chormecast already and it works very well with our TVs. You do have to learn to set it up", "verified": true, "helpfulness": "0/0", "author": "MARIA ELENA ESPARZA"}, {"rating": 4.0, "review": "Biggest disappointment would be that it does not allow mirroring from your smart devices. However low price makes up for its limitations.", "verified": true, "helpfulness": "1/1", "author": "Jay"}, {"rating": 2.0, "review": "At first I was impressed. I bought it on day one.  Then it started working sporadically if at all. Sometimes Chrome browser stuff will stream - sometimes not. Sometimes Netflix shows the Chromecast icon on the Nexus 7 and my phone - sometimes not. Sometimes it completely disappears from the network - sometimes it is there. When it goes bye-bye it is a pain to get it reconnected. And the apps that were on the way at launch (Pandora for one) - no where to be found. My advice and solution - if your laptop or desktop has HDMI out - but a nice long cable (25 footers are ten bucks here at Amazon) plug it in - mirror or extend your screen - then you can stream EVERYTHING - and it works ALL the time...", "verified": false, "helpfulness": "2/3", "author": "Ed Osworth \"The Joy Professor\""}, {"rating": 4.0, "review": "easy to set up and great picture quality, needs more apps to make it perfect but I am sure that is coming!", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 4.0, "review": "Works amazing if you have an android phone and like Netflix.  The setup is simple and it just works.  Seems to do a good job of caching.", "verified": true, "helpfulness": "0/0", "author": "Casey"}, {"rating": 5.0, "review": "I ordered one for me over in the UK works well with my laptops runni the chrome chromecast extension. I also managed to find the S4 android chromecast app online even through its on the UK google play store and it works like a dream. The latest version of the YouTube and Netflix apps work on my iPad as well so it's all!", "verified": true, "helpfulness": "0/0", "author": "Iles7"}, {"rating": 5.0, "review": "This take the power from my existing tv's USB port so no wire clutter. Can browse anything from Google Chrome or UTUBE. Doesn't work with Apple.. Nice picture quality!", "verified": true, "helpfulness": "0/0", "author": "Manu Mittal"}, {"rating": 4.0, "review": "Setup is not as straight forward as I would have liked.  But once it is working it does great on most Android devices, but not all.  I'm sure things things will be corrected soon!", "verified": true, "helpfulness": "0/0", "author": "Roy Phillip Oliver"}, {"rating": 4.0, "review": "Great for quick presos.  No cables from laptop to computer.  Needs SW sdk.  Performance can vary.  Recommend for those who want to stream from computers for little $.", "verified": true, "helpfulness": "0/0", "author": "Max Jones \"Tech Geek\""}, {"rating": 5.0, "review": "Good Device. Was easy to install & set up with WiFi connection / router. Great addition to home entertainment. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "John R."}]