[{"rating": 4.0, "review": "Great item, works pretty well.  Can't wait for more content!  Netflix works pretty well on it, and casting from Chrome, but we need more.", "verified": true, "helpfulness": "0/0", "author": "DanM"}, {"rating": 2.0, "review": "Do not purchase this unless you make sure it will work with your android or kindle. will not work with most and wont work with kindle at all.", "verified": true, "helpfulness": "0/0", "author": "mammie"}, {"rating": 5.0, "review": "I use this with my Samsung Galaxy SIII, and my HP Chromebook 14.  I can stream anything from my computer, and also from my phone.  My favorite thing to do with it is just go to my phone, bring up my YouTube or Play Music app, and then click the \"stream to Chromecast\" button, if the TV is on it automatically changes to the Chromecast source and starts the streaming, so I don't have to use the TV remote to change from my cable box to the Chromecast.  Because it's so cheap I'd recommend this to anyone using a Chromebook, Chrome browser, or Android device.  It doesn't have an OS or remote, like an Apple TV or Roku, but it's great to stream videos.  I would only caution someone who want this to replace their cable box, I don't think it's advanced enough to do that, but for streaming anything you want from your computer with Chrome, or Android device I would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "N. Saulter"}, {"rating": 5.0, "review": "It works! Easy setup, great tech support. Great Picture quality.well it alright they told me how many words to use", "verified": true, "helpfulness": "0/0", "author": "Eric Richardson"}, {"rating": 4.0, "review": "Been using this for the past month and when I take it from one wifi to another I have problems.  When I use it in network it works just fine.  Good product.  Would recommend to friends", "verified": true, "helpfulness": "0/0", "author": "jonvon"}, {"rating": 5.0, "review": "Please allow me to begin by stating that I would give this product 4 1/2 stars but that is impossible. The only reason being, it never seems to allow me to stream Amazon Instant Video from my Chrome browser tab (perhaps one day Amazon will be a chromecast partner? pleeeeaassseee?). That being said, I absolutely adore my Chromecast.I bought it right when it came out, and immediately had problems setting it up. The set up itself is really intuitive, just for some reason I was having trouble casting. I immediately called Google customer service, and they had me up and running within 15 minutes, it was AMAZING. The quality of the video and sound is terrific, and I love that I can cast from my phone, tablet, or computer. Previously, I had a HDMI cable hooked up to my tv to watch Netflix, and that really put a damper on my ability to multitask, but with Chromecast I can put a movie on in the background while pulling up dinner recipes to make without any interruption. If you have weak WIFI in your house/apartment, you may experience some difficulties casting, but I imagine that would be the same with Apple TV as well.If you already have Roku or Apple TV then you probably don't need this product, but if you're looking for a nice alternative to the HDMI cable set up for a great price, I highly recommend buying this product.", "verified": false, "helpfulness": "0/0", "author": "Madeline"}, {"rating": 5.0, "review": "The price dropped over the holidays, which led me to buy this product. I didn't want to pay for a monthly subscription to a show/video channel online. You can stream anything from your computer or YouTube from mobile devices (Android/Apple) with a downloaded app or widget. Sometimes the video and audio do not correspond if you don't have enough bandwidth to stream the content, but it's rare. Set up was very quick. So if you don't want a subscription service or don't have a smart TV, this is an amazing little gadget. There are some amazing reviews of this product on Amazon, but just thought I'd give me 2 cents!", "verified": true, "helpfulness": "0/0", "author": "Ellyn"}, {"rating": 4.0, "review": "The installation was not smooth and I have to reset 2 times to get it work. It works great once you installed it. You can control it by  using  any android device . It doesn't have lot of programs to carry right now . I mainly use it to watch things on Youtube.com.", "verified": true, "helpfulness": "0/0", "author": "donald-duck"}, {"rating": 5.0, "review": "So I got this sometime in mid-late November, 2013 and I was a bit disappointed. Since I have an iPhone/iPad and I have a pretty much ALL Mac setup this Google device wasn't playing nice. Yes it set up easily and is an impressive (especially for it's size) piece of tech, but basically it didn't stream any of the things I wanted it to. Vids from my Mac? Nope. Stuff on my Plex Media Center? Nope. It basically streamed Netflix and nothing more as far as I was concerned. Then a pre-Christmas update came that allowed me to stream from my Plex (keep in mind as I write this Plex only allows this function if you sign up for their subscription service \"Plex Pass\", not a deal breaker but a hassle nonetheless). The update has completely revamped the way I use this item and shows me that for ~ $30 this thing has some great features and an enormous upside. I can now stream all my videos, pics and music to whichever TV I want, and it's easy to unplug it from one TV and pop it into another. Plus since I can buy three of these for about the cost of one AppleTV I'm probably going to buy a few more for the other rooms in the house.And just and FYI I have had the Apple TV since it's change to the more compact streaming version and loved it but for the price and what you're getting the Chromecast beats it hands down. ​", "verified": true, "helpfulness": "0/0", "author": "M. Jewell"}, {"rating": 3.0, "review": "Unless you have a very strong internet connection, casting from the tab is less-than-efficient. YouTube and Netflix apps have gotten much better, though switching between videos doesn't always work. HBO is hit or miss. All in all, though, still worth $35.", "verified": true, "helpfulness": "1/1", "author": "Aymar C. Jean"}]