[{"rating": 5.0, "review": "Couldn't be easier to set up or use.  I use it for Netflix and Youtube and I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "If you have a standard HDTV without Smart features and are looking for a streaming device to access Netflix or HuluPlus type services, don't let the cheap price of this dongle sucker you in. There are many better choices out there that do a great job! For only a little more money, you'll get better access and performance with a media box or Blu-Ray player with these and MANY more built-in features and services. I have several boxes and ALL of them are better than this thing. At most it's just okay.", "verified": true, "helpfulness": "0/0", "author": "Jailer 58"}, {"rating": 5.0, "review": "After a little bit of Wifi confustion, the Chromecast works wonders for my not smart TV. I would even venture that I am not likely to buy a smart TV because the Chromecast works so well.", "verified": true, "helpfulness": "0/0", "author": "Alexander Layne"}, {"rating": 1.0, "review": "Chromecast was a waste of $35 for me.  After receipt of the item and subsequent call to google it finally was revealed that THE ROUTER MUST BE WITHIN 20 FEET OF TV!  My computer works fine next to my tv but chromecast is a fraud.", "verified": true, "helpfulness": "0/1", "author": "Jason H. Manchester"}, {"rating": 5.0, "review": "Loved it. Now I can watch my Netflix and Youtube movies on TV without wiring it. I really recommend Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Rafael Clemencio Santana"}, {"rating": 1.0, "review": "Worked fine at first and then after a couple months got a \"timeout\" error. I 'rebooted' it and set it up again and worked for a couple weeks. Now it doesn't work at all. It also destroyed the HDMI input on one TV. This product is junk. Better off buying APPLE or AMAZON products than this piece of crap.", "verified": true, "helpfulness": "0/0", "author": "blaken"}, {"rating": 2.0, "review": "the product is not as good as the advertise described, channels can be received are very very limited, can't meet our expectation.", "verified": true, "helpfulness": "1/1", "author": "cecei chen"}, {"rating": 4.0, "review": "We are Amazon Prime users and we use the streaming service as well as purchase consistently from Amazon. I just purchased a Chromecast and look forward to using it. However I am disappointed that after all this time Amazon refuses to support Android and Chromecast with an Amazon Prime app. I am not interested in a Kindle Fire.  Maybe a fireTV, but not if Amazon doesn't support the devices that I currently have.  In truth, I should be able to tan cast using a home PC or Surface Pro so it's not the end of the world, but definitely not ideal either.For potential cord cutters, the Chromecast device is a great way to explore options without shelling out tons of cash or making a specific connection to an ecosystem. If you have a collection of movies or tv shows already archived, just use Plex or Allcast.", "verified": true, "helpfulness": "1/1", "author": "CPFlorida"}, {"rating": 5.0, "review": "easy to use but dont like the power cable that hangs off of it, it is constantly pulling free. why not power from USB port?", "verified": true, "helpfulness": "0/0", "author": "GPBurdell"}, {"rating": 1.0, "review": "Waste of money.Had the prior Logitech Revenue for Google TV.  That was waste of money as well.The Chromecast is a design flaw.  Get a pink screen often unless I turn back settings.  I can't maintain a full screen view beyond a few seconds before reverting back.Chrome broswer with Chromecast tab regularly crashes.It's just a piece of junk.  I am sorry I purchased it.  The reality is everything to do w/TV that Google touches, fails.", "verified": false, "helpfulness": "0/0", "author": "Web \"Web....\""}]