[{"rating": 4.0, "review": "It works, but not with all apps.  Also, in Youtube does not show captions - hope they fix it soon.", "verified": true, "helpfulness": "0/0", "author": "Tuxedocat"}, {"rating": 2.0, "review": "I purchased Chromecast when my Roku still wasn't able to stream Youtube as well as for the ability to stream videos from my laptop (Ctrl O).Once I started useing CC I quickly realized that instead of using my phone or laptop as a remote it was just easier to watch YouTube on either of those devices.My second reason for buying was to stream movies from my laptop, but here the constant buffering makes it impossible to stream a movie and watch it in its entirety.I have never had any buffering issues even with my old Roku, while the streaming of YouTube is of similar quality the buffering and lack of a remote makes ChromeCast too much of a pain to use. Granted the Roku is three times the price but at least it works as advertised.", "verified": false, "helpfulness": "0/0", "author": "M. Jensen \"MJ\""}, {"rating": 1.0, "review": "Buffers too much....picture quality not the best and have to reboot from time to time. Sucks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works for what I wanted -  casting youtube features", "verified": true, "helpfulness": "0/0", "author": "R A"}, {"rating": 1.0, "review": "This stick works horribly. After trying multiple setups both by phone and computer, I cannot use anything except Youtube for streaming. It may be cheap, but the functionality isn't worth jack s***.", "verified": true, "helpfulness": "0/0", "author": "Christoffer Lundberg"}, {"rating": 1.0, "review": "I bought this almost a year ago and I LOVED it, but now I can't watch a 20 minute show without it freezing every 2 or 3 minutes!!!! I have tried all of the troubleshooting and nothing has helped. Wish it worked better!!!!", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "Superb", "verified": true, "helpfulness": "0/0", "author": "Deepesh Panicker"}, {"rating": 5.0, "review": "Second one I bought.  It is worth the money.", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 5.0, "review": "Great piece of technology. Really useful for Netflix and YouTube integration, plus you can send a tab to your TV and still work on your laptop. Love it.", "verified": true, "helpfulness": "0/0", "author": "Stephen Sheehan Jr."}, {"rating": 5.0, "review": "You don't need to buy a smart TV with Chromecast. Just plug it to free HDMI port. Love it.", "verified": true, "helpfulness": "0/0", "author": "Roberto Garcia"}]