[{"rating": 4.0, "review": "As I recall, I ordered this because my brother-in-law thought it looked pretty cool.  And I have fun playing off his techiness. LOL!  When it came, we plugged it in, and sure 'nuff, worked just like they said it would.  But my TV is already set up with a Chromebook.  And for no more TV than we watch, it's working fine with plenty of selection.  And I'd rather \"watch\" TV than play with it ~ LOL.  But now that I'm looking at it again....just may go home tonight and see if anything makes it different than what I have~~~", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Pam\""}, {"rating": 5.0, "review": "Quick and easy to set up! Very handy and addicting once you start using it :)", "verified": true, "helpfulness": "0/0", "author": "Emmy H."}, {"rating": 5.0, "review": "Wasn't sure this is what I wanted initially, but I like it now.  Item received as promised.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "petunia"}, {"rating": 5.0, "review": "Excellent product. I just love having my computer, my phone and tablet all hooked to this device!", "verified": true, "helpfulness": "0/0", "author": "fearless"}, {"rating": 5.0, "review": "Love this device, well worth the money, as it adds new life to older TV's without built in WIFI. Stream Youtube video and content from your tablet or phone without depending on your devise to continue to stream the content once you have sent the link to the Chromecast devise.", "verified": true, "helpfulness": "0/0", "author": "Tungar Gencel"}, {"rating": 4.0, "review": "enjoying it so much", "verified": true, "helpfulness": "0/0", "author": "I  hate  this   game."}, {"rating": 2.0, "review": "This isn't a product, it's a beta test.  Most of the features I care about (screen sharing, 1080p operation) are listed as \"beta\".  Really Google?  Why develop 90% of a good idea and then just leave it dangling on the edge of success?", "verified": true, "helpfulness": "0/0", "author": "deepseafarer"}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "love using the chrome cast to view pictures, videos, or movies on the TVs from the laptop & phone.", "verified": true, "helpfulness": "0/0", "author": "christopher s fuller"}, {"rating": 5.0, "review": "Great device. Have multiple in the house for months and never had any problems with the device. Sometimes the smartphone apps might crash but the device is fine.", "verified": true, "helpfulness": "0/0", "author": "Jason \"JB\""}]