[{"rating": 5.0, "review": "It's as simple as plug and play, literally.  Even if there's a little gap between your HDMI input and the USB power on your tv there's an extension.  I look forward to Google adding more features but I'm sure that'll chome.  In the meantime, Chrome can open so many files (of which I was previously unaware) that I've been streaming stuff to my TV all the time now!", "verified": true, "helpfulness": "0/0", "author": "Mark Twain \"Sam\""}, {"rating": 5.0, "review": "It is simply one of the best items I have ever purchased!  I believe everyone should have one.  Enough said!", "verified": true, "helpfulness": "0/0", "author": "WeHaveAFace"}, {"rating": 4.0, "review": "Easy setup between my iPad Air and Samsung TV. Not a lot of apps, but I expect that changes soon.", "verified": true, "helpfulness": "0/0", "author": "bosCage \"-b\""}, {"rating": 1.0, "review": "Smartphones not smart enough for the chromecast app (i.e. droid os not new enough). Ditto for my Ipod touch. I also run XP on the computers, too old. I'm too old for this crap.", "verified": true, "helpfulness": "0/0", "author": "Ann Custer"}, {"rating": 3.0, "review": "Not very impressed with this.. It stops work/freeze on my many times.  It is cheap product, can not expect to much from it", "verified": true, "helpfulness": "0/0", "author": "Xin Jin"}, {"rating": 5.0, "review": "Works great with my laptop, tablet and phone.  It's the best thing since sliced bread.  I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "stephen seibel"}, {"rating": 4.0, "review": "I like it and doesn't all of the things it says but the initial set-up can be confusing so be sure to read and do the step-by-step otherwise it will take you longer than it has to.", "verified": true, "helpfulness": "0/0", "author": "Gabe Castillo \"Gabe\""}, {"rating": 5.0, "review": "Great product, took me a while to set up since I am not a wiz, but wish it could be used in earlier versions of mac instead of 10.6.", "verified": true, "helpfulness": "0/0", "author": "Keith Young"}, {"rating": 3.0, "review": "I purchased a Chromecast HDMI Streaming Media Player as I don;t have cable TV, but I do have WiFi internet.I wanted to be able to watch Netflix on my basement tv ( which was only picking up the basic TV stations, ABC, CBS, PBS, etc.I hate watching adverts and prefer to choose my own uninterrupted programs.Setting up the device is a little tricky!Step 1.  Plug it in to the HDMI slot on the TV.  No problem there. I had a slot and I used the supplied short extension HDMI (about 4\") to connect it. Look carefully at the advert - in the small print off to one side they mention that you need a power cord. They actually supply a plug-in power pack that you need to plug into the Chromecast device.  Not a problem really, but make sure that you have a spare outlet.Step 2.  Switch on the TV and go though the modes until you find the HDMI channel you plugged the device into.  It displays nice pictures to look at when you find it.  Again, easy enough.Step 3.  This is where it gets interesting.  Make sure that you have a computer, phone, etc that is listed in the small print in the advert:Supported Operating SystemsAndroid 2.3 and higheriOS 6 and higherWindows 7 and higherMac OS 10.7 and higherChrome OS (Chromebook Pixel, additional Chromebooks coming soon).Be aware that if you don't have WiFi, Windows 7 on  your computer, or the correct Operating System on your phone, it won't set up!I went to the google.com/chromecast/setup on my WiFi computer with Windows 7 and was able to get through the first step, getting it to find and activate the device plugged into the TV.  I think that this is where a lot of people think that they have completed the setup and think that the device is not working.What I didn't notice initially was that a second window opens up after a short while to allow you to download the program that sets up the computer to put the little Chromecast App onto your computer or other device. It was hiding BEHIND the Chromecast setup window!  Once you find this and enable it you can use the device successfully - -for the listed places, like Netflix, etc.  Again very carefully read the list of what the device can do.What it DID NOT DO!I tried adding it to my Motorola Admiral cell phone, which has the Android OS 2.3, but it didn't want to let me Accept the App - just washed out the screen and froze up.  After a lot of playing with it I found a message that said that the device is not currently able to work on my version of the Android 2.3 Operating System!  So, I'm not able to use my phone to control the device. If you have a lower end phone like me then you may have an issue.Having said all that.IT DOES WORK WELL at putting Netflix, etc on my TV.  I can use the computer to do other things whilst the program plays, but I have to go back to the computer to control the program, stop, pause, etc. I'm happy that it does what I purchased it for. Picture quality and sound were excellent on my very high speed internet connection.You can name the device and then you could actually put one on different WiFi TVs and send different programs to each TV of necessary.If you have Cable or Sat TV it would not be much use to you, unless you want to view stuff from your computer or cell phone, but it does have a use if you do a lot of Internet viewing.Go the the Google Chromecast webpages and you'll find the answers to most of the problems you may have setting it up, and also what it will and will not work with at the current time.", "verified": true, "helpfulness": "0/0", "author": "Kevin C. RUTLAND \"LowFlyer\""}, {"rating": 5.0, "review": "I love this device, it makes things so easy!  Even though I can have Netflix on a tv, Xbox, or blu-ray player, you still have to use clunky remotes or controllers with it.  But the Chromecast makes it so you can just use the keyboard you're already used to on your device!The video quality is also incredible.  We don't have the fastest home wi-fi (only 15 mbps download speeds) but it still streams extremely well and we never have problems.", "verified": true, "helpfulness": "0/0", "author": "Jon"}]