[{"rating": 5.0, "review": "Fellas, you really nailed it on this one! This is a great product, hands down. Network usage is minimal and excellent, with content I'm only now beginning to explore. Being able to dial up something on our Kindle Fire and then simultaneously bring it up on the TV is one step closer to all device simul-play that I'm hoping for. This will bring back the Drive-In movie with a little development.It was pretty cool having the MayDay guy come thru the kindle  to walk us thru the simultaneous setup.One of the best products I've laid hands on, period. And I've got some pretty cool toys.", "verified": true, "helpfulness": "0/0", "author": "Gwaltney"}, {"rating": 5.0, "review": "I'm deaf  , love it fire tv. Games. And movies.  I'm Happy", "verified": true, "helpfulness": "0/0", "author": "Richard Smith"}, {"rating": 3.0, "review": "Not enough content is offered with the Prime Membership to be a true value.  Didn't have NHL and MLB connections.....the contect prices have to come WAY down to be a value.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was a gift for my dad he loves it", "verified": true, "helpfulness": "0/0", "author": "armando carbajal"}, {"rating": 5.0, "review": "Hands down the best media player I've ever owned! It was impressive enough to replace my HTPC, only drawback so far is no 3D support.", "verified": true, "helpfulness": "1/1", "author": "Wornick"}, {"rating": 5.0, "review": "So sleek and works like a dream.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Barbara \"Purplependulum\""}, {"rating": 3.0, "review": "At first I wasn't sure about Fire tv ,but after the thirty day free trial I  decided to keep it .The system works well as does the voice search. The biggest problem is the choice of movies  most seem to have a three star rating or less  after one year I decided to cancel my prime service the  cost of prime is not worth t features they offer  . Amazon should have a prime tier system most of the benefits of prime are useless to me ,if i could get their programs and two day shipping for $50 dollars per year I would sign back up don't need al of the other add ons", "verified": true, "helpfulness": "0/0", "author": "MisterE \"Emmyism\""}, {"rating": 1.0, "review": "no support for older TV with HDMI input.  No response from Amazon regarding the problem.", "verified": true, "helpfulness": "6/10", "author": "Matt"}, {"rating": 5.0, "review": "waiting on HBO Go to make it perfect. faster & sharper picture than my old roku xds.", "verified": true, "helpfulness": "0/0", "author": "michael buendia"}, {"rating": 5.0, "review": "The Amazon Fire TV is great! It has helped me get rid of my cable bill completely. The extra $86 a month in my pocket is very nice!", "verified": true, "helpfulness": "1/1", "author": "Jessi Lawin"}]