[{"rating": 5.0, "review": "Plug and play. Amazing how many things it directs you to, and I enjoy the voice prompt. Say PORN and boom every porn movie ever made. Takes you to crackle, Hula, netflixs, youtube,google, and prime. Skip Hula Plus it blows.", "verified": true, "helpfulness": "1/1", "author": "nate"}, {"rating": 5.0, "review": "Simple. Easy to navigate.  Many choices. Could easily replace cable.", "verified": true, "helpfulness": "0/0", "author": "docmom"}, {"rating": 5.0, "review": "Love it!!! Top of my daughters Christmas gifts this year. We love the Prime movies, Netflix, the games. Sound quality is fantastic. Voice search works perfectly. Super easy set up. Just plug in and log into Prime. Would definitely recommend.", "verified": true, "helpfulness": "1/1", "author": "KFS \"KFS\""}, {"rating": 5.0, "review": "So far so good as long as the Prime programs keeps me happy!", "verified": true, "helpfulness": "0/0", "author": "D. Dowds \"RF Man\""}, {"rating": 5.0, "review": "We enjoy the Fire TV a great deal.  It is everything promised.  It is far superior to our two wifi-enabledDVD players.  Faster and fewer connection problems.", "verified": true, "helpfulness": "0/0", "author": "rdeank"}, {"rating": 5.0, "review": "Great product! I use it every day!Pros:-Great for Netflix, Hulu, and Amazon Prime Videos-High Quality-Stylish DesignNeutrals:-Video gaming isn't used much-Interface would be confusing for people who aren't technologically advanced-No HBO Go (But supposed to be coming in the future)Cons:-Cannot be shut off", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.  Only disappointed in not being able to get Showtime with Directv.", "verified": true, "helpfulness": "0/0", "author": "Robert M Witner"}, {"rating": 5.0, "review": "Great gift for the whole family I also bought the game controller 😊", "verified": true, "helpfulness": "0/0", "author": "Tucson 36 \"Tucson36\""}, {"rating": 5.0, "review": "great selection, easy to install, amazing picture quality!", "verified": true, "helpfulness": "0/0", "author": "Governors Dad"}, {"rating": 4.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "James Hill"}]