[{"rating": 5.0, "review": "It's incredible, excelent", "verified": true, "helpfulness": "0/0", "author": "Nestor Freytes"}, {"rating": 5.0, "review": "Use it everyday. Awesome and rad.", "verified": true, "helpfulness": "0/0", "author": "Thomas Anthony Barter"}, {"rating": 5.0, "review": "We love this for watching Netflix or showing videos off our phone to the whole group on TV. Great buy!", "verified": true, "helpfulness": "0/0", "author": "teachermom"}, {"rating": 1.0, "review": "It was the worst thing I have ever owned I had it for les then 24 hours and shiped it back it kept freezing and disconnecting no good.", "verified": false, "helpfulness": "1/1", "author": "Kyle Ross"}, {"rating": 3.0, "review": "Disappointed so far. I had high hopes for the Chrome Tab casting feature (yeah it's Beta) since I watch motorsports streamed from sites not supported directly. Performance is dismal for me and I have broadband and a nice Asus router. It's probably OK if the source stream is really, really high quality but hey, most of them aren't. It was a bit balky to setup (false error message when connecting to the home network) but it works great for Netflix and YouTube. So does the Roku of course, probably better. The best thing about the CC is that you can control it with most any wifi device.", "verified": true, "helpfulness": "0/0", "author": "J. Hartley \"JRH\""}, {"rating": 2.0, "review": "I got this for the watch ESPN. The service is intermittent at best. It's not my internet connection, all other streaming apps work fine. Did some internet research and found this is a consistent issue for chromecast.", "verified": true, "helpfulness": "1/1", "author": "Bowhead \"Bailey\""}, {"rating": 5.0, "review": "Excelente dispositivo y excelente la velocidad de entrega del mismo, es por ello que e vuelto a comprar otro.", "verified": true, "helpfulness": "0/0", "author": "Euclides Sanchez"}, {"rating": 3.0, "review": "The chromecast is a very limited streaming device good enough for youtube, netflix and a couple of other apps, but that's it. For your own media better go for another device or an httpc. Apps on this are very few, although is getting some support is not much. Second, you require a mobile device in your hands to sling streams to the chromecast. Another thing is that google strangleholds advance by not allowing for more outside development of software, example some guy made an app to allow other apps to stream media and google quickly made an update to stop that. Last if you got no internet and want to run plex from own server you're out of luck no internet no work.", "verified": true, "helpfulness": "0/0", "author": "Ulises I Martinez"}, {"rating": 4.0, "review": "Good device.", "verified": true, "helpfulness": "0/0", "author": "Albert Algerio"}, {"rating": 5.0, "review": "GreT", "verified": true, "helpfulness": "0/0", "author": "Pagliaro Russo Nicolas \"Nico Pagliaro\""}]