[{"rating": 5.0, "review": "awesome product will purchase again", "verified": true, "helpfulness": "0/0", "author": "murphy"}, {"rating": 5.0, "review": "BEST PURCHASE EVER! Chromecast is amazing. Thank god I never got a smart tv and just a simple LED because this device completely turns your tv into a smart one without having to navigate it with remotes. You can send content from any smart device to your tv with a simple flick.", "verified": true, "helpfulness": "0/0", "author": "Himanshu Gupta"}, {"rating": 3.0, "review": "Does not work well with Comcast Arris routers, spent nearly 5 hours configuring this device and it only works within 5 feet of the router and stream quality is poor keeps buffering, however when any other device accesses internet it works fine. I have spent many hours trying to manually configure the router to allow Chromecast uPNP, and it still works poorly. I need to purchase my own router rather than use Comcast rented router, but even still I am not holding my breath here, I was not impressed with this.... Not worth the time/effort, and money to get this to work on Comcast supplied devices...", "verified": false, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 1.0, "review": "be aware this item is not the real Google cromecast it is a clone item with different name.", "verified": true, "helpfulness": "0/3", "author": "wilson r marin"}, {"rating": 2.0, "review": "I travel alot for work and purchased this to use in my hotel room.  Come to findout most hotel have their networks set where you can not share files.  Which with my limited understanding is what you are doing when streaming from laptop or ipad to the chromecast.  One of the fixes is to buy a travel router and hope that the hotel still has an active ethernet connect in the room without the AP security set.", "verified": true, "helpfulness": "0/0", "author": "Eddie Duke"}, {"rating": 5.0, "review": "Very good product.", "verified": true, "helpfulness": "0/0", "author": "Jberboa"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "greygoo"}, {"rating": 5.0, "review": "This review was very helpful.When the chromecast arrived, it was incredibly easy to set up. I was able to plug it in and immediately start the set up process. Rather than plugging it directly into a TV, mine is plugged into a receiver. When I bought the device, Netflix was still offering a three-month free trial. As a Netflix subscriber, this brought my cost down to just $11. At $11, this device is a no-brainer. At $35, it is a tougher one. I will try to compare the Apple TV and the Chromecast since those are the two I have.Set-UpThe set-up process was incredibly simple. I plugged the device in and instructions popped up on the screen directing me. I pulled up the website it told me to on my computer and I downloaded an app. The app then helped me connect the chromecast to my wifi network. After getting it connected, I then had to download an extension for my chrome browser. All in all, it took under five minutes from getting the package from the UPS man to watching videos on the device.First impressionsWith the chrome browser, you are able to place a browser tab on the screen. I personally noticed that text was not as clear on the screen as it was on my computer screen. I have a 42 inch tv, and I cannot speak to whether or not that is due to buffering issues or something simpler. I then went to YouTube. On YouTube videos there is now a button in the bottom right hand corner that allows you to play the video directly on the TV screen. My understanding is that this ends up being a more effective method than Apple's mirroring for the Apple TV. While you can only use certain Apple laptops for mirroring, the ones that can are uploading the information and the Apple TV is then downloading it which slows the process down a bit. The Chromecast does not have the ability to mirror entire parts of the screen or anything like that, but streaming videos did seem very fast on the Chromecast. I also played a YouTube video from my phone. Similarly, a new box is in the corner that allows you to send the video to the Chromecast.Other notesI have no idea what the future for the Chromecast looks like. I do believe, though, that Google typically opens their software up to more development than Apple does. Unless you have a specific laptop that can mirror to the Apple TV, the two products are very similar. On Apple TV you can watch and listen to local media which is nice. The difference between $35 (or $11 for me) and $99 is pretty drastic and I don't personally think the added functionality of the Apple TV is probably worth that. If you already have an Apple TV, you probably don't need a Chromecast. If you don't have either, I'd snag a Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Jesus Daniel"}, {"rating": 5.0, "review": "I stopped using my apple tv after buying this, i just love being able to send streams from any device, specially the tv queue function on youtube for the times when my friends come to the house, and everyone just queue what they want to play.", "verified": true, "helpfulness": "0/0", "author": "Douglas Yau Quan"}, {"rating": 5.0, "review": "Easy setup and small work around saw on youtube......and WALLAH...able to cast Amazon Prime video to tele....awesome", "verified": true, "helpfulness": "0/0", "author": "Tony Porras"}]