[{"rating": 2.0, "review": "it would be much better if it has google play app.It would much better if it has facebook app.", "verified": true, "helpfulness": "0/2", "author": "Marwan Daboul"}, {"rating": 5.0, "review": "So far so good. Very easy to hook up. very convienant to use.", "verified": true, "helpfulness": "0/0", "author": "Lisa Bousquet"}, {"rating": 5.0, "review": "Great selection, I love it so far.", "verified": true, "helpfulness": "0/0", "author": "D. Crow"}, {"rating": 5.0, "review": "A joy to use.", "verified": true, "helpfulness": "0/0", "author": "Lally"}, {"rating": 5.0, "review": "t y", "verified": true, "helpfulness": "0/0", "author": "Larrycdixon"}, {"rating": 5.0, "review": "Fastest media box made so far. I have had it 5 months and no problems, side loaded XBMC in 15  minutes. Very easy setup nice User interface. This media box blows Roku 3  & Apple  Tv Away. I am replacing those brands with this media box.", "verified": true, "helpfulness": "0/0", "author": "TheLuz"}, {"rating": 5.0, "review": "I admit, I am electronically challenged but even I had no problem hooking this to my TV. Very simple and very easy to use. I use it to watch TV shows and movies via Netflix and love the voice command. I love the small size, that its fast and so far, I've encountered no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Christy Tillery French \"author\""}, {"rating": 5.0, "review": "Enjoying Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "J. Simpson"}, {"rating": 3.0, "review": "Super fast for Amazon content.  But, my Netflix seems to lag, even more with this than when I used my older Roku device (which was the 720p model).  Wonder if that is intentional by Amazon?  If you watch mostly Amazon content, then you should definitely get this.  If you watch mostly Netflix or other sources, I would recommend you look for something better such as newest Roku device or Apple TV.", "verified": true, "helpfulness": "3/3", "author": "Brian L."}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Jimmy Merchant"}]