[{"rating": 5.0, "review": "It is easy to set up and a good value. I use it Netflix and have never had a problem.", "verified": true, "helpfulness": "0/0", "author": "gerry"}, {"rating": 1.0, "review": "Because of the reviews I bought the Chromecast. I live in Australia and I was hoping to stream from my NAS. At least I was expecting to be able to use it to get US channels. I have an Apple TV, if you think that Apple is restrictive, well... Google is far worse.The Chromecast updates without asking. You just connected it on your wifi, sorry too late to root it.The DNS are hardcoded, you can forget US-block and Netflix / Hulu if you are not living in the US.At least, I could stream from my NAS? Nope, they removed the functionality.Also you are forced to install Chrome to use it. Chrome set itself as default browser without asking. Knowing the appalling Google's policy about privacy, I am not very pleased.Overall, I am very disappointed by Google, and I'll think twice before buying another of their products.", "verified": false, "helpfulness": "1/3", "author": "Poseidus"}, {"rating": 1.0, "review": "I'm writing this review to help someone avoid buying Chromecast for the wrong purpose.  I was hoping to use it to stream from my Samsung Galaxy Note II phone to a larger screen (TV) using my phone's data plan (which is unlimited).  Based upon everything I read here and everyone I asked (technical support), I was led to believe that the wifi needed to connect Chromecast to other devices was required strictly to network (i.e., not as THE streaming source but as a LAN).  This is not the case.  So, long story short, if you have capped internet/broadband (satellite internet, mobile hot spots, etc.) and have dreams of using your smartphone's mobile data plan with Chromecast, those dreams are unattainable with this product.If you have unlimited high-speed internet, own an older TV (that is not a \"Smart TV\" with built-in Wi-Fi) and would like to stream content via a computer or smartphone (or select tablets), Chromecast is great way to go.", "verified": true, "helpfulness": "0/1", "author": "Dr. G"}, {"rating": 5.0, "review": "I just got the chromcast device and enjoying it.  Very easy set up.  Linked up with my Nexus 10.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "M Marquez"}, {"rating": 2.0, "review": "Kept freezing and tripping-up when loading Netflix. Just sat there and watched the circle spin around and around waiting for something to happen.Nice idea, hopefully there will be another generation that actually works.", "verified": true, "helpfulness": "1/2", "author": "Christopher J. Cornecelli"}, {"rating": 5.0, "review": "Worked great and easyMovies look as if you were doing them on the TV receiver. Would purchase again if needed", "verified": true, "helpfulness": "0/0", "author": "William I. Roth \"billfisher\""}, {"rating": 4.0, "review": "Im still working on finding a way to chromecast everything., When i try to stream from a different source than normal, i have problems. Other wise, it's a great little dongle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"nada\""}, {"rating": 4.0, "review": "Great buy, had it streaming to my TV in just a few minutes.  You're getting a lot of cool features for small price tag.  The potential for future app's is great, looking forward to see whats next.", "verified": true, "helpfulness": "0/0", "author": "McGoo"}, {"rating": 1.0, "review": "The setup screen came up right away but then would not connect to the router and the google chromecast website advised me to contact netgear. I had no idea this would be so difficult to set up. It's going back! What a waste. I'm not a computer geek who sits around reconfiguring my router. But I am quite savvy and resourceful. This was beyond the amount of time and energy I'm prepared to spend on it for the very little that this product will do.", "verified": false, "helpfulness": "2/5", "author": "just_do_it_28 \"just_do_it_28\""}, {"rating": 3.0, "review": "For now it seems like the google chromecast is very limited to what you can do with it. I hope there will be more apps you can use with it. I was hoping that I could use anything that was on my phone with the chromecast, but that is not the case, unless I just don't know how to use this thing.", "verified": true, "helpfulness": "0/0", "author": "Milton Rodriguez"}]