[{"rating": 2.0, "review": "I'm not sure if I'm alone here but this device doesn't work for me unless my router is 10' away or less....", "verified": true, "helpfulness": "0/0", "author": "Scott Hubble"}, {"rating": 5.0, "review": "I have a Sony Media Player that has not been playing Netflix for a couple of months now but this works flawlessly. So far so good. Easy to set up but the manual is tiny but is really not needed anyway. I was about to cancel Netflix but not now. Thanks Google for making this great little device too bad it was not made in the USA.", "verified": true, "helpfulness": "0/0", "author": "Scott Martin"}, {"rating": 5.0, "review": "It is extremely simple to use and provides great quality. I also like a lot how small it is. Yep", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Labbe"}, {"rating": 4.0, "review": "I had a little trouble getting the chromecast to connect initially, but it was more an issue with my router than the chromecast itself I think. I just had to turn off UPNP (on the router - a netgear N150 W1000 v3) and then turn it back on and it worked.Once I got it connected, the chromecast worked great. Flawless streaming even with my router on the other end of the house. I highly recommend the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Vanessa A Twarkins"}, {"rating": 4.0, "review": "Setup was extremely easy and was done in about a minute.Streaming to the TV from my Mac has been hit or miss.  The first time I used it to watch Netflix I didn't have a single problem.  Then I used it to watch Hulu and had issues with lag and stoppage on the TV while it was running just fine on my Mac.", "verified": true, "helpfulness": "0/0", "author": "TxEste"}, {"rating": 5.0, "review": "Great if you want to stream google services to your simple TV, mine has got Mirrorcast built in, so this is just for experimenting or visiting friends and family. But sound lagged when I played local video in Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Martin Franz \"meuro3\""}, {"rating": 5.0, "review": "My son in law requested this device as a Christmas gift and he says that he loves the way it works.", "verified": true, "helpfulness": "0/0", "author": "Maribelle"}, {"rating": 5.0, "review": "This works as intended.  The only drawback is it won't work with my Kindle or my phone (software too old).  I had to buy an inexpensive tablet to run it.  I am cutting back on satellite so will pay for itself in no time. I wish Kindle and Google would get along especially since I bought it from Amazon.  Would recommend it if you don't have a smart TV or other option.  I use it in a spare room for Netflix and Pandora.  I haven't tried it for anything else.", "verified": true, "helpfulness": "0/0", "author": "S. Bates"}, {"rating": 5.0, "review": "This was a gift for my husband.  My husband and son both have a blast playing things from there phones on the big screen. It is a smash at our house.", "verified": true, "helpfulness": "0/0", "author": "Rena"}, {"rating": 5.0, "review": "This is probably the best $35 I've spent on a media device. If you're like me and opt-out when it comes to smart-tv's, then this thing is a must have! Really impressed and can't wait as more and more apps and features are added every few months.", "verified": true, "helpfulness": "0/0", "author": "RenegadeJr"}]