[{"rating": 4.0, "review": "I feel this is a great product for the price. While it differs from the AppleTV (lacks a remote, and has no GUI with all of the accounts in one place, music channels(?)), I find it still succeeds in serving its purpose. I generally know which app or two I am going to use when I approach my TV, so I pull those up on the phone and fire up the Chromecast with ease.The one downside is that it may have a few apps that are not compatible yet. Several app updates came out just before I purchased mine to allow it to work with it, and I'm sure in no time that more apps will accommodate it. And for the record, I did have complications on initial install (forced to do a firmware update that never seemed to connect to it a server), however after reading a few forums, found the solution. I do not count this as a negative for the product due to the fact that I've heard of several other products with the same problem of getting connectivity on a home network (smart light bulbs, blu-ray players, etc).", "verified": true, "helpfulness": "0/0", "author": "coasty82"}, {"rating": 1.0, "review": "worked one time. I stored it away and didn't use it for a while. and after few days when I wanted to use it again. The product didn't work. There is no easy way to tell if this product is defective or not. Spent several hours trying to get it to work.", "verified": true, "helpfulness": "0/0", "author": "Ramesh K"}, {"rating": 5.0, "review": "What a great little gadget that works WITH your phone.  I originally bought the Apple TV for $100.00.  I took it with me on vacation and forgot the remote and thought I could download an app and use that.  Not so!  I even called Tech Support who confirmed no such app worked at that time.  So I was out of luck.  With this steaming player, I use my PHONE so no remote is necessary and I just connect to the wifi with my phone and presto- it works!!  Can't wait to travel and see if I can get it to work at the hotel.  Still all and all it works much better then the Apple TV and with the third of the price, this baby is a no brainer!!!", "verified": false, "helpfulness": "0/0", "author": "D. L. Pease"}, {"rating": 5.0, "review": "like being able to \"cast\" and watch on the TV from your laptop or phone.", "verified": true, "helpfulness": "0/0", "author": "newtdawg \"Carl Newton\""}, {"rating": 1.0, "review": "Horrible to set up, only works 20-30 feet from router(per Google customer service). Bought a Roku Stick, easy setup, works great, worth the $15 more and get a remote so you don't have to mirror from a smart device.", "verified": false, "helpfulness": "1/1", "author": "Derek"}, {"rating": 4.0, "review": "It works well with the iPad and MacBook Air. I wish there were more functions and apps available but maybe Google will roll out with more things for Chromecast. I also wish it was easier to switch TVs or taking it on the go (i.e. making profiles for each TV connected before or something of the sort). I love that it has Netflix on it when I use this on a \"dumb\" TV. I didn't want to spend a bunch of money on AppleTV and I don't think I will switch to it anytime soon.", "verified": true, "helpfulness": "0/0", "author": "Flora K."}, {"rating": 5.0, "review": "Work great so far have no issue. I would recommend to buy this.", "verified": true, "helpfulness": "0/0", "author": "Rosemead, Ca."}, {"rating": 3.0, "review": "Kind of a pain having to use my phone to control it.  would prefer a normal remote.  Also would like more content...", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've been wanting one of these little guys for a long time. I've had it for about 2 months. No problems to report as of yet. Puts out a great picture in 1080p. I couldn't justify paying for an Apple TV or Roku when I have this option to watch and cast from my iPhone or iPad. Shop wisely, the Chomecast is a great deal!", "verified": true, "helpfulness": "1/1", "author": "Antonio Carabajal"}, {"rating": 5.0, "review": "Easy to use and works great", "verified": true, "helpfulness": "0/0", "author": "Maltipoofan"}]