[{"rating": 5.0, "review": "Instead of buying a DVD player, buy this for 35 dollars and sync it with your existing laptop. You can watch a DVD, a slildeshow from the pictures on your laptop, any web page. Very simple to use. Set's it self up. All you need is a wireless system in your house.", "verified": true, "helpfulness": "0/0", "author": "Mark La Joie"}, {"rating": 4.0, "review": "It's fun to play with.  I would recommend purchasing this item.  Great price and easy to use.  You should try it.", "verified": true, "helpfulness": "0/0", "author": "Barbara Christopher-Thompson"}, {"rating": 3.0, "review": "Still trying to get it to work with Microsoft Surface and other devices. Connects fine to the TV and \"Getting Started\" but have yet to finish the process andview anything. Certainly not plug and play. Make sure to have Microsoft .NET 3.5 active on Windows devices if you can avoid error codes.", "verified": true, "helpfulness": "0/0", "author": "Michael Farley"}, {"rating": 2.0, "review": "Although I have an HDMI interface on my TV, the signal from the Chromecast is weak.  I have to sit within 6 ft. of my TV for it to work.  The display resolution is low and the video is interrupted frequently.  Perhaps I need a different TV but that was not specified in the ads.  I do not use the Chromecast and am looking for a high quality solution for viewing internet content on my existing TV.", "verified": true, "helpfulness": "0/0", "author": "shirley daniels collier"}, {"rating": 5.0, "review": "Does everything I need it to! Sometimes theres a lag, but never when you use your phone to connect to it.", "verified": true, "helpfulness": "0/0", "author": "Carla Golden"}, {"rating": 4.0, "review": "This was really easy to hook into my tv, and super easy to coordinate with my ipad (even though I am not a computer person).  Love watching the crystal clear picture on my HD tv, but I can't get it to work with my surround sound - either through the traditional manner or via wifi.  Sort of disappointing, but nice to watch things on the 55\".", "verified": true, "helpfulness": "0/0", "author": "N. Davenport"}, {"rating": 5.0, "review": "love it for streaming netflix, youtube, etc. and watching it on TV and not hard to use for those of us who aren't so \"techie!\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is perfect to get netflicks to work on our bedroom TV and without having to have another internet connection in the same room not sure how it works but it does and we can now watch netflicks in any room we want to.", "verified": true, "helpfulness": "0/0", "author": "faithchris"}, {"rating": 2.0, "review": "There is a significant number of steps to set up this product and the instructions do not always answer all questions.  The unit is slow by current standards.  The unit plugs into an HDMI port on the TV but requires an additional USB connection to power the unit.  Once everything is set up, the use is as advertised - but be sure to read all of the Chromecast website to see what you will be getting.", "verified": true, "helpfulness": "0/0", "author": "Louis H Otos"}, {"rating": 5.0, "review": "I am very pleased with the Chromecast. It works very well. though, I do hope that the availability of apps will increase in the near future. Overall I am content with my purchase and would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Vincent"}]