[{"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Francisco Aguero Mora"}, {"rating": 4.0, "review": "Very enjoyable little device. Works like it suppose to and does exactly what was advertised.", "verified": true, "helpfulness": "0/0", "author": "micheal harris"}, {"rating": 3.0, "review": "Doesn't work with amazon prime. about a three second delay from device to TV. Fuzzier quality.", "verified": true, "helpfulness": "0/0", "author": "C Shaw"}, {"rating": 5.0, "review": "Excellent with the computer streaming to the TV. and its not only for Movies you can see your desktop also on it.", "verified": true, "helpfulness": "0/0", "author": "Fernando Garcia"}, {"rating": 5.0, "review": "Love this product with all my heart!  It keeps getting better everyday now that Google has invested more time and effort into the support of Chromecast.  In my opinion, the easy access to Netflix, YouTube and HBO GO straight to my television for less than $40 just make this product a no brainer.  I used to have consistent connection issues with the Chromecast in December '13, however software upgrades and upgrades to the streaming apps themselves have made all issues a thing of the past.  Even got my 75 yr old dad actively using and streaming on his television in Florida.  Product is easy to use, set-up and understand.", "verified": true, "helpfulness": "0/0", "author": "Ben from NJ"}, {"rating": 5.0, "review": "Love this thing!", "verified": false, "helpfulness": "0/0", "author": "SMRC"}, {"rating": 5.0, "review": "This is the best thing ever! I can stream from my laptop (and I can still surf the net), phone and tablet. So easy to set-up. And I can move it from room to room. You can easily stream YouTube, Pandora, Netflix, Hulu and whatever networks that stream live on the internet. We got rid of our cable service because of the cost. But with the Chromecast, we don't miss any of the programs we like to watch. My personal opinion is that the Chromecast at $35.00 is the best deal out there. if your looking for a streaminig device, this is it.", "verified": true, "helpfulness": "0/0", "author": "Lori V."}, {"rating": 2.0, "review": "It's not the best product.  It doesn't always connect even with the WIFI working properly.  It takes a while a lot of the time to find the device and connect  to it, and sometimes it drops the signal as well.", "verified": true, "helpfulness": "0/0", "author": "Yamil Rojas"}, {"rating": 2.0, "review": "not easy to set up  Sitting in my draw for my set in the bedroom.  I like Amazon TV better", "verified": true, "helpfulness": "0/0", "author": "Charmeg89"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "lamtl354"}]