[{"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 4.0, "review": "Great... for Up-to-date DevicesGoogle Chromecast is a device that lets you stream your phones, laptops, and other devices to the screen. The streaming is smooth. In the home setting, it's practical when you want to save some batteries on your laptop because an HDMI cord from your computer will just count the TV as a second computer screen. Or when you have a party and want to keep your computer in another room or have people take turns sharing Youtube videos on the TV. In honesty, the uses of this are pretty minimal when there's no reason to stream and a cord will suffice.I initially bought this for my parents who still have a computer from when dinosaurs roamed. They weren't able to use it because the Chromecast application wasn't compatible with their old computer. So I took it home with me.I use a MacBook, my girlfriend uses a PC (in Chromecast's defense, it works much better for her). There are a couple of things that aren't compatible with Chromecast for Macs. Streaming Hulu, isn't like how you stream Netflix. You are Chromecasting your whole browser (so, like just having a cord) and it's a little laggy. Then again, Hulu is an extremely glitchy website and I wouldn't be surprised if the issue was on their side.The thing that Chromecast works best for is Youtube and Netflix. From either my phone or my computer, it's nice to not feel attached to the TV screen by a cord and the streaming is just as smooth (No strings on me - Ultron).Overall, I would give the product a 4. 5 stars for how well it works, but -1 star for the fact that it's really just an addition to your house (for $30) and really isn't needed if you have all the cords. It's not compatible with older computers, so buyer beware.Summary:If you got the cash, go for it, but it's not super necessary. It's a $30 device to live the life of Pinocchio.", "verified": true, "helpfulness": "0/0", "author": "Steven Pham"}, {"rating": 2.0, "review": "I love my Chromecast, but at $39.68 this listing is overpriced. You can get one brand new from Best Buy for $35.00", "verified": false, "helpfulness": "11/12", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "G. Dillard \"masterlock44\""}, {"rating": 5.0, "review": "I own two of these Chromecasters and I love them both. Installation (comes with item) are simply written and easy to understand. Chromecast allows you to cast videos from your computer's Chrome browser. The Google chromecast software also works using your Tablets and smart phones. When not casting your favorite videos it runs a screensaver of beautiful pictures on your TV. Works with Hulu, YouTube, Amazon Fire and a host of other video sites, Also casts other types of media. This product has allowed me to 'unplug' from my cable company which saves me well over $160 a month.", "verified": true, "helpfulness": "0/0", "author": "miamistorm"}, {"rating": 4.0, "review": "This little device works really well. I am able to cast most of my media to my living room TV. For the purchase price it was a great deal. Take that Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Jose Laguardia"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Raul Chiesa"}, {"rating": 5.0, "review": "A small learning curve, but so far easy as can be. On my desk top, it's easy, on my android devices it is requiring a small learning curve. But so far it is performing mostly as expected. I like it!", "verified": true, "helpfulness": "0/0", "author": "Thomas W. Dickinson"}, {"rating": 5.0, "review": "I absolutely love the chromecast!", "verified": true, "helpfulness": "0/0", "author": "David Franquez"}, {"rating": 3.0, "review": "What's better than watching youtube on a big screen? I love my Chromecast, but wish it had some of the features Apple TV has.", "verified": true, "helpfulness": "0/0", "author": "Frank Alvarez \"socalfrank\""}]