[{"rating": 1.0, "review": "This is a cheap and bad casting device. I guess you get what you pay for. Very disappointed Google! The video cats copy on TV and the function is not robust. Sometime it just doesn't work for no reason.", "verified": false, "helpfulness": "1/2", "author": "Sara Sarkhili \"Sarabanou\""}, {"rating": 2.0, "review": "I have found this not entirely useful. Since Google has locked out the API it doesn't really do a heck of a lot that I would want to do now that people can no longer write code that will stream to it from other apps that Google hasn't officially sanctioned, which at this point is just Chrome and Netflix. I found that trying to stream to it using the Netflix app on my iPad has some problems. If you start a movie, close the Netflix app, and then return to it, requiring the Netflix app to reload, it loses affinity to Chromecast, and you no longer can control the movie. It will just run until it is done. The fact that it will broadcast a Chrome tab is a novelty only IMHO. Also, when There are practically no controls for this thing other than for setup. I was hoping for Plex support to come out but it hasn't happened yet, so I just got a Roku 3 instead and couldn't be happier with it. This is now gathering dust as I hope that some day Google will change their tune so this is actually \"neat\" again.", "verified": true, "helpfulness": "0/0", "author": "Mr. Litwin \"living dangerously\""}, {"rating": 3.0, "review": "I admit it.  I bought into the hype.  I thought that this would be a good, cheap little device for me to supplement my Roku with.  Well, I was right, it is cheap.  At $35, it is almost a steal.  Almost....What the Chromecast ended up becoming for me is a device which allowed me to easily stream Youtube videos on my TV without the need for a more expensive device.  The \"casting\" of Chrome browser tabs just didn't work the way it could have, and the apps which support it are extremely limited.  The small handful of apps which are supported, Youtube notwithstanding, are available on a Roku, most other streaming boxes, and many connected TVs and DVD players now.  Also, since it requires another device to tell it what to play, and to pause and stop the video, I did have issues where it wouldn't respond to my devices' commands.I don't regret buying the Chromecast, though I am disappointed for having to wait so long to get it (I ordered it 7/29/13, and got it around the 10th of September) just to see for myself that a lot of the complaints were accurate.  The upside is that I found tons and tons of content on Youtube actually worth watching.  It is possible that if Google releases the SDK to other developers, that more and more apps will appear that could make this little dongle an incredible value.  Thanks to Google keeping the SDK closed, however, it isn't anywhere near where it could be.", "verified": true, "helpfulness": "0/0", "author": "smblkc \"smblkc\""}, {"rating": 4.0, "review": "Very simple installation and use. Loved the ability to stream YouTube to my big TV.One star less for lack of app support.", "verified": true, "helpfulness": "0/0", "author": "Rubin"}, {"rating": 5.0, "review": "So easy to use, so sharp and anyone can hop on it as long as they're connected to our wifi! Love it and highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "A. Marial \"CraftyMe\""}, {"rating": 5.0, "review": "Great device streams my browser and phone with no lag in hd.  Recommended to anyone who watches movies on his computer and wants to watch it on his TV without the hassle of wires", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 4.0, "review": "The Chromecast only works with certain apps such as Netflix and Hulu.  I bought it specifically for use with the Xfinity and HBO Go apps so that is kind of disappointing.  But it works well with the apps that it is compatible with.", "verified": true, "helpfulness": "0/1", "author": "Abby Bodily"}, {"rating": 4.0, "review": "the chromecast is not what i was expecting.. i have a smart tv with all the apps that this lil thing has...and i have rokus in all my other rooms.. so no need for this thing i think im gonna sell it.. the delivery was great.. go it really quick..", "verified": true, "helpfulness": "0/1", "author": "gabriel marquez"}, {"rating": 5.0, "review": "After switching to Android with the Nexus 4 from the iPhone 4, one of the biggest things I missed was AirPlay and Apple TV. I think Google finally heard us after the failed Nexus Q experiment. This thing is about the size of a USB stick but has some incredible functionality which I think adds some advantages over Apple TV.It doesn't have as many apps as Apple TV, but what it does allow you to do is use your device after you've initiated streaming something. For example, I fire up Netflix/YouTube on my phone or tablet and then choose what I want to watch, send it to Chromecast, and it starts streaming from the cloud. This allows me to use my phone or tablet while my TV streams the content I chose. Another great feature is streaming a tab from Chrome on your PC or Mac. I can share out any tab I want to replicate it on my TV. While I share that tab, I can open more and work on those while the shared tab is still displayed. This works pretty well but can definitely depend on your wireless network. I've seen some stuttering and lag when displaying some content, especially while scrolling. Having said that, it's definitely a killer feature of the thing. I have this hooked up to my Samsung Plasma and when I hit stream to Chromecast on my phone, it automatically switches the input to the Chromecast and starts playing my video.Did I mention the price? You're getting a lot of the same functionality as other streaming devices in something this small for a fraction of the cost. If you're thinking about getting this, definitely pull the trigger. You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Drew A. Rohaly"}, {"rating": 3.0, "review": "In truth you can't do much with it. Maybe that will improve down the road. I think it could be kinda nice for a hotel room. Able to watch youtube or netflix on the screen.", "verified": true, "helpfulness": "0/0", "author": "RJW"}]