[{"rating": 4.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Daniel Cordeiro Junior"}, {"rating": 4.0, "review": "Chromecast is pretty basic but it does just what I bought it for .. I am able to stream directly from my phone .. Videos, pictures, music and movies.  I downloaded show box for my LG g3 and can now stream the movies from my phone to my tv with no problem. Can't beat it for the price.", "verified": false, "helpfulness": "0/0", "author": "Mark Hernandez"}, {"rating": 4.0, "review": "Not enough apps that work with this...", "verified": true, "helpfulness": "1/1", "author": "aljdfoeif"}, {"rating": 3.0, "review": "cant make it hook up !", "verified": true, "helpfulness": "0/0", "author": "old-red  2012 \"red-dog\""}, {"rating": 2.0, "review": "I still have this product. I did not return it because maybe I will find someone who, if there is such a person anymore, who does not have any type of streaming device through their t.v., but I found this very confusing and I own a smart blue ray player. On my player they offer more and more places that stream from almost on a monthly basis. No I am not plugging another product  here but I have heard that this Chromecast is ok by others who do own it. It just does not stream from to many place yet. It does from the normal. Netflix, Hulu and all these one's that we all know of, but as for many other sites such as even \"Slacker radio\" Chromecast is still far behind all the everyday streaming devices. If you own it , I would like to hear back from you about your experience with it, maybe I am just incorrect about all the places that stream and I may need some information from someone out there. I will say, it is a good price here on Amazon. I have seen higher priced ones at places like Best buy and others.", "verified": true, "helpfulness": "0/0", "author": "sunshine"}, {"rating": 5.0, "review": "So easy to use, clear picture quality and great price!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Still having some issues with it but I hope it may work out", "verified": true, "helpfulness": "0/0", "author": "Chaplain541"}, {"rating": 5.0, "review": "excellent", "verified": false, "helpfulness": "0/0", "author": "sissaacc"}, {"rating": 5.0, "review": "Works as advertised. Now I can easily watch multimedia content from my computer, tablet or phone on my TV.", "verified": true, "helpfulness": "0/0", "author": "Álvaro Amador"}, {"rating": 4.0, "review": "Supported apps always increasing, device is very stable.Set-up requires some use of common sense, but nothing that requires an Engineering degree to understand.A few features that hopefully are considered on the next iteration:Dual-channel WiFi 2.4Ghz and 5GhzSupport for 802.11ACSupport for BTA few features that can be added on the next firmware update:Custom Background Wallpapers and ScreensaverGreat for Plex, Youtube. The new Chromecast app update that also adds mirroring support is surprisingly useful.I would recommend to those who know what this device limitations are, expect too much and you will be disappointed,For roughly $35, the device easily pays for itself.", "verified": true, "helpfulness": "0/0", "author": "d0nat0"}]