[{"rating": 5.0, "review": "Love this more than the AppleTV!  Voice operation is great, and if you have Amazon Prime, there is tons of music, shows and movies accessible.", "verified": true, "helpfulness": "1/1", "author": "Kelly M Samuels"}, {"rating": 5.0, "review": "Too bad you can't save money by buying non-smart TVs anymore- it seems like they don't even make them. An Amazon Fire TV however puts even the best built in Smart TV features to shame.Out of the box it's very good- but if you invest some time learning how to side-load apps it becomes an excellent device very quickly. It serves all my media/entertainment needs besides cable/live tv.Two things I do wish it had though was a way to use the USB port to add extra memory and an IR port that would allow a standard universal remote to do basic controls. Since the remote is bluetooth no basic universal remote works with it.", "verified": true, "helpfulness": "2/2", "author": "BirdOPrey5 \"JUOTnet\""}, {"rating": 5.0, "review": "Absolutely love my FireTV, works like a charm, easy to navigate, thousands of shows and movies at my fingertips.", "verified": true, "helpfulness": "1/1", "author": "DocDonna \"Donna Palladino\""}, {"rating": 5.0, "review": "Love it, fast, and lots of apps. Im glad I bought this!!!", "verified": true, "helpfulness": "1/1", "author": "ALY"}, {"rating": 4.0, "review": "The voice search is wonderful", "verified": true, "helpfulness": "1/1", "author": "Gloria Toth"}, {"rating": 5.0, "review": "We decided to cut the cable.  We went with the fire box after repurchasing the other options.  I love that it is hooked to my amazon account.  Even with the basics:  Netflix, Hulu, and Prime, there is no shortage of things to watch.  I have really enjoyed the other apps and exploring them. Every thing loads quick and I have not had any issues.  Very pleased", "verified": true, "helpfulness": "1/1", "author": "mdr"}, {"rating": 5.0, "review": "Bought 2 one for mu senior parents and one for my \"TV\" Hubby. Best gift for anyone including yourself if you like options for a low cost!!!!! Not enough stars to express this satisfied buyers thoughts on this buy!", "verified": true, "helpfulness": "1/1", "author": "Lee Dowell"}, {"rating": 5.0, "review": "Much easier for the parents than a ps3 or computer connected to a tv.", "verified": true, "helpfulness": "1/1", "author": "Vinnybags"}, {"rating": 5.0, "review": "Works great.  We love it. The Total mount worked great also.  Thanks.", "verified": true, "helpfulness": "1/1", "author": "James G. Ajac"}, {"rating": 5.0, "review": "Love it! It is easy to use and understand.", "verified": true, "helpfulness": "1/1", "author": "Lesley Blumenschein"}]