[{"rating": 5.0, "review": "AMAZING!  I have an old samsung galaxy sii phone I am using as my wireless device to cast movies to this and it plays on my projector flawlessly. For anyone with an older device and a smartphone or other WIFI device that can access streaming media, this is the ticket.", "verified": true, "helpfulness": "1/1", "author": "Scott Rudd \"LSRL\""}, {"rating": 5.0, "review": "I have had my eyes on this device since the day it was released and was very excited for it because I saw the potential it had.  I also own a Logitech Revue, which I love (except for the lack of continued support), and an Xbox.  I bought this because I wanted to stream videos from my (nearby) desktop computer.  With only a weeks worth of use I can say that I am very impressed and happy with my purchase.  Although the device has some limitations, which are hopefully temporary, I can say the potential is huge!!!  My first impressions are as follows:PROS:- Setup: Simple! As a self described FANdroid, Google shamelessly steals Apple product packaging and beats them at their own game when it comes to setup.  I was up and running in less than 5 minutes.- Usage: Using the device is so simple.  My friends and family were amazed how easily they could share video on the big screen from their own phone.  Casting anything from my desktop is easy too while using Chrome!  I was a little discouraged when I wanted to browse the internet with it until I realized there is an \"experimental\" option to cast the entire desktop.  (Although the mouse cursor is not cast properly yet, I see this as being a future addition.)- Price: No comparison!  Nothing else compares to the value of this device.  I love my Revue but this unit does essentially everything that it does and allows anyone to share their videos/music as they please.- Travel: This thing is perfect for anyone on the go!  I have not been able to use it yet in a hotel but I already plan on buying a second one just to keep in my travel bag.  Setup is so easy and allows you to watch whatever you want.- Opportunity: This is the biggest \"Pro\" in my opinion!  Google has not opened up the SDK yet, but when they do the possibilities are endless for this device.  I see this as being the device that forces the cable/satellite providers to reevaluate their offerings.  It has huge potential!CONS: (few but worth mentioning)- On Screen Selection:  My only major gripe is that you are forced to use your phone/tablet/computer to select you next video which is not shown on screen.  Owning a Google TV box and Xbox I enjoy being able to review a movie or show with my audience before watching it.  I wish I could cast the entire Netflix app so that I can see what I'm about to watch and share this with everyone else.- \"Open\" source: Ok, so even as a fan of Google and Android, I'll admit I wish Google would open up the SDK to everyone and allow all apps to have access to this wonderful device.  I think this will happen soon and I understand why Google would want to \"lock in\" the big players such as Netflix, HBO, etc. but I still want a more open environment since it will only enhance the product.FINAL THOUGHTS:Overall I highly recommend this product and plan on making this my go to Christmas gift this year.  It truly is a great device and really has a huge potential to take over the living room!  If you are wanting a streaming device, this is the one to get.  It's cheap, quick to set up, and has most the functionality of any other device (and functionality is going to expand soon *hopefully*).", "verified": true, "helpfulness": "1/1", "author": "wakeryder"}, {"rating": 5.0, "review": "What can I say?  Being a Google fan for a while, I like everything Google makes.  The chromecast is yet another innovative product that I like.  It plays youtube flawlessly.  That is all I care about.", "verified": true, "helpfulness": "0/0", "author": "voitel"}, {"rating": 5.0, "review": "This thing is awesome, especially now that it supports HBO Go.  Just be sure you have an extra outlet or a USB device to plug it in.  Google is hella shady in their marketing and doesn't show the GIANT CABLE sticking out of the back.  Thankfully the product works really well.", "verified": true, "helpfulness": "0/0", "author": "Timothy Wilkinson \"Tim Wilkinson\""}, {"rating": 2.0, "review": "It works great for the very few apps it supports. I wish I could broadcast my phone screen instead.  I want to share my screen, not just watch movies and videos from my phone.", "verified": true, "helpfulness": "1/1", "author": "lovinlife"}, {"rating": 5.0, "review": "It couldn't have been any easier to install and configure.  Props to Google for doing a fantastic job making it (almost) idiot proof.  I have a Roku on our main TV, and this on another TV in the kid's playroom.  I think comparing the two isn't exactly fair, they're close, but not quite the same thing.  The Roku has far more functionality and an entirely different selection experience (ie. My 4 year old son can use it, can't say that about the Chromcast).  However, for what it does, it's really slick.  I can control his shows from anywhere in the house, and see where he is in the episode or movie.  It's definitely very convenient, and for the price, I think this was an excellent purchase.", "verified": true, "helpfulness": "0/0", "author": "The King of Nothing"}, {"rating": 5.0, "review": "Great to display stuff on TV. Lightweight and cheap. Great to travel with you and watch your movies on TV", "verified": true, "helpfulness": "0/0", "author": "UIRA ENDY RIBEIRO"}, {"rating": 5.0, "review": "I do not usually write reviews, but I had to for this. This Black Friday was a little light for me since I have been low on funds. I wanted to pick up a SmartTv but was unable to. I just opted for a same size, regular tv for a fourth of the price. I still had one problem though. I like to have parties where my friends and I change the songs. I did some soul searching on the Internet and found this. Probably one of the best buys I ever made. Now I can pass around my tablet that is hooked up to the Chromecast instead of people telling me what songs to play. It does not do a lot of things a SmartTv can do, such as, Amazon Instant Videos, but there are things Chromecast does that SmartTvs cannot do, that I find cater to my needs. The thing that sold me was that I could cast my Chrome internet browser tab, if I wanted to watch a movie on the internet that is not on Netflix, Hulu, Amazon, etc. (you know what I mean). Not just movies but what ever you have on your Chrome tab. I am a fan of League of Legends and I host some parties for the big LCS games, its nice not to just hook up my laptop via VGA and just to have my computer cast to my Tv. Chromecast apps are limited but I think google will expand them. They have Netflix, HBOGo, Pandora(big plus), Hulu, and others not worth mentioning. To sum up my experience I do not regret not getting a SmartTV. I recommend this buy to anyone that doesnt have a SmartTv that wants to upgrade to one, or a nice substitute to one. It does need a tablet or a computer to use, probably its only downside, it is not a stand alone device that you can navigate through with a remote. Hope this reviewed helped anyone in the same situation I was in and I wish you the best of luck. :D", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "This has been the solution to lack of HBO GO on the Roku box for Comcast/Xfinity. It was actually a pleasure to setup ( maybe because I'm a gadget freak) and the streaming quality is great considering you have decent internet speeds. I would recommend this product.", "verified": true, "helpfulness": "2/2", "author": "Woolly Kundiff"}, {"rating": 3.0, "review": "It is not what I expected but I am sure as with new technology it will expand with time along the way", "verified": true, "helpfulness": "0/0", "author": "Carl Dailey"}]