[{"rating": 1.0, "review": "Ad said it would allow me to show family  pictures on my tv, spent two days trying to figure it out, did not work on my I-pad ot tv.", "verified": true, "helpfulness": "0/0", "author": "William H Lang"}, {"rating": 5.0, "review": "greatest thing ever, so easy to operate and do things with your phone, pictures, movies. Technolohy is great. I recommend", "verified": true, "helpfulness": "0/0", "author": "JEFF PLETZKE"}, {"rating": 4.0, "review": "The one disappointment was that it does not stream all TV programs. But, in the blogs, it looks as if this will improve. Another problem is that the WiFi does not work if your computer is too far away from the TV.", "verified": true, "helpfulness": "0/0", "author": "Marcia"}, {"rating": 5.0, "review": "Very useful, but is just an interface between pc and tv. Most better if it runs alone with your own software.", "verified": true, "helpfulness": "0/0", "author": "Sigifredo Rodriguez"}, {"rating": 4.0, "review": "From a trusted brandEasy to install and get goingAdapts to my iphone, ipad and even my windows laptop", "verified": true, "helpfulness": "0/0", "author": "Gopalan Kannan"}, {"rating": 5.0, "review": "Great product as long as you understand what you are purchasing. Works as described. I only see this product getting better with future updates and an increase in apps. Price is amazing.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Thomas"}, {"rating": 3.0, "review": "Very intuitive to install and operate, however, the wireless casting quality is not so amazing and if I choose the highest quality for casting the video is intermittent. I must use mid-level quality for watching videos smoothly.", "verified": true, "helpfulness": "0/0", "author": "Assaf Peled"}, {"rating": 3.0, "review": "The unit is the greatest tool. To be able to stream to the TV wireless.I would buy this for a gift.", "verified": true, "helpfulness": "0/0", "author": "Doug Wilson"}, {"rating": 5.0, "review": "Works great! I connected the Google Chromecast to an old TV using a HDMI to RCA converter box and use it to stream Netflix, Plex, and Pandora. Definitely a cheap an effective way to breath new life into an older device.", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 4.0, "review": "Received the chromecast as a Christmas present and at first didn't think we would use very often since we usually watched netflix through the Wii.  Had a few issues when installing (all user error and customer service was super nice) and found that it has become our main source of \"casting\".  A little disapointed that I can't cast everything to the tv but really, it was never advertised that way!  Love that once Netflix is playing we are free to use other apps.", "verified": false, "helpfulness": "0/0", "author": "Robin Springer"}]