[{"rating": 3.0, "review": "It's OK, the lack of HBOGo is pretty s***ty. Voice search should include more than just Amazon content. Its faster than other similar devices. I also wish that I could link to more than one amazon account. My wife has coins on her account and I don't know how to access them without deleting all of my existing pictures and account information to Netflix and Hulu and amazon streaming content.", "verified": true, "helpfulness": "1/7", "author": "f.no"}, {"rating": 4.0, "review": "Wish there were more movie choices from Amazon Hulu and Netflex AND having issues connecting to a third tv!  wasted money", "verified": true, "helpfulness": "0/0", "author": "Charmeg89"}, {"rating": 5.0, "review": "roku has went so downhill it is unreal. Love the new fire tv it does everything right.", "verified": true, "helpfulness": "0/0", "author": "Bret Dale Beach"}, {"rating": 5.0, "review": "Just getting it set up, It seems much easier to use than the roko", "verified": true, "helpfulness": "0/0", "author": "Rita F. Ringel \"rita4229\""}, {"rating": 4.0, "review": "Good for the price. Clear 1080p screen", "verified": true, "helpfulness": "0/0", "author": "mario ramirez"}, {"rating": 5.0, "review": "Love my Fire TV! There is so much entertainment in one little box! No more high cable bills for my family! It is really beneficial to be a prime member because of all the Prime content  available through this little box, though. Did I mention that it is a little tiny box that doesn't take up very much room on my tv table? It's great! Plus, I love the voice search function on the remote. The remote is very simple to use and is NOT clogged with a bunch of buttons that are hardly ever touched. The whole thing is simple to use! It's very user friendly and easy to navigate. I highly recommend this product!", "verified": true, "helpfulness": "1/1", "author": "Kimberly Gibson"}, {"rating": 5.0, "review": "I LOVE my Fire TV!  So glad I have all my music on Amazon, I can listen to it on the tv, even my playlists.  It also has the lyrics on the screen with a live shot of the band on most of the songs!  I got the $84 deal on this too.  I was looking into other ways to get wifi on my TV, and they were all data based charging and WAY TOO EXPENCIVE, (we all know the crazy data fees)  I tried using a gaming system to get Netflix but it just wouldn't load anything, or if it did finally load, it froze after a few minutes.  Besides the fact I couldn't watch amazon prime things, or youtube.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Terrific, except it doesn't offer HBO GO which is a main reason why I purchased it. Would have appreciated Amazon to be explicit in their advertising that no HBO. SHOWTIME is part of the viewing package (and was shown heavily in their ads). Otherwise, excellent quality, easy to set up, etc. Voice command is fabulous!", "verified": true, "helpfulness": "0/0", "author": "BeaniesMom"}, {"rating": 5.0, "review": "Well made.Easy Setup.The UI is not particularly useful, but it is not as bad as many in this class. At least it is fast and responsive.It does what it was designed to do well.The only complaints I have are the hurdles that Amazon places between me and the things I want to use the Fire TV for.The main purpose that I want to use the Fire TV for is to run the App \"SPMC\". I was ecstatic when I saw that this app is in the Amazon App Store! It is such a joy when you don't have to hack or side load the programs that you want to run on the device that you bought.My joy was short lived since Amazon has marked \"SPMC\" as incompatible with the Fire TV. Side loading is not terribly painful, so this is not a \"deal breaker\", just an annoyance.SPMC runs very well on the Fire TV. I can definitely recommend this combination as a great way to get XBMC (Soon to be known as Kodi) on your TV. It plays back just about everything except 10-bit video files great. It is not as flexible as a PC running running XBMC but this is the first Set Top Box that I can recommend as a \"good experience\".I wish Amazon would show side loaded apps on one of the many top level menus.I also wish they would provide some avenue to let Fire TV owners get root access to the device they own. There are some limitations that root can fix, most notably that apps cannot access locally connected storage without root. This means you cannot playback music, pictures or video from USB storage. SPMC does a great job playing via network connections though.The number of supported apps is very limited right now. For example I subscribe to the streaming video service \"Crunchyroll\". There is an Android App for this service, and there are apps for most other Set Top Boxen, but it is not on the Amazon App Store. I sideloaded the Android app and it works well but is annoying to get to since sideloaded apps are not visible on the top level menus.Given this shortcoming the lack of providing some way for their users to have root access is particularly biting. If your not going to provide a wide variety of Apps, at least don't make it so hard for me install the unsupported apps that I want to use.", "verified": false, "helpfulness": "4/4", "author": "sschlosnagle"}, {"rating": 5.0, "review": "This product is just amazing and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Entered \"Rescue Mom\""}]