[{"rating": 3.0, "review": "It took two tries and one shut down and reset to get the device to update properly but it finally did. Spent an evening fiddling with it and found it to be a bit confusing to use. The voice search feature seems to work well.  Not sure what I expected but I have all these apps on my TV and besides the gaming, which I didn't purchase it for anyway, no real advantage. Id return it but don't want to take the restocking hit so it will go on a shelf. BTW, there is no off button and its not clear how to turn it off. Turns out, you just leave it alone and it goes to sleep. Dont care for that.", "verified": true, "helpfulness": "0/2", "author": "Sunshine Sally \"professional Grandparent\""}, {"rating": 5.0, "review": "A wonderful addition to our house! From watching tv shows to rocking out with Pandora!It is a great feature especially since we have Prime.", "verified": true, "helpfulness": "1/1", "author": "ksmoore"}, {"rating": 5.0, "review": "I am really enjoying Amazon Fire TV.  I have only had it a few weeks and I feel like a kid on Christmas.  My main reason for purchasing Amazon Fire TV was to stream Netflix but I find myself using all the other features as well.  It is a must have for any tv lover.", "verified": true, "helpfulness": "0/0", "author": "Chicagopaul"}, {"rating": 5.0, "review": "I cannot believe how well built this little box is. It is very powerful and has a fantastic picture. You will have to see the voice search to believe it.", "verified": true, "helpfulness": "0/0", "author": "Phillip S. Main"}, {"rating": 1.0, "review": "When streamed videos did not play in surround sound i contacted Amazon.  After  4 days I received an email with a long list of things I could have done wrong.  The fact is that i connected it with a high rated unidirectional hdmi cable .  What else should there be for a product touted as plug and play?  I returned it and bought Chromecast.", "verified": true, "helpfulness": "2/7", "author": "Robert D. Fishman \"The fish\""}, {"rating": 2.0, "review": "Not impressed  I'm sure a better version will be out soon but to me it's whatever.  Games aren't even 2 players", "verified": true, "helpfulness": "0/1", "author": "Mike  CWH"}, {"rating": 5.0, "review": "The set up was so very easy and fast.  Our favorite feature is the voice control which works very well and the controller is not over-populated with buttons.  It was made with those of us who are not \"techies\" in mind.", "verified": true, "helpfulness": "0/0", "author": "Kathleen C."}, {"rating": 4.0, "review": "This is a pretty cool system. If you have this and netfix your covered pretty good. We cut our Dish TV back to a very low level now and some some money.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 2.0, "review": "The technology could be great but using Hulu, trying to find next episode from (example) ABC News, I have to scroll through hundreds of daily episodes before finding the newest episode. My biggest gripe though is Amazon Prime, I assumed that if I paid $99 for an annual membership then all items offered via Amazon would be inclusive but every movie or tv show I have searched for want an extra $2.99 or $6.99, how ridiculous, I will stick with Netflix and Hulu I would say!!", "verified": true, "helpfulness": "1/2", "author": "Ross"}, {"rating": 5.0, "review": "I really like it.It is easy to use and to install. I should have gotten it much sooner, and enjoy my programs", "verified": true, "helpfulness": "1/1", "author": "Judy Marty"}]