[{"rating": 4.0, "review": "While it only has Netflix, Hulu, YouTube, and google play, there's a good chance it will get lots of other apps as well. Tab casting is great, but you need a strong computer and a healthy wireless network.", "verified": true, "helpfulness": "0/0", "author": "ACH"}, {"rating": 3.0, "review": "I wouldn't doubt I didn't read the fine print enough. I own up to that. But I am really disappointed this thing ONLY works on a wifi network with internet access. I don't mean I want to stream over the network, but rather I mean accessing content too. I should be able to use my mobile data to access content and only use a local wifi to stream it to my devices. This not useful at all the other way!!!!! When my internet goes out and my router still works and my cell phone data works I should still be able to stream Netflix, but the way the system is set up you can't!I am glad it was only $35. It will collect dust now as a gadget that could have been great, but turned into meh.", "verified": true, "helpfulness": "0/1", "author": "Flemm88 \"F.88\""}, {"rating": 5.0, "review": "The Chromecast player works great! We love streaming movies from Netflix now. No more connecting cables every time. I recently had the cable guy come out to repair an outdoor connection. He saw the Chromecast player and said he was thinking about getting one. I showed him how it works. He thought it was great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It took a little for me to be able to connect to the Wi-Fi network. But just re-entering the password solved the problem. It works well, although I wish you could to more things with it (such as streaming your phone videos and photos)", "verified": true, "helpfulness": "0/0", "author": "Emmanuel"}, {"rating": 4.0, "review": "I would say I almost love it but, I have a tv in the family room and one in my bed room and every time you move it you have to reload it. It's not hard to reload it but it's annoying.", "verified": true, "helpfulness": "0/0", "author": "Marcie Ramirez"}, {"rating": 3.0, "review": "The device works well for the specific providers of content. I was disappointed that it would not stream the Amazon movies and if I had realized that I would probably not have made the purchase. Set up was strange but not difficult.", "verified": true, "helpfulness": "0/0", "author": "LK Duck \"Lloyd\""}, {"rating": 4.0, "review": "Great device, but not a lot of software works with it yet.  Chrome on laptop will connect, but I'm unable to get Chrome on Nexus 10 to work which is unfortunate because I like to stream college sports channels.  If going to use laptop, I just as well hook up a HDMI cable.  Netflix and youtube work great with Nexus.", "verified": true, "helpfulness": "0/0", "author": "Dirk Pattee"}, {"rating": 4.0, "review": "Really amazing, cheap, easy install, great resolution. Need extend the cover because on LATAM is imposible download the app from GPlay to control it.", "verified": true, "helpfulness": "0/0", "author": "Wendy Torres"}, {"rating": 4.0, "review": "Really good, low price, good picture quality and excelent if you have a netflix account. However, im still waiting for more improvements, like cellphone mirroring and having other apps working on it, such as pandora and songza.", "verified": true, "helpfulness": "0/0", "author": "Bryan Guzman"}, {"rating": 5.0, "review": "For the price this device is amazing. Not only is it very quick to send things from other devices, it loads a separate version of the media sent (in most cases) so you are able to continue on doing other things with your computer,laptop, phone or tablet!By far the best thing about the Chromecast though, is the ability to send all sorts of video files from your PC via the web browser by simply going to the drives network location in the address bar. (C:\\Users\\Public\\Videos\\Clockwork Orange)Anyway, I highly suggest it!", "verified": true, "helpfulness": "0/0", "author": "Josh"}]