[{"rating": 5.0, "review": "Love it.  Good movies..pbs..YouTube..hulu.  Great!", "verified": true, "helpfulness": "0/0", "author": "Janemarie"}, {"rating": 5.0, "review": "Amazon Fire TV is the best!", "verified": true, "helpfulness": "0/0", "author": "BOB"}, {"rating": 5.0, "review": "Best streaming device on the market.  Good UI with great hardware to support it.", "verified": true, "helpfulness": "0/0", "author": "Toby Preston"}, {"rating": 5.0, "review": "I used to run a old PC next to my TV for using Netflix, Plex and various local files i wanted to play on my TV. This device has made it 100 times easier to do the same thing.Pros- Easy to use- Android based and very stable- Runs Netflix, Plex and Local Files great- Small, compact and requires little space- Powerful system i have not experienced any lagCons- Search is limited to voice and only works with amazon prime- No way to filter watch with prime vs pay to rent/buy- Prime outages are not announced anywhere and they do happenOverall this device is great but i would only recommend it if you plan to use amazon prime you loose 75% of the features if your planning to use this exclusively for netflix or another media service.", "verified": true, "helpfulness": "0/1", "author": "Kyle Cohn"}, {"rating": 5.0, "review": "OMG, this is worth every penny! I love it! The interface is easy to use, the voice recognition is awesome, the remote has no delay, there is no glitching or buffering! The receiver is way smaller than I expected. It's easy to install and easy to setup. Voice doesn't work for Netflix and Hulu but their interface is easy to navigate so it's forgiven. I've had other receivers like NeoTV, even a tv with amazon and Netflix and Hulu built in... this blows them out of the water!I LOVE that my Kindle Fire HDX and my Amazon Fire Phone both work as a second remote with X-Ray, so you can see who's who and get tidbits of trivia about what your watching. I'm so happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "SheenaLee"}, {"rating": 5.0, "review": "The best one on the market. I am more than happy with the Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Lisa M. \"Book luvr\""}, {"rating": 5.0, "review": "Have been using the Fire TV now for three weeks and could not be happier. The load time is very short and have only had one instance of refreshing. We have used the box to stream Prime Video as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "John L. Domaschofsky"}, {"rating": 5.0, "review": "It's great. I use it almost every day to watch the shows that I love on TV and movies.", "verified": true, "helpfulness": "0/0", "author": "Moe S"}, {"rating": 5.0, "review": "Performs its function quite well. I had to adjust the location of our WiFi transmitter to provide it an excellent signal. I thought I'd enjoy the Fire TV, but it turns out that the wife enjoys it most of the time... Oh, and the voice response is quite good, keeps you mostly from having to press buttons to find what you want.", "verified": true, "helpfulness": "0/0", "author": "EngineerDave"}, {"rating": 1.0, "review": "I had the box for about two months with no real problem until just a couple days ago. I tried to turn on the fire tv and instead of the usual white light on the front, an orange light came on. Now the box does absolutely nothing. The tv screen stays blank, no sound, no nothing. The manual doesn't mention anything about an orange light, so i contacted Amazon customer service only to receive no reply! I will update if Amazon replies with a solution but it seems I have been ignored..I am usually an Amazon supporter but stay away from this product.", "verified": false, "helpfulness": "5/8", "author": "clay"}]