[{"rating": 4.0, "review": "The selection of apps is pretty good and the screensaver for Pandora is unbelievably beautiful.  I haven't figured out how to access my Amazon music library in the cloud (I'm able to do it from my Kindle Fire HD).  I also haven't figured out how to turn the thing off gracefully.", "verified": true, "helpfulness": "0/0", "author": "Arthur Miller"}, {"rating": 4.0, "review": "So I’ve been meaning to get Roku for a while now but never gotten it, so I figured when Amazon Fire TV came out I would give it a shot.  So far so good, very easy to hook up and it automatically connected to my Amazon Prime account.  This is just based on my two day experience so I will be updating in the future I’m sure of.Pros:-The mic works great, even picks up my awkward New York/Texas blend accent with no issues.- YouTube I LOVE to watch on it.  Automatically goes to the next video in 5 seconds of ending, this was great last night when I binged out on medical documentaries.Cons:-No restart from beginning option.  I started to watch a movie a month ago but never finished. So when I wanted to watch it from the start it played where it left off, and no option to simply restart from the beginning. Instead I had to rewind it.- Amazon Prime and paid for movies are not in separate areas. I’m use to watching prime movies on my computer where the categories are separate and easy to find what I can watch for ‘free’.So overall I love it and I’m glad I bought this, but just a few minor tweaks would make it perfect for me.", "verified": true, "helpfulness": "3/3", "author": "Bambi D."}, {"rating": 5.0, "review": "This was the best thing that i have bought in a long time. I was able to unpack the device in seconds and have it set up and working beautifully in under 5 min if even that. I feel that it is easier and more affect then the appletv. I am able to get access to all my amazon, hulu, and netflixs right away as well as access my personal movies with easy. Highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "n camp 310"}, {"rating": 1.0, "review": "The device provides a great video stream but the audio is unavailable or it will create sound after the video has been streaming for 30 minutes or so. Customer service is great, but the device is a loser. The Roku player and Apple TV work as advertised. The video and audio work. The Fire TV device is being marketed as having great specifications, but if no sound, then why bother? It may be wise to wait until this intro generation of Fire TV devices is sold, then if Amazon decides to continue competing in the streaming arena they will offer a device that streams audio along with video. The Roku device has a means to select the style of audio while a streaming event is taking place, the Fire TV device is lacking that feature. Very surprising Amazon would introduce such poor device.", "verified": true, "helpfulness": "11/27", "author": "L. B"}, {"rating": 4.0, "review": "I like the remote a lot.  Easy and well-designed. Voice command works well.  Hook-up was brainless and easy.. Thank you!  Buying it from Amazon was also good since it's already registered and set up.Do not like the pain of finding the \"40,000+ Free movies/shows. \"  Having to dig through the rental and purchase prices...all the while hoping you don't accidentally buy something.  The Shows that are included at no additional charge should have their own section without all the $$$ stuff.The set up video should go into a little more detail for the people who aren't tech savvy on how to get included shows they pay for with their Prime subscription.  Yes, I'm obsessing on that. It's the only negative.  It frustrated my husband so much he won't use it.", "verified": true, "helpfulness": "2/2", "author": "deb \"Debbie\""}, {"rating": 5.0, "review": "I am not a techie...Got the box, plugged it in and streamed a movie...took about 5 minutes.Absolutely seamless...already tied to my Amazon account.Have watched 7 movies since I got it and it takes about 3 minutes to find a good one...If you are a movie junkie this is HEAVEN.", "verified": true, "helpfulness": "1/1", "author": "Scott Landry \"a proud pappa\""}, {"rating": 3.0, "review": "Sadly with such a limited supply of Apps at this time is why I only gave Fire TV  3 stars.Now if you have never used Playon then this box will be great you simply will not know what you are missing.This device runs on Android OS and yet they DO NOT ALLOW allow you to use the Google Play app store if they did this thing would rock and roll.It also does not offer any web browser either boo hiss.The quality of video was fantastic, the audio is too, and it is blazing fast especially on Amazon Prime video, they should also have allowed you to shop Amazon from the main screen that also would have been a real plus..Compared to Roku for sound and video hands down Fire Tv wins, but there is that app problem.No matter how great the picture, or the sound without sufficient apps it is just not worth a 99 bucks.You have currently 4 or so streaming choices  Amazon, Netflix, Hulu Plus, and one or two other I do not remember they were not in my opinion worth the load. Playon is currently NOT available that sucks folks big time.Now it plays games and that is another feature younger folks will love, there are many games on the Amazon App page, but I do not play games.However I did load the Zombie game they offer the graphics were not too bad but game play was very poor indeed you walk and run forward and turn right and left to duck the zombies and pick up items you earn such as guns. The turns are very limited I removed the game right away after I checked it out.I had also ordered the Game controller they offer at the same time I ordered the Fire Tv but by the 2nd day after the Fire Tv arrived it still had not shipped so I cancelled the order.The Zombie game most likely would have been better with the game controller.My wife and I have 4 Roku in the house, and apps are in no short supply for them.So the Fire Tv  became a redundant device and was returned back to Amazon.On the day Playon and other significant streaming Apps are available for the Fire Tv I will gladly purchase Fire Tv from Amazon because that will make this little box simply awesome.Now if you write Java code for Android then this box is your playground, it offers an easy side load ability.I do write code in several languages but since I do not write in Java or Visual C++ which is much like Java so I am not in the App writing world for Android,yeah I know I am a programming dinosaur.", "verified": true, "helpfulness": "0/3", "author": "Gandolf"}, {"rating": 5.0, "review": "Besides all the normal stuff about speed, etc., on this box, I'm really please with been able to sideload apps like XBMC for OUYA and AllCast. XBMC works great and I have my favorite add-ons working like Movie25, 1ClickWatch, 1 Channel, Icefilms and Jupiter Broadcasting (Linux Action Show). It works great and will only get better once the Gotham release support Fire TV natively.You can do mirroring from your android phone (no more waiting for Amazon) using AllCast too! Plex works nicely and the interface is better than that for Roku. I'm a Roku 3 owner and waited a long time for enabling Miracast but they never did. Not even a hint of someone even been close to port XBMC to it... Now I have a box that is as good or better as Roku 3 but with XBMC and Miracast Mirroring.", "verified": true, "helpfulness": "2/2", "author": "gmicalzoma \"jaylopez\""}, {"rating": 2.0, "review": "I was hoping with this to be able to go to a basic package with Direct since it did have an ESPN option. Well no go. Direct is not one of the providers for the ESPN option. The picture is better but well $100 for a picture??? The remote easy to use and I will say for Amazon easier but its not worth $99 since I can't get a break with lower fees with Direct. I still have time to send it back - trying to decide was it worth it - the Wii works fine for Netflix and my Kindle works fine for prime........", "verified": true, "helpfulness": "3/11", "author": "J. Pepper"}, {"rating": 5.0, "review": "Setting it up on my home wi-fi network was easy (OK - watched the wife install it), it installed its software automatically, but I got the fun job of learning to navigate.  There's TONS of free content available just on Amazon Prime and I haven't even gotten to the $$ subscription services, such as HULU+ and Netflix.  I'm still learning about Amazon Fire, but I suspect that, once I become comfortable with it, I'll be extremely happy with it.", "verified": true, "helpfulness": "0/0", "author": "J. Chiapperini \"Joe C\""}]