[{"rating": 3.0, "review": "I'll give this 2 stars, only because I feel generous. But in reality I am very dissapointed in this device. First what it took to set it up. I am a very technically oriented person and I could NOT get this set up without over an hour phone call to tech support. There is a hidden setting you have to set to get it to work, and that is turning on the chromecast wifi option in your wifi. This is stated NO WHERE. Next , I had an issue with it constantly turning off my wifi when it was trying to set up on my Galaxy s4. I had to eventually get it set up using my windows pc(not a very \"portable\" issue).Then it did go thru the set up, and had to do an update. After the update it seemed to work on the Galaxy. Ok, so what this DOES do.. Netflix, HboGO, Pandora, You Tube,  Google Play music (somewhat buggy), Hulu. Most dissapointing is what it does NOT do, which is part of the massive ad campaign for this device. It does NOT cast my photos, my movies, my tv shows, or anything from Chrome browser. Android is not supported for casting from Chrome. Really? the most popular OS, on the most popular tablets, and it does NOT support it? VERY dissapointing. For now I'll keep the device, but even at $35 it is dissapointing that it was falseley advertised. If you want a device for the few supportive apps, and dont mind spending a while getting it to set up, I guess its ok. I just dont like being scammed into buying something, to find it does not do what it is advertised to do. Maybe it will get better.. we shall see.Edit: I have upped to 3 stars, because I do find I am using it for HBOgo and Netflix and my google play music. I did find however more set up issues. When I took it to another house on a different network, I had the same issues trying to set it up initially with my galaxy s4 smart phone. But once I tried on an android tablet, it did set up fairly easily. I think there is some issue using a phone for initial setup, as it gets confused with the wifi, its internal chromecast network, and the cell data network.  They do have 24/7 phone support, that is fair at best, but they answer fairly quickly and try to help.Edit #2: After using this for a week or so at another location, I actually did purchase a 2nd one for my office. The set up issues I had, I discovered were from trying to do initial set up from a smart phone (Galaxy s4), apparantly it gets the networks confused. On the 2nd unit, I went to set up right from a tablet and it worked quickly and flawlessly. I think the device will have a place in the market, and as time goes on, and it can do more, it may be a decent, and well priced device.One good thing about it, is if you use multiple chromecasts at different locations, once each is set up, you can access and control any chromecast device from any phone/tablet/computer, etc..", "verified": true, "helpfulness": "8/11", "author": "Diane Helen"}, {"rating": 5.0, "review": "I used to watch Netflix using an RGB connection with my laptop.  When Chromecast arrived on the market I was willing to risk the $35 for a better experience.  While it seemed to work fine with the laptop, my wireless is sometimes sketchy when connecting in our bedroom.Once while watching a movie in another room on my new desktop (which uses an ethernet connection), Netflix asked if I wanted to watch on TV or Chromecast.  Well, three rooms down the hall I now have a perfect connection with no interruptions.  Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "K Thomas"}, {"rating": 3.0, "review": "The first Chromecast I ordered was very easy to set up and use.  However, within one week it completely failed on me.  It was displaying a pink light, my TV couldn't find the device, it would not reset (either by holding reset button or unplugging and replugging back in).  After several very frustrating calls with Google, they finally sent me a replacement unit.  I've had it over a month and have had zero problems with it so far.  Perhaps I just got a lemon originally.", "verified": true, "helpfulness": "0/0", "author": "Yancey W House"}, {"rating": 2.0, "review": "This does nothing compared to what they advertise on TV.  I loaded it I get 2 apps. Netflix and You Tube that is it.  My Samsung DVD player gives me at least 6.  Don't waste your money maybe in the year 2125 they will have it do what it says it is supposed to do.  Save your money.", "verified": true, "helpfulness": "0/1", "author": "Arturo Rodriguez"}, {"rating": 5.0, "review": "Awesome!  We use it several times a day, and we can ever stream things from our smartphones.  This is an amazing product that makes an awesome cheap gift!", "verified": true, "helpfulness": "0/0", "author": "A. Brown"}, {"rating": 4.0, "review": "the only thins is you cannot project the video from chrome on ipad. so for ipad, you can only use netflix or you tube.  if you want everything to be projected to tv then you need to use laptop, which defeats the purpose of having a wireless dongle.", "verified": true, "helpfulness": "0/0", "author": "eshopperrock35"}, {"rating": 1.0, "review": "The device works perfect, but it wont allow you to play anything that you already have... all you can do is play youtube (or netflix)There are workarounds to play local media from a chrome tab, but the performance and quality is awful.The device itself is really powerful and I think google team made such limitation by design. A group of hackers had found a way to bypass those, but google released an update to quickly fix that .. it seedont work for local streamingms google does not want to let you watch whatever you want -- at least if they are not involved in the delivery process.", "verified": true, "helpfulness": "1/3", "author": "Martin Scotta"}, {"rating": 5.0, "review": "Cool will not stream a lot of things maybe in the future, wanted it to use with my sling box will not work for that. I bought 3 of them anyway, works great for youtube, they may have upgrades to support sling box in the future I am hopeing!", "verified": true, "helpfulness": "0/0", "author": "W. Todd \"IF ONLY I COULD BE THE PERSON MY DOG THINKS I AM.\""}, {"rating": 1.0, "review": "I cannot project my home videos from my phone to my television? This is the main reason I purchased this device. I had to go and spend 4.99 on the play app which allows me to project my videos.", "verified": true, "helpfulness": "0/3", "author": "Pen Name"}, {"rating": 3.0, "review": "Unfortunately, the list of supported applications is too limited so far. Piping everything through Chrome is not a panacea. If everything you watch comes in web streams, that's your device. For local content etc. - not really.", "verified": true, "helpfulness": "0/0", "author": "Hobbitophyle"}]