[{"rating": 5.0, "review": "i luv this and its really dope because i can use it to watch pawn stars.if u dont know what pawn stars is stop reading this review and go watch it rite now.pawn stars is the best show of all time.", "verified": true, "helpfulness": "0/0", "author": "coolguy 2000"}, {"rating": 5.0, "review": "Roku goodbye!", "verified": true, "helpfulness": "0/0", "author": "bellaluna \"luna\""}, {"rating": 2.0, "review": "I am very disappointed it did not come with an instruction booklet explaining a few more things", "verified": true, "helpfulness": "0/2", "author": "miss led"}, {"rating": 1.0, "review": "It is not accessible by my cable TV so i have to get the Roku because it offers time warner cable.", "verified": true, "helpfulness": "1/3", "author": "Arlyn"}, {"rating": 5.0, "review": "This was a great investment! It is well-built, easy to connect and start up, and simple to use. The remote is small, well-designed and reliable. I was especially satisfied with the voice activation feature. Access to Amazon Prime through our LAN gives us an impressive array of movies, television shows and games, and most of the ones my wife and I have watched so far have been free. Streaming through our cable provider and wireless router is smooth and continuous, with no annoying pixelation or interrupts. The unit has a small footprint, so it can be placed almost anywhere. It gives a high-quality display on small and large flat-screens. We like it so much that we bought two. Well done, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dianne G Sagan"}, {"rating": 2.0, "review": "Organization of application favors Amazon products and is not convenient to navigate. But most problematic is that this streaming device pulls lots of data from your internet source. This has been described as a glitch with the screen saver function. However, after turning off that function, the problem persisted in my hands. I advise to wait till all the bugs are fixed with this device.", "verified": true, "helpfulness": "0/2", "author": "Jennifer"}, {"rating": 5.0, "review": "This is the greatest item in which an avid series watcher has ever invested.  The remote is very sensitive but that works to your advantage.  This is like a full entertainment system in one box.", "verified": true, "helpfulness": "0/0", "author": "Cameron's Mom!"}, {"rating": 1.0, "review": "When we connected it to our TV the image was jumping & in black & white instead of color. We had to disconnect & have been unable to use it since.", "verified": true, "helpfulness": "1/3", "author": "R. D. Boone"}, {"rating": 5.0, "review": "I got this for my husband to hook up to the TV he most frequently watches. I also have an Apple TV which is hooked up to the TV I watch most often. We liked that we could view Amazon Prime content on this (obv) as well as Netflix and other Aps as we see fit. It works very well and my husband finds the remote much easier to understand than the Apple TV remote. Overall I still like both and find each has its benefits and drawbacks. The biggest benefit of the Apple TV comes from using other Apple devices, if you're not an Apple user (iPhone or iPad etc) then I would probably recommended the Amazon Fire TV over the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "LavenderGrove \"Mbb_Girl\""}, {"rating": 5.0, "review": "I am an Apple fan boy.  No doubt about it.  I have 2 Apple TV's in the house currently.  When this Fire TV went on sale during the holiday season, I thought i would give it a try.  Frankly, its interface is better, its faster, and i love the voice search.  In my main theater room I have both Apple TV and Amazon Fire to choose from and I find myself using Fire TV much more often.  I think its just better.", "verified": true, "helpfulness": "0/0", "author": "faltered"}]