[{"rating": 5.0, "review": "Love it so much! just need HBO go", "verified": true, "helpfulness": "0/1", "author": "wesley espinoza"}, {"rating": 2.0, "review": "I recommend the Roku 3 over this unit any day.I was attracted to this unit due to its voice feature, but it can only be used in the search mode, and it only works to search in amazon.Yes, I know this is an amazon product, but they made it difficult to use the other apps.First, you automatically open up in amazon.  That is fine if you don't want to use other apps; it also wouldn't be bad if your apps went into the app library, but for some reason they don't always go there.  I also had a lot of difficulty with getting Netflix to download.  We had to do a factory reset, and after some searching I was able to find and download Netflix, which never went into the app library.  (It was suppose to be in the app library from the very start, but it has NEVER appeared there, not even after being downloaded.). Netflix also keeps disappearing, so I continually have to find it download it again and enter my account information.  I have contacted customer service, but they feel like the problem is fixed, since I can download Netflix again and again and again.The Roku appears to search all our MOST of my apps for the movies or shows I want.  It tells me the prices or where I can get it for free.  The amazon doesn't have this feature.The Roku has a lot more apps available.  The Roku works well.Ok, I can imagine everyone shaking their heads and thinking I got a dud.  In that case, I got three duds, because I also ordered two amazon fire TV sticks, and they each were flawed in different ways.  On one, it wouldn't download the software at first.  Then it took two hours to download.  On the other, it wouldn't download the software at first, but then I got it to work quickly (no slow download issues).  The second one had the same problem as the amazon fire TV had with the Netflix, but this time it was with Hulu Plus.  So there are definite quality issues.  (I also set them all up on the same TV, so it wasn't related to my hardware.). All of the flaws were due to poor quality issues with the amazon products.Also, the Fire Sticks, while plugged directly into the TV, still require a power cord be attached to them to work.Overall, I would recommend the Roku 3 over amazon, net gear, chromecast, Sony (or other DVDs based media), or apple.  While this is a great device if you only want to use amazon, it has many irritating flaws that still need debugging.  However, for overall all performance and selection, I would suggest the Roku 3.Edit:  And now in a new and unusual move, I can open Netflix, but it is unable to play content.  But the Amazon content will play.  I checked on my Roku, and Netflix is working fine.  So it isn't that the WiFi is too weak.  It is just the Netflix not working on the Amazon Fire.", "verified": true, "helpfulness": "16/16", "author": "Kelli"}, {"rating": 5.0, "review": "I bought a second one. Enough said.", "verified": true, "helpfulness": "0/2", "author": "Ed H."}, {"rating": 1.0, "review": "What difference is it than the cheaper stick? Also any shows and movies not on prime (which is very limited in quality - even with the quantity) cost way too much", "verified": false, "helpfulness": "3/8", "author": "Rhett A Yankowski"}, {"rating": 4.0, "review": "great unit but they came out with one for less than half of the cost about 2 months after i bought 3 at about 99.00 dollars dont think that was fair would have liked the newer one i wold hace not had theproblems with the hdmi cables and the seporate power supply WALTER WHEATLEY wawheatley11@AOL.COM", "verified": true, "helpfulness": "0/3", "author": "Walter W."}, {"rating": 4.0, "review": "Good product but it needs an ON--OFF switch!", "verified": true, "helpfulness": "1/1", "author": "vampire"}, {"rating": 5.0, "review": "Great but I wish it had NHL app", "verified": true, "helpfulness": "2/2", "author": "Tomcdman"}, {"rating": 4.0, "review": "it is good great voice recognition bugt alot of buffering and i have high sped internet.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Can't believe I waited so long to purchase. Fire is a great way to watch netflix, flixter, etc.  Ordered two sticks after this purchase to be shared throughout the house.", "verified": true, "helpfulness": "1/2", "author": "shelly callaway"}, {"rating": 4.0, "review": "I was hooked on Apple TV. Now with Amazon Fire TV im changing my mind. The ease of use and variety of content you don't even need your own library of movies like the case with apple. Good call and I'm glad I got it.", "verified": true, "helpfulness": "1/1", "author": "MG"}]