[{"rating": 4.0, "review": "Works great for Netflix and Youtube.  Would be 5 stars if I could watch ABC shows online with it also.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Can't wait for more content to be added to this device.  For only $35 it takes your dumb tv and makes it a smart tv.", "verified": true, "helpfulness": "1/1", "author": "Umit Ozbas"}, {"rating": 4.0, "review": "Love this.  Had great fun recently with guests who wanted to show youtube videos.  The only problem is it only displays youtube, netflix and hulu.  (they might have added one more recently)  The good news is, as they add new services, they will come available on my device!", "verified": true, "helpfulness": "1/1", "author": "John D."}, {"rating": 4.0, "review": "This makes streaming Netflix to my TV so simple and fast. I keep hoping that Google will make the APIs public so more sites can be chromecasted. You can't argue with the price.", "verified": true, "helpfulness": "1/1", "author": "Vi Ann Beadle"}, {"rating": 1.0, "review": "This device will not work with time warner ubee modems. After you've purchased the product, then they give you the details that Chromecast is only compatible with certain wireless routers and incompatible with many.", "verified": true, "helpfulness": "3/5", "author": "John"}, {"rating": 5.0, "review": "So easy to use and set up.  Wish I would have got this awhile ago.  Save your money, get this and stop buying dvds.", "verified": true, "helpfulness": "1/1", "author": "Dara"}, {"rating": 5.0, "review": "I have had this adapter for under 24 hours and I am in love! I bought 3 more this morning for every TV in my house including a 8 inch android tablet for a universal remote. Right now I have my phone and computer to play with and it's amazing. Streaming quality is fantastic and very easy to setup. Although it is currently limited with the few apps that support it, I suspect they have only touched the surface. The ability to stream from my phone or tablet via Netflix, Hulu and Youtube to any TV is amazing and media servers simply can't compete.", "verified": true, "helpfulness": "1/1", "author": "Paul Edmundson"}, {"rating": 2.0, "review": "Buggy and marginal quality.Save your money and go with a Roku or Apple TV. You'll be happy you did.", "verified": false, "helpfulness": "0/2", "author": "taylor"}, {"rating": 2.0, "review": "Its a joke. Only supports Google apps, Netflix some others (7 total) but no Amazon. Plus the HDMI connector they give you is basically useless as the device is still stuck behind the TV and WiFi reception is poor.  A Female/Female Coupler would be better.Also some youtube videos do not support Chromecast - not sure why so my playlists end up very short.", "verified": true, "helpfulness": "0/1", "author": "MadBrit"}, {"rating": 2.0, "review": "Got this to try. I have a TV in the bedroom with a spare HDMI input and figured for $35 bucks what do I have to loose. I bought it on impulse and didn't do a lot of research. I figured it would work mostly like the roku with fewer available apps and controlled via smartphone/tablet. One of the things that looked really cool in the ad was the guy browsing the internet, and then \"flicking\" the browser page from a table onto the TV. That looked cool, and would allow me to surf in bed without reading glasses for my tablet!It does not do that...on an android tablet. You can do it from a laptop, or a WIN 8 tablet, maybe even from an iPad, but the android chrome browser does not have chromecast support. So all you can really do is Netflix, Hulu plus, and Youtube, HBOgo and Pandora and of course buy stuff from the Google Play Store. It is almost unbelievable that the android support is so poor. There are a few other beta apps, but not a lot. No easy way to stream other content directly off your device or computer (yea there are some workarounds). Android browser support is coming...someday.I'll keep playing with it. Maybe Google will update it some day to be more useful.Pro: Youtube (still not available on Roku)Cons: Does not do what it says. No real advantage over Roku (other than Youtube). No remote, Not very many apps/channels.Edit: I carefully re-watched the video's and they technically never say or show web browsing from an android device, but I still feel like it is almost inconceivable that they do not have this working. Chromecast didn't come out yesterday. There are some third party solutions, so it's technically possible.", "verified": true, "helpfulness": "0/2", "author": "Joe"}]