[{"rating": 5.0, "review": "Great! use it often.", "verified": true, "helpfulness": "0/0", "author": "pakcom"}, {"rating": 5.0, "review": "awesome...I used this when traveling mostly", "verified": true, "helpfulness": "0/0", "author": "Kuka"}, {"rating": 4.0, "review": "Could be a lot better, should Google give more freedom to stream media using this amazing device. The hardware itself is great, Google's holding it back is not.", "verified": true, "helpfulness": "0/1", "author": "REX9000"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 5.0, "review": "I've been using my Chromecast nearly daily since it arrived and it's worked flawlessly!Some hotels are starting to get wise on these things and either physically locking their HDMI inputs or using bluecoat type devices to block them on their networks.  Marriott and La Quinta hotels work well; Hilton seems to get throttled down a lot though.  Can't speak for other hotel chains because those are the ones I stay in mostly since I have long standing Rewards memberships with them.Biggest downfall is there is NO Amazon Video capabilities native with it.  I'm guessing Amazon wants you to buy their Fire Stick instead for that.  There are \"work-arounds\" for that though but video quality lacks.  It's pretty much surfing through internet sessions and sharing your devices screen with Chromecast to make it work.For those of you who like XDA or toying with your Android devices; you can toy with this too.  Check your normal websites like XDA and whatnot :)", "verified": true, "helpfulness": "0/0", "author": "Randy Reiterman"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "hasan beker"}, {"rating": 4.0, "review": "Works very well, you can control it from your phone and pretty much project anything you have on your phone without wires, this does not come with a remote but your phone is the remote. It connects straight to hdmi port in your tv, the media player also need to be plugged into usb port to get power that was about the only thing I didnt like, everything else works as expected and the quality of the picture is awesome", "verified": true, "helpfulness": "0/0", "author": "jesus gutierrez"}, {"rating": 2.0, "review": "It says you can cast from your iphone or ipad but you cant cast from chrome on these devices. You have to use a computer to do it. I would not buy this again as the instructions are very misleading. Says you can do all these things but you can't...... works great for netflix and youtube but forget the internet on an ipad etc.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 1.0, "review": "Bought one of these about 3 weeks ago.  Sometimes it works sometimes it don't.  I keep getting messages like \"no chromecast found\" then I reset the chromecast and go through the setup again only to get a message \"could not communicate with chromecast\".  I've sent multiple feedbacks to Google with no response.  Huge disappointment.", "verified": true, "helpfulness": "0/1", "author": "Jason A."}, {"rating": 5.0, "review": "My hubby loves this. I bought it for a gift for him and it comes in handy", "verified": true, "helpfulness": "0/0", "author": "GAMECOCK FAN \"gamecock fan\""}]