[{"rating": 5.0, "review": "Such a neat little device. I just plugged it into the HDMI port on my TV and it found it straight away. Had to update the software on it to the latest version, but once that was done, watching youtube videos and personal photos on my TV was just so easy. Just wonder why I didn't get it a year ago when they came out....", "verified": true, "helpfulness": "0/0", "author": "Xciting Trips"}, {"rating": 1.0, "review": "I'm highly disappointed with this device.Setup was easy enough; however, when I'm looking at a video on  my computer that is streaming beautifully, as soon as I cast the video to my HDTV, it starts dropping multiple frames, enough so that the image is jumpy and appears out of sync with audio since the audio is still going while the picture is momentarily still and the when it moves again, it's usually out of sync. The frame drop then occurs on both my computer and the TV set.I am using a high speed, broadband Wifi router and, for the test, the separation between the Wifi router and the TV is about 6 feet.Highly disappointed and would not recommend.", "verified": true, "helpfulness": "1/3", "author": "J. M. Bryant \"Jim B.\""}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/2", "author": "Edgar D Underhill"}, {"rating": 3.0, "review": "Found out after an impulse buy that you can't stream Amazon Prime.  Deal breaker, returned.  But it did work well for the very short time we had it.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "micleecon"}, {"rating": 5.0, "review": "This is an awesome product, that I use every day.I was the happy owner of an Apple TV (and I still love it and use it everyday with all my Apple products, such as iPad, iPhone and MacBook), but this device completes my Apple TV perfectly.I use a lot Plex Media Server to watch movies and TV Shows, and even though the Plex app is compatible with AirPlay, as the iPhone was sending the content on the Apple TV, the movie was first transcoded in the right format. It is done transparently by the Media Server, but the quality was not as good as a Direct Play.With the Chromecast, the iPhone is only used as a remote, and the movie is streamed directly to the TV from the server, so the quality is incredible. And I can stop my smartphone, close the app ... It is still working.If you are a Plex user, this device is a must-have (especially when you see the small price).", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "This is awesome!  We use it all the time.  When our kids wake up at ungodly hours in the early morning and crawl into our beds and say various titles of kids' TV series that they want to watch on our phones, we just pull out one of our Android phones or tablets, or one of our laptops, and open Netflix or Youtube and open up one of their shows and say, \"OK, it's on the big TV downstairs, go watch it.\"  \"HOORAY!\" they scream as the scamper off down the stairs to watch their show!  Gives us an extra half an hour or so of sleep!  We don't have a \"smart\" TV, but it does recognize when it is getting input over the HDMI port, and it turns on to that port, which is how we're able to stay in bed and not have to turn on the TV.  It's awesome.One thing I would REALLY like for it to be able to do is to stream movies from a USB drive connected directly to my router.  Right now, I can access the movies in Google Chrome browser by navigating to the drive over the network from my laptop, and then I can cast the whole tab, but that results in glitchy playback of the movie, unless it's extremely compressed, because it has to go from the router to my laptop, play on the laptop, and go back from the laptop to the router and from the router to chromecast and then play on chromecast  :(  But there is constant development happening with Chromecast Apps and I anticipate that something will be available that will work exactly how I want it (just set up the connection from the movie on the USB drive on the router and stream it directly to Chromecast).All in all, I love it!  There is no reason for me to buy a truly smart TV with Chromecast, and it's a super awesome steal of a deal!", "verified": true, "helpfulness": "0/0", "author": "Cade Foster"}, {"rating": 5.0, "review": "Awesome product for the price.  If anyone asks me if they should get a smart TV I always tell them NO.  Just get an average TV and then buy this Chromecast unit.  Now you have a smart TV at a great price with more potential.", "verified": true, "helpfulness": "0/0", "author": "John T. Veenkant"}, {"rating": 5.0, "review": "excellent!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The device itself is excellent and worth every penny, however Google's support on this device is rediculous. My device gave out after about 6 months of use and when I tried to claim the manufacturer's warranty I was put through a gantlet of pointless questions and tests and then told that they weren't willing honor the warranty because they thought it would be \"unfair\" to replace my broken unit with one that might also break. It was VERY unprofessional and unethical treatment of a customer. So much so that I would suggest caution with your future dealings with this company.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer \"seames\""}]