[{"rating": 5.0, "review": "Love this does exactly what I want", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Worked great for 5 months now I can't get anything to connect to it. I've tried updating all my software on my devices and reset the chromecast and my wifi network. Nothing. I loved it while it worked but I won't be buying another one. Too frustrating.", "verified": true, "helpfulness": "0/0", "author": "Engineer"}, {"rating": 5.0, "review": "We have two, great product!", "verified": true, "helpfulness": "0/0", "author": "KRiS"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Bruno Oliveira Muniz"}, {"rating": 4.0, "review": "A little buggy at times but I think that may be the fault of the Google Cast software running on my PC/Phone/Tablet and not the actual Chromecast's fault. Other than a few hiccups, this thing is awesome. And those hiccups are Netflix not wanting to be casted to my TV every now and then.The thing that sold me on the Chromecast is the ability to mirror Chrome browsing tabs onto my TV. Some websites that have embedded videos are supported as an \"app\" on the Chromecast (like all other \"stick\"-based streaming media players), but the Chromecast allows you to mirror the browser tab and enlarge the video to full screen. The current Google Cast extension for Chrome is very choppy when playing embedded videos, but the beta client is awesome. And now you can project 1080p with the bet client.I like the ability to stream files to the Chromecast using Plex (which is really easy). The only problem is that the Chromecast currently does not support DTS pass-through. I say currently because the Chromecast used to not support AC3 passthrough (and Google said they were not going to support it), and now it does. So I think that if there is enough demand for DTS passthrough (which there should be), then it will be there eventually.I like the fact that I don't need a remote to control this thing. If I have my PC or phone or tablet near me (which I usually do lol), then I have my remote. Much easier to search Netflix on a PC than on some dumbed-down smart TV interface.I think that the Chromecast experience will continue to improve as they release newer Google Cast software, but for now, it works for what I need.", "verified": true, "helpfulness": "0/0", "author": "Reviewy McReviewerson"}, {"rating": 1.0, "review": "Used this to stream from my computer to the tv.  Did not work at all for me.  Very choppy & sound was way off.  Ended up returning this and just got amazon stick to use instead to get more streaming capabilities.", "verified": true, "helpfulness": "0/0", "author": "Chris Waggoner \"waggs\""}, {"rating": 5.0, "review": "Bought this as a gift for my son in law. He has had it for 2 years and uses it everyday.", "verified": true, "helpfulness": "0/0", "author": "Darla Pippin"}, {"rating": 3.0, "review": "Useful but as there isn't a lot of content to Cast over here in Singapore it's a bit of a waste of great hardware.Don't get me wrong though, it's an awesome product!", "verified": true, "helpfulness": "0/0", "author": "Kamal Mututantri"}, {"rating": 5.0, "review": "Great way to watch things from your laptop on tv and still search the web.", "verified": true, "helpfulness": "0/0", "author": "Cuc"}, {"rating": 5.0, "review": "I used to consider myself a fan of Apple. I purchased iPhone's, iPads, iPods, and a retina MacBook Pro. I'm pretty tied up in the Apple ecosystem. I was about to purchase an Apple TV until I realized the Chromecast does everything an Apple TV would but at a fraction of the price (besides the Apple TV being ridiculously outdated and not updated). Sure I might not have AirPlay but I can still cast my Google Chrome tabs to my TV. I'm also seriously considering switching to the Galaxy S5 or Galaxy S6 soon. If I switch to either handset I'll be able to directly cast my screen to my TV. That would definitely come in handy. Anyways, if you're on the fence about purchasing a Chromecast don't be! I only wish I purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Phillip S."}]