[{"rating": 1.0, "review": "I thought I was going to love the Chromecast but it turns out I thought it was useless. Returned and maybe will buy it again if Google makes it better than what it is now.", "verified": true, "helpfulness": "0/3", "author": "scott encke"}, {"rating": 3.0, "review": "I have been searching for a way to display my computer screen on the TV. I thought this was it. Great idea, right? Well, it does what it says it will but trying to watch a TV show or movie is not so good. The picture is jerky. It stops and starts. I've tried everything to try to correct the problem but it is not much better. Pretty labor intensive.I will not be sending it back. I may find a use for it yet.I would recommend this to a friend with a full disclosure of it's limitations.", "verified": true, "helpfulness": "1/1", "author": "rsnooze"}, {"rating": 5.0, "review": "Just got this little gadget and loving it! Easy set up, quickly downloaded and installed software. Love that it also casts the sound! Now I can rid of all these cables going to my tv from my PC.", "verified": true, "helpfulness": "0/0", "author": "sebastian escobar"}, {"rating": 5.0, "review": "The Chromecast thingy seems to work really fine though it didn't like the HDMI Pigtail Switch I bought since my 2004 TV only has 1 HDMI port. It also didn't like streaming video from [...] but that's archive's fault, not the Chromecast. I like it fine for what it does and my adult kids love theirs.", "verified": true, "helpfulness": "1/1", "author": "Joe Wasson \"Joe W\""}, {"rating": 5.0, "review": "Easy to set up. Frame rate is good. would like to get it synced with all video apps.Still trying to figure that out.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 1.0, "review": "This item did not work! The item did not work with my router. Called google to get help to connect to my router and they told me I needed to call my ISP. My ISP said I needed to talk to google. Back and forth like that a couple of times. Wasted hours of time trying to change router settings and the thing never worked. Now it sits in a box because Amazon won't take it back because I waited too long too return it. What a waste!", "verified": true, "helpfulness": "0/0", "author": "Patrick Thomas"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "M. Naidas"}, {"rating": 5.0, "review": "so easy to use. I have Tivo w/access to Netflix but at my mother's house I use Chromecast and got to watch all of House of Cards in one weekend. Such a great device.", "verified": true, "helpfulness": "0/0", "author": "Kmacked12"}, {"rating": 4.0, "review": "I have two Rokus, a Roku LT and a Roku 3. Without any hesitation, the Roku 3 destroys all competition. That being said, this Chromecast is a nice little thing for such a good price. Yes, the Roku 3 is faster, has more apps, better tech specs, a physical remote, and a lot more, but it's 3 times the price of this. If you're looking for a cheap way to get stuff from the internet (and your phone) onto your TV, this is a good little unit. If you really want the good stuff though, don't hesitate another minute and buy a Roku 3.", "verified": true, "helpfulness": "1/1", "author": "scott brown"}, {"rating": 4.0, "review": "+ Streams youtube, netflix seamlessly+ USB charging port that can be connected to tv. Wont need to use the external charger- doesn't play videos from pc/tab/phone- no remote", "verified": true, "helpfulness": "0/0", "author": "Mathan"}]