[{"rating": 1.0, "review": "constantly crashing. Netflix constantly sends me back to the home screen after a few seconds.  Prime videos will tell me they are unavailable to play.  HBO videos work half the time.", "verified": true, "helpfulness": "2/7", "author": "KD \"KevinD\""}, {"rating": 5.0, "review": "Easy to use, lots of features. Great voice command on remote.", "verified": true, "helpfulness": "1/2", "author": "Scott Sala"}, {"rating": 4.0, "review": "exactly what I was looking for.very easy to work.", "verified": true, "helpfulness": "1/3", "author": "Deborah Lagor"}, {"rating": 2.0, "review": "I have a smart t.v. and Amazon Prime.  I found with Amazon Fire TV I cannot go between the two - haven't been able to use the Fire for weeks now - have DISH but not connected to t.v. - just internet.  Any suggestions?  I can only get Amazon Prime - no use for the Fire TV I bought, cannot get it to work.  Tried disconnecting EVERYTHING for an hour, rebooting, trying different stations...................I seem to only be able to use one - always - or the other.  Dissapointed to say the least.  I get no \"regular stations\".", "verified": true, "helpfulness": "0/4", "author": "jewelrycats"}, {"rating": 5.0, "review": "One of the best purchases I have made at Amazon.COM!  No kidding I love it and I am a \"die hard Apple fan\".", "verified": true, "helpfulness": "0/1", "author": "Ed - The Moneyman \"Retired Stockbroker and Investment Adviser\""}, {"rating": 5.0, "review": "This is an excellent media streaming device. I will be buying a second one.", "verified": true, "helpfulness": "0/1", "author": "miles"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "BEN SOTO"}, {"rating": 5.0, "review": "Wonderful!  I love this.  We use it all the time.  Love the voice search feature.  My husband loves that he can watch his youtube videos on the TV.", "verified": true, "helpfulness": "0/1", "author": "Carla A Chase Pearsey"}, {"rating": 3.0, "review": "Not quite ready for prime time.  Lots of stopping in mid-broadcast to watch a spinning circle.  Very cool toy, but needs software updates to make it right.", "verified": true, "helpfulness": "1/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "works way beyond expectation", "verified": true, "helpfulness": "1/2", "author": "dr mark deloreane"}]