[{"rating": 4.0, "review": "Awesome product but looking for compatibility with Dropbox.  Works very well with Netflix and other apps like HBO go. Jeah", "verified": true, "helpfulness": "0/0", "author": "Jmanh12"}, {"rating": 5.0, "review": "This one of the best purchases I have made.  I love that I can stream shows from my iphone and laptop instantly.  My only regret is not buying this sooner!", "verified": true, "helpfulness": "0/0", "author": "Michael Cook"}, {"rating": 3.0, "review": "I purchased two Chromecasts for Christmas for each of my daughters.  This is a mixed review.  The Chromecast would set up for one, but not the other initially. It was very disappointing on Christmas Day to have one child to view whatever she wanted from her HP computer, but the other who has a Chromebook to not have the same experience. My oldest daughter uses her Chromecast daily and swears it's one of the best things she received for Christmas.  My youngest daughter doesn't use hers as much, even though I was able to fix it eventually and thinks it's a hassle at times. They do not have the same manufacturer for the televisions, so I chalked it up to one having a Samsung, more compatible  versus the other having a unfamiliar name, maybe less compatible.  I own a smart tv in my bedroom and was thinking of purchasing another Chromecast for the family room tv (Samsung) so I wouldn't have to purchase another smart tv, but I think I'll wait.  Perhaps Google has not worked out all the bugs on this device. I think the concept is forward thinking, but it's still quite buggy.", "verified": true, "helpfulness": "0/0", "author": "Natasha Romanoff"}, {"rating": 5.0, "review": "Love them ordered one for each TV. PLEX w/ chromecast is amazing, the ability to stream anything to the TV is great!", "verified": true, "helpfulness": "0/0", "author": "kspahr"}, {"rating": 5.0, "review": "I wasn't able to get it to work. I am pretty ignorant when it comes to electronics. Maybe I can find someone to help me.", "verified": true, "helpfulness": "0/0", "author": "laurie shea"}, {"rating": 5.0, "review": "I love this device! We purchased another one to use in our home for the simplicity of the set up and the mobility of the device. you could take it anywhere with you. the only limitation are the amount of apps allowing you to view with the chromcast but i anticipate more apps being able to view with this device as popularity grows. I personally use it for Netflix and Youtube the most. So easy to use. What an amazing value!", "verified": true, "helpfulness": "0/0", "author": "Dylan Rothman"}, {"rating": 1.0, "review": "I was so excited to get this for Christmas. Since that time, approximately three months, I've been able to get it to work correctly maybe two or three times. The set-up was a nightmare. The device has connectivity issues, will often just stop working for no reason, and is - essentially - pretty worthless. There is no reason it should have these issues as the TV I am using it on is within range of our router, the router itself is an AC dual band, and I can get every other device in the house to both connect to the routre and play movies, all without dropping the signal or timing out. But not Chromecast. It rarely even stays connected to my phone - which is a Samsung Galaxy Mega - and there is no reason for that at all. My advice? Save your pennies and get something else.", "verified": true, "helpfulness": "3/3", "author": "T. Dupuis \"mrq_laurellen\""}, {"rating": 5.0, "review": "Finally, I found something that can easily play YouTube on my TV.The set up is very simple and took me less than 10 mins.I am using my ipad mini as the remoter and it works very well so far.I just love this product and it makes my life more wonderful.Thanks, Google!", "verified": true, "helpfulness": "0/0", "author": "JaneMMMMMM"}, {"rating": 4.0, "review": "It works great for things that it has apps for.  Stuff like netflix, hulu, pandora, etc...  It doesn't drain the battery on my mobile device at all.  My phone pretty much becomes like a remote control.  Simple to use and it can continue running in the background while I do other things on my phone.When mirroring a Chrome browser, it lags a bit.  Watching video while mirroring Chrome from a pc is a resource hog as well and isn't even worth trying to do using my older laptop (5 years old).  There is no mirror mode on mobile.  So, if a video doesn't play on netflix, hulu, etc, you can't stream it to Chromecast.  I hear rumors that Google is working on getting this function put onto mobile Chrome.  They Have a Beta Chrome out for mobile, but it doesn't work well and only streams a few videos, if any.", "verified": true, "helpfulness": "0/0", "author": "Anthony Bachmeier"}, {"rating": 5.0, "review": "My husband and I don't have cable, we have this!  This makes the remote your phone or tablet.  Easy to install, easy to use and easy access to entertainment by everyone with a phone.  My husband and I love this!  It's a great price for streaming and makes finding the remote as easy as finding your phone.", "verified": true, "helpfulness": "0/0", "author": "Beth"}]