[{"rating": 5.0, "review": "Very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Linda M. Parsons"}, {"rating": 5.0, "review": "Love this streaming box, you have Prime, Netflix, HBOGo, SHO, MLB and more, the only drawback, is non usable USB port and memory fills up too quickly.", "verified": true, "helpfulness": "0/0", "author": "JPH"}, {"rating": 5.0, "review": "Best way to stream movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "A good product.  But I have both the Fire TV and apple TV.  Apple TV is a much better product.", "verified": true, "helpfulness": "0/0", "author": "Douglas Sanderson"}, {"rating": 4.0, "review": "Our second Fire TV box and it works as good as the first PLUS this was refurbished which saved 20 dollars.. How can you go wrong?!", "verified": true, "helpfulness": "0/0", "author": "Jimmy S."}, {"rating": 3.0, "review": "2 Comments:1) I find that it did not, nor does it, capture my wireless network well. My wireless network access point is not very close, in fact pretty far. But other devices have no problem. The Fire TV does. It must re-find the network each time I go to it, as it turns itself off after a few minutes, and then I must re-enter the Security Key for the network to log in. It's a pain.2) I find that the movies, shows and other  non-Amazon created content is pretty much the same as on my cable network and/or Netflix. There are a few Amazon only shows but the content has got to grow to make it worth staying with Fire TV; especially if you have to re-boot it each time. It needs more content diversity.", "verified": true, "helpfulness": "0/0", "author": "Joseph Goldberg"}, {"rating": 3.0, "review": "I have prime, two kindles and love everything amazon, but I can't help feeling lied to. The main feature that stole me away from my Roku was the ability to have my kids play their favorite kindle games on the big screen. I even got an expensive controller for it. You can play a few cool games on it. Jackbox is the only reason this gets 3 stars. You won't be playing good games on this. You also won't play many games. You get right at 3gb of memory, just enough that if you instal their knights of the old republic, that they push, you can't watch video anymore. Also negative is the voice search is only for amazon video. You want to watch free Daniel tiger on pbs app, you're out of luck. At least roku search gave me all of a title and sorted where I could watch free. The last thing that makes me want to send this back is the layout. It's so geared towards making money that I have to really navigate to get to Netflix or hulu. All in all wait to buy until they release one with some memory or side loading apps from the usb.", "verified": true, "helpfulness": "0/0", "author": "OkieFuzz \"romans6twentythree\""}, {"rating": 4.0, "review": "its great except I cannot seem to get any youtube app to work on it. I may have to switch to my 3 year old blue ray player that has the youtube app.", "verified": true, "helpfulness": "0/0", "author": "Bob Magnusson"}, {"rating": 5.0, "review": "Easy hook-up to TV (HDMI) and home network. Does what it is supposed to do. Wish there was more free content on Amazon, but we also have Netflix so are happy", "verified": true, "helpfulness": "0/0", "author": "Savageone"}, {"rating": 5.0, "review": "Love it! So easy to use......I only wish that there were better movie options for Amazon Prime members. Kind of sorry choices! But that has nothing to do with Fire TV other than that's really the only thing you would use it for. It would be super awesome if movies were less expensive to rent, then I would choose Fire TV over my cable On-Demand function, every day of the week. The voice selection option is ridiculous....as in good.", "verified": true, "helpfulness": "0/0", "author": "Neatha"}]