[{"rating": 2.0, "review": "I was disappointed that there's a charge for \"My little Pony\" cartoons!ALSO for episodes of 2&1/2 Men!dMost of the movies have a charge and for re-runs of old programs?I know Amazon is a for profit place but  give me a monthly for unlimited use?", "verified": true, "helpfulness": "0/1", "author": "Bill Chapman"}, {"rating": 3.0, "review": "STILL FIGURING OUT HOW TO WORK IT.  VOICE FEATURE HAS A LITLE TROUBLE UNDERSTANDING ME.", "verified": true, "helpfulness": "0/0", "author": "Hannah S"}, {"rating": 5.0, "review": "I had a fire tv stick on order, and I bought a fire tv just to fill in until it arrived (sorry, but return policies are meant to be used). However, I now own both and I'm not returning the Fire TV. The combo of PLEX, Netflix, Sling TV, and Twitch TV means there is nothing I can't stream or watch that isn't available on my TV. This is the ultimate media provider to your TV.", "verified": true, "helpfulness": "0/0", "author": "Bazerka"}, {"rating": 5.0, "review": "Blows away my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 5.0, "review": "LOVE IT! Best purchase I've made in awhile.", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 5.0, "review": "I love it, have me a free month of Amazon Prime. My mother bought it for me and my wife and we both are happy", "verified": true, "helpfulness": "0/0", "author": "Rayshawn Collins"}, {"rating": 5.0, "review": "Awesome machine!", "verified": true, "helpfulness": "0/0", "author": "KM Store"}, {"rating": 5.0, "review": "so far so good. Its fast than the fire stick i owned.The apps are limited but seems the app store is growing.The voice command in the remote is not useful for me because it would only search amazon content. Atleast should be extended to youtube voice search.i have sling app installed and pretty much using it for regular TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Tan\""}, {"rating": 5.0, "review": "Already have a kindle fire tablet to go with this and I love it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to set up, works well, good GUI,  no complaints, works and easy to navigate", "verified": true, "helpfulness": "0/0", "author": "Dr Cisneros \"drjac\""}]