[{"rating": 5.0, "review": "Excellente product", "verified": true, "helpfulness": "0/0", "author": "Dervin Vargas"}, {"rating": 5.0, "review": "Why Amazon Prime won't get us a Amazon prime chromecast ready app soon? Netflix does, why not you while you are selling the chromecast device yourself. Let us share movies that you got on prime movie with others on TV when we are away from our homes easily using a chromecast. Okay?", "verified": false, "helpfulness": "0/1", "author": "Jean Butso"}, {"rating": 4.0, "review": "Convenient but still 'stutters' on most movies", "verified": true, "helpfulness": "0/0", "author": "John - Fresno"}, {"rating": 5.0, "review": "Best thing ever. Works perfectly with android. However it's a little bit slow with Apple system.", "verified": true, "helpfulness": "0/0", "author": "camila padilla levy"}, {"rating": 3.0, "review": "I had difficulties connecting to my wifi and had intermittent connection to my phone and it was slow when it worked for the first half an hour before it died. I think it may have had overheating problems. I assumed at first it was just slow because of using a budget processor but after it died I can only imagine that I got a bad unit (hopefully).Afterwards I returned it with no issues and bought a more expensive roku 3 and that works flawlessly, but it is MUCH more expensive at $100 vs the $35 I think I paid for the chromecast. In my opinion its probably worth it to go with one of the more expensive box top sets like the roku 3, amazon fire tv, nexus player, or something similar with a more powerful processor that just works better.", "verified": true, "helpfulness": "0/1", "author": "Brian"}, {"rating": 4.0, "review": "I love it, but I had some problems with the network performance!", "verified": true, "helpfulness": "0/0", "author": "LuiX"}, {"rating": 3.0, "review": "It needs to support more video formats", "verified": true, "helpfulness": "0/0", "author": "Henry A. Miller"}, {"rating": 4.0, "review": "I got it mainly to watch netflex, but now dish has come out to where I don't need it", "verified": true, "helpfulness": "0/0", "author": "Mark Koewler"}, {"rating": 5.0, "review": "Great for casting from devices.", "verified": true, "helpfulness": "0/1", "author": "joseph bristol"}, {"rating": 2.0, "review": "Thought it would be great for watching movies off our phone. Completely opposite, can't even stay connected for half or sometimes a quarter of the movie! !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]