[{"rating": 5.0, "review": "If you own a android device and an HD TV, you will not find a better value.This simple little dongle allows you to \"cast\" full 1080p video from your android device (or windows chrome browser) to your HDTV.I have owned one since the week they came out. It's support has gotten better and better. This is a product that has and will see strong support from the development committee. The SDK isn't even completed and it already has support from Netflix, Pandora, Google Play, YouTube, and now HBO Go to name a few. This product can only get better!", "verified": false, "helpfulness": "0/0", "author": "Tim"}, {"rating": 4.0, "review": "i really like the price and that it's easy to plug in.  It works really well with my wireless system.  I wish Google would provide easy-to-understand instructions for all the ways it can be used though, for people like me that are older and not tech oriented.", "verified": true, "helpfulness": "0/0", "author": "jw4unity"}, {"rating": 5.0, "review": "Good for the price. Only thing as of now - casting chrome is not avalible via iPhone iPad . Also - wish it can support more apps", "verified": true, "helpfulness": "0/0", "author": "Divya Agrawal"}, {"rating": 1.0, "review": "Gave it one star because there was no 0 star choice. Look, this evening had an aggravating portion because Google is not an honest company. Period. In addition to being purveyors and supporters of child pornography ... until, um, last week ... due to their support  .... I digress.The Chromecast was purchased for me as a gift. The buyer bought it based on the FALSE ADVERTISING CAMPAIGN -- that shows easy, 'one click' from tablet/computer to TV screen.Problem -- there is no Chrome browser 'tab' to 'cast' from -- the extension is \"not supported at this time\" as per ... Google. So you can play Netflix, sure. Youtube. Whee! But the buyers that are sold an expectation that they can see their screen on a TV are sadly ripped off.Soo... luckily this useless P.O.S. was purchased from Best Buy so it can be returned with a little, er, urging at the customer service desk. Nothing new there either. And anyone with an HDMI out on a notebook can watch ANYTHING from their browser on TV without this limited little gadget. So bye, and really, be warned before parting with any more $$ to Google anything -- did I mention my company's early experience with Google advertising ... aka vacuuming our money away on false clicks ...?", "verified": false, "helpfulness": "4/11", "author": "Experienced Hell \"Experienced Hell\""}, {"rating": 5.0, "review": "Works great with a nexus 7 tablet....lots of more features in the netflix app...this seems to be google's best kept secret. It would be nice if they started opening up the development on this peace of hardware. Would love to have more options and start taking advantage of it more :)", "verified": true, "helpfulness": "0/0", "author": "MG"}, {"rating": 5.0, "review": "I had a good idea of what I was getting into so I was delighted to get my Chromecast.  Since having an iPad and already being aware of how many videos have mobile-access limits, I understood how Chromecast works.  It allows you to \"cast\" (as-in casting a net in a pond to catch fish) and \"reel-in\" content from your mobile device (with it's already known video access limits) as well as allowing you to \"cast\" from your PC or in my case my Mac.Since you first log into the Chromecast device as if it were a wifi hotspot, then log back into your normal wifi Internet, the device itself ends up accessing Internet on its own after its fully installed.  Chromecast will then stream content direct from the Internet and not your device or computer, although it requires your mobile device to be actively engage on the wifi network as a persistent authentication is required to maintain streaming capabilities.  If you have photos and videos on your mobile device (cell or tablet) they may or may not be \"cast-able\".  The best option for you is to use a cloud to store your pics (Picasa) and videos (ex. YouTube must be set to \"Public\") and share them via apps that work with Chromecast.You can also use Google Chrome browser, add the Chromecast extension and be able to \"cast\" or transmit if you prefer everything from your computer, except of course audio which must be output by your computer's audio port.  What I love most is how portable it is, basically the size a thumb drive and you can take it anywhere you have an HDTV and want to bring your Netflix, HBO Go or other supported content.  Since Google still owns Google TV and Widevine's technology, I'm sure they'll be more to come soon I'm sure!", "verified": true, "helpfulness": "0/0", "author": "E. Caballero"}, {"rating": 4.0, "review": "normally good. once it streams I don't think you can pause it, rewind, etc.  It seems to play anything that has video embedded.", "verified": true, "helpfulness": "0/0", "author": "Asif Kumandan"}, {"rating": 5.0, "review": "Amazing and easy to use for what it does. A really helpful little gadget that allows for really great for watching vids on the big screen if you don't have one already that does this.", "verified": true, "helpfulness": "0/0", "author": "Allen W."}, {"rating": 2.0, "review": "I ordered the Chromecast on 7/26/13 when I first heard of it. I finally received it on 9/12/13. I have been using it since and my overall impression is that it is a great idea but needs further development to truly live up to its potential.Pros:Set up is very easy. Connected to my wifi network and we were off & running.Works really well with Netflix & YouTube. Since it is streaming the content itself, you can use your phone/tablet to do something else.It works with my Samsung S3, wife's iPhone 5S and LG G-Slate tablet running Gingerbread.Cons:The biggest issue that we had is the inability to quickly access control of what's playing. In the Netflix app, we would start watching. If I need to get up & want to pause Netflix, have to unlock the phone to see the app. You then have to wait for the app to reconnect to Chromecast and have the blue \"Now Playing\" bar to show up, then click on it, THEN pause. This happens with both the iPhone & Samsung S3. It could take anywhere from 10 to 30 seconds before you could actually pause the show, which seems like an eternity. Surprisingly, the old LG G-Slate was the easiest as the lock screen itself displayed a still of what was playing with a pause icon in the middle.What's worse is that in the last month, the above problem has reached the point that now, once the mobile phone has gone into standby mode, when you go back, the Netflix app will no longer show the small Chromecast square at all. The only option is to completely close the app & restart. Even then, it may or may not work. Again, this happens on both phones and now even the tablet. This resulted in us going back to using the Wii for Netflix and look for other solutions.The YouTube streaming worked better than Netflix but also degraded as time went on. Now, 3 out 4 times if you went back to the phone, the app no longer displayed the Chromecast square symbol & the app had to be shutdown & restarted.The mirroring of Chrome did not work as well as I was hoping it would. Video for which there is no Chromecast-compatible app (such as Hulu) suffered from severe lag & was unwatchable. This occurred from both my Dell Win7 Laptop & my wife's MacBook. Pictures worked ok but with a 1-5 second delay between doing something on browser and seeing the result on the TV. Watching videos stored locally thru Chrome was a little better then streaming but would have 30-45 second pauses every 4-5 minutes of video. Displaying static sites worked fine except for the lag in what you did on the computer showing up on the TV, such as scrolling. In all cases, the wi-fi network in the home is strong, with a current router, no cordless phones etc.Conclusion: I was incredibly excited when I originally read about Chromecast. In my experience, it did not provide the type of experience that I was hoping for. The development of more compatible apps has been disappointing but the worst aspect of it is the degraded performance over time which pretty much has made the device unusable for our household. We are once again thinking of possibly getting a Roku box or getting the PS4, now that the kids are 9 & 7. The Chromecast will be sitting in the garage & I will bring it out again once it seems Google has developed it further.", "verified": true, "helpfulness": "5/6", "author": "TR from WA"}, {"rating": 5.0, "review": "I have been looking at the Chromecast and when i saw it on sale at Best Buy it was an easy decision. It is so easy to use! I used to only be able to watch Netflix on one TV,  now it's easy to watch in any room. And I love being able to watch YouTube videos on my TV. It's worth it just for Netflix,  but I can't wait to see what is added next to this great little device.", "verified": false, "helpfulness": "0/0", "author": "Sheryl A. Esau \"Sherylcat\""}]