[{"rating": 1.0, "review": "I got this things yesterday and I'm in the process of returning it. This thing has absolutely no redeeming value. It's called Chromecast but try streaming something, anything from Chrome, it doesn't work. The thing supposedly works with four apps, four. I'm extremely disappointed and would gladly give it zero star if that was an available option because it isn't worth even the measly $35.00 I paid for it.", "verified": true, "helpfulness": "0/6", "author": "Cinco"}, {"rating": 5.0, "review": "Very easy to use and set up. Sick low profile design, works great with android and iOS. Easy 1 button integration with YouTube and Netflix apps.", "verified": true, "helpfulness": "1/1", "author": "Alexander Krahn"}, {"rating": 5.0, "review": "This is so much faster than watching Netflix through our Blu-Ray player.  The interface through our Blu-ray is slow and cumbersome, but with Chromecast the interface is the one you're used to on your phone or tablet, so scrolling thru selections is a breeze.  My 5-year-old mastered using it within a day.", "verified": true, "helpfulness": "0/0", "author": "Danielle Shields"}, {"rating": 3.0, "review": "This product is very limited in what it does (Netflix, YouTube, & Google Play movies), but what it does, it does well, and for $35, it's well worth it. I was using a Wii to access Netflix; the picture quality was bad, and it kept freezing up. The Chromecast was relatively easy to install and setup (see below) and the picture quality is 1000X better than the Wii. We watched 3 hours straight on Netflix and didn't have a single problem.Potential negatives:1) The Chromecast apparently requires some high ephemeral ports to be opened in order to function properly. This is only an issue if you are placing it behind a firewall or router that has been configured securely. If you are setting it up on your ISP's wifi router, it should work just fine. (Let that sink in for a moment...)  This may be an issue at some hotels if you plan to take your Chromecast with you when you travel, as it may simply not work with their network configuration.2) You may want to consider buying a cheap tablet to use as a dedicated remote control for it. Some major cable TV providers offer an app to use your smart device as a remote, so a dedicated tablet could serve as a single remote for both.3) I really wish Chromecast supported more stuff. It would be nice to be able to go to PBS.org, for example, and cast that to the device for remote playing. Perhaps in time they will add more application support.Edit: After some time, the Chromecast became annoyingly unreliable. We started having problems with it losing connectivity with the tablet we bought to control it. The only way to recover was to do a full power reset on all devices. We have since switched to using a Sony Blueray player with Internet features built in. It is highly reliable. Not sure why it worked well at first and then got worse. Reduced rating from 4 stars to 3.", "verified": true, "helpfulness": "0/0", "author": "CyberChick"}, {"rating": 5.0, "review": "What else is there to say? It took forever to get to me, because it was sold out. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Ayhson Shafiq"}, {"rating": 1.0, "review": "Requiring me to reboot my PC to setup a TV box is not ideal. Neither is the super-short length of the power cord. I'll have to find an extension cable to turn this thing on.", "verified": true, "helpfulness": "1/7", "author": "Brandon L. G. Windham \"compugod\""}, {"rating": 5.0, "review": "Pros:1. Relatively inexpensive ($35) compared to other options (Roku, Apple TV,...)2. Easy to setup (takes only 5 min)3. Can control using multiple devices (smartphone, PC, tablet) on multiple platforms (iOS, Android, Windows)4. Can stream anything on the Chrome browser (duplicating what's on screen)5. Can cue up multiple play items6. Doesn't consume battery on the smartphone (initiate streaming and move on to do other things or even put the phone in suspension mode7. 3rd party apps will continue to make this device more useful and will eventually allow streaming of anything on the PC or phone to the TV8. Tiny footprint that can easily hide away in the back of TV (if the TV has a USB port, then the device can be powered by a USB cable without a power supply connected to the wall outlet)9. Can connect it to an audio device/receiver and stream Spotify or Pandora continuously without turning on the TV- this is a very good feature!10. No additional service fee or subscription fee other than services that you choose to pay for (such as Netflix or Google Play)Cons:1. Doesn't support any local storage media directly (you can connect the storage media to your PC/laptop or smartphone and stream from there if necessary, though)2. No remote controller (you can use your PC/smartphone as a remote, though)3. ... can't think of any more cons!", "verified": true, "helpfulness": "1/225", "author": "ArborRes"}, {"rating": 5.0, "review": "Easy configuration, nice quality, good app.  It streams You Tube very well.  I wish that it supported Gallery images and videos.  I bought it expecting that it would.", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 1.0, "review": "I was unable after many attempts to set up the Chromecast I purchased so never was able to use it.  I tried with two different wireless networks and an iPhone and iPad.  The error messages conveyed no information about the problem(s) or how to fix.  I returned the unit to Amazon.", "verified": true, "helpfulness": "0/1", "author": "R. Magnuson"}, {"rating": 5.0, "review": "Works wonderfully.  Plug in and the device sets itself up.  Just need to download the apps for your PC/phone and you are ready to go.Been re-watching my Prison Break series off NEtflix on my Kindle Fire, it was nice to project it to my 60\" screen with perfect picture quality and no lagging time at all.  Used my phone/kindle as the remote to pause or change episode.Then i was happy that i could play my movies i have stored on my external harddrive on my network.  Just click and drag your file to a chrome browser and tell it to broadcast on your chrome thingy and works wonderfully.This will be great for when i travel and want to watch a movie as long as the hotel i stay at has free wi-fi lol.For $35 its a smart investment", "verified": true, "helpfulness": "0/0", "author": "Lisa"}]