[{"rating": 2.0, "review": "Bought this to try it out.  It would be great if you could stream local network content and have more sources for content.  However, until Google takes off the ridiculous restrictions, spend another $40 and get a WD Live, Roku or Apple Tv, all of which have a ton more options for content.  Also, it would be nice if this worked on 5GHz networks.  Currently, only works on 2.4GHz networks.  This product has so much potential if Google will get out of the way.", "verified": true, "helpfulness": "3/7", "author": "M. Scott"}, {"rating": 4.0, "review": "Items are working well it does not have any defects. Google chromecast works like charm though I find it a bit limiting like instead of 1080p it downscales it to 720p but overall it was great.", "verified": true, "helpfulness": "1/1", "author": "Caleb"}, {"rating": 5.0, "review": "I ordered a Chromecast the day it came out, and have since bought several for family/friends. It is a great device, really inexpensive, and makes streaming things to a TV extremely convenient and easy. I mostly use it for Netflix, but have also been using Pandora and Google Play Music a lot. It will only get better with more apps being integrated. If you have a smartphone you will love this. Get it. Get it now.", "verified": true, "helpfulness": "1/3", "author": "Peter"}, {"rating": 5.0, "review": "If you're simply looking for a way to watch Netflix or Youtube, or (with the new update) access streaming content from other services, this is certainly not the only way to go. I was more intrigued with the prospect of being able to cast web videos from a tab in my Chrome browser, and since I have a strong wifi signal, the Chromecast does that job quite well. (For pausing and playing the tab cast without going back and forth between my computer and tv, I use the free Hippo Remote app.)Even downloaded videos can be mirrored to my tv, as long as they will play in Chrome's browser. But with the addition of some new app compatibility, Chromecast really shines now for watching local content. (I'm using Realplayer Cloud; it's a free app, doesn't require a paid subscription, and is available for both iOS and Android users. I can watch my pc videos on my phone, or using Chromecast, either stream them to my tv, or stream saved videos from my phone to the tv. This is also a nice wireless, iTunes-free way to transfer content. I could wish for more precise video controls in the app, though.)I did have a problem with Chromecast periodically bumping my phone off our home wifi signal. (Apparently wifi interference is not uncommon.) After reading suggestions by others, I \"forgot\" the Chromecast wifi network on my phone and deleted the setup app, but the only thing that really worked was unplugging the power cord from the Chromecast unit between uses; pretty inconvenient. It finally occurred to me that plugging it into the tv's usb port instead of an electrical outlet would accomplish the same thing, because then the unit would only power up when the tv was turned on. So far so good!Some of the Chromecast's functionality may be duplicated by my Tivo and my Blu-ray player, but it fills the gap for watching free web videos, and I like using my phone to play local content. Your mileage may vary.", "verified": false, "helpfulness": "1/2", "author": "Retro Reader"}, {"rating": 5.0, "review": "Wonderful device. Once Google releases the SDK this little device will be incredible. I expect the Chromecast to be one of the devices that ends traditional subscription cable services as we know it.", "verified": true, "helpfulness": "0/1", "author": "Chase"}, {"rating": 2.0, "review": "Supported software is so limited as to be crippling. Basically, the chromecast is only useful for watching youtube videos. That leaves it as a pretty specialized bit of hardware. Perhaps they will open the API back up so we can stream other content", "verified": true, "helpfulness": "2/7", "author": "Harry Pottash"}, {"rating": 2.0, "review": "Only works with certain programs, not everything on the screen. Manage your expectations so you won't be upset with your purchase.", "verified": true, "helpfulness": "2/5", "author": "AtlantaGA"}, {"rating": 4.0, "review": "Sure there are a couple of bugs to work out still. Remember that this product is only a few months old and that new app functionality for Hulu+, Plex, etc have just recently been added and most Developers work quickly to fix major bugs.A few weeks ago, many new apps were added. SO DON'T LISTEN TO THE REVIEWS SAYING IT ONLY HAS YOUTUBE & NETFLIX. The list of supported apps is here: [...]With that in mind, I find it to work really well, particularly with Plex & Hulu. Very smooth as long as your internet connection is strong and of decent speed, as with any streaming device. Using it on my iPad & iPhone as well as Chrome browser is easy. Set up was easy. Casting is easy. Click the cast button and there it is. In addition, it's a really great tool for work. Presentations can be cast directly from Chrome. I just drag the .pdf into Chrome and cast. Fantastic.The small size makes this a MUCH better option for traveling vs my Roku or ATV. My NAS + Plex + Chromecast = LoveFor my needs & uses, with the addition of HBOGo, Plex & Hulu+,  I've been able to check off all the boxes and will likely sell my Roku now.", "verified": false, "helpfulness": "2/3", "author": "BRKLYN"}, {"rating": 3.0, "review": "While just about every major cable company has relented in allowing its subscribers to watch HBO GO on their Rokus, Comcast has held firm in its prohibition (they only allow HBO GO on Apple TV and Xbox 360).Because it's your tablet, phone or computer that's actually doing the streaming, there's no way for Comcast to prevent you from using a Chromecast to enjoy HBO GO on your TV. So suck it, Comcast!Generally speaking, Chromecast doesn't do anything that my Roku or Blu-ray player (which streams) can do. Picture quality is as good, but no better. If plugged into an A/V receiver it will stream surround sound audio. While a flood of new apps were recently added, it still doesn't support Amazon Prime or MLB.tv.And despite being pretty cheap, the Roku base model isn't much more expensive and offers far more content.Casting from Chrome browser tabs is pretty poor. Not only are most video formats not supported, but even for surfing the web there's a pretty big lag time between what you see on your computer screen and TV.I imagine that Google will eventually provide casting capability to all of its computer, smartphone and tablet apps, allowing its ecosystem to be available on your TV, but until then, you're better off with a Roku (unless you're a Comcast subscriber who wants HBO GO on your TV).", "verified": true, "helpfulness": "1/1", "author": "R.D. Monsoon"}, {"rating": 5.0, "review": "Finally some new apps out. Never have a problem with the device itself. I just get so frustrated with the netflix app.", "verified": true, "helpfulness": "0/2", "author": "thegreyspot"}]