[{"rating": 5.0, "review": "Love how easy it is to work and control things.  Need amazon to add more movies.", "verified": true, "helpfulness": "0/0", "author": "rallyon"}, {"rating": 5.0, "review": "We love Amazon Fire TV. Works great with our home theater setup. HD video and audio quality is great!Amazon Prime provides a lot of options for free viewing. Also, it provides current TV episodes as soon as aired for a small cost.  This also allows you to use other streaming services, like Netflix, if you are a subscriber.", "verified": true, "helpfulness": "0/0", "author": "Cyndi Crews"}, {"rating": 4.0, "review": "easy to use, Prime has greatly improved since I signed up last year.  Seems like the screensaver and auto off works when in Amazon Prime application, but it doesn't appear to work when in other things (like Netflix).  I fell asleep watching a movie on Netflix and in the morning the Netflix home page was still on my glowing TV.  Luckily, it wasn't long enough to burn into the screen, but beware.  Otherwise a very good investment.  I intend on buying a second one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "OFW"}, {"rating": 2.0, "review": "The only thing we seem to use this for is cartoons for our son. We are unable to see newer release movies without paying 15 bucks for them. Other movies seem to be 10 years old and not highly rated. Also, some of the shows we were hoping to see, we have to subscribe to the channels thru cable to watch when we want (Directv isn't supported or they don't support Amazon Fire....which ever way ,we can't see shows on showtime, HBO, etc). We had thought we would want one in every room, but just the one TV is fine.", "verified": true, "helpfulness": "1/1", "author": "Luckybee13"}, {"rating": 5.0, "review": "So awesome !! So far I've loved my fire tv. Simple and plenty of options to choose from. I just wish it had a complete shut off feature. I put it to sleep but I still feel like it's on completely.", "verified": true, "helpfulness": "0/0", "author": "steven cante"}, {"rating": 5.0, "review": "Love this!!  Definitely so much easier to play movies instead of hooking up my laptop.  Yipee....LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 3.0, "review": "Have to reset it a lot or Netflix is glitchy", "verified": true, "helpfulness": "0/0", "author": "nothinnicetho"}, {"rating": 5.0, "review": "My husband and I are so thrilled with this item! We are finally able to watch old movies we haven't seen in a long time and movies we never saw before, for free, without commercial interruption or paying for it.  Being a prime member certainly has it's advantages!  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Beyrer"}, {"rating": 5.0, "review": "I have truly enjoyed my Amazon Fire TV.  It is simple to use right out of the box.  There is a tutorial video that you can play.  It is helpful to watch, and doesn't take much time.  The Amazon Fire TV is very responsive.  The apps load quickly due to the quick processors.  The voice search is unbelievably accurate.", "verified": true, "helpfulness": "0/0", "author": "Gary Reynolds"}, {"rating": 3.0, "review": "I don't like the idea of having to pay for so many movies and shows even with having prime membership", "verified": true, "helpfulness": "0/0", "author": "nicole"}]