[{"rating": 3.0, "review": "I love this thing so much more than the Roku I owned previously... but this thing still has some room for VERY simple improvements.While voice search it great, it only works with Amazon movies - really wish it would work with other services, since I rarely use Amazon to watch movies/TV (mostly Netflix and YouTube here).My main concern: The only way to restart the box is by unplugging the unit. This is *incredibly* frustrating, considering it loses connection about once every 20-30 minutes in my apartment, and cannot reconnect, no matter how many times I push \"Try again\" (to reconnect) - but as soon as I unplug it and replug it in, it works perfectly fine. If this happened once a month - or even once a week, it would be one thing, but I have to unplug this thing at least once or twice each hour I am using it. Amazon, PLEASE devote a button on the remote to be a \"reset\" button when held for 5-10 seconds (I would have thought the Home button would have done this - but according to the manual, the only way to restart is by unplugging it manually).", "verified": true, "helpfulness": "1/1", "author": "Parks"}, {"rating": 5.0, "review": "This is the streaming device I've been waiting for.  The voice search is incredible.", "verified": true, "helpfulness": "0/0", "author": "David Fenton"}, {"rating": 5.0, "review": "easy, easy, easy!! From set up to watching netflix, could not have been clearer instructions. Downsized my satellite, so much on Fire TV. Love it, bought one for my neighbor as a gift", "verified": true, "helpfulness": "0/0", "author": "truittmom \"Linda A Clinger\""}, {"rating": 5.0, "review": "great tv viewing time and great with netflix", "verified": true, "helpfulness": "0/0", "author": "Randy S. Reiss \"Randy S Reiss\""}, {"rating": 3.0, "review": "Arrived one week late. Difficult to install apps. Great picture. Needs more apps.", "verified": true, "helpfulness": "0/1", "author": "Jimerna"}, {"rating": 3.0, "review": "Fire TV is a great idea, lots of raw power. But it's buggy right now. Some apps (like Plex) are just lazily ported from their android versions. I'm sure apps will be perfected. Keep up the good work, Amazon!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Much, much better than Roku", "verified": true, "helpfulness": "0/0", "author": "Barry Gardner"}, {"rating": 3.0, "review": "Liking it less and less each day.  Most of the apps will not deliver to Fire TV, not compatible.  Amazon needs to get its act together and make the apps available on Fire TV.  I'm a grown-up w/a grown-up life - I DO NOT have time to watch TV on my cell phone all day.  Make the apps available for Fire TV!  The apps that are available for fire tv have bugs that need to be fixed.", "verified": true, "helpfulness": "1/2", "author": "My Way Ranch"}, {"rating": 4.0, "review": "Easy set-up.Fast switching & loading, much faster than the Roku HD box it replaced", "verified": true, "helpfulness": "0/0", "author": "John ChiTown"}, {"rating": 5.0, "review": "East to install and easy to operate.  Love it.", "verified": true, "helpfulness": "0/0", "author": "maxdemax"}]