[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I don't like it. On my computer, I could watch almost anything that is on the Amazon Prime roster, while with the Fire TV I have to pay. I never use this purchase.", "verified": true, "helpfulness": "1/4", "author": "John"}, {"rating": 5.0, "review": "Worked like a charm even with a weak internet signal", "verified": true, "helpfulness": "0/0", "author": "Thomas F."}, {"rating": 5.0, "review": "My Apple TV hasnt been touched since I got this!! With the new updates and Apps..plus the ability to side load apps. Its been an amazing addition.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it, it's fast and has something for everybody it has replacement my computer as my home entertainment center.", "verified": true, "helpfulness": "0/0", "author": "Timothy R."}, {"rating": 5.0, "review": "The device is amazing. It is fast, clear and has lot of options", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up, already hooked up to my Prime account. Quite happy so far.", "verified": true, "helpfulness": "0/0", "author": "Blair Gibb"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Many video or movies I would like to watch are not included with Prime membership. There are also some books that I looked up to download and they also were not available on Prime membership. I know that I can purchase them but if I have to purchase a lot of what I want they why have Prime.  But after all what I said I still am happy that I purchased Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Gary A. Hopper"}, {"rating": 3.0, "review": "The Amazon Fire TV box was easy to set up. Interface is responsive and intuitive. Performance of streaming content (on 15Mbps wireless) hasn't been as good as I had hoped. Amazon content seems to play back the best; other sources, such as PBS / PBS Kids / Pluto, have produced a lot of lag.  Directly connecting to ethernet seems to improve this, so it could be a connection issue -- but Amazon content does seem to be better optimized.Jury is still out on the remote. It has failed to wake up the box from sleep 2x; requiring me to unplug and reconnect to wake it up. Nice that you can also control with the Amazon Fire TV app for Android and iOS (among other Amazon devices).  I'll update this review as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Acoustic T."}]