[{"rating": 5.0, "review": "I like it a lot.  Really enjoy the ability to move it around the house and use with any of the TVs.", "verified": true, "helpfulness": "0/0", "author": "scottz"}, {"rating": 5.0, "review": "Really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "margot"}, {"rating": 4.0, "review": "Wireless has great connection. Start-up is extremely quick. The biggest downfall is that the Voice remote was programmed as a sales tool. Anything that you search for with the voice activated remote either wants you to pay Amazon to watch or purchase from them. Some of the viewings are free if you are an Amazon Prime Member ( More Cost). Very few of the Amazon viewings are absolutely free. Unless you are a Prime Member or what to pay to watch the voice activated remote is a waist. For me it is still a valuable product. The Wireless reception is excellent to the farthest points from my router. Works great for HULU, Netflix and others which is the primary reason I purchased it. I give it four stars instead of five because of the sales pitch voice activated remote. I spent $100.00 to purchase it, I don,t want to pay again each time that I watch something.", "verified": true, "helpfulness": "2/3", "author": "llstrikerll"}, {"rating": 5.0, "review": "Fantastic device! Better than Apple TV (I own 2)", "verified": true, "helpfulness": "0/0", "author": "David Sibilia"}, {"rating": 2.0, "review": "Ill give it the 2 stars because of of its voice recognition technology but it only works for purchasing movies , that's it . Not for regular web browsing or Netflix .", "verified": true, "helpfulness": "1/2", "author": "armando velarde"}, {"rating": 5.0, "review": "Best investment ever! Saved me $100 a month on my cable bill.....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is incredibly fast; very clear pix; no commercials; and easy to use.  The only drawback is the selection of Amazon-Prime shows that can be watched at no extra charge.  Why can I watch a current TV show, when I cannot watch a 25 year old movie on \"Prime\"?", "verified": true, "helpfulness": "1/1", "author": "Gordon"}, {"rating": 4.0, "review": "It is pretty nice to have all the apps in one place, the remote could use a little work though.  the big round circle is a little hard to use to navigate to the right.  If you don't hit in just the right place, you'll hit the inner button which will take you back one screen.  I also was under the impression from the advertisements that the voice search would search across all apps, but it's only for the amazon choices, so that was a bit of a letdown as well.", "verified": true, "helpfulness": "1/2", "author": "M. Keeth"}, {"rating": 2.0, "review": "By the time it and the Kindle HDX downloaded everthing they needed to operate my data plan was decimated. I increased data plan and tried streaming movies from Amazon and Netflix suffering lots of lag, buffering, and more data decimation. I have gone back to my PS2 and only wish to return and forget Amazon Fire.", "verified": true, "helpfulness": "1/1", "author": "birdman"}, {"rating": 5.0, "review": "Best invention since atari. Love it, not a hardcore gamer, tv fan or any of that. Fire tv is perfect for the casual user that does not watch enough tv to justify $50.00 a month for 500 shopping channels on dish or cable. I get prime for $99. a yr. and netflix for a little more than that. Tv antenna gets me a few local channels to watch news & stuff. I don't like to waste money on stuff I will never use, but this will be in my living room for a long time. :)", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]