[{"rating": 1.0, "review": "I bought this item to stream videos from my laptop and it was easy to set up.  I do not know about others, but mine heat up quickly (less than 15 minutes) then it disconnect. I did not explore its full potential because of this.", "verified": true, "helpfulness": "1/1", "author": "alsarey"}, {"rating": 5.0, "review": "This is a tiny magic wand, Plug to your HDMI TV and play . Google could not designed and implemented it better. This is amazing how wifi and all other things are taken care by this tiny device. Love it :)", "verified": true, "helpfulness": "1/1", "author": "Subhendu"}, {"rating": 5.0, "review": "Otimo, gostei.", "verified": true, "helpfulness": "0/0", "author": "francisco alves de almeida"}, {"rating": 5.0, "review": "The product itself works fantastic with most apps. However some functions are not supported yet and the mirroring function is slow.", "verified": true, "helpfulness": "0/1", "author": "Jonathan RCR"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Khalid Kader"}, {"rating": 5.0, "review": "Worked well. I am excited about this player.", "verified": true, "helpfulness": "0/0", "author": "Sandra Collins"}, {"rating": 2.0, "review": "I really wanted to like this. It does have certain functions I like (Streaming from Chrome browser is nice) but it really fails for not doing 5Ghz wifi. I find it finicky on connections with my laptop, iPad, and iPhone. The streaming quality is only so-so as well. It'll make you appreciate a Roku box or your XBox though.", "verified": true, "helpfulness": "0/0", "author": "Drew NYC \"Drew NYC\""}, {"rating": 2.0, "review": "Constantly buffers, loses wifi connection.I had a Roku in my vacation house and forgot to bring it back, so thought I'd try chromecast instead of another Roku....boy was I wrong! There's no comparison.This is not even 10% as good by comparison.", "verified": true, "helpfulness": "0/0", "author": "anthony palmer"}, {"rating": 4.0, "review": "I just hate not having a real remote.... It's more of a hassle than you'd think", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 1.0, "review": "I really wanted to like the Chromecast but the device has some serious challenges for anyone who lives in a more populated area.  The devices touts that you can use it with your phone and intro video talks about \"casting\" your video content to the Chromecast.What it doesn't say is that it is just mirroring content (and not installing an app on the device) which means all content is sent thru your phone or other device to the Chromecast.  (from the internet to your wireless router to the phone (or laptop/pad/netbook) and then back the router to the Chromecast.)  The lack of an installed app creates 2 unnecessary wireless transmissions and bogging down your wireless network and router.  Put yourself in a normal household with a couple of devices running on wireless and you get a device that frequently stops to buffer, or loses connection with the content and you have to start over on your phone to restart the streaming.  It also is a quick drain on your mobile device so it is almost a necessity to have your phone plugged in, another que to a poorly designed device.Since I had wireless devices in the same area (apple tv previously was in the same spot) had no problem with the wireless connectivity and much of our device is wired wherever possible I am not willing to move the router to accommodate such a poorly designed device.  It's going back.", "verified": false, "helpfulness": "0/1", "author": "Wizbang_FL"}]