[{"rating": 5.0, "review": "Great product ever !! Easy to navigate with your smart phone", "verified": true, "helpfulness": "0/0", "author": "carlos"}, {"rating": 5.0, "review": "Cool.", "verified": true, "helpfulness": "0/0", "author": "N. Rizzuto"}, {"rating": 5.0, "review": "THIS LITTLE THING HAS ALREADY PAID FOR ITSELF IN TWO DAYS!!  My nephew told me to download VEVO,  CRACKLE, & FLIPPS -  WOW!  now I'M WATCHING FREE LIVE CONCERTS and FREE MOVIES! TOTALLY AWESOME!!!I'm 63yrs old and knew nothing about streaming things until my nephew offered to show me how awesome it is.  I figured I would give it a try because regular TV is so boring and stupid I can't stand it anymore. Fox NEWS only bashes the DEMS morning, noon, & night all year long. MSNBC only talks about racial issues 24/7. And CNN focuses on a Plane crash and searching for debri in the ocean for days and weeks on end or some Snow storm or who shot who in some town and beat the story to death with the redundant repetition of questions. HISTORY Channel focuses on Locked up abroad, Pawn Stars, & Pickers whatever.NOTHING EVEN COMES CLOSE TO THE ED SULLIVAN SHOW, A BROAD RANGE OF NEWS, OR REAL AFRICAN ANIMALS LIVING IN THE WILD, THE FABULOUS BEAUTY ON THIS PLANET and the list goes on.I'm hoping this little CHROMECAST allows me to get my feet wet and eventually replace my TV regular programming all together!!  SO FAR I'M VERY PLEASED FOR THE PRICE. GOOD ONLY FOR BEGINNERS AND NON-TECH IDIOTS LIKE ME.HOWEVER - ONCE I GET MORE SAVVY I'M TAKING A HARD LOOK AT UPGRADING TO THE 2015 ROKU-2 IF GOOGLE DOES NOTHING TO IMPROVE THE LIMITATIONS OF THIS DEVICE.", "verified": true, "helpfulness": "2/2", "author": "Robert N"}, {"rating": 3.0, "review": "It doesn't work quite as it should. On many pho es and tablets it will not cast your screen to your tv like it says it will. But there are many good apps. I use it to watch netflix and you tube.  A good purchase but i thought i was getting more for my money.", "verified": true, "helpfulness": "0/0", "author": "Michelle Gambino"}, {"rating": 2.0, "review": "Gave it away because I couldn't figure it out", "verified": true, "helpfulness": "0/0", "author": "CATHI"}, {"rating": 5.0, "review": "It is an excellent product", "verified": true, "helpfulness": "0/0", "author": "william obando"}, {"rating": 5.0, "review": "I have 2 of these and use them in my bedroom and living room to stream HBO Go and other programs from my laptop or iphone.", "verified": true, "helpfulness": "0/0", "author": "Laura \"Laura in Florida\""}, {"rating": 4.0, "review": "Gift item", "verified": true, "helpfulness": "0/0", "author": "sweetpea1966"}, {"rating": 5.0, "review": "Perfect", "verified": false, "helpfulness": "0/0", "author": "L. B."}, {"rating": 5.0, "review": "I love being able to stream without having to connect laptop to TV by a cord.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}]