[{"rating": 4.0, "review": "So far so good. Surprised most of the recent movies are so expensive.", "verified": true, "helpfulness": "0/0", "author": "Boyd F. Blair"}, {"rating": 5.0, "review": "Works Great!  We use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Pam Chambers"}, {"rating": 5.0, "review": "I had no problems at all connecting this to my TV. So far, everything works as expected and I absolutely love it. I love having access to so many different programs. I went with the Fire TV instead of the Fire Stick because the Fire TV has a plug for my soundbar (which does my TV does not have a plug in for).", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Remote control not intuitive enough. It would be nice to have an ON/OFF power button on the remote or the unit. this is one feature that no one should look for on any electric device and must be done in one click of a button. The voice activation feature works well but unfortunately not smart to to turn off my TV when I ask, instead shows a list of movie or other things that contains the words \"Sleep, Turn Of TV etc.\" depending on the phrase I use to have my TV turn off. I finally realize that I have to press the home button and select  to put Fire TV to sleep, but the te fire TV comes back on. How do you turn this thing off?", "verified": true, "helpfulness": "1/2", "author": "zadi"}, {"rating": 5.0, "review": "Love it.  Was using PS3 to view Netflix.  Bought this and side loaded XBMC.  Now the family uses amazon prime (easy to navigate)  I use Kodi.  I like the small size and the low energy consumption. The last update added a forced sleep mode which is nice, but I would have still preferred an On/Off switch.  Our large screen TV is an older model with only one HDMI port.  I use a three way HDMI switch to accommodate external boxes.  I have to manually switch away from the Fire TV box because the sleep mode is detected as still on.  Also, my house has a wired network so there is zero streaming issues with the NIC connection.  Great little box", "verified": true, "helpfulness": "0/0", "author": "JAR"}, {"rating": 5.0, "review": "Essential to cutting the cord. Tablo, Plex, Kodi, VLC. I only wish they put in a gigabit nic in it, 802.11ac would be cool too. Seriously is it really that much more $?", "verified": true, "helpfulness": "1/1", "author": "Casey Cooper"}, {"rating": 1.0, "review": "this thing stinks does nothing but sell  total junk does not work on my solo slingbox  i want  a refund", "verified": true, "helpfulness": "1/6", "author": "ron eckert"}, {"rating": 1.0, "review": "Very slow had to wait for buffering. It would often pause during a live game and have to catch up and I would lose large portions of broadcast. It gottobe unbearable so I returned it.", "verified": true, "helpfulness": "1/5", "author": "John"}, {"rating": 5.0, "review": "Great deal, but was a little disappointed in the consept.", "verified": true, "helpfulness": "0/0", "author": "Little T"}, {"rating": 5.0, "review": "I just love it. This has opened a while new world. We may be able to get rid of our cable now and save some money YEAH!!!!", "verified": true, "helpfulness": "0/0", "author": "Cynde Early"}]