[{"rating": 2.0, "review": "doesn't work well with my router", "verified": true, "helpfulness": "0/2", "author": "Richard Reinwald"}, {"rating": 4.0, "review": "A little hard to configure and manage once you have more than a mobile device to control it. Everything else is good", "verified": true, "helpfulness": "0/0", "author": "Cesar Gonzalez"}, {"rating": 4.0, "review": "They work well with apps such as Netflix and YouTube, but they don't have a mobile streaming for Safari or for the Google Chrome for the iPhone. From the computer, they stream reasonable well, but be sure that nothing else is going on your computer at the same time. The Apple Air is better for your iPad or Phone.", "verified": true, "helpfulness": "0/0", "author": "R. W. Womer Jr. \"villagevet\""}, {"rating": 5.0, "review": "Love this little guy.  Can't go wrong for the price.  Isn't my daily driver in regards to set-tops (I use my more robust Roku more frequently) but it's very nice to be able to sling content from my PC/Tablet/Phone to the TV easily.  Great for traveling as well.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Love this! You can project everything from your phone if you install APP. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Irina Lyublinskaya"}, {"rating": 5.0, "review": "amazing device watching movies and series have never been easier", "verified": true, "helpfulness": "0/0", "author": "Hussein Awala"}, {"rating": 5.0, "review": "This is my second one. Still loving it. Watch YouTube, Netflix, stuff online easily from my smartphone used as a remote to my TV. First one still works great, using since last winter. Watching a live Grateful Dead California show in 89 on my TV from YouTube using chromecast, my smart phone app. And texting this review on the phone. Does not tie up the phone. Anyway now one in the kitchen works great.  Wifi chromecast =free television. Peace★", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 4.0, "review": "Yes I love it, it does everything I want it to do", "verified": true, "helpfulness": "0/0", "author": "rayven coplen"}, {"rating": 3.0, "review": "It's OK but sometimes hang.", "verified": true, "helpfulness": "0/0", "author": "Shadi"}, {"rating": 5.0, "review": "Excellent!!", "verified": true, "helpfulness": "0/0", "author": "Mark Zachhau"}]