[{"rating": 5.0, "review": "Best investment I mademail this year so for", "verified": true, "helpfulness": "0/0", "author": "william hernandez"}, {"rating": 5.0, "review": "Got this for my son 2 years ago and he still enjoys using it every day.", "verified": true, "helpfulness": "0/0", "author": "Vicki C"}, {"rating": 5.0, "review": "so great I may have to buy another one.  Thanx!", "verified": true, "helpfulness": "0/0", "author": "I. Trotman"}, {"rating": 1.0, "review": "Connect with WiFi is too bad! I do not like it.", "verified": true, "helpfulness": "0/0", "author": "mohammed"}, {"rating": 1.0, "review": "Utterly useless. I'm sure it probably works with other google products. Hover --- not with anything else.What a piece of junk.", "verified": true, "helpfulness": "0/2", "author": "C. P. Brown"}, {"rating": 5.0, "review": "Bought one for the living room and one for the kid's bedroom to stream Netflix and YouTube. Both also have cable boxes. I then bought one for the guest room tv which is used less often so I didn't want to pay for an additional cable box every month. The Chrome is used for Netflix when we have company staying in that room. No complaints about any of the three. They were very easy to place on the tvs and the setup was a piece of cake with the walk through instructions to connect to our wifi. Highly recommend and I have even bought others as gifts.", "verified": true, "helpfulness": "0/0", "author": "GingerH"}, {"rating": 4.0, "review": "I love it!  The only problem I have is that it sometimes loses connection while playing a game or something, which is annoying (and also whyonly 4 stars).  Otherwise, I'm very happy.  As an added bonus, I've received over $26 in Google play credit so far.  I bought it on a cyber Monday sale for $23 total, so it is basically cheaper than free.", "verified": true, "helpfulness": "0/0", "author": "moe0303"}, {"rating": 3.0, "review": "It doesn't hold a charge and wouldn't charge via usb cord through tv. My internet is also really slow, so it was too frustrating to wait for it to communicate with my computer, so I've stopped using it.", "verified": true, "helpfulness": "0/1", "author": "LH"}, {"rating": 5.0, "review": "Love the chromcast---makes your TV smart.", "verified": true, "helpfulness": "0/0", "author": "Lbgballer"}, {"rating": 4.0, "review": "Works well, don't use it much though.", "verified": true, "helpfulness": "0/0", "author": "Oma Morey"}]