[{"rating": 5.0, "review": "So glad this item arrived!  perfect packaging and we'll put it to use asap.This is a new device that is so perfect for the experts on new techonology.", "verified": true, "helpfulness": "0/0", "author": "S. Hazlehurst \"Bargain Hunter\""}, {"rating": 5.0, "review": "It can be really challenging to find a decent tech gift at a reasonable price, but this cheap little thing is awesome.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "LOVE it! At first I wasn't that fond, but once I changed internet providers to a higher download capability it is phenomenal!!", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "I recieved the Chromecast Media Player in 2 days. It was very easy to install and I started streaming movies immediatley.", "verified": true, "helpfulness": "0/0", "author": "Jane Petty"}, {"rating": 1.0, "review": "Make sure you got a USB input on TV. I have older plasma that does not have USB. Otherwise works.", "verified": true, "helpfulness": "0/3", "author": "Michael Ricker"}, {"rating": 2.0, "review": "I tried everything and could not get this to work might work better for other tVs mine is not too old", "verified": true, "helpfulness": "0/0", "author": "Miky Kingsley"}, {"rating": 5.0, "review": "The product does exactly what I expected it too.  The only problem is that the internet plan that I currently have and has been sufficient until now, is no longer enough to stream live.  The stream is extremely choppy and I have to upgrade what I thought was a perfectly fast internet.", "verified": true, "helpfulness": "0/0", "author": "Michelle Wisniewski"}, {"rating": 5.0, "review": "Does everything it states it does nothing else just read what it says to do and it will work .", "verified": true, "helpfulness": "0/0", "author": "Bubba"}, {"rating": 5.0, "review": "This little thing is amazing. I find myself using it constantly to stream music from my phone, watch Netflix, watch HBO, YouTube. It keeps getting better too as more services are added. Worth every penny of the $35", "verified": true, "helpfulness": "0/0", "author": "jean"}, {"rating": 5.0, "review": "This is great if you watch Netflix.  Using a tablet to navigate is 100% better than using the SmartTV or DVD interfaces to find content.  When I push the Cast button after finding what I want to watch, it asks me which TV to cast it to.  If my Sony smartTV is not on, it will turn it on and change it to the Chromecast input automatically.  That's awesome!", "verified": true, "helpfulness": "0/0", "author": "Slbear"}]