[{"rating": 3.0, "review": "the amazon app wasn't working on our big screen samsung TV - movie were freezing up constantly.  After much talk with Samsung and Amazon, a friend of mine who works in tech suggested getting the fire -- said the apps on the TV's don't work that great.  Since then, its been amazing and i love the remote and the ability to search by voice.  I have two at home and the Fire stick for travel.  One reason I WON'T give this 5 stars -- When I search movies it offers \"more ways to watch\" but i usually just offers buying it on amazon -- that's NO help at all, we already know its on amazon.  further more IF IT'S ON NETFLIX AMAZON WON'T TELL YOU THAT as \"more ways to watch\"  I don't like them trying to get me to buy something that I could see on Netflix.  It's a dirty game Amazon and you should clean that up.", "verified": true, "helpfulness": "0/0", "author": "BAMAZON \"Barry\""}, {"rating": 4.0, "review": "I like the idea of this. However I feel it was a little too late as this tech already exists in so many other formats. I can already connect to prime and use voice commands through my Xbox. It was interesting to try as they gave me a free trial period but, it didn't seem worth the money as I have X amount of tech, that connect to streaming services, already on hand.Like I said, I like the idea. I just don't have a reason to spend the money on another \"connection device\".", "verified": true, "helpfulness": "0/1", "author": "Dr Zelski"}, {"rating": 5.0, "review": "Very simple to install and setup. This really is a plug and play item.", "verified": true, "helpfulness": "1/1", "author": "A. Ray"}, {"rating": 5.0, "review": "Works great, very satisfied and happy with the game apps.", "verified": true, "helpfulness": "0/0", "author": "mama pen"}, {"rating": 5.0, "review": "Awesome product has Optical out put for HD quality and 5.1 surround sound.", "verified": true, "helpfulness": "0/0", "author": "Najmi"}, {"rating": 5.0, "review": "I love it !", "verified": true, "helpfulness": "0/0", "author": "Sondra L. Brown"}, {"rating": 5.0, "review": "I love my Fire TV. With Prime and Netflix, i'm never bored or without entertainment. The selection of movies, tv shows, etc. is endless. I dropped cable because of the high cost per month and repetiveness of what was offered. Navigation through the apps and selections is seamless. It's a super alternative to cable for me.", "verified": true, "helpfulness": "0/0", "author": "Todd B. Olds \"Todd\""}, {"rating": 5.0, "review": "Currently own and have owned the majority of streaming devices on the market, and I will say I am extremely impressed with Amazon Fire TV. It is tremendously fast (nearly instantaneous starts, and seeks).  The selection of apps/vendors is comparable but what I love most about the system is that it is Amazon which I am a proud member of.  So yeah, I admit I'm a bit biased, but the truth is I have thousands of dollars of content purchased across all of the digital ecosystems I belong to (Apple, Google, Microsoft, Yahoo, etc), not just Amazon.  Yet Amazon has done a superb job with integration of their content into this system.  The interface is top notch and easy to use. The hardware is spectacular.  I love that it is dualband unlike my Roku and Chromecast, and Google TV and Apple TV.  Geeez now that I think about it I really missed out on so much bandwidth 802.11n offers.  I think that's the reason why video on those systems are occasionally choppy.  But it's ALWAYS silky smooth on my Amazon Fire.Anyway, take it from someone with EXTENSIVE experience owning the other systems. This one you will not be disappointed in.", "verified": true, "helpfulness": "0/0", "author": "Connor MacLeod"}, {"rating": 5.0, "review": "Simply Awesome, everything I was expecting and far more.", "verified": true, "helpfulness": "0/0", "author": "Yasser Fathy"}, {"rating": 3.0, "review": "Is ok", "verified": false, "helpfulness": "0/1", "author": "M"}]