[{"rating": 5.0, "review": "We purchased a new TV for Christmas that is internet ready, but moved the old TV into a room that does not have a cable jack, so we have a Wii hooked up that can access internet streaming, but is a pain to use.  This Fire TV is plug and play, preset to our Amazon Account, and was working in less than a minute over our wireless.  The remove works great from anywhere in the room.", "verified": true, "helpfulness": "0/0", "author": "Raudy"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "JoAnn L. Ranck"}, {"rating": 5.0, "review": "Very cool device. Plenty of features to keep you busy and works flawlessly. Setup was super easy and even my 7 year old was cruising through it looking up videos and games with ease. The voice features makes things so much nicer and faster. This was a great buy for the money and you will not be disappointed in this product.I purchased the controller to go with it and am waiting for it to arrive. For those of you who are interested in gaming on the Fire TV, please be aware that many of the games will require a controller.", "verified": true, "helpfulness": "0/0", "author": "Anthony Adams"}, {"rating": 4.0, "review": "Works great but i wish it had a youtube and ufc app. Hopefully they'll come in an update.", "verified": true, "helpfulness": "0/0", "author": "bjorn hansen"}, {"rating": 5.0, "review": "Works great. I have prime so I also have a lot of free choices!! Glad I asked for it for Christmas!!", "verified": true, "helpfulness": "0/0", "author": "heather"}, {"rating": 5.0, "review": "Everything I expected", "verified": true, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 5.0, "review": "We have never tried any of the technology items to allow our TV to stream.  However, we have really enjoyed using this device.  We like it so much, with a general antenna to pick up the local stations, we will be dropping our satellite.  Dropping our bill for TV about $70 monthly.  The speed is good, and we pick up a lot of movies, games, TV shows.  We chose to go with Hulu and Netflix at this time, plus we have Amazon Prime.  The three of these gives us a great variety of what we want to watch.", "verified": true, "helpfulness": "0/0", "author": "momreview"}, {"rating": 5.0, "review": "So far so good, we haven't had a chance to use it very often yet, but when we have used it we love the access we get to so many movies/tv shows.", "verified": true, "helpfulness": "0/0", "author": "R.M."}, {"rating": 5.0, "review": "worked very well as expected.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Corey Stanfill"}]