[{"rating": 5.0, "review": "Great absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 1.0, "review": "He was very excited about this new box tv for my tv series and show, but like everything in life something goes wrong sometimes, remote control batteries eaten in a day or two I thought the battery which brought were short duration so take my remote control of my tv that was relatively new the next day they were dead, so I bought some new Duracell batteries and use only a few minutes to test if it was I was going crazy or remote control the fire was faulty tv that indeed the second day were dead and that the Duracell also that updates all the box, control the 354 version, but still !!!! amazon am a loyal customer of yours needs your help with a control that works without making me spend all my money on batteries, it is very frustrating to want to see something at night with friends and have to go to the nearest store to buy batteries, I will connect to everything and achieving nothing clik .mouse keyboards. at least I hope the two fire sticks tv that pre-order will not have the same problem ...", "verified": true, "helpfulness": "0/4", "author": "Mario Duran"}, {"rating": 5.0, "review": "This is great . Works perfectly right out of Box.", "verified": true, "helpfulness": "1/1", "author": "Larry"}, {"rating": 5.0, "review": "It's Awesome. Just received it a couple of days ago, but so far I love it !!!!!! So much faster than our Roku.  Great format and the unit is sleek and solid. Great unit !!!!!!", "verified": true, "helpfulness": "0/0", "author": "teresa robbs"}, {"rating": 4.0, "review": "Predictably, nobody at Amazon can help me, so is there anyone out there whose Voice Search function on the remote has inexplicably stopped working (and if so, is there a fix?)", "verified": true, "helpfulness": "0/0", "author": "lns500"}, {"rating": 5.0, "review": "Works like a charm. Very responsive. Five stars.", "verified": true, "helpfulness": "0/0", "author": "SASSI JOSEPH"}, {"rating": 4.0, "review": "Ok, first off I'm not a die hard amazon fan. They have needlessly censored reviews of some of my good friends. That being said, when I was searching for the best streaming device on the market fire tv won hands down. I can stream Netflix through it (new app is listed in popular apps section with white background while old app is still upfront with red background).  My overall impression is that fire tv is the best streaming device on the market currently. I have satellite internet and have no problem streaming content (which has been an issue with another device). You don't have to have amazon prime. You can use this device just for Netflix or Hulu.  Bottom line it's worth the money. Netflix, Hulu, or amazon prime are all less expensive than dish or cable. For the cost of the initial investment you'll save a lot of money on the back end. As of today I would probably choose Netflix over amazon prime if your strictly talking about watching tv. However, if you use prime for free shipping, then you have to bring that into the equation.", "verified": true, "helpfulness": "1/2", "author": "&#34; Anti Microchip &#34; \"Jesus Christ can save your life.\""}, {"rating": 1.0, "review": "My Fire TV has turned out to be a dud. This would be a 5 star review if Amazon would help me and repair or replace it but I have contacted customer service twice and they have refused to do anything and the second time I contacted them that said they needed to escalate it to another department and PROMISED they would get back to me and they never did. The issue I have with it, is the sound cuts down to a lower volume and sounds echoey frequently. The only fix is to get up and physically unplug it and plug it back in. Now it happens everytime I use it, within minutes sometimes of watching something and also, the sound now just completely cuts out. It's at the point now it is not even worth using and I'm just back to using my Apple TV, at least it works and maybe it's slow, but it's worked fine for years now. I guess I need to contact Amazon for a third time and hope they won't blow me off again, otherwise this was a $100 paperweight.", "verified": true, "helpfulness": "4/7", "author": "natmgriff"}, {"rating": 5.0, "review": "Great Device for streaming content.", "verified": true, "helpfulness": "0/0", "author": "Lancia"}, {"rating": 2.0, "review": "There is no off on button. If I turn off the television and go to work , the box won't work when I come home and the batteries have to be changed in the remote. So now I just take them out when I'm finished watching. If I puuse it and the screen saver comes on I can't get it to work. I have to turn off everything and remove the batteries from the remote. I just stopped using it and went back to my Xbox. It is a piece of crap!!!", "verified": true, "helpfulness": "1/4", "author": "R. J. Barnwell"}]