[{"rating": 5.0, "review": "It does what it says it will, I liked it so much I purchased another", "verified": true, "helpfulness": "0/0", "author": "Idiot \"Thank you, shahir2@gmail.com.\""}, {"rating": 5.0, "review": "Works!  We were able to get it to work in Mexico!  Amazing!", "verified": true, "helpfulness": "0/0", "author": "Givaudan"}, {"rating": 5.0, "review": "This is a wonderful device that is a blast to use and was very economical!  I love it!", "verified": true, "helpfulness": "0/0", "author": "The Mom \"The Mom\""}, {"rating": 5.0, "review": "got this for my dad for his birthday. was super easy to use. dont bother buying one of those short USB cables \"made\" for this, because it comes with one. Yea its a bit long but its got a velcro. up and running in like 15 minutes, needs some updates. He has a smart tv with a netflix app but running netflix through the chromecast rather than the smarthub was much easier (faster, better pic quality somehow, easier to search for show titles and navigate in general). Can't cast amazon prime instant videos or videos from Facebook (my mom would like this as she is always showing you videos my brother has posted of my niece), but youtube, pandora and netflix work well with the cast. GREAT value for the price. A+ google as always", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "This works better than expected. Control it with my phone really easy.", "verified": true, "helpfulness": "0/0", "author": "wayne stanley"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Mustafa Moiz"}, {"rating": 3.0, "review": "This device only casts in 720p. Who spends the money for a 1080p TV and rents HD movies and then wants to watch them in 720p???? This should be the first issue disclosed. It is not for real movie people.", "verified": false, "helpfulness": "0/0", "author": "R. M."}, {"rating": 3.0, "review": "Works well. Wish I didn't update though. Now I can't use MX player on it. Curse you Google!", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Mukund P."}, {"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/1", "author": "Henry Rojas Rodriguez"}]