[{"rating": 4.0, "review": "Not much of use if you have your TV hooked up with a desktop computer.Great for  viewing your smart phone apps. which support Chromecast on to your TV.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "This Chromescast is pretty awesome. Id recommend it. You will turn your flat screen into a Smart TV essentially. Keep in mind, you have to have the chromecast plugged into the HDMI and USB cable. They sort if misrepresent this fact. You should have a USB near your HDMI port on your TV, if not you have to have it plugged into the wall.", "verified": true, "helpfulness": "0/0", "author": "azzuz"}, {"rating": 5.0, "review": "Works great.  Love the device, connects really easily to network and TV.  They just need to continue to grow the apps that are supported.", "verified": true, "helpfulness": "0/0", "author": "M. Prince"}, {"rating": 4.0, "review": "I would give this a five star, but when it is limited to Netflix and Youtube, it really doesn't do much more than I can already do with the cell phone and a Wi. What Google needs to do is get this thing adjusted so you can stream what you have on your Apple or Android directly to the television from the unit. This way you could really share things with friends.", "verified": true, "helpfulness": "0/0", "author": "Gregory Beamer"}, {"rating": 5.0, "review": "This is a great way for google to get their product to everyone. Very cheap and works great. Setup is really simple. Reading the specs it sounds like I should be able to start a google play movie and then send it to my tv. This works great. However my phone is required to be on the network in order for this to work. so if I start a movie for my kid and leave BAM movie stops.  The specis seem to indicate the chrome cast device will take over management of the URL but this is not the case.This is the easiest way to share your computer screen as well. There is a slight delay when sharing a chrome window on your computer but when streaming video and audo from a chromcast compatible app there is no delay at all and works better than expected.I hope google beats out directTV for the sunday ticket bid next year and we all get to enjoy Games ala carte on ChromeCastNFL...come on google. Dont let us down!", "verified": true, "helpfulness": "0/0", "author": "aaron lennon"}, {"rating": 5.0, "review": "At $35, chrome cast is as great way to stream netflix and hulu movies onto your big screen TV.Easy to set-up and to use.", "verified": true, "helpfulness": "0/0", "author": "Steve Johnson"}, {"rating": 5.0, "review": "Girlfriend uses it more than me .. I stick with youtube and pandora apps. Great for parties and watching HD videos!", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 4.0, "review": "Yes, I've got an older Samsung LCD television that doesn't have the built-in \"Smart TV\" ability to receive Netflix or other streaming services. I wasn't about ready to junk my TV and buy a new one so I ended up watching Netflix on my 19\" monitor hooked up to my desktop computer.I knew that Roku, Apple TV and other streaming media players were out there but I was only looking to be able to stream Netflix and YouTube to my LCD television-- I really did not care about having access to other media channels (some free and some not). I think that this is Chromecast's \"niche\".With Chromecast, I am able to watch Netflix and YouTube on my 40\" HD LCD TV. An added plus is that I can control what is being streamed to my TV using my tablet, Android phone or computer. I am able to watch all the Netflix & YouTube that I want using the inexpensive $35 Chromecast dongle. If you are reading this review, I assume that you've done your homework and seen how much more expensive Roku, Apple TV and other media players are. For me, the decision AND purchase was painless.The on-screen setup of the Chromecast was very easy. I was up and streaming in under 10 minutes. I love this thing!!!The only drawback (and it has nothing to do with the Chromecast) that I've noticed is that if you are watching a non-HD video from YouTube on your phone or tablet, it's going to look even worse when you \"cast\" it on your big screen HDTV. Luckily, more people are posting videos in HD on YouTube.If your needs are similar to mine, get it. At $35, can you really go wrong???  =)", "verified": true, "helpfulness": "0/0", "author": "Z Guy"}, {"rating": 5.0, "review": "If you are living in the Google ecosystem then the Chromecast will be a perfect fit for you. It is not as feature intensive as say a Roku, but that is a pro as well as a con. The Chromecast is simple to use and becomes a necessary appendage for your android devices. It connects my Galaxy S4, Chromebook 11, and Nexus 7 via wifi. It is very hard to mess up the connecting process. If your devices are all connected to the same wifi then the process is simple. Loved using the device so far and the price ($25 for student prime acct) could not be beat. My ONLY wish would be to make it possible to connect in-app to either Amazon Instant Video or Amazon Music.", "verified": true, "helpfulness": "0/0", "author": "Charles W. Church \"meanchase\""}, {"rating": 5.0, "review": "How often do we buy electronics and they don't work like they are supposed to?  I bought a Google TV only to find out it is an overpriced television with apps that don't work.  Get a Chromecast for Christmas that was purchased for only $30-$35 and it works flawlessly!  Love it.  Although if anyone could tell me how to get my Samsung Galaxy S4 to find it,  that would be great!", "verified": false, "helpfulness": "0/0", "author": "Cinti Review"}]