[{"rating": 4.0, "review": "I had one point where it just quit working for a few days. I don't know why, it just wouldn't cast.  At some point I tried it again and it worked.  Other than that it's been great.", "verified": true, "helpfulness": "0/0", "author": "Christopher Dee"}, {"rating": 3.0, "review": "The TV commercials give that idea that you can easily transfer (cast) any form of media from your handheld device to your television.  Not exactly!!! There was no way for me to cast my personal photos & videos from my iPad mini. The Chrome website says that software to do that has not been developed for the device yet. I am on satellite internet with limited bandwith (the joys of living in the boondocks), so using Chromecast for streaming media was out of the question. Oh well, I guess I'm back to HDMI cables for now...Setup was fairly simple, although no instructions included in packaging.", "verified": true, "helpfulness": "0/0", "author": "Nursing Home Preacher \"Benjamin Laird\""}, {"rating": 5.0, "review": "Excellent device! I love it! I started to use it the minute I received it. It gave me a little hard time setting it up but after it passed that hurled it worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "Pedro A. Geraldo"}, {"rating": 3.0, "review": "I didn't notice that Amazon prime does not work with this. I'm keeping it just to use on vacations instead.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have purchase 8 of these for myself. & Christmas gifts, they are a VERT affordable alternative to Apple TV", "verified": true, "helpfulness": "0/1", "author": "joshua cox"}, {"rating": 5.0, "review": "This Google Chromecast HDMI streaming media player works GREAT!  Easy to install and we now have all our bluetooth devices connected.  What a great invention!  Will recommend to everyone!", "verified": true, "helpfulness": "0/0", "author": "J Clint Musgrove"}, {"rating": 5.0, "review": "This is a great little device and the price is right. The light on it is way too bright for a bedroom but I put a sock on it and it still works fine. Streams Netflix from my phone. Doesn't stream Amazon Prime, but maybe someday it will.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Pretty Cool!  Works as described.  Great way to upgrade your TV to a smart TV without springing for a new TV!", "verified": true, "helpfulness": "0/0", "author": "A. S."}, {"rating": 1.0, "review": "Do not buy! This is a complete waste of money and time. My time is worth more than any dollar amount. I've spent over 12 hours trying to get this thing to work. Plug and play, haha what a joke! I guess you get what you pay for, JUNK! go with Apple TV", "verified": false, "helpfulness": "1/8", "author": "Cristina Munoz"}, {"rating": 4.0, "review": "The Google Chromecast device is worth what you pay for it.For playing TV and shows and movies from Google Play, Netflix, Hulu Plus and other places it was specifically designed for - it does an acceptable job. However occasionally, even though I do have a fast Internet Connection - it will pause for buffering.At this time, I am not sure if the buffering is the device's fault - or due to the fact my tablet doesn't have an overly fast processor.My biggest qualm and the reason I will not rate the device a full five stars is due to the Google Cast application that runs in Google Chrome on your desktop or laptop.Trying to use this app for streaming video from your laptop or desktop is a joke. In using it, no matter what setting you utilize - the Chromecast device will drop it's WiFi connection every few minutes.And needless to say, Google's forum support might as well be non-existent. I submitted this problem to the Google forum several weeks ago and still have not received even a single response.Botttom line: In using the designed apps specifically built for this device (except Google Cast), the Chromecast device does well and it's worth the $$$. But if you are looking for something to stream movies, TV shows, etc from places like Crackle.com via Chrome's Google Cast app - forget it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]