[{"rating": 3.0, "review": "Works fine, just did not understand that it only work with Netflix, not all programs.  Was disappointed in that limitation.", "verified": true, "helpfulness": "0/1", "author": "Mary Calhoun"}, {"rating": 2.0, "review": "Worked beautifully for a month before blowing out the only HDMI Port on mySony TV.", "verified": true, "helpfulness": "0/1", "author": "JESkage"}, {"rating": 4.0, "review": "Good quality and useful for the price. Wish we could use google cast from ipad or iphone tho. But still an awesome product. Would recommand it for people apple customers who don't want to spend money on an apple tv. Happy customer :)", "verified": true, "helpfulness": "0/1", "author": "U. Noble \"SI Fan\""}, {"rating": 5.0, "review": "great!!", "verified": true, "helpfulness": "1/1", "author": "Eric Santiago"}, {"rating": 3.0, "review": "I bought this a few months back when I had purchased my new LG 47\" TV. I was excited for the price and the features. When I plugged it in, I was impressed by the streaming availability. But when I logged into Netflix, which was the primary reason for the purchase, it was pixelated and degraded. It had a horrible picture. I returned it the next day. Invested in a Smart BluRay player and never have been happier.", "verified": false, "helpfulness": "0/1", "author": "Lexi Brown"}, {"rating": 3.0, "review": "Didn't connect to anything I had, maybe others will have better luck", "verified": true, "helpfulness": "0/0", "author": "Ryan H"}, {"rating": 2.0, "review": "whenever I try to connect to youtube and watch a movie, the sound skips! it works for any other websites but does not work on yotube! just very dissapointing", "verified": true, "helpfulness": "0/0", "author": "Willywill"}, {"rating": 5.0, "review": "This dongle is worth twice the price.", "verified": true, "helpfulness": "0/0", "author": "Dirk Derkle \"DakineAthon\""}, {"rating": 5.0, "review": "Great for streaming video. Even better than the built-ins that come with DVD-BluRay players.", "verified": true, "helpfulness": "0/0", "author": "integration_hero"}, {"rating": 3.0, "review": "Ive had this for a while now even though i do like it, it wont work with netflix. I guess for it being inexpensive you get what you pay for. I do enjoy however, being able to watch my favorite youtubers in my TV.", "verified": true, "helpfulness": "0/0", "author": "Maria"}]