[{"rating": 1.0, "review": "Horrible. Won't work with my router. Simple Google interface as fatally flawed as their arrogant \"self-driving\" cars. Crap that fails at the first hint of a problem. Not returnable. POS.", "verified": false, "helpfulness": "0/3", "author": "Miriam Hardin"}, {"rating": 3.0, "review": "I have a LG g3 and every time I use it on my tv (not a smart tv unfortunately) it lags big time. Same Wi-Fi connection. And even if I were to not use Wi-Fi I have Verizon wireless as my mobile carrier so the connection shouldn't be so bad.  If there was a way to fix this very minute detail than I think definitely it would deserve a higher rating for its accessibility", "verified": true, "helpfulness": "0/1", "author": "jose gutierrez jr"}, {"rating": 1.0, "review": "1) it can only be controlled by a wifi device. None of my home's hardwired computers can control it.2) It forces you to download Chrome web browser. Will not work with any other.3) My work netbook runs XP, an OS not supported.I have not been able to use the chromecast & I'd rather pay $40 for a Roku than $500 for a new wifi device.Money down the drain.", "verified": true, "helpfulness": "0/4", "author": "David Farrier"}, {"rating": 5.0, "review": "Excellent product. Very useful and inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Kevin Streckewald"}, {"rating": 5.0, "review": "Simplemente fantástico.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "Great little device for everyday use. It has a very simple setup procedure and I haven't  had any problems connecting. I live in a college dorm and at any particular time my computer can detect at least 4 to 5 Chromecasts nearby.", "verified": true, "helpfulness": "0/0", "author": "Evan Jaeger"}, {"rating": 4.0, "review": "Works great as long as you don't unplug it. The device get's a bit warm so I originally unplugged it when I was done using it out of fear that it would burn out my hdmi port. That was a mistake since every time I would plug it back it I would have to re-install the app and re-configure the chromecast. Just leave it plugged in and update the app whenever it's required and the device will work fine. I endured many nights of frustration before I figured out what NOT to do.", "verified": false, "helpfulness": "0/0", "author": "Randall Flagg"}, {"rating": 5.0, "review": "this is the 4th one i've purchase couldn't resit the deal", "verified": true, "helpfulness": "0/0", "author": "shawn landrum"}, {"rating": 1.0, "review": "May not work with relatively old TVs or monitors.The fundamental problem with Chrome-cast is that it does not allow you to manually set the desired display resolution, such as for example your laptop or desktops does. As such, the Chromecast negotiates  (by means of EDID through your HDMI cable) with your TV the highest resolution your TV can support. Your TV or monitor may report, for example, that it is capable of 1080P resolution, but in reality due to some inherent limitations, incompatibility or other unknown issues it does not really handle this resolution very well. As a result, the picture may be garbled, distorted, or black out, totally unusable.If Chromecast allowed to you to manually select a different  resolution, such as 720p in this case, then your TV would have been able to properly display the picture.  Unfortunately, despite many complains about this fundamental limitation on the forums, Goggle have not even attempted to fix it or even acknowledge it as a problem!So this is one star for a product, which basically does not work with some older TVs or monitor.", "verified": true, "helpfulness": "0/0", "author": "Digital Flashback"}, {"rating": 1.0, "review": "Gad to return it.  They don't work on 5 gig networks. ..only on the older 2.4 gig wifi networks.", "verified": true, "helpfulness": "1/1", "author": "Kurtislee"}]