[{"rating": 1.0, "review": "Received as gift - didn't install it right away.  By the time, I did - start-up issues. The only thing it displayed was the lovely yellow explanation point and a website.  Despite all user-based fix solutions - endless reboots - never got passed the explanation point.Finally gave up after many attempts.  Now, too late to return or replace - so no Chromecast in this household.", "verified": true, "helpfulness": "0/0", "author": "mia lisa"}, {"rating": 5.0, "review": "Perfect addition to any room. Works smoothly. Setup was a breeze.", "verified": true, "helpfulness": "0/0", "author": "Andy Spinosi"}, {"rating": 1.0, "review": "waste of money", "verified": true, "helpfulness": "0/0", "author": "sriram"}, {"rating": 1.0, "review": "The first disappointment came when it told me that it requires Google Chrome to be my browser! I am quite satisfied with my Mozilla Firefox browser so I don't want Google Chrome! I went all the way thru the setup process, only to find a screen telling me that it's not compatible with my operating system! (I have Vista) It requires windows 7 or higher! I don't think it said that in any of the advertisements for the product. So now I have a product that I can't use!", "verified": true, "helpfulness": "0/1", "author": "D. Wooley"}, {"rating": 1.0, "review": "i hated this thing, was hoping for a stand alone product in some ascpects, this thing is useless unless you have something to stream from", "verified": true, "helpfulness": "0/2", "author": "Chris"}, {"rating": 1.0, "review": "so what if its cheaper?  It doesnt work Before you purchase...go to google chromecast help forums connection problems,post after post of the same problem.Device loses connection after 5 or ten minutes.Countless suggested fixes....none that work...The best suggestion I found....by another product.", "verified": false, "helpfulness": "0/0", "author": "Colin"}, {"rating": 5.0, "review": "works like it should", "verified": true, "helpfulness": "0/0", "author": "William W."}, {"rating": 1.0, "review": "Will not stream from Xfinity on-line content. Great for You Tube whoopy...", "verified": false, "helpfulness": "0/1", "author": "gizmo"}, {"rating": 5.0, "review": "sweet", "verified": true, "helpfulness": "0/0", "author": "Richard A. Schnitzler \"RICO!!!\""}, {"rating": 4.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Scott Boyajian"}]