[{"rating": 5.0, "review": "More than expected, plethora of apps available, super stream lined setup. From out of the box to watching shows and playing music in less than 3 minutes. Love it, was a great purchase, planning on purchasing another for the guestroom.", "verified": true, "helpfulness": "0/0", "author": "BerlinerKindl"}, {"rating": 4.0, "review": "Who is this for? - Those interested in the interactive features of a smart-TV but who don't want to spend $500+.Why should I get it over the next? - Simply put there is no easy answer.  Amazon Fire TV is literally made for the middle of the road.  It's meant to be a crossover between TV/Tablet/Xbox (or other gaming)/Computer...and to its credit, it succeeds in most areas of concern.Who is this NOT for?1) Anyone who has ever hooked up a PC via HDMI and a wireless keyboard/game pad - If you've reached that point in the rabbit hole, nothing can satiate your needs beyond a better PC hooked up to a better TV...2) Xbox owners - Ever since they dropped the xbox live gold requirement to stream content, xbox has been my go-to for netflix, amazon prime, music streaming, etc.  Plus the games are exponentially better.3) Possibly PS owners...I don't know because I don't own one.Why should you maybe get Amazon Fire TV?If you're the type who likes some occasional mindless gaming, this is great.  It has app based gameplay that, to it's credit, is visually stunning with some of the better developed games.  Other than that, it's a box that gives your tv the ability to play movies, music, videos, show pictures, and play games.What to know?1) This box is really really small - it's about the size of a CD case, and about 2 of them thick.2) It CAN NOT support additional storage, so I'm not sure how the gaming things will work out in the future.3) When scanning through video selections, there is not a 'return to the beginning' when you reach the end.  You can push the back button, but it just seems a little careless when that feature is quite prevalent in most app based electronics.4) The voice commands work VERY well - and despite what others have said, you can type out selections if you don't wish to use your voice.5) If for some reason you own an xbox 360 or later, and still want to buy this - XBOX CONTROLLERS WORK WITH AMAZON TV!!!! Don't buy their controller if you have an xbox 360 controller", "verified": true, "helpfulness": "6/6", "author": "Toby Garcia"}, {"rating": 3.0, "review": "Amazon did well but I feel they can do a bit better. There is an obvious push to include non-prime content along with prime content and no easy way to filter out the $$ content.  Also, why can I not access my prime music?  Amazon has set the bar so high on other things but I did feel a little let down on this item.  I still like it and I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Rexit \"Rexit\""}, {"rating": 3.0, "review": "I like the concept but it didn't offer me enough selections for TV and movies for free. We don't need the music or other stuff so it wasn't a bargain for us. Both of us are over 58 yrs old. and it doesn't cater to our age group. I did the one month free but after we watched all the episodes of the ones we liked there were no more and sometimes there's only a couple of seasons of a TV program out of many seasons which is disappointing when you find what you like only to be able to watch a few shows. Maybe it will get better in the future.", "verified": true, "helpfulness": "2/2", "author": "RGMilford"}, {"rating": 5.0, "review": "This thing is awesome. I reduced my cable bill by 45$ just because my wife and I use it so much. Love it! Easy to use and set up took 5 mins. Epic", "verified": true, "helpfulness": "2/2", "author": "Jon"}, {"rating": 1.0, "review": "The screen graphics of using grey letters on a black background is totally unsuitable for any reasonable sized room.  You have to go stand in front of the screen to read things!  So far, if that can't be corrected with software updates, we are ready to box it up and send it back.  We did NOT have this problem with Roku!", "verified": true, "helpfulness": "3/3", "author": "Bette Inman \"White Crow\""}, {"rating": 5.0, "review": "This unity is better than the Apple 3 TV I have. If I could use it to watch my movies from my computer I would unplug my Apple TV.***** After using for few month it has become clear that  alight needs to behind the remote control so I can see the keys while watch movies in the room with low lighting.", "verified": true, "helpfulness": "0/0", "author": "D.B. McBrierty"}, {"rating": 5.0, "review": "All i have to say is positive only about this product. I already have Roku3 for 1 year and I wanted to buy one more so thought of trying this one. Lower price, much better speed and all apps that I had been using on Roku are available. Voice search is impressive.  Easy setup and works right out of box without a need to pull your hair.", "verified": true, "helpfulness": "1/1", "author": "Vijay K. Bhalla"}, {"rating": 4.0, "review": "At First Blush:1. Wow.  This thing is tiny.2. Well engineered.  About as minimal as could be - which I'm happy about.3. Prime Music - Get it on there NOW please :)4. Adding apps to this darn thing isn't intuitive.  Please make it easier.5. Connectivity - Super easy to hook up to my wifi.  However, I wanted to hook it up to my ethernet connection.  Tried but failed.  Not intuitive at all. Please make it easier.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"JS\""}, {"rating": 5.0, "review": "Wow once again I am impressed- I hooked it up all by myself with no problems except it states it comes with 2 AAA batteries and mine did not so I had to search for those a long time. It will be so much easier to find movies for Amazon Prime with the voice command. This is way ahead of ROKU which I've been using ever since it came out. And the new lower special price of $84 makes it cheaper than the other options.  I have the Fire Phone too- at age 62 it's my first smart phone so I am greatly enjoying it", "verified": true, "helpfulness": "1/1", "author": "Live to Ride"}]