[{"rating": 4.0, "review": "I would like for the voice search to work when I am inside apps.", "verified": true, "helpfulness": "0/0", "author": "Colton"}, {"rating": 5.0, "review": "My family and I had to move into a hotel for a month after our house sold too quickly, and after becoming accustomed to a DVR, we did not want to go back to live TV.  With this box, we are able to watch all of our favorite shows on Netflix, Amazon Prime (which includes a bunch of originals my family loves), listen to Pandora and Spotify, see all our photos and videos in our Amazon cloud, and play games like Minecraft and Minion Rush.  I can also rent movies through Amazon and a couple other apps.  The only app not on here that I would like to see is Vudu because we have purchased a ton of movies there that we watched on our smart TV.  We have found this to be a much better alternative than the sticks out there because it has a lot more flexibility and doesn't require a second device to fling to the stick.", "verified": true, "helpfulness": "0/0", "author": "Jo Anne Johnson"}, {"rating": 5.0, "review": "Works great!  My mother and I love having this on our TV.  I want to get rid of our cable, and Fire TV in accordance with Netflix and Hulu Plus are getting us to the point where I expect to be able to pull that plug. This gives us access to so many programs (TV and movies), past and present.  Am so glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Sherri \"Sherri\""}, {"rating": 5.0, "review": "Faster and better than ATV.", "verified": true, "helpfulness": "0/0", "author": "Andre Dirani"}, {"rating": 4.0, "review": "Easy to install, Voice search is really good. I like it - great replacement for my non-functioning Roku-2.", "verified": true, "helpfulness": "0/0", "author": "Richard Logue"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Barbara ODonnell"}, {"rating": 4.0, "review": "The Fire box was very easy to install and worked correctly right out of the box. I also signed up for Sling TV. Amazon Prime alone is very a good product. I use it a lot., but by adding Sling TV my satisfaction with this product is much higher. I use the \"live\" TV through Sling TV as much as Amazon Prime. I have the ability to access ESPN through Amazon Prime TV, but it does not work very well. I would like to have more \"live\" access to news and weather. (Fox News and TWC). At this point, (one month of use), I would rate my overall level of satisfaction at \"very good\".", "verified": true, "helpfulness": "0/0", "author": "larry"}, {"rating": 5.0, "review": "Works far better than chromecast!!!", "verified": true, "helpfulness": "0/0", "author": "UCRDAVE"}, {"rating": 5.0, "review": "I love the Amazon Fire!  We have sketchy satellite  coverage when there is bad weather, but the internet is always there. And I am able to watch my favorite shows when I want to, not when they happen to be on TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it! Turned my standard TV into a Smart TV! Easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Tonya"}]