[{"rating": 5.0, "review": "I've tried countless devices to hook up to my TV so I can watch various stream apps. This one is a very nice solid device. The plus being that XBMC (now Kodi) works great so I can watch Netflix, Amazon Prime and my movie collection all in one device and not a single hiccup.", "verified": true, "helpfulness": "1/1", "author": "A. Gil"}, {"rating": 5.0, "review": "excellent I love it ... it arrived very quickly,setting it up was easy, all I needed was HDMI cable 100%", "verified": true, "helpfulness": "0/0", "author": "Rocio Deitch"}, {"rating": 4.0, "review": "I've been using the Amazon Fire TV box (about the size of double CD case) for a couple of weeks on my 1.5 Mb connection and it is phenomenal. I can stream tons of free content with no buffering, and the list of available apps/stations grows every day.You need a $100 per year Amazon Prime account to use the device, but the deal includes free 2-day shipping on all Amazon orders all year so I come out ahead. The box can also handle some games (controller sold separately); nothing a hard core gamer would get excited about, but OK for the rest of us.About the only downside I can see is that you can't expect HD images at the 1.5Mb speed, and you may need to pay fees or subscriptions to watch some things - especially sports. It generally takes weeks or months after release for movies to show up for free. If you can't wait you have to pay for it with a service like Netflix. It is also a little annoying that Amazon has chosen to lock up the home screen, making it difficult to customize it.I would recommend going with the box instead of the stick. The box has more memory and speed, and you can side load programs (like a browser) from a computer.Other than that, be prepared to change the way you watch TV. Devices like this make watching TV a much less passive activity. You need to make a list of the kind of stuff you like to watch, and then figure out what apps to load to get it (hopefully for free). Then, rather than sitting there surfing through hundreds of garbage channels for something/anything to watch, you will have to choose between thousands of programs you actually want to watch - and when you want to watch them. That's harder than you might think.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy setup.  Good connectivity,  Haven't used it much yet, but seems to work much better and faster than our internet capable Blu-Ray player.I would recommend this.", "verified": true, "helpfulness": "0/0", "author": "by2447"}, {"rating": 4.0, "review": "XBMC works very well with the fire tv. the only things i do not  like about the fire TV is: you can't skip the first start video and can't easily put and app on you home screen that you side loaded.", "verified": true, "helpfulness": "0/0", "author": "J. Henry"}, {"rating": 1.0, "review": "Streaming buffers or sluggish for some applications like Crackle, Dish, and some others despite eXtreme internet connection.Doesn't shutdown automatically application nor any button to switch off application when idle.", "verified": true, "helpfulness": "0/2", "author": "Amit"}, {"rating": 3.0, "review": "Anything new and current is extra. Other then that I'm still trying to figure things out on how it works. I do love that it hooks up and goes right through tv!!! Watching movies n such on lap top sucked lol.", "verified": true, "helpfulness": "0/0", "author": "fmlr6rider"}, {"rating": 5.0, "review": "Works much better than Roku.  My son tell me it is because it has a 5 gig buffering capacity which , according to him, is greater than Apple TV.  We have been able to stream shows without interruption. Simple to install and use.", "verified": true, "helpfulness": "0/1", "author": "Jackson"}, {"rating": 5.0, "review": "I had a 3rd gen Apple TV I bought in mid 2012 and apple still hasn't released another model since then (currently December 2014 when I type this) so I thought I should try this out since it was a cyber Monday special of $69.  It was well worth it and I ended up selling the Apple TV to make my money back.  I even gifted a friend a Firetv as well bc I know he'd like it so much.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 2.0, "review": "It arrived but without remote.  I thought one came with or is it just voice command", "verified": true, "helpfulness": "0/2", "author": "James Bisek"}]