[{"rating": 5.0, "review": "Works great. It is very easy to setup. It is to watch videos from your laptop, phone or tablet on a HD TV. All the people rated it one star either don't know how to use it or try to use it in a wrong way. This piece is well made. Whoever says it's not, I don't know what they were expecting. Yeah, it is plastic, it's not made of titanium. Setup is very simple and it just works. Streaming video from any device is just a click away. Best $35 ever spent. I am going to get more so I have one attached to every TV. Love it.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is a great product that will no doubt get better as more apps are made available.Very easy to set up. Practically sets it self up.  My only problem is that it will not work with VPN server's.", "verified": true, "helpfulness": "0/1", "author": "Ulfar"}, {"rating": 5.0, "review": "The Chromecast is exactly what I have been waiting on. I've been using it for about 1 1/2 months now and it works great. All I wanted was something to stream my netflix and capable of streaming other videos. This device has made my life so much easier, not having to fire up the ps3 or 360 every time I want to watch netflix is very nice. I know lots of people are upset because it \"lacks functionality\" of other devices...I don't understand this because there is no false advertising by Google on this one. You get exactly what they describe it as. Great device.", "verified": false, "helpfulness": "3/4", "author": "chad"}, {"rating": 1.0, "review": "I ordered this the instant it became available, expecting it to be the answer to my video streaming problems... but discovered all I can stream in YouTube and Netflix. Big deal, I can already stream those.  Oh well, I only wasted $35.", "verified": true, "helpfulness": "2/8", "author": "JavaSkull"}, {"rating": 5.0, "review": "I got this little device for my girlfriend. Really simple to use. Just plug it into your TV and control Netflix, etc, with your laptop or tablet. Cheaper, smaller, and more convenient than a Roku or other digital TV device.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Quick setup to learn that this guy doesn't have much in the way of features. No audio from plugins in Chrome tabs, iOS app is limited to Youtube and Netflix (of the apps I have installed). Not impressed at all. 720p is below my expectations, though the framerate is acceptable. Debating on returning it, or keeping it around to see how they do. Software's nascent, but out of the box, I really, really don't care to learn more, or \"try to get it to work.\"", "verified": true, "helpfulness": "6/9", "author": "Connor Penhale"}, {"rating": 4.0, "review": "Install and setup of this device was easy.  Playing YouTube videos from my laptop, tablet or phone works great.  Given that the YouTube experience is very poor on most devices except my TiVo, it's great to finally find a device that plays them without stuttering and re-buffering.  The Netflix app is quite nice too, although the app in my PS3 is was always serviceable.  For $30 it's a neat little device to tinker with.Seriously though, they need to rolling on some new apps for this device.  I've had it for about two months and had expected that Pandora and a few others would have been released by now.  Until then it's still just a toy with a lot of unrealized potential.", "verified": true, "helpfulness": "3/4", "author": "Cliff M."}, {"rating": 5.0, "review": "I love it.. I don't watch that much TV but now I can choose more than ever what to watch. Watching a lot of you YouTude. Never knew there were full length movies to be found there. Easy to set up.", "verified": true, "helpfulness": "0/3", "author": "Joanne T. Johnson"}, {"rating": 5.0, "review": "I have been using the Chromecast since its launch. I really like the device setup is really easy and your up and running in about 5 - 10 mins. One thing worth mentioning is the device requires a USB power source you can hook the supplied cable into a USB Port on the TV or into the supplied wall adapter. All my TV's have a USB plug so this hasn't been an issue for me but could pose a potential issue just check your TV first if you don't have a practical wall plug near by.Currently things supported: Youtube, Netflix, Google Play Music, Google Play Movies and TV. One thing to note is this device is like a stand alone device. It just uses your phone/tablet or whatever to receive commands. I figured this out one day when I started a movie on Netflix and left for the store, the movie continued to play because its not using your device to stream.Added support for HBOgo and Hulu are said to be coming and if company's continue to jump on board this will be a home run product for Google. It needs local media support would be very nice to send pictures from your phone or home movies of the kids playing in the pool.For $35 you cant go wrong!", "verified": true, "helpfulness": "1/2", "author": "David Thomas \"DT\""}, {"rating": 1.0, "review": "This device will NOT work on a 5G and 5G has been a standard for years!  Why would they bring out a device that can't work on an industry standard 5G network....  A bummer!", "verified": false, "helpfulness": "2/13", "author": "Meezer Lover"}]