[{"rating": 4.0, "review": "Would have given 5 stars if there were more chromecast compatible apps.  Easy setup and solid performance.  I really liked the way it can be powered by a USB port on my TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Greene"}, {"rating": 2.0, "review": "...so the Chromecast isn't great. It does a good job connecting to Youtube when controlled by my iPhone 5. There are times when I open the Youtube app and Chromecast doesn't show up as an option for playback. If I close and reopen the app, it usually shows up as an option that time. The Youtube app is pretty responsive as far as pausing and playing, but it can be awkward.Netflix of late has been absolutely dreadful. Titles that load fine on my computer are met with a \"Netflix is unable to play this title at this time\" error message when I try to use my iPhone 5 to play them on my Chromecast. The Netflix web site on my iMac now includes a \"cast this\" option when playing back a video, but the video wouldn't load on my TV. If I used the \"cast this tab\" option from the Chrome browser, that worked until I switched it to full screen and my TV went blank. Making the window smaller on my iMac brought the video back to my TV, but not the audio.This could be an isolated incident, but even when Netflix playback works well, the interface between phone and TV is awkward because when I wake up my phone and go to Netflix while a video is playing the app doesn't display the play/pause screen. Instead it goes back to showing My List or something and I have to touch the top bar to get back to the play/pause screen.The bottom line is that Chromecast is just clunky to use. If you want to play in the Google sandbox and you are reasonably adept at dealing with electronics, you'll get along okay but be prepared for frustration at least occasionally if not on a regular basis. I don't recommend it at all to anyone else. I think I'll try the Roku stick next.p.s. If you're setting up Chromecast from a Mac, you need to be logged into the Mac as an admin.", "verified": false, "helpfulness": "0/0", "author": "Christopher K."}, {"rating": 5.0, "review": "I love watching Netflix, HBO, my media servers, and YouTube on my TV using this. For thirty-five dollars you can had seemingly a hundred dollars or more of value to your not so smart TV; all you need is a laptop, smart phone or tablet to stay in the room.", "verified": true, "helpfulness": "0/0", "author": "Jason V"}, {"rating": 5.0, "review": "Didn't think I'd be into this video streaming, but man with the price of cable and those other dish type, so much to chose from out there.. Very easy to hook up. have enjoyed it..", "verified": true, "helpfulness": "0/0", "author": "jarhead"}, {"rating": 5.0, "review": "If you have limited network options for a simple flat-screen TV. And you already have one or more of the limited services you can access. I use NetFlix and YouTube occasionally.  Couldn't be happier with the price and performance.", "verified": true, "helpfulness": "0/0", "author": "Richard Carlin"}, {"rating": 5.0, "review": "Never did I believe this little gizmo could do what it said it could. I got it for my husband for Christmas (but it really benefits the whole family.) He spent about a half hour fiddling with it, resetting things, etc. and voila! Netflix on the big screen. Photos from our vacation from my iPhone on the big screen. Planning our trip to Europe with 6 friends--showing all the sites on my laptop on the big TV screen. I love this thing and my kids use their smartphones to stream stuff--very easy.", "verified": true, "helpfulness": "0/1", "author": "Heather A. Henry \"BookBug\""}, {"rating": 5.0, "review": "I own both and was extremely optimistic for the Roku product. Plex integration is my primary concern but there are a number of other uses as well. Chromecast is all about displaying content. There are no on-screen menus or remotes to navigate. You use your phone or tablet, find the content you want to display and \"cast\" it to your TV. The simplicity and efficacy of this is remarkable. You get to experience the richness of the full Android/IOS app (youtube, plex, etc) and all that goes to the TV is what you actually want to watch. Roku provides a vast library of connected services and excels at searching for content but navigation on the streamstick is very slow overall. I really don't like having to use another remote and forget about universals unless it's wifi capable. Also the user experience of the Roku apps is not always great, the Plex app for example is very basic and plain. Additionally I experienced some occasional streaming performance problems on the Roku. After having used both products for a while I was surprised to end up preferring the Chromecast after having such high hopes for the Roku. If you don't mind using your phone, tablet or PC to choose content to display on your TV, Chromecast is the way to go!Pros:-Inexpensive-Simple (connect to wifi, cast almost whatever you want)-Performance is fantastic. 1080P streamed over wireless with no issues or lags at all.-No additional remote (may be a con for you)-Awesome Plex integration!!!Cons:-Some services are not compatible (amazon instant video)", "verified": true, "helpfulness": "0/0", "author": "P. Fine"}, {"rating": 5.0, "review": "Chromecast Media Player has got to be the best kept secret around. I had no idea it exist until I heard a co-worker talking about it. What I like about it is that it gives me the full benefit of movie watching on T.V. without paying movie and rental prices; Netflix subscribers will appreciate this beauty.  I would recommend this product to anyone who doesn't spend a great deal of time watching public programming but enjoy entertaining a movie every now and again.", "verified": true, "helpfulness": "0/0", "author": "Texas Girl"}, {"rating": 4.0, "review": "Everything as advertised and the chrome extension that lets you broadcast a tab is very helpful in making up for how few apps are currently supported by Chromecast. I suspect that will grow and the product will continue to get better, but so far a HDMI cable may have been better.By the time more apps are supported, I suspect it will more than justify the (very reasonable) price.", "verified": true, "helpfulness": "0/0", "author": "Patrick McWeeny"}, {"rating": 5.0, "review": "Excellent product, easy to use, much cheaper than similar products. Works as described, was able to hook up within 15 of opening up box.", "verified": true, "helpfulness": "0/0", "author": "Thinkman"}]