[{"rating": 5.0, "review": "Very nice gadget!", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Carvalho"}, {"rating": 5.0, "review": "Exelente", "verified": true, "helpfulness": "0/0", "author": "Roberto Meza"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "sADandSorry"}, {"rating": 5.0, "review": "You must buy this right away. I'm amazed how cool this little guy is. :)", "verified": true, "helpfulness": "0/0", "author": "Jaime L. Hansen"}, {"rating": 4.0, "review": "lave it", "verified": true, "helpfulness": "0/0", "author": "SIMIEL L. HARRIS"}, {"rating": 3.0, "review": "It works well on our newer TV, but when we try to use it combined with an ipad and an older TV its the pits.  It wont pause or even respond to the commands on the screen.  Very frustrating.  It seems to work better with iphone.  I have to reset the TV input 2 times before it responds.  The backlight on the little gadget is very bright.", "verified": false, "helpfulness": "0/0", "author": "Cyndi"}, {"rating": 5.0, "review": "Best $35 ever spent. /s/ What the heck is AppleTV? /s/", "verified": true, "helpfulness": "0/0", "author": "Ryan C Johnston"}, {"rating": 5.0, "review": "I love my Chromecast. I actually bought 2 of them after how useful the first one has been. This is a media device that powers up via usb on back of your tv, or it comes with ac adapter to plug in.For me I downloaded and paid for PLEX PASS which lets you stream anything from your pc to chromecast.I also have the following apps installed on my chromecast that I use regulary.HBO GO, Netflix, Plex, Hulu, Youtube, and Google play movies. So honestly to be able to use all of these apps on my TV makes this device such a no brainer.So if you want to rent a movie you can through Google play store which is almost always cheaper than your cable provider!", "verified": false, "helpfulness": "0/0", "author": "49erJoe"}, {"rating": 5.0, "review": "ok", "verified": false, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I love these things. they make a great gift and they keep getting better with updates.", "verified": true, "helpfulness": "0/0", "author": "Eden"}]