[{"rating": 5.0, "review": "Awesome! Great for those days when you want to watch Netflix but feel like your actually watching TV. Now just can't wait until you can stream non-internet items as well! that would be cool.", "verified": true, "helpfulness": "0/0", "author": "Mok"}, {"rating": 5.0, "review": "Works well. I could not make it work with my router. I purchased a new Linksys router/wireless and it then found this device and has been working ever since. Works with my iphone or computer to show anything I can get on my laptop screen on my TV screen.", "verified": true, "helpfulness": "0/0", "author": "rsdata"}, {"rating": 5.0, "review": "Absolutely love this !!! A must have", "verified": false, "helpfulness": "0/0", "author": "anthony delcorso"}, {"rating": 5.0, "review": "second one in house", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 4.0, "review": "Very happy with this device. However I wish I could watch more shows with it. As a example abc, nbc, cbs, espn.", "verified": true, "helpfulness": "0/0", "author": "kereese75"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeffrey J. Coleman"}, {"rating": 5.0, "review": "It works great. Though it's a shame there's no support for Amazon Instant Video (yet).", "verified": true, "helpfulness": "0/0", "author": "David L. \"Holonboy\""}, {"rating": 2.0, "review": "It was used for just a month before it stopped working.", "verified": true, "helpfulness": "0/0", "author": "Sunnysony"}, {"rating": 3.0, "review": "I bought it for traveling. I spend a few days per week in a hotel, this doesn't work on a lot of hotel networks. I read some of the work arounds and purchased the ASUS multi pocket router. I'm hoping that solves the issue.", "verified": true, "helpfulness": "0/0", "author": "amazon-aholic"}, {"rating": 2.0, "review": "Chromecast worked fine for streaming Netflix and that sort of thing, but its abilities to stream local media are basically non-existent. I set it up to stream content from a local Plex server, and it could barely do this; it would glitch and freeze every few minutes. This was not the fault of the Plex server, because it could stream fine to my iPhone with no log or freezes. Chromecast is okay for corproate streaming content but steer clear if you want to watch your own things. What a bummer. I regret my purchase completely.", "verified": false, "helpfulness": "0/0", "author": "David C"}]