[{"rating": 5.0, "review": "It's great... can watch all the good stuff on netflix and amazon... have not tried other yet but will", "verified": true, "helpfulness": "0/0", "author": "zoomer"}, {"rating": 5.0, "review": "Awesome product... glad I bought it", "verified": true, "helpfulness": "0/0", "author": "Jaime Jara"}, {"rating": 1.0, "review": "No it's not for me it's 2 aimed towards an amazon prone", "verified": true, "helpfulness": "1/4", "author": "Justin"}, {"rating": 3.0, "review": "Recently received this product for Christmas, and was eagerly anticipating using it with all of the movies I had been watching prior to it's release, including Captain America, The Avengers, a couple versions of Iron Man, Thor, etc.,etc. Unfortunately, the film vault dried up, with almost none of the films I had recently watched via Amazon Prime through the computer as available to watch on the TV. I feel ripped off. I have no desire to slog through the back of grade B and C movie catalogs to waste months watching sub-par films. I would have thought that the number of films available would have increased with this new product release. Hopefully I'm wrong and the movies will gradually return.", "verified": true, "helpfulness": "1/1", "author": "Verclear"}, {"rating": 5.0, "review": "so far so good. have watched a few movies and found everything worked as it should however I have not been able to get the voice activate part to work.. I will call Amazon cust. service  and am sure  it will be addressed.. Thank U amazon..", "verified": true, "helpfulness": "0/0", "author": "waynes world"}, {"rating": 5.0, "review": "Easily added the Amazon Fire TV to my home theater and network.  Now I can watch what I enjoy whenever I want.", "verified": true, "helpfulness": "0/0", "author": "K. Howard"}, {"rating": 1.0, "review": "you charge for each movie or tv show", "verified": true, "helpfulness": "1/6", "author": "Kenneth C. Shepherd \"Llamadad\""}, {"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "Sailor64"}, {"rating": 1.0, "review": "Got the Fire on my Sony tv. Wish the Fire was set up like my Samsung Smart TV-there is a list that comes up under the season such as Season 3, with all the episodes listed, they indicate which one have been watched already. I suppose my  memory may work for a while, but when there are 8 seasons with 10-15 episodes each, that may been very hard to do.To bad, it really is fast. I will give it a few days, then may get sent back...", "verified": true, "helpfulness": "1/3", "author": "Spot not Sport"}, {"rating": 5.0, "review": "Ok - by now you've read all the reviews.As far as tech stuff goes, I've got nothing new to add other than ... THIS IS THE BEST DAMN THING I EVER BOUGHT!The set up was so easy, a blind deaf mute man could do it. My only advice to whoever is reading this (except that blind man I just mentioned) youneed to buy Amazon's Fire TV ... push the button NOW!You won't seen regret this life changing decision!Why you still reading this - PUSH THE BUTTON!", "verified": true, "helpfulness": "0/1", "author": "Tim \"Snapple\""}]