[{"rating": 2.0, "review": "ONLY Connects to your TV in 1080p - no option to change to 720 or less. I use a projector, and component to hook up to it. It only supports 720p. All over this device they say 720p - but unless your TV / Projector supports 1080 - you wont see anything!What type of 1080p TV does not have smart tv built in? Not many. If you're hoping to use this on an older TV or Projector, good luck.Why would google do this? No options to downgrade the resolution?", "verified": true, "helpfulness": "0/2", "author": "Jan Ostrowski"}, {"rating": 5.0, "review": "Purchased this for my son for his 21st birthday -- it is what he wanted!  He loves it!!!  I guess it does many more things than I could understand but he said it is fantastic for connecting directly to the internet AND he can somehow display his laptop directly onto the big screen TV now...go figure!!!", "verified": true, "helpfulness": "1/1", "author": "D. West \"DogzMama\""}, {"rating": 3.0, "review": "I am still trying to figure out its application, what can I cast to my TV, from where can it be cast, etc.", "verified": true, "helpfulness": "0/0", "author": "Wayne Curtis"}, {"rating": 4.0, "review": "Good start at a cheap price, just that it needs to support more apps and add support for playing of local content from android and chrome devices (after all it's from google and i expect at least the entire google ecosystem is supported here).", "verified": true, "helpfulness": "1/1", "author": "Sudeep"}, {"rating": 2.0, "review": "only chrome can be shown on the tv, it would have been perfected if everything on my device could be seen on the tv. that's why i returned it.", "verified": true, "helpfulness": "1/3", "author": "Joe W."}, {"rating": 5.0, "review": "The Chromecast does exactly what it says it will do and does it very well.I have a ROKU. It's a great device, but it doesn't support Youtube.Bummer!Chromecast does have support for Youtube videos..For $35 my problem is solved.Simple!", "verified": true, "helpfulness": "0/0", "author": "BobInTulsa"}, {"rating": 5.0, "review": "Phenomenal, setup is a breeze, it does precisely what it says on the 'tin' and I recommend it to absolutely everyone I meet.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 2.0, "review": "Not good as other streaming devices; I think google failed again on streaming device area. I tried google tv it was epic failure and this continues too. Roku actually rocks in streaming videos.", "verified": true, "helpfulness": "0/0", "author": "vipin"}, {"rating": 5.0, "review": "Amazing and simple video streamer. Works great with Plex. Real easy to connect to home network and cast or stream to TV.", "verified": true, "helpfulness": "0/0", "author": "Stan Laudon"}, {"rating": 5.0, "review": "The Chromecast device is well worth the money just for $35 you don't have to worry about having cables all over the floor", "verified": true, "helpfulness": "0/0", "author": "Bruce Proctor"}]