[{"rating": 4.0, "review": "I hopped on the Chromecast bandwagon as soon as I could. I mean the marketing was perfect, for 35$ you can stream everything from your android device to whatever is open in Google chrome on your computer. Sounds perfect till you actually start looking for apps that Google is allowing to use it. When i first got it Netflix and Google's Play Apps and Youtube were the only thing that were available that I found myself to use. Now we have AVIA, HBO, and a couple other apps. Avia is what is needed to stream photos, music and videos from your phone. Google Play Music ******WILL NOT****** play music sideloaded from your phone on the Chromecast, that means no music you physically put on the device will be playable through Google Play Music on Chromecast!! (This is where AVIA comes in handy) Only music uploaded to Play Music \"Cloud\" will work with Chromecast. This didn't really affect me because about 90% of my music is stored on the \"Cloud\", but I did find it annoying when I did have a track that I downloaded from my phone that I wanted to listen too. I'm still waiting for more apps though, as of this review there aren't any games that you can stream, and still not a whole lot of apps in general. Overall, for 35$ I'm not disappointed. I got a little less than what i wanted but it still awesome! I still find myself using it nearly everyday, the user interfaces are a lot easier to navigate through compared to the PS3.", "verified": true, "helpfulness": "0/0", "author": "Steven Willoughby"}, {"rating": 1.0, "review": "This device forces the buyer to install and use the Google  Chrome browser  on one's PC in order to make the gadget function. Chrome can disrupt the operation of Mozilla Firefox, my preferred browser,,", "verified": true, "helpfulness": "0/0", "author": "Walter M. Smith"}, {"rating": 2.0, "review": "Still not a polished product.  I didnt realize when buying it that it also broadcasts what I have in a particular Chrome tab.  Getting my local music files, movies, home videos, and pictures to play on the screen is a total pain.  There are ways around it, but at the end I just gave up.  It's basically only good enough to play youtube on your TV at this point...", "verified": true, "helpfulness": "0/0", "author": "twin11 \"twinturbo11\""}, {"rating": 5.0, "review": "So easy to setup and use.  I use my Android phone and Tablet to control the Chromecast (like a remote) and play media from various Chromecast compatible apps (YouTube, Netflix, Hulu+, HBO Go, Pandora, Google Music/Video, Plex, BeyondPod)Cheaper and in my opinion better than the Apple TV, Roku or other similar devices.", "verified": true, "helpfulness": "0/0", "author": "Kristin Peterson"}, {"rating": 5.0, "review": "Real Player allows you to play personal videos over chromecast. This is very simple to use and set up. I really like how when you press cast on your phone or computer it switches over the tv to the correct HDMI input.", "verified": true, "helpfulness": "0/0", "author": "RRISSLERR"}, {"rating": 5.0, "review": "Only found out about this when my brother asked for it on Christmas. Arrived in timely manner, he loved it n I was very impressed by its function", "verified": true, "helpfulness": "0/0", "author": "Heriberto"}, {"rating": 5.0, "review": "If you don't have a smart TV yet (with web capabilities built in), but you have a TV with an open HDMI port, Chromecast is simply amazing!  It sets up and syncs as quickly and easily as Google claims, and you will be watching Netflix, YouTube, etc., or listening to your favorite songs via Pandora, ALL on your TV via this simply dongle!Another great, easy-to-use, make-life-simpler, product from Google!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The concept is nice but I wish it could project more information from a Nexus phone.  Maybe there is way to share more tablet/phone information to a bigger screen.", "verified": true, "helpfulness": "0/0", "author": "Jim Kendall"}, {"rating": 5.0, "review": "This is/was the coolest gadget in 2013 and no wonder why a must have for all geeks and TVs in the house. I also bought three as gifts, way cool to give someone special.", "verified": true, "helpfulness": "0/0", "author": "David J. Baxter"}, {"rating": 5.0, "review": "I have been using the product since last 2 months and find the product to be excellent device to play from your laptop / desktop / tablet / Smartphones.So far I rate this product at 5/5. I have not experienced any issues with the product.", "verified": true, "helpfulness": "0/0", "author": "SUDHAKAR SRIKANT"}]