[{"rating": 3.0, "review": "It has potential, but is too limited at this time for what you can stream. It only supports a single window at a time to cast. As more and more apps are supported, it will be a go-to device. Right now, it does pretty much the same thing as my DVD player.", "verified": true, "helpfulness": "1/1", "author": "Steve Marlin"}, {"rating": 5.0, "review": "Great product, excellent delivery time.  Easily installed, video quality is first rate.  There needs to be an interface with the disc drive  on a computer, but I understand that will come in time.", "verified": true, "helpfulness": "0/0", "author": "Young Brothers General Merchandise"}, {"rating": 2.0, "review": "I couldn't connect to one system in one of my homes (Even Google help couldn't assist me) and tried it on another house in another state.  It worked on the second system but kept freezing.  Not worth it until they get the bugs out", "verified": true, "helpfulness": "1/1", "author": "Frank Towers \"bronxguy\""}, {"rating": 3.0, "review": "It work good........but if you have apple products you are looking to use with it you should look elsewhere. (Only run U tube) bought an Apple TV an that works great.", "verified": true, "helpfulness": "0/0", "author": "Willie0013"}, {"rating": 4.0, "review": "Really needs to have the API opened up to developers! There are a lot of features that need to be implemented (well), like streaming files from a computer to the Chromecast, gameplay, etc. Stuff that opening up the API would create the opportunity to be made by third parties.", "verified": true, "helpfulness": "0/0", "author": "Jorgamun"}, {"rating": 4.0, "review": "Works great.  It has improved now to the point where it will automatically switch my TV to the right input source for the Chromecast when I start casting, so I don't have to look for the regular remote control.We need the ability to stream personal videos and pictures. I imagine that the personal stuff has been blocked for personal security reasons.  If this is the case then users need to be informed that if they are streaming over a shared network that there is a possibility that the personal stuff may be intercepted.  Then we can adjust and use the device accordingly.I like it enough to have purchased 3. Even if the TV has smart apps I find that searching for content is much easier from the Android device than it was with a Traditional TV or Blu Ray remote control.", "verified": true, "helpfulness": "0/0", "author": "N. Keith"}, {"rating": 5.0, "review": "Doesn't work outside of the US the way you can operate other US-only streaming devices (roku or apple tv). But for the price it's good enough for the YouTube only airplay-like functionality.", "verified": true, "helpfulness": "1/1", "author": "Hatim Alkahily"}, {"rating": 1.0, "review": "Can't access my local media. Keeps saying can't access internet, even though wifi network has a dial-up link that other PC's on the network can access.", "verified": true, "helpfulness": "0/0", "author": "Rob Egly"}, {"rating": 4.0, "review": "It's a maturing product like all of Google's products.  Very simple to setup.  Works great but there is a slight delay from your PC or what ever device to the picture on the TV.  All in all I like it and hope they continue to improve it.", "verified": true, "helpfulness": "0/0", "author": "Matt steffen"}, {"rating": 3.0, "review": "It works and all but very limited on the Apps that I can use with it. I only am allowed 2 Apps (You Tube & Play Music). I surely hope more Apps will be available real soon. Can't use it much at this time.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}]