[{"rating": 5.0, "review": "Just got this a few days ago.. Works great with Netflix and prime video, the only two things I really use. I've already sideloaded a few android apps that are working great as well, a file explorer and some emulators. Very snappy performance and lots of possibilities for software tweaks to further expand functionality.", "verified": true, "helpfulness": "1/1", "author": "Mtdpaiste"}, {"rating": 4.0, "review": "Very happy with this product easy for my daughter to use and great parental features. The voice feature is amazing it actually understands you and you don't have to struggle with it like I have to do trying to use Siri", "verified": true, "helpfulness": "0/0", "author": "deann vaughn"}, {"rating": 5.0, "review": "Outstanding.  Clarity is outstanding.  Far better that Apple TV.", "verified": true, "helpfulness": "0/0", "author": "C. Cooper \"BigRot\""}, {"rating": 2.0, "review": "This product is not live streaming as advertised.", "verified": true, "helpfulness": "0/7", "author": "dominic asamoah"}, {"rating": 5.0, "review": "This has far exceeded my expectations!  I received it as a gift!  It is simple to set up!  After that......not too much to say!  Movies, TV, Music, Games.  Wow!", "verified": true, "helpfulness": "0/0", "author": "R. Olohan \"bobby o\""}, {"rating": 5.0, "review": "My TOTAL TV experience. I love it so much I bought my daughter one and plan on buying another one for my bedroom! I am a Amazon believer.....", "verified": true, "helpfulness": "0/0", "author": "Judy Olney"}, {"rating": 5.0, "review": "Easy set up!!!  works great.", "verified": true, "helpfulness": "0/0", "author": "Steve McLaughlin"}, {"rating": 5.0, "review": "Beyond happy about this. Very easy to navigate. Much better than roku. I love the little remote... It's easier to use to type than most others. The only disappointment I have is that I haven't seen anything for Amazon music on there. It's nice having all my photos and videos on there but where's the music?", "verified": true, "helpfulness": "0/0", "author": "B. Sy"}, {"rating": 3.0, "review": "don't really have the time to play with it as much as I like to but the few times that I've used it I've enjoyed it", "verified": true, "helpfulness": "0/0", "author": "Robert R."}, {"rating": 1.0, "review": "If it weren't for Apple, non of these companies, totally lacking in imagination (Google, Microsoft, Amazon), would have no one to copy, and we'd still be using PCs with green screens!", "verified": false, "helpfulness": "2/20", "author": "Thinkman \"SmartEnoughToKnowBetter\""}]