[{"rating": 5.0, "review": "It came faster then expected. Hooked it up And connected it with my samsung galaxy tab 4 and it works 👍 recommend it", "verified": true, "helpfulness": "0/0", "author": "shady"}, {"rating": 4.0, "review": "It is a great thing if you don't have a Smart TV or a video game console but if you live outside the US you are not going to be able to stream Netflix or YouTube from the US because the Chrome gets the IP address form your current location.", "verified": true, "helpfulness": "0/0", "author": "Sol"}, {"rating": 3.0, "review": "Awesome technology; very easy to use and set up...The only setback is that there is an audio delay if you stream videos from your computer to the TV. It's only one problem but it really kills the whole experience, especially if you are getting Chromecast mainly so that you can watch something from your computer on a larger screen.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "alicia zanders"}, {"rating": 4.0, "review": "A great addition to our home!  Previously used a long HDMI cable from PC to TV, but a new, larger apartment made that impossible.  Chromecast gets the job done.  Still no support for DVD's (Other than creating a mkv from the disc, which is a waste of HD space in my opinion) but with the Videostream add-in you can cast videos from  your computer, as well as Netflix, youtube, and others.  Uses of the Rhapsody music service can even cast music from your smartphone app.The only downside (and the reason for 4 stars) is that sometimes I have to \"play\" with netflix to get it to work.  Usually I have to start casting (the connection fails but lists as 'casting') then stop and restart it, after which it works 100%, but tha'ts a bit of a niusance.  No issues streaming anything else here, though.", "verified": true, "helpfulness": "0/0", "author": "R. Franklin."}, {"rating": 1.0, "review": "was not explained right ,didn't tell me you had to join google in order to use this.", "verified": true, "helpfulness": "0/1", "author": "Donald R Daney"}, {"rating": 5.0, "review": "Works Great for streaming Netflix and other feeds to my TV.", "verified": true, "helpfulness": "0/0", "author": "NaspeDude"}, {"rating": 5.0, "review": "So easy to install and use.  I haven't had any trouble with it.  I watch lots of TED Talks on it.", "verified": true, "helpfulness": "0/0", "author": "Rochelle Yoder"}, {"rating": 5.0, "review": "Very good! It works very well with my S4.", "verified": true, "helpfulness": "0/0", "author": "Fabiano A. Souto"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Divine"}]