[{"rating": 4.0, "review": "I got this to watch my Amazon movies through my TV. It took a little figuring how to make this happen. I had to call Amazon and they helped me then they connected me with google to help with the rest but I did finally get to watch my Amazon library from my TV. I had to remove Microsoft Silverlight from my computer and then click on a movie and when the prompt came up to download silverlight or watch through Adobe I chose Adobe, then the Google rep had me use my google chrome connection and go into extensions and download the chromcast program then clicked on the chromcast icon box on upper right corner of my screen and approve screensharing. I had additional sound issue that I and the rep were able to figure out past that.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Chromecast doesn't hold a candle to Apple TV.  I was extremely displeased with this product, its difficulty to use and its limitations.  I suggest you don't bother.  Apple TV is far superior in every way and worth a few dollars more.", "verified": true, "helpfulness": "2/3", "author": "David McClendon"}, {"rating": 5.0, "review": "This works prefectly! I am able to view Netflix on any of my flat screen TVs. I love it. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Roger A. Phillips"}, {"rating": 5.0, "review": "Would definitely recommend this product. My husband found it easy to hookup to our tv and easy to use. Wonderful!", "verified": true, "helpfulness": "0/0", "author": "chrissy"}, {"rating": 3.0, "review": "I got it, set it up, all real easy, and started to cast something, everything seemed to good to be true. I noticed fairly quickly (by the 6th-7th time) that my wireless was not fast enough to handle live streaming programming. YouTube videos were fine but if you want to stream a sporting event or movie you will want to also go with the recommended speedy wireless/router.", "verified": true, "helpfulness": "0/0", "author": "Jared M. Koelling"}, {"rating": 1.0, "review": "Google has chosen to highly restrict what I can actually cast from my computer to the TV: with high quality, basically limited to youtube and netflix; cannot cast anything from Amazon; most \"cast this tab continually drops out, even though all other devices on my WiFi network are reading the signal fine.My suggestion: pass on this over-hyped restricted use item.Google at its worst . . .", "verified": true, "helpfulness": "2/3", "author": "Donn Clark"}, {"rating": 5.0, "review": "I am not sure what it is, but the person it was purchased for loves it and started streaming with it the day he opened it.", "verified": true, "helpfulness": "0/0", "author": "Sherrell Santana"}, {"rating": 4.0, "review": "Still looking for an app to port ANY video or just my entire laptop screen to the TV. This only allows you to port what is in your chrome browser or in the partner software (Netflix etc.)", "verified": true, "helpfulness": "0/0", "author": "Trent Freeman"}, {"rating": 5.0, "review": "I am not a tech person and I was able to get this set up on my tv with my ipad.  It is great for  using netflix.", "verified": true, "helpfulness": "0/0", "author": "Rebecca A."}, {"rating": 3.0, "review": "Love the Chromecast - hate the limitations on what I can currently stream with it .  Netflix, Flex and YouTube are not quite enough. Tab casting from a Chrome Browser doesn't work well so I haven't been able to enjoy my favorite video casts yet.  Google - please open up the APIs and let the developers go crazy!", "verified": true, "helpfulness": "0/0", "author": "Bill Stout"}]