[{"rating": 1.0, "review": "Terrible product.  Always freezing, constantly have to reset it. Many other comparable product out there, buy one of them.", "verified": true, "helpfulness": "0/0", "author": "Sean Hennessy"}, {"rating": 2.0, "review": "Redundant and standard video quality", "verified": true, "helpfulness": "0/1", "author": "SL Carrtel"}, {"rating": 5.0, "review": "We have really enjoyed steaming Netflix and YouTube through our smart phones.  Works every time and setup was fairly easy.", "verified": true, "helpfulness": "0/0", "author": "james bridges"}, {"rating": 5.0, "review": "I got one of these for Christmas, and procrastinated in setting it up. After discovering how easy it is, and how functional it is, I have cancelled my cable subscription, and bought one of these for every TV in my house. With the multitude of apps that now support the Chromecast, there is no need for me to have cable any more. I LOVE this!", "verified": true, "helpfulness": "0/0", "author": "DeadlyAura"}, {"rating": 5.0, "review": "Works great! I bought this product for all of my televisions", "verified": true, "helpfulness": "0/0", "author": "Christopher M Gale"}, {"rating": 5.0, "review": "Very good, is very good indeed", "verified": true, "helpfulness": "0/0", "author": "Ivano"}, {"rating": 4.0, "review": "Wishing it was powered by the TV versus having to plug it in but otherwise I love it#", "verified": true, "helpfulness": "0/0", "author": "TabB"}, {"rating": 5.0, "review": "Very nice addition to a basement room.", "verified": true, "helpfulness": "0/0", "author": "Martin Jones III"}, {"rating": 5.0, "review": "This has been absolutely fantastic. I love it!!! I can see all kinds of movies and shows on the TV while still being able to do other stuff on the tablet. This is just an amazing product and I highly recommend it if you don't want to throw away your perfectly good TV because just you can't use Netflix on it.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 2.0, "review": "Not so good", "verified": true, "helpfulness": "0/0", "author": "roger fields"}]