[{"rating": 5.0, "review": "This is great", "verified": true, "helpfulness": "0/0", "author": "N. Thomas \"nancynurse\""}, {"rating": 5.0, "review": "Very user friendly. Happy with this purchase. Was able to cancel my cable which was rarely watched.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "I really enjoyed the fire tv my family really enjoy it", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "We have had difficulty getting a good wireless connection with our 70 inch tv and Netflix and similar programs ran poorly.  Fire TV has been great, a strong connection every time (although sometimes an issue when the microwave is running) along with a wide variety of included content, as well as links to pay services and games.  Already being Prime this arrived already set up for our account and has been a great asset so far.Highly recommended if you want to wirelessly add content to your viewing experience.", "verified": true, "helpfulness": "0/0", "author": "Raymond Buettner"}, {"rating": 3.0, "review": "I don't like the fact that there is no power button to turn console off sometimes it automatically works(meaning it turns off) sometimes it does not(meaning it stays on)", "verified": true, "helpfulness": "0/0", "author": "jens"}, {"rating": 4.0, "review": "Returned first one due to slight darkness in the video signal... the second one works great,,, I really like it...Can not display my computer on TV like Google Cast can...", "verified": true, "helpfulness": "0/0", "author": "Don M."}, {"rating": 5.0, "review": "Switching from ROKU and the Amazon Fire Stick took some learning.  If you are new, not every step is labeled; just have fun trying.  Then you too will see how easy things seem and you will say \"duh\" as well.", "verified": true, "helpfulness": "0/0", "author": "Searcher"}, {"rating": 3.0, "review": "I have ROKU 3 and Fire TV, I get it when it's on sale...and this is for my future bedroom TV but for now I have both Roku and Fire TV side by side installed on my living room TV. The other reason I buy Fire TV is to watch my Slingbox, ROKU require you to cast from ipad, Fire TV have the app...which is far better but the app need some work, it's slower then the PC version also the control have a lot of room to improve.The ROKU works flawlessly despite having slower processor and everything and it works great with Logitech Harmony Hub too...the only thing I cant do is watch slingbox directly from the app. To me, it feels like the software is more developed and optimized.Fire TV feels slower, especially on HBO GO....it lags, doesn't seems to work well with Harmony hub. Pressing the button on harmony remote sometimes doesnt work, and it have slower response...the fast forward doesnt work on HBO GO. The software might have bugs and not as stable as ROKU.If ROKU fix slingbox app, Fire TV have no chance. Also I got it at a good price, so I'll keep it and see if Amazon will fix the issues on Harmony Hub and HBO...for now I'll use my ROKU.", "verified": true, "helpfulness": "0/0", "author": "Socal Resident"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mrs Margaret J Fonner"}, {"rating": 5.0, "review": "I love this better then tv", "verified": true, "helpfulness": "0/0", "author": "josh"}]