[{"rating": 5.0, "review": "Fire TV works fantastic.  I play my Netflix, Hulu, and Amazon Prime movies through it.  The microphone search in the remote control works great... and you can play games!", "verified": true, "helpfulness": "0/0", "author": "Appjunky"}, {"rating": 3.0, "review": "No ability to stream all of your music from your computer unless you sign up for paid Amazon cloud service for $24.99/yr.!May be returning it.", "verified": true, "helpfulness": "1/4", "author": "Gary G Bartley"}, {"rating": 5.0, "review": "I just gotten it the other day and I havent figured out all the great things it can do, but for the most part I love it very simple and easy. it makes my t.v. time much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Tye"}, {"rating": 5.0, "review": "Have resisted acquiring similar products because of an old guy's dread of additional electronic complications. Seemed simple in reviewers comments however (set-up and use) and--- it was. I was prepared for at least a few minutes of download (like Ebooks) but to my surprise I requested \"Flyboys\" and it was available immediately. Amazing! Both \"the box\" and the movie. My only other use so far has been a thing called \"Guilt Trip. A truly horrible movie - but, can't blame \"the box\" for that can we!", "verified": true, "helpfulness": "0/0", "author": "Felix M"}, {"rating": 3.0, "review": "It came and was kinda finicky getting connected to our router and then downloading its upgrade.  Eventually, plugging and unplugging it, it connected.Up front--I couldn't care less about the games so I can't rate that part.We have Rokus so compared to those the remote just feels right in your hand and the voice recognition works great.The picture looks super, and I feel like I have access to a ton of stuff on DVDS so for entertainment, sitting on the couch I think it would be great.  However, I want local news, up to date weather, business reporting in real time at my desk and that I can't find.  I originally thought some of this could be corrected by Aereo, but, unlike Roku 3, it doesn't support Aereo (yet, I guess).  So I knocked off 2 stars.  It can't replace real TV yet. As for sending it back--I will hold on to it for its potential and move it to a TV near a couch.", "verified": true, "helpfulness": "1/3", "author": "peb \"house&tool;_wife\""}, {"rating": 3.0, "review": "Pros:Device setup is quick and painless, navigation intuitive, video and sound quality is acceptable.Cons:Would have liked for Amazon to include the ability to play the digital music I purchased at Amazon and have uploaded to the Amazon cloud as well as the ability to connect to my home NAS to play music, pictures and videos.  Maybe one day they will get it right…Gaming – not impressive at all.I’d still recommend purchasing if you wish to add Netflix, Hulu or Prime to another TV in your house.", "verified": true, "helpfulness": "0/1", "author": "Michael Fazekas"}, {"rating": 3.0, "review": "Very disappointed. Difficult install, the screen was flashing on and off. Finally traced the problem to the fire box cable plug. It was intermittent. I had a bunch of cables and finally found one seemed to work.Compared to the Roku the fire has very limited apps. The menu logic is nutty and different.Took forever to update. The network connection (my network is 12Mb and a tlink router that works great) was harder than necessary and limited. I would have liked a fixed IP option. The keyboard that popped up had weird logic. Note: keyboard logic changes with different apps. Drives you nuts.When playing Pandora the music would suddenly do a snap crackle pop and the same for the movies. Netflix worked best of all and the Amazon prime menus were goofy and prime did a lot of flickering probably due to having to reload ( no reload message). You have to real careful with A-prime as it is easy to accidentally order something.The sound search worked great, but only works on Amazon.The unpackaging was a pain in the A**. It was a Chinese puzzle ( I would fire the person that thought it up). The big problem was to figure out how to open the remote to install the batteries without breaking it. Totally illogical. Hint: the cover opens straight up.As for the games only kids and the simple minded, mess with that crap. To me it is a negative. If I want games I will buy a gamer.The screen saver was the best of all, very beautiful pictures.I am going to send it back and get a Roku 3. Pity, it seems like Amazon sent out a buggy box. I would wait about a year than buy it.", "verified": true, "helpfulness": "1/5", "author": "Tommy J"}, {"rating": 4.0, "review": "Okay, so I've been looking for a device where I can stream stuff like netflix, hulu, crackle, etc. Looked at a few devices and tried three, tried Netgears Push2TV device, Roku 3, and last but not least Amazon Fire TV. Netgears Push2TV device was a very nice concept and I would of kept it if it actually worked and had a stable connection. Was waaay to difficult to set up, had to update firmware and some other crap. Anywho, it worked temporarily with my cellphone's miracast feature but returned the device because it seemed to be malfunctioning and got the Roku 3, impressive because I liked having HBO GO and having the option to plug in earphones into remote, very NIFTY! Unfortunately not a lot of games and so I got Amazon Fire TV, LOVE IT! Has everything except HBO GO in which I hope that'll change, the voice search is an awesome feature...way better than having to manually input text with remote, the only complaint I have is not having a Miracast or WiDI feature, if Amazon was to add this, it would be a killer. You CAN view your own media EXCEPT movies (boooo!!!) once you upload your content to Amazon's cloud drive, hopefully you'll be able to stream w/e you want in the future. Very promising top box...for now anyway.", "verified": true, "helpfulness": "0/2", "author": "Jason"}, {"rating": 5.0, "review": "I bought this to replace a Roku box that had become slow and sluggish in recent months. The FireTV is much snappier and loads videos very quickly.I think the best part about this device is yet to be seen. It has powerful specs and a lot of potential, so it will be exciting to see new apps and games that will be released for it.", "verified": true, "helpfulness": "1/1", "author": "Sauer"}, {"rating": 5.0, "review": "I COULD NOT BELEAVE HOW GOOD THIS WORKS, WE HAVE AMAZON PRIME SO OUR CHOICES ARE ALMOST LIMITLESS AT NO EXTRA COST. SIMPLE TO CONNECT AND USE. THE ONLY QUESTION I HAD (BUT WAS ANSWERED ON ITS ON) WAS HOW AND DO I NEED TO TURN IT OFF. I FOUND OUT IT SHUTS DOWN AUTOMATICALLY. I WOULD RECOMMEND THIS TO ANYONE. I WAS WORRIED THAT OUR DSL WOULD BE TO SLOW BUT IT IS NOT. THERE IS SO MUCH TO WATCH WE DO NOT KNOW WHERE TO START. THANKS AMAZON.  VERY SATISFIED IN RURAL NORTH CAROLINA!", "verified": true, "helpfulness": "2/2", "author": "Johnnie Needham \"readsalot\""}]