[{"rating": 5.0, "review": "As Advertised", "verified": true, "helpfulness": "0/0", "author": "Gib Souza"}, {"rating": 5.0, "review": "Watch what you want. When you want. Where you want. High quality product and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jean Dautruche"}, {"rating": 5.0, "review": "Far exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "David H. Bortzfield"}, {"rating": 5.0, "review": "Have three of these, makes any tv with a HDMI connection port a Smart TV . WORKS VERY WELL.", "verified": true, "helpfulness": "1/1", "author": "stephan logan"}, {"rating": 1.0, "review": "Purchased it months ago and when I finally had the time to try to use it, it just didn't work.  The window to return it is over so I am stuck with a $40 piece of plastic.  The TV won't recognize it, WiFi doesn't...... it lights up but that is it.", "verified": true, "helpfulness": "0/0", "author": "Tamberlyn Hendrix \"Busy mom and student\""}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "Hung Le"}, {"rating": 5.0, "review": "Does what it says on the tin - if it has access to the internet, then the casting is done without needing to keep the caster unit running the stream [you tube for example].", "verified": true, "helpfulness": "0/0", "author": "Keith Nicolle"}, {"rating": 5.0, "review": "This device is the only reason I own a TV at all.  This is a dramatic improvement over traditional means of consuming media.", "verified": true, "helpfulness": "0/0", "author": "Rueben Ramirez"}, {"rating": 5.0, "review": "I love the fact that I can stream any movie or video to my TV while still using my cell phone for anything else. I have seen reviews regarding issues with videos streaming but I can tell it has nothing to do with the Chromecast. The movie loading time is almost right away. So my suggestion is to verify your internet speed and cell phone settings etc. My internet is FiOptic therefore the speed is constantly throughout the day, if you happen to have internet with a regular cable company for instance then your internet speed will fluctuate as you are sharing a hub with your neighbors. In summary this is a great product and the only complain I have read are not related to the product. By the way I am a Samsung user but if you have a google phone then you can play all your apps on your TV.", "verified": true, "helpfulness": "0/1", "author": "jmortis"}, {"rating": 4.0, "review": "Gave it as a gift ,I assume it works great a sI have not heard any thing  about it\"s performance", "verified": true, "helpfulness": "0/0", "author": "foolishfisherman"}]