[{"rating": 5.0, "review": "Works great!!  The picture that streams is amazingly clear.  There are no problems with pixilation or lagging with the video or sound.", "verified": true, "helpfulness": "0/0", "author": "Chanin Clark"}, {"rating": 5.0, "review": "I ordered Google chromecast as i wanted to project movies from my laptop to a TV. I can't be more happy with this purchase. Installation was a breeze and it took less than a minute to set up. We have been playing everything from movies to baby einstein and it has worked every single time. Very pleased. Awesome work Google!", "verified": true, "helpfulness": "0/0", "author": "Sameer"}, {"rating": 5.0, "review": "It was very simple to set up and it works great with all my devices.They do need and app so I can use my Kindle fire HD feature.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 1.0, "review": "Chromecast only works with apps that specifically support it.  I have many apps on my phone and tablet that chromecast ignores.  I'm not about to start buying a new set of apps just to use chromecast.  However, because of chromecast I learned about Allshare cast instead - that will cast anything on my phones screen, exactly what I thought chromecast was supposed to do.", "verified": true, "helpfulness": "0/1", "author": "ifitaintbrokeitwillbe \"you rush a miracle man you get rotten miracles\""}, {"rating": 4.0, "review": "Synced quickly with my devices, including apple and Samsung phone. Love the portability and instant access to Netflix wherever I am with the tiny device and my cell phone.While it would be better if it could do items in my Itunes account, I knew it wouldn't when I bought it. It loses a star because I can't get amazon prime videos to stream to my tv in full screen, only in the smaller viewing window with the junk all around it. That's annoying.", "verified": true, "helpfulness": "0/0", "author": "Jodi"}, {"rating": 3.0, "review": "The Chromecast did not function very well as my internet connection.was to slow and kept turning off. to.  Returned the item.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy setup.  Flawless streaming.  Wish there were more applications for streaming movies are tv episodes.  Also wouldbe nice to stream movies already downloaded and saved on my tablet.", "verified": true, "helpfulness": "0/0", "author": "Maenovia Mitchell"}, {"rating": 1.0, "review": "It sounded great but was a disappointment and I returned it.  It didn't work with my Macbook because my operating system is OSX 10.5.8 and this device needs 10.6.  I tried it on my Android phone and it gunked up my phone and my wireless router.  I had to troubleshoot both devices to get them working again, wasting a lot of time.  Help for installing this device is hard to find.  Another feature I didn't like is that signup requires access to Gmail contacts and way too much invasion for my taste.  I realize Google is bent on world domination, but I don't want to play.", "verified": true, "helpfulness": "0/0", "author": "lee ostermann"}, {"rating": 5.0, "review": "Love the chromecast. Use it to stream videos from my phone and can do other things at the same time. Also does not eat up your battery power.", "verified": true, "helpfulness": "0/0", "author": "Olu"}, {"rating": 1.0, "review": "Bought with the idea that there would be lots of ways to use it. So far, Youtube and Netflix are the only apps that work, and they work pretty well, when they work. I've rebooted the unit by power cycling it several times. It seems it updates its own software whenever it wants so there's no way to stop it when the unit is stable. Its more or less a playground device for Google engineers to launch whatever software they want on my TV / Device. I feel more like I've provided a living space for some group of hackers than I actually bought something I own.Other than that, the video quality is surprisingly good for 720p, and if I actually knew it wasn't tracking my every move, I'd feel more comfortable using it. Perhaps someday in the future, we'll know what its actually doing, who is watching what I'm watching and gain a bit more control over the device.I'd hoped Google would provide these devices for free, with a movie subsidy, since its a data collection device and I'm giving up my privacy to use it.", "verified": true, "helpfulness": "0/1", "author": "Orcasaurus"}]