[{"rating": 5.0, "review": "I love, love, love Amazon Fire Tv! We have Direct Tv in our house, but my husband and I purchased this to go in our bedroom. We love it! I'm a re-runs girl, and the vast library of different shows that amazon provides is just what I wanted and needed! Amazon provides all the seasons of my favorites shows through Prime membership, and my husband enjoys watching movies and listening to pandora. If you are an HBO fan and wish you could re-watch some of the mini-series, this is right up your alley as well.I would warn anyone considering purchasing this that unless you have a Prime membership, you'll definitely want to purchase a netflix or Hulu account to make this worth your money. I canceled my netflix account once I bought this because Prime offers such a great variety that we didn't need it!For anyone wondering, the speaker/microphone search works amazing!! I never have to type anything out!!Would definitely buy again!! Set up is easy and quick. Worth every penny!!", "verified": true, "helpfulness": "1/1", "author": "Lcollins"}, {"rating": 4.0, "review": "My only suggestion would be to have an easier way to find the free movies etc.  Otherwise we love it!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"ragtoppat\""}, {"rating": 4.0, "review": "I love this little device.  I found this device very useful when traveling with the family.  Plugging this into a hotel TV is terrific.  I use it mostly at home and love the interface to many of the applications I use on my tablet and phone.  The only complaint I have is that you can't connect to WiFi networks that pop browsers for credentials.  Otherwise, the YouTube and Netflix apps work terrific and it's very fast.  I have a terrible internet connection at home but still loading videos with this is terrific.  I think this is one of the best internet entertainment solutions available for the price.", "verified": true, "helpfulness": "1/1", "author": "James Cotugno"}, {"rating": 5.0, "review": "I love it! It couldn't be easier to install, and to use, and the price is great! I bought it to replace my Chromecast because it gives me everything Chromecast does, PLUS something Chromecast does not, Amazon streaming. In fact it was the realization that because my Chromecast was limited to Netflix, and the realization that they have a much smaller streaming selection than Amazon that prompted me to buy Fire TV. Another great thing? Unlike Chromecast, you don't need to use use your computer; it taps right into your wireless router! Great product!", "verified": true, "helpfulness": "0/0", "author": "mbpinnyc"}, {"rating": 5.0, "review": "A fine entertainment hub. Wish I had a teen to help me take more advantage of its features.", "verified": true, "helpfulness": "0/0", "author": "Tim Johnson"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Laura Carno"}, {"rating": 3.0, "review": "I like that Roku has an App I can use to control it. Amazon Instant App is not available for phones. Netflix is better than Amazon Instant and Roku is better than Fire TV, in my opinion.", "verified": false, "helpfulness": "1/2", "author": "paulg"}, {"rating": 5.0, "review": "Easy hookup works great!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "So after having a few days to play around with the Fire TV, I thought I should take a moment to give my thoughts on this little black box. Maybe I can be helpful to some of you who are on the fence with the Fire TV.  First off the closest thing I can think of to compare this to is obviously a Roku streaming player, it connects to the internet and has applications that stream content to your television. Amazon has done a fantastic job getting applications of major players on their product. Netflix is here, WWE Network is here, Pandora, Hulu Plus, Crackle, the machine has a lot to wet your appetite. The only glaring omissions right now are HBO Go, and VUDU. HBO Go however is set to arrive later this year, from my understanding.  The interface is simple, clean, snappy, and responsive. It certainly didn't hurt for Amazon to throw a little muscle under it's tiny hood. Apps start quick, and in my short time with it, I've had zero crashes. The unit does what it is advertised to do, and does it better than the competition at the same cost. Apple TV and Roku 3 are the same price, and unless you are locked in to Apple with a ton of purchased content from them already, then you have no reason to not pick up this unit if you are looking for a streaming device.  I found the remote to be a tad small, and didn't feel as sturdy as the unit itself. It doesn't feel cheap, but it seems like you press too hard and it is going to snap in half. The voice search is neat, and it works fantastic, but it is not a feature I personally feel sets it apart from the pack. I like to browse the movies, shows, and games. Only in specific circumstances am I going to be searching for a certain thing, so this feature has gotten very little use from me. Throw in the fact that it doesn't work on things outside of Amazons own content, and that leaves me in the take it or leave it state of mind for that one.  Amazon Prime users should definitely own this unit, for the television, and movie streaming content alone. Amazon is bringing  Prime Music in the fall, and when that arrives this little box is a media goldmine for Prime subscribers. The selection on Prime is solid already, while it isn't as vast as Netflix, you add tons of albums to stream to your home theater included in the cost, and the value skyrockets. 30 days of Prime are included for you to try, if you aren't a subscriber already.  So why not the five stars? Why four? I purchased a game controller with the unit. I am not going to review the game controller itself, I will give my thoughts on it's own product page. I am going to be reviewing the game selection, quality and so forth. Amazon put the features in for this to also be an Android gaming console. The problem here is simple. A lot of the games I have played, and I have purchased quite a bit, have flickering, frame rate problems, or just control bad. Sure there is a gem here and there but a majority is throw away at best. Of course someone is going to come in and say what were you expecting, a Playstation 4? No not at all, I understand that a lot of this is going to be ports of mobile and tablet gaming. It's just that the quality is not even remotely there. Sev Zero is a start. If you are going to add something and tout it as a feature put a little ummph behind it.  But here is the biggest, strangest, and most baffling problem with the Fire TV. It has no external storage, and has 5 gigabytes free space when you purchase it. If you buy the three Grand Theft Auto games available for it, you are pretty much out of space. I have already bought enough games that I have to pick and choose what is installed on the machine, and what stays in the cloud. It's frustrating to have to look at file sizes before you buy a game. This product needs a patch to add support for external storage on the back usb port.  Outside of those problems this unit is great, and has serious potential. If they fix the quality of the games, address the storage issue, and get Prime Music up and running the unit is five star quality easy. Right now it sits at a solid four with me, and I recommend it to anyone looking for a nice entertainment streaming device for their televisions.", "verified": true, "helpfulness": "3/4", "author": "Stephen Bias"}, {"rating": 4.0, "review": "a", "verified": false, "helpfulness": "0/4", "author": "Tao"}]