[{"rating": 5.0, "review": "The Chromecast is awesome! Finally I now have a way of streaming my local media on my smartphone to my 42\" Vizio TV. Works great without issues.", "verified": true, "helpfulness": "0/0", "author": "Daniel Stamm"}, {"rating": 5.0, "review": "bought this for my son, he loves it and it was a great price", "verified": true, "helpfulness": "0/0", "author": "Kimberly M. Lotierzo"}, {"rating": 5.0, "review": "Excellent! Had to get rid of cable. Now (because of this), I can watch Netflix, Youtube... Easy to install as well!", "verified": false, "helpfulness": "0/0", "author": "Sketch5640"}, {"rating": 1.0, "review": "Doesn't work with my TV's hdmi input.", "verified": true, "helpfulness": "0/2", "author": "Ron D \"Ron D\""}, {"rating": 5.0, "review": "very cool,.i just wish they have more updates on apps", "verified": true, "helpfulness": "0/0", "author": "Sherry T."}, {"rating": 4.0, "review": "Works great with applications designed specifically for this device. Only I would like to be able to display more content stored on the device itself and not through an application. To view streaming content is very good.", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 2.0, "review": "Causes interference with the TV at times when we watch programming through the set-top box (it messes the image fully).Bought it to stream BBC iPlayer and it only streams live content!We have a smart tv that is already capable to connect to most of the other sites. So it's pretty useless to me.", "verified": true, "helpfulness": "0/0", "author": "CrisM"}, {"rating": 5.0, "review": "I have this dongle for months , It's works but not working correctly for my Ipad.", "verified": true, "helpfulness": "0/0", "author": "Harry DBH"}, {"rating": 2.0, "review": "Pain in the butt to set up. Now my expression \"is that it?!\" I'm not please with it at all.I really should give it one star but I like YouTube and I sometimes use the device for it.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this thing is great, easy to move around, fast, no issues with connectivity.  Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cody"}]