[{"rating": 5.0, "review": "i ALMOST made the stupid mistake of buying a smart TV. the chromecast makes it unnecessary to do so. i love plopping down in front of my TV and catching up with my daily YouTube videos or watching a netflix movie powered by my phone and the chromecast :)", "verified": true, "helpfulness": "0/0", "author": "Samuel O."}, {"rating": 4.0, "review": "This product was extremely easy to install and set up. Casting Netflix movies to my TV works perfect, however the casting plugin for the Chrome browser is still in beta and needs a lot of work. I've found that the audio lags the video when casting from the browser. More and more applications are starting to support this product, so I expect to see improvements in the future.", "verified": true, "helpfulness": "0/0", "author": "USMC13SOC"}, {"rating": 5.0, "review": "I purchased this as a gift for someone.  We had both seen the nefty commercial advertising this product.  I will most likely order one for myself.  If you have one be sure to check out the YouTube video of Snoop Dogg at the Kennedy Center Honors honoring Mr. Herbie Hancock!", "verified": true, "helpfulness": "0/0", "author": "Garnia Tre"}, {"rating": 5.0, "review": "I've tried this with netflix, hulu, and youtube and all work quite well, using my iphone to control the output. Also works well to play any movie you have that will work by dragging and dropping into google chrome browser. You need the right plugin but with it you can \"cast\" the movie to your TV. MP4 format works for this but so far that is the only format I've found that does.", "verified": true, "helpfulness": "0/0", "author": "David Bunnell \"Under Earth Imagery\""}, {"rating": 5.0, "review": "Worked as promises, no more messy wires to deal with.  Would do business again.  The price was the best I could find.", "verified": true, "helpfulness": "0/0", "author": "Jersey1514"}, {"rating": 5.0, "review": "It is a terrific item -- great opportunity to share viewings from your computer, what ever it might be.  Plus there are so many sites (hulu, netflixs, Youtube) that accommodate the application.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Mona Pitre-Collins"}, {"rating": 2.0, "review": "We tried this with my son's tv which is in his room. The chromecast did not maintain a good enough connection to the router located in a different room. We are now using an Apple TV device, which works just fine, although it costs much more.", "verified": true, "helpfulness": "0/0", "author": "robert poole"}, {"rating": 5.0, "review": "Easy to use and great quality. The price was excellent too. I highly recommend it for your laptop and mobile.", "verified": true, "helpfulness": "0/0", "author": "Junior Kemraj"}, {"rating": 4.0, "review": "It works great for Netflix and YouTube, but that's it.  Mor apps would lift it to five stars as it's generally pretty stable", "verified": true, "helpfulness": "0/0", "author": "Sabba"}, {"rating": 4.0, "review": "I was really surprised and disappointed that this won't work with Amazon Prime.  Prime has the capability to be the best available movie service, and yet they create a competitive disadvantage by not being compatible with Chromecast.  Hopefully, Amazon developers will work on a fix for this, especially if they are promoting the device so heavily.", "verified": true, "helpfulness": "0/0", "author": "Ken Rowland"}]