[{"rating": 5.0, "review": "I got my Chromecast today.  It took about 1 minute of easily guided set up to configure from my laptop, then it immediately starts working.  I have streamed video from YouTube, from regular internet sites, and music from Amazon's Cloud Player, and all played first try without issue.  I also tested it playing YouTube videos from my phone, also with no issues.  My favorite part is that it is only streaming one tab, so you can still keep doing other things on your laptop while streaming to the TV.  For $35, I couldn't be happier.  Now I am just looking forward to them adding more integrated apps.", "verified": true, "helpfulness": "1/2", "author": "Craig Martin"}, {"rating": 1.0, "review": "It does not support iphones, ipads, or surface rt. There are only a few apps that work with it, netflix, you tube, supposedly chrome but that does not work yet for me.  If you have a tv or dvd or blueray player that allows streaming don't waste your money.  They work better than the chrome cast.  For $35 dollars it is still a waste of money.", "verified": false, "helpfulness": "14/97", "author": "trsa"}, {"rating": 2.0, "review": "Just want people to be aware that you cannot set this up from iOS, nor does it seem to be able to be set-up from a PC that doesn't have a wi-fi dongle. So even if you have a PC connected to a Wi-Fi router, you will be unable to set this up. The amzon page says \"works with iOS\". Yes it will work after you have set it up but if all you have is an iPhone, iPad and a PC connected via ethernet, you have no option to set this up. You need an android device or a PC/Laptop with Windows 7 or higher and a wireless card.", "verified": true, "helpfulness": "14/33", "author": "JasoninAZ"}, {"rating": 4.0, "review": "I can't set the device up.  I have an iphone, ipad and a desktop that's hard wired into my router.  iOS setup of this device is not supported at this time.  My desktop can't see the chromecast for setup since it doesn't have wifi.  This device is a very nice paper weight until they add iOS setup or I purchase a wifi card for my desktop just so I can set it up.A bigger disclaimer would have been nice.  If someone knows how to get this working with my setup I'd gladly change my review.________Update: I had a friend come over with a laptop and we were able to set it up pretty easily.  Still irks me a bit.  It's everything everyone says it is (really cool).  I couple minor issues though.  When streaming a tab from my PC it seems to cut off a half inch of the screen all the way around.  As in, I can't see the edge of the content on my TV that I can see on my desktop.  I've tried both steaming my entire desktop and streaming a tab in chrome, same result.  A workaround I've found is instead of going full screen with video to just zoom in like crazy with the browser so there is still a border around the video.  That way on various esport or regular sport streams you don't have the score cut off, since that's normally on the edge of the screen.Updating my review from 2 stars to 4.  I'd give it a 3.5 based on my setup experience and the wonky things I have to do to get the screen not to be cut off.", "verified": true, "helpfulness": "3/12", "author": "R. Cox"}, {"rating": 5.0, "review": "Before I begin - let me get this out of the way - this device cannot be powered from the HDMI port. Google clearly states this on its Support page, and in the user manual/sheet. This device is powered by its USB port. The only question is whether you need the power brick, or whether you have a powered USB port available on your TV that can be used instead. (see first comment below the review for Google's connection instructions.)Now, for the review:The key innovation with this device is not its ability to stream content - that's been done before and done well.What the Chromecast brings to the party are an amazingly compact form factor and a user friendliness that Apple's engineers should envy.Setup:######In the box, you get the Chromecast, a micro USB to USB cable, a USB charger, and an HDMI cable extender.1. Connect the Chromecast to power. You can use the supplied USB charger or simply a powered USB port from your TV or receiver.2. Connect the Chromecast to an available HDMI input port on your TV or receiver.3. The Chromecast \"Set me up\" display should now appear on your TV screen4. Download and install a Chromecast app to an Android device (I used my phone).5. Startup the app. It automatically searches for the Chromecast and displays a code on its screen.6. Once the app detects the Chromecast, the TV also displays that same code7. If the code matches, click Next on the app, and move on to enter a name for this device8. Next, configure the Wifi password that the Chromecast should use9. The Chromecast connects to the wifi network, and ... that's it!Open your YouTube or Netflix apps on the phone, and you'll see a screen cast icon that you can click to \"cast\" your screen over to the Chromecast.Your phone now acts like a remote control, allowing you to fast forward/rewind/pause etc. on the app, and watch it reflected in real time on the screen.There was absolutely no lag with either Netflix or YouTube, and I could even turn on CC for Netflix.Note that once your video begins playing:1. you can close the playing app and interact with other apps as normal2. you can even turn off your phone, and the video will continue uninterrupted.Also note:The Google Cast extension for Chrome  adds a Cast icon to the top right of the browser. This lets you mirror an entire browser tab to the Chromecast. However, when I tried to mirror video the results were choppy and unwatchable - possibly due to my network's limited bandwidth.Overall, I have been very impressed with the stability and quality of this device. It absolutely does not feel like a version 1 product.Happy Streaming!", "verified": false, "helpfulness": "5/7", "author": "Ammy_Evaluator"}, {"rating": 5.0, "review": "Just wanted to chime and say the Chrome tab casting works better than I had anticipated. My family subscribes to a Japanese TV service which offers live Japanese TV through a flash video player. Up until now we had to have a computer hooked up to the TV with HDMI in order to watch on a big screen but now with Chromecast we can \"cast\" the tab that is playing the flash video to the TV. To make this even better you can also use other tabs in Chrome while it's playing the flash video on the TV so basically where before the computer had to be only used for watching TV and had to be hooked up to the TV now it can be used simultaneously to surf the web and on top of that it's wireless.I had feared there would be some choppiness in the video or the audio wouldn't sync with the video but it works perfectly (one disclaimer, it's not HD so I don't know if that matters). The only caveat in my short experience is that it seems to take a lot of system resources on the computer to \"cast\" so sometimes it gets choppy for a second if you're doing something else at the same time and every once in awhile you have to stop the cast and restart it (hopefully this will get better with updates but even if not it's not a big deal since it only happens when someone is on the computer so they can easily fix it). I am using the cheapest Macbook so it would probably work better on a nicer computer with a better processor and more memory.Anyways, this thing is great, so much better than connecting via HDMI. Youtube also works amazingly well as everyone else has mentioned.", "verified": true, "helpfulness": "4/5", "author": "G. Kemper"}, {"rating": 4.0, "review": "This was easy to set up. Up and running in less than 5 minutes.I am watching videos in Chrome tabs (pro Starcraft II games!!!).One thing I wish for: I don't seem to be able to watch the video when I pop it out to its own window. Only the regular chrome tabs seem to have the cast button.It is good that I can be playing one tab to the TV, but looking at other tabs on the computer (like reading my mail while playing the show).It is good that I can put the video in the tab into full screen and it goes to full screen on the TV, too. But then not sure I can look at another tab.", "verified": true, "helpfulness": "1/1", "author": "Mike H. Mccloskey"}, {"rating": 2.0, "review": "Tried Google chromecast today, this is a very half baked product. it works well with Youtube & Netflix but transferring browser contents is very tedious .... plus even on youtube, it behaves in a very weird way for e.g. even after i close the youtube window, it keeps playing the last video like a ghost. It just shows that like every other Google product this was never tested & just rolled out .... this is the reason why APPLE rocks !! RETURNING GOOGLE CHROMECAST TODAY", "verified": true, "helpfulness": "5/30", "author": "Dattatraya R. Korde"}, {"rating": 5.0, "review": "So I bought one of these for every TV in my apartment and I have to say setup was incredibly easy and I've been loving it so far.  So right now it seems like there aren't many applications that work with it, but a) the most important apps do (Netflix, Google, Pandora and Youtube) and b) this is like the first few days it's available so I have no doubt many more apps will follow suit.For all of you out there saying your built in TV functionality can do the same thing, I disagree... well unless you have Google.  I have built in functionality and internet in all my TVs (none are Google) and I have found them slow, they crash, and the music support is terrible.  This system allows me to stream all my music I have in Google Play, which honestly might be the best feature, plus it really does give me the interface I want for using things like Netflix and Youtube.  I can be playing something while searching for other things, which is nice and not possible on any native TV applications.  I know with the PS3 version of youtube you can do this through your phone, but I've found tons of problems with that and this seems to work perfectly.Lastly, this thing is so unobtrusive.  Yes, you do have to plug it into both HDMI and USB on your TV, and I wish you didn't, but that's not really Google's fault... had TV companies had the foresight to build power into HDMI you wouldn't.  I imagine in the future some companies will if these things catch on.  It's awesome and I love it.  I'm going to buy another just to keep on me when I'm out and I want to broadcast something at a friends house who is a little behind the technological curve.", "verified": true, "helpfulness": "4/6", "author": "Donald"}, {"rating": 3.0, "review": "updated below>(I got a netflix promo from best buy. it gets even crazier with amazon, i cancel on the word that they won't credit me, and then i get an email saying i will get the promo when my order ships, but when i try and reinstate my order, they say no i can't. but then they gave me a $10 credit.)I ordered my product on 24 July at 11:43 PM central standard time I had to call several places like others checking on the promotion making sure it was good for Netflix for three months and that it came with the chromecast, I called Amazon they were friendly but he did not have the information on the Netflix promotion he could not confirm anything so I spoke with a supervisor and received an e-mail saying that I would get my three-month Netflix however was kind of short on details so I am leery and I will update this post later on when I receive it. it was said that I would receive it within one week of receiving the product, but they also hinted that it may be in the product packaging I have no idea which story to believe I'm starting to think that maybe I should return it which is really sad because they would be lying if they don't honor this. It is nice to be able to leave reviews but they would have the biggest social network of all if they could let Amazon customers talk to each other socially. They will probably not do this because then we would have too much leverage to influence each other and make them honor their word on promotions like this. I also think Google was very shady because they did not specify when the promotion started or ended all they said was I would get free Netflix for three months so that is shady too.updated: this is crazy but they said it's just a misunderstanding. then they did a trick so that my emails bounced back to me. hilarious really if it wasn't so sad. anyway despite a promise, they backed out. amazing what a company will do to save 20 bucks in the short term, and lose a customer. this whole thing is a debacle. anyway, i gracefully canceled my order. shame on you amazon, you lack basic skills necessary to run a mom and pop store let alone a greedy publicly traded company.", "verified": true, "helpfulness": "1/10", "author": "travis foreman"}]