[{"rating": 4.0, "review": "It has a usb port,but can not play vob formats. It should, because WD does, and I want to play my mp3 songs that I bought from amazon,but it has no app for that; they say it's coming soon.The talk part works with the amazon videos , but not on the other apps , which it should; just like the smart phones do.Amazon , should hire better programmer's", "verified": true, "helpfulness": "0/0", "author": "Richard Woods"}, {"rating": 1.0, "review": "The hardware was nice. But once I started to use the Fire TV I encountered what many reviewers here, and most \"professional\" reviewers, have noted: access to free content (whether Prime or Netflix) is de-prioritized in the onscreen display in favor of pay content. Knowing that Amazon hardware exists to \"monetize\" the Amazon content, this was an intentional design on the part of the development team, and as a Prime subscriber it pissed me off.The lack of support for local content (a USB port that has no purpose) reflects this as well. Amazon makes no money when you play the video files you ripped from DVDs, or the MP3s you ripped from your CDs, so it's not worth the effort to support them.What is even more surprising is the lack of support for other features that exist on other Amazon hardware:  Amazon Cloud Player and Kid Zone, and the really lame support for \"second screen\" apps on Amazon's own tablets.The Fire TV was not ready to be launched when it did. Let's hope the team reads the reviews and makes the improvements that will make it a compelling choice over the Roku 3 (which it is not today) ... instead of wasting time and resources trying to recreate the Ouya experience and bring Android gaming to the HDTV (which - news flash - nobody wants).", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV is great.  Effectively turns a regular HDTV into a \"smart\" TV.  Thinking about picking up another.  Have recommended to family members and friends.", "verified": true, "helpfulness": "0/0", "author": "Gerald Linkes"}, {"rating": 2.0, "review": "I've always had multiple Roku's in the house for years. When one of those died, I figured I'd give Fire TV a shot. Navigating is fast and simple enough to use. Amazon based streaming works fine and there is rarely any lag with those. My trouble seems to be with the Hulu and Netflix applications. For whatever reason those seem to have to buffer quite often. Never had this problem with any of the Roku's or Xbox 360 that I've used for streaming in the past. Also, after a while the Fire TV will start complaining about the internet connection. When this occurs I run a speed test from another device and it's always fine. I've found the Fire TV requires a reboot periodically to fix this issue. I bought this the day it came out and as time goes on I find myself wishing I'd stuck with a Roku device.Oh, as for the games? Don't buy this thinking you'll have an enjoyable gaming experience. Lots of ported Android phone games that quite frankly aren't designed to run on (Fire) TV's or with the optional game controller. Not a huge concern for me but may be for others.", "verified": true, "helpfulness": "2/3", "author": "Brandon Lackey"}, {"rating": 5.0, "review": "I love it, love it, love it.  it is easy to use and love the voice search command button my favorite, no more typing in the title you want to watch.  It truly is the best thing I have ever bought", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "works as described. some apps have too many commercials. There should be a pay for no commercials option similar to Pandora.", "verified": true, "helpfulness": "0/0", "author": "charles"}, {"rating": 5.0, "review": "I was about to buy a ROKU since my neighbor let me borrow hers but am so glad the Amazon Fire TV came out.I saw it by accident when looking on Amazon for another item and read all the reviews and it matches up with my Kindle Watchlist and is very easy to install and use.We are enjoying a lot of the old westerns that we had not seen.It even keeps my husband watching TV with me instead of playing poker on his computer.Amazon brings the family together.", "verified": true, "helpfulness": "2/2", "author": "Judy FLNH"}, {"rating": 4.0, "review": "The Amazon Fire TV is a quality media viewing device. It is very snappy and responds quickly to commands. I have yet to use another media viewing device that can take you from viewing a Netflix video to the home screen as fast as the Amazon Fire TV. The responsiveness of the device is incredible and one of favorite features of the device.The available apps are decent but leaves plenty to be desired. I hope/assume the list of apps will grow with time but currently they are quite limited. Obviously the major necessity apps are available (Netflix, Hulu, etc), but the device is lacking utility apps. The lack of a browser is a big minus for me and I can only hope Amazon adds one ASAP.The voice search is a very power tool that is underutilized. The translation is generally very accurate and quick but is severely limited as it only searches Amazon's databases. Being able to use the voice search in apps such as Netflix or YouTube (and all the rest for that matter) would significantly increase the usability of the voice search ability. Its a major disappointment to see such a powerful tool be so choked.All-in-all, I am quite satisfied with the Fire TV. It is very fast, very nice quality, has an enormous amount of content (especially for Prime users), and has a lot more potentional for growth. I am excited to see what Amazon does in the future with the device as the possibilities are seemingly endless. With all that being said, there is plenty of necessary improvements/upgrades that need to make this device the hands-down choice for media viewing.Note:I have had the Amazon Fire TV since it has been released. I have not played games on it and do not have the game controller.", "verified": true, "helpfulness": "1/1", "author": "S. Hook \"-Sven\""}, {"rating": 5.0, "review": "Easy to install for my 12 year old grandson and to use.  I may try it one day. But I'm old and technology challenged.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am the owner of a Roku 2 and Amazon right now cannot touch the amount of channels that Roku has (including HBO Go, and some others to name a few).  I think as they begin to get their footing that will be a reality.  Love the speed of transfer to download Netflix and Amazon Prime plus Video cames to play.. it could be a game changer soon with the addition of more channels...", "verified": true, "helpfulness": "1/1", "author": "William J. McKenna"}]