[{"rating": 4.0, "review": "I can't get photos to display on TV using slideshow. Web browser items display fine.", "verified": true, "helpfulness": "0/0", "author": "Syed R. Hussain"}, {"rating": 5.0, "review": "Does a great job", "verified": true, "helpfulness": "0/0", "author": "taddy stone"}, {"rating": 4.0, "review": "Not as user friendly as I had imagined, but a great product for the price.  If you have AT&T; U-Verse, there will be some hoops to jump through to enable your Chromecast to work with your wi-fi router, but there are plenty of articles on Google that help explain acquiring your MAC address and the rest of the process. Overall, we are happy with the purchase.", "verified": false, "helpfulness": "0/0", "author": "JW"}, {"rating": 3.0, "review": "Not that easy to use and sometimes I had some difficult to pair with my phone.", "verified": true, "helpfulness": "0/0", "author": "Felicio Trez"}, {"rating": 5.0, "review": "This devise is awesome and makes research and utube large and easier.", "verified": true, "helpfulness": "0/0", "author": "Gina Sonshine"}, {"rating": 5.0, "review": "Exactly what I was looking for!The setup was quick and easy (simply plug, download the app and use). Everything is streamed via the chromecast app. The ability to cast your current screen/tab allows other apps that are not supported by chromecast to be directly streamed. Be weary that doing this will deplete your battery life as if you were streaming directly off your device (which is technically what you are doing). Overall this device is everything I hoped for!", "verified": true, "helpfulness": "0/0", "author": "Stunnz"}, {"rating": 2.0, "review": "very hrd to setup - we gave up", "verified": true, "helpfulness": "0/0", "author": "Seymour F."}, {"rating": 5.0, "review": "Easy to hook  up and use!", "verified": true, "helpfulness": "0/0", "author": "Donna Pierangeli"}, {"rating": 4.0, "review": "I loved it and it works perfectly but in this version one cable was missing the one for charge chrome cast", "verified": true, "helpfulness": "0/0", "author": "Gabriela Ordóñez"}, {"rating": 5.0, "review": "Everything I expected and more", "verified": true, "helpfulness": "0/0", "author": "chris"}]