[{"rating": 5.0, "review": "We were so sick of what our satellite programming had to offer...and the commercials even worse.  We have been using our Fire TV with Sling TV  for almost a month......wish we had done it a long time ago!!", "verified": true, "helpfulness": "1/1", "author": "Lauren G.  Florida"}, {"rating": 5.0, "review": "Easy setup,super fast.Traded a roku box in for the fire tv.Not quite as many apps as the roku ,but I am not missing any movies or tv shows because of having less apps.Have cut off my satellite box and have been watching tv shows commercial free.I still have a rooftop antenna and am getting the rest of the main networks free from USTVNOW which I have installed on the fire tv.The fire tv just works faster and smoother than the ROKU and it also has an optical connection.", "verified": true, "helpfulness": "0/0", "author": "mcc"}, {"rating": 1.0, "review": "amazon tv menus look  great, but hooked up to my lg tv. My tv is arround 5 yrs old but works great the picture keeps going black every few seconds then comes back.  IT works well hooked up to my pc monitor.  Its a shame that such an great product is a huge dissapointment for me as buying a new tv just for firetv is quite a bit more $$ just for fire tv. Also found out the usb port is disabled for storage. what kind of executive made that poor decision.", "verified": true, "helpfulness": "1/2", "author": "eric snyder"}, {"rating": 5.0, "review": "What was expected", "verified": true, "helpfulness": "0/0", "author": "Roy Iveson"}, {"rating": 5.0, "review": "I love this product.  Just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 3.0, "review": "Easy to set up and use, but quality of the programming is less than desirable. Too many skips and fragmented (blotchy) screens. Probably wouldn't make this purchase decision if I had it to do over.", "verified": true, "helpfulness": "0/0", "author": "Townsend Hoopes III"}, {"rating": 3.0, "review": "I guess I assumed I  would be able to watch local live television. not a product default, just my lack of knowledge.", "verified": true, "helpfulness": "0/0", "author": "dede"}, {"rating": 4.0, "review": "love our amazon fire tv!  It runs netflix and hulu much faster then streaming through the Wii. the one flaw is you can't shut it off unless you actually pull the plug from the outlet.  It stays on the whole time causing phantom energy loss!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Cosnyka"}, {"rating": 2.0, "review": "I loved this Fire TV right out of the box. You can be set up in minutes, download the apps and  and logged into your services like Netflix & Hulu Plus. The voice control works exactly as you would hope.I loved the Fire TV until I realize I am continuously disappointed in whatever operational problem it experiences with Hulu Plus. The video will play and then intermittently freeze. It is not my super-fast internet speed as Netflix runs absolutely perfect as does YouTube, or the location of the box as it is not running on wifi, it's hardwired. Using NBC as an example, the NBC intro and commercials all run flawlessly. But when my show starts to play, sometimes only the NBC watermark and the audio come through, while a video frame is frozen on the screen, or the screen is just black with only the audio playing. Extremely frustrating.I would otherwise five the Amazon Fire TV 5 stars, but not functioning properly with Hulu Plus (as advertised compatible app for the Fire TV) which is one of the top 3 most major services for those of us who dissed cable, forces me to unfortunately lower my rating. I will be trying a Roku box to see what happens and update my review after testing.", "verified": true, "helpfulness": "1/2", "author": "paula klein"}, {"rating": 1.0, "review": "Not a good purchase. Not easy to set up and lots of obstacles.", "verified": true, "helpfulness": "0/1", "author": "George W Tomlinson"}]