[{"rating": 3.0, "review": "It is easy to set up, works great.  But--I find little \"free\" programming on it that I want to watch.  The selection is disappointing, and navigating it is also a little difficult.", "verified": true, "helpfulness": "0/0", "author": "Mincks 2"}, {"rating": 5.0, "review": "I think this is better than the Apple tv, have both, so that's all I am saying", "verified": true, "helpfulness": "0/0", "author": "Saleem A. Mahfood"}, {"rating": 4.0, "review": "My unit works great.  Still finding little things as I play around with it.", "verified": true, "helpfulness": "0/0", "author": "Gary R. Parsons"}, {"rating": 5.0, "review": "Amazon Fire TV is awesome. You can do so much with it. I also purchased the fire game controller to go with it. Together makes a great combo for the TV experience.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I like but my control is not working fine and is brand new, also there is a lot programs and movies that you also have to pay if you want to watch. I have prime amazon but it doesn't mean that the best movies are there.Also the control does not work to look for movies outside of the amazon libraries, I mean if you try to search something on netflix you can't use the voice control because the results that you get when you use it is always from the amazon libraries.I think Amazon can do it better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "SEAN HOUSEN"}, {"rating": 5.0, "review": "Voice search doesn't work through apps like Netflix or Hulu, but I like it a bit more than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Alexander F Sirko"}, {"rating": 5.0, "review": "the end of cable is near.", "verified": true, "helpfulness": "0/0", "author": "jeff decker"}, {"rating": 5.0, "review": "Had Apple TV and switched to this. Immediately had to buy a second unit for my bedroom. Amazon Fire TV is the best box out there for streaming.", "verified": true, "helpfulness": "0/0", "author": "GuyInTexas"}, {"rating": 3.0, "review": "Love it but you have to download a lot of APPS before you can just watch a movie or show. It can be tiresome but worth the money. I actually like this better than Apple TV. It would be a little better if it came preloaded with more APPS.", "verified": true, "helpfulness": "0/0", "author": "jkyounger42"}]