[{"rating": 5.0, "review": "This product does just what it says it does, great for Netflix! No need to spend extra money for a Smart TV, when this is all you need!", "verified": true, "helpfulness": "0/0", "author": "RollyS"}, {"rating": 5.0, "review": "With this, TV is a whole new world. For $35 bucks mind ya. Amazon instant, Netflix, whatever !!!! Get one, you'll like it", "verified": true, "helpfulness": "0/0", "author": "jake lariviere"}, {"rating": 4.0, "review": "Does the job, but a little complex to set up.  For the price, this is a good product.  They could use some more complete installation and use instructions.", "verified": true, "helpfulness": "0/0", "author": "photo guy"}, {"rating": 3.0, "review": "I will start off by saying the features this little device brings are MORE than worth the cost.It's amazing how just $30 can benefit your techy needs with such ease.Use it to stream from your phone, computer, anything without having to change around annoying cabling, etc.For features and ease of use, I give this a SOLID 5 stars... BUTThis is a big BUT here... when I had the Chromecast plugged into the back of my TV and charging through the provided Micro USB chord... I BARELY turned my TV to rearrange my setup and ended up ripping the HDMI connector right off the Chromecast.With minimal \"force\" the HDMI connector just ripped right off of the black base.Now it's obviously broken, but I do want to get a new one as switching HDMI cables based on what display I want my video to be on is very annoying.5 stars for functionality + features2 stars for quality...I give it a 3.", "verified": true, "helpfulness": "0/0", "author": "Brett Kerigan"}, {"rating": 5.0, "review": "It is a nice way to lay in bed with my phone, and link it with my TV so i can watch videos and still use my phone.", "verified": true, "helpfulness": "0/0", "author": "Daniel Reekie"}, {"rating": 4.0, "review": "This is a great little device which does exactly what it's supposed to. I primarily use it to watch movies on my TV while using my phone as a remote control. And for this purpose, it works very well.Pros:- Inexpensive. $35 vs $99 for an AppleTV- Small. Stick in the back of the TV and you can hardly notice it- Works with nearly everything I use. Netflix and Google Play TV and Movies support has always been there. Vudu support is coming soon- Open SDK, which makes it easier for other vendors to support itCons:- No Amazon Instant Video or iTunes support. These probably will never happen since I don't see how Amazon or Apple would be willing to support Chromecast. This is not their fault, but I still have to dock a star from it.", "verified": false, "helpfulness": "0/0", "author": "Daniel K"}, {"rating": 5.0, "review": "You cannot beat the price and it works as advertised.....I would recommended purchasing this product.Now for more apps to be published.....", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Pros: small, easy to install, cheapCons: can only stream Netflix and Hulu, poor user controls for pausing, FF, RW, long initial load time.We have Apple TV in one room and Chromecast in the other, and we completely got rid of cable (hurray!).  I'd recommend folks purchase the Apple TV until Chromecast makes some improvements in the content they offer and the user interface for the application.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Marie Chamberlain"}, {"rating": 4.0, "review": "I bought this thinking it was a little like Google TV but it wasn't. You have to use the Google Chrome browser to stream things from your computer to your TV. Otherwise it is a neat device.", "verified": true, "helpfulness": "0/0", "author": "Christopher Lee"}, {"rating": 5.0, "review": "This google chromecast works excellent.  Can access all YouTube videos as well Netflix.  Very easy to use.  Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Tuan Nguyen"}]