[{"rating": 5.0, "review": "This sets up in an instant.  Works even with a spotty internet connection with no buffering (my living room is a long way from from my modem and sometimes the connection is not very good). Lots of free content with Prime.  I too wish I could sort by just Prime, I believe there is a password option to keep the kids from buying paid content but I can't seem to get it to work, at least not on my initial set up. I will admit I have not revisited it and should try again.  I have other streaming services available, besides my On Demand for my Cable, and the Xbox content, this is the easiest to use and with the least buffering. We were shocked that the \"instant startup\" was really an instant start up.  I was wondering though, I haven't even paid for this completely yet, are they going to adjust the price for those of us that paid the full price?", "verified": true, "helpfulness": "0/0", "author": "E. Riddell"}, {"rating": 5.0, "review": "We love Amazon TV. been streaming movies, tv programs. great response to commands and  very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ethel"}, {"rating": 4.0, "review": "I've been using Fire TV since mid-July and I have MOSTLY great things to say about it.  Load time on movies/TV shows is amazing...way faster than Netflix.  Love the apps and games available through the device.  Love the remote - it's easy to use and the search by voice function is really great!  Overall, I really really like this product.  I am a Prime member and it syncs so well with my account...in fact it came that way right out of the box.Now for the cons...  the beautiful screensaver pictures are not stored on the device, rather, they are running from the web which means even when the device is \"sleeping\" it is racking up data usage.  That's fine if you have unlimited data with your ISP, but for those that don't, BEWARE.  The way to fix this is to go into the settings and turn off the screensaver.  You end up with just a dark screen while the unit sleeps but at least the data usage is at a minimum during this time.  I actually found out about this glitch through online research for another issue I am experiencing...  There is no way to turn off the box.  After an idle time of 30 minutes ( I think that is the amount of time mine is set for ) the unit will \"go to sleep\" and that is when the screensaver comes on with the pictures I talked about earlier.  At first I didn't notice the issue I am about to describe... in fact, the unit worked perfectly.  For about the past two weeks, however,  I've noticed that after the unit \"sleeps\" and I come home from work and sit down to watch TV, Netflix will not work properly.  The movie/show I was watching will begin to play and then I get an error message saying the \"Netflix service isn't available at this time\".  I couldn't figure out why it seemed to work fine as long as I was actively watching TV, but not after the unit sat for several hours.  My work-around is to unplug the unit, wait a few seconds, plug it back in and, Voila!  It works like a charm.  Now this is great.... the unit works, right?  The question is... why does it do this?  I thought it was only the Netflix service that this happened with, but after further testing this \"bug\" of sorts also occurs in the Amazon Prime Movie/TV area as well.  Same issue... unit sits for hours during the day (presumably sleeping) while I'm at work.  I come home, pick up the remote, start an Amazon Prime movie or TV show I was watching that morning and the show will play for a few seconds and then stop.  SAME THING THAT HAPPENS WITH NETFLIX.  Again I unplug/re-plug the unit and it works fine.  I'm wondering if this is just a bug that has not yet been detected by the Amazon Tech staff??  Has anyone else had this issue?Other than these issues I am thrilled with Amazon Fire TV and would still recommend to purchase, especially if you are an Amazon Prime member!!", "verified": true, "helpfulness": "8/8", "author": "Holly Cobb"}, {"rating": 4.0, "review": "We've had the Fire at our cottage now for over a month. Got rid of cable and decided to stream only up here. Works great, took like 30 seconds to hook up and get it going, and easy enough that my 8 year old is probably better at using it than I am. It's lightning fast...no delay or buffering issues. No long load times. The voice search is incredibly accurate and very helpful...EXCEPT that it only searches Amazon content. So if what you want isn't in Amazon, you then need to go to the Neflix app and manually search by typing. It'd be awesome if the little remote had some kind of small keyboard on it so that typing in a title wasn't so tedious, but it's not a big deal.As far as content goes, I have to say I'm a little disappointed by how many shows and movies are not available with my Prime membership. For the $99/year, I really thought most things would be free. Not so. Virtually every old TV show I search for, thinking my kids will enjoy (old school stuff like Alf, you know?), is NOT free with Prime. It's there...I can pay for it...but I feel I shouldn't have to with my paid membership. This really bugs me. Yesterday I searched for the 2001 movie Rat Race...again, it's there but I have to pay to rent it. Why? It's not some fancy new release. So I suppose these critical comments are more aimed at Prime membership and the content available with such, but I feel those buying a Fire TV are probably Amazon users and will likely also be considering (or already have) a Prime membership.One thing that was not made clear (or at least I didn't see it anywhere) is that any show/movie that has the little Prime banner in the upper lefthand corner is free to watch with a Prime membership. When you click on it to open it, it can look like you're going to be charged for it because there's a price listed and nothing that actually says \"Free with Prime.\" But that's how it works. I highly suggest that users set up a password requirement for any content that requires a fee (very easy to do) so that kids can't buy stuff by mistake, and so adults don't order something without a password prompt alerting you that you're about to purchase something.Overall, happy with this purchase and will keep it. But I need to do some deciding as far as which subscriptions are worth the money and which aren't (possibly including Prime!).", "verified": true, "helpfulness": "10/10", "author": "Eliz \"Mom of Five\""}, {"rating": 5.0, "review": "Fast shipping great product", "verified": true, "helpfulness": "0/0", "author": "agustine santiago"}, {"rating": 4.0, "review": "Simple to set up and use.  My only complaint is that the Plex client does not support Dolby and DTS. Also, would like to see more apps.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Vincent J. Saracino"}, {"rating": 3.0, "review": "It's a good bang for your buck but it's going to have trouble holding up over the long run. I'm giving the Amazon Fire three (closer to 3.75) out of five stars because it is a quick and reliable way to access a lot of media without the need for multiple devices. It's easy to set up, has great HD quality video and sound, and if you have Amazon Prime you'll get a lot of additional content not available on other platforms.The good:Easy to set up and use.Once connected to your Amazon Prime account you can access all your media quickly and easily.The interface is nice, well organized.It has most of the streaming Apps including Netflix, Hulu, YoutubeYou can make purchases quickly with no fuss, and have instant access to your digital content.The voice search is fantastic and soooo easy to use.They recently added a lot of older HBO series to Prime.The Bad:Without Amazon Prime the Fire loses a large portion of it's appeal.It can freeze up from time to time, requiring a hard reboot or system reset.There is no 'OFF' button, it powers down after a certain amount of time idle (you can adjust the time). This can be problem if you have small children necause they love remote controls and if they start hitting buttons randomly you could potentially purchase a whole lot of content and not know about it until you get a bill. [Sound like this has happened to me? Yea, :-)]The Ugly:Amazon Prime selection. I'm placing this in the ugly because I've had Amazon Prime for years now and they're movie selection has yet to improve past 'rudementary.' What I mean is, they have a lot of content available but most of it's older films, public domain, or the same core group of top movies. If you browse the Prime eligible movies over a period of time you begin to notice how limited the catalog really is.Another issue with Prime Content is the constant change to what's Prime eligible. This is probably a contract issue, but movies often move in and out of Prime very quickly, so a movie that is Prime eligible one week may not be the next. This is a challenge and can be a real let down when it happens because there's no notice.Finally, I'm a bit disappointed in Amazon's digital movie pricing. It's a different model than DVD/Bluray, I understand that, but the price of buying a digital movie is usually as high or higher than the Bluray price. Amazon doesn't seem to be in a place where tey are willing to offer digital movie purchases at discounts yet. Perhaps that will change in the future, but for now it certainly keeps me from buying more digital films.  Example: Hot Fuzz is $12.99 for purchase through Amazon Instant Video. (This is HD, SD is $9.99). Fry's electronics had the Bluray of Hot Fuzz for sale at $4.99 this weekend. Same movie, both HD just different format. Obviously I bought the movie at Fry's due to the price.I'd love to buy movie in digital format through Amazon but they will need to change their pricing structure before they become seriously competitive.In conclusion, there is still a lot to like about the Amazon Fire and if you have Prime (a must) then you'll still have quite a bit of content to watch.", "verified": true, "helpfulness": "9/10", "author": "Raw Movie Reviews"}, {"rating": 3.0, "review": "First of all, let me say I love this machine. It's easy to use and works like a dream. So what's the problem? I own a Roku, but I bought the Fire back when it first came out because FreeTIme was promised for spring delivery. I thought it would be a great way for the kids to watch and play age-appropriate TV and games this summer. Well, school is starting back today, and FreeTime is still unavailable. It is now said to be \"coming soon.\" I understand Amazon wanting to promote upcoming features, but I hate when promises aren't kept. It would be better to not promise at all.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Wish I would have known there was a HD cord I needed to buy before but other then that. Love the amazon fire. great picture and so many shows and movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "lisa coronel"}]