[{"rating": 5.0, "review": "A friend has internet TV...and pays for it every month!  One buy and you're in!  More horizons opened by Google.", "verified": true, "helpfulness": "0/0", "author": "J G Hirsch"}, {"rating": 4.0, "review": "I like that I can display anything from my browser on my TV. I wish there were more Android apps, but like the Netflix and HBO Go. Works pretty well, but needs a strong WiFi connection.", "verified": true, "helpfulness": "0/0", "author": "Erica S. Heitke"}, {"rating": 5.0, "review": "I picked up another chrome cast when it was on sale.  Now that it has more app support, it's great.  I can stream local media with plex asking with all the other things it has been an able to do.  For 35 bucks this hands down beats any other TV add on box", "verified": true, "helpfulness": "0/0", "author": "Harrison Logan"}, {"rating": 3.0, "review": "Althought you can get HBO GO with this device, it won't stream Amazon Prime, Vudu, or MGo Movies.  I also have a Ruku, which I would recommend over this since you can get more channels than Hulu+, HBO GO, NetFlix and UTube.  Works well  for what it does allow you to stream.  Hopefully, they will come up with more apps for it and then it would rate 5 Stars.  Considering the cost it is OK.", "verified": true, "helpfulness": "0/0", "author": "Shopper1911"}, {"rating": 3.0, "review": "I thought that I would be able to stream video from my phone but so far it only allows me to use it for YouTube and Hulu Plus. I have other videos that I can't get to show on my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Its great that Google has given us the ability to shift viewing of all kinds of media from a small screen to the big.  Only problem -- its pretty limited.If you use the big services (Netflix!, Google Play Movies, HBO Go, YouTube -- after that, it drops off fast!)  Chromecast is great.Best part:  If you've got a TV that supports HDMI controls, you can automatically turn on the TV and switch the input to Chromecast.  No fiddling with remotes -- very cool.  (Note that Chromecast must have external power connected to turn on the TV.)Worst part:  Many devices or apps don't support Chromecast -- and vice versa. Google is still controlling the API too much which limits developers' from getting really creative.  So, for instance, if you want to watch movies you took on your HTC One on your TV -- no joy.  At best you can try loading 3rd party apps (Real Player, etc) but this often fails in these cases as the throughput is too herky-jerky to bear.But if you use the services it works with, for $25-$35 (depending on discount) you'll love it.", "verified": true, "helpfulness": "0/0", "author": "vardelda"}, {"rating": 4.0, "review": "Chromecase is pretty slick for where it is today.  It's fairly limited in some of it's abilities right now, but we all know Google will grow it.  I do like the ease of casting to it from Apple, PC, and Android devices, very slick how the chromecast icon shows up in the Apps if they are able to play to it.Some minor grumblings:  My wife noticed when she is listening to Pandora, what shows on the screen is not what is showing on the screen of her phone.  For her, she wanted to Thumbs up a song, but couldn't do it because her phone showed different than the screen.  Very minor, just notable.Very slick with casting Youtube, have been very impressed with the ability to play a video, and queue up other videos if wanted.  For the price I paid on black friday, it's definately a nice thing to have.  In fact, I bought a Soundbar, with Bluetooth capabilities, and I don't use it, because the Chromecast is easier to instruct my wife to use.I am not sure if it's a feature, but if you \"Cast\" something to it, your TV will auto tune to the input it's plugged into.  Very impressed with that feature of it, my TV is a few years old, and not very high-end, so must be a trick that chromecast pulled off.", "verified": true, "helpfulness": "0/0", "author": "Tom Simanovich"}, {"rating": 4.0, "review": "This simplicity of the Chromecast is a bit elusive.  The printed instructions that come with it are minimal.  The onscreen instructions are fine but are not completely intuitive.  Although there is no mention of this in either set of instructions, you can plug the device into an HDMI input on the back of an audio/video receiver.  Once you are able to \"cast\" programming content to your display, the instructions are silent as to how to access the content.  You do it by going to the webcast service's website and then casting the content to your display.  Once you figure all of this out, it works well, but getting from start to finish was a bit frustrating.", "verified": true, "helpfulness": "0/0", "author": "Joe Falk"}, {"rating": 4.0, "review": "The concept is excellent and works well for what it is.  For casting your Chrome session it could really use 802.11n or ac though.  I'm sure that was a price consideration but I would gladly pay more for that feature.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this little thing.  I have a Roku and Apple TV in addition to this but I use this more than the others combined despite the current limited app line-up.  Looking forward to seeing what google and other developers do with this next.", "verified": false, "helpfulness": "1/1", "author": "Kralnor \"2. LOOK IT OVER\""}]