[{"rating": 5.0, "review": "I gave it to my son and his wife - they love it", "verified": true, "helpfulness": "0/0", "author": "Carole Ford"}, {"rating": 5.0, "review": "Great price and super fast shipping !!", "verified": true, "helpfulness": "0/0", "author": "Tara Kalnitsky"}, {"rating": 5.0, "review": "There is really nothing wrong with this product, It's relatively inexpensive (for what it does). If you've considered it, just go for it!", "verified": false, "helpfulness": "0/0", "author": "Eric"}, {"rating": 3.0, "review": "OK, it does cast the screen from your PC or Smartphone to TV, but with few limitations.I am tech-literate and I should have checked that it connects to the stick through the router and not directly(unlike Miracast), so that's a disadvantage if you want to show pictures, do a presentation from your device without bothering about anything else.I hope Google works on direct transfer.Screen-mirroring (which is in beta) is also good.", "verified": true, "helpfulness": "0/0", "author": "VBab"}, {"rating": 5.0, "review": "I plugged it in, it worked. I don't know what else to say. I can cast my phone screen alright! galaxy S5 here.", "verified": true, "helpfulness": "0/0", "author": "Miguel G \"mikesoft\""}, {"rating": 5.0, "review": "It is really useful", "verified": true, "helpfulness": "0/0", "author": "Peng"}, {"rating": 2.0, "review": "Works great with Netflix.  However does NOT work with Amazon.", "verified": false, "helpfulness": "8/9", "author": "Cinnamon \"peace\""}, {"rating": 2.0, "review": "Works great for Netflix however you cannot watch Amazon digital with this device.", "verified": true, "helpfulness": "0/0", "author": "Cinnamon \"peace\""}, {"rating": 5.0, "review": "I love our Chromcast.  This is our 3rd one!  Easiest way to update your TV without purchasing a brand new smart TV!", "verified": true, "helpfulness": "0/0", "author": "Kiran"}, {"rating": 2.0, "review": "Not really all that great, unfortunately, you are really limited from streaming things from your ipad to the Chrome system.  If you're on a laptop or desktop, I suppose that may work better.  Bought it, but never really use it.", "verified": true, "helpfulness": "0/0", "author": "GooseDad"}]