[{"rating": 5.0, "review": "After the three free months of Netflix, it costs $11. If you really don't want it you can return it. This is amazing", "verified": true, "helpfulness": "18/121", "author": "Rich Woods"}, {"rating": 5.0, "review": "This is a great product. It's mostly eliminated my need to long cables. The streaming is flawless, and the installation is very simple. The only shortcoming is that it doesn't stream local content (files you have on your computer), but I understand that's a technically harder problem to implement.", "verified": false, "helpfulness": "15/102", "author": "Mohammad M"}, {"rating": 5.0, "review": "I've had my Chromecast since July 29th and I still find it to be one of the coolest gadgets I own.  I was so excited when it was announced and  ordered it as soon as it became available.It was a snap to set up. I just ran set up on the ultrabook and the rest of the devices recognized it as soon as I turned them on. It does work beautifully with the Nexus 7 as well as with the Nexus 10, my ultrabook, and my desktop pc.  It was interesting to see that I could not only use the Nexus 7 for something else while the videos were playing but I could actually close it and the video just keep running on the tv.  It's so easy to move the Chromecast device to another tv too.We do have a Roku but the simplicity of being able to project something from your mobile device right onto the tv just by clicking the icon can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Bichon Mom"}, {"rating": 5.0, "review": "So much better than the Fire Stick - go for this item or a Roku so you don't get disa[ppointed by the problems plaguing the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "S. Tank"}, {"rating": 2.0, "review": "This over hyped product spamming all news offers nothing new to consumers. Definitely something that Apple TV has been doing successfully for a loooong time. If it could stream local content from PCs/Macs it would have caught my attention. That is something we are waiting for a long time to stream downloaded local movies from a HDD to TV (1080p). Mac OS X with Airplay delivers it so looking forward for it.I have given this product 2 stars as it is dead cheap. $35 (with 3 months of netflix) makes it cheaper than a meal.Update after receiving the product:Chromecast review based on day 1 usage:Pros:Plays youtube and netflix (only 2 apps being supported currently) effortlessly which my tv already has built in, so no good for me.Cons:1. Chrome tab casting kills the performance of the device from which it is being casted. My Mac Air went dead from full battery in less than an hour.2. There are audio sync issues as well with the chrome tab casting.3. When you play a video from a chrometab in yupptv, cricinfo or any other websites, while on full screen it limits you to do anything else on the laptop.4. The device should be continuously plugged on charge either to a plug point which makes it tacky or to a USB port within the TV (If the TV has one).More to update soon.", "verified": true, "helpfulness": "14/284", "author": "Girish Vuggina \"Gadget Freak\""}, {"rating": 3.0, "review": "What a big turn off ... It cannot stream local content.. uhmm.. I suppose if google could put tubes and probes onto your body it would do it.  I wish there was a way to post comments not in the form of a review.  I am assuming that it works flawlessly and perfectly: 2 stars off for the lack of local streaming feature and its malintent.To quote ComputerWorld: \"For anyone wondering, that does imply that Chromecast is designed exclusively for cloud-based content -- not locally stored content on your phone or tablet. So yeah -- time to start uploading stuff to Google Play Music if you want to use this thing.\"", "verified": false, "helpfulness": "9/174", "author": "A reader"}, {"rating": 5.0, "review": "I think this is a great product for a great price.After setting up the device it's so easy for anyone around to connect and stream content. I love that.I gave it 5 stars because of the price and it's capabilities. If you want something that can allow you to watch Google Play movies or YouTube video's then this is the easiest way to do that. That's what I was looking for.Here is what I would like to see in the future:-Amazon Video Compatibility from iPhone or Android (hopefully Amazon creates this)-Better Chrome video support without the choppiness-More AppsAlso, it's worth mentioning that my Sony Bravia is HDMI-CEC compatible. What that means is that I was able to test this device's ability to turn on the TV and switch to the proper input. It worked perfectly. However it would be nice to be able to turn off the TV from my iPhone as well. There was no way to do this (that I could find). I would imagine there will be a Chromecast App available soon for the iPhone that will allow this.", "verified": true, "helpfulness": "0/0", "author": "b2dac"}, {"rating": 5.0, "review": "Update 7/26:The Package arrived today and Chromecast works as advertised I have played a movie from the play store \"Transformers Dark of the Moon\" via Nexus 4, and netflix movie from Avengers (ON KINDLE FIRE OG). It also works flawlessly in mirroring from chrome I used it to play music from google play all access. I have not tried Hulu yet but have read many reports it works. So if you pay to have Hulu Plus on a set top box, Chromecast can save you a few dollars a month there. All in all this seams to be a great purchase and with more developers getting on board in time, a must have. I have also read reports and tried casting local computer files in chrome by pressing \"ctrl o\" on a windows machine it brings up a file browser then you select the file. On a mac its \"apple o\". Hope this helps and happy casting", "verified": true, "helpfulness": "0/0", "author": "lamin41"}, {"rating": 5.0, "review": "I think this can sweep off Apple TV. The design, price are amazing. Looking forward to plug and use it.", "verified": true, "helpfulness": "7/108", "author": "phaneendra"}, {"rating": 5.0, "review": "Great for netflix and youtube streaming. I look forward to future added functionality. Pandora was promised to be available soon, and I would also like to see a Hulu and and HBO Go added to the list.", "verified": true, "helpfulness": "6/96", "author": "Joshua L Tomy"}]