[{"rating": 5.0, "review": "GREAT GREAT item to purchase especially of use with TV's that are not Internet-ready.  This device connects via HDMI to your TV, plugs into the wall; and, allows you to \"cast\" (as in casting a fishing line/rod) what's playing on your Internet capable device (iphone, Android, laptop, tablet) onto the TV.  Connect it to your WiFi and you're done. Buy one for every TV you don't have connected to the Internet. Can play Netflix, Amazon, Hulu+, and more.", "verified": true, "helpfulness": "0/0", "author": "Donise"}, {"rating": 5.0, "review": "I have Verizon and it does not work right away.  I need to call Verizon technical service to set the ip address for the chromecast an it is working great.", "verified": true, "helpfulness": "0/1", "author": "Vincent Dang"}, {"rating": 5.0, "review": "we stream most of our media (tv, music, movies, and even game apps) and this makes it so affordable and we haven't had any problems as of yet.  we use our smart phones (android) as our remote, we also use our tablet (also android based).  Love it!", "verified": true, "helpfulness": "0/0", "author": "A. spiegel \"makeup lover 85\""}, {"rating": 5.0, "review": "bought it the day they came out and still had to wait.. it is amazing and now i want one for every tv in the house", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product is super simple to setup and once you download the required apps to cast from your devices it does what it should do. I have had one issue with it crashing, but I am not sure it can be blamed on the device. Be advised once you plug it in it will be assigned to that specific HDMi port, so you will have to switch to that port on your TV/Receiver before you can start casting.", "verified": true, "helpfulness": "0/0", "author": "Matt Overton"}, {"rating": 1.0, "review": "Calling it Chrome Cast makes you think it will display anything from your Chrome browser onto your TV.  This is not true.  If you want YouTube, Netflix, HBO-Go, etc on your TV then get a Roku Player.", "verified": true, "helpfulness": "1/5", "author": "JASON J."}, {"rating": 5.0, "review": "Portable but strong signal. I love it. I might get rid of my iPhone to get more apps. It's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Akeshia Singleton"}, {"rating": 5.0, "review": "I love this thing. I usually keep it in our bedroom. When I travel I take it with me and plug it in to the hotel tv. It's a pretty neat little gadget. There are not many option for services but it works great for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jared C McDonald"}, {"rating": 5.0, "review": "It is a great product, works perfectly!Easy to setup and to use, would recommend it to every one.You won't regret it", "verified": true, "helpfulness": "0/0", "author": "Hubert"}, {"rating": 5.0, "review": "I have Chromecasted to various monitors in my home and hotels.  Always takes a little time to set up with the new network, but then works fine (except one time).  Version 2.0 will be even easier, I'm sure, but I would recommend this product - great small size, relatively easy to use, great form factor, good quality image projection.  It's now on my packing list for trips.", "verified": true, "helpfulness": "0/0", "author": "Dr. W."}]