[{"rating": 5.0, "review": "Ok I love this tiny box. Any movie or tv show or game that is free with prime is free with this box. Don't forget to buy your grim cord.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "I would recommend this product to everyone! Its so easy to use and perfect to have in a home! We love how easy it is to get to your favorite apps, to use apps and get new apps! It works really fast, and well! The one thing weve found is the sound sometimes gives us problems on the netflix app, we have to switch it in netflix, but other than that it works great!", "verified": true, "helpfulness": "3/3", "author": "Amber Feusner"}, {"rating": 4.0, "review": "I got one this weekend after a few months of debating whether to get an apple tv (as I primarily have apple products). In the end, I determined apple tv was redundant to what I already had set up for my television. Since then I've realized I do a fair amount of my tv watching through Amazon Prime, so when this came out I did a comparison and went ahead and took the plunge. So far I am very pleased with it. I like the set up, it's fast and works well with my less than optimal internet setup. The voice command option is fantastic- I've tried to use the one with my Kinect on my xbox 360 and it really wasn't worth it. The only things I feel like it is missing are MLBtv and HBOgo, which is why I have it at four stars instead of five. I hope those are eventually added.", "verified": false, "helpfulness": "0/0", "author": "T. E. Chalker"}, {"rating": 5.0, "review": "As the owner of a Roku 3 and Chromecast, I can confidently say Fire TV is really a superior product. It goes without saying it beats Chromecast, which I have never been able to get to work properly and basically sits in a drawer. The Roku 3 is a great device, and I probably would have been fine with it had I not received Fire TV as a gift. WOW! This is just a beautiful interface, and so FAST! I love the little things, like the beautiful photos that show up as a screensaver, or being able to play music in the background on Pandora while doing something else with Fire TV. Plus there is so much free stuff to watch since I am a Prime member! Though I heard HBO GO is coming later this year, I just fling it from my Kindle Fire HDX to my Fire TV and have no issues. Though I am excited for when Netflix gets integrated into search like they announced last week.", "verified": false, "helpfulness": "2/2", "author": "Char Baxter"}, {"rating": 5.0, "review": "I bought the Fire TV for two (2) main uses :watching movies and TV via Amazon Prime streaminginstalling XBMC for watching my video collectionI have been very happy using it for Amazon Prime streaming.  It is very fast and the video quality is very good.  I like being able to use the closed caption option, which was not available on my older Sony SNP-100 box.The Fire TV box is very small and it is silent.  I hope to use it for Netflix in the future.As to XBMC, it is still early days but it is working pretty well already.  If the XBMC Android port for Fire TV works for all my video formats, I will be able to retire a PC and simplify my TV setup.The recent announcements concerning the extension of the voice search to Netflix and Hulu Plus are very encouraging.  The one app that I am waiting for is support for MLB.TV.Pros:Very responsiveSmallSilent operationCons:still missing a few popular apps", "verified": true, "helpfulness": "5/5", "author": "das335"}, {"rating": 4.0, "review": "This device is pretty impressive in its responsiveness and what it offers.  The only negative thing for me is in order to watch movies off my Synology NAS I had to install Plex Player and install Plex Server on my NAS.  Even after that it still does not play them.  Most of the competition like WD Media Player or Iomega Media Player have a built in Player that will let you go to your media servers and play movies.  This one does not and its a big limitation.  Plex does not really play well with this device.  Now if you are getting it for watching Netflix, Amazon Prime and some of the built in features its an excellent device but if you are looking to stream across your network from your own movie collection this device falls a bit short.", "verified": true, "helpfulness": "0/0", "author": "Tball"}, {"rating": 5.0, "review": "I honestly say I love this. it processing is amazing. I have had it on for hours and it never heated up once. its amazing I use this more then I use my xbox I love it and I say its worth 100 bucks buy it", "verified": false, "helpfulness": "2/2", "author": "dominick hawley"}, {"rating": 4.0, "review": "I like the product. I was already familiar with ROKU and still use ROKU on another TV. All of the functionality of the ROKU seems to be there and the FIRE TV is quicker. The voice search works great. The weakness of the search as others have mentioned is that a search from the home screen on yields Amazon content. The ROKU search from the home screen give the results from other providers. If Amazon doesn't have the content you will have to search through each of the other apps such as Netflix and continue your search.  I still give the edge to ROKU at this point because of the search capabilities. If Amazon fixes that, the addition of the voice search and the speed of the Fire TV will give it the edge over ROKU.", "verified": true, "helpfulness": "1/1", "author": "R. Siebert"}, {"rating": 5.0, "review": "I gave the Fire TV a 5-star rating for numerous reasons; professional quality packaging, ease of installation, ease of pairing remotes, and video streaming quality.  My 2013 LG HDTV, while pretty high-tech for its time, was not on the list of products directly supported by Amazon Prime.  I found it necessary to stream video via my Apple iPad v3, back across my network to the TV, and buffering was a bit of a problem.  Being able to stream directly via the Fire TV eliminates the need to use the wireless network and the Apple iPad, thus buffering is no longer an issue.  The Fire TV has a very small foot print, about the same as my Apple TV, and supports all the features of other similar products, plus more.  Great purchase - get the wireless game controller too, you will not be disappointed.", "verified": true, "helpfulness": "5/5", "author": "Kevin E. Amos"}, {"rating": 5.0, "review": "We have been trying to decrease our cable costs and this IS the solution! we just bought hulu plus and are already prime members, almost everything i watched before is available for free and my sons shows that he watched on the kindle are there  just cant wait for the freetime to be available  we will order another one soon. we are now saving $80 /month by getting rid of cable!", "verified": true, "helpfulness": "2/2", "author": "jettysmom"}]