[{"rating": 5.0, "review": "This was my first venture into a streaming player.  I have to say I am impressed, the Fire TV is there to help disconnect from Cable or TV.  It is not a internet browser surfing machine, though with a few apps it could be...First, I have not had TV for many years.  I dropped Cable TV when I found I could surf on my my big screen via HDMI port on my laptop, years before Roku, Fire TV, or Chromecast were even rumored.  Not a hard thing to do, once I found a long HDMI cable, that was affordable.What I was looking for, was a box that would take the place of my laptop and the Fire TV is sooo close.  I was surprised there was not a Chrome or even a broswer app, and while we are there, why isn't there an Amazon app or Amazon Music* app?  My cell phone has these...*Amazon Music is on the Fire TV, but it's just my download / purchased music.  I have not discovered a way to get a non-downloaded Prime playlist added without pulling it into my cell, yet.Don't get me wrong, I am very satisfied with my purchase, this thing is simple to install and it configures itself for the most part.  If only it had a few more apps :)", "verified": true, "helpfulness": "0/0", "author": "GrayTiger"}, {"rating": 3.0, "review": "needs more content. games are mostly 16bit style old school stuff with a couple decent titles thrown in for excitement drive!I have apple tv, roku and x1- this is a decent addition but wont replace anything yet... it's still pretty new.the voice command is very accurate and is actually very useful.also, can't be controlled by most universal remotes. that kinda sucks", "verified": true, "helpfulness": "0/0", "author": "Dave Funk \"TFR motorsports\""}, {"rating": 5.0, "review": "This is awesome but the remote is not working after 2 days.  Not the batteries and did not drop it.  Have to contact customer service to see about replacing it but the availability of shows is wonderful!!!! Ok so I was transferred 4 times but the tech guy fixed the problem over the phone. Only took 13 minutes, transfers and a few more questions I asked also. This is really awesome-- product and service!!!", "verified": true, "helpfulness": "0/0", "author": "Deana Mercer"}, {"rating": 5.0, "review": "Ok this thing is cute. I ordered it without looking at the size and expected it to be the size of a vcr/Dvr or at least the size of my cable box! It's tiny! I mean teeny-tiny! I ordered the HDMI cable as I knew I did not have one. One two three I have the thing cabled. Fire TV did not come on right away and I had to adjust the input selector (admittedly the instructions tell you to do this .. ) and I did connect it to my router with an Ethernet cable. I loved the cartoon character walk through of how it worked and a few minutes later I knew my way around. I have a Prime account and my room mate has a Netflix account and it was easy to set up. Best Cyber Monday deal. Now I just need to get rid of cable ...", "verified": true, "helpfulness": "0/0", "author": "ALG"}, {"rating": 5.0, "review": "So far I love it. It moves fast. No stalls. Love the music and the ability for Hulu , Netflx, and others. Love it.", "verified": true, "helpfulness": "0/0", "author": "Am Schneider"}, {"rating": 4.0, "review": "The box is a great piece of equipment,  Unfortunately the youtube app puts out interlace video of which there is no excuse in 2014.  Roku youtube app does not do this.  It is awful when corporations argue with each other instead of taking the customer's interest in mind.  Youtube is an awesome service of which Amazon Prime Video does not have to be apologetic due to it being a great service.  Along with the Fire TV the Fire TV stick is a great device.  The youtube app needs to be fixed and the Fox News app is missing but other than that it is superior to Roku.  Can't comment on Apple TV.  I would definitely buy another stick, or a Fire TV if the price is right.Update: Reverified Roku does not have the youtube issue.  Currently my panasonic projector is losing sync when viewing my downloaded videos under the photo section.  Video in all other sections has been perfect.  Still 4 stars but may drop to 3 if the photo video viewing does not improve in the future.", "verified": true, "helpfulness": "0/0", "author": "J. Mills"}, {"rating": 5.0, "review": "Easy set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Jane Hoeweler"}, {"rating": 5.0, "review": "Works great.  Amazon Prime is steadily adding more offerings to its lineup.  I watch Netflix on it, use the PBS and Smithsonian channel apps on it.  We canceled our cable tv and now watch shows on the Fire exclusively.", "verified": true, "helpfulness": "1/1", "author": "WHC"}, {"rating": 5.0, "review": "I originally bought this out of curiosity.  It works well and has good wireless connection with adequate picture quality on my Time Warner Cable service.  I use it for working out, the 48\" Vizio TV I bought had trouble connecting with my wireless downstairs, but the Amazon Fire has no problems.  I think this would be really good for TV's that don't have wireless capability.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it - it's so easy to set up and the voice commands work perfectly.", "verified": true, "helpfulness": "1/1", "author": "Rosemarie K. Green"}]