[{"rating": 1.0, "review": "Used it for a month or so with no problems. It then began to disconnect from my wifi and had to be reconnected every day, then it just stopped connecting. It is in the junk pile now.", "verified": true, "helpfulness": "0/0", "author": "Habayou"}, {"rating": 4.0, "review": "Works great with the limited number of available applications. Really weird that it ALSO needs to be plugged into the wall - hate the extra cord.", "verified": true, "helpfulness": "0/0", "author": "Paul Gardner \"Conductor of Magical Publishing\""}, {"rating": 1.0, "review": "They have a lot of nerve selling this product. It has problems regardless of what browser you use. Sometimes no sound, sometimes sound no picture and very slow to book. I would not recommend this product until they improve it.", "verified": true, "helpfulness": "0/0", "author": "Peter Klossbruhe"}, {"rating": 3.0, "review": "Came fast and fits what it was intended for! Didnt work on my down rev TV, read specs carefully, know your TV.", "verified": true, "helpfulness": "0/0", "author": "Mcgoo"}, {"rating": 1.0, "review": "Save your money and buy a Roku.  I bought this and used it about 5 times.  What a waste of $35 and time.", "verified": true, "helpfulness": "0/0", "author": "A. Rancourt"}, {"rating": 5.0, "review": "Useful piece of hardware. Worked as advertised. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Gina S."}, {"rating": 5.0, "review": "I am very happy with my Google Chrome cast it has not let me down yet. I give it a 10 star thumbs up keep the good work. Thank you blessings", "verified": true, "helpfulness": "0/0", "author": "DR. JESUS G RODRIGUEZ."}, {"rating": 5.0, "review": "After setting up it is easy to use and a lot cheaper than satellite or cable.", "verified": true, "helpfulness": "0/0", "author": "JGPiper"}, {"rating": 5.0, "review": "Love this gadget!", "verified": true, "helpfulness": "0/0", "author": "T. Byrd \"Forensic Reader\""}, {"rating": 5.0, "review": "Awesome! A must buy if you own a Android device!", "verified": true, "helpfulness": "0/0", "author": "Steve Haze"}]