[{"rating": 5.0, "review": "I got this for Christmas, and I love it! It's easy to set up and to use. The only problem is there is so much to watch :-)", "verified": true, "helpfulness": "0/0", "author": "Nana Mimi"}, {"rating": 3.0, "review": "Don't like how what you are watching stops and you have to hit ok then restart what your watching. It would be really nice to have more history chanel shows that you didn't have to pay for. And have more RFD TV programs and be free to watch. Over all pretty happy so far.", "verified": true, "helpfulness": "0/0", "author": "Beaser"}, {"rating": 4.0, "review": "This is very easy to set up and use. Thought there would be more free movies and shows with a Prime account, but you still have to pay for a majority of the good ones. The voice command works great as advertised. They product itself is great, but would like to see Amazon offer more with a Prime account.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Love it. Bought it for my husband.I will get one for me soon.", "verified": true, "helpfulness": "0/0", "author": "P. Crocker \"PattyC\""}, {"rating": 5.0, "review": "Works great, streams my HD content with no problems (although im using wired vs wireless connections to my device).  Love it!", "verified": true, "helpfulness": "0/0", "author": "J. Alva"}, {"rating": 4.0, "review": "Easy to hook up and simple to use. Would not work on my older tv in living room because it doesn't have a HDMI connection. Hooked up in bedroom where I seldom watch tv so not getting much use, but looks like when I upgrade to a newer tv in living area soon hopefully, it will be of good use then.", "verified": true, "helpfulness": "0/0", "author": "Tyler Riggs"}, {"rating": 5.0, "review": "So easy .  As advertised.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Vicki Burner"}, {"rating": 5.0, "review": "Fired my local cable company. Now I only use Amazon Prime with a Fire TV, Hulu and Netflix. Tivo as a DVR. I'm one happy camper here and saving over a thousand dollars a year.", "verified": true, "helpfulness": "0/0", "author": "Tegs \"~Tegs\""}, {"rating": 4.0, "review": "The fire TV was just as everyone has said.  It was easy to install, the picture quality is superb and the feed is fast. I would recommend it over all the others.", "verified": true, "helpfulness": "0/0", "author": "P. Henry"}, {"rating": 4.0, "review": "I am pleased with the Fire TV stick.  It arrived as always in perfect \"prime\" time.  It was an easy set up.  After a few minutes of reviewing what I was looking at, I found it easy to navigate through the providers and options.  I gave it 4 starts instead of 5 because honestly I do not understand why the voice command can only be used with Amazon.  This would be a feature of the actual TV stick and to me Amazon has just chosen that it can only be for Amazon searching to steer you into the direction of choosing Amazon selections to watch primarily.  Silly.  I will watch what I want to as I am still paying for all services independently.  There was no reason not to make that a capability for all networks. Otherwise I am just happy to be able to watch Amazon and Netflix on my large screen TV.", "verified": true, "helpfulness": "0/0", "author": "Laurie S."}]