[{"rating": 4.0, "review": "I like that it's small and easy to use! I've had to call for help fixing it twice now, they were easy fixes but it's the matter of the fact!", "verified": true, "helpfulness": "0/0", "author": "Tony Simpson"}, {"rating": 5.0, "review": "I had been streaming Netflix through my Blu-Ray, and was having constant issues with it locking up and needing to be re set. With the Amazon Fire, after a slight learning curve, I now have absolutely no issues streaming. I am hoping it has a long life, because it is wonderful.", "verified": true, "helpfulness": "0/0", "author": "Brewski"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "Atef"}, {"rating": 5.0, "review": "One of the best gifts I've received! Setup to running took me less than 2 minutes!!  The voice search capability is a huge benefit!! Awesome!", "verified": true, "helpfulness": "0/0", "author": "Bowler - VA"}, {"rating": 5.0, "review": "The Fire TV has exceeded my expectations! I still have an Apple TV but barely use it now. There's pros and cons to both but the Fire is one great little unit!", "verified": true, "helpfulness": "0/0", "author": "Christopher watkins"}, {"rating": 4.0, "review": "This is a great add-on for our viewing pleasure, to manage when you have a list of movies created. Sure wish there was some type of keyboard connectivity for searching ease. For now I use my computer to create my lists or search for selections and use the Fire TV for viewing movies or Fire recommendations.", "verified": true, "helpfulness": "0/0", "author": "RMWizer"}, {"rating": 1.0, "review": "Most channels I wanted to watch, you still needed a cable provider.  I was hoping this would replace my cable provider.  Other channels I can watch on my tv with an HDMI cable hooked up to my tablet, so Fire TV was essentially useless to me.", "verified": true, "helpfulness": "1/5", "author": "Tammera Nickerson"}, {"rating": 5.0, "review": "This is a solid little unit. Does everything I need it to do. Well done, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Domenick Polesel"}, {"rating": 4.0, "review": "Would give it a 5 star if Vudu were available. Would be nice if Amazon added Vudu app to Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Curtis Joy"}, {"rating": 5.0, "review": "We received the Fire TV as a Christmas gift!  WOW!  And along with a 40\" flat screen!  Great kids!!!", "verified": true, "helpfulness": "0/0", "author": "Howie Beutler-Cruise \"LoveToRead\""}]