[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "A MUST HAVE.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 3.0, "review": "not enough apps.  Screen mirroring from notebook doesn't work very well.  Terrible lag.", "verified": false, "helpfulness": "0/0", "author": "NotAvailable"}, {"rating": 3.0, "review": "I bought this after my Equiso smart stick broke.  The price on the Chromecast is right, and it works well, but I miss the Equiso remote stick, and kinda wish I had waited until the Amazon Fire TV stick came out.  We ONLY use this to watch TV shows, mostly HULU.", "verified": true, "helpfulness": "0/0", "author": "Laura G. Peretic"}, {"rating": 3.0, "review": "Coming to Chromecast more than a year after its initial launch, I have to say that the technology is still not mature and not very well integrated with devices and apps.I have tested with a Nexus 5 and Android 4.4.4, an older Asus Slider tablet, and the iPhone 4s.For anything other than Youtube and Netflix, providing uninterrupted content is difficult. Depending on how websites stream video, there will be limitations. Chromcast will stop playback after each clip if the content is a sequence of short clips, as it is the case on some news sites. Lots of tapping is required until the next clip is up, to the extent that I just end up watching on the device. Some sites are built so that the maximize button is not available for the device, and the Chromecast link never appears unless the video is in full screen. Netflix works pretty well, though.All content works well in places where my wireless signal is low and other devices are having trouble providing an uninterrupted stream.Overall, this is a nice gimmick for the occasional projection of content from the device, but as a full-time streaming device for on- and offline content it is very limited.", "verified": true, "helpfulness": "0/0", "author": "Trailman"}, {"rating": 5.0, "review": "Works great.Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "JJM1827"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "TROY SMART"}, {"rating": 5.0, "review": "With Chromecast I can watch all sorts of video on my tablet and send them to the big screen. Great when I cannot find anything worth watching on TV. And the price is right too.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I finally bought a big LED tv and couldn't wait to get a Chromecast, I picked one up, came home, set it up and was sadly not the least bit impressed.  Here is why1. Playback Performance.  It took twice as long to load youtube videos as my PS3.  (sometimes longer, yes I timed it)/  And Netflix, it would barely load, buffering close to once a minute, sometimes sooner than that, and when it did load, it was pixelated badly.2. Wifi performance. Obviously the above issues were from a poor wifi connection. Normally I wouldn't blame the device, but in this instance, my TV (which has a wifi connection), my laptop, my phone, my PS3 AND my 360 are all in the same range, the PS3 and 360 are less than 2 feet away, and just as far from my router and all work flawlessly on their WIFI connections. So its not the network. Its the Chromecast.3. Features.  Now, to be fair, I JUST bought this TV and its a pretty new model, so it has the newest features.  So, my TV does Youtube, Netflix, it can stream content off my phone/tablet/laptop, it can do PLEX, it has Hulu/Facebook/Twitter and everything that the Chromecast has.  I did some reading and it appears that every \"smart TV\" on the market does this.Bottom line on #3 is that if you buy or already own a recently released Smart TV, don't waste your time or money on a Chromecast. Your TV already does everything the Chromecast does, and likely does it better.I know in the past a lot of smart TVs suffered from a clunky interface and slow performance, and many didn't do PLEX. This is changing and TVs released more recently have a lot higher performance and nicer interfaces.  My LG LED (I don't recall the model number, its the 4K that isn't 3D) has a very nice interface, its just as easy to navigate, just as fast as the chromecast and does PLEX.", "verified": false, "helpfulness": "0/0", "author": "David Birt"}, {"rating": 3.0, "review": "This device isn't magical as marketed. It doesn't work well if you've got an el cheapo WIFI router. Try watching sports when the screen freezes every 8-15 seconds and te router is virtually in the same room as the chromecast paired TV. Not google Chromecast's fault, I know, but Google should partner with a router vendor to recommend WIFI routers that they know will produce optimal streaming quality, rather than just selling this as the great hope and answer to all of your streaming needs.I would also like to see a feature that enables streaming anything from your mobile device. I know this is not limited by technology, but legality. Perhaps first with Android OS devices? I don't get how companies can only permit consumers watching certain content on mobile devices, but wont let you stream the same content to your TV?I could like chomecast more, but will have to try it out with a better router.", "verified": false, "helpfulness": "0/0", "author": "djkobafemi \"kofi_o\""}]