[{"rating": 1.0, "review": "I definitely don't recommend. It requires third wi-fi point which connects chromecast to the cell phone. I don't understand why it is not able to directly set up a link with phone.", "verified": true, "helpfulness": "0/1", "author": "NURI"}, {"rating": 3.0, "review": "I like how it connects my laptop and tv. however , if the wifi is not stable enough or maybe some other issue will cause video freeze quite often.", "verified": true, "helpfulness": "0/0", "author": "Misha"}, {"rating": 5.0, "review": "Great product this Chrome cast dongle has easily become a part of my life. It had simplified my entertainment tremendously.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Baje"}, {"rating": 4.0, "review": "Does exactly what I wanted it to do. Needed to purchase Plex for the complete package and will rate 5 stars when more apps / programs are added. For $35 you can't beat the deal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got one for each of my kids as a stocking gift, and because they reported it was one of the best gifts ever, I got one for us parents!", "verified": true, "helpfulness": "0/0", "author": "Caroline A. Miller \"Goals and Happiness Coach\""}, {"rating": 5.0, "review": "Easy to use, saves $. Brings us a step closer to giving up cable. Now if we can improve antenna t.v. reception.", "verified": true, "helpfulness": "0/0", "author": "ken wickman"}, {"rating": 1.0, "review": "Got this set up but for some reason getting it to cast was an ordeal for us. We use Roku to watch TV but wanted this to cast movies to TV from websites. It worked when IT wanted to work. Then the oddest thing happened. We tried to turn off our Vizio TV and the darn thing kept turning back on. Over and over we tried different inputs and turning off and it would turn right back on. Unplugged the Chromecast and TV was fine after. Returned it. Works pretty good for my folks to cast Pandora at their house except it keeps stopping doing that \"Are you still listening?\" prompt. Our Roku Pandora never stops until we stop it.", "verified": true, "helpfulness": "0/0", "author": "Melissa McGinnis \"shop-a-holic-in-remission (sorta)\""}, {"rating": 4.0, "review": "The Chromecast works as advertised, just don't expect to get phenomenal value out of it. It's definitely worth $35, but it lacks features you might expect in a smart TV.There is no user interface. Period. No UI whatsoever for your TV nor one on your smartphone in the form of a dedicated app. Chromecast is controlled from your mobile device via certain apps, like Netflix and YouTube.It's a Google product, so if you ever find yourself needing support, don't expect much help from Google. The best thing they can do is focus on expanding upon the Chromecast, because I believe it has great potential.", "verified": true, "helpfulness": "0/0", "author": "Daniel Marquard"}, {"rating": 5.0, "review": "Doesn't need butter or mayo either.  The process of setting up could be explained a little better, but the gist of it is to find the Chromecast device using your computer, iPad or Android's WiFi search feature, then load the app or go to the website.  If using a computer, you need to load the porting app so your browser can send the command to Netflix or Hulu to redirect to the Chromecast device.  Great HD video.", "verified": true, "helpfulness": "0/0", "author": "Robert S."}, {"rating": 4.0, "review": "Easy to install and setup. Works very good with Google Movies, Netflix, Youtube and recently with Napster. Displaying tab to TV from the chrome browser works good meanwhile the page you are displaying is not reproducing videos, in this case the image works with interruptions and finally communication falls.In brief it works good with phone and tablet apps, not the same in case of laptops with Chrome Extension", "verified": true, "helpfulness": "0/0", "author": "LCRD"}]