[{"rating": 5.0, "review": "just dont understand all those old movies still want to pay for them, when i am paying hundred dollars a yr. ?", "verified": true, "helpfulness": "0/0", "author": "buck"}, {"rating": 4.0, "review": "Way cheaper than cable", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Couldn't be happier with my Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Katherine M. Meduna"}, {"rating": 4.0, "review": "I resisted buying this gadget because I already owned Apple's remote - but I'm sorry I delayed. This device is head and shoulders more effective than Apple's Media Player. The Fire TV is user-friendly and simple to understand. Unlike the Apple MP, which requires you to re-login at odd times, and which seemingly can't remember who you are, the Amazon Fire automatically links to your Prime account and remembers where you left off. Additionally, the Fire's remote is slick and responsive versus the Apple, which is quirky at best.", "verified": true, "helpfulness": "0/0", "author": "RJM402"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Dr. Boomer"}, {"rating": 5.0, "review": "OUTSTANDING! What can I say? Finally liberated from cable TV. Within minutes, we had this installed and started enjoying uninterrupted movies and television shows with Amazon Prime membership we already had for the great shipping of packages feature. Entertainment at our convenience for a price we save every month by not having cable TV. It's too good to be true, so I'm still holding my breath hoping the government won't some how screw this up.", "verified": true, "helpfulness": "0/0", "author": "Mike Bifulco"}, {"rating": 5.0, "review": "I hope future software updates bring the ability to search other apps (netflix, etc) opposed to amazon only.", "verified": true, "helpfulness": "0/0", "author": "Pedro A. Cintron"}, {"rating": 3.0, "review": "Apps were slow to load. Streaming would stop or fail and disconnect. Exchanged this for a Roku3 instead which is leaps better. I got it because you could talk to it to find shows but because of the streaming and connection issues I had to take it back. It does have great programming though.", "verified": true, "helpfulness": "0/0", "author": "Di Vixxen"}, {"rating": 3.0, "review": "produce is good and fast but you cant stream movies from your PC OR mobile directly , you need to buy a software for that and it's not a good option.. streaming throw it is slow and you will face a problem with the subtitle.you cant add or change any font or code for the subtitles !!one more thing you cant connect any Storage device (USB flash memory or H.H.D ) the USB port is not detecting it!!!this device  is good only for amazon videos and products but you will spend a lot of money For sure, most of the good movies is not for free even with the prime account.", "verified": true, "helpfulness": "0/1", "author": "Faisal"}, {"rating": 3.0, "review": "The sound gets a tinny ring after a while. You can unplug it and it fixes the sound, but it comes back. I am writing CS to see if it is defective, but the fire stick does the same thing. I love the response, to loading ability and user interface. Need to get the sound fixed.", "verified": true, "helpfulness": "0/0", "author": "Frayed Knot \"frayed knot\""}]