[{"rating": 3.0, "review": "Interesting device, I loved the idea of having something that can wireless receive HDMI signals from other devices.  The downside is Google has locked this down so it's limited to a few apps.  For the iOS users you can only stream You Tube and Google Play (at this time).  You can't just stream anything you want from your PC to the Chromecast, it's limited as well.  There are \"hacked\" versions of this device out there that allow a lot more flexibility in what it can do. (I know have one).If you just need something that can play Netflix, HBO GO, Hulu or Pandora and that's all you really want for now, this is a cheap way to get high quality streaming video over WiFi!  If you want to stream anything and everything, this isn't there yet.Note, this product will continually update with new firmware so it's possible things improve and new features continue to be added to the device.", "verified": true, "helpfulness": "0/0", "author": "S. Shah \"Hi-Fi 4 Ever\""}, {"rating": 1.0, "review": "You can only stream youtube from your phone,  not videos from other sites. Very limited, hope next version can do more.", "verified": true, "helpfulness": "0/0", "author": "George Tsividakis"}, {"rating": 5.0, "review": "Work great.  One trick to play movie on TV is open up chrome browser andCTRL + O and select your movie.", "verified": true, "helpfulness": "0/0", "author": "M. T. LAM"}, {"rating": 4.0, "review": "This is exactly what I wanted out of my bedroom tv: play Netflix easily, play YouTube easily, play Pandora easily.Cons:-Black colors don't look great on Netflix or YouTube - lots of artifacts.-Apps sometimes crash on your device when casting to Chromecast.  When that happens - you have to load back up the app you were using and connect again to get controls working - like pausing a video.Beyond that I really enjoy Chromecast and would recommend it for anyone wanting an easy way to play their media from their Android device.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "I love it, works great with my Samsung S4 and I get to watch all my movies from my phone to my big screen", "verified": true, "helpfulness": "0/0", "author": "Yasbec Vera"}, {"rating": 5.0, "review": "Love it, super easy to install and use. Was well worth the purchase. Streaming made super easy or watching and listening to the computer that much easier.", "verified": true, "helpfulness": "0/0", "author": "noname9999 \"Working Mom in Ohio\""}, {"rating": 5.0, "review": "Totally COOL.But understand what it does and doesn't do (It's not Apple TV).Easy setup.Cast videos from Youtube or your Desktop to your TV.Quality very good...and you can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Rob G."}, {"rating": 2.0, "review": "failure to give information on the system needed to work, will not work with Vista system must be windows 7 or newer", "verified": true, "helpfulness": "0/2", "author": "Michael Ray"}, {"rating": 5.0, "review": "It does what it promises to do. It arrived earlier than expected. My kids and I love it. Great device.", "verified": true, "helpfulness": "0/0", "author": "D. Osegueda \"24 fan\""}, {"rating": 5.0, "review": "This works awesome. Buy it NOW. It makes it so easy to stream to your TV from your laptop iPad or phone.", "verified": true, "helpfulness": "0/0", "author": "robert horn"}]