[{"rating": 5.0, "review": "Absolutely amazing piece of technology.  Makes watching Hulu, Netflix, Youtube, etc. extremely easy.  I bought it as a gift for a relative, and now the entire household uses it daily.", "verified": true, "helpfulness": "0/0", "author": "Clint Mendonca"}, {"rating": 5.0, "review": "Got this just because it was so cheap and wanted to see what it can do.  Comes in handy when browsing Netflix or YouTube then want to easily transfer the video to the big screen.  I wish it was supported by Amazon Instant Video.  Just saying, Amazon!", "verified": true, "helpfulness": "0/0", "author": "JOHN VAN ZANDT"}, {"rating": 5.0, "review": "I like this product and it streams shows from laptop to TV just fine.", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 1.0, "review": "Spent hours trying to set it up because didn't want to Connect to the WIFI, after hours trying to fix the problem finally had it connected,had to rebooted a couple of time because it got stuck updating the OS, when FINALLY was able to use it, just worked for like 10 mins then lost the connection. Very disappointed.", "verified": false, "helpfulness": "1/1", "author": "Raymond Monge"}, {"rating": 5.0, "review": "A good addition to my hardware.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Hornsby"}, {"rating": 3.0, "review": "I received the Chromecast today.  Spent a lot of time setting it up between my laptop and hdtv.  I am thinking of cutting the cable so I wanted to see how good the web videos were if run on the Chromecast.  Chromecast casts the webpage on the TV OK, after you spend some time setting it up, but the videos are not sharp - not bad but not sharp.At the same time, I ordered http://www.amazon.com/gp/product/B004H1RHD6/ref=oh_aui_detailpage_o02_s00?ie=UTF8&psc;=1Belkin Laptop-to-TV HDMI Cable (Supports Amazon Fire TV and other HDMI-Enabled Devices), HDMI 2.0 / 4k Compatible.  I had a hdmi cable but it did not seem to work with my new laptop so I decided to get a new hdmi cable.  So after putting in all that time getting Chromecast to work, I plugged the new hdmi cable into the laptop and into a hdmi port on the tv.  Worked instantly.  No fuss.  No struggling to set it up. No bothering with the bane of my oneline life - logins and passwords.  Sharp videos.The difference may be due to the fact that Chromecast uses the wifi, but the hdmi cable is of course wired, but the cable is half the price of the Chromecast and is so much easier to use.  And did I say the videos are sharper too.I noticed that Youtube videos were pretty clear with Chromecast if I chose to cast them through the Roku2, but that option does not appear to be commonly available using Chromecast.Just thought someone might be interested in my experience when considering options and to know that a hdmi cable is an option and cheaper too, unless of course you need or want wifi.", "verified": true, "helpfulness": "1/1", "author": "Big Mamma"}, {"rating": 5.0, "review": "i just love Google chromecast  very good product", "verified": true, "helpfulness": "0/0", "author": "Sherman"}, {"rating": 5.0, "review": "excelente producto", "verified": true, "helpfulness": "0/0", "author": "Yesmey Carrillo"}, {"rating": 5.0, "review": "Love doesn't adequately describe how much I love this device.  I bought a second one for the main room after giving the first one to the kids.  As more apps come online this product will only get better.", "verified": true, "helpfulness": "1/1", "author": "Brent Currey"}, {"rating": 5.0, "review": "Exactly what I wanted. Works great, easy setup. Will do business with this company again.", "verified": true, "helpfulness": "0/0", "author": "Brian Leger"}]