[{"rating": 5.0, "review": "Bought two of them.  Really enjoy having them.  Not too difficult to set up or configure.  Doesn't integrate into Amazon Prime app on iPhone or iPad.  We mostly stream Netflix app, TED app, YouTube app, Google Play app.  But it is very convenient to stream a movie to our TV instead of hooking the iPhone or iPad up using a cable.", "verified": true, "helpfulness": "0/0", "author": "Woodson H. Farrar"}, {"rating": 5.0, "review": "bought this for my step daughter and she loves it...she has been streaming movies to her TV for 2 weeks now and still thinks it's the best thing ever", "verified": true, "helpfulness": "0/0", "author": "Rocket Man"}, {"rating": 5.0, "review": "Very good, now I can view/cast youtube videos and others on my TV.", "verified": true, "helpfulness": "0/0", "author": "John Paul C. Gamana"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "virginia lynn barnes"}, {"rating": 4.0, "review": "GOOD - For those who HATE clutter and love continuity this is UNNOTICEABLE in a good way in your media center- Works with basically all modern android smart phones, iPhones 4 and newer, also iPads computers and android tablets - Set up was EXTREMELY easy - Personalization with adding multiple accounts and backgrounds on the device is a nice extra - THE PRICE is hands down the best for a streaming device. Period.BAD - No Remote - Needs to be plugged in Via USB to work - Does NOT come with wall adapterBOTTOM LINEFor anyone with a little extra cash that wants to upgrade their older not so smart TV's, this will be one of your best investments. I HIGHLY recommend this product if you do not mind the lack of a remote (Product is control via the device it is connected to), always having to be plugged in (Most TV's have USB ports).", "verified": false, "helpfulness": "0/0", "author": "paul"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "bruno paulino"}, {"rating": 5.0, "review": "Very good appliance!", "verified": true, "helpfulness": "0/0", "author": "Pablo Ferreiro"}, {"rating": 3.0, "review": "I love it when it works. One never knows when that will be.", "verified": true, "helpfulness": "0/0", "author": "Don Cooper"}, {"rating": 5.0, "review": "I tend to be on the frugal, minimalist side and wait until I'm sure if I need something before purchasing.  I was hooking a laptop or tablet up to my TV using a HDMI cord, but every time I needed to pause or play, I had to get off the sofa and squat down by the TV to pause/play on the computer--the old-fashioned way.  If you use the chromecast, you hook it in your TV once, and then you can stream from your tablet, iphone, laptop, chromebook, etc. without getting up once--SOOOOO NICE!!!  If you're like me and on the fence about purchasing this, I'm here to tell you that you will not be disappointed!!!  Why didn't I buy this five years ago!!", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 3.0, "review": "Works for what it does, but does not fulfill its potential.  Disappointing that it is not able to stream DLNA.  Also, having to initiate on another device and then cast to this is a bit of a pain, when plenty of products keep everything natively on the device.  This was a first for devices being this small, but is far from the best.", "verified": true, "helpfulness": "0/0", "author": "Bricketh"}]