[{"rating": 4.0, "review": "Works as advertised - only complaint is that doesn't have an independent remote", "verified": true, "helpfulness": "0/0", "author": "W Kethman \"wkethman\""}, {"rating": 5.0, "review": "great product easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tuan Nguyen"}, {"rating": 5.0, "review": "I love the fact we can move this from room to room. My oldest daughter has been using this to watch shows from her laptop to the TV. So easy to use and works with NETFLIX!", "verified": true, "helpfulness": "1/1", "author": "Amy C"}, {"rating": 4.0, "review": "I am using Google Chromecast with 2009 Sony LCD flatscreen TV, and using a Samsung Galaxy Tab 4 to cast.  Primary purpose is to cast Netflix content from the Galaxy Tab 4 to the Sony TV.First of all, everyone should be aware that this device requires external power, namely from a USB port.  Since my older Sony TV did not have a USB port, this meant I either had to use the Google provided wall/plug USB converter - or in my case, I found a USB port on my cable providers set-top box, and plugged the USB cable from the Chromecast dongle to that port.Fortunately, the HDMI plugs on the Sony TV were accessible.  The Chromecast dongle is pretty large and it would definitely interfere with the TV case on certain TVs.  Mine sticks off the side on my TV like a big black stub; but maybe that is good for reception.  It is rather ugly.Biggest problem during setup was the now all too familiar \"16003 error\" when trying to cast Netflix from my Tab 4.  This would occur within a minute or so after choosing the Chromecast icon on the Galaxy Tab 4 Netflix interface.The fix for now (I am waiting to see whether the error recurs) was to \"synchronize\" the time setting between my Tab 4 and the Internet/Wireless.  Unfortunately on the Galaxy Tab 4 there is no \"automatic\" time detection, you have to manually adjust the time.  But when I got the time (hours and minutes) sufficiently close enough between the Tab 4 and the Internet/wireless, the Netflix Chromecast finally worked.  I did this by watching the minute rollover on my PC, then at that instant changed the minute setting on the Tab 4 to match.  Apparently, that was close enough to get the clunky Netflix/Tab4/Chromecast connection to work.What really astounds me is that it took the user community to identify the root cause of this problem.  Google and Netflix apparently have no clue, and don't seem to care. Once they have sold the hardware, their job is done.  Thank goodness we have Amazon reviews and other online forums to share information like this.  (Hint to Amazon: Don't toy around with removing or de-featuring the user reviews here, in case that ever crosses the mind of one of your product planners).", "verified": false, "helpfulness": "1/1", "author": "Midwesterly \"Midwesterly\""}, {"rating": 5.0, "review": "After the easy peasy setup, streaming to my TV was a breeze. This in combination with Netflix, Hulu, Amazon Prime and YouTube, there's really no need to pay a load for cable. Saves a ton! Great product!", "verified": true, "helpfulness": "0/0", "author": "M. Smith"}, {"rating": 5.0, "review": "Chromecast is easy to set up and use. It's so small that it can easily be moved from room to room. The price is excellent compared to other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Wendy R. Clagett"}, {"rating": 2.0, "review": "it was ok but not user friendly and you have to covert to chrome for it to work better", "verified": true, "helpfulness": "0/0", "author": "r garcia"}, {"rating": 4.0, "review": "Wish it would stream everything,, but it doesn't without some additional apps", "verified": true, "helpfulness": "0/0", "author": "Adult Male"}, {"rating": 5.0, "review": "So easy to use!  Even a non-tech can get this set up.  Great value.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect little device to my ever my boring old TV. I just saved lot of money getting a smart TV. Thanks Google for the product and Amazon for the wonderful shipping all the way to India :)", "verified": true, "helpfulness": "3/3", "author": "Reuben Ranjit"}]