[{"rating": 5.0, "review": "Works well and easy to set up. More content becoming available all the time. If you are looking for a cheap media player then this could be the one for you.", "verified": true, "helpfulness": "0/0", "author": "Cynthia A. Nunley"}, {"rating": 1.0, "review": "I received one of these as a gift and it works with my boyfriend's phone but it doesn't work with any of my handheld devices although the description says \"Chromecast works with devices you already own, including Android tablets and smartphones, iPhones, iPads, Mac and Windows laptops, and Chromebooks.\"The app for the android phone isn't compatible with my LG Android phone, there isn't an app for my new Nokia Lumia 1020 phone, and of course it doesn't work with my Kindle Fire HD. This thing is completely useless to me since it doesn't work with all 3 of my handheld devices!I just ordered a Fire TV. Thanks for nothing, Google.", "verified": false, "helpfulness": "1/2", "author": "Amie M \"Amie\""}, {"rating": 5.0, "review": "We bought this for my son-in-law for a Christmas gift.  He loves anything electronic.  They now watch everything they used to watch on their computer on their TV.  We are going to get one if he will come set it up and show us how to use it!", "verified": true, "helpfulness": "0/0", "author": "Carol Shaw"}, {"rating": 5.0, "review": "Buy this. It's super easy to use and super convenient. Works great with Netflix, Youtube, HBO Go, Hulu plus and google movies.", "verified": true, "helpfulness": "0/0", "author": "Andy B"}, {"rating": 5.0, "review": "Just a note about Samsung SmartTVs if you have one and are trying to use this with it. When I first plugged it in to an HDMI port, the TV recognized the same HDMI input in two different ways. One looked normal on the input selection list, and the other had this graphic label on it called \"Anynet+ (HDMI-CEC)\". Selecting either would indeed show you the Chrome interface screen, so I was able to set it up on my wireless network just fine. However, upon trying to actually cast Netflix from my phone or computer it just wouldn't play. The laptop or phone would act like it was casting, but nothing would play through to the HDMI inputs on the TV.You need to go into the TV's settings, and turn off the \"Anynet+ (HDMI-CEC)\" feature, then it will work fine. If you need that option on for some reason, then I'm not sure what to do, as I do not use it.", "verified": true, "helpfulness": "1/1", "author": "thundercade"}, {"rating": 5.0, "review": "Excellent product. Great performance casting videos and apps from my iPad. Chromecast is just beginning to embrace its capabilities of casting.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Benitez Gonzalez"}, {"rating": 1.0, "review": "I chose 1 star because all of the advertising doesn't say what google \"Chromecast\" won't do.  On all of the commercials and advertising you would assume anything on your phone, computer, or tablet could be put onto your tv.  This couldn't be further from the truth!I think it is highly overpriced to just be for things that you can view in the google chrome browser, netflix, and a few other.  I could have saved $25 and just bought a HDMI converter for my computer and tablet.  I think for this product to be up to snuff, it should be able to play whatever you are watching on any device, in any screen.  While also being easy to put onto your tv.  The only reason I didn't send it back was because I hope the updates will make the product more feasible for the people that bought it and intend to use it.  But all in all, I was very disappointed in this product!!!!", "verified": true, "helpfulness": "4/4", "author": "Willie Young Jr"}, {"rating": 3.0, "review": "I have very low bandwidth internet package and is shared for close to 10 devices. I found out that my TV does require more bandwidth for the content to load. To avoid spending extra dollars on upgrading internet connection. I got the Chrome cast and works absolutely fine. How ever the streaming channels are limited but that's what Google has to offer for this device. The major disadvantage is its not allowing the tab casting any more that's so disappointing.Pros:Easy SetupCan reset the settings and connect it backWorks for Ipad,Iphone and all other smart devicesWorks with low internet packages and bandwidth and streaming is quick and nice.Cons:Very limited channels and didn't try password protect for chrome castTab Casting is not allowed any more :( - which did for older versions.Yes, I would recommend to any one who has TV or big screens and works fine with low internet packages. :)- but doesn't do the tab casting :(-", "verified": true, "helpfulness": "1/1", "author": "AmazonUser"}, {"rating": 5.0, "review": "More apps needed but still, great device.Fast and easy to carry everywhere.It needs energy in old hdmi devices, this is provided by Google with a usb charging cable.", "verified": true, "helpfulness": "0/0", "author": "Xabier"}, {"rating": 5.0, "review": "Works very well for sending podcasts and Netflix to the television. Would be nice to have more app support, but that's not the unit's fault.", "verified": true, "helpfulness": "0/0", "author": "William Pope"}]