[{"rating": 5.0, "review": "I am quite satisfied with my Amazon Fire TV.  I was up and running in a few minutes.  The voice control has worked perfectly and successfully completed every search so far.  Wanna buy a used Roku?", "verified": true, "helpfulness": "3/4", "author": "Joseph Bentley"}, {"rating": 5.0, "review": "I was skeptical when I opened the box.  Small, I say smaller than I expected, but wow, was I surprised !  This thing packsa heavy weight punch bigger than I expected.  Installation was a breeze.  Picture quality and sound is stunning to say theleast.  The voice command is heaven sent, no  more typing titles for the shows you want to see.  Just press the voice commandsay the show, movie or actor and presto!  You got a list right in front of your eyes to choose from.  The box is so small but yetelegant.  I was truly amazed.  I'm hook on Fire TV for many years to come.", "verified": true, "helpfulness": "6/7", "author": "Alfonso Armesto Jr. \"AL\""}, {"rating": 2.0, "review": "I was quite eager to be this device.  When it arrived, less then 12 hours after ordering it, I was amazed at how quick and easy it was to get up and running.I have Apple TV and Roku.  Apple TV because I unknowingly bought into there closed ecosystem, (and Amazon Prime doesn't work internationally) and Roku because it has everything else.  HBO, TIme Warner, Optimum. PBS, none of which are on the Fire TV.The voice search, which is far superior to SIRI, only searches Amazon.  Roku's search searches everything. Well worth having to type.If you don't have a Roku box, don't want HBO, do not care about choice of video providers, and like limited search, this is the device for you.  If this were a few years ago and you could wait for so additional functionality, then this would be a great box.But it is 2014. You should get a platform that supports multiple providers.  For those that might say, Amazon will be rolling out other platforms shortly, you may be correct.  But look at how long it has taken them to make Amazon Instant Video available on Android.  Oh right - it STILL is not supported.Bottom line.  Fast install, fast box, limited channel selection, no track record of delivery.  Roku was beating the Fire TV 2 years ago.", "verified": true, "helpfulness": "8/12", "author": "Jim Kelly"}, {"rating": 5.0, "review": "Simple review: Prime video works extremely fast, Netflix, Hulu, Vevo, Pandora, TuneIn Radio, YouTube. For myself these are the great things about This box. Easy to set up and scroll through your choices.Doesn't have HBO but that's okay with me. The only thing I don't see is how to play music that you've already payed for through Amazon.", "verified": true, "helpfulness": "4/5", "author": "J_A"}, {"rating": 1.0, "review": "The main feature, voice search, doesn't work.  It will flawlessly figure out what I said, but will only search for amazon shows or movies.  Even if you are in the Netflix app and the show is right there, voice search will take you out of the app and show you Torchwood for purchase on amazon, when it is free on Netflix.  Greed killed a great concept", "verified": true, "helpfulness": "57/90", "author": "Vincent A. Pagano"}, {"rating": 1.0, "review": "I have a Chromecast & Roku 3, and wanted to see how this compares with them in terms of streaming content. After using the FireTV for a couple days, I am disappointed that all of the neat features funnel you only to Amazon's own video content. Voice search only works for Amazon content and I found this to be extremely disappointing. I have a Netflix account, searched for \"Scandal\" and it works great except is prompts you to purchase individual episodes. I currently have Netflix and \"Scandal\" is available for FREE! (after my monthly subscription).I don't want a box that pushes me to purchase Amazon content when I can stream it for free on Netflix. I'm sticking with my Roku 3 which searches content across multiple services (Netflix, Amazon, Hulu, Vudu, etc.) and shows results from all services (and notes which ones can stream for free based on your subscriptions). If you are looking for a streaming player that doesn't direct you to Amazon, I would look at the Roku 3. Have been using my Roku 3 for months now and love it!", "verified": false, "helpfulness": "104/140", "author": "CasaBonita"}, {"rating": 2.0, "review": "Guess what. The hardware is released before the app which would let you listen to your cloud content readily available on any smartphone. BIG mistake. Further, try signing up for iHeart radio. Site is unresponsive. As are others you'll need  Sounds like this product was rushed to market not ready for PRIME time. When I called, no one could give me a date when the cloud player app would be available. Soooo. It's better than Chromecast but needs work.", "verified": true, "helpfulness": "5/8", "author": "Jerry H"}, {"rating": 3.0, "review": "I only had this a few hours but it was diffiicuct to set up. Down loaded new software right away, which was strange, since it just came out two days ago. After connecting to the internet to down load the new software it could no longer connect. Finally resolved this. but, the video was jerky. The voice command only works with Amazon videos, not Netflix. Over all if you have a roku or Blu-ray with these features, I would save your money. This device brings nothing to the table.", "verified": true, "helpfulness": "5/8", "author": "Jperry \"jimp\""}, {"rating": 5.0, "review": "My Fire TV showed up today, delivered by FedEx well within the two day window. Very fast service! I had wondered if I made a good choice after reading many of the reviews here. Many of these reviews seem to be from people who don't actually own the product. I think most people who understand what the product is intended to do, will be very satisfied with it. For now, voice search only works with Amazon services, but it works beautifully. I expect it will work with more in the future. Video playback for Amazon content is blazing fast, nearly instantaneous. Netflix playback is about what one would expect from other devices. After reading complaints about the \"cheap\" feeling remote, I expected poor build quality. No worries, it's just fine. Remote design is great . I looked forward to trying gaming on Fire TV, and had my doubts. It turns out to be a pretty neat game device too! Expect snappy performance, and tight integration of Amazon services, and you'll be glad you got one.", "verified": true, "helpfulness": "5/6", "author": "LobsterTrouble"}, {"rating": 1.0, "review": "As a very dedicated, loyal Amazon Prime shopper and Instant Video viewer, I was very much looking forward to streaming with the new Fire TV that I had ordered from Amazon on the first day it was offered for sale.  Normally I wait until a new product has a proven success rate before I order it but in this case I was sure this product was for me.Since I generally only stream Prime movies and TV shows, I was impressed by the potential for four times faster buffering, voice search and the many other features highlighted on the product page and in news articles.  I thought that this device would suit me better than the ROKU XD because it would be totally dedicated to the Amazon Video offerings I enjoy so much and I would not have to wait as long for the video to load.  It was also advertised as \"plug and play.\"The unit arrived around noon yesterday via UPS Prime shipping.  After connecting the device to the TV, I put the batteries in the remote and turned everything on.  The colorful Amazon splash welcome screen appeared and then a notice that the device was searching for the remote and could not find it.  I followed the instructions to push the remote's home button for a number of seconds but the Fire TV still could not find it.  I checked the batteries, then pushed all the buttons, placed the remote near the device and still no recognition.  Finally, I just shut everything down, restarted the Fire TV  and the remote was finally recognized.  I stupidly thought everything would now work okay, but boy, was I wrong!After restarting, the Amazon splash screen again appeared and I was then asked to choose my wifi network and sign in.  The device connected immediately and began to slowly load an update.  After a very long time, probably twenty minutes or so, a notice on the screen stated that the installation process would now begin.  After the installation progress bar moved to the end (update finished), the screen went completely white and froze.  After waiting five minutes I then disconnected the unit's AC adapter, waited a minute and then reconnected it.  During the restart, the Fire showed the splash screen and I was again asked to sign in to my wifi network.  The Fire stated it was checking for updates but did not find any. Eventually another frozen white screen appeared.  I continued to restart the device numerous times with the same general result as before, only sometimes the screen would freeze up black instead of white.  Eventually during these restarts, the Fire would automatically connect to my wifi network but the screen would still freeze afterwards to black or white.  Even though my device arrived preregistered, I never saw a home page or the introduction video that was supposed to be displayed during the set up process.  So much for \"PLUG & PLAY.\"All during this long disappointing and stressful restarting time period I was using my iPad Air to check the Amazon Fire TV support page for help, but the information posted, including the trouble shooting guide was useless in this situation.The Fire TV product page reviews gave me much more information.  I discovered that a very large number of other verified buyers were also experiencing the same or similar problems.  Even a goodly number of the working models seem to be experiencing some problems that should not be.  According to a number of buyers, Amazon customer telephone support was also very lacking in knowledge of the product.  Based upon the reviews and comments, there probably is a fifty percent chance that a buyer will receive a dud instead of the promised perfect video streamer.All of this leads me to believe that the device was evidently not field tested properly before its premature release.  We buyers were expected to do the testing.As a result of all of this I decided to return the Fire TV for a full refund instead of requesting a replacement.  The odds of getting another dud and wasting more of my time are too high.  I will continue to use my trusty and easy to set up and use ROKU XD to enjoy my Prime Video.", "verified": true, "helpfulness": "92/118", "author": "Joseph"}]