[{"rating": 3.0, "review": "Awesome product if you use with youtube, netflix kind of apps. However its nt compatible with chrome browser on apple or android devices.", "verified": true, "helpfulness": "0/0", "author": "Sonal"}, {"rating": 5.0, "review": "Really good product makes it much easier to view movies n all", "verified": true, "helpfulness": "0/0", "author": "Deepak Mathur"}, {"rating": 5.0, "review": "PERFECT", "verified": true, "helpfulness": "0/0", "author": "Teela T."}, {"rating": 5.0, "review": "This little gadget is AWESOME. I bought it for a TVs on a video wall at work, now I've got to get one for home too.", "verified": true, "helpfulness": "0/0", "author": "Office Manager"}, {"rating": 3.0, "review": "Worked ok except when we were trying to stream television shows from Hulu Plus.", "verified": true, "helpfulness": "1/2", "author": "Ann Bowman"}, {"rating": 5.0, "review": "Nice tool to cast your screen.", "verified": true, "helpfulness": "0/0", "author": "ibrahim nasser"}, {"rating": 1.0, "review": "It's advertised as plug in and your ready to go... I haven't had much success getting it to work. I'll keep working with it, but it is not user friendly.", "verified": true, "helpfulness": "0/1", "author": "Harry Meampel"}, {"rating": 4.0, "review": "It does everything it's supposed to do.. But I expect a little bit more from a device like this.I have 40mps internet connection (the router is 3m away from the Chromecast) and still have YouTube buffering issues especially when casting from multiple devices. There is an annoying delay when casting from a PC or Mac.I kind of feel that it's a non-complete product under development being sold as is.", "verified": true, "helpfulness": "0/1", "author": "Khaleal Yasin"}, {"rating": 5.0, "review": "Google chromcast is a great product,easiest plug and play ever.It's interface is very friendly and it can make any TV with HDMI conection to a very smart one. It took me not more than 10 minutes after I opend the box (nice one)  to plug the dongle, download the software and started watching evrything thats on the web.Some friends come to visit me, we turned on the youtube channel and I didn't need to got up of my sofa once to chnge song or channel, I did it all from my IPAD.The dongle can communicate with severel computeres (2 PC, IPHONE and an IPAD).For a summary its a very good buy.", "verified": true, "helpfulness": "1/1", "author": "amihai"}, {"rating": 5.0, "review": "Good solution for streaming. I am not writing a long review because a lot has been already written here on Amazon.It works well. Only advice: be sure you have a very high speed internet connection", "verified": true, "helpfulness": "0/0", "author": "Francesco"}]