[{"rating": 5.0, "review": "The only issue I have is that I wish there were more apps that utilize the chromecast function. Other than that I love it.", "verified": true, "helpfulness": "0/0", "author": "Tim²"}, {"rating": 1.0, "review": "so i got my chromecast dongle, plugged it in, downloaded the app to my laptop, easy! i watched some youtube videos.but then when i wanted to go back to cable-- my television no longer worked. nothing happened when i pressed menu on my cable box, nothing happened when i pressed the input button on my remote to change back to cable. basically, now i have no television service, no cable service; nothing works anymore. my screen simply says no signal.plugging in this item messed up everything!!!i called google support and was told to call my cable company. of course, this had to happen on a saturday-- i'm not going to have any television until next week when the cable company comes to fix this. and i doubt google will pay for that service call.everything worked fine until i plugged the [expletive] dongle in. and now it doesn't.i'm returning this product.", "verified": true, "helpfulness": "0/1", "author": "Neutron88"}, {"rating": 4.0, "review": "it is easy & very usefull for non-smart tv to be a smart tv. more over the price is very nice comparing to smart TV prices.", "verified": true, "helpfulness": "0/1", "author": "Hani Fadul"}, {"rating": 1.0, "review": "i normally like google stuff and even though it's not expensive it's not worth the money it won't connect - sending it back", "verified": true, "helpfulness": "0/1", "author": "IAN L CRITCHLEY"}, {"rating": 1.0, "review": "Constantly dealing with technical issues just to get the device to function properly. The \"yellow exclamation mark\" indicating product issues frequents our screen. We see this just as often as see video. Seems like the product needed more engineering work to get the bugs out before hitting the market.", "verified": true, "helpfulness": "0/0", "author": "Dan Payne"}, {"rating": 2.0, "review": "Might be good if you only want to use the four apps that support it. I bought it to watch PAC 12 network on my tv and was disappointed! Bought Apple TV and was completely satisfied.", "verified": true, "helpfulness": "1/1", "author": "damon e johnson"}, {"rating": 4.0, "review": "only reason I didnt give a 5star is because the whole net works as well as youtube then it gets a 5", "verified": true, "helpfulness": "0/0", "author": "patrick cochran"}, {"rating": 1.0, "review": "I had to return this product. It is  not always compatible with all router. Check that out before you decide.", "verified": true, "helpfulness": "0/0", "author": "Sorento93"}, {"rating": 2.0, "review": "My main intention when I bought this Chromecast was to broadcast sporting events from my iPad or Chrome Browser on my laptop to my television.  I cannot do either.  The amount of apps that Chromecast supports is quite limited.  It does not include MLB AtBat, NFL GamePass, or any sports steaming app for that matter.  Unless your an HBO subscriber or you like watching YouTube videos all day, its tablet streaming features are weak.If you are streaming from the Chrome browser, you can only stream from within one tab.  This does cover most things, except sports.  Any link that opens up a new window (often the websites 'media player'), Chromecast is unable to broadcast.  Frustrating.The technology is very cool, but it has a LONG way to go before it rivals the features/capabilities of devices like AppleTV and game consoles.", "verified": true, "helpfulness": "0/0", "author": "Kyle Surlow"}, {"rating": 5.0, "review": "I initially held off on buying a chromecast because I didn't understand how it worked and was worried that it would drain my devices' batteries fast. After testing out a friend's chromecast I found that my fears were unfounded and it wasn't an issue.I've had the chromecast for a couple weeks now and have loved it. It handles streaming hd without any troubles and I haven't had any troubles with its wifi. So far I've mostly used it for netflix and plex but have noticed a number of other apps on my device which also support it. (Google music, youtube, vudu, hulu, pocket casts, etc...)", "verified": true, "helpfulness": "0/0", "author": "Andrew West"}]