[{"rating": 1.0, "review": "Very few situations where this can be used. Sent it back as the Apple TV and Roku are better investments and better thought out.", "verified": true, "helpfulness": "1/3", "author": "GS Amazon \"smart_shopper\""}, {"rating": 4.0, "review": "Well thought out, reliable little device. I'm still waiting for more compatible apps to be launched to make it worth 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Chaffwick"}, {"rating": 1.0, "review": "There were a number of problems with this item.  First you have to download the software and unfortunately you have to download google chrome to install the software.  I followed the instructions and when I did everything I was told the damn thing would not work.  I had it hooked up to my wifi, it could not find a connection even though my internet connection was fine.  I worked on it for almost two hours and finally said to hell with it.  I have some experience with computers and this was very frustrating.  This was my first google item purchase and it will be my last google purchase.  I immediately returned the item to where I purchased it.  I also have a problem with google requiring to download their browser and I believe requesting too much information.  I will now avoid them like the plague.", "verified": false, "helpfulness": "1/3", "author": "R. M. LaBarre"}, {"rating": 5.0, "review": "Our family LOVES Chromecast!It is easy to supervise what the kids watch and with streaming from YoutTube,Netflix and Pandora,we can access so many different entertainment options!", "verified": true, "helpfulness": "0/0", "author": "D. Metzger"}, {"rating": 4.0, "review": "I like it, however, its more of a \"look what I can do\" rather than, \"must have\" Using this with my Nexus7 (2012) and HTC One S. The HTC One S responds better to sharing than the Nexus does. Go figure. When using netflix, I must wait a long time before the sharing icon is displayed. The HTC One S shows up right away.The wifi is less than stellar on the Chromecast; if you are using it in an area where wifi is low (weak signal), I would probably say good luck as it is hit or miss. Other than than the set up per use time, it is pretty cool.", "verified": true, "helpfulness": "0/0", "author": "William Ingram"}, {"rating": 5.0, "review": "I LOVE THIS DEVICE!!! I purchased this first on here, but since it took so long, I eventually found one at a local Best Buy and bought one locally for one TV, and fell in love with it! So easy to use, almost a direct plug-n-play device. Just minimal setting up and you're ready to stream YouTube, Google Music, Google Movies, Hulu, and Netflix. There was an app where I could even play any movies from my device to the TV, but now that app's gone =( Hopefully they'll restore that", "verified": true, "helpfulness": "0/0", "author": "S. Misa"}, {"rating": 5.0, "review": "Awesome product.  I can't believe I waited so long. I wish I did this a long time ago.FYIThis product will work on your with your home wifi network (router) so have a good speed. It will tax your system if you have a slow speed.  You might see disconnections or lags.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 4.0, "review": "This is a very handy device for those who need to stream to non smart TV's.It also finally brings Hulu and Hulu Plus compatibility to the Google family although at this time the chrome cast app is still not compatible with Google TV.Hopefully they will continue to develop apps for it and it will be come even more useful instead of being more of a niche item.In my opinion that's what will make or break the success of this device.Still, for 35 bucks it's both a good workaround for the Hulu/Google TV issue and for older non smart TV's with HDMI inputs.", "verified": true, "helpfulness": "0/0", "author": "James R Henry"}, {"rating": 3.0, "review": "I thought this would be more versatile than what it is.  You can watch movies through your computer wirelessly but you have to do it through chrome.", "verified": true, "helpfulness": "0/1", "author": "Michael Turner"}, {"rating": 4.0, "review": "With some minor glitch sometimes, this little device is perfect for playing movie through youtube or Netflix. Cannot be wrong with this affordable price.", "verified": true, "helpfulness": "0/0", "author": "mark M"}]