[{"rating": 5.0, "review": "Very easy to set up, and has made my cable-less life so much easier. I am able to stream from my phone, but also, and more importantly, from my PC. Very good quality picture, and very rarely any lag.", "verified": true, "helpfulness": "0/0", "author": "Michael Miller"}, {"rating": 5.0, "review": "Awesome. Easy to connect and transfer from TV to TV if wanted.", "verified": true, "helpfulness": "0/0", "author": "Zacary Mountz"}, {"rating": 5.0, "review": "Somethings are very nice and others and just nice.", "verified": true, "helpfulness": "0/0", "author": "Dray"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "ibrahim sankour"}, {"rating": 4.0, "review": "A handy device for streaming Netflix and other media...", "verified": true, "helpfulness": "0/0", "author": "Linda Travis"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "LARRY"}, {"rating": 3.0, "review": "I wish everything was in 1080 p but other than that it is a cool little gadget .", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "I love the Chromecast. I use it every single day and I have no complaints!Pros:Stream single tabs and fullscreen videos using chrome on any desktop.Stream videos out of chrome app on Android and iPhone.Stream Google Music, Netflix, YouTube, and dozens of other apps from your phone.I really like just having it turned on to see the interesting pictures. It makes for a very nice background on my when I am not using it.It will continue to stream music/videos if your phone turns off or dies! This is really convenient when I want to watch a video, but my phone is about to die. I do not have to worry about it!If plugged into the wall, chromecast icon will always be there and you can turn on certain TV's by just connecting to it.IT MAKES A FREAKING GREAT GIFT! I bought 4 of these, 3 to give away to friends because it is so affordable and such a great product!There are so many other pros about it!Cons:I noticed that if I plugged the power source of the Chromecast into the TV itself, whenever I streamed tabs from my desktop there was a severe lag to a point where it was not working at all. After plugging it into the wall, there was absolutely no lag at all! I think it is just that my tv usb output is very low in amperage, so it just was not getting enough power. Most TVs should be fine, but if you have this problem, try plugging it into the wall with the provided usb power brick they give you.", "verified": true, "helpfulness": "0/0", "author": "Jeff B"}, {"rating": 1.0, "review": "Had this working in my living room. Decided to move it to the TV in my bedroom. The thing became very intermittent. Couldn't connect to the network. And even when connected, none of my smart phones and tablets could see it. Spent a couple of hours doing factory reset and went through the setup process multiple times. Finally gave up and took it back to the living room. Guess what? It worked again. What does that mean? Well, my bedroom is somewhat further away from the WiFi router. My labtop, my PC and all my smartphones and tablets have no problem in my bed room, but not this stupid thing. Apparently it has a very limited WiFi range. Maybe those morons at Google will start selling external antennae?", "verified": false, "helpfulness": "1/1", "author": "Ming"}, {"rating": 5.0, "review": "Get it fast and work amazing", "verified": true, "helpfulness": "0/0", "author": "osher"}]