[{"rating": 4.0, "review": "Easy to set up. Supports a wide range of apps. Streaming music through it from my phone as I type this.", "verified": true, "helpfulness": "0/0", "author": "O Miller"}, {"rating": 5.0, "review": "Love it!! Perfect solution to my entertainment needs. Chromecast + Plex, the only way to go.", "verified": true, "helpfulness": "0/0", "author": "Shawn Lynch"}, {"rating": 3.0, "review": "I am a bit disappointed with the design of the ChromeCast.  The mini-usb port is on the very rear of the device, extending the 'length' of the device.  This made it susceptible to bending or breaking of the usb port when a TV's HDMI port is designed to accept a device plugged in perpendicular to the back plane.  So when I pushed the TV back to the wall, I inadvertantly pushed the usb into the wall and bent and broke the power usb.  Fortunately, I have another mini usb so I can still use the device.Functionally, I think it's pretty slick.  Its good for what it does.  I would like to see a more seamless integration with more apps/games and the major platform os programs.", "verified": true, "helpfulness": "0/0", "author": "John Concha"}, {"rating": 4.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Mona Alamri"}, {"rating": 4.0, "review": "It's a good stick for streaming most of your PC, smart phone or tablet material. Unfortunately it doesn't appear to stream Amazon Prime movies. So, for the price it's ok, great to watch YouTube vids. Will have to investigate other streaming products.", "verified": true, "helpfulness": "0/0", "author": "AlexnAlexandria"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": false, "helpfulness": "0/0", "author": "Jay"}, {"rating": 4.0, "review": "I love this thing. I use it to play videos from my phone, laptop and computer. Easy to hook up, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jack of all Trades, Master of None"}, {"rating": 1.0, "review": "Bought this about a week ago. It says it is compatible with iPad but 99% of the time it does not let me steam from my iPad or iphone. Very disappointed. I have apple TV and  wanted to try some not so $$ but now I know it's worth the $$. I can say though my husband had no problem connecting with his Galaxy tablet....which annoys me....I only have apple products and this says it will work with iPads BUT DOES NOT WORK WITH APPLE PRODUCTS!!!!!", "verified": true, "helpfulness": "0/0", "author": "Sarah Gonzalez"}, {"rating": 5.0, "review": "The best streaming dongle $35 can buy. I only wish it had 5GHz compatibility.", "verified": true, "helpfulness": "2/2", "author": "Jason F."}, {"rating": 5.0, "review": "I love this thing! Basically you can use your TV as a monitor for your computer, tablet, or smart phone. Great for watching movies, giving presentations, looking at pictures, and music.", "verified": true, "helpfulness": "0/0", "author": "Dominique D. Daniell"}]