[{"rating": 4.0, "review": "It works very good so for no complaints", "verified": true, "helpfulness": "0/0", "author": "john gibson"}, {"rating": 1.0, "review": "I purchased this with the Sling promotion and that company has turned out to be nothing but crooks!  Be careful when ordering with that promotion!!", "verified": true, "helpfulness": "3/9", "author": "Vidal Montano \"Burbank\""}, {"rating": 4.0, "review": "Good.", "verified": true, "helpfulness": "0/0", "author": "anthony ferguson"}, {"rating": 5.0, "review": "Fantastic product easily could be Sideloaded with applications", "verified": true, "helpfulness": "0/0", "author": "Sanjay"}, {"rating": 3.0, "review": "Generally good quality.  Provides the same stuff as the others -- e.g. Roku, Boxee -- but really focuses and forces you to buy Amazon content.", "verified": true, "helpfulness": "0/0", "author": "Dave the Rave"}, {"rating": 5.0, "review": "Love it.  Easy to install and use.  Great!", "verified": true, "helpfulness": "0/0", "author": "Sue Miller"}, {"rating": 5.0, "review": "nice", "verified": false, "helpfulness": "0/0", "author": "Matasaru Bogdan"}, {"rating": 5.0, "review": "I love it, easy to install and the content is great. I have 3 Tivos and Netflix always seemed clunky but after using it with the Fire I realize the problem was with TiVo not Netflix. I intend to purchase another Fire.", "verified": true, "helpfulness": "1/1", "author": "Kathleen Casey"}, {"rating": 4.0, "review": "I am pleased with the purchase of Fire TV. It was extremely easy to set up and is simple to use. I only wish it offered more shows. Between Amazon Fire, Netflix and Sling there are plenty of things to watch. I had my satellite turned off and don't miss it at all.", "verified": true, "helpfulness": "0/0", "author": "Darrell Alldredge"}, {"rating": 5.0, "review": "I had problems with my Fire TV out of the box.  I contacted Tech Support and got an immediate phone call. Within 15 minutes they walked me through the solution.  This level of service is on par with Apple Care support.  I'm delighted with the performance, price and support!", "verified": true, "helpfulness": "0/0", "author": "Chester J Flynn"}]