[{"rating": 5.0, "review": "better than apple tv", "verified": true, "helpfulness": "0/0", "author": "wendy"}, {"rating": 5.0, "review": "Great product wish there was some room for expansion and I did not like that my amazon was forced to update immediately after it was plugged in", "verified": true, "helpfulness": "0/0", "author": "J D"}, {"rating": 5.0, "review": "The voice search works great.  The Fire TV box is tiny and does a great job.  No issues so far.  Just wish my Prime membership included more content.", "verified": true, "helpfulness": "0/0", "author": "Richard Crawford"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "David Gariepy"}, {"rating": 5.0, "review": "Love it! It is so easy to use and easy to find what you are looking for. What a great product. Fun and easy!", "verified": true, "helpfulness": "0/0", "author": "Lee Dziuk"}, {"rating": 5.0, "review": "LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Brandi Livingston"}, {"rating": 3.0, "review": "Works well so far. I have hsd this about three weeks so far. The picture is real nice. It stays connected with my lame intrrnet better than the Wii. Love the remote control viuce option. Just wish it had more ap options, especially the CW ap. That is the only reason I gave it only four stars.Updating...the box is slow sometimes. The video will often go out of sync. The device is only six months old.", "verified": true, "helpfulness": "0/0", "author": "Ryan L. Cornwell"}, {"rating": 2.0, "review": "For the most part it's great. However, I have two big complaints. The big intro video that you can't get out of being the first thing. But it's only once so no big deal.The part that actually deserves the two star rating, is that this thing CONSTANTLY loses my Netflix login info. It's really inconvenient to always type it in. I have a Roku 3 as well and recommend it over this.", "verified": true, "helpfulness": "0/1", "author": "nmpatel"}, {"rating": 4.0, "review": "I love this little box.  I only wish it had 2 extra things that Roku does (I own a Roku also). I wish it had the headphone jack in the remote and had the App for VUDU.  All of my Ultra-Violet content is viewed  via VUDU.  This unit has everything else though.  I'm actually listening to the  music that I purchased through Amazon right now.  I just found that feature. I bought this the first week it was released.  Amazon, why won't you put VUDU on here?", "verified": true, "helpfulness": "0/0", "author": "J. Guilfoyle \"Army Strong\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "avid amazon shopper"}]