[{"rating": 1.0, "review": "Do not buy this product if you have older projectors.  The resolution is not flexible. The optical does not work very well with older receivers.  If you have older gear you would be better off with a cheap PC.", "verified": true, "helpfulness": "6/12", "author": "Justin"}, {"rating": 5.0, "review": "This thing is great. I can take this when I travel it is so compact. Easy to set up and almost runs by itself.", "verified": true, "helpfulness": "1/2", "author": "Ken Price \"Kenny Price\""}, {"rating": 4.0, "review": "Well, this was a pleasant surprise. I've read some negative reviews of it in comparison to Roku, but decided to get it anyway to watch Amazon Prime offerings.  Some thoughts:- For its main function, access to Amazon Prime, it's neatly perfect. The box operates lighting fast, there is no delay, or queuing when starting to play a video. I can go from power on (from standby) to watching a video in less than 5 seconds - which is impressive.- Remote is excellent for what it does, comfortable and small in hand. The problem is, as it is not backlit, its hard to distinguish the buttons in the dark - I wish they had different shapes or some other cues. After a while it gets easy to adjust to buttons by feel, when using Nav ring as reference.- Voice search is excellent.- I like the box design, tiny and flat, and blends into the background next to equally colored tv.- The power light - that damn thing is so bright at night, I had to cover it up with electrical tape. At the very least the box needs an 'off' switch to turn off that annoyance when i'm done watching. The light does shut off eventually when box goes into standby, but it takes a long time.- Queuing next episode of a show is great too ...- FF/REW are ackward - but a 10sec skip is very handy.- Playback is great with no stutter (5.7mb/s DSL, Wi-Fi)- There does not seem to be a way to restrict searches to Prime only.- I haven't used other media apps, so I can't comment on them.", "verified": true, "helpfulness": "4/6", "author": "SecondClaw"}, {"rating": 5.0, "review": "I love this box! Had an apple and I find this amazon box works faster and has a clearer picture and is faster. I recommend this.", "verified": true, "helpfulness": "1/2", "author": "Bermyguy"}, {"rating": 5.0, "review": "Really like this product.  Had prime membership  about 9 months.  Only had fire tv about a month .  Still learning about device.  Easy to hook up and works great.  Would recommend if you watch much tv.", "verified": true, "helpfulness": "0/1", "author": "bjhnanny"}, {"rating": 4.0, "review": "Its real cool but didnt sync my tablet apps on to the fire tv maybe they aren't set up to handle apps like face book. There is no music option as far as I can tell. But the add claims it is there.  Will need to call shd ask", "verified": true, "helpfulness": "0/1", "author": "michelle"}, {"rating": 5.0, "review": "I love my amazon fire tv it's work very good by Angel M Rodriguez 08-31-2014 nuni", "verified": true, "helpfulness": "0/1", "author": "angel m rodriguez"}, {"rating": 5.0, "review": "Fast", "verified": true, "helpfulness": "0/1", "author": "amazonholic"}, {"rating": 5.0, "review": "Can't get anything done due to binge-watching !  Luv it!  Bought one for my son 's family.  Easy to hook up. Lots of TV series and movies free with Prime.  Only had it five days and find myself turning it on first thing in the morning  and staying up late.  Would make a nice gift for someone who likes to watch TV.  So far it works great and haven't had any problems.", "verified": true, "helpfulness": "0/1", "author": "Jackie S Moyers"}, {"rating": 5.0, "review": "It doesn't get any easier to use! I am so happy with it I am just speechless !!!!", "verified": true, "helpfulness": "0/1", "author": "Greso"}]