[{"rating": 3.0, "review": "I have an Apple TV but tried the Fire thinking I could both stream Netflix (all I did on my ATV) and utilize the video portion of my Prime membership.  I sent back the Fire since I couldn't get Dolby Plus to work with my system resulting in stereo instead of surround sound.  This was a deal breaker. When I plug the same HDMI cable into my Apple TV, I get excellent surround sound.  So the Dolby Plus killed it for the Fire.If anyone cares, I plug HDMI cables from my Panasonic SA-BT300 blu-ray player/home theater, my Charter cable box, and my Apple TV into my Panasonic TC-P42UI TV and optical sound out from the TV to my home theater.  The BT300 is clearly rated for Dolby Plus, don't know about the TV.  Anyway, the Apple TV produced surround sound and when I plugged my Fire into the HDMI cable that previously was the ATV and turned on Dolby Plus on the Fire, I got no sound.  I did get stereo when I turned off Dolby Plus.The Netflix app was clunkier on the Fire and produced large subtitles.  The Netflix app on my Apple TV was much easier to navigate and subtitles were more nuanced. Also the video colors were not as realistic on the Fire as on my Apple TV.The Fire was not voice searchable for Netflix titles.  So it was hunt and peck on the Fire whereas on the Apple TV I could type in search titles for Netflix from the iPad Remote app.Physically the Fire looked attractive and the Fire remote worked well.  Probably many of the problems will be fixed in a year or two.Edit -- I went back and realized my SA-BT300 home theater has two optical inputs so I could have run an optical out from the Fire into the second optical in for the BT-300 Home Theater, enabled Dolby Plus over optical and it might have worked.  Already packed up the unit to go back so won't try and the other factors also weighed for sending it back, but for the record the optical out straight to the home theater possibly could have worked.", "verified": true, "helpfulness": "2/8", "author": "Ralph H. Daily"}, {"rating": 1.0, "review": "Just took it out of the box. Needs to do software update. Software update unsuccessful.  I tried three more times. Same thing. I got my return label and UPS will take it back to Amazon.I really wanted to try it out but could not get past the software update issue.", "verified": true, "helpfulness": "12/30", "author": "old geek"}, {"rating": 5.0, "review": "This is a great product that needs some tweaks.  I've streamed with several Sony Blu ray players (5100 currently), a Panasonic Bly ray, a WD Live, and a Roku 3 --- only the 5100 Sony is a realistic alternative.  I, like many others, had problems with the Roku 3 and returned it.Many of the current 1-star reviews for the Fire TV are because of some specific desired feature that was not included, like HBOGo, DLNA (but the Plex app is better), or voice search in Netflix and other vendors' apps (up to them to include in their apps) -- so I'm going to start with the problems I saw.One issue that does need improvement is letting the customer know that the initial setup process will take several minutes and involve three restarts.  THAT'S OK as long as the customer is informed via on-screen prompts along the way what to expect and shown where the process is at each step.  Whoever came up with the dorky animated video instead of simple, informative text screens should not be doing instructions for consumer productsAt one point during setup I was prompted to unplug the unit and then plug it back in.  That's not OK.  Although the Fire is essentially the guts of a modern tablet, it is NOT a portable device -- it is designed to be installed with your other fixed equipment -- in my case in a hard to access equipment rack.  Once you have the unit physically installed you should never have to access connecting cabling again.  Whatever it takes Amazon -- a very small pushbutton switch on the back of the unit is probably the least expensive option if you HAVE to have a hard power off as part of the setup process.If a hard power off involving the customer accessing the physical unit IS necessary, the customer needs to be informed, this time via a sticker on the product:  \"Initially place unit where you can either the back of the unit or the power brick -- You will have to unplug/replug the unit during setup.\"  Or just access to the back of the unit if it had a small power switch.As soon as I had completed the initial setup I installed the Netflix app and tried playing a Netflix movie -- \"Oh no\" I thought -- the picture was in standard def, lots of jagged edges whenever something moved, and the sound was not very good.Turning the unit off and then on again (without a power switch you have to wait until autooff) solved the problem -- picture and sound were then good.  Like many modern tech devices, a restart cycle often solves problems -- again, an on/off switch is needed.My sound improved when I switched to Dolby Digital Plus -- but I was never prompted for that option and had to stumble across it as I browsed through \"Settings\".  I also stumbled across the ability to scale the output to my screen -- in my case a 3% downsize -- which does not seem to affect video performance adversely -- in other words a good scaler, as good as the one in my TV.So the main improvement that this unit needs, in addition to the removal of a hard power off as part of the setup process if possible, is the replacement of the little intro video with a prompted setup process -- just text screens, it shouldn't bee too hard to implement.  If guided prompts going through the various Setup options is too difficult to implement, the customer should at least be prompted to visit the Setup 'page' and go through the options.One other complaint some others have downgraded this unit for -- lack of DLNA, the ability to stream content from your hard drive.  It took me a few minutes to set up the Plex app on the Fire TV, a few minutes to set it up on my Windows 8.1 desktop, and several minutes of waiting while my media files were set up for access by Plex.  Then steaming music and videos from my hard drive to my TV was just as good as using the Sony 5100.  So DLNA functionality is there as far as I can see.So, issues aside, how does it work?GREAT!  Video and sound as good as the Sony 5100 (equal to the best I've seen).  Lots of 'channels'/'apps' including free streaming radio with many stations, YouTube, Netflix, Hulu -- too many to list.  There is an award-winning foreign films app that has some really good movies (with commercial interruptions) and a similar Classic TV app -- not too much classic TV in it but what's in there is good.  And of course great access to Amazon Instant Video, the unit comes linked to your Amazon account.Good job, Amazon!UPDATES 4/7/14:1.  I keep reading complaints, some justifying a 1-rating and a return of the unit(!) that not all content on every channel is merged into a voice searchable database.The Fire TV is essentially the guts of as Asus/Nexus/AmazonHDX table, with the button controls set up on a Bluetooth link as a remote, and the firmware optimized for streaming entertainment content.  It is a brilliant idea -- keep in mind that it IS, at heart, an Android tablet.  So if the Android app for your favorite 'channel' has voice search built in, you can expect Amazon to support it in firmware release.  I'm amazed Amazon supported voice search on anything (Vevo) other than Amazon's own 'app' on initial firmware release, until any bugs are found and fixed.  Expect more and more support for and optimization of speech recognition in the Android world in general.2.  Folks keep saying this does not have DLNA or Plex to stream media from your hard drive -- IT DOES HAVE PLEX -- look under APPS, then Categories, then Entertainment.3.  Something is causing occasional very brief pauses in video streaming.  On my system I've tried both a wireless and an Ethernet connection, and the pauses are brief, a little longer than a DVD layer change, maybe 1/2 second, once an hour or so.  Others have reported longer 'buffering' pauses that seem to be related to the load on their networks (reducing # of connected devices reduces pauses).  Although the number of folks reporting this is relatively few, it is a definite issue for Amazon to deal with.  Certainly in my case I've done high def streaming through Sony, Panasonic, WD, and Roku equipment and never seen this issue.UPDATE 4/20/14:  I upgraded my router from a Netgear wnr2000v4 to a wndr4300 and the pauses disappeared.4.  Anyone thinking about ordering the game controller should first download the free Zen pinball game and try playing the free table.  The Bluetooth delay using the Amazon remote makes accurate flipper control impossible.  If you are considering playing action games on the Fire, I'd wait to order the controller until more folks have had a chance to review it.Even with all the above issues this is still the streamer of choice IMO and still a 5-star product.", "verified": true, "helpfulness": "6/6", "author": "G. GUNNELL"}, {"rating": 5.0, "review": "UPDATE TO MY REVIEW:If I'm able to help you please mark my review accordingly ;)What is the best smart tv add-on for you? The answer is not that difficult to come to actually...It all depends on what you're primary use will be; will you use this in a child's bedroom or your living room? Will you be playing games, watching movies or listening to music mostly? Are you wanting to geek out with the TV device or just watch some TV?Once you have that question answered you're able to narrow down the options and you quickly realize how little time you actually spend watching TV in your bedroom and how something like the Roku 2 is more than adequate in an area like that or perhaps you realize that your Grandma has no idea how to even pronounce the word 'Nexus'. Whatever the case it's always good to take a quick look at what all of your options are...staples like Netflix, Hulu, Amazon and Pandora are practically embedded into everything or available on most modern devices so I'm not even going to bother talking about those types of things, instead I'd like to show you some other ingenious options available on this top end home theater must have.-Amazon Fire TV-The Amazon Fire TV is kind of a tongue twister; try to say it five times really fast. The currently $79 Android device does tout some heavy specs under the hood and was quite honestly one of the most underrated electronics this year, this is mainly due to the use of Amazon's Fire OS overlay on top of Android 4.4...the interface is actually really easy to use for someone older but it does leave those of us who are not older in a pickle in terms of customization and personalization, if those things are important to you.Upon first glance the sleek user interface sort of glows with it's subtle minimalist design and invites you to play with it, the remote immediately kind of made me feel deceived for a second because I was hoping the circular directional pad would have the feature similar to the 'Apple TV' remote. (The feature would let you scroll through pages in a circular motion with your thumb very organically.) Alas, it did not...moving on though the microphone feature adds a really cool touch, I will say that I NEVER use it but it's cool on lazy days.The feel of the remote control in my hand made for a very ergonomic and comfortable experience, the set top box was packaged very nicely and was extremely simple to turn on and setup. There is almost nothing to gripe about if you are not a very tech savvy person the entire setup process was simple and very straightforward.We recently had purchased Amazon Prime at the time of purchase so browsing through the abundant catalog of free to view Prime stuff was actually pretty fun and truly a varietal of content.Gaming is actually decent, not perfect yet but that truly could change with a few tweaks to the Amazon Fire OS from the manufacturer on the Android device. I was able to hookup my traditional wired Xbox 360 controller that I had lying around in a box under my bed and get to gaming with that as well, very cool! If you are adventurous you can install Android application files directly from .APK files and install applications not intended for the Amazon Fire TV...because Android is the base of the device this generally will never harm your device if you are careful and proceed with caution. There are many tutorials on the web that show you some very neat things you can \"sideload\" onto your Amazon Fire TV...you can even hookup your Google Drive, Dropbox, or OneDrive if you'd like with this option. In this instance particularly I happened to install some video game emulators and play some Super Nintendo and PSP (Playstation Portable) Games using the aforementioned .APK files and some files I found 'legally' with the help of my good friend Google. The other sort of cool secret, not-so-secret thing is that you can also install a bittorrent client like uTorrent on the Amazon Fire TV and download things through that means as well. Truly this device has some limitations but at the time of purchase we paid $99 for something that is very capable and really sort of future proof for the time being.Media is in abundance all around, you have Plex, Pandora, Hulu Plus, Netflix, Pluto.TV and anything else Android that you want to see on the big screen. I had no trouble finding something to watch using the bundled interface, I only wish I could do things the simple standard stuff like change colors and add apps to a designated bookmarked area. Other than that the automated suggestions are great and usually spot on.Just know that this is a very capable device and while you may not really need all that beef inside the box that at one point the Android update may just make the older more slower hardware choke inadvertently. This doesn't seem to be the case with the Android updates but it sure is something I've noticed with most Apple product...updates intended to fix newer functionality end up breaking everything else. This was truly one of the most quality Android devices I've ever  owned, hands down.We need a favorites tab, I'm a tactile person and I like to select the app by hand manually and I found it a little silly to not have the option to put apps in a manner that I get to designate. I hooked up my Xbox 360 USB gamepad and it WORKED! Woo Hoo, you can use it to browse the menus and play games just like the official controller would work...most boxes disable that function to gouge the customer and Amazon was cool enough to leave the driver working for gamepads. I used Plex mostly and was impressed with the speed and response with load times...3D films worked as well via Plex.HOW IT STACKS UP:My dilemma is that I have a Vizio Co-Star and I love how the included Universal Remote can effortlessly control my cable box, sound bar, as well as the Co-Star it self...the Co-Star also has dual HDMI so I don't have to switch inputs to watch regular cable, I feel kind of blah about the overall utility and versatility of the Amazon Fire TV...it feels like they released a half baked idea, it works well but it could have changed TV in the living room if they just asked customers for real input while putting it together. It's better than a Roku 3 in the speed and interface.I only wish that Time Warner would release the TWC TV app for the Amazon Fire TV! Then I could ditch the Roku 3 altogether, the TWC TV app let's us watch TV and On Demand anywhere we have a Roku with a nice user interface, Amazon please solicit Time Warner to release a similar app for your device, that would be amazing!Bottom Line:I might return it and wait for Amazon to do what they did with the Kindle Fire...they release a new iteration like every 3 months it seems, this is a beautiful device but it needs a little tweaking before it can earn a place in my entertainment center. I have a feeling Amazon will fix these issues, but they are hardware and not so much software so be forewarned that it's not going to be the all-in-one solution you've been looking for.", "verified": true, "helpfulness": "3/3", "author": "Mat C."}, {"rating": 5.0, "review": "I got the box, hooked up the HDMI cable, hooked to the network, and everything worked perfectly.  I've used HD streaming from Amazon, downloads from Amazon, and netflix and all worked perfectly.  There was no freezing, pixelation, or  reduction in resolution.The voice commands worked exactly as described.  I just held the microphone button and said \"Hunger Games\" and it pulled up the Hunger Games plus various related topics.  The amazon prime was the first choice, so I just clicked and it started.I was surprised how small it is.  It fits in one hand.  It's easier to carry than a kindle.  After using it during the day, I took it up to the bedroom and hooked it up to a TV up there in less than a minute.  It logged back on to the network and I was able to resume the movie.The only feature that would be on my wish list, but appears to be missing is a universal search.  I have a Tivo that will search from all of the following:  Amazon, Netflix, Hulu, and upcoming live TV.  However, the TIvo won't stream Amazon.Overall, this is a fantastic product.  I intend to use it at home and take it with me when I travel.", "verified": true, "helpfulness": "4/4", "author": "R. Garretson"}, {"rating": 3.0, "review": "This box is nice. I'll do a quick comparison since I own the Apple TV box also. First thing I noticed was the speed. Real fast loading content; especially Amazon content. I also like that I can upload pics and videos right from my Galaxy S4 to the cloud. YouTube app is also better compared to the Apple. Ease of use. You've all heard about the search feature. It works flawlessly except only with Amazon content. Not a big deal for me as it is with others on this board since no one else offers this type of service! The user interface, UI, is very nice and neat. On the Apple TV it seems to take forever, at least 30 seconds at times,  loading a purchased movie. Before you ask, I'm on a 75/25 Fios plan. So it's not my connection. The purchased videos on Fire load within 3 seconds or less. Setup is easy as it comes right out the box for you if you purchase from Amazon. You still have to enter passwords, like all other boxes, if you have Netflix and such. People whining about that; don't know why. And people writing reviews who don't even own it! Whatever!Now for the prime membership angle. I was satisfied with my Apple TV, but I've had prime for sometime and wanted to access my videos in a better way than Smarthub on my Samsung LED. Slow as all hell. Never buy a TV with all that internet stuff built in. These boxes will take the place of that and your TV will be cheaper. Anyway, prime is great if you order from Amazon on a regular basis. I do. With free 2 day shipping and next day shipping for 3.99; you can't beat it. And I noticed with Prime; the movies I get to watch for free are the same that are offered on Netflix. And with Prime, I get to watch TV shows for free that Apple is charging 2.99 to watch. \"The Good Wife\" for instance is free to watch for the first 4 seasons on prime. Apple wants 2.99 an episode. So if you have a Netflix account, which I used to, you can now cancel it; unless you watch \"House of Cards\".  They overlap in my opinion. 96$ a year for Netflix, 99$ for Prime; with the shipping bonus. And it used to be 79$. Was that price for years so they extra 20$ wasn't a big deal.I also noticed that some movies are cheaper to purchase on Amazon compared to Apple! Can't remember which, but when I was going through movies yesterday on both devices, some movies were 17.99, but were 19.99 on Apple TV. Also some of the rentals are 3.99-4.99 for a 1 day rental. Some are 5.99 for a 2 day rental. Apple offers only 1 day rentals, and for the higher 5.99 in some cases. DirecTv also does 2 day rentals for 5.99. When I realized this, I know longer rent movies from Apple TV. I wish Amazon would have come out with this box awhile back. I have so many movies purchased through Apple. Any new purchases will be through Fire.Now for the one issue I have with Fire. When you go to rent a movie, it doesn't tell you if it's a 1 or 2 day rental! I know the higher priced movies at 5.99 are 2 day rentals but it doesn't state this anywhere on the screen. I spoke with Amazon tech and they said they'd alert the developers. Also to those crying about it not having this app and not having that app. Relax. Apple has been slowly updating their apps as well. And when I first purchased it; it didn't have nearly the amount of apps it has now. But those complaints came from people who never even purchased the box. Still don't understand that. MLB and NBA were add ons to Apple as the box grew. I'm quite sure Amazon will sign agreements with them. So in closing; I like this box tremendously compared to Apple TV which at the time I purchased it, blew away the competition. Roku, Sony box, etc. Hope this was helpful....One other thing I forgot to mention. When you watch a movie, and then leave it and come back later. It will start from where you left off. But it doesn't give you the option to \"start from the beginning\" like Apple Tv does. It only says resume! Otherwise you have to rewind the entire movie. Unless you finished watching it. That needs to be updated....Update: 6/14/2014I've had the Fire box since it came out. I noticed this. The sound quality from my Apple TV through the optical out port in my opinion is better than the Fire. I have set my volume at 10 on my 7.1 surround system and played identical movies [X-Men] and when on Fire the sound is lower and so is the bass! Just sounds so much more powerful on the Apple. I only noticed it when I accidentally ordered the same movies on both devices. Apple uses 16 bit encoding; maybe that has something to do with it. I'm not a spec guy. But my ears don't lie. Sound and picture quality are most important to me as I assume others. Also the video quality on Netflix is horrible. Must be 480. It's not HD quality. Switched back to my Apple Tv and it's HD quality. Using FIOS with a 75/25 connection.", "verified": true, "helpfulness": "12/13", "author": "Alan S. Tyson \"Alan\""}, {"rating": 2.0, "review": "I was extremely excited when I got this unit but  VERY disappointed after using it for the first time.Good:-Nice graphic user interface-Fast internet speed/ processing-The voice feature is kind of cool and pretty accurateAbility to watch amazon prime. But I could have just connected my laptop to the TVNow the bad: (which I was extremely disappointed)-The product just launched this week and when I received it and turned on for the first time, it had to do an software update already. Took a long time.-It feels like you have to pay for every little video on there!!! The amazon prime movies section was OK and free to watch with my amazon prime account. But when you go to the Amazon Prime TV section it charges for every video OR it makes it confusing and difficult to find the amazon prime button to watch the video for free.- YouTube is not preloaded on it. Only Amazon's software. You have to download the app. Com'on Amazon...- the voice search feature doesn't work for YouTube- not much free content to watch and the pay stuff is pretty priceyAmazon Really??? You are charging 3x the price of Googles Chrome cast and you don't think we as consumers would have higher expectations? Let me repeat that again. You are charging 3x the price!Some suggestions for Amazon to improve:-you need more free content or even Amazon fire TV exclusive content- you created the Amazon 1-click but you completely forgot your clicks in this unit.... and quit hiding the free stuff-zero social media on this unit- more apps please- you really need to lower the price on this product. I feel raped for buying this thing 3x the price of my Chromecast-aside from being able to watch Prime, which the Roku can do too, what else is unique about this unit? You do realize Chrome cast allows you to browse the internet with your TV too... but amazon fire TV doesn't even have this small feature... so what is unique about your unit that you charge 3x the price?", "verified": true, "helpfulness": "21/30", "author": "W"}, {"rating": 5.0, "review": "After having it a few days ,overall I like it .It has some bugs which hopefully will get worked out,the interface is nice and its fast.Everyone seems to want to dog on Amazon, but the Apple Tv and Roku3 are far from perfect too.I actually enjoy the games on it ,hopefully Amazon keeps up with updates on it.after having it a week I love it !!!!my Roku 3 and Apple tv are just fancy paper weights now .", "verified": true, "helpfulness": "8/9", "author": "robbie H"}, {"rating": 5.0, "review": "Amazon Fire TV is awesome. I wish I'd known it was coming before investing in Chromecast. It is plug and play. Not only is it easy to set up, but a short, introductory video walks a novice user through the basics. Next, no other device is needed for \"casting\". The fire is self-contained and operates via its own remote. Having access to Prime videos and games, as well as the mega-Amazon video library, makes memberships for multiple sites unnecessary. Yet, there they are -- Netflix, Hulu+ and more are available on Amazon Fire TV. Finally, Voice Search is the best thing since sliced bread. I am looking forward to more original Amazon series as well.", "verified": true, "helpfulness": "3/6", "author": "Carleen A Short"}, {"rating": 3.0, "review": "I only have satellite internet where I live, and I need to make use of specific hours of the day (12am to 5am) to download my content.  I need a box with storage and the ability to schedule when content is downloaded...", "verified": false, "helpfulness": "2/15", "author": "Amazon Customer"}]