[{"rating": 5.0, "review": "Love Amazon Fire TV. Great selection of movies and shows. Plus games. Easy to navigate too", "verified": true, "helpfulness": "0/0", "author": "Christine H JEnkins"}, {"rating": 4.0, "review": "This is an amazing device.  The voice search is very handy, I havent had any problems within yet either. The apps take a little bit of getting use to but for the most part are pretty intuitive.", "verified": true, "helpfulness": "0/0", "author": "Nicolas Laudenslayer"}, {"rating": 2.0, "review": "We have had this for a while and only use Netflix. We are unable to use any other apps.", "verified": true, "helpfulness": "0/3", "author": "Brittany Guillen"}, {"rating": 5.0, "review": "ververyve", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 5.0, "review": "This is the best thing that has happened tv!  Having 'air wave antenna tv' and also expensive Directv, this has been exiting fun.  Great quality picture and sound, ease of use, and good selections for watching make this a favorite at our house.  Goodbye commercials,  hello binge watching!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my amazon fire tv  I can not believe it took so long to find.  Thank you  BKegg", "verified": true, "helpfulness": "0/0", "author": "Brenda K Kegg"}, {"rating": 5.0, "review": "I was choosing between Apple and Amazon but the Prime video access, etc. won me over.  I bought the bundle with the controller for gaming and my Minecraft loving children are pleased!", "verified": true, "helpfulness": "0/0", "author": "Working Mommie \"Grad Student Mommy\""}, {"rating": 1.0, "review": "Didn't work.. Had to send back. :(", "verified": true, "helpfulness": "1/3", "author": "Rochelle"}, {"rating": 5.0, "review": "Received this as a Gift.  Love it.  Easy to use and super easy to travel with.  Works great at home and on vacation.  TV, music and movies all rolled up into one nice package.  Even downloaded workout videos...gym on the go.  Highly recommend for anyone that does not already have a \"smart\" TV.", "verified": true, "helpfulness": "1/1", "author": "T. Miller"}, {"rating": 5.0, "review": "Love this product.  For the price you can't beat it.  Replaces Play Station 3 for movies and gaming!", "verified": true, "helpfulness": "0/0", "author": "M. Gudermuth \"Oldies Queen\""}]