[{"rating": 1.0, "review": "Extremely disappointed, perhaps the worst holiday purchase this year. It does not function as described on the box and failed to meet the main reason I bought it (streaming Comcast Xfinity to my bedroom), save your money", "verified": false, "helpfulness": "0/2", "author": "Fr. Stephen Sinclair"}, {"rating": 5.0, "review": "excellent product and sellerthanks very much!!", "verified": true, "helpfulness": "0/0", "author": "Nicolas Rubio"}, {"rating": 4.0, "review": "Not as easy to use as advertised.", "verified": true, "helpfulness": "0/1", "author": "A Genuine Validated Amazon Reviewer \"The Mad Monk\""}, {"rating": 3.0, "review": "I had trouble with audio on avi files mkv files and others.  Amazon firestick is better.", "verified": true, "helpfulness": "0/1", "author": "Greg Raizk \"Greg\""}, {"rating": 5.0, "review": "Everything was great Thank You", "verified": true, "helpfulness": "0/0", "author": "Ryan Coe"}, {"rating": 5.0, "review": "So much better than having to use a HDMI cable & now I can use my iPad for other thing while my family is watching Netflix or YouTube.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "I love this product", "verified": true, "helpfulness": "0/0", "author": "Darsh"}, {"rating": 5.0, "review": "Fast Shipping!  Great product.", "verified": true, "helpfulness": "0/0", "author": "Gordon Chew"}, {"rating": 4.0, "review": "Still a little buggy... I have to restart it by yanking the power now and then because it freezes up or inexplicably loses wifi connection. Sometimes it doesn't start streaming things when you select them from Netflix, Chrome tab, etc. Apple TV is better in terms of stability and not causing frustration. But when it does work (which is most of the time) it works well and has great picture quality. Recommended, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Narso"}, {"rating": 5.0, "review": "I love the Chromecast.  This is the third one I have purchased, two as gifts.  If you have a Netflix or similar subscription, then this is the way to go.  I like that I can simply unpug the device and take it to another room to watch.  Everyone who I know that has one enjoys it.", "verified": true, "helpfulness": "0/0", "author": "J. Devores \"jcdevo\""}]