[{"rating": 5.0, "review": "Excellent product!!!", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 5.0, "review": "I am very happy with the Chromecast.  Is good product. I use it all the time, and i watching  a youtube video on my tv.", "verified": true, "helpfulness": "0/0", "author": "mirelys"}, {"rating": 2.0, "review": "It works well in the beginning, but recently it is very laggy sometimes. And even lose connection very oftenly. I tried reboot or re-plug in, doesn't works. don't know why.", "verified": false, "helpfulness": "0/0", "author": "Kaleaves \"KSP\""}, {"rating": 5.0, "review": "This product is amazing! I was able to keep me and my family entertained, without television, with the Chromecast.  It has worked pretty well for me, with only minor issues of being disconnected at times.  The updates are necessary and presently, I don't have any issues with its use.  I've used it for parties and at other's homes with no issues.  Netflix, Google products, HBO GO and Showtime work great.  I recommend this to everyone! It evens can cast your cell phone screen and videos onto the television.  You really can't go wrong when purchasing this product.", "verified": true, "helpfulness": "1/1", "author": "Eric Ontiveros"}, {"rating": 3.0, "review": "I'm not super thrilled with this. It locks up regularly which requires me to reach behind the TV to restart it. It's wireless antenna isn't great either. I can use an iPad, Nexus 7, and phone literally inches from this thing and stream Netflix and Youtube, but the Chromecast struggles to maintain a stream.", "verified": true, "helpfulness": "0/0", "author": "Patrick R Novak"}, {"rating": 5.0, "review": "Doesn't get much better. Seemless interaction with my computer and smartphone. No need for a remote. The whole house loves it.", "verified": true, "helpfulness": "0/0", "author": "jeff clewell"}, {"rating": 4.0, "review": "Not bad for the price. I use it to cast the WatchESPN app in hd, YouTube and xfinity. It lags on the xfinity app but I don't use it often so no real complaints.", "verified": true, "helpfulness": "0/0", "author": "Mocmocs"}, {"rating": 5.0, "review": "My second one.", "verified": true, "helpfulness": "0/1", "author": "Daniel Curutchet"}, {"rating": 4.0, "review": "Works great but do not have enough internet speed to cast well.", "verified": true, "helpfulness": "1/1", "author": "Betty J. Readnour \"desert dweller\""}, {"rating": 5.0, "review": "Love it, simply the best thing I've bought in years. I actually bought 4 of them, and so did my friends and family!", "verified": true, "helpfulness": "1/1", "author": "Igor Bashuk \"IGOR\""}]