[{"rating": 4.0, "review": "I bought it for a friend to use on her tv. She loved it, took less than 10 minutes to plug in and setup on her wireless. Wished it works with amazon prime instant app.", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 1.0, "review": "Google continues to advertise that with the Chromecast  you can:\"With Chromecast, you can easily enjoy your favorite online entertainment on your HDTV--movies, TV shows, music, and more\".\"Browse for what to watch, control playback, and adjust volume using your device. You won't have to learn anything new\".That is blatantly a lie and fraudulent. I cannot watch Amazon Instant Video. I cannot watch websites that stream video online but that are not in the short list of what is available for Chromecast.You also cannot Browse the internet. You cannot use Firefox, Chrome or Internet Explorer. Yet all the hype surrounding Chromecast led me to believe I could. Read the hype and you will be inclined to believe the same. I really did not expect Google to be this deceptive with its advertising.If you only want Hulu or Netflix or Youtube then great device and cheap but I don't use any of them, I use Amazon for Streaming and this doesn't work with Amazon. I also hoped that I could watch a few of the websites that stream only online but I cannot. Sure there are all kinds of workarounds and other software but that is not what I expected to have to do.I am returning the Chromecast and really disappointed with Google, did not expect this kind of overhype from them.", "verified": false, "helpfulness": "4/5", "author": "S. A. ROBBINS \"shirley_rw\""}, {"rating": 5.0, "review": "This is worth every penny best way to turn my tv into a smart tv. its easy and so simple to use a MUST BUY.", "verified": true, "helpfulness": "0/0", "author": "Brennan"}, {"rating": 1.0, "review": "This product could be great however the difficulty of getting it into a secure networking environment is not worth the hassle. I'm not a super networking guy, but my skill set is slightly above average.It would not connect to an ATT Uverse modem no matter how many settings I changed, it could not get through the firewall. Once I connected it to my Linksys router (unsecured guest network), it would work, however it will not link to a non broadcasting SSID. You also have to enable multicast with no wireless isolation, etc etc etc....Bought a Roku, connected it to the non broadcasting network SSID and BAM! Done!.....Much more mature, easy product to configure, easy to use and gets prime amazon along with 700+ channels. Only bad Roku input so far is user interface kind of stinks, but its tolerable.Goodbye cable company! Hello Roku!", "verified": true, "helpfulness": "1/2", "author": "Nugget"}, {"rating": 3.0, "review": "Functionality: Streams web, I said WEB content to your TV through apps like YouTube. It will take 5-20 seconds before showing your video stream to the TV. There is a way to play local files i.e. movies off your computer.Setup: Device connects physically to TV through HDMI and wirelessly to your wireless network. My TV requires it to has the USB plugged in at all times. Not sure if required to do so. It was relatively easy. Plug in. Change \"channel\" to HDMI for TV. Download app. Connect to Google Chromecast device. Use selected app to stream.Available Apps: YouTube, Hulu Plus, HBO Go, Pandora, Netflix, Google Play Movies, Google Play Music, VEVO, Red Bull TV, Songza, Plex, Viki, Real Player Cloud, Avia, Revision3, Beyond Pod.Value: Worth it. Would be nice to see a functionality where you can play local files from your phone.... I like wireless and detests wires so that it that.", "verified": true, "helpfulness": "0/0", "author": "ProcrastinatingZombie"}, {"rating": 5.0, "review": "The chromecast is one of the easiest and most useful home entertainment devices I used to date. Having an AppleTV and PS3 at home, I have many options, but I continually come back to the chromecast. Anyone can 'cast' their favorite Pandora station, and the system works well with iOS, Android, Mac, and WIndows products since the chromecast uses the existing WiFi network at your home.Setup is quite easy, and I was up and running within 2-3 minutes following the easy guidelines provided with the product. Although many of the computer casting options remain in beta, they seem to work quite well.iOS has many apps that allow your phone to 'cast' to the device: Netflix, Pandora, Youtube, Songza, and HBO Go to name a few that I use most often. I highly recommend this device, especially if someone is considering buying a Roku, AppleTV, or other internet streaming device.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Watson \"Benjamin\""}, {"rating": 5.0, "review": "I absolutely love this device. It's so easy to use, as I literally just pull out my phone and stream youtube/netflix onto my tv all the time now. You don't need to power anything on as it'll automatically wait for you start using it once your tv is on. Definitely recommend it even if you already have a smart tv. Chances are it'll work better than your tv's built in apps.I can't wait for more apps to become supported but youtube and netflix is all I need.", "verified": true, "helpfulness": "0/0", "author": "RP"}, {"rating": 3.0, "review": "YouTube works amazing but hbo does not I did not like that I have to restart the app many times", "verified": true, "helpfulness": "0/0", "author": "Guillermo D Bravo Ariza"}, {"rating": 4.0, "review": "I like this, it dose as it advertised it did. But when I tried to connect my kindle I couldn't do it but I did get it sinked to my phone. but that means I am the only person in the house that can use it. I still don't know how I got it on my phone. the directions were very poor.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This allows you to connect to your wi-fi and use your tv as a computer monitor. It is equivalent to the apple tv and roku, but is much cheaper. It's easy to install and the picture is great. This in my opinion is better than apple tv or roku (which I have both) because you can go on any site and watch any video as opposed having to install apps.", "verified": true, "helpfulness": "1/1", "author": "McCarth \"aka sLiM sHaDy\""}]