[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "donna lowe"}, {"rating": 3.0, "review": "Way too many choices on the home screen, utterly cluttered. Too many clicks to find what you want. No control at all over photos. No setting the order in which you want to view them. The cloud is in control and cannot be altered. I like to create slide shows in a certain order...like photos of a vacation starting at the beginning. The cloud sorts newest to oldest only and Fire TV only uses them in the order dictated by the cloud.I like being able to watch Prime movies and TV shows on my TV. That's about all I use Fire TV for.", "verified": true, "helpfulness": "0/0", "author": "Jude"}, {"rating": 5.0, "review": "Works great at home but will not work on the WiFi system where we go camping for some reason.  Camping was what we had planed to use it for, the camp ground must have some kind of block on its usage.", "verified": true, "helpfulness": "0/0", "author": "Roger L. Stennes"}, {"rating": 5.0, "review": "I got the Amazon Fire TV for my wife and she loves it. I love it because Amazon Prime is a great deal compared to the cost I was paying a satellite provider. Just one month of satellite was costing us more than a whole year of Amazon Prime, which delivers more than just shows and movies. The voice search on the remote is awesome. I have been very pleased with this purchase. Both I and Gary Busey highly recommend you to give it a try as well!", "verified": true, "helpfulness": "0/0", "author": "Doug and Brooke Beard"}, {"rating": 5.0, "review": " Being a life-long Apple fan I'm shocked to find myself writing a review of the Amazon Fire TV - but it's simply the best set-top streaming device available (as of March 2015).I've bought (and since eBay sold) two versions of the Apple TV, and neither came close to this.As I work with technology, I'm aware at just how confusing it can be, so I'll steer clear of the Gigabytes and Megahertz and in common with Apple, focus on the actual experience rather than the technology.First Impressions--------------------Typical of Amazon rapid service, the package arrived next day, and once opened the beautifully packaged box I was immediately impressed.  The tiny matt black box looks like a CD box set, but at 4.5 inches square and half an inch thin - it's quite a bit smaller.  Plug it into the TV via an HDMI cable (sadly not supplied), and it immediately connects to your router, and up popped a message on the screen....\"Hello John - do you want to log into your Amazon account?\"Hey!  That's a tiny feature, but I was immediately pleased - the kind of attention to detail that's lovely to see.  Clearly when you order the Fire, the actual device is registered to you, and \"knows\" who you are.  You can of course connect to Amazon on another account (for example if you send it as a gift), but it's a lovely to find it quite literally works \"right out of the box\".  Good to see also, when you fire it up, it has any Amazon video or music purchases available along with photos and videos.After an initial re-boot to install the latest software it was ready to go, and boy did it go.It's blisteringly fast.What's it like?==========Scrolling around the menus is smooth and incredibly fast, and press \"Play\" and there's absolutely no delay, no \"downloading\" message, in fact no waiting at all.Of course it works even better if you have the \"Amazon Instant Package\" which means you can stream a huge number of films and TV programs for free (as well as free next day Amazon delivery).  However, where Amazon scores over (for example), Netflix, is the fact you've got the option to pay an extra £3 and rent a film that's not part of your package.  Being able to do this directly on the TV is a great bonus, and you can of course ensure your credit card is protected by a pin code if needed.From the main page you can view every film, TV programme or App (there's hundreds of games available), and even the \"Voice Search\" is impressively sharp.  Just press the \"microphone\" button on the remote control and say what you're looking for, and it displays options on screen - remarkably quickly.  Having said that, it works so fast scrolling through pages you hardly ever need this.I know this kind of technology is now common on smartphones, but I was really impressed at how well it's been integrated into the TV set.  Means you can search thousands of films or TV series in seconds, and if your request matches several possible options, it lists them all for you to select.In common with many other set-top boxes there's also complete integration with other media.  This means you can play your music straight from the Amazon servers or load photos and watch them on the TV.  Any music you've bought from Amazon is instantly available, and you can upload an additional 250 songs for free before buying additional \"Amazon cloud\" storage.Why is it better than Apple TV?=======================Firstly, I'm a huge fan of Apple devices (iPhone, iPad, Mac, TV), but the Apple TV was first launched in 2006, with a minor speed update since.  This Amazon device has a quad core processor, 2Gb of memory and  8 Gb of onboard storage, and is bang up to date.  You're therefore getting a MUCH faster device, and when you've got 1,000 programmes to choose from and a short attention span - speed counts.While the smooth aluminium remote on the Apple TV may be a lovely design, it still needs line-of-sight to the Apple TV to work.  Sure, no problem, except if you TV is attached to the wall, and the box hidden behind it.  Amazon Fire uses the Bluetooth wireless standard, which means you can change channels from another room if you want to.  Lovely touch.Indeed at just 5 inches by 2.5 inches, and weighing only 79g, the remote control sits nicely in the hand, and is equally beautifully designed - although without the aluminium Apple styling.I did wonder whether I'd want to mirror my iPad to the TV, and whether that'd be a deal-breaker.  No problem, you can buy an App for that.If you've got a huge film collection on a computer or NAS you're also in luck here.  Download a copy of the \"Plex\" App, and you can play all your media including films, videos, photos and music from your external device.Unlike the Apple TV you can even play games on this device.  There's hundreds available for free plus lots of paid Apps, and you can even buy a dedicated games controller.Finally, despite having a top end HD television and the latest Apple TV, the picture quality on the Amazon is so much better.  The screen resolution, and ability to fast forward or backward is just terrific.  Oh, and did I mention the \"instant play\" features.  It seems Amazon Fire learns what series you tend to watch.  So when you're not looking it quietly downloads the first 10 seconds of your most likely selections.  This means when you press play, it just starts immediately.Overall opinion===========Like thousands of others, I have to agree this is real winner.  The combination of the incredible simple design, super-fast no-wait streaming with an excellent remote control make this device a real family favourite.  I for one am really impressed, and if you've already got the \"Amazon Instant\" subscription with free one day delivery this is a no-brainer.  We've watched far more on Amazon TV now than ever before.Highly Recommended.", "verified": true, "helpfulness": "2/2", "author": "John Ryan \"Scouse in the semi-detached house\""}, {"rating": 2.0, "review": "I bought this only to watch movies through Netflix but the Netlix app is so bad compared to on other devices. Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Guy"}, {"rating": 5.0, "review": "If your someone that does not own a playstation or an xbox this is a great cheap alternative if all you want is a media device for video", "verified": true, "helpfulness": "0/0", "author": "c.know"}, {"rating": 3.0, "review": "I love the idea of this box and set up is so easy but it seems as though if you don't have Prime and the game controller its pretty useless.  Originally couldn't recommend but it was operator lack of patience that was the problem BUT having Prime does add much more.", "verified": true, "helpfulness": "0/1", "author": "Denise Anderson"}, {"rating": 5.0, "review": "I love it, it beats the competitors for sure... I mean the specs will tell you that.  It is easy to use and has all that I want.", "verified": true, "helpfulness": "0/0", "author": "RC \"R C\""}, {"rating": 2.0, "review": "Suffering buyers remorse here. The Hulu app is absolutely unwatchable due to buffering and lag, same with many other video apps. This is not a bandwidth issue b/c my Apple TV plays the same apps just fine with no buffering. This was going to replace my apple TV, but I've moved the Apple TV back in place and put this in the back room where it won't get much use. I have a huge problem with the fact that you cannot completely disable voice search, which I see as a huge privacy and security concern. You shouldn't have to physically hack a device to gain privacy and security. Really wish I hadn't of bought it, buyer beware. Get yourself a Roku or an Apple TV instead.", "verified": true, "helpfulness": "0/2", "author": "Chief Points"}]