[{"rating": 5.0, "review": "I am not a tech person and I was able to get this set up on my tv with my ipad.  It is great for  using netflix.", "verified": true, "helpfulness": "0/0", "author": "Rebecca A."}, {"rating": 3.0, "review": "Love the Chromecast - hate the limitations on what I can currently stream with it .  Netflix, Flex and YouTube are not quite enough. Tab casting from a Chrome Browser doesn't work well so I haven't been able to enjoy my favorite video casts yet.  Google - please open up the APIs and let the developers go crazy!", "verified": true, "helpfulness": "0/0", "author": "Bill Stout"}, {"rating": 5.0, "review": "I had to return them due to the fact that they would not work with our soundbar.  Really looking forward to getting a better nite sleep with my husband watching TV. Oh well!!!!  Earplugs", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 1.0, "review": "totally useless so far.  cannot get it to work!!!!  netflix does not find the device.  a total waste of money at this point!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Beth Shapiro"}, {"rating": 2.0, "review": "I purchased 4 of these for Christmas gifts.  We kept one of them.  It was extremely easy to set up and worked great with my Samsung Galaxy 4 phone.  However, the next day I decided to use it in the same room using my iPad.  No luck.  I could never get it to load Netflix - it kept buffering out.  I then decided to try the Kindle - since it is a droid product.  This did work - after taking 45 minutes to buffer and load.  We've tried watching Netflix shows - and sometimes we can get through an entire episode - but more likely than not - the show quits and has to re-buffer which can take up to 10 minutes.Obviously this has nothing to do with the internet as even on my phone, it is connected through the router.  There are obviously some glitches in these that are causing issues.  It's very disappointing it won't load on the iPad as that is the most convenient means to stream most of our videos.Because I only paid $29 - I'm not giving it 1 star - but for what it advertises - it really should work well.", "verified": true, "helpfulness": "0/0", "author": "Lexington Mom"}, {"rating": 3.0, "review": "I apparently didn't do enough research before ordering this, but I purchased it to put the internet on my tv via the new Nexus 7. As of now this isn't supported as you have to have a google chrome extension that isn't made for a nexus 7. Hopefully they come out with one in the future & I'd change this to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "mc"}, {"rating": 5.0, "review": "Great Product. Packaged wonderfully. Works as directed!Google has done great work with the Google Chrome Cast. I cannot wait for more apps to deploy.", "verified": true, "helpfulness": "0/0", "author": "Bryan Byrd"}, {"rating": 4.0, "review": "I love the google chromecast, it is perfect for what I need. It is very easy to use, and was very fast when it updated. I recently purchased a Netgear NeoTV and was seriously disappointed with it, as it was more expensive, slow (it took nearly 45min to update), and did not support HBOgo. Some models of the NeoTV do have HBOgo and are compatible with more streaming platforms than the chromecast- but the basic one was $50 compared with the $30 I paid for chromecast. The chromecast works with widely used platforms like HBOgo, Hulu, and netflix - which is perfect for me. I love this product and would definitely recommend it for anyone that wants to quickly and easily stream to their TV.One thing that I didn't like - it says it is compatible with Mac products -I have a Macbook Pro from 2009 that still runs great, but my OS X is a slightly outdated version for the chromecast and during setup it suggested that I do not use my Macbook since the software was not fully supported. I ended up using my iphone 5 - which works great with the chromcast.", "verified": true, "helpfulness": "0/0", "author": "Donna Davidson"}, {"rating": 5.0, "review": "After reading some of the Verizon customer comments regarding the installation difficulties encountered I was leery but followed the easy installation instructions and I couldn't be happier. Easy to use, great picture quality, no complaints. If you're still paying for individual movies... you have to get one of these.", "verified": true, "helpfulness": "0/0", "author": "Tom Gregor"}, {"rating": 4.0, "review": "I cut the cable TV cord well over a year ago and haven't really looked back. We've lived with Streaming Netflix, Blu-Rays, and OTA signals. We recently got into Amazon Prime as well.  The set up is simple. A Re-purposed PC for a HTPC in the living room and a Roku2 box in the bedroom for when the TV is otherwise occupied. We use the PLEX application (and server) to stream local content to the roku box ( and anything else with the Plex app) wirelessly. It works very well and I've no complaints.The Chromecast showed up wrapped in a gift I received over the holidays and set it up on the TV with the Roku Box. Here are my observations:Set up:Easy. It's all on screen. Read the screen and do what it says. It almost sets itself up. I had a few hoops to jump through due to some of the network security I have implemented but otherwise no issues. Easy enough your elderly parents could do it with little help.Streaming:YouTube - Flawless as it can be. Quick responses. No buffering.Netflix -  I installed the Netflix app on my Nexus 4 and attempted to stream to the Chrome cast. Again, It went off without a hitch. No Buffering and quality was good. Casting to the Chromecast had a snappy response.  (Seemed like the picture was better than the ROKU box out of the gate. That is, The Roku Box tends to buffer behind the scenes to improve the quality of the stream. Netflix streams get better as they play. Those who watch Netflix on their Roku should know what I'm talking about.)Google Music - No issue. Again, response was snappy. No real Complaints here.PLEX - This one I could not test due to me being too cheap to spring for the PLEX Android App. I'll be buying this once it's out of beta but many folks I talk to say it's working well.Cord Cutters, This will not replace your HTPC on your main TV. I've yet to find a device that will do that. Simply put, this is a great little device. It's portable, and requires relatively no time to set up. For 35 bucks, you would be hard pressed to find a better deal. It has not replaced my Roku 2, but with increased developer support, It can easily become my go to device for TVs other than the Main one. Crackle and Amazon Prime, I'm looking at you.", "verified": false, "helpfulness": "0/0", "author": "Norsican"}]