[{"rating": 5.0, "review": "I've had the Fire TV for about a week. I used to use my sons old WII to stream Netflix and YouTube. It was working as good and it would buffer a lot. I haven't had any issues with the Fire TV. It is very easy to use. I just wish it had an off and on button. When I'm done using it I just turn my TV off but the Fire TV eventually goes to sleep.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent quality, easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Samantha Marquis"}, {"rating": 5.0, "review": "Returned product...didn't need with Smart TV.", "verified": true, "helpfulness": "0/0", "author": "C. Brisendine"}, {"rating": 4.0, "review": "Five stars when mirroring works and voice is better, everything else is great.", "verified": true, "helpfulness": "0/0", "author": "dad of two"}, {"rating": 5.0, "review": "owns 2 of these , and 2 fire sticks. suck.. error on on sony lcd tv and vizio. have to power on tv when using fire stick.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Lots of capability, but short on explanation of how to use it all.", "verified": true, "helpfulness": "0/0", "author": "Derek Y."}, {"rating": 5.0, "review": "I love the Amazon Fire products!  I have had smart TV's and smart Blu ray players, but they all seem to have their own proprietary software with limitations.  So far, I am able to watch all my 'Smart Media' through the Amazon products.  I have the Fire Stick and the Fire TV.  I started with the Fire Stick and loved it so much, decided to try out the Fire TV.  I love the voice remote option.  I would highly recommend this over Chrome Cast or WD Media devices, both of which I have.", "verified": true, "helpfulness": "0/0", "author": "Cebob"}, {"rating": 4.0, "review": "Hooked up easily, easy to operate", "verified": true, "helpfulness": "0/0", "author": "debra caton"}, {"rating": 5.0, "review": "Never got to use it but I know they're streaming service is the BEST!", "verified": true, "helpfulness": "0/2", "author": "DakotaMike"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rodney"}]