[{"rating": 5.0, "review": "The Amazon Fire Tv is easy to set up and use.  The movie and tv selection is excellent and I would guess will get even better.  It is nice the way Amazon has set up \"categories\" which makes it easy to search for comedy, adventure, etc.  The TV shows stream without commercials. The \"Voice search\" also works very well.  I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "W. Dunlap"}, {"rating": 4.0, "review": "I really like my Fire tv.  It makes watching Prime convenient.  The only drawback is that there are few movies I want to wachieve that I do not have to pay extra for.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought a refurbished product.But the state is completely new products.I've used a lot I can not yet,So far it seems really good product.", "verified": true, "helpfulness": "0/2", "author": "chilsu Bae"}, {"rating": 5.0, "review": "Love it. It actually connects to my wi-if unlike my so called smart TV and blu-ray. I use it every day and have had no issues with it. Remote is easy to use. Set up was easy. Wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this unit. Easy to set up and use, 5 minutes from box to tv. Using Amazon prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Karen M."}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Solomon Daniels"}, {"rating": 5.0, "review": "Simply amazing. Easy to use and connect to WiFi. Please add a sleep button on the remote.", "verified": true, "helpfulness": "0/0", "author": "MP"}, {"rating": 5.0, "review": "Works great. Easy to set up and use. No regrets.", "verified": true, "helpfulness": "0/0", "author": "Carol Murray"}, {"rating": 5.0, "review": "works great. easy setup", "verified": true, "helpfulness": "0/0", "author": "J. C. Conchas \"Just my two cents\""}, {"rating": 5.0, "review": "Love Amazon Fire! I was able to get rid of a high cost cable package by getting Amazon Fire. Very easy to set up and use. Large selection to chose from to accommodate everyone's taste.Just wondering if I have Amazon Prime and Amazon Fire, do I still need to pay for Netflix?", "verified": true, "helpfulness": "1/1", "author": "Jan"}]