[{"rating": 5.0, "review": "Easy to use, and works perfectly as it is expected. 5 min ready after box open.", "verified": true, "helpfulness": "0/0", "author": "Mario Covarrubias"}, {"rating": 5.0, "review": "Easy to use and set up!  Works just as described.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ckoh\""}, {"rating": 5.0, "review": "Nothing to say.It works fine and good quality!", "verified": true, "helpfulness": "0/0", "author": "Dr.K"}, {"rating": 4.0, "review": "Little device. The only thing I don't like about it is you have to resetup up once in a while.", "verified": false, "helpfulness": "0/0", "author": "dylan bryant"}, {"rating": 2.0, "review": "Obscenely difficult to set up.  Once it is working it is great. Then my router simply got unplugged I had to do a factory reset/installation for it to work again.  Same roadblocks, same headaches as the first time around.  Have to go change router settings, access, blah blah blah. When working 5/5 stars but the absurdity of the setup drops it all the way down to a 2/5 for me...", "verified": false, "helpfulness": "1/1", "author": "Curtis Choe"}, {"rating": 4.0, "review": "I was starting to like it and my father took it to his house and now loves it.  So I don't have one anymore, I guess not Google's fault.  Easy-ish to connect and seems to work well with Chrome.  I took off a star for limited use with other applications and that the iphone app is a bit clunky.", "verified": true, "helpfulness": "0/0", "author": "MobileUser \"MobileUser\""}, {"rating": 5.0, "review": "My son had this on his xmas list, so handy once it was explained to me", "verified": true, "helpfulness": "0/0", "author": "Karen Hernandez"}, {"rating": 5.0, "review": "nice!!.. Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon customer"}, {"rating": 5.0, "review": "BEST.PURCHASE.EVER!!!!!!! I own a Playstation, and there is a HBO Go app for it, but Comcast blocks that IP, with Chromecast I can watch anything!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Frank Javier Velazquez"}, {"rating": 3.0, "review": "Could be better. Doesn't interface well with my Samsung tablet. Doesn't work well with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]