[{"rating": 4.0, "review": "The equipment is great and was very easy to install. There are more than enough movies to watch free. I wish that there some more tv series that are a little more recent. All in all it is an excellent piece of equipment and as Prime members we have even more use for our membership.", "verified": true, "helpfulness": "0/0", "author": "Daniel T. Byron"}, {"rating": 5.0, "review": "Better than apple", "verified": true, "helpfulness": "0/0", "author": "Jason Y."}, {"rating": 5.0, "review": "I really like it can't wait to dump cable..", "verified": true, "helpfulness": "0/0", "author": "MaryBeth Whone"}, {"rating": 5.0, "review": "Love it. Not much more too it. I love the gaming aspect. I need to get some actual game controllers.", "verified": true, "helpfulness": "0/0", "author": "Thomas Schuck"}, {"rating": 5.0, "review": "I have had my Fire TV for several months now.  I did not want to write a review until I had put some miles on it.  Simply stated, great streamer, and so much more.  I'm looking at getting a second one. I would do 4.5 stars if I could only because of launcher / xbmc (Kodi) issue.Pros:Plenty of horsepower to run streaming mediaSideloading apps is simple (if you've done it on other devices).  There's a great tutorial on XBMC's (now Kodi) web site.  Do a web search, you will easily find it.Many apps (and more coming all the time)music streaming (with new prime music, it replaces Pandora for me)Runs XBMC well, without breaking a sweat, remote control works \"natively\"USB Keyboard/mouse easily attach and useful.XBOX USB dongle makes XBOX controls useable as game controllers.Android Remote app works like \"native\" remote (needed after I lost original remote).Voice search (kinda cool)Optical outConsAccess to sideloaded apps is difficult (either go though system settings - applications - PIN - manage apps - select app - launch ; or use a piggyback approach - search it, plenty of tutorials out there).Does not support \"Universal\" remote - namely Harmony - without jumping so many hoops that I simply decided to give up (you need to add support for WMC remote, essentially).No native browser (you can sideload Firefox)Voice search (Amazon content and Vivo, all others be da..ed)Having previously had a roku, this device is a world apart, and then some.  Quality of picture / sound are great. Endless apps, games, etc. It is not a game console replacement for intense gaming, but great fun for casual stuff.  I tried the Ouya before, but returned it, as I couldn't get it to sync with TV + Receiver. This thing had 0 issues in any configuration (HDMI to TV, Optical to Receiver ; HDMI to Receiver to TV;)I think Amazon built a great device.  It replaced my HTPC as it is smaller, simpler, runs cooler, draws less power, gives me every option I want, and can frankly do more.", "verified": true, "helpfulness": "1/1", "author": "Yanomami"}, {"rating": 5.0, "review": "This unit is far superior to the Apple box which I am replacing. I am sorry I did not get this a year ago.", "verified": true, "helpfulness": "0/0", "author": "Richard E Kaestner"}, {"rating": 5.0, "review": "This is so neat!  I'm sure I haven't discovered everything about it but it was easy to install and the voice recorder is great.I've already watched a few free movies.", "verified": true, "helpfulness": "0/0", "author": "JaniceNilsen"}, {"rating": 5.0, "review": "Great seller, would buy again.  Fast shipment, great quality", "verified": true, "helpfulness": "0/0", "author": "Bud Martin"}, {"rating": 5.0, "review": "I cancelled my cable and ordered Amazon Fire TV as it seemed better than rivals.  The service is better than I would have imagined and the original series are great!", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 2.0, "review": "We have had nothing but problems of late with this item.  Wired or not we have issues with Apps like Hulu or even Prime shows dropping us out back to main screen and this repeating often after.  We got it to watch things on Prime and many of the other uses but often have to stop and go to another media to finish watching something on say Hulu.  I.E. Xbox...  This was meant to be a replace for having Cable and it is almost a hassle to drive us back to it.", "verified": true, "helpfulness": "0/1", "author": "Sam Levine"}]