[{"rating": 1.0, "review": "Freezes constantly while watching shows. Only way to un freeze it is to back out of show and restart it.  From info found online this is a common problem.... One that Amazon needs to fix asap.", "verified": true, "helpfulness": "0/1", "author": "Hiway9enterprises"}, {"rating": 4.0, "review": "Very responsive and easy to side-load apps!", "verified": true, "helpfulness": "0/0", "author": "Jeff A Buero"}, {"rating": 5.0, "review": "I bought a smart tv but the apps loaded too slowly and applications such as Netflix buffered too much without actually having connection issues. I read that fire tv had the fastest processor of all streaming media players available. So far I'm very pleased. Much faster loading of applications and no buffering issues. I now regret having bought a smart tv when I should have just bought a standard hdtv with a fire tv media player instead.", "verified": true, "helpfulness": "0/0", "author": "Rupert"}, {"rating": 2.0, "review": "Cannot get hbo go", "verified": true, "helpfulness": "0/2", "author": "DJ"}, {"rating": 3.0, "review": "Amazon's Fire TV works great.  Unfortunately,  I cannot rank it higher because I have been unable to mirror any Android device on my Fire TV. All devices are running Android 4.4.2 or higher.  I have tried to connect the following devices: Samsung galaxy S3, samsung galaxy S4, Samsung Galaxy S5, and Samsung Galaxy Note 2014. All devices are able to find the Fire TV, but then give a \"failed to connect\" error when you try to mirror the devices. I contacted Amazon about this issue,  and they said that  Samsung devices may only work with Samsung's AllShare Cast Hub and not other Miracast-capable devices. I tried that,  but it also did not work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has been great!  My daughter has already watched two seasons of the H20 shows. I would highly recommend this.  I like the Pandora radio.", "verified": true, "helpfulness": "0/0", "author": "D. Steward \"alroadrunner\""}, {"rating": 4.0, "review": "Easy to use.  Much better than my blu-ray player or smart tv.  The search by voice function is the bomb!", "verified": true, "helpfulness": "0/0", "author": "Johnny Bass"}, {"rating": 5.0, "review": "Best way to watch TV! Allows all of my accounts for streaming to be synced on one device making my life easier and harder to leave to my bed", "verified": true, "helpfulness": "0/0", "author": "Tricia Bartel"}, {"rating": 5.0, "review": "Fire TV has a great selection of movies and series from which to choose, and with a Prime membership most are free.  It's very easy to use.", "verified": true, "helpfulness": "0/0", "author": "daniel"}, {"rating": 5.0, "review": "We already have Apple TVs, chromecast, and all our TVs are samsung smart TVs.  So for us it's a matter of what interface is the most intuitive and convenient to use.  The fire TV is first go to source.  It's fast and intuitive.  Much faster than the apple TVs and light years better implemented than Chrimcast.", "verified": true, "helpfulness": "0/0", "author": "Austin Park"}]