[{"rating": 5.0, "review": "The Chromecast was super easy to set up, and it does everything we want to do for a cheap price. As I read other reviews, the primary complaint was that the Chromecast doesn't have as many available apps as other devices. We are not big TV watchers, so we primarily use it for Netflix and for casting a tab from Chrome Browser. For that purpose, it is perfect and the price is great.", "verified": true, "helpfulness": "0/0", "author": "Robbie Overton"}, {"rating": 4.0, "review": "Pretty nifty to be able to transfer apps from my tablet to my 55\" TV for $35.00  what  a wonderment", "verified": true, "helpfulness": "0/0", "author": "P. Sharkey \"SYMMPATTYCO\""}, {"rating": 4.0, "review": "Works great using netflix, hulu,  youtube apps ect but haven't had much luck streaming from chrome browser on computer but besides that excellent device.", "verified": true, "helpfulness": "0/0", "author": "Tyler Stone"}, {"rating": 4.0, "review": "This is an awesome technology. I think everybody should get one. I will tell everybody I know about this item", "verified": true, "helpfulness": "0/0", "author": "Sylvanus Gordon"}, {"rating": 3.0, "review": "This only works with You Tube on my iPad (my only mobile device) and it does work very well with that.  I thought I'd be able to access my iPad photostream but that didn't happen and I was unwilling to download some of the other apps for Chromecast as I didn't want to spend time moving photos around.But time will tell - maybe there will be more apps for the iPad.", "verified": true, "helpfulness": "1/1", "author": "Paul A Dlugos"}, {"rating": 5.0, "review": "Plugged it in. Quick setup on my Android phone and iPad and it works like a charm.  Even able to watch HBO GO on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Joseph Prasad"}, {"rating": 5.0, "review": "The Chromecast Streaming Media Player has been outstanding.It allows me to show my grand kid's favorite movies anytime andanywhere there is an HDMI connection available. GREAT.", "verified": true, "helpfulness": "0/0", "author": "Doug Woods"}, {"rating": 4.0, "review": "timei treid the others.but really this is best.thanks for good item..tanks good price and quality.i will buy a new item too", "verified": true, "helpfulness": "0/0", "author": "bülent özata"}, {"rating": 5.0, "review": "I use the Chromecast almost every day that I can, I use it for HBO GO, and YouTube, and Netflix, and Crackle, and other random apps.", "verified": true, "helpfulness": "0/0", "author": "McCartney"}, {"rating": 5.0, "review": "GREAT product, easy to install, easy to set up and use..........listen to music, watch movies, You tube straight to your TV! LOVE THIS!!!!!", "verified": true, "helpfulness": "0/0", "author": "Donna Linhart"}]