[{"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/1", "author": "bill wolfe"}, {"rating": 5.0, "review": "I've bought two of these! They are so convenient to use!", "verified": true, "helpfulness": "0/1", "author": "Amneris Vargas"}, {"rating": 5.0, "review": "Excellent .. must to have product.", "verified": true, "helpfulness": "0/1", "author": "Mohit"}, {"rating": 5.0, "review": "Love this!! Had to buy a second one!", "verified": true, "helpfulness": "0/0", "author": "J. MCDONALD"}, {"rating": 5.0, "review": "Love this! Just wish they had the amazon APP.", "verified": true, "helpfulness": "0/0", "author": "Kayla fragoso"}, {"rating": 5.0, "review": "Works very well and support for applications is on its way to be ubiquitous!", "verified": true, "helpfulness": "0/0", "author": "Mohamad Hussein"}, {"rating": 5.0, "review": "Works exactly as promised.  Most apps like youtube and netflix allow you to stream immediately when pressing play while some other videos must be started before you'll see the Chromecast icon become available.", "verified": true, "helpfulness": "0/0", "author": "Glendon Niblack"}, {"rating": 5.0, "review": "A great little device for streaming movies. Easy to install, easy use, all at a great price. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "John H. Arnold"}, {"rating": 5.0, "review": "This is an excelent device. It covered all what I want.", "verified": true, "helpfulness": "0/0", "author": "Juan Martín"}, {"rating": 1.0, "review": "I spent an entire afternoon on the phone with Google Chromecast Support trying to connect my Macbook Pro to my TV with no success. After what seemed like an eternity, I was told her supervisor would contact me tomorrow.  Two days later I received an email from Google instructing me to run a diagnostic program and submit the results which I did.  The next day I got another email asking what happened when I plugged it into another TV after I told them I didn't have a second TV.  That did it, I contacted Amazon and returned the device. Apparently thi Google’s Chromecast isn’t compatible with a Mac.", "verified": true, "helpfulness": "0/0", "author": "Bob in Tampa"}]