[{"rating": 5.0, "review": "Family favorite", "verified": true, "helpfulness": "0/0", "author": "Guillermo Pallete"}, {"rating": 5.0, "review": "These are amazing! I have two televisions and I am not a cable person because I cannot really afford it. These will stream almost any app that you have on your iPhone including: HBO GO, Netflix, YouTube, and TV APPS like NBC,CBS. It will also stream like this from any other device the is a smart phone. If you have a Google phone it will mirror your phone on the TV.", "verified": true, "helpfulness": "0/0", "author": "Nic98349"}, {"rating": 5.0, "review": "Helped me decide to cut the Cable Cord. Use it all the time", "verified": true, "helpfulness": "0/0", "author": "Gary E. Mintier"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "1/1", "author": "Talonda D. Ingram"}, {"rating": 5.0, "review": "It is simply a fun interactive way to watch TV. Love the queue feature, when we have friends over it becomes the juke box equivalent for YouTube and parties become even more fun as folks override each other's selections to the top of the queue while having a laugh.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "broke after a couple month and hardly any use", "verified": true, "helpfulness": "0/0", "author": "Sean S."}, {"rating": 5.0, "review": "I'm fascinated with this purchase.  This is more that I expected.  I totally recommend it if u like to play games,  watch movies, and videos if u like entertainment you'll love this", "verified": true, "helpfulness": "0/0", "author": "Josuanny Carvajal"}, {"rating": 5.0, "review": "The best thing ever. We love it and use our Chromecast almost daily to cast YouTube from our phones or tablets onto the TV.", "verified": true, "helpfulness": "0/0", "author": "Rae Augenstein"}, {"rating": 5.0, "review": "This is the second Chromecast I've purchased. This second one was for a friend. It gives you a \"smart tv\" without the svmart tv price. It is so easy to install and use. Anyone can be up and running in minutes.", "verified": true, "helpfulness": "1/1", "author": "Nita Derrick"}, {"rating": 4.0, "review": "It works well", "verified": true, "helpfulness": "0/0", "author": "jmc794"}]