[{"rating": 5.0, "review": "It works as promise and easy installation!You can watch Netflix and control  it from you tablet or phone.great !!", "verified": true, "helpfulness": "0/0", "author": "Frans"}, {"rating": 5.0, "review": "Love it, I highly recommend this product. I can watch YouTube videos, Netflix, etc right from my TV using my cell phone!", "verified": true, "helpfulness": "0/0", "author": "Michelle Mazzucco"}, {"rating": 5.0, "review": "Yes,,,I would and have recommended  this great new bit of technology ---even if i have to wait for the right app for my android phone. I have been able to cast from mu Pc to the Tv,,everything i wanted so far,,pictures,,apps you name it !! Pretty gosh darn pleased and intend to get another one or two before it is all said and done ! Oh yeah,,the kids and grandkids have been able to cast from their Ipods,,,their games,, utubes any apps off of theirs,,anyways pretty happy bunch here", "verified": true, "helpfulness": "0/0", "author": "Diane Watters"}, {"rating": 5.0, "review": "LOVING THIS SOOOO MUCH!!! Being able to watch all the movies I bought on Google Play and watch my shows from Hulu Plus and Netflix is terrific! We enjoy this more than any Christmas gift we got this year!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "An inexpensive, effective way to stream video to your HDTV. This unit uses your phone, tablet or PC to control streaming through your wifi network, so if you don't have a tablet or equivalent, Chromecast is far less cost effective than Roku. The tablet control app for Netflix is excellent. The small \"dongle\" is plugged into the HDMI socket on your HDTV and is powered by a USB cable that can be plugged into the wall or into your TV if it has a USB port. Supplied instructions are vague but several videos online explain the process quite well.", "verified": true, "helpfulness": "0/0", "author": "D. Mitchell"}, {"rating": 4.0, "review": "Great for Netflix, waiting for more apps outside the us. Sometimes it fails with my galaxy tab but it is not frequent.", "verified": true, "helpfulness": "0/0", "author": "elachinchilla"}, {"rating": 5.0, "review": "I think that All they tell you get,  you get it!good price, good product and great performance its great!", "verified": true, "helpfulness": "0/0", "author": "Alejandro"}, {"rating": 5.0, "review": "excellent product, excellent delivery time, I would re-order. Thanks for such good service/", "verified": true, "helpfulness": "0/0", "author": "joseph genna"}, {"rating": 5.0, "review": "out of all the choices for streaming media devices. this is perfect for me. i am a part of the google ecosystem, and so it was a very inexpensive choice.  it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "ernesto Gonzales"}, {"rating": 4.0, "review": "$35 is all you need... unbelievably easy and Google is still improving it. It's still in beta technically but it's complete enough to enjoy to the fullest.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]