[{"rating": 5.0, "review": "Who can possibly downvote a $35 device that lets you stream the web directly from your phone, no confusing GUI required?", "verified": true, "helpfulness": "0/1", "author": "IVB"}, {"rating": 5.0, "review": "We bought this as a way to use services like Netflix without our PlayStation.Compared to a Playstation:Chromecast is much faster to start up.Chromecast streams videos a little faster and with better quality.Chromecast allows you to preview other shows or episodes on you phone or tablet while the TV is playing a video.With our setup, and everything off, we simply:- connect a smartphone or tablet to our WIFI network- open the desired app like Netflix- select chromecast as the display optionThen, the TV powers itself up and starts on the correct input setting for chromecast.  You just press play!The only down sides that we have found are not with chromecast itself.  Some apps that play through it need some work.  For example, if you are watching a Netflix movie and simply turn the TV off, Netflix tends to show that you finished the movie when you restart the app.  Instead, we must press stop on the app and then power everything off.Overall, this is an inexpensive, simple to install, easy to operate, highly capable device.It is essentially hidden when installed, easy to control from any room that also has the WIFI signal (very helpful with Pandora), and has exceeded our expectations....especially for this price!", "verified": true, "helpfulness": "0/0", "author": "Noel"}, {"rating": 5.0, "review": "Came quickly, was very easy to setup.  I use it for everything streaming, so easy to use, and streams quickly to your tv from your phone or tablet. More apps are being introduced all the time. If you stream movies or shows, thesis the best option.", "verified": true, "helpfulness": "0/0", "author": "geoffrey w germano"}, {"rating": 5.0, "review": "Allows me to put every important app I can think of on my TV pretty easily.  I would recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "I love streaming hbo go and netflix.  Waiting for showtime anytime to become compatible.  It's very easy to setup.  Who needs apple tv?", "verified": true, "helpfulness": "0/0", "author": "kristi wallin"}, {"rating": 5.0, "review": "We have one at home and watch netflix off of it on our TV - it's great.  I gave one to my assistant for her birthday and she loves it too!", "verified": true, "helpfulness": "0/0", "author": "Sandra Deschamps"}, {"rating": 5.0, "review": "I use this almost everyday and I'm hooked. The price is cheap and I ended up buying a few more for family members...they all love it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Kingsbury"}, {"rating": 5.0, "review": "Convenient use on all devices. I have one and bought one for grandma's house so when family or I visit we can watch movies. Plus now you can cast from hulu hbo on demand so even better", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "I guess this is what they mean when they say you should wish for \"Peace on earth\" at Christmas. I got this gadget for my husband, the gadget king, for Christmas. It was easy to set up and sync and now he streams everything to the TV--haven't had more peace in the house in years. He watches YouTube videos, TV shows from Netflix, etc. It's well worth the small expenditure!.", "verified": true, "helpfulness": "0/0", "author": "Long Sam \"writing teacher\""}, {"rating": 4.0, "review": "I already have a Roku that does Netflix, Hulu Plus, Amazon Instant etc etc. I was looking for something to give me some specific web content on my TV. This works great. There's some network delay but thats my network, not the Chromecast. I also like that I can cast from YouTube. I load all of my favorites into a TV Queue and it will play on a loop. Its simple, its cheap and it works as advertised. If you want something more robust, try a roku. If you have a tight budget, I'd say this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Deborah Bentley"}]