[{"rating": 4.0, "review": "This is great for viewing Netflix and YouTube from a phone/tablet/laptop.  I don't use Hulu, so I don't know about it.  I would love for it to support more video providers.  I would especially like for it to support Amazon Instant Video.Note: Your TV needs a USB port for power or you need to have an adapter to plug it in to a power source.  I've heard of a few TVs that will power this through the HDMI port, but that didn't work on the models of TVs I have in my house.", "verified": true, "helpfulness": "0/0", "author": "David Walker"}, {"rating": 5.0, "review": "I was waiting for a friend to get this so I could hear a personal review and now that I have heard one and now own this item, it has not disappointed.  Very easy to install and works great with all my electronics.", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 5.0, "review": "I got this for my mother in law.  I had to play with it first before teaching her how to use it.  Incredibly easy to setup.  Probably the easiest piece of technology I have ever setup period and I'm an IT Professional of over 15 years experience.If you want something simple to stream Netflix without having to hookup your computer with an HDMI cable, this is it.", "verified": true, "helpfulness": "0/0", "author": "Hunter Bonner"}, {"rating": 5.0, "review": "The google chrome cast is one of the big solutions out there , but if u have a smart tv you don't need it . the good thing is the developers are working on adding extra apps to support users .", "verified": true, "helpfulness": "0/0", "author": "waheed"}, {"rating": 4.0, "review": "This little device can stream Netflix, Pandora, Hulu Plus, Youtube, Google Play, etc.  Very worth it.  easy to set up and use. Does lag from time to time.", "verified": true, "helpfulness": "0/0", "author": "Vaughn Landis"}, {"rating": 5.0, "review": "Works great even in bad weather. The picture quality is great too.  Easy to install and a very reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Loraine M. Devany"}, {"rating": 5.0, "review": "This device is amazing.  I am longer just a passive viewer of my TV, now i can easily send all kinds of media that i find one my phone right to my TV.  What Is especially nice is that friends with the chromecast app on their phone can connect to my chromecast and also share youtube videos, songs, etc from their phones to my TV.  It has been a fun experience so far and the number of apps supporting chromecast seems to just keep growing.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "I like it because it's small and portable. It works well with the app on my phone for Netflix and youtube.", "verified": false, "helpfulness": "0/0", "author": "Robert Assile"}, {"rating": 5.0, "review": "This was an excellent purchase. Works from my tablet, smartphone, pc!NO difficulty yo set it up. Definetely Recommmended! Cheers!", "verified": true, "helpfulness": "0/0", "author": "Gabriel Cunha"}, {"rating": 5.0, "review": "Chromecast is what I expected. My only warning would be that if you don't have the horsepower in your laptop, you will be disappointed because it relies on that.", "verified": true, "helpfulness": "0/0", "author": "Patrick L. Blythe \"Big Daddy\""}]