[{"rating": 4.0, "review": "Works well, once you figure out how to use it.  It really could use an instruction book. Netflix makes it worthwhile.", "verified": true, "helpfulness": "0/0", "author": "Kenneth R. Buonanno \"kennrb5\""}, {"rating": 5.0, "review": "Bought this for my living room tv instead of upgrading to smart tv. This little thing is powerful and really fast. As soon as you click movie it litterally starts the movie in 2 seconds..Also for the people who are not sure if it is Hd capable it definetly is...awesome!!", "verified": true, "helpfulness": "0/0", "author": "alexm"}, {"rating": 4.0, "review": "This product definitely fills a hole in the market. Overall, I really do love it. It's a brilliant idea, and it's really good for what I want it for. There are a few updates on the product that I am waiting for however:The product only supports a few video players. Netflix, Hulu, HBO go, but I can't play my amazon prime videos without using the chrome browser extension.The browser extension often makes the videos choppy and slow.The sound and picture sometimes get out of sync.Overall a good product for $35 but I think it's going to be even better in a few years!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "I give it all those stars because it does exactly what it was supposed to do and all I expected, maybe more. If you already have a computer on a network connected to your TV, you probably don't need it, save your $35 for something else. For me it works fine.", "verified": true, "helpfulness": "0/0", "author": "Roy E. McNary"}, {"rating": 5.0, "review": "Seriously,smart functionality in a tv is buggy.  If you have a smart phone this is a perfect replacement or addition to any tv.", "verified": true, "helpfulness": "0/0", "author": "LMS"}, {"rating": 3.0, "review": "Love the Idea, and its easy to set up,  but so few applications can use it..  the desktop view works well unless you are streaming video, then its to choppy to bother, But YouTube movies work Amazingly...", "verified": true, "helpfulness": "0/0", "author": "Kees Keesler \"Kees Keesler\""}, {"rating": 5.0, "review": "Love the fact that wirelessly can link my laptop  to my tv.  I was worried about this  but anything you can access on google chrome can be mirrored on your tv.  There are some really good websites where you can watch in the theater movies on your computer thus on your tv via chromecast.  see my short video  [...]  if you can't access here go to youtube  and type in  pf1950  you'll see my site.Just have to find a way to get chrome on my kindle and my surface rt and I'll be set! ::)  what a bargain for $30 or if you are hyper Best Buy has in store for $35Watch the short video if you want install the Google Chrome Browser effertosly on your kindle--although kindle currently does not support chromecast  so contact kindle[...]", "verified": false, "helpfulness": "0/0", "author": "PAT FALE"}, {"rating": 1.0, "review": "The first try went well. I was able to give it the password for my wireless network, it connected, and I was able to stream hulu programming the rest of the evening.  I turned my tv off for a week. The next week end I tried to use it again.  It would not connect to my wireless network.  I tried three times going through the setup again, but I was not able to get it to connect.  I will be returning the device.Thinking about it. The first thing that the device did after successfully connecting to my network was to download new firmware.  I would guess that the new firmware has a flaw that prevents it from connecting again.", "verified": true, "helpfulness": "0/0", "author": "David M Olien"}, {"rating": 3.0, "review": "It needs more apps. Works great. But so far there are only 8!apps that are comparable. Hopefully there are getting more.", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 4.0, "review": "All I expected it to be except that I was unaware that it had it's own DNS and based on geographic location, could not transfer some laptop info to tv", "verified": true, "helpfulness": "0/0", "author": "George Lyster"}]