[{"rating": 5.0, "review": "After reading some negative reviews I was so afraid that it will be the same for me but I'm glad I bought it. We use a very old laptop running on Vista which is used mainly for streaming videos to our TV. FIrst try for setup with this old laptop failed so we used our iphone 5 and it was a success!! Once setup, we have no problem going back to our old laptop to search for the Chromecast in our network. Now we don't have to be limited to hard HDMI wire connecting to our laptop but use this Chromecast all the time.", "verified": true, "helpfulness": "0/0", "author": "mR2"}, {"rating": 5.0, "review": "Great buy, mostly use just for screen mirroring and Plex which both work perfectly. Runs a little hot, but not a big deal. For $30, an easy buy.", "verified": false, "helpfulness": "0/0", "author": "Debarshi Majumdar"}, {"rating": 5.0, "review": "This thing changed my life. The picture is amazing, and the setup is very simple. I love that you can use it with any device. I can sit at home on my iPad and push my favorite shows onto the tv. If you're having trouble deciding on whether or not to buy this don't even think about it's just do it. For the price it is an amazing deal, and I recommend it to anyone.", "verified": false, "helpfulness": "1/1", "author": "DirtyDan"}, {"rating": 5.0, "review": "Way cheaper than an apple tv and continues to improve with constant updates from google.", "verified": true, "helpfulness": "0/0", "author": "Thomas Freestone"}, {"rating": 5.0, "review": "Amazing!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Mauro R."}, {"rating": 5.0, "review": "No need for cable when you can easily plug this in and have Netflix. Love it! I enjoy the fact that it's not like Roku. I have no plans to buy cable services so why pay for all the extra features on Roku? Chromecast supplies me with what I like. It's very basic, so if you want something with lots of entertainment extras, I'd advise you not to get it.", "verified": true, "helpfulness": "0/1", "author": "ktak"}, {"rating": 5.0, "review": "I bought 3 of these total and can now start streaming in one room and finish in another. I should have done this earlier. My grand kids can watch Thomas and Friends from You Tube all day long.", "verified": true, "helpfulness": "0/0", "author": "A. Mann"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "roberto"}, {"rating": 3.0, "review": "Glitchy", "verified": true, "helpfulness": "1/1", "author": "Marvin Christian Lee"}, {"rating": 5.0, "review": "The cheapest streaming device I bought and the one I use the most", "verified": true, "helpfulness": "0/0", "author": "G. Zastrow"}]