[{"rating": 5.0, "review": "This was one of the best investments that I could have purchased. It's really saving me hundreds dollars. I brought my TV right before the smart tvs. But now this has brought me up to date.", "verified": true, "helpfulness": "0/0", "author": "Paul Mason"}, {"rating": 5.0, "review": "Why is this just in my life right know. Completely awesome. Recommend everyone to buy one. I wish I coyld stream nba games from my phone though.", "verified": true, "helpfulness": "0/0", "author": "Fjölnir Þrastarson"}, {"rating": 2.0, "review": "No where does it say that this is incompatible with Apple products. Then I tried using it with my Android phone and it doesn;t work well with a small screen.", "verified": true, "helpfulness": "1/2", "author": "Roger A. Gindi"}, {"rating": 1.0, "review": "I've been unimpressed with Chromecast.  Originally I bought it thinking that the low cost and portability would be fantastic.  I have found the device to be very glitchy.  It disconnects itself from the network and constantly needs TLC.  It's very slow to operate and keep connected to network.  Use the $35 wisely and invest toward a Roku.", "verified": true, "helpfulness": "0/0", "author": "Chris French"}, {"rating": 5.0, "review": "Right out of the the box this works great. Setup takes seconds, all you have to to do is plug it into power and your tv and use the app from your phone or tablet. It will take the network info from your device and ask what would you like to name it and your done. Any supported app will see it on the network and show a cast button in the app or you can install a Chrome extension and cast web pages (flash of java plugins do not work). Now with SDKs are out there are a lot of different kind apps available. Most of them are video services (YouTube, Netflix, Hulu, etc), music (Google Play Music, Songza, etc) and I have seen a lot of games now too.Only a few downsides and most come from Google's own YouTube support. You can have multiple people connected but if someone connects during a casting video while having a video open on their device it will clear the playlist and stop the playing video. Also you can't have a computer and mobile device connected at the same time, the later one to connect will override what it casting. Once I trained a few people on these issues we didn't have them occur again but shouldn't be necessary.", "verified": true, "helpfulness": "0/0", "author": "Chris Swanson"}, {"rating": 5.0, "review": "Works amazingly, i love the ease of use required for it. I would recomend it to anyone that likes to watch Netflix or listen to Pandora.", "verified": true, "helpfulness": "0/0", "author": "Bobby Timothy Rafeal Jones Hicks"}, {"rating": 5.0, "review": "This is a really solid product. Can't go wrong with this -- it'll turn your retarded TV into a smart TV with very little effort.", "verified": true, "helpfulness": "0/0", "author": "Alkavas Vi"}, {"rating": 3.0, "review": "I like it but if i leave it plugged in i dont get good tv signal.  So unplug it from usb", "verified": true, "helpfulness": "0/0", "author": "Jasbir S."}, {"rating": 4.0, "review": "The Chromecast description pretty much sums up all you need to know about the product's specs and functions. The set up is super quick and easy, every thing was easy to deal with. Good purchasing experience. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Christine S Lin"}, {"rating": 4.0, "review": "Google chromecast is good, but not as good as what I had expected it to be. I'm having difficulty casting from chrome browser of Nexus 10. I'm hoping that Kitkat which is going to be released anytime would solve the problem. Also there are only limited apps to cast from. But the video quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "Stany DSouza"}]