[{"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "Alejandro Romero"}, {"rating": 5.0, "review": "This is easily the best purchase I have made in a very long time. 40 bucks with expedited shipment because I ordered on a Thursday and was too anxious to play with it on Friday instead of Monday. Anyways, I don't understand all the hate, they must either be old reviews or very very stupid people. This device does exactly what I wanted it to do, stream movies from my phone exchange to my 65 inch screen TV...  Flawless picture", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Lots of great entertainment for the price.  You can watch ANYTHING on your TV that you can stream on your computer with the Google Chrome browser.  Easy to set up, too.", "verified": true, "helpfulness": "0/0", "author": "kittychi"}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "A. Skauge \"Bako Man\""}, {"rating": 2.0, "review": "Good size.  I wish there were more apps that it worked with.", "verified": true, "helpfulness": "0/0", "author": "Parker"}, {"rating": 1.0, "review": "Shuts down my entire network, doesn't work properly", "verified": false, "helpfulness": "0/4", "author": "User24x"}, {"rating": 4.0, "review": "It really is a good product, it delivers what it promises.", "verified": false, "helpfulness": "0/0", "author": "luisloreto"}, {"rating": 5.0, "review": "Fantastic game-changer in my house. But first, the one negative issue I've had. It would not set up and connect to my wifi for the first few tries. Googling issues led me down wifi settings and router issues. Ended up the fix was much simpler: I had to keep the default name of the device. Something like \"Chromecast7023.\" I couldn't change it. After keeping the default name, it's never had an issue.I bring it with me when travelling, pairing with a TP-LINK TL-WR702N Wireless N150 Travel Router ($17), to use on hotel internet.I've given two out as gifts to my parents and inlaws. They're not tech savvy by any means and they both love it.The current setup I use is my Chromecast to a receiver and then HDMI out to my TV. All works great. I can keep the TV off and just hear music through the receiver's speakers.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup, works great.", "verified": false, "helpfulness": "0/0", "author": "Arnold Berndt"}, {"rating": 5.0, "review": "This is one of the best innovations in recent years, IMHO.", "verified": true, "helpfulness": "0/0", "author": "kutsokutso \"boiboi\""}]