[{"rating": 1.0, "review": "Connection was inconsistent and slow. Switched to Amazon Fire TV Stick and don't have any issues anymore.", "verified": true, "helpfulness": "0/0", "author": "J. Caravita"}, {"rating": 5.0, "review": "Very simple. I watch most of my Netflix /Hulu /downloads with it. I even got one to leave at the gf's place.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "this has been everything I expected. and then some..", "verified": true, "helpfulness": "0/0", "author": "Bill G. Parker"}, {"rating": 5.0, "review": "Arrived as described!", "verified": true, "helpfulness": "0/1", "author": "Goldfish"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/1", "author": "Nicole"}, {"rating": 5.0, "review": "I don't have a problem with this at all!!", "verified": true, "helpfulness": "0/1", "author": "Mark Antonio Albarran"}, {"rating": 5.0, "review": "I love my new Chromecast, its the best way to wath media in home, Thanks Amazon. great Price and great service.", "verified": true, "helpfulness": "0/0", "author": "Jorge G."}, {"rating": 5.0, "review": "The Chromecast is $35 and offers a great service : streaming media from your phone/tablet to your TV. I had no issues finding my Chromecast on my network, and on my University network as well. The Chromecast pairs well, and offers you to beam YouTube, HBO GO, Netflix, and more to your TV. And while there are other ways to get this content on your TV, the Chromecast is most valuable for those TVs you have that aren't a Smart TV. Just set it to beam content from your phone, and bam - your older TV is now practically as valuable as a smart TV! I have beamed YouTube videos, Netflix, and other video content from my PC seamlessly to my Chromecast. It's just a frustration free way to beam things from your devices to your TV and once you get one, you won't be able to go back! Great price, great features - this is a hit, Google.", "verified": true, "helpfulness": "0/1", "author": "Naz Khan"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/1", "author": "jacrespo"}, {"rating": 5.0, "review": "A really nice idea for me to watch Youtube videos on a large screen device. It works like a charm.", "verified": true, "helpfulness": "0/1", "author": "B. Johnson"}]