[{"rating": 3.0, "review": "Worked on one of two computers for the first few weeks, but with intermittent connectivity. The device would lose its connection to our wireless network periodically, sometimes once every few hours, but at other times several times per hour.About a week ago I think it perfomed a self-upgrade as it went into a reboot cycle on its own. After that, the one computer that it did work with could no longer connect, but the computer that was previously having trouble with it started working. So, at least we have one computer that works with it.The stream quality isn't all that great, as it drops frames more than I'd like. For casting websites and the like, its OK, the lag and dropped frames aren't too bad, but for streaming video from the browser, it's sometimes OK, but sometimes unusable.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "it took a little time to figure out how to install on tv, once installed it worked well, i would recommend to anyone without a smart tv", "verified": true, "helpfulness": "0/0", "author": "Carolyn W Vanderwerf"}, {"rating": 5.0, "review": "I bought this to use with Netflix and Hulu on mobile and laptop, but Hulu doesn't allow casting yet.  Oh well.", "verified": true, "helpfulness": "0/0", "author": "Jacob Mouser"}, {"rating": 5.0, "review": "The content available without serious, ongoing, automatically deducted, frequently changed without noticed and largely arbitrary 'subscription' is next to nothing.  Well, there IS a lot OF it, but practically nothing at all TO it.  The functional receiver sits in a drawer now, thoroughly upstaged by commercial - inundated broadcast television content.", "verified": true, "helpfulness": "0/0", "author": "Michelle Clouthier"}, {"rating": 5.0, "review": "It's the easiest, simplest, best-working TV streaming device.The \"biggest\" problem that I have had with it so far was getting the package open; the second biggest problem was deciding which HDMI port to use. This thing is amazing, it's simple to use (as long as you have WiFi...). I have used it with numerous android devices, and even with a couple iPhone 5S's, and an iPad.There is less support for iOS apps (when I used it with those a few weeks ago it was just Netflix and YouTube, both of which worked great). Using a computer with Chromecast is great, too. Simple. I don't blame the device for limited iOS apps, it's pretty obvious that each ecosystem wants their own stuff to work.", "verified": true, "helpfulness": "0/0", "author": "slackercow"}, {"rating": 5.0, "review": "Well what can I say, These are perfect. I use it with Plex to stream media to my TV in the living room.The only cons are it won't make me breakfast, or go grocery shopping for me.", "verified": true, "helpfulness": "0/0", "author": "bradley strassman"}, {"rating": 5.0, "review": "I'm a technology guy, alot of times I buy cool stuff just for the sake of having it.But the Chromecast goes farther than just something cool - it lets me stream youtube and netflix and other videos/pictures(with AllCast Android app), straight from my mobile devices and even the computer(beta function for entire screen streaming is awesome).The newest cool thing I've found is that the Samsung TV mine is hooked up to sees it as an AnyNet+ device and actually lets the device override the power or channel if you push a video to it... No more fishing or hunting for the TV remote if you want to put it on the right channel for the device - it just turns on and goes to the correct channel as soon as you tell your app to broadcast to the chromecast device. I bought one for my dad as a gift for Christmas and after seeing him enjoy it I immediately went out and bought another for myself... At ~$35 even if you only play with it for a week it's already some good value - and I'll be using mine for much longer than that.", "verified": true, "helpfulness": "0/0", "author": "Darkning"}, {"rating": 5.0, "review": "Works great. I read reviews and saw some people had problems. It installed and works great. I will probably get another.", "verified": true, "helpfulness": "0/0", "author": "Richman \"Richard Marks\""}, {"rating": 2.0, "review": "If you have a dual modem/router, forget it. (That's something you don't learn about BEFORE you buy.)I spent hours reading forums, researching, and pleading for help. This should be simple! Right?And it is not.I had to go back to my reliable HDMI cable that I used, ironically, with my Google Chromebook. <smirk>", "verified": true, "helpfulness": "0/0", "author": "Beth Gray-Robertson"}, {"rating": 5.0, "review": "Now that we have a chromecast for all our TVs, we can cut cable and save a ton of money every month! Love, love, love!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]