[{"rating": 5.0, "review": "When I first seen this advertising on I think the TV I had to have one. With it being so cheap I can now turn my older flat screen TV into a semi smart TV. It gives you 6 applications Netflix and Hulu Plus are the only ones that I actually care about and it has those.", "verified": true, "helpfulness": "0/0", "author": "Michele Winter \"love shopping online\""}, {"rating": 5.0, "review": "Love it!  Inexpensive and allows me to project anything from Chrome onto my TV.  Highly recommended and a great value.", "verified": true, "helpfulness": "0/0", "author": "Craig Allen"}, {"rating": 5.0, "review": "I've always wanted to buy a streaming media player device but the price was always an issue for me since i never got convinced with the high price of devices like apple TV which is restricted to apple devices only and other streaming players which are usually comes with high price. Because of the awesome synchronization of this Chromecast with the chrome internet browser, this device can be converted into a magical tool for mirroring any file (media or pdf) on your TV through opening it via chrome browser. Another cool feature about this chromecast is that it does not require external power through external adapter but instead it gets its power through connecting it into the same HDMI input if you are using the newest TV models which provide a newer HDMI port but don't worry if you are having a middle age TV with any HDMI you can still get your chromecast powered through connecting it to the USB port that usually comes with most TVs and in the worst case scenario  the chromecast device does come with an adapter as part of the package when you buy it and you can connect it to your chrome cast and then connect it to the power supply so you can get connected and enjoy the streaming no matter what TV model you have. Because this device is recently innovated, it is still in its early stages of adoption and therefore only YouTube and NETFLIX can be streamed from your MOBILE (IOS and ANDROID or WINDOWS operating systems mobiles) but there are many like Amazon instant watching and HULU  and HBO are coming on the way to be mobile compatible to steam videos via your mobile BUT this does not mean you can stream through the above mentioned websites if you use desk top or lab top via chrome web browser. YES you can stream any thing from any website as long as you are using chrome browser and so do not MIX between what you can stream via your MOBILE and what you can stream via your DESK TOP or Lab TOP. This device worth every cent and the price is its best feature for me compared to the features it provides. I love it", "verified": true, "helpfulness": "0/0", "author": "Jalal"}, {"rating": 5.0, "review": "This is the perfect replacement for an apple tv or a google play, you can even cast the entire Desktop of your windows computer, and it is just like $35. Great", "verified": true, "helpfulness": "0/0", "author": "CRVoiceCloud"}, {"rating": 2.0, "review": "I bought this for my boat but there was no way to install it without WiFi or the internet. I was hoping to connect my laptop wirelessly, to my TV but it needs the web to work, apparently.", "verified": true, "helpfulness": "0/3", "author": "Blain Anderson \"trails guy\""}, {"rating": 4.0, "review": "Love it - the only problem is that it is not as simple as just plugging in and using. I had to spend 4 1/2 hours on the phone between the internet company, google and directv.", "verified": true, "helpfulness": "0/0", "author": "Irene Moser"}, {"rating": 5.0, "review": "These are so inexpensive if you are looking for a way to enjoy your internet video experience. It's also super convenient to set up and works with any smart phone. It streams hulu flawlessly and we use it a lot to watch youtube videos when friends are over.", "verified": true, "helpfulness": "0/0", "author": "Heidi Schirato"}, {"rating": 4.0, "review": "this is a fantastic device for people with \"dumb\" TVs with HDMI ports.  Works flawlessly with all of my family's devices (iOS and Android).  Would give it a five if it had more application options, but that list is growing as well.  I have a home media server running Plex and it works well if your media is saved in the right format. Not the fault of Chromecast, but annoying none the less.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "I am not super techy. Attached it to my TV, paired with my ipad & I can watch Netflix seamlessly. It would be even better if you could play personal videos & amazon videos on this but I got it for Netflix & it does that just great. Its small, it works & its cheap.", "verified": true, "helpfulness": "0/0", "author": "hoovesofthunder"}, {"rating": 2.0, "review": "1st off i have the google tv from logitech, after years of owning it its one of the worst products ever. This is not exception. its goo for stream youtube, although it does have the occasional glitch. forget using this for anything else but youtube streaming its simply too buggy.", "verified": true, "helpfulness": "0/3", "author": "paulo amaral"}]