[{"rating": 3.0, "review": "slower to use on Netflix than the  Roku it replaces.  hard to read movie tittles on smaller screens than my Roku, I have to get up very close to the tv to read.  many features I don't care about. I think I will go back to roku.", "verified": true, "helpfulness": "0/2", "author": "R  Denham"}, {"rating": 1.0, "review": "I was really excited when I heard about the amazon fire TV. Installation was easy. Controller is cool. Only problem is....THE TV SEEMED TO GET IN TOUCH WITH ALIEN LIFE FORMS!!! NOW THE ALIENS ARE IN MY HOUSE AND CONDUCTING STRANGE DOINGS ON ME AND MY PIG!! I'm sorry but I simply don't have time for this and value my pig.", "verified": false, "helpfulness": "2/6", "author": "The1and0nly"}, {"rating": 5.0, "review": "Amazon Fire TV has opened up another level in watching TV/Movies.  I am not a Tech oriented person. Never could set the time on my VCR.  Amazon is so easy to install. Instructions are very simple to follow.  From the time the package was opened until the time I started watching my first movie was about 20 minutes.If I could install this without problems imagine how quick someone with a little tech knowledge can install it! I have never had a problem with buffering since I have a ultra high speed internet through Bright House Cable. I also have whole house DVR, which was asked by one reviewer, it is not effected by Amazon Fire since it uses another HDMI outlet on the TV.My only negative comment would have to be the way \"Prime\" shows are listed. At first I thought I had to pay to shows like \"Broadwalk Empire\".  It was not until I scrolled over to the \"More ways to watch\" that I discovered this was included in Prime.  Hunting for movies that are covered under Prime is hit and miss.  Going further, Amazon should fix this before adding more content.Overall, I am quite please with this purchase. If you are on the fence about buying this - Do It! I don't think you will disappointment.", "verified": true, "helpfulness": "3/3", "author": "Bonnie Adams"}, {"rating": 5.0, "review": "My whole family likes Fire TV. Sony made a lot of promises with its internet player (based on google tv), We had the Sony for a year with no improvements or none of the promised updates.... plus the Sony player's case stayed hot enough to make me worry. Thus came my purchase of Amazon Fire TV... The Sony is now packed in a shoebox on the top shelf in our walk-in closet. -bye-Blunt and short, You will not be disappointed with fire tv's video streaming quality... No long spill here just something you have to see for yourself. Everyone that cannot see the difference between appletv and roku or the other spinoffs quit complaining and go back to using them or upgrade your internet connect and take advantage of it... I got a 34mbps connect and I am VERY impressed with fire tv's streaming quality. If you are buffering spend some money with your ISP!! 1mbps downstreams expecting to see HD quality??? hehehe!!!**Edit**As brought to my attention below. Some people are not able to get 5 - 10mbps downstream from their provider. Just be fair in your review. Don't blame the fire tv if your internet connect is too slow :) Thanks Charles for reminding me of that.**End Edit**Compared to the Sony internet player, fire tv and it's case is barely lukewarm nothing to worry about.Yes the paid rentals and free content is mixed together at present *BUT* if parental controls are enabled nothing can be \"accidentally\" be purchased as I have read in previous customer reviews. Use your head setting it up!!Voice search is spot on... I have a insufferable \"southern drawl\" I cannot use voice anything with apple. android or windows phone.... Amazons voice search works for me... Very, Very and I repeat VERY pleasant surprise.... I look forward to cross platform searching between other streaming apps such as netflix that amazon has said is coming..People are comparing fire tv with 3rd gen releases roku 3 etc. Folks this is a first gen product @ 2nd month release, give it a chance to mature. Plenty of people bitched about the 1st gen release of roku.... GIVE IT A BREAK!!! At least most of the issues with fire tv are fixable with firmware updates and they will come.... Amazon has too much money and hype built around it to let fire tv fail.I did not order game controllers with my purchase. My bad too.... However I have 2 on order and will update this review with gaming impressions when I get them in the mail.....Any questions of LEGIT video streaming from supported services I will be happy to answer... thats what I bought fire tv for... That is what fire tv is designed to do, not play hacked downloaded versions of movies off the web or self ripped content off blueray or dvd....To be continued when my game controllers ship in....", "verified": true, "helpfulness": "1/2", "author": "Charles Brown"}, {"rating": 5.0, "review": "I got this for my birthday and it is great.  I have watched some series that I wanted to see but never to around to and also some movies.  I am an Amazon Prime customer which is great with the Amazon Fire TV.  I also have Netflix which I also use to watch programs and movies.", "verified": true, "helpfulness": "0/0", "author": "Peg"}, {"rating": 5.0, "review": "Wow, what greatness out of a little solid-state piece of technology. It operates flawlessly like a mature, well tested, reliable product should.  Just a few more rate hikes from my satellite TV provider coupled with a never-ending barrage of annoying (sometime embarrassing) commercials from the local and national programmers and say goodbye to me folks.Amazon Fire TV offers all the high-value, commercial free content in beautiful HD format on demand. As an Amazon Prime member, my wife and I can now immerse ourselves in quality TV watching without renting, buying or subscribing to anything! No commercials, no volume spikes, just a wonderful steady stream of our favorite show or movie.Thank you Amazon for enhancing our HD television watching experience to what it should have been all along! Keep those great products coming… …now who can help me overcome my Asphalt 8 addiction?", "verified": true, "helpfulness": "1/1", "author": "Jan Ophof"}, {"rating": 4.0, "review": "Right now, I have a bedroom setup which consists of a desktop computer and an HDTV. When I want to watch Amazon Prime or Netflix, I usually sit at my desk to choose a show/movie, and then either watch from there or from my bed. Are there any advantages from a computer to using Fire TV?From reading some other reviews, the only advantages I've gathered are -Possibly better video quality from using the Fire.Voice searchThe ability to use a remote from the bedAm I missing anything here?thx", "verified": false, "helpfulness": "0/2", "author": "Refreshing Lime \"Refreshing Lime\""}, {"rating": 3.0, "review": "Worked flawlessly out of the box while setting it up.  The one big issue I have is that some times while watching shows on Hulu the show pauses and then you hear sound but the picture is frozen.  You have to go out and come back and resume your show.  My internet connection is FIOS 50 MBPs download, so its not the connection.  I've tried both wireless and hard wired, same result.  I have three of these boxes, and even if only one is being watched it will freeze.  Hoping they put out an upgrade to the firmware to correct the issue.", "verified": true, "helpfulness": "0/0", "author": "Mickdog319 \"EMinVA\""}, {"rating": 3.0, "review": "The Fire is awesome and I love having Netflix included on it... My only issue is the remote, when you press any of the buttons there is annoying clicking sound, and if my wife is asleep, I am clicking to find a show or rewind etc, the darn clicking is so loud it wakes her... Seriously! None of my other remotes make this noise, why would you want to make a soft small stealthy remote, that clicks loud enough to bother someone???", "verified": true, "helpfulness": "0/1", "author": "BicycleSourceUS"}, {"rating": 5.0, "review": "i just love this product it's very easy to hook up it's streams quickly without an issue. easiest way to watch movies i also enjoy the voice search. just wish i could stream comcast or xfinity..", "verified": true, "helpfulness": "0/0", "author": "lisa m rodriguez"}]