[{"rating": 4.0, "review": "Excellent streaming and quality of picture when used with Netflix and Yahoo videos.It does not work as well with other videos. The streaming of the video is slow thus encountering a number of frequent pauses throughout the video. There is also a picture delay while the audio is continuously running.Overall, it is a good investment if you enjoy netflix and yahoo videos.", "verified": true, "helpfulness": "0/0", "author": "C. Nguyen \"cgn\""}, {"rating": 5.0, "review": "The Google Chromecast is fantastic.  Now I can watch movies on the big screen at no cost to me.  Amazon Prime is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Charles Looper"}, {"rating": 5.0, "review": "This thing is awesome and simple to use. I read the reviews that gave it a poor score due to its low versatility, so going in I knew to expect it to only transmit Netflix and YouTube. With that being said, those are the only applications I need it for anyway, so for $35 you can't beat this deal.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "Cheap and easy way to add streaming video and music to your TV, but I wish the screen-mirroring feature worked better. Sometime the picture freezes and I have to restart it, but then again, this feature is still beta.", "verified": true, "helpfulness": "0/0", "author": "Michael Doustani \"Michael\""}, {"rating": 4.0, "review": "Got one for every tv in my house. Great product especially if you have youtube kids. You must buy one!", "verified": true, "helpfulness": "0/0", "author": "warren"}, {"rating": 5.0, "review": "As advertised... It does it's job while these were gifts for my kids, they use it and take away the boredom of broadcast TV...or should I say the TV we pay too much for with more commercials than ever that we never had in early cable days...Geez. That's why we paid for cable ..anyone remember that?", "verified": true, "helpfulness": "0/0", "author": "knuckle47"}, {"rating": 4.0, "review": "I had to try several different ports on my tv before I could find the one that worked--not easy, since the tv was wall mounted, but once I got it in, everything was simple, and it works like a charm.", "verified": true, "helpfulness": "0/0", "author": "keenb"}, {"rating": 5.0, "review": "First of all the item is a great device if you're always streaming and watching things on YouTube. Easy way to to view in HD on your TV.", "verified": true, "helpfulness": "0/0", "author": "Nuruddin Zahed"}, {"rating": 4.0, "review": "Works great with Netflix, however casting a screen is somewhat unreliable - cutting off unexpectedly. It's absolutely worth the money and I'm looking forward to seeing what Google does to improve it.", "verified": true, "helpfulness": "0/0", "author": "cbradenf"}, {"rating": 4.0, "review": "It allows me to do what I want so I'm very pleased, but the limited number of channels available is a small turn off.", "verified": true, "helpfulness": "0/0", "author": "Joe Smith"}]