[{"rating": 5.0, "review": "Upgrading from a year of using Google ChromeCast I have nothing but praise for Fire TV.  Setup - very easy. Picture quality - sweet.I just have one minor/major criticism.  Parental Lock.  There is no way, short of blindfolding, to keep my kids from seeing the code I choose.", "verified": true, "helpfulness": "0/0", "author": "M.Scott Drummond"}, {"rating": 5.0, "review": "Great gadget...not quirky like my old GoogleTv.", "verified": true, "helpfulness": "0/0", "author": "Linda D."}, {"rating": 5.0, "review": "Much more than I expected. Very easy to install and use. With Amazon Prime and Netflex we hardly watch Dish at all except for news.I think it's a very good value.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "I never knew Prime had that many movies and TV shows available.  I did however need to get a more powerful router, but that helped all of our devices.", "verified": true, "helpfulness": "0/0", "author": "R. Valentine \"Love to Read\""}, {"rating": 4.0, "review": "I like the fire tv, although i have a google tv, i feel the fire tv is faster to navigate. Games play very well on the fire tv. On my google tv games dont play as well. Im looking forward to more apps and games on my fire tv in 2015.", "verified": true, "helpfulness": "0/0", "author": "Edwin"}, {"rating": 4.0, "review": "I was in the understanding that all the movies were part of the subscription", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Wow the voice search works really well. It is also quick and easy to search through available programs.  This was a great family Christmas present", "verified": true, "helpfulness": "0/0", "author": "Alana Bell-Dittrich"}, {"rating": 5.0, "review": "Does everything I wanted it to. Plex works great on it.", "verified": true, "helpfulness": "0/0", "author": "Seth Black"}, {"rating": 5.0, "review": "Everything I ever wanted. I just wish that free Amazon prime came with it or at least 3 months free of Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Amazing"}, {"rating": 5.0, "review": "Easy to use, great picture quality, lots of good content, especially with my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Savannah Wagner"}]