[{"rating": 4.0, "review": "Easy to set up and use, but there are so few apps (mainly Netflix and YouTube) it currently is not that useful.  With more available apps it would easily be four or five stars, especially at this price.  Would be nice to view Prime movies over this device.*** tried the chrome browser extension to view prime videos. Picture and sound ok using flash as recommended.", "verified": true, "helpfulness": "0/0", "author": "Sun Devil \"Sundevil\""}, {"rating": 4.0, "review": "Works great to stream stuff from my Android Phone to my tv. I have a bunch of devices for watching web and other content on my tv so I am not going to say this is the one I leave plugged in, but it works great!I would say the one thing that I would want to note is it gets really hot so not sure if that will affect the longevity of it or not. I also can't wait until support for more things are added. When I used it sending any tab from chrome to it didn't work, but I am sure it is in there now.For the price and getting Netflix credit it is well worth getting.", "verified": true, "helpfulness": "0/0", "author": "Nathan Bowhay"}, {"rating": 5.0, "review": "I ordered the Chromecast figuring no matter what, it's just $35 and it can be used on a spare tv to watch Netflix and the occasional Youtube video.... No harm, no foul. Wow. I love this little thing. I have a dedicated Mac Mini with Plex installed to stream video around the house to various tv's, ipads, roku's,and other devices and i love that, but the Chromecast does it's very limited job so well that it is, overall, a joy to use.I use it for youtube videos more than anything else. i send a video and keep searching for other things to watch and then add them to the queue. Maybe I'll throw up a couple of internet shows i subsrcibe to and a few user reviews as well, maybe a new music video from vevo... in no time i have a custom show for me to watch while i do other things... nice. it's simple and i find that the video streams better with less buffering issues than with anything else i've used. I've had this little dohickey for about a week and have been using it non-stop (something i didn't expect). you control the Chromecast with which ever device you sent the video (ios device, android, pc). it would be nice if i could seamlessly switch devices and still control the queue. currently the device that dealt it smelt it...... or something like that.at the end of the day this little thing costs $35 has the potential of being greater that it currently is. If true, Vimeo, HBOGo, Hulu are actively working on making their services work with the Chromecast, this thing could be a game changer. you can buy three of these for a little more than an Apple TV of Roku. Very impressed. Very cheap way to make a dumb tv a little smarter.", "verified": true, "helpfulness": "0/0", "author": "L. Mateo"}, {"rating": 5.0, "review": "I received my ChromeCast a couple of days ago and finally set it up! After a minor (perhaps major to some) hiccup, everything is working as advertized! First, that hiccup was no ability to connect with the Internet. That was probably mostly my fault for not recalling the correct Password for my router. I used the Guest connection and that one requires a browser to open but, of course, there is no browser on ChromeCast. Since, I really wanted a new Router anyway, I purchased another and it immediately connected as planned. I even get more speed in the process!ChromeCast is an excellent way to view video content from the Internet. I used NetFlix, Amazon Prime and was also able to view other content via the Chrome Browser.Just remember, this is for viewing content FROM the Internet, not from your PC or Tablet. Basically, your local device of choice provides the directions to ChromeCast for finding the content. From then on your local device is out of the picture, unless you want to stop or pause the content.I have two TVs and will purchase another ChromeCast, rather than switch between TVs. At an affordable price of $35 that is certainly the best way to handle multiple TVs. But, you can still control the ChromeCast from any of your devices.I used my laptop, smartphone and tablet and all worked just fine.", "verified": true, "helpfulness": "0/0", "author": "Roger \"RogerATM\""}, {"rating": 5.0, "review": "This is an awesome invention for an even more awesome price. As soon as it got out I ordered it figuring that for the price it was worth to try even if it ended up being something we didn't use much. Turns out we love it and use it a lot!We can see any video we play on the Chrome browser directly on our tv. It also streams video from Netflix and YouTube.The only problem is that apparently you can't cast from Chrome on a Samsung tablet, at least not yet, so we have to cast from our PC which is an adjoining room and we have to get up to the computer if we need to pause or rewind or anything. Netflix and YouTube can be cast from the tablet no problem. This can be a bit uncomfortable but still better than crowding around the computer monitor.I recommend getting it in addition to a Roku or Apple TV or other streaming apparatus. We have a Roku and prefer to use that for Netflix and Amazon Prime, it's better video resolution plus it's more convenient having the remote to control the video.However, there are plenty of videos you can't get on a streaming device like the US Open tennis we were able to stream entirely from their site. It's a wonderful little device, highly recommended. For the price there's no excuse for not getting one.", "verified": true, "helpfulness": "0/0", "author": "Meno"}, {"rating": 3.0, "review": "I ordered this because it said it supports video play from googles Chrome browser. What they failed to say was that it works only with a chrome browser from a PC, Mac or Laptop. It doesn't support video playback In chrome for IPads,IPhones or Android phones as of yet. So while the simplicity of using Netflix and youtube from your phone to a tv is great, easy and seem less, I cannot give a 5 Starr rating until more apps are supported, especially a browser.", "verified": true, "helpfulness": "0/0", "author": "Luke W LaSavage"}, {"rating": 5.0, "review": "I was debating whether to give this 4 or 5 stars, but in the end, I decided that it really is a groundbreaking product that is worth of the top rating, despite having so much more to offer.  Now I say groundbreaking, because up to this point, no other streaming device was so small or so cheap, so this really allows streaming to come to the masses.  I've used streaming video for years now, mostly on my xbox or blu-ray player, but this device lets me easily and aesthetically bring Netflix, etc. to our bedroom TV, where we don't have a bunch of set top boxes connected.As to improvements I would like to see... (1) better Wi-Fi reception. I live in a 3 level townhome, with the wireless router in the middle level.  The Chromecast does not work well on the 1st level, and sometimes has connection issues on the 3rd.  Other devices, like my wireless blu-ray player, do not have reception issues, so I think this is an area of improvement.  (2) More content. I would like to see HBO Go and other streaming services available, as opposed to pretty much just Netflix and Youtube.If Netflix is your go to service, then this is a must have product.  All in all, a great step in bringing easy streaming to every house and every TV.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 2.0, "review": "I'm using ipad2 and iPhone 5. You tube app got frozen and unresponsive after switching to another video. Also lost connection and unresponsive all the time. My Sony blueray play better YouTube.Chrome from PC didn't work with sites other than YouTube.Too much troubles and return after 2 days. I used roku, WD, Seagate media players and all did better than this and they are more than 2-3 yrs old.This product is not ready yet or may be only ready with androids devices as my wife's nexus 4 works well with it.", "verified": true, "helpfulness": "0/0", "author": "M. S."}, {"rating": 5.0, "review": "I picked up one through the google playstore and then managed to pick up another through best buy. This little device is awesome.  Connects quickly and easily to my TV and syncs perfectly with my Asus Tablet, Iphone and Galaxy S3.  I primarily use it to cast Netflix, and Youtube for now and the quality is near perfect.  I know that most likely they will add more third party apps to this, but it definitely does what it's advertised to do.  I also like the fact that I can cast from my laptop, my chrome browser which is an extra added bonus.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Dont suport casting from may Chrome browser on may phone and i nott open for 3 part prog.I am disipoynted ():) I exspekt it to cast from may phone in genneral like Apels", "verified": true, "helpfulness": "1/7", "author": "Yngvar Jahr"}]