[{"rating": 3.0, "review": "Setting it up initially was easy, but the second time turns out to be much harder if you're using a different wireless access point. Also, it doesn't stream local content on its own very well, but there are other programs that work with this hardware and will do it better.", "verified": true, "helpfulness": "0/1", "author": "Carolyn Anhalt"}, {"rating": 1.0, "review": "It stopped working after a week and cannot be reinstalled or restarted ! Poor build quality if you ask me !", "verified": true, "helpfulness": "0/0", "author": "Dr.Rajesh Jayakumar"}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "Wojciech Hetel"}, {"rating": 5.0, "review": "Best of Google", "verified": true, "helpfulness": "0/0", "author": "Aurelian Constantinescu"}, {"rating": 5.0, "review": "Exactly what I needed!  Shipped immediately.  No complaints what-so-ever!", "verified": false, "helpfulness": "0/0", "author": "Michael Wexler"}, {"rating": 4.0, "review": "While the software side of the chrome cast is fantastic, When i tried to remove it from my tv in my living room to the one in my bedroom the hdmi connector separated from the plastic part of the dongle its apparently not very well attached inside. I contacted google support and they sent a replacement in the mail. The process couldn't be easier for warranty claims I was only on the phone for seven minutes.My Advice: Regardless if you think you need it attach the chrome cast to the hdmi extender cable it comes bundled with and if you need to relocate like i did just remove the cable from the tv.", "verified": true, "helpfulness": "0/0", "author": "Truger"}, {"rating": 5.0, "review": "Easily connects your devices to your tv and streams very clearly. Easy to use and set up. Full function of device while streaming does not drain battery or interupt device use. Overall best quality option out there and can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "tasha"}, {"rating": 5.0, "review": "when you go to sign in and use it, there's a little triangle at the upper right-hand corner.  Click it and you can broadcast the current page you're on and when you type and use word processing, etc, it will broadcast onto the TV.This has worked so much better than I thought possible.  I'm a home educator and I can use this instead of using a chalkboard and type what I want to teach.  If my student wants to show what their working on, they can also do so, while I sign off for a few minutes and then go back and forth.This is a must-have for the classroom for the school day and for after to chill out with movies and fun.With a wireless keyboard and mouse, you can be up to 20 feet away from the TV and be totally chillin on the couch and surf.This is definitely worth the small price.  All you need is a USB plug to power the chromecast and an HDMI port on your TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very easy connection as long as there's some internet connection. I bought it for PowerPoint presentations with my mobile devices. I just wish it would not depend fully on WiFi but work like the SanDisk for places where there is no WiFi. Maybe I am the one who hasn't experimented enough. Small gadget but very powerful.", "verified": true, "helpfulness": "0/0", "author": "Lloyd Makamure"}, {"rating": 4.0, "review": "I would have rated the item a five but, seeing as the mirroring feature is developing as of yet that feature is not available for my s3. In every other aspect it works well. If you're a big netflix or YouTube user than you will get your money worth. The one thing that I loved is being able to use my phone means I don't have to hear my annoying fan on the Xbox.", "verified": true, "helpfulness": "0/0", "author": "willman3005"}]