[{"rating": 5.0, "review": "Love using chrome cast to watch Netflix, hulu and hbogo on my tv. Easy to set up and connect to.  Works on any tv with usb port.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Great product for streaming anything from your phone to the tv.", "verified": true, "helpfulness": "0/0", "author": "Lucas Bochman"}, {"rating": 5.0, "review": "Easy and simple", "verified": true, "helpfulness": "0/0", "author": "Guillermo Menes"}, {"rating": 3.0, "review": "Don't love it but it works.", "verified": true, "helpfulness": "0/0", "author": "LarryMc"}, {"rating": 5.0, "review": "Best small thing ever setup in 5 minutes do the job easy  stream movies without getting stuck, it mean your can navigate and watch your favorite movie... Loving it, I can stream movies from my phone iPad and tablet happy CUSTUMER", "verified": true, "helpfulness": "0/0", "author": "diana"}, {"rating": 5.0, "review": "Awesome little player for my TV needs!  YouTube, Netflix and Kodi are all I use on the Chromecast and couldn't be any happier!  You can also mirror your smartphone (I have an S4) onto the big screen and works in portrait and landscape depending on how you hold your phone.  Kodi does not have a chromecast icon so, to get around it, I just mirrored it from my phone to the TV and works fine, although the sound appears to be lagging which does not bother me.  I have two of these devices and love it!", "verified": true, "helpfulness": "0/0", "author": "physical therapist"}, {"rating": 2.0, "review": "This doesn't always work. Kind of aggravating.", "verified": true, "helpfulness": "0/0", "author": "Kelle Jones"}, {"rating": 4.0, "review": "Works great for streaming movies off of my computer onto a tv in another room. I like that I can stream anything off of my computer including movies on the internet. It doesn't have a interface like some of the other devices such as Amazon Tv Stick but is the best streaming device for specifically streaming from internet browser itself.", "verified": true, "helpfulness": "1/1", "author": "fireman9iner"}, {"rating": 5.0, "review": "Great little gadget. I love that I can now cast from my Chrome browser to my TV!Probably not the device for your grandparents, or even parents though.", "verified": true, "helpfulness": "0/0", "author": "KarooGuy"}, {"rating": 1.0, "review": "Chromecast is not easy to install. Then it messed up my cable TV so that I couldn't use it without calling Comcast for help. Two wasted days.", "verified": true, "helpfulness": "0/1", "author": "Cynthia Allison"}]