[{"rating": 5.0, "review": "Installation for this item was a breeze.  Within 8 minutes it was up and running.  We haven't secured any outside service provider (NetFlix, etc.) because we've found so many wonderful FREE shows to watch.  We're really enjoying this service and would recommend it to anyone considering it.", "verified": true, "helpfulness": "0/0", "author": "Anna Fair"}, {"rating": 5.0, "review": "I love my Amazon Fire TV device. I've had it for almost a month now. I definitely think I could have spent less cash by buying the TV stick because I don't think I will make use of all of the space and the games that my device offers me, but it does what it is supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Tomiko"}, {"rating": 2.0, "review": "It is very fast and looks nice! I like the interface which is very intuitive. I wish it had a few more apps such as Xfinity comcast app, Spotify, and other streaming apps. I am hoping to not have to buy cable box for my house since I have Xfinity in my other house. Otherwise I'd fire tv doesn't get Xfinity comcast, I will have to continue connecting my laptop.Or maybe I could do it through an internet app?", "verified": true, "helpfulness": "0/1", "author": "Movie Lover"}, {"rating": 5.0, "review": "Love it...", "verified": true, "helpfulness": "0/0", "author": "Robert Murphy"}, {"rating": 5.0, "review": "Love the voice search. Way faster than Apple TV using HULU.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 3.0, "review": "1/14/2015I have had the Fire TV box for about a month.  Amazon has missed the mark with this device.  There is so much more they could do, but they haven't.  In order to fully utilize the Fire TV as a media player, you must root the device.The evils of Amazon:  Amazon has gone so far as to blow an e-fuse in the chip if you try to root the device.  There are methods, but you must be careful.  Instead of allowing customers to tweak their devices, Amazon has asserted ownership over the device and that is just wrong!What you CAN do, out of the box.Games:You can play a VERY limited subset of games because most games are not \"compatible\" with Fire TV.  Fire OS is based off Android, and Android development (games and other programs) make the assumption that you have a touch-screen device.  With a Fire TV, you do not have a touch screen device.  Clicking \"select\" in most cases in these third-party apps doesn't work because it expects a touch-screen input.  You can use a gaming controller for the few games that support it, and it's really cool.  It's amazing how much can run on so little hardware (compared to a real gaming console).Programs:Again, a VERY limited subset of other programs will run on Fire TV.  Without root access though, there aren't many you need anyway.  Media offerings such as Netflix do work and work well.Voice search (and search in general):It searches Amazon content, not Netflix or other streaming services you may use.  This is unfortunately part of the \"Amazon wants to sell you stuff\" mentality behind the device.  They want you to have Prime, they want you to also pay for many of their streaming programs as most of the things I want to watch are not \"free with prime\".Limited storage space on device:It has 8 gigs, with a little over 5 gig available for programs.  When you consider that Grand Theft Auto San Andreas requires well over a gig itself in extra files just to run, you can see how this can become a problem.  There is no sdcard slot, so \"move to SD\" functionality is gone.  You cannot add storage to the device without root access.Why root is almost a requirement:1.  The USB port cannot see external storage.  This is the utmost in \"deal breakers\" and here is why.  I watch a lot of recorded shows on my Fire TV, using Kodi (formerly XBMC).  I don't stream to the device, I keep the files local, on a usb drive.  To see the USB drive, you have to use stickmount, which requires root.  You also are going to need to move some of the programs to external storage due to the lack of an sdcard.  This will require either Folder Move or Link2SD (or both).  Neither works without root.2.  No Google Play.  Amazon won't let you return apps at all.  Google Play gives you a very brief window to try paid apps and return if you don't like them.  For games, this is a requirement for me.  There is no way to determine if I like a game without playing it.  Also, there is a program that allows you to tell the Play Store that you're running a different device so you can download items that are not listed as compatible with AFTV.  Of course, this does not mean they will work, but you can at least try them.Closing:What really, really, really bugs me about this device is that people have already found the answers to these issues.  Amazon just needs to include them.  Simply adding support for storage on the USB port and allowing the app2sd method to move programs to the USB drive would clear up the majority of the issues with this device.  Amazon's Fire Phone was a flop, and even at the incredibly reduced pricing, a lot of people aren't buying it because Amazon locked down the device to the point that you can either use it \"Amazon's way\" or not at all.  They tried to \"innovate\" by adding their \"toys\" but REMOVING other features that users have come to expect.  They took the Apple approach of \"we know best\" and \"do it our way\".", "verified": false, "helpfulness": "1/2", "author": "Mike Snow"}, {"rating": 5.0, "review": "It so easy even my boyfriend can use it!", "verified": true, "helpfulness": "0/0", "author": "Joyce Terceira"}, {"rating": 5.0, "review": "Love Love Love!!!  I don't even watch regular TV anymore", "verified": true, "helpfulness": "0/0", "author": "Christina R. Zeravica \"Christina\""}, {"rating": 5.0, "review": "I bought this item for a spare tv that we use in our office.  I have been a user of Roku (2) and LG SmartTV apps so I was a little nervous to try something new (Especially with the complaints of Prime being hard to use).Overall this is a well made product that works very quickly.  I love the feature where you can play your images from Amazon Cloud as a screensaver.  Prime movies are easy to use (and find) and load quickly.  The voice command works well (though it takes time to get use to it because its more stream-lined than a smart phone.An inconvenience but not a huge one is that Netflix, Hulu, Crackle, PBS Kids are no apps that you have to scan down to the app section of the menu.  Only takes about 5 seconds but is still something to get use to.My only complaint is that the Amazon Basic Batteries that they give you with this are junk.  With light use they died in about 3 days.  I know this is probably a fluke, new batteries are pretty cheap and easy to install.", "verified": true, "helpfulness": "1/1", "author": "SMRoz"}, {"rating": 5.0, "review": "Easy to use and fast connection to TV.", "verified": true, "helpfulness": "0/0", "author": "adoracion cortes"}]