[{"rating": 5.0, "review": "and I was bringing my apple tv from the living room to the bedroom-and in my luggage when I travel...  but now I can leave the apple TV in the living room and tote my Chromecase around with me.  Really great device!  Turns an older non internet tv in an updated device.  Please ask me questions- I love this device!", "verified": true, "helpfulness": "0/0", "author": "KaDe"}, {"rating": 5.0, "review": "My family loves this, we use it all the time to show each other stuff from the web. We cast just about anything you can think of onto the screen. We use all of our iDevices and they work great you just have to use a google app to cast. We also use our laptops with chrome, which is the browser we use anyway, and cast anything from the web to the TV.", "verified": true, "helpfulness": "0/0", "author": "Macgyuver"}, {"rating": 5.0, "review": "Great device. Can't wait for more aps to be available for chromecast. Yes I would recommend this item.Thank you very much.", "verified": true, "helpfulness": "0/0", "author": "bambino"}, {"rating": 5.0, "review": "I really like my Chromecast and ordered another after a week of getting the 1st one.Pros: easy setup; renting movies, watching YouTube videos through Google Play is very easy; able to cast Chrome browser; play back quality is excellent after a short buffer.Cons: limited applications that support Chromecast but hope this is temporary.", "verified": true, "helpfulness": "0/0", "author": "rickp3131"}, {"rating": 5.0, "review": "Plug-in to TV, download the cast extension for Google chrome browser and watch/view your chrome browser content on your TV (only PC or MAC; does not work on your smart phone) You can watch Netflix and You Tube as well (all devices).", "verified": true, "helpfulness": "0/0", "author": "Murali Padmanaban"}, {"rating": 1.0, "review": "Disconnects all the time,how can I return it.No good for mi.!!!!!!!!!I want my money back.!!!!!!!!Jesús crist omg i", "verified": true, "helpfulness": "1/5", "author": "Efrain De la cruz"}, {"rating": 5.0, "review": "Neat device which allows cord cutters to access even more television programming without cable. Easy set up and works well...the nice thing is that it doesn't appear to \"tattle\" on you by letting services like Hulu know that you are viewing content on your television rather than your computer.", "verified": true, "helpfulness": "0/0", "author": "Otto Deydacht"}, {"rating": 5.0, "review": "This is a great products. It works better with my WIFI than my Roku. BUT, the Chromecast need more enabled apps. First the Chromecast needs Amazon instant Video app to be enable. The Chrome browser on smart phones and iPads need to have the chromecast button. I love the price of this piece of hardware.", "verified": true, "helpfulness": "0/0", "author": "Troy Bunten"}, {"rating": 4.0, "review": "Delivers what it promises.Few applications. I hope soon to be increased.The time it takes to load videos.Overall presents cost-effective.", "verified": true, "helpfulness": "0/0", "author": "Antonio Fortes"}, {"rating": 5.0, "review": "Great product... Did exactly what I wanted it to do and at a fair price. I wish it powered it self from the hdmi port.", "verified": true, "helpfulness": "0/0", "author": "Enos S."}]