[{"rating": 2.0, "review": "If you're looking for gaming put your $100 dollars towards something else. The choices are limited and the storage space is even smaller. Low storage heats up quite often. Grab a Wii U, it does the same thing in its Amazon Instant Video App. Could also get the same out of any streaming device. I returned in less than a week, game controller is built awkwardly and has no option for rechargeable batteries. Be careful the remote will sync to your kindle if not paying attention and good luck fixing that. Also no compatibility with older Kindle's and no amazon music or shopping support, but as far as the streaming, not consistent hd, quality not great all the time and overall nothing a wifi enabled blu ray player won't do. PASS", "verified": false, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Thought an Amazon branded product would live up to its name.  This one obviously did not.  First of all, you can't use the voice commands within any apps except for Amazon Prime where you are quickly prompted to purchase videos you already have access to with your Netflix account, which by the way is installed onto this device by default.  Say goodbye to using this device as depicted in the commercials and hello to D-padding letters again!  Next, almost every night after leaving this thing powered on, whatever app you are last using no longer works.  When selecting the app again to use it you are quickly welcomed by a black screen of nothingness.  Don't worry though, a quick reboot will fix this....by the way there is no power switch on the remote so you are forced to get up and unplug the device!  Good thinking on this one Amazon!  Bought this as a mother's day gift but it only gets her frustrated!  No way am I even considering Amazon's new phone after this!  Too bad it's too late to return this, I thought I'd give it a chance beyond the 30 day return policy only to be further disappointed.", "verified": true, "helpfulness": "4/6", "author": "Tyler"}, {"rating": 3.0, "review": "The Amazon Fire TV is a great idea that feels rushed to market.  It is a truly compelling and differentiated product in a increasing crowded space.  It has ample power to handle high resolution video and plenty of gaming; which is not some thing I really care about, but some might. And while the Amazon App Store doesn't have a great deal to offer, it's a start and will get better.The Pros:- The design: Clean and simple.  They took a very \"Apple\" approach to the design of their set top box.  With the included batteries (Amazon Basic, of course) and power cable, all you need is an HDMI cable and you are up and running.- The Remote: I was not sure if this was an item that belonged in the pros or cons section at first (due to the excessive number of button), but the voice command really did differentiate this product.- Amazon Prime: This is a truly great service, and sadly many of my friends/co-worker know nothing about it. We all pay for Netflix too, but with Amazon Prime, you really don't need to.Cons:- The Operating System: I'm sure this entirely subjective, but when I compare the Fire TV OS/interface (Android) with my AppleTV (iOS) it simply isn't even in the same ballpark.  The Fire TV feels more raw and unfinished.  Perhaps even Beta.  I like to watch Bloomberg TV and that app crashes nearly every time I attempt to watch \"Live TV.\"  The functionality of ESPN and Netflix is not nearly as clean either.  The only app that I have found that looks as it should is the Amazon Prime app (shocker?).- Price: It's rather expensive when compared to other offerings in this space (Apple, Roku, Google, etc.), but it does have superior internal hardware.  This superior hardware is largely in place to support the gaming functionality that is offered through the App Store.  The system doesn't include the requisite controller for the games, that will cost you and additional $40.Conclusion: Amazon has a great first effort on their hands, and I hope that they are continuing to develop this product from the inside.  They have the second best ecosystem available and it will only get better; however, I can't recommend that you purchase the Fire TV as it sits today.", "verified": true, "helpfulness": "1/1", "author": "A. Hayse \"Book Maven\""}, {"rating": 5.0, "review": "I have owned a Roku a Chromecast and now the Amaon Fire TV. Without question the Fire TV is the best of the three. The speed of navigation is great, the bluetooth ability for the remote and game controller is a big plus, the interface is perfect and the added bonus of Amazon apps and games is a big bonus.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to use, contains everything I need.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 5.0, "review": "I really love the Amazon Fire TV.  It was a replacement for an older Sony Streamer I had.  The Fire Tv is so much easier to use.  You just have to talk into it to get what you are searching for.  Saves a lot of time.  I bought this in May and it is now almost the end of July. Recently, we have had trouble with some of the videos not loading.  We are getting an error message which says to retry.  The videos are Prime videos.  I never had this problem before and I'm not sure that iti has anything to do with the Fire TV.  We use our Prime Video service a lot more than we used to and now with the new Prime music that is now available to Prime users we save a lot of money.", "verified": true, "helpfulness": "0/0", "author": "MizKatz"}, {"rating": 5.0, "review": "I love my amazon Fire ......", "verified": true, "helpfulness": "0/1", "author": "Chris Chasey \"movie\""}, {"rating": 5.0, "review": "Absolutely the best streaming box on the market. I have tried them all (and still own them) but the Fire TV is my favorite. Why?1) The UI is awesome. It shows 'recently viewed media' so very quick to resume what you were watching.2) The HDX integration is awesome, esp as second screen.3) The speech interface is super simple to find stuff. Wish it worked for everything not just amazon instant videoOver time i will replace all the other streaming boxes through my house with the Fire TV.Well done amazon.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"cellman27\""}, {"rating": 4.0, "review": "I love this little thing. It is a little pricey up front, but once you get it, it is worth it.all your shows in one place. I had netflix, but did the math and prime is cheaperover a year  and has almost the same shows and movies, plus the addedbonus of the free shipping, books and now music. Games are great. The onlything I would change, would be to separate the prime movies and shows fromthe ones you have to pay to view. Really that is a Amazon Prime thing and nota fire tv. WiFi signal is great, and My Hulu has stopped freezing as much as it was.I have only had it 2 months, so we will see how long it lasts!", "verified": true, "helpfulness": "0/1", "author": "Rhonda Bolt"}, {"rating": 5.0, "review": "Love this little unit a lot better then buy the Apple TV.,", "verified": true, "helpfulness": "0/1", "author": "Jose' R. Arvelo \"jrarvelo\""}]