[{"rating": 4.0, "review": "Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Silvia Gondo"}, {"rating": 5.0, "review": "Excellent device.  Awesome to use", "verified": true, "helpfulness": "0/0", "author": "robert rose"}, {"rating": 5.0, "review": "Received one as a gift. We liked it so much that we bought a second one. Watch Espn, YouTube, ETC. can be easily thrown from you mobile device or PC.", "verified": true, "helpfulness": "0/0", "author": "JD in BTR"}, {"rating": 5.0, "review": "Love my Chromecast", "verified": true, "helpfulness": "0/0", "author": "Lee Allen"}, {"rating": 5.0, "review": "Product works great..I got it to play power season 1 on my tv..i downloaded starz play app...and it works perfectly on my TV. .ty", "verified": true, "helpfulness": "0/0", "author": "Talia"}, {"rating": 4.0, "review": "Very simple and works. I tried the amazon fire stick and this is much better. I got the fire stick for the living room cause I thought it be easy for everyone to use because it had a remote. It lags and goes back to the home screen instead of playing videos. Also I payed for prime and figured I'd get it for the instant video. Big mistake.This works straight from the phone and I have one in the bedroom and living room. No lag. No complications. Just play from your phone and it goes right to the TV no issues. Just won't do amazon video. Although I didn't find much that amazon had more than Netflix that I wanted to watch.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Fer"}, {"rating": 5.0, "review": "It gets better with every update and with every app update that uses it. I own multiple of these around my house and use them on a steady basis.", "verified": true, "helpfulness": "0/0", "author": "Flyerwire"}, {"rating": 5.0, "review": "Available points made this purchase easy.  Chromecast is the way my son's family views TV and I decided to cut costs and try it too.", "verified": true, "helpfulness": "0/0", "author": "DONA"}, {"rating": 5.0, "review": "I travel for work and this has been a lifesaver! Since most hotels have newer tvs it works every place I stay! And I can stream right off of my phone!", "verified": true, "helpfulness": "1/1", "author": "jill crosby"}]