[{"rating": 1.0, "review": "Do you want to install every app that is on your Roku or FireTV on your cell phone? If so, this is the device for you. No remove, and no apps. Anything you do, you must do from another device. Wanna watch newsey? Download that to your iphone, because that is the only way you are going to see it.", "verified": true, "helpfulness": "0/1", "author": "Chuck Baker"}, {"rating": 5.0, "review": "It's super super quality item I ever had. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Hassan"}, {"rating": 5.0, "review": "Love this you can project you phone screen directly on to your big screen wirelessly great product forget buying apple tv or roku this is where its at", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "A must have for traveling.  I stream everything from content to photos right from my phone.", "verified": false, "helpfulness": "0/0", "author": "Chase"}, {"rating": 5.0, "review": "It works great but really didnt find much use to it.Think about what you'll use it for before you it, or it will probably end up on the bottom of your drawer like mine did.The software still need improvements though (but last time I used was in mid 2014, don't know if there have significant improvements since then)", "verified": true, "helpfulness": "0/0", "author": "Alison"}, {"rating": 5.0, "review": "grandson loves it", "verified": true, "helpfulness": "0/0", "author": "judith forristal"}, {"rating": 5.0, "review": "Great nifty little tool. So simple you dont need to read the instructions.", "verified": true, "helpfulness": "0/0", "author": "H"}, {"rating": 5.0, "review": "Thank you seller amazon for making it available at reasonable cost. I am using it everyday and feel good about my purchase.", "verified": true, "helpfulness": "0/0", "author": "kapil bhatnagar"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Zero"}, {"rating": 2.0, "review": "Not enough instruction, too difficult to understand how to use correctly, very disappointing.", "verified": true, "helpfulness": "0/0", "author": "P. Lamoureux"}]