[{"rating": 2.0, "review": "Good when it works, but gives an error on many days. Simply not good enough.", "verified": false, "helpfulness": "0/1", "author": "silver lake"}, {"rating": 5.0, "review": "I was surprised by the snappy response the Fire TV has. I was aware of the beefier hardware specifications vs. other streamers. But it was noticeably faster. Streaming starts almost immediately. It seems faster than Apple TV and Roku. Installation was effortless. I love the simple remote.", "verified": true, "helpfulness": "1/1", "author": "atrox13"}, {"rating": 5.0, "review": "Fire TV delivers exactly what it claims. Great user interface, fast processor and very easy to set up. Most of the top apps are available and having access to my Prime Music Playlists ROCKS. I have a Roku 3 as well and in my opinion the Fire TV is a far better product.", "verified": true, "helpfulness": "1/1", "author": "Alan B."}, {"rating": 3.0, "review": "Box seems to work fine just expected more stuff free with prime membership. Just another way to ask for more monthly subscriptions.", "verified": true, "helpfulness": "1/1", "author": "Matthew Stegall"}, {"rating": 5.0, "review": "It is slick, fast, and simple enough for my 82 Y husband to operate.", "verified": true, "helpfulness": "1/1", "author": "nanp"}, {"rating": 4.0, "review": "It's a good little box, if it would let me install an internet browser it would be 5 star. Nice sleek,smooth and snappy interface a pretty good selection of apps (though a lot of them are ports of crappy apps on the google play store) but other than that its very nice.", "verified": true, "helpfulness": "0/0", "author": "G.mas"}, {"rating": 4.0, "review": "It's great.i like picking my time at my convenience.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy quick good value", "verified": true, "helpfulness": "0/1", "author": "Aldo C."}, {"rating": 4.0, "review": "Solved the problem I was having with Amazon Instant Video app on my Sony TV and Sony Playstation 3.  They would not receive HD picture and Digital sound.  It was one or the other.  With the Fire TV I get both all the time.  I tend to think Amazon was throttling the streams to non-Fire TV devices to push customers to purchase a Fire TV.  Nonetheless, I like the device.", "verified": true, "helpfulness": "0/0", "author": "MRT \"Mel\""}, {"rating": 5.0, "review": "It was fairly easy to install.  It upgrades my upstairs tv to a smart tv.", "verified": false, "helpfulness": "0/0", "author": "Clarence954"}]