[{"rating": 1.0, "review": "Does not work with Amazon Prime video. Amazon blocks the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Scott A. Finley"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/2", "author": "NICOLAS DOTTA"}, {"rating": 1.0, "review": "You cannot use you own video files", "verified": true, "helpfulness": "0/1", "author": "Tony"}, {"rating": 1.0, "review": "Not compatible with amazon instant video.  returning and cancelling amazon prime everything. Lameand no I'm not buying a stupid fire stick.", "verified": false, "helpfulness": "0/2", "author": "H Winter \"HankW\""}, {"rating": 1.0, "review": "This is probably the worst of the streaming video products.I have owned a roku for a long time, bought my father in law a Amazon fire that works great and decided to get a chromecast for my other room because it was cheaper. Mistake.The problem is that it doesn't have any actual apps. It uses the apps from your phone, tablet or the web browser. So you're at the mercy of those apps.An example is WatchESPN. It has been documented this app is terrible for the iPhone/iPad and it constantly freezes.Another issue is that since it doesn't have apps it's self is that instead of streaming directly, the wifi signal must go from the router to your phone and then to the chromecast where others cutout the middleman of the phone.Oh yeah, and for some reason, this is a Beta version and there is no other. If you know about testing gadgets beta is normally only release to a select few users to work out the bugs. Why they released a beta version is beyond me.I'll be returning this for a Roku or Fire Stick", "verified": false, "helpfulness": "0/0", "author": "Rogan"}, {"rating": 5.0, "review": "Great gadget", "verified": true, "helpfulness": "0/1", "author": "Claudio Posada"}, {"rating": 3.0, "review": "Not impressed with the single band. It drops the signal too much. I like the Chrome browser cast feature though. Easy mirroring, when it doesn't drop the signal. The app is not impressive for it however.", "verified": false, "helpfulness": "0/0", "author": "G.I. \"G-Man\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "se4short \"Sheri Edwards\""}, {"rating": 3.0, "review": "It's kinda cool for what it does.More networks need to jump on board and offer Chromecast support.Lots of apps let you watch their network shows on a portable device, very few offer Chromecast support.", "verified": false, "helpfulness": "0/0", "author": "Kirk W"}, {"rating": 5.0, "review": "I'm very pleased with this product.  This is coming from a person who is an Apple Fanboy.  I wanted a device for my bedroom to stream HBO, Netflix and PLEX but didn't want to spend another $99.00 for an Apple TV.  Setting up this device is very easy.  I don't have a USB port on my TV and I didn't want to plug it into a power outlet.  I used a USB port on my cable box to power the Chromecast.  Once I powered up the device, the rest of the setup was simple.  I used my iPad to connect to the SSID that the Chromecast broadcasts, connected it to my wireless network and then I was ready to stream!  I have yet to have a problem with it.  You can't beat the price of this device either.  I would suggest buying it from Amazon because it's cheaper than what you can find in the stores plus it comes with free shipping.", "verified": true, "helpfulness": "2/2", "author": "BAMF"}]