[{"rating": 5.0, "review": "I dont even watch cable anymore", "verified": false, "helpfulness": "0/0", "author": "Starla"}, {"rating": 2.0, "review": "I'm hugely disappointed with the Google Chrome and ChromeCast application! I use a Google (Samsung) Nexus 10 tablet and a Samsung Galaxy S 4 phone - on BOTH devices I use the YouTube application to cast videos to my TV. Half the time the ChromeCast application cannot find the physical ChromeCast device even though I am standing less than 5 feet away from it and my wireless signal is at full bars (close to 100%). When I finally do make a connection and try to cast a YouTube video it will work sometimes, but mostly (about 80% of the time) it will fail with a Brain Freeze error and then I have to reset everything to get it working again...! I have changed out the physical ChromeCast device with 2 other devices yet I still get the same error. Very DISAPPOINTED!!!", "verified": true, "helpfulness": "0/0", "author": "Cameron Ninham"}, {"rating": 4.0, "review": "The only reason i bought it is for screen cast. It works but its buggy.", "verified": true, "helpfulness": "0/0", "author": "Jayce A. Brinkman"}, {"rating": 3.0, "review": "Be aware that there aren't as many apps as you might think that work for this thing. I bought it to teach a photography class and wanted to show a simple slide show each week and had a fun time trying to figure out how. Some of the apps it says work with it I simply could not get to work (such as Google +). Love when Google's own stuff won't play nice together. Hoping they work on fixing that, but for now, Avia seems to do the trick.", "verified": true, "helpfulness": "1/1", "author": "R. Young"}, {"rating": 1.0, "review": "not available at the price quoted.  Cancelled sale", "verified": false, "helpfulness": "0/1", "author": "F. Lassname"}, {"rating": 2.0, "review": "For some reason can't seem to get this to work.  When setting up, it suggested making some changes to my WIFI.  I really don't want to mess with my WIFI.  My attitude when buying these things is that if it doesn't work plug and play, I don't want to spend all kinds of time trying to figure it out.  Will try experimenting a little more, but if I can't get it to work properly will most likely send it back.", "verified": true, "helpfulness": "0/0", "author": "jtw2011 \"Joe\""}, {"rating": 2.0, "review": "It disconfigure after I used with a Samsung Tablet 10\", I dont recomended this product", "verified": true, "helpfulness": "0/0", "author": "Armando Loreto"}, {"rating": 4.0, "review": "Good product, just needs a few more streaming apps (better full desktop mirroring) and it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Matthew Quarisa"}, {"rating": 5.0, "review": "thanks shipping was done correctly, I recommend smoothly.", "verified": false, "helpfulness": "0/0", "author": "Marco Torres"}, {"rating": 5.0, "review": "Best device for TV ever", "verified": true, "helpfulness": "0/0", "author": "Foreman"}]