[{"rating": 4.0, "review": "love the way it works, but would be nice if I could watch more than netflix.  I  don't have cable in my bedroom and would love to be able to have some more options.", "verified": true, "helpfulness": "0/0", "author": "anna kitzis"}, {"rating": 5.0, "review": "Love Chromecast. Simple, easy setup. Have been streaming movies from Netflix. Excellent HD . Netflix and Chromecast great together. This little stick helps break cable cord and high costs.", "verified": true, "helpfulness": "0/0", "author": "sugarray"}, {"rating": 3.0, "review": "I can now stream movies from IPad to Projector without running wires through the walls. And Why pay $200 for wireless HDMI when we have this. Clarity is not as good as it can be. But it does the work.", "verified": true, "helpfulness": "0/0", "author": "Sandeep"}, {"rating": 4.0, "review": "Chrome cast is excellent for YouTube and Netflix if you don't have an smart tv in this days. However tab sync it's too slow and impossible to cast videos from tabs", "verified": true, "helpfulness": "0/0", "author": "PedroBolivar"}, {"rating": 5.0, "review": "Easy to install and set up. Works great with our laptop and my galaxy s3. Streams netflix perfectly. Easier and faster to use this from my cell phone than it is for me to turn on my blueray and open the app.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "This is a great bargain for cable cord cutters, and more features added every quarter.I use it for Netflix, YouTube any anything I can stream on my desktop I can port to this dongle . Even merged my iTunes music to Google music manager and all my music is there too.", "verified": false, "helpfulness": "0/0", "author": "J. Bro \"JB\""}, {"rating": 4.0, "review": "Ordering from Amazon was easy, the shipping was good and price was reasonable. Overall the Chromecast works good. Every now and then it buffers but that seems to be due to high internet usage issues. Very happy with the purchase.", "verified": true, "helpfulness": "0/1", "author": "S. Mills"}, {"rating": 5.0, "review": "Nice to be able to view all the documentaries on YouTube on my TV. Even nicer if more apps supported Chromecast, but that should follow.Setup was so simple, it was almost hard. Really, just plug it in.", "verified": true, "helpfulness": "0/0", "author": "John C. Turner"}, {"rating": 5.0, "review": "This thing is perfect for a variety of functions. Was surprised how easy it works for demonstrations in a conference room.  Use it as a media player or simply move a chrome tab to your tv... I love it...", "verified": true, "helpfulness": "0/0", "author": "itsjustme"}, {"rating": 5.0, "review": "Use it all the time with visitors and find it easy to use once installed.  Installation was initially problematic, but it was my TV!", "verified": true, "helpfulness": "0/0", "author": "Mark David London \"Mark\""}]