[{"rating": 5.0, "review": "I was apprehensive about this product when I first got it to test for 30 days from Amazon.  It was so simple to hook up, I think we were watching our first \"Paw Patrol\" episode in under 10 minutes!  The voice search worked at first, but then within a few weeks stopped so I was sent a replacement.  It works perfectly!  I primarily use it for netflix, Hulu Plus, and Amazon Prime.  My son found a racing game he enjoys too.  He is 3.5 and can run the remote perfectly!  Just make sure you set up parental controls or you may end up owning episodes of their favorite show you didn't plan on yet!  My only dislike is that for shows we own (and movies) I have to enter the passcode every single time before we can enjoy a show since the controls are on.  I would much rather him be able to watch anything that is free or we own without having to enter the code!  Otherwise, I would definitely recommend this!  It is fast going to the app you want, and watching your show.  From the time you turn on to the time you got into your show would be under a minute, and that is including your internet to connect.", "verified": true, "helpfulness": "0/0", "author": "kskatie"}, {"rating": 3.0, "review": "Not digging the interface. It was bought for my kids but the kids mode is really feature limited. I know the whole point of kids mode is to provide boundaries, but they are a little too restrictive and one of the biggest sellers, the voice search, does not even function in kid mode. The only other option though is to allow them full access... and I really don't like the idea of my kid getting bored with cartoons and switching over to Sons of Anarchy, you know?", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 4.0, "review": "I wanted a Roku alternative without going the Apple or Google route and I think this is a nice compromise.  The voice search works really well and is a huge plus.  Something about Amazon's streaming rentals clicks with me in a way iTunes never did.", "verified": true, "helpfulness": "0/0", "author": "Mr. Dunkles"}, {"rating": 5.0, "review": "There are so many features, Mirror to TV function is wonderful, speed of the operating system is super intuitive and quick.  Screen saver is beautiful.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Peter Su"}, {"rating": 3.0, "review": "My internet runs very slow and I keep getting interpreted with the service and can't watch all of my TV shows.  I even bought a Wi-Fi Extender, which helped but not that much (Still making payments on it!!)  After I gave up and ordered DISH, they informed me I could get faster internet for $10 more per month!!  I really liked the Amazon Fire TV, but it not working right, it just didn't measure up, but that was due to my internet connection!!", "verified": true, "helpfulness": "0/1", "author": "Marian Corrigan"}, {"rating": 4.0, "review": "I connected my Fire TV to my home theater system.  I can use it wirelessly but found that being hard wired is better for me.  I can stream to my TV with sound via TV speakers or use the digital optical sound through my home theater which is awesome.  4 stars because I don't get that excited about streaming media and somewhat limited prime video although I have never tried netflix.", "verified": true, "helpfulness": "0/0", "author": "WebER"}, {"rating": 5.0, "review": "This is awesome", "verified": true, "helpfulness": "0/0", "author": "LKH"}, {"rating": 4.0, "review": "This is the PERFECT companion for your prime membership as it has Prime Video and Music. It runs smoothly without any hiccups and the UI is simple and easy to use. The performance of the Fire TV is great and I generally prefer using it over my Apple TV/Roku 3/ChromeCast. Only real annoyance I have is that the watchlist is not organized in a grid fashion and instead, I have to scroll through everything (side scrolling). Another annoyance I have is the inability to mirror my phone/computer like my Apple TV. Other than that, It is a great media streaming device that is competitive in its market.", "verified": true, "helpfulness": "0/0", "author": "matthew"}, {"rating": 5.0, "review": "The product performs as promised. It would be nice to usb connectivity for a hard drive though, so that another box is not required for the purpose.", "verified": true, "helpfulness": "1/1", "author": "Dev Toprani"}, {"rating": 5.0, "review": "I love it, kills apple tv and the remote is far more responsive and easier to hold as opposed to apple tv's. the system itself is more responsive then apple tv's as its much faster. the speech? dead accurate. best amazon purchase ever.", "verified": true, "helpfulness": "0/0", "author": "Musical"}]