[{"rating": 4.0, "review": "It's slow and takes forever to load.", "verified": true, "helpfulness": "0/0", "author": "yestfl"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Sultan"}, {"rating": 1.0, "review": "I went through 3 chromecast. They suck. All 3 of them broke!!! I will never buy another. I never moved them ,I left them in the TV and they still quit working so I pull them out of TV and they fell apart!!", "verified": false, "helpfulness": "0/1", "author": "shaniqua"}, {"rating": 5.0, "review": "A must have for your smart TV! You can watch so many things from your smart phone to your TV, ie YouTube!", "verified": true, "helpfulness": "0/0", "author": "Eric Michael"}, {"rating": 5.0, "review": "This was, by far, the best investment I've ever made!  I don't have cable, so I often use the internet to get any video content to play.  This saved me from having to run a cable from my computer to my TV/DVD player.  It's customizable so you can have your own pictures as the screen saver, setup is fast and easy, and streaming is basically seamless as long as you have a good internet connection.  What made me happiest was that, if I was working and watching a movie at the same time, I can have one tab of my internet browser streaming video content and the rest of my computer is free to use other programs or other internet tabs without sending that information to the television screen; it doesn't mirror everything on your screen, just what you tell it to.  You can also download apps to your smart phone or tablet and stream from them to your chromecast.  I highly recommend this product... for about $30 it's fantastically convenient!", "verified": true, "helpfulness": "0/1", "author": "Lady Amalthea"}, {"rating": 1.0, "review": "Try as I might, I could not get this product to work.  Very frustrating.  I returned it and bought a ROKU unit.  That installed easily and works really well.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "I'ved used it (along with LocalCast) to stream movies from my cellphone (Z1 Compact) and tablet (Nexus 7 2013) to my lcd tv and it is really good. One time I streamed from online and got cutoff from my internet because my cellphone decided it's time to turn on airplane mode, I dunno how but Chromecast was still able to stream it (though I can't control the video anymore)", "verified": true, "helpfulness": "0/0", "author": "ormoreno"}, {"rating": 5.0, "review": "I love Chromecast and this item works as expected.", "verified": true, "helpfulness": "0/0", "author": "Dee \"Debs\""}, {"rating": 5.0, "review": "Better than paying the cable company with their overpriced service.", "verified": true, "helpfulness": "0/0", "author": "Susan J. Lafer \"the lazy day cook\""}, {"rating": 5.0, "review": "I love it.  It is so easy and quick to set up.  Actually it takes longer downloading app than setting up on my TV.  I love it so much i bought another one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Kyong S. Fair"}]