[{"rating": 4.0, "review": "When I first plug it in it squeals like a stuck pig so I unplug it and plug it in again and it works fine. I am enjoying the variety but I do not get a lot of time to watch it due to the holiday season.", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer \"Ali\""}, {"rating": 5.0, "review": "Fantastic. This made using Amazon for movies and TV shows easy. Compact and easy to connect.", "verified": true, "helpfulness": "3/3", "author": "Hummingbird"}, {"rating": 5.0, "review": "Great deal, love it.", "verified": true, "helpfulness": "1/4", "author": "Amazon CustomerPCAT"}, {"rating": 5.0, "review": "Amazing.  Got rid of my Matricom box because of this!!!", "verified": true, "helpfulness": "1/4", "author": "Michael F Backes"}, {"rating": 3.0, "review": "This works OK. I don't love it. It will disconnect and say network issues. We are then forced to disconnect power to it to reset it and get it to work.", "verified": true, "helpfulness": "2/5", "author": "Jeremy & Amanda"}, {"rating": 4.0, "review": "Love it I have to learn it as I have more time to invest", "verified": true, "helpfulness": "1/2", "author": "Joe"}, {"rating": 5.0, "review": "Use it to watch Netflix, Amazon instant video and now Plex! It really is a great device for the money (especially if you get the $20 off when it's on a deal)! Only downside I had was it couldn't be controlled via IR... had to upgrade to harmony one remote.", "verified": true, "helpfulness": "1/2", "author": "Chris M."}, {"rating": 4.0, "review": "I love the product, but im disappointed with the fact that so many of the tv shows and movies you have to pay for. Netflix has most of the shows for free. Not to mention a lot of the apps i can get on my kindel i cant get on this. But other than that the fire tv is great.", "verified": true, "helpfulness": "1/5", "author": "Tralo29"}, {"rating": 4.0, "review": "Great product. Dual band wifi is better than most streaming media boxes I have tested. Good Interface.Only negative is the lack of some of more popular apps. i think It would be an absolute knockout product if they added xbmc or spmc to the amazon store instead of having to sideload it. Keep in mind SPMC is on amazon store but you still have to sideload it to firetv. Remote feels great. Great design but it does consume batteries fast. Not sure why. Almost twice as fast as most other media box remotes i have tried. Also, no USB port for external storage.Overall, a winner from Amazon in my opinion.", "verified": true, "helpfulness": "2/4", "author": "zach"}, {"rating": 5.0, "review": "Perfect and FAST", "verified": true, "helpfulness": "2/4", "author": "Kayla Lowry"}]