[{"rating": 5.0, "review": "This works very well on any of the numerous sites that support it. Unfortunately Amazon Instant Video has taken the decision to snub the Chromecast which doesn't reflect very well on Amazon. I assume they just want to sell their Fire TV box, but instead I will probably let my Prime member ship lapse especially with the forthcoming price increase.The Chromecast is great because it sits behind the TV out of sight. It gets its power from the TV (USB port) and so it doesn't consume any power when the TV is off. It is easy to control from my iPad or my PC so that I can multitask. Great tool.", "verified": true, "helpfulness": "0/0", "author": "CGT"}, {"rating": 1.0, "review": "Just didn't like how it worked.", "verified": true, "helpfulness": "0/1", "author": "JoeG"}, {"rating": 5.0, "review": "I have no problems with this item works great", "verified": true, "helpfulness": "0/0", "author": "jorge barcia"}, {"rating": 3.0, "review": "Bought this specifically to work with HBO Go.  It doesn't work.  Too much buffering makes shows unwatchable.  Works with everything else so maybe the problem is with HBO Go.", "verified": true, "helpfulness": "0/0", "author": "L. Bartnik"}, {"rating": 5.0, "review": "Works great and I never have any problems.  At this price it makes sense to buy one for each room.", "verified": true, "helpfulness": "0/0", "author": "Joe L."}, {"rating": 5.0, "review": "Its so many good things I could say about this device. I'll just keep it simple. BUY IT TODAY. You might need two. All you need is the right apps and you can say \"bye, bye cable\". I bought this in February and I've saved over $600 so far this year on cable.", "verified": true, "helpfulness": "0/0", "author": "erik jenkins"}, {"rating": 4.0, "review": "Interesting... but it should be really cool as soon as Google figures out how to make this mirror my device (Samsung Galaxy S4) screen instead of just streaming online content to my TV.", "verified": true, "helpfulness": "0/0", "author": "John Stockett"}, {"rating": 5.0, "review": "Great for streaming movies and tv shows! I would recommend it to those who like to watch movies with the family since it is easy to use and makes it easy to stream Netflix, youtube, and other services! If you want to stream local content all you have to do is use programs like Plex which allows you to upload local movies and play it straight to your Chromecast which is useful if you have family videos and such!", "verified": true, "helpfulness": "0/0", "author": "Aamil Ali"}, {"rating": 5.0, "review": "I love this thing. It works so easy.  I stream movies from my phone or tablet in a matter of seconds. The setup is very easy just follow the steps on the screen.", "verified": true, "helpfulness": "0/0", "author": "Angelo"}, {"rating": 5.0, "review": "Quick and easy to set up. Streams 1080p. I mainly bought this for Crunchyroll, YouTube, and Netflix only and it works like a charm. It's like turning your normal TV to a smart TV (I do have a smart TV but it does not support the app that I want and Chrome Cast does). 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Rex D."}]