[{"rating": 2.0, "review": "Couldn't connect to the bone-stock version of what is probably the most-popular Android phone right now (this is needed for setup, unless a laptop is used).  Using a laptop (and Chromebook), I was able to connect to the unit, but I never could connect to my network, rendering the thing useless.Canned replies from customer service were useless and inaccurate.FWIW - My technical expertise: probably >95th percentile.Sending it back.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So I don't have a smart TV and gave this a try and I have to say it's absolutely awesome. It comes ridiculously plug-and-play (just need to install Chromecast app on device) and sets up in a couple minutes without any effort.Once installed, all of the compatible apps (Pandora, Netlix, Hulu, Youtube, etc, etc) have a \"cast\" option appear which basically pulls up whatever you're looking onto your TV. From then on it displays on your TV and you have control over it through your phone (play, pause, rewind, skip, volume, etc). Very fluid, though there's a very slight delay.When using apps like Youtube, you can pull up multiple videos and you have the option to Queue them with what's currently playing, and chromecast will continue to play them in that order.Audio and video quality is top notch, though you may get mixed results depending on what you're streaming (obviously poor quality video will not come out well).One thing to clarify is that this works off your wireless connection, NOT bluetooth or anything else. That means you need to have a wireless router for this. There is no direct connection between chromecast and your phone. You send a signal to the interwebs, chromecast picks it up through your wireless router, and then basically pulls it up by itself independently. If your phone dies, turns off, etc chromecast will continue to run. Theoretically you could control chromecast from anywhere (not necessarily near the chromecast device), though I haven't tested this.The downside of this however is that it's not a direct link in that you can't just display your phone's screen and for example, can't pull up a website. The upside is that you can start a youtube video (or something else) and then go browse the internet or play a game on your phone without disrupting chromecast.Better than having a smart TV since this can be seamlessly controller with your phone. New compatible apps are constantly popping up for this.As a side note, the Avia app (free download on the play store, but has a $3 add-on) can let you display photos/videos on your phone through chromecast, which is very convenient.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 4.0, "review": "Works nicely with the one app I have tried it with (YouTube) on iPad with no trouble. I am looking forward to more chromcast aware iPad apps like Vimeo, and a working chromcast extension for the iPad chrome browser. YouTube does look great on the big screen... Much better than I had thought it would.", "verified": true, "helpfulness": "0/0", "author": "steved"}, {"rating": 5.0, "review": "I love this little tool.  I can plug it into any television in my house and watch anything that will come through on cable.  I'm pleased with the selection of apps that come with it, and I hope to see Google continue to add more.  I have an HBO subscription, so theChromecast enables me to watch movies on the TVs that aren't hooked up to cable boxes.  I would highly recommend this little tool to anyone.  I was also able to get the Google cast extension so I can view my MacBook Pro (with Chrome browser) on any TVs, as well.  While Chromecast doesn't come with Amazon prime (I hope to see this in the future), the extension lets me watch movies through prime via my Mac.  Excellent $30 investment.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Pyrch"}, {"rating": 2.0, "review": "The Chromecast is not at all what it purported, might be fine once Google lives up to its promises.  I want to be able to control it from my smart phone, not have to open up the lap top every time I want to use it.  It is fine if all you want to do is stream You Tube.  Save your money until Google gets this figured out.  In the meantime, suggest you use your Roku.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer \"Ann\""}, {"rating": 5.0, "review": "Google has done it again with a another amazing product! This makes it so easy to watch Netflix on my TV without having to hook a device, like a Xbox or computer! This item definitely tops all those types of devices that do the same thing!", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 1.0, "review": "As much a I tried, this would not work on my Toshiba Flatscreen.  When I could get it to stream Netflix, I had no pause, rewind, fast forward or stop control of it.  I returned it and will not buy another.  I'll stay with my Smart DVD player to get the apps.", "verified": true, "helpfulness": "1/1", "author": "Ken"}, {"rating": 4.0, "review": "You can't send just anything to the tv. It has to be an app that lets you Chromecast. Which is not the impression that you get from their marketing. Still it's cheap enough that I'm keeping it. I do like it...I just wish it did more.", "verified": true, "helpfulness": "0/0", "author": "msaumell"}, {"rating": 5.0, "review": "Adds additional versatility to your television. Now I can stream movies wirelessly from my Ipod/Android device. Easy installation and hookup. If you want to add more features without adding wires to your television network this is the device to get.", "verified": true, "helpfulness": "0/0", "author": "Edsel6"}, {"rating": 1.0, "review": "For me,  Chromecast has never worked more than a couple of times before it gets confused, necessitating a couple of hours uninstalling, reinstalling, clearing data, clearing cash, Rebooting Chromecast device, Rebooting Router, and setting Chromecast up again (or some combination of the above).To top it all off Google's support is worthless - my support request has been passed from one person to the next and no one ever digs into the problem to identify the problem cause, let alone provide a solution.  Their only solutions after a month and a half is try another replacement (tried one already and it didn't work) or contact my Router mfg to see if they can help (seems to me that would be google's job as their the experts sic).Neither Amazon or Google is willing to refund my money so I'm just going to write it off as a damn poor purchase and Spend a little more to get a streaming device that works.Guess U get what U pay for.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"BGD\""}]