[{"rating": 5.0, "review": "I find myself using this more and more, as the app space expands.It was  breeze to setup and configure.  And the price is right.", "verified": true, "helpfulness": "0/1", "author": "Jeff Flowers"}, {"rating": 2.0, "review": "this thing just acts like a gateway between 2 devices.  sounds great in theory but didn't well in the real world for me.  it was super laggy  and just didnt do enough on its own to warrant the purchase. I return it the next day.", "verified": true, "helpfulness": "0/0", "author": "S. Whitaker \"superman1979\""}, {"rating": 5.0, "review": "does what it says on the tin and great for streaming online content through your laptop. Works bang easy with my mac and chrome too", "verified": true, "helpfulness": "0/1", "author": "Mez"}, {"rating": 4.0, "review": "Works great for Netflix and YouTube,  not so good for tabs and screen sharing...  I like it anyways but would love if it worked better for screen sharing", "verified": true, "helpfulness": "0/0", "author": "Nair Hid Ahmed"}, {"rating": 5.0, "review": "a super gadget. excellent price and function.It is super creative.this positive worth every cent  paid by your utility is awesome.", "verified": true, "helpfulness": "0/0", "author": "Yariel"}, {"rating": 5.0, "review": "It will not work with a public wifi connection however after setting up my own connection it worked beautifully with no issues...truly love this device!!!!", "verified": true, "helpfulness": "0/1", "author": "Dr. L"}, {"rating": 5.0, "review": "This product was recommended to me by someone that already owns one.  It is working for me just as they advised it would.  I am able to access Netflex via this product on my smart TV through my cable provider.  I love it!!!!", "verified": true, "helpfulness": "0/1", "author": "Linda A. Davis"}, {"rating": 1.0, "review": "I was very disappointed that the 3 easy steps advertised for the Chromecast were not true. Six hours later, still no connection to my TV, and I plan to return the Chromecast for the higher rated Roku device.", "verified": false, "helpfulness": "0/0", "author": "Rick Cote"}, {"rating": 1.0, "review": "Waste of money.  It is not as easy as apple TV product is.  The Wifi grab speed is not also that good with this product.", "verified": true, "helpfulness": "0/2", "author": "N. Sambamoorthi \"Minjur to Marlboro\""}, {"rating": 5.0, "review": "awesome works just like it states, me and my family enjoy it very much. My kids love watching all their shows on my bed tv now lol.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Sala"}]