[{"rating": 5.0, "review": "Yay! This makes watching TV so much easier... especially NETFLIX and YouTube! I take a ton of pictures and videos of my kids and now - with Chromecast - I can play and post them on the TV for everyone to enjoy!... no more fighting over my smartphone and tablet!", "verified": true, "helpfulness": "0/0", "author": "sup2u"}, {"rating": 5.0, "review": "No more headache in connecting my mac to TV.", "verified": true, "helpfulness": "0/0", "author": "selvakumaran"}, {"rating": 5.0, "review": "perfect!", "verified": true, "helpfulness": "0/0", "author": "Arendra Shrestha"}, {"rating": 1.0, "review": "I don't have a bad review for this product because I had to return it due to not being the one my husband wanted", "verified": true, "helpfulness": "0/1", "author": "Maria Moya"}, {"rating": 5.0, "review": "This is one of my favorite little gadgets.", "verified": true, "helpfulness": "0/0", "author": "D. Foote"}, {"rating": 5.0, "review": "I love my chromecast. I have hbo go and netflix. This is my main source of TV. Plus there were some google play deals that pop up that have allowed me to grab two movies for free to rent as well. Nothing beats this.", "verified": true, "helpfulness": "2/2", "author": "Gentian Kruja"}, {"rating": 5.0, "review": "Awesome love this thing", "verified": true, "helpfulness": "0/0", "author": "Mr. Shadow"}, {"rating": 4.0, "review": "I originally purchased this for my son because he asked for it as a Christmas present. My son, being a typical 17 year old, used it for a little and now it's yesterday's news. However, I started using it and I must say it is a terrific little device. It has not left my television since. I use it to watch Netflix and YouTube frequently on my big television as opposed to my little Chromebook or tablet. I know that since making this purchase other similar devices have been introduced, but for me this works perfectly.", "verified": true, "helpfulness": "1/1", "author": "TRC"}, {"rating": 5.0, "review": "genius!!", "verified": true, "helpfulness": "0/0", "author": "Pelin"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Laporsha Wallace"}]