[{"rating": 5.0, "review": "Love the Amazon Fire TV. So easy to hook up and learn to use. I bought three of them and feel it was a good buy. Would buy again. Small soe is greatLove the Amazon Fire TV. So easy to install and use. I bought three of them and have no regrets. Good price and I would recommend it without reservations.", "verified": true, "helpfulness": "0/0", "author": "Carol G"}, {"rating": 5.0, "review": "This product has a lot to offer.  It is fairly easy to use and if you don't have access to movies through another source already, it would be good to have.  You can also get older TV programs, which I like.", "verified": true, "helpfulness": "0/0", "author": "S. W. Fowler"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Fire TV best thing I ever bought the onlything that I dont like is that it doesnt turn off", "verified": true, "helpfulness": "0/0", "author": "jose"}, {"rating": 5.0, "review": "I'm really enjoying my Fire TV because it is regularly updated with new content including movies and shows. Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Trevor Brown"}, {"rating": 5.0, "review": "I am marginally adept at computers and their offshoots, but even I--even I--was able to set-up Fire TV in less than five minutes.  Just make sure to have the password for your wireless handy, and all you have to do is plug in two cables.  Insanely easy.As for the content, aside from all the free movies and TV shows, I downloaded YouTube, for starters.  If you have satellite TV, for about $120 outlay, Fire TV will increase your viewing options a hundredfold.  Fire TV has to be the best value of all time.  This is a true revolution.", "verified": true, "helpfulness": "0/0", "author": "Sammy Jackson 14/88 \"Tomahawk Kid\""}, {"rating": 1.0, "review": "Unit keeps Freezing and needs to be restarted at least every five minutes. Signal quality is reported as \"Very Good\"", "verified": true, "helpfulness": "1/2", "author": "K. Linde"}, {"rating": 3.0, "review": "Very user friendly and great graphics and interface... needs to get vudu app.", "verified": true, "helpfulness": "0/0", "author": "MisterY"}, {"rating": 3.0, "review": "It's a good alternative to cable but I won't be purchasing any selections but I will watch the free stuff", "verified": true, "helpfulness": "0/1", "author": "Brenda L \"Brenda L.\""}, {"rating": 1.0, "review": "Amazing!! Buy a set-top box for 100 bucks; then enroll for $99/year for the priviledge of spending $2-$5 FOR EACH EPISODE!!This seems to be......well enough, I don't want my wife's Amazon account to be in jeopardy...!!!", "verified": true, "helpfulness": "2/5", "author": "Barbara  ives"}]