[{"rating": 4.0, "review": "so far good", "verified": true, "helpfulness": "0/0", "author": "bsgiant"}, {"rating": 5.0, "review": "So easy to navigate. Absolutely simple setup. Have both Apple TV and Amazon Fire in the house and use Amazon Fire exclusively now. Much better remote and interface experience. Plus, I already had prime and Apple TV wouldn't let me put in an app for Prime use. Really glad I got Amazon Fire TV and may end up even getting rid of cable now!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "We just got the Amazon Fire, and it's so much better than our really old Roku. We love the speak feature. It's awesome !", "verified": true, "helpfulness": "0/0", "author": "Nanette A. Snipes"}, {"rating": 5.0, "review": "Love this thing. Exceeded my expectations. Like it better than my Mac mini htpc", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "natalie dimitri"}, {"rating": 5.0, "review": "Probably the greatest investment I've made. Threw xbmc on it and now I can stream anything I want including new movies. Threw a Few emulators like psp and snes and gaming is awesome....", "verified": true, "helpfulness": "0/0", "author": "wjjohnson"}, {"rating": 5.0, "review": "This item is great. It's much better than apple and android ones that I have.", "verified": true, "helpfulness": "0/0", "author": "E. Knowles"}, {"rating": 5.0, "review": "great, like it a lot", "verified": true, "helpfulness": "0/0", "author": "jose"}, {"rating": 4.0, "review": "Amazons improved answer to Google Chromecast. Competition is a wonderful thing. Good job Amazon, easy interface with the ability to stream Amazon prime movies and my Pandora subscription. Haven't completely explored all it's features but I like it!", "verified": true, "helpfulness": "0/0", "author": "bobby k. brown"}, {"rating": 5.0, "review": "We love it. Ordered for my family when it went on sale because I was already considering buying the fire stick, really glad we bought the fire tv with the voice remote and Amazon prime is awesome too. Perfect affordable family entertainment.", "verified": true, "helpfulness": "0/0", "author": "mike"}]