[{"rating": 5.0, "review": "The picture and sound are great!  I don't have any buffering challenges but I do have really fast internet.  The voice recognition works as advertised.  I have watched this more than I thought I would and it makes a much better value of my prime account.", "verified": true, "helpfulness": "0/0", "author": "Skypro"}, {"rating": 5.0, "review": "What a great idea.  Mom LOVES it!  Got this for my Mom for Christmas.  She's 70+ and not really a techie like me.  But, she gets around on this thing, with no problem.  Enjoys all the different options that are on it!", "verified": true, "helpfulness": "0/0", "author": "NoMIFish \"MISKIER\""}, {"rating": 1.0, "review": "I purchased this as part of a deal for Sling TV.  After spending three days trying to get it up on my home network, I'm throwing it in the trash.  I continue to get the error message \"Connected with problems\" on both wired and wireless networks.  This error is not documented so I'm at a loss to determine what exactly the \"problem\" is, however, all other devices (tablets, Chromecast, laptops) connected on the same network segment are working fine.  After wasting three days with no results, I'm done.  I'm not going to rebuild my network because Amazon included some undocumented feature in this device that prevents it from operating.Update:  Just had a session with Amazon \"tech support\".  I paid $25 for them to explain what error condition the \"connected with problems\" indicated.  After first saying \"the device is not connected to the internet\" (not the correct answer, I can see the packet flow through my firewall), the tech support individual quoted me the setup guide.  After I explained to him that I had run through the setup process about 100 times over the 3 days I was trying to get the device to operate, he was a bit miffed (\"it seems you dont want to follow simple instructions and it shows you know what your doing i guess you dont need our help\"). The good new is, they are refunding my $25.  The bad news is I still don't know what the error indicates.  Someone wrote code to put that error message on the screen as a result of some error condition in the device.  If Amazon isn't going to explain what that error condition is, why display the error message?", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Can't say enough I'm a prime member and have been for many years. This make a regular TV a smart TV with your Amazon Prime Account.This is the unit you should purchase I'm sure the sticks is ok, but this unit has what is needed for extreme service from Amazon the units internals,well read up on it, pretty good at a very reasonable price. Speed of delivery with just a standard internet high speed is, well I've never had an issue on anything I've watched. With all the cable channels out there today, it's nice to have something you can select what you would like to watch for a change....", "verified": true, "helpfulness": "0/0", "author": "Robert H. Charbonneau"}, {"rating": 5.0, "review": "I love this thing.", "verified": true, "helpfulness": "0/1", "author": "famke"}, {"rating": 5.0, "review": "The best thing that's ever entered my household!", "verified": true, "helpfulness": "0/1", "author": "De'Anna Mitchell"}, {"rating": 5.0, "review": "Really great products.... Can do a lot with fire tv ...", "verified": true, "helpfulness": "0/1", "author": "Ali"}, {"rating": 5.0, "review": "Love it!  Easy to use, very responsive to voice.  Love, love, love it!", "verified": true, "helpfulness": "0/1", "author": "Mona Moore"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Gabriel da Silva"}, {"rating": 5.0, "review": "Realy, really like it!  Super fast playback!  Great investment!", "verified": true, "helpfulness": "0/1", "author": "Christine"}]