[{"rating": 1.0, "review": "Not enough channel options.....No SciFi  channel  .....no AMC. I've already returned my Amazon Fire TV to the store. Sorry it just didn't have enough channel options.", "verified": true, "helpfulness": "0/4", "author": "Terriono"}, {"rating": 4.0, "review": "Great product. Remote is well designed & the voice command feature works extremely well. I would like to see the voice command bring up my \"amazon cloud\" music ( i.e.: Voice Command-\"The Beatles\" -  and have the remote pull up my Beatles albums- it does not).  However,  one can go to the music category- and find your uploaded music- by name). When I go to music, looking for my uploaded music- it takes a while (couple minutes or less) to find in the cloud ( albeit- I have a lot of music uploaded).Gaming graphics is superb- but looking for more adult gaming options  - hopefully in the future.I love the Amazon Prime ( music, movies, books, and free shipping- Perfect!!!).  However, I cancelled after 30 days.  I would like to see  a reduction in pricing or a bit more value provided.  I would Like to see Prime Music included in the Library selections of Fire TV - and a larger selection of NEWER music made available.  Movies and TV selections- see NEWER titles offered.The pristine quality of the HD streamed movies- hands down beats my current satellite HD selections!With today's competitive marketplace -  I would suspect many improvements and added value- are on the way.I do recommend this product- lots of choices and fun.", "verified": true, "helpfulness": "0/0", "author": "L. Sloan"}, {"rating": 3.0, "review": "I sent it back. Shows my grandchildren watch on Netflex for free were all 1.99 or 2.99 going through Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "lena begley"}, {"rating": 5.0, "review": "Fire TV is amazing, it does exactly what I want it to do immediatelley with my voice command and finds everything I ask for as fast as you can imagine.  Picture is HD perfect, sound is great, I could not be more satisfied with this streaming device.  I definitely recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Denis Herman \"apollo100\""}, {"rating": 5.0, "review": "Great item. Use it every day. Voice feature is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install.  I was using my Blu-ray player to stream I kept getting interruptions.  Went to Amazon Fire and it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Mike Zinkin"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Martin B."}, {"rating": 3.0, "review": "You are charging for movies that are 20+ years old and can be purchased at thrift shops for $.25 each.........", "verified": true, "helpfulness": "0/0", "author": "Kenneth F Shockley"}, {"rating": 5.0, "review": "Easy to work! Love the voice remote! Just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Hope N. Bunch \"Hope\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Jeff J Rink"}]