[{"rating": 4.0, "review": "It has a tendency to lose internet connection in the middle of the movie.  I then have to go through the process of setting up the access to my wireless internet.  This is not much fun when trying to watch a movie.  When it is working, it is great.", "verified": true, "helpfulness": "0/0", "author": "Margaret Higgins"}, {"rating": 5.0, "review": "Great gift", "verified": false, "helpfulness": "0/1", "author": "ray"}, {"rating": 3.0, "review": "Dont like the fact that even with my prime membership, I still have to pay for a lot of the shows an movies!  It seems lame and misleading.", "verified": true, "helpfulness": "0/2", "author": "Brenda Morales"}, {"rating": 5.0, "review": "Awesome. Batter than expected.", "verified": true, "helpfulness": "0/0", "author": "DK"}, {"rating": 5.0, "review": "Amazon Fire TV is awesome!  The HD picture quality is impressive.", "verified": true, "helpfulness": "0/0", "author": "Stephen West"}, {"rating": 5.0, "review": "Easy to setup and use.  There is a tremendous amount of content available to the user.  Only wish that you could search for music the same way you can search for movies and shows.  Unfortunately, you need to select music selections via a web browser on a computer or tablet device and add the songs/albums to your play list.", "verified": true, "helpfulness": "0/0", "author": "Jeff Kubik"}, {"rating": 5.0, "review": "Has over a 150 movies for every genra of movie & about 75 to 100 TV shows for free if your a amazon prime member. But if what your looking for isn't a prime movie or show then you have the option to rent or buy it. 1.99 each show SDAll the games are ones found on iTunes or google play", "verified": true, "helpfulness": "0/0", "author": "Seth Andrew Noto"}, {"rating": 5.0, "review": "I just love searching using voice and browsing content is just as easy as it can get.", "verified": true, "helpfulness": "0/0", "author": "Blayden Thompson"}, {"rating": 5.0, "review": "Easy to set up and use.  Love the search by voice feature.", "verified": true, "helpfulness": "0/0", "author": "Michele May Campbell"}, {"rating": 4.0, "review": "great product...worth every cent!", "verified": true, "helpfulness": "0/0", "author": "Eddyg718"}]