[{"rating": 5.0, "review": "I was surprised how small it was. However, it works great.", "verified": true, "helpfulness": "0/0", "author": "Sandra Tesch"}, {"rating": 4.0, "review": "It works good and was easy to set up.", "verified": true, "helpfulness": "0/1", "author": "danny christian"}, {"rating": 2.0, "review": "Prime movie and TV show selections are horrible.", "verified": true, "helpfulness": "1/3", "author": "Diane Colon"}, {"rating": 4.0, "review": "I have not had time to use it yet. Unpacked it from box and hoped it might have had an HDMI cable, but no. Another trip to Best Buy. After that no problems installing just not had time to watch anything. User interface seems ok", "verified": true, "helpfulness": "0/1", "author": "A Parkin"}, {"rating": 5.0, "review": "I had a Roku and after two years I discovered I was over 90% into Amazon's world. Why not go the next step and make that commitment --- to Amazon. This little gizmo is super fast compared to my Roku days. It's also super organized with a lot more help articles and videos. Amazon's packaging and promotion department goes all out. I thought I was getting some fine jewelry instead of a Fire TV box. KUDOS on the PR department. Except now I'm not sure I can recycle the box it came in. It's too pretty.", "verified": true, "helpfulness": "0/0", "author": "James A. Moore \"Jim\""}, {"rating": 4.0, "review": "Easy to set up.  I really like it.  I have Prime so most of the shows are free.  I don't think I would love it so much if I was paying.  i", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Thad McCoy"}, {"rating": 5.0, "review": "Easy to set up and use.  Reception is great with minimal commercials.  No need to record your favorite show, just find it and watch it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Daniel"}, {"rating": 5.0, "review": "Vocal search, speed of finding & navigating.....awesome. Top left shelf next to DVDs, small yet powerful. \" 2 stars & a swish\"Love it....in living color. Oh nooo Mr. Bill.DE OPPRESSO LIBER.", "verified": true, "helpfulness": "3/3", "author": "pale4thrider"}, {"rating": 5.0, "review": "The remote is incredible,it becomes part of your hand, if you're a prime member it come programed to you, streaming has been great so far, great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Carl"}]