[{"rating": 1.0, "review": "Google Chromecast HDMI...Did not work properly. Contacted technical support several times. Best to spend a little more money to get an Apple TV or other blue ray device that streams.", "verified": true, "helpfulness": "0/1", "author": "toledoman"}, {"rating": 1.0, "review": "I'm thoroughly disappointed, but not angry, since the price was relatively low.  I'll be passing this item on to a friend while I luxuriate in the VAST choice of channels from my Roku Streaming Sticks that I've now bought one for each of my HDTVs.  Two of my TVs are Smart TVs, but Roku has MANY channels that I will actually use but are not available on my Smart TVs.Moral of the story:  Chromecast has it's uses, but it's not right for me.  Your mileage may vary, but check out Roku.  Or buy both and make your own decision!  It's not that huge an investment.", "verified": true, "helpfulness": "1/2", "author": "Daniel L Comstock"}, {"rating": 5.0, "review": "I had to search for directions on how to install this thing.  However, once I got over that step, it was surprisingly easy to follow.  It practically did everything by it self, once it knew wi-fi password.  And it works great.  Now my son watches his videos and netflix on the big screen, instead of a little ipod screen.  He loves it, and so do I.", "verified": true, "helpfulness": "0/0", "author": "SeeAndSay"}, {"rating": 1.0, "review": "Super disappointed. I tried two different computers- my Dell PC and my Chromebook (literally a CHROMEbook) and both times casting Chromecast somehow busted my wi-fi.  Chromecast works for a while then fails. It would lose connection and makes the network disappear from Available Networks.You also get horrible buffering unless you have turbo high speed internet. With my \"regular\" internet, videos from online sites like HGTV were choppy and unwatchable.Save your money and buy a long HDMI cord if you really want to watch stuff from your laptop.", "verified": true, "helpfulness": "0/1", "author": "Lealorali"}, {"rating": 5.0, "review": "Loving this thing. I will probably order another for my other big screen. Best part is that Crunchyroll app now supports the Chromecast. Meaning, apps are steadily being added or updated. Indirectly relates to the Chromecast. Also Chrome Beta has a stream capability at the time of this review. Works with minimum problems.", "verified": false, "helpfulness": "0/0", "author": "John Green"}, {"rating": 5.0, "review": "Google has done it again with the chromecast. It's the cheapest media player that I can buy to watch Netflix and YouTube. I love the idea of having control from my phone and the fact that video apps support it with just an update. I'ts nice being able to use a familiar app for searching shows and just have them appear on my TV. The setup was painless and straightforward and only had to reset the chromecast once after I did an update.", "verified": true, "helpfulness": "0/1", "author": "bk"}, {"rating": 5.0, "review": "You plug it into the HDMI port and (after the inevitable period of tapping on iPads and iPhones) it works. beautiful picture, incredible convenience, unreal price. In fact, the price is low enough that you don't mind the fact that you're going to have to replace it in a year or two when something completely different comes along.Binge on Game of Thrones, Luther, and Orphan Black for a couple of weeks and it will have definitely paid itself off.", "verified": true, "helpfulness": "0/0", "author": "Edward I. \"Terry\""}, {"rating": 5.0, "review": "good value for streaming video.Well designed.easy to use.The color and form factor is wonderful.Like it.I bought 3 of these.", "verified": false, "helpfulness": "0/0", "author": "Shan Liang"}, {"rating": 5.0, "review": "Never had to reboot the device or reconnect to Wi-Fi, at least for now.  The Roku 3 I had required a reboot every 15 minutes and was sent back (they only let you exchange because it was bought on Amazon, NO return even within their 90 day warranty).  Chromecast is perfect if you only need to send your Netflix or Youbube to that huge TV.", "verified": true, "helpfulness": "0/0", "author": "Mimian H"}, {"rating": 2.0, "review": "Poor user experience.  While playing movies from my android tablet the movie buffered frequently.  Also my tablet lost wifi connectivity while Chromecast is in use.  Wifi problems do not persist when Chromecast not in use.", "verified": false, "helpfulness": "1/1", "author": "carbo23 \"carbo@telesoftvc.com\""}]