[{"rating": 5.0, "review": "We Have Chromecast for each both of our kids and our rooms.  They are easy to sync your phone/Tablet/computer to - as long as you have wi-fi.  I have noticed that if you are using it with a computer - you can also stream your computer webpage.  It worked great when we were playing a slideshow of photos from our computer, so everyone in the room could see them on the TV", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Works great & good product", "verified": true, "helpfulness": "0/0", "author": "Brandon G."}, {"rating": 5.0, "review": "Amazing product, great price and AMAZING SOEED OF SHIPPING!!", "verified": true, "helpfulness": "0/0", "author": "Dan Alvis"}, {"rating": 4.0, "review": "Should have gotten one much sooner. Only 4 stars because of the interference it causes with my cable and Xbox when plugged up.", "verified": true, "helpfulness": "0/0", "author": "Enyinna Akanwa"}, {"rating": 5.0, "review": "My TV was smart and supposedly able to connect wirelessly to my computer.  However, I was not smart enough to figure out how to do that.  So I finally bought the Chromecast and the connection process was simple enough even for me.  Good price.  Very good product - I have antenna TV reception so really appreciate using the internet for some programs and movies.  Wish I'd bought it sooner!!", "verified": true, "helpfulness": "0/0", "author": "mdkvegas"}, {"rating": 4.0, "review": "Works well. No issues so far.", "verified": true, "helpfulness": "0/0", "author": "Partha Sanyal"}, {"rating": 5.0, "review": "When I cut the cord, buying a Chromecast was the next step. I've loved it so much, I'm now buying one for the other TVs in my apartment.", "verified": true, "helpfulness": "0/0", "author": "Casidy Lemons"}, {"rating": 3.0, "review": "I have good internet, blazing speed and still lagged on my home network. Not a huge fan, used it once, now trying to figure out what to do with it", "verified": true, "helpfulness": "0/1", "author": "Brady E Inches"}, {"rating": 5.0, "review": "great christmas present!", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Darwin Hernandez"}]