[{"rating": 4.0, "review": "It's good, but has trouble connecting sometimes. I want a more reliable connection. I live in a small house and use a D-Link DIR-655 router. But at times my phone, a Note 3, will not have a connection until I cycle the Chromecast on and off.", "verified": true, "helpfulness": "0/0", "author": "Jay Cook"}, {"rating": 5.0, "review": "Hey, this is a great little gadget and it was so easy to install! Now I can watch the shows I missed from the comfort of my couch watching the TV rather than sitting in front of my PC to watch it. Try it...you'll like it, too!", "verified": true, "helpfulness": "0/0", "author": "Purple Violets"}, {"rating": 5.0, "review": "working very good.i use it with allcast working good have 2.4GHZ. don't support  5GHZ.netflix and hulu working good .Streaming protocols MP4 only!Developer Leon Nicholls has developed a very simple app called Fling . It lets users stream a range of different video formats direct from their computer to ChromeCast and onto your TV, similar to Apple TV.  Fling even offers streaming for one of the more problematic formats, .mkv. The video below shows just how easy it is to transfer files using Fling - it's just a case of dragging and dropping and enjoying your content on a bigger screen.  Fling will only work with the proper Google ChromeCast dongle, not with CheapCast for Android app, which turns any android device into a ChromeCast dongle, so, if you were thinking twice about spending $35 on  a limited content device, perhaps this app will push you in the right direction.[...]", "verified": true, "helpfulness": "0/0", "author": "haim ben-gal"}, {"rating": 3.0, "review": "Pros: small size, mostly painless setup, and a great concept.Cons: not living up to its potential.I have zero doubt that this product is really crippled by behind the scenes content squabbles and negotiations, but maybe the recently released SDK will bring new life to it. It's ironic to buy it on Amazon, but you can't stream Amazon Prime. (Okay, you *can* but not natively and not very well). It's also a shame that using it is inconsistent between apps and browsers. Netflix works from a smart device OR from Chrome, but Hulu+ only works from a mobile device. With Google Play, you can close or change browser pages without stopping playback, but not so with Netflix. Somewhere in all of that, is the perfect UI, and Google should press harder for consistency among the big players.", "verified": true, "helpfulness": "1/1", "author": "greyspace"}, {"rating": 5.0, "review": "as expected and reviewed with known limitations asit can not catch everything in a tablet or mobile device that you want to project as some apple apps does", "verified": true, "helpfulness": "0/0", "author": "Suman Mukhopadhyay"}, {"rating": 5.0, "review": "Really works well, such a great pleasure to be able to see Netflix and Utube on a big tv screen.", "verified": true, "helpfulness": "0/0", "author": "RONALD C. NEWBERY"}, {"rating": 3.0, "review": "This is not ready for prime time IMO.  There are few apps compatible with device.  The browser plugin does not work most of the time and I'm not the only one with this problem.", "verified": true, "helpfulness": "0/0", "author": "Real User"}, {"rating": 5.0, "review": "The set-up is super easy and quick. And it immediately works without any issues. This will not replace your netflix or other services you can stream directly through your TV (we tried, and the picture quality is distorted, so just as easy to continue using the TV or DVD player for streaming those sorts of things), but for showing what is on your screen it is AWESOME. Also, there have been some shows we haven't been able to stream through our TV - YouTube and our church website - this has worked great for those sorts of short videos. We love this thing!", "verified": true, "helpfulness": "0/0", "author": "aalaman"}, {"rating": 1.0, "review": "I ORDERED THE CHROME, VERY EXCITED, NOW IM VERY DISSAPOINTED, AFTER TRYING TO INSTALL IT ON COMPTER, TV, NOTHING SEEMS TO WORK, ITS NOT EASY, THAT ADDED TO THE FACT THAT IS WEIRD TO MIRROR YOUR COMPUTER R DEVICES AND ONLY WORKS W 3 APPLICATIONS, NOTHING WILL EVER BET APPLE TV, UNLESS NOT YET", "verified": true, "helpfulness": "0/1", "author": "dissapointedcharlie"}, {"rating": 5.0, "review": "This product has great streaming at an affordable price!!! Very easy to use and instal! Even works with my kindle!!!!", "verified": true, "helpfulness": "0/0", "author": "Amanda Frame"}]