[{"rating": 5.0, "review": "OMG!!!! excelent", "verified": true, "helpfulness": "0/0", "author": "BCVV"}, {"rating": 5.0, "review": "Worked perfectly for what I wanted which was to stream MLB.TV from my phone to the TV.", "verified": true, "helpfulness": "0/0", "author": "jdmiles"}, {"rating": 5.0, "review": "Works perfectly, had it for about a month now. I wish I had purchased this prior to purchasing the neoTV box to stream.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "This works awesome, make sure you're close to your internet connection/access point to get the best quality possible.Otherwise you may suffer and not be able to listen because the audio won't transmits through the wi-fi.Also, if you own an iPhone it will not play back amazon prime. Which is totally weird.Amazon, you should fix that.", "verified": true, "helpfulness": "0/0", "author": "Alicia Sierra"}, {"rating": 5.0, "review": "a bit slow", "verified": true, "helpfulness": "0/0", "author": "michael kedem"}, {"rating": 4.0, "review": "I like the simplicity of it... as long as your app can stream to it. I mainly stream youtube videos from my Android tablet to my TV. Sure there are other uses but none of them really interest me, except maybe music videos and Netflix...  Right now all I see are paid subscription type streaming services jumping onto Chromecast. Useless to me. Same goes for Apple TV. Everything needs a subscription or registration.", "verified": true, "helpfulness": "0/0", "author": "H. Eng"}, {"rating": 5.0, "review": "great product google really stepped up big as far as a budget HDMI WIFI stick goes does a lot more than other ones", "verified": true, "helpfulness": "0/0", "author": "Ronald Ruiz"}, {"rating": 1.0, "review": "Could not get it to you. Work.", "verified": true, "helpfulness": "0/3", "author": "Hank"}, {"rating": 5.0, "review": "Works like a charm.  Wondered how to get shows from internet onto the TV and this did it.", "verified": true, "helpfulness": "0/0", "author": "David C. Johnson"}, {"rating": 5.0, "review": "Best thing since sliced bread. Love these thing.", "verified": true, "helpfulness": "0/0", "author": "stan"}]