[{"rating": 4.0, "review": "I love this device! There are only a few things I would change. 1) I really wish Amazon would work with Google and allow streaming. 2) HBOGo encounters a few issues with streaming, although that could be associated with my internet connection.Overall, I love that you don't need yet another remote to control it. You can control from your phone, tablet, or computer! Very convenient!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Stream from just about any device!", "verified": true, "helpfulness": "0/0", "author": "Seth Armour"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Valerie Ligon"}, {"rating": 5.0, "review": "I love this thing! I found it easy to set up and use it all of the time. I have Roku and Apple TV and don't even use them anymore. Wish I knew how it compared to Firestick but I have 0 complaints about this gadget!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Chris\""}, {"rating": 5.0, "review": "WINDOWS PHONE APPS PLEASE!!! FALTA COMPATIBILIDAD CON WINDOWS PHONE.... TAMBIEN CON INSTAGRAM :(", "verified": true, "helpfulness": "0/0", "author": "Luisana Díaz"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Dianne Kimbrew"}, {"rating": 5.0, "review": "Good product! Able to stream after little than 2 mins configuration with the network.", "verified": true, "helpfulness": "0/0", "author": "ulysses lopez"}, {"rating": 1.0, "review": "My boyfriend bought me a chromecast last year from Walmart and it is perfect. I just bought my boyfriend one off here a few days ago and it gets way to hot. It doesn't do anything. Every time we try and play Netflix a error message comes up. But it does let us \"cast our device\" everything we do on our phone comes up on the TV so we  can watch uverse and YouTube. I ordered this February 27th it is now March 4th and Amazon did double charge my account $30.07 taking out a total of $60.14 leaving me broke. So over all not worth i", "verified": true, "helpfulness": "0/0", "author": "Sheri Snider"}, {"rating": 3.0, "review": "I was disappointed by the breakups I was getting of my shows through this. I have great wifi but it still wasn't reliable.", "verified": true, "helpfulness": "0/0", "author": "Jack Attack"}, {"rating": 5.0, "review": "i like very good google chromecast i recomende", "verified": true, "helpfulness": "0/0", "author": "alberto orellana"}]