[{"rating": 5.0, "review": "Couldn't get HBOgo on my ROKU because my stupid cable company...\"Comcast\" won't allow it.  LOVE LOVE LOVE being able to catch up on my shows and this little device works great.  Way worth it!  LOL", "verified": true, "helpfulness": "1/1", "author": "Theresa Barber \"Droness\""}, {"rating": 3.0, "review": "When used from my desktop PC it does work using the Chrome browser but not well for streaming.So now I hook my iPad directly to the HDTV using and HDMI adapter - much better!ALSO - it uses an HDMI port for video/audio AND a USB port for power.So make sure your HDTV has a USB port near the HDMI port or you're out of luck.", "verified": true, "helpfulness": "1/1", "author": "Stosh"}, {"rating": 5.0, "review": "This is a nice compact plug in unit, uses your smart phone or laptop as a remote.  Easy to link up and easy to use.", "verified": true, "helpfulness": "1/1", "author": "Ken"}, {"rating": 5.0, "review": "I didn't want to have to connect a blu ray or other device to my TV.  I have a clean uncluttered look and it is unnoticeable.", "verified": true, "helpfulness": "1/1", "author": "Karen Pearce Data Inc \"Suzi Pearce\""}, {"rating": 4.0, "review": "I bought this to try it out but it appears you have to have at least windows 7 on your computer for it to even communicate.  If anyone is a recent college grad like me and doesn't have a new computer, try something else.", "verified": true, "helpfulness": "0/0", "author": "SubZeb"}, {"rating": 5.0, "review": "It does what it says it will do, and has potential for more software down the line.  I had to buy the paid version of Avia for media streaming on the phone and tablet, but now I can stream my pc's music and video.  This is a great option for travelers also, just hook it into your hotel tv and watch Netflix or whatever.  At $35 you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Brian J. Joiner"}, {"rating": 5.0, "review": "I'm happy with they product.  As more apps become available it will even be better.  Ended up buying another for a friend.", "verified": true, "helpfulness": "0/0", "author": "ds \"bikegawd\""}, {"rating": 4.0, "review": "Useful to stream movies or programs from the laptop to the television without having to worry about cables. Great buy.", "verified": true, "helpfulness": "0/0", "author": "deeksha"}, {"rating": 3.0, "review": "It works great with you tube, Netflix and basic web browsing, but not Amazon.  Not favorite streamer Will not get an other one", "verified": true, "helpfulness": "0/0", "author": "Papagigo"}, {"rating": 5.0, "review": "With Google having released their API for developers to utilize this better, it's only going to get better.  The support on Android is great, though I look forward for more OS integration.", "verified": true, "helpfulness": "0/0", "author": "pfkninenines"}]