[{"rating": 5.0, "review": "We use this for Netflix, YouTube, HBOGo and Plex Media Server. It has completely revolutionized the way we watch tv. Be gone Time Warner Cable - BE GONE!!", "verified": true, "helpfulness": "0/0", "author": "Michele A."}, {"rating": 5.0, "review": "I had a Roku which I liked very much. Unfortunately, it quit working with my TV. I am not all that tech savvy so I just let it go until I saw the Chromecast on sale.It was VERY easy to set up (even for me). There were some issues with my wireless router that I couldn't resolve until I turned everything off and on again (always a good idea!).I like that I can use my iphone to access apps. Two things that are improvements for me are: !) the ability to cast from my laptop screen onto the TV! Very cool! (AND i can turn up the sound--a lot of youtube videos aren't very loud and since my laptop travels, I choose not to hook up speakers to it usually). 2) They have an ABC app that allows me to watch local TV news in the bedroom. We have Comcast in the living room but not here.For me, it was just easier all around than the Roku. Enjoying very much!", "verified": true, "helpfulness": "0/0", "author": "J. McCort"}, {"rating": 5.0, "review": "Easy to install and functional", "verified": true, "helpfulness": "0/0", "author": "Renato Toshio Hayashi"}, {"rating": 4.0, "review": "Not bad, but freezes up at times not sure if it's the wi-fi or the internet. Was able to watch Youtube; Netflix;& listened to Pandora.", "verified": true, "helpfulness": "0/0", "author": "Rhodes Pierre"}, {"rating": 4.0, "review": "as expected, unfortunately too complex to use for my wife.", "verified": true, "helpfulness": "0/0", "author": "Tom Tolstead"}, {"rating": 5.0, "review": "If you are looking at this item, you likely have some idea of what chromecast does (allow you to stream net content to your HDTV), so I won't waste time going into it. I'll just say that the quality has been great, the device has been reliable, and I'm actually considering getting another for my audio system to allow me to directly stream music.My only complaint is that there isn't a way to power it via the HDMI itself, so it requires either an external power supply or a connection to a USB port on the television, but this is a limitation of the HDMI technology, not the chromecast, so I won't take stars off for it. I just wanted people to be aware of it ahead of time.The two months of free Hulu+ has been nice. I don't see myself continuing the service, but it was a great trial.Compared to my Wii, my brothers roku and my friends Xbox 360, I'd say this is very similar. Which one you would want likely depends on exactly which streaming services you use and where your budget is. Chromecast was the perfect fit for me, but make sure your services are all covered by whatever device you choose.", "verified": true, "helpfulness": "0/0", "author": "Jeff \"Brown Coat\""}, {"rating": 5.0, "review": "Googles got a fantastic product that makes it stupid easy to go from your Phone, Tablet, or PC to your TV. It's so easy even my 80 yr. Old Grandparents can use it.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Love Chromecast!  This is our third unit and it just keeps getting better.  And the sales price made it a no-brainer.We have ios and Android devices in our home, and they both work great with Chromecast.  We use it often for Netflix, Amazon Prime movies, and YouTube.  We also use it to stream Pandora and Google Music through the home theater stereo.  We have never had any bandwidth issues.The device is incredibly easy to install.  Just plug into an open HDMI port on a tv and plug in the included power supply.  You have the option of plugging it into a wall outlet, or using an open USB port on the tv.  We are using the USB option for all our units. Next, you open the Chromecast app on a device that is connected to the same Wifi network that you want the Chromecast to connect to.  The app will find the device and walk you through the setup, which is really just connecting it to your Wifi.You're ready to go!Recent updates are providing for some great capabilities.  The Chromecast screensaver now uses our own personal pictures which is great to have in the background.  You can also use a variety of other themes.New apps are constantly being added to the Chromecast library, so expect better, and greater uses, including a slew of family-friendly games.", "verified": true, "helpfulness": "0/0", "author": "Igman \"Igman\""}, {"rating": 1.0, "review": "very difficult to set up and use, I returned it and purchased Apple tv", "verified": true, "helpfulness": "1/6", "author": "Jeffrey K"}, {"rating": 5.0, "review": "IT IS EASY TO USE AND WORKS PERFECT. DO NOT CONTROL REMOTE SINCE I CAN MANAGE IT WITH MY PHONE OR TABLE. I HAD MY DOUBTS ABOUT TO BUY ROKU OR CHROMECAST.,, BUT BELIEVE ME CHROMECAST IS MUCH BETTER BECAUSE U CAN CAST ANY APP AND WEB BROWSER  WITH BACKDROP EVEN IF IT IS NOT CAST COMPATIBLE APP. IT IS HD SCREEN CAST.", "verified": true, "helpfulness": "0/0", "author": "Paty"}]