[{"rating": 5.0, "review": "Does what it claims, wonderfully well. Has potential for so much more! :) Hoping to see easy media casting included in future versions.", "verified": false, "helpfulness": "0/1", "author": "Jason Bourne \"Cain is for Charlie. Delta is for Cain.\""}, {"rating": 5.0, "review": "This device turns our normal older TV into a internet connected machine.  We have been watching all our favorite shows on the internet using this device.", "verified": true, "helpfulness": "0/1", "author": "Teresa Sun"}, {"rating": 2.0, "review": "I've tried for more time than I'd like to admit to get my Chromecast working with my Comcast Arriss cable modem.  No luck, so I am returning the Chromecast device.  There are lots of posts on various forums where other Comcast users have experienced the same problem.  No help provided by either Google or Comcast.  So if you have Comcast / Arriss, you might want to defer buying one of these Chromecast devices unitl there is a fix.", "verified": true, "helpfulness": "0/0", "author": "Ron G. Rhodes"}, {"rating": 4.0, "review": "But at it's low price, the Chromecast ain't bad. It's kind of a pain to play any video you downloaded to your comp on it, but you can do it. It's kind of a pain to have to use two devices. I prefer my Roku.But it's really cheap and will let you easily get Netflix, Hulu, YouTube, and a few other things onto your TV. So it's hard to dislike.", "verified": true, "helpfulness": "0/0", "author": "Matthew Maroon"}, {"rating": 5.0, "review": "Very simple to setup and works great.  It is nice that Google keeps their prices reasonable as they continue taking over the market in general.F Apple...", "verified": true, "helpfulness": "0/1", "author": "Loren Hammond"}, {"rating": 5.0, "review": "I researched the Chromecast for a while before deciding to buy it and I have been pleasantly surprised.  It works as I hoped it would (although I did discover that if you have a video baby monitor in the same room as your wireless router it can disrupt your wireless access point and interrupt connections with the Chromecast, by no means the fault of the Chromecast...) and we use it quite frequently.  I am excited to get Plex up and running now that I have a viable solution to consume media from Plex throughout the house.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Colin"}, {"rating": 5.0, "review": "An excellent product and easy to use. It is much easier to use than Roku if you have a smartphone.", "verified": true, "helpfulness": "0/0", "author": "Linda C."}, {"rating": 5.0, "review": "This is so easy to set up! The first one received had a manufacturing defect and so I called Google and they immediately replaced it! Their support is GREAT so if you do have any issues with the product, consider contacting them directly. Currently streams the major players for me (Netflix, HBO Go, YouTube, etc.) -- for a current complete list:[...]So easy to set up and use! I would highly recommend to people that avoid cable and stream most of their tv/movies from their computers/tablets/phones.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product that worked out of the box.easy setup.Provides good quality and overall looks like a great product.", "verified": true, "helpfulness": "0/0", "author": "Inbar Agassi"}, {"rating": 4.0, "review": "I got the Google Chromecast for Christmas.  Out of the box it is easy to install and it plugs right into the side of our 48 inch Samsung.  You Tube, Pandora, and Netflix to name a few are supported on the device itself.  The problem is we were looking use our existing Prime account for videos and cancel Netflix.Amazon, get with the program.  Why do I have to go to my desktop to stream videos and then run back downstairs to watch on the tv?  Why can't you allow streaming on the tablet or phones for video?  How about at least an app support for Chromecast in the Amazon app store so I can use my Kindle Fire HD to stream directly?  I know there are fixes others have posted.  I just wish Amazon would get on the ball and support this product.", "verified": true, "helpfulness": "0/1", "author": "YankeeGirlFL \"YankeeGirlFL\""}]