[{"rating": 5.0, "review": "Love it,, only way to go for streaming movies.  I was using a blu ray player,, but the Fire TV is so much better,, picture is so very very clear,, I love it,, I have two of them one in bedroom and in living room!", "verified": true, "helpfulness": "0/0", "author": "Vickie J Cook"}, {"rating": 5.0, "review": "Look, it's a pretty bass product. I'm almost in overload. I don't even remember how I watched regular TV. Buy, no regrets. If I'm gonna complain about something, it's the plug. It's bulky...why make a big plug, Amazon? Now, I haven't played the games yet. I've just fiddled with the movies/tv/apps/music. I've got a lot left to explore. I'm a week into it and I'll name my first child after this product if the want me to.", "verified": true, "helpfulness": "0/0", "author": "David Watson"}, {"rating": 5.0, "review": "I have now purchased 5 of these. I love them.", "verified": true, "helpfulness": "1/1", "author": "Alexxi33"}, {"rating": 5.0, "review": "I love the Fire TV. Streams wonderfully and has a great picture.", "verified": true, "helpfulness": "0/0", "author": "jtrn001 \"Julie\""}, {"rating": 3.0, "review": "I had high expectations that the Fire streaming experience would be as seamless and high performance as advertised. The first box I purchased would never initialize and I had to exchange it. With the second box, I continue to experience stalled/paused content that refreshes the buffering 5 - 10 times over the course of an hour - especially with the Watch ESPN app. It was my understanding that the network requirements for an excellent entertainment experience were 5-7 Mbps. I have a 22 Mbps wired ethernet connection and my first month as been a big disappointment.", "verified": true, "helpfulness": "0/0", "author": "Dave M"}, {"rating": 5.0, "review": "THREE TIMES BETTER THAN EXPECTED.VERY SIMPLE SET UP, EASIER TO USE. THE VOICE ACTIVATION IS SIMPLY  FANTASTIC. ON A SCALE OF 1-10 IT'S AN 11.", "verified": true, "helpfulness": "0/0", "author": "TOMMYL"}, {"rating": 5.0, "review": "amazing love watching it", "verified": true, "helpfulness": "0/0", "author": "sammy johmson"}, {"rating": 3.0, "review": "Overal the performance is slick the box boots very fast and is overall very fast. If you want a box that lets you search your AMAZON movie library and integrates with your prime account this is for you.That being said if you want ot use this box with your own shared media (like I do with my roku)  then this box is well a turd in  a pretty box.There are ways to side load things like xbmc  and various other applications to make the firetv almost function in this manner however it defeats the purpose of an easy to use setup box.All of the epic search features and pretty menus are all designed to work around amazon services only if you want to search netflix , hulu or any other service you are stuck with a clunky almost hidden system which requires you to load each application.I like the unit overall  I more often than not find myself swapping back to my roku for my day to day use. If they would add in support for applications like playon and integrate your own personal media into the search  I would love this box.As I said in the beginning this just doesn't work for me I have no hardware complaints and I love the remote. If you want something to intigrate with your amazon accounts then this is the box for you.", "verified": true, "helpfulness": "2/2", "author": "angrymeat"}, {"rating": 5.0, "review": "Out of all the TV boxes I ever owned this is by far the best.This truly will replace my Roku, M8 Android smart TV box, and maybe even my Google Chrome dongle.At first I was concern when I read some reviews about not being able to sort out just the Prime Movies. But it appears that issue have been corrected. They do have sections for just Prime Movies, Prime TV, Prime Recently Added, etc.My next criteria was that it needs to play NetFlix and YouTube. And I was pleasantly surprise that they are integrated very nicely in the Fire TV Box.My other criteria was that I should be able to configure it to play XBMC. And Yes you can! In fact the Amazon Fire TV Box is 100 times better then my \"M8 Quad Core Android 4.4 Smart Set Top TV Box\".What will make this Box even better is if they integrate your subscription channels like NetFlix and Amazon Prime into the movie searches like Google TV does. So when you click on the movie it will tell you that its in NetFlix or Amazon Prime. That way you don't have to search 2 different apps for movies.", "verified": true, "helpfulness": "1/1", "author": "MEC03"}, {"rating": 5.0, "review": "I'm about to wear it out.  Really do enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Mitch Nelson"}]