[{"rating": 2.0, "review": "This thing works absolutely great! So why did I give it such a low rating? One word: Support. Or rather, the lack of it!When I bought this dongle, the setup was really easy. You need something with a wireless connection, like a laptop or a phone, in order to set it up, but after that, you can 'cast' to it a number of ways.I plugged mine into my Onkyo receiver's HDMI port. The Onkyo serves as a hub and connects to my TV and speakers. I downloaded the app to my phone and everything connected perfectly to the wireless network in my home.Fast forward a couple of weeks, and all of a sudden, I was losing connection to the Chromecast. I contacted Google's tech support via the phone number provided on the web, and we set about troubleshooting.This is where the story goes bad. We hear so much in the news about how great it is to work at Google. Maybe that's true, but it's murder trying to work WITH Google! I don't know where they recruited these mouthbreathers, but over the course of 5 days, I couldn't get a single straight answer out of them!It turns out all I needed to do was reboot my wireless router to restore connectivity, but that answer eluded 4 different techs. First I was promised a replacement unit. That offer disappeared mysteriously, never to be fulfilled. Next I was told I couldn't cast from a wired connection to my router, such as my PC has. Uh-huh, so how was everything working for 2 weeks before? Then I was told I needed to isolate my wireless connections. Really? Why? No answer; that's just what it says in their script. Finally, I was told the Chromecast HAS to be plugged into an HDMI port on a TV, not an HDMI port on any other device. Uh-huh, like HDMI-in is different from device to device? Nice try.I certainly recommend this little beauty. It works really well, and with such an easy setup, you can send great video to your TV (or media system). For $35, you're not risking much. But if you run into trouble, don't count on the good folks at Google to help you out - they have NF idea what they're doing.", "verified": true, "helpfulness": "0/0", "author": "MT Vessel"}, {"rating": 2.0, "review": "The product is easy to install and broadcasts well. It does need more portals. I hope CHROMECAST is working on it. A financial or another movie portal would be great.", "verified": true, "helpfulness": "0/0", "author": "Carmen Alexander"}, {"rating": 4.0, "review": "Great price but too limit for android streaming (netflix and YouTube only).  Very fast and convenience for movie.  Excellence price for sure", "verified": false, "helpfulness": "0/0", "author": "Bill phung"}, {"rating": 3.0, "review": "Just wanted to get this to test it.  I understand its early on and  that maybe new developments and partnerships will help improve it.  As for now, its really good if you don't have a smart tv and have a smart phone.  Limited streaming to Netflix, You Tube and a Google browser(that is if you get the desktop app and have a wifi enabled laptop or computer).", "verified": true, "helpfulness": "0/0", "author": "Selassie I \"Dj Amp B\""}, {"rating": 1.0, "review": "I have tried multiple times to get it working. There is always an error of some kind and it will not complete the installation.", "verified": true, "helpfulness": "0/0", "author": "Steve Willard"}, {"rating": 5.0, "review": "Compact design hiding perfectly behind the TV.  It's very easy to setup even I live in Canada.  For $35, you can't ask for anymore.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "This is a truly amazing product.  I was able to install it in just a few minutes.  The HD videos look great with no buffering while the movies are playing.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Michael Liimatta"}, {"rating": 3.0, "review": "So far I have yet to get this thing to work!1.  Mother's Sony flat panel, without network access - FAIL!2.  Roku box on a CRT television with network access - FAIL!3.  Sony BD player with network access - FAIL!In the end this device will cost you over $300 with either the purchase of a new television and/or the purchase of internet access.I am LESS THEN IMPRESSED...", "verified": true, "helpfulness": "0/1", "author": "Mark L."}, {"rating": 5.0, "review": "This is a great device. Just about anything that you run under the chrome browser will show up. The set-up is pretty easy - the only thing that tripped me up was that my connection when I plugged in wasn't tight enough. I wish they would let you know in the instructions that the item does emit a light when power is going through it. Also, the instructions are misleading as far as three steps. Make sure you either know or have the password for your wireless router available, or else this is not going to work.Only certain sites are supposedly set-up to run with this, such as Netflix and You Tube. But I found that almost any video that I spun up under Chrome worked fine. So, it is better than advertised. We also have one at work that we use when developing collaboratively. For the price, this simply cannot be beat.", "verified": true, "helpfulness": "0/0", "author": "B. K. Whittaker"}, {"rating": 3.0, "review": "Limited apps and a weak WiFi antennae make this less functional than Apple TV. If you only want to watch Netflix and YouTube than this is for you.", "verified": true, "helpfulness": "0/1", "author": "Richard L. Allen"}]