[{"rating": 5.0, "review": "I brought this to go along with my Chromebook and android phone. This chrome cast is amazing! I can watch hulu, YouTube and amazon on my TV. Also I can broadcast other websites on the TV through chrome cast. Great Product!", "verified": true, "helpfulness": "0/0", "author": "E.Navarrete"}, {"rating": 4.0, "review": "I don't think it does enough to stream more stuff from my PC.  So far only been able to use it for YouTube videos.  Would be nice if this worked with Amazon Video streaming.", "verified": true, "helpfulness": "0/0", "author": "Anthony Rosner Sr"}, {"rating": 5.0, "review": "easy set upcompatible with many different appsdoes not drain phone battery!!only problem is spotty wireless internet the stronger the better", "verified": true, "helpfulness": "0/0", "author": "Claire Treadwell"}, {"rating": 5.0, "review": "Absolutely Awesome!  It works great for netflix and YouTube! Perfect for family movie nights. And it's super easy to install.", "verified": true, "helpfulness": "0/0", "author": "Candace Pace"}, {"rating": 5.0, "review": "I use it all the time and my S3 loves it too.  I've had it for almost a year now and have had zero problems.  I hasn't left the back of my TV sense i got it in the mail.  Don't read too much in to this product.  If you have a Android phone and watch youtube, netflix, and use google play then what are you waiting for.  Get one", "verified": true, "helpfulness": "0/0", "author": "Jason York"}, {"rating": 5.0, "review": "Got few more for each TV set so I do not have to move this little device with me. Love Chrome!", "verified": true, "helpfulness": "0/0", "author": "Mingyen Pannicke"}, {"rating": 3.0, "review": "can't really expect much from a $35 dongle! most of the time it streams in 720p which is very watchable for Netflix, Hulu and YouTube, videos maybe very choppy on other websites such as Crackle, TheCW, etc... it also depends on your internet connection, mine is fairly fast at 50mbs down and 15mbs up. i usually watch it at night time or early in the day when no one else is using the internet besides myself. overall, it does the job, it beats using a HDMI cable adapter, but in all honesty, i believe with that, you will get better quality content streaming...", "verified": true, "helpfulness": "0/0", "author": "madebymicheal"}, {"rating": 5.0, "review": "This literally took 30 seconds to set up and use.  It's easy to operate and it works.  Well done, Google.", "verified": true, "helpfulness": "0/0", "author": "Joseph Allison \"Master of One\""}, {"rating": 1.0, "review": "I thought this would be the hot ticket to be able to watch movies in my living room, but it for some reason wouldn't work on my LG TV. I even tried different connection cables hooking it through component cables and still wouldn't work. Worked fine on the small tv in my bedroom, but not why I got it. Not sure why it wouldn't even boot up on my LG. Played around for hours, online & message boards, then finally gave up and sent it back.", "verified": true, "helpfulness": "0/1", "author": "Mudsow"}, {"rating": 5.0, "review": "Here is a small list of what $35 has allowed me to do:Stream music through my TV's sound system (Google Music)Show pictures from my vacation on the big screen in the living room (AllCast)Allows everyone to see this funny video without having to crowd around my tiny phone (YouTube)Beam Netflix to the big screen (Netflix)Completely mirror my desktop to my TV (Chromecast extension though Chrome)Its cheap, it has multiple uses, its easily concealable on your TV, and its getting better all the time. Why haven't you bought one yet?", "verified": true, "helpfulness": "0/0", "author": "Randall David Parker"}]