[{"rating": 5.0, "review": "Haven't used it all that much, but i like what I've seen so far.  Kind of pricey putting together all that's needed, but still less than Brighthouse!", "verified": true, "helpfulness": "0/0", "author": "WILLIAM F. KERNEBECK"}, {"rating": 5.0, "review": "Wonderful tool to expand viewing options.  My only wish is that is could use the voice command when I am using the NetFlix application within Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "MSH"}, {"rating": 4.0, "review": "It is ridiculous that it does not come with the required HDMI cable for how much money we spent. Otherwise it's great.", "verified": true, "helpfulness": "0/0", "author": "kimberly.annamarie"}, {"rating": 5.0, "review": "I love it and have absolutely no problems. It was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Wana ulysse"}, {"rating": 5.0, "review": "Love it, I only have to see if Prime makes a different in using it.  I have Netflix and it works out nice, I live out in the woods, so that could be a problem why the other shows keep stopping.  The Streaming from Netflix will start off that way and then gets better. I only have 512 on wireless out here in the country.", "verified": true, "helpfulness": "0/0", "author": "brandy"}, {"rating": 5.0, "review": "Yes it did thanks now i can shut off that damn CABLE yee haha.", "verified": true, "helpfulness": "0/0", "author": "William T."}, {"rating": 5.0, "review": "I really like it. I didn't realize I needed to download apps for certain things. I didn't think I needed the booklet but I am going to buy it. I think for new users you don't really need it but it could be useful. I wish it had more instructions or should I say some kind of user guide, other than the book, for it. If you're an amazon prime member and use it for more than the 2 day shipping then I recommend buying this. The main streaming boxes have basically the same apps minus 1 or 2. If your predominantly an Apple user then maybe you might want to look at Apple. I would recommend this to anyone though.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Working great!  Love it.😁", "verified": false, "helpfulness": "0/0", "author": "Susmita C."}, {"rating": 5.0, "review": "The Amazon Fire TV system add so much to the TV viewing experience.  You can watch free Amazon Prime movies and shows plus you have instant access to other sites such as NETFLIX.  The installation  is quick and easy.", "verified": true, "helpfulness": "0/0", "author": "Evan \"Big Doug\""}, {"rating": 5.0, "review": "I LOVE my Amazon Fire TV. Having access to unlimited television and movies at the touch of a button is amazing. I only wish it had a transponder to continue watching the media on the other televisions in our house, which would be perfect for our exercise room.", "verified": true, "helpfulness": "0/0", "author": "pen name"}]