[{"rating": 3.0, "review": "Works well but requires additional payments to use most features.", "verified": true, "helpfulness": "0/0", "author": "vera jean silveri"}, {"rating": 4.0, "review": "Fast delivery,Nice things,Works well.", "verified": false, "helpfulness": "0/0", "author": "stephany Eloy"}, {"rating": 5.0, "review": "Better than google TV! And I love Google! Way better than Chromecast. I love the voice search remote! Quality build!", "verified": true, "helpfulness": "0/0", "author": "Lauren K."}, {"rating": 5.0, "review": "Best bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "Robert Bonitch"}, {"rating": 1.0, "review": "I was really excited for this to replace my aging Sony Google TV that won't ever get updated again.  I use Plex quite a bit and was surprised to learn that 5.1 Dolby doesn't pass through correctly.  Also there isn't a simpleTV app for the Amazon Fire TV yet.  Sling TV, Amazon Video, and Netflix work fine.  The device is extremely responsive.  I would rate 5 stars if I could get 5.1 with Plex.  I am sure this device would be perfect for some people depending on their needs.UPDATE -08-30-15This device just frustrates me.  I put it in a bedroom that I don't use much and would never buy this over a roku.  Roku's just work.  This is so unrealiable it is just irritating.  Always some stupid issue.  Last one was gong to watch sling tv ... click on it..tells me to update app, takes you to Open app. round and round we go.  Had to go get a laptop sign into Amazon and push the app again, sync it from settings to get it to work.  This is NOT the first time that stuff like this has happened.  I just want to pick up where I left off from a dependable Roku and this is what I walk into. When it isn't screwing up, it works well but these glitches are just getting old.", "verified": true, "helpfulness": "0/0", "author": "Phoenix User"}, {"rating": 5.0, "review": "I've used an Xbox 360, Xbox One, Nintendo Wii, Roku 2 and my Blu-Ray player to stream media before, and this is by far the best! It is so fast! I love how quickly I can jump between Netflix, Hulu, Amazon Prime and Sling. As an added bonus, the free games I've downloaded have been very addicting and fun. The remote works great and keeps it simple; which I like. I did get 1/2 off for subscribing to 3 months of Sling, which really works well with this device, but I would have paid full price now that I've owned it for a month.If you cut the cable, this is a great all-in-one hub for streaming media apps. All of the apps above work great, and it switches between them faster than my Xbox One. I plan on buying a second for the bedroom.", "verified": true, "helpfulness": "1/1", "author": "Billy C"}, {"rating": 5.0, "review": "Good product, as expected.", "verified": true, "helpfulness": "0/0", "author": "AussieinNY"}, {"rating": 3.0, "review": "I like the concept of the fire tv but you have to get amazon prime to use it to its full potential. I did get amazon prime and I still don't think it lives up to its full potential. First of all most the movies and tv shows out there (even ones 5 years or older) you have to pay for. The only thing that makes this subscription any good is the free shipping and the amazon prime music. Overall:: GOOD CONCEPT. BAD QUALITY. When amazon decides to make their selection better, I will change my mind.", "verified": true, "helpfulness": "0/1", "author": "Kindred Holbrook"}, {"rating": 5.0, "review": "The best invention!  We canceled our pay channels and dropped down to just basic DirectTV!!  We have the Fire Stick and the Fire TV, and then we use our Xbox Gold Memberships for the other 2 TV. In order of HDMI streaming performance in my opinion is Fire TV, the Fire Stick, Xbox, HDMI TV.", "verified": true, "helpfulness": "0/0", "author": "Laura Seaman"}, {"rating": 3.0, "review": "DISCLAIMER:  These are my observations and does not directly reflect the experience anyone else has or will have with these two devices.Bottomline:  The Roku 3 connects to faster internet speeds for responsive, smooth, glitch-free viewing for hours.I owned the Roku 3 for almost 6 months before purchasing the Amazon Fire TV.  The comparison chart and great service I've experienced from Amazon helped me decide on this purchase.  The Fire TV has been in use for only a month and I have noticed operational comparisons not overtly discussed.  I'm using wireless dual-band connection and noticed the Roku 3 scans, finds and connects to the faster band, but the Fire TV does not.  Meaning, the Roku 3 has been more responsive and provided consistent, smooth, glitch-free HD for my television shows...which are on Amazon Prime...irony. Additionally, the Fire TV freezes or completely disconnects when loading shows and movies after being played for several hours.  I don't know if this is from the heat produced within the box or technical issues.", "verified": true, "helpfulness": "0/0", "author": "Eddie Music \"EM\""}]