[{"rating": 5.0, "review": "Amazon Fire TV is a very nice unit. Lots of good features and easy setup. Well worth the money if you like watching movies.", "verified": true, "helpfulness": "0/0", "author": "M. Ours"}, {"rating": 4.0, "review": "I got this in conjunction with Sling TV's rebate deal for 2 reasons.  1) It plays Sling TV and 2) you can easily side-load Kodi on it.  I'm a major Apple fan, so straying from the fold was a big move. I have 3 Apple TVs currently (1 2nd Gen and 2 3rd gen) and have helped my parents set up two of them.  I have modded the 2nd gen to run XMBC, but with that project stopping support for AppleTV, I needed to find an alternative.  I came across this one and am happy so far.  The one thing that I can't do is AirPlay.  There are apps and such, but they are limited and cost extra $$.  I also have a number of Digital HD movies downloaded to iTunes that won't work on the Amazon Fire TV, but I'll just have to create a version using the DVD/BD if I need that.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It was so limiting", "verified": true, "helpfulness": "1/3", "author": "mark g boutilier"}, {"rating": 4.0, "review": "Works great but chews through data very quickly", "verified": true, "helpfulness": "0/0", "author": "Isrrael"}, {"rating": 2.0, "review": "There is a problem with the Netflix app. The playback is choppy. I have a Roku 1 and an Apple streaming player on other tv's in the house without any issues. Netflix streams fine with these so I imagine I can rule out a problem with my wifi. Naturally, Amazon prime videos stream perfectly. The interfaces are well structured and it's an intuitive streamer. However, I'm on Netflix quite often. Accordingly, due to the choppy playback, I am unhappy with my Amazon fire tv.", "verified": true, "helpfulness": "0/1", "author": "David D."}, {"rating": 5.0, "review": "Super easy to set up. Very happy with my purchase overall", "verified": true, "helpfulness": "0/0", "author": "phi"}, {"rating": 4.0, "review": "The Fire TV was very easy to install.  The remote is extremely easy to use.  I did have a little trouble with the voice remote understanding what I was saying.  i.e. I asked for \"Transparent\" and got everything with 'trans' in it but not \"Transparent\".  It eventually did understand me after several tries.  So far, so good. I think we're going to like this product.", "verified": true, "helpfulness": "0/0", "author": "Carolie Stickley"}, {"rating": 1.0, "review": "I like Apple TV better", "verified": true, "helpfulness": "0/1", "author": "michael d cook"}, {"rating": 5.0, "review": "Since I have Amazon Prime; this is extremely worth it!", "verified": true, "helpfulness": "0/0", "author": "Danielle Leblanc \"Danielle\""}, {"rating": 5.0, "review": "Just what you expect from Amazon...a great product.", "verified": true, "helpfulness": "0/0", "author": "Todd H."}]