[{"rating": 5.0, "review": "I recently got rid of cable TV.  Fire TV is a great to watch the shows I used to DVR.Pros:-Quick start up-Voice search-Many apps (I use mostly Netflix, Pandora, Hulu Plus)Cons:-Wish the voice search applied to apps, but it only works for searching the archives of Amazon Prime Video", "verified": true, "helpfulness": "2/2", "author": "Mariel Hartman"}, {"rating": 4.0, "review": "I have had my Amazon Fire for about a week now and there are many things I have been impressed with, but there are a couple big things that are keeping me from loving it.  I will start my review by saying I could care less about games offered by these streaming devices and my primary use is streaming movies from my hard-drive or from sites like Netflix/Hulu.I have owned and used the Apple Tv, WD TV, Roku 3, and now the Amazon Fire.Apple TVPros:- Very sleek user interface- User interface is very friendly and easy to pick up for a brand new person- I have an iPhone and iPad so the AirPlay bonus is pretty niceCons- The most limited as far as app selection.- Cannot play movies I have without uploading them all to iTunesWD TVPros:- Only player (that I am aware of) that doesn't require additional setup to play movies off a hard-driveCons- The worst user interface of the 4- Does not have an app for Amazon primeRoku 3Pros:- The most flexible for app selection- The home screen is exactly what I want to see (the apps I have specifically selected)- User interface is second only to the Apple Tv (imo), and it is close- PLEX is an amazing app for movies.  It makes my movies pretty for me without extra effort (adds pictures, descriptions, ratings).Cons:- I needed to setup a PLEX server in order to play my movies.- I sometimes struggle with movies buffering periodically while watching.Amazon FirePros:- The best hardware of the bunch.  I have no issues with buffering.  There is no lag with menu navigation.- I was not super interested in the Voice control, but it works fairly well.Cons- Home screen has a lot of things I don't care about and is not configurable- It doesn't work with my Harmony HubOverallCurrently, I would rank these from first to last: Roku, Amazon, WD, Apple.  I think the Amazon Fire and Roku are way ahead of the WD TV and Apple TV, but I still personally prefer the Roku 3 over the Amazon fire. I had very high hopes for the Amazon Fire but there were three things that made me decide to stick with my Roku for my man cave.1. It does not work with my Harmony Hub because it does not accept IR signals (biggest disappointment)2. The home screen feels cluttered with a lot of things I could care less about3. Twitch is not an app I can select from.If they added support for the Harmony Hub, or you do not care about the universal remote, then I would probably rank the Amazon Fire over the Roku 3.", "verified": true, "helpfulness": "4/5", "author": "Nathan Schieve"}, {"rating": 2.0, "review": "I don't like much because fire tv don't have more apps compare to other streaming players. I can recommend this product.", "verified": true, "helpfulness": "1/6", "author": "vamsipriya"}, {"rating": 4.0, "review": "This unit works fine.  I was worried that our internet speed might be too slow for watching movies but have had almost no issues (not a function of this unit but our lack of access to fast internet service).  I thought we could use this unit to access the internet but that function is not available.  Good value for the price.  We have signed up for Netflix, Prime and Hulu Plus in the hopes of dropping Direct TV and saving money.", "verified": true, "helpfulness": "2/2", "author": "D. Wilde"}, {"rating": 5.0, "review": "Set up was easy - just plug in the HDMI cable and power, then synchronize it to your wireless router and it is ready to go.  You do just push the button and say what you want, and it goes right too it.  Outstanding product. Thank you again, Amazon", "verified": true, "helpfulness": "1/2", "author": "Marcia A. Gordon \"beancat159\""}, {"rating": 5.0, "review": "I love my Kindle ... and have owned 3 of these. One was a reader, then the Kindle Fire and then the Kindle HDX. However this is a game changer.I have a wall mounted tv - so getting it hooked up took me about 15 minutes with 14 minutes used to find where the cable connected into my TV and locating the password for my wireless internet.It is extremely easy to use. The navigation is awesome and I love the fact I can watch on my TV and then continue watching on my Kindle.If you have a Kindle Fire and love it for watching videos using your prime membership - you have to get this device.", "verified": true, "helpfulness": "7/7", "author": "Jodie Marie Shaw \"MktgMaven\""}, {"rating": 1.0, "review": "No way very expensive to reorder plans and setup rediculas no support i gave it away to a enemy not what i heard at all", "verified": true, "helpfulness": "4/24", "author": "liz roessler"}, {"rating": 4.0, "review": "I really like it.", "verified": true, "helpfulness": "1/1", "author": "IVIE BIEN-AIME"}, {"rating": 1.0, "review": "Love Prime video even at the new $99.  But there is no way I'm spending another $99 on a box that will not search for videos I've already paid Amazon for.  There is no doubt the Prime TV is is a tech winner and well worth the money, but to sell out your customers to sell a few rental is over the top.  They need to fire whoever made that decision.  Thanks to all you guys that kept me from wasting $99 !!", "verified": true, "helpfulness": "3/15", "author": "R. Clark"}, {"rating": 5.0, "review": "Its very easy to use and the picture is sharp. Netflix streams perfectly. I've had no issues with the voice search.", "verified": true, "helpfulness": "0/0", "author": "R. L."}]