[{"rating": 5.0, "review": "This is such an inexpensive and elegant solution for streaming to your TV. My only gripe is that not more applications support Chromecast yet...", "verified": true, "helpfulness": "0/0", "author": "Anthony P. Stein"}, {"rating": 5.0, "review": "This makes watching Netflix (and other apps) on my TV really simple and clean. I can't even see the device when its plugged into the TV, but it still works its magic.", "verified": true, "helpfulness": "0/0", "author": "D. Spearow \"Random Buyer\""}, {"rating": 5.0, "review": "works like I was told it would. It is very easy to use.  Following directions on installation made it quite easy.", "verified": true, "helpfulness": "0/0", "author": "Dale B."}, {"rating": 4.0, "review": "I was stoppd using a HDMI cable.  The device works perfectly with iPad and iPhone, but is a bit glitchy using Chrome on my PC.", "verified": true, "helpfulness": "0/0", "author": "Roger Parrow"}, {"rating": 4.0, "review": "I bought this for my daughter who has a nice flat screen LCD TV, but lives in NYC with no cable connection (too much money). She had been watching everythign on her laptop via internet, now she gets a large screen version. It was simple to set up, worked perfectly right out of the box.", "verified": true, "helpfulness": "0/0", "author": "bobh"}, {"rating": 1.0, "review": "Unfortunately I have not been able to use this device because my computer does not have a compatible system to support it. Others in the household have not tried it on their devices so I have no idea if it works or not. The ad that encouraged me to buy it did not mention this issue but the box does, in small print. I even went to a retail store and asked and the sales person was not aware of any requirements until reading the box.", "verified": true, "helpfulness": "1/2", "author": "Genie  Mc"}, {"rating": 4.0, "review": "Satisfactory performance most of the time, but often cuts off unexpectedly sometimes. That is all have to say at this time.", "verified": true, "helpfulness": "0/0", "author": "David L. Carroll"}, {"rating": 5.0, "review": "Its great, does exactly what it says it would do!It is worth the price and I bought 2 more for my son and son in law.", "verified": true, "helpfulness": "0/0", "author": "jessica"}, {"rating": 5.0, "review": "It is hidden behind the TV with no cables any where and best of all I don't need to look for the remote. I would however like to have a wider variety of sites that can be casted", "verified": true, "helpfulness": "0/0", "author": "Stephen Gomes"}, {"rating": 3.0, "review": "The only problem is that it doesn't seem to stay connected well.  And we keep having to set it up again and again.  But the concept is great.", "verified": true, "helpfulness": "0/0", "author": "Rosetta Wilson"}]