[{"rating": 5.0, "review": "Did exactly what I wanted took a minute to get used to phone being the controller .", "verified": true, "helpfulness": "0/0", "author": "Tyler Higley"}, {"rating": 3.0, "review": "Just ok !", "verified": true, "helpfulness": "0/0", "author": "Mr. Noll"}, {"rating": 4.0, "review": "I didn't know what this was until a few weeks ago we were at a beach house rental and they had installed a Chromecast device on the TV.  I was curious about it and googled it.  After a few minutes of reading I figured out I was able to stream content from my phone to the TV - connectivng my device to the existing Chromecast was a cinch and we were watching Netflix and HBO Go in a matter of minutes.That trip to the beach piqued my interest and I started researching the options (there are many!)  I focused on the cheaper ones (under $40) so decided to buy the Fire TV stick and Chromecast to compare.  Both are extremely easy to use / easy to setup and honestly for the price you cannot beat it with either product.At this time if I had to choose one over the other I'd go with the Fire stick.. both offer access to most major content but only the Fire device allows me to use Amazon Prime (movies, TV, music).  The Fire has a separate remote and allows you to download apps onto the device itself so no (cast) device is necessary as long as you have internet and wifi.  The ability to connect to captive portal' networks might be important to anyone taking this device on the go (hotel internet usually uses captive portal).I would not steer anyone away from buying the Chromecast - it is a great product and has expanded our control over when / how to watch streaming content.", "verified": true, "helpfulness": "0/0", "author": "J. KENNEDY \"Jeff\""}, {"rating": 5.0, "review": "It's the best thing ever!", "verified": true, "helpfulness": "0/0", "author": "R. Wendt"}, {"rating": 4.0, "review": "I bought it while my trip to US.But back home in India very limited apps are supported.", "verified": true, "helpfulness": "0/0", "author": "Ashish Gupta"}, {"rating": 5.0, "review": "Very good. Love it", "verified": true, "helpfulness": "0/0", "author": "umer alam"}, {"rating": 3.0, "review": "Okay. but doesn't connect all the time. Roku is better.", "verified": true, "helpfulness": "0/0", "author": "A2"}, {"rating": 4.0, "review": "I thought it was easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "GM"}, {"rating": 5.0, "review": "Works the way it's supposed to. The only thing that sucks is that it doesn't stream Amazon Instant Video, but you know that coming into the purchase so you can't complain.", "verified": true, "helpfulness": "0/0", "author": "To-Van"}, {"rating": 5.0, "review": "i love the chrome cast although you can't mirror your phone to the tv you can mirror your tv to it", "verified": true, "helpfulness": "0/0", "author": "Samantha Neuman"}]