[{"rating": 4.0, "review": "The price can't be beat, but I find myself missing the Roku 3 in the living room. If you want to cast from your phone or tablet and the (still) limited number of apps for the Chromecast aren't a problem, it works a dream. If you want a faster interface, more streaming services and like the ease of using a remote, then a choice from Roku or Apple might make more sense.", "verified": true, "helpfulness": "0/0", "author": "Bill.S.S. \"Bill\""}, {"rating": 4.0, "review": "Love it. I use it almost everyday to watch Netflix or YouTube. But I want more. I want to be able to extend my monitor with it. I want to be able to cast Amazon prime because let's face it, Netflix is lackluster when it comes to great movies and non-existent when it comes to new release movies. So here are the pros and cons. Once again, I love it but I want more.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 2.0, "review": "Just got Chromecast and -- after a few false starts and many searches for help -- got it to work...After a fashion.So what works?YouTube.Netflix? As the Russians say, Not Yet (nyet). You get a long message saying the Netflix plugin doesn't work in Chrome for Windows 8 mode, blah blah blah. I FINALLY got it to work, and it was nice -- again, kind of. The movie streamed fine, but after a while I couldn't pause or stop the TV. The laptop paused, but the TV kept on going and wouldn't stop paying.Amazon Instant Video not supported yet.Other screencasts with embedded YouTube or Flash content slo-o-o-o-w waaaaaay down. You can watch people at 8 frames per second or slower pause and stutter instead of move and talk.Not ready for prime time. Save yourself tons of headaches and get a $7 HDMI to HDMI cable instead.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 3.0, "review": "Works great for showing quick websites, slides, or watching anything on YouTube. But, I know it's still in beta, but I wish the tab cast function worked better.I used the tab casting for movies, and it just didn't meet my standards. I knew there was going to be a resolution loss (expecting my 1080 movies to look 720). But, I found that my 1080 movies were in a weird twilight zone between 480 and 720 that just made my movies look, well, awkward.I primarily use my Chromecast now for strictly supported uses such as YouTube viewing which works as it should.Verdict: Got what I paid for. Maybe I'm asking too much from a $35 streamer, but I expected a little more.", "verified": true, "helpfulness": "0/0", "author": "Chad Rogers"}, {"rating": 5.0, "review": "Very easy to install and use. You need a local wireless network (hotspot might work) and any devices on that network can cast to the player. My android tablet and phone, as well as my Windows laptop and desktop, can all cast to the player without a hitch.", "verified": true, "helpfulness": "0/0", "author": "Space Cadet"}, {"rating": 5.0, "review": "This is a must have if you currently do not have a smart or if you just want to display home movie from you personal computer. Love it", "verified": true, "helpfulness": "0/0", "author": "chandra garner"}, {"rating": 5.0, "review": "Great device, works perfectly. I enjoy using HBO GO, screen casting and pandora on this.  I just ordered the Roku stick to compare.  But for $35, you can't lose with the ChromeCast!! More apps and this will DESTROY all other options!", "verified": true, "helpfulness": "0/0", "author": "Bryan St Clair"}, {"rating": 4.0, "review": "Pros:Small, easy to use, great video streaming qualityCons: No way external speakers can be attached, only TV speakers work.", "verified": true, "helpfulness": "0/0", "author": "Abid  Hussain"}, {"rating": 5.0, "review": "Cann't wait for more support on other applications.  This thing works great on Netflix and my Chrome browser right now....We all love it.", "verified": true, "helpfulness": "0/0", "author": "firebreather"}, {"rating": 4.0, "review": "I use it only from Youtube from the laptop and Samsung S4, there are delays sometimes. The setup was a bit frustrating, there is not enough tutorial.", "verified": true, "helpfulness": "0/0", "author": "Sergio M"}]