[{"rating": 3.0, "review": "It definitely sped up my download times.  Movies I've watched so far have only \"spun their wheels\" once or twice a movie.", "verified": true, "helpfulness": "0/0", "author": "Bartman"}, {"rating": 5.0, "review": "This is a great addition to our Amazon prime account! Easy to use and tons of content!", "verified": true, "helpfulness": "0/0", "author": "Tim S."}, {"rating": 1.0, "review": "Currently, my Amazon Fire TV is not able to play content due to a bug which I have been told is not yet fixed. It does not work at the moment because of this.", "verified": true, "helpfulness": "1/4", "author": "Daniel"}, {"rating": 3.0, "review": "We have been incredibly disappointed in Amazon Fire TV box. We bought it as an \"upgrade\" to a Roku box and really wish we had just gotten a second Roku. We had trouble getting Netflix to work from the time we installed the Amazon Fire Box on Christmas Day. In the last week, Netflix has not worked as much as it has worked.", "verified": true, "helpfulness": "0/0", "author": "eabreese"}, {"rating": 5.0, "review": "Love it!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "There is much to like about the Fire TV.  It is fast! The voice search is very fast.  I like how it incorporates my Amazon video and music purchases.  I don't like that I can't pin Netflix on my home page and wish the search function would incorporate Netflix.  Still I am pretty happy with it.", "verified": true, "helpfulness": "0/0", "author": "Kevin \"cranky old man\""}, {"rating": 5.0, "review": "Have only had it for a week but so far I love it. I haven't watched cable tv in a week", "verified": true, "helpfulness": "0/0", "author": "mark ranieri jr"}, {"rating": 1.0, "review": "Got this as a gift and absolutely hate it.  Well, it's a great 'idea' but the designers didn't think things through.  As other reviewers have said, there is no way to separate PAY items from FREE ones.So- Amazon Fire is really marketed as this great thing but really you are paying 99 bucks to be able to have them advertise to you constantly by shoving pay items on your screen and you have to take so much time going through them to get to something you actually paid the 99 bucks for.Again, mine was a gift so at least I didn't pay for it.It's so frustrating when all I want to do is watch a movie, to get the 99 bucks worth, and I get to the point I switch to the tv because it's too much of a hassel to use this product.I went online hoping to find a site with an itemized list of things I can watch, maybe that would save me some time.... but nope... so I submit this review instead.", "verified": false, "helpfulness": "3/8", "author": "mlee"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Annette Snyder"}, {"rating": 4.0, "review": "My only real complaint is that when you use the remote to search there is no separation of prime content and pay content.  We have only been using our fire tv for about 2 weeks so we are still learning our way around.  I think our family will have many hours of enjoyment using our fire tv.", "verified": true, "helpfulness": "0/0", "author": "Lois Fugate"}]