[{"rating": 1.0, "review": "Not very versatile and allows limited streaming from iPad. Read up on this device and know it's limitations before buying.  There are many great reviews of this device, but I just don't get it.  The very limited streaming capability from mobile devices is a big letdown. It would be a nice companion to a chromebook, for some, but I much prefer my Roku. If Google gives it considerably more capability in the future, I will consider again.", "verified": true, "helpfulness": "1/2", "author": "BeeJ"}, {"rating": 5.0, "review": "Works great for me. I watch free movies from the internet on my TV with out wires. Plug it into anyone of my tvs and it works. May buy another one for my other tv. Thanks, it's a good product. Everyone needs one.", "verified": true, "helpfulness": "0/0", "author": "zebors \"old man\""}, {"rating": 5.0, "review": "This is an awesome and affordable product comparing to other similar products in the market.It not only delivers HD quality video from Netflix and HBO GO, but also plays any MP4 file from your local hard disk.You can simply type file:///C: in Chrome URL field to browse your C drive of your computer and double click on any MP4 file to play & cast it to your TV.", "verified": true, "helpfulness": "3/3", "author": "javalatte"}, {"rating": 5.0, "review": "Extremely easy set-up!  Took less than 5 minutes out of the box!  Used WPA protected network and NT an open guest network with password b/c if I chose open network w/password it didn't give opportunity for password - so be forewarned! On WPA protected network, it gave me opportunity to input password.  Also, please note, the chrome cast extension for the Google browser only available on Windows devices running chrome,not android tablet platform  YET. Just FYI. Love Netflix, hulu plus, u tube and Google play on the Comcast!!  Love the price of chromecast!  Right now I move from tv to TV but eventually, I will probably buy more as cast compatible additions occur....just do it!", "verified": true, "helpfulness": "0/0", "author": "Suzanne  Dill"}, {"rating": 1.0, "review": "The item doesn't work as advertised. The only thing I can get to cast is youtube. Netflix just stays on the loading screen and hbo go loads for a few seconds, stays on a blank screen for a minute, then resets to the chromecast default screen. I tried emailing google support but they were completely useless and barely even tried to help. I'm exchanging this for a roku box.Edit:I got someone on the phone who was extremely helpful. As it turns out you can only cast from your phone or tablet because the websites use silverlight which is not supported on the chromecast. I'm leaving it at the 1 star because it is completely ridiculous that I cannot cast from google's browser when they are the ones that made the damn thing. It took a 30 minute phone call for the rep to even figure that out because no where in the troubleshooting does it mention that.", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was surprised by how easy this was to setup, easy enough that I may give it as a gift to some less technical relatives this year.  I was casting netflix and youtube to my TV in minutes after opening the box.  The only issue I have is that I spend a lot of time on a VPN so my laptop doesn't see the device but that is unavoidable.  Definitely nice that you can cast one tab from chrome while doing something else on your computer, I was a bit worried that I would have to let Chrome have focus on my computer screen all the time while using it.", "verified": true, "helpfulness": "0/0", "author": "clark ross leininger"}, {"rating": 1.0, "review": "just seems like that it your laptop has an hdmi port you can do all the same things without this device.", "verified": false, "helpfulness": "1/5", "author": "pcdctr45"}, {"rating": 4.0, "review": "Excellent! Occasionally loses the connection during playback, which may be a function of the quality of the Wi-Fi signal. Great way to view Netflix streaming.", "verified": true, "helpfulness": "0/0", "author": "P. Davis"}, {"rating": 2.0, "review": "This thing is not a breeze to use.  Tedious as a matter of fact.  The Ruku is better and easier.", "verified": true, "helpfulness": "0/2", "author": "mcc"}, {"rating": 3.0, "review": "its great if you only want netflix ,as there is nothing else there.If there is a way to add more sites and someone knows how please let me know", "verified": true, "helpfulness": "1/1", "author": "paakaa"}]