[{"rating": 5.0, "review": "Takes 2 minutes to set up the unit and the rest is history. As Google expands the functionality and partners with more services, the value of this little piece of technology will only grow.", "verified": true, "helpfulness": "0/1", "author": "D. Kover"}, {"rating": 5.0, "review": "It works great.  I will love it even more when more providers sign on to provide more content. No problems!", "verified": true, "helpfulness": "0/1", "author": "GreenBullet"}, {"rating": 4.0, "review": "The Chromecast is a fantastic HDMI dongle for users who don't have a smart TV or a streaming appliance. Currently it's limited but the potential of this device is limitless.", "verified": true, "helpfulness": "0/1", "author": "Naurry Kwon"}, {"rating": 3.0, "review": "Not so good for streaming video.  It's reliance on Wifi limits throughput and often times causes video to be choppy.", "verified": true, "helpfulness": "1/2", "author": "st303"}, {"rating": 5.0, "review": "I'd been waiting for (& dreaming about) something like this for a very long time. I have a Roku XD/s player, but Roku doesn't play well with Google, so I was never able to watch YouTube, or listen to my Google Music All Access. The Roku did support Netflix, but it was really flaky - Every time the network bandwidth fluctuated, the thing would stop, re-buffer, and re-start in low-res mode.Drove me nuts.Not only does the Chromecast support the \"missing Google services\" Roku doesn't support, it's MUCH more reliable... Rather than constantly stopping, and re-starting, it dynamically adjusts resolution during bandwidth fluctuations, and does it so well, it's barely noticeable.If you absolutely must stream local content from your PC or phone, stick with Roku (the XD/s supported that pretty well), but if you want the simplest, most reliable streamer of cloud media, this thing's a winner.Great work, Google!!", "verified": true, "helpfulness": "0/1", "author": "T. Rodman"}, {"rating": 4.0, "review": "Im usually an early adopter of many things, so whe  i sw this at this price i just had to give it a go. I by no means needed it, i own a Xbox360, PS3,WDTV live new and old plus have an HTPC, all thes hooked up to diferent tvs in my apartment. But i must say one thing, this things is astonishingly simple to use. Android has always had my vote as a great Os when paired with the right ahrdware and this just adds value to it. It really is child proof..my 7 year old ussue it with no issues to view netflix from her tablet as well as youtube videos. In that scenario in which i have a old sony bravia, lcd tv it does wonders...for me its still need more support but i assume its just a matter of time, once the apps get updated this will be the best streamer money can buy...especially because the hardware is not necesarily the limiting factor..if you can program for it, than theres no telling how much you can do with it..", "verified": true, "helpfulness": "0/0", "author": "Francisco Ortiz"}, {"rating": 5.0, "review": "The Chromecast unit came in a small compact box, with operating instructions inside the cover of the box.  I had it up and running in less then 10 minutes using the USB Port.  Just to make certain I also hooked up via the power plug and that worked great.  Signing on with my Google ID was fast and clean.  Within seconds I was casting to my TV.Google Music and Google Movies played flawlessly and I can now see and hear them on my home theater setup.  What a difference.This item is clearly worth the cost.  If you subtract the free 3 months of Netflix the real cost of the item drops to $11.00.The unit does get warm but it doesn't seem to effect its use.", "verified": true, "helpfulness": "0/0", "author": "Thomas F. Lonergan"}, {"rating": 5.0, "review": "They've done it again! What a great device and for $35 dollars and the original free 3 months of netflix who could resist. This thing is still a work in progress but has huge potential. It works great for supported apps like netflix and youtube along with chrome browser casting. Can't wait for them to roll out the full SDK so app developers can utilize it. If you want to stream local content from your computer onto your tv just drag it into the chrome browser and poof it will cast.", "verified": true, "helpfulness": "0/0", "author": "Houston, TX"}, {"rating": 1.0, "review": "Yea, I just bought this P.O.S on Saturday and the freggin thing doesn't work as fluidly as it sounds. Through my Ipod/Ipad/Laptop/iphone it takes forever to connect to the TV and I have Time Warner Turbo Internet package so it's not my internet speed.  Once it does finally connect the streaming looks horrible \"this is viewing Netflix\" and the other times the sound doesn't work.It gets better, you use your phone or ipad as a remote that has a 30sec lag time or more to the TV.  SO basically, you sit around watching a loading screen for most of your day.  If it does start working properly don't touch anything or you'll start this crappy process all over again.Needles to say I'm returning it today.", "verified": false, "helpfulness": "3/8", "author": "B_DUB_311"}, {"rating": 3.0, "review": "can not cast chrome tabs from Tablet!Works well but not enough usability yet.  Holds wifi great, will be a nice unit once someone writes apps fro web browsing, pandora, and local media", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]