[{"rating": 2.0, "review": "I was disappointed with just a few options available. I also have an Apple TV and am much more impressed with its capabilities. The Chromecast does not mirror your device. Your tablet or phone acts more like a remote control. I hope Google adds more features with only a software upgrade required and not having to purchase a second generation version. For now, I think the premium for the Apple TV us well worth it.", "verified": true, "helpfulness": "0/0", "author": "Barry B"}, {"rating": 5.0, "review": "I purchased this product as a Christmas gifts and she loved it.  It works great and great design.  I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "ymen"}, {"rating": 1.0, "review": "I purchased a Chromecast to use for work and home use. I work in IT and thought it would be nice to wirelessly transmit some of my work to the TV for client interactions and for streaming things at home. The device setup and connectivity was flawless, but I had horrible transmission errors. I run a 100MBPS connection from Time Warner with a custom firmware setup on my Linksys N Plus router. I can stream things wirelessly from my windows home server to my Xbox, PS3 and Roku seamlessly, but whatever I would try to watch on the chromecast was choppy and out of sync, lagging considerably. I tried various setups with DNS and Port Forwarding but could not get around the poor streaming quality of the device. I'll hang onto it for now, but unless there are major firmware updates I'll stick with my other devices.", "verified": false, "helpfulness": "1/1", "author": "Kayla Hardinger"}, {"rating": 5.0, "review": "Excellent device. Huge bang for your buck and will only get better. Highly recommend for Netflix and You Tube on your big screen.", "verified": true, "helpfulness": "0/0", "author": "w"}, {"rating": 4.0, "review": "Super device!! Great for adding I internet Apps to an older HDTV.  Also enables me to show my smartphone and tablet screens on my 42\"\" flat screen to share with others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The product works as advertised, but is limited to mostly android applications. As a Mac user, I see some Mac applications, with more promised. Ruku is more expensive, but a better overall choice. For the price and android users, a great value.", "verified": true, "helpfulness": "0/0", "author": "Fred Hofer"}, {"rating": 4.0, "review": "Great product but not perfected. If you use netflix and YouTube a lot will be happy but some people have issues with other apps. I use it a lot for my old tv and use netflix more often now", "verified": true, "helpfulness": "0/0", "author": "Luis F Cruz"}, {"rating": 1.0, "review": "Won't work with older operating systems like Windows XP and will only work with a two page list of WiFi routers :(", "verified": true, "helpfulness": "2/2", "author": "LatitudeAdjustment"}, {"rating": 5.0, "review": "Best little gadget ever! No crazy wiring or hard to set up crap! Simple, easy and works like a champ!", "verified": true, "helpfulness": "0/0", "author": "Jersey4Life"}, {"rating": 4.0, "review": "Chromecast works, well enough for me to buy a second for the other large TV. There are very few vendors on board with it so far, but they are the ones we watch. There is some hesitation and low res on some movies/videos depending on the source, time of day (internet speeds available) but I've seen that will other brands of device.My main complaint so far is that there are currently few apps to cast from an iDevice to the Chromecast. Even Google's Chrome web browser on the iPad does not cast to the chromecast. In my case only HBOGO and Netflix cast to the chromecast from my iPad.From my MacBook Air, anything I see in my Chrome web browser I can cast to the Chromecast on the TV. Very useful.Be aware you need a TV with an unused HDMI port AND an AC electrical outlet OR an unused USB port on the TV itself.", "verified": true, "helpfulness": "0/0", "author": "n71403"}]