[{"rating": 4.0, "review": "very helpful. very easy to use. nice design - slim and small. need a good internet connection because it connects thru the router.", "verified": true, "helpfulness": "0/0", "author": "A. sethi \"dieselx\""}, {"rating": 4.0, "review": "I like the idea of using my handheld iOS and Android devices as a smart remote.  I was also pleasantly surprised that the Chrome extension not only casts a tab, but also allows the web version of the supported apps to work as a remote control as well.  My only criticism is that it only works on 2.4GHz (e.g. 802.11n) and it struggles competing with the bunch of other devices in my home being wireless devices or the microwave.", "verified": true, "helpfulness": "0/0", "author": "dash-o"}, {"rating": 1.0, "review": "Chromecast refuses to connect to 2wire routers, disabling a significant portion of internet users from using this device. I think I'll go for Fire TV instead... If it connects to your router, then it's a good buy.", "verified": false, "helpfulness": "0/1", "author": "Klc40"}, {"rating": 4.0, "review": "I purchased this first week when it was released in canada. In box came with the chromecast, the power cable that you need to plug into the tv to power the device and a dongle in case you have a incaptiable spaced port.It was very easy to set up with the chromecast app, but i must say, it didn't look like how they advertised it, came with alot more cable than I expected. Once you get the chromecast setup, the app is pretty much useless, unless you create new password or switch modem(which I had to and had to reinstall)Originally, there was not a lot of support, only supported the listed few apps however as they released the SDK to developers, it really became a prize jewel. Web video cast is a must have if you wish to stream from your phone/tablet to your chromecast from website video.I gave it 4/5 as it still is more limiting than I orignally expected, but for $40 it is a great buy still.", "verified": false, "helpfulness": "0/0", "author": "Kelvin Chung"}, {"rating": 3.0, "review": "Chromecast isn't everything it says it is. Spend the little extra to get something  better. Apple TV, or something else.", "verified": true, "helpfulness": "0/0", "author": "Woody Klemetson"}, {"rating": 5.0, "review": "We have an older HD television without any smart TV features. But this simple device plugs right into the HDMI port on the TV and works seamlessly with phone and tablet apps as well as Chrome web browser from your laptop or desktop. My family watches a lot on YouTube and this is the perfect way for us to share our favorite YouTube videos with one another. HD videos look awesome on Chromecast, even on our 720p TV.", "verified": true, "helpfulness": "0/0", "author": "J Tyler"}, {"rating": 5.0, "review": "I use hulu and netflix religiously. This works great for both, I will be purchasing a second one for my other TV!", "verified": true, "helpfulness": "0/0", "author": "ryanredbaron"}, {"rating": 1.0, "review": "It's hard to watch videos when the chromecast doesn't work, which is frequently. The Chromecast rarely stays connected when idle. Also, the extender isn't long enough.", "verified": true, "helpfulness": "1/2", "author": "Brett Davidson"}, {"rating": 5.0, "review": "I love that I can carry this to anywhere I go. But the best part is the price. For $35 you cannot ask for more.", "verified": true, "helpfulness": "0/0", "author": "Luis Sanabria"}, {"rating": 1.0, "review": "I cannot get the chromecast to work for any media at all. There is always an error. I am very disappointed", "verified": true, "helpfulness": "1/2", "author": "Bullie Nation Rescue"}]