[{"rating": 4.0, "review": "I love the Google chromecast ! It's easy to install and use with my Iphone. If you change your wi-if service it can be reprogrammed and the password changed. I have the chromecast on all my tv's. It's a great little gadget and Google is adding more apps and the price is super reasonable.", "verified": true, "helpfulness": "0/0", "author": "Yvette Mendez"}, {"rating": 5.0, "review": "Awesome device!!", "verified": true, "helpfulness": "0/0", "author": "Julio A. Carrasquillo"}, {"rating": 4.0, "review": "very good item.", "verified": true, "helpfulness": "0/0", "author": "harry ramey"}, {"rating": 5.0, "review": "This item was so easy setup and use.  I love it.", "verified": true, "helpfulness": "0/0", "author": "LEGALCHICK"}, {"rating": 2.0, "review": "it's an interesting ideato have this product with no remote control but I would rather have remote control.to me this is just a creative way to stream everything from either your phone or your computer wirelessly to your TV, I'd rather have a product that has All Access to everything I want without having to use my phone or pc. I give this to my daughter for her to try since she has a small TV in her room.  she uses a daily so I guess I'd rather have her write a review. Initially for the few times I've tried it I'm not impressed", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Clifford G Donley III"}, {"rating": 2.0, "review": "I have had difficulty connecting it for Netflix . I need better instructions for trouble shooting.  I am not a techie at all, so need all the help possible.", "verified": true, "helpfulness": "0/0", "author": "Margaret J Brede"}, {"rating": 5.0, "review": "No issues at all. It's worked flawlessly and I really like the \"beta\" feature of sending what's on my computer screen to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Russell Smith"}, {"rating": 5.0, "review": "This is a recent purchase and we are just starting to use it...so far so good. Easy to set up and use and we anticipate a great deal of usage.", "verified": true, "helpfulness": "0/0", "author": "Monique L Ferguson"}, {"rating": 5.0, "review": "worked well, son in law was very happy", "verified": true, "helpfulness": "0/0", "author": "ernet wheeler"}]