[{"rating": 5.0, "review": "There is one reason and one reason alone that I'm moving away from Roku 3, and it's not Fire TV's voice search (I could care less about talking into a remote).  Fire TV's HDMI port is very snug, to the point where I was initially concerned that my cable would not connect to the box.  However, it satisfyingly clicked into place, and I have not had to worry about the cable since.  The port on my Roku 3 was tremendously loose, and for all the joy I got from getting access to Vudu and several other apps I had yet to get on a box, my Roku 3's loose HDMI port was not something I could let go of.Fire TV also gives me access to my Amazon Flixster app - the one that actually lets me watch and purchase movies, not simply watch previews like the Flixster app for Roku.  These two benefits more than make up for me losing Vudu, which I'm sure will come to Fire TV in due time anyway.", "verified": true, "helpfulness": "1/3", "author": "Cleft Dad"}, {"rating": 5.0, "review": "At this early stage, it is everything it was promoted to be. Would love to get more Showtime app providers and possibly everything will be available through voice search soon, but for now it works great!", "verified": true, "helpfulness": "0/1", "author": "JW \"JW\""}, {"rating": 5.0, "review": "The unit was very easy to hookup.  It is also very easy to use and it is surprising with so few buttons.The only thing I wish you are able to do is to turn it off without having to disconnect the power.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Wanted to run Channellive TV and even though Fire is Android device, I could not find a way to run this.", "verified": true, "helpfulness": "2/10", "author": "Raj"}, {"rating": 1.0, "review": "Fire TV is a disappointment to us.  We purchased it  immediately on release in late April specifically to stream \"Free\" Amazon Prime content because our Samsung blu-ray does not have an Amazon Prime streaming app.  I emphasize \"Free\" Amazon Prime content.  I didn't want a device that would facilitate purchasing content from Amazon Prime streaming.  That's why I pay an annual fee.  To stream free content.  The disappointment is that through Fire TV's Amazon Prime app, the \"Free\" and pay-to-view content is combined making it tricky to select plus much \"Free\" content is hidden and not available. (I know is hidden because the ipad app is revealing).We are so disappointed in Fire TV device that we have allowed our Amazon Prime membership to lapse at annual renewal time.  The decision is based on disappointment with Fire TV soon following 25% increase in Amazon Prime yearly fee.  Amazon acknowledged they would lose some subscribers due to 25% price increase.  We will miss Prime shipping but cost:value ratio is not good enough and we decided the best vote is with our wallet.", "verified": true, "helpfulness": "1/1", "author": "Hikker"}, {"rating": 5.0, "review": "THIS HAS QUICKLY BECOME ONE OF MY FAVORITE THINGS.  I HAD CONSIDERED SIMILAR DEVICES SO WHEN AMAZON TOLD ME ABOUT THIS ONE I PURCHASED IT.  IT WAS EASY TO CONNECT TO TV AND SIMPLE TO USE.  I AM AMAZED AT THE NUMBER OF MOVIES, TV SHOWS, ETC THAT ARE AVAILABLE.", "verified": true, "helpfulness": "0/2", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It worked for a couple of weeks and then stopped working.  Amazon send a replacement immediately.  Unfortunately, had the same problem.  I changed the cable, rebooted the receiver, and tried everything.  It worked for one day and then it would not turn on again.  I am returning it for a refund", "verified": true, "helpfulness": "5/11", "author": "Vicky Barber \"barbersaiki\""}, {"rating": 4.0, "review": "The voice search is great and the machine is highly responsive. It needs a universal search as good as the Roku. The range of apps is a little disappointing. Only one weather app, and no good news apps. However, the selection should expand with time.", "verified": true, "helpfulness": "1/1", "author": "Dayton"}, {"rating": 5.0, "review": "I love the size and the amount of use I get out of this thing. I use it mostly for streaming video (Plex, Netflix) and games pretty much daily. Although there's a couple of major cons, they only warrant knocking off one star considering how much I really like the rest of the device. Having an Android-based streaming device is really fantastic.Pros:+ Very small form factor & powerful hardware+ The remote is surprisingly easy to use and can navigate menus very quickly+ Supports almost every type of video streaming I want to watch (amazon instant video, netflix, youtube, etc)+ Turns on instantly, and loads up whatever entertainment I'm in the mood for almost just as instantly.Cons (Mostly fixed, see updates below):- (Fixed! See update below) Missing HBO GO- (Mostly fixed) Not enough games on the app store- (Fixed! See update below) Too difficult to find just the \"Free\" Amazon Instant video choices that I want to watch. If I'm paying for Prime, the free options should be MUCH easier to find. I end up hardly using Amazon Instant Video because of this, and AIV was one of the main reasons I bought this device in the first place.UPDATES:1) Now it has HBO GO! Nice!2) They started adding \"Prime\" tags to shows/movies that I can watch with my prime subscription without paying extra. Much nicer and easier to find. Almost all of the prominently displayed items are available with prime it seems.3) There's some decent games on here now where before it felt like there were none. Could always use more of course!With the improvements they've made to the device, they've earned an extra star from me. Definitely one of the most-used media devices in my apartment.", "verified": true, "helpfulness": "2/2", "author": "Fig Martin"}, {"rating": 5.0, "review": "I just received my Amazon Fire TV and I absolutely love it. I have watched so many shows and movies that I haven't seen in a long time. Installation is so fast and easy. Just plug in and find your wifi and you're good to go. There are no hoops to jump trough...just watch some fabulous TV.", "verified": true, "helpfulness": "0/1", "author": "bpoarch"}]