[{"rating": 5.0, "review": "Excelent product!", "verified": true, "helpfulness": "0/0", "author": "Filipe Martins"}, {"rating": 4.0, "review": "Fast shipping great product.", "verified": true, "helpfulness": "0/0", "author": "Julie Brousseau"}, {"rating": 5.0, "review": "What can i say. Chromecast is awesome. You can stream your T.V. screen directly from you phone. You can send a show from an app so the chromecast takes care of the playback(e.g. netflix, youtube). You can send your photos to the T.V. to look at them with your friends. you can even, using Chrome browser, stream your desktop from your PC.", "verified": true, "helpfulness": "0/0", "author": "jose luis"}, {"rating": 5.0, "review": "Does exactly as advertised. Beautiful picture if your internet service provider's download speed is fast enough. Still wish there was a way to stream the same content from one device to two separate Chromecasts. Have not found anyway that anyone has discovered that works without a hitch.", "verified": true, "helpfulness": "0/0", "author": "Larry LaRue"}, {"rating": 1.0, "review": "WARNING:  IT does not work with our existing Comcast router(called Comcast to confirm). Need to reach out to Comcast before purchasing to make sure it is compatible with what you have before you purchase!  Either have to return or get a new router.", "verified": true, "helpfulness": "0/0", "author": "Paula Michelle"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Joe Edwards"}, {"rating": 4.0, "review": "I liked it but ultimately had to return it due to interference and lag. If I was in a less populated are I'm sure the streaming would have been spotless. I ultimately went with an Amazon basics HDMI cord", "verified": true, "helpfulness": "0/0", "author": "Craft Commerce"}, {"rating": 5.0, "review": "Bought this for my husband.  it works well, and it's much cheaper than the Apple tv!", "verified": true, "helpfulness": "0/0", "author": "Kimberly J Zippie"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "sheetal hemrom"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Nasser Aljoohe"}]