[{"rating": 3.0, "review": "Keeping it short.The item itself and how it is set up is great. Its easy to do and installing the device to your TV only takes a few moments. Downloading the file that allows you to use the Chrome browser is also easy and painless. It also is very discrete. Its small, a little longer and wider than a normal sized flash drive. The wires can be long or short and it has the ability to use the USB port on your TV as a power supply, no long cord across the floor. 5 stars for all that.The application itself though, that is where the device hurts for me. My biggest issue was the LAG. It was slow and unresponsive at times which is really annoying. In the end it would work but a a large majority of the times I tried to set it up for HBOGo, Netflix, or Browser streaming, it would freeze completely or take long enough to load that I would turn it off all together out of frustration. So, LAG and unresponsiveness was a huge issue for me.Now for supported feature. Simply put, there isn't enough. I would suspect over the next year this thing will become an awesome alternative with lots of applications and supporting feeds.Overall, I am disappointed and would tell you that this device is in a public Beta Phase. They will see responses like mine and adjust accordingly. This is google and I believe this product is on its way to becoming something great but right now, its a weak competitor. If it works great for you, awesome. I would suspect there are a lot more people like me than people who have a flawless device.Ending advice: Buy if you want but I would recommend following its progress and plan on this being a must have item for the 2014 holiday season. By then the kinks will be worked out and many more streaming sites will be available, (Insert sports network here), Anime streaming, news outlets, etc. This is a great invention but it is still working through its shortcomings.", "verified": true, "helpfulness": "0/0", "author": "Matthew A. L. Smith"}, {"rating": 4.0, "review": "Neat device, we use primarily to stream music and to view Netflix to our smart TV that has a horrible built in Netflix app. As of this review, 1/21/14, the ability to stream local content from a computer is still in beta and does not work perfectly.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Bugbee"}, {"rating": 3.0, "review": "The description fails to mention that an app for the iPad has not been released yet so that you can mirror your iPad in every aspect. If you are a dual household with PC laptops, then you are good to go. You can 'cast' anything and everything to your tv. Great gadget for the price. Good for iPad users if you only want to watch Netflix and YouTube. Certainly a good price.", "verified": true, "helpfulness": "0/0", "author": "Teacher of the Gifted \"GA Teacher\""}, {"rating": 5.0, "review": "I love being able to go from app to app on my tv to watch certain shows.  Listening to Pandora makes it even better!  Also like that you can use it on different tvs as well.Great price too!!", "verified": true, "helpfulness": "0/0", "author": "PrncsWarior"}, {"rating": 5.0, "review": "Now that all the apps have come out for the Chromecast... this thing ROCKS!  I can have people over at my house, us my internet, and show their favorite youtube stuff up on the tv.  You can watch HBO GO and now with Plex I can watch my downloaded movies... I take this with me when I go out and travel for work.", "verified": true, "helpfulness": "0/0", "author": "Joshua Mode"}, {"rating": 5.0, "review": "Our son broke our Apple media player and I wasn't going to replace it but $35 for the Chromecast convinced me, and it works just great.", "verified": true, "helpfulness": "0/0", "author": "Belle Gayer"}, {"rating": 5.0, "review": "I've had Chromecast since launch and it's become an indispensable part of our living room (and our travel regimen).  There are several different ways to watch YouTube, Netflix, Hulu+ and HBO Go on my TV, but Chromecast is my favorite: it's simply easy to fire up the app on your smart phone or tablet, or on your PC, Mac or Chromebook, and send it to the TV - in great quality - with the press of one button.  I've also started using Chromecast more and more to stream music from Pandora, Songza and more to our living room TV - connected to the best speakers in our house.I expect Chromecast to continue to add more of the apps that are important to me and improve the features continually.  For $35, Chromecast is a must have for the living room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Now with Hulu, HBOGo, Pandora and a bunch of other apps, I love it even more.  I use it at home with my ipad, my Nexus7, my ipodtouch, my mac and my chromebook", "verified": true, "helpfulness": "0/0", "author": "Antoine"}, {"rating": 1.0, "review": "If you only use Google, good.  If you use other services, this is NOT what you want.  Returned and replaced with Push2TV", "verified": false, "helpfulness": "2/2", "author": "Michael R. Books"}, {"rating": 4.0, "review": "I noticed that Google's Chromecast crashes sometimes. It worked well for the 1st 1 month or so but later on it starts to hangup after perhaps an hour or two of streaming...", "verified": true, "helpfulness": "0/0", "author": "Solve ASAP"}]