[{"rating": 3.0, "review": "So far we've tried 4 times to make it work and it doesn't yet.  So what should I say?", "verified": true, "helpfulness": "0/0", "author": "kauber"}, {"rating": 5.0, "review": "This might be the best thing ever. The streaming quality is amazing and works so smoothly. You can literally cast anything from your computer. You are limited to apps on the iPhone but that doesn't even matter if you're mainly using it for Netflix. Great product.", "verified": true, "helpfulness": "1/1", "author": "daniel lei"}, {"rating": 5.0, "review": "This works great.!", "verified": true, "helpfulness": "0/0", "author": "dreeme1 \"PA Man\""}, {"rating": 5.0, "review": "This. I have two of these and love them. I run a media server in my basement and use Plex to cast to my chromecast. Which also works with my Roku XD 2.", "verified": true, "helpfulness": "0/0", "author": "Obes \"S. R.\""}, {"rating": 1.0, "review": "Projects only Google Chrome program. Streaming was slow, laggy and pixelated.", "verified": true, "helpfulness": "0/0", "author": "Bob Kane"}, {"rating": 5.0, "review": "VERY easy to use.... but seems to only work with You Tube.", "verified": true, "helpfulness": "0/0", "author": "Floyd Sheldon Lee"}, {"rating": 5.0, "review": "Chromecast just continues to get better.  Google is really active with keeping things happening with Chromecast, and constantly adding apps, features, and functionality.I have used mine behind a TV, and it is currently plugged into the HDMI passthrough of my Xbox One and it works great, even without the dangle extender they have.I rarely have issues holding a connection.  Sometimes it's a little slow to catch itself up when starting a new HD youtube stream or something, but almost without fail, once it gets going it stays going.  There are rare times when it may drop, but I'd contribute more to my home wifi and router setup than to the Chromecast.It's a simple device, but performs amazingly, and in my opinion is a must have, Android user or not.  Obviously you can get more out it if you use more Google Apps.  It is especially necessary for others like me who have made the household a cable company free zone (for TV service at least)", "verified": true, "helpfulness": "0/0", "author": "R. Dodge"}, {"rating": 5.0, "review": "Having experienced a friend's Chromecast at her house, I immediately knew that I needed one.  I'm not sure why it took months of watching friend use her Chromecast before I ordered one, but I'm so glad that I finally did it.The Chromecast easily connects to the TV through the HDMI port, and powers itself through the USB port.  Chromecast is expanding its compatible apps, and I am able to now almost completely eliminate the use of my usual TV--HDMI cord--computer setup that I have for ages.  I can watch Netflix, Vudu, HBO Go, Xfinity...the possibilities are endless.  Cable and HDMI cords are going to be a thing of the past, and I highly recommend the Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Katie"}, {"rating": 2.0, "review": "Dissapointed . Purchased two at the same time. They both worked for about two days. I returned them and got new ones. Unlike the first two, the new ones did not work at all, so I ended up returning all four. What a waste of time. Google needs to figure out what is wrong with this product. It was great those first two days, then after that when you plug it in to your TV, it goes to green and flashes to red within seconds. If they can fix it, I would probable get it, but for now, i would not recommend it.", "verified": true, "helpfulness": "0/0", "author": "Teresa F. Amara"}, {"rating": 5.0, "review": "Awesome! Great purchase that takes your home entertainment to the next level. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Andrew D."}]