[{"rating": 4.0, "review": "Very good device...Just we need more popular apps. to be used on chromecastThanks for Google on this product", "verified": true, "helpfulness": "0/0", "author": "Wesam Al-Khatib"}, {"rating": 5.0, "review": "Works as advertised.Reasonable price. Check this one out. You'll be Surprise with the hd quality.A very small device yet so powerful.", "verified": true, "helpfulness": "0/0", "author": "str"}, {"rating": 5.0, "review": "this makes my smart tv like a giant computer screen.  I love playing videos directly from my smart phone on my tv", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Everything I expected from this magnificent device. I would highly recommend this device to my friends and family around the world.", "verified": true, "helpfulness": "0/0", "author": "William Bermudez"}, {"rating": 4.0, "review": "As one who is somewhat obsessed with watching Netflix movies on the living room TV, I was quite interested in Chromecast (an HDMI dongle used for streaming supported apps to a TV). Until my purchase, I have been using an HDMI cable to mirror my laptop’s screen to my TV; this worked efficiently, though I was looking for more of a wireless type connection. I purchased 2 of these devices, one as a gift to a friend (in Canada), and one for myself (in the U.S.). Thus far, the product works as expected.I typically use my Nexus 7 tablet to mirror Netflix or YouTube via Chromecast to my TV. I love having the capability of using almost any device as a remote for Chromecast. Though, for some this may be an issue, as you will need to always have some sort of device to control Chromecast. Chromecast is quite small, cheap, and is definitely a “bang for your buck.” After receiving the product, I was prompted to install a firmware update; unfortunately, this firmware update took several hours to install. I was quite eager to use the device, though was extremely bothered by such a long wait. I do however appreciate such an update. Now, despite that, I highly recommend Chromecast to anyone who is looking to replace their wired connection (ie: HDMI cable).Pros:- Easy to useI particularly like the YouTube queue feature. It’s exactly what it sounds like; it allows one to queue videos (in a list) to be automatically played in order. - Easy to set up - Compact - CheapCons: - Slow firmware update (for me it took several hours to download) - Limited to Chromecast’s apps and Google chrome for streaming - Netflix may freeze every so often in order to re-buffer the videoI hope this helps a consumer make a better informed purchase. If you found this review to be helpful, please let me know :).", "verified": true, "helpfulness": "0/0", "author": "Ninja"}, {"rating": 5.0, "review": "i have a desktop computer not wireless but wired ethernet using chrome with chromecast i can stream to the tv wireless. i do not know how this works. but i can stream all the internet wireless to the tv. what i see on chrome is on the tv. You go to setting in chrome browers to extensions to type in chromecast in search box press enter. Go down the list to google cast click on it go back to extensions click emable it . go to the internet site you wish to cast click on the cast button at the top right corner and start streaming to the tv. this working windows 7 64bit but i find it will work on windows vista to. it works wireless or wired ethernet to router.", "verified": true, "helpfulness": "0/0", "author": "jrsodd"}, {"rating": 1.0, "review": "This might work with Netflix or other services, but just returns error messages over and over again with YouTube (the only reason to use it, as I already have a Roku). Even with excellent Internet speed, it plays about 1 out of every 10 YouTube videos part way before failing. The other 9 times it just returns an error message. I've reset it to factory specs, restarted, and given it every chance to work. Perhaps this one is just a lemon, but it's not worth it to get a second one when a three-year-old Roku box just works.", "verified": true, "helpfulness": "0/0", "author": "BigEasyKev"}, {"rating": 4.0, "review": "It works. Nothing much to say. Took a couple tries to get it connected to my router (Actiontec, on Telus in Canada). One thing buyers should know is that tab casting from the Chrome browser is not perfect, at least yet. I had to plug in my laptop to get full CPU speed, plus use the included HDMI extender to get better reception, in order to get smooth playback in streaming video sites. You may still experience some lag and/or audio sync issues though, and you won't be able to run the tab casting in high resolution unless you have a very fast connection. Unfortunately my TV is far away from the router so I don't get the best connection. Youtube works excellently. Great price for such a capability. Looking forward to new developments.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Sun"}, {"rating": 5.0, "review": "this is not as good as apple tv, still has ways to go but a good 1st attempt.it works well for what is advertised.live tab cast is a bit laggy but manageable.", "verified": true, "helpfulness": "0/0", "author": "Vasy"}, {"rating": 5.0, "review": "I live in Perú so app support is very limited so I get to use it for Youtube only. And even for that and the price I paid for it I am more than happy. It completely replaces how I watch TV. I just setup an hour or so of videos and that's how I watch TV now.It is a shame that it is only Youtube and you cannot really cast your laptop or browse the web from it. Also when you see some other video (Vimeo, or any other flash based video) cannot be played. But for the price it is really great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jjdelc\""}]