[{"rating": 5.0, "review": "Picked this up to be able to stream netflix, youtube to another tv, very easy to setup. good connection to router which is on another floor, they also give you an extension for HDMI if needed also says it helps with reception. My tv doesn't have a usb port so I did have to use the cable/socket provided to power it, just plugged into power strip.", "verified": true, "helpfulness": "0/0", "author": "HCF"}, {"rating": 5.0, "review": "4/22/14 -- I've had this thing for a few months now and it's working great.  I think they must have updated it because the few bugs I had (it stopped turning my TV/Surround on over HDMI-CEC (aka Bravia Link, etc...) but that only happened briefly) with it went away pretty quickly.  I use it about 90% for Plex and randomly for HBO Go or Netflix and the rare YouTube video.  I'm done with the worthless vizio costar garbage, they refuse to fix the software.  I just use this thing now!------------Now that this supports Plex, it's pretty awesome.  Plex permits you to play all the local media you have!  I got these for a bunch of people for Christmas and everyone is using them.  Once it's setup, it's extremely easy to use (and it's really easy to setup--especially if you have and android device).  It's easier to use a phone or tablet to find a movie on Netflix than trying to use the TV's UI with most TVs.  All you do is find the stream you want to watch on your phone and send it to the TV.You need to know what you're buying, though.  If you expect to be able to browse hulu and webpages directly from the device, you're not going to be happy... it doesn't do that.  It's solely meant to sling media to from your device or your computer and only from supported apps/chrome.  You have to use your phone to control playback, remotes don't work.  For $25-35... it's pretty cool.", "verified": true, "helpfulness": "0/0", "author": "R. Ellis \"Eric\""}, {"rating": 5.0, "review": "You just connect it to your TV, connect it to an outlet, switch over to the hdmi input that it's plugged into and voila! You'll be streaming entertainment like it's nobody's business!", "verified": true, "helpfulness": "0/0", "author": "Sumit Gandhi"}, {"rating": 5.0, "review": "I did some research on the various products that were out there where I could stream Netflix, etc.  This one caught my eye because it was so small and portable.  I am amazed at how easy it was to set up and how I can just unplug it from the living room and move it up to my bedroom without any extra set up.  Just plug and play.  It's awesome.  My TV's won't power it alone on the HDMI port so I have to use the USB cable as well but no big deal since both of my TVs have a USB port right next to the HDMI port!", "verified": true, "helpfulness": "0/0", "author": "Jill Kelly"}, {"rating": 4.0, "review": "It works flawlessly. Would like to see more applications take advantage of this feature. I'm talking to you Amazon On Demand. HBO has temporarily allowed streaming to this device from all mobile platforms. Hulu+ works but after a while the Android app loses connection and you lose pause and volume control from your mobile device but the stream will continue to play to the end. Apple version of the app works much better. Netflix works obviously. Here's my message to content providers: Do what Netflix does and you may have their level of success. Serve up your content to every box and device possible. That's the golden ticket.", "verified": true, "helpfulness": "1/1", "author": "MJ"}, {"rating": 1.0, "review": "Could not get it to work.  Tried several times and called very nice customer service.  Love my techie toys, but just replaced this with an HMDI cord that cost 1/10th as much.", "verified": true, "helpfulness": "4/4", "author": "Mamalolly"}, {"rating": 5.0, "review": "I was a little concerned when I read other reviews about needing a really fast internet connection. My fear was unfounded. Chromecast works with my 1.2 mbps download speed just fine. YouTube plays perfectly although the image quality is a little less than with a faster connection. Netflix plays really well too. Those are the main apps I bought this for so I am happy with the purchase. I love being able to control things with my smartphone or tablet. In fact, to me, it's much easier than a remote control. I will probably buy another Chromecast for our bedroom TV in the future.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Mann"}, {"rating": 5.0, "review": "I love the Chromecast! It works well and is superior to my previous method of streaming video--hooking up the computer to the television. This would be perfect if I could use it to stream Amazon Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Karen Jensen"}, {"rating": 5.0, "review": "The setup is very easy.  I was able to watch immediately. I would highly recommend. In fact, I just purchased another one for bedroom.", "verified": true, "helpfulness": "0/0", "author": "Bella Kupaly"}, {"rating": 1.0, "review": "I am completely blown away by this product. It is misleading and a joke. It works perfect with my wife's samsung galaxy phone but on my dell venue 7 everything sets up great but netflx cant read it. i have tried every trick in the book and their customer service is a joke. buyer beware", "verified": false, "helpfulness": "3/4", "author": "Matt Barton"}]