[{"rating": 5.0, "review": "Works great", "verified": false, "helpfulness": "0/0", "author": "ivioo.cow"}, {"rating": 5.0, "review": "Google product.... Duh.....", "verified": true, "helpfulness": "0/0", "author": "Ian D."}, {"rating": 1.0, "review": "I don't use it any more. Too limited and 'proprietary' limiting what I want to do. Google wants to control the world.", "verified": false, "helpfulness": "0/0", "author": "Gary S. Broom \"broomerang\""}, {"rating": 3.0, "review": "If you want to \"cast\" media applications from your phone or tablet, the Chromecast seems to work pretty well. It was easy to plug into the TV, and reasonably simple to download the Android app to my phone. Casting a Netflix video from my phone to the TV worked well, with excellent picture and sound. There appeared to be an icon on the phone for pausing the video, but I didn't see any way to fast forward or rewind. I would assume YouTube and other compatible apps would work similarly well, but the number of Chromecast enabled apps appears to be fairly limited. Chromecast will supposedly mirror some Android phones, but very few at this time. Setting up the software on a PC was considerably more involved, partly because I seldom use the Chrome web browser. I also had a number of issues attempting to cast from my PC using the Chrome web browser; I haven't actually gotten this to work yet, but haven't spent a lot of time trying. Honestly, I haven't noticed any real advantage to the streaming applications in my blu-ray player or Wii, and this doesn't come close to comparing to Apple TV which is much easier to setup, offers more applications, allows AirPlay streaming from any home network computer running iTunes as well as any iOS device, and allows complete mirroring of iPhone screens.So, even though it is inexpensive and seems to work pretty well, it's hard to imagine who would be well served by this purchase. Mirroring support for more phones and tablets would likely make this much more useful.", "verified": true, "helpfulness": "0/0", "author": "Statman"}, {"rating": 5.0, "review": "Great, would buy from this vendor again.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Amazon Customer"}, {"rating": 2.0, "review": "When it works, it works well, but it is too finicky to get right.", "verified": true, "helpfulness": "0/0", "author": "RW"}, {"rating": 5.0, "review": "Very good product for the price. It is small and works easily. Great for netflix and YouTube videos.", "verified": true, "helpfulness": "0/0", "author": "Joann R"}, {"rating": 5.0, "review": "At first, the uses of Chromecast were limited with so few apps that were allowed to use it, but once they opened it up, it has come in very handy. I mainly use it for watching YouTube videos from my laptop or phone directly on my TV and it works flawlessly.  I am still looking that for that perfect app to view my phone's pictures and videos with no lag or delay, so hopefully someone will figure that out at some point.  A high note on this product is that I brought it with my on vacation to a rental house and I was able to watch MLB.tv Premium from my iPad to that big screen with no problem and my friends were very impressed.", "verified": true, "helpfulness": "0/0", "author": "Freddy G"}, {"rating": 5.0, "review": "Excelent !!!", "verified": true, "helpfulness": "0/0", "author": "giuseppe ginestre"}, {"rating": 4.0, "review": "Very good. ..", "verified": true, "helpfulness": "0/0", "author": "Carlo J."}]