[{"rating": 4.0, "review": "While I really live all the apps I find it puzzling as to why its own music app is missing.I have tons of music purchased through Amazons cloud but no way through their device to play it, puzzling.Luckily I can Bluetooth it from my other devices but still WHY Amazon?", "verified": true, "helpfulness": "0/0", "author": "eddy"}, {"rating": 2.0, "review": "The voice command feature is not functional as far as I can tell.  It is frustrating to repeat commands over and over again and never get a correct response.  I think the device has been overhyped by Amazon.  I think the device is just one more piece of electronic flotsam.", "verified": true, "helpfulness": "1/5", "author": "Fred L. Fisher"}, {"rating": 5.0, "review": "I would recommend this source of pleasure to anyone who enjoys a variety of entertainment.  Its simple to operate and a snap for installation to current TV.", "verified": true, "helpfulness": "1/1", "author": "Ben h. Sammons"}, {"rating": 5.0, "review": "It is very simple to connect and is very simple to operate.  Plus the media/apps that it provides access to is virtually limitless.", "verified": true, "helpfulness": "0/0", "author": "Sam W. Russ \"Concerned Cyberworld Citizen\""}, {"rating": 4.0, "review": "The amazon fire tv is a great addition to amazon's many other products.  It can carry it's weight very well against the other streaming devices.  The pros are that it has a quad core which makes the streaming extremely fluid and there is no jerkiness or freezing at all.  The voice search app is very new and unique to amazon and works like magic.  All you have to do is mention the name of an actor or a movie or show and voila there within seconds is everything related to that request, then you can make your selection from the material available.  You can also manually search if you so desire.  It has many channels to choose from and the most popular programs such as netflix, hulu plus, etc.  And if you are an amazon prime member, your amazon instant video selections and history is automatically uploaded, and you are pre registered during setup.  The setup is virtually plug and play.  The downside is that it needs more channels and variety of subjects and genre, which I can honestly see forthcoming, because roku adds new channels every week.  So Rome wasn't built in a day, but it is off to a nice start.  Finally, the price is nice for what you're getting.", "verified": true, "helpfulness": "2/2", "author": "Sasquatch"}, {"rating": 5.0, "review": "This box does everything I need it to do. Streaming is fast, no annoying stops in the middle I saw on chromecast or on PC streaming Netflix content. Haven't tried Netflix app yet to see if there are same pauses but FireTV works great. Love voice search.", "verified": true, "helpfulness": "1/1", "author": "Suren Baghdasaryan"}, {"rating": 4.0, "review": "Ive been a Roku users for years and have been patiently waiting for Roku to come out with a superior streaming product but they did not. They came out with a stick which would not work in my environment and is the same reason I avoided Chromcast. I use my main TV to watch my favorite shows and I want the experience to be as clean and crisp as possible. My old Roku was noticeably slow and crashed especially when using Hulu. For that reason I canceled Hulu. I wasn't watching Hulu as it was. The Fire TV installed easily and was presetup to my Amazon Prime account. It worked flawlessly right away and my family adapted to it with little fuss.First the Pros:The Fire TV is fast and the Menu is clean and easy to navigate. I no longer need to login to Flixter to watch trailers. Flixter destroyed their Roku incarnation making it unusable. The voice feature is awesome, but my seven year old son thought it lame that it only searched Amazons content. How clever to guide us to Wonderpets on Amazon for 2 dollars an episode when its free on Netflix. Im sure some parents will be in for a rude awakening when they learn their three year old daughter just streamed 100 dollars of cartoons in one day.Having Youtube is a HUGE plus over Roku and I have to say the fibre audio integration made a noticeable difference in sound and I much appreciate that addition.The Cons:HBOgo unavailable. Ok so this isn't Amazons problem, but HBO. When will they allow me to watch their content on my best viewing device? Is it not enough that I wait a year and pay 40 bucks to watch Game of Thrones?There is no universal remote. Not even a phone app. Lose it into your couch cushions like we do every day and you will spend countless hours searching for your hapless remote.", "verified": true, "helpfulness": "2/2", "author": "Eric C. Anderson"}, {"rating": 5.0, "review": "I had a 1st Gen Roku for about 5 years. It was probably the most used present I have ever received. I noticed it over the past year, however, locking up during movies, freezing whenever it felt like it. I was on Amazon browsing for something and a banner came up with the Fire TV. All I can say it is light years ahead of my old skool Roku. Wayy faster, reliable interface, bluetooth remote, voice search, clean look on screen and the device itself looks neat. I'm just waiting for more channels for it (ie Infowars.com). You'll be glad you got it. You can also play YouTube videos on it. I could probably dump cable- between Amazon Prime, Netflix, Hulu and Youtube why would I keep paying for 125 channels when I only watch maybe 5? Good job, Bezos- you did it again!", "verified": true, "helpfulness": "1/1", "author": "Thomas \"ITpro\""}, {"rating": 3.0, "review": "My case is currently residing with Amazon technical support however they did detect that the Fire TV device is sending a message back to the streaming server that the device is out of memory (which it is not).  The side effect of this issue is that this creates a pause during the movie playback.  I see a slight pause when playing one particular movie about every seven to ten minutes.  I'm certainly hopeful that Amazon technical staff can resolve this issue soon.  It is the only reason I did not currently give the device a higher rating.", "verified": true, "helpfulness": "3/3", "author": "averagejoe"}, {"rating": 5.0, "review": "I am always wary when I hear how easy it is to set electronic items up.  Well, this went perfectly and we were watching within 15 minutes of getting it out of the box.  We love the selection and the TV shows and movies we get free because of PRIME.  Everything starts quickly once selected - not like our blueray which could take a while.  I am going to get one for my motorhome also!  I love it.", "verified": true, "helpfulness": "1/1", "author": "P. Brimer"}]