[{"rating": 5.0, "review": "I love my Amazon Fire TV. They are super fast, I love the ability to search Netflix, Hulu and Amazon Prime. Naturally this pairs perfectly with Prime. I also run Plex for all of my media needs. I'd love to replace all the media players in my house with these but they aren't SO much better than the Roku 3 to justify spending another $300 to replace them all.There is one thing I wish it had, the ability to reboot from the screen. Sometimes electronics need to be rebooted, and I have to go unplug it instead of rebooting it from the remote.", "verified": true, "helpfulness": "0/1", "author": "EasyE11 \"Eric\""}, {"rating": 4.0, "review": "I have another brand in my living room. But this is as good and even somewhat faster. Good quality. I'm using the stick also.", "verified": true, "helpfulness": "0/1", "author": "Bryant armstrong"}, {"rating": 4.0, "review": "I have the Nexus Player and Amazon FireTV. As far as apps and functions, i prefer FireTV since it has apps i use (Netflix, Hulu Plus, WWE app, HBO Go, Twitch) plus a ethernet port and USB port. Wish both of these had a power button but sleep option will do. For those wondering if you're able to play media from USB drive, yes you are able to play media from USB drive but it needs to be formatted to Fat32 (i use VLC app for videos). The FireTV user interface is not that user friendly. I prefer Nexus player for user interface because it's simpler and cleaner. Overall i like FireTV and would recommend to anyone looking for a streaming player.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I am enjoying it and the children love everything about it.", "verified": true, "helpfulness": "0/0", "author": "Sanmi Ade"}, {"rating": 5.0, "review": "Great ptoduct, very responsive, way faster that anything Xfinity can do.", "verified": true, "helpfulness": "0/0", "author": "Jessica S"}, {"rating": 5.0, "review": "Very easy set up and it runs seamlessly! Lots of choices for the entire family I love it!", "verified": true, "helpfulness": "0/0", "author": "Teresa-Ann"}, {"rating": 1.0, "review": "Does not work with charter...", "verified": true, "helpfulness": "0/5", "author": "Clerpius Clerpitton"}, {"rating": 4.0, "review": "It works so great that I forget I'm not watcheing cable!  Amazon Prime members have some good content to watch.  Bosch is a killer great series.", "verified": true, "helpfulness": "0/0", "author": "Technical Bob"}, {"rating": 2.0, "review": "LMScve", "verified": false, "helpfulness": "0/2", "author": "glenn stanley"}, {"rating": 5.0, "review": "I some some trouble connecting to my internet, but the problem was with my system, not the TV box.  So far, it is as advertised and I'm enjoying it.", "verified": true, "helpfulness": "0/1", "author": "Jean K-C \"J. Clayton\""}]