[{"rating": 5.0, "review": "Great for watching YouTube and other online content on your big screen TV. Very easy to install and use, just select content from smartphone and play.", "verified": true, "helpfulness": "0/0", "author": "Johan Gustavsson"}, {"rating": 3.0, "review": "I am not impressed.  It does what it says it will.  The problem is you need another device to control it.  I get better use out of a raspberry PI.", "verified": true, "helpfulness": "0/1", "author": "Vincent DeVito"}, {"rating": 5.0, "review": "Works great!  I use it when traveling, but sometimes the HDMI port is blocked by the mount.  Haven't used the online content much.", "verified": true, "helpfulness": "0/0", "author": "G. Lomas"}, {"rating": 5.0, "review": "I had been thinking about buying a Chromecast for my TV for some time but never got around to it. Whenever I wanted to watch something from my computer I just tended to hook my whole laptop up to an HDMI connected to the TV. About a month ago I finally decided to invest the little bit of money and I have to say it is worth every cent. Chromecast is easier to use than many other TV streaming devices and is cheaper. I've mainly been using it for Netflix and Hulu and it has worked great from off my phone, iPad and laptop. Love it!", "verified": true, "helpfulness": "0/0", "author": "Joseph Jackson"}, {"rating": 5.0, "review": "I bought this product so I could watch movies through my TV via my IPAD.This product by far met my expectations! The Chromecast HDMI was very simple to install and start enjoyingmovies or tv shows immediately.  In my opinion every household would benefit and love this product.", "verified": true, "helpfulness": "0/0", "author": "StaceyF"}, {"rating": 4.0, "review": "Installation was a breeze and very easy to use. It would not recognize my 5G network but performs well on the 2.4. MHz channel.", "verified": true, "helpfulness": "0/0", "author": "Mark Alan Taylor"}, {"rating": 5.0, "review": "The only problem we have had with this is needing a strong wi-fi signal.  We had hoped to use it in our basement and our router is on the first floor.  Wasn't satisfactory!  But that is a router problem, not Chromecast's problem.", "verified": true, "helpfulness": "0/0", "author": "Sandy Schlaudecker \"Volunteer Mom\""}, {"rating": 5.0, "review": "This is a great solution for us on rainy days at our mountain get away house. We don't have cable or satellite there, so all we need is a decent internet connection and we can watch almost anything we wish....", "verified": true, "helpfulness": "0/0", "author": "GP \"gploversr\""}, {"rating": 4.0, "review": "my first Chromecast worked great with one exception:  a bump to the power connector killed it.  Hard to blame it too much, but it would seem a more robust design might be in order.", "verified": true, "helpfulness": "0/0", "author": "Nate M \"ndmcclur\""}, {"rating": 5.0, "review": "Works just great! Provides support for youtube but also for other apps, love streaming the music.Ps. Support for 802.11a would be desired.", "verified": true, "helpfulness": "0/0", "author": "kocur \"kocur\""}]