[{"rating": 1.0, "review": "Overpriced./ Difficult to use. Don't waste your money.Setup is awkward and has limited reach.If you are looking for access to Netflix on your TV there are much better ways get there.", "verified": true, "helpfulness": "2/4", "author": "Sharkey"}, {"rating": 4.0, "review": "The concept is great but more apps are needed like pandora, tune-in, etc. Also, you can chromecast web pages but not all video will show up.If you have an older tv with an HDMI input it is a no-brainer as you can make such tv's \"smart\" (albeit with access right now only to netflix, google music, you tube).  You do need a power source for it, though.  Only the newer tvs have powered hdmi or powered usb (you can plug the unit into an outlet or a powered usb port for power).The other thing that would be nice is if they allow you to play content from a local, networked library (support for MX Player would be awesome).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Bought it because I thought I can look at stuff on my iPad and for presentation at work on our large screen monitor.  This unit is NOT useful for iPad.  The only thing you can use it for is to display youTube and Netflix, both available though a blu-ray player or smart TV, and not very useful at work.  So it's pretty much useless for iPad.For those who dosen't know how it works, I believe it rebroadcasts certain sites (currently 2 sites) from Google.This is an emerging technology so it will probably get better in time. But for now, it's a waste of money for iPad users.If you keep the unit plugged up all the time, it gets really hot.Apple needs to develop a bluetooth or wireless HDMI interface for iPad.  Would be really useful for me.", "verified": true, "helpfulness": "2/3", "author": "James J. Trivitayakhun"}, {"rating": 5.0, "review": "While this is a \"Beta\" product it is very promising.Easy to set up and use, reduces the need for a smart TV by actually acting as one by transforming a regular TV to a \"Smart TV\".There are some bugs and I am guessing they will be fixed, nothing that can't be worked around", "verified": true, "helpfulness": "0/0", "author": "Yoram"}, {"rating": 3.0, "review": "We couldn't get this to work well for us.  Not that it is the products fault. Maybe the ones trying to install it and get it working with our TV and computer.", "verified": true, "helpfulness": "0/0", "author": "Carrie Bourlon \"Lucy\""}, {"rating": 5.0, "review": "Works great straight out of the box. Every tv should come with one as standard! Adds so much extra functionality to your tv and the ability to play local files and youtube videos on your tv while using your phone or laptop to complete other tasks is amazing.", "verified": true, "helpfulness": "0/0", "author": "Nirush Rameswaran"}, {"rating": 5.0, "review": "I received the item as promised in perfect condition much earlier than promisedIt worked as expectedI am happy on this purchase", "verified": true, "helpfulness": "0/0", "author": "Venkatesham Arvapally"}, {"rating": 3.0, "review": "Would have been a great experience if only I had high speed internet connection and access to the online video services.", "verified": true, "helpfulness": "0/1", "author": "Radcliffe Jason Gianan"}, {"rating": 5.0, "review": "for $35 you can't complain at all. Even if it was a $100 I wouldn't be complaining. YouTube, Netflix, Google Play music/movies, Chrome browser all work perfectly with this and I'm sure more apps will be coming in the future. Set up takes minutes. Works well with iPhones also", "verified": true, "helpfulness": "0/0", "author": "NPM"}, {"rating": 3.0, "review": "I was hoping that the player will be able to replace my WD TV Live, but I might have to wait till Google allows streaming from the local network shares (that was possible in the beginning, but not anymore). Since I'm not Netflix subscriber and don't watch Hulu the functionality of Cromecast is limited to watching Youtube (which works very well) and streaming from the Chrome browser. So far WD TV Live does much better job for me. I hope the Google changes their policy and will extend the applications list.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ig60\""}]