[{"rating": 3.0, "review": "Three big disappointments:1) It didn't work with the Samsung PN60F8500. If someone else got it to work with that TV, please comment, or even if you had the same problem, I'd love to know. I got it to work with 3 other Samsung TVs, one of which was a 2013 model (UN40F5500). The other 2 TVs are older 2008 models, and the Chromecast works on those too.2) Doesn't work in hotels. With the sign-on page needed to access hotel internet, Chromecast does not have an option to login in through those pages. It seems like the brilliant programmers at Google would have an easy software fix. Or here's an idea, add Google Chrome to Chromecast natively so that it can open the page and stream content directly from world wide web. You control it on your computer like you would for Netflix or Youtube, but instead, you're sending web addresses to the Chromecast to display. Unlike Tab Sharing (sit tight, you're up next) which tries to stream from the computer you're on as a screen share. If you just were able to hit the chromecast button and type in the address to open natively, all would be solved. I think... Just do it.3) When I saw you could share tabs from Chrome, I got excited. It's what made me buy the Chromecast. I can already get Netflix and YouTube through other devices, so that wasn't a big deal (however, they are nice features, and I'll discuss below). What I didn't know when I bought the Chromecast was that this feature is still in beta... I'm all for being a beta tester, and have done my far share in the past. Unfortunately, in this case, I was a bit blind-sided until reading that the feature was in beta at some point during the set-up. I think we're also in a very very early stage of the beta because I've yet to have a tab sent to Chromecast that would last more than 30 seconds. So forget trying to stream a video or other content from one of your tabs (that isn't Netflix or YouTube). I really hope that Google improves this feature. Perhaps my suggestion above for a native Chrome app controlled on your computer would do the trick. Just a thought.Three positives, and why I'm holding on to the Chromecast:1) It's very easy to use the Netflix and YouTube applications. Just hit a button and it's on the screen. I ended up putting the Chromecast on an older TV that still gets use, but doesn't have other video streaming capabilities. So $35 to get Netflix on the TV was a great add-on. I can use my phone or computer to tell the Chromecast what to play.2) Small - The TV it's hooked into is mounted on the wall. No boxes or cables are seen, everything in the wall, a very clean look. With the Chromecast, it's able to stay connected to the TV, doesn't show, and doesn't compromise the look of the TV on my wall.3) Hope for the future - More apps are coming. Developers are programming for the Chromecast now. Maybe we'll start to see more of what we see from the usual Roku boxes, built-in TV Apps, etc. I'm also hoping for the Chrome Tab share to get better. As the device improves, I think I'll be happier with the purchase.UPDATE 9/7/2013:I want to add that I have been able to connect the Google Chromecast to an HDMI port on my AV Receiver (Pioneer Elite SC-05). I have an HDMI out to my TV. No problems with this connection, works as normal. Wanted to add this just in case someone was looking to connect it through a receiver instead of directly to a TV.Also, if you don't find this review helpful, please leave a comment as to why, or ask a question that I can help you with. I'm a little curious why I quickly received 3 \"not helpful\" clicks vs. 1 \"helpful\" after posting my initial review which I posted solely to help others...", "verified": true, "helpfulness": "1/4", "author": "B. Wilson"}, {"rating": 5.0, "review": "This product is awesome the ability to stream directly from my computer to my TV is great. I know you can do that with Apple TV but I don't have an Apple Computer or iPhone.  I like that I can even use my phone to play Netflix and not tie up my computer to watch a movie or a TV show.Setup was challenging. That is kind of an understatement, I wanted to setup the product in my room that is downstairs from the WIFI router.  I have great reception in my room but apparently it was not consistent enough to complete setup.  But once I moved it closer to the WIFI router I was able to setup the system with no problems.  I was able to move it back to my room and it works great.So all in all a great item, if you are having trouble with setup check to make sure that you are close enough to the WIFI router.", "verified": true, "helpfulness": "0/0", "author": "Collin"}, {"rating": 3.0, "review": "For what it does, it does reasonably well and at $35 it is cheap.  Hence the 3 stars vs. 2 or 2.5.That said, for what it doesn't do, and there is a lot, it leaves me a bit cold.From the right up I had the impression that I could stream videos on my devices, so far, no.  It is limited to Netflix, Youtube and well that is about it.  I have Apple devices (iPad and iPhone) so I cannot attest to the streaming from the Chrome browser, or for that matter Google Play.I find it very humorous that this thing was pushed hard on Amazon but does not support the Amazon streaming service, though I do not know why it really should as despite Amazon's claim that it wants to be a player in streaming media, the number of services that support Amazon's streaming service to those that do not are roughly akin to the number of far-right Republicans you find in the overall population of the Burning Man Festival.  I digress.I  believe the device would be significantly improved it supported not just the limited services above but also worked with your home network to stream your other media, either resident on the network or via other services.", "verified": true, "helpfulness": "3/4", "author": "Bob Schulhof"}, {"rating": 5.0, "review": "Overall a great product for a great price.A simple solution for people who are not technical and don't know how to accomplish the same tasks with more expensive technology.Check xda developers for tips and tricks on the chromecast!", "verified": true, "helpfulness": "1/1", "author": "alisiena"}, {"rating": 5.0, "review": "Extremely easy to set up.  Within minutes anything that I can view on my chrome browser I can also view on my TV.  Simple, easy and useful.", "verified": false, "helpfulness": "0/0", "author": "A.L."}, {"rating": 3.0, "review": "I have always owned an updated Apple TV for the last 10 years and I really love it.  However, I thought I would take the opportunity to purchase the Google Chromcast HDMI Streaming Media Player and see how it works.  I did not see any functional differences beween the two platforms (Apple verses Google).  Each of the above-mentioned units (Apple TV and Google Chromcast) literally provide some of the same identical functionality and benefits..  Both can stream, provide access to the Internet,  YouTube, etc... I don't own an Adroid phone, but I was able to use both my iPhone 5 and iPad - 4th generation to stream movies and music.  I think this might be a great fit for an Android user who is looking for most of the functionality already built into the Apple TV.  But I still love my Apple TV better.", "verified": true, "helpfulness": "1/2", "author": "Gregory Eason \"Macman1956\""}, {"rating": 4.0, "review": "I eagerly awaited it, hooked it up using both my MacBookPro and my iPhone 4S and also an Android phone, and was surprised at the ease of use that I could watch YouTube videos, and from Chrome on the MBP, Internet content (That does not seem to be ready for IOS 6 on the iPhone yet.)Then, I went home and tried to do the same. Alas, I have an AirPort TimeCapsule Extreme with Dual-band connections that are not supported by the Chromecast. It insists on 2.4GHz. It did not even recognize the networks. I tried to set them up manually, to no avail. Even if I could disable the 5GHz on the APTC, I wouldn't. So I must re-connect my retired Cisco E4200v1 wireless router, and disable the 5GHz band (which I can do), or re-enable wi-fi on my UVerse gateway (which doesn't seem to have 2.4GHz wireless), only using them for the Chromecast.Other than that (and that is a BIG that!) it does what it does, even if I turn my iPhone off, it still was streaming over the network it connected to.I called the GooglePlay support people, and while she was very friendly and helpful, in the end, I am supposed to downgrade my APTC firmware (which I won't). But the support site does say that they are working on it, but do you really think that Google wants to play nicely with Apple!I was also a little bummed that the Netflix offer was pulled so quickly. I ordered on July 26, and it was off the table by then.", "verified": true, "helpfulness": "0/1", "author": "pws442"}, {"rating": 5.0, "review": "Pretty easy to set up, terrific picture, and it greatly expands our choices of things to watch with the Netflix subscription.  Can't wait till HBO gets on the bandwagon and let's us buy an independent subscription -- I will drop Dish soooo fast!  I'm tempted to just drop it anyway.", "verified": true, "helpfulness": "1/1", "author": "Ina J. Percival"}, {"rating": 3.0, "review": "I received my Google Chromecast a few days ago and have been playing around with it.  This is what I've noticed1.  Easy to setup out of the box.  Just plug it into your hdmi port on your TV and supply power to it either with the adapter or USB port.2.  Software setup is simple too. I set it up using the Chromecast app on my iphone.3.  Once you set it up, its easy to play youtube and netflix videos from your phone onto the TV.Here's where my initial experience abruptly ended.  There is no remote to control anything.  No built in browser or app of any sorts.I then got on my PC and installed the \"google cast\" extension to the Google Chrome Browser.  This enabled me to duplicate my chrome browser tab onto the TV by clicking on a button on the browser toolbar.  That is pretty cool but the down side is that the computer has to be turned on while streaming and it simulcasts what you see on the chrome browser screen only.  There is a 1/2 second lag between the video on the computer screen and TV.  (sound is turned off on the computer automatically and comes only from the TV).  Once you close the browser, the streaming ends as well.I also noticed that if you have any subscription based live video services like willow.tv which uses youtube.com live broadcast, this feature is not supported by Chromecast yet.I am hoping to see apps built for the chromecast in the near future.", "verified": true, "helpfulness": "2/4", "author": "Ashwin Rao \"Amazoner\""}, {"rating": 4.0, "review": "This device works great. It was a pain for me to get started because I had no Wifi Devices or a smartphone that was capable of connecting to it. When I first started there was no ChromeCast App. It is no very simple to get set up as the app does everything. It streams well just as it should but I do hope they start opening the doors for developers. There needs to be more of an option with what I can use my own device for. Side note, it gets pretty warm when connected. It's nothing to crazy though.", "verified": true, "helpfulness": "1/1", "author": "Devan Wright"}]