[{"rating": 5.0, "review": "Love it! Does exactly what it says it will and works well. I would buy again.", "verified": true, "helpfulness": "0/0", "author": "Tina Frankenberger"}, {"rating": 5.0, "review": "No problem setting up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cognac G."}, {"rating": 4.0, "review": "Chromecast has a few bugs still to be worked out, but it's getting better and better.", "verified": true, "helpfulness": "0/0", "author": "ITgreybeard"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "fahad h alsmairi"}, {"rating": 2.0, "review": "Funny, it works on a MS device just fine.  Does not work on a Chrome device - \"cannot find the network\" is the message.  crazy", "verified": true, "helpfulness": "0/0", "author": "Alain D."}, {"rating": 2.0, "review": "It works real good if u like google rule", "verified": true, "helpfulness": "0/0", "author": "mrt"}, {"rating": 5.0, "review": "This is an amazing gadget. It has all the capability of Roku and other streaming sticks, plus, with the Chromecast plugin for the Chrome browser, it will play just about anything that you can display in the browser on your computer. It has made cutting the cable a real possibility for me. And you'd be amazed how many web sites and apps support the little \"Cast to Chromecast\" icon.", "verified": true, "helpfulness": "0/0", "author": "Ara \"Hay Degha\""}, {"rating": 5.0, "review": "Excelente producto...", "verified": true, "helpfulness": "0/0", "author": "Alejandro M. Rodriguez V."}, {"rating": 3.0, "review": "Maybe it's just bad luck, the product didn't perform the way it's suppose to. when connected to 1080p LG TV, during the cast the screen turn green or blue. very inconsistent with the transfer rate to the TV. one of my colleagues have the same product but his works just fine. I like Google products, maybe just this one is bad.. Amazon is the place to buy anything, best service you can ask for.", "verified": true, "helpfulness": "0/0", "author": "vks c."}, {"rating": 5.0, "review": "Awesome product, appreciate the HDMI extender.  They could easily charge another $20 for this and I'd still buy it.", "verified": true, "helpfulness": "0/0", "author": "Patrick Gilmartin"}]