[{"rating": 5.0, "review": "now that the API is avabile this device will be more than worth the price. currently, using just with netflix makes it worth the purchase. can wait to use other services.", "verified": true, "helpfulness": "0/0", "author": "Alex Toussant"}, {"rating": 5.0, "review": "I highly recommend this to anybody.Me and my family enjoy using our Chromecast everyday. My siblings are always using it to watch YouTube videos with each other. It's so easy to use that even my 5-year-old brother understands how to use it.The available apps may seem a little limited, but it's only just beginning. Besides, all the major apps, like YouTube, Netflix, Hulu Plus, and HBO Go, are already available.", "verified": true, "helpfulness": "0/0", "author": "AZNpanda92"}, {"rating": 1.0, "review": "While streaming Netflix, it gets disconnected in the middle(not more than 10 to 15 mins) and goes back to set up screen and it takes more than 10 to 15 retries to get the set up again. I have no issues with Netflix on the Samsung Smart TV it self to rule out my router for the problem.", "verified": true, "helpfulness": "4/5", "author": "S. Rao \"skmr\""}, {"rating": 5.0, "review": "If you use android products this is amazing. So simple, quick, fun, cheap, and worth it! And it seems to make my WiFi faster when using a device connected to it compared to trying to use my device without it.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "The Google Chromecast was exactly was i expected. A small device that was easy to setup and super easy to use. I've had it moved a couple of times to watch films and living room and/or bedroom with no problems at all. Considering a second purchase.", "verified": true, "helpfulness": "0/0", "author": "Angel Rodriguez"}, {"rating": 5.0, "review": "It works and it is easy. I'm so glad I didn't go with the Apple TV, which was more expensive.", "verified": true, "helpfulness": "0/0", "author": "warren mead"}, {"rating": 5.0, "review": "I'm a 67 year old woman and I had working in less than an half and hour. Works great!!. We love watching all the Netflix movies and old tv shows. Would definetly recommend.", "verified": false, "helpfulness": "0/0", "author": "vws4lin1"}, {"rating": 3.0, "review": "Can be slow and get behind on the video or not work at all, but it is definitely a convenient way to display video", "verified": true, "helpfulness": "0/0", "author": "Custom Mer"}, {"rating": 4.0, "review": "I still need to get it workingI want to use to show pictures and spreadsheet on TVdon't know if this is possiblePhil", "verified": true, "helpfulness": "0/1", "author": "Phillip C. Karda \"Phil K\""}, {"rating": 2.0, "review": "I expected it to be a stand alone device that would work with a wireless router, like ROKU.I had to buy a 2.4GHz USB wireless stick for my computer to make it work.The Google TV was a much better product", "verified": true, "helpfulness": "0/1", "author": "Jim Rinehart"}]