[{"rating": 1.0, "review": "Amazon Fire TV useless if you outside off US ,no benefit you will get from it if you outside off USAi hope there solve this problem in future", "verified": true, "helpfulness": "3/7", "author": "Mohammed M."}, {"rating": 5.0, "review": "This beats my roku that I have, and my boys really like it too. It is easy for them use to watch their favorite shows, and my oldest likes the game option. We put the old roku in the their bedroom so they at least watch netflix in their room. This one is hooked up in our living room for all to use, and it gets used a lot. It helps my wife when she is cleaning, as it is a lot easier than having to deal with putting in dvd's or having to come back to start another episode. With Fire TV, it automatically starts another episode for you. I also have a Kindle Fire HDX, and the both work great together, and it is nice to be able to send things from the kindle to the tv. I wired to my internet, instead of just wifi as I wanted the full power of my 60 gigs. I would and have recommended this product to anyone wanting to cut the cord or just having a great streaming device. I tell people about amazon products all the time, as I have loved amazon and their customer service since 2004. One of my friends recently joined amazon prime, and can't believe how great it is, especially the prices and shipping. Fire TV just adds to amazon's other great products and services.", "verified": true, "helpfulness": "0/0", "author": "James Bennett \"Second star to the right, and straight on till morning\""}, {"rating": 4.0, "review": "Amazon Fire TV is pretty good overall -- I liked using it during my trial period but returned it because it's on the pricey side.  I could get two decent Rokus for the price of one of the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "rosee"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Kathryn S."}, {"rating": 2.0, "review": "I have had this for 5 months and hate it. i actually disconnected it and put it on ebay to sell. I am using my ruko now and love it.", "verified": false, "helpfulness": "1/4", "author": "Christie Greenman"}, {"rating": 3.0, "review": "I liked it cause it's fast but didn't care to be an Amazon prime. I had it free for a month and I only watched 1 movie and everything else that I did want to watch I had to pay. No thanks. Love Amazon, just not the prime.", "verified": true, "helpfulness": "0/0", "author": "LuLu"}, {"rating": 5.0, "review": "Excellent device. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Rod"}, {"rating": 5.0, "review": "Got my Fire TV today and I love it!  I ordered an HDMI cable at the same time so I could hook it up right away.  5 minutes after opening the box I was watching Prime videos and playing with the voice prompted remote.  It took a lot of deliberation before ordering Fire TV but I am very glad I did.  Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Victoria Lynch"}, {"rating": 2.0, "review": "I really like the format and remote control features but it loses connection constantly with my wifi. There is nothing worse than trying to watch an episode of your favorite tv series and the thing locks up. You have to unplug it wait for it to reset and then try to watch again. I thought it was my internet but I also own a Chromcast and never have troubles with it. I would recommend a Chromcast for the money.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "UPDATE: I've been using FireTV for months and I still love it, but Amazon could definitely push the ball further all via software.I've owned the Apple TV, the Roku, and the Ouya, and right now I'm happy to say I'm super happy with the Fire TV. It's beautiful, it's already logged into my account as soon as I turn it on, and it integrates with almost all of the services I use. I love being able to install apps easily from its store (I am digging some of the screensaver apps like the snowy day one).PROs:* Same price as competition at $99.* The additional game controller is well-built although has a tiny latency when I play SNES emulated games.* Using this for Netflix, Amazon Prime, and Hulu Plus is a breeze.* You can \"side-load\" any Android .APK file via another computer through ADB. I've used this to install SNES9X EX+ so I can play SNES ROMs. This does NOT require rooting it or breaking it, just turning on developer mode.* The remote control must be bluetooth as it does not require line-of-sight.* Lots of great apps you can install like PLEX.* HBO Go!CONs:* Voice search is GREAT, but it needs to be extended to other apps like the new YouTube app and Netflix. You can pair the YouTube app with your laptop but it would be a much smoother experience if I could simply hold the voice button on my remote and it would search Amazon, Netflix, YouTube, etc and present a list of results. As mentioned before, it should also sort Prime vs. non-Prime videos.* Even though it relies on Android-based apps, the available store is still quite limited. For example the Fire TV could provide a fantastic teleconference experience at some point if I could plug an HD widescreen 1080p camera into the USB port and launch a Skype app. (it might do better with a USB 3.0 device)* Some form of screen mirror/extension-over-network app or feature would be great.* Not enough games to really make me excited. I have the Sev Zero game included, but it crashes as soon as I start it so I've never played it. I imagine this will change over time as Fire TV gets a larger user base.* The Remote app for iOS is a good addition, but what would make it amazing is if it provided extended functionality like a menu of media on the remote that would then display on the TV when you select it.* Additionally, I think the remote app would be stellar if I could plug my headphones into my iPhone, press a button and the audio would be wirelessly broadcast to my phone and headphones, while muting the TV, so I could watch movies late into the night without waking up my girlfriend.Overall, though, I really love the Fire TV and have been using it for months now. It's powerful while tiny -- you can barely notice the little device next to my 42\" LCD.FEEDBACK FOR AMAZON:* P1: Extend the voice search feature to all apps, or perhaps allow me to select which ones I care about (Amazon Prime videos, HBO GO, Netflix, Hulu, YouTube)* P2: allow for wireless streaming from computers (like Chromecast, Airplay). You can kind do this with Kindle Fire devices but this should be native and should support the major computing platforms, not just Amazon.P3: Add audio-over-wireless feature for the Remote app for iOS, so I could put on my headphones attached to my iPhone and it would mute the TV so I could watch movies without waking people up.P4: Extend the USB functionality so I can hook up an HD widescreen USB camera to the top of my TV, then use it for Skype!P4: I would suggest updating the remote control to have a blacklight when your hand touches it. (an onboard sensor would detect if it was dark) It doesn't need to be lit 100% of the time at night (and thus killing the battery) but when I fumble for it and pick it up, it would be great if the buttons and d-pad would light up for a few seconds, and then gradually fade once I let go.", "verified": true, "helpfulness": "2/2", "author": "futureboy"}]