[{"rating": 1.0, "review": "Because I am in the Bahamas I am limited on movies and programmes to watch even as A Prime Member I can't watch movies other than on my Netflix.", "verified": true, "helpfulness": "2/11", "author": "Dejaneau"}, {"rating": 4.0, "review": "I recently bought a 2nd Fire TV box for the workout room when it went on sale.  Amazon did an excellent job building this device.  The voice search is awesome, it sure beats selecting characters on the screen with the remote.I am looking forward to when Prime Music is available on the FireTV.  It will be the perfect device for a home theatre.A couple of improvements could be made, you can fill up the capacity quickly if you download some of the larger games.  I think in the future, it needs to be able to run the games from the cloud or have expansion capabilities.Secondarily, the remote clicks when you scroll.  This does not effect the functionality, just somewhat annoying.", "verified": true, "helpfulness": "3/4", "author": "L. Palmer"}, {"rating": 5.0, "review": "Great addition to our living room and our Friday movie nights.The only thing I don't like is the layout.  I wish we could customize. I don't like rolling selection. I would like it better of the selections were stationary and I could move the cursor around.But it works great and is super fast all the movies are instant with zero delay and no lag time.", "verified": true, "helpfulness": "0/0", "author": "Valerie Funk"}, {"rating": 5.0, "review": "was a roku guy for years .....  this is better / love the GAMES offered ...", "verified": true, "helpfulness": "0/0", "author": "Steve Norden"}, {"rating": 5.0, "review": "Super fast....blows roku and walmart brand out of the water!  (not sure the walmart brand is even available anymore) Only complaint: there is no OFF button.  Bright LED light stays on for awhile after turning the Tv off.", "verified": true, "helpfulness": "0/1", "author": "D. Thornton \"swub\""}, {"rating": 5.0, "review": "I bought this as the entertainment hub for the TV in my guest room that also dubs as a TV monitor. This is a great alternative to bring entertainment to your TV if you do not want to pay your local cable provider an arm and a leg for service. Most of the popular shows you find on TV can be found on Amazon prime immediately or very shortly after it airs. It also has video games, neat!Cons: it doesn't really ever turn off. There is no way to turn it off it jet goes into sleep mode perpetually drawing power.", "verified": true, "helpfulness": "0/0", "author": "J. GODFREY"}, {"rating": 4.0, "review": "Amamzon does it again.", "verified": true, "helpfulness": "0/0", "author": "Thunder"}, {"rating": 5.0, "review": "well worth the money for a prime member", "verified": true, "helpfulness": "0/0", "author": "Claudia Kunz"}, {"rating": 5.0, "review": "Have several Roku's; however, my favorite is the Amazon Fire TV.If there was a negative it is very minor.  As a loyal Prime member, would appreciate any \"Prime\" movies to automatically let me play without having to select \"Find an alternate way to watch\" and then select Prime before it will play.  Seems the default options seem to be those that cost money which is surprising as the Roku's do not do this.So very user friendly over the Roku (which is pretty simple).  The voice feature is also brilliant and easily translates my search requests.4.8 Stars.", "verified": true, "helpfulness": "0/0", "author": "David Brown \"Carcapco\""}, {"rating": 5.0, "review": "I love it, NETFLIX and Amazon Prime members this is a must especially if yo don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "DaShu"}]