[{"rating": 1.0, "review": "It is great in theory and for the 2 minutes that it works. It consistently disconnects and  rarely make it through 2 minutes before it disconnects. It is frustrating and so not worth wasting your money on. In fact it really makes me think twice about ordering any streaming devices now.", "verified": false, "helpfulness": "1/1", "author": "Rachel"}, {"rating": 5.0, "review": "What an amazing product, I don't have a single TV in my home without a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "MICT"}, {"rating": 4.0, "review": "It works really well most of the time, but I do wish that it was on the 5 ghz band. Sometimes, if I'm streaming a video from a website that's not specifically built for the Chromecast, like comcast or cwtv, then there might be some stuttering. For sites that know about it, like HBOGO or Netflix, it works great.", "verified": true, "helpfulness": "1/1", "author": "Ted Pan"}, {"rating": 1.0, "review": "I bought it on a whim, thinking it would be similar to Apple TV for android devices.  I thought I could stream my video to it.  WRONG!  This thing will not stream the video YOU recorded yourself! Worthless device.  Buy an Apple TV.  This thing does less than your Smart TV, and not as smoothly.", "verified": true, "helpfulness": "2/2", "author": "Rocker"}, {"rating": 1.0, "review": "Bogus, I returned it bearing from my own pocket", "verified": true, "helpfulness": "0/1", "author": "Md Shariful Islam"}, {"rating": 1.0, "review": "I was very eager to set up my chromecast and start streaming. Setup was a breeze and everything seemed to be going great. Then it all of a sudden said that it could not connect to my router. What???? I have never had an issue connecting anything to my WiFi. I contacted customer support and there was nothing I could do. What a waste. I bet it works great if you actually are able to connect it to your network.....", "verified": false, "helpfulness": "1/1", "author": "mike t."}, {"rating": 4.0, "review": "Parents love it! It is certainly finnicky sometimes though, hence the star deduction. Wish it could remember multiple wireless networks.", "verified": true, "helpfulness": "1/1", "author": "Daniel Lavender"}, {"rating": 5.0, "review": "As advertised", "verified": true, "helpfulness": "0/0", "author": "Ken Munro"}, {"rating": 5.0, "review": "Fast ShipmentStrongly recommand", "verified": true, "helpfulness": "0/0", "author": "C. Y. Liu \"C. Y. Liu\""}, {"rating": 5.0, "review": "Thank you!!!", "verified": true, "helpfulness": "0/0", "author": "Nick Leavitt"}]