[{"rating": 4.0, "review": "After a few months of owning this thing, I'm finding it useful for pushing youtube videos to my computer, but that's about it. You can stream Netflix with this, but I turned my Netflix streaming off because I wasn't using it enough to keep paying for it. Other than that, it's a nifty little device. Only reason for 4 instead of 5 stars is that setting it up is a little bit of a hassle as you have to have a computer with internet in order to setup. Should be out of the box ready in my opinion.", "verified": true, "helpfulness": "0/0", "author": "R. Certain"}, {"rating": 5.0, "review": "Thank you google. Love it and hope with updates more options will become available to cast. Easy to connect and not limited to just one TV. The same setup only yr ago would have meant loads of hrs to set up and more money.", "verified": true, "helpfulness": "0/0", "author": "A. Doss \"Movie addict\""}, {"rating": 5.0, "review": "Works very well. My wife and kids love it as well.  Looking forward to more functionality but as is it was really worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Ernest"}, {"rating": 2.0, "review": "The packaging is slick, and the on-screen setup instructions are very conversational and friendly; Except when the device is unable to connect to your own wireless network. In this day and age, it's assumed that one should go online (to Google) and search out the reason for any problem. But still, it would have been nice if this little gizmo had given me some little hint, code number, anything to help me narrow down the cause.Turns out, my Verizon router needed a reclusive setting changed (I'm not a home office router, I'm a broadband router!) - a fix which was NOT suggested on Google's list for my device - but rather buried in a discussion group on an entirely different site.So now this little fob is working, and streamed a $9 Disney SD animated movie crisply and clearly, with no lag at all.I'd love to report on other media, but I'm not a fan of Netflix since their debacle of a few years back, and Google has not made nice with Amazon yet (where most of my paid content sits). I've been shopping their \"Movies & TV\" app, but am not yet satisfied with the selection or prices (only one season of Futurama? Seriously?). That leaves Hulu.I pray that Google has plans to join up with some more vendors soon (like Amazon) - and not just copy the Microsoft model of gently forcing us to use their own services whenever possible on their own hardware.The ability for my wife to \"cast\" her Chrome browser page onto the TV - so I can watch the same Facebook clip as her - is pretty sweet. I can cast YouTube video from my phone too. This thing has potential - and even current reward for the geek in some of us - and is a worthwhile gizmo if your TV does not have any media apps built-in.EDIT: Months later and there's no App to play Amazon Instant Videos on Chromecast. Rumor now is that it's Amazon's call, and they won't do it - citing some red herring about which media player to encode for (Buy a Kindle!).So in retrospect, it seems disingenuous for Amazon to sell something that won't Play with Amazon. So Google's product suffers as a result, and it's probably too late to return it. Not too late to start buying my videos elsewhere though!", "verified": true, "helpfulness": "0/0", "author": "A. K. Holden"}, {"rating": 1.0, "review": "Very little capability for iPad.If all you need Netflix and YouTube access, then this will work fine for you!", "verified": true, "helpfulness": "0/1", "author": "jaynorige"}, {"rating": 3.0, "review": "works but a little limited in the services it can broadcast. Still a bargain for the price. Use it on a second TV", "verified": true, "helpfulness": "0/0", "author": "Rick Graham"}, {"rating": 3.0, "review": "works as advertised but was kind of disappointed.  I was hoping that Google would come out with more features for this neat little device.", "verified": true, "helpfulness": "0/0", "author": "RockWarrior"}, {"rating": 5.0, "review": "I bought one, then I bought two more. I now have 3 Chromecasts in the home and love it. I used to be a very casual Netflix watcher, but now I watch Netflix and YouTube all the time while at home. It's so simple and now just reflex to be on my smartphone and instead of watching YouTube videos on my phone, I kick it over to my 47\" TV without hesitation. Netflix streams great all the way in the living room, away from the router's strongest Wifi signal area. I highly recommend it. Set up has been a snap with all three.", "verified": true, "helpfulness": "0/0", "author": "ButcherChop"}, {"rating": 4.0, "review": "Better have good internet connection.  Flakes out sometimes when using iPhone or iPad devices.  However, that could be a cause of internet issues just figured out we had from high-speed provider.  I will say that it kinda stinks that you cant stream anything you want to the device.  You are restricted to YouTube, Hulu and anything from your browser.  The took away the ability to stream without hacking the thing to death local files.  That sucks........It would be so easy for Google to let that feature work as I believe they would have a difficult time keeping them in stock.  I own 5 of them and give them to clients etc.....", "verified": true, "helpfulness": "0/0", "author": "Tyler Spore"}, {"rating": 4.0, "review": "The chromecast has been a good addition to our home.  Setup was really easy to do and follow.  It works great streaming netflix and youtube videos from any computer in the house.  I love being able to use streaming music stations as well to send music to my sound system using any device that has the chrome browser.  One issue that I have run into and should note is that when using other video streaming services the video stream can stutter and is not as clear as netflix and youtube.  This is more of an issue when trying to push the video from a wireless connected device.  It seems this is a problem with my wireless network not having enough room or bandwidth to play video using a wireless connection from the internet to my computer and then using the same wireless connection stream it to the chromecast which can only be used with a wireless connection.  A computer wired to the internet and then pushing video to the chromecast using the wireless connection smooths out most of these issues.  Overall for the money you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Fievel"}]