[{"rating": 5.0, "review": "A very user-friendly device which is well worth the  cost.it installs in minutes and works faster and cleaner than my smart TV.I was quite surprised with the lightning  fast response of the voice activation...of course,being supported by amazon,it is especially nice with prime membership-truly this device is a delight:-) ..a welcome addition to the  fire family.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"'heirborne'\""}, {"rating": 4.0, "review": "Very fast interface, however it steers you to everything Amazon, with a charge for just about everything. Netflix has the same selection for free, but Fire TV tries to keep you within Amazon choices.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 3.0, "review": "I have Amazon Prime and purchased this to take advantage of the movies on my HDTV.I was disappointed that it was only a content provider and I could not access the Internet.I noticed the new Fire HDX can do that. I just purchased my Kindle Fire HD and I don't want to spend $219 for the HDX.I resented the fact that I had to pay to watch the same shows on HGTV that I can watch free on the Internet.In particular, We enjoy watching shows on HGTV, in particular, the Property Brothers.I paid $3.50 to watch a segment on Fire TV that I could have watched for free on HGTV on the Internet.Perhaps, for the money, I would have been better off buying a Laptop and plugging it into my TV.", "verified": true, "helpfulness": "1/2", "author": "Thomas"}, {"rating": 5.0, "review": "as promised- I have Roku- apple tv and a smart samsung tv-  amazon fire tv is the easiest to use and a snap to set up!  bye bye cable you are history....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rjs\""}, {"rating": 5.0, "review": "We favor for watching Netflix as it runs faster, and rentals are generally cheaper than iTunes.  We still like AppleTV for airplay and it has a wonderful interface, but Amazon Fire TV is pretty amazing...with the same internet connection it runs faster than AppleTV or our other web-based devices (like smart TV or DVD).", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "So far I love it.....there is alot of potential here. Very responsive and easy to install available apps. There is no lag on inputing sign-in information as I have found with smartTVs and even Xbox. I even like the added screen saver and the pictures they have their make my HDTV pop. I say good job for a first step in getting into the 'cut the cord' set top box arena. I've never used Roku or AppleTV but I'm glad I went with this.People really should not be so harsh on Amazon for apps that are not available currently. You get upset when you install it that something wasn't there, yet they are very clear on the product page that HBO2Go is not available. For being something new, things will come in time, but at the same time its not as if Amazon said no we won't carry it but rather more like HBO2Go saying we don't want to let our app be there right now....you want to complain about it not being there, talk to HBO. Give it time, I'm sure it'll show upThe only thing I hate and that Amazon should fix is adding an option to skip is the initial 'how to video/comic' that talks about basic things. That's 5 mins I wish I could have skipped....for the life of me I could not find if there even was an option to skip as every button didn't work other than the back button which just made it start all over again.And you can tell what movies are part of Prime and what are not, contrary to an earlier review I saw", "verified": true, "helpfulness": "1/1", "author": "Keith Nicoll"}, {"rating": 5.0, "review": "Does almost everything you could want with 4X the memory and CPU, plus 6GB of onboard flash.No closed system like the AppleTV requiring you to jailbreak it to play your own local movies and videos.  The Plex media client is on it so you can simply install the free Plex media server on a PC and link to any drive with movies, either local or on a mapped drive.  And your entire media collection plays back flawlessly!  Streaming on Amazon On-Demand, and Netflix is much improved as well.  And a tip...don't use wireless...  It works, but geez, take a little time and connect it via gigabit ethernet.  You'll be happier with the performance and ability to skip forward or back quickly on large movies in 1080p.", "verified": true, "helpfulness": "1/2", "author": "NetJedi"}, {"rating": 5.0, "review": "I have a Mitsubishi 2008 735 Series WD-60735. After contacting Mitsubishi and asking if Amazon Fire TV would work with my TV, Mitsubishi said yes.  Mitsubishi was wrong.  Amazon called Mitsubishi and asked if it worked with my series of TV and they said yes to Amazon also.  Amazon has done everything to help me.  They are good people to work with.DOES NOT WORK WITH MITSUBISHI 735 SERIES WD-60735.", "verified": true, "helpfulness": "1/1", "author": "trustme"}, {"rating": 2.0, "review": "After numerous times attempting to set this up, I finally got it to update and was super excited!  Then, immediately disappointed to find out that even though I have high speed internet, every time I attempted to watch something on Netflix, it \"buffered\" and took me back to the set-up screen, instead of simply waiting and pausing my programming.  I might as well just watch my shows on my slow, 7 year old computer.  At least it doesn't go all the way back to the beginning of a program if my internet stalls.  Expected great things, and got less than mediocre.", "verified": true, "helpfulness": "2/4", "author": "emily kenworthy"}, {"rating": 3.0, "review": "I was hoping to move away from the roku.Both I cannot find HBO GO on the channel list.Showtime is there.... I do not subscribe to showtime.Anyway, Game of thrones now shows up as pay episodes.This is a serious mistake.When the wife sees this, it may be going back to Amazon.", "verified": true, "helpfulness": "0/8", "author": "RogerDodger"}]