[{"rating": 5.0, "review": "I was fortunate enough to test drive this product for 30 days and was deeply saddened I had to return it.If it wasn't for my current financial status I would have absolutely kept it.I stream a lot of TV shows and movies to and from different devices in my home including a PS3, Xbox 360, and more recently an Xbox One (although you don't have access to DLNA servers from the One) and have hated every second of it. All 3 devices, no matter what settings I choose, no matter how much trouble shooting I perform, I've had issues for years with devices skipping, buffering and simply not playing certain content.After getting the Fire TV set up I instantly fell in love. Netflix and Hulu buffer but for a second, and the show immediately plays and I didn't experience a single second of disappointment. What's even better, is that since it's running an android operating system, it has several apps you can download, INCLUDING a program to stream from your media servers! Although I had a few issues with my anti virus software, after getting passed all that I was able to stream all of the media from my PC.Overall, very satisfied with the device and really enjoyed it. The only thing I hated about it was packing it in the little box with the frown on the side.", "verified": true, "helpfulness": "2/2", "author": "Chris Kelly"}, {"rating": 2.0, "review": "While the concept of this is nice, there are way too many simple choices that aren't even available.  My son and I were watching the Sarah Connor Chronicles from like 2007.  We got all the way through the first season and were on episode 14 of the second season.  All of the sudden they decided we had to pay for the rest of the shows.  I called and spoke with the \"Fire TV\" people (some guy from a different country), and he informed me that they can change whatever they want.  He was nice enough to at least \"add\" the rest of the season to our watch list.  However, this is a ridiculous policy and if they ever really want to keep customers, they need to stop being so cheap.  I would rather pay a little more and get decent movies than to pay $99 for crap", "verified": true, "helpfulness": "2/6", "author": "janelle klein"}, {"rating": 5.0, "review": "I have the google dongle and roku but wanted something seamless with HD and my Amazon Prime account options.  This was super easy to set up and really was just plug and play.  The video quality is much better than other players I have used in the past and no buffer.", "verified": true, "helpfulness": "0/0", "author": "Al Evans"}, {"rating": 5.0, "review": "This is a great internet tool.  I have a smart TV and the computer wouldn't do justice to Netflix.  Amazon Fire produce film streaming in HD instantly.  If you are tired to slow streaming and rebooting on your TV, get Amazon Fire.  Its only $99 for amazing film streaming.", "verified": true, "helpfulness": "0/0", "author": "gary kimble"}, {"rating": 1.0, "review": "Lmao amazon in my opinion is one of the best sites to shop from, however when they mess up they royally mess up. This amazon fire tv situation is one of the worst customer service dealings I have ever had with amazon and I have been dealing with them for at least 10+ years. I returned the device, recieved an email stating that I was getting a refund back and the reason was CUSTOMER RETURN! Which says to me that amazon knows the device has been returned. So I go about my weekend. On Monday I was charged $99 for the device which is no longer in my possesion and the customer service rep by the name of ashley is acting like this is my FAULT. First rule of business dealig with the public, the customer is always right. In the future I will think twice about patronizing amazons services, my money is precious to me I work hard for it so therefore I will be very selective on where it gets spent!", "verified": true, "helpfulness": "4/13", "author": "trice"}, {"rating": 5.0, "review": "The only thing that I would change is a way to sort out programs that you have to 'rent' but so much of it is available and with amazon prime membership it is a perfect option for me.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Perea"}, {"rating": 4.0, "review": "If you are considering getting a \"streaming media player\" the Fire TV is an awesome device.  The performance specs are currently hands down the BEST on the market.  I was blown away at its speed and smoothness of operation.I however could not give it 5 stars, due to its limited amount of \"my preferred\" channels/apps.  Others may find the selection of channels/apps to be adequate though.", "verified": true, "helpfulness": "1/1", "author": "Heston Sohan"}, {"rating": 2.0, "review": "...but I don't.  I've used several Roku devices and an Apple TV for years, and the Fire TV just doesn't compare with those devices.  I do like the voice search--which is accurate and very fast, but it only works for amazon prime titles--NOT for netflix or other apps.The biggest problem with the Fire TV is that it pauses during playback much more frequently than my Roku or Apple TV--even when placed in the same location as those devices.I LOVE my kindle paperwhite for reading, but amazon needs to seriously improve the Fire TV device before I can recommend it.", "verified": true, "helpfulness": "1/2", "author": "R A MINNIS"}, {"rating": 4.0, "review": "I was thinking of buying a Roku when I received an email to use this product free for 30 days. I didn't know what to expect but I was pleasantly surprised. The set-up was quick and easy and I was even given a 30 day trial of Amazon Prime. I loved the device's interface as it made navigating through the menu a walk in the park. Unfortunately, I will be returning the Amazon Fire TV as I already have an Xbox and cannot justify paying $100 for it at this time. Maybe if the price drops, I will purchase one of my own.", "verified": true, "helpfulness": "0/0", "author": "TDP"}, {"rating": 5.0, "review": "great product glad I ordered it its well worth the money I highly recommended it to EVERYONE Great product and easy to use", "verified": true, "helpfulness": "0/0", "author": "Alan M"}]