[{"rating": 4.0, "review": "I love it my chromecast, it's incredible to see netflix and youtube, the one problem is that others website without application has a low quality in the images", "verified": true, "helpfulness": "0/0", "author": "Hendry"}, {"rating": 1.0, "review": "This is a review of Chromecast by Google. Google has blocked the use of VNC with this device. I use VNC as a trackpad on my PC. Because of this I cannot control my PC if I want to use Chromecast. Obviously that means Chromecast does not work.", "verified": true, "helpfulness": "2/5", "author": "Palul"}, {"rating": 5.0, "review": "I can stream my YouTube video and Netflix movie on my big tv. The quality is impressive. Strongly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Chan"}, {"rating": 3.0, "review": "Ok chromecast is definetely a great product, its unique, affordable, and can be very usefulGoogle has taken a very odd approach to this product, first of all the product is very nicely packaged and advertised but Google advises that it is in Beta..........I think you should take the time to complete your product testing and get all the kinks worked out before you start suiting it up with fancy packaging and commercials or else you're going to mislead your customers and have some pissed off people like mechromecast just barley got full plex support without having to buy a plex pass (as of about a week ago) so you can finally use it as a media serverOne very misleading thing about chromecast is that you can cast your browser from \"any  device\" which is not true, phones and tablets don't have the hardware power to cast tabs so it only works on laptops and PCs (on wifi of course)Which brings me to another odd feature is that an object has to be on wi-fi to use chromecast its not good enough to be plugged directly into the router (extremely odd imo)Also another thing that ticked me off is that google makes you jump through some hoops to broadcast local stuff from your phones (videos, music etc) which is very odd, you wouldn't think that doing something as simple as playing a video you recorded on your phone over chromecast would be such a painAnyways its not a bad product it just wasn't what I expecting, luckily I have a laptop so casting chrome tabs was useful for me, other than that I don't think I would have gotten much use out of it.", "verified": true, "helpfulness": "0/0", "author": "Mason Twain"}, {"rating": 4.0, "review": "I guess this would be called a thin client since it relies upon other devices (smartphones, tablets, PCs) to feed it content so I kind of doubt this will ever be hackable into \"android-on-a-stick\".  Don't buy this thinking that's what you're getting.  This device is much closer to a Roku except the \"remote\" is your personal devices and the potential seems much greater.My wife bought this for me originally, which is why I'm not a certified/genuine/whatever owner, and I knew at the time it wasn't going to more than what my PS3 already did in terms of media.  Now, since their API has been opened up to developers, it's been MUCH, MUCH better!  If the Chromecast played Blu-Rays I'd dump my PS3 in a flash (I barely play games on it).  At this point you can expect new apps and old apps to be coming out with Chromecast support on an almost daily basis.Ever since Plex released Chromecast support and allowed the general public to use the feature I've been using it like crazy.  Plex does a great job at managing my movies and TV shows and they play almost flawlessly via Chromecast.  I have had trouble with longer movies \"buffering\" towards the end but that may be a Plex issue and not the Chromecast.  I've also had issues with Pandora going off on it's own and not being able to rate/pause/skip with my phone anymore.  So it's not perfect, hence the imperfect rating.Also, even though there's little storage on the Chromecast, obviously it's not meant to have user storage though, it's disappointing how little it does by itself.  If you're not actively \"casting\" content it shows a nice picture slideshow, but there's no way to configure it, choose your own photos, or anything.  Someone has come out with a conceptual homescreen displaying Google Now, which should've been a no-brainer as a homescreen option.  There's been no talk of customizing the homescreen, but hopefully Google will update it to show more useful information or personal content when the Chromecast is idle.Again, I won't say it does a whole lot right now, but the potential is huge.  There's no reason why [in the future] you couldn't cast Angry Birds, presentations, Pinterest, or Twitter live-feeds, so it will definitely have something for everyone.", "verified": false, "helpfulness": "0/0", "author": "Alexander Wilke"}, {"rating": 4.0, "review": "This small device is easy to set up, easy to use. My husband, who's a bit tech-phobic, has had no issue with this device--and hasn't said why he's withheld a half star. It's probably some principle against full points. Anyway, it arrived quickly in an appropriately padded little envelope.", "verified": true, "helpfulness": "0/0", "author": "Lar & Catherine"}, {"rating": 5.0, "review": "I use this device almost daily. I love to watch YouTube videos often enough and on an HD TV  is pretty awesome, Google makes pretty good products usually.", "verified": true, "helpfulness": "0/0", "author": "Louie Green"}, {"rating": 5.0, "review": "Great little device to let you stream to your TV.  Small enough to not get in the way and ease of setup will have you watching streaming video in no time.", "verified": true, "helpfulness": "0/0", "author": "Anthony Szymoniak"}, {"rating": 3.0, "review": "I was 7 feet from TV. 2' from Modem. It was difficult to get the audio stream consistent. It serves the purpose. It worked fine from Galaxy phone. Didn't stream great from Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Thomas Clark"}, {"rating": 5.0, "review": "Pirfect working  fine used every day recommended for every body  I want order more for my family  good job  very good", "verified": true, "helpfulness": "0/0", "author": "alex"}]