[{"rating": 2.0, "review": "Like many other things that Google does, you could say this is \"Beta\".  I just don't understand why a company like Google, with the resources that they have... Why they can't make a polished product that is positioned well ?  It seems like everything they do, is \"Beta\".  Meaning that, your expectations should be lower, that it isn't finished, and you shouldn't expect it to work properly.  It's a cop-out.  Apple, Google is not.  Apple would have never released something like this, working they way it does.  You have to appreciate they way Apple works on a product, under wraps...  Then announces it - With everything working that day, polished, and most often positioned just right.  This Chromecast is not the case.  But maybe you can't complain much...  Because it costs only $35 and boasts features that have a low-expectation \"Beta\" classification.  That is quite frankly, kind of lame though.  What it comes down to, is that this thing barely lives up to the expectations you would have, after all the fluff they announced at their keynote.  It's supposed to work with your phone and iOS devices, they said...  But when you get to the Chromecast set-up page, one of the first things you see that is a let-down before even using it, says \"iOS setup Coming soon\".  So I had to set-up on my MacBook Pro.  They had a comforting \"Don't worry it'll work with your device after being set-up\" type of message though.  In the setup, there's a link that says \"get the Chrome extension here\" or something to that effect.  When you click on it, it of course doesn't take you to extensions and takes you to a Chromecast tutorial video page.  Maybe the web link was Beta ?  (haha).  Or maybe it installed it without me knowing or seeing it ?  But,  I had to go to the extensions gallery manually and run a search for it.  Funny that the name \"Chromecast\" is taken by another 3rd party extension.  So the extension for Chromecast is called \"Google Cast\".  Another little detail where Google fails to streamline & standardize, is with their branding.  In the Applications folder on the Mac, Google Chrome shows-up alphabetically under G for \"Google Chrome\".  After installing the App for Chromecast, you'd expect it to show-up under G for \"Google Chromecast\", right alongside Google Chrome.  But no... It shows up under C for \"Chromecast\".  Not a big deal, but another detail missed here.  So on to trying the thing out...  I'll give it to Google on this - the way the Chromecast icon shows-up on the YouTube app on my iPhone & iPad - without me having to update the apps on either....  That, is magical.  So, I tested watching YouTube videos on my TV.  First off, I don't really watch many YouTube videos on my larger TVs.  I watch YouTube videos on my iPad & iPhone, or computer sometimes. Because, the resolution of those videos is a mixed-bag.  You may find HD videos… But the reality of it is, that you're going to find lower resolution videos in abundance.  And they just don't look good on a bigger TV.  The lower resolution videos, you almost have to watch on a smaller window or device, so that you can even make out what's really going on.  Both my TVs already are smart TVs with a YouTube app.  But because of navigating an on-screen keyboard on the TV with a remote, the Chromecast method of watching a YouTube video, barely one-ups this.  One problem, is that when I was watching a video on YouTube via Chromecast, I wanted to change to another video, in the middle of  the previous video still playing.  When I did this, the newly chosen video just wouldn't play.  I got stuck with a gear turning and nothing happening.  This seems to happen less on my iPad than on my iPhone.  But it's pretty frequent.  Hmm, is this Beta too ?  Next I tried to cast a tab from Google Chrome on my computer, to my TV.  At first the, video is jagged and elements of the webpage were distorted.  But this smoothed-out after alottle bit.  The text (even very large text on a webpage) looked crappy.  I'm the only person on my wireless network, sitting 6 feet from my wireless router, which my TV is hardwired to.  And there is a very significant lag & time delay of displaying webpages.  For no explainable reason, sometimes the lag was much more significant than at other times.  Again, with me being the only person on the network.  Playing videos on CNN.com, from a Google Chrome Tab to the TV, was kind of cool in concept.  But, the audio was way, way off.  Also, the video was jerky.  And I have 50 down, 25 up Verizon Fios. I don't think internet connection is an issue here.  Also, casting a tab happens locally over the wi-fi network.  I discovered this same video played without being Chromecasted, with no delayed audio and without the jerkiness.  Maybe we can blame this on the fact that, casting a tab from Chrome is.... You guessed it - BETA !  So what is this Chromecast thing good for ?  Maybe the occasional YouTube video.  Maybe if you just had to show something from the internet on the TV, although not reliably.  For Netflix, I was already a Netflix subscriber and have 2 iPhones, an iPad, a Roku player, and two newer Samsung smart TVs.  The Roku & Smart TV Netflix apps are too easy to use, so why would I use my iPad or iPhones to start a movie ?  Maybe so I can avoid having to enter a search in with the TV type remotes... Would be the only reason.  And the YouTube thing... It's really a novelty.  In reality, alot of us are watching youtube videos on YouTube's website maybe not in Chrome, or watching a YouTube video that someone posted on FaceBook.  And those videos won't play on Chromecast.  Only videos you watch in the YouTube App will go to Chromecast.  That is weak.  And you can't cast a tab from your iPad even if you're using Chrome.  I updated Chrome in my iPad to make sure, but no option for Casting the tab appears.  I personally, rarely ever sit a watch TV with my laptop.  If I'm looking something up on the internet or browsing FaceBook or YouTube, it's on my iPad.  Maybe, just maybe they'll expand this and let you cast any tab from Chrome in any device to the TV.  And hopefully it won't be Beta, and won't be jerky with audio out of sync.  I guess I'm not so mad about this thing, considering it cost only $35... And I supposedly got the 3 months free of Netflix.  Making it cost less than $15 essentially.  But I have yet to get the e-mail that I am supposed to receive within 5 days with the Netflix redeem code.  I mean, I know Google pulled out of giving the Netflix promotion.  But I qualify because I purchased it within the time period they stated.  Unless they're going to back out on this now.  Another thing you notice with the Chromecast, is the packaging and accessories you get with it.  The packaging is too expensive for the price.  You also get an AC to USB power supply, a USB to USB micro cable with a nice Velcro strap on it, and a short (maybe 3-4inch) HDMI male to female extension cable with gold-plated plugs.  I did have to use the USB cable from my TV's USB port to power the Chromecast, although my TV is a late 2012 model with three HDMI 1.4 ports and should've powered it.  But it makes you wonder how much money Google is making off of this thing.  Google sitting on piles of money.  And the most likely reason for this Chromecast is seems... Is probably for mining your data and viewing habits, or trying to drive people to Google Play, & advertisements.  Maybe they're trying to find a cheap gadget they can plant in people's homes to help the NSA bug people....Who knows.  To sum up what I think about it.  This thing is cool for a dongle, yet weak for a set-top box type device.  I'd say Google Chromecast is a device that is not ready for primetime.  It's not clear what it's good for at this moment.  But it definitely doesn't do what it's supposed to do, very well.  But it does it.  Maybe it's a poor-man's AppleTV... But isn't that the position, the Roku LT takes @ $49 ?!  They can't really be compared though.  Because this thing is an HDMI dongle.  I'm not sure where the Chromecast fits-in between streaming media players and smart TVs etc.  The Chromecast might be good for that person who refuses to pay for content or buy a Roku & AppleTV.  The person that watches video from a computer/websites and wants it on their TV.  Maybe it's for the PC user - Who thinks bad behavior like this is normal and doesn't mind the jerkiness or out-of-sync audio (Haha, I'm a Mac guy).  It might be good for someone who doesn't have a Smart TV.  This is great for the people out there, that don't know the AppleTV or Roku boxes exist.  Let's face it, the AppleTV works pretty well and Airplay mirroring most definitely works better than Tab casting on the Chromecast.  I actually don't own an AppleTV believe it or not.  But even though the AppleTV is referred to as Apple's \"hobby\" product... It still works better than Google's (Beta) Chromecast.  If you're that guy that thinks using a computer is going to sit down at your desk with the monster tower computer, and you're looking for a way to watch the crap you download off torrents etc., that you want to see on your big TV.... Then this is for you.  Maybe if you're that guy that complains how Macs are too expensive and that a PC cost 1/3rd the price, then this, at $35 (versus AppleTV's $99), is for you.  If you're hoping it'll get better (like Windows 8 & the Surface), than this is for you.  Can't afford the Roku ?  This is for you.  Don't want to be \"down with the system\" and don't want to pay for cable, or buy an AppleTV , or Roku... Maybe this is for you.  If you're against iTunes, paying for content, subscriptions, etc.  And you have to somehow play your web browser or adult material from you computer to TV.... Then this could be for you.  Maybe your one of the few, that is a big Google Play user ?...  Otherwise, this is another disappointing release from Google.  Get an AppleTV, get a Roku.  They work.  Too bad Google is just blowing smoke again.  I think they suffer from a \"rich kid\" type of syndrome.  They just don't seem to have the hunger and fight, to actually make something successful and highly polished.  They just throw stuff at the wall, to see what sticks and call it \"Beta\".  Why ?  Because they can.  Will Chromecast beat-out the AppleTV or Roku ?  Absolutely not.  Add this to the string of badly positioned & non-polished products that won't be a success.  Like the Nexus Q,  Google phone, Nexus tablets, and Glass.  Only difference with this is, they sold more of these things because of the price point and false advertising/incentives.  Now I'm so thrilled & excited about this product (sarcasm)...  That I'm stuck between - wanting to return it, wanting to sell it, and wanting to keep it for the cheap price.  To see if it improves at all....  Knowing that I'll hardly ever use it.  If anything, this has made me want to buy an AppleTV even more !  So, I am biased, because I am an Apple user - Not an Android or PC guy .  But I know there are all different kinds of users.  PC users that have iPhones, or Apple users that have Androids, etc.  So, the wise-cracks about Windows & Android are all in fun.  But why shouldn't something like this, just work the way it's expected ?  I would love to see Google make something awesome and maybe give Apple some competition....  Maybe raise the bar.  But that just isn't happening yet.  I will give Google credit, for maybe creating a new category of devices. By inventing an HDMI dongle type of device which uses your mobile device or computer as the User Interface.  But what is it worth if it doesn't really work well ?  It's a novelty.  And in reality, how much are you going to use it on a daily basis ?  I can use Netflix just as easily without using the Chromecast and not have to have my Mobile device tied to it at all.  Speaking of Netflix, Google did the bait & switch, false advertising.  I think this was something to get people to go crazy and buy the thing, creating this artificial demand and hype for a product that is really mediocre at best.  Later they pulled out of the Netflix promotion.  Then they said that people would get the Netflix promotion if they bought it on the day of introduction.  Then, they said there was a cutoff time on the day of promotion.  It's been lie after lie.  I can tell you one thing - I ordered the Chromecast on the day of introduction, before 5:30pm and I STILL HAVEN'T RECEIVED MY NETFLIX CODE !  After 10+ days !  This has all been pretty lame of Google to do this.  Even at $35, this is disappointing to me.  At least Amoazon customer service is good and they're supposed to have a rebate representative contact me.", "verified": true, "helpfulness": "4/14", "author": "Bronek Wroblewski"}, {"rating": 4.0, "review": "I pre-ordered this right away, as I have many Apple devices and Android devices, and I love the airplay feature that my Apple products have to my Apple TV. This is Google's take on the idea of slinging your video from device to TV, or redirecting what you're doing on a mobile device to the TV, as well as laptop browsers (Chrome).Setup:My setup was not flawless. It kept telling me that it could not connect my Chromecast to my wireless network. After some jimmying around forward & back, I was able to get it to work without changing any settings. I chock this up to developer hiccups and lack of product maturity. I did the setup from my iPhone, using Chrome browser.My first Cast was from the Youtube app on iPhone 5 to the Chromecast. It worked flawlessly.My second attempt was to Cast from browsers. It is important to know that there is a downloadable app from google to do Casting from computers, plus a Chrome plug in.Attempt 1: Chrome browser on Macbook Air, latest model 2013: Failed miserably. Connected fine but resolution was total artifact.Attempt 2: Chrome browser on Windows 7 on laptop ( a virtual on the Mac) failed miserably: Chrome app told me that I wasn't connected to wifi. It wasn't smart enough to realize I had internet though every other app under the sun has no issue with this. I'm sure this will be fixed.Attempt 3: CR-41 (Chromebook) sharing the tab worked. Slinging video did not work.Attempt 4: Nexus 7 ( latest model ) worked great with Netflix app and sligning/casting the video.In conclusion, use at your own risk until the platform is more developed. It's going to be a great opening and feature for those who live in an Android world and want a feature set similar to Airplay (while they accomplish it differently, that doesn't mater, it's invisible to the user).I would fully recommend this for any nerds, since the price is right and part of the fun is figuring out what works and what doesn't. For the rest of the world, unless you plan to only sling netflix video from a mobile device, I'd say it's not ready.As far as usage goes, it did feel weird that the device simply sits there and waits for video to sling: There is no menu to use, no \"apps\" or other interactivity on the screen as far as selections or options go. It does feel very headless. There is no remote control app, or browser control app, though you can modify a few settings from the browser.This is going to be the next hotness in home TV, and Google is finally there with a good competitor to Airplay.Bring on the competition and making everyone better!UPDATE: Many updates have happened since I originally got this device. A lot of the hiccups are fixed, and many more apps are coming to the device. I really support this for anyone who has an Android or doesn't already own a lot of music/media with Apple.", "verified": true, "helpfulness": "0/0", "author": "RST_"}, {"rating": 5.0, "review": "This works incredibly well and setup is a breeze to set up. I went from opening the box to watching YouTube on my TV in under 10 minutes. I'm looking forward to more apps being available on Chromecast and really unlocking its potential!Quick update: Setting it up on my Galaxy tablet and HTC phone was a breeze too. All you need to do is install the Chromecast app from the Play Store and you're all set.", "verified": true, "helpfulness": "0/0", "author": "MrMister"}, {"rating": 5.0, "review": "How convenient to flip things to your TV from your Android :-) smartphone, tablet, or Google Chrome instantly!! Man, this has been a gem of a product! Love it", "verified": true, "helpfulness": "1/1", "author": "R. Clayton \"Alldayer\""}, {"rating": 5.0, "review": "I was waiting for this kind of device since long time..just click on laptop and boooomm..you have video on tv.", "verified": true, "helpfulness": "0/0", "author": "Vishnu"}, {"rating": 4.0, "review": "Pretty straightforward setup.  Once setup, easy to use.  Very.  Works with netflix, youtube, or google play.  Controlled it from my smartphone, easily (HTC DROID DNA).  Hope they add more streaming services in the future.", "verified": true, "helpfulness": "1/1", "author": "cbhuff"}, {"rating": 5.0, "review": "I see a lot of comments that Chromecast did not work on the Samsung $249 WiFi Chromebook.  It worked fine for me without a hitch.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Tablet Enthusiast\""}, {"rating": 5.0, "review": "I would like to thank Amazon the second time placing my order on back order as this will make ity harder for me to make excuses to sit in front of the TV.They are truly looking out for us and encouraging getting up and exercises by delaying the delivery of this item which would encourage people to spend more time in front of the TV.Also I it is nice to see Amazon supporting our economy by providing plenty of them to these people that are selling them for $80 and up.Keep up the good work and we will have a healthier population and strong economy.Ordered on July 25, placed on back order of July 26,  on Aug 3 given new delivery date of Aug 23, and today Aug 6 placed on back order again.", "verified": true, "helpfulness": "1/2", "author": "DonJoe \"Pa\""}, {"rating": 3.0, "review": "I buy a ton of things from Amazon, but this one slipped and i had to get it through Google directly.Summary-------Devices like these are very common. If you truly know your technology, this is also an overrated technology.What it is----------A mini-mini computer designed to your portable device (ipad/iphone/android) do most of the work.  The alternatives are the Roku, apple tv, and Android mini PC.  The latter still is the best option.What it will do for you-=====================-Let you stream content from your device to your T.V.What it won't do for you-------------------------Let you stream stuff without your device which every other hardware does.Prices------This = $35Mini-pc = $33 (OEM MK802 Android 4 0 MiniAppleTV = $100 (Apple MD199LL A TVRoku 2 = $78 (Roku XS 1080p Streaming PlayerGoogle TV = $999  (really this was a mess of a device and i think only Sony has one out now.  I have the logitech revue and it was a disaster).Final Summary=============This device is Google's answer to the very popular Chinese android mini-pc's using their Google operating system.  Everything you can do with Chromecast can be done with the mini-pc's plus they can do more.  They can run full software like hbo go app, your local cable (brighthouse/TWC app), [...]Plus they can be used as browser with a wireless mouse/keyboard or with a remote software built in to your device.  In the end, i see no reason to spend more than the $30 or so it costs for a fully featured mini-pc for this device (chromecast) or any of the other half functional devices.I'm disappointed in this device.  I ordered it thinking it was a Google branded and certified Mini-pc.  But instead it's just a dumb terminal.", "verified": false, "helpfulness": "0/4", "author": "M. Rodriguez"}, {"rating": 2.0, "review": "I could hardly believe my eyes when I saw these being sold for upwards of 200 dollars. Those stores should be ashamed of themselves! The device costs $35 plus tax and shipping on Google Play. I hope many read this and head to the Google Play store instead of buying from these ripoff artists. I intended to write down every store name that is trying to sell these for an outrageous price, and make sure I never shop there.", "verified": false, "helpfulness": "5/17", "author": "smallthings"}]