[{"rating": 3.0, "review": "Works great once you get going.  Because mine is powered from the USB on the back of the TV, and powered on and off a lot, I believe that it makes it hard for my network to find it.", "verified": false, "helpfulness": "0/0", "author": "Peter  H \"Gray Dad\""}, {"rating": 5.0, "review": "This products has worked flawlessly, and was exactly as advertised. I have been very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Daniel Coffaro"}, {"rating": 5.0, "review": "It's the perfect device to stream your favorite stuff on Netflix and YouTube! Plus the video quality looks great! :)", "verified": true, "helpfulness": "0/0", "author": "Richard Garcia"}, {"rating": 4.0, "review": "Works for what I use it for. Needs more apps.", "verified": false, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 4.0, "review": "Easy to use and navigate. Great for home and away.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "jenny luz martin"}, {"rating": 5.0, "review": "Item arrived on time and is as pictured and described.  It was easy to install and provides us with other watching options.  Have installed additional apps very easy since the original purchase. We are happy with the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jeane"}, {"rating": 4.0, "review": "I chose this over Roku. It's replacing a Roku. I find it to be very responsive and, yes, it's HD, great quality for sure. I mainly use it for NetFlix but Youtube and Vudu seem to be good options as well. The only thing that I found strange and odd to get used to is not having a remote control leaving everything to be done with your phone.There seem to be a handful of apps for casting. However. I'm still trying figure that out and which would be best for me. I have a NAS (Network Attached Storage) that I use mainly for streaming. I moved my DVD files to the NAS. but because I decided not to convert them to MP4 or AVI, they are still .VOB. I have yet to find a 'cast' app that supports .VOB files. only a player that will let me play them on my phone. So, the search for that continues.For the price the Chromecast goes for, it's well worth the money even if to just try it out and resell it on Craigslist some months down the road. I'm keeping it. Though there are only a few apps that I use on it, I am exited to really start digging into this thing.", "verified": true, "helpfulness": "0/0", "author": "FuDogDad"}, {"rating": 5.0, "review": "The only thing I don't like is that some sites are not compatible when playing videos in full screen mode. Otherwise, it's great and super easy to use!", "verified": false, "helpfulness": "0/0", "author": "Meg"}, {"rating": 4.0, "review": "So far so good.  Does what it claims to.  Wish we could stream anything from the internet, but we mostly watch Youtube and Netflix with this.  My boys sometimes listen to Pandora with it.  I'm sure one day this will look quite prehistoric.  Only 4 stars because it's limited on what it will stream.UPDATE: When our router went out and we had to replace it, we could not get Chromecast to hook up with the new router.  Doing more research indicates too many problems for me to try to solve.  The new router was on the list of those compatible, but it wasn't happening.  Rather than keep trying to replace the router with something that would work, I bought a Roku 3.  Chromecast is a great idea, and was great while it lasted. Perhaps they'll make it more compatible in the future.", "verified": true, "helpfulness": "0/0", "author": "M. Bouwhuis \"barrister\""}]