[{"rating": 5.0, "review": "What took me so long to get this? Easy to install and make streaming better. Skip smart tv and blu Ray players with some apps and get this.", "verified": true, "helpfulness": "0/0", "author": "Paula Marie Smith \"Pualaming\""}, {"rating": 5.0, "review": "I LOVE my Chromecast. It works just as well as Apple TV for a fraction of the cost.", "verified": true, "helpfulness": "0/0", "author": "Carla Boudreaux"}, {"rating": 5.0, "review": "It is perfect for the application. Apps are limited but it is one amazing quality product.", "verified": true, "helpfulness": "0/0", "author": "greatpunit"}, {"rating": 5.0, "review": "This comes in handy.", "verified": true, "helpfulness": "0/0", "author": "Shaun"}, {"rating": 5.0, "review": "Excellent,", "verified": true, "helpfulness": "0/0", "author": "Mohammed AlSaifi"}, {"rating": 5.0, "review": "plays music, YouTube and other media from my smartphone.i like the most that it got no interface, no menus to learn.", "verified": true, "helpfulness": "0/0", "author": "yoni"}, {"rating": 5.0, "review": "Great product. I would recommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "Adis radojcic"}, {"rating": 2.0, "review": "It would not work with my Verizon router and I'm no \"geek\" so I would not begin to change settings or anything that might be suggested. I gave it to my son-in-law and hope it worked for him. I have not asked. At least my Amazon Firestick seems to be working even though many have had problems with that too. Maybe I should just buy a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Ms. Phyllis Pierson"}, {"rating": 5.0, "review": "Excellent.  Inexpensive, works flawlessly, small and barely noticeable once installed.  Great value as well.", "verified": true, "helpfulness": "0/0", "author": "Bobby Digital The Professional"}, {"rating": 4.0, "review": "I bought two of these, one from amazon.  Aside from the first shipment getting lost (likely nabbed from my doorstep) I have been very happy with these.  Setup is straightforward and very simple with the assistance of the Chromecast app, and once set up, there are a host of services available for direct streaming.  Chromecast uses 2.4 GhzI run a 55\" television upstairs for my children and a 92\" in the living room for myself.  In combination with my router and very careful WiFi channel selection, I have found that I can simultaneously stream to both televisions via netflix or any other source without issues.My only critique of the chromecast is the lack of utilization of current technologies.  First, the 802.11n standard is capable of throughput up to 450 Mbps with proper hardware and configuration, while the chromecast only supports the 2.4 GHz band and is limited to 802.11g speeds of 54 Mbps.2.4 GHz is also rather crowded and without proper tools and knowledge of the inner workings of WiFi channels, it could be difficult for someone living in an apartment complex (or even a suburban neighborhood as I do) to get a clear signal. To assist in channel selection, I recommend you download a program like WiFi analyzer (available from the google and apple app stores) to your phone.  They have a very intuitive interface that will be helpful to many people.Hopefully future generations of chromecast will come with 5 GHz support, but until then this is still a very useful product.", "verified": true, "helpfulness": "1/1", "author": "themitch"}]