[{"rating": 2.0, "review": "requires you to use your phone/tablet. and always have to press allcast to stream video. Slow interface. I recommend the Amazon Fire Stick. DO YOUR RESEARCH before buying this. I gave this away. didnt even bother doing a refund.", "verified": true, "helpfulness": "0/0", "author": "Ganesh Persaud"}, {"rating": 4.0, "review": "The product works OK! It is ver y usefull for YouTube, Playmusic for Samsung  if the music was bought in Google, VLC, etc. The conecction with the wifi, my cellphone and table is really fast! Can't wait for other apps to use with my Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Diego Lopez"}, {"rating": 5.0, "review": "Good buy! Used everyday!", "verified": true, "helpfulness": "0/0", "author": "Bobby Briggance"}, {"rating": 3.0, "review": "it works most of time, but sometimes freezes, and I need to restart my TV to fix it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Klates"}, {"rating": 2.0, "review": "Worked well for a time. Now it lags and cuts out completely to the point of snow and loud static on the screen. The usb power cord should be utilized as the unit get extremely hot when run off of the standard power cord which I believe has shortened its life and abilities.", "verified": true, "helpfulness": "0/0", "author": "Richard A."}, {"rating": 5.0, "review": "very satisfied", "verified": true, "helpfulness": "0/0", "author": "william w koller"}, {"rating": 4.0, "review": "This has become a staple to my entertainment.", "verified": true, "helpfulness": "0/0", "author": "Bell"}, {"rating": 3.0, "review": "I wish it had more functionality like the Fire TV Stick. This is great if you want to use it with something like youtube that supports chromecase, but bad if you want to just browse for stuff from your TV.", "verified": true, "helpfulness": "0/0", "author": "Mike Kasberg"}, {"rating": 1.0, "review": "We bought this excited to have streaming options for our non smart TV, but it's a refurbished product and I believe that's why it didn't work properly. Our phones kept getting disconnected from the chrome cast and it just turned into too much trouble so we returned it. We plan on purchasing another, brand new, after we do some more research and comparing.", "verified": true, "helpfulness": "0/0", "author": "Thaddeus Davis"}]