[{"rating": 5.0, "review": "very easy t use, up and running within 5 minutes", "verified": true, "helpfulness": "0/0", "author": "charles e. scott II"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jason Hayman"}, {"rating": 2.0, "review": "It's not bad but it wasn't for me. The Voice Action feature is cool but it keeps bringing me to pages that require me to pay for the show I want to watch. Since this was set up through my Amazon account and since I made it aware that I subscribe to Netflix and other featured program subscriptions but it keeps returning to purchase pages. Like I said not for me", "verified": true, "helpfulness": "1/1", "author": "JR South Florida"}, {"rating": 5.0, "review": "Sent backAlready had fire stick", "verified": true, "helpfulness": "0/1", "author": "ric buckley"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "albert"}, {"rating": 2.0, "review": "not happy....returned", "verified": true, "helpfulness": "0/2", "author": "Clifford  Ferguson"}, {"rating": 4.0, "review": "this is a product that does what it says it can do and it worth way more than its cost.... fantastic tool for grandchildren and parents alike.... it is peasrue to use the service - Charlie J.", "verified": true, "helpfulness": "0/0", "author": "Charlie Jannetti"}, {"rating": 4.0, "review": "AMAZON FIRE TV is as they say, simple to install. The various selections are near endless! I have kept my cable but i have trimmed my cable bill over 100+ dollars a month11 THANK YOU AMAZON FIRE TV!!!!", "verified": true, "helpfulness": "0/0", "author": "Gary Jennings"}, {"rating": 3.0, "review": "It's sleek, and performs well. I love the fact I can load apps on it (i.e. plex); which was the driving motivation for my to buy the two units I own.What would have been a 5 star review is now a three for one simple reason \"Advertisements\".The recent appearance of advertisment banners across the top above the recent bar for shows and applications is unaccceptible. What use to be a nice clean interface now looks horrible, and there appear to be no way to opt out. I seriouslly don't know how they thought they could slap an advertisement in there and think it looked good. Had I known Amazon was going to do this I would had not have purched them.", "verified": true, "helpfulness": "2/2", "author": "Mike"}, {"rating": 1.0, "review": "Go for apple tv, much faster no connectivity problems. If you have apple devices like iphone ipad your days will be much easier.", "verified": false, "helpfulness": "2/5", "author": "abid"}]