[{"rating": 5.0, "review": "It's so cool to be able to watch YouTube on the TV.  I love watching old clips of Dean Martin Roasts and comedians, like Jonathan Winters.  It's well worth the price!", "verified": true, "helpfulness": "0/0", "author": "Mame"}, {"rating": 4.0, "review": "Very inexpensive and it works. The quality and overall product is fine. I recommend it.  The downside is the remote control. It's inconvenient.  Comparing, using an iPhone as a remote for an apple TV is smooth and fast. Androids remote ' are slow, you can't type and from the apps like Hulu sometimes you can't even rewind or anything. You basically have  to stop the app, start it again and find what you want to see.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Excellent device, but essentially only for youtube.Google has not really opened it. And since its already 7 months old, theres almost no chance that it ever will", "verified": true, "helpfulness": "0/2", "author": "dmitry"}, {"rating": 5.0, "review": "I got myself two, and a third one for my parents. It has been working great. Every room needs one, it changed our television interaction completely. Note I rarely watch the cable channels, since YouTube has so much material available.", "verified": true, "helpfulness": "0/0", "author": "The Consumer"}, {"rating": 5.0, "review": "Chrome cast was easy to set up and works flawlessly. It is easier to access Netfix through Chromecast than through TiVo.", "verified": true, "helpfulness": "0/0", "author": "David D."}, {"rating": 5.0, "review": "Works great and its cheap.  Great way to get you tube on your TV without having to use clunky interfaces provided by smart TVs or DVD players", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 1.0, "review": "Either my TV, or my desktop, or my laptop are so out date or I am an idiot. It won't work and I am stuck with a dongle.The setup is great if you know how to set it up and what is required. Where is the wifi? on the computer? in the room? My unit never found my wifi.I also found out it wound send streams of anything off the computer. That is what I want. Something to send everything that I see on my screen to my TV.", "verified": true, "helpfulness": "0/0", "author": "Joseph E. Solko"}, {"rating": 2.0, "review": "It doesn't open any video in ur phone. It's limited. Just youtube and Netflix. Hoping they will upgraded to open everything like Apple TV.", "verified": true, "helpfulness": "0/0", "author": "abdulhadi"}, {"rating": 5.0, "review": "I love my Chromecast.  I use Chrome (the browser) almost exclusively and found the transition to \"casting\" video to my TV completely flawless.  I can cast from YouTube or Netflix from my iPhone, too.  I'm looking forward to when I can cast from my (Android based) Kindle Fire, although it is possible I can already and I've not figured it out yet...In any case, if you're comfortable navigating between platforms and savvy about new apps, you shouldn't have a problem with Chromecast.  It is awesome.", "verified": true, "helpfulness": "0/0", "author": "Emily K"}, {"rating": 5.0, "review": "I've owned a GTV and enjoyed being able to fling YouTube videos from my phone to the TV. But then I had always wished for a way to fling songs from my phone's Google music player to the TV. Chromecasts remedies this and adds more and provides a seamless and smooth operation compared to GTV. It makes flinging Netflix, as well as Pandora, to the TV quick and simple. Simplicity is another plus of Chromecast. Setup is painless. And after that anyone with a smartphone or tablet can connect and start flinging content to the TV. At times I will battle it out with a friend flinging YouTube videos to the TV.A couple of tips to make the experience much better.1. Turn on the TV's CEC feature.2. Instead of plugging it in to the TV's USB port, plug it in to a constant power source.The CEC feature allows the TV to automatically switch the TV source input to the Chromecast when flinging content. And the constant power source paired with CEC allows Chromecast to automatically turn the TV on when flinging content. If plugging the Chromecast to the TV for power source, the TV might actually turn off the USB power and thus turn off Chromecast, making it unable to turn the TV on automatically.", "verified": true, "helpfulness": "0/0", "author": "David Kha"}]