[{"rating": 1.0, "review": "Doesn't work", "verified": true, "helpfulness": "1/7", "author": "nathan mitchell"}, {"rating": 4.0, "review": "I'm pleased with the new Fire TV box, it loads up Netflix and Amazon Prime videos much quicker than the blu-ray player I've been using.  The only reason I didn't give it 5 stars is because I can't screen mirror on anything except a Kindle or Amazon Fire phone.  When they release an update that allows me to mirror my android phone (Galaxy S5) or my tablets I will change my rating to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Terry Parks"}, {"rating": 4.0, "review": "Beyond expectations... I almost want to disconnect my cable!!! I love it", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 5.0, "review": "LOVE it. There isn't much to say, other than it is awesome.", "verified": true, "helpfulness": "0/0", "author": "AnthonyH"}, {"rating": 5.0, "review": "A great device amazon fire TV rocks and is easy to setup awesome device thank amazon for creating a great Devicesigned patricia olechnowicz", "verified": true, "helpfulness": "0/0", "author": "Dog Lover"}, {"rating": 5.0, "review": "I particularly appreciate the simple control options on this fine device.  Also, the auto-shutoff is very desirable feature for this absent-minded old codger.", "verified": true, "helpfulness": "0/0", "author": "CharlesWalther"}, {"rating": 5.0, "review": "The best streaming tv product I have seen. Better than the others on the market.", "verified": true, "helpfulness": "0/0", "author": "Nickolas G. Pizzalato \"Nickolas P.\""}, {"rating": 5.0, "review": "Received within 2 days.  Hooked it up without difficulty and my prime watch list was there.  Voice search works well and since I purchased fire tv for amazon prIme movies and tv, I am happy.", "verified": true, "helpfulness": "0/0", "author": "chavan40"}, {"rating": 4.0, "review": "works very well overall...costs a little more so I didnt rate a five", "verified": true, "helpfulness": "0/1", "author": "Adonayson"}, {"rating": 5.0, "review": "This devise is great, everything I hoped it would be and more.", "verified": true, "helpfulness": "0/0", "author": "Marsh Weller"}]