[{"rating": 3.0, "review": "Wish I could get more use out of this but for what it is now, its pretty awesome.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 3.0, "review": "Waiting for Android mirroring & casting without being on the same WiFi.  I hate that you cannot stream local media files without an active internet connection like AirPlay does through AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Item came as described..fast shipping", "verified": true, "helpfulness": "0/0", "author": "Ban Bo"}, {"rating": 5.0, "review": "love the device , now i can cast my Local media ,Netflix, YouTube,Hulu Plus or even Chrome Tab casting without being stuck to my HDMI cable and stuff, easy straight forward setup , no hassle at all", "verified": true, "helpfulness": "0/0", "author": "Islam"}, {"rating": 2.0, "review": "Its just okay.  I wouldn't recommend a friend to purchase it.I initially bought it because you can't go wrong with the price, so I figured I would give it a try.What I ended up using it the most for was renting movies from Google Play and streaming them, streaming Pandora or watching You Tube videos.It was so limited to what websites I could use it with I ultimately forgot I had it and stopped using it.", "verified": true, "helpfulness": "0/0", "author": "M. Mitschele"}, {"rating": 5.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "Andrew Christie"}, {"rating": 1.0, "review": "returned, next to useless", "verified": true, "helpfulness": "0/5", "author": "doughessons"}, {"rating": 5.0, "review": "This thing does the job. I had a \"smart\" Blu-ray player that did nothing but skip and freeze, but didn't want to shell out for a new one. This was a great inexpensive solution to my problem. It's true there aren't many apps out for it right now, but Netflix and Crunchyroll are really all I need. The only other downside is that the apps don't auto-play the next episode in a series, but Netflix has said they'll fix that in an update.  I also like that it cycles through pictures when idle instead of leaving a still image that will cause screen burn in on my old TV.", "verified": true, "helpfulness": "0/0", "author": "Sarah N."}, {"rating": 5.0, "review": "Best think for ever.  :)  I will buy another one once I have another tv too. :)  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Istvan Szabo"}, {"rating": 5.0, "review": "Chromecast is awesome. Netflix and redbox sent straight from my phone or laptop is incredible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]