[{"rating": 5.0, "review": "Works as promised. Got my Netflix code on my email after 10 days of purchase. Very nice, albeit limited as it requires a second device to work properly", "verified": true, "helpfulness": "0/0", "author": "Guilherme Godoy"}, {"rating": 5.0, "review": "This is the best streaming product for YouTube and Netflix. Only its missing Amazon Prime and On Demand streaming... come on Amazon make an app for this...you've sold way over a hundred thousand units. Wouldn't you want to sell to those people? I know I would buy more movies and series from Amazon if they had an app for Chromecast.Definitely easier to use than GoogleTv. And using your Android  phone or Chrome browser on a laptop to control it makes it so easy to use.Seriously,  Amazon get to work:)", "verified": true, "helpfulness": "0/0", "author": "k.haze"}, {"rating": 5.0, "review": "Gonna be good for streaming during Football season! Wish this had been out a few years ago. Would'a saved hooking up another computer to the tv (in different room from higher speed office computers using Chromecast).", "verified": true, "helpfulness": "0/0", "author": "Travis Parker"}, {"rating": 5.0, "review": "Works great.  Set-up was easy, connection was easy.  Playing movies and tv shows was easy.  Just waiting for expanded available content.", "verified": true, "helpfulness": "0/0", "author": "Tom H."}, {"rating": 1.0, "review": "Unless you watch YouTube all day this sucks!  Don't get this if you want a good functional unit to use your different online components.  Thanks so much for the refund!", "verified": true, "helpfulness": "2/5", "author": "Sunnymatl"}, {"rating": 4.0, "review": "I like the concept and that is why I gave it a 4 *.Not much content on it yet, but I expected that and I am looking forward for Google to quickly add more content.I also expect that Google will upgrade Chromcast electronically through the WEB, as improvements are made.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "I ordered one of these as soon as I heard about them on day 1. I liked at the time that they offered the Netflix deal as well. However, even without this deal (Google took it away), this little device is totally worth the very small price. I would get another one if my second TV could receive Wi-Fi where it is. So at some point if the price is the same i'll by another.The added benefit is that it does work with Android and iPhone (probably any i-device). It also works with the PC with a Chrome browser. The apps have the built in icon that lets you stream the content to the TV, so once the source is playing, your device is OK to use again. Basically it works by telling the Chromecast where the source is so it does not come from your phone/tablet.At this time, Netflix, YouTube, Google Music and Chrome browser are supported. I have not tried watching Amazon or Hulu through the browser.", "verified": true, "helpfulness": "0/0", "author": "David Beckett \"DB\""}, {"rating": 5.0, "review": "It is beyond my expectation. It is very enjoyable and convenient, very good choice, especially at such a low price.Pros:Small in size, and no need to connect to electricity, nice design.Cons:Only support youtube and netflix. Can only sync static contents form Chrome browser to Chrome Cast.I will recommend other to have one.", "verified": true, "helpfulness": "0/0", "author": "Harry Tan"}, {"rating": 5.0, "review": "It was easy to connect, though I'll admit muddling around for a half hour because I didn't follow instructions.  I'm able to show almost any web content at the screen resolution of my laptop, and for Netflix and Youtube it's even better. I look forward to more sites providing the direct link for chromecasting, such as Netflix has.Sound quality also comes through well.One drawback: In fullscreen mode off other than Netflix and Youtube, one can't use the laptop for other purposes.", "verified": true, "helpfulness": "0/0", "author": "David Hansen"}, {"rating": 5.0, "review": "Handy too for mirroring, I expect developers to start incorporating this into several of their apps soon. For the price and the size of it, I don't you can go wrong with this. It does just what it says it does.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Kaylee\""}]