[{"rating": 2.0, "review": "used the device to cast several instances of streaming media (NETFLIX and HBOGO) from my IPad to a TV and the results was extremely poor. The picture was very choppy, pixilated and froze up a lot.Not happy with the performance of this device. I may try again to cast from a laptop to a TV but this is not how I originally planned to use this device.Update review:Tried casting from a laptop and it works very well for Netflix and YouTube but does not work well casting browser tabs. I guess Google is still developing usage for this device. Excellent performance for limited applications.", "verified": true, "helpfulness": "0/1", "author": "DanLasVegas"}, {"rating": 5.0, "review": "Let's see. It was easy to set up. I loved the part where I can play something using my cellphone via netflix or youtube. If I have a presentation in youtube I saved I can easily play it. The best part? I am remote or cordless. This gadget is cheaper does a great job. Why connect your laptop when you have your cell and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Happy Cappy"}, {"rating": 2.0, "review": "Maybe eventually when there are broader applications for this, it will be more useful to me. At least it was inexpensive.", "verified": true, "helpfulness": "0/3", "author": "Carrie"}, {"rating": 4.0, "review": "Not bad for the price but it is not the end all solution to casting all of your computer based apps.  Doesn't work with Amazon prime (unless you kludge with Chrome) and has issues with Chrome running on an iPad.", "verified": true, "helpfulness": "0/0", "author": "Mickey E"}, {"rating": 4.0, "review": "I was more than excited to get my Chromecast.  It was back ordered, and then Amazon got it to me more than a month sooner than expected.  Nice job Amazon.  My entire hope for this device was to drop my subscription for HuluPlus and just use my laptop to cast episodes full screen.  Turns out my 2006 Macbook Core two duo running Snow Leopard can't really cut it. Later I find Chromecast wants OSX 10.7 or better, which I cannot install on my machine (not a criticism of Google.  I probably need to start paying closer attention to system requirements with my decrepit computers).  However, my 2008 iMac with a faster processor running the same OS casts perfectly, so it's clear casting is processor intensive.  I usually get annoyed when folks post bad reviews for entirely non-product related flaws, so no stars off for this issue.Set up was a snap, even in a non supported OS! It was a strange procedure of connecting to a wifi network generated by the Chromecast itself and then setting it up. Then I was instructed to disconnect from that and go back to my house's WAN for normal use. I'm wondering just how possible it might be hack my Chromecast and gain access to my house WAN with this unsecured signal from the device (the Chromecast stores the WEP key).  Minus a star.The Chromecast app in iOS works great.  It's a joy to be able to share YouTube videos with my wife without having to hold my iPhone between us. I don't have anything up in GooglePlay so I can't comment on that, and we don't subscribe to Netlfix.  My other great hope is Google will come through on their statement to produce/host more apps to cast more media from other sources.", "verified": true, "helpfulness": "0/1", "author": "Charles"}, {"rating": 1.0, "review": "Will not fit into the HDMI in back of T.V.I would have loved to have used it also if you do not have a internet connection it will not work i bought this because we live in the woods and thought i could put movies on the computer at work then bring home for the family", "verified": true, "helpfulness": "0/6", "author": "neal stockman"}, {"rating": 4.0, "review": "great execution, product arrived on time as promised, set up was easy...sort of had some issues but solved it without to little frustration. the only compliant I have is content, Netflix and youtube, come on guys...2??  really, its 2013, 1999.......otherwise 5 stars. highly recommended product.", "verified": true, "helpfulness": "0/0", "author": "Amado Royola"}, {"rating": 3.0, "review": "Cool device, but found limited apps a bit disappointing. I know they are coming but there is no timetable from what I can tell.-Did a great job with HD cast from YouTube.-Chrome browser display was adequate-Tried using Flickr slide show mode through browser interface and it was VERY sluggish-Installation was not as seamless as advertised. I have FiOS and had to make changes to network setting that most basic users would not comprehend.", "verified": true, "helpfulness": "0/0", "author": "Pete Felber"}, {"rating": 1.0, "review": "I had high expectations when I purchased this gadget.  I installed it and...poof...it was a dud.  The streaming sucked big time, with buffering all the time; I could only get two Internet sites (Netflix and something else); the quality was awful; there was zero reason for me to keep it, especially as I have a PS2 player and can get full access to the Internet.The most disappointing aspect of this was that Google produced it.  I expect only quality products from Google; they've really failed on this one.", "verified": true, "helpfulness": "2/3", "author": "peter graves"}, {"rating": 3.0, "review": "Chromecast has very limited play-back capabilities. Although youtube, netflix and google play work fine, the picture quality in google Chrome browser cast still needs major improvements.Also, it would be best served if I could cast videos from other providers like Dailymotion, vimeo etc. If these video providers come on board soon, I will be more than happy to give it 4 stars. But in its current state, 3 stars is appropriate.", "verified": true, "helpfulness": "0/0", "author": "Himanshu Dhimar"}]