[{"rating": 5.0, "review": "I love this little thing.  We ended up canceling our cable, because cable is getting too expensive and given the projection from the Comcast/Time Warner merger - this was a good alternative to spending approximately 200 dollars a month on cable.  My wife and I are extremely happy with this product.  Amazon always seems to be amazing us with their products.  I strongly recommend this product to anyone looking for an alternative to cable or just really enjoys reliable and high definition(close to Blu-ray, if not Blu-ray) video.", "verified": true, "helpfulness": "1/1", "author": "Timothy Ward"}, {"rating": 4.0, "review": "Worked well and was fast. Couldn't justify keeping it however, smart TV and other products already do it. Voice search is fun but ultimately an app on a phone queues up netflix better, etc....", "verified": true, "helpfulness": "2/4", "author": "Capt. Justice"}, {"rating": 1.0, "review": "Unfortunately the audio did not work with my Vizio model TV VA320M. Called Amazon tech, and advised to try another HDMI cord.  I went out and purchased another cord, but still could not get the audio to work. I was told that Other customers with my model Vizio had same problem. Returned product to Amazon. I hope they get it fixed soon!", "verified": true, "helpfulness": "1/5", "author": "Donna L Kitt"}, {"rating": 5.0, "review": "I will be canceling my Direct TV service as soon as my contract runs out. Everything you need and want to watch right here available on AMAZON TV", "verified": true, "helpfulness": "1/1", "author": "Jenny Billings"}, {"rating": 5.0, "review": "I would REALLY love to see crunchyroll get an app on the FireTV. I think that would give me the motivation to use it more than what i already do. Which is very rarely because I end up just using my roku for crunchyroll; But I would really like to retire it for the FireTV but no crunchyroll is the only deal breaker ;(", "verified": false, "helpfulness": "2/2", "author": "Tyler"}, {"rating": 5.0, "review": "It's wonderful; easy to use and lots of good content. I should have ordered it sooner. I've been glued to it since it arrived.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customerb. anding \"boop\""}, {"rating": 2.0, "review": "It took sometime to set this up and seemed to work pretty well sometimes and at other times doesn't.  I would not buy thisagain.", "verified": true, "helpfulness": "1/6", "author": "bailcor"}, {"rating": 5.0, "review": "Way more positive than negative with this. Granted, I'm coming over from the Netgear unit which, in terms of speed, is like going from dial-up internet to cable. Seriously, it's THAT much of a difference. The jury's still out as far as Prime is concerned but one of the weird gripes comes from Amazon Instant Video. Since it's not with the unit itself, I didn't dock a star but why haven't they implemented an auto-queue feature like Hulu and Netflix use? Not that I'm THAT lazy but it is nice not having to push forward then then enter EVERY TIME you want to move to the next episode of a show.***Important note*** Pay attention to the specifications for HDMI. I used a first generation cable and had all sorts of issues. Hulu and Netflix will either not work at all or give you various playback errors that gave me all sorts of frustration setting this up. Once I changed cables out, I was flying. It's in the instructions but....who reads those?!", "verified": true, "helpfulness": "1/1", "author": "RJ"}, {"rating": 3.0, "review": "I have used it and it is ok but the things we would like to watch you do not have or you have to buy them. When I am looking for documentaries to watch I have to go through all the movies so I just use netflix. I like the voice activated search but it comes up empty most of the time. Sometimes it has to reboot and I do not know if it is you or my internet provider. I hope you continue to work on it to make it easier to navigate.", "verified": true, "helpfulness": "2/3", "author": "Diana"}, {"rating": 5.0, "review": "It seems that as a \"Prime\" member a bigger selection of movies/shows would be free. Of the first 5 that I chose to watch, 4 of them I had to pay for.", "verified": true, "helpfulness": "2/3", "author": "Joseph C."}]