[{"rating": 4.0, "review": "easy set up,great performance but has issues... 1. does not release tv back to original hdmi when you are done using device, you have to redirect back to your broadcast hdmi,with the tv remote. 2. since installed on my samsung modelsm-t217s from sprint, my sound got turned off, will need to bring to store to reboot tablet. other than these bugs,unit is great....", "verified": true, "helpfulness": "0/0", "author": "Michael J."}, {"rating": 4.0, "review": "At first the device seemed to work  inconsistently but that was my error.  After getting use to the operations, it has been flawless and I highly recommend it.  I have found myself using Netflix a lot more due to the ease and I didn't have to buy a $40 hdmi cable and I simply unplug it and move it to whichever tv I want to watch on until I buy one for each set", "verified": true, "helpfulness": "0/0", "author": "Michael Hartlage"}, {"rating": 5.0, "review": "I am just scratching the surface of the Chromecast and it is surpassing my expectations every day.  From streaming movies to just showing people websites it works great.  Worth so much more than the $35 price tag.", "verified": true, "helpfulness": "0/0", "author": "Greg Hager"}, {"rating": 5.0, "review": "i managed to purchase 3 of these takes a minute to set up, easy as one, two , three love it", "verified": true, "helpfulness": "0/0", "author": "darlene bridge"}, {"rating": 5.0, "review": "Chromecast is awesome for what it is: Cheap and effective way to wirelessly stream entertainment to the TV. The product itself is flawless in my opionion, meaning great build quality, reliable performance and won't fail you.I use it to stream from a PC and a laptop.. so I find that an HDMI cable is almost better for me as I can stream my desktop, blu rays, etc. but it is nice to stream across longer distances.I think there are more features that could have been incorporated or that you will find in other streaming devices, but you are going to be paying a lot more than you would for Chromecast. For that reason I have given it 5 stars and would recommend this to anyone who's needs are specifically met by it.", "verified": true, "helpfulness": "0/0", "author": "MattTek"}, {"rating": 1.0, "review": "I did get the unit installed properly, I think.  The problem is controlling play, pause, or stop after the movie starts.  I would not recommend the unit.", "verified": true, "helpfulness": "1/1", "author": "Jim-Bob-Willie-Joe"}, {"rating": 5.0, "review": "Very easy to set up, easily controllable from a Google or iOS device, and great bandwidth performance. Hopefully it will cover more broadcasting services in the near future.", "verified": true, "helpfulness": "0/0", "author": "halukbg"}, {"rating": 3.0, "review": "When it works, it is great.  But it took me a long time and several downloads to get it working on my iMac.  And this evening, I see the device in the lower left corner of my TV, imy wifi appears to be working, and when I go to chrome and then youtube it can't find a device.And the help on the chrome cast site is AWFUL!", "verified": true, "helpfulness": "0/0", "author": "nosh \"nosh\""}, {"rating": 5.0, "review": "Easy way to stream Netflix and Youtube from my smart devices. Seems to stream in better quality than my apple tv does and is vastly cheaper. Hopefully with the release of the SDK more apps will be able to make use of the device.", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 3.0, "review": "The power adapter was required. This was disappointing. TV commercials ill use to the unit being self powered, or drawing power from the TV.Works we'll. One of the aspects about this adapter is the ability to stream foreign films with the English subtitles. Before this adapter I needed to stream to my computer to see the subtitles.I am not sure how to stream other programs to this unit, at this time it appears only to stream Netflics and YouTube. Maybe a future update will stream other software such as MS PowerPoint for presentations, or Facebook etc.", "verified": false, "helpfulness": "0/1", "author": "Iphone Kindle"}]