[{"rating": 5.0, "review": "Please buy one of these if you have a flat screen display with HDMI and not net capabilities. it will be well worth you money and time.", "verified": true, "helpfulness": "0/0", "author": "Hector Caceres"}, {"rating": 5.0, "review": "I love it. It does what they say it does which is stream content from Netflix and Google play movies and YouTube flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Gregory Wajda"}, {"rating": 5.0, "review": "I installed the device in less than 5 minutes.  Truly easy to install and use - AND very well priced!", "verified": true, "helpfulness": "1/1", "author": "Lisa Magno"}, {"rating": 4.0, "review": "hope google will update the software so i could mirror my IPAD, and also blackberry support for netflix, and youtube.", "verified": true, "helpfulness": "1/1", "author": "MAHESA SATHIAKUMARAN"}, {"rating": 5.0, "review": "This product is amazing, the setup is short and VERY easy!It works great with Netflix and youtube, there is always a bit of a delay to start the video, but once it is started, the controls are almost instant! The future possibilities are endless for this little package which is just a bit biggerthan the old USB key we used to see.Please know that if your TV does not have a USB port (Maintenance ports CAN NOT be used), you do need to have a power outlet available...which should not be an issue in most case since you need a power outlet for the TV anyway!", "verified": true, "helpfulness": "0/0", "author": "Yanick Villeneuve"}, {"rating": 5.0, "review": "great way to watch movies and tv without a lot of wires or expensive hardwarewish it worked with Amazon prime", "verified": true, "helpfulness": "0/0", "author": "moldie"}, {"rating": 5.0, "review": "*Easy setup*Flawless streamingstreaming*Price is crazy cheap*If you own an Android device and have a Netflix account, this is a must-have device", "verified": true, "helpfulness": "0/0", "author": "R. Mills"}, {"rating": 1.0, "review": "Video quality is poor. No comparability with chrome for Android devices. It is not usable.I have Google TV that is 200 times more feature and video quality", "verified": false, "helpfulness": "2/4", "author": "Arfa"}, {"rating": 5.0, "review": "It works and it works great best 35 dollars I ever spent only regret I did't purchase more than one now I have to wait.", "verified": true, "helpfulness": "0/0", "author": "Bernardo"}, {"rating": 3.0, "review": "It's a well designed and clever piece of technology.  .  Until a lot more apps and site support Chromecast, it will be of limited us.The setup is easy for wireless applications but it's not obvious how to get a wired device on your network to join in the fun.Only by Googling a solution did I discover how to get Chrome to play an MP4.  It can't play AVI's so I cant 'chrome cast' them.The device itself gets very hot while powered up, so I power it off a USB outlet on my TV.  That way it is powered off when my TV is, rather than constantly cooking while being powered by mains electric.", "verified": true, "helpfulness": "0/0", "author": "Edward D J Frost"}]