[{"rating": 3.0, "review": "Real nifty for wirelessly streaming Youtube and Netflix.  However, these streams will occasionally crash.  Unfortunately I bought this primarily to stream web browser video and this function simply does not work.", "verified": true, "helpfulness": "0/0", "author": "Brian Hill"}, {"rating": 5.0, "review": "This piece of technology is awesome! I purchased a Chromecast because I was disappointed with user interface on my Sony Bravia teleivision. I was surprised how easy it was to setup and it is quite intuitive. The people who had a hard time setting it up simply failed to follow the instructions. I am a network/client tech by trade but my fiancé had no problems setting it up when I decided to use her to test ease of setup. One negative thing I will say is there are only a handful of apps supported and the ones that do work can be a bit buggy at times. That is expected and with time the supported apps should increase. For people giving bad reviews for unsupported apps, well you should have researched the product before purchasing.", "verified": false, "helpfulness": "1/1", "author": "D. Chavez \"realistik\""}, {"rating": 5.0, "review": "Works perfectly!  I read some of these reviews and realize just how many poor shoppers and people who don't understand the \"BASICS\" there are.  People READ...  it's a casting media player, not a roku or FireTV.  If you want an app rich device that you run from your TV, you purchased the wrong thing.  If you have basic (AND I MEAN BASIC) knowledge about your home wifi and want to stream media content or display your browser from your phone, tablet, or PC to your TV, you'll love this.I had it setup in about 5 mintues and was streaming Netflix and then WatchESPN from my iPad in 1080p video that was very smooth.  It loads fairly quickly.  I never experienced any buffering and overall, I thought that the video image was great.  My bandwidth is around 15 Mbps.  I suspect if you can currently stream video content before adding the Chromecast you'll be fine.To be honest, I have to wonder if this device will survive much longer.  I paid $22.99 for it, which was all I would pay.  With the upcoming Fire Stick from Amazon coming soon, I'm sure everyone will opt for it, unless displaying your browser is important.", "verified": true, "helpfulness": "0/1", "author": "GP \"Golfer393\""}, {"rating": 5.0, "review": "google does it again. Cast anything i want from my desktop computer to ANY TV. inb4 taking over the world.", "verified": true, "helpfulness": "0/0", "author": "Stone Kold Killa"}, {"rating": 4.0, "review": "Its great for pulling videos from sites like Youtube, hulu, netflix, pandora (Radio), and othersBut its not a full browser, so you cannot play videos from other paid subscription sites like EOS entertainment and others.What I like the best is that you can control it with your cellphone. I was thinking it would be an issue initially, but I actually love it.Easy to install, pretty much plug, follow instructions, allow it 10 minutes to set-up the first time, and you are good to go.My TV has a USB port, so I didnt need to use a USB charger, but there is one in the box if you need one, along with HDMI extension, in case you are in a tight area and need to manuver the port.", "verified": false, "helpfulness": "0/0", "author": "Gaurav K. Dhamsania \"scary gary :)\""}, {"rating": 4.0, "review": "bought for daughter she thought it was okay did what it was suppose to but people need to read about it and understand what it is compare to the Roku 3,Fire TV,Apple etc..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well simple to use", "verified": true, "helpfulness": "0/0", "author": "Mark Dan"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Christie Marks-Johnson"}, {"rating": 1.0, "review": "The device it's self ... worked ... but its functionality was just not there. I get that its small and thus not much room for processors and storage and such but it has no built in anything such as apps like Netflix or anything else. EVERYTHING has to be streamed from another device such as a computer phone or tablet. I could not get either my phone or tablet to really sync well with it at all either and when I could there was no ability to stream built in media such as videos/pictures or even the screen. The app for the phone appeared to be a Beta version or at least functionality within it was and did not work. Amazon's return was awesome and easy. Save your time and get a Roku/Apple TV/Fire TV", "verified": true, "helpfulness": "0/3", "author": "~ Kyle"}, {"rating": 5.0, "review": "Cheapest streaming device. I can't seem to find anything that is wrong to it. Some may prefer to have a remote to it, but it is not my case. I like when I listen to music and I can skip the song with my LG G Watch, which is hooked up to my smartphone. My friend was just shocked last time I did that. The only thing that may be bad is that it's for select services only, but most popular service have support for it now.Pandora, Spotify, Netflix, Google Music, Youtube and Plex all support it and I don't think it's much of a problem like when it first got out. Must buy!", "verified": true, "helpfulness": "0/0", "author": "Jean-Francois Simard"}]