[{"rating": 3.0, "review": "I like Amazon Fire TV a lot, but I can't yet give it a five-star rating since MLB.TV isn't yet available. I got Fire TV in order to ditch cable, but I need the ability to watch baseball to do so.", "verified": true, "helpfulness": "0/0", "author": "Bart M. Bartlett"}, {"rating": 3.0, "review": "It works great with my Amazon Prime, but not so well with Netflix. I have been unable to watch a movie without constant interruptions and finally getting the following message. \" We are having trouble playing this title right now. Please try again later, or try another title\". Switching over to Netflix on my computer, it continues to stream without interruption. Obviously, it has some issues to be corrected.", "verified": true, "helpfulness": "0/0", "author": "Walter J. Siuda"}, {"rating": 5.0, "review": "After reviewing all the streaming products Amazon fire TV was the best by far! Easy set up, easy to run", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 4.0, "review": "I love the voice search but I don't recall reading that it only works on Amazon Prime.  You are back to the good old search for the letter and enter on Netflix.My biggest beef is really more for Prime than Fire TV.  When you find something you want to watch you have to make at least 2 clicks to find out if it is free or not.  Why can't that be front and center? It does open your search capabilities only to find out that there is not as much \"good stuff\" for free on Prime as Netflix.It was extremely easy to setup.  From box to watching in about 5 minutes.  Very intuitive and a no brainer. The device itself is good looking and very Apple-like. The remote is responsive and has a good feel. I love that Fire TV is app friendly with other services such as Plex, Netflix, Crackle, etc.I would and have recommended it to others.", "verified": true, "helpfulness": "0/0", "author": "ArkyBob"}, {"rating": 5.0, "review": "My family loves the fire TV and having access to the programs and games we love on our own time.", "verified": true, "helpfulness": "0/0", "author": "Gidget Kinley"}, {"rating": 4.0, "review": "Setup is super easy! The toughest part was trying to get the batteries in the remote.  It is very streamline and the diagrams don't give a hint it is the bottom back piece that will reveal the battery slots. The Amazon Fire TV box is an attractive space saver; very streamline.  Don't forget to buy the HDMI cable.Not intuitive to find \"unlimited access to over 40,000 Prime Instant Videos on your HDTV\". It took a while to figure out where all the free viewing is located.  The fastest I've found so far is to voice \"Amazon Prime\". Love listening to Pandora! Audio is clear and crisp.I'm not an expert, but these are some of things I learned.  There's still a BUNCH I don't have a clue about yet.  But I'll figure it out.  Help is very basic which leaves trial and error learning. I still haven't discovered what \"Amazon badge\" looks like.  According to 'Help' it denotes a free Amazon show.I'm not a fan of paying for a manual that should come with the product. Amazon lists books you can buy to learn more tips. There are lots of them from which to choose.I recommend Amazon Fire TV!  Very happy to watch shows like \"Andy Griffith\" and \"Grimm\" without commercials!  Lots of variety included with my Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "BC"}, {"rating": 5.0, "review": "Having 1 Apple TV, 1 Chromecast, 4 streaming BluRay players & 3 various Roku's devices to compare against the Amazon Fire TV, I have determined the Fire TV is far superior in performance.  It has a more powerful CPU, more RAM & more storage than any other streaming device in my collection.  It's worth every penny of the $99 i spent for it.  It will be even better when they start streaming HBO.", "verified": true, "helpfulness": "0/0", "author": "BobbyRed"}, {"rating": 5.0, "review": "A no brainer to hook up and use, even for an 80 year old.  Picture is amazingly clearf. Love it.", "verified": true, "helpfulness": "0/0", "author": "Dr. Richard J. Warren"}, {"rating": 2.0, "review": "If you are willing to pay high fees for content you have already seen on tv multiple times this is for you. Otherwise, maybe tv isn't so expensive, after all. You need deep pockets to take advantage of this expensive toy.", "verified": true, "helpfulness": "2/3", "author": "Colin Brash"}, {"rating": 4.0, "review": "So far I have only used for Netflix. Is really good. No complains. Set up was easy and the fire itself is easy to use. I rated 4star because I haven't really get the chance to use for other stuff and don't know how is going to be. So far I will recommend it to all.", "verified": true, "helpfulness": "0/0", "author": "millicent arthur"}]