[{"rating": 5.0, "review": "Works just great! Provides support for youtube but also for other apps, love streaming the music.Ps. Support for 802.11a would be desired.", "verified": true, "helpfulness": "0/0", "author": "kocur \"kocur\""}, {"rating": 4.0, "review": "It easy to set up, my kids love it! Amazing range compared to our iPhones and Roku. Only down side for us...it's an awkward shape and a little difficult to plug into older TVs. New TVs are simple connections are in the open.", "verified": true, "helpfulness": "0/0", "author": "Kim Grolemund"}, {"rating": 3.0, "review": "I don't know why it doesn't  work on my receiver. Apple TV works fine and other devices too. I'd like to know why?", "verified": true, "helpfulness": "0/0", "author": "Edward"}, {"rating": 5.0, "review": "I've been a Roku owner for years, but I decided to try Chromecast. I've not been disappointed in the least.", "verified": true, "helpfulness": "0/0", "author": "Christopher Knight"}, {"rating": 5.0, "review": "Fantastic device. I heard this was easy to set up and use and it was even easier than imagined. Anyone connected with an Android or Apple device to the same wi fi network can stream to it with no setup. I also have a Roku, a great device in it's own right, but I find I never use it now because the Chromecast is so much easier and faster to use. Picture quality is also outstanding.", "verified": true, "helpfulness": "0/0", "author": "JonK"}, {"rating": 5.0, "review": "Great product, works well with SO many of my favorite apps, very easy to use and a great value Thank you!", "verified": true, "helpfulness": "0/0", "author": "Jon Parker"}, {"rating": 3.0, "review": "It's so limited from devices; but anything on the Chrome browser is great! Slow, but great.I would like it to work like Airplay and force broadcast anything on your device or computer.Any day Google may actually get up to speed.", "verified": true, "helpfulness": "0/0", "author": "The Reviewer \"To be, or not to be.\""}, {"rating": 4.0, "review": "This is a decent streaming stick. It hooks to the back of your tv in your HDMI port and streams stuff from all your devices - laptop, computer, cell phone, and tablet. It takes a bit of getting used to but you can watch videos on youtube, netflix, etc. It also has other extensions that allow you to view other media like music and movies. It's pretty comparable to the roku streaming stick but with the chromecast, you use your device as your remote (ie. phone, tablet, laptop).", "verified": false, "helpfulness": "0/0", "author": "Eduardo Espinoza"}, {"rating": 5.0, "review": "This article is very interesting. Installation is simple and intuitive. When connecting with Google Play will be obtain so much benefits in this article so cheap. The bridge set it is fast and stable", "verified": true, "helpfulness": "0/1", "author": "Antonio Boscan (Venezuela)"}, {"rating": 3.0, "review": "Its just a DLNA device. Which are included with most Bluray players now and most cell phones now have the DLNA technology which will broadcast to your player.", "verified": true, "helpfulness": "0/0", "author": "Ryan McCann"}]