[{"rating": 5.0, "review": "Recommended", "verified": false, "helpfulness": "0/0", "author": "raynier"}, {"rating": 5.0, "review": "Don't know why it took me so long to get a Chromecast. Even though I have other means of streaming Netflix and HBO Go (i.e., an Xbox) this little device still gets used if I just want to watch something quick. I have mine running off of TV power (it is plugged in and gets its power from a usb port on the TV). This means that the device powers off when I turn the TV off. When the TV is turned on the Chromecast takes about 5-10 seconds to boot up and is ready to go. I currently use it to stream Netflix, youtube, or HBO Go using my Samsung Galaxy S4 as the \"content controller\".It's important to realize with this device you need more than just a Chromecast and a TV. You need something to direct the content to the Chromecast. This can be a phone, a tablet or a PC on the same wifi network as the Chromecast. I'm not positive, but it doesnt seem to me that the intermediary device (phone/tablet/PC) uses any data/processing power in this function as my phone never heats up or has a significant drop rate in battery power, it really just seems to be operating as a remote control. For this reason, the streaming content you choose to send to the Chromecast has to have an app on the \"remote control device\". This means that I cant stream NBC sports (premier league soccer) through my phone to the Chromecast because there is no Google Play app for this streaming content. Luckily, you can use a PC with Google Chrome browser and stream anything in that browser window to the Chromecast! This means that on my PC upstairs I can open a browser tab start the NBC sports content in the tab maximize the window and (using the Chrome browser extension \"Google Cast\") send the content to my Chromecast/TV downstairs. The only problem there is controlling the source content (on the PC) since it is now not in the same room. Therefore I set up Teamviewer software on my phone and connected to the PC in order to pause and change content remotely.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 4.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "Asad"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "lb"}, {"rating": 4.0, "review": "Bought this for my boyfriend and he loves it! He does have problems with it rebuffering frequently, though, so only giving it 4 stars.", "verified": false, "helpfulness": "0/0", "author": "Emily Mahar"}, {"rating": 5.0, "review": "Easy to set up makes streaming a snap .", "verified": true, "helpfulness": "0/0", "author": "missmaui"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "peteferren"}, {"rating": 5.0, "review": "got 3 of them", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was a little tricky getting it set up but the Amazon folks have been very helpful with a few little tips and tweaks.", "verified": true, "helpfulness": "0/0", "author": "Yams"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Emir Vallejo"}]