[{"rating": 3.0, "review": "This little device has a lot of potential.  But since it seems that all Google wants to do is to capitalize on things nowadays (money must be tight) it is really a you tube and a Netflix player unless you can figure out on your own how work around all the imposed restrictions.", "verified": true, "helpfulness": "0/0", "author": "ayatsk"}, {"rating": 5.0, "review": "I have been using Google's search website for years, and I love it so much and I know I can always trust Google. The device I have been using for months confirms everything Google has done is always wonderful. I love Google.", "verified": true, "helpfulness": "0/0", "author": "YZ"}, {"rating": 5.0, "review": "I love it.  I love how straightforward it was to set up (cannot say the same for Apple TV).  I can watch Netflix movies while I exercise.  No hassle.  Admittedly I did have to get a switch so that I could also watch other things using Apple TV  since Chrome does not support everything and I only have one extra HDMI port, but what a feeling of power to cast things to my TV from every one of my devices, PC, Android, IPhone, Macbook, Mac Air!  Except for not having an HD TV, I cannot think of any reason, considering the price, not to get it.", "verified": true, "helpfulness": "0/0", "author": "Phylis K. Stein"}, {"rating": 4.0, "review": "Works as advertised, just make sure you read the advertisement!  Most internet stuff comes in fine, some is very low resolution.  This is probably due to the upload stream more than the download stream.  Sure beats plugging in an HDMI cable especially if you have more than a few TV's, but is just a glorified wi fi etena that portals your laptop to the bigger screen TV.", "verified": true, "helpfulness": "0/0", "author": "Ken Humphreys"}, {"rating": 3.0, "review": "I had Apple TV at my parent's house and when I went to college I was miserable without Netflix. I ordered Chromecast after Christmas. Delivery was pretty fast. In comparison to Apple TV, Chromecast isn't interactive at all on your TV. I liked being able to have Netflix on my TV, but with Chromecast it's all through the app on your phone. The good thing about it is it connects Androids, too, which my roommate likes.Chromecast is also pretty slow. If I'm watching a show and want to pause it, it takes a few seconds to load which is kind of annoying. Other than that, it does everything else it's supposed to! I definitely prefer Apple TV, but for the price of Chromecast I'm not complaining.", "verified": true, "helpfulness": "0/0", "author": "Megan Ware"}, {"rating": 4.0, "review": "Set up was simple. It took less than five minutes to set up. Works great with netfix and YouTube. HBO go is not great, but I suspect that is a problem with the HBO GO app. Make sure to change ypu tv's hdmi settings if you want it to turn on your tv. Would be five star if there were more supported apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "What happened to the student promo, as published on the Amazon websites for $24.95 until Feb 11, 2014?  I understand that inventory may run short, but there are still 30 days until the end of the published promo.  This promo is being published on various websites throughout the internet, and links to this page where the end user receives a message that it is not available.This is horrible marketing and very poor customer experience.  Yes, you have the option to change your promo at any time, but I understand the concept of bait and switch (advertise a great price, customers come to your Amazon site, and when the promo is not there they only have the option to purchase at a higher price.)Sorry to be a complainer, but saving money is important, especially for students.  Businesses should calculate and project response rates and stock merchandise accordingly.  I signed up for a student Amazon prime service, paid, just to partake in this promo and had to wait 24 hours to use the promo code... now the promotion is gone.  You've lost my business.", "verified": false, "helpfulness": "0/0", "author": "Bob Wilson \"Kind regards ~ Bob\""}, {"rating": 5.0, "review": "I highly recommend this. Its the greatest thing since sliced bread. At a whim we can decide to watch a movie and all I have to do is go to my ipod or PC and watch a netflix movie.", "verified": true, "helpfulness": "0/1", "author": "olga"}, {"rating": 1.0, "review": "After you purchase it they give you a list of about every router that it doesn't work with (which is about all of them). They all need some obscure settings changed for it to work.", "verified": true, "helpfulness": "0/2", "author": "Awesome Art"}, {"rating": 1.0, "review": "NO Kindle, Junk overallWILL NOT STREAM CONTENT. Only streams from YouTube APP, not website. This is not a wireless HDMI device. This is a proprietary streaming.device that is very, very limited in function. Also, the video quality is unwatchable. Not HD! Does not work with Kindle AT ALL! Avoid. TiVo is much more powerful.with streaming. Had to buy a square Netgear tv dongle. Search Miracast and it will come.up.", "verified": false, "helpfulness": "0/0", "author": "Andrew E."}]