[{"rating": 2.0, "review": "Hardware is great.  They don't show the ugly Power Cable but I guess it can't be powered off the HDMI port.  I get that.  Started out as a great option, used AirCast and was displaying pictures and videos, then they updated and made it essentially a $35 Roku with less features.  Cant show my pictures anymore.  Locked it down to basically YouTube and Chrome.  I already have a Roku, AppleTV and devices with apps built in.  Don't need another.  I just want a device that can display whats on my Android phone or tablet on the TV easily without wiring it up.  Google has gotten so that if they cant show you an ad, they won't play.  Android has gotten that way too.  At least the iPhone apps aren't as \"in your face\" and you know up front the limitations.  Apple never downgraded me.  I will keep this one in hopes but was going to put one on all my TVs'.", "verified": true, "helpfulness": "1/2", "author": "nqy"}, {"rating": 4.0, "review": "it does everything it claims to and with out any difficulty. the uses are limited right now but more apps are becoming available. and with the 3 months free Netflix it paid for itself. well worth the $35", "verified": true, "helpfulness": "0/1", "author": "meridith williams"}, {"rating": 5.0, "review": "Chromecast works exactly as advertised for me, no problems whatsoever!  Setup was SUPER easy too.  I really don't care that I had to plug it into my TV's USB port, its behind my tv, I don't see it....not sure why people are complaining about that.  Who cares?!  I can't wait for more apps to support it, but for me netflix and the casting feature from my chrome browser made this a no-brainer at $35.", "verified": true, "helpfulness": "0/1", "author": "J"}, {"rating": 4.0, "review": "I recently purchased a Google Chromecast fob from Amazon and have been able to configure and use it with the Kindle Fire HD 8.9.  Side loading Chrome and the Chromecast apps was relatively easy to do.  To date I have been able to use netflix and youtube  , but not with the Chrome browser.  The experiment will continue as time allows.  The picture quality and streaming are fine.This is a concept that will drive more innovators to improve access to streaming web content, this and other solutions may be the beginning of the end cable of TV as we know it.  Maybe 2014 will be that year?  That alone deserves a rating of 4 or more stars!I hope that Amazon will allow use of Prime with this device and provide access to needed apps if possible.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 1.0, "review": "The device works fine, only in the 2GHz WiFi band.It just provides a way to stream youtube to your tv, no other free content and no way to see your own movies or pictures.These features existed in the original software release, but were removed later on, so more development goes into taking away features than into adding new ones.Chrome on Android cannot stream on it.In my opinion, its like most of the other botched Google projects, based on a good idea but killed in its infancy by corporate greediness.", "verified": true, "helpfulness": "4/12", "author": "yue"}, {"rating": 5.0, "review": "I have been using this to stream youtube or other videos to my tv while i work on my laptop, its fairly simple to set up, had a minor issue with my wifi but that was quickly resolved and has been rock solid since", "verified": true, "helpfulness": "0/0", "author": "Eyuras"}, {"rating": 2.0, "review": "You can't beat the price if you need this to do something that some other device you have can't, but for most folks this will add nothing to their Home Theater system they don't already have.This device is good for streaming Netflix, YouTube, Google Music, Google Play Movies/TV, and if you use Chrome Browser on your laptop or computer, it attempts to stream any media in a tab, but it doesn't do that too well (in beta, ya know).If you already have a Roku, TiVo, Google TV, PS3, Apple TV, XBox, or even a recent Smart TV then the only thing this device will do that a couple of those won't is stream your Google Play Music/Movies/TV.The interface is unique and simple for Android phone owners.  Install the Chromecast app on your phone and it scans the network for the Chromecast device, then it lets you \"cast\" the YouTube/Netflix/whatever to the television.  The streaming is handled by the Chromecast over its own network connection, but the phone is used as the remote control.  Just control the video stream on the phone the same way you always have, but the video on the TV is controlled.  I actually found this more tedious than just using a remote control for my GoogleTV/TiVo/PanasonicVT50 apps.After the initial, wow, a cool new, very affordable Google product enthusiasm wore off, I found myself not using this anymore and just went back to the GoogleTV for playing YouTube and the host of other useful things like PodCast apps that it offers.  Perhaps when the Chromecast adds some more features it will be useful for those who aren't already connected with some other much more capable device.I did find one small usefulness for one of my three Chromecasts:  I had an HDMI-compatible 1080P 24\" computer monitor I wasn't using.  I plugged the Chromecast into it and now can play some limited videos on it, but with no way to hook up external speakers, it needs to be in a quiet room.", "verified": true, "helpfulness": "2/4", "author": "Distorted Loop"}, {"rating": 2.0, "review": "This device DOES work but there are a few drawbacks. First off, it ONLY works on 2.4Ghz wireless networks which removes a lot of wireless N networks from the picture.  Secondly, Google is actively blocking local content streaming which takes away a lot of it's value.This is nothing more than a roku and not really worth it to be honest.  I personally don't like it because I cannot use it at work which is a wireless N network.", "verified": false, "helpfulness": "3/5", "author": "Pege"}, {"rating": 5.0, "review": "$35 for wireless video streaming and 3 month Netflix subscription. What's not to like? Cheap, simple to set up and should only get better.", "verified": true, "helpfulness": "0/0", "author": "j d goodall"}, {"rating": 5.0, "review": "While somewhat minimal, it does exactly what it promises and excels at it. I've switched almost entirely from an amalgam of Apple TV + Xbox to just the Chromecast. As a heavy Android user, it was a relief to finally have some sort of unified experience. The fractured media management landscape was a thorn in my side which I'm happy to be rid of, even if it does not alter my life radically for the better.One unexpected perk is that the Chromecast can switch on your TV and switch over to its port whenever you activate it on your phone or computer. I'm told any HDMI above a certain spec can do this, but none of my other electronics have taken advantage of this feature.Chromecast is a platform, so it's not limited to the initial offering though, as of this review, no more big names have officially come out and said they are developing for the Chromecast SDK. In all fairness, I'm not sure that it's finalized. Hopefully the large number of sales are tantalizing enough to gain widespread support for the device.If you've been reading review around the internet, much has been made about the fact that, in practice, the dongle has a couple attachments you'll probably need for the device to work (such as USB power), but if you have anything more than a very small HDMI television, you probably won't have much issue with aesthetics. If you have a television with the very latest HDMI spec, the dongle will work in the way it looks in advertisements.My main complaint is that it has no Hulu support yet, but I'm not docking stars since that wasn't promised. I'd also like to display my own pictures and local video, though it seems an official solution to the latter is in the works. Hopefully content providers will recognize the Android market is pretty big now, and that they could make a fair bit of money by supporting the device.", "verified": true, "helpfulness": "0/0", "author": "E. White \"SpyHI\""}]