[{"rating": 4.0, "review": "Very easy to use my only complaint is somehow the color doesn't seem to be perfect and is a little off", "verified": true, "helpfulness": "0/0", "author": "Rebecca C Boswell"}, {"rating": 3.0, "review": "I guess I should have done a little more research on this product.  I thought it was wireless and only had to be plugged in to the HDMI port.  It needs power so it either has to be plugged in to the USB port on your TV or to an electrical outlet.  Also, there are a limited number of applications on the chromecast.  For instance, I am an amazon prime member but can not access amazon movies with this device.  Again, I should have researched more because I was under the impression it made your TV wifi and not that there were limited applications.  Other than my lack of research, the product is great if you only wish to watch Netflix, hulu or youtube.", "verified": true, "helpfulness": "0/0", "author": "Tudy"}, {"rating": 5.0, "review": "Great for people that travel a lot. It's alittle annoying having to set it up each time you change wifi networks, but it beats the hell out of watching netflix on your phone or tablet.", "verified": true, "helpfulness": "1/1", "author": "Zedsdeadbaby"}, {"rating": 5.0, "review": "Family has Netflix and Amazon Prime in family room, wanted to be able to watch movies on the living room TV . Works great!", "verified": true, "helpfulness": "0/0", "author": "Linda Freimanis"}, {"rating": 4.0, "review": "This is a great little device. Works well but needs to have more apps that will stream through it. Awesome price for all it does.", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 5.0, "review": "Really easy to set up. Works great for watching streaming video via Netflix and Hulu. Great for getting a browser tab on the big screen. Full screen casting is OK.", "verified": true, "helpfulness": "0/0", "author": "Nicholas A Stetich"}, {"rating": 1.0, "review": "I tried to install it at home and it didn't work. brother-in-law's house, didn't work either.very frustrating. worst thing is that I assumed it would work right out of the box, so I had it sitting for a couple of months until I had time for it.very disappointing. additionally the support isn't any good either. for my personal experience, NOT very google-ish .money and time lost.", "verified": true, "helpfulness": "0/0", "author": "Diego cordoba"}, {"rating": 3.0, "review": "You have to pay for all channels seprate. If you have a gaming system, this is no use to you", "verified": true, "helpfulness": "0/0", "author": "Douglass Parham"}, {"rating": 4.0, "review": "Chromecast is a super convenient way to watch Netflix, youtube and others at home and while traveling.  Very easy to set-up and works great with my iPad and iPhone.", "verified": true, "helpfulness": "0/0", "author": "Dustin R McFall"}, {"rating": 3.0, "review": "Bought this device at the reccomendation of a friend. Works well, but seems to have issues on my network. This is most likely due to the slower speed of my internet.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Fechter"}]