[{"rating": 5.0, "review": "it does what its supposed to do and it does it good, installation was a breeze, the only downside is that if you are using Chrome to cast it has to stay in full screen mode to be full screen on the TV, other apps like or websites like youtube don have that problem, overall Im very happy with it.", "verified": true, "helpfulness": "2/3", "author": "Var"}, {"rating": 5.0, "review": "Love this little device.  It was easy to set up on my wifi network, and it works well with my iPhone, my Macbook, and my iPad.  The number of things you can stream is limited, but the video quality was pretty good, and the integration was a cinch to set up.  At $35 this is a terrific little gadget to have if you like to watch Netflix or YouTube.", "verified": true, "helpfulness": "2/3", "author": "Jody"}, {"rating": 5.0, "review": "I got the Chromecast to watch Netflix on a larger screen than an iPad or computer and hopefully reduce the Comcast charges for OnDemand movies the kids rack up. It took me less than 5 minutes to set up with my home WIFI and is working perfectly. I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Julie Trulson"}, {"rating": 1.0, "review": "Very disappointed of this product. I was trying to watch a movie on megashare website and is not working at all. I do not recommend this product to my enemies.", "verified": true, "helpfulness": "2/14", "author": "Julian1000"}, {"rating": 5.0, "review": "Usually with these things something always goes wrong with compatibility but this was truly plug in and play, definitely worth the money, well done Google", "verified": true, "helpfulness": "1/2", "author": "Stephen Carmody"}, {"rating": 3.0, "review": "Good little gadget for the price. Easy to use and the apps load up quick. Hopefully soon they will add more apps like hulu and other major ones.", "verified": false, "helpfulness": "1/1", "author": "william j oconnor jr"}, {"rating": 5.0, "review": "For only 35 dollars, this was an truly awesome product.  It work as well as products costing 4 times.  It works very similar to Airplay.", "verified": true, "helpfulness": "0/0", "author": "Chad Pangborn"}, {"rating": 5.0, "review": "This product is worth every penny, especially since it is only $35.  Easy to set up and using Google Chrome you can cast anything you are viewing to your television.  Simple and effective.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "the first thing that you need to know is that you don't need help support for whom any other streaming service as long as you can stream from their website you can use this product To stream through Google Chrome browser if you want HBO Go then go to this site if you want ABC streaming in go to the website. I had three of them right off the bat in one of them I could not get to work the other two would work so I finally figured out that the thing was defective so I returned it And got another 1 and it work flawlessly. trust me for people who know what this thing is and how it works you will love it", "verified": false, "helpfulness": "1/2", "author": "Derrick hampton"}, {"rating": 5.0, "review": "I finally received the package yesterday and was up and running in ten minutes.  So far, it is performing as expected already integrated into my viewing habits.  I too, expected to use my Amazon Prime account and was temporarily disappointed due to MS Silverlight issues.  I uninstalled Silverlight and was able to stream Amazon using Flash instead.  I video stream on another tv using my PS3 and Chromecast is much easier to set up and use.  A few more video choices would go a long way.", "verified": true, "helpfulness": "1/2", "author": "Bosox"}]