[{"rating": 4.0, "review": "I got it because a friend was raving about itI had no issues installing it. So simpleI have watched many hrs of Netflix and youtube with out issuesI just wish I could watch movies that I have made.", "verified": true, "helpfulness": "0/0", "author": "Brennan Gilroy"}, {"rating": 5.0, "review": "I had no problem connecting my Chromecast on the first try. Watched my first movie, with no issues. Bought one for each of my grown kids for Christmas. Couldn't beat the price,either. Bonus: ordered from Amazon on Black Friday, and had it by Monday!", "verified": true, "helpfulness": "0/0", "author": "CmentMxr"}, {"rating": 1.0, "review": "I bought this device based on advertisements that gave me certain expectations:1. I thought I would be able to stream my own content, not just Youtube or Netflix.And 2. I thought that I'd be able to charge the chromecast with the USP wire and then use it without it being plugged in--I was wrong. This device has to be plugged in THE WHOLE TIME, otherwise, it does not work. The problem I have with this is that my TV's HDMI ports are placed in such a way that the chromecast by itself would fit, but with the extra USP wire sticking out the round, opposite end (where the little white line is), my chromecast doesn't fit and thus, I can't use my chromecast AT ALL. This wired set-up, I believe, should have been advertised with the product--customers should be made aware of the limitations of the product. For example, the chromecast pictured here does not show the wire plugged into the opposite end which would be necessary for the chromecast to be turned on.This purchase was a waste of money. I expect more from Google.", "verified": true, "helpfulness": "1/4", "author": "Freshte Kashani"}, {"rating": 1.0, "review": "I can only get about 3 Netflix movies to screen to my TV with this useless piece of junk crap.", "verified": true, "helpfulness": "0/4", "author": "Lorcan Keating"}, {"rating": 5.0, "review": "Cost effective,  easy use of utilizing Netflix, Hulu, YouTube with all the wires or fuss.I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My whole family uses this little dongle!  No more standing around the laptop or tablet screen.  On our Samsung TV, the input switches automatically when the cast is connected from a device.  Super simple to use and app support is growing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I installed this yesterday and the setup was fairly easy.  However, I was dismayed to discover that the chromecast app is only available on iOS 6, which means my 1st generation iPad can't be used to stream to it.  Also, no chromecast app exists for the Kindle or for my Windows/Nokia phone.  So basically I can only stream from my iphone 5.Other than the major beef above, the Netflix streamed well.  I have yet to try it from my Windows PC.  I have tried streaming via Google Chrome on a Macbook and it also works really well for that.If it had apps for Kindle and Windows, I would give it 5 stars.", "verified": false, "helpfulness": "0/1", "author": "Barry Richard \"Rico\""}, {"rating": 4.0, "review": "Setup was super easy.  Streaming HBO GO/Netflix has been crystal clear with no playback issues.  Google has made a nice product for only $35.  Plus it works with Comcast who have blocked HBO GO on Roku boxes for some stupid reason.While casting video with my iPhone/iPad has its perks, I've had multiple times where I really miss having a remote.  To pause I have to turn on my phone/tablet, punch in my passcode, relaunch the video app I'm using, then press pause.  I know, I know.... it sounds small and silly, but it's a 10-15 second process that gets kind of old after a few times.  Then to fast-forward/rewind, you basically have to drag the progress bar on your phone/tablet's screen - which is like threading a needle with winter gloves on.  Disaster.  I never realized how much I'd miss having dedicated remote buttons for all of these functions.If this is for a second room or you barely ever pause/Rewind/FF your videos... you can't beat it though.  Just keep this in mind if you're a real heavy user.**Update** After using my Chromecast for over 4 months now, it continues to work very well.  Unfortunately I still have one other small gripe.  The Chromecast will try to always stream the highest resolution possible (always targeting 1080p).  There's no option to set the output to 720p.  My older Panasonic 720p plasma will accept a 1080p signal, but down-converts it to 720p.  Therefore every time I stream I'm basically wasting the extra bandwith for a 1080p stream I don't need.  Super picky obviously, but it would be nice to be able to set your preferred resolution.", "verified": true, "helpfulness": "0/0", "author": "Timezones"}, {"rating": 5.0, "review": "chrome cast works great, everything that I expected it to be. we probably be ordering another one for my other tv", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Everything is great about this device and google. I hope they come out of the beta phase for the chrome extension and stabilize it soon.", "verified": true, "helpfulness": "0/0", "author": "Arun K."}]