[{"rating": 4.0, "review": "I have read so many mixed reviews and thought for something that costs less than lunch, I would put it on my Christmas list.It's worth 4 stars simply because it works with Plex, no issues whatsoever. Plus Netflix looked great and both streamed in HD with no issues whatsoever.Judging this on it's Chrome browser function is not really fair as the developers fully admit that it's still in Beta. I was able to stream Chrome from my computer, with video and sound, but it was choppy and the audio was slightly out of sync.I own Roku, Boxee and Google TV,  compared to these Chromecast cannot be beat price wise , if you want a simple Plex, You Tube and. Netflix streamer this is for you....if you want more bells and whistles, go with the Roku 3, but be prepared to fork out more than twice the price of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Andrew I. Munro Sr."}, {"rating": 5.0, "review": "Got this for my husband and well us really.  LOVE IT.  Wished I would have known first it is not compatible with Apple products.  It is also not compatible with Amazon videos.  Works great with netflix though.....", "verified": true, "helpfulness": "0/0", "author": "Amber Klein"}, {"rating": 1.0, "review": "I connected the device to a 5 year old Sony 47\" TV that is connected to a TV  Antenna.The Chromecast caused the TV display to distort immediately in TV mode meaning thatthere is a lot of RFI coming out of the Chromecast.Next, I tried to set the HDMI channel the Chromecast was plugged into.  It would notshow up as an HDMI device.  Even though my cell phone and router could talk to it,there was no picture when trying to watch Netflix.  I tried it on another Sony TV with the same results.It's time to return it.", "verified": true, "helpfulness": "0/0", "author": "Harry E. Bunting \"embedded linux\""}, {"rating": 5.0, "review": "It's my alternative to expensive cable bills. The versatility, in regards to its capacity to support multiple devices, makes choosing content no different than changing channels. Get it.", "verified": true, "helpfulness": "0/1", "author": "Jose"}, {"rating": 5.0, "review": "A great buy for the money.  but if it was any more expensive than $35, i would have given it only 4 stars.  For the price, the utility is provides is great.  Stream anything you want from your laptop from your chrome browser.  Depending on my internet speed, it can lag a few seconds sometimes and sometimes starts getting jerky.  What many people do not know is that you can actually transmit your desktop as well after you connect your laptop through your chrome browser and beam office documents and anything else open on your desktop as well.  BUT IT DOES NOT transmit sound from any application unless it is from Google Chrome.  I am hoping google would come out with a solution for this.  But alternatively you can use a bluetooth speaker and stream it out of that (if your laptop has bluetooth enabled).  But otherwise it works as they claim. I love it.", "verified": true, "helpfulness": "0/0", "author": "Jayakumar R. Nair"}, {"rating": 3.0, "review": "It took a while to get use to.The heasatation from compute to chrome cast is very noticable on some things.I have even brought one for a friend and together we are getting to know  what to do", "verified": true, "helpfulness": "0/0", "author": "Brenda Trenholm"}, {"rating": 4.0, "review": "Purchased this for $35.  it works for a few apps and google chrome browser.  could stand to be added to other applications or even whatever opens on the desktop, but it is a good start.", "verified": true, "helpfulness": "0/0", "author": "Dsgnce \"dsgnce\""}, {"rating": 5.0, "review": "This is nice for travelling. I can plug into a TV and stream from my laptop, tablet, or phone. Can't wait for more apps to become available. Netflix and YouTube work great, Hulu hasn't worked as well. I can display anything from my laptop using Chrome, my phone is more limited.", "verified": true, "helpfulness": "0/0", "author": "jvd"}, {"rating": 5.0, "review": "One of the best purchases that I have made this year! Easy set up and it works with my cell phone, tablet and laptop! A must have if you have a HDMI TV!", "verified": true, "helpfulness": "0/0", "author": "Lyent"}, {"rating": 3.0, "review": "Another good product.  However wish there was a way to convert composite to HDMI....  I have an old 2004 TV set.", "verified": true, "helpfulness": "0/0", "author": "Joe"}]