[{"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Johnny Azofeifa Torres"}, {"rating": 5.0, "review": "This is such a great product.  And with this price, it is absolutely a winner.", "verified": true, "helpfulness": "0/0", "author": "Wan \"derek_poh\""}, {"rating": 5.0, "review": "The device is used mostly to watch Netflix and Youtube (even karaoking with Youtube). It is easy to configure, easy to install, I have no complaints. In time, more and more apps are launching Chromecast functionality, so I can share on the screen all the pictures taken with my phone.I can use the phone and the tablet interchangeably to control the device.It's the best purchase ever!", "verified": true, "helpfulness": "1/1", "author": "Max"}, {"rating": 5.0, "review": "The same benefits of having a smart tv, apple tv, or roku box, but cheaper.", "verified": true, "helpfulness": "0/0", "author": "BEG"}, {"rating": 3.0, "review": "Metal unput boke after one week of use so my husband took it apart. Cheap materials all around.", "verified": true, "helpfulness": "0/0", "author": "meejay"}, {"rating": 4.0, "review": "There’s no doubt in anyone’s mind that there is a booming market for media streaming and sync devices and services. With Apple TV, Roku, Amazon Fire grabbing up the lucrative market, Chromecast by Google is making waves in small steps. And here’s what we know so far:Chromecast Specs:Output: HDMI, CEC (Consumer Electronics Control) compatibleMax. Output Video Resolution: 1080pDimensions: 72(L) x 35(W) x 12(H) mmWeight: 34gWireless Standards: 802.11b/g/n Wi-Fi (802.11n 2.4GHz only)Wireless Security: WEP, WPA/WPA2Power: USB (USB cable and power adapter included)Plugs into TV directly and powered from TVs USB port or wall outletSupported Operating Systems:Android 2.3 and higheriOS 6.0 and higherWindows 7 and higherMac OS 10.7 and higherChrome OS (on a Chromebook running Chrome 28 & higher)Over the Air Updates: When available, Chromecast will automatically update to the latest and greatest Chromecast software version.Seems pretty neat right? I couldn’t agree more. I’ve owned this little nifty device for a little over a month. For it from Amazon with two-day free shipping. Pros: It works smoothly, supports Android and Apple mobile platforms, quick start up, lots of potential and development from third party devs, sleek design. Cons: Not enough apps (yet), Screencast needs a stable release, no google now app support for Chromecast.I am in love with this device and it has lots of potential. I downloaded Just Dance Now app on my Samsung Galaxy S5 and I can use it as a motion sensor to play it on Chromecast and it looks beautiful. The Chromecast has it’s rough edges on app development but for the price and value, it’s definitely worth getting!", "verified": true, "helpfulness": "1/1", "author": "insert_name_jokes"}, {"rating": 5.0, "review": "The greatest invention of the last 10 years.", "verified": true, "helpfulness": "0/0", "author": "RickySteve"}, {"rating": 4.0, "review": "One of the cheaper and nicer forms of Streaming Devices. You can almost never go wrong with anything Google gets into! Plenty of reviews have gone into the specifics of this device so I'm going to focus on my personal experience with it.This device works just fine 95% of the time. It often will disconnect from my Moto X and other phones at random seemingly while watching Netflix or Hulu causing me to have to re-sync (not too big of a deal as it takes a second to re-sync). I think the more annoying problem is when switching streaming services on the 'Cast. A lot of times when I say want to switch it from casting Hulu to Netflix, it will refuse to sync and timeout. I'll have Hulu playing, then on my phone I will open up the Netflix app and attempt to sync it on the app to have it kick over on the T.V. However most of the time it won't kick over unless I stop Hulu completely and return the Chromecast to the home screen. This will do the same thing sometimes if I try to switch from Netflix to YouTube, YouTube to Hulu, etc. I'm sure more time will allow the developers to fix such glitches, but that's the one thing that bothers me about it right now. I just want it more seamless.Also when casting certain websites or videos from Google Chrome to the 'Cast it causes a slight video lag which can be a little irking. It's not quite as smooth as AirPlay or some of the other mirroring software.Other than those problems, I like this Streamer a lot better than Roku and the like. I got mine for free when I bought my Moto X, but 30$ is a very fair price considering older versions of Roku still run you up to 70$, the new Roku Stick is 50$, Amazon Fire TV is 80$, and Apple TV is 100$+.", "verified": false, "helpfulness": "0/0", "author": "KempShire"}, {"rating": 5.0, "review": "Why anyone would get a streaming player other than a Chromecast is beyond me.", "verified": true, "helpfulness": "0/0", "author": "Ryan V."}, {"rating": 3.0, "review": "I'm sure it works just fine but after playing with it for a little while we never use it.", "verified": true, "helpfulness": "0/1", "author": "K. McCoy \"BluesGirl\""}]