[{"rating": 4.0, "review": "Had some trouble getting to work. Was in my Wifi.  Support for this product was quick and helpful but i found the trouble on my own.", "verified": true, "helpfulness": "0/0", "author": "D. Brink"}, {"rating": 3.0, "review": "Works fine for anything in chrome. Needs more apps for the iPhone & ipad.  It's nice that you can close the laptop once it starts casting", "verified": true, "helpfulness": "0/0", "author": "J. Traynor"}, {"rating": 4.0, "review": "this has worked well so far. however, i don't keep it plugged in since i am not always around to use it daily.", "verified": true, "helpfulness": "0/0", "author": "Saph"}, {"rating": 5.0, "review": "Shortly after purchasing the Google Chromecast 10 new apps were added to the catalog increasing its value exponentially. I hope to have an app that can share virtually everything from my PC/Mac, but apps like Plex and Avia do a decent job streaming protected media through my network. For the price of this little device it's unbeatable, turning any TV or monitor with an HDMI port into a smart TV it sorts. I adore this little technological marvel.", "verified": true, "helpfulness": "0/0", "author": "S. Graham"}, {"rating": 4.0, "review": "Great idea but still limited functionality.  I anticipate more programs and options will be added.  That is all that is needed to make it a great product instead of the promising product it now is.", "verified": true, "helpfulness": "0/0", "author": "Montague Dixon"}, {"rating": 2.0, "review": "I love Google products/services and was excited to try this out.  Unfortunately, my router is about 50ft from the TV where I tried this and Chromecast could not connect to the router.  This same TV has a Wii connected wirelessly to internet and works fine so I think the issue is more with Chromecast.  I read online that Chromecast needs to be within 20ft of router which I think is too short a distance for most homes.", "verified": true, "helpfulness": "0/0", "author": "David I"}, {"rating": 5.0, "review": "Do not waste your money on other devices that cost many more fold that perform similar functions. The Chromecast is a device with expanding ability, and you will love using your existing products are remotes for your HD television. Easy to set up, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "007007"}, {"rating": 5.0, "review": "My son talked me into buying this, as I had no idea what it could do. But, I am very happy to have it. Very handy little gadget!", "verified": true, "helpfulness": "0/0", "author": "Sandra Strain"}, {"rating": 1.0, "review": "I bought tow and one turned out to be factory defective.No means to reinstall  firmware and clean reset. Limited to streaming few apps.", "verified": true, "helpfulness": "1/2", "author": "Zafer Rasim"}, {"rating": 5.0, "review": "Product arrived on time as promised. Well packaged. Bought 2. One was for my son . Have now ordered a 3rd one for another large TV in the house. Excellent product with a great price for what it does. We have 1 of the major dish networks and they will not allow us to stream Netflix as it is in direct competition to what they offer at a much higher price. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]