[{"rating": 2.0, "review": "The Chromecast worked great for a day or two but then I started to have troubles with it. The Chromecast would always say, \"Chromecast is connected but can't access the internet.\" I have wasted about two hours trying to fix it and nothing. Furthermore, a return is not possible after 1 month. I. Didn't. like. It.", "verified": true, "helpfulness": "0/0", "author": "ray"}, {"rating": 3.0, "review": "Easy setup, awesome that I do not need to deal with cables but it is not a flawless experience yet for me", "verified": true, "helpfulness": "0/0", "author": "Peter Kelemen"}, {"rating": 5.0, "review": "Love it!  I can finally watch my favortie Bollywood Netflix movies on the big screen now!  Easy to use! Awesome!", "verified": true, "helpfulness": "0/0", "author": "Dalani Tanahy"}, {"rating": 5.0, "review": "One of the best purchases I've made in my life! I highly recommend this device to anyone and everyone. Cheers!", "verified": true, "helpfulness": "0/0", "author": "rivzy"}, {"rating": 5.0, "review": "I use this all the time. It's really convenient to be able to throw Netflix or YouTube videos from my phone to my tv instantly without having to load up either the Xbox or the Wii.My only caveat with it is that you are very limited as to what you can cast to the tv. As of this writing, you can only do Netflix, YouTube, and Google Play. I've heard they will be expanding the roster of potential casting locations, but until then, I'll have to settle with those three.", "verified": true, "helpfulness": "0/0", "author": "Z"}, {"rating": 5.0, "review": "Wow this makes my TV so much better and simpler and only costs 35 bucksDefinately recommend to anyone who wana see whats on laptop / ipad onto tv", "verified": true, "helpfulness": "0/0", "author": "pa_rkm"}, {"rating": 2.0, "review": "Unbelievably poor product for a major company like Google. The inability to redirect audio to \"airplay devices\" is a major flaw in this product.", "verified": true, "helpfulness": "0/0", "author": "Martin Rosenblum"}, {"rating": 1.0, "review": "We bought the Chromecast specifically to stream from Chrome onto our smart TV. Setup was pretty easy... until we realized that you cannot stream from Chrome on an iOS device (iPad, iPhone). You can only use the existing apps -- Netflix and Youtube. That is NOT well described anywhere on the Google Chromecast site. They just say that it's \"compatible\" with iOS devices. So, we tried streaming from our laptop using Chrome. It \"worked\" but just barely, if you could even say that. The lag was so terrible that the audio/video never matched up and the video essentially froze. This device sounded too good to be true... and it was. I am returning this right away.", "verified": true, "helpfulness": "21/27", "author": "Awesometown"}, {"rating": 4.0, "review": "It's a nice device but you can't do much with it. It has around five apps but it's new so that's what I expected. My only complaint for now is it can't play my music that I purchased on iTunes or any of the videos on my if they are not purchased from the Google Play Store. So all they need to do is fix that and add a few more apps. Then I will give it five stars.", "verified": true, "helpfulness": "0/0", "author": "L.Villalona"}, {"rating": 3.0, "review": "Poor App support, no option to use Cast Chrome browser from tablets, trying to go full screen will casting from Laptop Chrome browser doesn't work.", "verified": true, "helpfulness": "0/0", "author": "Neil Menzies"}]