[{"rating": 3.0, "review": "in this tv everything is good but the main problem is that i cant play my own personal videos and plus amazon hasnt done anything about the usb port till now!so for anyone who watches any video from his computer on his tv.then this is not the device.apple tv is better", "verified": true, "helpfulness": "1/1", "author": "Sidhanth K."}, {"rating": 5.0, "review": "A new experience for me. I am watching television more than ever. My new Amazon Fire is a good thing to have if you like movies. I would recommend this.", "verified": true, "helpfulness": "0/0", "author": "Deidre Humphrey"}, {"rating": 5.0, "review": "Dumped my cable TV and will NOT look back! This unit works great and is fun to use. What more could you ask?", "verified": true, "helpfulness": "0/0", "author": "Frank E. Hartman \"contractor\""}, {"rating": 5.0, "review": "I love the Amazon Fire TV.  It replaced my ROKU.  It is so easy to do a search using the voice command.  It has a beautiful screen saver.  There are so many more choices and you can watcgh Netflix movies through this device.  I am sure that I have not discovered all of the convenience of this wonderful device.  It was extremely easy to set up.  I had a very hard time setting up my Roku\"s.  It would not accept any password.  I have two Roku's and it took hours to set each one up.  I am not very technically savy so it was a dream to set up the Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "sleeksenior \"Dorothy Miover\""}, {"rating": 5.0, "review": "Seriously would recommend this product to everyone!  I have had Apple TV and no comparison.  Amazon Fire TV is the best!  And it has everything you would want and more!  Movies, TV, music, photos and even better if you are an Amazon Prime member (which I am)!  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Body By Bill"}, {"rating": 3.0, "review": "I'm usually a big proponent of what Amazon does. We do not have cable, so I use Amazon to augment our antenna with shows I can't get. For that it works really well. Amazon offered a free 30 day trial of the Fire TV, so I ordered one. I have a PS3 with the Amazon app connected to our main TV, so this box would pull double duty for the bedroom and patio. My current set up for that area of the house is an HDMI cable that I hook into my laptop to run on either TV as a second monitor.The box was considerably smaller than I thought it would be, maybe the size of a double CD case. It was fairly easy to set up, though the video was annoying. Maybe helpful for your parents or someone with no technological ability. Connecting to the wireless network was easy enough, staying connected is another matter. I have a wireless repeater in the bedroom to cover the back of the house and the yard. All my other devices have no problem staying on this signal, and the repeater is 4 feet away from the Fire TV, producint a \"very good\" signal rating. But every time it \"sleeps\" (there is no off button btw) and wakes up, it says it's \"connected with problems\". Whatever that means. I have to tell it to forget the network, rejoin it, and reenter the password. That buys me 10 minutes maybe before it's \"connected with problems\" again. The Amazon solution is to unplug your router or the Fire TV (again, there is no power button), and I'm not doing that every single time I use this device. I have connected the Fire TV to the repeater via ethernet cable, but this doesn't provide any better results. I guess I could unplug the repeater or run a 50ft ethernet cable under the house to the Fire TV, but to me this is too much of a hassle to deal with when I can just plug in my laptop to the TV and get better results. YMMV, but this is what I encountered.I was also under the impression that MLB TV would be available for use. Well, not exactly. It's supposed to be available \"later this year\" (I asked for a more specific time frame but they wouldn't give me one). We are less than a month from the All Star break, so there's not a lot of \"later this year\" left.I would like this device to be useful, but with these constant connection problems, limited apps, and no power button, it's not worth it to me right now. I'm going to return it and wait for football season to see if things have improved.", "verified": true, "helpfulness": "0/1", "author": "Sid Bream"}, {"rating": 5.0, "review": "I'll admit that I bought Fire TV on an impulse and wasn't quite sure what to expect. I had used Apple TV, Roku, Chromecast etc. in the past and while they all worked great for the most part, I just couldn't sell myself on having enough of a need for one. I plugged in my Fire TV with the same expectation, and was pleasantly surprised right off the bat. Installation & setup couldn't be easier. Processor speed, which had always bugged me with other set-top boxes and smart TVs, was comparable with performing tasks on a computer. All of the standard apps are there including games, radios, and of course video services.Warning: Review gets a little techy from here on.The biggest surprise for me though was how easy it was to add unofficial Android apps onto the device WITHOUT HAVING TO WIPE THE ORIGINAL FIRMWARE OR JAILBREAK THE DEVICE! The entire process was extremely simple to side-load apps onto Fire TV and there are numerous guides online with step-by-step instructions. Now I have both the standard Fire apps that are amazing, and also the optional Android apps that give you endless possibilities.If you're one of those people who stays away from new devices until the kinks are worked out, no need to delay. This device meets & exceeds all expectations.", "verified": true, "helpfulness": "3/3", "author": "Kourosh Arianejad"}, {"rating": 5.0, "review": "This is the box Apple should have designed. The voice commands are excellent and work fairly well. The product quality is great, and set up was easy and straight forward. In fact, if you are an Amazon registered customer, it comes already set up with your account right out of the box.An excellent product", "verified": true, "helpfulness": "0/0", "author": "Owen Rubin \"orubin\""}, {"rating": 5.0, "review": "This is very easy to set up and use.  I go to the website to add to my videos and just go from there.", "verified": true, "helpfulness": "0/0", "author": "R A Childers"}, {"rating": 4.0, "review": "very useful but would like other streaming services for all 5 stars. Easy to look up most old movies and current tv", "verified": true, "helpfulness": "0/0", "author": "Jon Jensen"}]