[{"rating": 3.0, "review": "Compared to our WiiU streaming device, this unit buffers A LOT.  If I had to do it over again, I would have found another alternative.  The buffering can be reduced by unplugging the device regularly, but that is a bit of maintenance that I don't have to do on the Wii and shouldn't have to do here either.", "verified": true, "helpfulness": "0/0", "author": "S. Blanchard"}, {"rating": 5.0, "review": "Very happy works great should of gotten it sooner", "verified": true, "helpfulness": "0/0", "author": "anne wilken"}, {"rating": 4.0, "review": "Very good.  Would like to see more live TV.", "verified": true, "helpfulness": "0/0", "author": "Robert S Trickovic"}, {"rating": 5.0, "review": "So easy to use with so many programs, that my wife and daughter made me buy one for each TV in the house.", "verified": true, "helpfulness": "0/0", "author": "MikeR2 \"MM_irv\""}, {"rating": 5.0, "review": "Love love love this!!", "verified": true, "helpfulness": "0/0", "author": "Marsha Thibodeaux"}, {"rating": 5.0, "review": "works great and practicaly sets itself up no need for a guide to purchase ,seperately!", "verified": true, "helpfulness": "0/0", "author": "Christopher whitten"}, {"rating": 1.0, "review": "I bought it but it does not work and hours with the technical could not get it working. Going to buy a ROKU", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the most easiest plug and play device I ever had.  We are enjoying every minute of Fire TV.  GOOD BY SATTELITE TV  Saving us the cost of Satellite.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Grack"}, {"rating": 4.0, "review": "Pro's - faster than my smart TV or smart Blu Ray player.  Included games.  Works well with Prime membership. voice search worksCon's - prime membership has more paid movies and shows, but when I do voice search there's not a way to filter out the shows that cost money.", "verified": true, "helpfulness": "0/0", "author": "Mike N."}, {"rating": 5.0, "review": "I am really happy with my purchase of the Amazon Fire.TV, it has exceeded my expectations and I have been recommendedrecommending it to all my friends. It was simple to set up, and easy to use. I'm not sure why I waited so long to try it!", "verified": true, "helpfulness": "0/0", "author": "Frank Waters"}]