[{"rating": 5.0, "review": "Love my fire tv I have been able to get caught up on all my shows that I missed!", "verified": true, "helpfulness": "0/0", "author": "Joy Nunnery"}, {"rating": 5.0, "review": "Great box", "verified": true, "helpfulness": "0/0", "author": "Darrin Palin"}, {"rating": 4.0, "review": "I wanted a better way to watch Prime on my TV. It works great. Easy to set up and the shows play without delay. It signs on to the internet very fast and without delay. If I had one complaint is would be that I don't like how the prime is set up. It is so much easier to use the button that is on my TV for Netflix. It is easier to look for shows and see how many seasons there are etc. That is why I don't use Netflix on the Amazon Fire and still go though my TV for that.", "verified": true, "helpfulness": "0/0", "author": "C. Ragels"}, {"rating": 5.0, "review": "Beyond expectation..Amazon comes through once again.I only have the fire box about four days, and I would normally wait to write a review, but I already know that I love it.It was easy to set up. The quality of the streaming and the hd resolution is at least as good as the cable, maybe better.I know that I have a high speed internet connection, so I don't know how the streaming would be if I didn't, but members of my family with a slower internet connection seem to also be very happy with theirs.I did a little research before I bought this and am very glad that I chose the fire box rather than the fire stick.I had intended to use this for Netflix, which I am doing, but I am so impressed with Amazon Prime package, that I intend to keep that as well.I don't think that Amazon has ever disappointed me.", "verified": true, "helpfulness": "0/0", "author": "tlynne"}, {"rating": 4.0, "review": "Sure beats regular broadcast tv", "verified": true, "helpfulness": "1/1", "author": "skz"}, {"rating": 4.0, "review": "I love everything except that I cannot get any Google apps and Amazon apps or Prime don't have two of my favorite programs.  Also, the font size is so small I cannot see what many of the things say on the TV.", "verified": true, "helpfulness": "1/1", "author": "Judith Gregory"}, {"rating": 5.0, "review": "Very fast, easy to use and intuitive!", "verified": true, "helpfulness": "0/0", "author": "Jeff Miller"}, {"rating": 4.0, "review": "Works fast response an load times are snappy. Only thing I wish is that amazon would offer package deals to get the controller and a fire stick with it. For say 160 that would be an awesome deal.", "verified": true, "helpfulness": "0/0", "author": "john curtis laswell"}, {"rating": 5.0, "review": "Everything I expected", "verified": true, "helpfulness": "1/1", "author": "terry essig"}, {"rating": 4.0, "review": "Very good device, only problem is no shut off for the unit", "verified": true, "helpfulness": "0/0", "author": "Richard G. Visovsky"}]