[{"rating": 5.0, "review": "I was skeptical when I ordered it but it was extremely easy to set up and use.  The voice command really works too!  I was also glad to see the ability to use Netflix too and not be stuck with only one service.  I use both, so that is huge. Good job Amazon, you got it right! Very pleased with purchase!", "verified": true, "helpfulness": "0/0", "author": "Colin Bonner"}, {"rating": 5.0, "review": "So it turns out that it wasn't compatible with my TV which was a 6 year old Sansui TV/DVD combo. Just when I thought all was lost, my son decided to give me his TV and it works now! I still haven't had time to really watch anything yet but just getting it going and downloading apps it appears to be awesomeness!! I wanted to hurry and change my review and I will add more later!I read some reviews. My issue is when I plugged it in I had a flashing white and amber light. I plugged in the Ethernet cord which stopped the flashing amber, but my TV still is not recognizing the device at all. I'm not getting the Amazon screen. I am on my second box. This one is recognized by the smart TV but not the TV I desire the service on. I am now waiting to find out whether or not the TV is compatible with the service, and if not see if there is a work around. I really want this to work. I don't need the service on a smart TV.", "verified": true, "helpfulness": "2/3", "author": "Miss Charly"}, {"rating": 3.0, "review": "This thing is amazing. its like a collectors edition cd case. its silent and hardly noticeable. voice search even works with my accent.The menu is slicker than a greasy snake on speed in a chicken house. I mean its almost comical how nicely the menu, a cornucopia of images and section tiles, runs.The issue is thus : Netflix and hulu and essentially every other service built into it wont work here. netflix will let me watch any trailer, flawlessly, quickly and in hd. it will also let me play any movie for 3 seconds. Apparently i can bypass this with a vpn, but i have a fritzbox so am stuck.It would be nice if it had the ability to pair with any old 360/ps3 controllers. Apparently you can with the windows version that has the usb dongle.", "verified": true, "helpfulness": "0/0", "author": "Dave Vaughan"}, {"rating": 5.0, "review": "This is my first streaming box.  Prior to this, I was using my desktop PC, with my TV as a monitor.  I now have the Fire TV on a wired connection to a 20+ Mbps cable internet service.-- Pros --The streaming performance is at least as good as I was getting through my computer/internet browser, and now I don't have to get up every time I want to pause, go to the next episode, etc.  I have not had a single hiccup in playback.The Fire TV UI is extremely smooth.The voice search does work, and well at that.  I use that as my primary means of navigation.  Very efficient.-- Cons/areas for improvement --Voice search does not yet work with Netflix, among other things.  I have read that amazon has made this available to them as app developers, so I am hopeful that this will come soon.  I also really hope that they will upgrade to a truly unified search so that I don't have to look through each media ecosystem individually for content.The app selection needs some key additions for me, namely, news shows.  I want apps for CNN, Fox, CBS, NBC, etc.  They will come, I'm sure.The controller needs TV power and volume controls.  Give me those and I can ditch my TV controller 99% of the time.  Maybe there will be a third party solution for this?-- Conclusion --This is an excellent piece of hardware, and voice search is for real.  Once the app ecosystem comes fully online, it will be hard to beat for the price.", "verified": true, "helpfulness": "2/2", "author": "Jonathan W Driver"}, {"rating": 5.0, "review": "Fire is fitting in nicely, replacing the outdated Boxee box for accessing content in my home network.  Plays all files I have tried to play.  I haven't used the Wifi, but via Ethernet has met my expectations...", "verified": true, "helpfulness": "0/1", "author": "Doug McPhie"}, {"rating": 4.0, "review": "This thing ROCKS!  Easy to install and use.  Love it!  Took longer to set up the netflix account than to install the box.", "verified": true, "helpfulness": "0/0", "author": "AndyB"}, {"rating": 5.0, "review": "Amazon Fire TV is superb! The search capability is fantastic and works very well. As a game box it is not an XBox or PS4, yet it perfectly satisfies my desire for gaming. The basic three apps that I use are Netflix, Hulu and of course Amazon Prime. I love it and recommend it highly.", "verified": true, "helpfulness": "1/1", "author": "Lois McKinney"}, {"rating": 5.0, "review": "The setup was ultra simple....the pictures are clear and bright (better than Dish). I have used the Voice feature several times and it actually does what I ask it to do.  I canceled my Dish subscription...no more $100 plus a month anymore.  I am hoping that in the future, more offerings such as Golf Channel and Espn will be available.....  This pretty little black box has got to have the cable and satellite companies sweating.  It just has to get better for the consumer..  I am proud of you Amazon....", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"bogeyjohn\""}, {"rating": 4.0, "review": "I gave this 4 stars I like it . Its very fast loading movies , picture clarity is awesome ! Your choices of programs are many , over all I think its a great system.As a mater of fact better then most that are out there.", "verified": true, "helpfulness": "1/3", "author": "Robert"}, {"rating": 5.0, "review": "We love it ! Easy to use and of course we have prime so it's ideal ! It is not a brick !!! Very slick and small and its taking the place of cable because we tired to spend $ 150.00 at month for Nothing !!!Thank you , we have tons of shows to watch and set up was a walk in the park for people like us that are not high-tech wise yet !!", "verified": true, "helpfulness": "1/2", "author": "Teresa"}]