[{"rating": 5.0, "review": "I have a Roku 3 on my main TV for streaming my PLEX server to and it is great, but I was tired of putting an HDMI cable into my bedroom TV from my desktop in order to watch movies on their without getting blocked. I started using my Chromecast and my life was so much simpler! I had some trouble setting it up, but that was a network issue on my end.", "verified": true, "helpfulness": "0/0", "author": "Cdeli"}, {"rating": 5.0, "review": "Great product for the price. It connected with ease to my labtop and smartphone. Mostly watch u tube vids and movies.", "verified": true, "helpfulness": "0/0", "author": "Eric P."}, {"rating": 2.0, "review": "I purchased this from Best Buy along with a Smart TV. I was told this product would stream content from the PC (locally stored) to the TV. Being a Smart TV I can already stream from the internet directly. It appears this unit serves no purpose for me and I was lied to by the salesperson. Unless someone can enlighten me to the contrary I can not stream local content. For me a waste of money.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It would not syc to my Vizio TV.  Return was no problem.  Just had to go hard line.. . . . .", "verified": true, "helpfulness": "0/1", "author": "Dennyc"}, {"rating": 5.0, "review": "Pretty cool little device. Makes your TV an entertainment hub while conserving space nicely. Don't have much space to work with in my apartment, this made that work out.", "verified": true, "helpfulness": "0/0", "author": "nliles"}, {"rating": 2.0, "review": "Great toy, wish it was a little more capable. Too new, not a whole lot of apps that can be used with it yet", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 5.0, "review": "This device is really cool. It allows to play almost anything form the computer and also from any tablet or cellphone.", "verified": true, "helpfulness": "0/0", "author": "Edwin"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Woodrow A Landry"}, {"rating": 5.0, "review": "As with any new media device, it takes time,  customer feedback to get things right. I bought this when it was first released and I have only seen improvement since. I amazed by things Google does and I will continue to support this product as long as Google keeps delivering updates and improvements.", "verified": true, "helpfulness": "1/1", "author": "Phil"}, {"rating": 5.0, "review": "Does everything I could ask of it in clear and crisp HD.Do not hesitate to purchase if you have the following.1. Wifi2. Internet Service3. TV with an HDMI port.4. IOS, Android, or a computer (pc or mac)This thing is so much better than that clunky Roku that developers don't take the time to iron out app issues due to better technology coming along, such as the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Joseph"}]