[{"rating": 5.0, "review": "I love fire tv. I already have prime membership with my kindle and this makes cable obsolete in my house.", "verified": true, "helpfulness": "0/0", "author": "Jessica Harvey"}, {"rating": 4.0, "review": "I like it a lot, just wish more newer movies were available on prime.  I really do not want to pay for a movie when I am paying for prime each year.", "verified": true, "helpfulness": "0/0", "author": "Sheila Mitchell"}, {"rating": 5.0, "review": "Watch moves and play steam games on it with a logitech controller and it works great.If you also have steam and you wanna play your games on your fire tv then download limelight.", "verified": true, "helpfulness": "0/0", "author": "Luther"}, {"rating": 5.0, "review": "Makes streaming extremely easy! Voice command works well. Love it!", "verified": true, "helpfulness": "0/0", "author": "Leah Pettis"}, {"rating": 5.0, "review": "Love this little box! It's a whole new TV experience. I was actually able to cut my cable bill due to Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Love Amazon Fire TV, just another great product from Amazon", "verified": true, "helpfulness": "0/0", "author": "DeezerD"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "L. Consol"}, {"rating": 5.0, "review": "Much better than Roku -- get this with Amazon Prime and cut the cable!Hooks into your high speed internet and you can browse Youtube and play em right on your TV or dive into the deep free library available at Amazon.Downside: no NFL or live sports", "verified": true, "helpfulness": "0/1", "author": "Steven N. Gosney"}, {"rating": 5.0, "review": "It works", "verified": true, "helpfulness": "0/0", "author": "Jarryd Ruff"}, {"rating": 3.0, "review": "I would have given this 5 stars if I would have received better customer service. A week after receiving this the remote stopped working. Amazon customer service was very difficult in providing a replacement. Aside from my concerns on their warrantee policies, I have been very happy with it. the set up was very easy and everyday use is simple.", "verified": true, "helpfulness": "1/1", "author": "Hillary R."}]