[{"rating": 1.0, "review": "What a waste of money!  This product was released WAY before it should have.  This was an impulse buy after seeing the ad and I will be promptly returning it.  This products allows only 5 apps to run on it and barely operates on Apple devices.  Your better off getting a Roku.  The ad makes it look like you can chromecast playing games on your IPhone to your HD TV which isn't true.  This is definitely a MUST PASS on device.", "verified": true, "helpfulness": "0/0", "author": "CHESTEROO"}, {"rating": 2.0, "review": "To start with, I'm pretty techy.  As a matter of fact, we're deploying almost 250 new Android tablets and were looking for a video streaming device to assist with presentations.  I reduced the rating by one star because picture quality on a 55\" tv was bad.  Another star went because on an Android, it only works with 5 or 6 predetermined apps.  Another star got dropped because, no matter what you read, see, or hear, this device DOES NOT cast Chrome browser tabs from an Android tablet.  After trying for an hour, I called Google support.  Was told that it would only cast from a desktop or laptop.  Totally defeats my purposes.  It does, though, get two stars because, for the price, if you don't have a streaming option on your tv, being able to get Pandora, HBO to Go, Netflix, and a couple of others is worth it.", "verified": true, "helpfulness": "0/0", "author": "Jeff Harris"}, {"rating": 5.0, "review": "Very easy to use and alot of fun.  Pandora was just added and makes it better.  It looks like google is working to port more media streams in which only make it more valuble.", "verified": true, "helpfulness": "0/0", "author": "Casey Becker"}, {"rating": 1.0, "review": "Like others, I had great expectations.  But don't waste your money (even though it is very reasonably priced).The unit freezes constantly, even \"casting\" simple text-based web pages.  Seems to work fine when I go to a new site, but then freezes when I scroll down.  How frustrating is that?!It's going back tomorrow.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far I've only used my Chromecast for Netflix and it seems harder to use for other things the way my house is set up, but it works great for Netflix. I got it with the free 2 months of Netflix and it made an already inexpensive dongle much cheaper.", "verified": true, "helpfulness": "0/0", "author": "Hisashi T. Fujinaka"}, {"rating": 4.0, "review": "I love the concept... There's still some content issues, but the device itself is great. I've used it mostly to stream content from Chrome from my laptop to the TV and so far it works good.", "verified": true, "helpfulness": "0/0", "author": "Scott lloyd"}, {"rating": 5.0, "review": "This is now our primary way of watching movies and TV, easy to use and affordable. You can control it from either your phone, tablet or your computer.", "verified": true, "helpfulness": "0/0", "author": "jesse"}, {"rating": 4.0, "review": "amazing this works exactly as advetised and has the simplest setup you have a phone download chromecast appt plug it in and your ready to go have a computer download google chrome and chromecast extension and your done literally takes no more then 2 minutes now it terms of streaming there is good and bad news good news is it works as advertized stream hulu netflix google play now youtube and more  once your streaming you can do other things on your phone or computer whithout interupting the stream got a call take it and let eveyrone else keep watching or pause from your phone fast forward rewind you name it also there is an extension on your chrome tab (computer only) that allows you to stream the entire screen to the tv now this is still in beta form but I love it because I dont have cable (im cheap) and this allows me to go to project free tv and watch the walking dead or game of thrones from the computer stream it to the tv and click full screen and now youve got quality free tv (if your in full screen mode you cant use the computer to do seperate task in that mode) if you want to view a pic or personal video save just drop the pic into a chrome tab (computer only) and boom its on the tv now the bad side the wifi dongo is extremely bad my home is roughly 1200 square feet the router and chromecast seprated by about 18 (centurylink router) feet got a terrible signal and sometimes dropped the streaming task it had also the apps are limited but in enough time more developers will be on board and you can stream more but now its only the few I mentioned before so all in all if you router is close enough and there are too many wall or you have a really good router this buy is the only thing that makes sense nothing comparesside note: if your going to stream something in hd from the play store do it on your phone play store on a computer (you can view your purchase when you log into your google) won't work stream in hd just 480p or under", "verified": true, "helpfulness": "0/1", "author": "James"}, {"rating": 5.0, "review": "It worked for what I bought it for. Was easy to install. It was priced less than if I bought it from an electronics store.", "verified": true, "helpfulness": "0/0", "author": "400meters"}, {"rating": 3.0, "review": "Great Idea but it is currently limited on the IOS mobile platform. The price is right though, and its pretty cool for what it does, but my TV, Xbox, and BR Player already does the same things. As more apps become available I can see this as a pretty cool item, but for now, on the iPhone and iPad, you get Netflix, YouTube, and a few other movie and music services. We need to be ably to cast anything from our mobile device to the big screen. Then it will be 5 stars.", "verified": true, "helpfulness": "1/1", "author": "T. Hodges"}]