[{"rating": 5.0, "review": "Awesome and cheap. A perfect little slingbox. Try it with Plex and Localcast too.", "verified": true, "helpfulness": "0/0", "author": "Keram"}, {"rating": 4.0, "review": "Good low cost product to wirelessly connect your computer to a tv. You can watch Youtube videos, etc. pull up anything from the internet and have it on your tv. Chromecast allows you to use your tv as a giant computer screen (anything on your computer will be on your tv). With ROKU or Apple tv there are limitations to what you can see so with Chromecast you can see any internet site on your tv wirelessly from your computer.", "verified": true, "helpfulness": "0/0", "author": "Fast Eddie \"Eddie\""}, {"rating": 5.0, "review": "The cheapest, most reliable Wireless Streaming Dongle you can buy, that is incredibly simple to set up. Even just moving it to another TV doesn't require it to be set up again as long as it's within range of the paired Wi-FI network.Pros:- So cheap and robust it makes Apple TV a total waste of money. Chromecast apps can be launched from both PC and Mac OSX 10.8+, and most likely Linux.- Small footprint and rarely freezes, and if it does, unplug it for a few seconds from the power and reconnect. At worst there is a small button there to restore to factory settings.- Content delivery method is brilliant, it goes to a Chromecast optimized server for your app/service- Casting a chrome tab is also awesome.- AMAZING photos for when nothing is casted. I'll leave my TV on just for the beautiful high-resolution images they throw up randomly.Cons:- Only some apps support it right now, their SDK should have been released earlier.- Wish it could support 5Ghz networks for faster streaming. 2.4Ghz was probably chosen for the sake of range.- Need a 2nd one now.", "verified": false, "helpfulness": "0/0", "author": "J.S."}, {"rating": 5.0, "review": "I think if you have your uses sorted out, this is the best way to connect your tv. My primary requirement was to stream movies from my computer onto the TV and although there is no native support for that, PLEX just does absolutely fine and flawless. Also casting your phone/tab screen on your TV too works great and hence i feel this is a much better solution compared to an android stick considering the price difference and Google support. Its not a complete product but does everything perfect what its supposed to!!", "verified": true, "helpfulness": "0/0", "author": "zubin"}, {"rating": 5.0, "review": "We have smart tvs or game consoles in every room in the house but still found this so useful we bough two more.", "verified": true, "helpfulness": "0/0", "author": "Dave \"Dave\""}, {"rating": 5.0, "review": "It works great with youtube, netflix and basic web browsing, but not Amazon. Nor is it compatible with the Kindle Fire HD.", "verified": false, "helpfulness": "0/0", "author": "DAVID \"P\""}, {"rating": 5.0, "review": "Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Enrique Rodriguez"}, {"rating": 5.0, "review": "Everyone should have at least one of these, if you like to watch Netflix or YouTube. The video quality is better than streaming through a Playstation 3.", "verified": true, "helpfulness": "0/0", "author": "Shawn R \"ruby\""}, {"rating": 1.0, "review": "NO TECH HELP NUMBER. If you have a glitch with set up and you can't find your exact specific issue mentioned in a user blog or one of the standard FAQs then you are screwed and you just bought a $35 bobble for your key ring. Useless if you can't complete the set up. They have your money, can't be bothered with your petty problems.", "verified": false, "helpfulness": "0/0", "author": "dzip"}, {"rating": 1.0, "review": "It's advertised as the easiest way to watch online content but it's not. Apple products work out of the box the first time. This thing took several hours to configure..then you have to download new apps for it to work. Better stand right next to your wifi connection or it won't find your internet. Sending Back!!.. Just gonna stick with Apple products. Google PC stuff is always a hassle", "verified": true, "helpfulness": "0/0", "author": "George H."}]