[{"rating": 3.0, "review": "As with other reviewer comments, setup is very easy and picture quality is great but I may be sending this back within the 30 day free trial period because there is no direct access to Amazon Prime \"free\" movies without looking through the entire library which is very time consuming and you can't access your personal watchlist.  This is a BIG downer for me!!  I do not buy \"movies on demand\" and resent the fact that Amazon is practically forcing you to do so just because you get tired of looking for a movie that you know is free through Prime but isn't presented that way.  If they resolve this I will buy it then!", "verified": true, "helpfulness": "3/5", "author": "Kathy Roberts"}, {"rating": 2.0, "review": "Did not work with my internet speed. I could not get past the initial update download. We were very disappointed.", "verified": true, "helpfulness": "1/1", "author": "Kimberly Farish"}, {"rating": 4.0, "review": "I bought it a few hours ago and the setup was a breeze. Compared to the Sony home theater that I streamed from before, the visual is a 100 times improved.I'm having one little issue though.I connected it to my TV instead of my home theater because I can't get the first option to work. The audio on my TV is horrendous so I prefer using the home theater speakers.Any tip on how to stream through it? I thought I'd just plug in the HMDI into the home theater instead of the TV but when I do that, Amazon Fire  doesn't show up on the tv screen. My tv has only two HDMI ports, the other is reserved for my cable box.", "verified": true, "helpfulness": "1/1", "author": "Wendy \"Wendy\""}, {"rating": 5.0, "review": "Let's face it, cable TV is rapidly becoming obsolete. I can't stand paying for channels I never watch and having to use complicated remote control  devices. This device works really well , is simple to use, has an easy remote, and is not as fussy as apple TV. Great product that is even better with an Amazon Prime Membership", "verified": true, "helpfulness": "0/0", "author": "Laughin Bones"}, {"rating": 5.0, "review": "This is great device. They got this one done right. Voice commended works very well and I'm a lowest techie. Worth the $100 to buy and must buy Prime at $100 per year but much to watch.", "verified": true, "helpfulness": "0/0", "author": "Michael Knott \"mmknott\""}, {"rating": 4.0, "review": "I bought this product to use at my home outside of the US and it works perfectly to access Netflix, the only donside is that Amazon content cannot be purchased unless you have a US issued CC. Otherwise it works wonders.", "verified": true, "helpfulness": "2/2", "author": "grassengel"}, {"rating": 4.0, "review": "[Good]Since this has the most horsepower out of all the current set-top boxes (I own an Android / Google TV, Roku3, and Apple TV), it has the smoothest experience in terms of response (moving through the UI, and so on). Apple TV is pretty close, but it has limited apps so it's not really an equal comparison.Easy to use: Most things feel intuitive and they even have a quick video tutorial just to be safe.The app and channel selection variety is pretty good compared to the competition. It has the best games for set-top boxes though some require a separate game controller to play. In the future this will be a good substitute for a traditional video game console since it will have a yearly ungraded hardware release. My guess is that Fire TV will have the same amount of horse power as the Xbox One and PS4 within 3-4 years because of the yearly hardware releases.The price is great for what you get in terms of hardware (better processor and more RAM) and the price comparable to other set-top boxes.The remote feels great and it has most of the keys I need.It looks great. It's very minimalist. It will blend easier with your AV setup than either Roku or Apple TV.[Ok]The app and channel selection aren't bad. The selection is better than either Google TV or Roku, but it's not mind blowing either. Of course Amazon seems to be vetting the apps more than Google so quality is better than the Google Play Store for Google / Android TV.Voice Search: like Xbox One, this is a hit or miss with a 70% success rate. I didn't care for this feature much. A keyboard would have been more useful.If you're already happy with Roku3 and Apple TV, there's nothing that really stands out for Fire TV that makes this a must buy unless you're upgrading from a Roku 1 or 2, or an older version of Apple TV. If you have a Google or Android TV, get this immediately. Fire TV is an Android set-top box done right.[Bad]Set up was NOT a no-brainer in my case unlike the competition, even the garbage devices known as Google TV. Attempting to setup the Fire TV via Wifi only yielded a blank screen with no UI visible even when I repeatedly pressed buttons on the remote. This is really bad. It made me think that I had a defective product. Nothing happened until I plugged the Fire TV into wired ethernet where it proceeded to download a bunch of updates and finally show a UI. If I wasn't a techie, this would have gone back to the store almost immediately. This is a really horrible problem that needs to be fixed.No 3rd party social network or photo site integration: one of the best features of Roku is Facebook integration. It is really nice being able to see pictures from your Facebook newsfeed beam passively to your big screen TV as a screen saver. Using Amazon storage for the screen saver isn't good enough since it only shows the pictures that you add, and not the ones your friends and family add today and in the future. UPDATE: No set-top box has this feature now. Apparently Roku's Facebook integration was provided by a 3rd party and it's no longer present.I liked having a full set of alpha-numeric keys using the Android / Google TV set top box from Vizio. It's really not convenient having to type on anything that doesn't have a alpha-numeric keyboard. No, voice search isn't good enough yet to make me not want this feature. This is a minor complaint.[Misc]I got this through a discount at Staples. They typically have sales on electronics where you can get a new Fire TV 20% cheaper than what Amazon prices it.[Verdict]As I've predicted with my review of the Vizio Android / Google TV box, Amazon would be the one to bring best set-top box. It's not perfect but it's the best on market (for now).", "verified": true, "helpfulness": "2/2", "author": "Lee"}, {"rating": 4.0, "review": "Seeing as this is one of the only easy ways to stream the Amazon Prime library to a TV, I decided to pay the (to me) steep price tag and get it. I have been very happy with it barring a couple small things and 1 big one.First, it's kinda annoying that you can't choose to show just Amazon Prime content...It's just mixed in with the pay content.  (Make sure you turn on the password protection for purchasing items or you may find yourself buying things accidentally.)Second,  everything other than amazon content (Netflix, Hulu, Etc.), is accesed through their respective app. It would be nice if you could just browse EVERYTHING that is available.And that brings me to the thing that annoys me the most...the really cool voice search feature that Amazon promotes  (and actually works quite well) ONLY work with Amazon content.  You cant use it to search anything else! (Netflix, Hulu, YouTube,  etc.)Even with that major flaw this a really cool decice amd my family has gotten many hours of enjoyment out of it!", "verified": true, "helpfulness": "1/1", "author": "Scott May"}, {"rating": 4.0, "review": "Love it. Come already setup with my prime information and works perfectly. Just wish it had Vudu app. Would be a 5 start with that app.", "verified": true, "helpfulness": "1/1", "author": "JoeS"}, {"rating": 5.0, "review": "Ok, well, when I first got this out of the box and installed it which took like 2 seconds I was a bit miffed. Having been with Direct TV all our lives we were used to getting everything we wanted included in the programming and paying a lot of money for it. We only paid for the Fire TV and then the prime membership, Netflix we already had and then added Hulu Plus. With Fire TV, yes you have to pay for a lot of the content that you want but once its yours, its YOURS. And nobody can take it away because you switch companies, it is paired with your Amazon.com account for life and the wonderful news is that Fire TV only needs wireless internet and your TV to work. THAT's IT. So, while you may have to pay for some shows and their seasons and for some movies because between prime and netflix and Hulu you should have decent coverage, you still end up paying less than you would if you paid for Direct TV or Comacast or U-Verse. You only pay for exactly what you want to watch.There are free apps for food that do recipes live and there is a fitness app that includes yoga, there are tons of apps and you just have find your niche and they are also adding apps to Fire TV and add prime movies daily. The prime membership is 100 a year, that's it. So, while it might take you a while to get your library established to where you would like it, you would still be paying much less than you would if you paid for a year's worth of satellite TV. I personally love never having to lose my stuff again. Oh and there are kids apps for math, reading, story time and the muppets. Disney TV is coming and also PBS kids. Its different, takes some getting used to but once you adapt you will never go back.Totally eliminates the need for a dvr, making it totally obsolete. You can live stream whatever you want, whenever you want. No more TIVo service fee. Tivo does not even work with Direct TV or U-Verse unless you get one of their Tivo's. And if you want to live stream with a TIVo you have to buy a mini which might or might not work for you because it does not work wirelessly. I think once you do your homework and you do the math you will realize that it is the better way to go. A little bumpy in the beginning but a much more stable future. Loving it!", "verified": true, "helpfulness": "1/1", "author": "Glades Girl"}]