[{"rating": 1.0, "review": "Maybe it was just my luck but couldn't' get the darn thing to work for anything. The book that comes with it (you actually have to get it separately) DID not do any good either. It's a very picky system. Not for people that have high speed internet that do NOT live in the city.  Just bad.  Just get a Blueray player and get it over with.", "verified": true, "helpfulness": "1/3", "author": "A Moms Rantings \"Mom tested and Mom approved\""}, {"rating": 5.0, "review": "I cannot compare this to any other similar device but Apple TV, which I have used and love, but could not dish out the cash to pay for one for myself. Chromecast is a fraction of the price and, though its apps are currently limited, I have recently gotten around that by simply Chromecasting from my laptop. I had a little trouble with Amazon Instant Video until I disabled Silverlight on my PC and made it stream using Flash (point your Chrome browser on computer to chrome://plugins to disable/enable Silverlight). Voila! So anytime I cannot operate it using my iPad, I simply pull out my laptop and cast from there. My brother likes to Chromecast from his Android phone when he is visiting and plans to buy a Chromecast of his own. For a mirroring device to mirror from my laptop, and for streaming YouTube, VEVO, Pandora, and Netflix from my iPad, I feel like I have something the same (or better) quality of AppleTV, with a slightly higher learning curve. At first I bought this because I was curious and thrifty. Now, it's the only reason I turn on my TV, and I may ultimately invest in Hulu+ and ditch cable for good and just Chromecast everything. One surprise bonus: I can use my iPad or PC to Chromecast a movie to the TV, then still use my iPad or PC's other tabs/screens for other things ... So think a movie for the kids, then grownups can use the device for something else. Nice way to multitask.", "verified": false, "helpfulness": "0/0", "author": "DeeIngram \"D\""}, {"rating": 4.0, "review": "We use this to watch tv shows from our computer on our tv. If you are looking for a gadget it is not too pricey and helps us do that, but there is nothing super exciting about it.", "verified": true, "helpfulness": "0/0", "author": "JHolland"}, {"rating": 5.0, "review": "This works great!", "verified": true, "helpfulness": "0/0", "author": "Tallieu \"Tallieu\""}, {"rating": 2.0, "review": "Worked well for 6 months and then stopped working.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I bought this device for my plasma TV.  I have DirecTV.  After I installed the device, I got a message from my TV that said it can't connect to the Internet, thus negating my ability to buy their view-on-demand movies.  I keep getting this error message whenever the Chromecast is plugged into my TV.  The message is very annoying as it takes up most of the screen and keeps recurring, preventing me from viewing the show I'm watching.  Therefore I removed the Chromecast.  It seems to conflict with DirecTV.  Is there any way to get around this?", "verified": true, "helpfulness": "0/0", "author": "Bryan Cassiday \"Author of  'Sanctuary in Steel: a Zombie Thriller'\""}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Yeh"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Chromecast works pretty well! My 55\" Samsung is a great tv but trying to navigate the web with the tv remote and on screen keyboard is... forget about it! With Chromecast you can just use your phone for navigation and when you find what you want just \"cast\" it to the tv. Way easier than the remote!One thing to note is you can only cast from chrome browser or one of several downloadable (free) apps. So not every webpage will necessarily make to your tv screen. Still a pretty nifty device!", "verified": true, "helpfulness": "0/0", "author": "Robert G."}, {"rating": 5.0, "review": "It is awsome", "verified": true, "helpfulness": "0/0", "author": "Kaveh"}]