[{"rating": 1.0, "review": "Regret this purchase.  First I didn't realize I couldn't use with my kindle.  Thankfully it worked with my iPhone. Second didn't know I couldn't surf the web. Finally stopped working after two weeks. Spent quite a bit of time trying to figure it out before I realize it was a defective device.", "verified": true, "helpfulness": "1/1", "author": "MS"}, {"rating": 5.0, "review": "Later Comcast!", "verified": true, "helpfulness": "0/0", "author": "RollingVideoGamesDenver"}, {"rating": 5.0, "review": "Connects to WIFI instantly, and runs pretty cool. Apart from the standard Apps, I am able to stream videos from my NAS without any issues.Also, google gives free offers to get movies or cash, so there is always some cashback too.", "verified": true, "helpfulness": "0/0", "author": "Ramesh Manni \"mrrame\""}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Jose A. Arvelo"}, {"rating": 4.0, "review": "Great for Netflix, and for using your iPhone or iPad as your remote. I do wish, I could use it for Amazon Prime.  But there are more apps everyday  and it's hard to beat the price.", "verified": true, "helpfulness": "0/0", "author": "Jemma Arcega"}, {"rating": 5.0, "review": "Awesome...watch my show on my tv using my ohone as remote...love it", "verified": true, "helpfulness": "0/0", "author": "cj177"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Amalia Banuelos"}, {"rating": 5.0, "review": "I love my chromecast.  I have used a wide variety of different streaming devices (Roku, Samsung, neotv) and this is one of my favorites and I think it is the best for the price.  It streams Netflix, Youtube, and Hulu without any problems.  The only downside is that it can be difficult to stream amazon prime videos and videos from your amazon library.  It can be done but it takes some effort and is super draining on the phone/tablet battery, to the point where it's not even worth it.  For the cost I think it is one of the better streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "love my chromecast. good price and quick shipping on amazon. have a few of them set up in my house and easy to use for my parents.", "verified": true, "helpfulness": "0/0", "author": "Yuliyan"}, {"rating": 5.0, "review": "Love it!! I love being able to listen to my music playlist and watching the movies purchased or rented on You Tube.", "verified": true, "helpfulness": "0/0", "author": "Shelley Calhoun"}]