[{"rating": 3.0, "review": "you need a strong wireless signal to make this work and the newer / faster processor you are streaming from helps", "verified": true, "helpfulness": "0/0", "author": "R. Sorenson"}, {"rating": 5.0, "review": "hope to see more Apps for that, like NetFlix, YouTube...No issues, so far. Nice to have it for $35, period.", "verified": true, "helpfulness": "0/0", "author": "Stanley Lam"}, {"rating": 5.0, "review": "would like to stream more sites than the few available right now, but simple to use, no issues for at this time.", "verified": true, "helpfulness": "0/0", "author": "Mark Caleb"}, {"rating": 5.0, "review": "Bought this device a bit skeptical but when I began using it was very easy to fall in love with. This thing sends any webpages from chrome to your screen without a flickr or a second thought. It's fast, streams fast, I can use my laptop and iphone or ipad and no longer need to connect my blueray player to get netflix on my tv. Great product for a great price...", "verified": true, "helpfulness": "0/0", "author": "sarkis oganyan"}, {"rating": 5.0, "review": "This product is only $35 and has changed my life for the better. If someone doesn't already own a smart TV there is no reason not to purchase the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Scott Bengtson"}, {"rating": 4.0, "review": "Overall am thrilled and amazed with this product. As a google product, one would expect this to work flawlessly with other google products. But answer is no, casting chrome browser gets disconnected intermittently. Not all youtube videos are casted to chromecast, some videos get unexpected error but works when you cast the full chrome tab to TV.May be some updates in future to youtube and chrmocast would make this as wonderful tool.", "verified": true, "helpfulness": "0/0", "author": "HBO \"kali4nia\""}, {"rating": 4.0, "review": "We like it very much!! Happy to have it! Totally worthy for money.  It works wireless with our lap top and the picture and sound on Netfilx and Youtube are great. The only limitation I have noticed so far is a small number of applications (so far Netflix, Youtube and Chrome), but I understand they are working on developing new apps, so soon, this will be 'a must have' device at home. And one more thing I have noticed with Netflix is that it's not playing a sequence of episodes right  after each other. You always have to start it manually, but I am guessing this improvement will be featured soon also. So, yes, I am recommending it.", "verified": true, "helpfulness": "1/1", "author": "G. Stojanovic \"goggie018\""}, {"rating": 1.0, "review": "I loved the idea of chromecast being able to stream videos from any android device to a television. Unfortunately you cant actually stream videos from your OWN gallery. Lucky an app called Allcast actually lets me stream my own videos to chromecast; unfortunately Google now block that app and now they've restricted me from sharing my own videos. Why? If my family comes over I can't show them videos of my kids on the television. Why?", "verified": true, "helpfulness": "851/1", "author": "Paul Rivera"}, {"rating": 5.0, "review": "this is a great product,it would be even greater if it had more apps,easy setup plug and play,connects with wireless network real fast,i love it.", "verified": true, "helpfulness": "0/0", "author": "del"}, {"rating": 5.0, "review": "At the begining, a little confusing to pair with router once paired it's a great addition to the TV.  The only concern that comes to mind is that it overheats, the component tends to run hot and becomes a little sluggish.  Otherwise a great product!", "verified": true, "helpfulness": "0/0", "author": "D. Rodriguez"}]