[{"rating": 3.0, "review": "Amazon TV has a lot of features which are great, but the fact that you still have to have a cable subscription to use things likeHBO GOShowtimeESPNDisney Jretc.Is a turn off. We were hoping it would replace our cable subscription, but it's more of a complement. I guess this is really not what we expected which is not Amazons fault, but it would be great if it would replace cable.", "verified": true, "helpfulness": "2/4", "author": "Victor"}, {"rating": 3.0, "review": "We have both the Amazon Fire TV and the Apple TV - they are used on the the same television (not at the same time as the cable has to be switched back and forth). We got this mainly to be able to watch Amazon Prime videos since Amazon won't license their app for the Apple TV. In general the setup and usability is fine, with the exception of its wireless feature. With the Fire TV, it is CONSTANTLY stopping to buffer while streaming and periodically pops up the screen about our bandwidth being too slow to properly stream. The Apple TV sits a foot away and it RARELY has streaming issues.As a recent example, the other night hubbie paid for a tv pilot from iTunes before checking availability from Amazon Prime. He watched it on the Apple TV, then thought I'd like it so offered to watch it again with me, this time he switched to the Amazon box as we might want to watch more episodes. The Amazon version was SD, and it balked and buffered so continuously during the first 10 minutes (and had the 'slow bandwidth disclaimer on the screen) we stopped, changed boxes and watched the iTunes HD version on the Apple TV - not a single stutter in the entire show!If your main reason for getting a box is to have access to Amazon Prime videos, then it's worth it, otherwise I'd consider the Apple or Roku (tho I haven't tried that one).", "verified": true, "helpfulness": "1/1", "author": "lapak"}, {"rating": 5.0, "review": "Great device. Easy setup. ASAP technology makes start of streamlining quicker than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mark P."}, {"rating": 5.0, "review": "Easiest electronic device I've ever set up, and the ease of use is great.  With prime, I have found very little that isn't free.", "verified": true, "helpfulness": "0/0", "author": "Braeden"}, {"rating": 4.0, "review": "When you compare Amazon Fire TV to Apple TV, I will definitely say that Amazon Fire TV is far superior, more memory,faster downloads, excellent HD movies, games and apps. MOVE OVER Apple, AMAZON RULES!!!However,I am truly disappointed that being a Prime member and also being charged a yearly costs, I still cannot download anything from the Prime menu, and all I am told is that it's not available at this time. No Prime Video, etc. so I had to download Netflix and pay for that due to the unavailability to access Prime.", "verified": true, "helpfulness": "0/0", "author": "John S Hamilton"}, {"rating": 5.0, "review": "I regret not Having bought it before, this fire tv is incredible.", "verified": true, "helpfulness": "0/0", "author": "Yeimy"}, {"rating": 3.0, "review": "The device has two ways to search for a program (e.g. a movie) you want to play: 1. Voice function 2. Text input. I found voice function to be great. However, the text input is time-consuming and tedious. I wonder if it is possible to use my lap top, that is, is there a way to connect wirelessly Amaxon Fire TV with my laptop. Any suggestions will be of great practical help.", "verified": true, "helpfulness": "0/0", "author": "chirawa"}, {"rating": 4.0, "review": "The movies I wanted still cost a fee. Of course I was disappointed.", "verified": true, "helpfulness": "0/0", "author": "cindy bartels"}, {"rating": 3.0, "review": "While the voice command feature is impressive, the Amazon Fire itself is not user friendly and the internet connection for non-Amazon products (e.g. Netflix, Huluplus etc. is painstakingly slow.", "verified": true, "helpfulness": "0/0", "author": "yehuda"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Vincent J. Carter \"Phooey\""}]