[{"rating": 3.0, "review": "I think I will like it when I get use to it and can operate it to it's capacity. Maybe I can get rid of the some of the unwatched channels on my TV.", "verified": true, "helpfulness": "0/0", "author": "Joan Childress"}, {"rating": 4.0, "review": "I think 4 stars is ample but not deserving of 3 or 5.  I have an Apple TV which lacks some features (i.e. Amazon Prime) and a remote that seems to vanish into thin air.  Very frustrating. I tried the Remote App for my iPhone and it became glitchy overtime.  Again- very frustrating.  None the less I was determined never to pay for satellite or cable service again!!! I am a huge fan of Amazon Prime but had been relegated to watching it on my iPad or my computer.  I decided to give the Fire TV a try.  The price was right and shoot it would probably be on my door step within 24-48 hours (and it was).  When it arrived it was sleek and compact just like the Apple TV but the remote had a much better design and has proven easier to operate and find.  The only draw back is the search function.  Yes it has a voice search which is terrific but the screen layout leaves much to be desired.  The categories are not specific enough and finding free Amazon Prime stuff is a task.  The iPad layout was better for that.  Overall, I like it and due to it's compact design it can sit next to my Apple TV and I can switch between the two.  I hope that the search categories and screen layout is updated soon.  Either way, I am so much happier with Fire TV than with those ugly dust collecting satellite boxes.  It is absurd to pay almost $100 per month after taxes and fees for pretty much basic service. A one time $99 purchase fits my budget perfectly :-)", "verified": true, "helpfulness": "3/3", "author": "HeatherLea"}, {"rating": 4.0, "review": "I don't use this for much but my blu-ray player crapped out so I am using this for my netflix and amazon prime (even though I never find anything worth watching for free on amazon prime, it all costs money even though I already am paying a yearly fee).  The box seems to work good and is nice and small.  When I have tried it the voice search always seems to work even with complex titles or names.  I wish the voice search  would work in netflix so you didn't have to take forever to type in words.  The thing I don't like is you can't turn it off.  There is no power button.  You have to just go back to the menu and let it sit there for half an hour and it will go to standby on its own.  If you accidentally bump a button on the remote it turns back on.", "verified": true, "helpfulness": "2/2", "author": "not mark twain"}, {"rating": 5.0, "review": "For such a tiny box, so much to offer. We are getting the most out of our Prime membership with this. Along with the other features, This is one of the best buys I have done in a while.", "verified": true, "helpfulness": "0/0", "author": "kperkins"}, {"rating": 2.0, "review": "There's very little on the fire I can't get on Comcast on demand. Couldn't get the 2nd season of House of Cards.  Doesn't let me use anything on Showtime because I don't subscribe to Showtime! Same with all the premium channels.  All the movies are OLD!Waste of $$.", "verified": true, "helpfulness": "1/3", "author": "Nancy L. Hendel"}, {"rating": 4.0, "review": "I Love this device. It's so much nicer than the Roku the faster processor(s) and the added memory is a huge improvement. One MAJOR draw back though is the overlooked MUSIC content that I've already purchased from amazon.com. I listen to music a lot and I find it a bit sad that in order to enjoy the music on my amazon cloud I have to revert to the Roku...MAJOR oversight on your part Amazon....seriously!!!!!", "verified": true, "helpfulness": "3/3", "author": "Karin P. Kenny \"Karin Penelope Kenny\""}, {"rating": 1.0, "review": "We purchased this product hoping to lower our provider bill.  However, one thing they do not tell you is that there are only certain providers that work with Fire TV.  DirecTV is not one of them. I believe Amazon should list the providers supported. I emailed Amazon and received a quick reply that Amason FireTV and DirecTV are not compatible. Therefore certain apps don't work, i.e., ESPN. Returned the product.", "verified": true, "helpfulness": "4/11", "author": "Flowers400"}, {"rating": 4.0, "review": "Amazon Fire TV was a great addition to my home theater system.  I have a Samsung Smart 60 inch TV, but was having audio problems when streaming from the smart hub.  No such problems with Fire TV.  It is very fast, sound is great and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "D. J."}, {"rating": 5.0, "review": "This is awesome, there is a lot in  a small package. Super easy to hook up .  The selection was more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Clyde Sanford"}, {"rating": 5.0, "review": "great everything we wanted and more.easy hookup and operation.lust talk and watch your favorite movies.Easy to find movies and series", "verified": true, "helpfulness": "0/0", "author": "msdank1"}]