[{"rating": 4.0, "review": "Does as it says.", "verified": true, "helpfulness": "0/0", "author": "tcpiii"}, {"rating": 5.0, "review": "Great gadget - but, my internet service is soooo slow through Hughesnet that I cannot stream video through Netflix without it locking up and pausing for foreeevvvveeeeerrrrr.  But, when showing other items on my laptop - it's awesome!  Thank you, Google!", "verified": true, "helpfulness": "0/0", "author": "Marie Belinowski"}, {"rating": 3.0, "review": "Great potential....when it works, it only does this on its on demands and i have never been able to figure out what is the reason for that. Connection issues all the time", "verified": true, "helpfulness": "0/0", "author": "Todor Jelev \"Tony Jelev\""}, {"rating": 3.0, "review": "Is good", "verified": true, "helpfulness": "0/0", "author": "beatriz"}, {"rating": 5.0, "review": "Better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "Noley \"REAL FOOD ENTHUSIAST\""}, {"rating": 5.0, "review": "I had debated this product as I had Apple TV and WD Live, however, I am now moving into the Android arena with an Android tablet, phone and a Chromebook.  It is great and I mean really great how I can stream out so much media from one of these devices to the Chromecast.  You just can't go wrong, especially with this being so inexpensive!!  I have one, looking for a deal on another!Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Mike Callery"}, {"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Jasonc10146"}, {"rating": 5.0, "review": "splendid piece of gadget", "verified": false, "helpfulness": "0/0", "author": "Solar111"}, {"rating": 4.0, "review": "So it's a simple Google product which does well what it has promised. Cast your Google Chrome window to the TV or things like playing Youtube.This is not a negative feedback towards the advertisement of the product but rather a wish for feedback: Definitely needs to integrate with media players like VLC Player. When that happens, this will be a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "Basar K. \"-Basar\""}, {"rating": 5.0, "review": "Really nice gadget. Simple, easy to install and lets me stream my contents from smartphone and pc to my tv.", "verified": true, "helpfulness": "0/0", "author": "Patrick Martinez"}]