[{"rating": 4.0, "review": "I bought this for what it one day will be, the ultimate supplemental media streaming device. That being said it still has some work ahead of it, the cast desktop and tab options have significant lag and in the whole desktop option the screen is flipped upside down. Understandably both of the aforementioned options are labeled \"Beta\" so expect improvements in the future. The Youtube application is problem free and extremely impressive, as is the Netflix application. I look forward to the day when the supported application list expands to Amazon Video.", "verified": true, "helpfulness": "0/0", "author": "Anri Pekaj"}, {"rating": 5.0, "review": "very good device. it's very easy to setup. However, the setup does not working with a macbook and a hidden network. I have to switch to my PC which is running windows 8.Other than that, all the castings are working like charm and it's worth $35.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "matthew peterson"}, {"rating": 5.0, "review": "Setup was incredibly easy. I used to watch YouTube videos on my computer or phone. Now I always just click \"Watch Later\" so that I can watch them on my bigscreen HDTV. Makes viewing them so much more enjoyable. The Chromecast works just like it is supposed to work. I'm gonna buy some for presents this holiday season. At $35, they make a great gift, even if someone is only going to use it occasionally.", "verified": true, "helpfulness": "0/0", "author": "Matthew B. Jones"}, {"rating": 1.0, "review": "CHEAP,OLD TECH,PICTURE QUALITY NOT GOOD,KEEP CRASHING,FREEZING,NOT RESPONDINGIF YOU HAVE SMART TV YOU DONT NEED ITFU..ING GOOGLE THEY CHEAT PEOPLE CHEAP STUFF", "verified": false, "helpfulness": "0/2", "author": "Halil"}, {"rating": 5.0, "review": "Very easy to set up.Even easier to use.Nothing to negative to say about this at all!  From the initial setup that walks you through the easy set of instructions, to the flawless operation of the companion app.  I have used the app on Andriod, Apple, Windows, and Linux platforms and have never had a single issue.", "verified": true, "helpfulness": "0/0", "author": "Nick Large"}, {"rating": 5.0, "review": "This item was recommended to me by a friend. I bought it as a gift and I'm sure my friend will be very happy.", "verified": true, "helpfulness": "0/0", "author": "Maria Florence Oliverio"}, {"rating": 4.0, "review": "Love this little thing.  Settin' it up is a breeze. Great picture quality.  If only it would read my NAS....", "verified": true, "helpfulness": "0/0", "author": "a computer guy"}, {"rating": 1.0, "review": "I AM HIGHLY SKILLED COMPUTER GUY, I TRIED EVERY WHICH WAY TO SET UP THIS PRODUCT, EVERY STEP THERE WAS A PROBLEM. THE CODE ON TV SCREEN DIFFRENT FROM MY COMPUTER. THE APP TO BE ADDED TO WINDOWS NOT VISIBLE. LENGTHY SERIES OF STEPS THAT LEAD NOWHERE. JUST SET UP ROKU ESY AS A CHARM. STP 1 TO 10 SMOOTH AS BUTTER. RETURNING IT ASAP", "verified": true, "helpfulness": "1/4", "author": "Martin S. Barnes"}, {"rating": 5.0, "review": "This is exactly what I needed.. It works great.. If you are on the fence about buying it.. Do it! It's worth the money...", "verified": true, "helpfulness": "1/1", "author": "Michael Cooper"}]