[{"rating": 5.0, "review": "Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Lisa Elgabry"}, {"rating": 5.0, "review": "cool.  turned my \"dumb\" tv into a \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "Happy mommy"}, {"rating": 5.0, "review": "Once I figure out how to set it up I'm sure I'll love it", "verified": true, "helpfulness": "0/0", "author": "rebecca blon"}, {"rating": 4.0, "review": "To start with I was in need of a TV. But smart TVs were costing approx. $150 more than their usual counter-parts with the same configurations. So, it made good sense to save the $150 and purchase this at $35. The device works extremely well and makes my TV experience very comfortable. The streaming is flawless (but for you to know, my internet speed is above 50Mbps). Most of the major iOS and Android apps have support for chromecast, so there is very little limitation for the application of this device.One thing I noticed though, the casting is sometimes erroneous when done from my chrome browser (maybe that's why it says \"beta\" version) and it's been a pain from my wife's iPhone 6. Using the iPhone to cast something and then trying to change the source after a while seems to fail most attempts. None of this happens with my Galaxy Note 2 device, it works like a charm.Maybe the Google Chromecast and the Apple iPhone share a love-hate relationship :)Finally, the device is total worth buying.....", "verified": true, "helpfulness": "0/0", "author": "Sahil"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Susan B."}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "chris spafford"}, {"rating": 1.0, "review": "Great idea, poor execution. Struggles to connect to phones or iPads. Often won't stop or pause when you need it to. Loses connection to the app that is streaming to it constantly.", "verified": true, "helpfulness": "0/0", "author": "K. Crowe \"Informationatrix\""}, {"rating": 5.0, "review": "Very good product. Very premium.", "verified": true, "helpfulness": "0/0", "author": "Tiago V."}, {"rating": 5.0, "review": "One of the best things that I bought", "verified": true, "helpfulness": "0/0", "author": "Meshal"}, {"rating": 4.0, "review": "Arrived quickly and works great.Pro's:-Easy to use-Works with any tab in Google Chrome and has good functionality with sites like YouTube-Cheap-Works off WiFiCon's:-Has problems with non-mp4 video files on certain sites (they are choppy even if fully loaded)-Sometimes you have to cast Netflix twice because of a weird bug-Eats up a TON of bandwidth. We cannot download or play games on any other systems while someone is casting.", "verified": true, "helpfulness": "0/0", "author": "Webbster"}]