[{"rating": 3.0, "review": "Amazon Fire is great, but be aware... Amazon Prime service that represents a huge differentiator of the product DOESN’T work in Brazil!!I was going to buy 2 more devices, but with this blocker I don’t see any other benefit comparing to Apple TV.", "verified": true, "helpfulness": "2/3", "author": "Ricardo Nobile"}, {"rating": 5.0, "review": "NICE, VOICE COMMANDS ARE SUPER! VERY HAPPY.", "verified": true, "helpfulness": "0/0", "author": "Dennis Patrick Smith"}, {"rating": 4.0, "review": "I had read quite a few reviews for this product before I purchased it.  While the content is great, the menu is great, and it's easy to use, my biggest complaint is that I get quite a bit of buffering.  There's a decent Wi-Fi signal so I am not sure what the problem is.", "verified": true, "helpfulness": "0/0", "author": "Double G"}, {"rating": 2.0, "review": "I am returning it.  The movies available are outdated and selections are poor", "verified": true, "helpfulness": "1/4", "author": "Roberta"}, {"rating": 5.0, "review": "Everything I expected and more", "verified": true, "helpfulness": "0/0", "author": "Outrageous"}, {"rating": 5.0, "review": "Love this fire TV, very fast and menu system smooth and very easy to understand. I own a Roku box also and this is a better device. This has plenty of apps to watch movies, TV shows and play games.", "verified": true, "helpfulness": "0/0", "author": "coffey"}, {"rating": 5.0, "review": "Fire TV is awesome. I always have something on my watch list just waiting for me to get the time to watch it. The voice search works amazingly well, that surprised me. Sometimes those types of things are not as advertised.", "verified": true, "helpfulness": "0/0", "author": "Larry Chartier"}, {"rating": 5.0, "review": "Works really wel and fast", "verified": true, "helpfulness": "0/0", "author": "Customer H"}, {"rating": 5.0, "review": "Fast downloading", "verified": true, "helpfulness": "0/0", "author": "John N Nash"}, {"rating": 5.0, "review": "Set up was straightforward and the remote is easy to use.  Voice control is very convemient.  Access to Amaazon Prime video library is impressive.", "verified": true, "helpfulness": "0/0", "author": "anne"}]