[{"rating": 5.0, "review": "awesome value", "verified": true, "helpfulness": "0/0", "author": "Real Help"}, {"rating": 5.0, "review": "Best device to have and for the price its a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 2.0, "review": "It woorks very well for a couple of hours but overheats and stops working, until you unplug it and cools down, I bought two units and both have the same problem", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 3.0, "review": "This is only as good as the network of devices and software you have in combination with it.  If you have a smart phone a tablet and a TV you are only half way there.  You will then need to figure out the applications that work well with this device.YouTube is okay, but it could be more user friendlyIt is actually pretty good at surfing the webIf you are an Amazon Prime member forget this even exists because Amazon doesn't allow you to use it with its video media and other content because it competes with Amazon's Fire StickBasically be ready and willing to adjust to a new method for operating in apps. And do not let me scare you because this is a great step in a new direction and there are plenty of overlapping applications - just not extremely intuitive yet.  I say that because this is not something I would give to my parents who are still figuring out smart phones.", "verified": false, "helpfulness": "0/0", "author": "Nick Fav"}, {"rating": 5.0, "review": "Of cause, very good reliable product. My second buy.", "verified": true, "helpfulness": "0/0", "author": "Wei Chen"}, {"rating": 2.0, "review": "Does not work half the time. A waste of money.", "verified": true, "helpfulness": "0/0", "author": "Genevieve Eirich"}, {"rating": 2.0, "review": "I cant cast my laptop screen on my TV also i can't attach movie subtitle to cast on my tv :( But it's good only for using youtube ..also i can't use HBOgo in UAE", "verified": true, "helpfulness": "0/0", "author": "Amr Ahmed Hossni"}, {"rating": 1.0, "review": "Good thing I bought 2.  One died at 5 weeks old 2 uses. CANNOT return or exchange it seems after 4 weeks.  BS!", "verified": true, "helpfulness": "0/0", "author": "Robert S Hamilton"}, {"rating": 5.0, "review": "I was looking for device that can play web video from various sites. Chromecast  tab casting was interesting but it lags. Later I found several apps on android and  PC (plugins for chrome browser) which seamlessly cast any video.  This is the best option for web videos.", "verified": true, "helpfulness": "1/1", "author": "Raj S"}, {"rating": 5.0, "review": "Great product!  If you don't have a Smart TV this will allow you to use go to Netflix or other similar sites without plugging the computer up to your TV.  Even if you have a Smart TV (like we do) it is very useful.  We have movies saved to our hard drive and used to have to plug the TV up to the computer to play them.  Then if we wanted to pause or rewind we would have to go over to the computer and then the popups were a whole other problem.  This allows us to remotely play the movies from our tablet, computer, or phone.  Love it!  The price is great too.  Similar items like the Roku are much more expensive.", "verified": true, "helpfulness": "0/0", "author": "Angela Smith"}]