[{"rating": 5.0, "review": "Love it! works great! Easy to set up! My kids  are now mainly watching the Fire TV and not cable.", "verified": true, "helpfulness": "1/1", "author": "asmond ambursley"}, {"rating": 5.0, "review": "I asked my local computer club how I could learn about streaming. The technical gobbledygook discouraged me until I saw Amazon Fire in a TV ad. Like most things from Amazon it is idiot-proof. Combine it with Netflix and you'll double your TV=watching which will lower your IQ an appropriate amount.", "verified": true, "helpfulness": "1/1", "author": "James S. Doyle \"Jim\""}, {"rating": 5.0, "review": "Worked very well right out of the box. No installation problems or issues.", "verified": true, "helpfulness": "1/1", "author": "CHARLES J. BAILEY"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 5.0, "review": "Exceeds my expectations by alot, the fire tv and prime membership are a bargain. Also plan to get a game controller for this device.", "verified": true, "helpfulness": "1/1", "author": "John C. Uhles"}, {"rating": 5.0, "review": "That ****** is awesome.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing streaming box.  Upgraded from Firestick TV and it will run Plex significantly better", "verified": true, "helpfulness": "1/1", "author": "Randy S Hyder"}, {"rating": 4.0, "review": "Very pleased with ease of set up and the fact the product came already loaded with my Prime Account.  The voice activated remote works great and makes finding everything much easier.  Great way to stream movies and shows on my big screen TV. Very happy with Amazon Fire TV. Thanks.", "verified": true, "helpfulness": "0/0", "author": "EA Poe"}, {"rating": 5.0, "review": "This system has opened up a whole world of shows that I have wanted to see! I don't have HBO or STARZ on my Verizon account -- so I can now watch movies I love! Currently starting with Season 1 Episode 1 of Downton Abbey since I missed so many segments -- WOW! What a well-written and fascinating series!", "verified": true, "helpfulness": "1/1", "author": "Bonnie Derbyshre"}, {"rating": 2.0, "review": "I now have no trouble with staying connected, and my pictures are much better.  But, I am not finding as many choices for movies as I had on Netflix.", "verified": true, "helpfulness": "0/1", "author": "Anne Vanoni"}]