[{"rating": 5.0, "review": "Use this on my TV in my work out room, bedroom and living room! I use it to serve media via PLEX from my DROBO 5n unit connected to my network. Works wonders for me and helps prevent wire mess everywhere!Recently ordered a couple of these for my parents, they need my help to get more tech savvy and this is a great approach!!", "verified": true, "helpfulness": "0/0", "author": "limited360"}, {"rating": 2.0, "review": "I would like Google chromecast to have an actual remote rather than use my tablet or laptop. The chromecast often loses internet connection and doesn't continuously stream as if Netflix was running on the laptop. I don't like it as much as my Neotv.", "verified": true, "helpfulness": "0/0", "author": "Lilre1 \"Lilre1\""}, {"rating": 2.0, "review": "A simple streamer like roku but roku is better because it has a ton of apps, google only has 3-4 apps.", "verified": false, "helpfulness": "0/0", "author": "Kaalow"}, {"rating": 4.0, "review": "This is a nice machine for use whith my telephone. I haven't problems to use when I wath \"YOUTUBE\" programs.", "verified": true, "helpfulness": "0/0", "author": "Enrique Ramírez"}, {"rating": 2.0, "review": "I debated getting one of these, but finally broke down and did it. Sorry I did.It can stream Netflix, Hulu+ and Pandora to the TV from another device. Whoopee! I can do that from the blu-ray player downstairs. I can do that from the Rokus I have in every room. I can send pictures across the room. I can play music that I have on one of my Android devices via the Chromecast.Why do I want to send pictures and music to my TV? The answer: I don't.What those don't do, and I wanted to do, was stream movies from my Android netbook (a homemade affair) that has tons of storage space. I can't. Period. I've tried nearly every app out there I can find. They either crash, do nothing or pretend to start streaming and never actually do it. I don't blame those apps. I blame the device. I blame the design of a device that won't let me send movies from a device I own to another one I own.To make sure the problem wasn't the netbook I made, I tried from my phone and my tablet. No workee. Same as the netbook.Get something useful if you're looking around. Get a Roku. It does the same thing and a lot more. There are even apps for Android devices (maybe iOS devices, too) that will let you use you handheld device as a remote for the Roku.", "verified": true, "helpfulness": "1/2", "author": "Alan Brady"}, {"rating": 4.0, "review": "Love it for sending something from Netflix, or any web page. Unfortunately I thought I would be able to cast my photos from my computer, as well a my work pages to have a second screen. Or even cast what I was playing from DVD - NOT. Disappointed in that part. Chromecast advertising is misleading.", "verified": true, "helpfulness": "0/0", "author": "Mark Schaller"}, {"rating": 5.0, "review": "I use the CHROMECAST to stream  videos for my wife cooking recipes , it works like a charm , I am thinking to buy another for me.", "verified": true, "helpfulness": "0/1", "author": "kajoad05"}, {"rating": 1.0, "review": "If you are trying to use this with an iphone don't even bother using it as it will constantly disconnect and not even get through one movie.  Also there is no support unless you are using an android device.  Total waste of money.", "verified": false, "helpfulness": "1/2", "author": "Rodney K."}, {"rating": 1.0, "review": "I had some problems setting it up and the Google support staff was not helpful.  I eventually figured it out myself.", "verified": true, "helpfulness": "1/3", "author": "Joel Kolko"}, {"rating": 1.0, "review": "Save your money and buy a roko!I thought this would just pick up the wifi in my house. Very in convenient.", "verified": true, "helpfulness": "1/3", "author": "Gregory Chetwynd"}]