[{"rating": 4.0, "review": "It is what it says. Im using it to stream movies to an older tv and am looking fwd to doing more with it", "verified": true, "helpfulness": "0/0", "author": "micheal keefe"}, {"rating": 4.0, "review": "My wife and I love this product. We're senior citizens and enjoy streaming from our I-pad and laptop. No more messing around with HDMI cables. This is Great ! ! !CO", "verified": true, "helpfulness": "0/0", "author": "Cotto"}, {"rating": 5.0, "review": "Streaming Netflix and TV shows using chromecast is so much cheaper than having to pay $150 a month for direct tv. We don't even miss having the other.", "verified": true, "helpfulness": "1/1", "author": "Charlene Bost"}, {"rating": 5.0, "review": "We now have one of these in all of our televisions because it makes it so easy to watch Netflix.  Great value for the price!", "verified": true, "helpfulness": "0/0", "author": "DarMar"}, {"rating": 4.0, "review": "Great picture and sound quality, easy to use.  Only two issues.  The audio is missing at times and changing hdmi ports seems to be the solution.  The other is time for Apple and Google to  allow for more apps to mirror.", "verified": true, "helpfulness": "0/0", "author": "Ken Helvey"}, {"rating": 5.0, "review": "Love it, I now have a smart TV. Google does it again with Chromcast. You can use all your favorite movie apps like Hulu, Netflix, Youtube and HBO by using your phone as a remote control... Genius!", "verified": true, "helpfulness": "0/0", "author": "Alexis Luis"}, {"rating": 5.0, "review": "Great product. Don't know what I did without google cast. Works with google chrome app so you can cast webpages to your TV.", "verified": true, "helpfulness": "0/0", "author": "Dustin Randall"}, {"rating": 3.0, "review": "The Google Chromecast easily installed on my Apple iPad and it's great to watch \"You Tube\" videos but I was hoping that it would allow streaming of videos from network web sites.  I can watch old issues of TV shows on my iPad but was thinking it would be great to be able to stream them to our larger television.  Well, you can't do that.  Hopefully in the future the networks and Google will come to an agreement to allow that.  It can't take that much of a change in software to make that work.  The Chromecast is a great idea with a fantastic price but for me it needs more applications!  One other complaint.  Please tell us what's in the box.  I thought I would need an HDMI cable so bought one at the same time I bought the Chromecast.  You don't need additional cables!  I can't send it back because postage is more than the cost of the cable.  Come on Amazon, let us know what comes in the box!", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 4.0, "review": "Overall it's a good product. I'm just waiting for new apps after the SDK release so I could stream my media from my laptop too!", "verified": true, "helpfulness": "0/0", "author": "Dren"}, {"rating": 4.0, "review": "good quality that really works as promised ,been using it for the past couple of weeks and really enjoying it .", "verified": true, "helpfulness": "0/0", "author": "Tarek Sakr"}]