[{"rating": 5.0, "review": "This exceeded my expectations it's like I have cable TV in my room now.  Incredible", "verified": true, "helpfulness": "0/0", "author": "CarolinaFats"}, {"rating": 5.0, "review": "Thank You, Great for Netflix", "verified": true, "helpfulness": "0/0", "author": "R. Anzaldi \"dragon\""}, {"rating": 3.0, "review": "The Fire TV was very easy to set up.  We did have some trouble opening the remote to add the batteries, but a google search confirmed how we thought it should work (we thought we would break it if we pushed too hard).  My dissatisfaction is with the voice command feature.  I asked for movies such as \"Hunger Games,\" then \"The Hunger Games\" and it typed back what I said perfectly and then said the search produced no results.  I got no results on several movies that were on Amazon's offerings.  Also, I would hope that Amazon would create a \"free movie\" list area so that we could look through those without having to search each movie separately to see if it's free or not.", "verified": true, "helpfulness": "1/2", "author": "Lois Smith"}, {"rating": 3.0, "review": "I like the fire tv however we have a fire stick as well and i cannot tell a big difference between the two. If i had to do it again i would have just bought a second fire stick. Also, the first fire tv send was dead, Amazon overnighted another one to me.", "verified": true, "helpfulness": "1/1", "author": "Aaron S."}, {"rating": 5.0, "review": "Nice faster download", "verified": true, "helpfulness": "0/0", "author": "David Johnson"}, {"rating": 4.0, "review": "Advertising a little misleading. I was thinking this was just like a flash drive but you must have constant power to this. Am using this as a travel option and outlets are sometimes no whre to be had in hotel rooms or a laptop configuration. But happy so far.", "verified": true, "helpfulness": "1/2", "author": "John OBrien"}, {"rating": 5.0, "review": "We love our Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "MAGGIE"}, {"rating": 5.0, "review": "I bought this to replace a Fire TV Stick. We were unsatisfied with the performance of the WWE Network via the Stick. It would stutter, pause, buffer, and then it stopped bringing up the app altogether. So I sold the Stick.But I really liked the Fire TV interface. We have multiple Roku boxes and sticks in the house...I liked the Fire TV interface better, and since this was going in my room, this is what I wanted.The Fire TV box was easy to set up, and we have had ZERO problems with the WWE Network. Never an issue! Runs Netflix fine, too, plays Amazon music and video just fine. Overall, no complaints at all about this device. It works just as well as my husband's Roku 3, actually better, I think.I haven't tried to play any games on it yet, but I will. Looks like fun.You do have to provide your own HDMI cord for this box. I recommend one sold here on Amazon: Twisted Veins (3 ft) High Speed HDMI Cable. We have two of those cables in the house, now. Really nice.", "verified": true, "helpfulness": "1/1", "author": "bookloveranne \"booklover6\""}, {"rating": 5.0, "review": "I love it alot grat selection", "verified": true, "helpfulness": "0/0", "author": "Lillie Clary"}, {"rating": 5.0, "review": "so far so so good", "verified": true, "helpfulness": "0/1", "author": "Joseph S."}]