[{"rating": 2.0, "review": "This item doesn't work well at all. We have only been able to get it working twice, and even then it freezes a lot. It's cheap, but you're better off with an Apple tv.", "verified": true, "helpfulness": "0/1", "author": "Katherine C Artibee"}, {"rating": 2.0, "review": "Only thing I can get this to do on my galaxy s4 Active is cast you tube, no cast in options, ive read this is a big problem, means I cant cast video or pictures, not tried the netflix ect, limited data, wouldn't buy again", "verified": true, "helpfulness": "0/0", "author": "Karen T. Evans"}, {"rating": 4.0, "review": "works as expected", "verified": true, "helpfulness": "0/0", "author": "Kurt KC"}, {"rating": 5.0, "review": "Need more play time with chromecast, I love throwing videos from my iPad.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Great Product....link up easy...with YouTube play lists we now havendless music videos plusBuy the USB cord", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Matador\""}, {"rating": 5.0, "review": "The only streaming service not supported now is Amazon's.  This is really sad because I have 3 Chromecast devices but all of my content is on Amazon Prime Instant Videos.  We will continue to use 1 of these for NetFlix but Smart TVs + the Amazon Fire Stick will most likely replace my Chromecast devices.", "verified": true, "helpfulness": "0/0", "author": "P. E. Raney"}, {"rating": 5.0, "review": "its awesome works great and easy to hook up just a few minutes and your watching your favorite movie or show", "verified": true, "helpfulness": "0/0", "author": "candy clark"}, {"rating": 1.0, "review": "I spent an hour and a half getting it connected. It would not play to the TV even though Netflix and Hulu showed the Chromecast device; kept switching back to my iPhone 6 plus. I bought it so that I could dump my crummy cable TV/Internet provider but I couldn't use the Chromecast device and my hotspot simultaneously (I needed WiFi and internet). To make it work, I ended up using my iPhone for the hotspot and my iPad for the Chromecast app. Everything finally connected correctly but could not get Netflix on my iPad to play to my TV. Cludge and no workie -- I wound up ordering Apple TV v3.", "verified": true, "helpfulness": "0/0", "author": "hm"}, {"rating": 5.0, "review": "Love it... it was delivered on time, and I have been faithfully using it daily!", "verified": true, "helpfulness": "0/0", "author": "Mario Hicks"}, {"rating": 5.0, "review": "I'm a big fan of this product! I just bought a smart tv with apps but still use the chromecast bc its easier to use than my new tv remote. Plus, i like being abke to stream straight from my smart phone. I got it for a great price during cyber monday, and shipping was fast.", "verified": true, "helpfulness": "0/0", "author": "Narissa Ramlogan"}]