[{"rating": 5.0, "review": "If you don't need to see it right now this is the best pay once and enjoy for a life time", "verified": true, "helpfulness": "0/0", "author": "Marilyn Kendrick"}, {"rating": 4.0, "review": "The ability to use voice commands is ingenious!  Very simple to use remote is very intuitive.  If it had a DVD player it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "KJOApex \"Ken Osborne\""}, {"rating": 5.0, "review": "Amazon Fire TV is the best set top box yet!  Fast quad core processor.  Brilliant HD.  Customizable!  Easy to use!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Suzanne L. Harris"}, {"rating": 5.0, "review": "The product looks great seems great till you try to turn it on and get connected. I typed in my network password no less than 12 times and it fails to connect. The light in the front flashes orange and nothing happens. What I could find for product support says to go to home screen and activate wifi. The system goes right to scanning available networks and you can push the home button till you are blue in the face and it won't take you there. I'm an experienced network and computer individual so I know what I am doing. At this point I don't know if the unit is defective or there's some glitch. With the lack of product support for problems I'm not sure this was a wise investment.The light strangely went from flashing orange to Orange and white. I put in the password and it connected. This was within 24 hours of two emails from Amazon support. Makes ya wonder but it'sworking nicely now.", "verified": true, "helpfulness": "5/8", "author": "creed"}, {"rating": 2.0, "review": "I have returned my second unit and still the Wi-fi is unusable. My Visio and Sony units work OK on my network with Amazon Prime content. The unit is functional on Ethernet, but it is not available in the location I need it in. Tested it against the Sony in the same location and it takes about 5 minutes to load 10 seconds of video.", "verified": true, "helpfulness": "1/2", "author": "John H. Shields \"Johno\""}, {"rating": 5.0, "review": "Prime is literally one day shipping when selected so pretty surprised at that. The fire TV seems to be a powerful little unit and has shown that when put against the Roku it replaced.", "verified": true, "helpfulness": "0/0", "author": "Etroze"}, {"rating": 3.0, "review": "The specs are great and it works well but there aren't  enough apps ready and available to make it is good as my Roku. You shouldn't have to buy an app to stream things from your PC to the fire TV.  I have tried sideloading multiple apps for android and only a few work. It would be nice if it came with a compatible browser and you could watch videos from the Internet on that browser.", "verified": true, "helpfulness": "1/1", "author": "CHRISTOPHER T ALLAMON"}, {"rating": 4.0, "review": "I think that amazon fire TV is amazing! It is really worth the purchase of you have amazon prime or if you have a lot of cash to spare. It has a great variety of movies and it has all the new popular ones. But.... I think that a lot of the movies are overpriced just for one view. I could go to a movie rental store and save on many of the movies. Another thing that I think could be improved is that they could make more movies rentable. Many of the movies that I want to watch are not rentable yet. I think that if amazon kept adding movies and made the prices competitive with movie rental stores then they would have a fabulous product that would be in everyone's home. I would recommend this product to everyone because its a great product now and I can only see it getting better.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "As long as you dont mind giving up a lot of the shows you love to watch. I bought this as a possible cheaper alternative to the high cost of viewing television. Several of the shows I normally watch can be found and I can view them the day after they normally air but others (most of Syfy, Discovery and a few others) are only viewed on line (which you will still need a listed cable provider to watch) or can be purchased per episode or by season with some seasons only being purchased once all episodes have aired. I have Amazon prime, hulu plus and netflicks along with a few other apps and have to switch between them to watch certain shows, but thats ok I guess.", "verified": true, "helpfulness": "0/0", "author": "James B."}, {"rating": 4.0, "review": "This is a quick unit. Faster than Apple TV OR Roku. Easy hookup. Works as expected.I would have given it a 5 but it is hard to know what content is included in the Prime account. You must press other options to see if you need to buy or it is free. I was somewhat displeased that no free Prime content was available until I stumbled upon this selection. Prime should be front and center or at least an option for search and display.", "verified": true, "helpfulness": "0/0", "author": "DerechBenNoach"}]