[{"rating": 4.0, "review": "Works great but needs more \"channels\" and options ..Its a great start and hope to continue to add viewing options.", "verified": true, "helpfulness": "0/0", "author": "Kola"}, {"rating": 5.0, "review": "Even though it doesn't have as many apps as Apple tv. It is a great option if you have a pc. Happy with my purchase hoping that google gets more apps in the near future.", "verified": true, "helpfulness": "0/0", "author": "O. Criollo"}, {"rating": 5.0, "review": "The main reason I bought Google chromecast is to stream audio (google music) from my phone to my receiver. I looked into a  lot of bluetooth audio receivers to wirelessly stream music from my phone or laptop to my receiver {onkyo 809}. I even bought Onkyo UB1 bluetooth accessory for this purpose but it did not work as it only for 2012+ receivers.Looked into Chromecast and it suits me perfectly. I have attached it to my receiver input and works fantastically. No need to worry about steaming(or casting) quality. Youtube also works without any hassles in full HD. Chrome tab casting also works fine.I tried local streaming with plex media server. Good to avoid it as it is very slow with lot of  buffering with 720p video though may work ok with audio. It is better to do local streaming with WDTV or similar device.I think if you know the purpose device serve it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "addm"}, {"rating": 4.0, "review": "I got this gadget to display websites on my computer directly onto my large tv.  It also allows Netflix and other video sites to stream to your tv.", "verified": true, "helpfulness": "0/0", "author": "Charles Berry"}, {"rating": 2.0, "review": "kinda works, but it seems only good for watching youtube stuff.The ROKU LT which is about $10 more is much better", "verified": true, "helpfulness": "0/0", "author": "Ian H \"Ian\""}, {"rating": 5.0, "review": "I really like the Chromecast. Yes, it's currently still in beta stage, but I truly do think it has some great potential. We just have internet at our house and a Roku 3. The Chromecast will add to what we have. I have had no issues whatsoever using it both with my Android phone and a Windows 8 PC. You can now watch all those YouTube videos that could only be viewed online. Even though it's compatible with the huluPLUS app, you can now watch all those movies that are only available for online viewing right on your TV. Had no problems with Netflix but we will use the Roku for that. Soundcloud sounds wonderful on the TV. And for $35, it's a bargain. Don't be disappointed that only a few apps are compatible right now, that will change. Plus, casting from a PC adds a ton of stuff you can now watch on your TV. At the moment, the only Chromebook it is compatible with is the Pixel. Hopefully, more Chromebooks will be added. Overall, I am extremely happy with Chromecast and can't wait for more sites and apps to \"sync up\" with it. I strongly encourage you to contact all the developers of your favorite sites and apps and encourage them to make their product usable with Chromecast.Update: I swear this just happened: immediately after posting this review, I just happened to notice my Acer Chromebook has the casting extension now. This must have just happened very recently. Well, that makes me extremely happy and even a bigger fan of the Chromecast.2nd update: One great feature of my Acer Chromebook is that it updates itself. The Chromecast extension was automatically added. After playing with it for awhile, I have noticed that when viewing casting a video from the browser, the video is very laggy and unwatchable. Hopefully this is something Google will fix. YouTube and Netflix work great but you need to use the casting feature within the video player itself. When I did this, I had no issues other than I couldn't pause or stop the video  playing on Netflix...I had to just stop casting entirely. I did cast from within the browser while on Soundcloud and Google Music. Not really any issues there. The only glitches I experienced was when I opened another browser window just to view while casting. Soundcloud did stop but started right up again when I recasted it. Overall, I'm still happy with the Chromecast and can work around its limitations on my Chromebook.", "verified": true, "helpfulness": "1/1", "author": "John B."}, {"rating": 5.0, "review": "While awaiting the arrival of my Chromecast, I read all the reviews.  I had almost decided to return it without opening, but thank goodness, I didn't.  It works perfectly.  Picture me, lazing back in my recliner with a beautiful, full screen picture with closed captioning so easy to read and being easily controlled by my Acer A200 android tablet.  I can't believe the picture quality compared to receiving off Dish through my DVR.  I need both CC and earphones....my earphones won't work through the tablet but come through the TV, so I just plugged in my headphones in the TV and I'm all set.  Here's hoping everyone else likes it, also.  It was easy to set up ... I followed directions that came on the screen...I already had Netflix streaming plan...so after allowing the updates, downloads, finding the WiFi, etc....I just used my tablet to go to Netflix and to my Wish List and up in the corner, pressed on the screen symbol.  The choice of how to watch came on the screen and I chose Chromecast.  I'm thrilled with the product and the packaging it arrived in.  Very nice for only $35.", "verified": true, "helpfulness": "0/0", "author": "Brun Hilda \"Brun Hilda\""}, {"rating": 1.0, "review": "maybe I just don't know how it works. Can't find any place to plug it in the t.v.. need help.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer \"LawGirl\""}, {"rating": 1.0, "review": "I find the irony agonizing, that the \"chromecast\" doesn't actually cast a chrome browser.  Basically, it just gives you access to hulu and Netflix.  This has a long way to go to be of any use.  I was hoping to free up my chromebook by using the chromecast to access my web content.  Nope.  Silly Google.  What were you thinking?  I mean I love you guys, but this was a flop or at best a missed opportunity for something really cool.", "verified": true, "helpfulness": "1/2", "author": "LR Alias \"LR Alias\""}, {"rating": 5.0, "review": "This is a fabulous piece of technology for a great price. Jump on this deal now, because it is only going to improve. If Google can get a better deal going with Apple the sky is the limit. Even as it stands now the streaming from iPad or iPhone to TV via Netflix or YouTube is pretty great. We have also used this product with my husband' s laptop and it worked great.", "verified": true, "helpfulness": "0/0", "author": "Justus Hunter"}]