[{"rating": 5.0, "review": "I love it, let me make a quick list of cons and pros, which I will try to explain in more detail below. Also remembering that some of these things may change in future updates to the software.CONS:-Hulu and Netflix are clunky/not well integrated/freeze the fireTV-Had difficulty connecting to my amazon music-YouTube to phone connection does not work at crashes my youtube app on fire and phone-Remote is easy to losePROS:-Lightning fast within Amazon content-Easy general set-up-Voice search always understands meSo the bad. Hulu and Netflix apps kind of suck. I have a Roku3 and an X-Box 360 which both load these apps faster and just run better in general.Also, for some reason the music tab, which connects to your amazon music library, just wouldnt connect for me. The fix was going into the settings and deleting the app data. I had a similar problem with Hulu app not logging in and had to delete app data for hulu.When I look at the remote I think it looks cool and it works well, although this is one I might have to give to roku3, since it has a headphone jack for silent viewing. The problem is that the remote is so small and skinny that I lose it 5 times a day.The good is great though. The device does everything you expect it to, and with amazon content it is so easy and blazing fast. I click on a movie or tv show and it starts playing within an instant. I would recommend the fire over the Roku3 unless you want the headphone in remote feature, which works great when your spouse wants to sleep without hearing your media viewing.", "verified": true, "helpfulness": "3/3", "author": "Eric"}, {"rating": 5.0, "review": "I think this is the best Hardware Amazon has ever made.  Fast, simple and streams movies perfectly.", "verified": true, "helpfulness": "0/0", "author": "CR"}, {"rating": 3.0, "review": "Netflix doesnt work on it. I tried calling Amazon fire tv support. They had me try some things I already tried, nothing worked. Im still without Netflix on it. They said they would call back within 48 hours. Havent received a call back for over a week. Good I am a prime member so I can get some prime tv shows and movies anyways, but I would love to use my netfix on it rather than having to hook up my computer to the tv!", "verified": true, "helpfulness": "3/5", "author": "Alexis"}, {"rating": 5.0, "review": "can't wait to hook up... best of all it arrived on my BIRTHDAY...perfect", "verified": true, "helpfulness": "1/2", "author": "B66ks"}, {"rating": 5.0, "review": "I love my fire TV.  Love being able to access my Prime accts and movies.  Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "It's great but, I wish it had Watch ABC,  while browsing Amazon one day a few months ago I saw Amazon was going to add Watch Disney, Disney XD, ABC and ABC Family, they have added 2 out of the 4.  I've had it for 5 months now and it has worked flawlessly, not one problem.  I would have given it 5 stars if it had ABC, ABC Family, DramaFever, and Viki and the ability to add most of the android apps in the Amazon app store.  Then it would be the perfect device for watching TV.", "verified": true, "helpfulness": "2/2", "author": "lsb"}, {"rating": 5.0, "review": "My husband and I all ready own one of the Amazon Fire TV. Because we love it so much I ordered a second one for our second TV last night. Love the ease use of this product.", "verified": true, "helpfulness": "0/0", "author": "Mary C. Anderson"}, {"rating": 5.0, "review": "WOW!!! This is one of the best purchases I have made in a long time. I always had an Apple TV (2nd Gen) and I liked it because it was jail-broken and had XBMC installed. Then a friend of mine purchased this Amazon Fire TV and asked me to install XBMC. The Amazon Fire TV was so good that I just had to order one for me.It is fast, reliable and if you have Amazon Prime and Netflix like me, then you will surely appreciate being able to watch any movie you want for free. Specially if you install XBMC in it (Then you really can watch ANY movie).It is a lot easier to use, the remote control is fantastic. It is 1080p which is a huge plus. You can search for any movie you want just by talking to the remote control. On top of that, you can install other apps and games which is something you cannot do on the apple TV.I just love it!. I'm buying a second one this week in order to have one on my living room as well.", "verified": true, "helpfulness": "2/2", "author": "Daniel Kaz"}, {"rating": 5.0, "review": "Excellent. It would be nice to see a quicker turn around on the selection, but great none the less.", "verified": true, "helpfulness": "0/1", "author": "GreyBird4u"}, {"rating": 5.0, "review": "I bought this for my mom on her 78th birthday. The \"speak your selection\" feature was the kicker.Ease of use was paramount in my decision and this is easy to use. All the streaming devices are pretty much the same…..except Amazon Fire let's you \"Gary Busey\" speak your search into a mic. (GREAT ad campaign, i must say)", "verified": true, "helpfulness": "2/2", "author": "Paps Meer"}]