[{"rating": 4.0, "review": "Great for using in rooms where cable box is not present & for ESPN 3 during March Madness!!", "verified": true, "helpfulness": "1/1", "author": "Jacquelyn N Hutchings"}, {"rating": 4.0, "review": "Only wish Amazon instant video had the option to Chromecast.", "verified": true, "helpfulness": "1/1", "author": "steven garcia"}, {"rating": 4.0, "review": "I love Chromecast. Use it everyday to stream videos. However, when casting a tab from a computer, I needed to upgrade my router due it not being able to handle the download and upload simultaneously. It could be due to the range and the the internal processing power of the router. The other thing was that I have an HDMI Auto Switch. When I plugged it in to that, it no longer worked and was stuck on that HDMI port. I then just plugged it in the back and everything worked well.", "verified": true, "helpfulness": "1/1", "author": "Daniel J Marvin"}, {"rating": 1.0, "review": "NOT GOOD FOR PRESENTATIONS OR EDUCATIONAL / IN SCHOOL USEI bought this to be able to carry around my tablet as I was projecting my presentation to my class.This is not a versatile device and will not work for such diverse uses such as in the classroom.1. It will not connect to thru the school network which has a overriding network security access. There is no troubleshooting materials available as far as we could check to help us configure it. No web articles provide solutions either. You will not find teachers explaining how they use this successfully to present ppts.2. It will not work using a VGA to HDMI converter (the converter chip will not be able to successfull convert the stream to doggle) so if you have a VGA video projector connect and not a HDMI, this device will not workIf it works for you outside the google system, please help us understand how you did it.", "verified": false, "helpfulness": "0/1", "author": "Biz Professor"}, {"rating": 1.0, "review": "did not work as promised.", "verified": true, "helpfulness": "0/1", "author": "Fred Blake"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "John C"}, {"rating": 3.0, "review": "When it plays Amazon Prime,  it will get a 5 star rating.  Until then?  3", "verified": true, "helpfulness": "0/0", "author": "Scott Albert"}, {"rating": 5.0, "review": "Big Fun Fun Fun at a small price!", "verified": true, "helpfulness": "0/0", "author": "KR"}, {"rating": 5.0, "review": "Works well", "verified": false, "helpfulness": "0/0", "author": "Tatiana DEMPS"}, {"rating": 5.0, "review": "easy to install, works well", "verified": true, "helpfulness": "0/0", "author": "Max7777 \"Max7777\""}]