[{"rating": 5.0, "review": "Won't work at hotels requiring wifi password.  Everything else about this device is awesome and will work with more apps soon.", "verified": true, "helpfulness": "1/1", "author": "Dennis Hughes \"early adopter\""}, {"rating": 5.0, "review": "My family absolutely loves having Chromecast installed into our lcd tv.  We can take it anywhere we go that has an HDMI or USB or port.  It would make sense though to have more than just one.  Since we all have different taste in programs.I defiantly recommend this to all my friends and family.", "verified": true, "helpfulness": "0/0", "author": "Nico123104"}, {"rating": 5.0, "review": "Just got mine, extremely easy to set up and is by far the most convenient way to stream web content to your TV. I'm happy to see that hulu plus has now added support for the chromecast, can't wait for more apps to catch on.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "This is the best way to play YouTube videos on your TV, which I think is a huge advantage. It has Netflix too, which is great, though I have a Roku so that is of less interest. What is missing is Amazon Instant Video, which is the sole reason I keep my Roku around. Amazon is of course coming out with its own set top box, and I assume Chromecast will get Amazon Instant Video soon enough. THe $35 price point is unbeatable.", "verified": true, "helpfulness": "0/0", "author": "Simit Patel \"InformedTrades\""}, {"rating": 3.0, "review": "I'm using my Chromebook so one would think that things would work smoothly considering that it is also a made by Google.  It keeps on disconnecting if I don't use it for a couple of days and then I have a little trouble getting it reconnected.  It works really well otherwise.  There is no way of shutting it off other then disconnecting it from the tv, which I have done and then when I reconnect it I have to go through the setup procedure again.  Maybe it's the chromebook that is the problem but no matter either way its a bit of a hassle.  But all in all I still think it's worth the money.", "verified": true, "helpfulness": "1/1", "author": "lucky"}, {"rating": 5.0, "review": "As i dont have a SMART tv, this served the purpose of apps for youtube, Netlifx.for other sites its little slow as it has to pull the streaming from the computer. But I liked it.May be google should add more Apps to chromecast.", "verified": true, "helpfulness": "0/0", "author": "Bhaskar Thota"}, {"rating": 2.0, "review": "This device would be great to allow much more freedom of viewing from the internet... it is so limited in it's use, I would rather buy an android device with much more options of what I want to view on my television...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"BGR\""}, {"rating": 5.0, "review": "Very straightforward  to install and use, and I am not a \"techy\".  I've had it for a few weeks. Makes it easy to watch all my Netflix favourites on the big TV screen.", "verified": true, "helpfulness": "0/0", "author": "Roberta"}, {"rating": 5.0, "review": "Great way to watch YouTube and Netflix on the TV. Hoping they add Hulu, Amazon Instant, and Spotify. It was a great gift.", "verified": true, "helpfulness": "0/0", "author": "Sajidah Marwat-Khan"}, {"rating": 5.0, "review": "I was paying for xbox live to watch Netflix. This little gem of awesomeness is saving me nearly $80/year plus the experience is so much better. Picture quality is better, they load faster and the Netflix Android app is easier to use than the xbox one. This is aunt have device.", "verified": true, "helpfulness": "0/0", "author": "mysticdroid"}]