[{"rating": 5.0, "review": "My family is using this regularly with great success. Even the luddites are comfortable! And transferring from the little screen to the TV is quite helpful.", "verified": true, "helpfulness": "0/0", "author": "Myron Thornberry \"MDT\""}, {"rating": 5.0, "review": "I was hooked on this thing the first time I used it so I thought I would wait a while to review it just in case it wasn't as good as I first thought.  I have had it for 3 or 4 weeks now and I like it even more.I'm not sure what to say for those saying they had a difficult time setting it up or were unable too.  The most difficult thing about the set up for me was getting it out of the box!  The rest of the set up process was so easy it was almost scary.  Especially how fast it found and was able to communicate over my secured wi-fi.  Downloading and installing updates, which it did automatically, was the most time consuming part of the process.  About 2 minutes after that was done, I was casting a TV episode from a network website.  Excellent picture quality.  I used our 3 year old Windows 7 laptop initially.  I have noticed, especially with older shows (non-HD) that there is some  delay between the audio and video using that computer at times.  I tried the same show (Star Trek: Deep Space Nine from Hulu) on my Android phone and there was no delay at all.  So, it is likely just something with that laptop as the delay seems to come and go when I use it but I never experience it from my Android device.The only thing missing at this point that would probably cause some people to complain is the ability to watch live sports over it given the restrictions on sports broadcasts.  This is not a big enough problem for me to continue paying DirecTV a monthly fee for a bunch of channels I don't want.  They will be going away before the next bill is due.  I have an antenna ordered to pick up local broadcast stations for sports.  We'll see if it is as good as the Chromecast!", "verified": true, "helpfulness": "0/0", "author": "R. B. Farley \"RBF\""}, {"rating": 2.0, "review": "It was okay but not for me if you think this is a cheap product compared to the Apple TV you are correct but let me tell you buy a Apple TV it's not that I hate this device it's just I never would use it as much as a apple tv", "verified": true, "helpfulness": "0/1", "author": "Michael sofia"}, {"rating": 5.0, "review": "This works great for viewing You Tube or anything from my computer on my big screen TV. Price is right also.", "verified": true, "helpfulness": "1/1", "author": "Ted Santos \"doowopted\""}, {"rating": 2.0, "review": "If you want to see everything that is on you phone then this is not the product. I was under the impression that this does just that. HTC has that product, Chromecast only streams certain things. I wanted to show pictures and videos from my phone to everyone in the room without a wire from my phone to the tv.", "verified": true, "helpfulness": "0/1", "author": "KoalaKiller \"Karl Waller\""}, {"rating": 2.0, "review": "I think the chromecast is a great idea but for me it didn't work as I had hoped. I had issues and continue to have issues with being able to connect to it. I have contacted the help line where the technicians were more than helpful. I've had it for a week and continue to have issues, one day it works and the next it doesn't. I was able to watch a netflix movie streamed through an ipod and the next day it wouldn't work. I'm not giving up on the devise but am not impressed on it working for me just yet.", "verified": true, "helpfulness": "0/0", "author": "Trea"}, {"rating": 5.0, "review": "One of the hardest things to endure is the transition and initial expense from having cable/satellite to relying solely on data. There's the cost of the modem, router, and receivers for every room - not to mention the monthly services that must be purchased, such as Netflix and Hulu. The Chromecast softens the blow at only $35, making any TV an internet connected device. Nevermind the bloated proprietary software that comes with modern smart TVs. Just plug this thing in, and off you go!I love it! It is my go-to gift for anyone with a smartphone.", "verified": true, "helpfulness": "0/0", "author": "Fernando C. Jaimes Jr."}, {"rating": 5.0, "review": "For the price you can't beat the Google Chromecast. I've purchased several of them for different TVs and we also use it when on vacation so that we can watch Roku, Netflix, HBO GO etc.", "verified": true, "helpfulness": "0/0", "author": "M. Webber"}, {"rating": 2.0, "review": "I'm a big Google fan and really wanted to like my Chromecast, but ultimately it fell short.Firstly, the selection of \"apps\" that support it stands at about 16.  And some of those require a subscription to use.Secondly, the device requires a Wifi connection on the same network as the device controlling it.  So, it's not a P2P connection as I'd hoped. And despite needing that Wifi connection, it isn't made to work over the Internet (controlling/streaming remotely from a different network).Third,  and my biggest grumble, is that misleading claim that it works with Android device and Chrome browsers to stream browser tabs. Due to the serious lack of supported apps, the Chrome browser casting was what I expected to use the most.  And while it DOES support Android device and desktop Chrome browsers, it DOES NOT support the Chrome browser on an Android device.Fourth, while not a big issue for me, make sure you realize that this dongle needs a power source in addition to the HDMI and wifi connections.  That means a powered USB port on your TV or running the included cable to the nearest wall outlet.Some more advanced \"workarounds\" may diminish some of the above limitations, but there's still a lot to be desired here.On the plus side: It's small, sleek, and easy to use.  And it's cheap.", "verified": true, "helpfulness": "0/0", "author": "J. YZ"}, {"rating": 5.0, "review": "best thing i have used. i highly rec. the Chromecast media player for all your viewing needs from a tablet", "verified": true, "helpfulness": "1/1", "author": "jm \"jm\""}]