[{"rating": 5.0, "review": "Absolutely delighted at the speed it loads the applications (Amazon, Netflix, YouTube, etc); the Menus are well planned and intuitive and the Voice Recognition is again, excellent.  I subscribed to SlingTV and am planning to 'cutting the cord (cable)' in the near future.  Now for two little surprises: Voice Recognition brings up only Amazon hosted movies, don't expect to get Amazon, Netflix, HULU all combined into one response; just Amazon movies.  Next surprise: The ability to play SOME games (Quell, for example) is awesome, but if you want to play Minecraft or other immersive games you'll need to buy the Amazon Game Controller (I added it to my Father's day wishlist).  Overall an excellent device though.", "verified": true, "helpfulness": "1/1", "author": "Sam Dizzy \"AnyKey\""}, {"rating": 4.0, "review": "easy installation", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "camilo gomez"}, {"rating": 1.0, "review": "I have had to replace it on three different occasionsso I don't think very much of it", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Joseph Whitaker"}, {"rating": 4.0, "review": "I have been pleased with this device. It does feel like you can dig a little deeper into Prime video offerings via web browser than you can with this device. I think it is geared more towards setting up a watch list in a browser and then watching it on the device. This is a bit of a let down but if you tend to like the popular shows on TV then you would not have a hard time finding something to watch on the devices \"Featured\" list.", "verified": true, "helpfulness": "0/0", "author": "Josh Reagan"}, {"rating": 5.0, "review": "I do not know how I ever lived without it. Our whole family is enjoying. We are going to order more for the rest of our televisions, and finally dump our cable! Thank you, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Katie S."}, {"rating": 5.0, "review": "Perfect. Easy to install, it does exactly what I wanted it to do - allow me to stream Netflix and Amazon media.", "verified": true, "helpfulness": "0/0", "author": "P. Brewster \"Avidreader\""}, {"rating": 5.0, "review": "Once learning all the features; It ROCKS!!", "verified": true, "helpfulness": "0/0", "author": "D. Hill"}, {"rating": 5.0, "review": "Very convenient and works well, but not enough free movies.  They charge to watch 50-year old movies.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]