[{"rating": 5.0, "review": "Chromecast works great! Smooth performance,  youtube and Netflix videos look great you jist need a good internet connection,  realy hope new app are added to the mix. Recommended!!!!! For this price is almost ridiculous not to get one ;)", "verified": true, "helpfulness": "0/1", "author": "Andres"}, {"rating": 3.0, "review": "I Bought the Chromecast to use when I travel so I could use it with my IPad in my hotel room.  On my last trip, I could not get it to hook up with the hotel wireless network so I couldn't use it.  Disappointing.  Also, it only works with a limited number of streaming services so it does not have the range of use I had hoped.  It does work fine at home.  I will continue to try it when I travel and see if it works better at other hotels.  On the other hand, it did not cost too much so at least I'm not out a large amount of money.", "verified": true, "helpfulness": "4/4", "author": "Michael"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. Fast. Good value.This streams Netflix in HD while my Xbox 360 sitting right next to it will not...For $35 it could have worked half as well and still have been worth it.", "verified": true, "helpfulness": "0/1", "author": "David M"}, {"rating": 4.0, "review": "I used this for streaming YouTube videos from my iPad and Netflix from my laptop. Works really well. Can't wait to see more applications come out!", "verified": true, "helpfulness": "0/1", "author": "Jason S."}, {"rating": 3.0, "review": "I can not use chromecast in my android tablet the same way I can use it in my computer. They need to do some upgrades before I can give 5 star. Not what I expected for my Samsung Tab 2", "verified": true, "helpfulness": "1/2", "author": "chico"}, {"rating": 3.0, "review": "if you only have a desktop computer, don't bother buying this product. We could not get it to connect until we used my son's laptop, then were able to use either. To set it up, you definitely need a laptop,etc.  While the technical people at the company are nice, even they couldn't figure out how to do it with just a desktop, even though we've been members of Netflix for quite awhile.", "verified": true, "helpfulness": "0/1", "author": "Michelle St. John"}, {"rating": 4.0, "review": "The device was able to be setup and active within a few minutes, I was unsure how easy it would be since it has no interface to connect to secure wifi.  Instead I just plugged it in, went to the google link as directed, typed in my wifi password and moments later I was chromecasting.  I docked a star off because it hasn't been as nifty as presented, no issues with netflix which has been clearly supported and developed from the start.  My issue was chromecasting browser stream, for instance watching a tv episode on hulu was failing to stream correctly or at all in full screen.  It would somewhat work in windowed mode but I could just use a hdmi cable to the computer if I wanted that.  There is potential as they tweak and improve the device though so maybe it will be updated and fixed (either driver or browser issue improvements) to get a 5 star bump.I will say that if you just want an easy way to watch netflix on a non \"smart\" hdtv this is a fantastic method.  The pricetag is nice and the setup couldn't be any more simple, the marketing has somewhat hidden the fact that it uses usb power though so be mindful of that.  All images tend to just be of the dongle without power cable attached, it can pull power from a tv usb port or if your model is older simply use the included wall power adapter, the usb power cable is moderately long so it shouldn't be an issue.  The instructions recommend using wall power though I have only used the tv usb port (which is fine).  I am guessing this recommendation for wall power is because usb power has the potential to vary for instance a laptop with many power pulling devices might not have enough \"juice' to properly power another device.Note: another perk of the device is you can get multiple chromecasts for different rooms/tvs and label them to what they are.  Hijacking can happen though, I used it to interrupt my fiance streaming netflix with a youtube love song because I started a second chromecast on a different computer ;)Summary:it's cheap, simple to use and works with pretty much any tablet,phone,laptop or desktop.  As long as they have an app IOS or Android or google chrome they should work.  You just click a button on chrome and it shoots over to the screen.", "verified": true, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 2.0, "review": "After setup and trying chromecast, it lost connection to my wifi network.Google isn't very helpful in their instructions about how to re-connect.It's a catch-22.  You need to connect, in order to connect.Features are limited: Netflix and YouTube.  I can get these via my blu-ray player.Any smart TV has the same capability, and more.I may eventually figure this connection thing out.But, it's not as simple as Google claims.And I really can't afford another time-wasting techie device sucking up my time.Back to my blu-ray player.  No more chromecast.", "verified": false, "helpfulness": "4/5", "author": "Stuart Riley"}, {"rating": 1.0, "review": "Would not connect to my Actiontec GT784WN router. Error help file said to enable UPnP in router, which already was enabled. No other help/support available.  My guess is that ANY Actiontec router connect problem will result in the \"Enable UPnP\" message. I tried for three days to find some kind of support or a way to contact Google on this; no luck.  It's hard to provide support for a $35 piece of hardware.  Darn good idea, too bad it didn't work for me.", "verified": true, "helpfulness": "2/6", "author": "Carol"}, {"rating": 4.0, "review": "I am not sure what is wrong, but the TV no longer recognizes the Chromecast.  The light on the Chromecast was red, I reset and now it is white or flashing white (yes, it is plugged in). I tried rebooting and no luck, still is not playing on the TV.  The laptop thought it was playing - so it is between the chromecast and the TV or router.  If you have a problem you will be hard pressed to find answers online.  It seems pretty simple, \"What does the color of the light signify?\"  I can't find anything but a Google chat page telling you to go to Chrome help which if you go is not very helpful.I will say when it worked it was great, if limited in it's use.  I wanted it to stream Netflix on an extra TV, so for that is was good.  It looks as if this will be going back for a refund.******I wanted to update my review as after much research and blogs and phone calls finally figured out what my problem was.  It was not the Chromecast, it was my TV.  I had been to the Google help page but never got to the customer care numbers, speaking to the representative helped me eliminate things - he didn't have the answer but it helped knowing what it wasn't.  It was my HDMI input settings, I ran across a few lines on a Sony Bravia update page about how after updating you should always reset the HDMI input ports, which was simple, just uplug all ports then uplug tv - wait one minute and restart - turn on and then replug in the devices and it worked!  I am not even use anyone knows you can reset those or even need to, I reset the Chromecase, reset the TV to factory settings and was about to try one last thing a software update when I noticed that little blurb about the HDMI settings.I changed it to 4 stars as it is still rather limited in its uses so not perfect but it does work great for Netflix.", "verified": true, "helpfulness": "1/1", "author": "M. Deane"}]