[{"rating": 5.0, "review": "Wow, I love this .  Cant stop watching this.  I have already downgraded U-verse to basic.", "verified": true, "helpfulness": "0/0", "author": "Scott Alderson"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Stephen R. May"}, {"rating": 5.0, "review": "Best decision I could have made for streaming.. Easy set up and simple to use..", "verified": true, "helpfulness": "0/0", "author": "barbara kane"}, {"rating": 2.0, "review": "The unit itself is nice. Setup is quick. Picture quality is good and onscreen menus are clear. However, this product has a serious drawback IF YOU ARE A COMCAST XFINITY CUSTOMER. Neither the ShowtimeAnytime app nor the soon-to-be-included HBOGo app allow Xfinity customers to authenticate to use the app on Fire TV.The fact is hidden on both the Amazon site and on the Showtime site. Both tout that you can watch ShowtimeAnytime, and that ShowtimeAnytime works on all major service providers. That's not entirely true. While Showtime and HBO apps work fine on mobile devices, on streaming media players like Roku and Fire TV, Comcast users cannot authenticate their subscriptions.Showtime and the news that HBO Go was on its way to Fire TV were the two main reasons I wanted Fire TV. However, without those, buying a wifi Blu-Ray player with on-board apps is actually a better route, so my Fire TV is headed back to Amazon for a full refund.", "verified": true, "helpfulness": "4/5", "author": "Jon G."}, {"rating": 5.0, "review": "I just got my amazon fire tv and it is awesome!  I don't have cable or dish or satellite (refuse to pay the monthly fees) and this is a great alternative to watch tons of shows and movies.  Its really easy to use and Amazon prime offers so many shows.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Russell"}, {"rating": 3.0, "review": "Designed well, easy to use, connects w/o any problems and the Quad-4 processor's speed is very evident. The problem is that it does not see local content at all, obviously, I can't upload 1.8TB of data to the Amazon Cloud Service, thus, it is of limited use, in fact so limited that I can't really use it, it is being returned due to lack of seeing the local content.", "verified": true, "helpfulness": "0/2", "author": "Joe Farkas \"The Transylvanian Terminator\""}, {"rating": 3.0, "review": "the remote  batterys go down like two days I got to get new battterys", "verified": true, "helpfulness": "0/2", "author": "Mike Casey"}, {"rating": 5.0, "review": "love the ability to get amazon tv more easily than using my ipad.", "verified": true, "helpfulness": "0/0", "author": "alldancergirl"}, {"rating": 2.0, "review": "They are tricky and try to fool you into paying for things that come free with Amazon Prime.  Also they let me watch season one of Broadwalk Empire.  Then when they get me hooked on it they want to charge me $3 per episode of season two.  When my annual; subscription is up I won't be renewing.", "verified": true, "helpfulness": "2/4", "author": "Gilbert Deming \"Tiller man\""}, {"rating": 3.0, "review": "The HD on this is amazing. However, be aware that this lovely little gadget will blow your internet usage out of the water. My household went from using 49GB to 600 GB in 2 months.", "verified": true, "helpfulness": "0/0", "author": "Angela Story"}]