[{"rating": 5.0, "review": "First TV box I've had so not much to compare to, but works great. Fast boot up, quick display, voice function is not buggy and works correctly right out of the box. I'm an Apple guy and I'll probably get the updated Apple TV once it comes out but until then this is the best thing out there by far. Menus are easy to navigate and able to quickly access the programming desired. Only flaw on any of these boxes are ability to view current NFL games. For that you need to go to Cable or Sat", "verified": true, "helpfulness": "1/1", "author": "L&DM;"}, {"rating": 5.0, "review": "I'm not computer or electronics savvy so I was pleasantly surprised at how effortless this was to install, setup and use. Made with the highest quality and design, we have been enjoying this device thoroughly and highly recommend it. Good job, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We love it!  Love getting free tv and movie shows. Cartoons could be more cohesive,instead of having to keep pushing play every 8 minutes.", "verified": true, "helpfulness": "0/0", "author": "Ralf Davis \"virabahdra\""}, {"rating": 5.0, "review": "The Fire TV is very intuitive and so easy to use. HD is wonderful. The voice search on Amazon Prime is fantastic. More apps need to be added however and there needs to be a way to stream iTunes library. That probably won't happen so I have to use my apple express to stream.I am very impressed with the Fire TV. I'd highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Glass Onion9 \"mbinsures\""}, {"rating": 4.0, "review": "I do like the FireTV and have recommended to a few friends who have purchased. It was easy to install and is easy to navigate. I am a prime fanatic, so I loved being able to access Prime shows on TV.I was really hoping the Watch ABC or ABC News Apps would be coming to Fire this Summer, but it appears Apple TV got this deal instead, which is disappointing. Hopefully it comes soon....", "verified": true, "helpfulness": "0/0", "author": "Lexi Wolfe"}, {"rating": 4.0, "review": "It works very well, easy set up, works well with my kindle hd, i'm getting my prime membership worth.  The only complains I have is that the HBO shows such as True Blood includes only up to a certain season and not the latest ones which leaves you disappointed.  The interface is not that great neither, I wish it would be more user friendly or just follow the kindle format.  Overall worth the price and the speech recognition is pretty good.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "Replaced a WD Live Plus set top box. Doesn't have DLNA support but I mitigated that by buying and installing Plex and the Plex media server.Only gripe I have with it is no DLNA support, but Hulu / Netflix / Prime Video work very well. Voice search is one of those features that you never knew you needed!", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 2.0, "review": "Once I got it and started searching I realized you had to subscribe to Hulu, Netflix and Prime to get what you can get. On top of that many movies are $14 and more dollars, more than I would pay for them in hard copy. I might be missing something, but I don't plan on keeping it.", "verified": true, "helpfulness": "1/2", "author": "M. Doherty"}, {"rating": 5.0, "review": "We have been very happy.  The only complaint I have is that it would be nice to be able to search by \"free\" Prime content.  The FIRE was easy to set up and it has been reliable and easy to use.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "M. Colwell"}, {"rating": 5.0, "review": "Okay, I am in my 70's, and my husband is in his 80's.  I am the techie in our household, but I have long since fallen off the cutting edge.  This was a gift.  The way that works is that the giver buys it, and it is automatically registered to the giver.  The giver then deregisters it in a simple procedure.  When the recipient installs it, it automatically is registered to the new owner if the new owner has an account.  Since I am a Prime member, that is all that was necessary.  If you have no account with Amazon, I would suggest setting up the account by computer before installingYou will need to have a new TV that has all those fancy plug ins on it.  I have WiFi and a DSL to my computer so I needed to buy an HDMI cable.  If you have a router that requires a wired set up, I don't know how that part goes, but you need a different cable.The instructions are there.  I plugged directly into the TV, and it used my computer wirelessly.The tiny box I plugged in to the TV and to an electric outlet is about the size of a portable hard drive..Once I plugged those items in, I went to my TV remote and went down to the appropriate HDMI choice on it.  The little box came on.  You will need to have your WiFi password and your Amazon account name and password to follow your on screen instructions.  It was very simple, although there are no words on the remote.  You have to deduce that going to different parts of the outer round ring moves the on screen highlights, and pushing the center of it chooses the highlighted area. The remote is black on black so it might be hard for low vision people.  It all worked very smoothly.The really interesting thing was choosing the movie we wanted to see.  We only remembered part of the name and said \"Budapest Hotel\" to the remote.  The screen came up with several choices, one of which was the movie we wanted.  I call that amazing.The movie showed with no pauses waiting for the feed to catch up - another amazing thing.  So far that is all we have done with it, but it seems sort of like magic. I would definitely recommend it to people who have some computer literacy, but you don't need much.As part of the gift we received the instruction book: \"Fire TV Users Manual\" by Steve Weber.  I think that was not included in the FireTV purchase, but rather something the giver added.  BUY IT.  It has nice large easy to read print and tells you everything you can do with the gadget.", "verified": true, "helpfulness": "2/2", "author": "S. R. Schnur \"srschnur\""}]