[{"rating": 5.0, "review": "Loads a movie faster than a Roku, runs well even with my slow DSL. Voice search is a great tool to find a movie or TV show fast. Only thing that I miss is weather capability.", "verified": true, "helpfulness": "0/0", "author": "Gary P."}, {"rating": 5.0, "review": "Very easy to use and I love the easy access to movies and tv shows on amazon prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The only thing I don't like a bout the fire tv is it doesn't have enough memory and you can't connect a external drive .", "verified": true, "helpfulness": "1/1", "author": "Doug Bales"}, {"rating": 5.0, "review": "What I like best is the user friendly interface.The controller is very easy to use to find what you are looking for.The voice search works very well if you pronounce english well :)Box is easy to setup. Plug the power, connect HDMI to your TV, configure which network to connect and thats' it.A must for prime members ! I used to watch Amazon prime stuff via my PC connected to the TV. I can now remove my PC. Less clutter around the TV since this box is very small.I don't need the gamepad yet. I bought this without the gamepad first to check it out.Maybe at later stage I will order one to play games also.Now.. if only prime could come up with more recent movies, then it would be perfect... but that's not a problem of the fire TV of course or is it?", "verified": true, "helpfulness": "1/1", "author": "W.P. Born"}, {"rating": 4.0, "review": "I used it to replace a Roku unit that I moved to another TV. The only thing I do not like about it is after watching a show such as Family guy it will automatically start playing the next show in like 15 seconds. with my Roku I just turned the TV off,  but with amazon fire I have to hit the home button because if not the next show will be playing. Other than that I think it works great.", "verified": true, "helpfulness": "0/0", "author": "jabberwockie"}, {"rating": 4.0, "review": "The hardware and integration with Amazon Prime makes this device the best option for streaming. All the other streaming apps (Netflix, etc) work as we have come to expect from a media device like this, but the addition of Prime really gives it the edge over Roku and others.Unfortunately the Fire TV is still in its early stages of development, so a few features that were promised aren't quite there yet. For music, your only options are to stream from radio sites such as Pandora. If you are the type of person who likes to makes playlists or listen to specific songs, there are no real options at the moment. It has been said that Amazon is working to bring it's MP3 service to this device, but this is still a non-feature as of today. Additionally, the voice search currently only integrates with the Amazon Instant library. There are talks of integrating this with other apps such as Netflix, but due to contracts and the like, it is still down the road.The Fire TV is still the best option out there for streaming movies and TV shows. You get your standard apps (Netflix etc), but the added benefit of complete integration with Amazon Instant and Amazon Prime. The hardware makes it faster, and the instant streaming feature makes everything look smoother than any other streaming device. I highly recommend this device, even if the features you are looking for aren't quite there yet. There is plenty of room for growth, but it is still the best device of its kind out there right now.", "verified": true, "helpfulness": "2/2", "author": "Brandon Rockwell"}, {"rating": 3.0, "review": "There are still some bugs.  The sound does not come on every time.  I have to unplus Fire Tv and replug it in.  You really need to be an Amazon Prime customer to get full benefit of FireTV or not worth it.  On sound, I called tech support and they could not help me.  Told me maybe a fix will come from Amazon but was not sure.  Told me maybe try another tv set (yeah, right - that's easy to replace).  Also, when I put on Pandora the screen saver setting plays through once then the screen goes black.  It should just keep repeating and there are no additional picture libraries.  I like to have music playing in the house all day while I work from home and I thought that would be nice to have with accompanying screen saver but it goes black so I just play off laptop and bluetooth audio system with pandora.  I am still considering returning although I am past 60 days now and not sure Amazon will take back.  I dropped NetFlix and still use RedBox plus my ATT UVerse & HBO subscription mostly.", "verified": true, "helpfulness": "0/0", "author": "Thomas Setaro"}, {"rating": 1.0, "review": "Dead on arrival. Did not work for me at all. Will not update. The people who ship it to me did not do their job. It should have my account preloaded, plug in and update. Now I have to ship it back and get a new one. Very disappointed.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I though I would get a lot more of the shows I like with it a lot of things want you to pay a fee to get them , the Amazon fire works fine it is the media I had a problem with", "verified": true, "helpfulness": "1/1", "author": "Dean A White"}, {"rating": 1.0, "review": "I purchased the Amazon Fire TV because I already had two Roku devices and the only problem with those devices was with the streaming of Hulu. Hulu only recognized one Roku at a time so two different TVs couldn't watch Hulu at the same time. So I purchased the Amazon Fire tv, big disappointment. When it comes to streaming the Fire kept loading, loading, and loading when trying to watch Netflix or Hulu. Streams perfectly fine with Amazon Tv, I guess that's the only program they want you to watch. Problem with that is they don't carry enough free movies and shows like Hulu or Netflix. Also with my Roku I get free streaming to Lifetime, History, A&E; and Vudu which have all my digital movies that I downloaded. I feel Amazon with this device only want you to watch their tv since their channels are limited and the connection to Netflix and Hulu doesn't load properly. To be honest I wish I had spent my $100 on another Roku instead of this device.Update: I haven't had the device a whole year and I went back to my Roku. I was so sick of the fire tv freezing. The picture would freeze in place but the close caption and sound would continue like nothing was wrong. If that wasn't the worst part of it. I love that when HULU played a show and it came back from the ads, you would have a complete black screen, but the sound and close caption was still going normally. I called about this issue four months after having the problem and they wanted to say maybe it was my internet signal. The funny part is that nothing else seem to be affected by the internet signal except by Fire TV. I have since moved that sorry box out of my room and put it into the living room where no one really watches tv, and when my son does goes to watch anything he uses his playstation 4 because he does not want to be bothered.  I really love Amazon but this product is a piece of crap.", "verified": true, "helpfulness": "2/7", "author": "Stacey Askew"}]