[{"rating": 4.0, "review": "Fits our needs. No complaints so far and had been using only for a week or so.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 1.0, "review": "Can never get it to work exactly like they show on television advertisements. The voices are talking but the mouth is moving a second later.Weird, like an old Godzilla movie.", "verified": true, "helpfulness": "0/0", "author": "o2b_moi"}, {"rating": 5.0, "review": "Very install to install. Great fun using it.", "verified": true, "helpfulness": "0/0", "author": "KFG"}, {"rating": 5.0, "review": "I have basic cable which means no HD. However I can watch HD TV online through NBC Sports or HBO. In the past I would have to hook my laptop in through HDMI, but that meant no multi-tasking. Now I can stream through Chromecast to my TV (as a Chrome tab or through the HBO GO phone app). So I get HD TV without paying any extra and I can use my laptop at the same time.", "verified": true, "helpfulness": "1/1", "author": "MidwestSCC.com"}, {"rating": 5.0, "review": "This is my second unit.  Had problems with this one during installation.  Need to get into to the router and remove the guest network in wifi to make this and the old units accessible.  But with more and more apps with Chromecast built in this is great for the price.  The pictures are very good when cast from an app.  But never works well from Google Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Venkata Manian \"Manian\""}, {"rating": 1.0, "review": "Promo didn't explain os needed for it's use.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 3.0, "review": "Device works fine, it has a nice GUI and connects fast with any device that has the cast app. Still very limited with services (you tube, netflix, and few more) Chrome browser cast its only possible through computer or very few selected devices. Wish I could cast my device`s screen, but again just for some devices.", "verified": true, "helpfulness": "0/1", "author": "Marco Durán"}, {"rating": 5.0, "review": "TROUBL FROM THE START", "verified": true, "helpfulness": "0/1", "author": "W. Allen \"Magnum\""}, {"rating": 4.0, "review": "good but waiting for the Google set top box is gonna be better.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "owesome product.  I have netflix and youtube on my tv from my cell!", "verified": true, "helpfulness": "0/1", "author": "Afrodita \"Afrodita\""}]