[{"rating": 5.0, "review": "Works great.  Have even been able to get some local sports games that were not on tv with the watch espn app.", "verified": true, "helpfulness": "1/1", "author": "Justin King"}, {"rating": 3.0, "review": "We're serving overseas with the U.S. Deparment of State, and unfortunately we found out that most of the apps are blocked from overseas iP addresses. The only thing we can use is the Sling Player. This is not good.", "verified": true, "helpfulness": "0/0", "author": "Michelle A"}, {"rating": 5.0, "review": "Greatest thing since the invention of the TV. Unbelievable how perfect it is, its worth getting the internet if you don't have it. Get rid of and cable or satellite you have with the big channel receiver your paying another 5-7 dollars a month for on top of there monthly fees. Amazon fire TV is just this tiny black box with a comfortable non confusing small remote that is so easy to use. We have Amazon prime which gives many advantages for purchases, but with it the added at no extra charge shows and movies are amazing. Amazon prime is about $5.00 a month but we get free 2 day shipping on most items so it pays for itself just on orders, the added kindle book and fire TV stuff puts it over the top the best thing you'll ever do.", "verified": true, "helpfulness": "1/1", "author": "David Wilson"}, {"rating": 4.0, "review": "Easy use and clear picture  sample thanks", "verified": true, "helpfulness": "1/1", "author": "Dung"}, {"rating": 4.0, "review": "Is it free or do u have to set up something to keep buying it to see the shows", "verified": false, "helpfulness": "0/2", "author": "Genevia Hendricks"}, {"rating": 5.0, "review": "Great Product, speedy delivery", "verified": true, "helpfulness": "0/1", "author": "Tammy L. Gill"}, {"rating": 4.0, "review": "It is very good and I love no commercials", "verified": true, "helpfulness": "1/1", "author": "M McMichael-Holveck"}, {"rating": 4.0, "review": "First off, let me say that I am glad I bought the Amazon Fire TV and think it is a good investment. The picture/sound quality is unmatched compared to similar devices. The remote works amazingly and the device is small. I have access to every media app that I currently use and they all work flawlessly. I have not used this device for gaming so I will not comment on that feature. One problem that really irritates me is that if you want to avoid accidentally purchasing titles, you have only one choice. You must set a parental control feature that will ask for a pin before you make purchases-but also before you watch free titles and make ANY changes to settings. The drawbacks outweigh the benefits in that regard, so I will be forced to watch out for titles that aren't free. This wouldn't be a problem except that when you search from the menu, with voice or not, you will not be brought immediately to where that title is free. For example, I accidentally bought House of Cards because I clicked too fast when I searched- assuming it would bring me to the free Netflix version. It instead made me purchase the $3.00 episode. Note, Kindle Fire TV will direct you titles that ARE available on HBO Go, Showtime Anytime, and Prime- just not Netflix.Pros:-Processing power/ graphics card allow for Full HD and 5.1 surround sound.-HBO Go, Showtime Anytime, Netflix, and Pandora.-Ability to use your phone as a remote.-Cloud allows you to upload your photos, music, and videos.Cons:-Sleep/Off button oddly inaccessible.-Can't prevent unauthorized purchases without activating full parental controls- Amazon wants you to purchase titles you may not have planned to.-Device and remote collect fingerprints easily.-Voice will only work for amazon, in Netflix for example it will not search Netflix specific titles.", "verified": true, "helpfulness": "2/2", "author": "Joe R"}, {"rating": 5.0, "review": "Does exactly what I wanted", "verified": true, "helpfulness": "0/0", "author": "larry a underwood"}, {"rating": 4.0, "review": "Love it easy to use", "verified": true, "helpfulness": "0/0", "author": "Katlady"}]