[{"rating": 5.0, "review": "It gets better with every update and with every app update that uses it. I own multiple of these around my house and use them on a steady basis.", "verified": true, "helpfulness": "0/0", "author": "Flyerwire"}, {"rating": 5.0, "review": "Available points made this purchase easy.  Chromecast is the way my son's family views TV and I decided to cut costs and try it too.", "verified": true, "helpfulness": "0/0", "author": "DONA"}, {"rating": 5.0, "review": "I travel for work and this has been a lifesaver! Since most hotels have newer tvs it works every place I stay! And I can stream right off of my phone!", "verified": true, "helpfulness": "1/1", "author": "jill crosby"}, {"rating": 3.0, "review": "Roku much better", "verified": true, "helpfulness": "0/0", "author": "Matthew K."}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "alvaro montoya"}, {"rating": 4.0, "review": "I need to use this more often to be able to provide a proper feedback. I have tried it out just on two occasions and I do feel it is a bit difficult to move from the regular TV channels to Google Chrome and back again.", "verified": true, "helpfulness": "1/1", "author": "TJL Solomon"}, {"rating": 5.0, "review": "very good!", "verified": true, "helpfulness": "0/0", "author": "FedeVero"}, {"rating": 5.0, "review": "Did what was expected and then some. Definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Terrance Missouri"}, {"rating": 3.0, "review": "It doesn't get a lot of use in our house, but when it does, it works well.", "verified": true, "helpfulness": "0/0", "author": "Andy R."}, {"rating": 4.0, "review": "Took hardly any time for setting up and casting on the television from mobile/computer. Casting from apps supported by Chromecast like Youtube/Netflix is impeccable. Would give a 5 rating for that. However there are delays streaming from apps not supported by Chromecast. FOr instance when you play videos from other online websites like Megashare.com, etc. Also casting the entire screen of the computer or hand-held device, instead of just the app, is also not working properly - delays, lack of clarity, etc. Dont think it is a problem with wi-fi since the same video plays fine without any delays on the computer or ipad. This is the only reason am giving a rating of 4.Otherwise i am thoroughly delighted with this purchase. And for the price it is a must own. Youtube/Netflix/AmazonVideo watchers would love this.", "verified": true, "helpfulness": "0/0", "author": "Sheeba David"}]