[{"rating": 4.0, "review": "I have been using it for the last few months and really like the Chromecast.  I have lost connection once or twice but otherwise works as promised.  Needs more functionality, but for $35 it is pretty awesome.", "verified": true, "helpfulness": "1/1", "author": "C. Santo"}, {"rating": 5.0, "review": "Although this device is still in it's infancy I see limitless potential in the future for thiis little dongle. Google has really outdone themselves this time especially with the price point.The purchase of this gadget is really a no brainer if you purchased this with 3 months of free Netflix. With Netflix running $8 a month this unit essentially is only selling for $11. For what it can do and what it can potentially do in the future, this $11 investment is very miniscule. You'd spend just as much or more on 2 trips to Starbucks, why not put that towards something you can use for much longer?Being able to control YouTube and Netflix with nothing but your TV, Chromecast, Android device and an internet connection is such a convenience, in my opinion. I can't wait until there are more features. The ability to sling the content on your computer from the Chrome browser definitely opens things a bit. With continued support from Google and 3rd party developers, I see a very bright future for this little device.There aren't very many cons about this device. Only cons I can think about relate to the limit 3rd party support it currently has....or lack of, but that's something that will definitely be remedied in due time. It is a very new product.In the past I've used my PS3 to stream media, to connect to Netflix or YouTube but it could be troublesome to navigate with just the on screen keyboard and UI. With this you have all of the control with a very familiar setting that is your Android phone, Android tablet, PC, or iPhone.When you purchase this item it comes with everything you'll need. The device itself, an HDMI extender, and a powered USB cable to power the device itself if your HDMI port is not powered. I guess the only thing you'll need is a TV with an HDMI port. Good thing is that most people who have a TV, do.I think everyone should get one just to experience the convenience and fun factor fo this great media doo-hickey.", "verified": true, "helpfulness": "1/2", "author": "Benjamin Hsu"}, {"rating": 3.0, "review": "Works just as advertised.  Streaming of Netflix and YouTube works well.  Streaming from the Chrome browser is fine but it requires a fairly fast laptop to encode/stream local video files.I bought this to use while traveling for work.  I would give it more stars if I was able to stream from more sources (which I'm sure is coming).  Pretty much have to bring a small travel router with me for use in hotels.  I can use my LTE hot spot but video eats my data plan too fast for extended use.Looking forward to the future of this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The actual functioning of the Google Chromecast is wonderful. I had it hooked up and running in less than 10 minutes. What it does, it does really, really, really well.I'm using a Windows 8 laptop. You have to install an update to Google's Chrome browser, and then use that for accessing web content. When you want to \"Chromecast\" you just click on the \"Chromecast\" icon and voila! Whatever you see in your browser you'll see on the screen. Almost everything. Almost. I was able to stream free programming from Hulu (not Hulu Plus), and general web browsing from static pages, to Google Maps or Earth (including street view) all worked great. There is some obvious lag from what you do on your laptop to what you see on the screen so you probably can't use this with your TV as an extra monitor. One negative feature was that though I could see Amazon Prime video on my laptop the Chromecast unit wouldn't show the video on the TV screen.I have an android tablet with Jelly Bean (ver. 4.3) and found the Chromecast experience to be a lot less seamless and a lot more annoying. Basically, you can ONLY use your Chromecast with Youtube, Netflix, and Google Play. A single app is an umbrella interface for three separate apps for accessing those three services. And, currently, no others. Worse, when I tried to play free content from Google Play, I couldn't do that without supplying a credit card number. Yes, you can't see free content unless you register a credit card and that annoyed me.The technical aspects of the Chromecast dongle are top-notch. I'm waiting for the open-source community to come up with work arounds that will eventually allow me to watch anything I can stream on my device through the Chromecast to my TV.A very neat, intriguing product. And annoying. One star off just for that.", "verified": true, "helpfulness": "1/1", "author": "Kilgore Gagarin \"Those who believe in telekinetics, raise my hand. - Kurt Vonnegut\""}, {"rating": 5.0, "review": "Ordered this in Google Play and Amazon about a month ago. Received it few days ago from Google.Took 30 seconds to setup with my home theater receiver (Onkyo). Plug into an open HDMI input port.Was able to cast movies from macbook pro and Samsung S4 immediately. Video was great, Audio worked as per HDMI passthrough setting.All in all it was easy to setup, works really well...Things that work really well are (but not limited to).. Anything in Chrome browser including online movie channels, Youtube, Picassa Web, ...", "verified": false, "helpfulness": "0/0", "author": "Jagan Jey"}, {"rating": 2.0, "review": "I was very excited of finally receiving my Chromecast, but I rapidly became frustrated with it and would not recommend it to anyone at this point.The video quality is bad, and the audio is out of sync with the images.When casting a Chrome tab from my laptop, the frame quality is so bad that it is impossible to watch a movie or video. When casting from YouTube (from my laptop or iPhone), the video quality is definitely better but there is a delay in the audio portion and it makes the overall experience bad.Overall, Chromecast is useless to me right now. I've tried modifying video quality and such, but nothing improved the overall experience and images and audio are still out of sync.So far I'm not impressed with the product and is no longer connected to my tv: I'm not returning it in the hope that more native apps  will soon integrate the Cast functionality (similar to what YouTube and NetFlix currently do) and that the overall quality of the product will improve soon.If not, it will end up being a $35 paperweight...", "verified": true, "helpfulness": "1/3", "author": "Jonathan"}, {"rating": 4.0, "review": "The device seems to have some communication issues while streaming from YouTube, hopefully fixed somehow through an update. Streaming movies from a Chrome browser works well though. Very recommended.", "verified": true, "helpfulness": "0/0", "author": "J. Govoni"}, {"rating": 5.0, "review": "I love my Chromecast device. Works great with Netflix (crystal clear picture) and Youtube. Connects really fast and offers a very easy to use interface. I downloaded the app in my phone and run it with out a problem every single time. The only thing that worries me is that it overheats so I don't know if that's going to be an issue in the future.", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Moreno"}, {"rating": 5.0, "review": "I love my Chromecast!!  Having the ability to watch something on my computer, but cast to my TV is amazing.  The quality of the picture is great! Only occasionally do I get a delay in the audio matching the video, but that is usually fixed by pausing it and letting things catch up and then it's fine.  You can't beat the cost!  There are many people out there that say they are not going to get it because there is no apps for it yet.  Well to tell you then truth; 1 of my friends said that it doesn't support HBO Go.  There isn't an option that I know of through HBO Go that it has an embedded cast button, but as long as you use chrome you will always have that cast button, so it really doesn't matter.  If you are looking for something that is inexpensive that in essence does the same thing as ROKU, then this is it! Like I said, you can't beat the price.  I HIGHLY RECOMMEND THIS!!", "verified": true, "helpfulness": "0/0", "author": "Shawn V \"Bear\""}, {"rating": 5.0, "review": "A great little device, even better price. If you don't use it for anything more than YouTube on your TV navigating with your phone, it's an amazing experience. My AV receiver has HDMI inputs, and I've found it's a great way to watch music videos with great sound.Also great if your setup box is suffering from an outdated or crippled Netflix interface, or if you want to watch Netflix on a TV without a set top box/blu ray player.", "verified": true, "helpfulness": "0/0", "author": "Blair Briggs"}]