[{"rating": 5.0, "review": "I love it ~ However ~ with HULU Plus, anytime you touch the remote, you get a commercial...which I am sure Amazon gets a stipend for...but GEEEZ ~ you don't get that many commercials online and streaming.  Otherwise....this little beauty is the BOMB!  It changes the whole streaming game....it's faster, more efficient and you can see everything far better on the big screen!", "verified": true, "helpfulness": "0/1", "author": "Mistress Ursula"}, {"rating": 5.0, "review": "Works faster than my Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Sol McNally"}, {"rating": 5.0, "review": "best ever The best ELECT I Ever Bout ,,Everone should own one,Better than Xbox an all others iv owened", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "OK, I don't review often but NEED to do this for Fire TV. This little system comes packaged in gem worthy packaging. As only Amazon could package their products. Then, to open this nice box to find a device the size of a slice of bread AND possibly one of the most ergonomically designed remotes I have ever owned. But, don't let the size fool you! This little metal box is loaded with technology. To be able to watch all your Prime content is one thing but, to add apps, games, etc. Well. what more can I say? Perhaps to simply say, you really NEED the Amazon Fire TV.....especially if you are a Prime member. Shoot, maybe getting one will move you to become a Prime member. Just get it. You won't be sorry!", "verified": true, "helpfulness": "0/0", "author": "Melissa L."}, {"rating": 5.0, "review": "Nice  all the stuff I like to watch", "verified": true, "helpfulness": "0/0", "author": "GLPmn"}, {"rating": 3.0, "review": "Now that I have my Amazon Fire TV, they've cut back on what's available for free.  Bummer", "verified": true, "helpfulness": "0/1", "author": "BookLove"}, {"rating": 5.0, "review": "Just as I was beginning to tire of watching the little 7\" KINDLE FIRE screen to catch up on all the missed series and cable shows. (I have never paid for a cable subscription and don't intend to) I was able to connect it to my 48\" HD TV and enjoy all the shows I have heard about all these years.  Thanks Amazon,  I think this will give me years of entertainment for a great price, free!!!! UDABEST.", "verified": true, "helpfulness": "0/0", "author": "mary ann gonzalez"}, {"rating": 1.0, "review": "Very limited on the prime movies. Very disappointed with it.", "verified": true, "helpfulness": "0/5", "author": "Scotty Rosatto"}, {"rating": 5.0, "review": "Easy to set up - must have Amazon Prime and Netflix but you can really get a lot of good movies, tv series, etc.  Bought one for a gift also.", "verified": true, "helpfulness": "0/0", "author": "punkiebon"}, {"rating": 5.0, "review": "We have 5 Rokus but prefer the Fire TV.  Faster and easier to use.", "verified": true, "helpfulness": "1/1", "author": "BRO"}]