[{"rating": 5.0, "review": "Great device i use it with android and pc and to make full screen display i use ezcast ..... is th best", "verified": true, "helpfulness": "0/0", "author": "Erick"}, {"rating": 2.0, "review": "Limited funcitonality.  Apple TV is more fun to use and more interesting for software developers to play with.", "verified": true, "helpfulness": "0/0", "author": "Project 2501"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Dawn Beswetherick"}, {"rating": 1.0, "review": "I had technical after technical issues with Google Chromecast. Worthless product, spend more and get Apple TV. I would not recommend getting this product at all!! Google customer service was very nice, but all issues were temporarily resolved and had similar issues a day or two later. Product became useless once it asked for an upgrade - after doing so, it became inoperable. Google customer service said I can return it, but didn't bother to send it back, get my money refunded to order another one. I just went ahead and purchased Apple TV - more expensive, but worth the money. You might want to look into similar Amazon streaming products too. Amazon makes returns much easier.", "verified": true, "helpfulness": "0/0", "author": "owh03"}, {"rating": 5.0, "review": "Hundreds of reviews, all positive. Just buy one for each TV.", "verified": true, "helpfulness": "0/0", "author": "Witold"}, {"rating": 5.0, "review": "Great product holds up well does what it said it would.", "verified": true, "helpfulness": "0/0", "author": "droidhead"}, {"rating": 4.0, "review": "excellent but I wish it as amazon instant", "verified": true, "helpfulness": "0/0", "author": "vuhx"}, {"rating": 2.0, "review": "Owned this for several months..it is a pain to connect and get up and running.  Once its running, its difficult to get a program to stop (Netflix.)  Now that the Fire stick is coming out, I've ordered that as a replacement.", "verified": true, "helpfulness": "0/0", "author": "Mantooth"}, {"rating": 4.0, "review": "Chromecast uses the Wifi to get the trigger from the user to stream contents from the web. It connects seamlessly to the HDMI input out-of-the-box. Setup in Android and Windows is pretty easy (in fact going to the link and rest was pretty automatic). It needs to be connected to the same network though during set up. It gives a \"handle\" to any youtube/video that is present in the web to be played via the HDMI to the screen. Needless to say, a good internet connection and a good router is essential for this to work seamlessly.A few points to notice (both good and bad):- It takes 10-15 seconds for the video to load from the Android/Windows screen (Nexus 5/Windows 7/Comcast generic router) to the screen. The wait seems to be a bit long.- I have both Roku and Chromecast, I concluded that Chromecast is both faster than Roku and the video quality is crispier.- A bad internet connection makes the Roku video blurry but motion is unaffected (i.e. compromises on pixels but not frames/sec). Chromecast makes the video choppy but preserves the crispiness of the picture (i.e. compromises on frames/sec).- Roku uses the monitor actively and shows what I am typing on the TV screen, where with Chromecast uses the monitor passively, and all typing and searching is on the OS rather than on the TV.- Chromecast (and also some versions of Roku) suffers from no independent audio output channels, which can be extremely handicapping if one wants to use a separate audio system is used for sound. In my case the TV speakers are too tinny. So I had to channelize the audio to a standalone 5.1. I had to buy a separate sound-video splitter which takes the HDMI signal and separates the audio and the video. I tried two different (expensive) splitters, and best quality HDMI cables, but I was not able to completely reproduce the picture quality of the Chromecast when it is directly streaming to the TV. So, I am a bit handicapped, as listening to music using a 5.1, yet getting the best picture quality at the same time is not an option with Chromecast. Hope this will change in future versions.- Some reviews/manufacturers comments on comparisons on WiFi bandwidths used by these devices will be helpful in future.Overall, it is a great device to have, if one can live with the drawbacks mentioned above.", "verified": true, "helpfulness": "0/0", "author": "Arnab Banerjee \"abjee\""}, {"rating": 5.0, "review": "This is my third one that I purchased!", "verified": true, "helpfulness": "0/0", "author": "Walkerdc"}]