[{"rating": 5.0, "review": "I  got this as a birthday present for myself and I'm very pleased now I can finally watch Google play TV shows on my HDTV.", "verified": false, "helpfulness": "0/0", "author": "Dontay"}, {"rating": 5.0, "review": "I don't usually write reviews for stuff I buy. With that said I am pleasantly surprised at how much I am enjoying this device. Once you do the initial setup, all someone must do is be connected to wifi on whatever device they choose. In our home, just about everyone carries around a cell phone with them where ever they are, which makes this even better. For the kids who don't have cell phones, they have the tablet which works equally as well.One area of concern. Chromecast only works on 2.4 GHz WiFi radio. There is an increasing demand for 5 GHz network in today's times simply for the significantly faster speeds it provides under the right conditions. Every wireless device I use in my home is compatible with a GHz network, which in turn makes it my frequency of choice. For anyone that doesn't understand what this means, basically 2.4 GHz is your standard WiFi radio, which just about everything that has ever been WiFi capable is compatible with. Over time with the amount of devices using WiFi, it has caused that particular frequency to become extremely crowded, and every device that uses WiFi is basically fighting each other for those  little invisible air waves. This includes neighbors, community centers, restaurants, hotels etc. Keep in mind there is a certain distance each router is capable of broadcasting, so signals from the persons house a mile away don't effect your signal.With the", "verified": true, "helpfulness": "0/0", "author": "Jason Call"}, {"rating": 4.0, "review": "This is the second one I purchased to hook up to another TV. With the high price of cable we used this in the spare bedroom (which we don't have cable in) so that my son could watch Netflix while home for the holidays. I love the fact that it doesn't need a remote... just use your phone!", "verified": true, "helpfulness": "0/0", "author": "Deb F."}, {"rating": 5.0, "review": "AAA+", "verified": true, "helpfulness": "0/1", "author": "Juan González"}, {"rating": 5.0, "review": "Great product for a great price! Shipped fast. Package arrived in perfect condition.", "verified": true, "helpfulness": "0/0", "author": "Harold Cáceres"}, {"rating": 4.0, "review": "Pretty cool device for YouTube and pictures within a few Apps. Wish it were more universal. That's not on the device but on Developers at FaceBook, YouPorn and others. The price is right for what it does.", "verified": true, "helpfulness": "0/0", "author": "Rainman"}, {"rating": 5.0, "review": "This streaming video device is the most affordable of the bunch, and I love how easy it is to set up and work. I watch YouTube and Netflix all the time on my television and the quality is wonderful. If you want Amazon Prime Video, you may want to go with the Amazon Fire Stick, which I hear is probably the best of the bunch. But if you want to watch the basics and don't have a lot of dough to throw away, this player is awesome.", "verified": true, "helpfulness": "0/0", "author": "Cedar Street Films"}, {"rating": 3.0, "review": "don't like using my iphone for remort", "verified": true, "helpfulness": "0/0", "author": "Robert Cawley"}, {"rating": 2.0, "review": "pretty much only for youtube and netflix and if you want to cast hulu to to your tv then its not enabled free, expect to upgrade to hulu plus by paying. waste of money, I could have spent little for a Roku or a Apple tv.", "verified": true, "helpfulness": "0/1", "author": "shanpn"}, {"rating": 5.0, "review": "Absolutely worth it.", "verified": true, "helpfulness": "0/0", "author": "Charles N."}]