[{"rating": 5.0, "review": "I have two RUKU streaming devices. The extra internal memory on the Fire results in no frame freezing. Of course the voice search is far easier and faster. It is the best of the streaming devices on the market at this time.", "verified": true, "helpfulness": "1/2", "author": "CAS"}, {"rating": 4.0, "review": "The voice activation to search within Amazon movies and TV is great and fast.  I wish it would search my netflix movies also.  It is also much faster at launching movies and TV on prime.  Essentially it starts instantly.  It also has game capability that I don't have for my Apple TV.  My Apple TV is better for connecting with my iTunes music and my photos, but I like the Amazon Fire TV box better for viewing movies and TV.", "verified": true, "helpfulness": "0/0", "author": "Bob Strickland"}, {"rating": 2.0, "review": "Very disappointed with Amazon Fire.  USB port did not work. Does not stream movies well in comparison to my Samsung bluray player.", "verified": true, "helpfulness": "0/3", "author": "Franz P Gatling"}, {"rating": 3.0, "review": "I had hopes although I knew it didn't stream from my Mac iTunes and was disappointed. Free content is hard to find and in many cases you run the chance of clicking on paid content. They shouldn't commingle the two. Worse yet was the biggest cool features which was voice control search versus scrolling broke. There recommendation was to go back to manual scroll and enter to search titles.FAILI am adding to this instead of editing. Oddly enough I was able to get the remote to work by rebooting my wifi and while the Fire TV device itself was accessing the wifi with no problems, the voice command part of the remote wasn't able to. I am holding off returning the device and giving it some more time to see if it recurs.", "verified": true, "helpfulness": "2/4", "author": "Scott Brown"}, {"rating": 5.0, "review": "This product is saving me over $50 a month by dropping Cable TV. In our house we don't have the need to watch TV shows the day they come out and find we enjoy watching back episodes of shows, especially without or with limited commercials. This product connects to your TV and allows you to watch movies and shows from your Amazon Prime account, Hulu Plus and Netflix as well as play games and do much more. Very happy with this product and highly recommend it.", "verified": true, "helpfulness": "2/2", "author": "Dean F"}, {"rating": 5.0, "review": "I'm not a techy person at all, but thought I'd give it a try since many of the reviews stressed how easy it is.  It was a snap to install!  And the voice activation really works!  I love it!", "verified": true, "helpfulness": "1/1", "author": "Jacqueline"}, {"rating": 5.0, "review": "I simply love this device.  No more freezing up problems with my Chromecast and more intutive than my built in Samsung smart apps.  The only thing I hope they change,(which I've heard they will) is using voice search in a non-amazon app is not yet available.  Not a big deal with its predictive text feature, it's easy to navigate around.  This has crazy range too; it's over 60 feet from my internet modem/router and still has strong signal.  Lastly, with its quad core processor and internal ram storage, there's no buffer time.  I have it plugged into my smart tv because it simply performs better on all levels.", "verified": false, "helpfulness": "1/1", "author": "Kevin"}, {"rating": 5.0, "review": "Great device!!! Super fast and easy to use. The only  2 things missing are  HBO Go and universal search.Everything else is just perfect.", "verified": true, "helpfulness": "2/2", "author": "Rafael Guzman"}, {"rating": 5.0, "review": "Love this system. It is very easy for even the most electronically challenged people. I would certainly recommend it highly!", "verified": true, "helpfulness": "1/1", "author": "Bonita Burke"}, {"rating": 5.0, "review": "Excellent. Worth every penny.Voice control is perfectly flawless.Do yourself a favor. Buy this.You wont regret it.You ll love this box.", "verified": true, "helpfulness": "1/1", "author": "JC.."}]