[{"rating": 5.0, "review": "We love it. The quality of the image is insane!", "verified": true, "helpfulness": "0/0", "author": "hellen nitschke"}, {"rating": 2.0, "review": "It can not stream video from my laptop, which was the main reason I bought it.  Works great from my phone or my tablet, but will freeze up when even attempting to stream video from the laptop.  I read you need a \"high power\" laptop in order to do it?  Mine's not a slouch and I know it's a lot faster and has more memory than my phone or tablet.  Avoid if you want to stream from your computer!", "verified": true, "helpfulness": "0/0", "author": "Al T."}, {"rating": 5.0, "review": "What i expected.  It works great.  Really happy with Amazon", "verified": true, "helpfulness": "0/0", "author": "Agustina"}, {"rating": 5.0, "review": "Chromecast is pretty much a much have for the price. It's definitely worth trying out and for $35 you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Rey"}, {"rating": 1.0, "review": "Garbage", "verified": true, "helpfulness": "0/1", "author": "Anne Bischof"}, {"rating": 5.0, "review": "My cousin got me one as a gift and I love it. I don't even need my cable anymore lol because I watch everything on my phone & tablet & now with chromecast I can watch it on my big screen TV.", "verified": false, "helpfulness": "0/0", "author": "timilian"}, {"rating": 4.0, "review": "I am not happy to find out after purchasing Chromecast that Amazon Prime isn't supported. I haven't used Prime video and thought this would be the answer. Everything these days seem to have to have to be proprietary. Why can't  companies keep it simple?", "verified": true, "helpfulness": "0/0", "author": "Jill Dahl \"Loves books\""}, {"rating": 5.0, "review": "good value and delivered really two days", "verified": true, "helpfulness": "0/0", "author": "rich"}, {"rating": 5.0, "review": "Great Google product to connect my phone with the tv", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "This is the perfect device for sending videos from my phone or computer to the television. If you are thinking about buying one do it. It is super handy and not gimmicky at all.", "verified": true, "helpfulness": "0/0", "author": "Nick Accuardi"}]