[{"rating": 5.0, "review": "What a fun device, works like a charm, super easy to set up, pretty much plug n play, LOVE the talk to clicker, hasn't made a mistake yet!HAPPY,HAPPY,HAPPY", "verified": true, "helpfulness": "0/0", "author": "Robyn"}, {"rating": 5.0, "review": "Very pleased with it!  Very easy to use and navigate!", "verified": true, "helpfulness": "0/0", "author": "Rich Pross"}, {"rating": 1.0, "review": "Was not what I was expecting. I had purchased the fire TV box and Amazon prime looking to replace cable TV. With prime there is a lot of movies that are free but not many that are newer. Biggest disappointment was TV shows. If it was free they were seasons behind and most shows I wanted to watch were $2.99 each show or $30 for a season. If you watch a handful of shows you will quickly be back to price of cable TV.  The hardware and services are there, just not the pricing and availability of new shows.", "verified": true, "helpfulness": "2/5", "author": "Keith Way"}, {"rating": 5.0, "review": "Love my Amazon Fire TV!!!!", "verified": true, "helpfulness": "0/1", "author": "Kitty \"runner22\""}, {"rating": 5.0, "review": "I am very impressed with everything the Fire TV has to offer. I hope they contnue to add more programs to the current selection.Set up was simple and painless Navagation could be a little more user friendly but overall it was defintely worth the cost.Another nice feature is that you can literally take it on the road with you when you travel.", "verified": true, "helpfulness": "0/0", "author": "Papa Joe \"Papa Joe\""}, {"rating": 5.0, "review": "This is the best streaming device, period.  Great content and video and audio resolution is outstanding. It's fast and easy to use.  I bought 2!", "verified": true, "helpfulness": "0/0", "author": "thepit47 \"Pete\""}, {"rating": 5.0, "review": "We love out fire TV we now have two in our home.", "verified": true, "helpfulness": "0/0", "author": "Christopher Pope"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "sandra martinez"}, {"rating": 5.0, "review": "It makes my plain TV 'smart'.", "verified": true, "helpfulness": "0/0", "author": "Ray A. B."}, {"rating": 5.0, "review": "AMAZON FIRE TV IS THE BEST!  I FIRST BOUGHT THE FIRE STICK BUT HAD A LOT OF ISSUES WITH IT FREEZING UP MOVIES OR NOT PLAYING THEM AT ALL.  PLUS I KEPT GETTING WEIRD MESSAGES POPPING UP ON THE SCREEN.  THE PROBLEM TURNED OUT TO BE THAT THE WIRELESS TRANSMITTER INSIDE THE STICK WAS NOT STRONG ENOUGH TO PICK UP THE WIRELESS  SIGNAL FROM MY ROUTER.  THE ROUTER WAS NOT THAT FAR FROM THE FIRE STICK BUT IT WAS STILL AN ISSUE.  AMAZON, BEING THE GREAT COMPANY IT IS WITH CUSTOMER SERVICE, GAVE ME ALMOST A FULL CREDIT ON THE STICK AND I THEN PURCHASED THE FIRE TV FROM THEM.  IT WORKS PERFECTLY AND SO MANY GOOD MOVIES TO CHOOSE FROM.", "verified": true, "helpfulness": "0/0", "author": "opinionsplus"}]