[{"rating": 5.0, "review": "Work fine", "verified": true, "helpfulness": "0/0", "author": "Piotr P."}, {"rating": 5.0, "review": "Good technology.works fine and streams seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Ndy"}, {"rating": 1.0, "review": "DO NOT BUY - literally a piece of rubbish, it is still in beta, wait year for full release, not worth the headache.Choppy video, encountering errors, randomly stopping, no sound etc.again, DO NOT BUY", "verified": false, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "great purchase, works great", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "Really use this a lot. Plus they are getting more and more apps accessible.", "verified": true, "helpfulness": "0/0", "author": "Shannon Bridges"}, {"rating": 3.0, "review": "Learning curve too steep for my clients.On a personal the device is ok though not suited for non-tech types.I.E.= Senior Citizens.", "verified": true, "helpfulness": "0/0", "author": "Kona Mike"}, {"rating": 1.0, "review": "I'm sure this would be a great product if you have one of the few routers that are basic enough to work with this product. If you have any form of home network security or a vpn, then forget even trying to get this chromecast up and running.", "verified": false, "helpfulness": "0/0", "author": "Boom"}, {"rating": 5.0, "review": "Best thing if you are an indian this is available in india for almost 2 times the price..in US..the best is u can cast your desktop from a chrome cast which is not possible in amazon fire stick..", "verified": true, "helpfulness": "0/0", "author": "Abhinav Gupta"}, {"rating": 5.0, "review": "I own three of these. They are not entirely open as far as running your own apps, but there is a lot of flexibility as far as what you can do with apps from developers other than Google, Netflix, and HBO. One of my favorite apps is Allcast which let's you stream videos and photos stored on your mobile device directly to your Chromecast. The screen mirroring feature is neat but I rarely use it in practice. My favorite reason to own these, or really any streaming stick, are the power savings. The amount of energy Chromecasts consume (at most 5 watts) is a pittance compared to the 200+ watts most computers and consoles use when powered on. In that sense they pay for their selves. The promotions have also netted me 9 months of free Play Music radio and $18 to spend on movies in the play store. If you run them directly from the USB port on your television you can save even more electricity by completely powering off the device with your TV. They're great for slapping onto older \"dumb\" TVs.", "verified": false, "helpfulness": "0/0", "author": "What."}, {"rating": 3.0, "review": "Not compatible with old tv", "verified": true, "helpfulness": "0/1", "author": "lolita rivers"}]