[{"rating": 5.0, "review": "Just plug it in, follow the prompts to install, and instantly watch all your favorite TV shows/Movies/Videos on your TV! Amazing! Best purchase I made all year!", "verified": true, "helpfulness": "0/0", "author": "Celine Villongco"}, {"rating": 5.0, "review": "Do not purchase a smart tv, purchase a chromecast! Cheaper and better! Very very very  easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "O. Salas"}, {"rating": 5.0, "review": "I love this! 2 minute installation. You can literally play ANYTHING from your computer to the TV. Definitely recommend to anyone!!!!", "verified": true, "helpfulness": "0/0", "author": "Dazzle1206"}, {"rating": 2.0, "review": "Pure impulse buy!!!Nothing special here....I can stream nexflix from my ipad to our TV...big deal we have netflix on our tv....you can stream Utube from  you ipad to your tv....big deal!!!!I thought i could stream alot more than 2 things!!! FAIL!!!!", "verified": true, "helpfulness": "0/0", "author": "Don C"}, {"rating": 5.0, "review": "The set up was more difficult that I had anticipated.  I tried to set it up using my desktop computer which is right next to the TV.  That never did work.  However, when I moved to my tablet, it went more smoothly.  We are now streaming with no difficulty; no buffering, very good quality HD picture.  Very happy.  I just wish I could get another one for my studio, where I have an old analog TV.  It may be worth buying a new TV for that room.", "verified": true, "helpfulness": "0/0", "author": "SandyC"}, {"rating": 5.0, "review": "Works great. Easy to set up and is small and easily hidden. No streaming delays to speak of, and is perfect for watching anything from your computer.", "verified": true, "helpfulness": "0/0", "author": "Julius"}, {"rating": 5.0, "review": "If you have a semi old TV and want to watch netflix, redbox, hulu and what not, then Chromecast will definitely put a smile on your fave. I have a 37 inch Panasonic flat screen and didn't want to have it hooked up to PS or DVD players to get access to online streamers like netflix. Chromecast works nice and it is so easy to setup. I've been watching mainly netflix on my old TV now. For what it does you can not beat that price either. So overall I am happy with the device and the price.", "verified": true, "helpfulness": "0/0", "author": "Touraj Behmand \"Touraj Behmand\""}, {"rating": 3.0, "review": "not a real necessity if you have a blue ray player with internet capability. The particular blue ray ray feature will play u-tube and a lot of other videos from almost any site and view other internet pages. more expeditiously and with more versitilitiy than chromecast.  However chrome cast is easy to use and install but it requires you to have to go back to your computer to change the utube video you are watching. very inconvinient if your pc is upstairs or a few rooms away. If you don't have bluray chrome cast is a very economical wat to go.", "verified": true, "helpfulness": "0/0", "author": "Electronic Genius \"phone hack\""}, {"rating": 5.0, "review": "The best thing about this is its easy installation and simple use through a laptop or other mobile device.  It is surprisingly affordable too.", "verified": true, "helpfulness": "0/0", "author": "Judyms"}, {"rating": 5.0, "review": "Great product.does what it says.very cheap considering the alternative of apple tv. I highly recommend this product to everyone. It will only get better", "verified": true, "helpfulness": "0/0", "author": "Andrew"}]