[{"rating": 5.0, "review": "Very easy to use, to set up, just follow the instructions. Download the apps and everything works just fine, love it.", "verified": true, "helpfulness": "0/0", "author": "S.Daniel A."}, {"rating": 5.0, "review": "This was so easy to set up, and it streams beautifully to our tv. No- brainer- great product & price!", "verified": true, "helpfulness": "0/0", "author": "nobody you know"}, {"rating": 5.0, "review": "A friend told us about this. My kids love the fact that they can see more programs.It's awesome! We also received it in a timely manner.", "verified": true, "helpfulness": "0/0", "author": "paymin teo"}, {"rating": 5.0, "review": "It gives us so much more flexibility for viewing videos, movies and more!Technology is great. Good if you dont have xbox", "verified": true, "helpfulness": "0/0", "author": "Lesa K \"Lesa K.\""}, {"rating": 2.0, "review": "I was disappointed to learn that it doesn't work natively with amazon prime yet (the workdaround was not good). Also there often seems to be an audio/video sync issue which is distracting and intolerable if you are watching something longer than 5 minutes. So far it has been most useful for casting youtube videos.", "verified": true, "helpfulness": "0/0", "author": "Danielle M"}, {"rating": 5.0, "review": "Works wonderfull with Plex, this is one of the best things i could get to stream my Plex Library to my TVs at home!", "verified": true, "helpfulness": "0/0", "author": "Alain!024"}, {"rating": 5.0, "review": "I got a Chromebook for Christmas, and purchased this about a week later for the large TV in our living room.  No-brainer to set up and get working.  Works great from my Chromebook or my Android phone.  Will be getting another one soon for the TV in the bedroom.  Works great with Netflix, Amazon, YouTube videos.  Haven't tried any others, but I'm sure I will get around to it.Video quality is excellent.  Can continue working on something else while casting from another tab in your Chrome browser.Limited support for Linux, which is kind of a drag.  I refuse to run Windows or Mac, so will just need to wait to see if Google ever gets around to adding full support.  I won't deduct any stars for that.Other video streaming devices just don't make sense at all compared to Chromecast.  I'm very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Bob Miller \"Bob Miller\""}, {"rating": 2.0, "review": "Does not work on your lap top if you are using a VPN connection, had to  send it back, Google needs to fix this", "verified": true, "helpfulness": "0/0", "author": "kevin healy"}, {"rating": 2.0, "review": "It works fine but the lack of apps makes it not as useful as I had hoped for.  More apps = better rating.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Streaming music or just a tab while surfing works great. Trying to stream HD video from a tab...nope. I have a 50mbps connection and Chomey kicks me out or will stall the video and keep the audio going.", "verified": true, "helpfulness": "0/0", "author": "Nicholas S Wilhelm"}]