[{"rating": 5.0, "review": "I can't see my self with out this little device.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Nicolas Daniel Pintos"}, {"rating": 5.0, "review": "These work really well", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 5.0, "review": "Gotta love the chromecast.  Gotta love amazon's prices too.", "verified": true, "helpfulness": "0/0", "author": "VTratings"}, {"rating": 5.0, "review": "Wow.. turns your tv into a computer! We didn't have cable, but we did have wifi access. We were bored, so got this stick, watched Netflix, surfed the web and more! Best that money can buy. Traveling to friends houses, different towns,etc.. makes for some great entertainment! Didn't take very long to set up, but do need to know a little technical knowledge. Instructions were easy to follow.", "verified": true, "helpfulness": "1/1", "author": "robin earnhardt"}, {"rating": 3.0, "review": "It does the things I wanted it to do - play netflix on the big TV, watch files from my PC on the TV.  However, once the chromecast is on, I pretty much can't use my wireless on any other device.  This makes casting something to the TV take a while, unless I use the one wired PC in my home.  I did not expect this issue because I have a lot of bandwidth and have often had like 3 different devices streaming wireless no problem, but have the chromecast on and I can't check my email now? Not the best.Also using the Videostream app to stream files from the PC to the TV works great, but you can only do one file at a time.  When I am watching 11 minute videos this gets pretty annoying pretty quickly.", "verified": true, "helpfulness": "0/0", "author": "Gabby"}, {"rating": 3.0, "review": "It was very cool until we tried the Amazon stick.  The Amzon stick seems to have almost all the same uses, and can do a little more.  The Firestick can access your Amazon music, and Amazon Prime video.  Basically, you'll probably like the Amazon Firestick better.", "verified": true, "helpfulness": "0/0", "author": "Dan Powers"}, {"rating": 5.0, "review": "What can I say. This is excellent. I have two now, and am dependent on them. I travelled recently, and did not have my Chromecast, and missed it terribly. I use this to screencast to my TV so we can collaborate on work, watch John Oliver on Monday morning on Youtube, and fifty other things. I am amazed at the usefulness of this Roku killer. The downside is that it requires an Android device, or you are limited to streaming what can be viewed in a Google Chrome web browser tab.One thing: When you install it, you might find that it does not connect to your home network. You may need to jigger with the channels on your router, and turn off \"auto\". Set the router to use channel 1 or channel 6. Then restart the router. That has always fixed it for me.", "verified": true, "helpfulness": "0/0", "author": "Sean P. Moran \"spmoran\""}, {"rating": 5.0, "review": "Works great and allows you to put just about anything on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Mike Crabill \"I'm into aviation, avionics, computers, web development and basically anything technical. USAF veteran, now disabled and still into tech.\""}, {"rating": 3.0, "review": "Does the job, but unless your wireless router is in the same room as your TV, the quality is not great. The video is very jumpy and not smooth. It also sucks to have a power cable coming from your HDMI slot of your TV.", "verified": true, "helpfulness": "0/0", "author": "Aidan Licker"}]