[{"rating": 5.0, "review": "I love this. My hubby took two min to setup for me. I have a friend that was thinking about doing away with cable. I told her to buy this and she will not miss cable at all.", "verified": true, "helpfulness": "0/0", "author": "cheryl gomez"}, {"rating": 5.0, "review": "I snagged this during the holidays for only $79. What a great deal and a terrific product. So easy to set up and use. I connected right away with my wifi signal and have been binge watching \"House of Cards\" ever since. I use this with subscriptions to HuluPlus and Netflix, as well as my cable tv provider Time Warner. The best part is the voice search, although it only voice searches Amazon Prime. I would love it if voice search also searched into HuluPlus and Netflix, but for me that's only a minor criticism. Great deal.", "verified": true, "helpfulness": "0/0", "author": "Mims Athome"}, {"rating": 5.0, "review": "Beautifully beautiful!!!!! All in one as described.", "verified": true, "helpfulness": "0/0", "author": "Eg"}, {"rating": 4.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Top notch. Ready to get rid of the cable", "verified": true, "helpfulness": "0/0", "author": "mary davis"}, {"rating": 5.0, "review": "I love it very much. I've watched several tv shows that are no longer on. It was a very nice gift.It is a five star plus rating.", "verified": true, "helpfulness": "0/0", "author": "Gwendolyn L. Eagleson"}, {"rating": 2.0, "review": "Meh, its just ok.  We bought it to see ESPNWATCH, which cuts in and out.  It doesnt show espn unless I upgraded my cable, which then I wouldnt need it.  It has a few games with good graphics, but they are not my interest. (shoot em up, Grand theft auto etc) They dont offer the games that would be nice, I would still just have to use them on my computer.  It DOES NOT mirror your computer screen, which I thought it did.  I am not sure what is so great about this because all it does is what I could already do with ROKU.", "verified": true, "helpfulness": "1/2", "author": "Oregon Mom"}, {"rating": 5.0, "review": "User friendly. Love the voice command option. Much easier than typing your search.", "verified": true, "helpfulness": "1/1", "author": "Jollene Shirley"}, {"rating": 5.0, "review": "I love my Amazon Fire TV. Its very fast And I really like the interface.", "verified": true, "helpfulness": "1/1", "author": "DAVID WARREN"}, {"rating": 3.0, "review": "Not enough current movies on PRIME!!!", "verified": true, "helpfulness": "0/0", "author": "Scott"}]