[{"rating": 3.0, "review": "It does what it's suppose to do, easy installation, everything was easy.  The product description failed to mentioned that it contained a USB Power cable so I ended up ordering one separately. Not a big expense but it would have been a nice to know.", "verified": true, "helpfulness": "0/0", "author": "john n"}, {"rating": 5.0, "review": "Very Good!", "verified": true, "helpfulness": "0/0", "author": "Dinesh Bissoon"}, {"rating": 4.0, "review": "Great product, provides great entertainment when friends/family are over allowing us all to queue up youtube videos.  The only issue i take with it is that when not pushing youtube video and using other apps(pandora, screencasting, etc) from my phone the cast icon will usually only show up after either a reboot of the chromecast or my router.  I also had to change a setting on my router to get it to work at all, which I was able to find after a quick google search.  I have found that this happens on all our android phones in the house.  I am unsure if this issues is with the device or the router but I am hoping that an update to the chromecast will eventually resolve the issue.  The router in questions is a DIR-655.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 5.0, "review": "I absolutely love my Chromecast. Turns any TV I choose into smart TV. Super easy and fast installation. Can't go wrong with this product", "verified": true, "helpfulness": "2/2", "author": "joey l"}, {"rating": 1.0, "review": "I purchased this and I could not get it to work. I could not get it to recognize my wifi. I returned it and I am completely satisfied with Amazon.", "verified": true, "helpfulness": "1/2", "author": "rene halligan"}, {"rating": 5.0, "review": "Easy to use and its better on a bigger screen", "verified": true, "helpfulness": "0/1", "author": "juan"}, {"rating": 2.0, "review": "Overheats in use.  Setup is straightforward, but failed a couple of times initially.", "verified": true, "helpfulness": "0/1", "author": "Another Customer"}, {"rating": 5.0, "review": "Works best on Netflix.  Other sources for streaming like PB, not so much.", "verified": true, "helpfulness": "0/0", "author": "Agent 99 \"Agent 99\""}, {"rating": 5.0, "review": "Great product, very happy!", "verified": true, "helpfulness": "0/0", "author": "Dave Haney"}, {"rating": 5.0, "review": "I did not watch TV that often before I got the Chromecast, now I am an avid movie watcher as well as some of the series that are on TV. Frankly I need a second one.", "verified": true, "helpfulness": "1/1", "author": "Sandra A"}]