[{"rating": 5.0, "review": "Awesome little box. Worked right out of the packaging and I was able to install apps and side load other apps I use with no issues.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really pleased.streams exceptionally well.easy set up , and  too  use.games great as well😀.And it listions too me LOL", "verified": true, "helpfulness": "0/0", "author": "michael r johnston"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "terri"}, {"rating": 1.0, "review": "Amazon fire TV it was okay at first then after about four months has started to freeze up and cut off. I thought it was my internet connection is so I had the Internet company come out and check my connections and everything, but there was nothing wrong with my internet. So I return my Amazon try a TV and Amazon replace it with another and blonde fire TV.but after only having the new one for about a month and a half it started to do the same thing so I just returned it for a refund.", "verified": true, "helpfulness": "3/5", "author": "viv43"}, {"rating": 3.0, "review": "The Amazon fire TV only outputs Dolby digital plus my old receiver only handles Dolby Digital so I am left with only two channel PCM audio. I returned it...", "verified": true, "helpfulness": "0/1", "author": "K. Rajan \"PK1\""}, {"rating": 3.0, "review": "I am heavily invested i  the Amazon ecosystem.  Prime member,  Kindle,  etc.  I couldn't decide btwn Fire TV or a Roku,  so I bought both,  intending to give the other to my so.  I was willing to wait for HBO,  but it turns out if you are a Directv customer,  you CANNOT watcb Showtime on Fire TV.  Whaaa what?  Deal breaker.  While voice search was cool,  the Roku feature of searching for a movie/show and being given a  list of results showing ALL options (Netfix,  Amazon,  Hulu,  etc) AND prices for each (good to see what options cost and whichare free for the SAME movie)  is killer!  Not to mention Roku presents Amazon  Prime movies in a much better format.  Love Amazon but Im sending this back.  Will get a Roku for my son  too.", "verified": true, "helpfulness": "0/0", "author": "Susan L. Rambus \"hiker4life\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lonnie Davis \"lonnielou2\""}, {"rating": 5.0, "review": "Next to Roku, this is almost as good.", "verified": true, "helpfulness": "0/0", "author": "Frank J. Lapps"}, {"rating": 5.0, "review": "Starting to cut the cord.  Easy to use.  We've had it for a couple of weeks.  If it were possible to get nesn without cable the cord cutting would be complete.  No issues with the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very fast playback, voice search works great", "verified": true, "helpfulness": "0/0", "author": "Lee E McKeeman"}]