[{"rating": 4.0, "review": "Would be 5 stars except for the follow:-No browser-Difficult to install apps-Voice search is not integrated with all my streaming service apps, only APIV.-Home library/NAS support only present in weird video apps. Installed XBMC through ADB.update quickly to keep up with the Android TV's coming this fall or i will be replacing it for something potential perfect.", "verified": true, "helpfulness": "0/0", "author": "Joshua Taylor Lunsford \"Jolly Josh\""}, {"rating": 4.0, "review": "Would help if Amazon would clearly show programing that is pay for view vs. Free.", "verified": true, "helpfulness": "0/0", "author": "David T. \"book mizer\""}, {"rating": 2.0, "review": "Data usage is to high! I was using an average of 80 gigabytes per month for the last 7 months. The first month with fire tv I used 260 gigabytes and got a warning from my ISP that I exceeded the limit!  I was streaming before using Roku and Amazon Prime so my viewing habits haven't changed. I unplugged Fire TV and won't be using it until they fix it.", "verified": true, "helpfulness": "3/4", "author": "Paul B"}, {"rating": 4.0, "review": "Great device. Fast, easy to use. Will be 5 star once search is optimized across all services.", "verified": true, "helpfulness": "0/0", "author": "Daniel S Nelson"}, {"rating": 4.0, "review": "Simple set up and no problems. But navigation software needs to be reworked to make Prime content a bit more visible. Otherwise, works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Franklin"}, {"rating": 4.0, "review": "We've been using Fire TV  for a little over a month. It has a wonderful picture and gives us access to many web based shows. The only reason it didn't get 5 stars is it having to buffer more than what I expected a device with its amount of memory to. I don't know if it's the device or my cable provider.", "verified": true, "helpfulness": "0/0", "author": "Bear"}, {"rating": 5.0, "review": "I love this! Was using a Roku before, which is a good product but I like the Fire because I was able to download the XBMC program. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Romans828"}, {"rating": 5.0, "review": "We use the fire tv in our bedroom and it is great. We have a smart tv in the living room, so this is exactly what we needed for the bedroom. The box itself is small and the remote is easy to use. We also have Netflix and it was easy to download the app and get started. The only thing I have to complain about is the lack of a hdmi cable. Otherwise, the picture quality of movies and shows is great, we haven't had to deal with \"buffering\" like we did when we used the wii, and the price wasn't bad.", "verified": true, "helpfulness": "0/0", "author": "Renea E"}, {"rating": 5.0, "review": "Was thinking about buying another flat screen TV with Netflix (and other similar) capabilities, but was reluctant to do so because of how much they cost.Found out about this unit by total accident from reading about it in the business section of our local newspaper. Seemed like it was EXACTLY what I wanted. As it turned out; it is !!Only 'caution' I have is that it's easy to 'accidentially order' movies; I got nailed $12.99 without realizing it.Other than that drawback; this unit stands up to everything it's claimed to do. Thinking about getting a second once so we don't have to move the unit from the bedroom TV to the family room TV and back and forth.", "verified": true, "helpfulness": "0/0", "author": "Delta"}, {"rating": 5.0, "review": "I love the fire!  So much better than Roku.", "verified": true, "helpfulness": "0/0", "author": "Sarah Mullins"}]