[{"rating": 4.0, "review": "It is very easy to install from my Apple Tablet and my Sony Android Tablet (4.0.3 Ice Cream Sandwich) to Sony Bravia TV.Currently the number of programs that are available is very limited, however I am confident that Google will add move.For the price how can you go wrong?", "verified": true, "helpfulness": "0/0", "author": "JKX4009"}, {"rating": 5.0, "review": "What I like in Google Chromecast HDMI Streaming Media Player, that you don't only stream movies and showes from Netflix, Youtub etc. but you transform your computer or laptop screen to a big TV screen. Installation is very easy (if I can install it, everybody can do it). No wiers or connection cables between the tv and the computer. You can evan use your phone. Good quality of streamed pictures, with very short delay of streaming between the computer and the tv screen, In general... I love it.", "verified": true, "helpfulness": "0/0", "author": "george"}, {"rating": 5.0, "review": "This was easy to install, you need to sign up for Netflix service otherwise the movies costs can be incredible.  But the web cast quality is great and my HDMI TV has better quality than my cable.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Smith"}, {"rating": 2.0, "review": "Poor Quality and very limited feature1. video play with jerks.2. very few application supported.3. do not support any other view other then chrome browser form PC", "verified": true, "helpfulness": "0/1", "author": "Tarkik Mittal \"tarkik\""}, {"rating": 4.0, "review": "after hearing reviews was concerned about quality, now that I have it, quality is good to great, youtube comes in at least at 720.  Happy with purchase", "verified": true, "helpfulness": "0/0", "author": "Janice LS"}, {"rating": 4.0, "review": "If you are not a Netflix subscriber, Google Chromecast will be valuable to you only for YouTube or (perhaps) some local computing tasks. Still, it is way ahead of anything in its price category. Apple TV is superior, but it's a lot more money, too. If you are interested in the Chrome environment, you'll like Chromecast.", "verified": true, "helpfulness": "0/0", "author": "rpb \"There ain't nothin' like a good book!\""}, {"rating": 2.0, "review": "The quality of the video is amazing. I played youtube in Chrome browser from a windows laptop onto the TV.One problem, a major one, is that if you are in a hotel where you connect to internet via  browser (by giving guest user id and password and by accepting the terms and conditions) as against just giving the password (WPA Security key) on your home router, the Chromecast doesn't work.The Chromecast doesn't give you an option where you can enter the guest user id and password on a browser page. It always expects that you are connecting to a 'home' type of router and asks just for the router password.This is a major disappointment.", "verified": true, "helpfulness": "0/0", "author": "G. Akkinepalli"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player. really good paraphernalia, you will enjoy it. the movies look crispy in my TV.", "verified": true, "helpfulness": "0/0", "author": "AP"}, {"rating": 5.0, "review": "Hooks up really easy. Directions for downloading the apps are simple. The stream quality is great-it's hard to believe it's being transmitted through wi-fi. For $35 you can't go wrong.", "verified": true, "helpfulness": "1/1", "author": "Stacey Adams"}, {"rating": 1.0, "review": "The product is not 100% compatible with all devices, you can not get MAC address unless you are in a android device,At the begining was displaying few short clips, but afer an upgrade from google it just did not work at all what so ever....", "verified": true, "helpfulness": "2/4", "author": "Miguel Francis"}]