[{"rating": 2.0, "review": "Returned.", "verified": true, "helpfulness": "0/0", "author": "Mary Miller"}, {"rating": 2.0, "review": "Terrible video quality. Come on Google.", "verified": true, "helpfulness": "0/1", "author": "jeff"}, {"rating": 5.0, "review": "this thing rocks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We are still learning how to use it :)", "verified": true, "helpfulness": "0/0", "author": "PATTY BRUSH"}, {"rating": 5.0, "review": "Excellent... Thanks!", "verified": true, "helpfulness": "0/0", "author": "Donald"}, {"rating": 5.0, "review": "This thing is awesome! Recommend 100%.", "verified": true, "helpfulness": "0/0", "author": "Chingasos"}, {"rating": 4.0, "review": "works well...gave one as a gift....", "verified": true, "helpfulness": "0/0", "author": "s.hope"}, {"rating": 5.0, "review": "working great so far .... it simply does the job ..... for 35 you turn ur tv into smart tv ... not bad", "verified": true, "helpfulness": "0/0", "author": "rob \"Rob\""}, {"rating": 1.0, "review": "terrible  scammers  thats all i can say", "verified": true, "helpfulness": "0/4", "author": "Timothy Lambright \"Timothy Lambright\""}, {"rating": 5.0, "review": "This device is great.  I held off buying one because my TV only had one HDMI port that was occupied by my first generation Roku.  I needed to buy an HDMI splitter to use it, nearly doubling the cost. While that device met my needs, I had always been curious how much more I could do with a Chromecast.  My only regret is waiting so long to buy one.Hardware quality is good,  Installation was quick and easy.  I was shocked how well it can share the screen off a phone, or anything in a chrome browser, tested with a Chromebook.What impressed me the most was how it enables true multitasking.  Normally, with Android you can play audio from Google play or Pandora while running other aps, but as soon as you leave YouTube to respond to  text message, the audio stops.  With Chromecast, you \"cast\" a video (from YouTube or Netflix) or music from Pandora while doing other tasks on your phone, until you decide to cast something new.While the device occasionally dropped a video or audio, but the low price more than makes up for it.  The video quality is great, a noticeable upgrade from my Roku, for a lower price.While the device requires other devices (computer, smart phone, or tablet) to function, you could buy it with a cheap android tablet for under $100, or the price of an apple TV.It functions similar to an Apple TV, but is platform independent.  I'm curious how well this would work on a iPhone or iPad.  It's only shortcoming is its inability to play Amazon instant video, which worked fine on my Roku.  I take this as Amazon intentionally withholding functionality from consumers of Google and Apple products. Boo Amazon. Makes me regret buying instant videos from Amazon.", "verified": true, "helpfulness": "1/1", "author": "Eli M"}]