[{"rating": 5.0, "review": "Bought this to watch Amazon streaming video in the bedroom. Was hella surprised that, after putting in my WiFi password, it already was set up with my Prime account. That's really nice.The interface is intuitive and attractive, and the voice search worked flawlessly so far.Playback seems every bit as good as my Apple TV. In many ways, I think the interface beats the Apple TV, and it seems much faster. If I have any complaint, it may be the scrolling seems too fast sometimes, and it skips a movie.I'm very impressed. I will probably never play a game on it, I have no interest in video games. But as a streaming video player, this is a nice piece of hardware for $99. Packaging and the finish on the box, power supply and remote are all first class.", "verified": true, "helpfulness": "2/3", "author": "M. Frobisher"}, {"rating": 5.0, "review": "What an amazing purchase.  Everything I have done on this so far has been amazing.  Videos are clearer, sharper and my family is sitting here saying I didn't realize this level of detail was in this movie.  With Android it multi tasks.  I am listening to music while doing schoolwork and watching the beautiful screen saver.  Simple to use and fast as can be.  Please dont hesitate.  In the words of Cramer, Buy Buy Buy", "verified": true, "helpfulness": "2/3", "author": "L. Redding \"hambone\""}, {"rating": 5.0, "review": "I got mine today.  Setup was easy and I quickly had Netflix and Plex setup on it without a hitch.  I love that the Netflix app has kids mode (unlike Roku).So far the only downside I've noticed is it seems that while in the Amazon home screen/menus, the menu seems to flicker.  I don't notice this in apps or while watching anything so its a minor annoyance but it is noticeable.  Hopefully this will be fixed with a software patch.", "verified": true, "helpfulness": "2/3", "author": "Craig \"Senior Java Developer\""}, {"rating": 5.0, "review": "This is an immediate review after using the Fire TV for an hour. Setup was extremely easy (although I wish we could have skipped the cartoon setup guy in the very beginning.) The Fire TV is EXTREMELY fast! Apps like Hulu and Netflix open fast! You WILL notice a different in the Fire TV over the Roku 3!This is an Amazon box, so I can tell that they really tried to wrap everything around the Amazon Instant video and trying to get you to \"buy\" episodes and movies. Yeah, that's never going to happen with me. However, it's extremely easy to get to Netflix and Hulu app.Here is the BIG revelation why the Amazon Fire TV is staying in my house and I'm returning the Roku 3! PLEX! Yes, the Plex app!! I am in LOVE with the Plex app on the FIre TV over the Roku 3! The Roku 3 only shows 1 row of movie posters and you browse through your movies going horizontal. You maybe see like 4-6 movies at a time. You can't see that many movies on the screen. However, with the Fire TV, the Plex apps shows your movies on MULTIPLE rows going across the screen and then you browse your collection by scrolling down, not horizontally! You can see like 15 movies at a time! This is a huge improvement for me when I'm not sure what movies I want to watch.If Plex is as big for you as it is for me, then Amazon kills it with their box! Way better than Roku 3. You won't be disappointed!", "verified": true, "helpfulness": "2/3", "author": "R. Beck"}, {"rating": 5.0, "review": "Received the Amazon Fire TV yesterday along with the Amazon Fire Game Controller and have to say, I am very pleased with both.  Set up of Amazon Fire TV was quick and easy. There was a software update that had to be done which took about 20 min, after it was completed, everything was ready to go. I used the remote at first to set everything up and messed around with the Fire TV, and really liked the feel of the remote. The voice activated search ran very smooth. That feature will come in very handy, making searching around quick and easy.Even with three teens in the house, they each own an Xbox 360... two love their Android cell phones and one likes his Apple Iphone.  I use Android as well and also am on my second Kindle (8.9\" Kindle Fire HD, having upgraded from my first Kindle purchased about 3 yrs ago).  No iPads in the house, no Roku's. I found a use for the Amazon Fire TV and am very pleased with my purchase.I really like the idea of this Amazon Fire TV to watch Prime movies/TV shows, as well as movies saved in my Library.  The kids tried a few games, and seem very happy with the Controller (separate review) as well the ease of skipping around from games/apps/etc.  I tried Pandora which was really nice and a few other Apps.  The set up on the screen is similar to the Kindle, which I like. No skipping or lagging at all, another plus.Will look forward to seeing what other apps and/or games will come out in the near future.", "verified": true, "helpfulness": "2/3", "author": "KitKat2011"}, {"rating": 5.0, "review": "I am technologically challenged.  My PS3 has driven me nuts for years, needing reprogramed frequently.  I opened the Amazon Fire box, plugged in the electrical cord and then the cord to the tv.  It took about 5 minutes to update its program and then it was on.  It uses a very simple clicker and I can even operate it.  The picture is better too.", "verified": true, "helpfulness": "2/4", "author": "Golden Buckeye"}, {"rating": 5.0, "review": "I've been using the Fire TV for approximately 4 hours.  So far I'm very impressed with the device. As an owner of multiple digital media devices, and a person who has invested in WiDi devices, HDMI cables, and other connectors to get my content to a bigger screen - I'm very impressed.  This device is sleek, sexy, and is easy to use.Packaging:I ordered overnight shipping and the device arrived in a small, well packed box.  As with all Amazon products I've used the packaging had a lot of thought put into it.  No wasted space, yet easy to get items out.  The box came packaged with instructions, the remote, two AAA Amazon branded batteries, the AC adapter and the Fire TV unit.  The cable to the AC adapter came bundled in a small rubber band like device, which was much better than cheaper looking plastic twist ties.  The instruction booklet is well laid out, easy to read, and contains connecting instructions.First Impressions:Sleek. Sexy. The Fire TV is black, flat, square, and looks the part.  I was able to lay a standard DVD on top of the device and it was just a hair smaller.  It has a nice \"grippy\" feel to it - a black rubberized feel that coats both the controller and the main unit.  I connected it to my 46\" LCD TV via HDMI and powered it up.  No signing in needed - it knew who I was which was a nice touch.  I connected the Kindle TV to my wireless network with no problems (WPA2) and downloaded a software update.  A nice tutorial plays showing you the controls and the voice command system.  This was a very pleasant experience and the flow of activities from unboxing to connecting to initial start up went smooth as silk.Remote ControlLove it!  From its texture to its simplicity this is really a great way to control the Fire TV.  It fits easily into my hand and has just a few buttons (return, home, menu, rewind, play/pause, and fast forward) in addition to its large circular navigation circle and selection button.  No numbers, letters, or colors - very simple and easy to use.Voice ControlsThe voice search was 3 for 3 as I searched for movies I owned, didn't own, and didn't even know were on Amazon.  Just hold the voice button, keep holding while you say what you are looking for, and let go.  Unlike other devices that require awkward on screen keyboards the voice command system worked and within 5 seconds I had my search results.  Make your selection with the gigantic selection button and you are off and running.Parental ControlsI have three kids and decided to turn the control on right away.  I set a 5-digit PIN (nice improvement over standard 4 digit codes) and just about everything you do requires a PIN to be entered.  You can also set your Amazon Instant Video PIN online at the Amazon website (Your Account-->Amazon Instant Video Settings-->Amazon Instant Video PIN).  Whether it be downloading a game you want to buy, downloading a free game, watching a movie you already own, or watching a free TV show - enter a PIN.  Even if you try and \"fling\" from your Kindle HDX to the Fire TV you must enter a PIN.  The only improvement I want to see here is to be able to enter the PIN on my tablet after attempting a \"fling\".I Had a \"Fling\"As an HDX owner I was eager to try the \"fling\" action of starting a video on my Kindle Fire HDX tablet and sending it to the Fire TV.  I tried watching a movie I already owned and was able to fling the movie from my HDX screen to the Fire TV with a delay of only 10-20 seconds.  The movie started playing with no problems.  I was also able to play other Prime Instant Videos with a short delay by starting the playback on my tablet and pressing a button in the lower right hand corner to start playback on the Fire TV.  Fling just plain works.AppsMany popular apps are available today and were pre-loaded such as a iHeartRadio, Showtime, Vudu, Crackle, Hulu and Netflix.  The pre-loaded apps that  I don't use I was able to uninstall with a couple of clicks from the remote.  I noticed that some of the games require the Amazon Game Controller which I have on order but won't have for a couple of weeks to keep that in mind as you download new games.  Other games can be played with the Fire TV remote.  As of today there are nearly 50 games you can play with just the Fire TV remote (use the filters when searching for games and filter on \"Fire TV\" and then \"Fire TV Remote\" on the left hand side).  Many of these games are free.ConclusionI've seen a lot of hype in the technical journals about the potential of this device to supplant existing media controllers.  I think the hype in this case is appropriate.  The simplicity of the device coupled with its capabilities and Amazon's content make me want to forget other devices even if they are cheaper or are shaped like a stick.  Amazon has built another winner.", "verified": true, "helpfulness": "4/7", "author": "Dwayne Jon \"Dwayne Jon\""}, {"rating": 4.0, "review": "I have an apple tv (2nd gen) , Roku box 3, and gaming systems like the ps4/Xbox One.I think that as a steaming box if you were to be starting out and purchasing your first one, the Fire TV does just as good as the competition and if you are already a prime member the fire TV will probably be the best choice.It's pretty sweet that the Fire TV comes already registered to your amazon account so right out of the box its setup and ready to go for streaming amazon prime movies.The only thing that bugs me is how all the movies have ratings and amazon is making predictions on what you would like to watch yet there is no way that I can find to rate movies after watching them on the fire tv. hopefully this will come in a software update and I can give the fire tv a full 5 stars.", "verified": true, "helpfulness": "2/3", "author": "MikesTooLz \"Mike\""}, {"rating": 3.0, "review": "The Roku has both support for your music purchased from Amazon through the Cloud Player and a remote app that allows you to control the device through your Kindle Fire.  This device has neither.The curious absence of both features makes this device less integrated with the Amazon ecosystem than the Roku.The remote doesn't use IR, so you can't control the device with your universal remote.The ability to \"fling\" videos from your Kindle Fire is only supported on the HDX devices.  I have a generation one Kindle Fire and will be swapping my new Fire TV out for my old Roku until Amazon publishes a remote control app and adds a cloud music player.The video content loads faster and buffers a bit less (which really wasn't a problem with my Roku).  Overall, I'd still rather wait 10 seconds for content to load and be able to control the device with my universal remote or my Kindle Fire.The search feature works great but only for Amazon content.Bottom line:  I own nearly every streaming device ever made (PS3, Xbox, Streamium, Netgear EVO, Roku, Roku XS, Google TV) The content display is indistinguishable from the ROKU and not quite as sharp as the PS3.  I bought this device assuming there would be better integration with Amazon's ecosystem (because that's what I'm committed to).  I hope they get to that.", "verified": true, "helpfulness": "3/6", "author": "techie1 \"techie1\""}, {"rating": 3.0, "review": "Any chance to have plex application on the amazon Fire TV.In that case I would be interested in buying one.Thank you for your answers ?", "verified": true, "helpfulness": "0/7", "author": "julielaurent8"}]