[{"rating": 5.0, "review": "i stream everything off of Thanksfornothing.org  everything works great love it", "verified": true, "helpfulness": "0/0", "author": "Urif Aggot"}, {"rating": 1.0, "review": "I would like to say that I feel like the $35 was well spent but that would be lying. Something i really cant do because i failed salesperson/marketing training.  This device, while it does offer the ability to stream from my laptop or an android device, is limited in what it has loaded on it.  I was hoping it would come with its own browser but I guess browser software is so bloated anymore it wont fit on something like this.  Also you really can't use this without it being plugged into power. What the heck is the purpose of that? Why can't it get power from HDMI? I was sadly disappointed and feel like the $35 i spent could have been better spent on something else like a couple of good wines or some good beer or maybe even a dinner.", "verified": true, "helpfulness": "0/0", "author": "HonestJoe"}, {"rating": 5.0, "review": "Love It!", "verified": true, "helpfulness": "0/0", "author": "SP"}, {"rating": 5.0, "review": "Works spectacularly. Easy set up, quick shipping.", "verified": true, "helpfulness": "0/0", "author": "DJL"}, {"rating": 5.0, "review": "Excellent gadget can't live without it anymore,  watching all series in TV", "verified": true, "helpfulness": "0/0", "author": "Alberto Reyes"}, {"rating": 3.0, "review": "Returned, could not find a good reason to keep it, already have a Roku box", "verified": true, "helpfulness": "0/0", "author": "WR8"}, {"rating": 5.0, "review": "Very happy. The service level was superb. The Chromecast got here fast and at the right price. We are all very happy here.", "verified": true, "helpfulness": "0/0", "author": "Sidustar"}, {"rating": 4.0, "review": "we bought a few of these to put into different rooms of the house (kitchen, living room, etc) so we can easily send media to nearby screens. works fine, just wish app support was more widespread and not just netflix, youtube, and those unknown services nobody cares about. 4K support would be nice too but thats probably in the next iteration of the hardware.", "verified": true, "helpfulness": "0/0", "author": "poematik"}, {"rating": 5.0, "review": "This thing is pretty awesome. Whether you have a smart phone or a computer you can get a lot out of this thing. Doesn't take up any space and is really inexpensive. Make sure your TV has a USB input.", "verified": true, "helpfulness": "0/0", "author": "Sir"}, {"rating": 3.0, "review": "Very good, I bought it for my parents and they are using it a lot. Would be better if there is storage for some apps instead to use the phone or even a computer.", "verified": true, "helpfulness": "0/0", "author": "Michael BR"}]