[{"rating": 5.0, "review": "I have a couple of different TV items and the Fire TV is for the best an easy one to operate. If anybody buys one or any other thing from Amazon be sure to try and purchase the PRIME. I is very much worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love it!  It is worth every penny. It takes my flat screen to a smart tv. Even my kids love. We r a fire family!", "verified": true, "helpfulness": "0/0", "author": "madeline florance"}, {"rating": 5.0, "review": "Exceptional product. Highly recommended...well packaged, easy set up, love the voice feature...fast, easy to use, exactly as advertised. Amazon has a winner here.", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 5.0, "review": "totally a cool concept! little difficult to get my kindle to stream to tv screen, but am able to skype so all is good!", "verified": true, "helpfulness": "2/2", "author": "gameplayer"}, {"rating": 5.0, "review": "I love the Amazon Fire TV. I love how easy it is to use and find shows quickly for my three year old grandson. We bought this product thinking it would be nice for Netflicks . I was very pleasantly surprised at how well the voice activation work!!!!! Such a plus when looking for a certain show. Our Amazon Prime is wonderful to use. We plan to buy at least one more if not two.", "verified": true, "helpfulness": "0/0", "author": "Sue G."}, {"rating": 2.0, "review": "I purchased this product thinking I would be able to stream a lot better at the far side of my home.  It works no better that my Roku which was half the price.  The  Roku is a bit friendlier to use.  I can add new channels with no problems. I do like the remote on the fire. The voice command is great,  Not sure if any of the movies  are free as all my request came with a cost. My kids like watching the WWE Network and the Fire does not offer the WWE Network.  I'll keep it for a month to see if it will grow on me. I don't think it will.", "verified": true, "helpfulness": "2/2", "author": "el toro \"SFC TORO\""}, {"rating": 5.0, "review": "Voice recognition really works every time. The picture is so much better, also. Great product and very affordable. Highly recommend.", "verified": true, "helpfulness": "1/1", "author": "Elizabeth C. Feldt"}, {"rating": 5.0, "review": "I had a basic Roku and decided to give this one a try. Overall the most impressive thing for me is the very high resolution - it is a danged good picture. It comes loaded with all of my Amazon stuff. It was extremely easy to hook up and maneuver around once it was going. I like the display screens. The Pandora is very cool. I loaded some of my photos and he slide show is impressive and fun. So, Gary Busey is odd but is right on the money, this is a great addition to my home video system.", "verified": true, "helpfulness": "2/2", "author": "Gary Flanders"}, {"rating": 5.0, "review": "We try to watch it as much as possible and with Prime it opens up an endless venue of movies and games.", "verified": true, "helpfulness": "1/1", "author": "Bruce Hostetler"}, {"rating": 5.0, "review": "easy set up, easy to use I'd like better on content on prime but it's free so what's to complain about", "verified": true, "helpfulness": "1/1", "author": "loren bartlett"}]