[{"rating": 5.0, "review": "Damn fine product.  Gave up the xbox prime for Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Fydor"}, {"rating": 2.0, "review": "Its alright. The UI was unimpressive to say the least and there was no oomph factor in the whole experience. Installing Netflix App was an ordeal and certainly, it seemed that installing other apps was going to be not a simple process. So far, I have tried many other streaming players and Roku 3 has been my favorite hands down!", "verified": true, "helpfulness": "0/1", "author": "Sharad Gupta"}, {"rating": 5.0, "review": "The best media player out there...i like that you can use your phine as your controller... Great device..", "verified": true, "helpfulness": "0/0", "author": "Chris Tam"}, {"rating": 5.0, "review": "We got the Amazon Fire TV for Christmas and can I just say this was love at first sight for all of us.  The set up is simple, it streams beautifully (much better than our Samsung smart DVD player or our Roku), and it is packed with features that you will actually use.  My daughters loved the gaming features and I may just have to break down and purchase the game remotes.  My mom (not tech savvy) was amazed by the picture sharing and music streaming.  We all loved the search by voice feature on the remote- totally accurate every time.  We did a lot of seaching on Christmas day without difficulty.  I absolutely adore the screensaver's beautiful picture display.  I actually sat for some time just watching-  I think it would add a special touch to a party.The Amazon Fire TV beat our Roku by a wide margin.  It is vastly superior in features and streaming-- no buffering with the Amazon.I definitely recommend having a Prime membership-- while it is certainly not required-- we have taken advantage of the free movies, tv shows, music streaming, and free picture storage.  I am currently uploading 10 years of photos and loving watching the the slideshow as it grows.  Also, my hubsand and I are binge watching Sons of Anarchy on Amazon Prime right now.  Its awesome (the Amazon Fire not just SOA).  :)Another thing about the Amazon Fire TV is that ease of set up and use.  Its virtually idiot proof.  After watching our unit in action, my extremely tech phobic parents are buying one of their own.  That's about the most ringing endorsement I can give this little wonder.One last thing, having expereinced both the ROKU and the Apple TV, for the price, the content and features I highly recommend the Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "J. Cathcart"}, {"rating": 5.0, "review": "It is great and makes life so much more enjoyable. It is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Isabart"}, {"rating": 5.0, "review": "Received Amazon Fire TV as a gift and so far I love it. Lots of movies and TV shows available. I especially like the voice command to search for shows or movies.", "verified": true, "helpfulness": "0/0", "author": "Judith Malys"}, {"rating": 5.0, "review": "If you are a prime member you are crazy not to get this product.  I am going to order the gaming controls just for fun.", "verified": true, "helpfulness": "0/0", "author": "Kathleen M. Willenbucher"}, {"rating": 5.0, "review": "I have tried a number of products Google Chromecast, WD TV, Logitech Media Center, Kindle HDX with Mircast and a Sony Blu-ray with Ethernet connection. I went with the Fire TV because I have an Ethernet connection available and I am an Amazon Prime customer. I use Amazon and have yet to try Netflix, etc. or I have tried the alternatives and don't care for the offerings. Set up was easy. On one show the playback stumbled for a micro second but otherwise the playback was as you would expect with an Ethernet connection.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Would have given higher rating if the HDMI cable had been included or indicated it would be needed to set up.", "verified": true, "helpfulness": "0/0", "author": "Nance"}, {"rating": 5.0, "review": "I love this set-up", "verified": true, "helpfulness": "0/0", "author": "Daniel A Woods"}]