[{"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/1", "author": "Jose alcantara \"JA\""}, {"rating": 5.0, "review": "it does what it's supposed to do. my kids are happy to watch netflix on tv and watch youtube games on it. good product.", "verified": true, "helpfulness": "1/1", "author": "R. santana"}, {"rating": 5.0, "review": "Great !", "verified": true, "helpfulness": "0/1", "author": "Chaim-Moshe T."}, {"rating": 5.0, "review": "Work great.", "verified": true, "helpfulness": "0/1", "author": "David GreenSeeker"}, {"rating": 5.0, "review": "Best thing since sliced bread.", "verified": true, "helpfulness": "0/1", "author": "B. Bennett"}, {"rating": 3.0, "review": "extremely limited. for ten  bucks more you can get the amazon fire stick which has its own Operating System and remote and doesn't require another device (android, ipad,...) to be the interface. not even windows 8 compatible.  the amazon fire is stand alone ( though it does interface to my android nicely ), has two versions and built in games. lots of apps incudluding netflix, sling tv, amazon prime,... I tried the chromecast sent it back and ordered 1 amazon fire tv  stick and 1 amazon fire tv box and an amazon fire gamers bundle ( comes with the game controller ) and now even with 3 younger kids my house is cable free. chromecast is ok if you want to play back only items on your device, broadcast to a hdmi enabled projector or show something you are doing on your handheld device. anything more than that, get the fire.summary,, chromecast ok if there was nothing else available but fortunately, there is a choice.", "verified": true, "helpfulness": "0/1", "author": "dirkjal"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Frederick"}, {"rating": 2.0, "review": "This product seemed good at first seeing as how I don't have a smart TV. I quickly learned however that the device refuses to connect with my iPhone 6 which I use to cast Netflix to my TV. Very annoying that it only works about 1/3rd of the time.", "verified": true, "helpfulness": "1/1", "author": "Dylan"}, {"rating": 5.0, "review": "This thing is amazing.  I ordered it because I like to watch movies with my family and I had this hdmi cable that had to be connected to my phone. So when I wanted to watch a movie my phone had to be charged 100% so I could watch the whole movie without it turning off. SO WITHI GOOGLE CHROME that is overrr.. it is amazing. Its wireless so I can be texting and watching the movie at the same time with out it showing on tv. My phone can be charging in my room and the movie is still going on in the living room tv. So I recently discovered this by accident. . My family and I were watching a movie then I had to go to the store 1 mile away to go buy something, then I got home and they were still watching the movie, I took my phone with me and the movie didn't stop. Idk how that works, but I love it. I can use it with my ipad my android, my sister's phone, and my mother's phone. So anyone can pretty much have access to it. I give it a 5 star rating,  it is amazing and easy to use.", "verified": true, "helpfulness": "0/0", "author": "gloria hernandez"}, {"rating": 5.0, "review": "wonderful", "verified": true, "helpfulness": "0/1", "author": "Ghamaa7k"}]