[{"rating": 5.0, "review": "I bring this handy device on work trips and vacation to bring any entertainment I have with me.  Perfect to listen to music if those channels aren't available where you stay.", "verified": true, "helpfulness": "0/0", "author": "Ryan Joseph Wiese"}, {"rating": 5.0, "review": "Its nice, fast the best streaming exist, really really really usefull, I recomend to everybody using this good and brilliant dispositive...", "verified": true, "helpfulness": "0/0", "author": "Wilfran Hiciano"}, {"rating": 4.0, "review": "Is a really good choise to buy, the only thing is that is possible to have only one chrome tab at a time.", "verified": true, "helpfulness": "0/0", "author": "Maria Angelica Rivas"}, {"rating": 5.0, "review": "I have used this item for about to mouths linked it to my phone by downloading an small app. And linked the Google Chromcast to my wifi router and Away I went \"password needed for some\"  .", "verified": true, "helpfulness": "0/1", "author": "Andrew Birdsong"}, {"rating": 4.0, "review": "It's not an AppleTV but it will work for Netflix.  Having the control on the smart phone is great since you don't have to keep track of a remote.", "verified": true, "helpfulness": "0/0", "author": "BoomerSooner"}, {"rating": 5.0, "review": "Will buy it again and again. Even if your TV has wifi, the fact that you can mirror anything that is in your computer rocks! Best gadget for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "While at first it was pretty buggy such as crashing after about ten minutes of casting, with the passing of a few updates the experience became more stable. A helpful tip to casting is to connect to the Chromecast before selecting any video, because sometimes the Chromecast icon doesn't show up while a video is playing. The initial setup was fast and easy taking a maximum of ten minutes. Overall, a useful product for people who watch shows on a regular basis and want an inexpensive solution for watching it on the TV.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 4.0, "review": "I have just ordered my second Chromecast for my home. The first one was placed on my bedroom TV and has been great. It has support for my Netflix and Hulu accounts and lets me play YouTube videos on my TV. It is easy to set up, and only takes a few minutes. Once set up, each additional phone or tablet only requires about a minute to connect.It would be better if it supported all video apps or allowed mirroring of the tablet screen. However, these are minor drawbacks compared to the overall utility. Also, several apps have gotten updates since I bought my first one and now allow me to stream video.Good:Connects easily to multiple devicesReplaces my much more expensive cableSupports access to my most used video applicationsReplaces my remote control for most TV functionsBad:It is not quite instantaneous and sometimes requires me to restart Apps or my phoneIt does not have support for all video apps (this can presumably be corrected by third party Apps, but they cost extra)", "verified": true, "helpfulness": "0/0", "author": "Leslie Dane Hanna"}, {"rating": 5.0, "review": "This is the easiest way to use Youtube or Netflix on your television. I got this so that I could stream Netflix on an older, non-smart TV and I find that the picture quality and ease of use is so great, that I'm considering getting another for my smart tv... the smart TV interface isn't nearly as appealing as the Chromecast. Best $35 I've spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "Jason C."}, {"rating": 4.0, "review": "This is a really handy device!! Setup took a little longer than I would have liked, but it wasn't too bad. (And I'm still a noob when it comes to technology, so if you know stuff about setting up dvd players/gaming consoles/etc you probably won't have any issues.)", "verified": true, "helpfulness": "0/0", "author": "Phobic42"}]