[{"rating": 5.0, "review": "Amazon Fire TV works exactly as advertised.Easy to install and the voice activated search capability is the best I have ever used.", "verified": true, "helpfulness": "0/1", "author": "Bonnie Gardner"}, {"rating": 5.0, "review": "the voice feature really works, you got a lot of stuff to watch and there are subtitles almost everywhere (which I need cause I am not US), setup takes 5 seconds. Recommend for people who have prime and are familiar with how it works. Seen that some complain that there is no on/off button and I agree, that's nonsense, wonder why... also people complain that there is no way to discern between free and paid content, that's when your prime account comes into play because on a computer you can search for \"free amazon instant video\", find titles, and then add to your watch list on amazon fire. Otherwise, you have to click on the title, and then it shows if it is something you have to pay or you get free.Done registration to Netflix (new to this) cause it comes with one month free. Also added YouTube. will add hulu plus too to compare to netflix. Really easy to download and install apps (like on your phone). Recommend this if you watch mostly movies and tv series and listen to music. However, there are a couple of apps with news too, even though not my favorite. Lots of games too. Video quality is great!! much better than tv provider. I have realized that cancelling charter tv (which was more than 80 per month to have basic service) even if I confirm membership to netflix and hulu and pay for both every month, I will have repaid the expense of the amazon fire in less than two months, and I will then spend less than 20 a month..love it!", "verified": true, "helpfulness": "3/3", "author": "chris"}, {"rating": 1.0, "review": "I started working fine, we are very happy with the device we acquire. the problem was y hay it failure after 2 weeks and now I can not connect to internet", "verified": true, "helpfulness": "1/4", "author": "Gilberto Rodriguez Herrera"}, {"rating": 4.0, "review": "i tried the competitors: Apple TV, Roku 3 and now Fire Tv. The Apple TV seemed half baked and stale, the roku 3 was nice but there was no way to overcome the HDCP handshake (old plasma screen) and i just didn't cozy up to it. While Steve Jobs was alive he said that he cracked the \"TV Code,\" Perhaps? But i think Amazon has beaten Apple to the punch. Just wondering how many Apple engineers it takes to \"screw in a TV set\"? Also, how many Apple employees have the Fire TV in their house in favor of the lame-o Apple TV?Anyhow, for a first gen box the F-TV box is fast, intuitive and impressive. I have been streaming wireless with the box and the quality is just shy of S-VHS/DVD. Some stuff obviously looks compressed in some scenes, but generally speaking good enough to consume the content. I am planning on tethering the F-TV box with a cord in the near future.My only cons (pet peeves) with the box that warrant the -1 *:The voice command works well enough, but not stellar by any meansThere seems to be no way to turn off the paid content for free \"Prime Video\". They are trying to force your hand into paying for something you don't want - as if i will stumble upon a movie and then want to pay? There are work arounds using your computer and clicking PRIME MOVIES, but it is like driving to Costco and parking a block away. Really? Your going to make me walk. Just too much leg (finger) work. Not Cool.The F-TV seems to be very similar to what you would get with a smart tv or a blue ray player with all the channels and such? I do think the interface is nice and simple and the box is quaint and the remote is nice. Overall a solid 4 star Keeper.6/3/2014 Update:wish the fire tv had a volume up/down button on the remote. overall the remote is nice, but i just don't like having two remotes and juggling between them. In a dark room you don't know if the remote is up or down. it would be nice if either the buttons were illuminated or there was some illumination on the search button so you knew which end was up?", "verified": true, "helpfulness": "1/1", "author": "Mitchell Kasdin"}, {"rating": 4.0, "review": "To many expensive programs - very few free programs beyond Netflix. otherwise a great idea once how to use is figured out. also easy to mistakenly select cost program with no way to cancel the purchase", "verified": true, "helpfulness": "0/1", "author": "bothreed"}, {"rating": 5.0, "review": "I have an Apple TV and other devices that stream video, but Amazon has gotten it right! I love the voice search. So easy to look for movies and TV shows without having to do the tedious scroll and type one letter at a time thing. L-O-V-E it!", "verified": true, "helpfulness": "2/2", "author": "S. D. Smith \"Tech Addicted\""}, {"rating": 5.0, "review": "other than the fact that I have trouble getting the tv to switch back and forth, I think the fire tv is great..", "verified": true, "helpfulness": "1/1", "author": "BARBARA NICHOLSON"}, {"rating": 5.0, "review": "Fast. Crystal clear. Voice recognition great.  Easy to use  Set up in 5 min. Better than I hoped  Love it!", "verified": true, "helpfulness": "0/0", "author": "CATHERINE P. BADEAUX"}, {"rating": 1.0, "review": "this product is new to the market I have tried it sucks please save your money and get something else my nefllix will not play on it, just save your money im returning mine back to amazon and im getting my money back.", "verified": true, "helpfulness": "3/14", "author": "prince"}, {"rating": 3.0, "review": "It's a neat little box. The voice search is a cool idea, and works great. I have a problem with the sound. Using a HDMI cable for both sound and picture, I get this horrible feedback. So I used an optical cable for sound and the feedback issues went away. I'm also not impressed with their selection of apps. I need Spotify and Vudu. Those two apps are where my music and movies are. Roku has them and pretty much every other device has them. I'm making use of the 30 day free trail Amazon offered Prime Members. I'm not sure yet if I'll keep it.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}]