[{"rating": 5.0, "review": "I love using this device. Chrome (beta) recently introduced casting html5 videos to chromecast. I have one for each tv and it has been well worth it.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 3.0, "review": "The device itself is pretty impressive for the price, being able to stream videos from the phone and computer are nice but google really needs to get more apps for this device. Right now it is far behind its competitors but has the potential to be an amazing device.", "verified": true, "helpfulness": "0/0", "author": "Georgeous"}, {"rating": 5.0, "review": "This is one of the best things I have purchased in a long time. Works great, and is extremely simple to use. One of the few things I have ever purchased that is exactly what was promised. Works great with Nexflix, Hulu, Pandora, and other.", "verified": true, "helpfulness": "0/0", "author": "D M Watts"}, {"rating": 5.0, "review": "My friends and I can use it with our Android devices, or iPhones and iPads...I can even use it with any computer that has the Chrome browser (basically any decent computer these days)I love that the Chromecast is Not restricted to one platform like other products (e.g. Apple Tv, Amazon Fire Tv, ...)I hope the next version does 1080p but the current 720p is also pretty good.", "verified": true, "helpfulness": "1/1", "author": "Sep"}, {"rating": 4.0, "review": "use it only for netflix and youtube which works great. will be 5/5 once the chrome tab streaming goes live (out of beta).", "verified": true, "helpfulness": "0/0", "author": "Jaymin"}, {"rating": 1.0, "review": "Not to happy with .not user friendly and you can only view compatible sites with it. Does not do what the product description says. Sorry", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Chromecast is great. I use it all the time. It would be especially good for someone who has a TV with a HDMI port that isnt a smart TV, but would also make a smart TV alot easier to use by controling the media via a phone/tablet rather than a smart TVs often unfriendly interface.", "verified": true, "helpfulness": "0/0", "author": "Steve L"}, {"rating": 5.0, "review": "This along with Netflix or Show Box is a cable TV killer. It's a must have device for those who want to save money.", "verified": true, "helpfulness": "1/1", "author": "Subhan Tariq"}, {"rating": 4.0, "review": "I've been using my Chromecast for several months now. Initially I was very excited when I first set it up, but its limitations started showing up very quickly leading to disappointment and 'do I really need this?'. Now, it has its own niche place in my collection of media devices, where its very useful in specific situations.Pros:1. Very easy to set up. Its amazing how your phone can detect the Chromecast as soon as you plug it in, without the Chromecast needing your wifi password. I have no clue what kind of hackery makes this possible. My Sonos was similarly easy to set up, but Sonos requires at least one wired connection, so its not surprising. With the Chromecast, its magical.2. Unlike a popular misconception, you only need your phone to be on the same wifi signal as the Chromecast for the initial set up. After the initial setup, ANY device on the LAN can control the Chromecast. I have several routers and wireless bridges set up across my high-interference apartment with both 2.4GHz and 5GHz signals being broadcast. Only the Chromecast is connected to the 2.4GHz signal, yet all my computers, phones and tablets can control it.3. Casting Netflix and Youtube videos is really easy.4. The device takes up a very small footprint. This isn't such a big deal for me, but it could be for many minimalists.5. Its cheap!6. It takes advantage of CEC to control the device it is connected to. It can both turn on and change input on a CEC-enabled TV. In my case, I have it connected to a CEC-capable HDMI switch, so it cannot turn on my TV (which is desirable in my case, since I use a harmony remote and automatic power state changes can get my remote confused), but it can automatically change the input on the switch to itself, which is a great feature.7. Its always ready to go. Unlike my PS3, it doesn't require a 2-minute lead time to turn on and get to a video. Its also great to be able to calm down a toddler in the living room when you're not physically in the same room, since you always have your phone with you.8. My HDMI switch is connected to my SONOS Playbar, so this set up allows me to use the Chromecast as a youtube music player without turning on my TV or having to change inputs.9. Nice collection of rotating wallpapers when nothing is being played.10. Supports 5.1 sound output.Cons:1. The 2.4GHz-only limitation is a big limitation in high rise buildings. I had to move one of my routers right next to the Chromecast to get consistent, good-quality playback.2. Casting from an android device works most of the time, but casting from a chrome browser on a PC is hit-or-miss. I have a 60% success rate, so I rarely use it.3. Several workarounds exist to play local content, but the experience isn't great - playback is laggy, there are audio-video sync issues, etc. and its just not something you would rely on the device for unless you're in a pinch.4. Though you can cast anything from a chrome browser tab, there are too many limitations - it needs to keep playing on the browser in the PC, the experience can be a bit laggy, etc. Again, not something that works well enough to keep using.5. Most of the limitations stem from the fact that the device does not have Ethernet support, meaning the available clean bandwidth is severely limited.6. Google hasn't really been very aggressive in expanding the feature set or adding more content sources. This is really the challenge with Google. The company suffers from an attention deficit disorder and you never know if a product or service they offer will be expanded or not.Right now I have the following media sources in my living room:TV: LG 55LM8600. Its a smart TV but I do not use the smart features since audio out is only stereo. However I do use the iMediaShare android app to play camera videos on my phone directly to the TV.HDMI Switch: Monoprice 4x1 HDMI switch with SPDIF output. I use this because my Sonos Playbar only supports SPDIF input and the SPDIF output from my TV is stereo-only.Controller: Harmony One RemoteAudio: SONOS Playbar + SUB. Apart from being my home theater, it also plays all the local audio stored on PCs on my LAN. Also use it for radio and Pandora. It also allows my Chromecast to be used as a youtube audio player.Media players:1- PS3. Main source for Netflix and Amazon VOD. It is wired to my FIOS router, so playback quality is always consistently good.2- Chromecast. Mainly used as a youtube video/audio player. Used for Netflix if in a different room and need to calm down someone in the living room.3- PC. Connected via HDMI as an extended display. Use 'universal remote' android app to play locally stored videos or view livestream events.4- FiOS Set-top box. TV!Overall, the Chromecast is a great addition to your Living room setup provided you are aware of its limitations and do not expect it to be the be-all and end-all media player for all your needs.", "verified": false, "helpfulness": "0/0", "author": "Ramkumar Balaraman"}, {"rating": 5.0, "review": "Sweet little gadget. Heck of a price. Perfect for someone who doesnt have cable in their bedroom and wants to watch something on tv without having a big ole dvd player in the bedroom. Control from phone is smooth and simple.", "verified": true, "helpfulness": "0/0", "author": "Jesse W. Blum"}]