[{"rating": 1.0, "review": "I followed the directions for setup, did not work. Google was no help.  I will stick with my Apple TV", "verified": true, "helpfulness": "3/27", "author": "rickeylee51"}, {"rating": 5.0, "review": "I was extremely impressed with how trivial this was to set up:1) Plug into a USB port and a HDMI port on the TV2) Go to the URL it tells you to3) Install the application & it finds the device (you can customize the name of the device if you have multiple of them).4) Give it your wifi password5) DONE!After that, to watch a movie simply:0) Turn on your TV (doesn't even matter what input I had it on)1) Open up the application you want to play through Chromecast (Netflix, Youtube, Google Play, ...)2) Tell the application that you want it play through chromecast3) The TV switches inputs automatically and starts playingYou can control pause/rewind/forward/jump/volume from your device, but you're NOT using twice your wifi bandwidth by streaming to your mobile device from the internet and then having your mobile device stream to the Chromecast.  It's going straight from the internet to Chromecast, and your device can remote control the chromecast, Brilliant!Multiple people on the same network can connect to the chromecast, the last command wins.I have to say, I wish these were everywhere.  It would be great if it had the ability to have the \"ready to cast\" screen have customized widgets like Google TV, but I really like the price so maybe in a premium version.", "verified": true, "helpfulness": "2/3", "author": "An avid shopper"}, {"rating": 5.0, "review": "I've had the Chromecast for about a week now, and despite a few little hiccups have been incredibly impressed and pleased.  Considering the price, I feel like this is a no-brainer purchase if you enjoy streaming shows from Netflix, clips on Youtube, and/or movies out of Google's store.Setup was a little more complicated than I was expecting.  I have a dual-band router, both with the same hidden SSID.  The Chromecast has an option to enter in your hidden SSID so it seemed like there'd be zero issue.  Entered it correctly, verified, and it just couldn't find my network.  I went back and tried a few times, thinking I must have been fat-fingering a button.  No luck.  I un-hid my 5ghz SSID, tried connecting, no luck.  It only worked after exposing the SSID on both 2.4 and 5ghz bands before it would connect.  Somewhere on the device page it says it does work with 2.4ghz hidden SSIDs, and I may try re-naming that band and hiding the 5ghz again.  But I hear that's not actually too terrible a thing to break through if somebody's actually seeking to get in so I might not even worry about it.Anyway, once setup, it's worked great with my HTC One.  Finding content through Netflix, Google Play, and Youtube on your phone is so much more convenient and intuitive than searching on the apps on your TV, or 360, etc.  Basically - any box where you have to fumble with a remote to do searching and navigation, this is better than.  You kick off a movie/clip, cast it to your TV, and the phone is free to do whatever else you want while the content plays.  At any time you can get back into the casting app and pause/resume content.  Super slick.I tried out the casting extension on my chrome browser, and it works about like you'd expect.  You can cast a tab, and all content on that tab is sent to your TV.  Works reasonably well for me, and I can definitely see the use cases (photo sharing, watching things you can't get to through the other mediums you have).  I tried streaming a movie through my Amazon Prime account, and while it worked, the audio wasn't 100% synced up.  And of course if you want it full-screen, you have to give up your laptop while the movie plays.  Also - my laptop (retina MBP) got really hot, and really noisy.  My recommendation would be to not expect to use this feature on a regular basis for streaming content.One other downside I noticed is that while casting a netflix movie, the netflix screen takes up the entirety of my lock screen.  I received a phone call, and the phone was ringing but the caller information was missing, as were the 'Answer' and 'Ignore' buttons.  Had to \"back\" out of the netflix info (which is just weird on the lock screen to have to do) before they showed up.  Google Play Movies did not have this problem, yet still allowed you to pause/resume from the lock screen.Anyway - I really can't recommend this thing enough.  It isn't perfect, but it's also not expensive enough to expect perfection.  If you like Netflix, Youtube, and Google Play content to be on your TV, this is the easiest and cheapest way to get it there.  If you have other ways to get it there, this is still a worthy investment as it's infinitely more pleasing to use than a TV-remote based application.Very, very pleased.", "verified": false, "helpfulness": "8/10", "author": "J. Swartzy"}, {"rating": 4.0, "review": "the power supply did not work in any outlet.  When the cord was used in a device with a USB outlet, the Chromecast works perfectly.  The power supply DOES NOT work and without a near by USB power source, it would not work at all.", "verified": true, "helpfulness": "1/3", "author": "Michael Moffatt"}, {"rating": 4.0, "review": "I was initially disappointed until I discovered how to share my desktop and stream my videos outside my browser tab, now I'm elated.  #teamchromecast", "verified": false, "helpfulness": "1/1", "author": "K. Young \"DSTPYT\""}, {"rating": 4.0, "review": "For what it's supposed to do, it does it well. I use it to stream YouTube videos I'm watching. My problem is I mainly use Apple stuff, so switching to Chrome is another step. Another \"another step\" - switching to HDMI 3 on the TV. It'd be nice if it was all automatic, but that's not the situation yet.Again, for what it's supposed to do, it does it well. That's probably all that really matters.", "verified": true, "helpfulness": "0/2", "author": "R. Johnson"}, {"rating": 5.0, "review": "I've been extremely happy with my chromecast. Setting it up took about 5 minutes and it's pretty mindless. You're prompted to visit a website and install the utility on your computer. Once you type in your wifi password, you're set and it's ready to cast. It hides behind my television and is plugged into one of my TV's USB ports, so whenever the TV is on, it turns on as well. It streams Youtube, Netflix, and Google Play services rather flawlessly. I had a few moments where it got lost and I couldn't find the controls to pause or stop a video on my phone. Casting a tab (a beta feature) worked well, but I think it has a lot to do with having a fast, reliable router. I tried it at a friend's house and the playback and quality definitely suffered on his inferior equipment. He's looking to upgrade his setup just to keep this feature. Overall, Chromecast is a great way to get videos onto your TV. I'd love to see more sites and apps supported, and it looks like that will happen, as HBO and Hulu have said they will support the device later.", "verified": false, "helpfulness": "3/4", "author": "itsgbro"}, {"rating": 5.0, "review": "Yes! The update came and everything works on my bionic, even my wife and son razor maxx cast with YouTube on the tv and they do not even have the app for chrome cast. Works well on the desk top.", "verified": true, "helpfulness": "1/20", "author": "Hill Varnadoe"}, {"rating": 2.0, "review": "I've purchased this device from google store, this device does what is says for $35 that's it. Beware... Veetle do not work, also many flash video from chrome do not work & if work it do not sync. Waste of money. Not happy with this Google product.", "verified": false, "helpfulness": "1/11", "author": "Zubin"}, {"rating": 5.0, "review": "Nice 3 month Netflix deal, great price, super fast shipping.Streams high quality videos from YouTube which is great as I watch hour long episodes.  Arrived just in time for the current season of the show I watch.Netflix on it is nice too of course. Much more convenient to use than Roku menu wise and time to boot and all that.I like that you can use the remote Android app, but yet once the command is issued, it doesn't use my phone's cpu/battery.  A huge plus.All in all satisfied greatly with it.  Hope they add more apps like Amazon Video to it soon!  C'mon Amazon, work with them to get the Amazon Video app on it! :o)", "verified": true, "helpfulness": "2/3", "author": "AdoptAPet \"Adopt a shelter pet PetFinder.\""}]