[{"rating": 5.0, "review": "I will be glad to tell you that for $35.00 this little unit has given our family hours upon hours of pleasure and I activate it with just my Cell phone or Computer. Thanks for a great new way of entertainment.  Now let me tell you about amazon. Fast,! Fast is the way amazon is. I ordered this unit and was expecting it to be five days or so but we received this unit within 24 hrs. of amazon sending it. Great job.", "verified": true, "helpfulness": "0/0", "author": "Carl Hamilton"}, {"rating": 5.0, "review": "Great product, and easy to use! Do not expect it to be fully functional with your computer or smart device. It only works with the apps that Google allows. (Chrome/Netflix/YouTube...)", "verified": true, "helpfulness": "0/0", "author": "Josh Hartge"}, {"rating": 3.0, "review": "Nice to have for Netflix...but a little buggy sometimes. Needs to have more useful apps for the public. Not too bad...", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Gardner"}, {"rating": 4.0, "review": "Hi so far so good.  I gave as a gift to a relative who has a lcd tv that didn't have the wireless internet access built in but they had HDMI and usb port on the back of the tv.  They have a windows laptop connected wirelessly to their home router and like to view nature websites and You tube videos.  I needed about an hour on the phone to talk them thru the process of hooking it up and gaining access but once they saw it work on their tv and understood what the process was it's great.  They love it.  Now instead of crowding around a 15 inch laptop screen they can view on a 42 inch tv screen.  Great product Google!", "verified": true, "helpfulness": "0/0", "author": "marjala"}, {"rating": 1.0, "review": "I have a Roku and XBMC computer connected to my TV, and thought I could replace some of the features of both with a Chromecast.  Installation was fairly straightforward although I needed to modify my router to allow it to work correctly.  From there it went downhill.I figured the Chromecast would have the basic apps like Netflix, Pandora, etc on the Chromecast and I'd just control the unit with my phone (instead of a remote control).  But I was disappointed to find I had to install all the apps on my phone and stream them to my phone and then onto the TV.  This makes it useless to me, so its going back to Google.", "verified": true, "helpfulness": "2/4", "author": "CookOutLoud"}, {"rating": 5.0, "review": "100% is recommended.The product is excellent, the device is so useful that really looks like a tablet. With expansion memory can be used as a data logger, music and videos.", "verified": true, "helpfulness": "0/1", "author": "Oscar"}, {"rating": 3.0, "review": "dont get me wrong the item does what its supposed to but the streaming quality is pretty poor (even over 5GHz).", "verified": true, "helpfulness": "0/1", "author": "Anthony Nowak"}, {"rating": 1.0, "review": "I had the device for a few days and returned it. Streams very well from my Smartphone, however I purchased with the intent on streaming from my laptop. The Audio and Video streaming quality from it was consistently choppy and just flat out very lousy. I checked my laptop to make to sure it was fine. The Wi-Fi set up at home is stellar, so that's not the problem. It's back to connecting the HDMI cable to laptop to stream til something better is available.", "verified": false, "helpfulness": "0/1", "author": "Alfonso"}, {"rating": 5.0, "review": "This is the coolest piece of technology that's come out in the last 10 years.  There is no degradation at all in picture quality.", "verified": true, "helpfulness": "0/0", "author": "Jason W. Carpenter"}, {"rating": 1.0, "review": "false advertising. you should have informed me that there were limited apps i will go back to my ipad usage", "verified": true, "helpfulness": "0/3", "author": "pat o'harrow"}]