[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Miguel Ibarra"}, {"rating": 5.0, "review": "Works great and keeps getting better with updates from Google.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I am using a low-end laptop to send HBO GO to my TV. The HDMI out on the laptop did not work: the color was bad, and action was not fluid. The same lap top using Chromecast works very well. For a cheap device, it does a remarkable job.Unfortunately, each time I cast, I have to power the chromecast on and off, and sometimes restart Chrome once or twice, before the browser  sees the device. The Chromecast device is showing its screensaver on the TV, and I can see the device in Windows list of devices, but the browser still has problems connecting. Once connected, it is fine. Perhaps there will be an update to fix this in the future.A minor issue is that the device gets very hot. It does go into sleep mode, and wakes up when I select that source on the TV.", "verified": true, "helpfulness": "0/0", "author": "Eric P. Shade \"epshade\""}, {"rating": 2.0, "review": "Difficult to transmit from device to TV", "verified": true, "helpfulness": "0/0", "author": "Terry Bates"}, {"rating": 5.0, "review": "Fantastic！", "verified": true, "helpfulness": "0/0", "author": "Ryan Chiu"}, {"rating": 5.0, "review": "Great streaming device portable and very easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Kurt S Schutter"}, {"rating": 5.0, "review": "Cool products works great", "verified": true, "helpfulness": "0/0", "author": "jeff gordon"}, {"rating": 2.0, "review": "Works well at first. But when I stream screen from chrome in my computer to my TV. Sometimes the TV screen stops or move 0.1s by 0.1s. The screen in my computer is very smooth. I don't know why. I can hardly watch those video after cast to TV. My router or other thing are all very well.I feel really bad about it.", "verified": true, "helpfulness": "0/0", "author": "long"}, {"rating": 5.0, "review": "I use this every night. It works very well as long as you have Google chrome updated.", "verified": true, "helpfulness": "0/0", "author": "Ivette"}, {"rating": 4.0, "review": "Great product but you have to putts around to set up?", "verified": true, "helpfulness": "0/0", "author": "BL Meyer \"BLMeyer\""}]