[{"rating": 5.0, "review": "love this device", "verified": true, "helpfulness": "0/0", "author": "ddsut"}, {"rating": 4.0, "review": "I love it but had no instructions in the box....I really love the feature that you just press and tell it what you want.", "verified": true, "helpfulness": "0/0", "author": "Linda wk"}, {"rating": 4.0, "review": "A slight bit better than Roku. The HD quality makes the tv screen looked enhanced and moves/scrolls through options quickly to your selection. My only issue was some of the apps layout was a bit confusing and redundant. I highly recommend this one.", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 5.0, "review": "Bought first one, works like our Roko except for the voice feature which is nice..", "verified": true, "helpfulness": "0/0", "author": "Shaw Simonsen"}, {"rating": 5.0, "review": "Getting rid of AppleTV due to lost connections continually. This works great and was same money with more features.", "verified": true, "helpfulness": "0/0", "author": "Jeff J."}, {"rating": 5.0, "review": "Love this thing! I have had it for over a week and I realized that I no longer use my Apple TV. I prefer using this. Be sur e to get a Bluetooth keyboard with the Fire TV. This is an amazing device!", "verified": true, "helpfulness": "0/0", "author": "Affie"}, {"rating": 5.0, "review": "I bought this device for Netflix streaming and access to Amazon Prime content.  My blu-ray player was being used for streaming, but it had intermittent wifi connection problems.  And my internet speed is fast.  With the Fire TV, no more wifi connection issues.  The beefed up hardware in the box clearly makes a difference in performance.  I also like that it has an optical out port to send audio to my receiver.", "verified": true, "helpfulness": "0/0", "author": "L. J. Mammino"}, {"rating": 1.0, "review": "it would be a five, if I could get a faster speed, is there anything you could think of to help.I tried everything so far even You Tube no luck. thank you", "verified": true, "helpfulness": "0/1", "author": "ralph"}, {"rating": 5.0, "review": "Loved", "verified": true, "helpfulness": "0/0", "author": "Monica De Castro"}, {"rating": 5.0, "review": "I love it just wish it was full screen without the bars on the sides and it can be a little better i wish the i could stream the normal channels to like cbs nbc and abc without having to go out and get one of those digital stream boxes to watch the regular channels again other than that its great.", "verified": true, "helpfulness": "0/1", "author": "Steve Tipton"}]