[{"rating": 2.0, "review": "Google Chromecast has a lot of potential, but unfortunately a lot of it remains unrealized. Frankly, I was surprised to notice that Chrome on Android does not support it. I would have expected to be able to cast my Chrome tabs. Youtube works, so for that I'm giving Chromecast 2 stars. But seriously Google, if the product is called Chromecast, please enable it at least err... cast Chrome,If you're using Chromecast with a laptop things are a little bit better as on the desktop it is actually able to cast Chrome tabs and there's even a well hidden functionality to mirror the whole screen as well. Chromecast feels most useful when used with a mobile device, though. Hopefully Google focuses its efforts to make it work with them.", "verified": true, "helpfulness": "0/0", "author": "Mikko Vihonen"}, {"rating": 5.0, "review": "How about that. It works. Simple instructions. Easy set up. Tried NetGear. That sucked. Buy this instead. An easy decision.", "verified": true, "helpfulness": "0/0", "author": "James Gaines"}, {"rating": 5.0, "review": "I really like the Chromecast works great with iPad and iphone. Only wish is that it would cast more apps like amazon prime videos", "verified": true, "helpfulness": "0/0", "author": "Txrcarr"}, {"rating": 4.0, "review": "Doesn't let me see all YouTube videos. And haven't seen Netflix or hulu yet, sites want me to register account.", "verified": true, "helpfulness": "0/0", "author": "dan earles"}, {"rating": 5.0, "review": "If you're looking for a way to stream Netflix/Hulu/Google Play then this is for you! At $35 it's hard to beat, plus Google is always expanding the apps that can use it. It's awesome being able to bring up an app on my phone, begin the streaming, have the chromecast turn on my TV AND switch it to the correct input, and then the video begins playing. It's also cool to be able to stream tabs from Google Chrome, though it is a bit buggy at times. To be fair that part is in beta. If you cant figure out how to get the chromecast to turn on your TV automatically and switch inputs the chromecast requires power from an outlet (The USB port on your TV doesnt provide power unless the TV is on, which can also lead to slow startup times), and you also have to enable CEC on your tv. A quick google search for your TV model should show you how to do this.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Now I can use my phone to control Netflix on my TV.  So good it should be illegal! Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "Jill Oregon"}, {"rating": 1.0, "review": "If I play video from any other website , other than youtube, connection get disconnecting between my browser and chromecast. I have 55MB connection in my home..So I don't think its a network issue, its purely compatibility issue. I never expected a google product have such big issue.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "To those of you that feel this was a waste and restrictive consider who made this and what device you're using. If you're using and Apple product pretty much forget it.  This is out of Apple's Eco-system. Until Apple decides to support this (and I doubt they will completely) you should stick with Android or Chrome devices.  There's not much I can add to this that most people didn't already know but new apps are being added.Plex Media Server is The Saving Grace of the Chromecast.  I give Plex a 4 out of 5 stars for what it does it does it well. And that's broadcast your personal videos in full HD 1080p or 720p or whatever you resolution you recorded the video.  4 stars is for the additional fees associated with a Plexpass.  However these guys are working hard to bring you a one stop shop solution,so take that with a grain of salt as I see potential here.  One review I read spoke of this app already and I cannot tell you how correct he is about this app but that's only for videos, no music no photos for that read on.Avia is the 2nd App I'd like to discuss in detail because this is the one thing that most people complain about.  Broadcasting you're personal media.  But this also supports other DLNA devices too so it's not just limited to Chromecast.. It's a decent App and does the job appropriately but if I had to rate the app it would get 3 stars for the dip in resolution and only supporting specific type of formats vs all types.However I give the Chromecast 5 stars for the potential that it holds.  Given more time more apps will get onboard and I see the sky as the limit for this little dandy.So in a nutshell I'd say give it a go, if you have an Android device.  At $35 (there are small fees to unlock most of these apps but they still seem to be worth it.)", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Animaleyez\""}, {"rating": 4.0, "review": "I use this to watch YouTube videos on my HD display.  The best bet is an Apple TV for iOS devices but this is a fun toy to do things on the cheap.  I thought quality was totally acceptible and of course is limited by original source, your internet connection speed and potentially the performance of your home wireless network.  Had no issues with full HD Netflix of Skyfall with a 30Mbit connection.  Fun toy that can be used on multiple platforms - iOS users will find it lacking in terms of apps that can \"cast\" to it but that's what AppleTV is for.  I think for 35 bucks is awesome.  Sound was good too. 5.1 Dolby Digital or whatever...  It isn't going to beat your BluRay player - just understand that and you'll be fine.  Quality was excellent provided the source content was HD and connection was good.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Likes:-sooooo convenient-I got 2 chromecasts one of upstairs and downstairs. So when I need to do something in a different location I could continue watching what I was watching.-works on pretty much any device that is connected to your wifi.(I use my cell phone, tablet, sometimes my laptop)-easy installationDislikes:-anyone on your wifi can chromecast something on your TV (prone to trolling/pranking by your friends)-some apps not support yet for chromecast-casting a tab from Google Chrome has some issues not to major", "verified": true, "helpfulness": "0/0", "author": "Gianne Obrero"}]