[{"rating": 2.0, "review": "do not like grome", "verified": true, "helpfulness": "0/0", "author": "Davi d"}, {"rating": 4.0, "review": "Was very buggy at first. Then found you must keep unit you're casting off of in close proximity and in line with chome cast unit. After that, it's been a delight. Joy only limited by what's available to you to cast. Great for someone bedridden or just to enjoy whenever.", "verified": true, "helpfulness": "0/0", "author": "Warden"}, {"rating": 5.0, "review": "adorable item,simple to use and work great,using the google chrome is how you broadcast the screen from that browser", "verified": true, "helpfulness": "0/0", "author": "Alexander.L."}, {"rating": 3.0, "review": "Its OK. Despite having a nice ASUS router and putting the said router in close proximity to the device casting the feed and the TV, there is lag.  Would probably have not gone with this item if I had known this was a issue.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 2.0, "review": "I don't recommend chrome cast to ISO users, it's not worth the money or your frustration. We have had it for 3 months every time I turn it on I have to reset my router. We finally went out and bought the Apple TV it may cost a little bit more but it's worth every penny. Now I can watch my programs with no frustrations.", "verified": false, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Bruce Barrett"}, {"rating": 5.0, "review": "possibly the best purchase ever.", "verified": true, "helpfulness": "0/0", "author": "onyxind \"OI\""}, {"rating": 5.0, "review": "Ordered with Amazon prime. I came very quickly. I personally love chromecast. I went with my friend to Wal-Mart to get her one. I set hers up. Its easy set up. I now have one for all my tv's.", "verified": true, "helpfulness": "0/0", "author": "Chaelia"}, {"rating": 5.0, "review": "Works as a charm. My children are able to watch their shows on a big screen and I can stream mines.", "verified": true, "helpfulness": "0/0", "author": "Vanessa Lopez"}, {"rating": 3.0, "review": "Streaming can be sometimeish. When it works well, it works very well!", "verified": true, "helpfulness": "0/0", "author": "vetondenet"}]