[{"rating": 5.0, "review": "Easy setup easy software update excellent value 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Eric Rhoad"}, {"rating": 4.0, "review": "I have an Amazon Fire, Roku, and apple TV. The Amazon Fire is better in every way when it comes to watching video and appears to have one very big advantage... It appears to have better video buffering. I have a 26MBP internet connection from Comcast. Frequently the Ruku experiences a connection hick up which causes it to drop in resolution and it will not return to HD unless I reboot it or switch to another video and back. So far Fire TV with it's bigger better buffer has had no problems. The only negative is an annoying LONG introduction video that YOU CANNOT SKIP. This forced feeding of a dumbed down introduction video was frustrating and made me hate this device before I had a chance to use it! This hate has thankfully begun to morph into love :-))", "verified": true, "helpfulness": "0/4", "author": "Kevin Bohacz - bestselling techno-thriller author"}, {"rating": 3.0, "review": "I also have a Roku 3 in addition to the Fire TV. The Roku 3 has more apps than the Fire TV, which is somewhat of a disadvantage. It is nice to be able to have the capability to utilize a game controller when playing some of the games. I was able to connect my Xbox 360 controller to the Fire TV with an adapter. The voice search is very accurate; however, I found that it is unfortunately limited to Amazon content. Hopefully, as time goes on there will be additional apps and channels that can allow it to compete better with the Roku 3.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "really am pleased", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "set up in 5 minutes, love it", "verified": true, "helpfulness": "0/1", "author": "Dave flowers"}, {"rating": 4.0, "review": "Fire tv is great but amazon shipped it via lasership. Poor handling, no update about when it will arrive. Did not know amazon is relying on this company.", "verified": true, "helpfulness": "0/1", "author": "Animesh Roy"}, {"rating": 5.0, "review": "Awesome device!!!", "verified": true, "helpfulness": "0/1", "author": "Roy Escaname"}, {"rating": 5.0, "review": "This device is very easy to use and the interface is perfect.  I use it for my pled server and it works look Ile a charm.", "verified": true, "helpfulness": "0/1", "author": "Denis C. Labine"}, {"rating": 1.0, "review": "Trouble viewing nextflix, which was my main reason for buying.  I returned it.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to hook up and use.  Voice search works wonderful.", "verified": true, "helpfulness": "0/0", "author": "Nancy P"}]