[{"rating": 4.0, "review": "I have to dock it a star due to it's need to be always online. Sometimes my internet goes out and I want to stream from my Plex, but the stream ends even though the media is stored on my NAS.", "verified": true, "helpfulness": "0/0", "author": "Ryan Skeldon"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "JLB Chattanooga \"Tall Man\""}, {"rating": 1.0, "review": "The primary reason I bought the device was to stream Youtube videos on my TV monitor as the internet TV software bundled with my TV was no longer usable for streaming these videos. The device was easy to set up and it worked well for one day but by the second day, I could not cast Youtube videos onto my TV moniotor. I spent several hours on the phone with a Google technician in an unsuccessful attempt to fix the problem, so I returned the device for a refund. I then bought a Roku 1 device. It cost approximately $20 more than the Google Chromecast but it works well. I also prefer the remote control that operates this device to having to turn on my IPad or desktop computer to control the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "martyg"}, {"rating": 5.0, "review": "Love my Chromecast as it can stream anything (even web pages from my computer) to my TV wirelessly at ease.  Didn't buy directly from Google because I didn't want to pay shipping, so I was glad to see it on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "avalone"}, {"rating": 4.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "While I've been trying to stay optimistic about the Chromecast, I've hit my breaking point. I've had it for about a week and it has frozen up on me daily :( It's a casting device, basically, you operate it with the apps on your devices. I'm not sure what's causing it to freeze up, as my apps continue to work, even when the Chromecast is frozen. I did do the update right away too when I got it. If this continues, I will be back to lower my rating. If there's another update down the lines, I hope that will fix my issue, which I will be back to change my rating again. I may be looking into other streaming devices soon. I would not recommend this.*Update: I have to restart my Chromecast daily, haven't had for one month yet. Do not recommend.", "verified": true, "helpfulness": "0/0", "author": "Kylie"}, {"rating": 5.0, "review": "I turn on my TV, grab my phone and play pandora, youtube or netflix directly from phone. Great concept!", "verified": true, "helpfulness": "0/0", "author": "xyz"}, {"rating": 3.0, "review": "A bit too slow for what I wanted it for. I was using it to stream my desktop to my TV. I know this is not it's intended purpose; just a nice extra. But I was disappointed in the video/audio quality and refresh rate.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Love these...have one in each room. Also love how you can cast Google music to it and use your phone as a whole house remote control!", "verified": true, "helpfulness": "0/0", "author": "Maison R. Hughes"}, {"rating": 5.0, "review": "Wish you could use it outside of Chrome to project entire desktop or phone.", "verified": true, "helpfulness": "0/0", "author": "AC"}]