[{"rating": 5.0, "review": "Its a Great tool to have and its cheap, what else needs to be said?", "verified": true, "helpfulness": "0/0", "author": "John H"}, {"rating": 4.0, "review": "Would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Raymond J Golden"}, {"rating": 3.0, "review": "I got a Chromecast during a black Friday sale and so far I like it. But I was disappointed to find it only accepts up to 2.4GHz WiFi. High quality videos NEEDS fast internet. I find myself buffering a lot or watching low quality videos. YouTube has replaced my cable TV but until they upgrade the signal this won't replace watching on my phone.", "verified": false, "helpfulness": "1/1", "author": "Jesse"}, {"rating": 1.0, "review": "I'm sorry, but if your product can't even be set up without having to learn how to disable AP isolation on your router (what???) then it's a waste of money. Better off buying Roku or Apple TV, unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "works great! I love it!", "verified": true, "helpfulness": "0/0", "author": "eliazar delacruz"}, {"rating": 5.0, "review": "Works seamlessly with YouTube and other public movie sites.", "verified": true, "helpfulness": "0/0", "author": "Eduardo"}, {"rating": 5.0, "review": "One of the best purchases ever. Works just like they said", "verified": true, "helpfulness": "0/0", "author": "Karen J. Booker"}, {"rating": 5.0, "review": "havent explored fully but i like the idea and works well", "verified": true, "helpfulness": "0/0", "author": "Edward M. Rivera \"emr\""}, {"rating": 3.0, "review": "not what i expected but... it's alright", "verified": true, "helpfulness": "0/1", "author": "natanael"}, {"rating": 3.0, "review": "We have two of these in our house, mainly for Netflix.They are great because they work with most things (phone, pc, etc) but over time they cutout constantly and stop communicating with our phones (Moto G and Galaxy S4).", "verified": true, "helpfulness": "0/0", "author": "Pamela Knoll"}]