[{"rating": 4.0, "review": "need to connect to any android phone without a third party software.", "verified": true, "helpfulness": "0/0", "author": "yehia"}, {"rating": 5.0, "review": "Set up could not be easier - it came all set up and ready to play.  I love the wireless (not IR) remote - no line of sight is needed.  The box is hidden but fully available.", "verified": true, "helpfulness": "0/0", "author": "S. Joseph"}, {"rating": 5.0, "review": "I bought the Kindle Fire for my Dad in March 2014, paid $100 for it at Best Buy...worked fine for about 2months...started acting up until it died.  Got Roku and the Roku works fine.  Just threw away $100...cost me $50 a month for as long as it worked. My Dad liked the features, easy to use, liked the speaker feature, unfortunately did not work that long.... If you buy make sure you keep the receipt so you can return...I didn't...can't return...  I trust the Amazon product, big boo boo...will never be so trusting again.  I am not happy with this product at all...wish it worked.I am updating my review.  Somehow we got the product to work.  We had it inside the cabinet the TV was in, we placed up on the top of the TV cabinet and it is working fine.  BUT....more amazing, once again is the customer service at Amazon.  After my review, I was contacted by a marketing person (thru email) indicating to call them and they would try to see what they could do for me.  I was pleased just to realize they do pay such close attention to the reviews and that even though I had bought the product thru Best Buy they were standing behind their product.  I continue to be a satisfied and happy customer of AMAZON.  I feel very good about continuing to do most of my big purchases and many small thru Amazon.  Keep up the good work.", "verified": true, "helpfulness": "3/11", "author": "Migui"}, {"rating": 5.0, "review": "We bought this to test watching our shows so that when our contract is up with our satellite provider we can ditch them.  We are loving it.  It is very fast.  It streams well.  We do not have experience with other streaming boxes.  We are extremely happy with this one and will probably purchase another one for additional rooms in the house when our satellite contract.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Kristi\""}, {"rating": 3.0, "review": "This is a mixed review.  The hardware is very good, but a half year into this product's life, it appears that neither Amazon nor its app partners are building the software that would really take advantage of it.First the good - It's beautiful, and dead easy to set up and use.  As has been frequently remarked upon, this thing is best for Amazon Instant Video, in fact, not too surprisingly, it's better at that than anything else.  It's really fast - in fact, it's the first streaming device I've seen where the user interface is fast enough to avoid major frustration.  In addition, the picture quality easily exceeds that of the local 3-or-4-subchannels-crammed-into-one HD channel broadcasts here in Austin.  Like all digital TV streamers, compression artifacts and color banding are an issue, but to get a better picture, you'd have to go back to analog.  The Fire TV's video quality is about as good as digital video streaming gets these days.Where the Fire TV falls flat is the software - in three places: locally (in the Fire TV box itself), surprisingly,on Amazon's backend, and lastly, in the available apps.  (Fortunately, the first two of these are upgradeable and fixable, but the sad state of Fire TV software well into the product's first year doesn't bode well for customers.)First, the UI is a bit too voice-oriented.  Although it *usually* understands what you say, if it doesn't, you're reduced to using one of the world's most awkward and painful on-screen keyboards.  (Amazon developers, if you're reading, there is really *no* excuse for shipping this. Yes, it's that bad.)The place where the Fire TV really falls down is the availability of quality \"channels\" (as Roku calls them, they're a not-readily-identifiable type of \"App\" in the Fire TV lexicon).  With the exception of Sky News and RedBull TV, there basically aren't any.  Oh, there are a few seemingly attractive content apps there, but most (including A&E;, History, Animal Planet, Smithsonian, etc.) either offer only snippets of a few minutes rather than complete shows, or require a cable subscription anyway - this is anathema to a box aimed mostly at cord-cutters.  The lack of any good options for streaming news and sports is one of the real disappointments for this device, but to be fair that's the Fire TV ecosystem, not the device itself.  Pluto.tv is the best option I've found, and it's certainly not very compelling.  A few channels (apps) like Tubi.tv offer lower quality content, but cram it so full of commercials (automatically inserted and NOT at natural program breaks) that it's unwatchable anyway.  Amazon really needs to get some good streaming/content partners, and also ensure that apps are good quality and offer reasonable value.  (Alternatively, Amazon could reduce the price of TV shows from their current stratospheric prices of around $3/episode to something that would actually allow people to watch them - \"catching up\" on a popular series that's been running a few seasons can easily cost more than the Fire TV itself!)In addition, the search needs to work much better in finding and showing the best way to see things you might have missed on regular TV that are available on the web.  A browser with HTML5 and/or Flash video support would give you most of these during the period that the networks offer them for free - today, you just can't see this online content on your Fire TV.  I was disappointed, for instance, to find that it was going to cost $3 to catch a missed Castle episode via FireTV, but it was viewable free online.The apps/streaming channels situation is depressing, but at least those are (mostly) beyond Amazon's control.  It's sadder when Amazon's own products don't work well through FireTV.  Here are two examples:First, there is no really good way to find content unless you are *specifically* searching for a particular movie or TV show.  The recommendations are weak and never change (even if you've already watched them on Amazon!), and I was about to give up on Prime, thinking that since they had \"un-primed\" a bunch of movies in my watchlist, that there was not enough left worth watching.  There is, but it's a genuine pain in the butt to find it:  The best you can do is to search for a movie you like and *then* explore the \"other people also watched\" trail at the bottom of the page.  This will turn up lots of decent (and often Prime) content that will never be presented to you as a Recommendation or in any of the Popular (duh) or Genre collections.  Bottom line, Amazon needs to make serendipitous discovery of interesting content much easier.  (Oddly, finding content worked better on the Amazon Instant Video app for the Wii, which is what I was using before.)Second, and perhaps more distressingly, the FireTV cannot be used to take advantage of my current favorite Amazon feature:  The Playlists in Amazon Cloud Player.  For reasons known only to Amazon, Playlists (Prime or otherwise) are NOT available through the Fire TV - the only music available is what you've bought through Amazon (and most of that, at least in my case, is only a few digital tracks per album, so I still have to rip the CDs anyway...)Overall, the Fire TV is very good, but I'm seriously pondering whether to send it back and get a Roku 3 - it solves the channels problem, also has a decent picture, and is no worse for music, but has a painfully slow UI.The most frustrating thing is that this device comes *so close* to being really great, but fails to reach it in every dimension, resulting in an experience that is more disappointing overall than it should be,  even though each individual part is pretty good.  The good news is that Amazon COULD fix this, using a combination of updates to the box's firmware and updates to the cloud services behind it, but sadly, I fear that like the Fire Phone, this was a trial product that Amazon may not be committed to getting right.  That's sad, because the Fire TV *could* be the best thing going, if they would just put some focus and effort behind it.  This platform has room to grow and to be awesome - I hope Amazon is committed to it, and moves quickly, because the window of opportunity to get it right is closing rapidly as Apple, Google Chrome, and even Tivo strive to do a better job.Oh, one last thing - build the next remote with the ring as a scroll sensor, not just a stylized 5-button pad.  This would be awesome for replays and scrolling through bigger lists of better recommendations!  (Yeah, this means I'd have to use the scroll remote instead of my Logitech Harmony Smart Control, but for that, it'd be worth it...)", "verified": true, "helpfulness": "5/6", "author": "Dub Dublin"}, {"rating": 5.0, "review": "I have nothing but great things to say about this device.  I got it for my grandparents and it has worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "Jordan T Bonanno"}, {"rating": 5.0, "review": "Love the remote! It's intuitive and simple to use. The HD reception is perfect and no waiting for streaming. The integration with my Amazon account is excellent. Much better than Roku or Apple's unit.", "verified": true, "helpfulness": "0/0", "author": "Jerry Delgado \"Jerry\""}, {"rating": 4.0, "review": "Easy enough to install eventually and works just fine for our needs.", "verified": true, "helpfulness": "0/0", "author": "R. Beeks"}, {"rating": 2.0, "review": "Sounds great, but not interested until it has HBOGO", "verified": false, "helpfulness": "1/8", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am really surprised at how awesome this thing is.  My husband and I got rid of our cable and replaced it with this teeny tiny box.  It's amazing.  Between our Netflix and Amazon Prime subscriptions, we don't have to miss any shows anymore.  A really good gift for those who complain about cable bills, too!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]