[{"rating": 1.0, "review": "Does not  have the functionality I was hoping for, ie... \"casting streaming computer to TV\". I was absolutely totally disappointed.", "verified": true, "helpfulness": "0/0", "author": "Michael Rodriguez"}, {"rating": 4.0, "review": "a friend knows I have way too many wires sticking out of my media center, luckily the chromecast has gotten rid of all that.  Nice clean modern home now.  So convenient, easier to watch movies from laptop while I work on other stuff and even works straight from your phone - AMAZING", "verified": true, "helpfulness": "0/0", "author": "Rosie Dehoyos"}, {"rating": 4.0, "review": "Serves My Needs Perfectly And doesn't Interrupt My Movies When I Receive A Phone Call.  I've Had No Problems With It To ThIs Point.", "verified": true, "helpfulness": "0/0", "author": "Rumble"}, {"rating": 5.0, "review": "a great Google product! does everything it promised! check out the tricks online and you can take it to the next level!", "verified": true, "helpfulness": "0/0", "author": "khai m tran"}, {"rating": 4.0, "review": "This was the first tome I had tried to view movie on TV thru a wireless connection instead of connecting with HDMI.  There was some screen digitizing and jerkyness while watching the first two movies.  I haven't noticed this before when watching on computer.  Don't know if we were just experiencing a fiber optic overload with our network, if the issue was feeding the movie thru the wireless, or due to using Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "My android tablet cannot stream anything to this device. You cant use spotify on it unless you mind streaming from a computer via the website. I dont know I had high hopes for this but theyve gone the way of apple and turned it into proprietary piece of junk.", "verified": false, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 1.0, "review": "Does not work with x p  also have to download a Google app for Comcast and still needs to be  Shared with your wifi whatever it isI still cannot get it to work with my samsung galaxy4 phone", "verified": true, "helpfulness": "0/2", "author": "Dan Bailey"}, {"rating": 5.0, "review": "You can stream pretty much all your content through it.  There are a few things to keep in mind:  If you want to stream content from your browser you need to use a Google Chrome browser (Internet explorer will not work).The exception to this are items like Netflix which is really imbedded into the browser and not directly associated with Internet Explorer.Works great with an IPad Mini, a Nexus 7, and Windows phones.On to videos on your hard drive.  You can also watch videos that you have stored on your computer through it but not directly (this is the only drawback).  How do you do it you ask?First install Realplayer Cloud on your PC, then install the app on your portable device (iPad, Nexus, Kindle, etc.).  The portable device is required for this.  Once this is done you can sync the two wirelessly and your PC video content will appear on your device.  Once you begin to play the content through RealPlayer Cloud on your device you can click the button to send it to the Chromecast.  It sounds involved, but once the RealPlayer app is installed it's not.  Trust me, because I was going to return this until I figured it out.One last thing, ensure that if your TV is wall mounted and it is flush against the wall, ensure that it has an HDMI port and a USB port accessible from the side.Happy streaming!", "verified": true, "helpfulness": "0/0", "author": "Book Lover"}, {"rating": 4.0, "review": "I want to rate it a 5 but the product get way too hot and although I read its common for it to get hot and that its encased in what some say is a heat sink there is no way for it to cool it down since its encased in a hard plastic. So its rather warm to hot to the touch. I used the adapter and it appears to have help since its not direct with the tv which the HDMI ports also produce heat from a HDTV that is on for the most part of the day which adds ups causing the chromecast to become hotter. Other than the heat issue it works great for me. I am able to view youtube and viki videos which is what I bought it for. Video quality although its 480p on viki it is still really good. Youtube videos do play in HD I have yet to test Hulu and the other apps but I expect them to also play HD. I noticed that it cleans up the image compared to how it looks on computer so 480p looks much better than the norm. I am satisfied with it the only thing that worries me is the lifespan of this device do to how hot it runs.", "verified": true, "helpfulness": "1/1", "author": "Edgar Amaya"}, {"rating": 3.0, "review": "It's a great deal for the price. It's a little glitchy, though. The support for it also needs to be expanded. There are only a few things you can do with it right now. The sky should be the limit with what it is really capable of doing, though.", "verified": true, "helpfulness": "0/0", "author": "Jeff Bryant"}]