[{"rating": 5.0, "review": "Love it, great idea.", "verified": true, "helpfulness": "0/0", "author": "Douglas"}, {"rating": 5.0, "review": "Great alternative to get away from the exorbitant cost of cable/satellite tv!  Super easy to install...", "verified": true, "helpfulness": "0/0", "author": "Darcy"}, {"rating": 5.0, "review": "We love our Amazon Fire TV.  It was super quick and easy to set up.  We love the Amazon Prime programming and we also loaded the Hulu ap. I  purchased the gaming combo and my grandson said the game controller that comes with it is a lot more responsive than his Xbox controllers.", "verified": true, "helpfulness": "0/0", "author": "Eva M Chappell"}, {"rating": 4.0, "review": "Easy to use, and good selection", "verified": true, "helpfulness": "0/0", "author": "Domarys"}, {"rating": 5.0, "review": "It's great so far, it's doing everything I was hoping it would.", "verified": true, "helpfulness": "0/0", "author": "Richard Contreras"}, {"rating": 5.0, "review": "It's perfect. Exactly what I expected. The price, not too bad, I just wish I would have made my purchase when it was on sale for $79,  I could have save a few pennies. Overall she's great. Not much of a t.v head these days...but when I do decide to view something, this gadget it perfect.J.NYC", "verified": true, "helpfulness": "0/0", "author": "J."}, {"rating": 4.0, "review": "Cool hand little device for those of us that have cut the cable cord.  Wish there were more up to date options for viewing movies and latest TV episodes.  It would be great if you could actually access HBO Go or Showtime Go without having a contract with a cable provider. I like the size, very small and discreet, it's about the size of a CD case just a little thicker.", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 5.0, "review": "I love it! My cable company is terrible (cough, Comcast, cough) and On Demand will go months without working. I don't normally watch what is on TV at the time and prefer watching things when I feel like it. I've added Netflix, Tubi TV and Screambox so far and I haven't been disappointed. I did have to plug the ethernet cable in because my internet connection is also iffy sometimes...Comcast, I'm looking at you...and I haven't had any problems(knock on wood!).I would suggest everyone get one of these!", "verified": true, "helpfulness": "0/0", "author": "Dana A. Hedengren"}, {"rating": 5.0, "review": "Really love our fire Tv easy to use. Its great if you are tired of some of the programming on television and want to have choices of what to watch and when.", "verified": true, "helpfulness": "0/0", "author": "JOHN HUCKABEE"}, {"rating": 5.0, "review": "I just love this thing, Im 70 years old and not very good at elec stuff, this hook up was so easy even for me, im now going to get another.,,thank you amason.", "verified": true, "helpfulness": "0/0", "author": "bruce c huff"}]