[{"rating": 5.0, "review": "I installed on my living room tv and then when I used on my bedroom tv, it worked immediately, Anything that Google Chrome shows Chromecast will project on the TV", "verified": true, "helpfulness": "0/0", "author": "Aarone K"}, {"rating": 3.0, "review": "On a Mac, I found it easy to install but needed Chrome, which I don't like otherwise. Audio doesn't come from the TV set on some stations so I bought a portable bluetooth speaker also. Audio and Video don't always match exactly either, which is annoying. For the price, it's ok; it allows me to watch what I might not be able to watch otherwise.", "verified": true, "helpfulness": "0/0", "author": "Emerald1773"}, {"rating": 3.0, "review": "I am old enough to find such devices truly amazing, but I am also old enough not to want to spend most of my spare time making them work. Check your expectations before buying.1. Google Chromecast works only from Google Chrome and better from a PC than an Apple. You can't just cast anything up on the tv screen from any device.2. It has very limited apps available for iPhone and iPad use.3. Ours needs to be reset (a fairly simple process, but still a process) almost every time that we use it; otherwise, the video streaming stalls while audio continues or audio is garbled or the two lurch on out of sync.Bottom line: Is it worth $35? Definitely, but the smoothness of use will depend on how good your internet service is and what type of device (laptop, tablet, smart phone) and OS you are using.I suspect that Chromecast apps will increase and improve rapidly and so will the ease of use for this astonishing little device.", "verified": true, "helpfulness": "0/0", "author": "Chaigirl"}, {"rating": 5.0, "review": "Works great. Easy to install.Great alternative to having to get a wii or blue tooth device. And much cheaper.", "verified": true, "helpfulness": "0/0", "author": "Joan Bischoff"}, {"rating": 5.0, "review": "Great, more affordable alternative to Apple TV. I have one upstairs and one downstairs and am able to Stream from my iPhone or my iPad with ease!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'd been on the fence about buying a Chromecast for a while simply because I thought I wouldn't use it considering I already had access to things like Netflix through my game consoles. I finally did purchase one though, and I'm seriously glad I did. Since I got it I've used it probably every day. From sharing YouTube videos with my roommates, to watching movies and TV shows with a click of a button, to utilizing my TVs stereo system to blast Pandora throughout my apartment. The Chromecast makes all that so much easier. Love it!!", "verified": true, "helpfulness": "0/0", "author": "ToWhenTFor"}, {"rating": 1.0, "review": "We have a laptop running Windows XP professional, which is not supported. We also have an older iMac running OS X 10.6, which is supposed to be supported. However, during setup, an error indicated that the iMac hardware was too old and not supported. We had to return it.", "verified": true, "helpfulness": "2/3", "author": "Frequent Buyer"}, {"rating": 4.0, "review": "Great being able to watch Youtube and some other things from my tablet, but after using Chromecast device, I was unable to view all my cable channels.  I had to disconnect and reboot my cable to regain access to all channels.", "verified": true, "helpfulness": "0/0", "author": "travelbug \"rdlee56\""}, {"rating": 5.0, "review": "Love it! It's all I expected and the price is very reasonable, also its easy to carry around so I can take it everywhere.", "verified": true, "helpfulness": "0/0", "author": "Natalia Cunningham"}, {"rating": 4.0, "review": "I did not know what to expect, but for only $30 I was willing to gamble with it. I am not the most tech savvy person, but that being said the instructions on how to set this up and use it were easy. I was watching steaming digitaltv within a short period of time.My only reservation is that I would like more streaming options on it. Netflix, and Hulu+ are the primary streaming options, both of which require paid accounts. There are many free legal streaming media outlets that Google could tap into.", "verified": true, "helpfulness": "0/0", "author": "AllTheSh0pping"}]