[{"rating": 5.0, "review": "Better than roku", "verified": true, "helpfulness": "0/0", "author": "vahik"}, {"rating": 5.0, "review": "Works very well", "verified": true, "helpfulness": "0/0", "author": "ward roser"}, {"rating": 5.0, "review": "This is a wonderful little device.  My family uses it daily.  Teenages love the ability to stream their music apps from their phone through the home theater.", "verified": true, "helpfulness": "0/0", "author": "Travis Wright"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Manuel A. Martinez Jr"}, {"rating": 5.0, "review": "I really like this great little device.  It has freed me from needing cables and I can take my tablet to my basement where we have another TV, and use it for watching movies while I do laundry.  Or play videos to exercise.", "verified": true, "helpfulness": "0/0", "author": "DIY Diva"}, {"rating": 4.0, "review": "Just find to watch Youtube but when I tried google Chrome browser has some lack to watch movie by internet.", "verified": true, "helpfulness": "0/0", "author": "Dongju Lee"}, {"rating": 5.0, "review": "Works well but be sure to purchase the (TVPower USB Power Cable for Chromecast) if you don't want to use the AC cord.  Loving my Chromecast...", "verified": true, "helpfulness": "0/0", "author": "ahiker4u"}, {"rating": 4.0, "review": "no comments. Fine.", "verified": true, "helpfulness": "0/0", "author": "A. Furst."}, {"rating": 5.0, "review": "Chromecast is awesome!! We didn't know how much we wanted it until we got it. Quite a few channels allow you to chromecast from their apps which is really convenient. I am hoping that with time more channels upgrade to use chromecast. Very small USB, takes pretty much no space and it keeps one channel open to cast. One can cast from a specific app or from a browser, or even from your photo library on your android device. very cool! I love technology!!", "verified": true, "helpfulness": "0/0", "author": "Rosa"}, {"rating": 5.0, "review": "This is an outstanding low cost answer to streaming. I am now convinced that I will not pay extra money for a smart TV when I upgrade to a larger screen!", "verified": true, "helpfulness": "0/0", "author": "Ken Gibson"}]