[{"rating": 2.0, "review": "I didn't do a lot of homework before buying, my bad, but the Chromecast appears to be just another way to stream Netflix content to an already-netflix-enabled TV, and stream $ from your bank account to Netflix and Google. I expected a Ruku-killer, and instead got a Netflix-Google revenue producer.PLUSES? EZ to set up (note - you MUST use a wireless device to set it up with the CHROMECAST AP, not a wired one. Andriod phone works great. It give you a confusing Wi-Fi error message if you attempt to use a wired device).Also, nice and small- hides behind the TV. And even the USB cable is hidden if plugged into a TV USB port.MINUS? As NOT a Netflix subscriber, apparently the only content is TV reruns @ $2.99 (which I can get free on cable) or some old movies, also over priced. It says there is FREE content- all I asw was perhaps some old TV shows I never heard of.BIGGEST MINUS? I pay for AMAZON PRIME and have access to lots of content. Think Chromecast helps me stream that to a bigger-than-7\" TV? Think again. No. Still stuck in 7-in-land.So far, the only thing I like about it is it's hidden, so as not to remind me that I just wasted $35.", "verified": true, "helpfulness": "2/6", "author": "Ed M."}, {"rating": 2.0, "review": "Small size easy to connect to TV.  That is to it, installation is easy, connects and video quality is OK.  Connects to YouTube and NetFlix, however google does not offer the 3 month free Netflix option.  Compared to Roku and Apple TV, Chromecast is way behind.  The app on the iphone/ipad does not work well, however on Android devices the app works great.  I expected better software integration from Google however this is like most Android devices, just marginal.  A good attempt but does not replace my Apple TV or Roku.", "verified": false, "helpfulness": "1/2", "author": "Tsv Krishnan"}, {"rating": 5.0, "review": "Its here and it punches my brains out!!! Its so easy to install and very responsive so im happy I didn't have to buy a smart tv, I converted one with a $35 device! GENIOUS!", "verified": true, "helpfulness": "0/2", "author": "Mysterious Shadow"}, {"rating": 3.0, "review": "I just received my Chromecast yesterday. It connected quickly to my router, good. But if you have side loaded video or music not from Google it will not play it. Also I havehad a few crashes already. It does work from my windows 8 tablet and my HTC evo 4 g phone but just not fluid enough yet and it needs to become more of a mirror cast then it is now. I will keep and play with but my Apple TV and Roku really do a better job.", "verified": true, "helpfulness": "1/2", "author": "C. V. Rogers \"Chuck322\""}, {"rating": 5.0, "review": "BUY THIS immediately.As the title suggests... this is the best thing ever.  It is by FAR the best $35 I've spent in like... a decade.When I bought it, they gave a way 3 free months of Netflix (INCLUDING people who already have an account).The ability to stream from my phone/tablet/PC/laptop ... and for only $35?Not to mention Google is going to continue support and development of this amazing little device...", "verified": true, "helpfulness": "0/0", "author": "Steven B."}, {"rating": 4.0, "review": "I am updating this review - after having had more time to play with it. It DOES have a use - when you have a TV which is NOT network attached.  I have a computer monitor/TV - which does not have RJ45 or Wifi connections - SO having THIS device - allows me to hook up that TV - and spin off movies from various sources.  I have used it with Netflix, Hulu+, HBO-GO and Youtube.  You should go to wikipedia and check out the various products available for use with Chromecast.---------------------------------------I opened the box, everything was there, hooked it up to my 29\" Vizio Smart TV as well as an older dumb 26 inch Samsung Monitor/TV. Those two worked fine!  It failed to work with my 32 inch dumb Viewsonic TV.I Used my iPad to configure it - configuration worked fine. Software works fine.  Hardware works fine.  Great piece of engineering, great user interface.It isn't 'Bad', but for me - I don't use it all of the time.  Maybe, if I throw the dongle into my desk drawer - I will discover that in six months it will be really cool.  Maybe I will change my mind about Chromecast, and come back, and update. alter, improve this review.  (I did!)", "verified": true, "helpfulness": "4/7", "author": "Mike Taylor \"Mike4920\""}, {"rating": 5.0, "review": "A winner from Google.  Simple set up via an Android App or on your Chromebook [or PC with Chrome Browser].  Excellent instructions spanning all of THREE steps. On screen and on phone/Chromebook info takes you from there.  Simple to cast from the Chromebook. Casting from Android limited to Netflix, YouTube, Google Play AT THIS TIME.  Google will bring out more, to be sure.  Beautifully boxed, with an HDMI extender [about 4 inches long], a USB power cord, USB/AC plug.", "verified": true, "helpfulness": "0/0", "author": "Frank M. Tedesco \"frankt\""}, {"rating": 5.0, "review": "The chromecast does exactly what it is advertised to do.I can flawlessly stream Netflix and YouTube videos from my iPhone and iPad. I can switch between the iPhone and iPad for control without interruption.This product allows me to stream movies to my non Internet connected TV.Roku and Apple TV may have more featues but the chromecast meets my needs.", "verified": true, "helpfulness": "0/0", "author": "DES F"}, {"rating": 2.0, "review": "I purchased Chromecast directly from Google.  The idea is great.  The execution not so much.  I don't need this for Netflix since I have Roku.  I was hoping this would be a good way to look at You Tube on the big screen.  Perhaps in another release.  For now, it is not worth the trouble.  The process is problem laden.  The casting icon does not always appear on your You Tube screen.  And when it does appear, the casting is not always successful.Perhaps another day.", "verified": false, "helpfulness": "1/4", "author": "Al G"}, {"rating": 2.0, "review": "Worked fine the 1st 2 days with my Sony Bravia tv and streaming off my Samsung S3. After that, couldn't make connection with tv. Had to unplug and then replug a few times before it finally worked. Took me 10 minutes. The next time, same thing but it took longer to connect. The 3rd time it didn't connect and I lost patience. Had to reset chromecast to factor settings. Its worked once before same thing starting happening again. Not what I expected. I sent 2 Feedback forms to Google with no response so far.", "verified": true, "helpfulness": "10/13", "author": "The Boss"}]