[{"rating": 2.0, "review": "I was excited about getting my Chromecast and now I am more disappointed with it's limitations. You can stream YouTube, but there are also many other ways to do so and easier. App support is just almost non-existent and this device requires you to use a computer, smart phone or tablet in order to operate. It seems you must use the Chrome browser in order to stream media to your TV and, last but not least, in order to use the fantastic Plex app you must have a subscription which starts at $3.99 (this is well hidden from advertising; very clever on Goggle's part). After using YouTube and Plex, my videos kept stopping and I had to keep restarting the video in my phone or tablet.In my opinion, this is too much of a hassle to operate without video freezing. I will stick to my Roku 3 box which works flawlessly and it is a breeze to set up.", "verified": true, "helpfulness": "0/0", "author": "junin07"}, {"rating": 4.0, "review": "It's a great addition to my tv! Does need to be plugged in, that's the only downside to having it.", "verified": true, "helpfulness": "0/0", "author": "JKTeach"}, {"rating": 1.0, "review": "Not easy to install and required us to slow down our internet connection.We will stick with our Ruko streaming player.", "verified": true, "helpfulness": "2/4", "author": "Rita Beth"}, {"rating": 5.0, "review": "What is product can do may overlap many other products for content streaming, it fits in perfectly where you may not already have a device. Many people already have game consoles or dvd/blu ray players that can stream content, however where this device fits in nicely is bedroom that doesn't have one of these devices.Being able to easily add instant streaming to a TV that doesn't already have it is great. Instead of paying ~$100 more to go from a regular to a smart TV, you can add the chromecast and you're set.Also the ability to go on vacation and just plug this device into the TV and you're all set.", "verified": true, "helpfulness": "0/0", "author": "George B."}, {"rating": 5.0, "review": "This is one of the best purchases we have made.  We use this with Netflix and we no longer run out of things to watch!  We use it with our laptops, and now my iPad mini... works like a charm!  We even use it to cast local sports that are only on ESPN online... awesome!", "verified": true, "helpfulness": "0/0", "author": "Deborah Killian"}, {"rating": 5.0, "review": "I really like the fact that I can set it up in the office and it will transmit my programs on the TV in the living room.", "verified": true, "helpfulness": "0/0", "author": "IDEN1"}, {"rating": 5.0, "review": "Easy to install! Easy to use! We enjoy Netflix and Youtube on the big screen at our house.Great buy!", "verified": true, "helpfulness": "0/0", "author": "M. Berry \"Berryjam\""}, {"rating": 1.0, "review": "Somebody had a great idea but didn't do the the necessary technical work to produce a useful product.  Get it to market even if it is not ready.  Make a few bucks while we work on it. Look elsewhere for a product that works, i.e., Apple TV, Roku, etc.", "verified": true, "helpfulness": "1/6", "author": "Mark Alfano"}, {"rating": 3.0, "review": "everything it SHOULD be is really cool. unfortunately it doesn't function in an older house with thick stucco walls. The signal would drop frequently from the computer I was using only 10 feet away between 2 separate walls. my sister is enjoying it where the computer lives in the same room as the television.", "verified": true, "helpfulness": "0/0", "author": "Timothy M. Faught \"rancorlicious\""}, {"rating": 4.0, "review": "The Chromecast device was easy to connect and setup. It immediately recognized my wireless network and the onscreen prompts together with my laptop and smartphone made the connection smooth and seemless. I began streaming YouTube videos and later tried playing streaming movies from my HBO Go account. picture quality is very good and streaming is smooth and uninterrupted. I gave the product a 4 star rating because I would like to see more online networks become available for streaming. All things considered this was a good investment and I would recommend to anyone who is looking for an inexpensive way to stream videos to their TV.", "verified": true, "helpfulness": "0/0", "author": "Chris Costa"}]