[{"rating": 5.0, "review": "Working great , now my friends and family are ordering it.", "verified": true, "helpfulness": "0/0", "author": "darryl knight"}, {"rating": 5.0, "review": "Delivered on time. 100% satisfied", "verified": true, "helpfulness": "0/0", "author": "Schalk Bezuidenhout"}, {"rating": 5.0, "review": "Very easy to instal and use!!", "verified": true, "helpfulness": "0/0", "author": "Bruno Gonçalves da Silva"}, {"rating": 5.0, "review": "I can just sit with my tablet on my lap and stream anything I want to my TV...set up has clear instructions. I have an older TV, 6 years old, and by electronic standards most would consider it ancient but it does the job and I'm happy. Make sure you have plenty of data available with your internet plan as the ability to watch what you want can be addicting!", "verified": true, "helpfulness": "0/0", "author": "Ladipyg6243"}, {"rating": 1.0, "review": "Not what I expected, won't work with any of my pc's or laptops due to Windows XP not supported. The 2 pcs with Win 7 don't have bluetooth so they are useless also. 2 Android phone did not work because they also were not supported. You have to have the latest and greatest I guess to use this product. Oh, forgot to mention they also force you to use Chrome to access content.", "verified": true, "helpfulness": "0/2", "author": "tomkay"}, {"rating": 5.0, "review": "Well, for the price its a super buy. It does what it says, stream Netflix, YouTube, my music and even mirror my phone on my Sony Bravia.  Why did I get this device since my tv already has a YouTube app and Netflix built in?  Well Google is pulling the plug on the internal building in YouTube app on many smart TVs including the Sony Bravia model that I have.  Im a big you-tuber and enjoy watching YouTube videos on the big screen so for $29.99 its no brainier.  Now its even easier to search for videos and view my playlist since I can do it from my phone and with a push of a button cast it on the screen.  I've also notice the Netflix app on this Chromecast is better than the Sony Bravia's built in one and the picture quality is also an improvement.  All around I would recommend this dongle to turn your TV into a \"smart TV\" with extra options.  Power from a USB port, HDMI, and a home wireless networking is needed for this devise to work.", "verified": true, "helpfulness": "1/1", "author": "Deltatristar500"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "1/1", "author": "Jeremy"}, {"rating": 5.0, "review": "I like it better that the Amazon fire TV.", "verified": true, "helpfulness": "0/0", "author": "Perry"}, {"rating": 5.0, "review": "I was skeptical about Chomecast since it initially got some bad reviews when it first came out but now i cant believe i didn't get one sooner! the ability to cast any video on the web through chrome is awesome and you can also play any videos you have on your hard drive with one of their apps. If you are looking for the simplest way to play any video from the net or your computer on your tv this thing is perfect", "verified": true, "helpfulness": "1/1", "author": "Kevin O'brien"}, {"rating": 4.0, "review": "works great but updates are a pain and take a long time.", "verified": true, "helpfulness": "0/0", "author": "Kate Salveson"}]