[{"rating": 2.0, "review": "Streaming is very choppy and color rendering is poor. Overall not worth the effort/money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm feeling very sucessful for this item, was a good buy.", "verified": true, "helpfulness": "0/0", "author": "Peter Navarro"}, {"rating": 4.0, "review": "I bought this device for one purpose - to watch streamed broadcasts on ESPN3 on my 55\" flat screen.  Watching basket ball games, while there is game action being streamed and even some commercials, the video and audio quality could not be better.  I have 3 M/s internet service, which is adequate to watch streamed games (I have been watching them on my computer for some time).  However, for some reason 'connection is lost' between segments of action (during commercial breaks, TV timeouts).  The message is displayed on the big screen, but I also see my tablet trying to reconnect with the game; so I cannot blame this issue on the Chromecast device.  I just reestablish the connection with ESPN3 and cast it back to the big screen. When I watch the games on my computer, I use a wired connection and do not experience any dropout, so I suspect the problem is a wireless sync issue.The only quirk is that both the Chromecast device and your tablet/PC/phone (whatever you use to control it) must be on the same WiFi network - on the same SSID.  No problem with this, just something to be cognizant of if you have more than an simple home network.", "verified": true, "helpfulness": "0/0", "author": "Howard S. Robins"}, {"rating": 1.0, "review": "Not bought from here but its a piece of crap. It reset good and does great set up but once disconnected it don't pick it up or link again. They should allow for it to work with phone hotspots as not everyone can afford a monthly contract with any internet provider.", "verified": false, "helpfulness": "0/2", "author": "Cya \"Cya\""}, {"rating": 4.0, "review": "We ended up replacing 3 verizon DVRs in our house and replaced them with the Google Chromecasts and switched to internet TV. Because we are still using Verizon, we get free channels such as ESPN through the applications, and we pay monthly subscriptions for Netflix and Hulu Plus. Internet TV is definitely worth the switch for whoever is ready for change.The only problems I have found with the Google Chromecast would have to do with the limited amount of programs you can run through Chromecast. This is definitely improving over time. And I wouldn't recommend the Google Chromecast to non android users because Apple isn't as compatible with the Chromecast as the android products are.**TO ALL VERIZON USERS**Verizon as well as some other companies purposely slow down bandwidth when using programs like Netflix to encourage more people to go back to cable. Don't think that the Chromecast is the reason that the videos your streaming aren't streaming at a high quality.Definitely a cheap alternative to streaming videos off your laptop and android devices", "verified": false, "helpfulness": "0/0", "author": "Anna O"}, {"rating": 5.0, "review": "This has been so easy to use.  I have Casted movies from Netflix.  I have exercised to Fitnet.  I have viewed family pictures.  It's so much easier for this technically challenged mom.", "verified": true, "helpfulness": "0/0", "author": "CastleRock"}, {"rating": 2.0, "review": "I'm sure it works great for some people, but it does not work with my WiFi/modem.I have AT&T; Uverse with the standard 2Wire modem they issue to customers. After extensive talks with Google, 2Wire, and AT&T; customer service it is clear I will not be able to use my Chromecast, even though Google says it is compatible with my modem, etc. The issue could probably be fixed by someone with advanced technical knowledge, but AT&T; says they cannot (or will not) tell me how to make the changes necessary to get my Chromecast to work with my WiFi.To their credit, Google tech support was very helpful and even followed up on my issue.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "This device is amazing for turning any television into a Smart TV", "verified": false, "helpfulness": "0/0", "author": "Philip"}, {"rating": 1.0, "review": "Do not buy this product, a recent firmware update (22062) broke my chromecast. Google simply has no support in place for this. If you are looking for headache then purchase this.", "verified": false, "helpfulness": "0/0", "author": "William Kruger"}, {"rating": 2.0, "review": "Limited Google applications. Chromecast should be application agnostic. ANY application should be able to CAST, not just limited to Chrome. There are other devices on the market already without ChromeCast limitations.", "verified": true, "helpfulness": "0/1", "author": "Hossein M Moghadam"}]