[{"rating": 5.0, "review": "Cute little device.It's a bit of a downer that it can't be powered via HDMI, but no big deal.Not the most powerful Wi-Fi device either, but is connects without mayor hiccups.Few apps, some a rough some are better implemented than others (if you have a WP8 phone, TubeCast will probably make you cry a bit) but like the title says, it has potential!It's cheap, it works and with the recently released SDK, is just a matter of time to start seeing more and more apps.", "verified": true, "helpfulness": "0/0", "author": "LordsBH"}, {"rating": 5.0, "review": "this gadget may not be as feature loaded as the roku box but for the price its a great little device", "verified": false, "helpfulness": "0/0", "author": "Charles S. Barnhart"}, {"rating": 5.0, "review": "By itself, the Chromecast is good.  Easily throw YouTube and Chrome browser content up on your TV during get togethers, have people display their content on your device without having to ask for passwords or configs...but when coupled with Plex, this device is on a whole new level.At the touch of a button, I can have my entire media library streaming to my TV, wirelessly, for $35.  It simply doesn't get better than that.", "verified": true, "helpfulness": "0/0", "author": "Scott R. Tucker"}, {"rating": 4.0, "review": "The hardware itself is a 5-star, literally a 3 step setup.I use my Roku 2 XS (hard wired to the router) for most of my video streaming and use the Chromecast as a supplement:1) casting my from the chrome browser2) youtube (love the \"TV queue\" feature that lets you line up all the videos you want to watch that day).I'm not getting too much use from it right now, but hoping that more apps (hoping games) start utilizing the Chromecast", "verified": true, "helpfulness": "0/0", "author": "edmo"}, {"rating": 5.0, "review": "I only use it at the moment to stream YouTube from my phone. At this time I have not researched other uses, to be more helpful.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "I own this product and love it.. For me it works as advertised.. My question is how does the Limited Edition differ from the $35.00 one I purchased..?Mine came with everything that this one does.. Hooks up the same way..So.. Am I missing something here..?", "verified": false, "helpfulness": "0/0", "author": "Joe Grober"}, {"rating": 1.0, "review": "It's too slow to watch anything from my brand new laptop.  It pauses every few seconds to buffer.  Not compatible with my Samsung S4 phone which is only a year old.", "verified": true, "helpfulness": "0/1", "author": "mark"}, {"rating": 4.0, "review": "This is a great little device.  We run it with 2 ipads & so far it has been great for netflix!!", "verified": true, "helpfulness": "0/0", "author": "Dean"}, {"rating": 5.0, "review": "For 35 bucks you can make any TV with a HDMI input a smart TV. I have two of them and they work great. Also a great gift idea.", "verified": true, "helpfulness": "0/0", "author": "Gary Nagra"}, {"rating": 4.0, "review": "I bought this because the TV in my bedroom isn't a \"smart TV.\" The Chromecast does exactly what it says it does, was really easy to set up, and works great. I wish it was compatible with amazon Prime streaming, but sadly, it is not. That's just about the only downside.", "verified": true, "helpfulness": "0/0", "author": "Misti Mackey"}]