[{"rating": 3.0, "review": "Love most things about this unit. The Amazon side of things is great, but it is let down by the Hulu app. It's buggy and is essential to my viewing experience. The Hulu app on my Roku is much more reliable.Finally, when streaming hd video, I still get 'stutter' when the camera pans a scene. Better than my Roku in this respect, but I was hoping for better with all the extra processing power.", "verified": true, "helpfulness": "3/3", "author": "Pete Ford"}, {"rating": 2.0, "review": "Two things:1. It didn't work, so I had to send it back. It cost me a few hours on the computer troubleshooting, and on the phone with tech support who wanted to take me again through all the basic troubleshooting I had already done. I said no to that, and we proceeded with him trying to make it work. I then waited a week for the promised \"call in two days\" from the Tech Report that he filed with the higher Support people. It never came.Since I had the number of the tech report, I put that on my return request and it went smoothly.The return process was EXCELLENT; refund was given as soon as UPS picked up the package with its free return label.2. Because the process for obtaining the Free movies was so burdensome, costing us too much of our precious hours, we decided not to replace it. --We ordered a ROKU instead.  We can watch our Amazon Prime offerings on the computers.", "verified": true, "helpfulness": "2/3", "author": "Dr. Taylor"}, {"rating": 3.0, "review": "First let me say that my initial impression when using the fire tv at work was outstanding with an excellent menu layout and very well laid out search functions. However I must warn others that if you own an older display that has DVI input instead of HDMI and are using an HDMI to DVI cable you will not be pleased. The fire tv is locked down to strict HDCP handshaking like the apple tv. I returned 3 of these before identifying the problem. Sadly because of this we will continue to use the roku 3 which works just fine on DVI.", "verified": true, "helpfulness": "1/3", "author": "Jessica Arnold"}, {"rating": 4.0, "review": "I love everything about this device but the remote quality is suspect. It has been less than two months and the clicker is starting to fail. For example, the up button no longer clicks so it's getting harder to navigate.", "verified": true, "helpfulness": "1/1", "author": "Vu Q. Le"}, {"rating": 2.0, "review": "Purchased to solely watch Twitch.  It pauses so many times it's unwatchable.  I wanted to watch League of Legends on my big screen tv and am very dissapointed.  Hopefully they improve the app since Amazon now owns it.", "verified": false, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great and has tons on it! We have comcast cable and haven't used the cable since we got this box", "verified": true, "helpfulness": "1/1", "author": "Robert & Meagen Smith"}, {"rating": 3.0, "review": "Pros:Easy to installVoice searchEasy to useCan install most regular android apps manuallyMultitasking (aka play Pandora and a game at the same time)ConsNetflix app is super out of date and clunkyVoice search doesn't cover any content outside of amazon (roku will search all video sources at once)Many apps lacking that can only be installed manually (such as Spotify, vudu and any other video provider other than Netflix and hulu).In the end it was a nice experiment to install xbmc and gain root access, but then I got fed up with Netflix being outdated, and having to use a keyboard and mouse for most manually installed apps.I got a Roku again though. More stable and way better media selection and integration.", "verified": false, "helpfulness": "7/7", "author": "hkleiner"}, {"rating": 5.0, "review": "Purchased specifically because my Smart TV was not that smart or fast. I love this enough to have bought one for my brother the next day. It is the Fastest Easiest way to watch Amazon Prime content. I loved \"Hand of God\" Ron Perlman is awesome and the pilot series this year is worth the cost of the device even without the prime shipping.", "verified": true, "helpfulness": "2/2", "author": "David W \"Video Dave\""}, {"rating": 1.0, "review": "kept saying \"problem playing your video contact amazon.. of course there is no phone number on the website\".. finally got through.. 3 hours on phone with tech support.. same problem.. wont play ANYTHING", "verified": true, "helpfulness": "3/5", "author": "John D Allen"}, {"rating": 3.0, "review": "I really like my Fire TV. I like the games option. What really is ABSOLUTELY TERRIBLE is the small amount of memory the device has. To put some of the really great games on my FTV I have to remove other games which pretty much is stupid. Amazon needs to allow folks to connect USB memory of some type on FTV. Otherwise it is SEVERELY crippled. I know it can be \"in the cloud\" but is such a giant hassle and it eats up data needlessly. This device is simply crippled until this gets fixed. If you are going to promote games and put the hardware in to play some really great ones the present setup is pretty much useless.", "verified": true, "helpfulness": "2/2", "author": "memwmp"}]