[{"rating": 5.0, "review": "Awesome! A must buy if you own a Android device!", "verified": true, "helpfulness": "0/0", "author": "Steve Haze"}, {"rating": 5.0, "review": "Use chromecast all the time love it!", "verified": true, "helpfulness": "0/0", "author": "G. Reed"}, {"rating": 4.0, "review": "Not nearly as simple to use as advertised: one really must be a nerd to use this well.But it does what hit says it will do, as long as everything is connected correctly.Note: this assumes that you're using the speakers on your TV; if you're using other speakers, this requires help.This device: (http://amzn.to/1tsC6Nt), plus these cables: (http://amzn.to/1sXhoA4 & http://amzn.to/1wT1MCI) solved that nicely.Does a fine job of showing photos or from my phone on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Nor'west \"NWP\""}, {"rating": 5.0, "review": "I really liked the product. It does what It said in description. I use it with my iPhone and iPad and so far there are no complains. I would really recommend it.", "verified": true, "helpfulness": "0/0", "author": "NADEEM"}, {"rating": 5.0, "review": "I once bought this one and have to admit how great it is. So I come back buy one more to make a gift for one friend. Its reasonable price saves you big money as it turns your TV into something even better than smart TV. Very convenient with small, clever design, easy to bring with and works great with mostly any mobile phones or tablets", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 1.0, "review": "Piece of trash. I've had 2 chromecasts and neither have worked. Plug it in - red light. Try the reset- red light. The 5 minutes it was actually turned on with the 2nd one - couldn't connect to network. Piece of trash. I'm done with this.", "verified": false, "helpfulness": "0/0", "author": "Paul S. Runnoe"}, {"rating": 5.0, "review": "Arrived on time. Bought for my brother who loves it and uses it all the time on his tablet and tv.", "verified": true, "helpfulness": "0/0", "author": "Ol."}, {"rating": 5.0, "review": "I am hoping it does everything the adds said it will do. I Travle for a living had not hooked it up yet but I'm hopeful it's great", "verified": true, "helpfulness": "0/1", "author": "Edwin R Holt"}, {"rating": 5.0, "review": "Best item I've bought on here", "verified": true, "helpfulness": "0/0", "author": "Deondra Jones"}, {"rating": 3.0, "review": "waste of money.", "verified": true, "helpfulness": "0/0", "author": "Greig"}]