[{"rating": 4.0, "review": "Fire TV works great.  I find the screens to be a bit less user friendly than the ROKU (which we also have), and the viewing is limited for now.  We opted for this, however, because Amazon usually is a great supporter of products they put out.  We are enjoying using the Fire TV, and look forward to additional apps in the future.", "verified": true, "helpfulness": "0/0", "author": "Barbey G \"BarbeyG\""}, {"rating": 3.0, "review": "Had many good qualities and many not so good.  Netflix for one does not break down the genre of subjects. so surfing is a problem .  Another problem to me, am I prime, which ones are free and part of my subscription? I entered a few movies only to find I can either rent them or buy them but are not free, until I started to watch a show..  On the excellent side is the quality of sound and picture. Also voice command is a definite plus. Netflix, I turn it on scroll to my options in minutes and it is ready to watch. I  realize there is more to fire tv but I find navigation somewhat difficult.  Frank Dandria", "verified": true, "helpfulness": "2/2", "author": "Frank DAndria"}, {"rating": 3.0, "review": "As advertised, Amazon Fire provides quick access to streaming and an improved picture.  It works extremely well for films streamed directly from Amazon Prime.  We've been disappointed with the streaming from Netflix, however.  The pictures drag from time to time, which makes viewing them very difficult.  So we've had to return to our previous source for Netflix, a DVD player.  I'm not sorry for the purchase, since the easy availability of Prime movies is a real plus.  But it's not everything we had hoped it would be.", "verified": true, "helpfulness": "1/1", "author": "Charles B. Harris"}, {"rating": 5.0, "review": "It was so easy to connect to the TV. Then the really easy part started-handed the remote to my 11 and 12 old grandkids and they took over the rest now the hardest part is changing the input from TV to Amazon Fire TV. I love it and the kids love it. Now only if it could get rid of the fighting about who gets the controls.", "verified": true, "helpfulness": "0/0", "author": "Nana"}, {"rating": 4.0, "review": "I use Fire TV to connect to Netflix without using my PS3, Watch Amazon Prime Video content, and Showtime Anytime.  I like the voice search, the remote is easy to use.  Finding Prime Free content is not always easy, they \"hide\" it... under \"more ways to watch\".  It would be better if you could search by free content or that was just an easy option on the front viewing page for each item.  Also, for $100 you would think that there would be more quality free content offered, but there isn't.  If you'd like to watch really old movies or shows from a TV perspective, this is your system.  If you're looking for newer content... better be ready to pay up.Prosvoice searchShowtime Anytimefast and easy connection to Netflixlinked to Prime accountStreams amazon prime musicConsThey hide the \"prime free watch now\" buttonFree content not easily searchableNo HBO GO or Stars PlayNeed more channels (kids content channel, learning channel, DIY channel....)", "verified": true, "helpfulness": "2/2", "author": "SC2313"}, {"rating": 5.0, "review": "This was a whim Purchase and I feel that it is one of the best ones out there. The OUYA has nothing on this. this box is connected to prime and lets me watch the entire database of movies and is one of the only ones to use a external USB to allow me to watch my home movies and videos. I would recomernd this to anyone looking to watch stream content.", "verified": true, "helpfulness": "0/0", "author": "Matthew D Church"}, {"rating": 5.0, "review": "Very pleased with this purchase and Amazon.  Just wish it had a button to turn it off.  Lots of good movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 3.0, "review": "It was ok. It would have been nice to be able to access programs or apps like VUDU. Also, Prime movies and TV shows are much older programs that can be seen on Netflix or Hulu. It is not worth the price unless they allow you to access more from it.", "verified": true, "helpfulness": "0/0", "author": "me"}, {"rating": 5.0, "review": "This unit is in my opinion the most advanced system for the TV.  It's second to none as far as it's overall features.  I give it the highest recommendation.", "verified": true, "helpfulness": "0/0", "author": "Ronald l. Graham"}, {"rating": 5.0, "review": "REVISED: December 30,2014: I don't really recommend it anymore because I've discovered VUDU, they use paypal and i can purchase movies or rent them. No more waiting for something i like to show on netflix or amazon prime, Whatever i feel like watching i just rent them for the night. Next television i buy will have a vudu app for sure.Original Review: I use UnblockUs service on this device, i have my wifi router setup and i can watch the north american version of Netflix and i can finally view amazon prime videos,. ( can't purchase though because of non-US Credit card)There is no customizable configuration when using wifi, so you'll have to setup your wi-fi router with the dns server numbers.I own both ps3 and ps4 and i rarely use my television except when playing games or the occasional bluray classic film. I really bought it for the others in my household so they can stop using my ps3.When i first got amazon fire tv box i wanted to set it up as fast as possible and be done with it, but holding the very comfy remote and trying out basic apps like the tunein app listening to music, switching to movies it feels really great. It actually got me back interested in movies, i watched all star trek episode and movies available.Now when i watch netflix on my ps4 i miss holding the remote. its really great device and really well made, its so small and cute. amazon has a great service for its prime members where you can upload family photos and then view them on your tv with the rest of your family. It also has video game support and if your just a casual gamer or have kids I recommend it over the more serious game consoles, it gets the job done for the kids.If your outside of america and like many people would like to use the north american Netflix this box will work and if your an amazon prime member you'll get free prime movies (but you'll be unable to make purchases without an amercian credit card). it also has other great apps that will entertain the whole family. i highly recommend it even if you don't watch much tv, it probably will make you fall back in love with watching television just like me.", "verified": true, "helpfulness": "1/3", "author": "Dennis.B"}]