[{"rating": 4.0, "review": "Works great. Neat idea. Would recommend for every one give it a try I think you will like it too", "verified": true, "helpfulness": "0/0", "author": "Alan S."}, {"rating": 5.0, "review": "I wanted a way to stream wirelessly from my iPad and this was the perfect solution. Super easy to install and works great every time. I end up buying two and recommending to others.", "verified": false, "helpfulness": "0/0", "author": "Sandy Schultz"}, {"rating": 4.0, "review": "I guess setting up the Chromecast was not as a breeze as it was for most users. I simply couldn't set it up through chrome. I checked all the router settings as it was suggested by the installer, even reseted my router, but to no avail. After going though all forums and troubleshooting pages, I realized that the firewall on my Macbook Pro is on, and that's the reason. When I disabled the firewall, it was set up in no time.But things got better after that grueling installing experience. I have hooked the Chromecast up to my LG 39LN5300, and it works (almost) perfectly. I use it to watch youtube, Netflix, or to stream (some) online videos using VidCast bookmarklet. From time to time, it doesn't work, but a simple reload of the chrome page almost always solves the problem. I also tried tab-casting, but it's not something to write home about. You can cast The Daily Show, or Colbert Report, but it only runs (almost) smoothly at 480p, and it takes a lot of CPU and RAM (you can hear the fan on Macbook Pro going crazy). The good thing though is that it also casts the audio to the tv. To be fair, this option is still in beta version, so hopefully it will get better with time.What is exciting about Chromecast is that Google recently released the SDK for developers, and they are doing a great job coming up with cool ideas (check out AllCast, for instance). This is what sets apart Chromecast from Apple TV and Roku. I hope Amazon also releases its own app for Chromecast some time soon.", "verified": true, "helpfulness": "0/0", "author": "Alireza202"}, {"rating": 4.0, "review": "I sometimes have a voice/video sync problem when I broadcast from my Chromebook but it works perfectly when I use my phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got this on sale and bought it thinking I would use it for streaming video. Shortly after receiving the plug in I bought a new TV and it had Google already installed in the firm ware on the TV so I didn't need it. I gave it to my daughter and she is using it and it works well.", "verified": true, "helpfulness": "0/0", "author": "Bob0a"}, {"rating": 2.0, "review": "Not happy with this at all.  It will only stream Netflix and Youtube content.  If you try and stream Amazon Prime content, it will not do it.  I purchased it for that reason and found after I received it, it will not work.", "verified": true, "helpfulness": "1/1", "author": "Tommyyamaha"}, {"rating": 2.0, "review": "I'm a big google fan. In my eyes, very few products google touches can be seen in a negative light. However as of right now, this product needs some work. I got this with the hope that I could use my PC to watch what I was seeing, etc. For a windows user with no android devices in my home I was able to see Google, netflix and Hulu. That was as far as the supported apps it already had. I could snyc my google chome from my desktop PC with this device and my iPhone could pick up this device but I could only share from my desktop and it was not the biggest resolution and the streaming delay was a bit laggy. I returned this product. I could just as easily get the supported features and more from a RoKu.", "verified": true, "helpfulness": "0/0", "author": "Brandon B."}, {"rating": 5.0, "review": "If you do not have this you are missing out on a cool tool. I like lying in bed on my days off to watch movies and this tool really makes  it happen. Before i had to hook my laptop up to a rgb cable to my flat screen now i just caaassst it.  I have gotten chrome cast to cast downloaded movies, youtube movies, realplayer cloud movies and even work on a different page on my laptop while casting. Its easy to use, i actually run 30 mbps on my internet and everything looks great when casting. My note 2 cast the same way from realplayer cloud, but not from google chrome because there is no tool bar on my my phone. Tablets work great as well so have fun i use it a alot.", "verified": true, "helpfulness": "0/0", "author": "Shawn Higgins"}, {"rating": 5.0, "review": "Awesome gadget. Does so many cool things for only 35 bucks and easy to set up on your home network.", "verified": true, "helpfulness": "0/0", "author": "Rob Ellwood"}, {"rating": 5.0, "review": "This unit is not to be believed. All my friends that have seen it tell me they have to have one. Am thinking of purchasing another for another room t.v.It works from my Nook, Ipad. Laptop, etc.", "verified": true, "helpfulness": "0/0", "author": "phil h"}]