[{"rating": 5.0, "review": "Love it, replaces cable\\satellite", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 4.0, "review": "Works as described. Streaming quality is better than I was anticipating. I would like to see more app support and maybe casting via chrome on mobile devices.", "verified": true, "helpfulness": "0/0", "author": "Robert Baca"}, {"rating": 5.0, "review": "Absolutely love it! The only possible negative thing I can think of is that the cord is just a bit too short even with the extender. Great value for the price.", "verified": true, "helpfulness": "0/0", "author": "Robyn Hackett"}, {"rating": 5.0, "review": "Loving it so far. Easy to install and use. Will never go back to an HDMI cable if I can avoid it!", "verified": true, "helpfulness": "0/0", "author": "Christopher B. Rodell"}, {"rating": 5.0, "review": "I love it. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Don't have to use the computer to connect to the TV anymore.", "verified": true, "helpfulness": "0/0", "author": "Running Helga"}, {"rating": 5.0, "review": "Works just like it is supposed to with no wires needed. Just plug into the back of the tv or your receiver and it's as simple as following the directions on the screen.", "verified": true, "helpfulness": "0/0", "author": "C Ferguson"}, {"rating": 2.0, "review": "Honestly, I would not recommend this product. I understand that it may not have a lot of apps and that you are not able to have that mirror effect off the iPad (I am able to do it through my GalaxyS4) but it works when it wants. All I really wanted it for was for my daughter's room... Netflix and YouTube WAS all I wanted so because all the reviews said that was all that worked I figured that was perfect. Nope, when I'm trying to \"find\" the device it does not appear all the time. Waste of $30. I have the ROKU box in the other rooms in the house and 1 smart tv... would recommend the other products instead.", "verified": true, "helpfulness": "0/0", "author": "Garibay M."}, {"rating": 5.0, "review": "Chromecast is an amazing device and worth more than the current price tag. It easily outperforms my Fire TV stick, and I love the ability to share the whole screen of my android phone to the TV so I can even play games and watch unsupported video formats.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 1.0, "review": "I was extremely disappointed with the Chromecast in that it did not produce the results it had advertised. Tried different methods, but same result.  I'm not happy st all", "verified": true, "helpfulness": "0/1", "author": "Xavier Perez"}]