[{"rating": 5.0, "review": "Great product. Replaced my Blu-ray player with this. Blu-rays are so over rated. Plan to buy another one of these for my spare bedroom tv. Awsume product. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "fatboy04"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Robert J Morris"}, {"rating": 5.0, "review": "I have 2 fire tv's and am spoiled along with my wife. Switching back and forth from Prime TV to Netflix is flawless, meaning, you will be impressed with the speed at which this unit operates given a adequate internet service speed. My service is 80mg download speed which checks out in the high 70's under speeedtest.net and am using amazon prime. The only aggravation that we were presented with was a reset, that was required  to re-established service in order to fix a malfunction, but just like the intro video explains quite well, most glitches can be fixed with a power down for 30 seconds. The complete reset is in the settings menu and requires password for router and amazon to be reentered, but once done all the gremlins were gone! Audio search in the amazon offerings from the remote is cool and fast! If you have a 5.1 or higher setup, you will appreciate the quality sound from this unit given any good A/V amp and speaker usage.", "verified": true, "helpfulness": "0/0", "author": "9THPSUCHIEF \"Chief Snipe\""}, {"rating": 5.0, "review": "Makes watching TV....using Amazon Prime....Netflix...Hulu, basically everything so easy!", "verified": true, "helpfulness": "0/0", "author": "Maria Knight"}, {"rating": 3.0, "review": "Graphics are really nice and the system seems to be user friendly. I thought it came with complimentary Hulu Plus, but it didn't.  It's pretty much the same as apple tv (which I already have) so it didn't make sense to keep it.", "verified": true, "helpfulness": "0/1", "author": "Corymia"}, {"rating": 5.0, "review": "In use for the last few weeks and working well.  Very fast.  Note that voice control only works with Amazon content.  Solid user interface.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey C. Lewis"}, {"rating": 5.0, "review": "I LOVE the Amazon Fire TV!  It is Wonderful and streams movies very well.", "verified": true, "helpfulness": "0/0", "author": "lfletche"}, {"rating": 5.0, "review": "I absolutely love this.  I wish I was able to pull the games I currently have downloaded for free or paid for and play on the TV.  Other than that, I love being able to watched different things on my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works fine.", "verified": true, "helpfulness": "0/0", "author": "David Sturniolo"}, {"rating": 5.0, "review": "nice gadget, i have an apple tv and roku tv and i think by far amazon fire tv is the best, with a lot of app to choose of, and also excellent games.", "verified": true, "helpfulness": "1/1", "author": "HANSEL TAVERAS \"hansel taveras\""}]