[{"rating": 5.0, "review": "Fast and beautiful HD picture.  I like the fact it has both Cable and wireless options.  With the cable there no pauses.  I have a DVD/NETFLIX player (SONY) with a wireless only options and there is a lag sometime.", "verified": true, "helpfulness": "0/0", "author": "Amukbuyer"}, {"rating": 4.0, "review": "Dear sir, I'm presently living in Nicaragua, and we have Claro for TV, Internet, programing, etc. It is a company owned by Mr. Carlos Slim from Mexico. Is this Amazon Fire TV can work in Nicaragua? Please advise, or research for me???", "verified": false, "helpfulness": "0/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loving this box expecially since I received a second one free with my new Kindle fire HD (on another purchasing site).  I have downgraded my cable service and utilizing my Prime account more along with Netflix.  If you are like me and don't really look at cable TV like I would recommend you getting this and watching what you want and not paying for what they want you to have.  I would highly recommend this!!!", "verified": true, "helpfulness": "1/1", "author": "msladydc"}, {"rating": 4.0, "review": "While it doesn't have all the apps that a Roku does, it has all the ones I need.  I much prefer the user interface to the Roku as well.  The only negative feedback I have on it is the lack of infrared which eliminates the use of many harmony remotes.", "verified": true, "helpfulness": "2/3", "author": "John S. Holzer"}, {"rating": 3.0, "review": "It works good but as far as the Amazon prime membership there isn't much to watch with out paying for it even though you already have a membership.", "verified": true, "helpfulness": "1/4", "author": "Robert Barney"}, {"rating": 1.0, "review": "Frequently has trouble accessing any content and must be restarted. Has real trouble working with Hulu. And the cherry on the crap sundae is now it won't access any of amazon content and it completely unusable. It is connected to my internet, I have rebooting and there is no help. I do not like this at all. I do not recommend. The Roku is way more reliable and user friendly.", "verified": true, "helpfulness": "5/11", "author": "Liz Jolie"}, {"rating": 5.0, "review": "Love it!!! If you don't have a smart tv but want one than this is for you. It can be used wireless or hardwired right to your modem. I love the remote that doesn't have to be aimed at the box to work and the speech recognition works very well.", "verified": true, "helpfulness": "0/0", "author": "Eric Reese"}, {"rating": 4.0, "review": "I bought my Fire TV about 3 weeks ago and I am very pleased with it.  We still keep and use our cable subscription but this is a nice addition!  We have one smart TV, Sharp Equios, and I am constantly disappointed in the problems; after comparing the two... Fire TV wins hands down!One thing I wish Amazon would add to the Fire TV is Vudu.  They currently have so many apps already I wish they would add this as I have a large collection on Vudu.You can't go wrong with this purchase for this price!  Enjoy!!", "verified": true, "helpfulness": "1/1", "author": "Rbaird"}, {"rating": 3.0, "review": "We have been streaming our television and movies on a Roku 3 for the last year and so I was excited when the Fire TV came out.  I thought it would be a good product for our main tv.  I really liked the format of the screens and how the content was organized.  In fact, I prefer it over the Roku3, however, the screen CONSTANTLY would lock up while streaming.  while watching a movie, the screen woudl freeze while the audio continued.  This sometimes lasted a few seconds and other times lasted ten minutes.  Thinking it was our internet service, I tested the speed and it was fine.  I plugged the Roku 3 back in and no hanging up issues at all.  Amazon advertises the Fire TV as having a faster processor than the Roku 3, but I didn't see that in my experience.  So we are back to the Roku 3 and have banished the Fire TV to the guest bedroom....", "verified": true, "helpfulness": "3/4", "author": "Jason T. Hein \"jth\""}, {"rating": 5.0, "review": "The Amazon Fire TV is amazing and so easy to work with also small enough you can place it anywhere .", "verified": true, "helpfulness": "1/1", "author": "Julius A. Simmons"}]