[{"rating": 4.0, "review": "Most of the time chromecast works great. We regularly have to reset it when we get the \"can't find device\" message from the icon on our  browser. Then it works again. (Its not our computer because the hdmi cord works just fine) Microwave will cause chromecast to glitch.", "verified": true, "helpfulness": "0/0", "author": "Nicole O'Donnell \"Nicole O'Donnell\""}, {"rating": 5.0, "review": "The best thing to connect my and android to tv", "verified": true, "helpfulness": "0/0", "author": "hamad al fardan"}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "TAL"}, {"rating": 2.0, "review": "I was anticipating something simpler; next time I need to register the product descriptions with a more thorough analysis. Need to tighten it up", "verified": true, "helpfulness": "0/1", "author": "David Piazza"}, {"rating": 2.0, "review": "Well it was hard to use", "verified": true, "helpfulness": "0/1", "author": "BIG 'D'"}, {"rating": 5.0, "review": "Liked it so much, this is my second one.  Now we can watch movies, etc on either large screen TV.  The ShowBox.apk with AllCast app is a great combination for viewing movies.  You must have a strong wifi signal, and be willing to wait for some buffering for the show to start.  When it does, you're off and running a lot cheaper than going to the theater.  And the popcorn is a LOT cheater at home also.I ran out of HDMI ports on one of my TV's, so one ChromeCast is working on a splitter.More websites are casting all the time, so the range of content is always expanding.  Even YouTube has full length movies.Highly recommended. Pays for itself in no time.", "verified": true, "helpfulness": "0/0", "author": "Mr Graphics \"worldvue.us\""}, {"rating": 5.0, "review": "My wife's valentine's gift.  She's setting back and enjoying her shows.  Well worth it!  Easy to set up and working great in about 15 minutes!", "verified": true, "helpfulness": "0/0", "author": "david r."}, {"rating": 4.0, "review": "Work fine. Limited apps to use for this. Need to get updated. Setup is OK... sometimes it gets difficult to setup...", "verified": true, "helpfulness": "0/0", "author": "Khoi N."}, {"rating": 3.0, "review": "My only complaint is that it only works in chrome browser..and no browser on your smart phone or tablet", "verified": true, "helpfulness": "0/0", "author": "Andre H."}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "basel shamali"}]