[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Gianfranco De Blasi"}, {"rating": 4.0, "review": "Great product for the money!", "verified": true, "helpfulness": "0/0", "author": "April MacMackin"}, {"rating": 4.0, "review": "Works great. I just wish it can cast the screen of my PC.", "verified": true, "helpfulness": "0/1", "author": "AKB48"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Thiago Keismanas"}, {"rating": 5.0, "review": "Works great with all my streaming apps.  Cheaper than other options for streaming and you can use your cellphone as a remote!!!", "verified": true, "helpfulness": "0/0", "author": "Matthew Morgan"}, {"rating": 2.0, "review": "I really like the chromecast, but after about six months of using it about once every two weeks, it now overheats extremely fast, and then looses connection. Has anyone else had this problem? I literally have to reset it once a minute which makes watching anything impossible.", "verified": false, "helpfulness": "1/1", "author": "David Money"}, {"rating": 4.0, "review": "I thought i'd use it more than i do, wish it didnt need external power.", "verified": true, "helpfulness": "0/0", "author": "Ben Myers"}, {"rating": 1.0, "review": "After many reloads, I finally gave up on getting this gew gaw to work with Verizon wireless. Stop motion is what I got. Better stick with Roku.", "verified": true, "helpfulness": "0/2", "author": "Samuel H. Bostaph"}, {"rating": 3.0, "review": "Didn't realize I can't broadcast most of videos I stream on my smart phone, eg. Amazon instant video and other apps.  Very limited apps I can broadcast.  The ones I can cast, eg Pandora, is problematic (may be because the apps sux).  YouTube plays just fine.Streaming from my laptop most TV program from major networks had mostly been annoyingly slow and unreliable.  Quality is poor may be when connecting to my Wifi (router is only in the next room).Overall though, for $35, I guess I won't have much expectation.  Just okay.  I'd use my traditional HDMI cable to my laptop which gives me much better quality.", "verified": true, "helpfulness": "0/2", "author": "Elsye Fm"}, {"rating": 4.0, "review": "I did not research as well as I should have. After I got it I found it is not compatible with vista on my computer. But I am able to use iton my phone to watch on TV. But for some reason I can't find it to put on my kindle. But all said and done I am happy with it and definitely think it is worth it !", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]