[{"rating": 5.0, "review": "Awesome way to stream without any hassle and easy set-up!  Google really nailed this one.....an exceptional device to own or give as a gift.", "verified": true, "helpfulness": "0/0", "author": "Sherman L. Howard Jr."}, {"rating": 4.0, "review": "the device works properly, and my wife can use it, win-win.I'm ordering another one for my parents, highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Giorgio Ardito"}, {"rating": 5.0, "review": "Streams Netflix perfectly. Quick and easy setup. Looking forward to the future capabilities of this item. Compliments cable viewing wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Joseph Moore"}, {"rating": 4.0, "review": "It took quite sometime for my laptop and my TV to connect so that I could finish installing themedia player. I will wait and see how it shows day by day.", "verified": true, "helpfulness": "0/0", "author": "JAMES WARD"}, {"rating": 5.0, "review": "HBO Go, Netflix, Youtube and more... without any fuss. Google is constantly adding more apps for the Chromecast, so I expect the value of this purchase to only go up. Worth the money for HBO Go streaming alone.Great also for when I travel and want to watch tv, granted there is Wifi.", "verified": true, "helpfulness": "0/1", "author": "achilles318"}, {"rating": 5.0, "review": "It needs a few more apps but it is great. Needs tunein radio and gallery support and it would be perfect for my needs.", "verified": false, "helpfulness": "0/0", "author": "Shawn D. Medeiros"}, {"rating": 5.0, "review": "The setup was so easy with my TV. I love how I can send movies on Netflix to my big screen with a touch on my smart phone.", "verified": true, "helpfulness": "0/0", "author": "Mo M"}, {"rating": 3.0, "review": "I wish the system requirements would state \"use with Windows 7 or above\".  My Windows XP computer nor my MacBook are new enough to use this device.  I'll have to wait until my next computer upgrade.", "verified": true, "helpfulness": "1/1", "author": "David W. Titus"}, {"rating": 5.0, "review": "It's a great product, works, almost no setup required and it's easy to use.  I bought a second one about three days after the first for another TV.  Wonderful if you are looking for a low cost way to stream \"Youtube,\" or \"Netflix.\"", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "I know it will never happen but it needs Amazon Instant Video built in. I know about Chrome workarounds but that's exactly what it is.", "verified": true, "helpfulness": "0/0", "author": "Steve Griego \"stebog\""}]