[{"rating": 4.0, "review": "It makes easy work of adding the internet and netflix and other apps to non-smart tv's. I have a nice 42\" panasonic plasma in my bedroom and its great now that it is \"smart\" However the user interface is not as nice as a smart tv but like I said it does work and its nice to have the net connected to a non smart tv.Its nice not to have second remote but you do sorta have a second remote because you can only control the programming with your phone but the volume and other tv controls have to be controlled with your tv remote.Easy to hook up and set up and I got it for $23 total and shipped fast. All other devices on the market (Roku, Amazon, Apple, etc) are all $80-$100. So although the Chromecast has a few quirks I dont like (the other brands probably do as well) its an amazing value for what you get and it does what its supposed to in that it makes your non smart tv into a smart tv. I would recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "MitchH"}, {"rating": 1.0, "review": "You have to have a app to get your netfelx.  Pay another 39.00 for the app", "verified": true, "helpfulness": "0/5", "author": "pAT42"}, {"rating": 5.0, "review": "good produced and it compliments the ROKU is some respects.", "verified": true, "helpfulness": "0/0", "author": "alexander peterson"}, {"rating": 5.0, "review": "Nice and cheap", "verified": true, "helpfulness": "0/0", "author": "S. Reineke \"Rhino\""}, {"rating": 4.0, "review": "Got what expected.", "verified": true, "helpfulness": "0/0", "author": "JoeT"}, {"rating": 1.0, "review": "I owned an Apple tv/iPhone and unfortunately got a chromecast when I got my LG g3. Wow, this is a terrible piece of hardware.First, some things you may not know. HDMI is NOT a charging medium, meaning the chromecast needs to be plugged into a wall outlet as well as the tv, much like any DVD player would. Funny how they NEVER show this completely necessary detail in ads or photos.Well, why is it a terrible piece of hardware? Good question. First of all you have to open the chromecast app to connect (as opposed to automatically connecting as with Bluetooth or with a button on your YouTube or music player window as with Apple tv). (And yes, I do mean you have to go to the app EVERY TIME.)Next, about 1/10 times you will be able to ffw and rw. It ONLY SENDS THE VIDEO TO THE TV, it does not allow you to interact with the video using your phone as a remote as I expected it would. I found YouTube to be the most reliable with control.MOST of the time you can pause/play the video, BUT NOT ALWAYS. once you have sent the video to the tv, you can just sit around with your thumb up in some creative places and watch. Hope you like ads and credits! Hope you never want to watch one specific scene over again!Lastly, and the real reason this is a 1 star for me, is that you can't play music over chromecast, only video. Buy an Apple tv and get the $5 app which let's you use it with an android phone.", "verified": false, "helpfulness": "0/0", "author": "Natty Shack"}, {"rating": 4.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Miguel"}, {"rating": 4.0, "review": "Works very well with streaming apps through my Samsung tablet, Samsung phone, and iPod touch. It's terrible through my laptop though. The video doesn't seem to buffer at all and is very choppy. And yes, I tried to lower the video quality to \"standard\" (lowest available resolution) and it wasn't any better. Overall I am very happy with how it works. Given the cost it is totally worth it. I just won't be using it with my laptop.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Schneider"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "M. Drab"}, {"rating": 5.0, "review": "Excellent !!", "verified": true, "helpfulness": "0/0", "author": "RONISVALDO RIBEIRO DOS SANTOS"}]