[{"rating": 5.0, "review": "Was given to me as a gift.  Love it.  Better than AppleTV.", "verified": true, "helpfulness": "0/1", "author": "jim B \"jimmyb\""}, {"rating": 4.0, "review": "Amazing device and simple UX. I can't wait till some of the apps catch up to to the UX!", "verified": true, "helpfulness": "0/1", "author": "Matt Saling"}, {"rating": 5.0, "review": "The Amazon Fire TV is wonderful. It beats Netflix by a mile. Very easy to install and to use. Selection of what you want to watch is simple. No long searches. I have been raving about this device to family and friends. I recommend this to all.", "verified": true, "helpfulness": "0/1", "author": "Nancy S."}, {"rating": 5.0, "review": "Amazing", "verified": false, "helpfulness": "0/0", "author": "Trent Dunn"}, {"rating": 5.0, "review": "Love it! I love the apps on here, I work out with one of the apps everyday and it's so nice to not have to put a DVD in the player. My kids love the variety of shows too!", "verified": true, "helpfulness": "0/0", "author": "Aratatat"}, {"rating": 4.0, "review": "Glitchy at times", "verified": true, "helpfulness": "0/0", "author": "Billy"}, {"rating": 5.0, "review": "This has to be the fastest system on the market. It loads very quickly and Amazon Prime has the most up to date movies than any other service online.", "verified": true, "helpfulness": "0/1", "author": "steve jones"}, {"rating": 5.0, "review": "Super fast streamer and loves it, can replace my cable box", "verified": true, "helpfulness": "0/1", "author": "ebenezer mensah-addison"}, {"rating": 5.0, "review": "The only thing that I have found missing with this unit is not having the option of having the menu to check to see what movie you.are watching if you happen to tune in late or to see if a program is a repeat.  I love everything else about it!!", "verified": true, "helpfulness": "0/1", "author": "Elaine Murray"}, {"rating": 5.0, "review": "Bought this for a Christmas gift for my husband.  He loves it.  Simple to use and the whole family can enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Andrea Webster"}]