[{"rating": 5.0, "review": "It's a bummer that you can't stream Amazon Prime using Chromecast (hint hint, Amazon), but otherwise it's pretty fantastic and so cheap. I no longer have cable and I couldn't be happier about it.", "verified": true, "helpfulness": "1/1", "author": "Katie K"}, {"rating": 4.0, "review": "It works great with wi-fi. The main dissapointment is that it does not work with the cell phone's \"mobile data\", meaning access through the smart phone non-wi-fi 3G or 4G data plan, that would allow you to see video content through the tv where you don't have cable/router internet connection (wi-fi).", "verified": true, "helpfulness": "0/0", "author": "Norberto Vignoli"}, {"rating": 5.0, "review": "Great!!! Really good purchase. Love chromecast, really easy to use . Everything  as expected. i realy recommend to buy it", "verified": true, "helpfulness": "0/0", "author": "milagros"}, {"rating": 5.0, "review": "Excellent product! i recommend it, only 35 dollars to see your phones videos and power on your tv! Google product, immense quality", "verified": true, "helpfulness": "0/0", "author": "Ignacio"}, {"rating": 4.0, "review": "It was easy to install and very easy to sync with wifi. I wish Google provides more apps to stream.", "verified": true, "helpfulness": "0/0", "author": "SD"}, {"rating": 1.0, "review": "Why does this have 1 star when it should be zero? Because this product should be thrown in the trash. What a complete waste of money. It doesn't work at all as I thought. The only app I can use is Netflix. I already have Netflix on my DVD player. I am so dissatisfied with thus piece of junk that I don't even want to return it for fear they'll sell it to some other poor sap who doesn't know better", "verified": true, "helpfulness": "0/3", "author": "Andrew J. Frazier III"}, {"rating": 5.0, "review": "Google with another masterpiece. Takes the apps from your phone and puts them on your TV. I put YouTube on the TV from the Chromecast and even restarted my phone and it still ran on the TV.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 3.0, "review": "While Chromecast is inexpensive and has great potential, I am unable to get it to stream in full screen using Amazon Prime. The annoying part is that it's not clear in the help sections of Chromecast that this isn't possible. I just wasted almost an hour trying to get it to work. I know this is not all Google's fault but still it diminishes it's usefulness to me.", "verified": true, "helpfulness": "0/0", "author": "SamIamnot888"}, {"rating": 5.0, "review": "Google Chromecast works extremely well with Netflix and Youtube. I have enjoyed many movies and have been very pleased with the video quality and sound.", "verified": true, "helpfulness": "0/0", "author": "Blerina Gosturani"}, {"rating": 1.0, "review": "dorsnt work.woth Kindle.products. find that interesting since Amazon.sells.it. try the mirroring feature on your kindle which does the same thing. Talked to.both Kindle.and Google.  They don't want to.play nice and allow access to each.others platforms.", "verified": true, "helpfulness": "1/1", "author": "Rosanna J. Sandlin"}]