[{"rating": 2.0, "review": "Did not work with my Samsung Tablet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"S. King Fan\""}, {"rating": 5.0, "review": "Nice experience. Timely delivery and good product too.", "verified": true, "helpfulness": "0/0", "author": "francis olaniyi"}, {"rating": 5.0, "review": "Bought one for every room! Works well!!", "verified": true, "helpfulness": "0/0", "author": "K. Brewer"}, {"rating": 4.0, "review": "It links up with my phone, my girlfriend's phone, and a tablet. It does have some issues in staying connected to the tablet, however.", "verified": true, "helpfulness": "0/0", "author": "Andrew Bowman"}, {"rating": 5.0, "review": "This device is so great! Now I can do my Netflix movie streaming via my iPhone 5s. It's so amazing with all these gadgets nowadays, I thought I'd be stuck ordering Netflix dvd's by mail forever or have to upgrade to a Smart TV. The initial log on was fine but then I couldn't sign on to the Streaming part of it. Then it dawned on a friend of mine that I needed a Streaming account!  So I canceled my \"dvd by mail\" account and opened a Streaming account with a pw and then it worked!  So far so good, I tried to upload all the titles I had in my 'by mail que' onto my streaming que and noticed not all were available for streaming.  Other than that, I am so far happy having bought this chromecast device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Google hides the fact that only expensive high-end smartphones can accomplish screen share.  And without a smartphone, tablet or computer it can't do anything on its own except show an all-day slideshow of pictures from your selected source. (the only cool exception is that it will continue to play whatever you started from your other device even after it's not present or off).This is not a self-sufficient computer with a browser as I hoped for.  It can do nothing more than the devices you already have can do (besides being shown on a larger screen).  And it includes no free media accounts.  By the end of the 1st day until now I have resigned to only use it to launch free YouTube dance workout videos (see \"Zumba Beto\") and start paid Netflix movies on it from my phone's account then leave with my phone while it continues to stream the entire movie for my kids who remain to watch it (without the pause or stop controls on my phone).", "verified": true, "helpfulness": "0/0", "author": "A. Robateau"}, {"rating": 5.0, "review": "Works very good streaming from ipad to TV!  I wish some more of the TV network apps could stream to it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this Media player which I can watch all kinds of movies & listen to music through my TV.", "verified": true, "helpfulness": "0/0", "author": "Harry J. Rubright Jr. \"hrgolf\""}, {"rating": 5.0, "review": "Works very well and super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Herrada"}, {"rating": 5.0, "review": "Its nice to finally be able to see what's on my phone on a big screen. No loss of quality in audio or video. Everyone should have one of these.", "verified": false, "helpfulness": "0/0", "author": "Mendel Jaffe"}]