[{"rating": 4.0, "review": "This is so incredible. It's unfortunate that I can't use it for Amazon Instant Video or Yahoo Screens. Overall, a great and innovative product.", "verified": true, "helpfulness": "0/0", "author": "Kali"}, {"rating": 2.0, "review": "had to be rebooted all the time", "verified": true, "helpfulness": "0/0", "author": "Darlene Hollingsworth"}, {"rating": 2.0, "review": "I didn't see the fuss about these. Yes it works, sometimes. It's hit or miss for me. By no means on the same level as Apple TV but it will due for some people. I wouldn't buy another one.", "verified": true, "helpfulness": "0/0", "author": "Brandon Morris"}, {"rating": 4.0, "review": "Enjoying access to variety of options. Dialog is often out of sync with the picture which is disappointing.", "verified": true, "helpfulness": "0/0", "author": "William Cushnie"}, {"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "Nedu Computer Systems \"neducomputersystems LLc\""}, {"rating": 1.0, "review": "Did not work with my wifi", "verified": true, "helpfulness": "0/0", "author": "Esther  Large"}, {"rating": 4.0, "review": "so far so good. setup took longer than i liked. something hiccuped and i just had to redo the initial connection 3-4x. streams well from chrome browser/laptop and iphone 6 apps. picture and sound are good. disconnects every so often. reconnecting is quick. sometimes it goes hours without disconnecting, sometimes it disconnects 20 minutes later. i think it has to do with the number of devices connected to the router. (household has 3 laptops, game console, 2 tablets, and phones). so all the wifi traffic may be a variable. i dont blame the chromecast but i do see upgrades in the technology for future releases.", "verified": true, "helpfulness": "0/0", "author": "D."}, {"rating": 1.0, "review": "Deeply annoyed with the removal of support from early 4.0 android screens. Chromecast updates mean that most apps on 4.2 or earlier androids no  longer work. If you loved it you will hate it now. I expect a company that says compatible with 2.3 android on their site will actually be compatible. Chrome browser with mobile and chrome screen no longer work.", "verified": true, "helpfulness": "0/0", "author": "Disappointed \"unknownsoldier1\""}, {"rating": 5.0, "review": "Great not so expensive product", "verified": true, "helpfulness": "0/0", "author": "Sor Camila Oberto"}, {"rating": 4.0, "review": "Works well about 90% of the time. Sometimes it gets very laggy and pixelated, but for the most part works well. Only other downside is that I had to get a whole new router in order for it to be compatible. Very easy setup. Casting is simple using an iPad and iPhone. Will definitely purchase another for other TVs in the household.", "verified": true, "helpfulness": "0/0", "author": "RyokoG"}]