[{"rating": 1.0, "review": "-Chromecast sounds cool but is not that practical-You need another device to cast something onto your TV, chromecast doesn't have a brain of it's own-You'll run into frequent casting issues-Limited app support, how many apps does this thing support seriously? 15?-Compare this with Roku streaming stick which is available for 50 bucks and gives you more than 1200 apps to choose from-35 bucks is not 0 bucks people, I mean to say it's not dirt cheap as some people would say, for what this piece of hardware is, 35 bucks is 15 bucks more than what I would like to pay now that I know it's capabilities", "verified": true, "helpfulness": "0/0", "author": "S.D."}, {"rating": 5.0, "review": "I only wish I could use it to surf the web on the tv other than that it is awesome.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Lambert"}, {"rating": 5.0, "review": "I love my chromecast and will probably buy these for Christmas presents. It's great to stream directly from your phone or show your computer screen (tab) to the TV.", "verified": true, "helpfulness": "0/0", "author": "kdogg"}, {"rating": 5.0, "review": "Every thing is ok, time and product, i m using it in this moment at home with the family thanks to god", "verified": true, "helpfulness": "0/0", "author": "Jorge Ayllon"}, {"rating": 5.0, "review": "It's an amazing experience to have chromecast in a TV. It's easy to install and use google apps and share it.", "verified": true, "helpfulness": "0/0", "author": "DANIEL PAULO ZUIM"}, {"rating": 5.0, "review": "I got Chromecast since our family recently dropped our cable service and opted for Netflix as an alternative. Given the great reviews and after a little research, I decided to give this a try. Setting it up was super simple. It comes with a Micro USB cable and that is used to power it. Everything to use it is in there. I only needed the cable itself and connected to the TV's USB port and power it that way. After that was done, I was able to cast YouTube and Netflix from my iPhone to the living room TV.The cool thing about this is that it's not tied to a single TV. I moved it to my room and I was able to cast YouTube off of my computer, working just as well as in the living room. My parents loved it, I ordered another one so they could have it in their room and it works great. This is an awesome little device.It does get hot after being used and it is normal, according to the instruction manual. Just like the manual says, I disconnect the power and let it sit for a bit after I'm done using it before putting it away.", "verified": true, "helpfulness": "0/0", "author": "Monroy of the Red Mountains"}, {"rating": 4.0, "review": "So far, our Chromecast has been working fine. We've had it for about a month. I mostly use it with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Shopper_14"}, {"rating": 5.0, "review": "It's very easy to use, offers a wide range of things to view and it's very convenient. The price is hard to beat.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love Chromecast! It is very easy to setup and use. The one misconception is that it runs off the tv you do need to plug it into the wall", "verified": true, "helpfulness": "0/0", "author": "Chelsea McKibben"}, {"rating": 5.0, "review": "I've told all my friends and family members it's greatI will tell the world I need another one thanks", "verified": true, "helpfulness": "0/0", "author": "Teri J"}]