[{"rating": 1.0, "review": "It is not clear in the description that you can only stream certain applications to your TV.  I was under the impression that you could stream whatever was on your smartphone screen to the TV - not so!!!", "verified": true, "helpfulness": "0/1", "author": "Toller65"}, {"rating": 5.0, "review": "Easy. Simple. Cutting Edge.  This device has changed my world.  Set-up literally to , 5 minutes, and anyone can do it, you do not need to be \"tech savvy\" to set-up.  I would highly recommend a Net Flix account with this, as I got tired of You Tube in a hurry.  Well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Sparky"}, {"rating": 5.0, "review": "I have Roku 2 and i love it. I bought this just to add streaming in some areas of my house and also to compare to Roku. Even though it's lacking of channels but still ok because i normally watching Netflix and YouTube and it got on it. Shipping is fast because the seller is Amazon and it's the cheapest offer in Amazon online shops.Recommendable for watching streaming videos.", "verified": true, "helpfulness": "0/0", "author": "ARL"}, {"rating": 4.0, "review": "works great and really convenient...  The only downside is that the tab has to be within 20 ft. of your wireless router... :(", "verified": true, "helpfulness": "0/0", "author": "Kyle Maxwell"}, {"rating": 5.0, "review": "This makes it so easy to use my big screen tv more often as I watch movies and surf the web!", "verified": true, "helpfulness": "0/0", "author": "JCOII"}, {"rating": 1.0, "review": "I bought one without knowing (being told) that I had to use the most up to date IOS (if using iPhone as was the plan; I have Last year's iPhone).  Shocking that it has no backwards compatability.  And something that I should have been told.I bought another router since the one I had was not supported (I was not told that either before I bought it; that information is nowhere on the Amazon page and hard to find that out on the Google pages).  So I wasted another $80, and if Amazon had told me that I would have to do so I would not have bought the Chromecast.I wasted over an hour trying everything suggested, spent the money, and when I called Google I was told there is no solution for me other than buying more stuff that I otherwise don't need.Did I mention that the Chromecast keeps turning the TV on in the middle of the night?  Try that if you want to be freaked.Larry Burnett", "verified": true, "helpfulness": "0/1", "author": "L. W. Burnett"}, {"rating": 3.0, "review": "I was very excited about the arrival of the Chromecast. Everyone got one for Christmas this year. I really like the concept of a streaming device that plugs right into the TV like this instead of being a box in the entertainment center. The device is a lot of fun if you want to watch YouTube or Netflix but it doesn't meet some of my other hopes. I am on the lookout for a single device solution. We have a Roku and that has almost everything we want to stream but doesn't do iTunes. We have an Apple TV and that has many streaming features but doesn't have Amazon Prime. Now we have the Chromecast and it doesn't have iTunes OR Amazon (and streaming Amazon through the browser requires the removal of Silverlight and then the video lags frequently). Amazon and iTunes are not likely to show up any time soon either - since Google has their own competing service. But overall, it works as well as any of the other streaming devices we have and the decision to purchase this device or one of the other competitors really comes down to which service you prefer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Google Chromecast arrived in perfect condition. It was brand new, and it worked perfectly when I hooked it up.", "verified": true, "helpfulness": "0/0", "author": "Chelle"}, {"rating": 3.0, "review": "Less connectivity and features than expected. Chromecast does not support all web content, as silverlight or QuickTime. To be improved! Easy to install", "verified": true, "helpfulness": "0/0", "author": "Enric Rovira Suñe \"eric\""}, {"rating": 5.0, "review": "Has some limitations, but overall very useful.  For example, widescreen videos are distorted to fit a standard TV (maybe not a problem on an HD set).  Had to purchase an HDMI to RCA converter since my older TV does not have HDMI, but it works fine.  The colors may be a bit distorted.  On the movies I have viewed so far, the color on the PC is blue-tinted but on the TV the colors are somewhat green-tinted.  (The TV actually looks more natural; don't know which is the \"true\" color.)  Documentation is non-existent, but there are some good references on Amazon.  (Interesting:  setup using Chrome failed, could not find my network, but setup using IE worked first time - go figure.)  Very worthwhile especially considering the price.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]