[{"rating": 3.0, "review": "I was excited to get my Chromecast, but I have to admit I've ended up not using it that much. It needs more apps and more mobile apps and browsers need to be compatible with it. We have used it several times to allow people to present content on a 52\" LCD in our small theater for workshops and lectures and it worked fine for that.", "verified": true, "helpfulness": "0/0", "author": "J. S. Keck \"improviz\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Juan Martin Etchart"}, {"rating": 4.0, "review": "It works great but was hard for me to set up as there are little printed instructions.  Did not work the first time I tried it but worked just fine th next day without having to change a thing.  I found out later that the unit should be within 20 ft of your wireless router.  Mine is probably 22 ft away so that may have been the problem.", "verified": true, "helpfulness": "0/0", "author": "Kermit D. Reppond"}, {"rating": 5.0, "review": "Works great, easy to use,  mirroring had problems.", "verified": true, "helpfulness": "0/0", "author": "Javier Garcia"}, {"rating": 2.0, "review": "It wasn't what I wanted", "verified": true, "helpfulness": "0/1", "author": "Keval"}, {"rating": 5.0, "review": "We love it. If it had the option to stream from DLNA Server, would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Andrija Vucinic"}, {"rating": 1.0, "review": "Was disappointed in order to watch Netflix or Hulu that you have to stream it though a smart phone or laptop device", "verified": true, "helpfulness": "0/1", "author": "KARCH \"KARCH\""}, {"rating": 5.0, "review": "Easy setup right out of the box. Connected IPAD 2 and Flatscreen via HDMI port. Worked great.", "verified": true, "helpfulness": "0/0", "author": "DG"}, {"rating": 4.0, "review": "A little slow for today's standards, but good performance in general.", "verified": true, "helpfulness": "0/0", "author": "Jafeth Lagos"}, {"rating": 3.0, "review": "Could work with PC withou having to play the videos in Google Chrome. But with youtube in the smartphone works just fine.", "verified": true, "helpfulness": "0/0", "author": "Leandro H. Paleari"}]