[{"rating": 5.0, "review": "Great way to mirror your phone to your tv or to simply use it as a remote to broadcast content to your tv. Great cheap little media box.", "verified": true, "helpfulness": "0/0", "author": "Stanley"}, {"rating": 5.0, "review": "I originally thought the chromecast was lacking in terms of features, until I found out about the videostream extension; now I use my chromecast all the time to cast video files flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Richard von Trollington VII \"--\""}, {"rating": 4.0, "review": "Small hiccups keep it from being an excellent device but the value and power this device brings is amazing.", "verified": true, "helpfulness": "0/0", "author": "Mehdi Limonadi"}, {"rating": 5.0, "review": "Works great,easy set up. A great value.", "verified": true, "helpfulness": "0/0", "author": "Joe Callo"}, {"rating": 4.0, "review": "I'm not sure how to work it yet, but am getting help from my kids and grandkids.", "verified": true, "helpfulness": "0/1", "author": "L. Dow Dozier"}, {"rating": 2.0, "review": "Didn't work in my 2009 Toshbia Regza TV. Took it to the office to try on a newer one. Still haven't installed it there.", "verified": true, "helpfulness": "0/1", "author": "Kevin Nichols"}, {"rating": 5.0, "review": "Great little device", "verified": true, "helpfulness": "0/1", "author": "Donald Smallhorne"}, {"rating": 5.0, "review": "Ok, I was a little hesitant to jump on the \"Chromecast Bandwagon\".  I've had a Media PC for over a decade, so I have made the digital transition long before most.  I currently have all my music and Movies on hard drives that I store on a server.  I've always ran long cables to the TV in order to use all of this media.  Chromecast gave me freedom on ALL my TV's.You can use your Chromecast just as you do any smart TV for things like Netflix, Play Movies, You Tube, etc.  The beauty of the Chromecast is you don't have to fumble through your TV's slow software to get to what you want.  I don't care how Nice and new your TV is, the software required to run the smart TV is clunky, slow and nowhere near as streamlined as a phone or tablet.  What I mean is that your smart TV has a built in software to run the \"smart\" functionality.  You are at the limits of your TV manufacturer to ever update this.  Update examples would be to add more features, or improve your models performance, etc.  Chromecast works only as a transfer of your already installed apps on your phone or tablet.  All it does is take the app and display it on the screen.  For example, you want to watch Netflix.  You pick up your phone, pick the Netflix app and start watching your show.  If you want to watch it on your Living Room TV, your press the cast button in the upper right of the app and it will send that show to your Living room TV.  If you have multiple TV's with Chromecast, you can move rooms and simple pick another Cast and it will send the show there.My Media PC now sits in the basement and I've added something called Plex Media Server.  This software allows you to play your movies, home videos, music, etc. directly to the TV without any wires.  You control it the same way as described above on any TV in the house.  Plex takes it a step further and inputs all the Media Data about the movies and/or music so it shows up on your phone with clip art, track lists, etc.  It's a very convenient setup!", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "Use this little device on the daily basis", "verified": true, "helpfulness": "0/1", "author": "Yosh"}, {"rating": 5.0, "review": "Works like it should, and a great value.", "verified": true, "helpfulness": "0/1", "author": "KLR"}]