[{"rating": 5.0, "review": "Very  good", "verified": true, "helpfulness": "0/0", "author": "Jassem.a"}, {"rating": 3.0, "review": "Initialization a bit tricky, but end result more than satisfactory.", "verified": true, "helpfulness": "0/0", "author": "Ted Bancroft"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Stephanie kibitelsky"}, {"rating": 5.0, "review": "I love internet streaming TV.  And now that many TVs are coming with Smart functions, this almost seems spurious.  But one thing the chromecast does is allow me to pause it on TV and continue watching on my phone or tablet.  VERY cool, especially if I want to crawl up into bed and fall asleep.  It also allows me to bypass Comcrap's stupid restriction on HBO GO and my Roku device.", "verified": true, "helpfulness": "0/0", "author": "Bob W"}, {"rating": 5.0, "review": "GREAT PRODUCT....", "verified": true, "helpfulness": "0/0", "author": "moises gomez"}, {"rating": 5.0, "review": "We have a roku and we have one of these.  This works great!  It does not have the controller like the roku, but the phone app makes it really easy to use.  I love the photostream that plays while not watching shows.  All around it is great!", "verified": true, "helpfulness": "0/0", "author": "T. Ely \"designsbytami.com\""}, {"rating": 5.0, "review": "Best $30 ever", "verified": true, "helpfulness": "0/0", "author": "Ross Brown"}, {"rating": 5.0, "review": "Yes", "verified": true, "helpfulness": "0/0", "author": "Mike Van Lannen"}, {"rating": 5.0, "review": "I prefer watching YouTube videos on my Chromecast rather than on my phone or laptop because I can just look through all of my subscriptions choose all of the videos I want to watch, and put them in the Chromecast queue. Then I don't have to look at my phone anymore and all the videos I wanted to watch just play through continuously.", "verified": true, "helpfulness": "0/0", "author": "Ryan Eiden"}, {"rating": 5.0, "review": "I don't use Hulu or any of those other internet TV options so the Chromecast did not initially interest me. The second I read an article about how it was upgraded to enable my cell phone to cast to it then I was sold. I also use Videostream to watch movies from my laptop and it works perfectly. If you don't have a smart TV and you are tired of hooking up the HDMI cord and running it from your laptop to your TV then it is time up upgrade to Chromecast. I have one in the man cave, the living room and the bedroom. I love it!", "verified": true, "helpfulness": "2/2", "author": "Terry D. Barnes"}]