[{"rating": 2.0, "review": "Won't stream from iPad...  Chrome doesn't work on iPad yet....It works with pc or laptop but we wanted it for the iPad...", "verified": true, "helpfulness": "1/2", "author": "RAD"}, {"rating": 5.0, "review": "Rapid delivery of amazing device. Performs exactly as described. Perhaps not as flexible as Apple TV or Roku but significantly cheaper. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Andrew K."}, {"rating": 5.0, "review": "Quick set up and small package. Pull up Netflix HD quality films and YouTube clips without using frustrating controllers. Do everything from your phone, tablet or computer.", "verified": true, "helpfulness": "0/0", "author": "zmarshall81"}, {"rating": 4.0, "review": "Works great on PC. Times out rarely.  Wish it worked on mobile devices. Its so ease to install I would even recommend it to my grandmother.", "verified": true, "helpfulness": "0/0", "author": "Pablo A. Silva"}, {"rating": 5.0, "review": "I love the fact that I can mirror my computer screen on my television. It's the perfect inexpensive solution for making television presentations to arts groups of people.", "verified": true, "helpfulness": "0/0", "author": "lloyd Schrack"}, {"rating": 5.0, "review": "I really enjoy my Chromecast. It's so easy to use. You don't need many instructions to use it mostly plug & play. Prompt shipment and great service.", "verified": true, "helpfulness": "0/0", "author": "PattiCP"}, {"rating": 1.0, "review": "It worked for a grand total of three days and then began overheating every time I used it. Not ready to write these things off, but I got a bad one...", "verified": true, "helpfulness": "0/0", "author": "Turkish71"}, {"rating": 5.0, "review": "good gadget to haveand easy to use i use it with my iphone and my samsung and my laptop", "verified": true, "helpfulness": "0/0", "author": "AbdulRahman Sabbagh"}, {"rating": 1.0, "review": "I got this Chomecast device for my birthday and I love gagets. I have to say though that other than using it for You Tube or Netflix, it's about worthless. There are times that it does a bit more but not without restoring it to its default each time. Opening up the Chromecast will tell you that it is ready to use but nothing but errors follow as you try to cast anything. Changing networks would seem simple enough but again you will have errors until you restore to its default to evey try to get it to work. Sometimes I can use it to cast pictures on my TV from my android tablet but mostly it will not do it as it does not see the device. Lots and lots of errors on this thing when you want to do the simplest task. Unless they can do a firmware update, this is worthless for me. I hardly ever use You Tube, and although I do use Netflix, I have other devices that are more reliable than this and easier to use. I would not recomend this device unless you want another headache.", "verified": false, "helpfulness": "0/0", "author": "Ricus"}, {"rating": 5.0, "review": "Works like charm. Setup in 1 minute. Works with all android devices that I tried. Hope we will see more support from applications.", "verified": true, "helpfulness": "0/0", "author": "Alex"}]