[{"rating": 5.0, "review": "We just replaced our wii with the Amazon Fire TV. Best idea I've had in a while! We ordered it on Thursday and it was here in Michigan the very next day!!! Thank you for that Amazon shipping department!This device is awesome! The apps are great and the playback is crystal clear with hdmi.The load time is extremely fast.The voice command search is extremely accurate and so convenient.We watch 70% of our programming online and the Amazon Fire TV is the way to go for us!Thank you Amazon!", "verified": true, "helpfulness": "1/1", "author": "Joshua Baker"}, {"rating": 3.0, "review": "We had just purchased the roku right before amazon for came out. We decided to purchase the fire because we really enjoy other amazon products, but unfortunately it needs a lot of help. There are very few channels or apps to choose from. There are over 1000 on the roku. Trying to search for a movie it show only searches amazon and not all of the apps like roku does. Roku bears amazon on this market hands down", "verified": true, "helpfulness": "0/1", "author": "Amber"}, {"rating": 5.0, "review": "Not a techi.  Took me two minutes to set up and start using.  Enjoy watching prime and netflix on my TV instead of my computer.", "verified": true, "helpfulness": "1/1", "author": "Liane"}, {"rating": 5.0, "review": "Great choice, with all the options out there. I have a kindle fire and already have the account setup, i figured this would be the easiest option. And it was! Amazon sets it up before  its shipped, so turn on is very simple. I canceled my dish network since the kids watch wallykazam, timmy time, bubble guppies, and paw patrol on dvr all the time. $90 a month got out of hand to watch reruns.As you find your shows, it will find others like it. At first I wasn't inpressed but soon found show i forgot about. You get amazon prime free 30 day trial, which I will subscribe to. The annual fee will pay itself off in a few months.", "verified": true, "helpfulness": "1/1", "author": "grizzlypower2001 \"Erik\""}, {"rating": 4.0, "review": "I've had this for almost two months and I have concluded:++Everything is HD+Small and compact box looks good & can nestle under tv+I like the feel of the remote & no line of sight required+Super easy to set up+Good selection of games w/awesome graphics (I favor Asphalt 8)+Decently organized+Beautiful default screensaver (you can dl others)+Speak to search works well+People complain about not being able to search for only/all Prime movies, but I notice most of the search results will show Prime first+I like that it auto turns off when it sees you're asleep...just kidding about the seeing you part (does feel like it watches me sometimes) but it does auto turn off if you're inactive after it prompts/asks if you're still watching whatever and don't hit the OK button--Speak to search only works for Amazon-No volume button on remote and I think it makes more sense to swap the last two rows of buttons-I initially couldn't set up at all, bc my internet was too slow. I had to upgrade my internet package to increase speed (46kbps-90kbps) and we know Comcast is hella expensive. I did not have speed issues with my Roku stick, but on Roku none of my Amazon movies would play in HD and 1080p would frequently come and go on Netlfix (with Fire this happens a lot less)-You will not get a full list of Prime movies and movies quickly lose Prime status...old movies like the original TMNT. Too pricey-Amazon hates Netflix so sometimes (sometimes often) it'll have trouble connecting to Netflix-You have to select movie by movie instead of using the ff/rw button to see a group of movies at a time (on Amazon, Netflix you can do this)-Be nice if remote had a headphone jack-Does not come with required HDMI cableOverall I'm satisfied with this, but it doesn't offer anything amazing or new. At least nothing I'm interested in.", "verified": true, "helpfulness": "1/1", "author": "Vanessa Williams"}, {"rating": 5.0, "review": "Once again Amazon delivers. Despite the movies being older, there are many I've not seen and receiving them FREE on Amazon Prime, really sweetens the deal. Easy installation and use, Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kevin C."}, {"rating": 5.0, "review": "Just plug it in and start streaming. Just make sure you order a hdmi cable for the tv. I also have apple tv. I like this much better easier to navigate and netflix is much easier to use. I love the voice command and it works everytime", "verified": true, "helpfulness": "1/1", "author": "Janelle H."}, {"rating": 3.0, "review": "After several weeks, I finally have this operational.  I have a 50\"HD TV with a Sony surround sound system.  The TV doesn't have any speakers so I had to get additonal cables and an adapter to make it all work.  Other then that it was easy to install :)", "verified": true, "helpfulness": "0/0", "author": "Malia Behr"}, {"rating": 5.0, "review": "Price: perfectSetup: self-explanatoryFeatures: more than I hoped for, really.  The voice search works amazingly well.  Say \"Tom Cruise\" and you'll get everything available on the device that he's been in.  It really is that easy.  Even the games work well.Pros: inexpensive, more features than Roku/AppleTV, backed up by Amazon Customer Service (no small thing)Cons: only one...it would be NICE if Prime/free movies were tagged separately but there are easy work-arounds for this.I def recommend this.  The only people who would suffer with this would be people who are already totally committed to iTunes and have a ton of video content pre-purchased that they just have to have.  Those people should buy Apple TV.  For those of us who are not bound to our iTunes content, the Fire TV really seems to be superior.", "verified": true, "helpfulness": "2/2", "author": "Lobsta Johnson"}, {"rating": 2.0, "review": "While in theory, this is an awesome device, in reality it leaves lot to be desired.  The much touted \"voice search\" feature is nothing more than a cheap shot at the wallet.  It only returns items for sale on the Amazon store and works with nothing else.  Also, the lack of ability to filter results for \"free\" or \"paid\", only emphasizes the fact that you just gave Amazon $100 so they could further extract money from your barren wallet.  Furthermore, for $100 US dollars, you are gifted with a paltry 8GB of internal storage, of which almost 2GB is used from the start and there is no way to expand.  I'm keeping it only due to the fact that I am simply too lazy to return.On the plus side, the Netflix app is a real gem here (no thanks to Amazon for this).  It's  quite wonderful to have all of the Netflix catalog ready to go at the touch of an FM remote (recall my earlier diatribe...the voice search doesn't work unless you're partial to having your bill-fold pilfered).  Maybe some day, when the dead start digging their way out of graves, Amazon will actually put out an update to allow the voice search to be used in every app.  Until then, I suggest you use the money to build up your defences for impending zombie apocalypse, I'm guessing this is more likely to happen.  If Amazon actually fixes this, I will happily change my review.  Until then, I will continue to unhappily use this product.", "verified": true, "helpfulness": "4/6", "author": "Jennifer Lynn"}]