[{"rating": 5.0, "review": "Snappy, great connectivity, easy to set up, this device is my favorite, by far, of all the streaming devices available and I have tried them all.  All the apps are there, minus the obvious HBO GO, but that has more to do with slow development on HBO's part.  It will be there and when it is, the Fire TV will be complete.  Voice search is fantastic, even though it's only for Prime content currently.  The Bluetooth remote is great.  At first I was faced with the problem of playing local content from my PC but the Plex App fixed all that and I am now completely content with the device.  It's amazing and I recommend it hands down to anyone looking for a media streaming device amongst all the myriad of mediocre devices on the market currently.", "verified": true, "helpfulness": "0/1", "author": "Lars"}, {"rating": 5.0, "review": "Many of the Fire TV reviews both here and in the tech media are pretty tough.  Here's why I rate it a five.  As always, your use case and experience may be different.Use Case: We cancelled NetFlix two years ago because most of the movies just weren't that good.  I used a Samsung BluRay player to access NetFlix.  It was very slow and has a cumbersome UI.  I decided to sit out on the Roku box and just couldn't bring myself to commit to the Apple TV ecosystem.  I joined Prime last year to get free shipping (we did a kitchen re-model and bought a lot through Amazon.)  The Samsung doesn't support Amazon and using a laptop with the TV isn't cool, so I didn't take advantage of Amazon video.  I jumped on the Fire TV purchase because the free content with Prime is enough to convince me to remain a Prime member.UI:  The UI for the Amazon content is excellent, especially for a first release.  (I'm an EE and a software dev.) Super fast and the speech rec works great.  Glad I skipped the Roku.Cost:  There seems to be a large segment of the population that happily paid $99 for an Apple TV or Roku 3, yet rate the Fire TV as too expensive.  Maybe they are bad at math.  Thanks to Moore's Law,  I got a lot more processing power for my $99 than they did.Gaming: I'm not a gamer.  If I were, I'd be on the latest console.  For me, the Fire's gaming capability is a great bonus.  The Asphalt racing is fun and the kiddie games are perfect for the grand kids.  Amazon is making a serious investment in game studio talent, so they must have serious plans.Packaging: I think Amazon should get high marks for the physical design.  Very clean and compact.Future-proofing:  Here is where I have to trust Amazon.  I think that the platform has several more years of software upgrades that will bring new features.  You know that they will offer shopping.  You know that others will deliver new apps for the Fire.  With technology, you never know.  But I'm betting that it will be a much better platform within a year.In summary, I rate it a five because it does everything I need today perfectly and I expect that it will continue to improve.", "verified": true, "helpfulness": "5/6", "author": "Murray Judy"}, {"rating": 2.0, "review": "My experience is constant buffering on netflix, i own about a dozen other devices and have no issues. The google chromecast dongle is by far the better product. You will be better served with the 65 dollars in your pocket. The UI also seems outdated and I feel likeI am on my old windows home media player from xp.", "verified": true, "helpfulness": "4/11", "author": "droid dude"}, {"rating": 5.0, "review": "I am a Prime member and I was in my account within minutes!  The set up was so easy and intuitive!", "verified": true, "helpfulness": "0/0", "author": "Kristen M. Stanley"}, {"rating": 4.0, "review": "I really like the device, it does what it claims well. It could be better. Voice search should span apps or allow ad a parameter to indicate an app. I want to search more than Amazon easily.", "verified": true, "helpfulness": "1/1", "author": "Caryn C"}, {"rating": 5.0, "review": "I am a beautiful person. I have a good time to time. I was wondering how to do with it. The other is a good day. It isag time to time.I", "verified": true, "helpfulness": "0/10", "author": "coumba"}, {"rating": 5.0, "review": "I got this from Best Buy a few days ago and I'm must admit this baby is faaaaast. This is coming from a person who has a Roku 2, Google TV, GX Midnite android box, and an Ouya. This device has a smooth interface that is easy to use. Great selection of content. Games are awesome and inexpensive if not free. Don't listen to the idiots who have posted 1 or 2 stars for this product. Those are the people who as either Apple fanboys and girls and if it's not Apple TV is junk. Or, those people are dumber than dumb. This device will open doors to a new cheap android gaming platform. Android gaming has been tried on Ouya before without too much success. Ouya games are almost double in price and the hardware is cheap cheap plastic (trust me! I own one). Amazon fire TV game controller is an excellent solid hardware and doesn't look cheap with sticky keys. Excellent game selection. Sev Zero came with the controller and is an great game. Many others available and the most expensive games is about 6 bucks. If you're looking for an all in one cheap media steamer/gaming solution, Head on to amazon fire TV. You will not be disappointed.", "verified": true, "helpfulness": "0/1", "author": "Inderjeet \"indi\""}, {"rating": 5.0, "review": "I simply love Fire TV! Navigation with the remote is easy and the sound quality is really good. It's super small and doesn't take up very much room at all.The voice recognition hasn't failed yet...you guessed it, I was trying to get it to fail. :)For the price it's well worth it - in my opinion, or course!", "verified": true, "helpfulness": "0/1", "author": "dtba1965"}, {"rating": 5.0, "review": "I just got my Amazon Fire and I love it (specially if you are a Prime Member, you don't pay for watching lot's of shows) great selections of movie, concerts, the remote is very easy to use and love the microphone function", "verified": true, "helpfulness": "1/2", "author": "Victor Flores \"music lover\""}, {"rating": 1.0, "review": "I purchased the device and had high hopes.  However, it does not work with a DVI-HDMI converter.  My television is a Sony Plasma XBR Circa 2004.  It does not have HDMI inputs.  In place, I use a DVI-HDMI converter.  It works flawlessly with AppleTV, Sony Media Player and Roku.  However, it does not work with Amazon FireTV.  Amazon tech support claims that it is due to Amazon's licensing of content, however, the Sony Media Player plays all Amazon content with no problem.  Additionally, I'm able to stream from the Amazon Instant Video Player on my iPad through my AppleTV over this DVI-HDMI connection.  Oh well....  I wish it would have worked, but alas...no.  I have returned it.", "verified": true, "helpfulness": "13/20", "author": "christopher stewart"}]