[{"rating": 1.0, "review": "Don't buy it if you are not from United States; because almost all the applications are not going to work. BE-CAREFUL!!!!", "verified": true, "helpfulness": "1/3", "author": "franciscocuesta"}, {"rating": 3.0, "review": "The VEVO and Vimeo apps on the Fire TV had so many buffering problems that after many times of trying trouble shooting tips that did not fix the terrible buffering I finally deleted VEVO and Vimeo. To check I plugged my old Roku HD back in and VEVO and Vimeo played fine with no buffering, so there is some problem with the VEVO and Vimeo apps on the Fire TV. VEVO on the Fire TV does not add the Playlist and it sounds like VEVO knows this is an issue and it has not been fixed yet, there's poor video quality, and there's so many other issues with the VEVO app on the Fire TV that I deleted VEVO. The VEVO app is fine on my old Roku HD (it has the Playlist, and can scroll through all the categories to pick a song). I can find most of the music videos on Youtube, so it didn't bother me too much deleting VEVO. Vimeo on the Fire TV would only sync changes made on a computer by logging out and back in, and most of the better quality videos had huge buffering problems such as taking ten minutes trying to watch a two minute video, so because of the terrible buffering of Vimeo on the Fire TV I deleted Vimeo. I plugged my old Roku HD back in the exact same location and all the Vimeo videos played fine with no buffering problems. As with VEVO there appears to be a problem with the Vimeo app on the Fire TV. I did not want to delete Vimeo on the Fire TV, but most of the videos I can find on Youtube. The main feature I use these devices for is Amazon Instant Video, and on both my old Roku HD and on my new Fire TV the Amazon Instant Video movies played very well with no buffering just like watching a DVD. On Roku HD the Youtube app was mostly not able to be used. On Fire TV the Youtube app has been pretty good, and I could find most of what had on VEVO and Vimeo so that basically made up for deleting those and instead just using Youtube. I was disappointed that VEVO and Vimeo had buffering problems on the Fire TV because I expected everything to be fast and those were terribly slow. I'm on wireless DSL that has as least as much speed as others, so I can't believe there's not more reviews mentioning buffering problems. There is some fun games on the Fire TV, but I would have rather had VEVO and Vimeo have no buffering problems. I almost returned the Fire TV, but didn't want to go through the hassle, and can use it in a second room for Amazon Instant Video and Youtube, as so far those have been playing fine with no buffering issues. Roku basically requires a credit card to set it up, and the Fire TV does not require a credit card I'm part of the Amazon ecosystem, but I would have gone with another Roku over the Fire TV because some apps on this current Fire TV have buffering problems. In the future I will buy a Fire TV again only if they make a lot of improvements and all of the apps have no buffering problems.", "verified": true, "helpfulness": "0/2", "author": "Jack"}, {"rating": 5.0, "review": "Amazon box is better than Apple TV enough said", "verified": true, "helpfulness": "0/1", "author": "Mahill57"}, {"rating": 3.0, "review": "Apps do NOT work with Comcast authentication. If you have HBO on Comcast and want to use the HBO GO app, you can't. The apps that don't authenticate against your cable account will work (like PBS), but none of the others will.", "verified": true, "helpfulness": "0/2", "author": "Alex Kiefer"}, {"rating": 5.0, "review": "Can't say enough how much I love my new Amazon Fire TV.  Once again Amazon comes through with super fast shipping.  Loved how easy the Fire TV was to set up...had it working in a matter of a couple of minutes. Love that I now have access to my personal streaming library as well as Prime movies and TV and LOVE that I have access to Prime music.  Can't recommend this product enough...Thanks Amazon!", "verified": true, "helpfulness": "0/1", "author": "Kimberly J Martin"}, {"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/1", "author": "DongHo Keum"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Scott Kauffman"}, {"rating": 2.0, "review": "My 4 year old and I both prefer the Roku.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love it, it's great but I wish there were more apps and that's why I gave it four stars. Please get songza and g", "verified": true, "helpfulness": "0/1", "author": "al"}, {"rating": 3.0, "review": "Its okay. However I prefer my Roku as I can search and use it with better ease.  This Amazon Fire TV was more of an annoyance.", "verified": true, "helpfulness": "0/0", "author": "Cyn \"CR\""}]