[{"rating": 3.0, "review": "The Chromecast HDMI Streaming Media Player does not auto detect wireless networks. It is limited to one home network and is not made to be carried around,", "verified": true, "helpfulness": "1/1", "author": "david smith"}, {"rating": 4.0, "review": "Bought a couple of these, one for myself and one as an attempt to improve my dad's youtube viewing experience (he was setup with an IPad + Apple TV).For my own setup it was pretty straightforward - I got a kick figuring out how it could be configured to recognize my wifi without having any methods of input.  After that, I promptly tried casting chrome tabs from my MBA, and youtubing from all of the mobile devices in the house.  All worked as expected, but I have very little use of it in my house.As a replacement for my dad's Apple TV, however, it rocks.  Previously my dad would use the IPad as the remote for AppleTV to facilitate text input (for search etc), but the connection is intermittent, and the fact that he couldn't log in through AppleTV's Youtube app was cumbersome.  With Chromecast, I instructed him to go to what he wants on the IPad, or his Galaxy Note, then just \"cast\" it to his TV.  Pausing and seeking is easy and responsive, and he could queue episodes!  Again, he only watches shows on Youtube, so YMMV.A great testament for Chromecast was my dad calling me up the next day asking when I would go pick up the AppleTV.  I am very happy with this ease of use, since it saves me a lot of time and headache doing technical support.", "verified": true, "helpfulness": "0/0", "author": "Paul L."}, {"rating": 3.0, "review": "This dongle has the unrealized potential to rival Roku; but it doesn't because Google is seemingly doing nothing with it. As I write this I can watch YouTube, Hulu and Netflix. Roku has dozens and dozens of free channels and is adding more channels all the time. If you are OK with just one or two of those then this will be a five star for you. However; if you are looking for variety I strongly suggest you buy a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "qyrral"}, {"rating": 1.0, "review": "Tried for hours to install it.  Went through all the router settings.  Google help was no help.  Returning it tomorrow.", "verified": false, "helpfulness": "0/0", "author": "Douglas Largent \"High Peaker\""}, {"rating": 2.0, "review": "i like the product with its limitations.i allows to cast Google chrome tab or Netflix or YouTubeIt worked for 20 days both times.I paused the casting for 10 minutes both times and tried to use it. The stick failed, RESET WILL NOT HELP. I tried the reset. The stick will not boot up againThanks to Amazon for return policies. For the same reason I am a frequent user of Amazon. i can order a product and with in limits the Amazon takes care of return or various issues with the product.Failure of two stick in a row does not make sense.Has any one experienced similar issues?", "verified": true, "helpfulness": "0/0", "author": "jmclr"}, {"rating": 3.0, "review": "I bought this not having researched all of its capabilities.  It is nice for a few things, but could definitely be more functional.  Currently you can use your phone/ipad (i'm an Apple guy) to stream netflix (as long as they're connected to the same wifi network), and you can use your computer to stream a tab from Google.  This is the only way I've figured out to play video files from your computer or to play streaming videos from online.  It would definitely be a better product if it could somehow take video files from your computer and stream them to your tv.It is, however, $35, so I guess I can't expect everything (but it's Google so I can!).", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 1.0, "review": "Great concept, but lack of support! I was excited to purchase 2! I was hoping to see the next media center, a gtv replacement. But clearly this is not it. The lack of support, no real updates just killed it for me. Sure it has netflix, but i'm not in a need of an netflix player. Play from your browser or phone is cool but nothing an $20 more expensive Roku device can't handle. If you are looking for a media player & smart TV features this is not the product. I feel like this product regardless the great start and demand is just the next NexusQ.", "verified": true, "helpfulness": "0/0", "author": "Ivan"}, {"rating": 5.0, "review": "Its amazing what a $30 device can do, the integration with my devices is seamless and the ability to play a video from my cellphone on the TV without any cable is, somewhat, magical.  Well done Google!", "verified": true, "helpfulness": "0/0", "author": "Gustavo M."}, {"rating": 5.0, "review": "The fact that I don't need to replace a perfectly good HD television to make it 'internet ready' is great.", "verified": true, "helpfulness": "0/0", "author": "Ky \"gamer\""}, {"rating": 2.0, "review": "This thing works absolutely great! So why did I give it such a low rating? One word: Support. Or rather, the lack of it!When I bought this dongle, the setup was really easy. You need something with a wireless connection, like a laptop or a phone, in order to set it up, but after that, you can 'cast' to it a number of ways.I plugged mine into my Onkyo receiver's HDMI port. The Onkyo serves as a hub and connects to my TV and speakers. I downloaded the app to my phone and everything connected perfectly to the wireless network in my home.Fast forward a couple of weeks, and all of a sudden, I was losing connection to the Chromecast. I contacted Google's tech support via the phone number provided on the web, and we set about troubleshooting.This is where the story goes bad. We hear so much in the news about how great it is to work at Google. Maybe that's true, but it's murder trying to work WITH Google! I don't know where they recruited these mouthbreathers, but over the course of 5 days, I couldn't get a single straight answer out of them!It turns out all I needed to do was reboot my wireless router to restore connectivity, but that answer eluded 4 different techs. First I was promised a replacement unit. That offer disappeared mysteriously, never to be fulfilled. Next I was told I couldn't cast from a wired connection to my router, such as my PC has. Uh-huh, so how was everything working for 2 weeks before? Then I was told I needed to isolate my wireless connections. Really? Why? No answer; that's just what it says in their script. Finally, I was told the Chromecast HAS to be plugged into an HDMI port on a TV, not an HDMI port on any other device. Uh-huh, like HDMI-in is different from device to device? Nice try.I certainly recommend this little beauty. It works really well, and with such an easy setup, you can send great video to your TV (or media system). For $35, you're not risking much. But if you run into trouble, don't count on the good folks at Google to help you out - they have NF idea what they're doing.", "verified": true, "helpfulness": "0/0", "author": "MT Vessel"}]