[{"rating": 5.0, "review": "Have tried to register this item. Can't find where to go.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Merrill"}, {"rating": 5.0, "review": "Absolutely amazing.  It is compact, powerful, and runs cool. (I'm a retired computer nerd and appreciate high tech). Setting it up on the Home Network was a Piece of Cake (POC), and we had it working in about 5 minutes after opening the Amazon box, including plugging the MAC address into the Router security.  This device is well thought out and quite user friendly. The amount of onboard memory in the Fire TV makes a H-U-G-E difference in performance - Yes, more is better!Our 1st experiences with streaming devices started many years ago with the Wii (basically a brick from the start), then two years ago with a S**sung Smart TV that we thought was good (not difficult after the Wii, eh?!).  Now enters the Fire TV in our home in early 2014!  There is NO comparison between the Fire TV and earlier experiences.  Searching is easy, and when watching a series of episodes, it seamlessly rolls into the next one with a sort of autoplay that we find very helpful.The speed of the device is great and we have had ZERO issues.  Our plan now is to buy another one to connect to our 'Smart TV' that has always been cumbersome to use, slow, and endlessly updating software and patches.  (FYI - If you have a \"S**sung Smart TV\" with a web cam, you don't want to know how easily they have been hacked for a view into your life - G**gle it!).We've been Prime members for years and find the selection is great, and of course we have multiple other streaming services for diversity, and gave up cable/dish years ago.  Living near a city gives us access to tons of local programming via an antenna tucked neatly away in the attic, and out of sight.Finally, we have not regretted the move to Fire TV for a moment, and will be buying them as gifts this Christmas (and NO, I didn't say this holiday season LOL). Thanks, and I hope you found this helpful.", "verified": true, "helpfulness": "0/0", "author": "DIY Guy"}, {"rating": 5.0, "review": "Just got my Fire TV this weekend, so haven't used it much, but compared to Roku and Smart TV, it is very, very easy to use.  I watched some Netflix, listened to some Pandora and it was terrific.A friend was over and I asked him who his favorite musician was.  He and I were shocked when the voice search found videos by Lil Jeezy immediately.  Really didn't like the music, but it impressed my friend...lol.Keep up the good work Amazon.  My Kindle and Fire TV are the bomb.  Who knows, maybe I will get an Amazon Phone one day.", "verified": true, "helpfulness": "0/0", "author": "Dr. Michael C. Saripkin \"The Raw Gourmand\""}, {"rating": 5.0, "review": "cant beat it", "verified": true, "helpfulness": "1/2", "author": "Malmark"}, {"rating": 5.0, "review": "enjoying all the programs this FIRE TV gave us.", "verified": true, "helpfulness": "0/1", "author": "Carol A Beard"}, {"rating": 5.0, "review": "Love that I can do Amazon TV, Netflix, Plex, and Crackle!  Very fast to respond.  Also love the fact that I can use it with the Logitech Harmony remote!", "verified": true, "helpfulness": "0/0", "author": "Ryan B."}, {"rating": 1.0, "review": "Can't use it because it does not have a USUSB connection. Sending it back", "verified": false, "helpfulness": "2/6", "author": "richard d o'neil jr"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/1", "author": "gamer"}, {"rating": 5.0, "review": "Really enjoying it so far and with the price drop to $84.00.....it is difficult to go wrong. Installed Kodi on it and seems to be working just perfect.....still need to play around with it a bit.", "verified": true, "helpfulness": "0/0", "author": "TroyAR"}, {"rating": 5.0, "review": "I am crazy about this it works great", "verified": true, "helpfulness": "0/0", "author": "Darlene Buchanan"}]