[{"rating": 5.0, "review": "The reviews are ubiquitous as to the effectiveness and goodness of this tool. You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey B. Little \"Geoff\""}, {"rating": 5.0, "review": "Does everything i wanted it to at a great price. Great product with a lot of potential", "verified": true, "helpfulness": "0/0", "author": "Ben Westcott"}, {"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "Sing71 \"P Harding\""}, {"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 5.0, "review": "Better than using a cable for hdmi streaming. If you don't already intend to buy a smart tv then it's the next best thing for watching YouTube videos", "verified": true, "helpfulness": "0/0", "author": "Atiq"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "Hab Zog"}, {"rating": 5.0, "review": "Best thing ever...we love it😊", "verified": true, "helpfulness": "0/0", "author": "Vava"}, {"rating": 5.0, "review": "Best device", "verified": true, "helpfulness": "0/0", "author": "apurav"}, {"rating": 5.0, "review": "I bought this so that I could stop plugging my computer into my TV. This works great with Netflix, Pandora, and the other apps. It also allows you to cast your computer screen using chrome. I did have a couple issues with the Netflix app on my phone disconnecting from the Chromecast so I couldn't praise or stop what was playing; but I think an update must have fixed that problem recently. You can also play movies on your computer in a chrome tab, and cast them to your TV. I like this option, but it does require your computer to handle streaming to your TV. One last thing to consider, i also have a surface 1, and it does not connect as easily. You have to download different streaming apps, and the Netflix app does not support Chromecast. In all I really enjoy having this, and it performs exactly the way I wanted.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Great dongle", "verified": true, "helpfulness": "0/0", "author": "Evan"}]