[{"rating": 5.0, "review": "Resolution is really great, it's a reliable product that hasn't cut out for me yet. No complaints, it matches its description and is cheap to boot. Hopefully they will add new apps for it soon.", "verified": true, "helpfulness": "0/0", "author": "Rynoseruss"}, {"rating": 5.0, "review": "This is the greatest device since ice cream. Just plug it in, set it up and start watching streaming video.Works great and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "Can't really complain given the cost of the device.  However I do wish the device had more uses other than casting Netflix or youtube.  It did a barely satisfactory job at casting a browser page with flash content, the sound kept playing in the chrome browser and there was a lag between the video and the sound.I've had this for over a month and like my title indicated it was cool for a few days, now its just connected to the TV.Hope Google will start releasing updates to make this more useful.", "verified": true, "helpfulness": "0/0", "author": "Kwan Cheng"}, {"rating": 3.0, "review": "I'm not sure about this device yet. I have not gotten it to work as advertised. The instructions are very confusing and when I plug it in, it turns red, it maybe something I'm doing so I'm in the process of working it out.  I'm using it with a laptop so maybe there is something I missed on the setup. I'll write more after I have used a while. that is if I can use it. More to come", "verified": true, "helpfulness": "0/0", "author": "Biomedted"}, {"rating": 5.0, "review": "I enjoying streaming video from my phone or laptop to my TV with this. It is very easy to use once this is set up and reliable. quick delivery and good packaging. thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Since cable is getting was too expensive, I now have Hulu Plus, Prime, Netflix.  Chromecast is so easy to hook up and the picture on the tv is very good.", "verified": true, "helpfulness": "0/0", "author": "Joyce"}, {"rating": 3.0, "review": "Although it is an awesome device, but it lacks the compatibility of most programs and apps.If more company can make this device more useful, it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Quincy Cheung"}, {"rating": 2.0, "review": "Limited apps for it only 4 apps.  I want it ro show anything on phone or computer.  It does not", "verified": true, "helpfulness": "0/0", "author": "sugarbear"}, {"rating": 1.0, "review": "Nothing special ! Poor image quality..Apple TV works better, better image .Can only see You tube, netflix and Google play ...Not worthy for me .", "verified": true, "helpfulness": "0/0", "author": "Leonardo Tabak"}, {"rating": 5.0, "review": "I got this Cromecast thing because I love to watch You-Tube videos on my big tv and it works good. Love that I can watch them and still can work at the same time with my tablet or pc. Only had a little work setting up witg my tv and laptop but after that no problems.", "verified": true, "helpfulness": "0/0", "author": "Miguel Kissimmee"}]