[{"rating": 2.0, "review": "It can't do much just play youtube vids and stream netflix if u have that which i don't so it didn't do much for me.", "verified": true, "helpfulness": "0/0", "author": "Frank Romano"}, {"rating": 5.0, "review": "I installed Chromecast yesterday to stream Netflix. It worked perfectly on both my PC and my iPad. There is one step that involves installing Chromecast Extension that placed a tiny icon on the corner of computer screen. This needs to be clicked to run the signal to the TV. If you do a Google search there are many sites that give good instructions about installing Chrome, Chromecast, and the extension. It connects to your WiFi so you will need to know the password to your internet router. You can name the Chromecast connection to match the TV you are using. You can change the name or add another TV/computer/WiFi connection. Your TV will need HDMI port and a USB port. It comes with a power supply to plug in if your USB port is not powered. You can minimize the program and work on something else while streaming. The whole process took about 5-10 minutes and I was able to watch an old favorite TV show.", "verified": true, "helpfulness": "0/0", "author": "Nancymarie Phillips \"ninabird\""}, {"rating": 5.0, "review": "I love this product, very easy to use are very good quality and the price, I would recommend it to a friend.", "verified": true, "helpfulness": "0/0", "author": "Chiu Chi Chung"}, {"rating": 5.0, "review": "Chromecast is great to view Neflix on TV. Super easy to install and use.Just use your smartphone, tablet or computer as a remote.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Paradelo \"CEO Expertizen | Google Premier Partner\""}, {"rating": 4.0, "review": "Wish more apps were compatible but does the job rather well. Hopefully on the future it will happen. And soon I hope.", "verified": true, "helpfulness": "0/0", "author": "Ralph Burgoz"}, {"rating": 2.0, "review": "I am disappointed this item.Application is very limited. Only Youtube and Netplex are available.Also, the wireless connection is very unstable.The wireless network service in my home is comcast high speed internet.But the wireless connection is frequently disconnected.Also Everyday you need to setup again for the connection.", "verified": true, "helpfulness": "1/1", "author": "T. Jeong \"peace\""}, {"rating": 3.0, "review": "Simple set up, not many things work with it now, but expect beaucoup with a year or so...Google ChromeCast works!  Perfect for showing photos,etc on tv...", "verified": true, "helpfulness": "0/0", "author": "Deipnosophist \"cw3rd\""}, {"rating": 5.0, "review": "I got this for my flat screen and so far its been great. My internal network is great so no delays on that side so overall great cheap product", "verified": true, "helpfulness": "0/0", "author": "SnazzyDre"}, {"rating": 5.0, "review": "Very nice tool to watch wirelessly. Enjoy using this a lot. Easy installation, a real breeze to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "Keith B."}, {"rating": 5.0, "review": "Now that the API is available, more and more apps are using the Chromecast so it becomes easier to use.It is the most simple option once an app integrates Chromecast support. Plug in the Chromecast and set it up, when you're on the same WIFI as the Chromecast an icon will show up on your app. Press it and it begins casting.It stays in hibernation mode until you use it, no need to turn it on or plug it in whenever you want to use it.Also, if you have a smart TV and you're watching cable or something and then you press the cast button on an app, the Chromecast signal will automatically tell your TV to switch to the Chromecast input as it begins casting.", "verified": true, "helpfulness": "0/0", "author": "J. Kile"}]