[{"rating": 4.0, "review": "Simple and love it! Only thing is that I wish I could stream/cast from my computer more easily. It stutters and if I play my own content to stream, the picture lags behind the audio. But good if you just like Netflix/Hulu/YouTube and have a smartphone.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "You can't go wrong with a Chromecast, it gives you so much for so little. And with updates it is only going to get better.", "verified": true, "helpfulness": "1/1", "author": "Baltazar Najarro"}, {"rating": 5.0, "review": "Family of 6, 3 with androids who LOVE this.  It streams netflix, hulu, youtube, etc. BETTER than the smart tv we have.  Streamlined, easy to use and love throwing up pictures, videos, etc.  Going to a few more for the other tvs.", "verified": true, "helpfulness": "3/4", "author": "mibo"}, {"rating": 2.0, "review": "You can cast from a PC:Chrome Browser, THATS ITFrom your phoneYoutubeNetflixHuluPandoraI have been feeling some lagging several times, without any reason, my Network is all clean, not bugs. If you need some based reason to believe me, I Do work with Cisco networking equipments!", "verified": true, "helpfulness": "1/3", "author": "Daniel Horande \"Daniel Horande\""}, {"rating": 5.0, "review": "Everyone at my son's household seem to enjoy this very much. I really don't know that much about it, I do know you can stream Hulu, Netflix and other things through to your tv which make s it great that you can see it on a bigger screen. Haven't heard any complaints.", "verified": true, "helpfulness": "0/1", "author": "Thefoxesden2000"}, {"rating": 2.0, "review": "I don't know why it's made this way, maybe it has to be, but it doesn't simply mirror what's on the screen, as it should. You have to have apps that are compatible with it, for some reason, and there aren't that many. For instance streaming a podcast is easy, showing your photos is a total pita.", "verified": true, "helpfulness": "0/0", "author": "Ilo O. Kratins \"cabinet pro\""}, {"rating": 3.0, "review": "Love the way this works!  Only got 3 stars because right now it only has a couple apps available.  When this thing really takes off it will be a 5 star.", "verified": true, "helpfulness": "0/1", "author": "Adam"}, {"rating": 2.0, "review": "I thought this would be a good workaround to enjoying Xfinity.com's online library of programming on our bedroom tv. It works--I guess. It's just really laggy. The audio and video is so out of sync, it's like watching a poorly dubbed kung-fu movie. On the other hand, Netflix actually works really well...but I already have a Roku for that purpose. I'll probably keep the chromecast and use it when I travel. But I don't think it's going to get as much home use as I originally thought.", "verified": true, "helpfulness": "0/1", "author": "Rob S."}, {"rating": 5.0, "review": "We use it all the time. Great for sending TV shows from Netflix or videos from YouTube for the kids to the TV. We will be ordering another so we get it back on our main TV. Picture quality is great. Occasional buffering issues, but otherwise no problems.", "verified": true, "helpfulness": "1/1", "author": "Michelle Hermann"}, {"rating": 1.0, "review": "i have the most advanced samsung smart TV and it will not read it.  yes i know which hole to plug in!!!", "verified": true, "helpfulness": "1/3", "author": "disappointed"}]