[{"rating": 2.0, "review": "Well in my country i cant see most things on my phone with the chomecast  its no what i though it was", "verified": true, "helpfulness": "0/0", "author": "Roberta Phillip Greaves"}, {"rating": 5.0, "review": "Works flawlessly. I have spent years looking for an easy way to connect my TV to the web, this is close.", "verified": true, "helpfulness": "0/0", "author": "bitlooter"}, {"rating": 3.0, "review": "I bought this as a gift for my brother and his reaction was mixed. He liked it at first but I guess google came out with an update which restricted certain content that he wanted to stream. Installation and set up was a little tricky/confusing however once we got it set up the chromecast does most of what it claims. He uses it with his Iphone the only problem is that it kills his battery.... so if you want to use your phone and you want to watch a longer video you should probably hook your phone up to the charger.", "verified": true, "helpfulness": "0/0", "author": "Ross Guiles"}, {"rating": 5.0, "review": "We bought this for our bedroom TV and it works like a charm to stream Netflix. It was an easy setup.", "verified": true, "helpfulness": "0/0", "author": "Ratzlaff Library"}, {"rating": 5.0, "review": "It's portable and makes your old TV smarter than SmartTV!SmartTV are too slow but as GC connects to router directly it can handle Internet streams and you can manage it by any other device (Laptop, Smartphone, etc.) as well. Too fast and it works for most of video formats even by Chrome browser. Yeah! It means you can cast your own videos by Chrome browser ;-)", "verified": true, "helpfulness": "0/0", "author": "frash"}, {"rating": 3.0, "review": "It was an older version that had to be updated as soon as it loaded. The directions for use were lacking, especially for a non-tec person trying to move into the 21st century.", "verified": true, "helpfulness": "0/0", "author": "Thomas Noyes"}, {"rating": 4.0, "review": "To be perfect it should be able to cast chrome browser and/or android screen. The apps ready for cast still very few that is a problem.", "verified": true, "helpfulness": "0/0", "author": "Alexandre Alves"}, {"rating": 5.0, "review": "Goodbye Roku and AppleTV ,  hello Chromecast!!Our third device in the family.  Excellent product for entertainment!!  Excellent price point also!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I'm not sure why this device has such high marks. It can cast YouTube videos like a champ, but that's all it does. This is a product that was rushed to market. If you're trying to use it to cast presentations from your Android device, you can't. You can't even cast a tab from chrome for Android.", "verified": true, "helpfulness": "0/0", "author": "Tarkaan"}, {"rating": 4.0, "review": "Easy to set up.  Very High quality output.  Could use a shorter USB cord to power it and it seems to run very hot, even when not in use, leaving me to leave it unplugged when not in use.  Not easy to move from one wifi location to the other, so for those who say they carry one in their bag to travel with, good luck with that.  Right now, limited app access, especially from mobile devices, so until at least Chrome for android or Chrome for iPad/iPod can stream, its use is limited.", "verified": true, "helpfulness": "0/0", "author": "Owner"}]