[{"rating": 5.0, "review": "I highly recommend this product, especially at this price. It took approximately 15 minutes to set it up and connect to two laptops, two tablets, and two phones. The picture quality so far, from what I have seen, is really good and it seems to be responsive on all of our devices. Currently it only works with your laptop chrome browser (Which is pretty cool), Netflix, Youtube, and Google Play apps. However, other apps are rumored to be in the works in the coming months. I was able to stream Pandora through my laptop browser no problem. The original advertising is a bit misleading as it does require that you plug the Chromecast into a USB power source (It comes with an adapter). You will need to have a TV that has an HDMI and USB or at least a wall outlet nearby. Overall, at $35 it is well worth it, even if it is not perfect.", "verified": true, "helpfulness": "2/3", "author": "CR"}, {"rating": 3.0, "review": "Works awful with Chrome browser casting using a MS Surface Pro: Lots and lots of buffering, cannot watch anything for more than a minute, or two.  SURPRISE...it works perfectly from my old Motorola Xoom tablet! Also, with the Surface and the Zoom, the Chromecast redshifts, that is, everything is sifted into the red colors.  One other thing: Amazon, WHERE'S MY NETFLIX CODE? Actually, today was the 7th day (should have had the code in 5 days from shipping), but I gave them a couple of extra days to catch up.  But, I will be contacting them tomorrow, anyway. UPDATE: I sent Amazon an email this morning (8/7/13), and two hours later I had my Netflix code.  Kudos to Amazon.", "verified": true, "helpfulness": "0/4", "author": "GL1800"}, {"rating": 5.0, "review": "Really an awesome and possibly revolutionary product! Google has done it here! I used it to watch some Youtube, Netflix, etc all wirelessly with my DLP TV, which is not a SmartTV. I also was able to mirror my laptop screen through Chrome to the TV, which was AWESOME. Happy that I got it for 35 bucks before it went on backorder and jacked up in pricing!", "verified": true, "helpfulness": "2/3", "author": "Deepen"}, {"rating": 5.0, "review": "The Chromecast has made home entertainment even more convenient. Watching YouTube and Netflix has never been easier. The ability to \"cast\" a tab from Chrome was a nice surprise, but it is still in beta so it was a bit janky with some websites. The setup could not have been any easier. Tried it on dekstops, laptops, and tablets with great results.", "verified": true, "helpfulness": "3/4", "author": "Bender Rodríguez"}, {"rating": 5.0, "review": "First of all, I find it funny that currently, most of the people who reviewed this have not even bought this yet.  Now with that said, I bought it on the first day it was offered.  I've had it over a week now, and I love it.  I have 3 small children under the age of 5, so cords connecting my computer to my TV are tugged and pulled and constantly tied into various annoying knots.  Now, I can watch youtube, foodnetwork shows (I got rid of our cable due to costs), and other great things on the TV without having to wait until the kids get to bed.Pros-Easy to useNo cordsrather simple to set upCons-They don't tell you about the extra power cord, though if you have a USB port on your TV, you don't have to worry about it.Some laptop/desktop issues which aren't too badI still haven't found a way to lower the netflix resolution since I'm on a data plan with a set gb limit", "verified": true, "helpfulness": "2/3", "author": "David Woods \"Bill\""}, {"rating": 2.0, "review": "I'm really surprised at all the glowing reviews here. And the price gouging here is horrible too. If you do buy it go to Best Buy - I waited a week. Anyway, this thing is very limited.  I did the install, tried to \"cast\" and got extremely choppy video with no audio.  The icon turned red, indicated there may be a problem with my internet connection speed, so I checked it.  18 mbps.  Really?  Tried another tv, also tons of lag, but audio worked this time, so I figure something was up with the surround sound on the first tv.  Anyway, the only way to make it bearable was to drop the video quality to \"standard,\" but even then there was noticeable lagging more than I'm willing to put up with.  Returning it.", "verified": false, "helpfulness": "1/9", "author": "Double D"}, {"rating": 1.0, "review": "You can't do anything but view youtube videos on both the iPad and iPhone! It claims you can do so much but don't believe the false advertising.  If you're apple, don't waste the money, it's only for android.", "verified": true, "helpfulness": "10/47", "author": "CW"}, {"rating": 5.0, "review": "I'm not gonna get all technical.  Right now it's in beta stage and Google is requesting no apps be released yet.  But I only say yet.  As an android developer, I can see the true value of this device.This will turn any HD TV in to a Google smart TV.  Stream Netflix and YouTube easily.  Also, stream chrome desktop. And soon stream anything.  This will have many apps for it.I've purchased one for all 3 HDTVs and really look forward to developing some fun and useful apps.  All I'm going to say is buy it, many of my android Dev buddies are already at working delving some fun apps.", "verified": true, "helpfulness": "2/3", "author": "leoisright"}, {"rating": 3.0, "review": "It does exactly what it claims, except that if your phone's a little out of date and takes a few hiccups you're left with programming on rails without the ability to change.", "verified": true, "helpfulness": "0/3", "author": "Cody Reynolds"}, {"rating": 5.0, "review": "Chromecast was VERY EASY to install - perhaps not Google's intent - from my Amazon Kindle.Tried to install it from Chrome on my Ubuntu laptop but installation program suggested otherwise.  When will popular devices, apps, etc. recognize that there be Linux?I \"cast\" from my Kindle Netflix app easily.  Would love to cast from Amazon Prime Video, but it doesn't work and as much as I love Amazon, their videos are RARELY close-captioned.If there is a gripe, it is that once \"cast\", Kindle doesn't know what is happening, i.e. movie progress - time shown/time left.Chromecast is a GREAT product!Dennis", "verified": true, "helpfulness": "1/2", "author": "Dennis K. Biby"}]