[{"rating": 2.0, "review": "My high hopes for the Chromecast were dashed almost immediately. It doesn't communicate well with my Droid Bionic. This appears to be a common issue with the Bionic and some other smart phone models. I was unable to set up the device via the Chromecast app on my phone and the \"Cast\" button is unavailable in my Netflix app. Once I finally got it set up via my laptop I attempted to control the device via my Samsung Galaxy tab. Again problems. When I tried to cast out of Netflix I repeatedly got an error that the content I was trying to cast was unavailable. After resetting the Chromecast the problem went away and I was able to operate the device off of my tablet. However, when streaming Netflix through the Chromecast I did not get as clear of a picture as I did when I stream via other devices such as Roku, Wii, Blue Ray player, etc.Overall, it just seemed buggy.The only feature that really worked well right out of the box was the ability to cast the Chrome browser to my TV from my Macbook. That's pretty cool.", "verified": false, "helpfulness": "5/9", "author": "Maryann"}, {"rating": 1.0, "review": "After purchasing and testing the Chromecast, I've decided to get rid of it, because of its limited use. Chromecast only works on YouTube, Google Music and Netflix on Android apps or on Google Chrome. My conclusion is: don't support proprietary hardware that is limited in its capabilities. Us consumers need to force vendors to use standard systems (like USB, HDMI & Bluetooth). When Apple, Google, Samsung and all the big players create their own proprietary hardware that benefits those who use their hardware devices, it allows these companies to take advantage of us consumers only if we fall into their trap.If you want to play a game or project any other app (other than the 4 mentioned above), including the Photo Gallery to present a slideshow, then Chromecast will not work for you! What a major let down!Why Chromecast when you can Miracast?Miracast is a standard like bluetooth that wirelessly transmits hiDef audio and video between two devices.Miracast is a way of transmitting HDMI-grade audio and video over a direct peer-to-peer Wi-Fi network with another Miracast-capable device. Chromecast is more like a network media player you control via web browser or mobile app like Plex or XBMC where your mobile device acts like a remote control rather than originating playback device.Miracast was created by the Wi-Fi Alliance ([...] and billed as an open alternative to Apple's AirPlay Mirroring.It's a standard (device agnostic) like bluetooth, USB & HDMI.Soon, everything (input and output) will be miracast enabled: vehicle screens, tv's, computer monitors, projectors, video cameras, etc. So you'll have a video camera sending a wireless signal to a projector and an audio system. And you'll have your phone act as the GPS unit in your vehicles miracast enabled screen.I hope this helped.Cheers!", "verified": false, "helpfulness": "17/50", "author": "Oz Idlibi \"Oz Idlibi\""}, {"rating": 3.0, "review": "Don't kid yourself, there are 100 different devices that do what this does, but better. It's not revolutionary. It's not evolutionary. It's just a inexpensive toy from google.But don't get me wrong, it does make watching porn a heck of a lot easier.", "verified": true, "helpfulness": "6/19", "author": "Miker"}, {"rating": 5.0, "review": "This is an awesome dongle.  It works very well, it was easy to install.  I especially like that you don't have to install anything on mobile devices, the correct apps just do it.Only feedback for improvement would be to allow chrome tab casting on mobile devices and to speed up the performance while chrome tab casting.I absolutely love that it doesn't stream from your device, but rather from the cloud.If your app doesn't chromecast, it should.  For $35 I'm giving these out at christmas.", "verified": false, "helpfulness": "2/3", "author": "Olga Slavin"}, {"rating": 4.0, "review": "Setup:I refused to read any instructions and stumbled a bit through installation, I wanted to see how easy it is to just setup and go. First, I realized I need to plug in the power adapter, no problem ( none of the ad pics I saw showed a power adapter), setup is slightly confusing with the WiFi networks and the chromecast wifi.  I also did not download the app for my android device before attempting to use . Netflix wouldn't work with my Samsung TV so I called Netflix and they were already aware of the problem and fixed the issue. So, I went to YouTube and watched some movie trailers etc , and then went back to netflix and started watching the Hunger games with my 8 year old daughter.To provide context, I had an apple to HDMI connector which was how I used to watched netflix on my large screen TVs.*Update* Netflix on my Apple iPad supports chromecast and I have used it successfully.*Jan 30, 2014 Update* I've had this for a few months and there are still not that many apps that support it. A pet peeve of mine is that I can't cast homemade videos and pictures from my stock android phone. None of the native Android apps cast, you have to purchase an app for this, ridiculous.I uploaded my home videos to youtube to cast, but apparently if your home video is not set to public it will not cast.  I think the native android apps should support casting.Rating dropped to 4 stars", "verified": true, "helpfulness": "3/5", "author": "Rich M \"Rich M\""}, {"rating": 5.0, "review": "I have Intel WiDi box which was a PAIN to setup and still unsuccessful, then I had google revue box which was great except the wifi signal was weak.then I got this.Pros:- Easiest setup I've experienced-Chromecast feature works FLAWLESSLY with youtube app. It is so much faster to get your results by just using your phone instead of revue (ie, grabbing the keyboard, load the app, apply search)-Wifi Signal is STRONG!, this is hooked to my a/v receiver which is in a cabinet and where revue got weak signals, this has NO issues. very surprisedCONS:None. for $35 you CANNOT complain", "verified": true, "helpfulness": "2/3", "author": "Danial Khan"}, {"rating": 5.0, "review": "What to say about this. One of the great electronic device, that I purchased in recent times. Very easy to use and loving it. People say that, why do you buy a new product, just use your laptop throught hdmi. Just use this once, you will change your statement.", "verified": true, "helpfulness": "0/1", "author": "Nag"}, {"rating": 5.0, "review": "I already own a LG tv with youtube and apps built in that could do the airplay like streaming to my TV.  Problem was that I wanted something else to plug into my older TV without spending a bundle on GoogleTV, Roku, etc.So i picked this up, and it shipped amazingly fast from Amazon.  Took it out of the box, plugged it into my HDMI, plugged into power, followed the steps on my Nexus 7, and it was up and working in close to no-time!  It pulled all of the data it needed to connect to my home network from my tablet, and once it was setup, it was flawless!Pros: Simple to use, all apps included work seamlessly.Cons: Lack of variety from apps.  If netflix wasn't included in the bundle, I'm not so sure it would have been a big hit.tl;dr - Great, cheap HDMI stick that streams Google Music, Google Play, and Netflix.", "verified": true, "helpfulness": "0/1", "author": "Adrian Chadzynski"}, {"rating": 5.0, "review": "Wow, so I ordered the Chromecast the day it was released and got it within less than a week. It really is the way they describe it, plug in and play. All my devices work on it (iPad, iPhone, and Windows laptop). Best part is you can keep browsing and doing whatever you want and it'll stream to your TV. The quality is HD1080P, and what I didn't know is that it transmits the sound as well. It only works with Netflix, YouTube, and a few other apps, but according to Chromecast's Facebook page, they are working on allowing everything to be transmitted soon. For $35, I am a very happy guy!", "verified": true, "helpfulness": "1/2", "author": "J. Stewart"}, {"rating": 4.0, "review": "It works as expected now, at first I had problems because it could download the Chromecast app in my country, but after a few weeks it was available.The only think I didn't like is that I can't view videos stored on my devices with the chromecast app", "verified": true, "helpfulness": "20/52", "author": "Tomas"}]