[{"rating": 5.0, "review": "Amazing device. Although it can have trouble on certain dual-frequency routers, the Chromecast is easily my favorite gadget of 2013, and an absolute steal at this $35 price point.", "verified": true, "helpfulness": "0/0", "author": "Eric Garling"}, {"rating": 4.0, "review": "The Chromecast is easy to set up and works well through the phone. I am hoping that more applications become 'streamable' through this device to make it even better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"YpsiET\""}, {"rating": 5.0, "review": "Smart TV on a budget! I use this on my upstairs TV that is not a Smart TV, its setup and operation are seamless, now netflix doesnt have to be watched on a laptop!", "verified": true, "helpfulness": "0/0", "author": "John D. Kazeva \"rocketjohnnyk\""}, {"rating": 4.0, "review": "good deviceeasy installationsmall like what I expectationwork with phone and tabletbut i need some update cos it's have little apps", "verified": true, "helpfulness": "0/0", "author": "Majedeast"}, {"rating": 4.0, "review": "The Chromecast is a very clever device. Because I enjoy making lists, I shall provide you with two. Yay!*Pros*Casting (on Android) from Netflix or Hulu is easy and smooth. No issues (so far)The device is small and light, making it portable (sort of)HDMI connectionInexpensive*Cons*HDMI connection, if you don't have HDMI, you gots no video!You must use your device as a remote, which makes sense, but if your device locks and you have a security code, you'll need to unlock before you can pause/do other things. Not the biggest deal but for people used to dedicated remotes, this could be annoying.Not many apps can cast so far!*Neutral*LED on the device is somewhat bright. Do with that information what you will.Requires connection to power source. If your TV is mounted on the wall, you'll have an additional cable dangling.", "verified": true, "helpfulness": "0/0", "author": "Niiiick"}, {"rating": 5.0, "review": "I'm very impressed how well Chromecast does to mirror your content from phone to TV. My son watches netflix from his iPod to TV with no problems.", "verified": true, "helpfulness": "0/0", "author": "Jose Renteria"}, {"rating": 4.0, "review": "Chromecast is really great and I use it all the time. 2 downsides: it does lag a bit sometimes (audio does not exactly sync w. video) when playing video from my local desktop via a Google Chrome tab (I realize this feature is in beta right now), and for some reason I can only cast mp4s from my local desktop to Chromecast, it does not work with avi files which instead just start to re-download to my computer. Actually, this may be a Chrome issue and not a Chromecast issue, but it's still annoying to have to hook up my HDMI cable again.Chromecast works really, really well for casting anything from Nexflix or Youtube. I think it's definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 4.0, "review": "Greatest thing to ever come to my TV. Google needs to open this up to more countries. I've at LEAST doubled my Google Play Movies library ever since I bought it. Win/win situation no?", "verified": true, "helpfulness": "0/0", "author": "Jace Hernandez"}, {"rating": 5.0, "review": "Works as advertised. Netflix, YouTube and casting Chrome tabs works great.  However, casting a video from a Chrome tab is a bit laggy.", "verified": true, "helpfulness": "0/0", "author": "Stuart"}, {"rating": 1.0, "review": "The Google Chrome cast HDMI don't work, I have tried 2 of these devices.  Rep couldn't figure it out either.Larry McComas", "verified": true, "helpfulness": "0/3", "author": "Larry E McComas"}]