[{"rating": 2.0, "review": "well, generally speaking, if you have a apple TV, then Chromecast is pointless. at least till they get diff apps and channels on it..", "verified": true, "helpfulness": "0/0", "author": "Ahmad B."}, {"rating": 5.0, "review": "Good easy to use. But i request web login support (wifi hotspot) Thai Chromecast | First Google Chromecast users community in ThailandPls visit our: [...]", "verified": false, "helpfulness": "0/2", "author": "sontaya"}, {"rating": 5.0, "review": "Netflix, Hulu, YouTube ... $35 ... How can you go wrong? This thing is really great for watching YouTube ... The only thing Roku is currently missing. Chrome cast is an awesome product. Easy to set up, easy to use. Totally worth the price.", "verified": true, "helpfulness": "0/0", "author": "Patrick Johnson"}, {"rating": 2.0, "review": "To judge this product is to understand it: This works as advertised: It will play content from Netflix, HuluPlus, etc. So if you don't have a DVR cable box built after 2003, and you don't have cable service that supplies OnDemand, or if you don't have a DVD player or if you don't have cable or dish service period, but have access to WiFi this is a great product for you. So if all you have is a tablet or laptop, with no DVD player, and a TV, and WiFi, then you can pay for and stream TV and movies that everyone each is watching as part of their package. If you don't have cable service, and went to Vegas for the weekend, and pay the $9/month for HuluPlus, then you can sit in your room and watch TV, if they offer free WiFi, else you'll have to pay for that. The reason for the low score here, is that they do not display or indicate the huge USB power cable that sticks out the end of the Chrome Stik. Nor do they tell you how playing movies through your Chrome App player will start the movie, but if you close the app or browser, the movie keeps playing....you cant stop it without unplugging the Chrome Stik. The other option is to let it play until it finishes, and I honestly don't know what happens there. This product is a very niche tool, that is in fact rather cool, but that is not how its being marketed. But the reality is, if you only had a laptop or iPad to watch your Hulu, then you could buy a $4.95 cable to connect and display on your TV. This let's you do it wireless, but also restricts you in your content. Lose/Lose", "verified": false, "helpfulness": "2/4", "author": "cfreema7"}, {"rating": 1.0, "review": "Despite the false advertising claiming how easy this is to set up I could not get it to work with my router. After hours of trying different settings it would not connect to my Wifi. More time with tech support was fruitless. This item is not ready for prime time. It is unbelievable that it does not connect to my Wifi like ALL my other devices. Now I have to send it back. Total waste of time.", "verified": false, "helpfulness": "0/0", "author": "Eliott Ness"}, {"rating": 2.0, "review": "I can't give Chromecast a good review because it is not compatible with any of my devices.Just so you don't make my mistake: Chromecast only works with the newest tablets, PCs and TVs. My Samsung tablet is 2 years old, but not compatible.Here are some Chromecast specs to consider before you buy:- Your PC/laptop must be running Windows 7 or newer.- Your TV must have an available HDMI port.- Your smartphone/tablet needs to be Android 2.3+- It is not compatible with Kindle devices.- The player is powered by USB, so your TV needs a USB port or an electrical outlet for the USB adaptor (included with Chromecast).", "verified": true, "helpfulness": "2/3", "author": "Kerrie Lee"}, {"rating": 4.0, "review": "Works great, easy to configure. Don't forget it needs power, use the provided USB or AC adapter. It hosts a WiFi connection to your PC/iPad for initial setup. After downloading the Chromecast app, programs like YouTube are enabled with the cast button. Easy and fun to push content to the TV. Browser casting does not seem to work from mobile device, just PC/mac. YouTube, NetFlix, Pandora and Play purchased movies and songs can be pushed. I have read that they hosted a developer conference (hack-a-thon) so more apps may be on the way. Tic-Tac-Toe was the first I saw come out of this.", "verified": true, "helpfulness": "0/0", "author": "Joseph Collard \"Joey\""}, {"rating": 2.0, "review": "Two big issues not mentioned amongst all the positive advertising...1) very dependent on your wifi router.  We had to buy a new one to make this work.  Big hidden expense there.  (And do you have any idea how hard it is nowadays to find any wifi router that doesn't have a backdoor???  It seems like every brand has some device that's been compromised.)2) barely supported by iOS.  On my iphone the only app with Chromecast support was Youtube; even Chrome itself didn't support Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Electropostie"}, {"rating": 1.0, "review": "What a waste of money!  This product was released WAY before it should have.  This was an impulse buy after seeing the ad and I will be promptly returning it.  This products allows only 5 apps to run on it and barely operates on Apple devices.  Your better off getting a Roku.  The ad makes it look like you can chromecast playing games on your IPhone to your HD TV which isn't true.  This is definitely a MUST PASS on device.", "verified": true, "helpfulness": "0/0", "author": "CHESTEROO"}, {"rating": 2.0, "review": "To start with, I'm pretty techy.  As a matter of fact, we're deploying almost 250 new Android tablets and were looking for a video streaming device to assist with presentations.  I reduced the rating by one star because picture quality on a 55\" tv was bad.  Another star went because on an Android, it only works with 5 or 6 predetermined apps.  Another star got dropped because, no matter what you read, see, or hear, this device DOES NOT cast Chrome browser tabs from an Android tablet.  After trying for an hour, I called Google support.  Was told that it would only cast from a desktop or laptop.  Totally defeats my purposes.  It does, though, get two stars because, for the price, if you don't have a streaming option on your tv, being able to get Pandora, HBO to Go, Netflix, and a couple of others is worth it.", "verified": true, "helpfulness": "0/0", "author": "Jeff Harris"}]