[{"rating": 5.0, "review": "If you are still reading these reviews, you should buy this product. End of discussion.", "verified": true, "helpfulness": "0/1", "author": "Paul Yeager"}, {"rating": 2.0, "review": "Pros: Its cheap, works ok- at firstCons: Begins to freeze and bug out relatively quickly.  I have not even owned for a full year and it already barely works.  Probably going to spend the extra dough and get something better next time.", "verified": true, "helpfulness": "0/1", "author": "Jordan kabbani"}, {"rating": 1.0, "review": "I bought this worthless piece of garbage for the sole purpose of watching the World Cup.I was traveling a lot and wanted to alleviate any worry that I would miss World Cup matches in the event that ESPN wasn't available at my destinations.Unfortunately, it would frequently stop \"casting\" during the matches, causing me to miss many of the best moments.At first I was angry at the WatchESPN app, but soon found that Netflix and HBOGo both experienced frequent pausing, disconnections, delays, etc.I tried everything I could think of: restarting the chromecast; restarting  the TV; restarting the apps; restarting the wifi modem. You name it, I I tried it. The only common denominator was the chromecast.The only consistency was consistent failure. Regardless of my location, time of day, signal strength, this thing was worthless. I ended up watching several matches on my iPad, which worked great aside from the tiny screen.I suppose my options are to spend more money on a Roku and hope it actually works, or bring my big, heavy playstation with me when I travel (not happening).", "verified": true, "helpfulness": "1/4", "author": "Raynocirous"}, {"rating": 4.0, "review": "Yeah Google. Awesome as always. Only issue is that some things....like Amazon Instant Video...wont cast. Get with it Amazon", "verified": true, "helpfulness": "1/1", "author": "enterthemeowmix"}, {"rating": 2.0, "review": "bad thing is u need a router and i think internet kinda sucks i cant bring with in my camper when we go out would b nice tho", "verified": true, "helpfulness": "0/2", "author": "ryan raymond"}, {"rating": 5.0, "review": "This is an awesome invention!!! I can stream almost anything from my phone, computer, tablet onto my TV.  Love it!!!", "verified": true, "helpfulness": "1/1", "author": "C. Weber"}, {"rating": 5.0, "review": "The item is awesome", "verified": true, "helpfulness": "1/1", "author": "camilo bernabe"}, {"rating": 1.0, "review": "This was not a smart buy for me.  In order to use this, your wireless router must be within five feet of the chromecast dongle.  The connection is iffy any further away.  The picture quality is second rate at best.  There's about a two second delay between the video on the computer and the chromecast video on the TV.", "verified": true, "helpfulness": "1/5", "author": "J.R."}, {"rating": 5.0, "review": "$35 for a media streamer! go buy this now; it gets better with everyday. new apps are being added on a regular basis at this point. Additionally, on an android phone with google chrome installed, you can stream nearly any video as long as it is HTML 5...there is so much content to stream now!", "verified": true, "helpfulness": "2/2", "author": "SirStraw"}, {"rating": 5.0, "review": "Awesome thing to have.  No more looking for the remote and getting mad at people for hiding remotes in the couch because the remote is my phone, chromebook, laptop, ipad, etc!  I also like the photos that are used for the screen savers.", "verified": true, "helpfulness": "1/1", "author": "Corinne Schoppet"}]