[{"rating": 1.0, "review": "Was not compatible wiht my router settings.  I did not feel the desire to rip open my router settings and revise my permissions and firewalls.  Not for something i expected to be plug n' play.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "There is no point in messing with this when you can have a Roku.", "verified": true, "helpfulness": "0/1", "author": "karen"}, {"rating": 4.0, "review": "sometimes problems with connection pc-chrome", "verified": true, "helpfulness": "0/0", "author": "Vitaly Klyarfeld"}, {"rating": 5.0, "review": "Great item. Does exactly what it is supposed to do. Simple installation. Use my Galaxy S4 as remote control and to mirror whatever appears on my cellphone screen. There is not yet an app for Slingbox but that is supposed to be in the works. But I get around that issue by bringing up my Slingplayer app on my cellphone and using the screen mirror ability to cast to my flatscreen television. To make my explanation simple, if you can see it on your smartphone you are able to see it on your TV.", "verified": false, "helpfulness": "0/0", "author": "Preston E. Peckham \"Preston EPS\""}, {"rating": 4.0, "review": "Not quite as good as the Roku but very handy and affordable for what I needed it for.", "verified": true, "helpfulness": "0/0", "author": "A. Tuinstra"}, {"rating": 5.0, "review": "The Best", "verified": true, "helpfulness": "0/0", "author": "Kevin Gregoire"}, {"rating": 1.0, "review": "Only useful if you live in Chrome or Youtube.  Can't seem to share my whole screen or desktop like I can with an Apple TV.", "verified": true, "helpfulness": "0/2", "author": "BP"}, {"rating": 5.0, "review": "Great product. We now have two of them and they work exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "WestM \"westm\""}, {"rating": 5.0, "review": "At $35, it was an easy impulse purchase.  Little did I know that I'd love this little guy so much that I'd be buying a second one just to take on trips.  The concept seems so simple, yet the flexibility and power of this 1080p full-resolution, HD audio streamer belies its tiny stature.  Initially Chromecast only supported a few major apps, but now with dozens of apps available, no TV should be without one of these guys permanently plugged into an available HDMI port.Ever-increasing list of apps: https://www.google.com/chrome/devices/chromecast/apps.htmlNote that the HDMI protocol doesn't supply power (like USB), so there's a little USB-powered cable that must be connected to the tail of the Chromecast to supply power.  Most/Many TVs provide a USB port, so power is readily available, but for those of us with a circa 2010 HDTV, Google supplies an AC power adapter too.", "verified": true, "helpfulness": "0/0", "author": "ViperGeek"}, {"rating": 3.0, "review": "The technology is still a bit kluge-y.  It took a bit of work to figure out how to configure the TV, to change the input source as needed...  and we still suffer from the odd pixillated image.  But all in all, it's a nice way to broadcast Netflix stuff via the big screen TV.It's not possible (or perhaps I just haven't figured it out?) to cast .MPG files to the bigscreen yet...  That's a pain; we make these beautiful family movies, and then can't show them.  Until it becomes seamless and effortless to get nearly anything from the laptop to the big screen, I can only give it 3 starts.", "verified": true, "helpfulness": "0/0", "author": "R. Tompson \"randyt5194\""}]