[{"rating": 3.0, "review": "I do like the chromecast, it works great for Netflix and you tube but not compatible with crackle or other common steaming video sites.", "verified": true, "helpfulness": "0/0", "author": "Michael Roche"}, {"rating": 2.0, "review": "Worked, but not well.  Needs a lot more support for video codecs other than Googles.  Worth it to spend more on better products.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "I am able to see what I have on my computer screen on my wide-screen TV most of the time...whether it is because of the unit, my computer or my wi-fi, sometimes the Chromecast does not do its job in timely fashion...eventually it settles, and off we go.", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Agostinelli \"Tony Agostinelli\""}, {"rating": 5.0, "review": "This product need no introduction.Works exactly what it advertise, paid 35 USD for this, totally worth it.Plex support is out!", "verified": true, "helpfulness": "0/0", "author": "Wang B"}, {"rating": 5.0, "review": "This is perfect. Now my regular samsung TV is a smart-TV. Actually much better.I can operate it from multiple devices. No configuration required. I use this to play videos, songs from my iPhone, iPad, my mac and my roommates devices. All seamlessly without any problem.", "verified": true, "helpfulness": "0/0", "author": "nishanth nagella"}, {"rating": 5.0, "review": "What the Chromecast does is obviate the need for a computer to run your Netflix (et al) to your TV.  That is all.  But that is an important distinction to note.  It works great with one caveat: it will will not work with VPNs.  There are ways around that limitation, but you should note that before buying.", "verified": true, "helpfulness": "0/0", "author": "CJReview"}, {"rating": 5.0, "review": "The set up was much easier than I had anticipated and this item was a hit!!  The whole family loves it so much that they are constantly taking it out of my tv!  You can't beat it for the price and if you have google chrome on your laptop or pc there is even more you can do with it.  If you have a smart phone, make sure you download the app first.  Going through the internet alone makes pictures look fuzzy and you have many buffering issues.  Google has got the right idea with this one!", "verified": true, "helpfulness": "0/0", "author": "Nouvelle"}, {"rating": 5.0, "review": "Works better than expected. Can only use it on You Tube here at the moment but no doubt other channels will arrive in due course. Picture clarity is very good and easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Raymond Welburn"}, {"rating": 2.0, "review": "Google Chromecast has a lot of potential, but unfortunately a lot of it remains unrealized. Frankly, I was surprised to notice that Chrome on Android does not support it. I would have expected to be able to cast my Chrome tabs. Youtube works, so for that I'm giving Chromecast 2 stars. But seriously Google, if the product is called Chromecast, please enable it at least err... cast Chrome,If you're using Chromecast with a laptop things are a little bit better as on the desktop it is actually able to cast Chrome tabs and there's even a well hidden functionality to mirror the whole screen as well. Chromecast feels most useful when used with a mobile device, though. Hopefully Google focuses its efforts to make it work with them.", "verified": true, "helpfulness": "0/0", "author": "Mikko Vihonen"}, {"rating": 5.0, "review": "How about that. It works. Simple instructions. Easy set up. Tried NetGear. That sucked. Buy this instead. An easy decision.", "verified": true, "helpfulness": "0/0", "author": "James Gaines"}]