[{"rating": 4.0, "review": "The FireTV comes loaded with your credentials already logged in. So, you hook up the firetv and watch your first primetv episode in under a minute. It is that fast. It is also easy to use, especially the voice search. The voice search understands my accent (indian accent) very well and I use it more that I thought I would.Now for the cons, there is only one, as far as I know. I watch youtube and pandora. There is no way to pin the most used apps to the 'home page' or the left navigation item. So, I have to use voice search or dig into applications for it. Not a big deal.And I wish it was even more smaller (!!!). Will be easy to throw into my carry-on and take it along with me when I am travelling. I wonder how the protected wi-fi works though. The type of wifi where you need to accept the terms and conditions in a browser.", "verified": true, "helpfulness": "1/1", "author": "sb \"R\""}, {"rating": 5.0, "review": "Needed an all-in-one device to get Amazon Prime TV, Netflix, etc.  Connected with easy and has streamed movies with no interruptions.", "verified": true, "helpfulness": "1/1", "author": "Kit Mathews"}, {"rating": 3.0, "review": "I really do like the Fire TV.  There are just a couple of things that I've found issue with, and if these are corrected I would have no issue giving it 5 stars.First, immediately after I received my Fire TV, I started having issues with it locking up when I tried to \"wake it up.\"  I wouldn't be able to bring it out of sleep without power-cycling it.  This was annoying.  Though I'm not aware that an update has been pushed, this has not been happening as frequently as of late.  I'm cautiously optimistic that it has somehow been resolved through an un-noticed patch.Second, I'm not crazy about the Netflix app.  Whether this is Amazon's fault or Netflix needing to update the Android version of their application, I really don't care.  It's my only way to use the app on the Fire TV, so the device gets the ding here.  Coming from a Roku, I notice that the streaming from Netflix requires more buffering on the Fire TV than I ever had with the Roku.  It isn't bad, but coming from something that never buffered to something that occasionally does - is a little annoying.Lastly, and this wasn't an expectation so I'm not knocking the Fire TV's rating, I would really like to be able to load XBMC on this thing at some point.  If this capability is added, this thing will be perfect.At present, I'd like to give this 3 1/2 stars, but since that's not an option (and I don't feel it's worthy of 4 stars at this point) it only gets three.", "verified": true, "helpfulness": "2/2", "author": "odoyle"}, {"rating": 4.0, "review": "Amazon Fire is Great!!  with the exception of security related to the pass code.With the option for \"hide password\" selected.  The number entered is still shown on the screen long enough to be read before the \"greyed in circle\" hides the number.  This needs to get fixed ASAP!The requirement recommended: With \"hide password\" selected; The unit should not display the number entered just the greyed in circle.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "I've had a number of streaming media players over the last few years, and this is the best device I've seen so far. The device itself is small, but feels extremely solid and sturdy. It could easily be hidden behind your display as the remote does not need line of sight to work. The remote is very compact and easy to use. Compared to all the other streamers I've seen, the user interface on this is VERY responsive. Menus and button clicks respond immediately rather than the sluggish \"did that click register\" experience you may be used to seeing on other devices. I have it wired directly to my network, and streams from Amazons library seem to start instantly for everything I've tried so far. No noticeable buffering before starting to play and have never seen any hesitation while playing. If you are an Amazon Prime subscriber, there is a ton of content you get for free. This does not mean that all content from Amazon is free, but there is more than plenty to keep you occupied for quite a long time. It is very easy to identify the free content from the little Amazon Prime banner that appears on eligible content. So it is a great value add if you already have or are considering prime subscription.", "verified": true, "helpfulness": "0/0", "author": "D. Marietta"}, {"rating": 5.0, "review": "Having both Netflix and Amazon Prime I was anxious to see if this would be an easy way to access these streaming systems on my HD television and I am very very pleased.  I have no technical skills and found setting this up and operating it a breeze.  It is a welcome additon.", "verified": true, "helpfulness": "1/1", "author": "J Alvin Stout III"}, {"rating": 5.0, "review": "Setup is simple....plug the HDMI cables in, plug the power in, let it search for your wireless modem, type in the password, it updates it's software (3 minutes) and boom......you are good to go.  And the voice command actually works with my flat Minnesota accent....no issues whatsoever.  My wife and I like the English drama series and other similar shows so we have been enjoying many episodes we didn't even know existed.  The box is discrete, the remote tiny.  So the price of $99 is very reasonable, and as Amazon puts more and more content on line the system will only get better.  An added bonus is when you press the 'Home' button on the remote the tv will automatically switch to the Fire TV HDMI input on your tv so you don't have to fiddle with the main tv remote to switch over.  We don't play games so that feature isn't a concern to us.  Overall we are very pleased with Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Evitzee"}, {"rating": 5.0, "review": "I get around the various options quickly, when you make your choice, your program starts right up.Easy fast simple...", "verified": true, "helpfulness": "0/0", "author": "Gloria A. Moncada"}, {"rating": 5.0, "review": "Easy to hook up. Voice search works well, picture and sound quality is very good. Optical output is nice to have as well.", "verified": true, "helpfulness": "0/0", "author": "R. Dietz"}, {"rating": 5.0, "review": "The new amazon fire is so easy to use, you simply plug it in and go.  It is so much quicker than using my DVD player to watch on my tv.", "verified": true, "helpfulness": "1/1", "author": "dixibell"}]