[{"rating": 4.0, "review": "It was super easy to set up and does exactly what it says it does. I bought this device primarily to stream Netflix. It took 10 minutes to set up and I was quickly able to stream Youtube, Netflix and Vimeo videos from my Android phone, a Chromebook, and a Windows laptop.", "verified": true, "helpfulness": "0/0", "author": "Mike G."}, {"rating": 4.0, "review": "I was torn between 4 and 5 stars for this product. 5 stars for ease of setup and ease of use. I connected it quickly and easily to my TV, and set it up quickly from my iPhone. I can \"cast\" video easily from Netflix, which is great. No stutter, no buffering, everything runs smoothly. 4 stars for the amount of content available. I really want Amazon Instant Video to be supported. With the addition of this service, it would definitely be a 5 star product. You can't beat it for the price, though, even with this limitation. I'll be taking it on the road with me, since it's so small and easy to hook up. Any hotel with WiFi will now come with streaming movies!", "verified": true, "helpfulness": "0/0", "author": "Mark D. Wilson"}, {"rating": 4.0, "review": "Very nice, easy to use, really making it easy to take better advantage of online services on the big screen tv.  Can't wait for new services to be available to expand the value operation.", "verified": true, "helpfulness": "0/0", "author": "ZFam"}, {"rating": 1.0, "review": "So why do I give this 1 star? There are only 4 app that work with Chromcast. So unless you already pay for HBO, Hulu+, and/or Netflix, you will only have Youtube for free. It is easy to hook up and thats about it. To control it, you must use your phone or tablet with the Chromecast app. This isn't much of an issue unless your phone needs off because you forgot to charge it.I am very disappointed mostly with google since they have not allowed other apps to work with it. I would love to use my ABC app to watch Castle but that is not possible. It seems that the low price comes with very little options unless you are willing to pay a subscription. I am very disappointed. I should have spent the $30 to purchase the Roku 3 for $100 on Amazon and would have been able to stream Amazon Prime videos. By the way, I really like Google devices. I own a Nexus 4 and Nexus 7 and enjoy them greatly; however, I am very dissapointed with Chromecast. Don't buy Chromecast unless you have HBO, Hulu+, Netflix and don't care to do anything else. Save your money and buy another device.", "verified": true, "helpfulness": "4/6", "author": "PRDG"}, {"rating": 5.0, "review": "This is an amazing cheap/simple solution for getting your online video stream to your TV.  Setup is a breeze.  With dedicated apps (I use Netflix and HBO Go) the playback is fantastic.  My experience is that there is very occasional additional buffering that halts playback briefly.  This is probably due to the internet connection speed being sluggish (I'm under the thumb of TWC NY, which is a pretty terrible service).  Using the apps on my phone I occasionally find that the cast button disappears, which requires restarting the app and/or disconnecting and reconnecting my phone from the WiFi.  In the grand scheme of things these are very minor inconveniences when weighed against how fundamentally awesome this product is.The device is easily portable and once set up it can be unplugged from one TV and plugged into another on a different WiFi network with minimal fuss.With streaming directly from the Chrome browser (you need to install a small add-on to your Chrome browser for this) I find the playback ranges from very smooth to quite choppy.  I would, again, attribute the choppy playback largely to my internet connection speed.  Nevertheless, I caution people with regular \"high speed\" cable internet against purchasing Chromecast if flawless playback from Chrome is your primary goal.  For me, casting from the Chrome browser is just a bonus feature.I note that I used to stream online content using a Samsung \"smart\" BluRay player.  The smart player system was constantly failing to initialize apps, hanging, declaring that content was not currently available, and logging me out.  After putting up with this for over a year, using Chromecast was an absolute revelation.  I have seen the light -- five stars for awesome.", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 2.0, "review": "as product don't like it .useless and there is something else bettercant stream my gallery on itinternet connection is always needed", "verified": true, "helpfulness": "0/0", "author": "saad hamad"}, {"rating": 5.0, "review": "It was easy to install and I was able to start streaming shows right away with Netflix and Hulu Plus.", "verified": true, "helpfulness": "0/1", "author": "Carol Johnson"}, {"rating": 4.0, "review": "The installation is super easy, its tiny and it does the job. The only draw back is that I originally purchased it so that I could travel and still access Netflix, and it doesn't work within the few hotels that I have stayed. Not sending it back though. Its perfect!", "verified": true, "helpfulness": "0/0", "author": "Frugal Princess"}, {"rating": 3.0, "review": "This is a good device to stream netflix, pandora, hulu plus and Google play music to your TV. But Google really needs to add more apps. it's great to have for the price but I'm hoping more apps down the road gets added to the chromecast .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Chromecast is brilliant in that it understands how we consume content.  Rather than creating a separate set-top device, Chromecast understands that we typically consume content from second-screens (laptops, tablets, phones) while watching TV.  With that in mind, Chromecast turns your second screen into a remote for your first-screen (your TV).  By doing so Chromecast simplifies watching content from any device.It is important to understand, however, that it's a new technology that's still being developed.  It works very well with the limited set of apps .  It's also important to note that some apps are supported better on Android than in Chrome (on your laptop) and vice-versa.  As of now that's roughly Hulu+, Netflix, Google Play Movies/Music, HBO Go & Youtube.  For these apps you get a near flawless streaming experience.  see the wikipedia page for currently supported apps: [...]The other major feature is the ability to stream any Chrome Browser tab onto your TV.  In this case the quality wasn't that great.  Videos streamed in this way were grainy and stuttered.So what it comes down to is this.  If you are the type of person who uses your laptop, tablet or phone while watching TV, and want a simple way to send content to your TV, this is a great device.  Just make sure that the bulk of your content is in a supported app (see the wikipedia page).About the setup process,  I did have some setup problems when I first tried using my Chromebook.  I instead ran the setup from my android phone which triggered a software update on the Chromecast.  After the software update, my Chromebook had no problems connecting to the Chromecast.  So if you have problems detecting the Chromecast, try another device.  If things go really wonky you can hard-reset the Chromecast by pushing the tiny button on the dongle itself for 15sec (it's near the usb port on the dongle).", "verified": false, "helpfulness": "0/0", "author": "Tony M."}]