[{"rating": 3.0, "review": "This gadget is amazing, allowing users to stream from multiple devices. When using netflix or any other offered streaming services the experience is seamless. Their are two huge draw backs for this device the no remote and lack of supported services. It is pretty inconvenient to control the current media that is playing when multitasking on the controlling device. Navigation to the controller menu of netflix for example is a bit clunky.  A cheap roku style controller would have been great.  The lack of other streaming services is also a big con. Netflix and Google movies gets boring after a while. If you have $15 extra the lower end roku is a better buy.", "verified": true, "helpfulness": "0/0", "author": "Brandon WIlliams"}, {"rating": 3.0, "review": "Installed okay despite misleading on screen instructions.  Works fine with YouTube videos.  Does not work with Amazon Instant Video.  I'm not a Netflix subscriber so I can't comment on that.", "verified": true, "helpfulness": "0/0", "author": "joseph garland"}, {"rating": 3.0, "review": "The device is just okay. The sounds are heard long before movement on the screen. Most of the time the images are stalled on the screen. The device can't process the images fast enough.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Google chromecast is awesome. It turns your tv into a smart tv. You can access popular apps like netflix, YouTube, hulu for example. Google recently added more apps but need to add a lot more if they want to compete with apple tv and roku. All apps are controlled thru smart phone, tablet or laptop.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Makes watching TV shows/movies a lot more enjoyable for me than watching my ipad at night.  Would recommend to anyone with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Plpratt"}, {"rating": 5.0, "review": "Works like a charm, so long as you don't fall prey to shifty advertising.This is basically highly calibrated WiDi that works, selectively. I use it for my phone, to stream Netflix to my TV.Just be careful. You need to have WiFi in your place of residence for this to work. It won't work with your cell carrier.", "verified": true, "helpfulness": "0/0", "author": "tosbanzai"}, {"rating": 1.0, "review": "If i wanted to be followed and advertised to why is it not free  .  What the He## has happened to this county when  you have no privacy to to look at and search for things that interest you!  I pay for  High Speed Net service every month so why don't we as Citizens have the right to privacy, when using are smart phones and PC's that we have purchased with are own money...... .................Simply if you buy this Item you give Google the right to save not only what you watch but to have access to all of your personal data that is on your network so that they can find anything relevant to use as a tool to advertise and sell to other marketers (your personal information---  Pictures and pvt emails ect...", "verified": true, "helpfulness": "2/6", "author": "Titus Kitchen"}, {"rating": 4.0, "review": "Easy to install, and makes me enjoy listening to music and video clips at home on my tv. It also good to watch movies, such as Netflix. I do not give it 5 stars because the image quality is not full hd. Some movies might have poor image quality, as well.", "verified": true, "helpfulness": "0/0", "author": "Hebert Rony Silva"}, {"rating": 5.0, "review": "I brought for my friends.It's very nice.I use google chrome to connect to it.Watch film on the TV is a amazing thing.", "verified": true, "helpfulness": "0/0", "author": "Yang Z."}, {"rating": 5.0, "review": "Works great for parties for anytime you want to show multiple people a video for photo! So easy I bought on for my ipad loving Grandpa!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A Stanneart"}]