[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "jason watson"}, {"rating": 5.0, "review": "Love it! Super fast and I like the interface. Voice search is fun and easy.", "verified": true, "helpfulness": "0/0", "author": "E. Wyatt"}, {"rating": 5.0, "review": "I love this device. I use it to go on Netflix, YouTube, and play games using the Amazon game console remote. The remote is pretty awesome. You can speak to it to search. You can also download a remote app on you smart phone that does the something. It's worth the price.", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Sanon"}, {"rating": 4.0, "review": "We had full cable service in multiple rooms in our house through our local cable company for years.  One morning my wife and I were discussing the merits of having all those programs available to us and not using them.  Neither of us had watched an HBO, Showtime, Encore, or other premium channels program in the last 4 months so we cancelled our premium channels and purchased the Fire TV.  We have not regretted our decision.  My only wish is that there were more current \"Prime\" movies available to members.", "verified": true, "helpfulness": "0/0", "author": "Vince"}, {"rating": 5.0, "review": "does it have AMC channel?", "verified": false, "helpfulness": "0/0", "author": "poisoning"}, {"rating": 4.0, "review": "I like how quickly apps load on the Fire TV.  The chromecast and Xbox 360 I used before can't match it.  The Xbox would take 30-60 seconds to load the  Netflix app while the Fire TV has it open in seconds.  Loading episodes it much faster too.  It's also more reliable than my chromecast.  Sometimes I have to close an app on my phone, reopen, and reconnect it to chromecast in order for it to start streaming.  I haven't had that issue with Fire TV so far.  My setup is Fire TV in the living room and chromecast in the bedroom.  But if the Fire TV Stick is ever on sale, well chromecast is going to have to go in the guest room.I like that you can use the remote or download the app for your phone.  Both work well.  I wish the voice control loaded more than amazon products.  For instance you can't say, \"open Netflix\" or anything like that.  I also find myself playing games on here, and I didn't think I would.  I'm not a gamer but it's cool to have little games to play when I'm bored or while listening to music.  The remote plays most games and works ok.  But I imagine if you buy the game controller it's even better.Biggest thing I'm not fond of is the interface.  It's not bad, but it could be better.  I understand amazon wants it's own streaming content front and center, but even being able to pin applications like Netflix to the main screen would be nice.  That way you don't scroll and scroll and scroll some times to find it.  I also don't like Amazon Music.  I've tried to give it the benefit of the doubt, but it's just easier to download the spotify app or in my case the Air Play app so I can play music from my phone over the TV and my sound bar.  If the interface was tweaked, music better, and more voice control options it would be 6 out of 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jeff Lankford"}, {"rating": 3.0, "review": "sorry,not as impressive as I hoped,in fact I don't even use it.It needs a free section ,when you finally find something you want to watch;even old b&w; movies,they want to charge a fee for something I can catch on tv for free", "verified": true, "helpfulness": "1/1", "author": "robert m rehrig"}, {"rating": 5.0, "review": "Easy to use, like it", "verified": true, "helpfulness": "0/0", "author": "Kirsi Marja Blankenship \"kmb\""}, {"rating": 5.0, "review": "I really like the Fire TV and I am thinking of buying a second one. I have two sticks one of which I gave to my sister. However she is already complaining of memory issues. That is one of the reason I bought the Fire TV.  It hasn't failed me yet. It has been a great media center. And no, I have not rooted it. There is no need for it. You can sideload apps to it and also enjoy Amazon's apps. I think I have the best of both worlds. Wouldn't mind being able to put Google PlayStore on it.", "verified": true, "helpfulness": "0/0", "author": "jwillin"}, {"rating": 4.0, "review": "nice little box, I have watched a lot of old programs I can't find elsewhere and very current movies. the usual hiccups and delays as with any service that is dependent on internet bandwidth but overall very good.", "verified": true, "helpfulness": "0/0", "author": "Richard Stevenson"}]