[{"rating": 3.0, "review": "Will not hold charge.", "verified": true, "helpfulness": "0/0", "author": "Joe \"Joe\""}, {"rating": 3.0, "review": "I feel like if this had the option of using amazon instant video I would give it a 5 star. I would rent movies from amazon all the time if I could use the amazon instant video with chrome cast to put on my tv. Instead I usually rent via redbox or my cable provider. I would rather give amazon the business.", "verified": false, "helpfulness": "0/0", "author": "Hannah D. Marshall \"H.Marshall\""}, {"rating": 5.0, "review": "Super great product. Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Valcarcel"}, {"rating": 5.0, "review": "Excellent merchandise and fast seller", "verified": true, "helpfulness": "0/0", "author": "Abdullah"}, {"rating": 4.0, "review": "if application increase, it would be much betters", "verified": true, "helpfulness": "0/0", "author": "Yas"}, {"rating": 5.0, "review": "Excellent choice for casting to your TV from you smartphone or tablet, works with a lot of apps including but not limited to Hulu plus, Netflix, Plex, and You Tube. Also you can cast from your desktop computer or laptop with the Chrome browser and and an add on extension for chrome cast. Highly recommend this simple dongle to a whole new experience with you TV. Even if you have a smart TV, this can you can you extra options that are not available through your TV's HUB. Comes with every thing you need including an ac adapter, HDMI Extension cable and usb cable. In most situations you can use a USB port on the TV to power it and not use the ac adapter.", "verified": true, "helpfulness": "0/0", "author": "Craig M."}, {"rating": 5.0, "review": "For the price you can't beat it. Works really great though not every site will allow you to Cast. The only issue I have is sometimes my iPhone will go into sleep mode and then you have to reconnect in order to stop or pause whatever you're watching but that's really pretty minor.", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Lalla"}, {"rating": 3.0, "review": "It first it didn't work that well, but then I just got used to it or I am not using it as much, I guess.", "verified": true, "helpfulness": "0/0", "author": "bnf"}, {"rating": 4.0, "review": "It just needs to improve the All Cast. Also I think adding battery would be more sufficient.", "verified": true, "helpfulness": "0/0", "author": "Rashed Al-Yemni"}, {"rating": 4.0, "review": "Great unless you want to cast amazon Prime.", "verified": false, "helpfulness": "1/1", "author": "Scott Wright"}]