[{"rating": 1.0, "review": "After I installed Amazon Fire I tried it for about 3 hours.  When my phone + wifi connection bill arrived it was astronomical.  My son in law, in the computer industry, explained to me that in a city he pays for the internet speed.  As a rural customer using satalite or wifi I pay for the giga bytes hence my outrangeous bill.  It is not cost-effective for me to use the devise and I would recommend anyone living in a rural area to think twice about its purchase.  The specifications, etc. fail to address non city use.", "verified": true, "helpfulness": "3/11", "author": "Amazon Customer"}, {"rating": 5.0, "review": "THIS IS AWESOME", "verified": true, "helpfulness": "0/0", "author": "bryan stipp"}, {"rating": 1.0, "review": "Never could get it to work.  Connected to my Wi-Fi ok, but would stop loading & I could not watch anything.  Called customer support & they stepped me thru various \"fixes\", all to no avail.  CS said they would \"kick\" it up the ladder & someone would call me next day.  Didn't happen.  I called them.  Same \"fixes\", still didn't work.  I purchased a Cat 5 Ethernet cable and \"hard wired\" the unit, thinking maybe the Wi-Fi was the problem.  Still wouldn't work.  Contacted CS again....stepped thru same \"fixes\" as before (unplug, re-set router, etc.).  Still not working.  CS said they will call me back by 3:00pm next day.  I even received an e-mail confirming the call back.  Guess what...no call.  I  called them & asked for a return after explaining the problem.  They said OK and the usual canned responses.  Amazon issued a call tag & it was picked up the next day.  But there's more!  Now they want to charge me for returning it by shorting my credit!  Yes that's right folks, it doesn't work but I'm being charged to return it to them.  What a joke!  Don't think I'll be doing any more business with Amazon this Holiday Season!", "verified": true, "helpfulness": "2/6", "author": "Mark Janus"}, {"rating": 4.0, "review": "It was easy to install and set up. There are a lot of choices for sports, movies, tv shows, music, and games. Navigation is fairly easy, although going back and forth through long lists is tedious.", "verified": true, "helpfulness": "0/0", "author": "Charles R Roberts"}, {"rating": 5.0, "review": "This is by far the best device for streaming that I have owned! I have had Apple TV and every ROKU. Very fast, great picture and sound, and the voice search is awesome!", "verified": true, "helpfulness": "0/0", "author": "D. Coffill"}, {"rating": 4.0, "review": "Really enjoy this product. I am able to watch all my videos easily and navigate with no problem.Some improvements I would suggest:-have voice for more applications like Netflix-music takes way too long to load-keep other accounts like Netflix logged in when an update happens, it is annoying to retype the credentials", "verified": true, "helpfulness": "2/2", "author": "Paul_dot_com"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "yvonne dawson"}, {"rating": 5.0, "review": "I like it that best lots everything movies", "verified": true, "helpfulness": "0/0", "author": "Audrey Shapiro"}, {"rating": 5.0, "review": "Use it mostly for Netflix ,Kodi (Xbmc), and Plex....and it works very nicely. Replaced a Ouya which i will sell cheap!", "verified": true, "helpfulness": "1/1", "author": "mark aubuchon"}, {"rating": 1.0, "review": "It does less than Comcast and costs more.", "verified": true, "helpfulness": "1/15", "author": "kay Morris"}]