[{"rating": 5.0, "review": "This product was received on time and worked as described. It's great to see new Chromecast support being offered constantly.I can't wait to see all the future applications of this device.Pros:-It's cheap-Let's you share your desktop screen, Chrome tabs, videos, music via the various apps available-I was able to download the Chromecast app on my mobile in Singapore which is great! Thanks for unblocking that Google (I think they did that originally to maintain that customer experience while apps, etc. were being built).-I love the apps connection with Plex, Youtube and the other new apps from big brands joining the mix.Cons:-A few seconds of delay sometimes after clicking to load apps and play videos/ movies on Viki/ Youtube. This may be due to my wifi connection but worth noting.-Does not fully support local Singapore TV stations yet (e.g. Toggle, ChannelNewsAsia, etc.)", "verified": true, "helpfulness": "0/0", "author": "runhappy"}, {"rating": 5.0, "review": "It is great to use to send videos from any kind of devices. Works great. We still have to wait for more apps to come, but they'll be here in short time... no doubt about it... it's Google!", "verified": true, "helpfulness": "0/0", "author": "Valeria"}, {"rating": 5.0, "review": "Extremely happy with this purchase. It has definitely been worth the money, and I recommend chromecast to anyone. You should buy one.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Vigil"}, {"rating": 5.0, "review": "nothing feels like wireless!if you don't like lots of wires you can choose this Item.I can stream my photos and videos of my iPhone. not to forget to mention that my computer content can be streamed via Google Chrome.it's just great!!", "verified": true, "helpfulness": "0/0", "author": "Elias Alali"}, {"rating": 3.0, "review": "limited number of apps. No direct support for Amazon Prime and with tab casting video quality sucks. I am returning this.However if you are going to play using the apps I think quality will be very good.It does not work for my situation.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Ours stopped working well 1 month after purchase.  After screwing around for days off and on, I still don't know if the problem is the within the Chromecast device or our Xfinity Comcast Gateway and service.  Comcast and Chromecast both have lousy Customer Service and documentation, so we can't figure out why various gizmos don't work and play well together.  Chromecast might be taking the reputation hit for problems created by Comcast controlled (gateway) device settings in our area. Comcast's business practices tell us on a regular basis that they don't care. You've been warned especially if you are forced to play in the Comcast sandbox.", "verified": true, "helpfulness": "1/2", "author": "W. Hawkins"}, {"rating": 3.0, "review": "I bought this for my android tablet only to be disappointed.It doesnt work with many apps:Works with:google play musicgoogle play videosyoutubenetflixhuluNow I don't use these apps for streaming video I use xfinity from comcast, and google chrome.. Can you believe it doesn't work for google chrome on android? It does work for chrome on the PC BUT the quality of the picture sucks badly, I have a $200 wireless router so i KNOW its not my internet connection. Anyways It just could use some new features/update/quality improvements.. Otherwise its really only good for listening to music", "verified": false, "helpfulness": "0/0", "author": "kmaster54321"}, {"rating": 5.0, "review": "Not much to say about the Chromecast other than it is awesome. I love this thing. With limited space during my deployment to Africa, I bought this thing mainly to stream movies from Netflix, video/audio from Youtube and listen to Pandora from my smartphone. It does just that and more. I would definitely recommend this to anyone looking to do any of the aforementioned activities for a really cheap price using something that takes up very little room.", "verified": true, "helpfulness": "0/0", "author": "W. S. Garvey"}, {"rating": 4.0, "review": "First off this device could be great! but like most Google products...they phoned it in. There are too few apps available...if you want to watch anything other than Netflix, Hulu or Google Play search for a different device....it has no Amazon video or Vudu. The option to cast from your browser leads to poor quality playback and choppy video. Disappointed that even when using Chrome I can not stream from the browser on my Google Tab. The one great thing about the Chrome Cast is that it allows me to us my tablet as a Netflix remote. However, in my house it is simply a $35 Netflix streaming device. In the future I will replace it with a Sony product and it will get cast to the dungeon t.v. to rarely be used again.Correction - increased by one star because Vudu can be cast to the chromecast, but Google does not advertise it and doesn't display Vudu when you search for Chromecast apps. Would give it a five if it could stream from Amazon Video and other video apps like A&E.;", "verified": false, "helpfulness": "0/0", "author": "Matthew D. Perkins \"Perkmd\""}, {"rating": 5.0, "review": "I couldn't be happier with my Chromecast. It works well with all my devices and makes \"projection\" way less daunting. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"portageeboy\""}]