[{"rating": 3.0, "review": "disconnects from my phone often. not sure why. I really liked it at first, but honestly a bit disappointing. Pay more attention to it google!!ended up with Roku and much happier.", "verified": true, "helpfulness": "0/0", "author": "Dan D. \"bleh\""}, {"rating": 5.0, "review": "The best thing that has happened since Tofu!  This was such a great investment and the packaging was perfect.", "verified": true, "helpfulness": "0/0", "author": "Mecca"}, {"rating": 2.0, "review": "I've had this device for about six months and I continue to have problems with casting.Sometimes an app (e.g. Hulu Plus, Netflix) will have the icon that you can touch to cast it to your TV and sometimes the same icon will spontaneously disappear or never appear at all when first launching the app. Likewise, sometimes while casting the app will drop the signal. This can happen five minutes into the show or even after casting for twenty minutes. When I go to recast the signal sometimes the casting icon within the app is gone or doesn't respond. This is particularly true for Hulu Plus although it's happened within the Netflix and, ironically, the YouTube apps. Finally, I thought perhaps it was because I was using an iPad and maybe there was incompatibility (it is a competitor to Apple TV after all), but I found the same exact issues on an Android device.I called Google for their assist and I have done everything correctly to connect it to the TV. I've also deleted and redownloaded the apps (particularly Hulu Plus several times), but continue to have the same problems. Despite checking out the help sections of each of site, and despite apparently doing everything I should be doing with each app across all of the devices, the problem has continued for several months. And who has time to troubleshoot across several apps, services, and devices over and over again? Too bad because when Chromecast works, it's nice to use (hence the 2 stars).The lesson? Probably my next step will be to look into a Roku box (not its equivalent to the Chromcast) or smart TV configuration. In the meantime, I have to decide whether paying for Netflix and/or Hulu Plus is worth it when the only device I can consistently get functionality is on my laptop. You get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Guada \"jmg7777\""}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Walfredh Ruano"}, {"rating": 4.0, "review": "Great device, great price. Hope they keep adding apps...", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 3.0, "review": "Works great, BUT... you can't play anything from your amazon prime account on it. Total bummer!", "verified": true, "helpfulness": "0/0", "author": "kliz22"}, {"rating": 5.0, "review": "LOVE Google Chromecast. This was recommended to me by a friend who had one already and told me I'd love it. He was right, it works like a charm. So easy to set up and use. I ended up getting Amazon Fire TV several months later which we use more than the chromecast now (because of the ease and the remote), but I still have NOTHING bad to say about the chromecast. We still use it when we want to show each other youtube videos on the tv from our phone, since there's no youtube app on Amazon Fire TV. If you don't want to spend $100 on Apple TV or Amazon Fire TV, this is a GREAT alternative!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! The function, the price, everything!", "verified": false, "helpfulness": "0/0", "author": "Van Gary Cathcart Jr"}, {"rating": 4.0, "review": "May be this is a great product but This is not for my needs as i already have a streaming player.", "verified": true, "helpfulness": "0/4", "author": "SRI \"gssmsri\""}, {"rating": 5.0, "review": "Works as advertised.  You can stream any tab from Google Chrome that you see on your computer screen.  I love it and much cheaper than other alternatives.", "verified": false, "helpfulness": "0/0", "author": "Roger Ely"}]