[{"rating": 1.0, "review": "When you buy this product keep box for return.  I have spent hours trying get it to work.  All I get is a great screen saver.  My brother talked me into this product but forgot to tell me his son who is the geek of geeks spent several hours to get it to work.  Unless you are a geek and love to spend hours following directions that don't work stay as far away from this as you can.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Delivery was right on time. The item was just as described. I love the Google chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jocelyn Him"}, {"rating": 1.0, "review": "What a piece of crap! Shame on you google for putting out a lame useless piece of equipment! Way to lazy it up even more by not even providing a remote! A remote mind you that would had worked on EVERY unit no matter if the consumer had to provide the \"remote\" ie you smartphone or laptop! Just plan lazy! Oh and I hope your \"remote\" is better than mine and my wifes \"remote\". Iphone 5c??? wont even recognize it from 6\" away! Also google you take 1st place for laziness for this simple fact, Chromecast is not a \"streaming\" device because if you dont have a required \"remote\" you SOL. Chromecaast expects you to find the content you wish to watch on your \"remote\" ie smartphone tablet laptop (compatiable of course) then \"stream\" more like beam the content to the Chromecast which in turn is \"displayed\" if one wishes to classify display as being 30 secs of video followed by an eternity of 99% buffering, the result of my wifes \"remote\" (samsung s5) now keep in mind we downloaded the recommend chromecast app and both have Tmobile cell service.  I would like to end this review by saying, this is my VERY FIRST amazon product review. Ive been burned before, had problems with sellers, problems with recieving the wrong product, and problem with return, but google finally broke the bank with the lazy, cheap, complicated, middle man, excuse for a streaming device! Shame on you google!", "verified": false, "helpfulness": "1/5", "author": "Dirty Cajun"}, {"rating": 5.0, "review": "Another great Google product and works as it should.", "verified": true, "helpfulness": "0/0", "author": "C. Donnelson"}, {"rating": 5.0, "review": "awesome; got rid of the wires from the to the laptop to the computer and can control it from the comforts of my couch", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Love this gadget. Easy set-up!  Easy to use!  Great image quality!", "verified": true, "helpfulness": "0/0", "author": "Lstring \"Grandma Lynn\""}, {"rating": 5.0, "review": "arrived quickly! easy installation. works great!", "verified": true, "helpfulness": "0/0", "author": "tt"}, {"rating": 1.0, "review": "I was under the impression it was simple to operate. It absolutely is not. Trouble seeting up. And never got it working properly.We returned it and bought the firestick which works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome. streak netflix, youtube, etc from your ipad, iphone, etc. I love it and its only $40, less now maybe.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 3.0, "review": "I show photos on a large TV screen to my clients from my computer, and the slide shows lag and are choppy.  I hope chromecast can improve on this.  Casting from the internet works well, but not as much from the desktop.", "verified": true, "helpfulness": "0/0", "author": "Diana"}]