[{"rating": 5.0, "review": "very impressed with the ease of use and the great functionality of the voice command option. also, just as stated, take the unit out of the box, follow a coupe of easy steps and you are good to go. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Anderson \"Car Guy\""}, {"rating": 5.0, "review": "One of the easiest setups ever. Lots of free streaming and reasonable. So far an e excellent purchase for home entertainment. Recommended.", "verified": true, "helpfulness": "0/0", "author": "mamaretta \"L.N. Lawrence\""}, {"rating": 4.0, "review": "Amazon Fire TV is not as easy to navigate as Roku but does offer shows/movies that the latter does not.  Although new in my home, I am well pleased with the device thus far.", "verified": true, "helpfulness": "0/0", "author": "1ID68-69"}, {"rating": 5.0, "review": "Love it...super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Diane Day"}, {"rating": 3.0, "review": "I feel like this EXTREMELY POWERFUL device has been so limited by Amazon. Open it up to the Developer community, watch it fly. This thing has so much capability in such a small package, but it's so locked down, the controllers when mapping them to emulators, after pressing a button, seem to stick, so the games read that I am continuously pressing the buttons (an issue with the api, I'm sure). UNLOCK THE BOOTLOADER Amazon! Let me use my device to its maximum potential!", "verified": true, "helpfulness": "0/0", "author": "Archangel5884"}, {"rating": 5.0, "review": "Amazing ! Far far away better than my previous Apple TV !!!", "verified": true, "helpfulness": "0/0", "author": "CVLo"}, {"rating": 5.0, "review": "Wonderful enhancement to my Prime membership!", "verified": true, "helpfulness": "0/0", "author": "TSO fan"}, {"rating": 4.0, "review": "Great product but they make it a little annoying to use the apps like netflix.", "verified": true, "helpfulness": "0/1", "author": "uncleleo88 \"uncleleo88\""}, {"rating": 5.0, "review": "This is the second one and works fine. The first one would reboot by itself after short use.", "verified": true, "helpfulness": "0/1", "author": "Journeyman"}, {"rating": 3.0, "review": "Works perfect..never stops cause of slow internet", "verified": true, "helpfulness": "0/0", "author": "Danny S."}]