[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "izzy0014"}, {"rating": 3.0, "review": "This is a hit and miss product that is mostly a miss.  I ordered it a while back, so I don't remember how to use it if you plug it into a power outlet, but it just doesn't work for me using the usb into my tv.  I don't know why, but it skips, stalls and doesn't play.  It seems to work okay on my vizio  for some reason, but not on my other tv.  I don't know what the deal is.  I finally broke down and got another product that streams my workouts from my phone to my tv.  I wanted to love this, but I don't.  Others say if I plug it into a power outlet that might work.  I don't think mine came with that option.", "verified": true, "helpfulness": "0/0", "author": "Readsforfun"}, {"rating": 5.0, "review": "I absolutely love my Chromecasts (I have 2 of them).  So easy to stream just about anything from my phone, tablet, or laptop.  It supports most of the major streaming services I use (Netflix, Vudu, HBO, Play Movies).  And for everything else, I can stream either my laptop's Chrome browser tab or my phone/tablet screen.", "verified": true, "helpfulness": "0/0", "author": "Dan P."}, {"rating": 4.0, "review": "Works great with apps that are designed to support it.Two complaints: First, the screen mirroring is jerky and not really usable for video. I have an Apple TV and my iOS devices mirror perfectly, with little-to-no noticeable delay. Second, Amazon Video doesn't support Chromecast. This is probably more an issue to take up with them, but if you're thinking about buying one of these with the intent of watching Amazon Video, look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Bill \"Long-time audiobook listener and enjoy sci-fi, thriller and crime noir. In non-fiction, I enjoy science, anthropology, history and religion.\""}, {"rating": 4.0, "review": "Really cool! Sometimes it disconnects but other than that I love it.", "verified": true, "helpfulness": "0/0", "author": "DDrod"}, {"rating": 5.0, "review": "For $25-$30 you can't beat the price and versatility of Chromecast. I have recommended it to all of my friends and family and haven't had any complaints.", "verified": true, "helpfulness": "0/0", "author": "Chris Eccleston"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Enriquez"}, {"rating": 1.0, "review": "Horrible item for 35.00 It is just transferring stuff from computer to TV. I have air parrot for that, free download thru torrents.", "verified": true, "helpfulness": "0/0", "author": "manonfire"}, {"rating": 5.0, "review": "love it so much we bought two for our bedroom and livingroom.", "verified": true, "helpfulness": "0/0", "author": "Caroline Wigginton"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "MARCOS PUIG"}]