[{"rating": 4.0, "review": "It took me a few days to figure out how to get movies on Prime.  I am an older woman and all this is new to me.  Like the choices. Having trouble with the game controller.  Never used one before.  Could use a little more information on how to get the most out of the until.  Over all like the setup with Speak feature.  Glad I waited to get this unit.", "verified": true, "helpfulness": "1/1", "author": "B. Hill"}, {"rating": 3.0, "review": "I should have known too good to be true, when i talked to the amazon rep he said i would get Netflix Hulu Plus and Pandora 1 at no additional charge, not so if you want these extra stations you have to pay for them, Im glad i didnt cancel my Netflix I already have before I sent Amazon Fire TV back. I like the concept that I can speak into the remote and it will find everything for me, but for a little effort I can get out of my lazy boy and find what i want on my computer or Kindle Fire and plug it in to my TV", "verified": true, "helpfulness": "1/1", "author": "BStinger"}, {"rating": 3.0, "review": "Fire TV would be the “perfect” set top box if:>It provided access to the internet using a web browser.>It provided access to UltraViolet digital collection via VUDU or FLIXSTER.>Must subscribe to Amazon Instant Prime in order watch movies>Dose not easily identify free TV or movies content>Does not offer a free streaming media serviceOver all it's OK but could be a lot better", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love it!  It's so fast and easy to use, we mostly do Netflix and it works perfectly for us.  Haven't explored the amazon tv side of it yet but so far very impressed", "verified": true, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 5.0, "review": "I usually don't give five stars, but this little gadget has been so very useful I can't justify anything else.  I use it for Netflix mostly, but I've also gotten Amazon movies and the picture quality is awesome and it loads super fast.  The voice search only works for Amazon selections, but the unit got me to set up my Chromebook as a remote control for Youtube searches.  This was so easy that I didn't even realize I was doing it until it was working.  I'm very happy with this purchase.", "verified": true, "helpfulness": "1/1", "author": "S. Cusick"}, {"rating": 3.0, "review": "I bought this thinking I would be ahead of the technology curve.  Not so.  Difficult for me to figure out how to install it.  I was also going to use this in place of Comcast but really limited choices.  Too lazy to return it but will use it for Amazon prime selections.", "verified": true, "helpfulness": "1/3", "author": "Ronald A. Kronowitz"}, {"rating": 5.0, "review": "It's wayyyy better than all the other media streaming devices I have used and reviewed, as I own a computer repair business. I installed this device in my Coffee Shop and was blown away with it's speed and voice search capabilities!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to work! I'm extremely happy with this product. I had no problems setting up and I've had it for about a month with no issues. I decided to save on cable and cancel. I watch all my tv thru Amazon prime, Netflix and hulu. I have a roku in my bedroom, I had bought it before fire came out. I'm happy with both.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}, {"rating": 3.0, "review": "It's absolutely everything you want, if all you care about is Amazon....I loved how smoothly it worked, hoe great the interface works, everything, but it didn't last in my home for one reason, it didn't really separate itself from my Roku or Apple TV (or other boxes I have bought and returned).Roku has the killer feature - Universal Search. You do too, but your awesome feature is Voice Search, yet you relegate it to only a few things (Amazon primarily). Why? That's absolutely the reason I returned it.Apple TV is dead simple. I love that it works with my computer running iTunes. Use it daily. Same with my Roku.I had a WD and it worked well with an external hard drive, but again, Roku and Apple beat it out.Amazon, you are SO CLOSE to making the perfect streaming device, but you missed the mark.Universal Voice Search would've made my Apple TV and Roku obsolete.", "verified": true, "helpfulness": "1/1", "author": "David E. Crocker \"Aliens Wanted\""}, {"rating": 4.0, "review": "I haven't had time to hook this unit up yet.  The quality looks good and the shipment was great.  Good service", "verified": true, "helpfulness": "0/4", "author": "Bernie Axtman"}]