[{"rating": 2.0, "review": "After numerous attempts to correct the sound to be in sync with the video, it just doesn't improve.  I'd love it if it worked.", "verified": true, "helpfulness": "0/0", "author": "Musetta Wollenweber"}, {"rating": 3.0, "review": "Good price for product that allows you to watch media on a TV without a cable box. However, Netflix and Amazon Prime do not work. It also streams from smartphone so have to have that around.  I would suggest FireTV Stick. About same price and comes with a remote plus streams from Internet, not phone.", "verified": true, "helpfulness": "1/1", "author": "Michael's review"}, {"rating": 5.0, "review": "Youtube on the TV and it's actually rewarding to use in steady of the awkward setup up of some smart TVs.  It's real easy to set up and even better that I can use it with my phone, laptop or tablet.  It doesn't seem to work with sites that stream with silver light though.", "verified": false, "helpfulness": "0/0", "author": "Jeffrey T Pretz"}, {"rating": 5.0, "review": "Great buy.", "verified": true, "helpfulness": "0/0", "author": "Miguel S."}, {"rating": 5.0, "review": "This is slick and the best part is it takes 3 minutes to make work. I use to stream music videos off my android and its perfect quality and I.like how you control volume.", "verified": true, "helpfulness": "0/0", "author": "MylesD"}, {"rating": 5.0, "review": "First time user of Chromecast, not only is it incredibly easy to set up (5 minutes from box to watching a movie) but it is versatile as well. I can easily use it on my living room TV and transport to my bedroom TV. It's great for YouTube videos, as long as the quality of the video is good so will the casting. I love how it shows my pictures from Google Photos too! I totally recommend buying! Especially if you are a Google user, not sure how well this works with Apple technology...from personal experience this is WAY better than Apple TV-which is of course, over-priced.", "verified": true, "helpfulness": "0/0", "author": "Carla Garrison"}, {"rating": 2.0, "review": "Works well for what it is. Don't like that it only works from an outside source (phone, tablet, etc.) Ended up returning and getting a Roku stick instead. I am much happier with it. Amazon Fire stick is also a good choice. Both have a remote, and all the content streams directly through the stick, rather than \"casting\" from a device. Can't stream Amazon Prime through Chromecast either!", "verified": false, "helpfulness": "0/0", "author": "Kale"}, {"rating": 5.0, "review": "Amazing!!", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 5.0, "review": "LOVE IT!  So many things you can do from your PHONE and the cost is reasonable --it's amazing technology.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing. So easy. I didn't realize it didn't have a remote, only your phone is used for that but that is just fine. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "BV \"BVO\""}]