[{"rating": 5.0, "review": "Best thing everrr", "verified": true, "helpfulness": "0/0", "author": "blasbenoit"}, {"rating": 4.0, "review": "I own several different solutions to solve the problem of getting content onto my TV.  I have the Amazon Fire Stick.  I have a Roku 3.  AppleTV.  Even one of my TV's can do it without any additional gear.  The ChromeCast is elegantly simple, but perhaps too limited compared to the others.  It basically provides a wireless bridge between your phone (or computer) and the TV to display whatever content you have.  It doesn't provide access to any content on its own.  For the money, the Roku provides much more functionality.  Still, the ChromeCast is very well executed and does a great job within its design parameters.  Yes, you need to provide separate power to the unit, which means an extra cable coming from somewhere.  If your TV provides power via USB you could power it from one of those slots.  Otherwise, you're running a cable to the wall adapter.", "verified": false, "helpfulness": "0/0", "author": "Evan Jacobs"}, {"rating": 1.0, "review": "We purchased the chrome cast and enjoyed it for about 6 months. We did have an issue with an update and having to reboot our router and the chrome cast. However, today we went to cast and it won't cast at all. We did a hard reset and everything. It has completely stopped working!!! Apparently this is a problem that Google knows about and has no way of fixing and has even ignored customers asking how to fix it.", "verified": false, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Once I figured out which setting it needed to be on for my TV, I have loved it.  Very easy to use and my kids just love that they can watch a movie on the computer and the TV at the same time.  My wife and I also enjoy it as we're able to watch movies from my computer.  A great buy!", "verified": true, "helpfulness": "0/0", "author": "ET MAN"}, {"rating": 5.0, "review": "Love this thing.  Easy to use, easy to setup.  This is my ain playback for Netflix, some games, and casting from my laptop or Android phone.  For the cost it is amazing!", "verified": true, "helpfulness": "0/0", "author": "Tonyh"}, {"rating": 4.0, "review": "A great buy .I finally stepped into the 21st century . I'm now connecting my devices to my T.V. It doesn't connect right away the first time but if you keep trying it will connect(that's the only reason I didn't give 5 stars).This is a very reliable product.I'm very happy with my purchase and will definitely but again from this seller.", "verified": true, "helpfulness": "0/0", "author": "JERRY PERKINS"}, {"rating": 5.0, "review": "Great item so useful! Must buy! no more stupid long wire!", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 5.0, "review": "It works perfectly.", "verified": true, "helpfulness": "0/0", "author": "MELINA C. SANFELIPPO"}, {"rating": 4.0, "review": "...it doesn't fit too securely in the USB port in my TV. I have to move it around and jiggle it until the White light comes on. This is crazy! Was surprised of this because most USB jacks fit securely in ports!  But once it secure, it works great.", "verified": true, "helpfulness": "0/0", "author": "RV"}, {"rating": 5.0, "review": "Got this for $7 with a $10 gift card on special sale.  Works pretty well ror PC and great with my moto g (1.5 gen LTE).  Ipad support severly crippled but thats not googles fault ;)", "verified": true, "helpfulness": "0/0", "author": "Todd A. Klick"}]