[{"rating": 5.0, "review": "Gotta love those things that \"just work\"; this is definitely one of them! In most streaming scenarios, your device will \"hand off\" the stream to the Chromecast, freeing you up to use your phone or tablet while the chromecast handles the work.", "verified": true, "helpfulness": "0/0", "author": "Russ Minton"}, {"rating": 2.0, "review": "Only streams from a limited number of apps through other devices. Having said that, it's cheap and easy to use. No spotify. :(", "verified": true, "helpfulness": "0/0", "author": "D. Stovall"}, {"rating": 5.0, "review": "nice product", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 5.0, "review": "such a good product for the money.", "verified": true, "helpfulness": "0/0", "author": "paulander15"}, {"rating": 5.0, "review": "What a great product.  Bought the 1st one and the wife and I loved it so much, we bought a 2nd for the upstairs TV!  You can stream almost anything to you TV now.  Even your desktop screen!  With the cast the entire screen/window (in experimental mode, but works great), you can even cast your entire desktop/laptop screen to the TV through the chrome browser.  So you don't need to install Plex Media Player anymore.  Just play whatever media you want, and the cast the entire screen to the TV and the TV will pick up both video and audio from the desktop!Great job google!  You heard our cries and have answered.", "verified": true, "helpfulness": "0/0", "author": "Tim T."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "ROGER F LINDQUIST"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Sheila Britton"}, {"rating": 4.0, "review": "its ok needs more apps", "verified": true, "helpfulness": "0/0", "author": "paul cioffi"}, {"rating": 1.0, "review": "its works; however, if your watching multiple shows it doesn't go on to the next show you have to recast every time. I'm sticking with roku", "verified": true, "helpfulness": "0/0", "author": "Christopher Brannaman"}, {"rating": 5.0, "review": "worked perfect with our laptop and tv", "verified": true, "helpfulness": "0/0", "author": "Roger W. Elshaug"}]