[{"rating": 4.0, "review": "it keeps reloading not all the time", "verified": true, "helpfulness": "0/1", "author": "june petersen"}, {"rating": 3.0, "review": "I bought this to replace my Apple TV. I use netflix and Plex for my local content and thought this would be a welcome new addition. I found problems that can't be resolved right away with Plex/Fire TV. Fire TV has an optical out which I need, but it doesn't do passthrough unless you use Amazon content, so you only get stereo through plex and there is no workaround as of yet. Also I noticed huge stuttering in large 1080P files with Plex which I never have experienced with ATV3. These problems are kind of a breaker, I am not sure if it's Plex's fault or Fire TV, but I never had an issue with Plexconnect on ATV.Now for the Fire TV itself. The interface is clunky and seems without purpose and refinement unless you want Prime content in your face. There is no App store on the fire TV which I found stupid and odd, I found it kind of inconvenient to have to go to a different device just to load more content on it. You can sideload apps via ADB but the apps won't get an icon anywhere to access them and you have to go deep in the settings to access the service to launch the APP.The Fire TV has potential but Amazon is trying to pull an \"Apple\" and lockdown everything and force you to see the world through their eyes.", "verified": true, "helpfulness": "0/1", "author": "Warren"}, {"rating": 3.0, "review": "Pros: beautiful build, great load times, haven't experienced any buffering yet, great voice search speech recognition.Cons: locked to only Amazon content, almost everything needs to be purchased if you don't have Amazon prime, doesn't have google play store, slim app selection, can't download and install apps from unknown source and allow them permissions to actually run.", "verified": true, "helpfulness": "1/2", "author": "Bdb"}, {"rating": 5.0, "review": "Super easy to set up. Don't even bother buying the info book. You won't need it. The instructions pop up on your TV and walk you right through the installation. I'm still confused as to why I'm not seeing season 3 of Ripper Street available though.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Agne"}, {"rating": 4.0, "review": "Fast and simple to operate...But where is the OFF Button! In a world where we should be conserving energy..there's no Off Button?I put it on a power strip with a Off Switch", "verified": true, "helpfulness": "0/1", "author": "Roger Sajak \"I hate social media!\""}, {"rating": 5.0, "review": "Works great, amazing capabilities and speed. Voice remote is amazing and fast! Haven't had more than 3 hours to use it (been using prime/netflix/hulu plus for a year online but this is so much more convenient and works exactly as advertised!", "verified": true, "helpfulness": "0/0", "author": "Jerrico Usher"}, {"rating": 4.0, "review": "My Roku 2 was freezing on me so I decided it was time to make a changed.  Read reviews, decided not to go with a new Roku because the old one was freezing.  Reviews were right about Amazon Fire.  It is fast, so much faster.  I like that very much.  I do miss the string attached to the control.  I keep losing the remote in my couch.  Adding the application was pretty easy except for Netflix.  There was an error that I needed to search internet for a solution.  Eventually the solution worked.  Also, got a great deal.  I was able to spread payments out over 5 months. Love that.  Reviews said the interface was very simple.  I don't mind that at all.  I'd recommend.", "verified": true, "helpfulness": "0/1", "author": "Raccoon"}, {"rating": 5.0, "review": "Excellent streaming device if you have prime. Plenty of apps.", "verified": true, "helpfulness": "0/0", "author": "Shaun"}, {"rating": 2.0, "review": "The Amazon FireTV is yet another \"trusted client.\" Meaning it's locked down, and useable only for what its developers intended.  From an available apps perspective its comically bad, performance wise its better than most.  If the only thing you do is watch Amazon streaming this is your box.  If you want to use it for anything else, YMMV.  Good luck.  Personally I think it was a complete waste of money.", "verified": true, "helpfulness": "0/4", "author": "eggehad"}, {"rating": 5.0, "review": "We love this little gizmo!  We decided to ditch our premium channels on TV and try something different.  Super easy to use with both Amazon and Netflix.  I am catching up on movies and TV programs that I did not have time to watch when they were first run.  Really like it and recommend it to anyone who likes their entertainment how and whenever they want it.", "verified": true, "helpfulness": "0/0", "author": "Ellen R. Mertz \"Bead Rose\""}]