[{"rating": 4.0, "review": "This is an incredible value for the price.  It installed easily, and streaming YouTube, my Netflix and Amazon Prime are a cinch.  BUT the instructions included with the Chromecast are nearly non-existent, and I have yet to figure out how to stream other content from my computer, such as my pictures library.  I don't use cable or satellite at all.  Just Roku and an antenna for local broadcast stations, so I had contemplated buying a device to stream from my computer for a long time.  But I kept reading reviews about how difficult it was for many people to get the streaming devices to work with their systems, and most of them cost $100 or more.  When I saw the Chromecast for $35, I figured, \"What th heck - at that price, I'll give it a try\".  I'm very glad I did.  And BTW - you can take it with you when you travel.  I recently stayed a t a very nice hotel, but their free cable offerings were very limited.  But with the hotel's free wi-fi, my netbook & chromecast, everything I would watch at home was available.", "verified": true, "helpfulness": "0/0", "author": "Earth Mother \"Earth Mother\""}, {"rating": 3.0, "review": "I didn't know that this will not work with a Kindle. If it would have I would give it 5 stars, but now I have to send it back.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Great item, Fast Shipping", "verified": true, "helpfulness": "0/0", "author": "Michael Simon"}, {"rating": 5.0, "review": "Bought this product for daughter at College, when our son said this is great to have, easy to install, You can watch all the programs you love! He installed it in 5 minutes, it was faster than following instructions on how to put furniture together! So we actually watched TV ten minutes after we got there. THIS is a \"peach\" of an item!  Great gift for College kids!", "verified": true, "helpfulness": "0/0", "author": "sandra resnick"}, {"rating": 5.0, "review": "This is the best thing since sliced bread. It is easy to install/setup and use. Great picture quality and fun. We use it for from tablet, laptops and phones. Everyone with a tv should have one.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelente!!!!", "verified": true, "helpfulness": "0/0", "author": "Paola"}, {"rating": 5.0, "review": "I can not stop recommending this Media player. Now that local content playback has been released is the most used piece of technology in my house.", "verified": true, "helpfulness": "0/0", "author": "salvador"}, {"rating": 5.0, "review": "This little fob is AWESOME.  We travel quite a bit and only take our ipad with Netflix.  Now kids can watch their Netflix movies & shows on the TV instead of huddling around a little screen, and we can watch documentaries, series, etc while we're away from home.  You have to make sure TV has proper HDMI input.  Sometimes can be a little finicky to setup but once you figure it out youre good. Sometimes would disconnect after non-use for a day or two, but just unplugged everything to reset and it reconnected no problem.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works fine!I bought this item and it works just fine in latin america with a tp-link router.", "verified": true, "helpfulness": "0/0", "author": "Irene Arizaga"}, {"rating": 5.0, "review": "Changed my life awesome if you have kids", "verified": true, "helpfulness": "0/0", "author": "luis"}]