[{"rating": 5.0, "review": "Luv it !!!!!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great ,way better than Roku", "verified": true, "helpfulness": "0/2", "author": "maxie"}, {"rating": 1.0, "review": "Not pleased with promotion from Amazon nor the product.  The voice activation search only gives you AMAZON options (or IMDb--most of which you pay for)  Not as many channels as the ROKU, which is simplier and gives you the freedom of many more channels.  You cannot upload TWC streaming or lots of other streaming options, so you are really limited if you use streaming alot like my family does.  I can buy two ROKUs for the price of this item.  I did not receive movie credit because of installation plan because you have to choose one or the other, but that was never explained or even noted on the promotion I received.  I am returning before the 30 days.  There is no benefit to the customer for this product.", "verified": true, "helpfulness": "6/10", "author": "#notoamazontv"}, {"rating": 4.0, "review": "I think this is a great product but it just needs more to it. More apps, integration, etc. But I have an appleTV and from a speed stand point (loading movies, etc), it blows it out of the water. Just not much else separates it so I don't know why I need both. Searching form movies that you can watch for free is incredibly painful though, which shouldn't be the case as a prime member.", "verified": true, "helpfulness": "0/0", "author": "PrimeGuy"}, {"rating": 5.0, "review": "Ultrafast shipping this is an outstanding value. This device is far superior than any other I've seeing on the market.Highly recommended!Outstanding service plus so many other features too many to describe. If you don't purchases you're missing out.", "verified": true, "helpfulness": "0/0", "author": "Ti1234"}, {"rating": 2.0, "review": "I'm having issues with intermittent signal loss via HDMI hooked up to my Panasonic ST60 plasma TV.  The signal loss happens at random intervals, usually for about one second, where the screen goes black and sound cuts out.  I've tried using different HDMI cables and switching HDMI ports on my TV but still getting this problem.I also tried testing the Fire TV with other TV's I own to see if it is a defective unit or an isolated problem on my Panasonic plasma.  After hooking it up to both a 42 inch Samsung LCD TV and even my Asus 23 inch computer monitor, I didn't experience any signal loss whatsoever.  This leads me to believe that the Fire TV is not playing nice with my Panasonic plasma for whatever reason.  If anyone has any suggestions or solutions to this issue I'd appreciate the help.Until this problem is fixed, I can only give this a max of 2 stars, the saving grace being the clean, snappy and responsive UI, and the ease of sideloading Android apps not offered through the Amazon Marketplace.", "verified": true, "helpfulness": "0/0", "author": "aquinonga"}, {"rating": 3.0, "review": "Not enough programming available without a charge to Amazon Prime members. Older programming should not require a charge to view.", "verified": true, "helpfulness": "0/0", "author": "Derald J Carroll"}, {"rating": 4.0, "review": "Contents are on quite limited.  Also the connection are frequently chocked when the wifi connection is average.", "verified": true, "helpfulness": "0/0", "author": "Xiaofeng Chen"}, {"rating": 4.0, "review": "I really do! I just hope they will add their amazon music to it. I don't understand why I have to have Pandora or some other app when Amazon's own music app is my favorite. The voice controls work great, there is tons of great programming. Its easy to find programs you want to watch, there is an entire section dedicated to free prime content divided up into movies, HBO, TV shows and children's (that I use anyway there may be more) I love that its much easier and more reliable than their PlayStation app. It has a really cool feature where you can use your own photos as a screen saver (their stock photos for this are pretty freaking awesome too!) I've played one game on it so far (you don't know jack) which is free and you don't need the control for. I'm actually planning on getting a second box for the living room. They have a cool limited program part for kids too though I haven't really checked that out yet. Their parental controls really work (to the point of being annoying if you don't turn them off lol) all in all totally worth the 100 bucks considering I've had a prime membership for the last 3 years and dont plan on ever giving it up( i order lots and lots but bonuses like this are so nice) and this is the first time I've actually used the free TV portion.", "verified": true, "helpfulness": "0/0", "author": "ReviewStuffz"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Squatch \"Squatch\""}]