[{"rating": 5.0, "review": "My son had to coax me to buy this but I can't rave about it enough! For me, the best part is laying in my bed and having Netflix streamed to my tv from my phone. It is so easy to set up and to use! I rave about it all the time.My teens like to use it for youtube on the tv and pandora but it's great for so many things!", "verified": true, "helpfulness": "0/1", "author": "Tonya"}, {"rating": 5.0, "review": "Not having a smart TV this little addition made watching shows that much better. Youtube on a big screen...Netflix episodes...so much better than my tablet.", "verified": true, "helpfulness": "0/0", "author": "AEspo"}, {"rating": 4.0, "review": "If money is no option, go with Apple TV, but if you're on a tighter budget, this will do the trick.  The lack of a remote is the weakest point.", "verified": true, "helpfulness": "0/0", "author": "Dan Marsh"}, {"rating": 5.0, "review": "I didn't even know such a thing existed until I accidentally saw it on Amazon while browsing through products.Was going to subscribe to ESPN to watch the World Cup but using this with free WatchESPN app, I saved having to pay $10 extra per month!If you're not sure what this is as I was in the beginning, this basically allows web pages via Chrome or supported apps to be shown on TV.  At first, I'm not sure how this works and was wondering if I have to keep the app running on my iPad but no, once you click the Chromecast button, the web content will be shown on your TV and you can even turn off the iPad.  Truly remarkable.Having problems with your Netflix on your TV?  Open Netflix app and watch via Chromecast!As far as I'm concerned there does not seem to be any loss of resolution and the picture looks just as good.With so much of the cable content being broadcast on the web for free, you can basically cut the cord by using this baby!", "verified": true, "helpfulness": "0/0", "author": "dasn0wman \"dasn0wman\""}, {"rating": 1.0, "review": "I have both Roku and Apple TV streaming devices.  They were easy to set up and came pre-packaged with the streaming sources built in.  I received this as a gift and thought I would give it a whirl.  Not up to standards is my conclusion.  Easy enough to download the software to run it and hooking into the wi-fi not a problem.  Have had no success however with any of the apps.  Sure I can stream from my WIndows 7 laptop, but what good is that?  The online help is pathetic.  So, this is going on the trash-heap of useless electronic devices.  It should not be that difficult to get it working.  I feel bad for the giver.  This from a company that is supposed to epitomize tech savvy-ness.  Save yourself the frustration and go with either Roku or Apple.  Yeah, they cost a little more, but the old adage \"You get what you pay for.\" is true in this case.", "verified": false, "helpfulness": "0/1", "author": "M. Parke \"Matt\""}, {"rating": 4.0, "review": "I bought the Chromecast as a gift for my wife because she has an Android phone and there was no way to stream, Airplay etc., to my Apple TV 3. Neither of us find ourselves using this or the Apple TV now that I have an HTPC hooked up to the same TV. The device has no exceptional features, but for the price it's a huge value.Who's this for?Anyone needing a streaming solution without specific needs for a box with more utility. Anyone looking into an Apple TV as that machine does nothing more (ATV 2 can be jailbroken, however).Who shouldn't get it?Anyone with ANY streaming device including Roku, Ouya, Apple TV, Xbox, PS or a PC hooked to their television.Biggest complaint:The power chord. I knew this going in, but I would love for this dongle to be powered from the USB port similar to an external hard drive. It's far less elegant with a chord hanging out.Bottom line:It works, it's simple and it's a great value considering price. The limited feature set will not be reason enough for many to shell out more $$ for a more versatile box.", "verified": true, "helpfulness": "0/0", "author": "Trevor Ayers"}, {"rating": 5.0, "review": "Works with youtube and netflix flaswlessly. Would like to see more streaming services compatible with this device though. If you could stream videos directly from Internet explorer or Chrome etc that would be ultimate upgrade.", "verified": true, "helpfulness": "0/0", "author": "R. J \"dear_rupa\""}, {"rating": 4.0, "review": "I wanted something to allow me to watch my college baseball team's games on TV when they were only available streaming via the internet.  This is a pretty good solution for this.It's by far not the best possible video quality or performance you can get. So if that's what you want, look for something better. But this is really great for the price.", "verified": true, "helpfulness": "0/0", "author": "Guitar Johnny \"Guitar Johnny\""}, {"rating": 2.0, "review": "I rented a movie on Google Play in HD & tried streaming it through Chromecast via my laptop. It buffered every ten to fifteen minutes. I should have bought the Roku Streaming Stick instead, although I might have had the same problem with that too. I am returning this product to Amazon for a refund and from now on will just use my HDMI Cable to play movies or TV shows on my TV via my laptop, which is fine. Chromecast is basically just a wireless HDMI cable is all. It doesn't even have a user interface or a remote. For $15.00 more I would buy a Roku Streaming stick (in the link below) which doesn't have ridiculous buffering times.http://www.amazon.com/gp/product/B00BGGDVOO/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00BGGDVOO&linkCode;=as2&tag;=nealo1-20&linkId;=NAY7ZD4IRWRFP7EF", "verified": false, "helpfulness": "0/2", "author": "Dan"}, {"rating": 1.0, "review": "I bought this with very high hopes since it is from Google,after plugging in, realized it is very slow on streaming and returned it back to Amazon,would not recommend", "verified": true, "helpfulness": "0/0", "author": "Harik \"hariagk\""}]