[{"rating": 3.0, "review": "There isn't really a lot that can be done with this. Not enough Chomecast apps yet. My Roku can do a lot more.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "What I spected is the device.  Very cool and I love a lot because I don't need a new TV.", "verified": true, "helpfulness": "0/1", "author": "Miguel Green Camara"}, {"rating": 5.0, "review": "I love this thing.  Hooks in with my TV well, YouTube, Netflix and the rest of my PC are at my disposal at a moments notice!", "verified": true, "helpfulness": "1/1", "author": "Martin Phillips"}, {"rating": 1.0, "review": "Do not waste your money. Chromecast has cost me so much frustration.  Do not waste your money with this product.", "verified": true, "helpfulness": "1/6", "author": "Clara Alvarez"}, {"rating": 1.0, "review": "I purchased this product less than 2 weeks ago. All on a sudden sound stopped working. I would not recommend it it to anybody.", "verified": true, "helpfulness": "0/3", "author": "raven"}, {"rating": 5.0, "review": "The best investment I've ever made! got rid of my cable tv!! works perfectly and was soo easy to set up!!", "verified": true, "helpfulness": "1/1", "author": "Samantha Piva"}, {"rating": 5.0, "review": "The Chromecast works exactly as described. I recommend it for anyone who uses Netflix, Hulu, HBO Go, or any of the other supported streaming services.", "verified": true, "helpfulness": "1/1", "author": "Michael Denholtz"}, {"rating": 5.0, "review": "Adding the ability to simply cast Amazon Prime Video is the only thing I wish I could change about my Chromecast.  If Amazon would step up and write an app for Chromecast, I would be completely satisified.  Well, now that i think about it, I do wish Netflix would make its Chromecast app play multiple consecutive episodes of a show without requiring user input each time too.Chromecast is a great little device at an excellent price, and I am really glad that I bought one even though I already had a streaming Panasonic Blu-Ray player with more apps than my Chromecast had in the beginning. Chromecast has fewer hiccups than my Panasonic Blu-Ray player, reacts more quickly to my input, has a better user interface overall, and allows me to stream shows directly from Chrome.If an Amazon app were available for Chromecast, it would be the perfect streaming device for me.  As it is, I end up using Chromecast with Netflix, YouTube, other apps, and Chrome, while watching fewer and fewer Amazon Prime Videos.  I could watch Amazon videos with my streaming Blu-Ray player, but using Chromecast is so much easier.And when I'm not streaming with Chromecast, I often enjoy the beautiful slide show it displays.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 1.0, "review": "Got my chromecast and it worked great for 2 weeks and then crashed. It only shows a black screen and won't cast anything from netflix, hulu, or youtube. When trying to contact Google about it, it sends you in a loop. It says that they honor a 1 year warranty and you need to contact Google plus support, but when you contact Google plus support it doesn't offer any links for warranty claims and when you click on return it says the return is only valid if purchased through Google plus.Very lame and the worst of customer service. The chromecast is a scam and I would not be surprised if they had all workers at Google write reviews to seem the product is amazing and trending.AVOID AT ALL COST. I will be buying a Apple TV today as the $35 I spent on the Chromecast cannot be returned to Amazon as the timeframe has expired and is not handled under any warranty by Google Plus.", "verified": true, "helpfulness": "2/2", "author": "Gatorboy92000"}, {"rating": 4.0, "review": "I bought two of these and they work great with my tablet.  I have tried with two different TVs to play TV shows as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Nat D. Traudt"}]