[{"rating": 3.0, "review": "A new gadget which we probably thought and hoped too much of. Let's see what happens with it in the near future.", "verified": true, "helpfulness": "0/1", "author": "Joe"}, {"rating": 5.0, "review": "works great for presentation on LCD, LED tv for office, wireless so i dont use more cables on my presentations", "verified": true, "helpfulness": "0/0", "author": "Javier fragss"}, {"rating": 4.0, "review": "easy to use, just plug into my TV;easy to setup, less than 1 minute,easy to share, across almost all platform!but:only youtube and netflix,no local video support.", "verified": true, "helpfulness": "0/0", "author": "Peter Geng"}, {"rating": 2.0, "review": "So, maybe this works great for what it is supposed to do but I thought I could put anything on my Kindle, iPhone, or iPad up onto my tv.  Once I loaded it, I found out it can only basically do YouTube or Netflix.  I already have a smart tv so it doesn't do what I thought and doesn't really help.", "verified": true, "helpfulness": "3/6", "author": "usma89 \"usma89\""}, {"rating": 5.0, "review": "Just being able to stream Netflix and Google Play content (music, movies, etc) makes it worth the $35.  Once the device mirroring options get ironed out and it gets Plex support its going to be a steal at that price.", "verified": true, "helpfulness": "0/0", "author": "ITguy"}, {"rating": 3.0, "review": "The only app that I have used is the YouTube app and it works seamlessly. The mirroring of the Chrome tabs needs work given that the audio doesn't sync when watching videos. If simply viewing web pages there is a lag in what you're doing and what is cast to the TV and the mouse isn't visible on the TV. I think one fix is to reduce the resolution from 1080 or 780 to 480p (not pretty) but out of the box it isn't the best. So, if the apps are going to be what works best, hopefully Google is working on some more. Especially those with a video component. Given the price I would recommend the product, however I would temper your immediate expectations. This is a new product that needs work but i'm sure there will be upgrades in the future.", "verified": true, "helpfulness": "1/1", "author": "Ning Burden"}, {"rating": 2.0, "review": "This would be great if it worked with more apps but it works with only a handful such as Netflix. Sure I can stream from my computer in another room but that means I lose functionalities such as Pause / Start. It's close and I hope that they plan to partner with more vendors to make this a great device.", "verified": true, "helpfulness": "1/1", "author": "Wise Guy"}, {"rating": 5.0, "review": "I bought the Chromecast for 4 reasons:1.  streaming Netflix from smart phones to TV at home or while travelling because its so portable2.  I purchased the Madden 25 anniversary edition with NFL Sunday Ticket streaming and use my laptop to send the game stream to my TV.  I used it all day yesterday and it worked much better than I expected.3.  the SDK, when its released, will allow all my favorite apps to stream.  Once my Plex app adds Chromecast support I will be in nerd nirvana.4.  My wife likes iPhone, I like Android.  We are both able to use Chromecast as well as stream from our laptops.  A feature I love but wasn't aware of is the ability to Cast my entire desktop.The Chromecast is fantastic now and its only going to get better.", "verified": true, "helpfulness": "0/0", "author": "Jerry A. Morey \"Jerrance\""}, {"rating": 1.0, "review": "I bought this device mostly based on the low price. I'd try it out for $35 and figure out where it fit within my home media setup. To be honest, I'm not really sure of the point of the device. Your quality is much, much higher if you simply use a wired connection. The video buffered constantly.", "verified": true, "helpfulness": "2/4", "author": "Ryan Joy"}, {"rating": 2.0, "review": "Picked one up 1 month ago and aside from setting it up I used it once at set up.For people who have a roku,xbox,ps3,internet blu-ray or any other device they use for netflix and other services this thing will see little use unless you just think its cool to send and control from tablet.The biggest let down for me was you cannot(and no plans to soon)stream anything from your android chrome to this from your phone or tablets,only the chrome browser on desktop chrome which really makes no sense to me.Google has made no effort in adding services or adding a cast from tablet,phone feature and there is not a lot of work in doing this.They really seem to want to lock this down to streaming their content only.Having said that for $35.00 I did get three months free added to my netflix which makes the device less then 15 bucks which is good.All other devices do a lot more and easier and better.No amazon streaming yet either.Google needs to get on the ball and soon or this will fail as quick as it got popular.............Had few months and have used it uh o times.Really if it wasn't for the netflix credit I would have returned it.Nothing major added since its release and news of other apps being added has since faded away.", "verified": false, "helpfulness": "0/1", "author": "mika"}]