[{"rating": 1.0, "review": "I rather prefer 1000000000 times the roku than Chromecast. For the same  price and you can also stream from your cell or tablet to your TV.", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 1.0, "review": "Instructions aren't there and its not working with my tv, and no one I know has one or can explain how to sync it with my tv.....", "verified": true, "helpfulness": "0/0", "author": "Alikins"}, {"rating": 4.0, "review": "great product but you have to learn how to manage always with your computer/cell phone as you don't have a remote control and a menu option on the screen.", "verified": true, "helpfulness": "0/0", "author": "Jeronimo S."}, {"rating": 5.0, "review": "100% satisfied!", "verified": true, "helpfulness": "0/0", "author": "Sergei"}, {"rating": 5.0, "review": "Great gift!", "verified": true, "helpfulness": "0/0", "author": "Logan"}, {"rating": 5.0, "review": "I received one as a gift, and enjoyed it so much I purchased another for the bedroom the next day.  Also I found an app that works as a remote control for the tv.  Using Chromecast is so easy, and works with our smartphones, laptops, and desktop easily.  We use the internet as our TV, people who prefer to browse the TV in traditional TV way might prefer roku with the remote control.  This is great my my household tho!", "verified": true, "helpfulness": "0/0", "author": "Jeanette Pace"}, {"rating": 5.0, "review": "I have tried other devices like this before and this is the best one. I can hook it up to an TV in my house that has an HDMI plug-in and automatically connect through my phone or laptop to use YouTube, Hulu, Netflex, Pandora etc and the list goes on. I watch a lot of tv and so does my family and we also like to use our personal devices as well and this provides a great bridge for them both. It has lasted me well over a year so far.", "verified": true, "helpfulness": "0/0", "author": "B."}, {"rating": 5.0, "review": "awesome very pleased", "verified": true, "helpfulness": "0/0", "author": "Daniel De La Torre"}, {"rating": 3.0, "review": "I was really excited for my Chromcast- it seemed like the cheap, magical solution for me to connect my hdmi-lacking-Macbook to my TV. The reality however wasn't as efficient as I hoped it would be. The whole set up is sloppy. Theres always issues casting when netflix transitions from one episode to another. The extension is always giving me issues saying it can't find the chromecast and asking me to set it up again(even though i've already set it up twice). Also loading times are REALLY long. Frequently I have to force quit chrome and reopen because after 5 minutes video still wouldn't load. Im not sure if these issues are with the device or the support software/extension but either way google needs to put some time and effort into improving the experience. This product is OK. Probably wouldn't recommend it if you have another option. I was disappointed with product performance.", "verified": true, "helpfulness": "0/1", "author": "Amber"}, {"rating": 3.0, "review": "Convenient and neat but been having some problems with streaming of late. Dropped connections and lagging. App could also use a bit of work.", "verified": true, "helpfulness": "0/0", "author": "Lee"}]