[{"rating": 5.0, "review": "I now have two of these on two different TVs in my house.  They were easy to set up and go.  I have used it for Netflix and HBO go so far.Very happy!", "verified": true, "helpfulness": "0/0", "author": "PKSmart"}, {"rating": 4.0, "review": "It works for basic apps. Found the packaging misleading a bit regarding 'fully supports iOS.' It does not, only certain apps. But, if you want that buy Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Leonard"}, {"rating": 5.0, "review": "I always liked the idea of something like the Roku box or Apple TV, but I didn't want yet another box sitting under my TV. I didn't quite see the point of the Chromecast, though, until I used it at a friend's house. I put my cellphone on his wifi network and just like that I could go to YouTube or Netflix and broadcast to his TV without any setup on my part. The fact that it works with Netflix, YouTube, HBO Go, and Pandora (and more) is awesome and it's way easier than going through an Xbox or another media box, at least if you don't have a keyboard hooked up to them. I can even broadcast a tab from Google Chrome. I was so impressed I got one for my mom and my brother. Even my technology challenged mom can use it with ease, and she loves it too. The only negative is that you can't use it at hotels that require a web login to their internet. That's a bummer because it's so tiny it would be great to travel with.", "verified": true, "helpfulness": "0/0", "author": "LadySmarmalade"}, {"rating": 3.0, "review": "I am a total Google fan-boy so I had to buy this when I first heard about it.  I will say that it still needs a lot of room for improvement.There are not many \"apps\" for it.  And the few apps that DO work (see full list here: [...] ) are glitchy and will cause issues.  Also, the phone apps are full of problems.  I have a iPhone 5 and my wife has a galaxy S4 (android) and the app will stop responding randomly.  Mine also randomly turns off for no reason.The key feature for this thing is that you can just send any page on chrome to your television in a click.  This is really cool and great for presentations.  But as a media device, this falls short.But that doesn't mean don't buy this!  Google is great about supporting their products and in due time the Chromecast will be a great tool, but for right now, get a Roku player if you want a media machine.", "verified": true, "helpfulness": "1/1", "author": "Adam A."}, {"rating": 4.0, "review": "I love it, especially for the price. No cables, no wires, take with you anywhere. When it is plugged into the HDMI port of your TV, it can turn on the TV and switch the input to itself when used for display from phone or chrome browser. The only reason I gave it a 4 star is because some apps on my phone still dont take advantage of this & sometimes I can't stop the video playing and switch to something else instantaneously.", "verified": true, "helpfulness": "0/0", "author": "Amber Ansari"}, {"rating": 5.0, "review": "Although I haven't used this much so far, I've really liked the clarity of the picture that I get on my TV when using the Chromecast. I need to spend time discovering the multiple ways in which I can use it other than streaming Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "6 hours into this with Google support, this junk still won't work. 3 days later, it is still useless as the first hour I received this crap. Deleting this, downloading that, manipulating Win7, router, modem and on and on...don't wast your good time on this over-hyped junk. Google must have hired people to give positive reviews on this junk. Good riddance.", "verified": true, "helpfulness": "1/4", "author": "Kota \"Kota\""}, {"rating": 2.0, "review": "I had high hopes I could stream with this device, but it does not work with my windows phone, and was hard to work with my laptop as well.", "verified": true, "helpfulness": "0/0", "author": "Jan Swan"}, {"rating": 4.0, "review": "It really allows me to smoothly transition my chrome views from my laptop to TV. Cool product. I had bought this about 5 months back and have no complaints on this whatsover.", "verified": true, "helpfulness": "0/0", "author": "Siraj Ghosh \"sirajghosh\""}, {"rating": 5.0, "review": "not a cable tv guy. I just watch bits and pieces from around the web so this is great for that.", "verified": true, "helpfulness": "0/0", "author": "Stephen, MPLS"}]