[{"rating": 4.0, "review": "This is really great for the price! Easy to navigate and easy installation!", "verified": true, "helpfulness": "0/0", "author": "Mimi Cheetah"}, {"rating": 5.0, "review": "Did really great,  thinking on getting  another..", "verified": true, "helpfulness": "0/0", "author": "rosanna"}, {"rating": 2.0, "review": "Won't work with my router.", "verified": true, "helpfulness": "1/1", "author": "Jimmie Sullivan"}, {"rating": 5.0, "review": "This is one handy device. You can stream just about anything from your mobile device (computer, phone, tablet) or another computer nearby, which is pretty slick. It's damn near mind-blowing for most of the folks I've shown it to which means I'm getting old and so are my friends or it truly is pretty great. It's the only tech item I'd give as a gift and at $30, it seems like a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "balooohalooo"}, {"rating": 4.0, "review": "Works well with a tablet or a phone. Not as great with a lap top.", "verified": true, "helpfulness": "0/0", "author": "elly ros"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Duyle Campos"}, {"rating": 1.0, "review": "Very difficult to use. I returned it", "verified": true, "helpfulness": "0/0", "author": "Mitch"}, {"rating": 5.0, "review": "works fine, great price", "verified": true, "helpfulness": "0/0", "author": "Dennis Hejduk"}, {"rating": 2.0, "review": "The reason I bought this was because the Amazon Fire Stick wouldn't be available to me in my area until mid February, which was a month ahead during the time I wanted it back in January. After having this thing for some time, I have come to despise it. It is slow and regularly has issues. I DO NOT LIKE IT.", "verified": true, "helpfulness": "0/0", "author": "Shannon Amick"}, {"rating": 4.0, "review": "I use the TMVEL \"HDMI to Composite\" converter here [http://www.amazon.com/gp/product/B0091VF4FA] and it works as it should. Both the chromecast and converter needs external power. So keep it in mind before you buy.Chromecast is a excellent product, especially if you have android phone. There are tons of apps for android. For playing local files saved on android device, use the free ES File Explorer app(works like a charm!)For people with old TVs, note that there are two types of converters (HDMI to Composite and HDMI to Component) Composite has three pins and component has five pins. Composite is enough for most purposes. The price range for these converters are form 20$ to even 100$. The TMVEL converter that I have works very well with my very old TV and it costed me 30$.", "verified": true, "helpfulness": "0/0", "author": "kichuku \"Srikanth Chandrasekaran\""}]