[{"rating": 4.0, "review": "Work,s good .", "verified": true, "helpfulness": "0/0", "author": "rita yarbrough"}, {"rating": 2.0, "review": "It's functional but freezes sometimes", "verified": true, "helpfulness": "0/2", "author": "Kristina Bradshaw"}, {"rating": 3.0, "review": "The unit Is remarkable.  The only thing negative is it is sold without a HDMI cable without which it is not usable.", "verified": true, "helpfulness": "0/0", "author": "Dean Hodgdon"}, {"rating": 3.0, "review": "Plenty of power. Almost returned it when I found that the voice to text feature was restricted to Amazon services only while you have to manually type in everything else. Scrolling through a horizontal alphabet while having a button for voice activation is a bit odd.", "verified": true, "helpfulness": "0/0", "author": "Caleb Johnson"}, {"rating": 5.0, "review": "Good", "verified": false, "helpfulness": "0/0", "author": "jose"}, {"rating": 5.0, "review": "Love it!, Love it!  I got this for my 12 year old granddaughter for Christmas.  It was so easy to hook up and she was using it soon after.  I am a Prime member and there are endless movies, books and games to watch, read and play.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "SMargo"}, {"rating": 5.0, "review": "This is a great addition.  Works better than expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had an Apple TV and I gave it to my children and I bought myself the Amazon fire TV and I like it so much better. I like it that I can order something from Amazon and immediately appears I'm both my TV and in my iPad.", "verified": true, "helpfulness": "0/0", "author": "Gwen I. Baker \"reading continually\""}, {"rating": 5.0, "review": "Great addition to our television watching experience.  Easy to set up and use.  Well worth the $40 extra for the voice controlled remote.", "verified": true, "helpfulness": "0/0", "author": "Barbara Powell"}, {"rating": 5.0, "review": "So far so good. Enjoying the ease of streaming through this though the Netflix app is messed up. I like that when you stream music you can also get lyrics.", "verified": true, "helpfulness": "0/0", "author": "Victoria duda"}]