[{"rating": 4.0, "review": "Easy to set up and easy to use.  Very convenient for travel. Wish you could display pictures from device but awesome for Netflix, YouTube, Hulu, etc...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to install with online instructions that were clear to follow. Set up took a matter of minutes. We use the Chromecast to stream Netlix and we have found that the picture and sound is of a higher quality than when we use our Wii box. You can not beat the price. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Steven A. Maze"}, {"rating": 5.0, "review": "My television and blue ray player both have a wireless connection but I had problems with NetFlix always pausing.  I thought it was my wireless router because my other 2 devices were having trouble with the connection.  Chromecast fixed that problem so now I can enjoy my movies or TV shows from NetFlix without any pausing (other than me pausing it so I can get some hot popcorn)The only thing I don't like is that I can't broadcast my Chrome tabs from my android tablet and/or phone and my desktop is in another room.", "verified": true, "helpfulness": "0/0", "author": "Robert W Apps"}, {"rating": 2.0, "review": "I hooked mine up to the main TV in the house.  It installed easily and worked great.....once!  It's no longer connecting to the network.  I've reset it, unplugged it from the HDMI and power, waited a while and plugged it back in....not working.  Im let down.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "As long as you have a fast stable connection you'll be able to enjoy good video quality streaming. If you are heavily entrenched in the Google ecosystem you'll love this.", "verified": true, "helpfulness": "0/0", "author": "Michael J. \"Mikey\""}, {"rating": 5.0, "review": "I love my Chromecast. I didn't know I'd need it until I started using it. It's the best for showing content to your friends when they come over and watching YouTube series on tv. The support for it is getting better and I can't wait until they have support for Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Nessaka"}, {"rating": 3.0, "review": "Good product, but the product needs more apps.  The capability of the product is not being used in full. Good potential", "verified": true, "helpfulness": "0/0", "author": "GQM"}, {"rating": 5.0, "review": "amazing little device that does exactly what it claims. The set up was easy and the device streaming works perfectly!", "verified": true, "helpfulness": "0/0", "author": "zippy"}, {"rating": 5.0, "review": "We already had Netflix, but our TV's Youtube program no longer functioned.  I really would like to see more functionality down the road.", "verified": true, "helpfulness": "0/0", "author": "Notbushcity"}, {"rating": 5.0, "review": "Easy to set up and works great!  It was very easy to get the chromecast plugged in and streaming netflix.", "verified": true, "helpfulness": "0/0", "author": "Gio Campos"}]