[{"rating": 4.0, "review": "To anyone considering buying this device, be very aware, the Amazon Fire TV does not offer a web browser of any type that I have been able to find.  I have searched every option I could, and nowhere in the store, nor by using voice commands is there any way to find and install a web browser.  Honestly, this was the Main reason I purchased the device, so my mother could watch some of the shows she watches on her android tablet, and even though the app store is supposedly on the Fire TV, try finding a browser, nothing comes up.  Everything else works fine, but what is the point in an android device for your TV that does not have all the features android offers?", "verified": true, "helpfulness": "2/3", "author": "John L. Garza \"gamewiz1\""}, {"rating": 5.0, "review": "Absolutely freakin' love it. If fire TV offered local channels I would cancel my cable in an instant. It offers a little of everything for everyone. I currently own 2 Roku boxes at different locations in my home and I can tell you, Fire TV is superior in navigation, layout and performance. And the price is a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "B. Huff"}, {"rating": 2.0, "review": "Great idea if it worked all of the time.  I barely get through 20 min of video before the thing errors out and tells me no network connection.  I've tried wired and wireless doesn't matter still glitches out.  Meanwhile I'm watching a YouTube video just fine on my mobile phone on the same network and my kids are playing online games in the other room. Terrible I how they fix it I'd really like to use it.", "verified": true, "helpfulness": "1/2", "author": "Fozzie"}, {"rating": 4.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Robert F."}, {"rating": 5.0, "review": "Slickest interface for watching internet TV (Amazon, Netfix, Crackle, etc) BAR NONE. Before this the PS3 was king (some might argue it STILL is, as it is available at the same price point and offers better games) Very glad I got it.", "verified": true, "helpfulness": "0/0", "author": "SactoGuy \"FrankM\""}, {"rating": 1.0, "review": "If you have digital tv (cable) ??why?? you have to pay for everything - emphasis on everything...it is ridiculous. Every show on cable, every movie! Why would one need another apparatus to view Netflix or other streaming service?It made absolutely no sense to me. It would be great if Amazon would describe the service they somewhere, however, I could not find it anywhere and neither could my friends.You will be charged for shipping the item back, even though I bought the 30 day 'free' trial - about $6-7.Was not happy at all with this purchase!", "verified": true, "helpfulness": "2/6", "author": "Richard Lara"}, {"rating": 2.0, "review": "If the remote hadn't died in the first week this would have been awesome. Guess I will have to buy a new remote for this. I honestly regret getting this now when at first I was excited. I emailed Amazon with the troubleshooting I did and I received a response saying to call them to troubleshoot it. If I cannot be helped through the email section and I am going to be asked to repeat steps I already took then get rid of your email option and don't waste our time. I work in Information Systems for a living and have to do a lot of work with the Help Desk and this wouldn't fly at my company. I buy a ton through Amazon and this kind of soured me since it is their product. Accidents happen and defects will be found but at least have decent customer service to resolve it. I am sure a lot of people have good things to say about it and I just got a bad apple. But that is my two cents. I have the Chromecast and Roku (An original Roku) and they both still work fine. If you already have a streaming device don't put yourself through the headache like I did.", "verified": true, "helpfulness": "1/1", "author": "Charles Lawry-Martinez \"Virtus Junxit Mors Non Separabit\""}, {"rating": 3.0, "review": "Amazon charged me $9.95 shipping when I returned my Firebox due to bad user experience.I have returned Firebox TV because of the limited Game selection and games section is lacking badly. In addition, no enough space to install game on Firebox TV. For gamers look somewhere else.", "verified": true, "helpfulness": "0/3", "author": "F. Saleem \"Salem\""}, {"rating": 5.0, "review": "Still expanding their Apps, love the voice search.", "verified": true, "helpfulness": "0/0", "author": "Wayne Nicklin"}, {"rating": 5.0, "review": "Love myAmazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Maxine P."}]