[{"rating": 5.0, "review": "I went into my Chromecast purchase not expecting much and ended up being completely in love with how easy to use and well functioning this thing is. Ask my friends and family, I cannot shut up about how cool and easy the Chromecast is. I have sold people on them at Best Buy because they overheard me telling someone how easy and versatile this is. At the price they make great gifts and very easily make old not-so-smart TV look snappy and intelligent. The Google commercials for this are crap and don't do it justice. Easily stream YouTube videos, Netflix, Hulu and Google Movies to your TV with this. No special versions of these video apps required. If you have the latest version of the Youtube app, you can already use Chromecast. Even if your using an iPhone. If someone is on the same wifi as your Chromecast, they can cast to it. No complicated setup, no password hassles, just awesome video casting. I have used this so many times hanging out with friends and family to watch video after video on Youtube. Chromecast even goes home with me on the holidays and was the highlight of my teenaged sister-in-law's slumber party as the girls sat around taking turns casting goofy videos from the devices they usually have their noses buried in.In short, just buy it.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 3.0, "review": "This is a really great product! All the reviews are true and this is one of the greatest recreational investments I've made so far this year, however, they weren't kidding when they spoke about the glitches and kinks. If you're on a college campus, and have no choice but to use campus WiFi, you're going to run into some serious problems because of security network protocols. There's a looooong explanation I was given by the Google customer care rep, and since I'm not a techie, I'd have difficulty re-explaining it, but long story-short: You would have to go to your school's IT department and have them set up a DMZ host on your computer so that your computer can be the source of your WiFi connection to Chromecast. It's a very tedious process, so I wouldn't recommend buying it until Google irons out those kinks. However, if you plan to use it at home, everything should be fine and it should work really well for you!", "verified": true, "helpfulness": "0/0", "author": "Brittany-Marie Aarons"}, {"rating": 1.0, "review": "i had to call google to set it up which took an hour only to find out that there are serious issues associated with streaming from a windows 8 laptop.", "verified": true, "helpfulness": "1/1", "author": "Einat Ronen"}, {"rating": 5.0, "review": "This works really well and was extremely easy to set up. The chromecast is quick and works from almost any device that I have!", "verified": true, "helpfulness": "0/0", "author": "Daniel P"}, {"rating": 2.0, "review": "When it worked, it was fine - i could never get it to project higher than 480p without lag. Then it stopped working - i had to unplug and replug quite a few times each time i want to use it.", "verified": true, "helpfulness": "0/0", "author": "CostBenefitAnalysis"}, {"rating": 4.0, "review": "This device is small and connects to an HDMI port on your TV. You then use your smartphone or laptop to send videos or other media to your TV. It works pretty well, and has a great feature that allows you to mirror a specific tab from your Chrome browser on your TV.Watching YouTube via your phone works really well. The best part is that you can add videos to a playlist, and you can browse for other videos while the current one is playing. Also, the Chromecast loads and streams the video itself, saving your phone from using up extra battery.There are still not too many apps for this device, but it definitely has a lot of potential.", "verified": false, "helpfulness": "0/0", "author": "R. Toro \"Tech Junkie\""}, {"rating": 1.0, "review": "What a rip-off.  The description on Amazon says it will stream HBO GO and it only gets YouTube and Netflix.  My Sony Bravia does that without any additions.  It sounds as if this product is destroying itself as it creates more and more limitations over time with restrictive updates.", "verified": true, "helpfulness": "1/2", "author": "Seattle Shopper"}, {"rating": 1.0, "review": "I had high hoes for this product when I bought it, but it proved to be a big disappointment. First, the setup was difficult and tedious. The chromecast had trouble connecting to my wifi, and when it did, it had to perform an update. However, it was stuck on 0% of the update. Only after multiple resets and network fixes did I manage to connect it. The software was hard to use, and spent almost an hour connecting to my chromecast. When I went to stream with the chrome browser extension, the video was pixelated, laggy, and out of sync with audio. This doesn't make sense to me, as I have a Netgear Nighthawk router with the latest firmware and a 50mbps down/25 mbps up connection, with only 4 devices on the network. Also, the chromcast runs extremely hot. Overall, I would not recommend this product, and would advise people to stick with a good old HDMI cable and adapter instead.", "verified": false, "helpfulness": "2/2", "author": "lllllIIIII"}, {"rating": 4.0, "review": "Pro'sStreams netflix from my phone or laptop effortlesslyStream from device, able to continue to use device as normalCon'sStreaming from the chrome browser is slowWatch ESPN is not a supported appSome routers may not be compatible", "verified": true, "helpfulness": "0/0", "author": "Joseph Meyer"}, {"rating": 3.0, "review": "I would like to watch more  ( free).All  so,  I hope YouTube in HD.However, thankyou very much. You make my life better!  I like you.", "verified": true, "helpfulness": "0/0", "author": "samhe"}]