[{"rating": 5.0, "review": "I love my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Ignign0kt"}, {"rating": 2.0, "review": "The chromecast is easy to use. Unfortunately, the speed is so slow that I can't really see the movies on my 60'' samsung TV.Sits on my desk for almost 2 years", "verified": true, "helpfulness": "0/0", "author": "Sfhehe"}, {"rating": 2.0, "review": "Find it almost unusable as the stream keeps \"buffering.\"  I doubt it's my wireless LAN, as my Apple TV works fine...", "verified": true, "helpfulness": "0/0", "author": "Tien Shiah"}, {"rating": 5.0, "review": "It's a must have especially if you don't own a smart TV that's WiFi enabled.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "This is my favorite gadget which i own now. It really changed the way how i see TV.", "verified": true, "helpfulness": "0/0", "author": "Kishan K"}, {"rating": 3.0, "review": "It works OKAY, but I think it needs an interface to better control it. It works actively, but not passively. For example, you launch Netflix, choose your movie, click play, and then click on the little icon to pass it to Chromecast. I can pause and rewind on the PC, but most of the time, I cannot pause or rewind the Chromecast. If there was an interface that had better control over the \"casting\", it would be fantastic.", "verified": true, "helpfulness": "0/0", "author": "A. Gift For You"}, {"rating": 5.0, "review": "Excelente!!!!!", "verified": true, "helpfulness": "0/0", "author": "juan jose"}, {"rating": 3.0, "review": "ok as a fixed device on your fast home network.  a pain to setup when moving TV's.  glitch and slow at times.  couldn't get it to work on hotel network due to 'terms and accept' on login.", "verified": true, "helpfulness": "0/0", "author": "dieter"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Josue"}, {"rating": 2.0, "review": "I'm disappointed.  I have a Samsung Galaxy Tab Pro 12.2 and it's extremely slow trying to push content to the Chromecast.  My Chromecast is about 3' from my wireless router.  Many apps (like VLC) don't even support it.", "verified": true, "helpfulness": "0/0", "author": "Gary Quiring"}]