[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Rainer DePontbriand"}, {"rating": 2.0, "review": "The only thing that seems to work well, with any consistency, is Amazon Prime video. Good luck trying to enjoy Netflix or Hulu.", "verified": true, "helpfulness": "0/1", "author": "Scott"}, {"rating": 5.0, "review": "The kids seem to like it. It was delivered same day I ordered it on a Sunday even. That was exciting!", "verified": true, "helpfulness": "0/0", "author": "Jiana R."}, {"rating": 5.0, "review": "I simply love it. I have one for the kids and one for my living room and I can't think of anything that I don't like about the Fire TV. It has been the only device that I've owned that after a short tutorial was simply plug and play.", "verified": true, "helpfulness": "0/0", "author": "Julius"}, {"rating": 5.0, "review": "Fire TV is a huge improvement over other devices for accessing Amazon video content!  Menus are well designed, searching is easy and the device responds smoothly & quickly.  Movies start playing almost instantly without any buffering issues.  Although the unit doesn't have the overall high quality look & feel as Apple TV, it performs well and I'm happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "SJDiv"}, {"rating": 5.0, "review": "Great device, small yet powerful, slick interface, has all the apps and subscriptions I want, and inexpensive to boot. Couldn't be happier with my purchase! It would be nice if the next generation supported 802.11ac, but it's been running great on 5GHz 802.11n.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is sweet. No problems, runs quickly, easy to use and navigate. Streams videos (Amazon Prime in this case) flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Anthony Olivieri"}, {"rating": 4.0, "review": "Buy it as a gift", "verified": true, "helpfulness": "0/1", "author": "sovannasvay"}, {"rating": 5.0, "review": "one word: awesome.  The interface is incredibly user friendly and intuitive.  well done Amazon", "verified": true, "helpfulness": "0/0", "author": "UMCPTERP"}, {"rating": 5.0, "review": "Love it. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]