[{"rating": 5.0, "review": "Chromecaset works so well we pretty much stopped using our apple tv. chrome cast allows any device to cast to your tv so theres no more hunting up the remote, always have a phone or iPad close by and it doesn't drain the battery on the device that you cast from.other pulses are, the hdmi is automatically labeled \"chrome cast\" and along as the tvs on it will automatically switch to the right hdmi.", "verified": true, "helpfulness": "0/0", "author": "Mike C"}, {"rating": 5.0, "review": "One of my favorite gifts to get for any of my tech friends.  Amazing price, awesome value.  Did I mention it's incredibly useful?  Yeah, it's that too.", "verified": false, "helpfulness": "0/0", "author": "Hyper Vision"}, {"rating": 2.0, "review": "This is typically a thing where you have to read the fine print. It does exactly what it says. It transmits anything you have in your Chrome Browser. If you want to show your slide show on an overhead projector, you will have to publish it first as pictures on a web site. Which than can be showed on the projector. And \"I'm sorry\" that's all it does.", "verified": true, "helpfulness": "2/2", "author": "Martinus Meiborg"}, {"rating": 5.0, "review": "I love it, I can watch my movies , watch YouTube videos while I do my hair just using my cell phone wow I just love it, and the kids like it so much..", "verified": false, "helpfulness": "0/0", "author": "Ruth Acevedo"}, {"rating": 5.0, "review": "Wow. Turns my non-smart TV into a Smart TV. Whether i want to cast photos, video's or movies.  It does the job.  Very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Elson"}, {"rating": 4.0, "review": "Great gadget, its a shame Google wont come forward with an application of their own, so users can stream their content to the Chromecast key (music, movies, home made videos) they would really be ahead of everyone else if they did.", "verified": true, "helpfulness": "0/0", "author": "Victor C."}, {"rating": 5.0, "review": "Works well if you have a windows 7 or above or I pad but will not work on a guest network has to be on the main router", "verified": false, "helpfulness": "0/0", "author": "Greg Goins"}, {"rating": 1.0, "review": "You have to download an app for everything! This should simply mirror your phone or computer. Setup was easy but now have 12 more apps to deal with", "verified": true, "helpfulness": "1/3", "author": "Matt Missel"}, {"rating": 5.0, "review": "I love it and use it every day.For $35 worth every cent.It couldn't be easy to use; from the TV intallation to the setup", "verified": true, "helpfulness": "0/0", "author": "Juan Pablo"}, {"rating": 3.0, "review": "I must just not know how to work this thing.  I have read and watched tutorials on how to make it work and it just doesn't.", "verified": true, "helpfulness": "0/0", "author": "HM"}]