[{"rating": 5.0, "review": "It was what I expected, wanted and it arrived on time. watched a few movies with it works best with a fast wy-fi and internet connection. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "GABRIEL MARTINEZ"}, {"rating": 3.0, "review": "Great idea - but it doesn't always work well.  It might be us but we'll be watching something and all of a sudden it will stop broadcasting it on the large screen.....kinda bummed.", "verified": true, "helpfulness": "0/0", "author": "David Lehman"}, {"rating": 5.0, "review": "I like that i can cast right to the television without pausing the picture is amazing and  i can still work on my computer at the same time. I didn't like the fact that when i used my tablet it took forever to load movies but you tube would load fairly quickly.", "verified": true, "helpfulness": "0/0", "author": "shirley"}, {"rating": 5.0, "review": "Would recommend this to anybody who uses services such as netflix.  Easy and fast to setup.  It's a no brainer....", "verified": true, "helpfulness": "0/0", "author": "Fidel S. Serrano"}, {"rating": 4.0, "review": "I enjoy this product and it was very reasonably priced and easy to hook up. It does not work with all media, which is a problem, but that is ok.", "verified": true, "helpfulness": "0/0", "author": "Trish Munsell"}, {"rating": 5.0, "review": "I can use either my iPhone or iPad to watch Netflix, youtube, Amazon Prime and HBO Go on my television.  Easy set-up!  Edited to add that chrome cast does not work with Amazon instant videos.", "verified": true, "helpfulness": "0/0", "author": "auntnancy"}, {"rating": 5.0, "review": "chorme is so far so good for me. Never has a problem. This item is great. I  am very satisfied to buy this.", "verified": true, "helpfulness": "0/0", "author": "shaminder saini"}, {"rating": 4.0, "review": "Good product but limited to only a few things would be great if i could surf the web with it", "verified": true, "helpfulness": "0/0", "author": "Robin Campbell"}, {"rating": 4.0, "review": "If a Roku 3 is a bit much for you, and you don't have another method of streaming to your tv, then a Chromecast is a great, inexpensive alternative.Pros:Low profileOnce paired, reacts fairly reliablyFast streaming capability (I can watch HD movies just fine, so it is capable of at least that)Cons:A bit finicky. What I mean is that I occasionally have to just reset the device and connect it to my wireless network again. It fairly often doesn't show up when I first scan for devices in my chromecast app (same across all our devices: Kindle, Android phone, and Apple phone).Limited in terms of services available: Cannot stream your own media. Has to be through a sometimes poorly supported app (off the top of my head, it supports Youtube, Netflix, HuluPlus, and Crackle)Overall, great for 30 bucks, and a nice novelty to be able to sort of easily control the device through your phone/tablet.", "verified": true, "helpfulness": "1/1", "author": "Nathan"}, {"rating": 5.0, "review": "Such a great investment! Saved so much by canceling my cable subscription. And it works great! I really am glad I ordered this", "verified": true, "helpfulness": "0/0", "author": "Susana"}]