[{"rating": 5.0, "review": "Great I love it", "verified": true, "helpfulness": "0/0", "author": "DENISE W. PARRAM"}, {"rating": 5.0, "review": "It work's great for streaming NetFlicks if you have a good internet connection.  I haven't tried  streaming movies from tablet to TV because the TV has a USB port.", "verified": true, "helpfulness": "0/0", "author": "Grumpy"}, {"rating": 1.0, "review": "Thought this was going to be a great buy for my parents to be able to watch Netflix and hulu, but I really feel like I just wasted $35 on a piece of plastic. Despite being about ten feet from the router it's very laggy to the point where you don't want to watch anything on it. Not sure what else there is to say about it. I'm wondering why it's scored so high when it doesn't work well.", "verified": true, "helpfulness": "0/0", "author": "Robert B."}, {"rating": 3.0, "review": "gduhh", "verified": false, "helpfulness": "0/0", "author": "Michael Voss"}, {"rating": 1.0, "review": "When I bought the product it logged me out of all my accounts (HBO, Starz etc) and said that I was not subscribed to those services anymore.. This was a problem with the Chromecast not my accounts as when i returned it my accounts went back to normal", "verified": false, "helpfulness": "0/3", "author": "Aaron Mains"}, {"rating": 2.0, "review": "It is great when it actually works. I have it plugged into my tv at all times, but when I switch to it via input, it is a complete gamble if it will work or not. It appears on my tv screen that everything should connect, but when I try via phone or computer to play a movie through Netflix, there is no communication between devices and according to the chrome cast app, no device is found even though they are connected to the same wifi. It is completely frustrating. I will attempt again a few days later and it will work fine. No consistency and no change in wireless signals. It does rotate beautiful pictures on the screen while I curse technology and how it rarely works when you want it to.", "verified": false, "helpfulness": "0/0", "author": "Louise"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/1", "author": "D. Andrew Millett"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "lewis mauldin"}, {"rating": 5.0, "review": "Love it works so good bought more as a gift", "verified": true, "helpfulness": "0/1", "author": "Frank"}, {"rating": 4.0, "review": "Easy to set up and use. Good.", "verified": true, "helpfulness": "0/1", "author": "Ivy Du"}]