[{"rating": 5.0, "review": "Too easy to be true. No instruction needed, just followed the picture, plugged the device in, download the app, changed the source on TV. Bingo!", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 4.0, "review": "Good initial product from Google. The set up is a bit clumsy and took a few tries to get it going. netflix subscription that came with it was a very good bonus. Casting is simple. Being able to push Youtube is also great. Also like the fact that once the casting starts you are free to do whatever you want on the computer. I would have rated it a 5 if I could push more content (pictures, movies from my computer) and the setup was a bit easier.", "verified": true, "helpfulness": "0/0", "author": "Aalookaaparantha"}, {"rating": 1.0, "review": "I bought it, it arrived, I followed the instructions, the wheel depicting installation began turning but nothing happened.  I repeated this until it was obvious I would never get it installed.  I figured I could do better if I got a gmail address.  No matter how I tried I could not accomplish this.  It refused every attempt.  Since there is absolutely no way to contact Google I am stuck with something I cannot instal and that I reasonable no longer want.  What can I do?  Yes, it is only $35.00 but I hate being treated this way!l.", "verified": true, "helpfulness": "2/4", "author": "Flint Lock \"Flint Lock\""}, {"rating": 5.0, "review": "It was easy to connect up, download the app and register my android phone as a controller. Once that's done, the YouTube app has a Chromecast icon at the screen top which becomes active when you have selected a video and started it playing (the Chromecast app is only for setup, so it's not running with YouTube app). The first time (each session) you have to wait for the video to actually start playing on your phone (pc, whatever) before clicking the icon on the YouTube screen, but succeeding videos in the same session automatically chromecast to the tv. In other words, when the first video finishes or you pause, etc, you can just use the YouTube app as normal and find another video to play, start it playing, then just watch on the tv. The phone and app are only in the loop when you decide to pause or whatever. Otherwise the Chromecast works directly thru the wi-fi.I'm not presently a Netflix subscriber and didn't start a free month just to see it play, but if the YouTube experience is an indication, it should work fine.The quality of the picture will depend on your broadband connection including how well your wi-fi works. I have DSL 8-10 mi from the rural phone center and wi-fi router that is very recent and uses two channels (different carrier frequencies) of wi-fi.Before getting the Chromecast I used Chrome and Firefox on my fast laptop to stream some YouTube and some Amazon movies and another device to send it from pc to tv. That method sometimes had some speed problems and pauses would occur now and then. I think it was dependent on the day and time (broadband competition) and probably going thru my pc and browser were slowing things. I haven't yet tried the Chromecast in the evening when the DSL usually gets busy. I'll update this review if it hiccups. So far it's very good.", "verified": true, "helpfulness": "0/0", "author": "Chris Foran"}, {"rating": 1.0, "review": "Google has intentionally killed the ability to play your own files. There are p.i.t.a. workarounds that will work for some files types with some audio (and even that has audio sync issues) at reduced resolution, and only through a chrome browser, but that is completely unacceptable. This is a device that is only used for Google approved content (aka you can't play your home movies). It's a shame, this was a potentially great product crippled by greed, if mine doesn't sell on ebay, I'll be returning it.Need a device to watch Netflix on? Then go ahead and get this, otherwise take a pass", "verified": true, "helpfulness": "1/3", "author": "Chiguy"}, {"rating": 5.0, "review": "Works great with YouTube and Netflix...can't wait for what is to come as far as additional partnerships!  Streaming from Google Chrome is not entirely smooth.", "verified": true, "helpfulness": "0/0", "author": "liz"}, {"rating": 2.0, "review": "A quick,review of the new google Chromecast device.  It has a very  limited capability with the iPad,  Essentially it will interface with Netflix, YouTube  and a couple of google apps.  However, the casting will NOT work at all with Chrome from your iPad.  It gives you a very definite error message, to the affect,  this device, \"if we have any say about it at all\" will NEVER work with Chromecast!!!!  You get the idea.  However,  it will work with you lap top and potentially, although I can not vouch for it, non iPads,  smart phones and maybe some other devices.The laptop using Google Chrome and an add on for casting works, surprisingly well, what you see on your computer, anything , can be cast to the tv screen.  However, there is a one second lag, between audio and video.  So don't count on watching Hulu or other video products other than YouTube and Netflix with out bad lip syncing.  Looking at your Facebook picture file on a 60 inch is quite nice.So if you thought as I did there would be some compatibility between your iPad and the device,  that's not in the cards.  But using your lap top or non Apple  product you might have more luck.Was it a good 35 dollar investment.  Perhaps, but it could be so much better.  I guess we just  have to wait and see.", "verified": true, "helpfulness": "1/1", "author": "eagle2352"}, {"rating": 5.0, "review": "Works as promised easy set-up could have more streaming partners with that said, all and all really good product. Planning on buying a second.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 2.0, "review": "I had high hopes for this device but resigned to the fact that its nowhere close to what I was looking for.1) It does not support 5Ghz N-network therefore I would have to switch between networks on my devices to get to it. (AppleTV supports it)2) There is a mini-USB input to connect it to power sticking out from the back.  Apparently its not capable of powering from HDMI port on latest TVs.3) Only supports 2 applications  (AppleTV has far more)4) No remote (All other streaming devices do)", "verified": true, "helpfulness": "0/0", "author": "Vadim Gekhman \"VG\""}, {"rating": 1.0, "review": "If I could give 0 stars I would. It wasn't compatible with my tv and couldn't  play Netflix. I returned it but lost a shipping and restocking fee. Also it was almost $  90.00 not $35.00", "verified": true, "helpfulness": "1/7", "author": "lynda magill"}]