[{"rating": 1.0, "review": "Wow, what a nightmare...Pro'sGood looking deviceeasy to setupgood quality pictureCon'sKids free-time did not workSupport Transfer nightmaresReturn policy not like other amazon purchases.The story:The one star is not so much for the product that was in my case not working as expected but for the terrible customer service received... I know! Amazon bad customer service?!I purchased this device for the kids free time which simply would not work on this device. It would work on the Kindle fire so I knew it was not an account issue.Day-1: I engaged the chat support who asked me the usual questions transferred me to another department and then they asked me the usual questions transferred me to another department that asked me the usual questions transferred me to another department... and on it went for an hour. I quit and walked away.Day-2: The same as day one except this time it was a grueling 2 HOURS of transfers to and from the same departments, Sometimes the guys would insist on the factory reset register it all try something else blah blah and then without a word: TRANFER again. some would ask questions for 15 min and at then go \"so, what is not working ?\" My blood was boiling now. I went over to the phone support, much nicer demeanor but the same question and a few more transfers. They placed a case for the tech guys.Day-3: questions but no progressDay- 4: Call-1:  questions no progress.I decide that life is too short and call them back and tell them to replace it for one last try or if that going to take more than 5 minuted to arrange to just refund... nope \"we must run through the tests first....!!!!another hour and now i am getting turrets syndrome. and have to leave the call when the agent askes \"what product is this for again? 15 minutes and you didn't even know what we are talking about?!?! I have to leave this call before I start dropping F bombs on you.Call-2: Amazon representative:  \"I don't have that name on the account are you pronouncing your name correctly?\" Hmm let me see... goodbye.Call-3: finally get through to some one customer service guy that reads my new found fury and does not transfer me, 15 min in he arranges for a replacement unit with special case expedited 2 day shipping ( whoopy doo! i get 2 day delivery by default with prime). Should get that unti today so we will if that FINALY fixes the issue and if not I can finally get a refund and be done with this madness.", "verified": true, "helpfulness": "13/14", "author": "FireFly"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Michael Oster"}, {"rating": 4.0, "review": "Bought this item primarily to work with PLEX.  I am very happy with it.  The only issue that i have ran into so far is that i have replaced the batteries in the remote 3 times now and i have only owned the unit for 1 week.  That is just crazy.  The device is easy to use and has a great menu to it.  I have read negatives and the postitives to this unit and i am saying  believe the positives.  It is a great system.  Just fix the battery issue on the remotes.", "verified": true, "helpfulness": "0/0", "author": "Troy W. Cailteux"}, {"rating": 4.0, "review": "the fire tv works awesome, the video quality is excellent. I would like rate 4 star because at the beginning Netflix can't be installed, there is no support or instruction on how to fix it, wasted lots of my time. Several hours later, system software was prompted to be updated, then Netflix installation problem was solved.", "verified": true, "helpfulness": "0/0", "author": "CLIFF"}, {"rating": 5.0, "review": "Really like the voice-recognition feature. Everything seems much speedier and it completely replaced everything I had been using my Roku 3 for.", "verified": true, "helpfulness": "0/0", "author": "Leah Bresette \"Leah\""}, {"rating": 4.0, "review": "I really like the Amazon Fire TV box. It's definitely more geared towards Amazon prime users than the Roku or Apple TV, as the front page is all amazon prime movies and TV shows which I do not subscribe to but I can still stream almost everything I had hoped to; Netflix, Hulu plus, YouTube, some music apps like Pandora and Spotify, and other channels I didn't expect like History channel and A&E.; You can also watch any movies or TV shows you rent or buy through Amazon instant video but the one app I was hoping they would have is FX Now app to watch FX episodes. We had that app on our Xbox and would've loved to have it on here too as we like to watch new episodes of American Horror Story :(This, plus the overload of Amazon prime stuff is the reason it only got 4 stars, otherwise it's amazing and I love it! The sleek little black box and remote is a plus too, it doesn't look as tacky as the purple plastic Roku, very nice touch!", "verified": true, "helpfulness": "0/0", "author": "Paige Clark"}, {"rating": 2.0, "review": "Device worked great just did not offer enough free channel's.", "verified": true, "helpfulness": "0/3", "author": "Eddie Bates"}, {"rating": 5.0, "review": "Brilliant", "verified": true, "helpfulness": "0/0", "author": "Zhoobin Heidari Bateni"}, {"rating": 4.0, "review": "Great device, wish it had Google Play Services however since I'd have access to my purchases already made on non Amazon products.", "verified": true, "helpfulness": "0/0", "author": "Carlos Martinez"}, {"rating": 3.0, "review": "Requires reboot every few weeks, otherwise it looses Internet connection.  For the same price, Apple TV or Roku is better", "verified": true, "helpfulness": "0/2", "author": "Amazon Shopper"}]