[{"rating": 5.0, "review": "Great product and very responsive and fast. Much better than Apple Tv.", "verified": true, "helpfulness": "0/0", "author": "Reza Molavi"}, {"rating": 5.0, "review": "Great way to get access to tons of various entertainment media.", "verified": true, "helpfulness": "0/0", "author": "J. Lott"}, {"rating": 3.0, "review": "Unit is very good for streaming, but seriously.....this is the WORST REMOTE EVER !  Double clicks when it feels like it, way too sensitive to touch.", "verified": true, "helpfulness": "1/2", "author": "James Hawkins"}, {"rating": 5.0, "review": "I have an old roku1, wd live and I feel this thing is way better than the two player I got.  This refurbish looks brand new with packaging and original tape sealed.", "verified": true, "helpfulness": "0/1", "author": "Salvador"}, {"rating": 4.0, "review": "have so many things i can watch now", "verified": true, "helpfulness": "0/0", "author": "Pat Langford"}, {"rating": 5.0, "review": "Set up quickly and is user friendly. Voice activated search works great. Good deal.", "verified": true, "helpfulness": "0/0", "author": "Brian Smith"}, {"rating": 4.0, "review": "It works great, easy to use and streams well. The only problem that I had was to change my pandora Password and the realization that there was a charge for broadcast television.", "verified": true, "helpfulness": "0/0", "author": "RAYMOND ANDREWS"}, {"rating": 4.0, "review": "So far so good. Although Disney jr app never works boo!  Love the movies available with the prime membership and the photo storage.", "verified": true, "helpfulness": "0/0", "author": "michael miranda"}, {"rating": 5.0, "review": "Love it. Easy and plenty of choices.", "verified": true, "helpfulness": "0/0", "author": "Jarka"}, {"rating": 5.0, "review": "The set arrived when it was supposed to arrive and was well packed. Setup was easy and linking to my WiFi went without any hassles. I've been using the Fire TV box for a few weeks and have not experiencing any issues or problems. Remote works well and we're impressed with the voice recognition feature.", "verified": true, "helpfulness": "0/0", "author": "W. Lackner"}]