[{"rating": 2.0, "review": "If this was a Windows Media Player 'extender' I would buy it in a heartbeat.Since I have multiple tuners and full DVR service working in my computer via Windows Media Player,my non-computer connected TVs need a box that is a Windows Media Center extender.", "verified": false, "helpfulness": "1/4", "author": "FlipFerrari"}, {"rating": 5.0, "review": "Works like a charm! Easy to set up and connected to Wi-Fi in just a few seconds.", "verified": true, "helpfulness": "0/0", "author": "Gail M. Upchurch"}, {"rating": 4.0, "review": "Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "A. Barger \"Wonka\""}, {"rating": 5.0, "review": "I think it,s GREAT! easy set up too.!", "verified": true, "helpfulness": "0/1", "author": "H S"}, {"rating": 5.0, "review": "Awesome product. Voice search works great for Amazon content. Tons of prime video available. And, it plays other apps like Netflix a million times better than the smart bluray player we had been using.", "verified": true, "helpfulness": "0/0", "author": "Gregory W."}, {"rating": 5.0, "review": "I set up the Fire TV by myself pretty quickly.  We can watch our usual Netflix movies and TV shows through our Netflix account, yet also now have access through the Fire TV device to the Amazon Prime offerings in video, audio, and gaming.  I didn't even have to log in to set up the Fire TV device as it was already linked to my Amazon Prime account.  This device also allows uploading and viewing of photos.  And it has voice recognition as well.  We also have a Roku device yet the Amazon device has those additional options.  Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "LisaLisa \"kldckldc\""}, {"rating": 4.0, "review": "Amazing device that I got imported to Ireland! Though Amazon Fire Kindle certainly wasn't the best tablet out there this Fire TV is without a doubt the best streaming device on the market and by rooting it and installing XBMC it makes for one amazing all round device that satisfies all your streaming needs. I returned the limited and very laggy Roku for this device which has no lag whatsoever like most of these streaming devices.It only loses a star for the fact that for those of us who don't use Amazon Prime (I certainly don't as I'm from Ireland)you find yourself swimming through oceans of Amazon Prime focused content in order to find the apps you want. Another is the absurd decision to not allow 3rd party ADB installed apps to appear on the home screen. This forced me to install a 3rd party launcher called FiredTV which gives it the appearance of a Roku interface where all the apps are in nice big columns. Another of cuse is that the great voice search is limited to Prime and won't search Netflix or Hulu Plus. The apps, in comparison to the Kindle Fire or Roku are also quite limited and forces you to make use of ADB. It also has 'install unknown apps' blocked so that sideloading apps like EWTN that you'll find officially on the Kindle is prevented (By rooting it I was able to access the system script and enable it by turn it from 0 to 1. So at the moment Amazon has prevented it from reaching nearly half of its full potential, forcing many of us to root it in order to do what Amazon should have done to begin with.Another thing is it has very little storage and badly needs SD expandable memory in the next generation if it wasn't to be taken seriously as a games unit.", "verified": true, "helpfulness": "3/3", "author": "Chris"}, {"rating": 5.0, "review": "This is the best streaming device I have ever owned. Other devices take forever to buffer. This one does not.", "verified": false, "helpfulness": "1/1", "author": "Kenneth Jamison"}, {"rating": 4.0, "review": "It's a great player. The streaming is fast and the processor is quick. This is one of the best voice searches that I've used and didn't make any mistakes while I was using it. It's nice and compact so you can put it almost anywhere. The only thing I don't like is that you can't turn it off. It goes into sleep mode. You have to actually unplug it from the wall to turn the power off to the device. Other than that it's a great product.", "verified": true, "helpfulness": "1/1", "author": "Greg Conley"}, {"rating": 3.0, "review": "I don't own it yet...but I love the headphones option on the Roku. I can watch my movies at night without waking up my wife !", "verified": false, "helpfulness": "1/7", "author": "Amazon Customer"}]