[{"rating": 5.0, "review": "I love it. Mirroring works great as well as streaming netflix and youtube.", "verified": true, "helpfulness": "0/0", "author": "Ali Kasmani"}, {"rating": 5.0, "review": "Okay, this is slick. Maybe not so much for the Android-sphere yet, but that will come. This little guy is, after all, the 800 pound gorilla in the room. Now if AMAZON PRIME INSTANT VIDEO WILL GET ONBOARD WITH AN ANDROID APP... hint, hint. Come on guys, you know it's futile to resist and in the long run you stand to make a ton of money. TON OF MONEY. You know I'm right about this. I can cast from my PC (BTW, thank you, Amazon), but I'd really like to do it from my cell phone and tablet. Convenience is everything. And I know the folks at Amazon will agree with that!", "verified": true, "helpfulness": "1/1", "author": "Arthur C. Cox"}, {"rating": 5.0, "review": "Excellent quality", "verified": true, "helpfulness": "0/0", "author": "BP"}, {"rating": 4.0, "review": "Color issues. Works great otherwise.", "verified": true, "helpfulness": "0/0", "author": "Christopher Ciavarella"}, {"rating": 5.0, "review": "Completely changing my tv viewing habits. Good by premium cable.", "verified": true, "helpfulness": "0/0", "author": "David Kieffer"}, {"rating": 5.0, "review": "Muy buen producto y buen tiempo de entrega", "verified": true, "helpfulness": "1/1", "author": "Juan H"}, {"rating": 5.0, "review": "works as advertised", "verified": true, "helpfulness": "1/1", "author": "pedro moncada"}, {"rating": 1.0, "review": "Does not work with apple products", "verified": true, "helpfulness": "0/2", "author": "F. Braun"}, {"rating": 5.0, "review": "I wrote a review for the keyboard by mistake this is what was for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Carol J. Dunninggs \"To God Be The Glory\""}, {"rating": 2.0, "review": "If you want to use it as a Netflix machine, it works perfectly fine. If you want to use it as a Youtube browser, it's perfectly adequate. If you want to use it to extend your Chrome browsing to your TV, this is terrible. I know it's a \"BETA\" feature or whatever, but it simply does not work enough to ever use that way. Extremely frustrating.", "verified": true, "helpfulness": "0/0", "author": "Myles Handley"}]