[{"rating": 2.0, "review": "not enough newer movies & more horror!!", "verified": true, "helpfulness": "0/0", "author": "DEE"}, {"rating": 2.0, "review": "interface is very laggy remote quits working at time plus will keep moving the on screen options without my in put", "verified": false, "helpfulness": "0/0", "author": "Alanah C."}, {"rating": 3.0, "review": "It works fine, but it does not hold onto the signal as much as the Roku does.  I had to connect my modem directly to the Amazon Fire TV in order to avoid dropping the signal whereas in the Roku I rarely had problems with it not picking up the signal from the wireless modem.  I purchased it because it does have an optical audio port for better sound versus the Roku which does not.  Overall it is fine.  I am also hoping they will be able to add more channels or apps to increase what I am able to view.", "verified": true, "helpfulness": "2/2", "author": "Ezequiel Valdez"}, {"rating": 5.0, "review": "Although hookup was self explanatory and extremely easy. Once hooked up, there's a video tour on how it works, which was nice. It's simple, easy to navigate and works amazingly. I recommended it to family that is elderly and within seconds, they were amazed by how easy it was to understand and use, including the voice search option. There is parental blocks that I haven't used yet, so I can't comments about this. It was simple to install other applications and use them with ease, including a vast library of other applications to choose from both free and to buy (Games,Netflix,Crackle,Sing< etc...) Renting/Buying movies was easy as well. We did have one instance in which a movie didn't stream well, However Amazon reimbursed the money without us even complaining!! We will be ordering the game controls next as there are so many games, both free with prime and to buy. It's small, easy to install. BEATS cable bill, boxes and cords!!!", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 4.0, "review": "It took a while to set the stick up and learn how to use it, but once I did, I love it.. My husband loves it more..He hasn't watched regular TV since we got the stick..LOL..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "net zero mobile broadband does not have enough usage to run amazon fire tv you forgot to mention that", "verified": true, "helpfulness": "1/4", "author": "beverlywren"}, {"rating": 3.0, "review": "Many features are not available in my country", "verified": true, "helpfulness": "0/1", "author": "hernan garcía"}, {"rating": 4.0, "review": "I was skeptical but I actually love my fire tv. So convenient and I have so many streaming opportunities between prime, netflix and hulu. I barely watch cable anymore.  Happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Darlene Reese-Mannion"}, {"rating": 3.0, "review": "Worked great 11/2014-5/2015, 6 months, after which Netflix failed to load totally. Tried everything to fix, reboot, reload Netflix, reset to factory settings. Great product, just not dependable.", "verified": true, "helpfulness": "3/4", "author": "B. Przybylski"}, {"rating": 1.0, "review": "Really poor user interface, can't search for free, (paid for goal prime membership) the real killer for me is no YouTube app.", "verified": true, "helpfulness": "1/1", "author": "Photogeek1234 \"Photogeek1234\""}]