[{"rating": 5.0, "review": "Love it - made Netflix worth paying for as we are now watching it a lot more.  I realize there are other ways to watch Netflix on my TV, but this is the easiest for us.", "verified": true, "helpfulness": "0/0", "author": "Katherine Owen"}, {"rating": 5.0, "review": "Love the Chromecast!I have several Apple TV's and I can say that this is just as good. Especially for watching Netflix and Youtube. You get the easy UI that you are used to on your phone, and then you just tell it to play on the TV, it makes perfect sense.The only thing Apple TV is better at is Airplay obviously, or presenting something to someone. Other than that, Chromecast takes the cake. Also its way cheaper!", "verified": true, "helpfulness": "0/0", "author": "qrpike"}, {"rating": 2.0, "review": "Doesn't work with D-Link DIR-655 routers. So annoying. I can't figure it out. You would think that they would work with all routers.Once I finally did get it working it is dependent upon a very strong wi-fi signal. If you don't have a strong signal it won't work that well. Simple as that.", "verified": true, "helpfulness": "0/0", "author": "Robby"}, {"rating": 5.0, "review": "The Chromecast works as advertised.  To dock it a star because they haven't expanded its streaming capabilities would be unjust. From my iPhone, my Galaxy S2, my Nexus 7, I can cast from YouTube & Netflix flawlessly.  So far, I feel the integration with the Android device is better since control exists from the lock screen vs on the iPhone.  This is a downer since I favor my iPhone, but it's a Google device, makes sense.  HuluPlus & Pandora have been added since I got the device, and I have yet to test either.I hope that it's deal with Hulu doesn't lock the device from other content providers.  I'd love to see the device offering more options.For what it is, and for it's cost, it's a neat device that I look forward to more content being available in the future.", "verified": true, "helpfulness": "0/0", "author": "Mark Savage"}, {"rating": 5.0, "review": "Wanted to stream Netflix. I am not tech savvy but this was easy to install,even for me. Nice to watch tv instead of tablet.", "verified": true, "helpfulness": "0/0", "author": "Evelyn Bay \"Big Fan\""}, {"rating": 4.0, "review": "Great device that has the potential of getting an extra star. The thing that is lacking right now is that the platform needs to be opened up to third party applications.", "verified": true, "helpfulness": "0/0", "author": "Peter Frandsen"}, {"rating": 5.0, "review": "Just awesome, works perfectly in Chile", "verified": true, "helpfulness": "0/0", "author": "Matias Bown"}, {"rating": 2.0, "review": "I recommend against the Chromecast device.  It is a brilliant idea but a poor application.  The supposed purpose is to view on your TV what you view on your computer.  It is NOT compatible with many internet streams - for example, with Chromecast you cannot stream your own Amazon Instant Video streams on your TV.  Also, it \"eats up\" your random access memory and random operating memory (RAM & ROM) such that any projection to your TV is scratchy and jerkish.  It is a wasted $35.", "verified": true, "helpfulness": "0/3", "author": "Douglas Fisher"}, {"rating": 4.0, "review": "25 Jan 2014 - I want to update my review and upgrade my rating for the Chromecast to 4 stars.The wireless N router that I was using previously was just the built in one that came with the modem from my cable provider.  It was crappy and was using it for a long time.  I have now changed my setup so that this modem is switched to bridge mode, and now I am using a new ASUS dual band wirelesss AC router.  The video on the Chromecast improved.  It looks very much like 1080p streamed from the net.I still did not give this 5 stars simply because of application support.  In Singapore, I am only able to use this with YouTube on my phone.  I tried Avia but it still need me to buy an add-on that will allow direct streaming from my phone.  And even when I tried to buy it, Play store did not allow which I believe is a country restriction as at now.Almost perfect.------------------------------I'm using this only for YouTube and casting Chrome tabs only.Compared to my WD TV Live using the enhanced WDLXTV firmware with YouTube 1080p set, the videos via Chromecast were disappointing.  If you do not have a way to stream YouTube videos to your TV yet, then this is a good way start.Sharing YouTube videos on a big screen TV is always better than from tablets and smartphones.  Using your handheld devices like a remote is way better than your usual TV remote.Casting Chrome tabs is a plus.  Its wireless, so you can easily toggle casting on/off.Its cheap.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Fuentes"}, {"rating": 5.0, "review": "Easy to install, excellent performance! I have tried various ways to watch iPad movies on TV, this solved it in 5 minutes!", "verified": true, "helpfulness": "0/0", "author": "Cynthia A. Bailey"}]