[{"rating": 5.0, "review": "Finally got to watch the wire which is why I bought it.  Roku doesn't stream hbo go well, this does", "verified": false, "helpfulness": "0/0", "author": "amber tardino"}, {"rating": 4.0, "review": "As advertised. The installation took about 10 minutes. The product had to update drives, but it was simple.I transmitted a TV show from my laptop and the picture was great. I have disconnected from cable and stream all my TV over the internet.  I am happy with this product. I also use a roku box - together I get more and better TV than I did with cable. In all the installation was simple, the picture quality great, product can be moved to TV's in other rooms. I would recommend for streamming videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This product is great and is wonderful in the home to stream audio/video to home theater system.  Streaming is easy to setup and generally works pretty well without too much lag.  My biggest disappointment was that it CURRENTLY doesn't work in hotels because there is no way to log-on to the hotel network (or any network with access point/client isolation).  I expect google to fix this soon and then this will be an amazing companion to have on the road.  All they need to do is imbed a \"Chrome-Lite\" browser within Chromecast or allow the app on your phone to handle the AP splash page and they're set.", "verified": true, "helpfulness": "0/0", "author": "narc"}, {"rating": 5.0, "review": "The value to price ratio on this product is the highest of any electronic product on the market.  Easy five stars.", "verified": true, "helpfulness": "0/0", "author": "Iran hernandez"}, {"rating": 5.0, "review": "It's amazing how this thing works.. We were able to get a great quality streaming with half of a signal.  The wireless AP is in our basement an we were surprised on the how much it picked up. 3-4 out of 5 bars works excellent.We use it primarily for Netflix and Plex.I'd highly recommend this.. It's an impulse buy!", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "People keep saying you can't without work arounds and all that.Simply open Chrome browser and press Ctrl+O then pick the video you want to stream from your HDD. Done.", "verified": false, "helpfulness": "0/0", "author": "DeathWish808"}, {"rating": 4.0, "review": "after having this product a few months i realize that sometimes there is \"delay glitch\" in the streaming. the video i'm watching on my laptop will play fine but then I try to watch via the chromecast and the video will be jumpy.", "verified": true, "helpfulness": "0/0", "author": "Gary S. Koech III \"nightshifter\""}, {"rating": 5.0, "review": "Now this is a gadget I truly love. So easy to install that even my luddite sister was able to do it.  I have one on both my living room and bedroom TV.  So clever and so very affordable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Joan-ArmChair shopper\""}, {"rating": 5.0, "review": "This device is easy to install and use.  It provides a great way to watch perfect television without ongoing fees.", "verified": true, "helpfulness": "0/0", "author": "Kenneth K. Cassell"}, {"rating": 1.0, "review": "It was cheap so that makes up for a lot.If you just want to stream netflix or youtube and that's pretty much all you tend to do then this is for you.I have movies and stuff I stream from my pc and switching back and forth when I can do everything on a different streaming device the chromecast is a huge disappointment.  There's no reason why they want to stop people from developing apps to allow for any file streaming but oh well; still early stages.But I've had it for a little while now and used it twice; the first day to set it up and play around with.  The 2nd was at work to show it off.  It just stays plugged into the TV and I forgot I even had it until I got a notice from Amazon to post reviews for the products I bought.", "verified": true, "helpfulness": "0/1", "author": "John Lee"}]