[{"rating": 5.0, "review": "Excellent device. Able to get it hooked up and working just two minutes out of the box.", "verified": true, "helpfulness": "0/0", "author": "DiveDoc"}, {"rating": 5.0, "review": "I love the capability of this little box :)", "verified": true, "helpfulness": "0/0", "author": "klfindest"}, {"rating": 4.0, "review": "It met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Emily Austin"}, {"rating": 5.0, "review": "The Amazon FireTV is the perfect solution for your streaming needs! I wanted to put Twitch streams on my TV and this was just the product for the job, especially after Amazon's purchase of Twitch.The device itself is sleek and simple, its just a small black box with a few plugs. I was surprised by its ability to receive an excellent wifi connection despite being fairly far from my router. It could hold a fairly strong and fast connection, unlike my Chrome Cast.The UI is fast and powerful, and fairly organized. Sometimes the apps you have installed have to be searched for instead of simply chosen from the main menu but that is fine if you're reusing your most commonly used apps anyways. The remote is a bit small for my taste (and a bit too small to easily locate when it gets lost) but it's very effective.I am very pleased by the Amazon FireTV, and I highly recommend it to anyone who wants to stream, well, anything at all.", "verified": true, "helpfulness": "0/0", "author": "evanc1512"}, {"rating": 5.0, "review": "Good selection of movies, games, very entertaining, choose not to watch standard TV as much.", "verified": true, "helpfulness": "0/0", "author": "Kay Martin"}, {"rating": 5.0, "review": "Love my Amazon Fire TV-very easy to connect and so many wonderful applications for streaming.  Love it, only wish one modem cannot work for my other TV's.", "verified": true, "helpfulness": "0/0", "author": "Lena V. Brigner"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Al Foster"}, {"rating": 5.0, "review": "very easy to set up with great customer support.", "verified": true, "helpfulness": "0/0", "author": "walter perry"}, {"rating": 4.0, "review": "I was hoping the voice search would display more than just Amazon stuff but overall, I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Tipton"}, {"rating": 4.0, "review": "Hulu plus needs an update for closed captioning. I had to reinstall the app to be able and have subtitles.Bout the only complaint I have, idk if other apps may have the same issue.Otherwise, works great, smooth, and has every app I wanted. 4.5 out of 5", "verified": true, "helpfulness": "0/0", "author": "serge"}]