[{"rating": 5.0, "review": "Perfect with Sling TV, Netflix, Amazon Prime Video, and Youtube.  Remote simple to use.", "verified": true, "helpfulness": "0/0", "author": "Weihan Wu"}, {"rating": 5.0, "review": "Good Quality, Good Streaming, Good Voice Search, Works well with Kindle Fire Tablet. You get your money's worth.", "verified": true, "helpfulness": "0/0", "author": "Jess"}, {"rating": 5.0, "review": "It works very well and is super user friendly!", "verified": true, "helpfulness": "0/0", "author": "latisha"}, {"rating": 4.0, "review": "Very fast compared to other similar devices - Apple TV, Roku etc...", "verified": true, "helpfulness": "0/0", "author": "Ian Duncan"}, {"rating": 5.0, "review": "Not only does it do a great job of streaming video, but it is a really nice gaming machine. It immediately had games on it that came from my Fire tablet. But I have found a few really fun games that were free. Just the thing for the casual gamer. I can play a game while I wait for my husband to start streaming video. I am bad a waiting. You should have the game controller though.", "verified": true, "helpfulness": "0/0", "author": "Gayle E"}, {"rating": 5.0, "review": "This is a great alternative to cable. My husband & I were tired of paying the ridiculous prices that these cable companies are charging for watching just the basic channels. Now we get all the channels we normally watch at a 75%+ discount. I have already referred others to this, hope they take advantage of it as well.", "verified": true, "helpfulness": "0/0", "author": "Michele Williams"}, {"rating": 5.0, "review": "Fire TV lived up to my expectations. I was planning to use it mainly as a Kodi (XBMC) box and it definitely pulled it out. It is compact and elegant, accompanied with a nice user interface. It is as powerful as advertised (which was battle proven by the latest Emby add-on), and can be hidden behind the TV thanks to the supplied remote, no receiving issues for me. I had a couple of minor let-downs, mainly the inability to connect to 5 GHz Wi-Fi but I suspect  it is due to my router placement and a thick wall in-between, only my mac can maintain a persistent connection, other devices switch to 2.4 GHz back-and-forth.", "verified": true, "helpfulness": "0/0", "author": "Perit Bezek"}, {"rating": 3.0, "review": "I have ROKU 3 also, so this gives me an opportunity to compare the two.  ROKU 3 controler is easier to use.  I find the ROKU first screen that comes up more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Scott T Westphal"}, {"rating": 3.0, "review": "I live in Costa Rica, I can't access to movies or some app because is not available here. Except this, I am fine.", "verified": true, "helpfulness": "0/0", "author": "Alex Castillo"}, {"rating": 5.0, "review": "Awesome device!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Izzy"}]