[{"rating": 1.0, "review": "Doesn't work on university Wifi. This would have been nice to know beforehand.", "verified": true, "helpfulness": "0/2", "author": "Joshua"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "Thus didn't work out so well. Hate that it doesn't have a remote, not even controls thru the chromcast. No way to go back a page or forward. You can only play and pause. Also, works somewhat ok with you tube but buffers. And hardly ever worked with netflix. Would always display some error code.  I called I emailed I looked at blogs online,  & still nothing helped.  Tried on another tv with a diff internet provider at a different house. Still didn't work. I don't recommend this at all. Try a smart blu ray dvd player with screen mirroring instead.", "verified": true, "helpfulness": "0/0", "author": "babemalo"}, {"rating": 4.0, "review": "If you have fast internet connection, it will works good for you!", "verified": true, "helpfulness": "0/0", "author": "Petermusic"}, {"rating": 5.0, "review": "Best thing ever that is attached to my big screen! Very conveniently streams stuff from my android phone like youtube videos, google music and even casts my phones screen!", "verified": true, "helpfulness": "0/0", "author": "Andrius Mateikis"}, {"rating": 5.0, "review": "Liked the price", "verified": true, "helpfulness": "0/0", "author": "pam"}, {"rating": 4.0, "review": "You will love it!,  I enjoy a lot! even the games!", "verified": true, "helpfulness": "0/0", "author": "Willian Garcia Velasquez \"gmaestro\""}, {"rating": 4.0, "review": "Very good item. Shold buy it asap.", "verified": false, "helpfulness": "0/0", "author": "mayank"}, {"rating": 5.0, "review": "Once you use it, you will want one on every TV. This is my 3rd. Great for use on vacation to watch movies from my android tablet.Favorite apps- PLEX!!!- Netflex-YoutubeMore apps added often. Still waiting for Slacker Radio Support. Other than that no complaints", "verified": true, "helpfulness": "0/0", "author": "Michael J. Sjaarda"}, {"rating": 4.0, "review": "Chromecast is a great device for broadcasting content from your computer directly to your TV screen.  It was a breeze to set up and easy to connect.  I did have some connection issues because my router wasn't powerful enough to send a clear signal, but I recently upgraded the router and now have no issues at all.  I do wish that the device would operate on the higher frequency 5ghz, not just the 2.5ghz band.", "verified": true, "helpfulness": "0/0", "author": "ATLJC \"JC\""}]