[{"rating": 5.0, "review": "Much better than my old sony.  No picture freeze or slowdowns.  I'd definitely recommend it.  .Much better than my old sony.  No picture freeze or slowdowns.  I'd definitely recommend it.  .", "verified": true, "helpfulness": "1/1", "author": "Michael S. Neely"}, {"rating": 5.0, "review": "Works as advertised (which is a big deal these days).Bought this box to replace a dying WD TV Live.  Tried replacing it first with an Apple TV, that was a waste.Bought this; right away, it works.  And it's quick too.Then installed XBMC - and holy cow, I've now got the perfect media player.", "verified": true, "helpfulness": "1/2", "author": "phil"}, {"rating": 4.0, "review": "The amazon fire is a great network unit that has a cool feature where you can talk into the remote instead of typing. However the BIG negative is that Amazon does not allow the. HBO app, so if you are a HBO subscriber like me you will be disappointed. I had to pull out Roku because of the missing app. I hope Amazon will reconsider this big loss", "verified": true, "helpfulness": "1/1", "author": "Nor'easter"}, {"rating": 5.0, "review": "Plex Media Server is a great app that streams local media from your computer. The layout of the app is much better than on the Roku, and the browsing and loading speed is phenomenal.", "verified": true, "helpfulness": "1/1", "author": "Dustyn"}, {"rating": 4.0, "review": "I have been using a mac mini hooked up to my television for many years. Mainly, I use Hulu Plus, NetFlix, Amazon Prime, and Plex. I have a bluetooth mouse pad and keyboard which makes it pretty easy, but I still have to lean over to the coffee table to navigate until I find what I want to watch.With the Amazon Fire TV, I can navigate through all those apps much faster than I could with my mac mini. I have watched movies and shows with Plex, Hulu, Netflix, Amazon Prime, and even rented a couple of movies off Amazon and the quality has been great. I haven't had a single issue streaming. I was concerned with this because when Amazon Prime first started, I had a lot of buffering issues, but they have definitely gotten that worked out.With Plex, since my movies are hosted on my Mac Mini and streamed, I had to remember to set my mac mini to not sleep, otherwise you'll go into Plex and none of your movies will be listed, no matter how many times you refresh. So, I guess my mac mini will use a little more power now, I can deal with that.The voice feature has worked great for me, but it only works with Amazon Prime... If it would tie into Plex, NetFlix, etc.., it would be much more useable. Also, if you need to search for something by typing in the name, you're not going to enjoy it since you have to curser to the alphabet pasted on the screen. I tend to just browse, so I can deal with it...  I thought there would be a remote app that you can install on a smartphone, but I haven't seen anything on my few searches.I have not played any of the games, so I can't provide feedback on that.Overall, I'm very happy and I plan on buying a second for another room in the house. I wish the layout was more customizable and wish the remote had a qwerty keyboard (or there was an amazon fire tv remote app), but having a couple fire tablets, I'm used to it.", "verified": true, "helpfulness": "2/2", "author": "Robert Hanley"}, {"rating": 1.0, "review": "I ordered this product because I have had very good success with all Amazon products.  The order was filled and sent in prompt order and my friends brought it down to me in Cabo San Lucas.  Unfortunately, nowhere in the details did you mention that this does not work in Mexico.  Will send it back, and be sure to let others know that it will not work south of the border.", "verified": true, "helpfulness": "2/13", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Amazon Fire TV is easy to use, clear, ready to use with my video library, quick response to changes, good buy", "verified": true, "helpfulness": "1/1", "author": "SF"}, {"rating": 3.0, "review": "I purchased a Fire TV about a month ago and continuously have problems. Half of the time I have remove power cord to make it work. Now I am getting message unable to connect to servers when I try to connect wireless. I have Verizon FIOS and this computer and  my Roku 3 works all the time with my wireless router. The only way I can make it work correctly is use a wired connection. I paid the same price for Roku 3 as I did for this Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Lawrence J Earl"}, {"rating": 3.0, "review": "When I first saw the Amazon Fire TV advertised, I was incredibly excited. I had been looking for a solution to my Sonos sound bar/ projector home theater system. The Fire TV comes with an optical audio out which plugs directly into the Sonos bar and what I was most excited about was the USB drive.....Turns out the USB drive doesn't actually work. So I cant plug it into the box and stream anything off of it, its essentially a useless port. Had I known that I probably would've stuck with the WD TV box that I was using despite its horrible operating system.Im still holding out hope that amazon will push an update to the box that allows the USB drive to be used like the Roku 3, I personally recommend the Roku 3 to anyone who is considering buying this box, keep in mind that the Roku 3 doesn't have an optical audio out port.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The amazon fire TV is the best streaming device i have researched that will go together with my entertainment system. Size is not to be judge so quickly it runs without any issue and the set up was a breeze. The app selection is vast so Its a good opportunity to include the whole family with our many different viewing habits also the voice function is greatly appreciated for those that are less tech savvy.", "verified": true, "helpfulness": "0/0", "author": "Tonas_Michael"}]