[{"rating": 5.0, "review": "It was very easy to set up and from the start everything worked perfectly. I have no problems whatsoever with it so far. I would highly recommend the Chromecast to anyone interested in purchasing it.", "verified": true, "helpfulness": "0/0", "author": "Lorna Wong-Johnson"}, {"rating": 4.0, "review": "It's a great idea, however it needs work, it needs a lot more apps to work with it. I like how i can do other things on my phone or tablet and still stream stuff. I haven't tried but I am hoping I can connect it to my home theatre system somehow so I can do stream music without having the tv on.", "verified": true, "helpfulness": "0/0", "author": "pegah"}, {"rating": 5.0, "review": "Thank you so much for getting this product to me so promptly. I have installed it and been using it for a couple months already. I am getting ready to get rid of my satellite service because this covers all my needs.", "verified": true, "helpfulness": "0/0", "author": "Metro Up"}, {"rating": 5.0, "review": "This is a great device and works great with netflix and youtube.  If you have an android device and do not have a smart TV, this is the way to go.  Shipped very fast too.", "verified": true, "helpfulness": "0/0", "author": "John Stallions"}, {"rating": 5.0, "review": "I bought this for a second TV that I have in the bedroom.  I did not want to install cable and pay for another DVR in the bedroom, but wanted to occasionally watch a streaming movie or TV show on that TV.I stay at hotels often, and will sometimes bring this along. Many hotels leave an HDMI port available on the TVs in their rooms, so you can bring this guy along to watch whatever is available on your streaming apps.", "verified": true, "helpfulness": "0/0", "author": "Kriszena"}, {"rating": 5.0, "review": "On older flatscreens (that don't come bundled with apps) this is your solution. Five minutes to set it up and then just forget it. One day all TVs will come with these installed...", "verified": true, "helpfulness": "0/0", "author": "Robert F. Pinion"}, {"rating": 1.0, "review": "I would suggest you look at chromecast support to see if your router is supported.  Mine is not  and now I have a chromecast I can  not use.", "verified": false, "helpfulness": "1/1", "author": "cissy Lee"}, {"rating": 5.0, "review": "I mostly use this for streaming Netflix on my TV. So far it has worked great and I haven't had any issues, so I'm a happy cutomer!", "verified": true, "helpfulness": "0/0", "author": "JJI84"}, {"rating": 1.0, "review": "I couldn't download all the software to make it work. There's no support from Google. And if you want to watch tv from your laptop, it's easier to just by a cable. I ended up returning it", "verified": true, "helpfulness": "0/1", "author": "Chris Hardy"}, {"rating": 5.0, "review": "I love this....but....I have to turn my TV on, make sure the device is up and powered, then check on my iPhone...and then I connect to the Chromecast.  Done this way, it works great....otherwise, I cannot get it to work for several hours.  But, once I figured  this out it has been super.", "verified": true, "helpfulness": "0/0", "author": "Karen H Early"}]