[{"rating": 5.0, "review": "I almost don't know how I got by before without this product.It suddenly becomes the simplest thing in the world to come home, and put some music through my stereo without having to leave my phone sitting on top of my media center. Being able to walk around the house (not even constrained by the limited range of Bluetooth) has been shockingly freeing. The ability to simultaneously listen to music or stream a Netflix show and continue to browse and use my phone is awesome.In terms of performance, I've never experienced a lost connection, dropped frame rate, or buffering issue. I have nothing to complain about, and for $35 I couldn't ask for more, and frankly there's not much else I would ask for.If there's one thing I'd like to see, it would definitely be iTunes/Amazon MP3 integration, so my (non-Android using friends and family) could use their phones to stream content too. Not sure how much of this not being a thing is on Google's end, and I doubt it'll ever come to fruition, but if you're already on Android, or have a Windows or Mac PC, this is by FAR the simplest and fastest (and cheapest?) way to get Netflix/music/screen sharing on your TV. Can't recommend this enough.", "verified": false, "helpfulness": "0/0", "author": "Ryan Faulk \"Ryan\""}, {"rating": 1.0, "review": "I love technology and I expect it to evolve to make my life easier.  Chromecast seems to do the opposite.  Its cheap technology to stream only netflix, youtube Hulu, and that type of online media.  Most TVs already have that technology built in.  Other options like Ruku or Netgear makes simular devices that have more capabilities at a simular price.  So here are my top issues.First, I wasn't able to stream Computer content to Chromecast if the TV is connected via Ethernet.  Only works WiFi.  WiFi will automatically reduce your streaming quality.Second, my TV volume didn't work through Chromecast.  I called the Google Tech and they weren't very helpful.  Maybe I got a defective unit.Third, the unit cannot view all file formats.  So not all my videos were recognized from my local hard drive.  Again, the Google Tech recognize the problem and wasn't able to help me.Save your money.", "verified": true, "helpfulness": "2/4", "author": "Amazon Shopper"}, {"rating": 1.0, "review": "Apple Tv is 100 times better. all you can send from the ipad is from the youtube app or the netflix app.  I have apple TV and anything i can get on my Ipad I can sent to my tv with Apple TV.  Chromecast has to conect to your wifi as well it is not indepedent from your network. For netflix or you streaming it would be fine.", "verified": false, "helpfulness": "7/11", "author": "fred"}, {"rating": 3.0, "review": "I have Apple TV, Roku's and a Mac Mini and an OG Logitech Google TV.  Not super impressed with this one.  Right now it's limited.  Plus if you Cast a Chrome Tab, be prepared for to peg your host CPU out!  I have a 2012 MacBook Pro with Retina Display that has 16 GB of RAM and the 2.7 GHz Intel Core i7 special order CPU and my fans sound like a C17 taking off when I cast a Chrome Tab.  But I will say it's easy once it's up and running.", "verified": true, "helpfulness": "1/2", "author": "Craig Seabrooks \"Network Engineer\""}, {"rating": 5.0, "review": "Great product - loving it - it works from phone, computer and ipad.  Google thanks for giving us such a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Kay Jay"}, {"rating": 5.0, "review": "I ordered this on a lark, but am glad I did. It installs in a couple of minutes and my Samsung Android phone connected to it when I downloaded the correct app from the Play Store. I instantly streamed You Tube and NetFlix movies to my television. The picture quality is outstanding, (unless, of course, the quality of the source isn't!) and all controllable from the phone.As with any new device, there is a limited number of program sources now, but if it never goes beyond Netflix and YouTube, I'd be satisfied.", "verified": true, "helpfulness": "0/0", "author": "Marty B \"Marty B\""}, {"rating": 5.0, "review": "We use this at our house to steam Netflix from our computer and iPad to our TV.  We also use it to play some youtube videos.  We have installed Chrome onto our computers...this works through Chrome (not our other browsers)...to the doodad.  Our TV has an HDMI port and a USB port.  Installation was a breeze.There is a small delay between what is playing on our computer and what shows on the TV we play it on.  The sound transfers with the video.  Only once, has the sound been off from the picture on the TV.  We re-started and it worked fine after that.", "verified": true, "helpfulness": "0/0", "author": "TLCaldwell \"research maven\""}, {"rating": 5.0, "review": "It works great. I thought with it only being 720 it wouldn't look as good on the 65\" but it really looks great and I have told everyone I know how great it is and they should pick one up for themselves. I hate google chrome but thankfully this does not require me to have it and I just use my phone.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 1.0, "review": "Didnt work - I think I have an older version of HDMI on my TV :(  sold it to a friend", "verified": true, "helpfulness": "1/2", "author": "Theodosios Paraskevas \"Teo\""}, {"rating": 4.0, "review": "This is the best substitute to Roku and other smart tvs. IF you do not have a smart TV then all you need is Chromecast. They have Netflix and you tube support and it works seamlessly with both services. I can cast from my laptop, iphone and ipad. If it had and just a few more apps and DLNA/uPnP support I would have given it 5 stars and that is all it takes to match Roku.", "verified": true, "helpfulness": "0/0", "author": "SVPL"}]