[{"rating": 5.0, "review": "Sets up in only a few minutes.... voice search make browsing easy... has all my favorite video apps... great picture quality", "verified": true, "helpfulness": "1/1", "author": "Chris Ruckman"}, {"rating": 5.0, "review": "Awesome device. Low power consumption and i already have it runnig xbmc to run all ofy movie library 1080p on netflix amd amazon tv services. What more can you ask for?", "verified": true, "helpfulness": "1/1", "author": "jro"}, {"rating": 5.0, "review": "I have had Fire TV for less than a week so I am still experimenting with it.  But it does all it said to do.  I have the feeling that it will get even better in the near future.", "verified": true, "helpfulness": "1/1", "author": "Lawrence J. Murphy Jr. \"Spud\""}, {"rating": 3.0, "review": "It does the trick for Netflix and Amazon Prime, but I would like to have more choices much like Apple TV. The gaming option is ok, but too many add ons get pricey. If I had to do it all over again, I would have gotten a second AppleTV.", "verified": true, "helpfulness": "1/2", "author": "Jodi L. Lalos \"saxgrl\""}, {"rating": 4.0, "review": "As an owner of an Apple TV, 2 Rokus and 2 Google TV boxes, I feel like the Fire TV is a nice step forward for set top boxes. It is super fast and the voice search works well. I also like how well it works with Plex.I would have given it 5 stars if it had all of the promised features at launch. Unified voice search (i.e. ability to search Netflix, YouTube, etc. with voice) is still not there.With a software patch or two, this is the set top box to beat right now (and worthy of 5 stars)", "verified": true, "helpfulness": "0/0", "author": "Shawn Morton \"sMoRTy71\""}, {"rating": 5.0, "review": "Excellent, easy to install and the remote and voice command puts this ahead of Apple TV.I would highly recommend this!", "verified": true, "helpfulness": "1/1", "author": "Bill w"}, {"rating": 3.0, "review": "The box is super easy to configure, the video quality is excellent and very fast.  The search recommendations are a little limited.  It seems too hard to get to Netflix.", "verified": true, "helpfulness": "1/2", "author": "Chris Lower \"Home Theater Fan\""}, {"rating": 5.0, "review": "The size of this is similar to the Apple TV that I also have, but fire tv better looking. My impression of the remote was a cheap plastic, but I was proved wrong, the remote is actually made of superior quality materials. Once connected it downloaded the software update and a quick tutorial of the product follow after. The interface is organized and the control to the media is super responsive. I downloaded and installed asphalt 8 and the quality of the game is mediocre. It reminded me of video games taken directly from smart phones and fit on the same ratio, but  it was different because it provided a larger view on flat screen tv. I also ordered the nyko remote that I will be pairing with it as soon it arrive. Netflix is awesome and very easy to navigate. The amazon fire tv is far superior to the Apple TV. Overall I am satisfied with the product and will be using it as my primary entertainment system.", "verified": true, "helpfulness": "2/2", "author": "Tony"}, {"rating": 5.0, "review": "This is way better than my Roku's. more efficient and love the speak option.  Nice, good value. Only had it a week, but so far I'm impressed.", "verified": true, "helpfulness": "1/1", "author": "daily shopper"}, {"rating": 5.0, "review": "I am seriously considering  using an antenna to pick up local stations for my TV services and  only subscribing to fast internet service.I have had Fire TV for over a week now and the scope of the programs available is much broader than I anticipated.  The picture rivals that of the cable service.  Instead of scanning thru scores of stations you are not interested in watching, you can use the verbal command and select something you really would like to watch.For a one time payment of $99 this product is amazing.  The remote works flawlessly with one drawback, the volume controls and mute can only be accessed with your TV or cable remote.Fire TV exceeds my expectations.", "verified": true, "helpfulness": "3/3", "author": "William P. Dailey"}]