[{"rating": 3.0, "review": "Gave as a Christmas gift; I don't think its been used.  LOL.", "verified": true, "helpfulness": "0/0", "author": "J. Yee \"Value Shopper\""}, {"rating": 5.0, "review": "After decades of paying exorbitant monthly fees to my local entertainment provider (satellite or cable), I have finally \"cut the cord\" and miss very little as a result. My girls don't miss at all because virtually everything they desire to watch (or hear) can be accessed with a few key components for a one-time total cost equal to 1-2 months of cable service.Here's what I've done, noting there are countless ways (technologies) that can be combined to achieve the same or similar results. Final configuration will always come down to personal preference. Here is mine as it is for now, with the most important first:1) Flat Screen TV: but the best you can afford because it is the one item of them all you will be using the most. For our master bedroom set-up we have a Sony Bravia Sony KDL-40R450A ($499, but this will not be factored into the cost since it's assumed you already have a TV, if not this one represents great cost-quality value.)http://www.amazon.com/Sony-KDL-40R450A-40-Inch-1080p-Black/dp/B00AWKBZQQ/2) DVD Player w/ Internet: Sony BDP-BX110/S1100 Blu-ray Player - $77.00http://www.amazon.com/gp/product/B00BQ3EGPU/The extra-short response time, coupled with HD upscaling and Internet connection make this a wonderful choice for the price. The Internet connection gives you access to a large number of content providers found on Roku, Apple TV and Amazon Fire TV. Those on a shoestring budget can get away with this single item if you are not too picky about missing the benefits provided by these other options.3) Roku 3 - $95http://www.amazon.com/Roku-3-Streaming-Media-Player/dp/B00BGGDVOO/As much as I adore my Amazon Fire TV, I'd be lying if I put it before Roku. The main reason is its vast channel offering. Period. Ultimately out of the thousands of channels offered on Roku, I have settled for only about 50, but they have added immensely to the pleasure I derive from the content accessible. I love that all of my Spotify Playlists are accessible and which I love getting lost in through the excellent speakers on the Sony as well as the TDK SoundCube, which is a non-essential add on that has taken the overall audio experience to a higher level. There are movie channels (both free and pay), but since I can pay only for the exact ones I wish to see, if they're not available on Amazon Prime, Apple TV or Netflix, there's no reason to pay for a monthly service. I have taken Qello up on their free offer as I love live concert movies. If it's actually worth the $5 per month, time will tell. There is no doubt that anyone serious about Cutting the Cord, would be well served by a Roku.4) HDTV Antenna: AmazonBasics Extreme Performance Ultra Thin Amplified Indoor HDTV Antenna - $58http://www.amazon.com/gp/product/B00DIFIP06/This ultra-thin antenna allows you to pick all of the free HDTV over-the-air channels broadcasting in your area. We have access to scores of channels, but when I whittled them down to the ones that we would actually want to see, we ended with about 15, including, ABC, CBS, NBC, Fox, PBS and others. It really boils down to spending a few dollars to ensure HD reception of the major networks, which is a definite must-have and well worth the cost.5) Amazon Fire TV - $99http://www.amazon.com/Amazon-CL1130-Fire-TV/dp/B00CX5P8FC/A wonderful product. Amazing. However, ultimately it is a nice-to-have...a luxury. That said, I LOVE this product and am grateful that something inside me was compelled to get one. So what is it about Fire TV that moves me so much? There are only a few, but they are powerful persuaders:> Voice Search works PERFECTLY and allows you to say a word, name, genre, title, director. Anything. In return you easily find what you're looking for.> Amazon Instant Video and Netflix are delivered, accessed and resumed perfectly. The picture is immaculate. The quality, undeniable. It is just such a joy for these two reasons that unless you have used it, it's virtually impossible to convey the exquisite usability of Fire TV.The only downside at this point in time with respect to Amazon Fire TV is that it has few content providers on board as compared to Roku or even Apple TV, but this is changing as Amazon is in the process of adding content apps and seems committed to continue to do so into the future.6) Apple TV - $93http://www.amazon.com/Apple-MD199LL-A-TV/dp/B007I5JT4S/The only reason and yet the best reason we have an Apple TV is that we're an Apple family and it makes zero sense NOT to own an Apple TV. It's just the way it is if you are committed to Apple, as it also has a highly intuitive and polished user interface as well as a number of desirable content providers. Apple TV remains the easiest way to share and access your Apple content across the members of your family.7) Google Chromecast - $35http://www.amazon.com/Google-Chromecast-Streaming-Media-Player/dp/B00DR0PDNE/This HDMI stick simply and easily allows you to \"cast\" ANY and ALL internet content from any PC or Mac that is running the free Chrome browser onto any TV with a HDMI connection. Think about that for a moment. Anything you can access on the Web, you can view on your TV. YouTube viewing through the Chrome browser has been optimized for Chromecast and is a far, far better YouTube viewing experience than watching them any other way. All for $35. Talk about value!8) Rabbit TV - $8http://www.amazon.com/Telebrands-Rabbit-TV/dp/B00AWC51DW/One can only be disappointed by this small and powerful little USB stick if they have not properly managed their expectations. Coupled with Chromecast, Rabbit TV is in essence a meta-search filter to access thousands of Internet content providers, representing a gargantuan amount of audio and video at one's fingertips. When you put it in perspective, $10 to effectively and efficiently search for anything you can think of, is a major advantage. Despite being at the bottom of the list, Rabbit TV is a must-have by any measure!The final optional item that may be necessary in order to hook all of these HDMI cable into your TV is a Fosmon HD1831 3-Port HDMI Switch - $13http://www.amazon.com/gp/product/B008GVOVK0/This allows one to expand a single HDMI port into three and it works perfectly.CONCLUSION:The bottom line is that for around $400, one can feel good about Cutting the Cord to your cable or satellite company. You get access to virtually any programming you wish to consume, albeit some you might have to pay for either through a service like Netflix, Amazon Prime or pay-per-view/rental. When one looks at the cost vs. cable fees it does not take long to realize that it makes a lot of sense to save the money and enjoy your shows and movies just as much for a tiny fraction of the cost.There are always disappointment when one finds a compromise and no doubt you will too, as I did with ESPN which one can't receive unless through cable or satellite, but in the end it is still a small price to pay as far as I'm concerned. One thing is for certain, it is possible to say goodbye to cable fees and not look back!", "verified": false, "helpfulness": "1/1", "author": "N Nguyen"}, {"rating": 3.0, "review": "DIDN'T WORK BUT MAY HAVE BEN MY LACK OF KNOWLEDGE. RETURNED IT. PROBABLY NOT GOOD DIRECTIONS FOR MY LACK OF KNOWLEDGE.", "verified": true, "helpfulness": "0/0", "author": "RICHARD A. HALL"}, {"rating": 5.0, "review": "It's OK I guess.This is our second Chromecast and it was kind of impossible to add it to our network form an Android device.Once I got onto a Windows machine and installed Google's app it worked. Major pain though. Seriously major pain. It should just work from mobile, nut NO not if you're adding one to a network that already has a Chromecast.Look out for the settings that want to send your stats back to Google too.", "verified": true, "helpfulness": "0/0", "author": "B. Barbier \"baker\""}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "T. Diggs \"Sheila E\""}, {"rating": 3.0, "review": "Have a lot of problem to sync with my iPhone 6", "verified": true, "helpfulness": "0/0", "author": "Ariel Damia Plabnik \"aplabnik\""}, {"rating": 5.0, "review": "Opens new worlds", "verified": true, "helpfulness": "0/0", "author": "Joe Deegan"}, {"rating": 3.0, "review": "loses connection quite a bit with a MacBook.", "verified": true, "helpfulness": "0/0", "author": "muddtt"}, {"rating": 1.0, "review": "Doesn't do much beyond screen mirroring which is useful for streaming, but this function is also widely available with competing media sticks. Frankly the Amazon Fire TV has been much more useful in terms of finding new content, apps, etc.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "This is the best streaming device period! It beats out the Amazon Fire Stick in terms of picture and streaming quality. It works flawlessly with Netflix, Youtube, and the HBO app. The only downside is that in order to use this with HBO, Hulu, etc, you need to download the app. The best feature with the Chromecast is that you can stream anything from the Chrome browser, which means you can watch anything you want even if the site does not support streaming.", "verified": true, "helpfulness": "1/1", "author": "K.D"}]