[{"rating": 5.0, "review": "Works excellent", "verified": true, "helpfulness": "0/0", "author": "eric luukko"}, {"rating": 1.0, "review": "Prior to purchasing the Amazon Fire TV, I owned two Roku devices (a Roku HD and a Roku 2).  After nearly five years of use I replaced my Roku HD with a $69 Amazon Fire TV Gold Box Special (new, not refurbished)The Amazon Fire TV has been connected to our primary television situated closest to our Wi-Fi router.  From day one, I have had problems with the device.  First Netflix would not stream, then Amazon Prime failed to stream, now for the past four months the device constantly freezes and/or is \"unable to maintain its network connection\" or \"play selection at this time\". I have call Amazon support multiple times and they are unable to resolve the issue.  In contrast, my much older Roku 2 which is situated further from my router operates flawlessly.Other Pros / Cons vs. Roku 3:Fire TV pro:  The device itself looks better than the Roku 3 (the device and the remote).Fire TV cons:  The menu is highly geared towards Amazon content, it is very cluttered, and makes using other apps difficult (such as Netflix).  The Fire TV does not sync well with typical universal remotes.  You will need a universal remote with RF capabilities (such as the Harmony Smart Control Hub).Finally after four months, I have had enough and I have replaced my Amazon Fire TV with a Roku 3.  No more frustrations, the Roku 3 works as advertised and the Amazon Fire TV is a paper weight!", "verified": true, "helpfulness": "0/2", "author": "Mike G."}, {"rating": 4.0, "review": "Good so far.  The menus take a little getting used to and the remote has lost connection a few times.  I also don't like the the remote is bluetooth only.  I can't program my Harmony remote to work with this like I can my Apple TV.  Otherwise it's a great way to watch Netflix and Prime.  The machine also has plenty of horse power.", "verified": true, "helpfulness": "0/0", "author": "Christopher D. Ey"}, {"rating": 4.0, "review": "The only thing missing is a native YouTube app.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 1.0, "review": "The UI is very cluttered, aggravatingly so.  It frustrates me to see apps and things I don't want and have no intention of using.  I ordered the game controller at the same time, never got it.  Missing TV Apps may be the fault of the developers and not the fire, but I went from 2 to 1 stars on that as well.  Drama Fever is what I miss most.  I need to only see 1 or two lines of options not 4  I should be able to have those options of what I want to see.  If I want games, on one row, and Channels on another and nothing else I want to do that.  I want to be able to put folders for movies, having Chainsaw Massacre next to My Pretty Pony just because I watched one last night and my child watched one the next day is just ridiculous, but I can't remove the movie option from the carousal. I like going down a rabbit hole the same as others, but I don't want that to be the view when I first open the service.Clean it up Amazon!!!!!!!!!.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kathy P."}, {"rating": 1.0, "review": "pile of junk that needs to be constantly rebooted by the power plug. should of put an on / off switch if thats the case.", "verified": true, "helpfulness": "1/2", "author": "Sebastian K."}, {"rating": 5.0, "review": "Amazon Fire TV is awesome. It was supper easy to set up ad run. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Claudia"}, {"rating": 2.0, "review": "Generally it works, but one thing is extremely annoying, I have quite fast network connection (40Mbps) so I would expect that streaming 1080p is not something extraordinary. However for some reason Fire TV streams Amazon Instant Video content mostly in low resolution and highly compressed video.  At the same time I can watch Netflix in 1080p without long buffering (usually 30-60 seconds is enough), same with Vimeo, YT etc. but somehow in case of Amazon Prime it takes even 15-30 MINUTES to switch to high resolution.And now interesting fact: I have Amazon Instant Video in my Samsung Smart TV, when I play the same (or actually any) movie on Samsung TV it starts in most cases in 1080p right away. Also, since my TV is 4k  I can even watch 4k streams from Netflix without any problems, so clearly network is not the problem.So, Amazon...something is wrong with Kindle TV. At least please allow forcing the device to stream 1080p with longer pre-loading, I don't mind waiting for 2 minutes for it to pre-load, although with my fast network connection it should not be a problem in the first place...", "verified": true, "helpfulness": "0/1", "author": "Karol Bryd"}, {"rating": 3.0, "review": "Slick interface, good product but ultimately I returned it because my cable company does not support HBOgo on it (charter.)  I bought a roku instead which I am able to watch HBOgo on.", "verified": true, "helpfulness": "0/0", "author": "J. McEvoy"}]