[{"rating": 5.0, "review": "How did I ever live without my Chromecast?  This thing is the greatest!  I can stream basically any video from my phone right to my TV.  It was incredibly easy and fast to set up.  I was slightly disappointed at first because streaming from my laptop seems to be a little choppy, but now I'm very happy with it after trying it with my phone.  There is no lag or choppiness when casting from my phone, and using the Chromecast is the quickest way to watch streaming media vs xbox or roku.", "verified": true, "helpfulness": "0/0", "author": "Matthew Berendsen"}, {"rating": 5.0, "review": "Bye bye, XFinity.  I won't miss you...  Fantastic in every way.  I stream everything now and couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Hubert Bonisseur de La Bath"}, {"rating": 1.0, "review": "Biggest piece of garbage I have ever purchased. Set it up right but the picture was absolute garbage. Not only the picture but the delay was so bad. If I were to scroll down, it took a minute, then said no device found. Biggest piece of garbage I have ever purchase and I would never EVER recommend this to anyone.", "verified": false, "helpfulness": "0/4", "author": "Alex"}, {"rating": 5.0, "review": "very useful and convenient especially for netflix!", "verified": true, "helpfulness": "0/0", "author": "YoHanYing"}, {"rating": 5.0, "review": "This little magic Chromecast does everything I wanted and maybe doesn't have all the apps to support it, but it gets better everytime. More and more support everytime. Does so much for the price get this this if your tired of wires!!", "verified": false, "helpfulness": "0/0", "author": "The Truth"}, {"rating": 5.0, "review": "It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Lee,Jeyoung"}, {"rating": 5.0, "review": "The best $35 dollars I have ever spent! Living in the boondocks, with 2 squirrels and a treadmill for an internet service- Chromecast doesn't buffer HBOgo every 30 seconds! I love it!", "verified": true, "helpfulness": "0/0", "author": "Caren Lewis"}, {"rating": 2.0, "review": "Couldn't make it work", "verified": true, "helpfulness": "1/2", "author": "Rod"}, {"rating": 5.0, "review": "I use this all the time. I just with Amazon would release an android app so I could use my prime streaming on this device as well.", "verified": true, "helpfulness": "0/0", "author": "Kerrald"}, {"rating": 5.0, "review": "Absolutely awesome product", "verified": true, "helpfulness": "0/0", "author": "Joshua Dehn"}]