[{"rating": 5.0, "review": "Works really well on my regular 42\" LED flat screen TV.  It is actually faster than my new LED 60\" Smart TV.  Highly recommend it if you have an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Dario"}, {"rating": 5.0, "review": "Love it, love it, love it. Price is great - Many people,  myself included, would have no idea what this is or what it does. Thanks to my son, I am educated and can now access all media I want to use. Great product! Now I have shared the word with same age and stage friends as well as older - some of whom think they are tech savy. Guess what? None knew what the Chromecast is - all went out and bought one and not a single person regretted it.", "verified": false, "helpfulness": "0/0", "author": "Anne Erwin \"Anne Erwin\""}, {"rating": 5.0, "review": "Simple and amazing device. I love that it can turn on my TV and switch to the correct input automatically when I cast to it. My only gripe is that it doesn't change the TV input back to my cable box after I'm done using it. That would be fantastic!", "verified": true, "helpfulness": "0/0", "author": "Jon Packard"}, {"rating": 2.0, "review": "We never got it to work properly with our wifi amplifier.  We are not totally tech ignorant; however, never could solve all our tech problems", "verified": true, "helpfulness": "0/0", "author": "Itzy Gardener"}, {"rating": 1.0, "review": "Originally, I ordered this device to replace my Blu-Ray Player for streaming functionality. I am fairly competent in electronics, however I found this device to be difficult to use. The Chromecast does not have a menu to choose channels, unlike other streaming devices. You are supposed to use your smartphone or tablet to mirrorcast whatever you are playing on your phone or tablet at the time. I found this to be extremely inconvenient. I have mainly Apple devices, so when I searched for apps that would work with this device, I was disappointed to see that most of the good apps were only to be found in the Android market. Until Chromecast adds the ability to use Spotify and mirrorcast Iphones, Ipods, and Ipads, this device will remain useless to me.", "verified": false, "helpfulness": "0/0", "author": "Bella"}, {"rating": 5.0, "review": "fantastic. no longer have to move the computer or hook up hdmi sillyness. can just cast straight from the pc or my ipod. great features and easy to use. can't wait for more apps to utilize it.", "verified": true, "helpfulness": "0/0", "author": "Lynz \"kittielynz\""}, {"rating": 5.0, "review": "Use this little guy all the time", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Barlow"}, {"rating": 5.0, "review": "The product is great, and each version of android apps such as Netflix or Youtube just makes it even better. Great wi-fi range, even though it's only 2.4GHz, which in my opinion is more than sufficient to stream HD content.", "verified": true, "helpfulness": "0/0", "author": "Jorge Sosa"}, {"rating": 1.0, "review": "I was expecting more versatility from it.  It is extremely limited in what it will stream depending on what Google allows.  I was expecting to be able to run all of my laptop media to the TV.  Not so.", "verified": true, "helpfulness": "0/0", "author": "Barry"}, {"rating": 5.0, "review": "This is an amazing device!  We can control what's on TV from a phone, tablet, or computer, allowing us to have Netflix and other internet content without a wii or x-box hooked up to the TV.", "verified": false, "helpfulness": "0/0", "author": "Audrey K Plessinger"}]