[{"rating": 4.0, "review": "works with iPad, iPhone as expected.", "verified": true, "helpfulness": "0/0", "author": "mjypkc"}, {"rating": 5.0, "review": "Works perfect! At first 30 mins had passed and nothing had loaded but after I unplugged and plugged the unit back in the load went to 30% and on in the next 15 mins. I downloaded the Chrome set up app and web browser on my I pad and all the kid and movie apps with free trials. I even downloaded a app offered by Chrome that allows you to type in www... and cast to TV. Thats EXACTLY what I wanted. I had not been satisfied with a couple purchases recently so this saved the day! Just a awesome tool to do more! At an affordable price. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "TyeDye"}, {"rating": 5.0, "review": "Perfect! With this small product you can easily mirror your smartphone to your screen. Twitch, Netflix, Youtube. Everything! Really good", "verified": true, "helpfulness": "0/0", "author": "Daniel Prieto"}, {"rating": 5.0, "review": "Super cheap, great device. I use it for Youtube and Hulu and love it. I'm waiting for HBO Now to work, but that is the only complaint.", "verified": true, "helpfulness": "0/0", "author": "TS"}, {"rating": 5.0, "review": "Nice product and on time arrived..!", "verified": true, "helpfulness": "0/0", "author": "Asdrubal Rabadan"}, {"rating": 3.0, "review": "I have already had to buy a second one as my toddler broke the first. Netflix is very finicky and doesn't not like to work all of the time.", "verified": true, "helpfulness": "0/0", "author": "Emma Lichtman"}, {"rating": 5.0, "review": "Cheap and works flawlessly for plug and play. Stream movies from the laptop or tablet to my big screen TV. The cast screen feature is slow but its a nice option if you want to show off your desktop or some pictures, don't expect smooth playback if you are streaming cast screen for movies or music. For movies I recommend Plex. Youtube and other apps of that nature works great.. smooth 720p video and audio. Also depending on your software or app that you use to stream I have confirmed that Chromecast will stream 5.1 Audio which is great if you have a home theater setup.", "verified": true, "helpfulness": "0/0", "author": "Stan Q"}, {"rating": 5.0, "review": "fun streaming from Android phone", "verified": true, "helpfulness": "0/0", "author": "A.W."}, {"rating": 5.0, "review": "I have a google account and a wi fi so i thought lets give it a try. Works great easy to use love", "verified": false, "helpfulness": "0/0", "author": "Jones Co."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tawnia DuVall"}]