[{"rating": 5.0, "review": "Love it!  Works great & easy to use.", "verified": true, "helpfulness": "0/1", "author": "Dana L."}, {"rating": 5.0, "review": "Great interface, great apps, great little machine. I used to always have issues when I used the streaming apps on my BluRay player. This thing is a beast. Chomps through all the tv and videos that I throw at it. The voice recognition is also really good. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "C. Osterhout"}, {"rating": 4.0, "review": "I'm getting used to this after using a Roku 3. Not as many games, no Blackjack, Video Poker is lame. No headphone jack.I'm big in the Amazon with Prime, Kindle, Echo and this. Hopefully it's just growing pains, I hope I don't go back to my R3 in a few weeks.", "verified": true, "helpfulness": "0/0", "author": "Dan M."}, {"rating": 5.0, "review": "fast and easy shipping.  Love it.", "verified": true, "helpfulness": "0/0", "author": "michele houston"}, {"rating": 4.0, "review": "Ok but local channels need t be added", "verified": true, "helpfulness": "0/0", "author": "jacobbaus"}, {"rating": 4.0, "review": "I recently purchased a Fire TV largely because of supposed support for the Smithsonian Channel app. However the Smithsonian Channel app is not currently available for the Fire TV even though it is listed on the Fire TV product page. The app is not returned in search results on the Fire TV and does not install when synced after purchasing the app via the Amazon Appstore website. Strangely, the app product page lists compatibility with the Fire TV Remote but not with my Fire TV. Under \"Compatability with your devices\" there is an X beside my Fire TV indicating that it is not compatible which is of course why it will not install.Apparently this app used to be compatible as there are numerous comments and even product reviews which mention it and at some point was a featured app on the device. Sadly no more. I have confirmed this with Amazon support which indicated that the app is currently listed in their system as compatible with the Fire TV Stick but NOT the Fire TV. How bizarre is that??? The support person theorized that a recent app update must have broken compatibility because those with it already installed are still able to use it but you will not be able to install it fresh.I'll be sending the unit back for a full refund due to false advertising.Note that I also tried sideloading the app. And while the app installed fine via that method it was unusable due to fact that it didn't work with the remote and there was no way to navigate the app. So it seems that an app update must have broken compatibility.[Update 12/21/2014]I discovered today that the Smithsonian Channel app is now available for my Fire TV. Evidently the app was recently updated or the issue was corrected by Amazon that was causing it to be listed as incompatible and prevent installation on the Fire TV. This is great news as the Smithsonian Channel being listed under \"What to Watch\" on the product page was one of the reasons I decided to purchase a Fire TV. So I will definitely be keeping the Fire TV after all. The funny thing is, now that this app issue is resolved it is no longer being featured under \"What to Watch\" on the product page. It seems that they removed it from the list for whatever reason when they added HBO Go. Anyway, I'm raising my review to 4 stars now that I'm getting everything I expected when I purchased it. In fact i really really like the product and now use it more than my Chromecast. I especially enjoy the speed of the device and the voice search which works quite well. I'm withholding a star only because the voice search is still not all that it could be since it has limited app support. Although support is growing and the recently added HBO Go app does support voice search which is awesome. Once voice search is added to Netflix (which is supposed to be soon) it will be very close to a five start product. About the only missing app I care about is TED Talks so hopefully that will come soon as well.", "verified": true, "helpfulness": "1/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Wish there was more in the store for this device. Bought it for casual gaming but there aren't enough quality games to get. I can stream video and everything the kindle tablets can do, but nothing like the stuff for my iPad and android tablets. So it's a Meh.......", "verified": true, "helpfulness": "0/1", "author": "Jess Lantz"}, {"rating": 5.0, "review": "Love my Amazon Fire TV! Was received quickly and so simple to hook up. Came pre-programmed with my account so all I had to do was plug it in and start watching! And I don't have to pay that outrageously expensive monthly cable bill ever again! $99 one time for the box and once a year for Prime service saves me $1800.00 a year. What is not to love?!", "verified": true, "helpfulness": "1/1", "author": "Lish BalthaZOR"}, {"rating": 5.0, "review": "Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "K. Haro"}, {"rating": 5.0, "review": "Use it daily", "verified": true, "helpfulness": "0/0", "author": "Dave"}]