[{"rating": 5.0, "review": "It's only been 3 days since I received my Fire TV, but so far I give it a definite thumbs up. The set up was easy. The only trouble I had was: (1) the battery cover on the remote, but I eventually got it open to install the batteries, and (2) could not figure out how to turn the box off (use the remote, go down the menu on the left side of the screen, click on Systems then Sleep). The sound coming through the box is much better than the sound that comes through my DVR and it has close captioning for everything I've watched so far. I've only used it to access Amazon Prime content, so that's all I can attest to. Definitely recommend if you want to watch a lot of Prime content on your TV rather than computer or tablet.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Voice command works well.", "verified": true, "helpfulness": "0/0", "author": "Dutch Schulz"}, {"rating": 5.0, "review": "This is a great addition to my HD television viewing.  If I want a movie right away, I don't have to go to the Amazon web site on my computer and order it, then open it on another device connected to my TV.  I can order it directly on my TV (as long as you have an active account at Amazon).  The quality of the streaming video and audio is also great.  I can also go to other video apps, like Netflix, if I wanted to (and had an account at those other apps).  It also has a great screen saver (for when you have to pause a movie or TV episode for more than a minute or two) that has some really beautiful scenes that change about every 10 seconds.  It also has a \"Voice Search\" feature, that is awesome.  You can push the \"Voice Search\" button (holding it down), say the name of a movie or TV episode, the name of a actor or actress, and it will display the movie or TV episode, or all the movies that the actor or actress has played in.  The \"Voice Search\" feature is not available on the \"Amazon Stick\".", "verified": true, "helpfulness": "1/1", "author": "mfisher \"Michael Fisher\""}, {"rating": 5.0, "review": "Love the instant television shows and movies.", "verified": true, "helpfulness": "0/0", "author": "D. Price"}, {"rating": 4.0, "review": "The Amazon Fire TV is great. The only issue I have had is with the voice search. The voice search only searches through the Amazon website. There is no voice search in the Netflix app.", "verified": true, "helpfulness": "1/1", "author": "Kelley Stott"}, {"rating": 4.0, "review": "I really love my fire tv. The voice search is cool. However, I wish the controller had a few programable buttons, a separate volume control, and the ability to turn the TV on and off.", "verified": true, "helpfulness": "1/1", "author": "Chris Patrick Crampton \"Cbase4\""}, {"rating": 4.0, "review": "USB input is not supported. Streaming from phone is not supported. You have to upload to cloud then Fire must play it from cloud, So no true stream from phone like you can on other devices.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Gomez \"Robert\""}, {"rating": 4.0, "review": "I'm taking off a star because for some inexplicable reason, after having been left on for too long the sound will sometimes get very tinny and I'll have to pull the power and restart the Fire TV.  I tested to be sure that the issue wasn't the tv speakers, it's definitely a problem with the Fire TV.  I'll have to deal with Amazon about that at some point.Other than the technical problems, I love my Fire TV!  I use it for playing music off my tv with Spotify, I regularly use it for Netflix instead of my Xbox, and Amazon has some really awesome programs available for free if you can find them.  I can rent almost anything I want to watch without leaving the house, and I never have to worry about late fees or returns.", "verified": true, "helpfulness": "1/1", "author": "P. Jensen"}, {"rating": 2.0, "review": "Just ok. You have to buy most of the movies despite Prime membership.", "verified": true, "helpfulness": "1/3", "author": "BRIAN"}, {"rating": 5.0, "review": "I LOVE FIRE TV!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gold Acres"}]