[{"rating": 3.0, "review": "I purchased this to be able to transfer downloaded movies from my Kindle onto my TV screen. Doesn't work for that purpose.", "verified": true, "helpfulness": "0/0", "author": "S.H."}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Antonio Rujana"}, {"rating": 2.0, "review": "Doesn't do what I thought it would. Barely works. Fairly useless IMNSHO.", "verified": true, "helpfulness": "0/0", "author": "CARLOS GARDEL"}, {"rating": 1.0, "review": "If you have a smart TV already, you don't need this. I purchased this for casting my Chrome tabs from my mac so I can watch in browser videos and such. What they don't say is that casting tabs is still in beta and therefore really buggy and slow. There is a slight delay, and videos/audio stutter while they are playing perfectly fine in my chrome tab. There is nothing wrong with my internet connection, we have 80 Mbps throughout the house. I don't think the product can handle videos in tabs that well.", "verified": true, "helpfulness": "0/0", "author": "Alex Hosseini"}, {"rating": 5.0, "review": "Works great!  Easy to sync with iPad and iPhone", "verified": false, "helpfulness": "0/0", "author": "Kristin Lucas"}, {"rating": 5.0, "review": "This simple device is great for streaming movies and YouTube Videos. My husband had been watching his Netflix and Hulu videos on his computer screen, but that gets old when you have to sit in your desk chair. My son recommended this simple device, and we decided to try it. At the price, how could we lose.We love the streaming. We have a problem in our area getting good bandwith if everyone in the area is streaming movies at the same time. The Chromecast device solves this if you put in the extension. I'm not sure, but I think it buffers the signal and as a result we got fewer dropouts. It's a major plus when you can watch a movie all the way through.We did have one problem because we didn't realize the capabilities of our television. It has two HDMI ports. We thought we could easily switch from one to the other with the remote. It turned out to be harder than that, but reading the manual solved the problem. It turns out to be quite easy. So now we can attach both our DVD player and the Chromecast device. It's a shame we can't play DVDs on the computer and cast them to the TV, but maybe someday.I can't recommend this device highly enough. We love it.", "verified": true, "helpfulness": "0/0", "author": "Nancy Famolari"}, {"rating": 3.0, "review": "Worth the buy for the money you pay. Eventhough this is wireless, when I chromecast from my iphone, this works as fast as when I connect my laptop to the TV directly via HDMI cable. Unfortunately, I cannot chromecast from all my iphone Apps. Works for most popular apps though.The speed is slow when I chromecast from my laptop chrome browser. There is a huge lag and watching it is quite irritating. So I would recommend it only when you want to view from tablet or smartphone.", "verified": true, "helpfulness": "0/0", "author": "K. Tunga"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "William Patrick Boggs"}, {"rating": 5.0, "review": "The perfect partner for my TV!", "verified": true, "helpfulness": "0/0", "author": "Juan Castro"}, {"rating": 3.0, "review": "I do not like to say this, this product did not work on my equipment  I did give to my son and he is using it.I am sure it is a good product.", "verified": true, "helpfulness": "0/0", "author": "KAY HIGDON"}]