[{"rating": 1.0, "review": "The chrome cast was easy enough to install and set up but thats where it ended. It works OK streaming Netflix and YouTube from my MacBook Air, but it will not stream a tab from chrome no matter what I try. I spent about 3 hours trying to get this thing to work last night, and I am generally really good with technology. Every time I tried to cast from a chrome tab I got an unexpected fail type of error message. So now my choices are to call tech support and get frustrated all over again speaking to someone in a cube farm in a far away country, or send the damn thing back.", "verified": true, "helpfulness": "1/2", "author": "Arthur Rosenthal"}, {"rating": 5.0, "review": "We use this constantly! It allows us to stream music and videos straight from the computer or our phones in a quick and efficient way. No cords!", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "I have 2 TVs that are flat screen and HD but they don't have WIFI built in and they're not WIFI ready. The Chromecast fixed all this. I can watch Netflix or YouTube or I can view any tab on my computer screen. My wife and I watch movies on it 4 or 5 times a week, commercial free. If I want to I can sign up for other services, ie Hulu. It doesn't work on my old old Kindle fire, except YouTube, but what does, really? My take is \"get it.\"", "verified": true, "helpfulness": "0/0", "author": "tikisailor on utoob \"Tiki\""}, {"rating": 4.0, "review": "Bought these after reading several reviews and it works great for it's intended purpose - streaming Youtube videos, select apps, and screen sharing from Google Chrome. However, I'd have expected better compatibility with Android smartphones because it does not allow you to stream videos stored locally on the phone - and if it does, I haven't figured it out just yet. Quality is great, easy to set up, and works seamlessly. Would love to see the ability to stream music and video directly from my Note 2 or tablet like I can with my Roku.", "verified": true, "helpfulness": "0/0", "author": "Manoj N. \"interceptor_1972\""}, {"rating": 4.0, "review": "It Works great. Nice video quality and sound. It is not difficul to install, however if you pretend to use with other wifi net you will need to do the set up process again and  to reset the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Wilson Padilla"}, {"rating": 5.0, "review": "I love this thing.  I have a 6 year that LOVES watching cartoons on netflix.  I taught her how to use the ipad mini so she can beam her cartoons on the TV.  Its that easy, a child can use it.  I've been streaming movies thru my bluray but I'm thinking about buying a second one.  This thing is awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It was easy to set up and works fine with Netflix and YouTube, but not for casting Chrome, which is, after all, what it is named for, and the main reason I bought it. I have a fairly decent pc and good internet and it.just.doesn't.work. It's extremely choppy, and horribly out of sync, even at the lower resolution. I've since read it's better if you have top of the line equipment and super fast internet.", "verified": true, "helpfulness": "2/2", "author": "glenbren"}, {"rating": 1.0, "review": "Worked OK for months. After the latest Chrome \"update\" it crashes and is uselessGoogle is aware of the problem, but has done nothing", "verified": true, "helpfulness": "1/1", "author": "ieddyi \"ieddyi\""}, {"rating": 1.0, "review": "YOU BETTER BE A COMPUTER WIZ OR YOUR GONNA BE CHASING YOUR TAIL NO ONE TO CAKL FOR HELP JUST A VIDEO WITH A SPEED FREAK TALKING ..BUT BY ALL MEANS GIVE IT A TRY I M SENDING MINE BACK TO MUCH TO FOOL WITH ..", "verified": true, "helpfulness": "2/7", "author": "Mike P."}, {"rating": 5.0, "review": "Great device to convert your TV into a SMART TV. With google chrome, it even enables browsing on bigger screens and in bigger group streaming", "verified": true, "helpfulness": "0/0", "author": "Pradeep"}]