[{"rating": 5.0, "review": "LOVE THIS PRODUCT, ALREADY HAVE APPLE TV, THIS ONE BY FAR IS MUCH BETTER, THE REMOTE IS SO MUCH BETTER TO USE AND THE SIZE IS PERFECT, THE APPLE REMOTE IS TOO SMALL AND ALWAYS MISPLACED,ITS FAST AND MOST OF THE STUFF ARE FREE SINCE WE ALREADY HAVE PRIME UNLIKE APPLE, DEF WORTH THE 99$ PRICE", "verified": true, "helpfulness": "2/4", "author": "ziad k."}, {"rating": 5.0, "review": "I COULD NOT BELIEVE HOW SMALL AND FLAT IT IS.. BUT IT WORKS EASILY AND IS A PLEASURE TO USE. I HAD A BLU-RAY WIFI DVD PLAYER AND I THOUGHT THE DVD  PLAYER WAS THE BOMB... BOY WAS I WRONG.!! JUST PLUG IT IN TURN IT ON AND FOLLOW THE VIDEIO.. AND YOUR DONE JUST LIKE THAT.!!!!", "verified": true, "helpfulness": "1/2", "author": "LOVE ME MY AMAZON"}, {"rating": 5.0, "review": "I start off this review by stating that I am not the most technologically savvy person.Saying that, this Amazon Fire TV was ridiculously easy and quick to set up. Plug it in, and it gives you a brief tutorial and you are on your way.I have been using the Apple TV for many years and thought it was just okay. Because we don't use Netflix, I admit that we didn't use it very much. My husband enjoys the MLB network and we sometimes used it for that although he usually watches the games on his iPad.I have been an Amazon Prime member for many years and with their Instant Video service, it just seemed to make sense to switch to this Amazon device.It's been fantastic. It's easier to navigate and use than the Apple TV and I love the fact you can use the voice command and easily do a search that way. Now we have so many movies and TV shows available to us and it's just so much simpler to get to them. If you have Prime it just makes sense to switch to the Apple Fire TV.Highly recommended. (Note that there is no MLB access but not a problem for us.)", "verified": true, "helpfulness": "7/7", "author": "sb-lynn"}, {"rating": 4.0, "review": "Even though it is advertised as having 8 GB on board, when you check, it only has a little over 5.5 available. Some games are nearly 2 GB as stated on the games downloads on the Fire TV. Amazon should quickly enable the use of a USB stick to expand on board memory. Otherwise, you will have to continually shuffle games around or apps, to stay under the limit. The downloading of graphics takes a long time and this will quickly become tiresome. Mine only has 2 GB left. I also hesitate to fill the thing up and not leave some free space, so this even limits it more.Fills up fast.", "verified": true, "helpfulness": "6/6", "author": "MovieFreak"}, {"rating": 5.0, "review": "As of 4/9/14 the MLB.TV app is not yet available on it. I bought it assuming I would be able to immediately start using the MLB.TV app, but instead I now have to switch between the FireTV and my \"Smart Hub\" on my Samsung TV if I want to watch the Mets.It's not a HUGE deal at this point, but I was hoping to avoid using the Smart Hub apps all together.More pros/cons:Pros:- The design is sleek, small, and sturdy. I love all these things.- It's fast. I mean it. FAST fast. Navigation, searching, app load speed...FAST.- I'm connected via Wi-fi I haven't seen a single \"buffering\" notification. What? This is possible? Apparently it is.- VOICE SEARCH. I didn't think this would really be a big deal. I was wrong. It is *fantastic*. You don't realize how much you hate having to use your remote to plunk in letters to search for something/someone/some app until you DON'T HAVE TO DO IT ANYMORE. It's great. I only wish that I could use it to search Netflix as well. That's a bummer. I'm used to the Netflix app being horse crap anyway, though.Cons:- The previously mentioned missing MLB.TV app.- If you hate fingerprints and you're going to be looking at your FireTV every day, then use gloves when handling the box. It's a fingerprint magnet.- It has not yet made me dinner. Once it figures that last hurdle out I'll go ring shopping.I'll update my review once the MLB.TV app is available.**UPDATE 1/27/15** ...I guess it's never too late. The MLB app was added mid-season. It worked very well. I look forward to firing it up again once Spring Training starts. :)Overall, I'm VERY pleased with the Fire TV. It has streamlined my whole TV watching experience, is incredibly fast, and simply makes my life a little bit easier.", "verified": true, "helpfulness": "2/4", "author": "PDX"}, {"rating": 3.0, "review": "Packaged nicely and very easy to set up. But does not App for Aereo to get Free over the Air TV stations, Does not HBO Go, CBS Go, and other TV apps available to subscribers to cable and satellite providers. Didn't get March Madness App which was available free to anyone with internet connection. After set confusing on how to play \"Live TV\". Amazon needs to upgrade very quickly these simple changes to stay competitive", "verified": true, "helpfulness": "4/5", "author": "Joseph Calamari"}, {"rating": 4.0, "review": "I desperately want to cut the cord--baseball is the only thing keeping me from doing so because I live out of state from my preferred team, so I can't just watch \"over the air.\" (Plus, most baseball teams are on cable TV most of the time anyway...) So, bottom line, unless I can watch MLB.tv on my television set (without some jury-rigging involving a laptop or other PC device) it is essentially a \"no go\" on cutting the cord until winter.Otherwise a brilliant little box, though. If the streaming services you prefer are listed do not hesitate--this thing is awesome. A friend of mine has the NBA streaming thing and we're going to try it later--can't wait. Already love it w/Netflix. With a few tweaks this could easily be the killer set-top box app we've been waiting for.", "verified": false, "helpfulness": "1/1", "author": "T. Marsh"}, {"rating": 3.0, "review": "I purchased the fire tv not knowing that most features such as Prime is not avavaible outside of the USA. I only wish that they would have given amazon international users a heads up. disappointed .....", "verified": true, "helpfulness": "0/2", "author": "Renee T James"}, {"rating": 4.0, "review": "I DONT LIKE THAT FACT THAT YOU CANT TURN IT OFF...THE ONLY WAY TO TURN IT OFF IS TO UNPLUG IT AND THAT SUCKS!!! I HAVE ONE HD PLUG IN THE BACK OF MY TV SO I HAVE TO USE A HD SPLITTER  AND NOW WNEN I WANT TO PLAY A GAME OR SOMETHING I GOT TO UNPLUG MY FIRE TV...PLEASE FIX THAT..AND ALSO I DONT LIKE THE FACT THAT YOU PAY 99 DOLLARS FOR IT AND IF YOUR NOT A PRIME MEMBER YOU HAVE TO PAY FOR EVERY SINGLE MOVIE YOU WATCH IF YOU WANT TO WATCH AMAZON MOVIES, AND I KNOW AMAZON HAVE A LARGE SELECTION OF MOVIES..AMAZON NEED TO BE ALITTLE MORE LIKE NETFLIX WHERE YOU PAY A MONTHLY FEE AND I KNOW THEY WOULD BLOW EVERYBODY ELSE OUT THE WATER CAUSE THEY HAVE EVERYTHING...BUT YOU CAN GET OTHER APPS LIKE YOUTUBE, CRACKLE ETC. BUT THE MOVIES WONT BE IN HD....IF YOU HAVE NETFLIX OR ANYTHING LIKE THAT ...THE MOVIES WILL BE IN HD...I HAVE NETFLIX...BUT I LIKE IT THEY JUST GOT TO WORK OUT THE KINKS", "verified": true, "helpfulness": "0/7", "author": "knoxxgrim"}, {"rating": 3.0, "review": "I'm ready to send this thing back.  Is it fast? Yes.  It streams very quickly.  Why don't I love it?  This box would not work on my Vizio TV. I got perfect picture, but no sound  --at all.  I tried it on other TV's and it works fine.  Other streaming media devices work on the TV too.  I am still waiting for someone from Amazon customer support to call me back, which they promised to do, but didn't.  In addition, I wanted to take advantage of the games, which looked awesome, but, alas, the game controller is \"out of stock.\"  So, the box is just sitting under the TV doing nothing.  Then I found out that Android TV is launching soon.  Not sure I want to wait around for Amazon to beta test this on me, and wait for a controller, so I can take advantage of one of the main features of the box.  If Android TV launches any time soon.  Bye, bye Fire TV.", "verified": true, "helpfulness": "1/7", "author": "Jason M. Kosmiski \"JMKOSMO\""}]