[{"rating": 4.0, "review": "Everything is great but one major knock for me personally is the Plex app does not work at all. 5 stars after this is fixed.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Wonderful product!", "verified": true, "helpfulness": "0/0", "author": "Dora"}, {"rating": 5.0, "review": "Very good product. Hope it gets more content.", "verified": true, "helpfulness": "0/0", "author": "Michael Sanchez"}, {"rating": 5.0, "review": "Great gift", "verified": true, "helpfulness": "0/0", "author": "Kat C. \"Kat C.\""}, {"rating": 5.0, "review": "It works great!", "verified": true, "helpfulness": "0/0", "author": "gary j schill"}, {"rating": 5.0, "review": "Easy to use... love it", "verified": true, "helpfulness": "0/0", "author": "Kim M. Williams"}, {"rating": 5.0, "review": "I received this as a Christmas gift and I absolutely LOVE it.  So far so good, I love how fast it is, and all that is available, especially with my Prime Account.  So much more than Chromecast and Apple TV (older model).", "verified": true, "helpfulness": "0/0", "author": "C."}, {"rating": 5.0, "review": "Easy to set up and to use", "verified": true, "helpfulness": "0/0", "author": "jerry pratt, jr."}, {"rating": 5.0, "review": "This product was purchased because I had to go in for surgery and I knew I would not be able to do anything but sit in a chair and watch T.V.  I am extremely pleased with this purchase.  The box itself is not much bigger then a wallet so it fits right under the T.V.  I love the can do a search just by pushing the microphone button on the remote and talk and it finds it for me.  I would recommend this product to everyone.  I love mine.", "verified": true, "helpfulness": "0/0", "author": "Patty Fuller"}, {"rating": 2.0, "review": "Ultimately I am let down with this device.  I should have waited until the second or third version came out.  It did not stream seamlessly with either Netflix or Amazon Prime Video...and no, it was not my internet connection that slowed things down.  Most times what happened is that the video either wouldn't load or that it would load out-of-sync with the audio. My new Samsung Blu-Ray player streams flawlessly and loads faster than this Fire TV.I'm no fan of Roku (they won't work on certain televisions), but this failed to live up to the hype.  If you are trying to stream Netflix, etc. to your TV, then I urge you to seek out a good Blu-Ray player or WiFi connected TV set.", "verified": true, "helpfulness": "0/2", "author": "Justin"}]