[{"rating": 4.0, "review": "This is nice, it works well and as far as operation  goes should get 5 stars, I gave it 4 because it has limited apps, but for 35 dollars guess I can't expect it to be loaded like Roku.Easy to set up and use, Netflix works great, from laptop, phone or tablet. No real complaints just hope they add more channels..", "verified": true, "helpfulness": "0/0", "author": "William Chambers"}, {"rating": 5.0, "review": "I don't have cable so it works out great for when they family want to watch movies together on Netflix.  I love it my kids love it. I may have to order more. No issues.", "verified": true, "helpfulness": "0/0", "author": "Bernadine Williams"}, {"rating": 3.0, "review": "This is good. But deserves only 3.5 star. It's integration with YouTube (google's own product) is not good. The playlist videos do not automatically play and requires manual intervention for every video. You cannot play your own videos from your laptop. You cannot have more than one wifi setup with chromecast.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Pros:  easy to install, great pic, hours of enjoymentcons:  locks upOne fall a great new toy for our family", "verified": true, "helpfulness": "0/0", "author": "Jeni Whittington"}, {"rating": 5.0, "review": "The best choice in the market making the relationship cost vs features. It works for my preferences and is not expensive.", "verified": true, "helpfulness": "0/0", "author": "Francie Velazquez"}, {"rating": 5.0, "review": "Works great how ever once in a while it somehow disconnects from the wifi feed other than that it is great", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Nice look and feel. BUT Google has release the FW update in Dec.2013 which makes it impossible to root and allows only whitelisted apps to use. So not many thirdpaty apps to emrge soone. The selection of apps is poor, almost none native apps support Chromecast. You can't even playback your photos on TV without purchasing an app.", "verified": true, "helpfulness": "0/0", "author": "chvjak"}, {"rating": 1.0, "review": "Did not expected such a useless product from google. If you already have smart tv or Xbox or wii or ps3, you have option to pair your YouTube or play netflix, do not need to buy chromecast for the same. Chrome browser cast from laptop or desktop computer for watching streaming online movie is worst or just not possible.This device is only good if you do not have any other way to watch YouTube or Netflix on TV, which is generally very less chances of ppl have in current smart gudgets world!", "verified": true, "helpfulness": "0/1", "author": "Don"}, {"rating": 4.0, "review": "Everything advertised (and perhaps some more capabilities found after a simple search) works without an issue and I could switch content playback from tablet to TV and back as needed. I would have given 5 stars if there was an easier way to play all my local HD content as well without which I will need to continue to maintain a separate media player.I would also like to see if there is any option available to preset picture quality / bitrate while moving from tablet to TV (i.e. in tablet video player I could change settings to Low from default High at times I don't have full bandwidth needed but it gets reset to high after switching to TV)", "verified": true, "helpfulness": "0/0", "author": "Dhammike"}, {"rating": 1.0, "review": "Such device for its price should of been a given. The device definitely very easy to connect and use, but I won't recommend it for those who plan on using it to stream movies. As the sound quality lags and the movie doesn't follow. This would be great for presentation or things without audio, the sounds just doesn't connect very well. In my book this is definitely a disappointing device from google. Kind of seems like one of there engineer's weekend project, that failed!", "verified": true, "helpfulness": "0/1", "author": "pq121"}]