[{"rating": 4.0, "review": "Overall Chromecast works pretty well but there is plenty of room for improvement.  Only works with a few apps on an android device but works with most web sites via the chrome add-in. We have a very strong and dependable wifi network but connection drops periodically for no apparent reason.", "verified": true, "helpfulness": "0/0", "author": "Eric in CT"}, {"rating": 5.0, "review": "I've really enjoyed this thing.  It really does work well.  We just need more web sites to get on board so that ehier content can be streamed.", "verified": true, "helpfulness": "0/1", "author": "Bryan"}, {"rating": 3.0, "review": "First of all, I have a Wii that's set up with Amazon Instant video and Netflix, so the only reason that I got this was to be able to actually use Amazon Instant video without the help of my computer (not sure if anyone else has had this problem, but I can stream beautifully from my computer, but the Wii app just sucks and I can't get through anything without it having to buffer 4-5 times, but it doesn't do it when the computer it hooked up). I was a little dissapointed that I had to download another browser (I don't use chrome, and really didn't want to have to use it), but I did, and it does work to broadcast anything on the Chrome browser to the computer. It worked pretty well on the computer (better than with the Chromecast app on my iPhone, which I didn't get to work at all), but if you are able to hook up your computer to your TV (or you use your Wii), you really don't need this. At least not until Google is able to offer more apps than they have now.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Heather"}, {"rating": 5.0, "review": "This product is flying off the shelf in Alabama.  It works as indicated and have met all of the standards I have set.  It is worth the price.", "verified": true, "helpfulness": "0/0", "author": "Sylvester Johnson"}, {"rating": 4.0, "review": "A lot of bang for your buck for such a solid device.Now has Hulu Plus - tested yesterday with an iPad (can't wait til they bring it to web/iPhone as well), wish they had an option to continuously play all queued items though.Hoping for the additional features soon (which will increase my rating to 5*):- Local network playback from your computer.- Amazon Prime streaming- Vevo", "verified": true, "helpfulness": "0/0", "author": "Hun Kim \"I'm on a boat.\""}, {"rating": 5.0, "review": "I was lucky enough to snag this deal when 3 months of Netflix came with it. Just about pays for itself. Lets my friends control music and videos when I have parties. Also helps when my parents visit and want to look at things like pics from their latest trips.Not a necessity with the growing tech in tvs, but this is a nice piece of tech to have on hand!", "verified": true, "helpfulness": "0/0", "author": "soccer895"}, {"rating": 3.0, "review": "I like the idea of this, and would probably rate it higher if more apps were supported. If you have a smart TV, or a ROKU box, you really don't need this device. I have a ROKU box, and I bought the Chromecast to use on my bedroom TV. It works well but as I stated before, I cannot rate it higher until it supports more streaming media apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "nice i like it . it is cheap and Practical easy to use but sometimes it is crash i think becuse its beta", "verified": true, "helpfulness": "0/0", "author": "ordentlig renhold"}, {"rating": 5.0, "review": "Absolutely great. Using it daily.Wireless HDMI------------------- - Chromecast is like a Wireless HDMI for 35 bucks. - I use my Boxee mostly for watching youtube and netflix videos, and now Chromecast has replaced it.Tab/Screen Casting-------------------------- Tab casting works great for viewing most of the web pages with mostly static content. You'll experience lag while watching videos, audio might be out of sync.- Screen casting isn't great with my experience. It stops every now and then, stating network issue.Power Up-------------I have a Samsung LCD TV with Anynet+, so as soon as you enable Chrome cast streaming on your phone or PC, TV turns ON and it automatically switches to HDMI input on which Chromecast is connected. That is a great feature.Switching Control With Different Devices---------------------------------------------------Of course, you can play a video from your laptop, pause it from phone and resume it again from a tablet. Every device will detect chromecast and shows you what is being played so that you can control it from that device.Pretty Stable----------------Since its the first gen I was expecting occasional crashes, frozen screens, and other issues that might need us to reboot Chromecast. So far no issues whatsoever.", "verified": true, "helpfulness": "1/1", "author": "Rajiv Venkatesh"}, {"rating": 3.0, "review": "Chromecast is great if you want a way to stream Netflix, Hulu or YouTube to your TV screen.  But don't make the mistake I did thinking that the device would stream anything from your PC onto it.  I wanted a way to get online ABC or CBS episodes to transmit wirelessly to my TV but it doesn't do this.  Not yet anyway. Maybe at some point down the line they'll support these networks but for now it only works with websites and browsers that have a special Chromecast icon on it.", "verified": true, "helpfulness": "1/1", "author": "Kallaka"}]