[{"rating": 1.0, "review": "not many Apps that support it, you tube constantly crashes, Besides Pandora all the other apps are just not worth it", "verified": true, "helpfulness": "1/2", "author": "Ernie boy"}, {"rating": 3.0, "review": "which is kinda neat.  I'm not a tech guru so I don't know how many other plug in dealios you can just plug in and quickly set up (I doubt many), and have your computer's web browser on a big screen tv in your living room.  but I couldn't get the rest of my desktop to show, and for things like netflix, the quality degraded considerably between what I saw on my laptop monitor versus what showed on the tv.  which is of course to be expected when transmitting so much data on a stream, and my vid card may not be the greatest either, and then there's your home network doing double or triple duty for one objective (i.e. expectations should be adjusted).  but unfortunately, other streaming devices will give you better quality to your tv.  but they won't emulate your browser (PS3 browser I am going to single you out as utterly horrible here).  this plug in is truly a \"get what you pay for\" kind of thing, but praise to google for trying to take steps in the right direction.  someday soon this framework could be a lot more powerful and useful.", "verified": true, "helpfulness": "0/0", "author": "corpopolis"}, {"rating": 5.0, "review": "Its works as advertised. Once setup and updated, all the services and streams I have tested worked good including netflix, youtube and other streaming sites. Hopefully in the future they will add apps etc to make the experience much improved.", "verified": true, "helpfulness": "1/1", "author": "Syed"}, {"rating": 5.0, "review": "Gave this as a gift. Two weeks later got a call from the recipient thanking me and telling what a great gift it turned out to be for them.", "verified": true, "helpfulness": "0/0", "author": "L. Eugene Pelfrey \"lesgene\""}, {"rating": 3.0, "review": "Had no problem setting it up and worked great and then it didn't.  I have rebooted, reset and it will say ready to cast but want go any further. ITs in the room with my WiFi so its connected to it and says so anyone have any suggestions as to what I can do to correct this. .", "verified": true, "helpfulness": "0/0", "author": "S. Gautreau \"sgautreau\""}, {"rating": 4.0, "review": "Now that Google has released the SDK I look forward to have many other sources able to stream to the Chromecast out of the box, but it's the simplest way to watch YouTube videos on your screen, and quite simple to cast videos from your laptop too.I'd recommend this product to anybody that wants a cheap way to broadcast to TV.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Herrera"}, {"rating": 5.0, "review": "Items works as described in the listing.  No problems and I have been using it for several months at this point.", "verified": true, "helpfulness": "0/0", "author": "Dr. Lisa A. Burrell"}, {"rating": 2.0, "review": "I really figured that for $35 it wasn't going to work, but I had read all the reviews so decided to try it. Unfortunately, I was unable to install it on one of my TVs (which, although HD, is a few years old, and possibly the HDMI port was incompatible). The newer TV I have installed the chromecast software easily, but I couldn't stream from either my iPad mini or my iPhone 4 (the chrome icon didn't appear in YouTube, Netflix, or Hulu). So, if it isn't compatible with iOS, I missed that warning. Fortunately, Amazon returns are easy.", "verified": true, "helpfulness": "0/0", "author": "Valerie Anderson"}, {"rating": 5.0, "review": "I've never had a moment's regret getting the Chromecast. It's perfect. I use it to watch netflix all the time and it looks like a digital broadcast... cause it is. The only downside is that you cannot watch Amazon Prime Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Keith R. Jones \"Keith Jones\""}, {"rating": 2.0, "review": "Cannot cast everything from web from  IPad, Kindle devices. Limited to Netflix and couple other. Could use more improvements on this device", "verified": true, "helpfulness": "0/1", "author": "Shridhar Dixit"}]