[{"rating": 5.0, "review": "It took less than a minute to set up and does its job beautifully.", "verified": true, "helpfulness": "0/0", "author": "Marcus Phillip"}, {"rating": 5.0, "review": "Not bad for what it does. Shop around and you can usually find it on sale for around $29.  Limited usefulness with Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "OldOnliner \"OldOnliner\""}, {"rating": 5.0, "review": "Great product", "verified": false, "helpfulness": "0/0", "author": "Patricia H. Joyce"}, {"rating": 5.0, "review": "super little device! Unfortunately it doesn't work with Amazon Prime, but I have Netflix too, so that works  - - it is very easy to set up, too", "verified": true, "helpfulness": "1/1", "author": "Kathy Burkly \"bongobelle\""}, {"rating": 5.0, "review": "I love it. It works great. I like that anybody can use their phone or tablets to control it. Easy set up. Too bad I didn't see the Fire Tv Stick first, its the same price but with a control.", "verified": true, "helpfulness": "1/1", "author": "Gabriela"}, {"rating": 5.0, "review": "Easy to set up, just plug in and get started watching. Does not yet work with Amazon Prime instant videos, but great for other subscription apps such as Netflix and many others. I love that I can cast a show from my iPad Netflix app directly to my TV and then continue to use my iPad for other things while I watch my show.", "verified": true, "helpfulness": "1/1", "author": "Addi's Nana"}, {"rating": 3.0, "review": "It wasn't for me. Bought an apple TV, more money but much easier application.", "verified": true, "helpfulness": "0/0", "author": "A. Sera"}, {"rating": 5.0, "review": "Amazing device. I own 2 already and use them almost daily to stream movies from computer to 55\" TV.", "verified": true, "helpfulness": "0/0", "author": "Ryan Mercer"}, {"rating": 4.0, "review": "Works ok for the most part. I bought it to stream NFL games from my Verizon phone but I can't because the NFL won't allow it. Dumb.", "verified": true, "helpfulness": "0/0", "author": "Paul M"}, {"rating": 2.0, "review": "low quality streaming, but better than nothing", "verified": true, "helpfulness": "0/0", "author": "Douglas Shelley"}]