[{"rating": 5.0, "review": "Love it use it all the time !!~", "verified": true, "helpfulness": "0/0", "author": "androidguy"}, {"rating": 5.0, "review": "I wanted a very simple device to use for streaming services like Netflix and Amazon Prime.  This fills the bill just perfectly for me.  It is very easy to install and set up and works just as I'd hoped.  It's small size also means it doesn't take up any extra space like a box device would.  While it hasn't been a problem for me to use, the remote is very small, which might make it a bit tricky for someone with large hands or problems with limited manual dexterity to use.", "verified": true, "helpfulness": "0/0", "author": "Vicky Faurot"}, {"rating": 1.0, "review": "Wifi not good", "verified": true, "helpfulness": "1/1", "author": "Luis Villanueva"}, {"rating": 4.0, "review": "A lot of usefulness packed into a little device. That's the best way I can describe this.It is really snappy specially if you are using amazon services. I wish it could do the same with services as netflix but it is understandable that Amazon is trying to sell their brand.Using it makes me wonder how much better does the regular Fire TV is because if it is much faster than the stick is I'm sold.", "verified": true, "helpfulness": "0/0", "author": "P. Garcia \"HomeStudio\""}, {"rating": 4.0, "review": "I like everything about the fire stick except that there is no app for Yahoo Screen. That would bump it up to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Derek DeJean"}, {"rating": 1.0, "review": "The Fire stick is just a constant ad for Amazon Prime. If you have a Prime membership, or are interested in one, then you may like this device. Since I'm not a member, and don't want to be it was incredibly annoying. So I returned it and switched it out for another Roku. Many of the apps don't work without buffering for a long time. The display is not user friendly and it's hard to find apps. The Roku has a much better, easier set up and it's not pushing a product like the Fire stick does. Spend the extra $10 and save yourself some aggravation and just get the Roku stick.", "verified": true, "helpfulness": "0/2", "author": "lpnc"}, {"rating": 4.0, "review": "Works like any other of the Roku, Apple TV, chrome stick etc.  I have all of them Roku is still the best", "verified": true, "helpfulness": "0/0", "author": "Ddm33"}, {"rating": 5.0, "review": "I have the firestick and chrome cast both and personally I find the firestick easier to use because it's nice to just pick up the remote a few clicks and your watching TV.", "verified": true, "helpfulness": "0/0", "author": "James D. Hatcher"}, {"rating": 5.0, "review": "Pluged right in and was working great!  the remote is awesome and it allows you to play some of the games on it!  a must have for prime users.  the only thing i wish it did was control the volume on the TV", "verified": true, "helpfulness": "0/0", "author": "Larry Wigley \"Saldyan\""}, {"rating": 5.0, "review": "works great! Glad I got it.", "verified": true, "helpfulness": "0/0", "author": "JudyO"}]