[{"rating": 5.0, "review": "Great, convenient, wish it was powered by usb rather than having to plug it in (older TVs can't properly power via USB only).", "verified": true, "helpfulness": "0/0", "author": "BrotherDave"}, {"rating": 5.0, "review": "Easy set up.", "verified": true, "helpfulness": "0/0", "author": "13stars"}, {"rating": 5.0, "review": "Got rid of out $15 a month cable box and went with this for my daughters TV. Its very easy to use - my daughter is 5 and she's a wiz on it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Leanne Little\""}, {"rating": 5.0, "review": "Easy to install. A little confused if I need to pay for most of the movies and series I would like to watch.", "verified": true, "helpfulness": "0/0", "author": "liz rotondi"}, {"rating": 5.0, "review": "I bought the Fire TV Stick  so I could access Netflix and Amazon Instant Video when I was traveling. The device takes up very little room in a suitcase. Installation on a TV that has a USB port is very easy, and accessing a broadband network through the on-screen menu is pretty straightforward. I found that the Fire TV Stick's performance is excellent, but, of course, it's performance will depend a lot on how good the broadband is. I am very satisfied with this device and would recommend it. I should mention that you may not be able to access Netflix or Amazon Instant Video if you are out of the country. Recently, on a trip to St. Kitts, I was unable to access Amazon Instant Video, but I did get Netflix. That limitation was due to video viewing rights and not a lack of functionality of the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "G in Big D"}, {"rating": 5.0, "review": "Everything OK", "verified": true, "helpfulness": "0/0", "author": "Sebastian Levis"}, {"rating": 4.0, "review": "We do not have cable and with the stick we are able to enjoy movies, without paying the high cost of cable.", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 5.0, "review": "The Fire TV Stick truly works better than Apple TV, Google Chrome, or any preloaded Blu Ray/DVD Player I've used. The Speed and Transfer rates give better consistency with apps like Netflix and HBO GO, and the streaming music choices suit our families tastes.", "verified": true, "helpfulness": "0/0", "author": "Jonathan De Carlo"}, {"rating": 1.0, "review": "Only really works with prime  all additional apps freeze up and laggy", "verified": true, "helpfulness": "0/0", "author": "Chris casey"}, {"rating": 5.0, "review": "My dad suggested that I get this fire stick because I wanted to stream Netflix. It works Amazing! I even like the little remote!", "verified": true, "helpfulness": "0/0", "author": "Misty Meegan"}]