[{"rating": 1.0, "review": "From the reviews it appeared to be a good product but without an air remote it a waste of time. Not to my expectations", "verified": true, "helpfulness": "0/1", "author": "R S. Salandy"}, {"rating": 1.0, "review": "Still early on, but i dont know what all the excitement is all about, maybe it's just me?", "verified": true, "helpfulness": "0/1", "author": "Michael P. Terrick"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I find this product vastly superior to its competitors. I love how easy it is to set up and instantly acess my favorite programs in Amazon Prime and Netflix with only a few clicks on the remote. It's incredibly easy to travel with or move from room to room. The quality is high and I have had no trouble with buffering.My only complaints are very mild. The lack of a power button on the remote is confusing. I learned that the Fire Stick is supposed to \"sleep\" after a set time of inactivity but occasionally I have found it has required a restart to work properly after it's been in \"sleep\" mode. It has also occasionally changed the TV input to the wrong channel when I push the home button to wake it from it's slumber. I have avoided this problem by waking it with the back button.Overall, my complaints are minor and the fire stick is well worth it's price. Enjoy!", "verified": true, "helpfulness": "1/1", "author": "Sam Haggart"}, {"rating": 5.0, "review": "Best money spent", "verified": true, "helpfulness": "1/1", "author": "KAREN BROWN"}, {"rating": 1.0, "review": "Does not fully support Miracast. When I bought it the page said it did. Now it says that support for the product I wanted (with Windows 8.1) is coming soon. Apparently that was added some time in January. It is now the end of March.I hardly us it. It's slow and has a clunky interface. The upside is I got it for under $20. Otherwise I would not recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Jay S. Mills"}, {"rating": 5.0, "review": "Works great and loads very fast", "verified": true, "helpfulness": "1/1", "author": "saroeun teang"}, {"rating": 1.0, "review": "Absolutely sucks. Will not connect to the internet any longer. When it was working, the remote lagged terribly and you would end up in the main menu repeatedly. It doesn't turn off easily and it doesn't even have a display clock unless you download one as a separate app. I called customer service and they told me I was just out of luck and gave me a 5 dollar credit. I want my money back and I will never buy another Amazon brand item again I will put this in my pile of broken junk with my dead kindles.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The Firestick is OK, but not sure why Amazon would release something that could not cast from a computer, like the Chromecast.  Doesn't make much sense to buy this when the Chromecast does more for less money.  Not being able to cast is a huge loss of a feature, so I don't recommend until Amazon adds this functionality.", "verified": true, "helpfulness": "0/1", "author": "Sledhead"}, {"rating": 4.0, "review": "User friendly in setting up.  My only problem was not a strong enough wifi signal.  After boosting my wifi signal, everything went as expected.", "verified": true, "helpfulness": "0/0", "author": "dave c,"}]