[{"rating": 4.0, "review": "It's a gift an in the Artic where it DOESNT work very well", "verified": true, "helpfulness": "0/0", "author": "Stormy weather \"Stormy weather\""}, {"rating": 5.0, "review": "Very pleased with the product", "verified": true, "helpfulness": "0/0", "author": "annie mosley"}, {"rating": 5.0, "review": "Works Great. So simple. Doesn't get any easier than this simple fire stick! It is worth your purchase!", "verified": true, "helpfulness": "0/0", "author": "David Kent Aalberts"}, {"rating": 5.0, "review": "Pretty awesome. I have an Apple TV for comparison. The fire stick is fast, comes loaded with everything you want and it's easy to set up. Very pleased at the price point", "verified": true, "helpfulness": "0/0", "author": "Benjamin Taylor"}, {"rating": 5.0, "review": "Works great -- the walk through video was very self explanatory.  I love that after you set it up on any TV you can just plug it into any other TV in your house and it works.  I have it with a trial Netflix account and have been using it a lot for that.  I am not sure if I will use it as much when it runs out.  Works great.  We love it and the kids love it!", "verified": true, "helpfulness": "0/0", "author": "erinrae23"}, {"rating": 4.0, "review": "I like it a lot", "verified": true, "helpfulness": "0/0", "author": "angela hardin"}, {"rating": 5.0, "review": "Great option for watching Prime videos or using other souces of streaming content, like music or SlingTV. Its beyond easy to install and the remote is simple, but well designed. There is also an phone app you can use as a remote as well.", "verified": true, "helpfulness": "0/0", "author": "Lalatack"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Louise Giordano"}, {"rating": 5.0, "review": "A better product than I expected; fast, reliable and worth the Prime Membership!", "verified": true, "helpfulness": "0/0", "author": "Al Fields"}, {"rating": 5.0, "review": "This item has met my full expectations. Easy to use and set up (even has a cartoon guide to help you through it). Arrived on time and in great condition. So far I have only used netflix but you can use Amazon prime, purchase and play games and many other sources of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}]