[{"rating": 3.0, "review": "Sadly, Showtime Anytime is not supported for DirecTV customers. No Starz Play and no HBO Go. Works great for the apps it does have.", "verified": true, "helpfulness": "0/0", "author": "C. Gehlker"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "sheila"}, {"rating": 4.0, "review": "Wish it had HBO GO", "verified": true, "helpfulness": "0/0", "author": "akster"}, {"rating": 5.0, "review": "Works great! great receptions!", "verified": true, "helpfulness": "0/0", "author": "Jodi Biasiucci"}, {"rating": 1.0, "review": "I received this before Christmas - hooked up and nothing...  It displayed \"Amazon\" momentary  then blank.  Subsequent hookups/power up/down did not display anything.  Tried on another TV too.  Maybe some quality control is in order.  Garbage...", "verified": true, "helpfulness": "1/1", "author": "Big nerd"}, {"rating": 5.0, "review": "Very easy set up, was online in just couple of minutes. Love the movies, tv series and specially the music playlist. Meet and exceed my expectations too.", "verified": true, "helpfulness": "0/0", "author": "Natalie Martinez \"technicagirl\""}, {"rating": 5.0, "review": "oh my! what a deal! except i thought Netflix was included with the deal.", "verified": true, "helpfulness": "0/0", "author": "CATHOU"}, {"rating": 5.0, "review": "Purchased this as a replacement for an older Roku model--extremely fast compared to what I was accustomed to.  Love that it comes with a remote (as opposed to Roku/Chrome).  Biggest downside the lack of HBOtv, which is supposedly coming in 2015.", "verified": true, "helpfulness": "0/0", "author": "pwillunlv"}, {"rating": 1.0, "review": "This thing would be great if it had better wifi capabilities.  I figured with new tech it'd work better, but this is just... awful.  It doesn't achieve or hold an internet signal in rooms where every other wifi tech I have, connects just fine.  I'm extremely disappointed with this.  It will be unlikely that I purchase another one, or even an actual Fire TV.  Which is very unfortunate since I tend to support amazon a great deal.  All they needed to do was give it some good wifi technology.  Amazon fail.", "verified": true, "helpfulness": "1/1", "author": "aperfectsircle"}, {"rating": 4.0, "review": "My biggest gripe abouut this item is that it doesnt have volume control. I have to keep the control for my TV handy just to alter the sound volume.Other than that this thing has been really nice bought an app to stream from my file server to ym tv.I only paid $20 for this as a Prime member but if I had to pay $40 for it I would have gone with the Android tv ones that are sold on Amazon.", "verified": true, "helpfulness": "0/0", "author": "Hugo Estrada"}]