[{"rating": 5.0, "review": "This is better than I ever imagined . Love it!", "verified": true, "helpfulness": "0/0", "author": "keb"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "David Swierk"}, {"rating": 5.0, "review": "Very pleased with the Fire Tv Stick.  Was happy to have gotten in on the $19 initial offering, and eagerly snapped up another at $24 for their PrimeDay.  Great for Amazon Prime videos, Netflix, HBO Go.  I use Plex to stream movies from my PC to tv's...works wonderfully with the Amazon Fire Stick.  I don't game so can't imagine any reason to go with the $100 Fire Tv when the Fire Tv Stick does the job.If I could do AirPlay reliably and well, I'd give up my AppleTv", "verified": true, "helpfulness": "0/0", "author": "Jerry L. Harrington \"leebase\""}, {"rating": 1.0, "review": "When I set up my new fire stick, my original one quit working. Are you only allowed to use one in a household?", "verified": true, "helpfulness": "0/1", "author": "Wistaria"}, {"rating": 5.0, "review": "I got the Fire stick because the Amazon Instant Video app kept crashing my Roku, and I figured that the Fire stick would work better for Amazon Instant Video.  It did more than that:  now it has pretty much replaced Roku for me.  Fire stick is faster and easier to use, and seems to have more content available in general.", "verified": true, "helpfulness": "0/0", "author": "K. Dahl"}, {"rating": 1.0, "review": "Always drops signal and is always buffering. More of a headache than anything.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and works great - the included games are a nice bonus.  This is especially good for users with a Fire Phone (or any prime members who use the photo service) as it includes a nice Photos link that allows you to view all of your pictures through the TV.  That noted, my main use is watching Amazon Prime and Netflix content and it does that nearly perfectly.  It was especially nice to get a great deal on Prime Day.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Anthony Polycarpe"}, {"rating": 4.0, "review": "Works fine but sometime lagging.", "verified": true, "helpfulness": "0/0", "author": "lien"}]