[{"rating": 1.0, "review": "Has to be plugged in at all times.  Very deceiving", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 2.0, "review": "If it is an Amazon approved app it will run okay, but running 3rd party apps will have you jumping through hoops. The Amazon Fire stick stalls a lot. We have a 110 Mbps cable connection so I know that internet speed is not the issue here. The remote that came with the Fire stick is complete ((GARBAGE)). Everything that you click on will register several clicks per one click of the remote. This at one point even caused an unwanted app purchase. Trying to search using the on screen typing with this remote was impossible because it inputs several clicks for every one click of the remote. I tried to remove batteries and even tried reconnecting the Bluetooth. The remote lost connection or would get stuck constantly and keep selecting things without even touching it. I took the batteries out and disconnected it from the Bluetooth. I then got the remote app for my I-phone and the Fire stick works much better, but it still stalls regularly. If you have a Amazon Prime account, which we do then I would say this is an okay device. I decided to explore 3rd party apps and how to install them due to lack of performance and the lack of third party supported apps. You can push 3rd party apps to the Fire stick using your computer once you establish a wireless connection and locate the ip address on your local network. Wish it allowed internet browsing and the ability to check email. There are many things that the Fire stick will do if you take the time to learn about third party apps and how to install them, but that is up to your discretion. The Fire stick is pretty lame unless you have a Amazon Prime account. The regularly sluggish lack luster performance will have you looking at other brands. The picture was good and sound quality okay, but nothing like having cable or satellite.", "verified": true, "helpfulness": "0/0", "author": "Heavysteel"}, {"rating": 3.0, "review": "OK so I was very excited to get the fire stick.  Mostly because I just discovered Twitch and wanted to watch poker and gaming.  Well twitch doesn't stream in 1080, you can't log in to see the channels you follow, and there is no search function.  You have to scroll through the list of channels 1 by 1 which is sorted by number of viewers.  If you dont know how many people are watching the channel you want to see at that very moment, good luck.  It also just boots me out of the channel pretty fequntly either back to the previous screen or the home page.  There are plenty of cool things about it and when I have found the channel I want on twitch i forget how frustrating it was to get there.  Had a $25 gift card when I bought it so for the price I cant complain.  But when it comes to the twitch app I really have to...Amazon, you OWN Twitch! C'mon you're better than this...", "verified": true, "helpfulness": "0/0", "author": "toorude89"}, {"rating": 4.0, "review": "Good streaming dongle for the price, but continues to drop wifi and requires power cycle everytime.  New OS update seems have improved it, but still happens.", "verified": true, "helpfulness": "0/0", "author": "Ding Dong"}, {"rating": 4.0, "review": "arrived on time and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use!  I have not taken it on the road yet though.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love it so much", "verified": true, "helpfulness": "0/0", "author": "Jean Bruschi"}, {"rating": 1.0, "review": "Nothing but continual problems for Netflix", "verified": true, "helpfulness": "0/0", "author": "Joseph Unthank"}, {"rating": 5.0, "review": "Does exactly as advertised.  Good value for the money", "verified": true, "helpfulness": "0/0", "author": "Chris Lofgren"}, {"rating": 4.0, "review": "This is a great device", "verified": true, "helpfulness": "0/0", "author": "William Hudson"}]