[{"rating": 3.0, "review": "It does not tell you that you must use a secure wifi connection. I travel  quite often. Useless when I'm on the road.", "verified": true, "helpfulness": "0/0", "author": "mykeens"}, {"rating": 1.0, "review": "It was working fine an now it will not connect to my internet.", "verified": true, "helpfulness": "0/0", "author": "Terri L. Daniel"}, {"rating": 5.0, "review": "Absolutely love it, so easy!  I could not believe how many apps were available. I ordered it for my bedroom tv and within a week I purchased another for the living room tv. I bought one voice remote , which I love, but for the other tv I just downloaded my iPhone with the app which allows you to use it as a voice remote as well.", "verified": true, "helpfulness": "0/0", "author": "Pamela Reed"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Philip Streib"}, {"rating": 3.0, "review": "So far I've had it for a week and a half.  I searched for a couple of movies that were not list in the guide and all three of them were available at a price of 3.99.  Now that's not a lot of money, but....So I'm not that impressed at this point.  Perhaps as I get to use if more, I may enjoy it more.", "verified": true, "helpfulness": "0/0", "author": "Carmelo Assenza"}, {"rating": 1.0, "review": "Apparently, my internet speed is not fast enough.  Plus I did not know that I would have to play my router as close to the product as possible to maximize reception.  This is (in my view) unsightly.  I have to return the product.", "verified": true, "helpfulness": "0/0", "author": "Sandy Buerle"}, {"rating": 5.0, "review": "Worked exactly as advertised.  Could not be more pleased.", "verified": true, "helpfulness": "0/0", "author": "Ean Sullivan"}, {"rating": 4.0, "review": "So far, so good!", "verified": true, "helpfulness": "0/0", "author": "Robert E."}, {"rating": 5.0, "review": "Wish we would have bought it sooner!", "verified": true, "helpfulness": "0/0", "author": "Sandra Simons"}, {"rating": 4.0, "review": "I did get it to work.  WiFi reception is a bit tricky given that the \"stick\" is behind the TV, which is in a build-in enclosure.", "verified": true, "helpfulness": "0/0", "author": "JJS \"JJS\""}]