[{"rating": 5.0, "review": "Absolutely love it.  My 3rd one.  One for me, hasband and grandkids", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"dlariviere\""}, {"rating": 1.0, "review": "Sling TV does not work. Blank screen.", "verified": true, "helpfulness": "0/0", "author": "woohooo"}, {"rating": 5.0, "review": "I am really enjoying the fire stick, there is something for everyone to enjoy!", "verified": true, "helpfulness": "0/0", "author": "Pacia Smith"}, {"rating": 5.0, "review": "Great. Hookup was easy. Didn tv fit my toshiba in side hdmi because of the shape but i just moved something from back of tv hdmi and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"JEAN C FINNEGAN\""}, {"rating": 3.0, "review": "Meh.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to install. Would like to see larger selection of movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Pawson,J"}, {"rating": 5.0, "review": "Due to software updates, I found that my blu ray would no longer be able to stream youtube so I purchased the Fire Stick as a replacement. I discovered the stick works even better than the blu ray ever did at searching by offering suggestions and had more available videos. I wish I had gotten it sooner. I also enjoy using it with my Amazon prime membership and mirroring my kindle fire where I stream movies from TCM. It takes a bit of effort to mirror the kindle fire, at least for me but it is worth it.", "verified": true, "helpfulness": "1/1", "author": "graphics guru"}, {"rating": 5.0, "review": "Works great..", "verified": true, "helpfulness": "0/0", "author": "pedro espinoza"}, {"rating": 5.0, "review": "Amazing but then again maybe I shouldn't have gotten it because now my social life is in shambles when all I wanna do is binge watch EVERYTHING just now on a bigger screen. Smh. But ya it's great and you should get one too so we're in the same boat.", "verified": true, "helpfulness": "0/0", "author": "Breanna Wyant"}, {"rating": 3.0, "review": "Great for viewing Amazon Prime, but I cannot figure out how to cast my netflix subscription using this device.", "verified": true, "helpfulness": "0/0", "author": "Esther Walker"}]