[{"rating": 4.0, "review": "The Firestick was very easy to install and it works fine. It's a lot faster and less expensive than the other streaming device on my living room TV (an RCA box). I would recommend to others for ease and convenience of operation. I love it when something does what it's supposed to do!", "verified": true, "helpfulness": "0/0", "author": "Pete Scaltrito"}, {"rating": 5.0, "review": "I figured I'd try the fire stick because I've been wanting to make the break from cable.So far I've been streaming Netflix and Amazon Prime selections, and I think I'm falling in love with this thing and very soon I'll be unplugging from the over priced cable masters.", "verified": true, "helpfulness": "1/1", "author": "Ronault D. Trowbridge"}, {"rating": 3.0, "review": "Too many movies that either you have to purchase or rent. Not enough of the movies are free to watch like on Netflix. Kind of a disappointment.", "verified": true, "helpfulness": "0/0", "author": "cdicki"}, {"rating": 5.0, "review": "Great for the price. Prime makes it awesome", "verified": true, "helpfulness": "0/0", "author": "Don Boland"}, {"rating": 5.0, "review": "Great product! Easy to use, very small and convenient. It would be better if I could use my own TV remote but it's still ok. If you are looking for a way to watch Hulu Plus, Netflix or Amazon Instant Video on your TV in a cheap and good way, this is your product.", "verified": true, "helpfulness": "0/0", "author": "Gökhan Kul"}, {"rating": 2.0, "review": "Cute little device. The user interface could use some refinement. Unfortunately the device will not maintain an internet connection. Perhaps I just received a defective unit. Should have bought the Roku.", "verified": true, "helpfulness": "0/0", "author": "MadMarc"}, {"rating": 5.0, "review": "Absolutely LOVE this!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Once we figured out how to get audio with our surround sound (connect Fire Stick to receiver instead of TV), it worked flawlessly and easily. No skipping or buffering - fast response time. Now to program our smartphones, although included remote control works well. Have to give credit to Edward Jones' book, \"Amazon Fire TV Stick Made Easy\" for helping us with surround sound connection, as well as many other practical hints. We purchased this stick to take advantage of Amazon Prime, and are now watching HBO miniseries for the first time. A great little gadget!!", "verified": true, "helpfulness": "0/0", "author": "Bourne, Cheryl"}, {"rating": 4.0, "review": "I cancelled my cable service because I was tired of paying $200+ dollars for the same movie selection every month. I received my Amazon Stick before scheduled date.  I ordered three, one for me and one for each of my daughters. The 14 year old is enjoying the games; the 18 year old is disappointed about the movie selection as most of the pictures she wants to see, are for a fee. I also have Amazon prime for is to watch TV shows and movies. I have a Roku box and wanted to compare the differences. The Amazon stick have fewer apps than the Roku. The Roku have over 200 apps and the Amazon Stick have 81 apps. The set up for the Amazon is easy and takes only min before you're watch movies. The picture quality is excellent and no buffering or hesitation that you will sometimes get with the Roku. I really would like to see more apps, and add new movies weekly. Over all I like the stick so I'm keeping it. But I can't put up my Roku box yet.....(crackle) (Hulu) the best thing of all I save $200 dollars monthly.", "verified": false, "helpfulness": "0/0", "author": "Keisha Taylor"}, {"rating": 5.0, "review": "Purchased for our sons room! Works great!", "verified": true, "helpfulness": "0/0", "author": "Collins05"}]