[{"rating": 5.0, "review": "Pretty cool!  Love being able to watch the movies on our TV versus the iPad or Computer.", "verified": true, "helpfulness": "0/0", "author": "M. Britt"}, {"rating": 5.0, "review": "Love it but I am tech challenged.  I need to know what is free and what is not.  Have I just not opened up enough.  If I need to pay for something will it say so.  How I go t you tube one ,I do not know.", "verified": true, "helpfulness": "0/0", "author": "bonnie swann"}, {"rating": 1.0, "review": "Shame on Amazon; They don't tell you up front that you need a full Prime membership even though you might be an invitee and have an \"invited prime membership\"  through a family member.  So, Amazon is charging me an additional $99 and the way I found this out is in my monthly billing on the credit card .The right thing to do is  to warn people that \"family Prime\" does not cover all Fire TV Stick functions and that you need a full $99 Prime membership. I would like to return this but it was past one-month when I was aware  of the details.", "verified": true, "helpfulness": "0/0", "author": "ee422"}, {"rating": 4.0, "review": "Pretty good for the price.. Would be better with Prime!", "verified": true, "helpfulness": "0/0", "author": "Timothy Dinkins"}, {"rating": 4.0, "review": "It's good but they need more TV channel apps and providers.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Campos"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "u060033"}, {"rating": 3.0, "review": "I can honestly only give this device a 3 star rating due to its poor portability. The remote is absolutely ESSENTIAL to using this device. If you lose/forget the remote and you're on a trip, the Fire TV stick is worthless. Why? Because you cannot join a new wifi network without the remote.  In order to communicate with the device and set up a new wifi connection (at a hotel for example), you must have the remote. The Android/iOS app is not capable of talking to your Fire TV stick unless it's already connected to the wifi. But if you don't have the remote...you cannot connect to the wifi. See the problem here?All in all, it works if you plan to plug it in at home and just leave it there. My goal with the device was to take it over to friends' house and use it as a portable player. Requiring me to constantly remember the remote makes that far less appetizing. For portability, go Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Garrett Gyssler"}, {"rating": 5.0, "review": "Awesome little device. Can't beat the quality for the price.", "verified": true, "helpfulness": "0/0", "author": "Polanski"}, {"rating": 5.0, "review": "Great product. was super easy to set up. even though it creeped me out that it knew my account already.", "verified": true, "helpfulness": "0/0", "author": "CorrienteLatina, LLC"}, {"rating": 5.0, "review": "This is pretty cool", "verified": true, "helpfulness": "0/0", "author": "Drake Daigle"}]