[{"rating": 5.0, "review": "Love it! I have chrome cast and Apple TV too. Fire stick is the best one so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use and set up.  This would be something nice to take to places if you wanted access to netflix on a TV.", "verified": true, "helpfulness": "0/0", "author": "amaughan"}, {"rating": 5.0, "review": "The set-up was quick and easy and it fit our needs perfectly for the TV in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Toni C. Butler"}, {"rating": 5.0, "review": "Well worth the price. There are many shows that are not available on NETFLIX.  We have been watching a compelling historical TV series, John Adams.  I like the suggestions that come from Amazon about similar shows.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "Love it.  Very easy to set up.  Easy to use.  The only regret is that I didn't purchase it sooner.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Bodnar \"kathy loves stitching\""}, {"rating": 4.0, "review": "😊", "verified": true, "helpfulness": "0/0", "author": "maricela"}, {"rating": 5.0, "review": "Love, love, love the fire stick. It is so convenient. I use it on my bedroom TV, but i also take it with us when we travel. This way we don't have to worry about brining DVD's for the kids to watch. I use this for both Amazon prime streaming and Netflix. My kids just discovered you can download game apps. I have taken it to florida for our disney trip, on our ski vacation and taken it with us when we go to our families for dinner since they do not have cable. Its is perfect.", "verified": true, "helpfulness": "0/0", "author": "FlanNH"}, {"rating": 5.0, "review": "Simply amazing. Instead of having to use my bulky PS3 for streaming now I have this nice little device. Does everything you could want it for and more. A must have for any living room or bed room. Why stream shows on a laptop ever again?!", "verified": true, "helpfulness": "0/0", "author": "Ara Sardarbegians"}, {"rating": 5.0, "review": "I love the new fire stick. I'm glad it came w the remote. It works and does like it said it would. Haven't had problems watching movie or tv shows, my son has even played a few games with it. Its so much cheaper than a smart tv. I've been telling friends and family bout it.", "verified": true, "helpfulness": "0/1", "author": "sunnyd"}, {"rating": 5.0, "review": "So easy to use and quick installment! Has apps and games. Don't have to have be an Amazon prime member. But if you are u get soooo many perks.", "verified": true, "helpfulness": "0/0", "author": "Claudia Perez"}]