[{"rating": 5.0, "review": "Excellent value if you have Prime. Easy to set up and use. Well worth the money for the convenience when connecting to movies with the stick instead of using your computer.", "verified": true, "helpfulness": "0/0", "author": "D. Murphy"}, {"rating": 5.0, "review": "great love all the choices", "verified": true, "helpfulness": "0/0", "author": "Miss Lu"}, {"rating": 4.0, "review": "I love the Fire TV Stick. My old blu-ray player wouldn't stream very well anymore, so I decided to try this. Setup was simple and quick and I have no complaints about the performance. The only reason I didn't give five stars is because the print is a little hard to read from a normal viewing location. It doesn't hinder what I need often, but I occasionally have to get up to read something on the menu.", "verified": true, "helpfulness": "0/0", "author": "Melody Cooper"}, {"rating": 5.0, "review": "Amazing.  Plug and play. Easy to set up.  Wow!", "verified": true, "helpfulness": "0/0", "author": "Amy Oliver, DVM"}, {"rating": 5.0, "review": "The fire TV Stick is just what I needed for viewing movies without cable premium channels. Excellent choice", "verified": true, "helpfulness": "0/0", "author": "vaughn white"}, {"rating": 5.0, "review": "The Firestick is terrific.  I am able to watch movies on our tv screen and view photos.  The really nice thing  is my husband can view these with me.THE", "verified": true, "helpfulness": "0/0", "author": "betty boop"}, {"rating": 5.0, "review": "My wife and I are enjoying movies all genres now", "verified": true, "helpfulness": "0/0", "author": "Skyhook"}, {"rating": 1.0, "review": "Not compatible with our Denon surround sound receiver", "verified": true, "helpfulness": "0/0", "author": "Joel N."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Blaine L. Johnson, Ph.D."}, {"rating": 5.0, "review": "This has already become one of those things that I wondered what I ever did before I had it.", "verified": true, "helpfulness": "0/0", "author": "Frances McMahon Ward"}]