[{"rating": 1.0, "review": "Sucks buy a roku YouTube works on those", "verified": true, "helpfulness": "0/1", "author": "Vincent  Parra"}, {"rating": 5.0, "review": "I have only started using it, and tomorrow I cut the cord and my DirecTV is going to be a thing of the past to save money. So far I have watched some Netflix and Hulu and I am very happy. I am thinking about taking the Sling deal so I can get a second for a different room.", "verified": true, "helpfulness": "0/0", "author": "K. Hicks \"Geek Girl\""}, {"rating": 5.0, "review": "I REALLY LOVED IT BUT AFTER YOUR 30 DAYS FREE TRIAL THEY CHARGED ME FOR A YEAR OF PRIME AND YOU STILL HAD TO PAY TO WATCH ALOT OF MOVIES AND I THINK AFTER YOU PAY FOR A YEAR WHY MAKE YOU HAVE TO RENT MORE MOVIES THEN YOU GET FREE ,,,,,,I CANCELL ,,,,,", "verified": true, "helpfulness": "0/1", "author": "tina  vance"}, {"rating": 5.0, "review": "I was a doubter but this is totally legit. Simple controller very intuitive. Firestick menu layout is similar to netflix scrolling.", "verified": true, "helpfulness": "0/0", "author": "Kevin O"}, {"rating": 4.0, "review": "We've had our Fire Stick for about 2 months and we are really enjoying it. We got it when we cut our cable. Amazon content comes in clearly and quickly without buffering/downloading/etc. I haven't been thrilled with some of the 3rd party apps (Hulu plus runs pretty slowly for us- probably because we have slow internet service. It buffers frequently, but not so much I can't watch- just enough to be annoying). Overall, I am pleased with the Fire Stick and would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "I am so happy I finally bought this. I just wish I hadn't waited so long now...We love it.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "Love It!!", "verified": true, "helpfulness": "0/0", "author": "becki odell"}, {"rating": 5.0, "review": "The new Amazon Fire TV stick is a home run!  I have it attached to my HD projector on our screen porch.  Makes family time on the porch way more enjoyable.  Compared to the old Roku that we used,  the Fire TV Stick is light years ahead in speed, performance and functionality!", "verified": true, "helpfulness": "0/0", "author": "Matthew Jaeger"}, {"rating": 1.0, "review": "I thought I would love the fire stick. It would allow me to stream all of my son's favorite prime.shows. unfortunately, it performs terribly due to the fact that it can't hold a wifi signal. You gotta do better and put a stronger receiver in the device Amazon.", "verified": true, "helpfulness": "0/0", "author": "BTN"}, {"rating": 4.0, "review": "Glad I got it", "verified": true, "helpfulness": "0/0", "author": "reco"}]