[{"rating": 2.0, "review": "I bought this as a replacemente for my chromecast, hoping among other things to have a much better performance in terms of network reception and responsiveness. The former was particularly critical as I have it on my secondary TV, far from my router and connectivity from Chromecast is spotty (5GHz band won't reach it). I was much disappointed to find it was much worse from the Fire Stick. Netflix took forever to load a movie, and much longer to reach HD quality, being unable to sustain it for long. By comparison, Chromecast loads much faster and tends to sustain HD quality most of the time. Connectivity even dropped several times while navigating the menu, making every feature unusable when it happened.Add to this, the official Android app does not work on any of my devices (I have an Android 4.4.2 tablet and an 5.0 cellphone as well as an older 4.2), so for the moment I am stuck with the remote for typing password and search terms.I haven't even been able to download YouTube as of now, or tried casting apps, so I might be updating this if I manage to, but my first impressions are dismal. I would return it if it wasn't expensive for me (don't live in the US)", "verified": true, "helpfulness": "0/0", "author": "Sebastian"}, {"rating": 5.0, "review": "Liking it", "verified": true, "helpfulness": "0/0", "author": "Susan Elgar"}, {"rating": 5.0, "review": "Work really great and love the cost", "verified": true, "helpfulness": "0/0", "author": "jason florence"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick.  Love the Prime Movies that are free with membership.", "verified": true, "helpfulness": "0/0", "author": "Jane E. Mays"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Millie"}, {"rating": 1.0, "review": "Great concept.  Easy to use.  Constant delay in the screen. No other internet items in the house have any issues.  Such poor delays we've stopped using it. If it processed faster it would be great.", "verified": true, "helpfulness": "1/1", "author": "Andrew"}, {"rating": 4.0, "review": "Does what it is suppose to do ok.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Taylor \"WebDesigner\""}, {"rating": 2.0, "review": "No. I'm not too happy with the product.", "verified": true, "helpfulness": "0/1", "author": "Roxie Deleon"}, {"rating": 5.0, "review": "Binge watching Orange is the New Black sure made the Fire TV Stick was of the best purchases I've ever made. If I never use it again (I know that I will though) that show alone made my purchase well worth it!!!", "verified": true, "helpfulness": "0/0", "author": "Joan M."}, {"rating": 5.0, "review": "It's awesome. ,we love it.", "verified": false, "helpfulness": "0/0", "author": "ysioufi"}]