[{"rating": 2.0, "review": "fair", "verified": true, "helpfulness": "0/0", "author": "shirley"}, {"rating": 4.0, "review": "Love the stick, and the remote is a cool feature.  If Amazon Prime allowed you to rate what you just watched, a lá Netflix, this would be pretty near perfect.", "verified": true, "helpfulness": "0/0", "author": "James Bunch"}, {"rating": 5.0, "review": "Works like a dream. Smooth and intuitive.", "verified": true, "helpfulness": "0/0", "author": "Happy Infidel"}, {"rating": 5.0, "review": "Good deal for the price.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Guertin \"the woodworker\""}, {"rating": 5.0, "review": "Just what I needed..", "verified": true, "helpfulness": "0/0", "author": "John Romeo"}, {"rating": 5.0, "review": "Great product, I really like the interface and the updates have been great!", "verified": true, "helpfulness": "0/0", "author": "Joshua M Karsten"}, {"rating": 4.0, "review": "Some occasional minor stuttering which I do not see when running netflix on my PS3 but still a great little deivce.", "verified": true, "helpfulness": "0/0", "author": "Racer X"}, {"rating": 5.0, "review": "I have a smart TV but accessing the apps are painfully slow. I also wanted to be able to access PBS so I tried using the web browser on my smart TV. This did not work well at all. Then bring in the Fire TV stick. This thing is plug and play (except mine was in German but Amazon tech support provided Amazon's usual outstanding service). It is so much faster than my TV interface and very intuitive.  You can access all the usual suspects (Netflix, Hulu, Pandora, etc) but for my son, PBS was all he cared about. There are lots of apps to chose from (some requiring either paid subscription (Netflix, Hulu, etc), account set up (Pandora) or cable TV (Disney, ABC, etc). For Prime members, you can access all the free movies and TV series. You can also use it on other TVs or during travel.  Great buy!", "verified": true, "helpfulness": "0/0", "author": "Jodi \"irongrl\""}, {"rating": 5.0, "review": "I am not technologically inclined so I was concerned this would be a bad experience. Read the very short instructions sent to my email, plugged it in, cartoon character appears on the screen with a short tutorial ...and in 5 minutes I am watching an Amazon prime movie.  Amazing!!  Just remember you need to know the password to your network when you first sign on.", "verified": true, "helpfulness": "0/0", "author": "JoAnn"}, {"rating": 5.0, "review": "In my 6 year olds room so that she can watch her shows. Great parental controls and ease of use.Will be ordering a couple more.", "verified": true, "helpfulness": "0/0", "author": "Kati Morris \"Kati\""}]