[{"rating": 3.0, "review": "We have had the firestick since christmas.  I love how it connects to everything that we stream to and the size of the connecting device.  I do not like how it disconnects to the internet (1-3 times a week) and you have to manually unplug the device in order to reconnect it.  I attempted to do it using the remote but it would only reconnect using this method.  I also think that the remote is a little bit too small.  We lose it all of the time, it blends in very easily with what we have in our house.  I also don't like how when you have on the parent settings when watching a tv show on amazon prime that is free that you have to put in the code each time that you go back to watch it.  I feel as though you should only have to put it in the first time for free prime videos.  Other than that I enjoy it and it works for our family.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Love it ... fast processor. ..", "verified": true, "helpfulness": "0/0", "author": "Mitchell Moyers"}, {"rating": 5.0, "review": "Works well if the WiFi is working. The WiFi where I live sucks. Many of the movies cost extra, for $99 a year more movies should be free.", "verified": true, "helpfulness": "0/0", "author": "Stephen Blair"}, {"rating": 5.0, "review": "Works very well", "verified": true, "helpfulness": "0/0", "author": "Brian Rupert"}, {"rating": 2.0, "review": "the music still isnt working", "verified": true, "helpfulness": "0/0", "author": "KERM"}, {"rating": 5.0, "review": "This was a Christmas gift and I love it!", "verified": true, "helpfulness": "0/0", "author": "BP"}, {"rating": 2.0, "review": "Main reason for purchasing was to have easy access to both Prime video and Netflix account.  I watch considerably more Netflix than Prime.  When I stream Netflix through this, the video will freeze while the audio keeps going, then the video goes super fast forward to catch up with the audio. It's incredibly annoying.  I do not have this problem at all when I stream Netflix through my 5+yr old DVD player that's hooked up with a Wi-Fi adapter.  Also, the Fire TV Stick keeps saying the Home page is unavailable, that my network is connected \"with issues\", even though there are no issues with my other wireless devices connecting to my network.  When this happens I have to try to force it to connect to some random network that shows up on the scan list, then tell it to connect back to my network.  Needs improvement.UPDATE:  After a few months of using it, I have to knock the rating down another star.  Continual issues with it saying there's a problem with my network connection, when all my other devices work just fine.  Sometimes it won't even let me manually reconnect - I enter the password and it goes back to the screen that says \"disconnected\". I would return this item, but unfortunately it's already past the return date limit.", "verified": true, "helpfulness": "0/0", "author": "Wanda"}, {"rating": 4.0, "review": "So far very pleased wih the results of a very modest investment.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Love it. Connected the whole house.  No more cable!", "verified": true, "helpfulness": "0/0", "author": "Bryan Brown"}, {"rating": 4.0, "review": "This is a wonderful device!  Will definitely be purchasing another one for the bedroom.  I could only give 4 stars though since the remote control apps and stuff don't work on the iPhone platform. Hopefully this will be available soon.", "verified": true, "helpfulness": "0/0", "author": "colohiker1983"}]