[{"rating": 5.0, "review": "I love it. It's amazing. Buy one or two", "verified": true, "helpfulness": "0/0", "author": "Sam Bates"}, {"rating": 5.0, "review": "Love the fire stick.  However, the app to turn my cell phone into a remote screwed up my cell phone.  Even after deleting the app, phone not correct.  It deleted some apps pre installed on the phone by LG.  Now I have to back up everything and reset to factory specs and hope that it not only restores the missing apps, but that I can get my contacts, pictures and other stuff back again.", "verified": true, "helpfulness": "1/1", "author": "linda maguire"}, {"rating": 3.0, "review": "Yes it is pretty good so far", "verified": true, "helpfulness": "0/1", "author": "leta kubo"}, {"rating": 5.0, "review": "Beyond what I  expected my family loves it.", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 5.0, "review": "We LOVE having Amazon Prime TV at our fingertips and this cool gadget made our TV smart, which is awesome. Pictures are misleading, The Fire Stick needs plugged into the wall for power.", "verified": true, "helpfulness": "0/0", "author": "AlysssaL \"AlysssaL\""}, {"rating": 4.0, "review": "Excellent product!  It found my WI-FI easily and connection was a snap.  Since it was already registered to my Amazon Prime account, my movie/ TV show list was immediately available.  Adding apps like Netflix, Showtime and others were without issue as my Internet and TV service is currently UVerse.  So far this device has provided me with several hours of viewing in any location that I choose.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We LOVE this!!! I purchased this for my daughter & it's just unbelievable how simple it was to connect & use! I'll be buying one for every room in my house next!!! We watch a lot of movies on Netflix & Amazon and I love the simple portability. I may buy the wireless controller soon so we can play some of the games on the tv as well. Great invention Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Genell Goodson \"GYG\""}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "ALexander O"}, {"rating": 5.0, "review": "love it!  So easy and a great way to make your TV smart!", "verified": true, "helpfulness": "0/0", "author": "Catherine Martin"}, {"rating": 5.0, "review": "Easy to install, works great. Came with batteries :)", "verified": true, "helpfulness": "0/0", "author": "awise1"}]