[{"rating": 2.0, "review": "It's ok. Got it as a gift. Graphics are better than the roku but it loses connection every time we cut the TV on.", "verified": true, "helpfulness": "0/0", "author": "jcofield91"}, {"rating": 4.0, "review": "A gift, he likes it.", "verified": true, "helpfulness": "0/0", "author": "noname"}, {"rating": 5.0, "review": "Great bang for your buck", "verified": true, "helpfulness": "0/0", "author": "B. Blondell"}, {"rating": 5.0, "review": "I have a few streaming devices, and I thought I would give the Fire Stick a try.  I had no issues with setting it up or logging.  It is highly intuive. There was an introduction video that automatically began for the first time user.  I thought that was a nice feature.  It's a must-have if you have Amazon Prime.  The streaming videos included with your Prime membership have a special category so you can browse only those videos. The picture quality is fantastic.  However, it does use quite a bit of bandwidth, which might be a concern if your internet provider has restrictions on the amount you may use.  I'm still trying to see if I can adjust the setting's picture quality so I don't use as much bandwidth.  Overall, I am very happy!", "verified": false, "helpfulness": "0/0", "author": "Skyumah"}, {"rating": 4.0, "review": "The only downside is there is no voice search as on the Fire Box.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Great streaming device.  I have been using it with Amazon Prime Videos and Netflix since it was launched.  Hope to use it more once HBO Go comes to it.  I bought this because the price was great.  It includes not only the streaming features but has Miracast.  The issue for me is that I only have Windows devices and Windows support is not available yet.  This was not described well when I bought it at launch.  I would give this five stars when Windows Miracast is enabled.", "verified": true, "helpfulness": "1/1", "author": "Anthony"}, {"rating": 4.0, "review": "So far I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"nolajohn69\""}, {"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "ivan horta lopez"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "Dianna R. Bertram"}, {"rating": 5.0, "review": "The Fire Stick is a great little device! I'd say try one at first and then buy the Fire TV Box to expand the possibilities of entertainment. I have Comcast at 55mb per second and sometimes it buffers a bit when using Netflix, reason unknown. I believe it is the providers connection and streaming capability in my area since this happens on my other devices too. That being said, this device provides a good introductory to the would of streaming video and games plus apps at a great price.", "verified": true, "helpfulness": "0/0", "author": "Kevin P"}]