[{"rating": 5.0, "review": "Great product! Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Donna Hurst"}, {"rating": 5.0, "review": "My kids love it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey L. Simmons"}, {"rating": 1.0, "review": "Worthless without Prime. Unlike the Chromecast, you cannot stream your browser window to the TV. I'm sure others will get use out of this product, but not me.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S"}, {"rating": 5.0, "review": "Setup was quick and easy. Very fast", "verified": true, "helpfulness": "0/0", "author": "Bajan"}, {"rating": 4.0, "review": "I've been using the Fire Stick for several weeks now, and thus far, it (1) has slightly improved picture quality when viewing Netflix and other streaming services, (2) has been easy to navigate, and (3) its remote is far too easily lost in the depths of the family-room sofa and surrounding environs.  What were they *thinking* when they made the remote this small??  On top of its 'lose-ability,' its wee size makes it a tad more difficult to discern some of the icons (I have 20/20 vision, incidentally, as does my husband).  C'mon, Amazon, you can do better than this.  How about illuminating the icons, for a start?  But apart from this problem, it's a wonderful product.  And for those who don't especially like seeing dongles hanging this way and that and dinging your viewing aesthetics, the Stick inserts into an HDMI port just behind the edge of your set (ours is a new Samsung LED), and is thus invisible -- unless, of course, you're poking around the back of the TV.  We're very happy with our purchase, and I recommend the product.", "verified": true, "helpfulness": "0/0", "author": "Mish G."}, {"rating": 5.0, "review": "I love my Firestick.  This was a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Dawn Hardin"}, {"rating": 4.0, "review": "I Really like it! Very easy and convenient set up. Arrived the next day. One suggestion: its convenient to stream, but on the free apps, the programs offered are mostly snippets, not the full program, and full episodes are more desirable! Overall a good purchase.", "verified": true, "helpfulness": "0/0", "author": "K.J."}, {"rating": 4.0, "review": "Has opened up new doors for watching TV", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 5.0, "review": "I love it! Firestick has opened up a plethora of viewing choices.", "verified": true, "helpfulness": "0/0", "author": "ROBERT SHIBLEY"}, {"rating": 1.0, "review": "I have 3 tvs and have been using a Roku on all of them.  I have NEVER had a problem.  I got a new puppy that chewed one of my remotes so I thought I would give the Fire stick a chance.  This item is horrible!  It skips and skips.  The longer you watch tv, the more it skips.  It gets so bad that it resets itself.  Save yourself a headache and just spend a few dollars more and get a ROKU!!!", "verified": true, "helpfulness": "0/1", "author": "Jane"}]