[{"rating": 5.0, "review": "Best thing we've ever bought on Amazon. And we have a Visio Smart TV, but it always slow down during movies. The fire stick is very fast and would love it!", "verified": true, "helpfulness": "0/0", "author": "MTB Man"}, {"rating": 1.0, "review": "NO.  All it does is keep you going to things you either have to pay for or don't want to watch.  I mainly wanted it to watch art videos, especially the 400 free tv art videos that are offered on weekends that are advertised on my kindle fire tablet email.  when I do find art videos with the fire stick it still won't let me watch.  All I get is directed to something I have to pay for which wouldn't be so bad if it was something I actually wanted to watch.", "verified": true, "helpfulness": "0/0", "author": "Kindle customer five stars"}, {"rating": 5.0, "review": "The Fire Stick is awesome.  I like it better than Chromecast!Pros:  Includes a remote so you don't need to use your device (cell phone, tablet) as your remote like ChromeCast.  Video quality is better and faster download speed in my opinion.  Love the additional apps that come along with it.", "verified": true, "helpfulness": "0/0", "author": "jaye210"}, {"rating": 5.0, "review": "Works great! Nice to be able to watch all those movies and old TV shows on a big TV screen.", "verified": true, "helpfulness": "0/0", "author": "Sam Baker"}, {"rating": 1.0, "review": "I ordered the Fire Stick and of course it was after the holiday season so it ran about 5 weeks late...no big deal.  Now that I have used it a few months here is what I am finding.......... Seems there is an error that happens to Amazon's advantage.  For example, I can get Netflix on my computer, but the point of a Fire Stick is to be able to watch it on my TV with a stereo sound or any other movie source.  So I know it is not my internet access and I can get everything else I use wireless without any problem.  I get error messages more often than not when I try to access Netflix.....but no error when I use Amazon movies.  I'm heading over to Best Buy to look for a Roku to see if that makes a difference.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Romero"}, {"rating": 5.0, "review": "Excellent !! Best thing I could have ever purchased!!!", "verified": true, "helpfulness": "0/0", "author": "Shay"}, {"rating": 5.0, "review": "It's very good", "verified": true, "helpfulness": "0/0", "author": "yasseralothman"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "D ENNIS  FINLEY"}, {"rating": 5.0, "review": "Great deal!", "verified": true, "helpfulness": "0/0", "author": "Maria Morande"}, {"rating": 5.0, "review": "I love it!!!  Can't believe I used to pay for cable...  now if only you could broadcast some football games!  Lol", "verified": true, "helpfulness": "0/0", "author": "Javier Garza"}]