[{"rating": 4.0, "review": "Pretty good deal for the price.  A little disappointed at the \"works best when powered\" optional feature.  Because it really is not optional.  Without it, the stick does not work for me.Plus, the cable for the power adapter is a wee bit short.Other than that, very easy setup, already preconfigured for your Amazon account, simple navigation, and functions as advertised.Of course, the above review might be premature given that only a day has transpired.", "verified": true, "helpfulness": "0/0", "author": "Shri"}, {"rating": 1.0, "review": "So far it has been a paid to download updates, we can't stream without buffering, the picture quality is horrible and if we need tech help we have to call in and talk to someone. I will probably return it.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 4.0, "review": "Works great as advertised.", "verified": true, "helpfulness": "0/0", "author": "D. L. Moss \"oldcol\""}, {"rating": 5.0, "review": "We are very pleased with the Firestick. Had a little trouble the first time we tried to use it, but all has been resolved. Must point the remote in a direct line with the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Frac Daddy"}, {"rating": 5.0, "review": "Love it!", "verified": false, "helpfulness": "0/0", "author": "Keshonda Harley"}, {"rating": 5.0, "review": "Yo this thing is really awesome. It's like chromecast meets apple tv for the exact right price point.", "verified": true, "helpfulness": "0/0", "author": "M. Kravitz"}, {"rating": 5.0, "review": "I was so fortunate as an Amazon prime member to pre-order this item.  I had no idea it was fabulous and tried to immediately order one for my son for Christmas but I could not get it till January. Boo Hoo.  I absolutely love this item - So many options", "verified": true, "helpfulness": "0/0", "author": "monica cannon"}, {"rating": 4.0, "review": "After plugging the device into my TV and the power in, the device started right up and asked me to select the WiFi network. At first, it was unable to connect to my WiFi, but using the HDMI extender cable that comes with it solved that quickly. The initial update was a bit of a pain, seemed to take longer then it should but it wasn't terrible.After the initial setup, things just worked. No problems since. I'm running all the basic apps you'd expect (Netflix, Showtime, etc) and have side-loaded apps with ease from the play store, but the Amazon store more then covers the majority of my needs, even AirPlay. The biggest app I was missing was Dish Anywhere, and now I'm content with my setup (although it works poorly without a touchscreen). There's an Android app called WuKong Remote that worked perfectly with Dish Anywhere. The FireTV Android remote seems to work well, but it's not a full-fledged mouse, and can't interact with Dish's app.The HDMI-CEC capabilities of the device are a nice touch.The only problem that I currently have with the device is how the main interface displays apps. It feels unintuitive and side-loaded apps are only accessible from the settings (unless you use FiredTV launcher or dummy apps). They're not deal-breaker issues, just mild annoyances.Overall, I'm very happy with the FireTV stick, glad I picked one up!", "verified": true, "helpfulness": "0/0", "author": "Steven Rolfe \"Steve\""}, {"rating": 3.0, "review": "Cons:Miracast (wireless display) only works with androids..which kind of sucks. does NOT work with windows 8.1 tablets or computers.No app for windowsphone.You have to use the power adapter and cable that came in the box.Pros:Everything else works smoothly.", "verified": true, "helpfulness": "2/2", "author": "NavC"}, {"rating": 2.0, "review": "This thing seams to be made for androids I have an iPhone and I wanted to mirror my phone but it didn't Returned it.", "verified": true, "helpfulness": "0/1", "author": "David Parker"}]