[{"rating": 5.0, "review": "The Fire TV Stick is just what I need.  I can finally get rid of cable.  I love the Fire TV Stick I can watch what I want to watch anytime of the day.", "verified": true, "helpfulness": "0/0", "author": "Wanda"}, {"rating": 4.0, "review": "yes, its great but there is not many free movies to watch. i dont have 100.00 to buy prime so i just watch what ever they have to offer to watch.they should have plans that customer can choose from then i will have more movies to watch.", "verified": true, "helpfulness": "0/0", "author": "steven sanders"}, {"rating": 1.0, "review": "Did not connect to wifi. Modem was 5ft away. My Chromecast had no problem connecting. Returned the fire stick  I'm now getting the roku instead.", "verified": true, "helpfulness": "0/0", "author": "Kerry Venuti"}, {"rating": 5.0, "review": "As an Apple fan, I have to say that I am loving this Fire TV Stick as a streaming box.After installing Kodi, it is just perfect. No more AppleTV for me...Great price and fast. I just wish the remote had the voice control as the normal Fire TV.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 5.0, "review": "I wish this item was easier to navigate but I guess I'll eventually learn.", "verified": true, "helpfulness": "0/0", "author": "Lynn"}, {"rating": 5.0, "review": "i LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Response to the remote control is super fast even though the unit is plugged into the rear of the TV. Great item and great apps. Only downside is the charge for so many tv shows on Amazon even though I am a prime member.", "verified": true, "helpfulness": "0/0", "author": "ben salomon"}, {"rating": 4.0, "review": "Used my phone as a hot spot and watched Netflix on TV in boat.", "verified": true, "helpfulness": "0/0", "author": "Donald F Ganoe"}, {"rating": 5.0, "review": "Really like this", "verified": true, "helpfulness": "0/0", "author": "Jan Walker"}, {"rating": 4.0, "review": "Makes streaming alot easier.", "verified": true, "helpfulness": "0/0", "author": "sylviamrosales"}]