[{"rating": 4.0, "review": "I've been testing it out for a few days and I love it! I have cable as well and it's so hard to choose to watch cable instead of using the fire stick. I wanted to see if with this device I can cut cable off and still enjoy all the shows I like to watch..... And the answer is yes! And I can watch anything whenever I want! Also I can put music on while I do something or play games. It's like your whole digital world in one. I'm definitely gonna keep it and cut cable off for good!! =)P.S. I have HBO, STARZ, etc in the fire stick but keep in mind that you still need to have cable access to log into these movie apps. Also if you don't already have Netflix or Hulu, you need to start paying for it per month if you want access to them.", "verified": true, "helpfulness": "0/0", "author": "Cris"}, {"rating": 5.0, "review": "Fabulous for the upstairs TV. Why didn't I pay attention to this a year ago???", "verified": true, "helpfulness": "0/0", "author": "Lynda"}, {"rating": 2.0, "review": "Laggy Android app performance and no volume control across apps makes this a poor imitator of the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "I love it!I also hace Apple TV and I actually prefer my Amazon stick: easier to navegate, fast, and great if you have Prime!", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 2.0, "review": "Its basically good for you if you have Amazon Prime..", "verified": true, "helpfulness": "0/0", "author": "Marshay Spencer"}, {"rating": 3.0, "review": "just take to long to buffer an that's  every 5 minutes.....nice to have", "verified": true, "helpfulness": "0/0", "author": "MR.C. PHOTOGRAPHY"}, {"rating": 5.0, "review": "Amazing!  This is exactly what I was hoping for and so much more.  I absolutely love it.  I am the most technically challenged person I know, and I was still able to set it up with no issues in about 5 minutes.  My kids love it too.  We recently moved and our goal was to ditch our expensive TV service and do only streaming.  We subscribe to Amazon Prime, Netflix, and Hulu.... So for less than $30 a month we have more than enough to keep us happy!  Highly recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Noel"}, {"rating": 1.0, "review": "Difficult to use in Argentina.", "verified": true, "helpfulness": "0/0", "author": "Juan Roza"}, {"rating": 5.0, "review": "Love This, It works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Frank Reynolds \"Bent Rider\""}, {"rating": 2.0, "review": "I love the apps and there are a lot of game options for my child. I do have some real issues with performance though. When watching something it will stop and re-load every few minutes and the volume will just stop all of the sudden. The only way to get it back on is to stop and start it again. In the short time I've had it I'm already tired of trying to use it, way too much effort to get through even a one hour show.", "verified": true, "helpfulness": "0/0", "author": "Maria Martinez"}]