[{"rating": 5.0, "review": "This is the second unit I've purchased. They work well with a very easy and intuitive interface. Surprisingly fast too.", "verified": true, "helpfulness": "0/0", "author": "brian gillespey"}, {"rating": 1.0, "review": "I am very disappointed in your system because almost anything I want to watch costs money. I want my money back for your stick.", "verified": true, "helpfulness": "1/1", "author": "Joseph W. Verzino"}, {"rating": 5.0, "review": "I love my Fire TV Stick and will be getting another one. It's super easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "AP"}, {"rating": 4.0, "review": "Got a nice deal. Easy to use with remote. Easy to setup using WiFi.", "verified": true, "helpfulness": "0/0", "author": "Marcus Chen"}, {"rating": 2.0, "review": "Plugged it in, connected to wifi.It updated itself to the latest software version and now it just shows amazon logo and then the black screen.Going to continue using the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Boris"}, {"rating": 4.0, "review": "Well worth it if you don't have apps integrated into your tv. The netflicks app gets stuck when I watch movies, but everything else has worked well. Be sure to have an outlet within a few feet of the usb port on your tv or you won't be able to power it on because it needs to be plugged in to work, it is not wireless ( meaning you don't charge it up to use it, it needs to be plugged into the power cord),", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "I bought the Fire TV Stick to replace my mom's Roku, as the remote that came with it stopped working within a month of ownership. It came down to a choice between this and a Chromecast and the fact that a smartphone is required for the latter, something which she doesn't own, the Fire TV was the clear winner. She isn't super tech savvy so I was relieved to find that the interface for the Fire TV was very simple to navigate, meaning that stuff like Netflix and Hulu are easy to find and use. I've used it for those channels in addition to others like the WWE Network and Twitch and streaming across them all has been flawless. So far using the Fire TV Stick has been a great and easy experience.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Great itemShipped on time", "verified": true, "helpfulness": "0/0", "author": "Arly"}, {"rating": 1.0, "review": "Don't waste your money on this.  I did not see any advisement when I purchased this about needing to have the router in the SAME room as the TV and device.  I bought this on July 15th and it came on July 20th.  Unfortunately I had to be away from the house from the 23 of July till Aug. 15th.  So I never really got around to setting this up until this past weekend.  I followed all of the instructions.  I also made sure that my phone and my Fire HD tablet were working in the same room as this TV is located.  I'm clarifying here that I knew the WEP Key and password and it was working on other devices.  I tried all weekend to make it work...the Fire TV Stick would never connect to the network.  Finally, after several tries I got connected by Amazon to the division that trouble shoots the Fire TV Stick.  We went through the whole process several times, we rebotted my router, we made sure the device was plugged in correctly.  It will not work.  Finally, the tech who was helping me asked where the router was. When I said in another room she advised me that was the problem. That the Verizon FiOS router couldn't provide enough signal strength for this device.  She said it needed to be in the same room as the router.  I told her that was absurd, why would you need the Fire TV device to watch something on a TV if you were sitting by the computer and could watch it there?  We left the discussion with them saying they had no opitions for me...either move the router closer or the device closer.  We have a ranch house and there is only one open room between the router and the Fire TV device.  One of the two techs said that the small size of the receiver inside the device needed a stronger signal.  I note now that the regular Fire TV system is no longer available.  I think this may be a total bust for them.  Since I took too long to try and install this it looks like I'm just stuck.  Amazon is telling me it is too late to return it.  This is a BAD idea, very poorly thought out....you simply would not buy this device to use along side where the router is.  SAVE you money...don't buy it or even think about it.", "verified": true, "helpfulness": "1/1", "author": "Carl L. Anderson \"papacarl\""}, {"rating": 5.0, "review": "This thing is amazing!! So much fun! Perfect for adults and kids", "verified": true, "helpfulness": "0/0", "author": "Robert Castillo"}]