[{"rating": 5.0, "review": "Easy to operate", "verified": true, "helpfulness": "0/0", "author": "Carole C. Pilgrim \"Mrs. P:)\""}, {"rating": 1.0, "review": "When it works, the Fire Stick is fantastic. However, it is designed to go into sleep mode after 30 minutes of inactivity. That's fine with me, especially since my children never turn anything off. The major problem is that the Fire Stick won't wake back up. I spend each time I want to watch my shows troubleshooting and getting frustrated because it won't wake up. If Amazon can fix this problem or put an on/off switch on it, the product will be great. As it is, I can't even use it.", "verified": true, "helpfulness": "1/1", "author": "Jason Russell"}, {"rating": 5.0, "review": "LOVE IT! Use my fire stick frequently. Have a smart TV that is constantly rebuffing, use the Fire Stick in place of the Smart TV and have no problems. I bought 2 extra for gifts and the recipients are pleased with their Fire Sticks as well.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "What a piece of s***. I got it, set it up, watched 2 movies, and the remote went to hell. Won't accept commands, and when it does decide to work, the cursor just bounces around the screen. I'll be returning this waste of money- Don't waste your time. I'll check out Chromecast to see if i have better luck.", "verified": true, "helpfulness": "1/1", "author": "Chesley White"}, {"rating": 5.0, "review": "beautiful design and easy to use.", "verified": true, "helpfulness": "0/0", "author": "mikem"}, {"rating": 5.0, "review": "WOW!!!! Great Product... now I don't need cable.. Thank You Amazon", "verified": true, "helpfulness": "0/0", "author": "Patty R"}, {"rating": 5.0, "review": "Where have you been all my life?", "verified": true, "helpfulness": "0/0", "author": "Valerie Chism"}, {"rating": 1.0, "review": "Few reasons why this device gets a 1 star.  I will keep it simple.Remote, very buggy, poor response.Wifi signal- set up in a room 10 feet from the wifi ACESS point. Signal goes from 3 bars ( full ) to 1 to lost connection to full strength. Using other devices in the same area to test possible inference, they work fine. iPhone 6 130-150mbs down using speed test app.I need this device for the slingbox. Will return and buy the more expensive box set, as for the stick, chrome, or Roku are the way to go in this price range. WD for a little more money.Fix the bugs Amazon, great idea...just needs fine tuning", "verified": true, "helpfulness": "0/0", "author": "MPRIME \"RealD3al\""}, {"rating": 5.0, "review": "Ots cool but  some appps  are  bad  n some atlre good  i  think  you  need to add kodi. N  addons  in.your  product  by the way  its 4.5 stars", "verified": true, "helpfulness": "0/0", "author": "alpesh patel"}, {"rating": 2.0, "review": "boohoo fire stick. this thing loses my internet connection ALL THE TIME. it constantly freezes up when all my other electronics are working fine. Don't waste your money on this, buy apple tv instead!", "verified": true, "helpfulness": "0/0", "author": "Kenneth S."}]