[{"rating": 5.0, "review": "We love the fire stick. Our Internet was not strong enough in our lower level of our house and streaming was always interrupted. Now we can enjoy a movie from start to finish.", "verified": true, "helpfulness": "0/0", "author": "honest"}, {"rating": 4.0, "review": "The fire stick installation was super easy.", "verified": true, "helpfulness": "0/0", "author": "Jeffery Johnson"}, {"rating": 5.0, "review": "It is 1000 times better then the chrome stick", "verified": true, "helpfulness": "0/0", "author": "Randell J."}, {"rating": 3.0, "review": "This item has it's pro's and cons. I had to buy a wifi booster to get this item to work in my bed room however it works fine in my living room near my router. The graphics are really nice on both my smart tv and my regular HDTV This item is fine for your major apps like Netflix,  prime video,  Hulu etc. But lacks the variety of apps that a roku 3 offers. With my roku I can watch Tv channels and stream radio stations in different countries and it has a bigger variety of free apps I would purchase this item again and recommend it to a friend.", "verified": true, "helpfulness": "0/0", "author": "Jasmine Arvin"}, {"rating": 1.0, "review": "WIFI attenna is terrible. It constantly loses a connection from a short distance from the router. My Roku does not have this problem from the same location. I'm guessing this is probably a hardware defect that a firmware patch will not address.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 5.0, "review": "Amazing. This item was more than I expected, If needed, I will buy again.", "verified": true, "helpfulness": "1/1", "author": "Debra M Vanbogelen"}, {"rating": 1.0, "review": "does not work! Audio issues  and now after waiting so long to get it.....it does not even turn on.", "verified": true, "helpfulness": "0/0", "author": "raul aguirre"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "marcia snyder"}, {"rating": 2.0, "review": "Great 5 stsrs", "verified": true, "helpfulness": "0/1", "author": "Debra Schaich"}, {"rating": 3.0, "review": "I bought two of these on sale (19.??). One works well in a room next to my WiFi hotshot.  The other lags a buffers in a different room with a weaker signal.", "verified": true, "helpfulness": "1/2", "author": "V. Miles \"Track by track fan\""}]