[{"rating": 5.0, "review": "love this. watch a movie every night.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Adams"}, {"rating": 3.0, "review": "I was disappointed because of the range of reception to my router. I could not use it in the room I wanted too because it would not pick up the internet. I have other devices that I have in the same room and have no problem with them.", "verified": true, "helpfulness": "0/0", "author": "Harold K. Sickles"}, {"rating": 4.0, "review": "Works great for us. Great for travel.  Can be a little finicky sometimes.  Overall, great product.", "verified": true, "helpfulness": "0/0", "author": "davidjames911"}, {"rating": 3.0, "review": "I rate this a 3 because its a back and forth issue. This does provide quick access to several apps that are used often. Hulu, Netflix, Pandora, to name a few. Yet i am sick and tired of having to reset the damn thing. Not only does it need to be reset, when i do reset it the parental control resets and turns off purchase protection which in turn allowed my kid to buy an episode she didnt need to have.", "verified": true, "helpfulness": "1/1", "author": "Chris Baldwin"}, {"rating": 1.0, "review": "I bought this device based on its advertisement. At present I have a setup in which a sungle HDMI capable Denon receiver is driving my LG TV. This receiver has an Apple TV connected to one of the HDMI ports, a Roku 3 box to the second, a Google chrome stick to the third and all work well at 1080p. I've connected the Fire TV stick to the remaining port only to receive a flickering image about 5 times a second. Just got off a talk with Amazon support. The person there informed me that the stick does not support a receiver and has to be hooked up directly to a TV. What a lame design decision!!! If you're anything like me suggest you avoid this device at all costs!!!!!!", "verified": true, "helpfulness": "2/3", "author": "yosgof \"yosgof\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Derell"}, {"rating": 5.0, "review": "Great for a spare room with no cable box.", "verified": true, "helpfulness": "0/0", "author": "John Rose"}, {"rating": 3.0, "review": "works fine.  Abit harder to install than the commercial shows", "verified": true, "helpfulness": "0/0", "author": "maggyjohn"}, {"rating": 5.0, "review": "My fire stick was a gift. It seems great. Haven't really had a chance to figure everything out yet but unbelievable number of movies available !", "verified": true, "helpfulness": "0/0", "author": "cynthia marek"}, {"rating": 4.0, "review": "Somewhat of an impulse buy. It's kind of just been sitting there kind of like the Google Chromecast. It does what it does well.I just wish that all of these little sticks could stream from a local source. I have a server at home and these devices become more of a novelty item because they can't stream.I will say I am looking forward to using this at a hotel the next time I go out of town.If you don't have a need to stream from a local source this stick is a great choice. It's cheaper than the Roku and many other devices yet does the same if not more.", "verified": true, "helpfulness": "0/0", "author": "kfsutops"}]