[{"rating": 5.0, "review": "love the fire stick i take it with me every time i travel", "verified": true, "helpfulness": "0/0", "author": "Mabull"}, {"rating": 5.0, "review": "Great product. I think it fits our needs sufficiently. I used Chrome at first but hated that i had to be streaming directly to the TV and had to go through all of the other stuff just to watch my shows. instead the apps are already downloaded on this and I can even watch movies in my Amazon library.", "verified": true, "helpfulness": "1/1", "author": "NattyDahlin"}, {"rating": 5.0, "review": "This Little Stick is nice it does what i need it to do in a small form factor so the footprint isn't too much", "verified": true, "helpfulness": "0/0", "author": "Xavier Langham \"Xavier L.\""}, {"rating": 5.0, "review": "If you don't have a smart TV this is awesome!", "verified": true, "helpfulness": "0/0", "author": "Ran-D"}, {"rating": 3.0, "review": "Drops network connection roughly hourly. Searching on the web this seems to be a well documented issue (firmware?) having nothing to do with the user's internet service, modem or router. Amazon Prime is great streaming to my laptop but stinks on Fire TV Stick! Must fix or I'm going back to Netflix.Update: I swapped wireless routers for other reasons and now Fire TV Stick is usable. Not great, but usable. I'll give it three stars now, although I still object to having to swap one functional router for another to get what's supposed to be a convenience product to work conveniently. There are still significant connection quality issues compared to other devices streaming the same content on the same network. If I want to stream HD reliably I still need to send from my laptop to the TV instead. For the price and convenience I no longer regret the purchase so strongly, but would still recommend trying the competition.", "verified": true, "helpfulness": "0/0", "author": "Colin"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "jorge"}, {"rating": 4.0, "review": "This is a layman review. It's works pretty good but does freeze up sometimes. The app for our phones also freezes up sometimes. Every freeze, whether on the app or on the stick, requires a power down and reset. Also most of the apps the Fire Stick offers are paid in some way. Crackle is good, Netflix and Amazon Prime we expected to pay for, but with our old Blu Ray we had about 40 free apps. Plus we notice that movies we never used to pay for on Amazon Prime on the old aystem....we now have to pay for! Not cool. Finally, app has a nifty voice search function but guess where it takes you? Amazon Prime only. It won't search other apps (like Netflix hint hint?)All in all, good video and audio but definitely feel like we are being fleeced on cash. And no way this late in  the cell phone app game should we have to suffer freezes and restarts. A 9 year old could program better than that!", "verified": true, "helpfulness": "0/0", "author": "john stenzel"}, {"rating": 2.0, "review": "I have the fire TV just purchased this fire TV stick for my man cave let's just say I should to of purchased the fire TV it is slow and looses Internet connection a lot not to happy so far", "verified": true, "helpfulness": "1/1", "author": "Kenneth Green"}, {"rating": 2.0, "review": "The streaming is pretty mediocre.  I can't stream MLB.TV without very frequent lag.  Netflix always has issues.  I have the fastest internet in the area and still there are so many issues with it.  I am a very loyal Amazon Prime member but had to purchase the the Fire TV Stick at Best Buy because Amazon was out.  What a poor choice.  I should have purchased something else (Chromecast or Roku Stick).  Fire TV Stick is pretty useless.  On top of that, set up was much more difficult than Amazon made it seem.  In the photo you can see how I am experiencing slow streaming and it just basically is unwatchable on the MLB.TV app.  If the app doesn't work, don't offer it and I would not have bought the Fire TV Stick.  My router basically across the room from where the stick is plugged into a Samsung TV.  There should be few streaming problems, but even Netflix stinks with the device.  Real bummer overall.", "verified": true, "helpfulness": "2/2", "author": "Bill Clinton \"Bill Clinton\""}, {"rating": 3.0, "review": "I've had this now for about three weeks, acquired when I elected to rejoin Sling TV and I took advantage of the promotion whereby the Stick was free with a three month prepaid subscription. Playback is occasionally choppy on all the services I use, including (and especially) Sling TV, Netflix, Hulu and Plex. Seems to work pretty well on Amazon Instant Video content though...how about that. Even though my home wireless-N network is speedy and running on a 30 Mbps cable internet connection, playback issues are frequent and annoying. I just don't think this little stick has the processing firepower to produce an acceptable (by my standards) level of performance. I wanted to like this device, especially after Mr. Busey's sales pitch, but I don't think it's going to be true love. Since I got it on a promo I guess I'm stuck with it--I'm not willing to take a chance on returning it for a regular Fire TV and paying another 60 bucks for the privilege.", "verified": true, "helpfulness": "0/0", "author": "Colby D. May"}]