[{"rating": 5.0, "review": "I love the Fire stick.  It is so nice to watch movies on my big tv.  One of the best investments I've made.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As long as you have the Amazon Prime membership ($99 a year) and wifi this thing is AWESOME! I just wasn't so sure from the description of how it worked that I was going to be happy when I ordered it. But it's a very cool entertainment source that I still haven't figured everything out on yet (and not because it's complicated, I just haven't had time to figure out the music stuff yet). And the app for my Kindle Fire works with it really cool!!! Super happy with it!!", "verified": true, "helpfulness": "0/0", "author": "Charlene"}, {"rating": 5.0, "review": "Love it! It does everything you could ever need from a streaming device.", "verified": true, "helpfulness": "0/0", "author": "jake rick"}, {"rating": 5.0, "review": "Had the fire tv stick for about two months and love it.", "verified": true, "helpfulness": "0/0", "author": "Augustus Kelly"}, {"rating": 5.0, "review": "Easy to install and made me glad I cancelled  my overpriced cable!", "verified": true, "helpfulness": "0/0", "author": "Audi Oehler"}, {"rating": 3.0, "review": "It would be nice to get more shows without having yo pay more money. Why isn't it compatible with Comcast?", "verified": true, "helpfulness": "0/0", "author": "Anne-Marie Baxter"}, {"rating": 5.0, "review": "Smooth and easy to use. Happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Idris Adjerid"}, {"rating": 5.0, "review": "Awesome, easy to navigate and set up.", "verified": true, "helpfulness": "0/0", "author": "todd"}, {"rating": 5.0, "review": "Works well - opens up my viewing choices.", "verified": true, "helpfulness": "0/0", "author": "ann sokoloff"}, {"rating": 5.0, "review": "The Fire Stick works great! It was easy to set up and having an app for it is also quite handy!", "verified": true, "helpfulness": "0/0", "author": "beckyk2594"}]