[{"rating": 1.0, "review": "A huge huge disappointment. The only part that works even remotely well is, SURPRISE, for Amazon video. The other apps load so slowly that they are almost useless. I've bought other streaming devices and had high hopes for this. I was disappointed by Roku, but Fire TV Stick is simply the worst streaming device I've seen.Could Amazon please get over itself and work out a deal with Apple? Apple TV reacts immediately. Even Sony BluRay player reacts immediately. Fire TV thinks about it for a long long time.And, really, a PBD Kids app but no PBS app when every other device on the market has full PBS? Really?I'd be happy to discuss this in detail with an Amazon representative. I'd love to return this thing.", "verified": true, "helpfulness": "0/0", "author": "Robin M-B"}, {"rating": 3.0, "review": "I already have a Chromecast, and bought the FireTV Stick during the promotional period because, hey, why not test the waters for 20 bucks. I also have a Roku 2 box, an Xbox One, MythTV PVR and XBMC (now Kodi) on Windows and Plex on, well, everything.In a nutshell: The FireTV Stick is a better deal than the ChromeCast, though it's not without its fairly big flaws. On the plus side, it comes with a real remote and an actual on-screen interface, making it easier to navigate than a ChromeCast.On the negative side, it still has a ways to go to get the full functionality that the ChromeCast has. While you can stream YouTube to it from a Chrome browser, this function is buggy (It's also buggy on my Xbox One so this may be Google's fault). The FireTV Stick pretty much requires a true power source as opposed to the ChromeCast's ability to get by with the USB service port on my TVs. The thing also takes several minutes to boot, rather than seconds with the ChromeCast, so I have mine set to stay on all the time. The FireTV also has a really annoying feature where it shuts the screen off after a certain idle period, so when you switch to that input it makes you think that the device has stopped working. There's no way to completely shut this off so far.Netflix and Amazon Video work well, as does Plex (The main reason I bought this other than the price). Screen mirroring from my Android phone works well but it almost requires an act of congress to set up, requiring the FireTV be in a weird target mode. Why can't it \"just work\" like the AppleTV does? If they're concerned with it being hijacked Tony Stark-style, just put a passcode on it.If you want a real remote and a real interface and don't mind an external power source, this thing beats the ChromeCast all day. However, for me I find it lacking in some key areas at this time - VLC just announced support for sending video to the ChromeCast, so I'm about to pick up a second one for the living room and put the FireTV in a drawer until they can increase the software's feature set. But I'm kind of an edge case because I have so many other devices. If they can match ChromeCast feature-for-feature, make the software a bit more polished, and make it 'just work' with everything I want to stream to it, it's a borderline 5-star device. For now, three stars.", "verified": true, "helpfulness": "0/0", "author": "JerkyChew"}, {"rating": 5.0, "review": "Order the Amazon TV stick. And received it very quickly. The set up was easy straightforward. I enjoyed it a lot.  You got to get this Amazon fire's TV stick. Enjoy, I sure have.", "verified": true, "helpfulness": "0/0", "author": "annamae acosta"}, {"rating": 5.0, "review": "I love my fire stick....I feel it will replace cable in the future !", "verified": true, "helpfulness": "0/0", "author": "Rita Miles"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Latiesha Dixon"}, {"rating": 5.0, "review": "It was very easy to install with the instructions . Have had no problems streaming programs.", "verified": true, "helpfulness": "0/0", "author": "Mary Funsch"}, {"rating": 4.0, "review": "The stick seems to be working fine, but the instructions included to getting it to work were terribly lacking.  After fiddling with it for a long time, I finally got it to work.", "verified": true, "helpfulness": "0/0", "author": "jenene"}, {"rating": 4.0, "review": "Fire stick is fabulous. Opens an interface you've been waiting for. Only bad side is the remote. You practically have to smash it to get it open to insert batteries. In addition, no information tells you if you need to switch the usb back and forth with your cable or satellite.... You do!!!!", "verified": true, "helpfulness": "0/0", "author": "by Valerie Nixon"}, {"rating": 1.0, "review": "Doesnt let you connect to wifi that need a password at a hotel, the whole reason whyi bought this thing is so i can travel and watch movies. So no browser = no connection what the hell good is this thing.. I can connect to movies in my house with my dvd players", "verified": true, "helpfulness": "0/2", "author": "Catherine Tusa"}, {"rating": 5.0, "review": "This fire 🔥 stick TV 📺 is awesome everyone who is anyone should get this device, kudos to Amazon 🎆😊!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Yates"}]