[{"rating": 5.0, "review": "Was easy to set up. Have to download hulu and Netflix. That takes a while. All in all about a half hour.", "verified": false, "helpfulness": "0/0", "author": "Beth Ramburger"}, {"rating": 5.0, "review": "I love it, wish pay movies pay were cheaper as much as direct Tv, but is fun", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great simple to use device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product had such an easy set up and install; it works extremely well for streaming anything I want at good quality and so far have had no buffering problems.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 1.0, "review": "I AM EXTREMELY DISAPPOINTED WITH THIS PRODUCT. I PURCHASED IT FOR MY TELEVISION IN MY BEDROOM, BUT IT SIMPLY DOES NOT WORK. I WOULD LIKE TO RETURN IT. PLEASE ADVISE ME AS TO HOW I DO THIS.", "verified": true, "helpfulness": "0/0", "author": "Angela E. Ryman"}, {"rating": 5.0, "review": "Works great! Quick easy set up.", "verified": true, "helpfulness": "0/0", "author": "Maranda Hill"}, {"rating": 5.0, "review": "Whole lots better than google chrome cast.", "verified": true, "helpfulness": "0/0", "author": "anthony  vance"}, {"rating": 5.0, "review": "Amazing indeed no more cable bills. My son is 10 years old and he loves it. What is really great about the Fire TV Stick is for only $99.99 a year I am a Prime member and I have all these special free additional access passes to everything I want----movies!!! (smile)This Fire stick can move from TV to TV and no reprograming and it is better than the Roku stick. I tried that one 1st and Amazon Fire Stick is the best!", "verified": true, "helpfulness": "0/0", "author": "AMINAH"}, {"rating": 5.0, "review": "Very good buy I'm enjoying it", "verified": true, "helpfulness": "0/0", "author": "Kenneth Aaron"}, {"rating": 2.0, "review": "I'm a little disappointed with the FireStick.  It would be better if there was an internet app, access to Hulu (not just Hulu plus), HBOGO, and Showtime videos.  I already pay for cable (HBO, Showtime) and Netflix.  It would be nice if I didn't have to pay for it all again to watch on the FireStick.", "verified": true, "helpfulness": "0/0", "author": "Brendan"}]