[{"rating": 5.0, "review": "I'm totally enjoying it. dw", "verified": true, "helpfulness": "0/0", "author": "Dennis R Williams"}, {"rating": 5.0, "review": "My kids love it!!!", "verified": true, "helpfulness": "0/0", "author": "Patrick Terry"}, {"rating": 5.0, "review": "I received the Amazon Fire Stick as a White Elephant Christmas gift and I love it! Very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Dannah"}, {"rating": 4.0, "review": "It's pretty useful and works great. I haven't got to use Netflix yet because \"apparently\" it is down on the Stick. But otherwise I love it!", "verified": true, "helpfulness": "0/0", "author": "Casey Phelps"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use and set up. I can also use the app to use voice options. Love how easy Amazon prime is to access", "verified": true, "helpfulness": "0/0", "author": "Susan Krebs"}, {"rating": 5.0, "review": "We have had this for a couple of days and really enjoy it. I prefer watching Netflix through the stick than through our PS3, plus we have access to a lot of other helpful apps like Showtime Anytime, YouTube, Pandora... It is very easy to set up and use. The only downfall I have seen so far, and it isn't huge, is that it can sometimes take a minute to wait for a YouTube video to play. I like being able to pair my ipad and laptop with it for easier searching. My son loves using his ipad to search for shows since he can't spell very well.", "verified": true, "helpfulness": "0/0", "author": "Veruka"}, {"rating": 5.0, "review": "I need to set up my Prime account, but I love that fact that I do not have to rely on  my cable company for movies!", "verified": true, "helpfulness": "0/0", "author": "L. Speers"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jaclynn Gallagher"}, {"rating": 5.0, "review": "Love it. Can watch movies easily assessable easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "snapnt"}]