[{"rating": 1.0, "review": "it keeps timing out and loading video", "verified": true, "helpfulness": "0/0", "author": "BRIAN CITRANO"}, {"rating": 5.0, "review": "This is my second Fire Stick...I have one in my bedroom and this one is for the living room. We LOVE it. My Comcast bill is out of control. Now with the Firestick I don't need OnDemand and all the extra stuff. It was so easy to set up. My account information was already loaded. The only thing I had to do was log into my Hulu and Netflix accounts one time and now we are ready to rock and roll!", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Francisco Alberto"}, {"rating": 5.0, "review": "Love this product very easy to use.  Bought another one for family. Need to put it on sale again!!,!!!", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 5.0, "review": "I love it mor that Apple tv", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "Awesome purchase", "verified": true, "helpfulness": "0/0", "author": "Anthony Basquez"}, {"rating": 2.0, "review": "Kinda disappointed in Amazon.  This thing is pretty buggy (shows will stutter at the start), and almost always freeze around 80% of the way through on netflix and then gets stuck loading at 25%.  Sometimes I get random reboots.  The smartphone remote app is a completely horrible. Just a frustrating, terrible un-intuitive experience.  In one level of the UI, you swipe the phone screen a certain direction, and the items on the tv screen move in the same direction.  Go a level deeper (by 'clicking' or entering a menu), and suddenly the swipes move things the OPPOSITE direction!  What the heck??  The voice search is a neat feature, but is not designed well (nothing tells you to keep holding down to keep listening).  We lost the included remote for a week and completely quit using the Fire TV stick just because the smartphone remote is so terrible.On the positive side, the interface is decent, and the included remote is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Craig H"}, {"rating": 4.0, "review": "Great addition! Gives you lots of options and entertainment for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Rosalind"}, {"rating": 5.0, "review": "Great for the price especially when you have a fire phone", "verified": true, "helpfulness": "0/0", "author": "Sasha Armstrong"}, {"rating": 3.0, "review": "Setup and functionality work fine for me, the \"always\" on functionality means my Samsung detects it every time I turn on the TV and switches to that HDMI input.  Wish there was a way to power it off, putting it to sleep makes no difference :(Not ideal design ....", "verified": true, "helpfulness": "0/0", "author": "tucker74"}]