[{"rating": 4.0, "review": "Love the speed of the navigation and the remote.  Have the remote make it very convenient.  Also you can side load other apps like XMBC.", "verified": true, "helpfulness": "0/0", "author": "gotkimchi"}, {"rating": 4.0, "review": "The Fire TV Stick was easy to set up, easy to use, and performs real well on my 15mbs cable internet connection. The gui is more responsive than my Roku 2 XS box - though I have been TOLD the Fire TV BOX is even faster.The Roku wins easily as far as having more channels/apps BUT perhaps the Fire TV devices will eventually catch up. For now the Roku stays for those channels I can not get on the Fire TV Stick.  Otherwise, I use the Fire TV Stick because its an overall faster and more pleasant experience.  However, I hope Amazon will continue to work on the Fire TV gui and add more customization settings - such as being able to set the order of the main screen rows.  And which are even displayed.  Not everyone uses it for music, for instance. So let me hide the parts I don't use.Overall, I am really pleased.  A good value and a sold product.", "verified": true, "helpfulness": "1/1", "author": "glrobin"}, {"rating": 5.0, "review": "Easy to use, fast Great!", "verified": true, "helpfulness": "0/1", "author": "Sandy"}, {"rating": 2.0, "review": "I have had to factory reset it 4 times and redo everything. It will not stay connected to my network. I even moved it to 3 feet from my router and it still won’t connect... So frustrating when trying to stream Netflix or espn.", "verified": true, "helpfulness": "1/1", "author": "Brandon80"}, {"rating": 4.0, "review": "This thing is is unreal.  It is almost perfect.....the only reason I gave it 4/5 is because it requires you to plug it into the wall electrical outlet when it is attached to your TV for proper operation.  I am not sure if I missed that when I ordered it, or if it may be a bit deceiving on the fact that it needs power, but that was a slight pain in the butt when I realized it.  Otherwise, it is so nice and I will be getting this for family & friends as gifts in the future. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 3.0, "review": "I feel that Chromecast provides better \"local\" options.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than ROKU", "verified": true, "helpfulness": "1/1", "author": "N. udani \"New Tech lover\""}, {"rating": 5.0, "review": "Love this device. Great for travel, I'm sure we'll love it at home as well!", "verified": true, "helpfulness": "0/0", "author": "D. Randall \"Mavrick1903\""}, {"rating": 5.0, "review": "the picture is so much better than what we were getting with cable.", "verified": true, "helpfulness": "0/0", "author": "veronica melchor"}, {"rating": 5.0, "review": "I love it, haven't stopped watching since I got it.", "verified": true, "helpfulness": "0/0", "author": "Marie Lozano"}]