[{"rating": 5.0, "review": "The Amazon Stick was easy to install.  So far, it has performed flawlessly.  I watch both Amazon Prime and Netflix.  The specs indicated that the Amazon Stick was comparable to the ROKU 3...it does perform that way.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelent, way faster than I expected", "verified": true, "helpfulness": "0/0", "author": "Adrian Morales"}, {"rating": 5.0, "review": "much better than chrome for Amazon Prime movies-and very easy to navigate-like the way that the categories are set up", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 2.0, "review": "Di9d not meet my expectations at ALL", "verified": true, "helpfulness": "0/0", "author": "ken l"}, {"rating": 4.0, "review": "Works as advertised plus the ability to listen to prime music.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I received this item for Christmas and it's just amazing! I hooked it up with my Amazon prime account and having unlimited movies and TV shows wherever I go is awesome. It only works on wifi and plugs right into the TV. Easy set up, easy to use. I have no complaints! Best gift ever!", "verified": true, "helpfulness": "0/0", "author": "Lauren Herrera"}, {"rating": 3.0, "review": "My biggest and only complaint is that it buffers a lot! Sometimes I can eat h 2 or 3 movies with no buffering other times I can't get throught a TV show without it buffering half the show. It's like commercials but worse. Ugh", "verified": true, "helpfulness": "0/0", "author": "Michelle Greenlaw"}, {"rating": 5.0, "review": "The fire stock is awesome!! Easy to install and love that my music is on it and everything is preset with. Amazon account information.", "verified": true, "helpfulness": "0/0", "author": "Lynn Leasia-Nevill"}, {"rating": 5.0, "review": "Super easy to use and offers a wide variety of choices to select from...", "verified": true, "helpfulness": "0/0", "author": "Chris Glenn"}, {"rating": 5.0, "review": "I love it, enough said.", "verified": true, "helpfulness": "0/0", "author": "Mike Gayda"}]