[{"rating": 4.0, "review": "luv everything about it. if amazon sold internet...I wouldn't need Comcast AT ALL$25 month for sling is way better than $170 for Comcast.my only advice to amazon. let buyers try games b4 they purchase. some of them, like golf, are not games I would play all the timeother than that,,,,i'm HAPPYI started with the stick in the living room. now im getting two fire tv set ups for the bedrooms and getting rid of cable boxes. right now, I move the stick from one tv to another which was cool. i'm 50 my husband is 70....he bowls, plays pinball, pool, chess, golf, and solitaire on the fire stick...I like the arcade games....we spend more time doing games now instead of just sitting and watching the news all day. best fun we've had in years..great gift for kids and seniors!", "verified": true, "helpfulness": "0/0", "author": "CHEF DEANNA"}, {"rating": 1.0, "review": "all went well its easy to hook up an watch movies", "verified": true, "helpfulness": "0/0", "author": "Paul Jensen"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick works as designed, has helpful video instructions to get started, but, due to being a real dummy when it comes to these things, I needed extra help and got it from DirecTV.  They are always very helpful, courteous, and patient.  Not being aware that the Stick package includes one, I also ordered one and received two mini-USB power cables (two per package) that arrived weeks before the Stick.  I could have saved ten dollars if the Amazon Fire TV Stick information had indicated one such min-cable was included.", "verified": true, "helpfulness": "0/0", "author": "Danno"}, {"rating": 5.0, "review": "Love it!! The complete Amazon library is availble, and includes Hulu, Smithsonian, and Netflix access as well. One of the smartest little ideas since Apple TV.", "verified": true, "helpfulness": "1/1", "author": "blny"}, {"rating": 5.0, "review": "What can I say? I love it and love having access to Amazon Prime movies and Netflix on my TV. It's easier than my Apple TV. I also got it when first offered at the introductory price. More smiles!", "verified": true, "helpfulness": "0/0", "author": "Clearintentions!"}, {"rating": 4.0, "review": "Very easy to install and operate.....gives lot of options for tv", "verified": true, "helpfulness": "0/0", "author": "Don Gauthreaux"}, {"rating": 4.0, "review": "It works just fine", "verified": true, "helpfulness": "0/0", "author": "Steven Dunn \"STEVE DUNN\""}, {"rating": 5.0, "review": "Easy to install, easy to use, enough content to keep me busy for a long time.", "verified": true, "helpfulness": "0/0", "author": "Julie N."}, {"rating": 5.0, "review": "WORKED PERFECT--EASY TO INSTALL", "verified": true, "helpfulness": "0/0", "author": "Robert Atols"}, {"rating": 2.0, "review": "Very disappointed the format for Amazon movies doesn't format to fit my screen but Netflix and Hulu does I don't find Controls Interface friendly and I will stick to my Roku", "verified": true, "helpfulness": "0/0", "author": "WILLIAM E TRIMBLE"}]