[{"rating": 5.0, "review": "I love the Amazon fire stick! I didn't have to purchase additional smart TVs for my guess room and for the kitchen.  My grand children can watch movies on Netflix without any problems.", "verified": true, "helpfulness": "0/0", "author": "Mary White"}, {"rating": 5.0, "review": "I have to say I had no interest in streaming before but so many of my friends were doing it and I figured for $39.00 I might as well try it since I have been a prime member for years.  I was hooked immediately.  The first show I saw was Mr. Selfrige. Then I watched Bosch.  That was a 5 star series.  I hope they make another season.  It was one of those shows that you like so much you hate to see the ending because that means its over.  Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 4.0, "review": "works great and easy to install", "verified": true, "helpfulness": "0/0", "author": "RWS"}, {"rating": 1.0, "review": "I see was led to believe the stick did more than what it does", "verified": true, "helpfulness": "0/1", "author": "Kameo"}, {"rating": 4.0, "review": "Easy to set up, user friendly. Great for the money. Even thinking about getting rid of cable. Only problem, it seems when it's used for an extended period of time, Netflix will freeze frame then speed up to catch up with the audio. Also wish Amazon had not removed the ability to side load apps.", "verified": true, "helpfulness": "0/0", "author": "jacob voorheis"}, {"rating": 5.0, "review": "get it for yourself and cut the cord, i wish miracast was not locked only to amazon products.", "verified": true, "helpfulness": "0/0", "author": "James B. Nthenge \"Student for life\""}, {"rating": 5.0, "review": "Its the best! Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly!!! It's way better than my chromecast!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly White"}, {"rating": 5.0, "review": "Great product. Super easy set up. Perfect for Netflix", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "Other than having the ability to access both linked accounts to all features- this works well", "verified": true, "helpfulness": "0/0", "author": "maria schwarz"}]