[{"rating": 5.0, "review": "I own both a chromecast  and this. I've found I use this more often than my chromecast. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Heikki_Lunta"}, {"rating": 5.0, "review": "We are very pleased with the Amazon TV Fire Stick. There is a good variety of programs and movies. Something for everyone. I would recommend that you get Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Jan Keefe"}, {"rating": 5.0, "review": "Wow! Works great for movies and shows . I love the youtube link.", "verified": true, "helpfulness": "0/0", "author": "gpeterson"}, {"rating": 5.0, "review": "Very easy and quick set up. The portability to other TV's is a key feature. Using the remote app on my I-phone and I- pad is awesome. Very satisfied that I went with the stick vs the Amazon TV \"box\". Primarily use it to watch Netflix and Amazon Prime. I love it. Only problem is competing with my son to use it. Will probably buy a second one for him!!", "verified": true, "helpfulness": "0/0", "author": "Sharon W."}, {"rating": 3.0, "review": "The stick works great, but not on every TV.  Apparently the signal isn't strong enough for Fire Stick in the room I'd wanted to use it in, although my other wireless devices work fine in that room.  I had stick from another provider that didn't work with Verizon FIOS at all, but this one works fine on the TVs on which it works.  And you can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "NICK ST. AMANT"}, {"rating": 5.0, "review": "It was the perfect gift for my son! Easy to set up and easy to use. I really appreciate that fact that is has parental controls to protect his eyes from the things he shouldn't view.", "verified": true, "helpfulness": "0/0", "author": "Kane Wrench"}, {"rating": 4.0, "review": "Works well except occasional overheating and wifi connection issue. Using the hdmi extension cable helped.", "verified": true, "helpfulness": "0/0", "author": "Haitao Liu \"hliu24\""}, {"rating": 5.0, "review": "I have Amazon Prime so this is such a great item!!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "Great Device. Easy to connect and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Joel Vasile"}, {"rating": 5.0, "review": "Gift", "verified": true, "helpfulness": "0/0", "author": "PGP"}]