[{"rating": 4.0, "review": "I finally got HBOGo to work as well as Hulu Plus. It works well", "verified": true, "helpfulness": "0/0", "author": "crayfishkc"}, {"rating": 5.0, "review": "Great value for the money.  One of the better products for home viewing on the market.", "verified": true, "helpfulness": "0/0", "author": "Beverly McDonald"}, {"rating": 5.0, "review": "For $39 you are not going to find a better way to stream content to your tv. Very easy to setup and works with all major services will definitely purchase another for the my other tv!", "verified": true, "helpfulness": "0/0", "author": "Debogo"}, {"rating": 1.0, "review": "I have the Fire TV box which works fine.  Fire stick will not connect to the internet for more than 2 minutes.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome works great had a little trouble setting up couldn't get it to connect I had to trouble shoot and reboot by pressing select button and home key together for a few seconds  but once it got going haven't had any problems I love it works awesome", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Navigating Amazon Prime video content is not as easy as Netflix.  It is not possible to easily navigate amazon prime music, you have yo add things to your library online to use it.  There is no support for Google play music, which is where music is.Video quality seems quite good.  Audio quality is good, except for a pop when starting playback of  video with certain Dolby auidio formats enabled (otherwise I had no auidio issues).Overall, amazon has just done a poor job on their user interface and usability for music and video on the fire TV stick and on their android apps.  I really have little interest in using the product as a result of the poor navigation of amazon prime video content; this makes the fire tv stick mostly a waste of money for me.", "verified": true, "helpfulness": "0/0", "author": "Gary \"Gary\""}, {"rating": 1.0, "review": "I had high hopes for the Amazon firestick since I am a prime member and my Apple TV stopped working after a year and a half.  However, the firestick is a disappointment.  It doesn't hold the wifi connection and I am using it in the same room as the router and all of my other devices work just fine.  It would be a cool product of it worked though.", "verified": true, "helpfulness": "0/0", "author": "Shan"}, {"rating": 5.0, "review": "! I have struggled for a long time to get my tablet to stream my smart phone ,I couldn't count many times my picture which stop and need to be buffered. with the fire stick all of that is gone, it is so easy to install navigate, my only regret is I waited so long to get one! I am a senior citizen like most  seniors we don't need anymore frustration in our lives Thank You Amazon", "verified": true, "helpfulness": "0/0", "author": "Art S"}, {"rating": 5.0, "review": "Excellent Product !  I really mean excellent too !  Easy to navigate, search, locate, and play ALL content. Heck, I bought one for my Dad and one for Myself !  This, truly, is well worth the cost.  Thank you for such an amazing product.  I plan on buying a 3rd one for my sister,", "verified": true, "helpfulness": "0/0", "author": "Iron 883 Owner"}, {"rating": 5.0, "review": "Easy to set-up and we got a great deal on it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Pogue \"poguejr\""}]