[{"rating": 5.0, "review": "Great piece of equipmen, works excellent", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 5.0, "review": "Absolutely amazing.  Finally something to watch on TV.", "verified": true, "helpfulness": "0/0", "author": "Jim Slade"}, {"rating": 5.0, "review": "Only had for a short time, but I love, no complaints so far!", "verified": true, "helpfulness": "0/0", "author": "Chrissy"}, {"rating": 1.0, "review": "I get \"HDCP unauth content error\" displayed on a blue screen when trying to watch Amazon's own prime video service. Called customer service twice and got the response that i need to upgrade my 5 year old TV. So let me get that straight...you want me to buy a 1000$ TV so that I can watch 35$ stick? BTW, roku works fine and I can watch amazon's prime video in HD...its really funny and ironic at the same time.", "verified": true, "helpfulness": "0/0", "author": "Rahul Sharma"}, {"rating": 4.0, "review": "I've used Apple TV for several years so it is what I am accustomed to.  The Fire TV stick remote operates similarly but it has a slipperiness to it that the Apple remote does not.  The tactile feel of the remote is just off, perhaps it is the plastic it is made of.The unit is so easy to install - just plug it in, sign into your home network, and off it goes.  Adding apps is easy, but a bit tedious.  I wish there were more categories in the Amazon Prime Instant TV like documentaries.  I am not sure how it knows what I like, but so far it is a bit off on that.  I also can't figure out how to rate a show I just watched so that the service can learn what my likes are.Overall a great value - if there was a way to get Amazon Instant Video on the Apple TV I would do it.  Unfortunately there isn't.", "verified": true, "helpfulness": "0/0", "author": "Darren"}, {"rating": 5.0, "review": "I have put this on bedroom TV and am enjoying it very much. I am sure I will enjoy using it when traveling also.", "verified": true, "helpfulness": "0/0", "author": "Betty from Chicago \"Betty from Chicago\""}, {"rating": 1.0, "review": "It didn't work", "verified": true, "helpfulness": "0/0", "author": "Dawn Diskowski"}, {"rating": 3.0, "review": "It works okay. I like being able to download different TV/cable apps. I am disappointed that I cannot use my HBO Now access in the device. It only has HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 5.0, "review": "Easy to setup and use! Plug in the device to your TV's HDMI, plug into power through either the enclosed power adapter or through a powered USB port, connect to WiFi and you are set. Display is awesome. We have a good WiFi connection so no buffering! If Sling TV is all it is cracked up to be and we can get a good digital antenna our cable company is out the door!This device is the perfect gift for those who can't afford cable, moving into dorms, etc. We are a single family home and it is perfect for us!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "jscott"}]