[{"rating": 5.0, "review": "Awesome device, works great and is compatible with all of the streaming services I use.", "verified": true, "helpfulness": "0/0", "author": "Greg Vaughan"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Heidi J. Boogaard"}, {"rating": 5.0, "review": "Loved this product so much I bought 2 more!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Opened up a new avenue to entertainment.  Easy installation and user friendly.", "verified": true, "helpfulness": "0/0", "author": "Royce W Brown"}, {"rating": 4.0, "review": "As of right now it is working. Sometimes it has a hard time with playing some shows, but then what device now a day do....", "verified": true, "helpfulness": "0/0", "author": "Megan D. Knutson"}, {"rating": 5.0, "review": "Is exactly what is advertised and is great for the price.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "Absolutely love it!  Will be ordering more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really enjoy the quantity and quality of movies and TV shows and the music is awesome.", "verified": true, "helpfulness": "0/0", "author": "William Vass"}, {"rating": 3.0, "review": "I love the idea. It is very easy to use and a great way to view web-based shows on a t.v. I would get the box - With the stick the show stops every few minutes. I understand that this is do to the internet speed, but I have good internet. Also, before we bought the stick I guess people at the store told my husband to get the box because of this.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 3.0, "review": "It's really slick for the price, but there's limit to what you can pack into that little stick, I guess, because while it has basically the same features as its slightly larger competitors, it's noticeably slower to respond and the video quality. On the other hand it's half the price, which may make up for it for some folks. I'm definitely not unhappy with mine, but I don't know how I'd feel if it was the only streaming device I had in the house.", "verified": true, "helpfulness": "0/0", "author": "Snipehunter"}]