[{"rating": 5.0, "review": "I Love it!", "verified": true, "helpfulness": "0/0", "author": "Stephen Y."}, {"rating": 3.0, "review": "Too much time searching for next selection.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The best hands thumps up", "verified": true, "helpfulness": "0/0", "author": "Peter Orduno"}, {"rating": 5.0, "review": "This is a Great Product... Get it!", "verified": true, "helpfulness": "0/0", "author": "FStop"}, {"rating": 5.0, "review": "I have a smart tv but it will not do amazon on it so I bought this fire stick. Wow.. super simple to install and yes, you have to plug it into an outlet but no biggie as it was easy enough to hide the cord.The stick came pre-programmed with my amazon info so it was just plug and input my wireless code and I was up and watching a movie in no time.The games look like fun so might buy the game controller as well.I have not downloaded the app onto my phone yet but looks easy enough to do.This is a super simple device that anyone can install and the price is right.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 3.0, "review": "This gizmo is \"OK\". I read that it was the highest rated among its competition ie: Roku etc. so that's the reason I bought it. I use this in conjunction with my new Slingbox. As with all these type of gadgets, there is a slight learning curve. I downloaded the Sling player app to the Fire stick, the controls are kind of primitive. I don't think that's the Fire stick's fault though. Response speed is OK. Just remember how far the distance is from the TV you have the stick plugged in to and where your home TV is. There will always be lag time. I don't use any of the built-in apps. I only purchased this Fire stick mainly to use with Slingbox. So in short, it serves its purpose...", "verified": true, "helpfulness": "0/0", "author": "arleigh simon"}, {"rating": 5.0, "review": "Love it! So easy to watch Netflix!", "verified": true, "helpfulness": "0/0", "author": "Stephen Gremillion"}, {"rating": 4.0, "review": "Love it so much better than the chromecast or the roku. The chromecast didn't have enough apps and you had to use your phone. While the roku was not user friendly.", "verified": true, "helpfulness": "0/0", "author": "D. I. Walker"}, {"rating": 5.0, "review": "This is an awesome device.  It makes streaming so easy.  I love the easy access to amazon videos on our tvs.", "verified": true, "helpfulness": "0/0", "author": "Marge W \"Marge\""}, {"rating": 5.0, "review": "Awesome! I already have Amazon Prime in my livingroom, but needed access in our spare bedroom, so I got the Fire stick. It was INCREDIBLY easy to set up! Within 5 minutes, I had it up and running. Now, when hubby wants to watch Ballgames, I can go to the spare room and enjoy movies and tv shows from Prime! Also, our guests can enjoy watching whatever they want in the privacy of their room when they visit!", "verified": true, "helpfulness": "1/1", "author": "Claudia Gray \"Jettski\""}]