[{"rating": 3.0, "review": "Set up was incredibly simple and the interface runs smoothly, especially compared to the Chrome. My only criticism is that I travel a lot for work and a big reason why I bought the Fire Stick was so that I could use it in hotel rooms during my travels. I've been on multiple trips since the purchase and stayed at a variety of hotels but I have yet to be able to get the Fire Stick to work. Calls to customer support haven't been helpful and I wasn't able to find support online either. If I could get that functionality to work then I would give it all 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Crystal Thompkins"}, {"rating": 5.0, "review": "Had a Chromecast until one of the kids accidently damaged it. Decided to try the Fire Stick this time around-I cannot tell you how pleased I was! Still have all the same capabilities - screen mirroring, access to all of favorite apps (Netflix, Hulu, Amazon Prime) and it is so fast!  LOVE the included remote control-makes browsing so much easier - and it's about 2 to 3 times faster at loading content than the Chromecast. Extremely happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "MommyMeg"}, {"rating": 5.0, "review": "Excellent Value for money.User Friendly.Fast Loading of Movies or Programs.Take with you where ever you're on the move.GREAT !! 😜TWO THUMBS UP 👍👍", "verified": true, "helpfulness": "0/0", "author": "Jacques BANGARD"}, {"rating": 4.0, "review": "Works great if in close range to wifi antenna.", "verified": true, "helpfulness": "0/0", "author": "Don H \"Don\""}, {"rating": 5.0, "review": "Like it alot", "verified": true, "helpfulness": "0/0", "author": "Deshon Wright"}, {"rating": 5.0, "review": "I love the firestick it is absolutely perfect! And the cost is excellent.", "verified": true, "helpfulness": "0/0", "author": "Mikia Steele \"song girl\""}, {"rating": 5.0, "review": "Very easy to install and does a great job.", "verified": true, "helpfulness": "0/0", "author": "curlyjo"}, {"rating": 5.0, "review": "The best thing yet, very fast ,picture quality is excellent, got it within 2 days, im considering ordering another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It is easy to use and quick to install. It is disappointing that you still have to pay for so many of the shows and movies, even with a Prime Membership. So you pay for the Firestick, and you pay to be a Prime member, and then you have to pay for the shows too. Not really worth it. Should have gone with a different product.", "verified": true, "helpfulness": "0/0", "author": "Katokat \"sleeping through Chaos\""}, {"rating": 4.0, "review": "Love it was very easy to install and dose everything advertised .", "verified": true, "helpfulness": "0/0", "author": "Marvin Lee Taylor"}]