[{"rating": 5.0, "review": "The Fire TV Stick that I received from you did not work, the setup did  but we could not see anything but a blue screen and a message telling us that our TV had a HDCP Error meaning that my TV was not HDMI compliant. Long story short is my second call to Amazon Customer Service resulted in talking to an American tech named Zak versus a Philippine tech, who took the time to listen to me.My son found an article describing the problem and the fix, it turns out that this is a common problem and the fix is a HDMI Splitter. Zak found one for me on your site but it wasn't sold or shipped by Amazon resulting in it's taking 10 days to reach me. I finally got it, installed it, and viola, the Fire TV Stick works slicker than snot which is what I told him when he called to see how things were.We especially like the remote, it is so much smoother and faster to scan your offerings than our TV remote. I guess my biggest gripe is I had to fork out another $30 bucks and another 10 days to be able to use my Fire TV StickAfter all is said & done I would definitely recommend it, like I said, Slicker than snot.", "verified": true, "helpfulness": "0/0", "author": "Paully"}, {"rating": 4.0, "review": "Wonderful.  Really love this more than any other multi-media device out there.", "verified": true, "helpfulness": "0/0", "author": "Zachary Matar"}, {"rating": 5.0, "review": "Love it wish  we would have  gotten it sooner", "verified": true, "helpfulness": "0/0", "author": "Virginia Smith"}, {"rating": 5.0, "review": "It is wonderful!  Very happy with my purchase.An abundance of games, apps and videos.", "verified": true, "helpfulness": "0/0", "author": "J. Dunn \"JMD\""}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Jennifer Onovughakpor"}, {"rating": 5.0, "review": "Even better than I could have hoped, and I'm a big amazon fan and had pretty high expectations. I'm only kicking myself I didn't get it sooner, and I plan to give one as a gift at Christmas, along with a prime subscription. The gift that keeps on giving. :)", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Interface is a million times better than the one of my Vizio TV. Easy to use, good feel to the remote, and a responsive interface. The one thing that I wish was possible would be to include a power button for the TV on the Fire Stick remote.", "verified": true, "helpfulness": "0/0", "author": "Jordan Radaj"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "1/1", "author": "anjel"}, {"rating": 4.0, "review": "This thing has worked out pretty well for my son. The biggest issue, and reason for the one star deduction, is that freetime does not work witht he stick. That is a pretty huge downside to this thing. It makes the MRC I pay to Amazon a little less of a good deal.", "verified": true, "helpfulness": "1/1", "author": "Andy"}, {"rating": 5.0, "review": "The Amazon Fire Stick is a great little unit.  Small enough to carry with you on a trip.It also works very nicely with KODI if you know how to install it.", "verified": true, "helpfulness": "0/0", "author": "jeff barbanell"}]