[{"rating": 4.0, "review": "It does exactly what I need it to do. And I love the remote!", "verified": true, "helpfulness": "0/0", "author": "Evanna Payen"}, {"rating": 5.0, "review": "The best all around tv streaming device you can buy right now. Use agk fire app to sideload kodi and firestarter launcher & you're all setup!", "verified": true, "helpfulness": "0/0", "author": "Micah Davis"}, {"rating": 5.0, "review": "We love it.  It works better for us than Netflix did.  We had spooling problems with Netflix and while their customer service tried to fix it, we continued to have spooling problems.We also love the Prime membership offerings with Fire Stick.  Awesome.", "verified": true, "helpfulness": "0/0", "author": "Shirley A. Rudd \"sar\""}, {"rating": 5.0, "review": "I have the Google Chromcast also.  The Fire TV Stick is so much easier to work with and program.  It's really nice not to have to use my computer.  I never use the chromcast anymore.", "verified": true, "helpfulness": "0/0", "author": "Hank"}, {"rating": 4.0, "review": "The set-up was a little more difficult than expected.  All of the instructions were in German, and my fluency is more than 40 years out of date.With assistance from the help line, I was able to find the correct selection to change the language to English.  The unit works fine.", "verified": true, "helpfulness": "0/0", "author": "Charles McSorley"}, {"rating": 5.0, "review": "Lower your bills & get rid of cable and sattelite. The Fire Stick is the BEST alternative! 5 stars!!", "verified": true, "helpfulness": "0/0", "author": "Victoria Mason"}, {"rating": 3.0, "review": "Interesting device! I admit it is small, convenient, and very easy to install. Yes! Consumer friendly. Picture clear as can be.My problem is, it takes 3 hours to watch a 2 hour movie. Why? Because as your watching the movie streaming has to catch up the movie stops it begins to process then movie continues. Unfortunately, this occurs about every 3 minutes and it took anywhere from 10 seconds to 2 minutes. Once it went back to the beginning of the movie. I have a Wii game in family room watched Netflix, it only happened twice for about 10 seconds. Granted the Wii game is only6 feet from WiFi and my bedroom is 35 feet away. Could this be the problem? Not sure. My grandson says WiFi is only guaranteed from cable companies for 20 feet. Something to think about? Call your cable company first. If there is an answer please share.", "verified": true, "helpfulness": "0/0", "author": "William J. Mclean Jr. \"BIG BILL\""}, {"rating": 5.0, "review": "Excellent product, works as advertised", "verified": true, "helpfulness": "0/0", "author": "larry webb"}, {"rating": 5.0, "review": "Great value item", "verified": true, "helpfulness": "0/0", "author": "Jim Evans"}, {"rating": 5.0, "review": "Nice device if you have Amazon Prime and don't have a smart TV with the app installed on it.  Excellent if you have a TV not hooked up to cable or dish in a guest bedroom or whatever.  All you need is wifi and you are good to go!  Saves on paying for that extra TV you hardly ever use and allows you to choose from all those programs and free movies.", "verified": true, "helpfulness": "0/0", "author": "DDLB"}]