[{"rating": 5.0, "review": "A", "verified": true, "helpfulness": "0/0", "author": "Cameron B. McKay"}, {"rating": 5.0, "review": "Easy to use and set up. The fire tv stick is very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Pmorphy \"pmorphy\""}, {"rating": 5.0, "review": "Works great with my insignia tv. Streams fast. Was so easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Michelle Fowler"}, {"rating": 5.0, "review": "Awesome product so far!", "verified": true, "helpfulness": "0/0", "author": "Linds"}, {"rating": 5.0, "review": "i love the amazon fire stick! so thats why i ordered 2 more amazon fire sticks so my kids have them for in their bedromms!", "verified": true, "helpfulness": "0/0", "author": "Heather Marie Bell"}, {"rating": 5.0, "review": "For $39 you can't go wrong. Slick looking. Great packaging. I was very surprised with how fast it isand responsive .... very happy with the 8GBand love the interface. Amazon continues to update and with Amazon Studios we will see moreAMAZON original series. The remote is good. Bit difficult to open the back to place the battery.Overall ..I have been using this product for over a week now and very satisfied. Highly Recommend this product !!", "verified": true, "helpfulness": "0/0", "author": "FABIO A PENA JR"}, {"rating": 5.0, "review": "This stick works great. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Linda Kay Bostwick"}, {"rating": 3.0, "review": "Pretty good product but don't like that even though I have Netflix and Hulu it will tell me it's only available on amazon and not always free but with a price. Really really don't like this because when I search manually through the other systems it shows the show I was searching as available and FREE. Hmmm", "verified": true, "helpfulness": "0/0", "author": "Jamie Fisher"}, {"rating": 1.0, "review": "This is a very unreliable piece of hardware!!!  I received a replacement module and it doesn't work any better than the first.  Sometime it works, but most of the time it doesn't.  Amazon tech representatives keep me on the phone for about six hours total and never turned it into a piece of reliable hardware.  The Stick has line-of-site to my TV--about 10ft.  The module says the signal is from excellent to fair, but will not connect consistently.  Sometimes it's connected, but most of the time it is not.  Most of the time I see the screen saver photos.I bought this hardware at the intro price of $20 and I'm glad I did because it is not worth the current price of $90!!!!  Amazon blew it on this project!PS  the Aamzon tech reps have no idea to fix this problem!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "dcstoo"}, {"rating": 1.0, "review": "Unhappy that it required plugging it in to an outlet. Commercials are misleading. Very disappointed. Retuned it.", "verified": true, "helpfulness": "0/0", "author": "Robert"}]