[{"rating": 5.0, "review": "we watch stuff every day, and if you're a Prime member, you see stuff for free!", "verified": true, "helpfulness": "0/0", "author": "Yo Mama \"ErinBS\""}, {"rating": 5.0, "review": "Fantastic purchase", "verified": true, "helpfulness": "0/0", "author": "Michael Booher"}, {"rating": 5.0, "review": "Worked like it said....to simple...Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Carlos Vargas"}, {"rating": 4.0, "review": "Works! Should have come with a longer cord!  Had to buy one .  Also wish they would add Acorn TV.", "verified": true, "helpfulness": "0/0", "author": "J. Horchak"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to set up and use. Love extending my Amazon Prime benefits even further!", "verified": true, "helpfulness": "0/0", "author": "Carmen Duroni"}, {"rating": 3.0, "review": "With the selection of channels on the box advertised, I was a bit disappointed with the availability compared to the Roku after I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Harris"}, {"rating": 1.0, "review": "This product is terrible! I have not been able to use it once since I bought it in February! It shuts my tv off drops the Internet connection, just a bad product in general.  And big surprise when I wanted to return it it just happened to be right outside the window of time I had to do so.  I've used Amazon for everything and this is truly disappointing! (Only gave one star be use its required)", "verified": true, "helpfulness": "0/1", "author": "Samantha Fitzpatrick"}, {"rating": 5.0, "review": "Works great and there are lots of choices. Love that my kids can watch the older shows like Chitty Chitty Bang Bang and Pink Panther!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "Much better than chromecast. Easy to use and a fun gadget.I mirror European outdoor concerts from You Tube ( Andre Reiu ) from Kindle Fire hdx 7 and they are amazing.Will", "verified": true, "helpfulness": "0/0", "author": "Will"}]