[{"rating": 5.0, "review": "Awesome! !", "verified": true, "helpfulness": "0/1", "author": "erick"}, {"rating": 2.0, "review": "This has a hard time keeping connected to the home wifi. Still havent decided if I should return it or not", "verified": true, "helpfulness": "0/1", "author": "dman"}, {"rating": 5.0, "review": "This does exactly what I bought it for. I downloaded an App for my Galaxy 5 called \"TVFI\" and can mirror my phone to the TV. Such a convenient product!", "verified": true, "helpfulness": "0/1", "author": "David Barrero"}, {"rating": 5.0, "review": "Awesome and super easy to use!  Ordering a second one for the other TV in the house.  Easy set up and easy installation!", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love watching black and white movies that item has provided just that.", "verified": true, "helpfulness": "0/1", "author": "Virginia E. Moreno"}, {"rating": 4.0, "review": "Easy to set up and use. Good product.", "verified": true, "helpfulness": "0/1", "author": "Brittany Grogan"}, {"rating": 4.0, "review": "Incredibly easy to set up and works well.  Movies load instantly despite my very slow internet speed.  The only reason I bought it was to have easy access to Amazon Prime videos.  I wish it the device had more additional features that I'm interested in (I have Apple TV already and they essentially offer the same except for each machine's proprietary channels - iTunes vs Amazon) but for the very low price it's worth adding Amazon Fire TV Stick.  Now to buy an HDMI switcher for all my devices and HDMI cables.", "verified": true, "helpfulness": "0/1", "author": "C. Taylor \"Movie Maven\""}, {"rating": 5.0, "review": "Plugged it in and working great.", "verified": true, "helpfulness": "0/1", "author": "Robert"}, {"rating": 5.0, "review": "Came fast and works great!", "verified": true, "helpfulness": "0/1", "author": "JBillz"}, {"rating": 5.0, "review": "Great little gadget.  Easy to install and get started with!", "verified": true, "helpfulness": "0/1", "author": "k. cor"}]