[{"rating": 5.0, "review": "I am so happy with the Fire Stick. I love all the free TV and movies! I wish there was a keyboard that worked with the Afire Stick. I hate having to use the remote to type in search words. But it is still really awesome!", "verified": true, "helpfulness": "0/0", "author": "angela"}, {"rating": 5.0, "review": "I must say this item is the best thing since peanut butter and jelly. I have a flatscreen in the living room and the bedroom. The one in the bedroom does not have the programs to access various options like the one in the living room does. This forces me to ask the wife to watch tv in the bedroom so I can watch Amazon or Netflix which I feel bad doing. I purchased this item and now I can lay in bed and watch movies without having to ask the wife to change rooms. The hardest thing about the stick was trying to open the remote to put the batteries in and Amazon has a video that I googled that will show you how to open it as they discovered that many people as myself had a problem with opening the remote to insert the batteries. After that I followed the brief instruction that were only needed for hook up and within 5 minutes I was watching Amazon Prime movies just that fast. Would recommend this product to anyone without hesitation", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 1.0, "review": "Worked great for the first 4 months now remote died noting plays without stopping and I am so irritated i will most likly not renew prime", "verified": true, "helpfulness": "0/0", "author": "bblack23"}, {"rating": 5.0, "review": "Sweet, easy to install...I'm NEVER going back to cable!!", "verified": true, "helpfulness": "0/0", "author": "Stephen D. Ward"}, {"rating": 5.0, "review": "5 minute installation easy to use..only downfall is now yet anoyher remote", "verified": true, "helpfulness": "0/0", "author": "Blitzkrieg"}, {"rating": 1.0, "review": "04/22/2015 Experiencing buffering issue with FireTV stick and MLB.TV; reported to Amazon on 04/9/2015 and chatted with Amazon support.on 04/22/2015; was told it was a known issue with the App and Amazon was working with app developer to resolve. Amazon rep said expected update in 2 or 3 days; My phone and Android tablet run MLB fine on same wifi network. Amazon promised response within 2 or 3 days of 04/22/2015.I will return FireTV stick and go to Roku or Apple TV  if not resolved; I want my MLBTV. Update, went to Walmart, got a roku stick and problem is gone! The problem is definitely the Amazon stick or MLB app. Regardless, I'm returning my FireTV stick! The problem has been there for a month and has not been fixed, Amazon, you snooze, you lose!", "verified": true, "helpfulness": "0/0", "author": "Arcee"}, {"rating": 5.0, "review": "I already have an Amazon FireTV, and it gets a lot of use. I bought the Stick for another tv in the home. Setup is extremely easy and intuitive. Works great. I got the IOS app for my phone so that I can use the voice search, and that works well also.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Very Cool!", "verified": true, "helpfulness": "0/0", "author": "Tommyboy84"}, {"rating": 4.0, "review": "Works great, streaming is smooth and quick even at crappy Time Warner 15mb internet speed. Would like to see more movies/tv shows/games but understand product it new and things are being added every day.", "verified": true, "helpfulness": "0/0", "author": "cpy"}, {"rating": 5.0, "review": "love it works great", "verified": true, "helpfulness": "0/0", "author": "little angel"}]