[{"rating": 5.0, "review": "All I expected and more; love Pluto TV!!!", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 5.0, "review": "Awesome device. Very user friendly!", "verified": true, "helpfulness": "0/0", "author": "ohio304"}, {"rating": 5.0, "review": "Awesome product I'd much rather pay $100 a year for prime then $100 a month for cable and shows I don't watch. Huge variety", "verified": false, "helpfulness": "0/0", "author": "John Bloom"}, {"rating": 3.0, "review": "The commercials on tv don't show the power cable, so I was pretty annoyed. I was expecting hdmi slot witchcraft, but now I have another cable around the tv. Thanks for the false advertising, Amazon. Other than that, it works fine.", "verified": true, "helpfulness": "0/0", "author": "Miran Mehic \"Koala\""}, {"rating": 5.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Carl Brick"}, {"rating": 4.0, "review": "Doesn't support windows miracast devices. I'm told by amazon reps that it will in 2015. Other than that it's a great little device.", "verified": true, "helpfulness": "0/0", "author": "Reviewer is SC"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Andrew Carazza \"AJCJr\""}, {"rating": 5.0, "review": "Life made easy!  It's perfect.", "verified": true, "helpfulness": "0/0", "author": "Jane Schuster"}, {"rating": 1.0, "review": "This purchase was a total disappointment. It suffers from a very limited app selection, has no web browser, can't add the Google Play store (so all the content and apps I've purchased there are inaccessible). I can't connect to bluetooth devices like mice, keyboards or external speakers/headsets. There's no native DLNA player so I can't stream content from the other devices in my home. Compared to generic Android HDMI sticks available at a similar price from overseas vendors, this product is a total loser. A $45 HDMI stick I bought over a year ago from a website in Hong Kong can do all these things and more, it even has USB ports to attach local drives, wired ethernet and other devices - another no-go for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Very good streaming device! Easy to use and comes with many free TV shows and movies if you're a prime user.Pros :Low price!Great hardwareAmazing capability to interface with almost every remote without configuration.Awesome user friendly GUI.Great shows for prime users.Great apps.Cons:No access to home servers over FTP. You can't play home movies via this device.No force stretch option for older shows.", "verified": true, "helpfulness": "0/0", "author": "three_legs"}]