[{"rating": 5.0, "review": "Does what it is supposed to do.  Even included a short extension for the cable, as my tv is a little bit older and has a curve near the HDMI port that didn't allow a straight plug in.", "verified": true, "helpfulness": "0/0", "author": "April \"melissa\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Daniel de Sousa Mendes"}, {"rating": 4.0, "review": "I like the item very much", "verified": true, "helpfulness": "0/0", "author": "evelyn"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "adrienne"}, {"rating": 3.0, "review": "It's what I needed. Installed easy and quirk.", "verified": true, "helpfulness": "0/0", "author": "Martha K. Ball"}, {"rating": 4.0, "review": "Pros:  Love the stick because I love streaming video from Amazon Prime to my TVs.  I also have a Roku stick and it is far more responsive than that little sucker at $10 less.Cons: My biggest issue is the fact that it operates best when plugged into an outlet.  Are you guys aware that the tv area already requires approximately 1 million things to be plugged in in that vicinity?  What is the point of making it this cool little unobtrusive stick if I have to dangle a power cord from it in order for it to work properly?  Additionally, the adapter has a very short reach.  If you have your tv on the wall and it in not 2 feet from the outlet, this is a problem. Second the adapter takes up so much space on a power strip I can't use the plug next to it  Why is this necessary? I tried just plugging in the USB to power it, but when I use it this way, I get a 'not enough power to charge stick' message and the sounds gets warbly and off from the video.Do I use it?  Yes?  Do I really sort of expect better thought out user experience from Amazon?  Also, yes.  Would I buy an additional one?  Argh.  Probably not.", "verified": true, "helpfulness": "0/0", "author": "A. Edwards \"books for all reasons\""}, {"rating": 3.0, "review": "Works half the time. :(", "verified": true, "helpfulness": "0/0", "author": "jean b smyth"}, {"rating": 1.0, "review": "Not as many movies as you wold think and if your have dish or Xbox you already have the other stuff they offer.", "verified": true, "helpfulness": "0/0", "author": "Blaine"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "John A. Warner \"Chip Warner\""}, {"rating": 3.0, "review": "Needs a better wifi signal. Had to get a Wifi Extender.", "verified": true, "helpfulness": "0/0", "author": "Brian"}]