[{"rating": 5.0, "review": "Just what I needed and price is right  Works great!!!", "verified": true, "helpfulness": "0/0", "author": "CINDY EPIFANIO \"guerrooska\""}, {"rating": 4.0, "review": "Great product just gets aggravating when internet service is weak", "verified": true, "helpfulness": "0/0", "author": "hkhitt"}, {"rating": 5.0, "review": "I have had both Apple TV and Roku.  I hated the Roku setup and the inability to toggle between different Netflix profiles.  The Fire TV stick was by far the easiest setup of all 3.The only issue I have had with it so far is it refuses to switch the time zone to accurately reflect my current time.", "verified": true, "helpfulness": "1/1", "author": "Emily K. Mckinley \"EmKat2\""}, {"rating": 5.0, "review": "This Fire stick is so dope, made my life a little more happy!", "verified": true, "helpfulness": "0/0", "author": "Sonny"}, {"rating": 5.0, "review": "Easy set up, works well. We are enjoying it! A little thing, but also impressed me, that the remote came with batteries. Nothing comes with batteries anymore. Enjoying our Prime streaming on the TV screen!", "verified": true, "helpfulness": "0/0", "author": "Jess"}, {"rating": 4.0, "review": "A seemingly easy install turned into a 2 hour job because all of the on screen instructions were in German, with no way to change language until user name, password and WIFI password were installed and accepted.  What a pain!!!", "verified": true, "helpfulness": "0/0", "author": "Roger A. Jensen"}, {"rating": 5.0, "review": "I cannot say enough. I cut the cable finally and I am ecstatic.  I had no idea how much I would enjoy it and have been telling everybody to cut the cable, even people at my internet providers office when I go to make a payment.  I have only had it for 2mths and I will keep my amazon prime indefinitely,  I never knew prime had so much stuff and the choices you have to put on the firestick even without prime is phenomonal.  I think this is the greatest thing since the invention of the TV.", "verified": true, "helpfulness": "0/0", "author": "Olinda Henderson"}, {"rating": 5.0, "review": "The Firestick has met all my expectations. I subscribed to Sling TV and got the Firestick free.  I have finally got rid of my high cable bill and do not miss it at all.", "verified": true, "helpfulness": "0/0", "author": "Steve \"sjs731\""}, {"rating": 2.0, "review": "Not really compatable to andriod products", "verified": true, "helpfulness": "0/0", "author": "JERRY CHIN"}, {"rating": 5.0, "review": "Luv it!", "verified": true, "helpfulness": "0/0", "author": "Glenn Coopersmith"}]