[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Callie"}, {"rating": 5.0, "review": "Easy to install, worked well right away. We are enjoying it immensely .", "verified": true, "helpfulness": "1/1", "author": "RUTH  E.  HINES"}, {"rating": 5.0, "review": "Love the Amazon Fire TV Stick.  Very easy to install and remote very easy to use.  I cancelled my cable and can still stream the shows I watch.  Plenty of choices of movies, TV series and apps.", "verified": true, "helpfulness": "1/1", "author": "Lovin Life"}, {"rating": 2.0, "review": "Not sure what this is for to be honest.  All it really does it provide a wider selection of things to rent.  Nothing free and not much different to Netflix in truth", "verified": true, "helpfulness": "0/1", "author": "Scalpel"}, {"rating": 5.0, "review": "It was everything I expected it to be.  I can watch all the movies and TV series on my TV now. Wonderful.", "verified": true, "helpfulness": "0/0", "author": "Cindy Johnson"}, {"rating": 5.0, "review": "I like the fire stick.", "verified": true, "helpfulness": "0/0", "author": "John hayes"}, {"rating": 2.0, "review": "It's a great idea, and when it works it's awesome, but it constantly drops the wireless signal, even though my router is right on the other side of the living room (and I have the upgraded comcast internet speed.) I'm going to buy the $99 plug-in model instead, to see if that doesn't get rid of the constant buffering and dropped signals.If not for the constant wireless issues, I'd give it 4 stars. Prime content needs to be a little better. It seems like 60% of their Prime content is infomerical and B-movie garbage. Not bad enough for 3 stars, but not good enough for 5, certainly.", "verified": true, "helpfulness": "0/0", "author": "David Monteith"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "happienlife"}, {"rating": 5.0, "review": "I am very very pleased with this. It supports everything that I watch streaming and already pre setup for my Amazon account! I only wish it were HARDER for little hands to purchase content. When easy is too easy. I wish it came with the better remote, oh well. I don't play games so I cant comment on how well it performs in that aspect.", "verified": true, "helpfulness": "0/0", "author": "RomanST"}, {"rating": 5.0, "review": "Great addition to media library. Easy to use,great for viewing pictures and playing games.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]