[{"rating": 2.0, "review": "Easy to use but as with other complaints it seems to skip a lot while watching Netflix and Hulu.", "verified": false, "helpfulness": "0/1", "author": "Stephen R Meiczinger"}, {"rating": 5.0, "review": "EXCELLENT product worth every penny.  Does exactly what it's supposed to seamlessly!", "verified": true, "helpfulness": "0/1", "author": "vanman \"Ace\""}, {"rating": 4.0, "review": "I am very pleased with my purchase. I am able to stream movies and videos on my tv. It is a much more pleasant experience than watching them on a small device. The set up was very easy and I was able to start using the Fire Stick in 10 minutes. I highly recommend it.The only slight negative is that using the USB connection, instead of the power adapter, causes the video to stall at times.", "verified": true, "helpfulness": "0/1", "author": "Justagal"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Marcy Munoz-Navarro"}, {"rating": 5.0, "review": "Never could get my Chromecast to work. Replaced it with the Fire Stick.  This Amazon Fire Stick was so easy to set up and works perfectly. I absolutely love it.", "verified": true, "helpfulness": "1/2", "author": "Janis D."}, {"rating": 5.0, "review": "Great. My family loves it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Turned my TV into a smart TV.  My Netflix, HBO Go, YOUTUBE, ESPN, all work great. Lots of games too.", "verified": true, "helpfulness": "0/1", "author": "Steven Nakamura"}, {"rating": 5.0, "review": "Turned our basic TV in the bedroom into a smart TV for $40. I'm a long time prime member so this was an obvious choice. We used to use a noisy PS3, so the best thing about this for me is its quiet, which might sound weird but is incredibly important in the bedroom.", "verified": true, "helpfulness": "0/1", "author": "Steve Pehrson \"Inglo\""}, {"rating": 5.0, "review": "I have to say this thing is awesome. The picture quality and sound are outstanding. Easy to hook up and activate. Great product Amazon. Love it.", "verified": true, "helpfulness": "0/1", "author": "George K. Piersall"}, {"rating": 5.0, "review": "Love it!!! Bought as a replacement for my ATV2. I bought it for $26 during the amazon cyber sale. Kodi runs great! Powerful and portable, I'm buying them as Xmas gifts for my friends", "verified": true, "helpfulness": "0/1", "author": "Much510"}]