[{"rating": 5.0, "review": "So great! I love the fire tv stick and am so happy with it I bought another tv stick and several full fire tv units as holiday gifts. The system is really easy to use, streams very fast and smooth (better than my apple tv and roku units). I only wish the remote had light-up buttons for watching tv in a very dark room--I might put some glow in the dark tape on it and see if that helps visibility on the remote itself.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Love it. Works great for my HDTV on the wall in the man cave!", "verified": true, "helpfulness": "0/0", "author": "John W."}, {"rating": 3.0, "review": "Not quite as easy to install as promo indicated.  Had to go online to install it.", "verified": true, "helpfulness": "0/0", "author": "woodwhit \"class action - NO!\""}, {"rating": 4.0, "review": "I jumped on this when the price dropped to $19 for Prime members. I already had a chromecast so it was more out of curiosity for a tech fan. It works just as well as the chromecast and the remote is a great addition, but sometimes it seems a bit touchy. I've set it down, face down, and it turned off the movie and went to the main menu. Just a minor issue. A more prominent issue is the connection to wifi. If my chromecast had the same problem, I'd accept it's my brand new router. But it doesn't. The Fire TV Stick occasionally goes into a boot loop of sorts. For instance, I had to go back to my chromecast because the Stick wouldn't stay connected. It doesn't happen all of the time, but more than I would like.  Other than that, it's a great piece of tech at even $39, it's worth it. It's nice to have such a small product that doesn't take up any space do so much. I highly recommend it. It'll be 5 stars when the connection issue is fixed.", "verified": true, "helpfulness": "1/1", "author": "Bob Y."}, {"rating": 4.0, "review": "great but a little hard to see overview of what is available from Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ria Foster"}, {"rating": 5.0, "review": "This was so easy to set up. I was already an Amazon Prime member so it made so much sense to watch my movies and shows that I alreadyhad on my Kindle Fire on a bigger screen. And besides there are many, many other options to choose from.", "verified": true, "helpfulness": "0/0", "author": "Dawn Shaeffer"}, {"rating": 1.0, "review": "It didn't work as it was supposed to and I ended up returning it for a refund. I wasn't impressed with it. :[", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works Great! I was surprised at how easy and quick it was to set up. Content loads quickly, plays without needing to buffer AND the picture quality is excellent.  Thanks again, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 3.0, "review": "still getting used to it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LMM\""}, {"rating": 5.0, "review": "LOVE LOVE LOVE this thing!!!!!", "verified": true, "helpfulness": "0/1", "author": "AP"}]