[{"rating": 3.0, "review": "Does not work as well as my Roku 2XP", "verified": true, "helpfulness": "0/0", "author": "Hugh A. Stephens"}, {"rating": 5.0, "review": "Really like our new fire stick so much to watch and do thanks amazon", "verified": true, "helpfulness": "0/0", "author": "lorrie"}, {"rating": 1.0, "review": "I bought this for my Non Apps TV thinking I could plug in the stick only and have the apps on my HDMI TV. However that is not the case. Ad is misleading. You must attach a USB cable for power which makes it look like a mess hanging down from my TV on the wall.. In order for me to get this to work I would have to buy an extension USB cable so it could run down the wall to an AC Outlet.  Very disappointed that I could not just plug only the \"stick\" in the HDMI and expected it to work. Be warned you will have to attach usb cable for power to the stick which IMO makes this useless. Should have gone with the chrome stick.  All the pics show just the stick and the remote , no where do I see a USB cable attached to the stick. Always liked Amazon but now have to rethink buying there products.", "verified": true, "helpfulness": "1/4", "author": "David C. Phillips"}, {"rating": 5.0, "review": "cool stuff", "verified": true, "helpfulness": "0/0", "author": "Siwei Chen"}, {"rating": 3.0, "review": "Works OK but not as well as I expected.  My Blu Ray player has wi fi and has no trouble getting the signal from my router.  This device at the same location has trouble connecting to my wi fi.", "verified": true, "helpfulness": "0/0", "author": "J. L. Carr"}, {"rating": 5.0, "review": "it is good for the price, I pre ordered but it was easier to go to best buy and get it , one amazon was backing the order for so long.", "verified": true, "helpfulness": "0/0", "author": "latino"}, {"rating": 5.0, "review": "I love this! So much better than a Chromecast. You can see apps, Amazon videos, and games on it very easily.", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 4.0, "review": "Great product overall, but the remote gets \"behind\" sometimes so I have to wait 10 seconds or so for it to catch up. This isn't always though and doesn't stop me from giving it 4 stars.", "verified": true, "helpfulness": "0/0", "author": "Eric J. Majerus \"variablex9\""}, {"rating": 5.0, "review": "Exelent device", "verified": true, "helpfulness": "0/0", "author": "Juan Escobar"}, {"rating": 5.0, "review": "I received my fire stick ahead of time and began to set it up. The setup was a breeze, in no time I was watching movies from my watch list. I tried out the voice thing and it works very well. The only thing is when you use the voice thing to find a movie, it not only searches the prime but the pay movies, which could mess you up if you don't watch out. If you are on the prime movies it still searches all the movies. Maybe there is a reason, but I would like to search just the prime movies. I really like the fire stick over my TV for just the watch list thing, the TV has no watch list feature. I can search prime movies on my pc then view them on any TV in the house. I still gave it a five.", "verified": true, "helpfulness": "0/0", "author": "Yak Yak Face \"Yak\""}]