[{"rating": 4.0, "review": "Love it and it works great. Only wish I could use it with Vudu. Other than that very pleased.", "verified": true, "helpfulness": "0/0", "author": "Brian M"}, {"rating": 5.0, "review": "I bought this for my husband and he loves it.  He likes being able to watch such a wide variety of shows whenever he wants.", "verified": true, "helpfulness": "0/0", "author": "Christina Hamby"}, {"rating": 3.0, "review": "It's good but I'm disappointed because I can not cast series with external subtitles (eg .srt files) like Chromecast does.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Bought this on the special preorder deal. Stick lags hard on all channels... Tried it in homes with excellent wifi and still obtaining poor quality streaming! Stick crashes often, needs serious updates ASAP! Considering sending it back for a replacement, maybe the first batch of sticks were bad... My Roku 2 I bought 4 years ago is wayyyy better than this thing! Also the interface could use a little work, maybe include an actual app store so I can browse all the available apps including the 'most popular' ones.", "verified": true, "helpfulness": "1/1", "author": "MB"}, {"rating": 5.0, "review": "And they thought of that cool remote for the small stick. Good product for the price.", "verified": true, "helpfulness": "0/0", "author": "Aarthi Srinivasan \"Aarthi\""}, {"rating": 5.0, "review": "Works as described.For the price very nice product especially if you have amazon prime.Did not try the games yet,but that should be a bonus for the kids.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Really love the Kindle Fire Stick. This makes watching TV so much better and is so easy.", "verified": true, "helpfulness": "0/0", "author": "Kimberly M. Clark"}, {"rating": 1.0, "review": "It's awful the streaming does not work.  I called and they told me it was a Netflix issue. But It is also s prime, Hulu and sling TV ussue for me. I'm forced to watchtower blurry and  Amazon have not offered any option after two purchases.", "verified": true, "helpfulness": "0/0", "author": "Nancy mitchell"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Bella423"}, {"rating": 2.0, "review": "Extremely disappointed. Mine always has to be plugged into the wall outlet eventhough I have 2015 TV. Plus the interface is very laggy. My old PS3 is on the same TV and the internet connection is so much stronger. At least I bought it early and saved a few bucks.", "verified": true, "helpfulness": "0/0", "author": "Jungle Alive"}]