[{"rating": 5.0, "review": "I ended up getting this after my Roku stick couldn't fit behind the TV. I am happy that I ended up going with the fire stick instead. I can hook it up to my amazon account and have access to my prime account and the shows and movies I had previously just for my kindle. My family loves it and my sister is now waiting to get one for her apartment because and I quote, \"I don't need cable anymore I just need this.\"", "verified": true, "helpfulness": "0/0", "author": "monika porch"}, {"rating": 4.0, "review": "Changing this to 4 stars, Netflix is now working, it took a while, but it looks like it was on Netflix end.  I would give this 5 stars if I didn't need to power it, but not sure if a battery would work or not.", "verified": true, "helpfulness": "1/1", "author": "Kevin London"}, {"rating": 5.0, "review": "had prime time for some time and never used the free movies and much more. Bought the fire TV stick and I was surpriced how easy it was to set it up on my tv. The collection of movies videos tv shows and so much more are available I never run out to watch something I like. Now I bought another fire TV stick so my husband can watch a movie he like and I watch on the other TV what I like, it was a great investment.", "verified": true, "helpfulness": "0/0", "author": "Quilter"}, {"rating": 5.0, "review": "So much faster to load Netflix and Prime than my BluRay player. Push a button and the menu appears instantly! I also like the way it maneuvers though the menu better. One more thing, I really like its portability. I use the same Fire Stick on the main TV downstairs and my bedroom tv.  No problem picking up reception upstairs from my downstairs router. I have recommended the Fire Stick to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Jane M."}, {"rating": 5.0, "review": "Bought as a gift. They absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 2.0, "review": "Not compatable with Direct TV service provider to use A&E;, Lifetime.", "verified": true, "helpfulness": "0/1", "author": "michael crouthers"}, {"rating": 5.0, "review": "I love the amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "LaSaundra Dean-Bamundaga"}, {"rating": 5.0, "review": "Love the fire tv stick. We used to watch Netflix and Prime on our Wii and this is so much better. We love the Prime music feature too.", "verified": true, "helpfulness": "0/0", "author": "zao cor"}, {"rating": 4.0, "review": "Functioned as advertised and was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "A&J Properties"}, {"rating": 5.0, "review": "Awesome so far!", "verified": true, "helpfulness": "0/0", "author": "Jaso-Sarm"}]