[{"rating": 5.0, "review": "Excellent product. Worked easily and immediately.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really like the firestick! Incredibly easy to use, just plugged it in. Now I'm watching Amazon Prime shows and Netflix on my nice big TV instead of my computer. Thinking about getting a second one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Readerly"}, {"rating": 5.0, "review": "I love the Amazon Fire Stick! Was fortunate to get it at $19 prime member deal. Love the remote and remote app. Love the update that included the wifi login portal. Sometimes laggy, but I think that has something to do with the internet connection.", "verified": true, "helpfulness": "0/0", "author": "Treneicia"}, {"rating": 4.0, "review": "Faster than my roku and very clean.  Love it.  Wish it had more apps like free speech tv though", "verified": true, "helpfulness": "0/0", "author": "William J Davis"}, {"rating": 5.0, "review": "I like it, no complaints so far. Works exactly like watching on my computer.", "verified": true, "helpfulness": "0/0", "author": "Robert Fowler"}, {"rating": 5.0, "review": "Easy to use. Really like it. And cheap!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It buffers too frequently. Some days it worked great and some days it took us 25 minutes to get through 10 minutes of a scene because of the buffering. Ruined movie nights! Avoid - there are better products.", "verified": false, "helpfulness": "0/0", "author": "Jerry Jones"}, {"rating": 2.0, "review": "The device worked for a few but now drops network connection. I have looked all over the message boards and google for tips to fix it. I have been in IT for over 15 years and still can't put my finger on it. I have a fire TV that works without any issue. May I suggest paying the extra money and getting a product that works.", "verified": true, "helpfulness": "0/0", "author": "pheeasco"}, {"rating": 4.0, "review": "Very easy setup.", "verified": true, "helpfulness": "0/0", "author": "David Cantrelle"}, {"rating": 5.0, "review": "Great device. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lisa Stickles"}]