[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Patrick Shewey"}, {"rating": 4.0, "review": "GREAT!", "verified": true, "helpfulness": "0/0", "author": "RICARDO TRUJILLO-MEJIA"}, {"rating": 5.0, "review": "I like this much better than Chromecast. All the controls are on screen, I don't have to cast from my phone.", "verified": true, "helpfulness": "0/0", "author": "Trucker Chris"}, {"rating": 1.0, "review": "Up to now I haven't been able to sign in in the Netflix account. Very dissappointing.", "verified": true, "helpfulness": "0/0", "author": "Cary"}, {"rating": 5.0, "review": "My grandson is enjoying the amazon stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Thanks for the Labor Day sale!Fire TV Stick was easy to install - we were up and running within 10 minutes (5 of that devoted to entering the stick's MAC address into our router's wireless filter). Amazon Prime content loads instantly, and the connection is steady, unlike the Amazon app we'd been using on our smart TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "Patrice Sigmon"}, {"rating": 4.0, "review": "I am enjoying the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Wenna Phelps"}, {"rating": 1.0, "review": "I am disappointed in Amazon.  People who review here must either all be lucky or Amazon is pruning bad reviews.  The Internet boards are loaded with people like me who cannot stream without buffering constantly.  Does not matter how you set this up, every app including the prime video app will buffer constantly.  I have a cheap wifi blu Ray player right next to the stick and the same apps (netflix, hulu, prime, etc) never buffer and stream flawlessly.  The key reason I am so negative is Amazon does not care.  They took my money and don't apologize nor refund for this crappy device.  They offer no solution other than \"reset your device\" or \"clear the app cache\" neither of which solves the problem.  Amazon you should be ashamed of this product.  Look elsewhere for a streaming wireless solution.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing! It performs very well for a stick, has good speed, lots of options and choices for apps and I haven't had a problem yet. I would choose this over a chromecast as I have both. Definitely a solid buy.", "verified": true, "helpfulness": "0/0", "author": "Steve C."}, {"rating": 4.0, "review": "I use it for my Amazon Prime movies.  I just wish the remote was labeled as to what each button is for - very confusing!", "verified": true, "helpfulness": "0/0", "author": "janb"}]