[{"rating": 1.0, "review": "I purchased it in the US in order to use it for Netflix in a non-smart TV.I knew that many features are region locked but I still wanted it because the control is easy to use for my parents in Mexico (they only wanted it to access Netflix which has international service).It worked great, fast and responsive for the first two weeks, but Amazon blocked it and we can not access Netflix using this device anymore in Mexico.I'm really sad that Amazon blocked Netflix service for Mexico via this device. It was a waste of money, and I don't recommend to purchase it for using in other countries.", "verified": true, "helpfulness": "3/4", "author": "alefitus"}, {"rating": 4.0, "review": "The biggest issue I had was not being able to select Prime Music from the stick. I had to add things to my albums on another device before I could play them on the stick connected device.", "verified": true, "helpfulness": "0/0", "author": "Howard M. Brown"}, {"rating": 1.0, "review": "I'm a prime member and still had to pay to watch shows. Not happy about this purchase. Already returned", "verified": true, "helpfulness": "1/2", "author": "Jessica Hall"}, {"rating": 5.0, "review": "phenomenal product", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "Easy To Use.  Very Happy!", "verified": true, "helpfulness": "0/0", "author": "PoodleMom"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is Chromecast 2.0. It has been the easiest streaming device that I've used to date - and I've tried them all. Never had any issues with it and I've had it since Xmas 2014. interface is slick. Streams netflix all day with no problems. The games that are available on it run buttery smooth with the included wireless remote.HIGHLY recommend to anyone that wants netflix/amazon content/music/some android games on any TV.", "verified": true, "helpfulness": "0/0", "author": "Evan Stueve"}, {"rating": 5.0, "review": "Easy to use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Laura freer"}, {"rating": 5.0, "review": "So far so good.  My 10 year old plugged it in set it up on her sisters TV and as far as I know it is working as expected.  No complaints.", "verified": true, "helpfulness": "0/0", "author": "SL - Avon Lake"}, {"rating": 2.0, "review": "I feel like the commercial makes this thing look easy to use. It's not...", "verified": true, "helpfulness": "1/1", "author": "ACE"}, {"rating": 5.0, "review": "Wonderful unit - I love it !!!!!!", "verified": true, "helpfulness": "1/1", "author": "Sau Le"}]