[{"rating": 5.0, "review": "Easy to use, hooked up in 2 minutes ! Great shows available ! I love it", "verified": true, "helpfulness": "0/0", "author": "Aimee R. Sloat \"AimeeKeyWest\""}, {"rating": 1.0, "review": "I am very disappointed in this product. I cannot watch a single thing on the netflix app without it having to buffer at least 5 times throughout an episode or movie. When i check my internet connection it says very strong yet randomly it will say no internet connection. Right now my Fire Stick isnt even working because it says it cannot find the device meanwhile i havent touched any wires for it to have all of a sudden changed. I made sure everything was connected correctly but it still will not work. I say spend the money for the Apple TV. All of my roomates have it and they have not had any problems.", "verified": true, "helpfulness": "0/0", "author": "cpj9191"}, {"rating": 5.0, "review": "Don't know why I wasted so much money on a smart tv. This thing does everything my 1200 dollar smart tv does and is much more reliable with wifi signal. Also once it is up and running you can use your tv remote to control it.", "verified": true, "helpfulness": "1/1", "author": "Robbiez"}, {"rating": 5.0, "review": "The easiest plug and play ever. Less than 5 minutes nd most of that was the long password of my system.", "verified": true, "helpfulness": "1/1", "author": "Joel Meszaros"}, {"rating": 5.0, "review": "Better than I expected.", "verified": true, "helpfulness": "1/1", "author": "Joe Kroetsch"}, {"rating": 5.0, "review": "I absolutely love the fire stick it is lightweight and durable", "verified": true, "helpfulness": "1/1", "author": "Hank Loeb"}, {"rating": 5.0, "review": "Great product. Easy to install and use.", "verified": true, "helpfulness": "1/1", "author": "Brett Goins"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Heather P"}, {"rating": 5.0, "review": "Little jumpy at first but overall work flawlessly. Shows are crystal clear, even play board games with the family on it very fun.", "verified": true, "helpfulness": "1/1", "author": "josh"}, {"rating": 5.0, "review": "We are enjoying our fire sticks very much", "verified": true, "helpfulness": "1/1", "author": "angela"}]