[{"rating": 1.0, "review": "I am signed up for Amazon prime and my account works on my wii, but not on my amazon fire stick. It's awful", "verified": true, "helpfulness": "0/0", "author": "ashleigh"}, {"rating": 3.0, "review": "Don't get HULU PLUS with it. Thought it was included.", "verified": true, "helpfulness": "0/0", "author": "Claire P White"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "john greaves"}, {"rating": 5.0, "review": "Absolutely love it.  Chromecast is good but Firestick improves upon an already good product and makes it great.  Love streaming my Amazon Prime and Netflix, the little remote makes it even easier to browse and play.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "jd smth"}, {"rating": 5.0, "review": "Bought one for our main room and loved it so much that I bought another for our bedroom so I can watch what I want to.  Only issue I found was that I had an HDMI splitter that allowed me to connect headphones and while I can hear the clicking as the Fire Stick moves through the menu, as soon as I try to play something there is no audio.  Does anybody have an HDMI audio splitter that works with the Fire Stick?", "verified": false, "helpfulness": "0/0", "author": "Dweebler"}, {"rating": 5.0, "review": "It's great. I received it as a gift to replace my Apple TV. I love it. It is fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Vampire Girl \"Vampire Girl\""}, {"rating": 5.0, "review": "The fire stick made my hd tv a very smart tv, the remote made it easy  to Install the software , Amazon preprogrammed  the item  being an customer is wonderful the product's are outstanding  thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "ayala, maria"}, {"rating": 5.0, "review": "very easy install and set up.", "verified": true, "helpfulness": "0/0", "author": "Martin Wood"}, {"rating": 5.0, "review": "The Fire Stick gives me everything I could ask for.", "verified": true, "helpfulness": "0/0", "author": "Geraldine"}]