[{"rating": 3.0, "review": "The stick works well streaming content clearly and quickly.  I like that it provides convenient access to Amazon prime video.  However, the stick seems to interfere with over the air tv signals.  I noticed after installing the fire tv stick that the OTA signal became garbled, and cleared up when unplugged.  It seems like it's not properly shielded.", "verified": true, "helpfulness": "0/0", "author": "G8rmike"}, {"rating": 5.0, "review": "Got this on sale! Pretty intersting and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Timbo"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Disappointed"}, {"rating": 5.0, "review": "I love my fire stick.  Just like everyone says a must for prime members.", "verified": true, "helpfulness": "0/0", "author": "Chrysacola"}, {"rating": 5.0, "review": "Easy to use and allows you to have full access to your amazon video accounts. Not only can you get to the Amazon items but it also allows you to use an app for Netflix and other sites.  The only thing that I wish that it had is way to mirror your computer screen, but that is a minor minor issue", "verified": true, "helpfulness": "0/0", "author": "JDGlendo \"Comic Connoisseur\""}, {"rating": 1.0, "review": "unit continuously reboots, cannot display in 1080p because it will flicker green, i have to run it in 720p just to use it, if i'm in netflix when it reboots (which is frequent) it will magically erase my login info and i have to put it in all over again. This is a seriously rough unit and should not have been released yet.", "verified": true, "helpfulness": "0/0", "author": "Colin Edward Polly"}, {"rating": 1.0, "review": "it is alright but I expected more from it... Movies that are offered free can be seen on Netflix and movies that I would like to see you have to buy... The tv shows are the same way...... So all I can say is it does not live up to the hype... If you don't mind having to pay for shows this is for you but had I known before hand how much of it was not free I would not have ordered 3 of them like I did for my family....Save you money.....", "verified": true, "helpfulness": "0/0", "author": "l caruthers"}, {"rating": 5.0, "review": "It's the best money I have spent in a long time.Now we can watch movies and listen to music and not have to pay high cable bills.You can pick and choose the movies you want to watch.It's great.You should try it.", "verified": true, "helpfulness": "0/0", "author": "TM Guy"}, {"rating": 5.0, "review": "I loved how easy it was to set up. It already had my prime account login details saved when I plugged it in. Works smoothly. Great UX. I just wish it had full HBO Go access.", "verified": true, "helpfulness": "0/0", "author": "Bensonhurst Jazz"}, {"rating": 5.0, "review": "The Fire Stick is a very good device considering it's size. The dual core chip does the job with Streaming and picture quality is excellent with HD resolution. I have both the Fire TV Box and Stick......The only drawback to the the Stick vs Fire TV is the lack of USB input for a keyboard to navigate.I would recommend it over the Chromecast in head to head usage because it comes with it's own remote and built in Apps. Chromecast depends on another device (Applle/Android/PC) to control it.Good luck", "verified": true, "helpfulness": "0/0", "author": "Theater Guy"}]