[{"rating": 4.0, "review": "Very cool if you're looking to access Media in the bedroom cause you don't have a Smart TV or a computer to hook up.  The remote is easy to use but you will need the TV/Cable remote to adjust volume etc....They recommend using the included power adapter but the USB to Micro USB cable that is supplied my be too short for some applications such a mine. TV is 55 inches from floor for comfortable bed viewing and would need about another foot of cord to plug into power strip on ground.  Luckily I have a powered USB on the side of the TV that seems to be doing the job just fine.  Haven't noticed any ill effects despite a notification that it is under-powered.", "verified": true, "helpfulness": "0/0", "author": "Chad E."}, {"rating": 4.0, "review": "main issue is that i have to unplug and reboot so often. seems to lose track of my wifi network and tell me my network is down when none of the other devices operating on my wifi are having problems. recently downloaded the remote app and am much happier with that technology. i think its a great device for the price, but the wifi connection is definitely not consistent. my only previous experience with this type of technology is apple TV and i never had any issues when using that device. obviously the price on this is much better. wouldn't expect it to function as well, but there are definitely a few kinks to work out.", "verified": true, "helpfulness": "0/0", "author": "Amber D. Arbo"}, {"rating": 5.0, "review": "absolutely everything it said it would be", "verified": true, "helpfulness": "0/0", "author": "E. Frazier"}, {"rating": 5.0, "review": "So easy to use and great choices!!!", "verified": true, "helpfulness": "0/0", "author": "Bonnie Rendl"}, {"rating": 5.0, "review": "a good deal for anyone who owns a Kindle Fire", "verified": true, "helpfulness": "0/0", "author": "kevin k crawford"}, {"rating": 5.0, "review": "Got the for our family room tv that had an HD CD player that doesn't have wi fi. The stick makes it possible and it is so easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Cynthia OConnell"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "KW"}, {"rating": 5.0, "review": "Got this and cut off the cable!! Has so many great features from games, movies, and apps. And thats just the start!", "verified": true, "helpfulness": "0/0", "author": "Brandi Taylor"}, {"rating": 1.0, "review": "Terrible. Horrible. Doesn't work worth a crap. Wish I could give it negative 3 stars. Wouldn't connect to WiFi. Wouldn't let me log in to register. Won't download Netflix. Won't open apps screen. \"Loading...\" forever. Won't play shows I have purchased through Amazon. This device does not do a single thing it is supposed to do. Amazon's technical support is nothing but a guy saying \"reboot and try again\". I felt more knowledgeable just by Googling stuff. This was a complete waste of money and time. I thought about having another sent to me, in case it just my item, but I am not even going to bother. Going to get a Chromecast.", "verified": true, "helpfulness": "1/1", "author": "J. Gray"}, {"rating": 5.0, "review": "Very user friendly and just what we needed instead of cable tv or u-verse.  We have u-verse internet but didn't want the added cost and lack of choices that cable programming gives you.", "verified": true, "helpfulness": "0/0", "author": "glen a. carroll"}]