[{"rating": 5.0, "review": "Love this product very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Brenda Greene"}, {"rating": 5.0, "review": "Great product! Allows you to connect your TV to Amazon's extensive movie and TV show library. Buy or rent videos and connect to your existing account for access to apps and music libraries. I'm leaving out many additional features. You download the Fire TV app and your able to do voice searches. Very cool!", "verified": true, "helpfulness": "0/0", "author": "avi from bklyn"}, {"rating": 5.0, "review": "Love this item!  Works with PRIME so well!", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "Love it, Love it, Love it. My dad is visiting from India and my local cable company does not provide the Asian Package. I would have to get a Dish installed. With the amazon fire stick. My old \"non-smart\" TV can now get, netflix, amazon prime, sling tv, willow cricket etc. My son loves the games. Win Win all around. Took five minutes to connect and set up.", "verified": true, "helpfulness": "0/0", "author": "VK"}, {"rating": 4.0, "review": "so far it's doing great...thanks", "verified": true, "helpfulness": "0/0", "author": "Judy Venters"}, {"rating": 2.0, "review": "it just moves to slow always logging.", "verified": true, "helpfulness": "0/0", "author": "LESROY"}, {"rating": 5.0, "review": "Love this product !", "verified": true, "helpfulness": "0/0", "author": "siAN"}, {"rating": 5.0, "review": "Love it !!!", "verified": true, "helpfulness": "0/0", "author": "Ms.Lopez"}, {"rating": 1.0, "review": "Huge disappointment!  I purchased it when it first came out.  I even got the warranty.  About 4 months after receiving it, it started to freeze the picture when we watched anything other than Amazon Prime.  I have called twice and have been given the runaround.  Their customer service is horrible and their agents are rude and inept.  Get some other brand, Amazon wont stand behinf the Fire Stick.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Tawny\""}, {"rating": 5.0, "review": "They're Great Thanks", "verified": true, "helpfulness": "0/0", "author": "Kevin K"}]