[{"rating": 5.0, "review": "Had to ask my 15 year old son to help me hook it up, but it is AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Hilbert"}, {"rating": 4.0, "review": "Quick and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Mercy E."}, {"rating": 5.0, "review": "Made my \"smart\" TV smarter.  The only thing it needs is browsing capability.", "verified": true, "helpfulness": "0/0", "author": "JGLaws \"JGLaws\""}, {"rating": 3.0, "review": "Very easy to set up.  I love the size.  Would be better if I could hook up a USB storage device so I could play files and photos through it.", "verified": true, "helpfulness": "0/0", "author": "Byron \"Byron\""}, {"rating": 3.0, "review": "The only reason I got this was because Sling was not supported on my PS4 and this came for free when you signed up for Sling.With that said, it's good for what it is. I use it for Netflix and Amazon prime and it works just fine.  The only reason I give it 3 stars is because there's not to many apps you can download for it.  The main one I wanted was the Comcast app so I could watch the walking dead. I tried getting around this by mirroring my IPad(which has the Comcast app) to the Firestick (You need to buy an app on the Firestick for $6.99, which I did) and it won't let me, I get some copyright BS when I try to do it. Amazon was nice enough to refund me for the now worthless app.Overall if you are interested in Sling (where you get to watch about 10-15 TV channels for $20 a month) and they still have the offer where you get this device for free, it's worth it.If you are just buying this as a standalone device inorder to upgrade your TV to a smart TV, I would go with the google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Devon"}, {"rating": 1.0, "review": "Bosch series was excellent, but recent movies cost money to view...not good.", "verified": true, "helpfulness": "0/0", "author": "Bill Burton"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Ruth Ventrello \"tech nut\""}, {"rating": 1.0, "review": "Does not work with my Sharp HD TV", "verified": true, "helpfulness": "0/0", "author": "HARRY A. GIBBS"}, {"rating": 5.0, "review": "Packaging is very classy.  Very easy to install.  User friendly to operate. Best of all it works seamlessly with WiFi - no stuttering or buffering.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Teich"}, {"rating": 5.0, "review": "Very happy with it.  The remote is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Corby \"Firefighter\""}]