[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Lori A. Quin"}, {"rating": 5.0, "review": "Absolutely love my firestick!!!  No need to pay a cable bill anymore... just get Netflix!", "verified": true, "helpfulness": "0/0", "author": "Patricia Sharp"}, {"rating": 5.0, "review": "Great, easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Patricia Colavito"}, {"rating": 1.0, "review": "Will not work if your TV is hooked up to a reciever", "verified": true, "helpfulness": "0/0", "author": "D Grant Hewitt"}, {"rating": 5.0, "review": "I was blown away when I connected my Firestick and realized my full potential as an Amazon Prime Member. I don't need Netflix or Hulu with my Prime membership. Through the Firestick my entertainment media is fully content. I was so over whelmed that I bought another one and plan to order more to give as Christmas gifts. I can go from room to room, on trips and everything. It's an awesome product.", "verified": true, "helpfulness": "0/0", "author": "Butch Mose"}, {"rating": 1.0, "review": "Ordered the Fire Stick because it sounded great. I have already been using google chrome for awhile now and thought this would be similar with greater access to show's movies etc.What I found was a horrible interface with little to no organization. The only way to navigate through the screens is with this tiny flimsy remote. And even one there you must scroll to the organization you want (genre, new movies, prime, etc). Then once there, there' no organization to how the movies are set up, you can only scroll through all 150 plus titles one at a time.After using Google Chrome I don't see how anyone could enjoy using amazon firestick. It's cumbersome, requires a direct power outlet, and has mediocre offerings. Frankly I'd rather be able to switch applications at the touch of a finger and scroll freely without having to click 149 times to get to the right film.It now lives in my drawer, and I expect it will stay there for the foreseeable future.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Works great! We though about getting the full Fire TV, but if you aren't a gamer, it really isn't needed! Great solution by Amazon for a more affordable option. The platform is very user friendly! We love it!", "verified": true, "helpfulness": "0/0", "author": "AQK1913"}, {"rating": 5.0, "review": "Got to watch the Wire in HD, no buffering or choppy streaming. Way better than chrome cast.", "verified": true, "helpfulness": "0/0", "author": "tyler lahey"}, {"rating": 4.0, "review": "Overall I love the device but I hate how I always need to make sure I am not actually buying a video.  So to avoid that I have the parental control on.  Would be much better of the free stuff and paid stuff were not all in the same area. Other than that I am happy.", "verified": true, "helpfulness": "0/0", "author": "Anthony M Christopher"}, {"rating": 1.0, "review": "I got this on \"Amazon Prime Day\"...  like the \"sales\" on this day, this product is a flop!  Thing would not stay connected to my network more than 20 seconds at a time and the router is 10 feet away!  Tried trouble shooting with the Amazon team and they couldn't figure it out either.  Returned it for a refund!", "verified": true, "helpfulness": "0/0", "author": "Barry H."}]