[{"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Pablo J. Mendia"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "sharon a. luiz"}, {"rating": 5.0, "review": "Well made device. It's also fun to use but make sure you have Amazon Prime membership. If you do not have it your options will be limited.I have seen the similar apple device and this one is much better.The only thing I'm not a fan of is the background is rather boring and there are no skins to upgrade it and make the display look better.", "verified": true, "helpfulness": "0/0", "author": "ExcessReviews \"On It\""}, {"rating": 1.0, "review": "Always buffering as compared to the Roku which never needs to buffer.", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 3.0, "review": "If you have a Samsung Smart TV, which I have, this product may not work for you. I wish I would have come across reviews forewarning about this issue before purchasing but oh well. Fortunately I have two TVs and it worked perfectly on TV #2. I like the product but not happy fire stick is not compatible w my main TV but I'll be switching TVs soon.", "verified": true, "helpfulness": "0/1", "author": "Robert Diaz"}, {"rating": 4.0, "review": "Great product and very affordable", "verified": true, "helpfulness": "0/0", "author": "mark357"}, {"rating": 4.0, "review": "I love my Fire TV Stick! It's super easy to set up and you can use the remote app to navigate & type. Would have given is 5 stars but ABC GO is not yet available which sucks as I will need to keep my Apple TV a little longer :/", "verified": true, "helpfulness": "0/0", "author": "Corren"}, {"rating": 1.0, "review": "Should have read the feature description better.  This does NOT have a Vudu app.  I have my movies on a Synology 5-bay server with extra memory, and currently use Plex to watch movies from that.  I was not able to find a way for this stick to allow me to browse through my movies.  It could find them if I did a title search, but that was it.  For me this was a waste of money.  I originally bought this for someone else, but after it arrived I found out they did not need it. I was curious how well it worked.  The third problem was that I  could not watch my bluray movies in 1080p at anything faster than half speed.  I connected to my AC router on the 5 ghz band and it could not play in normal speed due to not being able to handle the volume of data being pushed through for the movie.  My movies are usually around 12 to 16 GB per bluray.  I could go lower than 1080p and have it play, but that was it.  A Roku stick that I used to have was able to play them using wifi.", "verified": true, "helpfulness": "0/0", "author": "Craig N. Raper \"fafow\""}, {"rating": 5.0, "review": "I like that it is easier to use than another type of streaming product that uses a phone app to change the movies around. With this one you use the remote or you can use an app AND it has more than just Netflix. There are Prime movies, games, and music. I love it so much more than the other type I had!", "verified": true, "helpfulness": "0/0", "author": "CJ_in_Cali"}, {"rating": 5.0, "review": "Yes it did meet my expectations.  It was easy to set up and worked well.", "verified": true, "helpfulness": "0/0", "author": "Rachel Miller"}]