[{"rating": 5.0, "review": "Once I determined that I need a splitter to use the Fire Stick with my TV I now can easily switch between cable, blu-ray, and Fire Stick. It's a lot easier to access all the streaming options so I'll take more advantage of them. It was easy to set up and it was operating in a few minutes. I am very happy with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Laura L. Cleveland"}, {"rating": 4.0, "review": "I am really enjoying my Amazon Fire TV Stick!  The only problem I am seeming to have is that I can't do other things, all I want to do is watch all the movies and television shows!  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Alex52"}, {"rating": 5.0, "review": "Works good and just what I expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It's a good product but it restarts often when I am using it. But other it works good.", "verified": true, "helpfulness": "0/0", "author": "Dexter R."}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "mandy"}, {"rating": 5.0, "review": "Works great!  I would recommend highly!", "verified": true, "helpfulness": "0/0", "author": "Joseph H Watson Sr"}, {"rating": 5.0, "review": "Love it best streaming media device for the price.  Luv it.", "verified": true, "helpfulness": "0/0", "author": "Frederic Delos"}, {"rating": 4.0, "review": "It's awesome I only gave four stars because sometimes a glitches", "verified": true, "helpfulness": "0/0", "author": "Jessica Bradley"}, {"rating": 5.0, "review": "Love it!!! Already found some new shows to become obsessed with!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 2.0, "review": "Lot of problems with apps. HBO app voice out of sync thru receiver and nothing showing any sort of fix. Accessing Prime membership sporadic. Wouldn't show any pictures would dump you back to home screen.", "verified": true, "helpfulness": "0/0", "author": "Steven"}]