[{"rating": 5.0, "review": "I've owned the Fire TV Stick since release now and I have to say it has been one of the most pleasurable experiences ever. Being able to stream Netflix and Amazon Prime along with the WWE Network I rarely have any reason to turn on my PS3 and PS4 anymore (no great exclusive games for them in a long time). You can also sideload your own android .APKs if you so choose which really makes this one of the best bang for your buck Android compatible sticks ever.I did have some WiFi issues with it where it kept dropping signal a few months back but a firmware update solved that issue but I still see some other users reporting similar issues despite having the most recent firmware.Pros:-Versatile, with many video services included such as HBO Go, Netflix, Prime Video, WWE Network, Hulu, etc.-Works very well with Plex-Can load many apps from the Amazon store-Sideload APKs-Best bang for your buck for a smart TV stickCons:-Remote doesn't have voice control unlike the Fire TV remote-Not as fast as the Fire TV (but so much cheaper), can feel sluggish sometimes when opening too many apps. A quick restart solves this (do so by holding the middle select button and the play/pause button simultaneously at the home menu until the device reboots)-Some users are still reporting WiFi issues (mine were solved with a firmware update months ago)", "verified": true, "helpfulness": "0/0", "author": "Yorker118"}, {"rating": 5.0, "review": "thank you for keeping my girlfriend occupied...always something to watch!", "verified": true, "helpfulness": "0/1", "author": "Travis"}, {"rating": 2.0, "review": "This device is slow. I find that it sometimes takes 2 or 3 minutes for it to close an app or for me to put it in sleep mode. Theres really only one app I use and i cant see a find a good way to find any other apps that are good. I tried searching for a particular app that a friend of mine has but perhaps im searching wrong. Ill probably use this until the next black friday when I can purchase a roku.", "verified": true, "helpfulness": "0/0", "author": "Manuel Casas Jr"}, {"rating": 4.0, "review": "Bought this to use in our trailer. We use Roku in almost all the rooms in our house so we were a bit skeptical about trying a new device but we were pleasantly surprised. It did not work on one of our smaller tvs even though it had an HDMI port so we switched to another small tv and it worked perfectly after that. Connects easily to the internet even at campgrounds where WIFI is a hard thing to come by. Also connects easily to hot spots. Definitely recommend", "verified": true, "helpfulness": "1/2", "author": "Cynthia G."}, {"rating": 5.0, "review": "Love this!!!!!! We might cancel cable we love it so much.  And the fact its portable is awesome", "verified": true, "helpfulness": "0/0", "author": "Teresa S. \"Reese\""}, {"rating": 2.0, "review": "has serious buffering problems, cannot maintain a connection with the wifi source when all other wi fi  connections are solid.picture has a tendency to be garbled. unless you are directly next to a wi fi source, you are SOL", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Love this fire stick! Just wish you could get the cbs app on it. Other than that it's great. Oh and the remote is so tiny. I lose it all the time.", "verified": true, "helpfulness": "0/0", "author": "Chelle"}, {"rating": 1.0, "review": "Doesn't really work that well. Specially if you stream a lot", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Font"}, {"rating": 5.0, "review": "None", "verified": true, "helpfulness": "0/2", "author": "tracy hart"}, {"rating": 5.0, "review": "I was very skeptical when purchasing this. I read reviews for days, researched the product and compared it to Roku before finally ordered it. As a prime member there is so much available that I haven't bought any subscriptions to any of the apps yet. New stuff is added all the time and my family loves it. I did buy an Ethernet cord and USB attachment to plug it into my TV. Now the internet keeps up. It's rarely spent time having to buffer like a lot of review said...people are so negative in reviews sometimes. Overall I recommend this to all. It saves a ton of $ and offers a lot to watch. Now I just need to figure out which apps to get to enjoy my local network shows and super bowl, then I can finally be done w/contracts for TV. YAY!", "verified": true, "helpfulness": "1/1", "author": "Loretta childers"}]