[{"rating": 5.0, "review": "I bought two. I knew I would love this device.", "verified": true, "helpfulness": "0/0", "author": "Matthew Presley"}, {"rating": 5.0, "review": "Simple to use and fast loading times. I really like it. If you have any questions just post them and I will respond to them. Please note there is very limited free contet. Crackle is free, but unless you have subscriptions for streaming services such as, hulu, netflix, sling, amazon prime, or etc. this might not meet your expectations", "verified": true, "helpfulness": "0/0", "author": "eric inocencio"}, {"rating": 2.0, "review": "When it works and doesn't reset it is a good device, however just like amazon kindle fire, it didn't have all the apps I want.  I really want vudu app, and the dma app or Google play movies", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "A few issues.  Firstly, this item is not wireless as I originally believed.  I made the incorrect assumption that the USB cord was for charging only, when it in fact must always be plugged in.  The interface itself is fine and is does all the things a normal smart TV does but in a delayed manner.  When scrolling through titles it often freezes for a moment and then scrolls feverishly though titles and a blinding speed  This becomes tiresome.  Lastly and in conclusion, I just don't think its worth the money (even at this reduced price compared to the set-top amazon fire box).", "verified": true, "helpfulness": "0/0", "author": "shaun sandera"}, {"rating": 3.0, "review": "With the Fire Stick plugged in my DirecTV will not run. It shuts off. don't know whose fault it is but I have to unplug Firestick to watch DirecTV.", "verified": true, "helpfulness": "0/0", "author": "Dennis Hobb"}, {"rating": 5.0, "review": "amazon fire tv is awesome. It's an amazing little stick, and I would recommend for any prime member!", "verified": true, "helpfulness": "0/0", "author": "Brian Kovaleski"}, {"rating": 5.0, "review": "Works as expected and would buy again.", "verified": true, "helpfulness": "0/0", "author": "CAM"}, {"rating": 5.0, "review": "Super easy to use!", "verified": true, "helpfulness": "0/0", "author": "Geneva Gard"}, {"rating": 5.0, "review": "I like the fact that it is so small, doesn't take up space!", "verified": true, "helpfulness": "0/0", "author": "miss acton"}, {"rating": 3.0, "review": "We have a 2001 TV with no hdmi inlet, will the Fire Stick work if plugged into our Directv box? Sorry had to rate to post question.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]