[{"rating": 5.0, "review": "We have 3 fire sticks in our house and we love them. We now stream more than anything and the fire stick is perfect. We can watch even more than is available through cable. Just make sure that you have a good router so that you won't have buffering issues.", "verified": true, "helpfulness": "0/0", "author": "LDavis1026"}, {"rating": 2.0, "review": "Was a gift... Set up worked fine but second time I tried to use it, nothing happened. My Fire-stick-savvy tech friend couldn't get it to work so he sent it back.", "verified": true, "helpfulness": "0/0", "author": "L. F. Anderton"}, {"rating": 3.0, "review": "Buffers a lot compared to the Ruko 3. However, for the $25 we paid for it it's fine. Great for traveling.", "verified": true, "helpfulness": "0/0", "author": "E. Shinafelt \"2BSpokas\""}, {"rating": 4.0, "review": "Needs a usb port then I would be a great buy.", "verified": true, "helpfulness": "0/0", "author": "Jason W."}, {"rating": 5.0, "review": "Great product!!! Use on any TV and take it with you on trips.", "verified": true, "helpfulness": "0/0", "author": "Septy"}, {"rating": 5.0, "review": "I really like this thing. I also have the Google one, a ROKU and AppleTV. Personally I found the the Fire TV Stick the easiest to set up, and the interface is nice. I particularly like watching YouTube videos with it. Of course, it's also good with Amazon Prime -- no surprise there. Though I'm not a big game player, I messed around with one of the Slot Machine apps and it was pretty fun. It's got a lot of entertainment packed into a tiny device.", "verified": true, "helpfulness": "0/0", "author": "Tony Caravan"}, {"rating": 5.0, "review": "Better than Chromecast!  Im buying another stick to replace my chromecast that only sometimes works", "verified": true, "helpfulness": "0/0", "author": "Cel Lud"}, {"rating": 5.0, "review": "Chrome Cast has one trick, broadcast on you TV what you have on your phone or tablet.  The Fire Stick has tons of features, no phone or tablet required AND for about the same price!", "verified": true, "helpfulness": "0/0", "author": "CraigBag"}, {"rating": 4.0, "review": "It works great. If only the direct streaming from Apple and android products would be easier!", "verified": true, "helpfulness": "0/0", "author": "BELEN H."}, {"rating": 5.0, "review": "Very nice device that enables you to become independent of cable companies at a very reasonable price. It has all the power you'll need.", "verified": true, "helpfulness": "0/0", "author": "Meskerem Gebretsadik"}]