[{"rating": 1.0, "review": "I really want to like this product but I cannot.  I have been a prime member for years and frequent Amazon shopper.  However, this product is frustrating for a few reasons:- No real instructions.  While that may appear silly to some people because its so easy to use, its not so silly when it does not work and the only information the screen tells me is to power down or try later.-I installed the stick and it seemed to find my wifi connection.  Then it needed an update.  Ok, why not.  Cannot update and stops.  Asks me to unplug or try later. Seems simple.-I unplug and try this at least 8 more times.  Still nothing.  Gets caught up on the download of the update.-ok, I start looking for directions or help.  Nothing available.So it can find my wifi but cannot download an update.  All this in the first 30 minutes I owned it.  Really glad its so simple it does not need instructions.  I waited several works for this nonsense and got nothing for it.  I may own a smart TV but I am feeling pretty stupid right now for being taken for $19 and all I really got out of it (that was useable) was a micro charger and 2 batteries.", "verified": true, "helpfulness": "2/3", "author": "S. F. SALAMONE"}, {"rating": 5.0, "review": "Very pleased. Makes the video and audio benefits of Prime membership easily accessible on your HD TV at a great price point.Looking forward to the UHD/4K version.", "verified": true, "helpfulness": "0/0", "author": "Publice Sine Nomine"}, {"rating": 4.0, "review": "I looked forward to trying out the Fire TV Stick as soon as it was announced. Installation was easy - stick it in the HDMI port, plug in the USB power adapter and you're done. Yes, it downloaded an update as soon as it was plugged in, but I was aware of that. I have fast high speed internet, so it wasn't too long before it rebooted and was ready to run.I own an Apple TV (gen 2), PS3, and a KDLinks HD720 for media playing, so those are my comparison devices.The menus operate quickly and it was easy to move around in those menus. I wish that it when you selected a App like Netflix or Youtube that you went directly into the App. Right now, when you select Netflix, it then loads another screen where you have to select to Open the Netflix app before you get into the Netflix menus. Seems like an unnecessary steps. Same thing with Plex, but not with the YouTube App.Performance with this Stick is good, just a step or two slower than an Apple TV or PS3, but those are devices that are many times as expensive. It's not an easy comparison especially since I got the Fire TV Stick for such a good price (early purchaser).Will I use this as my main media device? - Yes, on the less-used TV that I have it on. It does the Amazon eco-system well, if you're a Prime member or have Netflix. Plex ($1.99 add'l) works well if you want to serve media from another computer or NAS, even over wireless.At the regular price of $39, it's a decent deal. Certainly a better deal than the FireTV - that costs more than twice as much - and this does almost the same things.", "verified": true, "helpfulness": "2/2", "author": "Alexander Wall"}, {"rating": 5.0, "review": "This item surprised me quite a bit. It does more than what I expected. The beauty is that it can connect to 5GHz wifi band, which is awesome. I purchased three more to give to family members. Only drawback is that sideloaded apps doesn't show up in the home screen. Otherwise, it's a great product. It is better than the Chromecast (I own two of those units as well).", "verified": true, "helpfulness": "0/0", "author": "Sabbir Shajib"}, {"rating": 4.0, "review": "Great gift for teens at christmas", "verified": true, "helpfulness": "0/0", "author": "suzanne nsoto"}, {"rating": 4.0, "review": "For the intro price of $20-ish for Prime members, you can't beat it with a stick. I also have a Chromecast and I like this gizmo equally well. Unlike the Chromecast, the FS also tunes in Amazon videos, so that's a plus. It also comes with a remote--another plus. I also like not having to use my iPad/iPhone like I do with the Chromecast. The interface is a bit clunky but I can live with it.", "verified": true, "helpfulness": "0/0", "author": "M. Alexander"}, {"rating": 4.0, "review": "Got it with the Prime pre order deal for $20.  I already have a couple ChomeCast devices, so this is a little different.  Got primarily so I could get the Amazon Prime movies which seems somewhat redundant if you have Netflix as most of the movies available are the same.The remote and menu selection make it stand out from Chrome Cast though as I don't need to cast from my computer, etc..  But it does lack the ability to cast browser sessions.  Apps are somewhat limited right now also.  No HBOGO, which I use a lot.", "verified": true, "helpfulness": "0/0", "author": "D. Byrnes \"IT guy\""}, {"rating": 4.0, "review": "A little hard to set up at first but it is nice to have if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "ChrisP"}, {"rating": 4.0, "review": "Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Jose L. Galloza"}, {"rating": 5.0, "review": "Love it, works better than my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]