[{"rating": 1.0, "review": "The Fire TV Stick itself is a great product. The problem I had was with the HDMI extender that I needed to use as my tv is mounted to the my wall.  With most manufactures this would not be a problem as they would just send you that part.  Not with this manufacturer (Amazon).  The whole thing has got to go back and by the way its back ordered and won't be available for approximately two months.  I ended up buying a similar HDMI extender of Ebay for a few bucks but it sure is disappointing the original equipment does not work out of the box.", "verified": true, "helpfulness": "0/1", "author": "jvi"}, {"rating": 4.0, "review": "For the price, I like it!I have a Chromecast and I love it because I love being able to \"cast\" content to my TV from my laptop, ipod touch, phone, tablet, basically whatever I have available.  So far the Fire TV Stick is lacking that feature in the sense that I have to have my Android tablet available to do it. I hope they eventually come out with a chrome extension or windows 8 app, etc.However this does trump my PS3 when it comes to watching Amazon content and that is why I justified the purchase of this over another Chromecast to \"upgrade\" another tv with.That pre-order price was too hard to pass up.I do love the remote. Don't love the fact that the Stick complains that I plugged it directly into my TV's usb port (though confusingly, it still works fine but complains that it is not plugged in using Amazon's included plug) I assume the dual core requires a bit more power than what the TV can output so it might limit processing a bit but in a pinch I am glad it still allowed me to use it.I think this thing will improve with time so I am holding out full judgment but for now I am still a bigger fan of the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "M. P. \"UpIrons\""}, {"rating": 4.0, "review": "I bought this mainly as it had a  better hardware(& remote) as compared to Chrome Cast.I thought the user interface was very confusing & they seem to be promoting Amazon paid movies.  They made it harder to find Kindle Prime Content or Other Apps(like Youtube).I had to search for YouTube app & I then paired it with my android phone. This allowed me to search for content on youtube native app and add them to my \"TV Queue\".I did a similar exercise to pair  NetFlix from my Kindle Tablet.I had to similarly look very hard to find  \"Yupp TV\"(indian channels) app.(which did not have any pairing capabilities)I installed \"Kindle fire remote app' on my phone , but i do  not use it much,  as it was a mere copy of physical remote (I  expected \"netflix\", youtube button or some user interface on it). However the nice part was that this software remote had the ability to use a keyboard which is lot more user friendly as compared to typing netflix user/pass with the physical remote.As pointed by others HBO Go app is missing in this. I played only one car based game and I thought it was gimmicky.", "verified": true, "helpfulness": "0/0", "author": "S. Shaikh \"zahid-java\""}, {"rating": 2.0, "review": "I'm grateful I only paid $19.00-so far has many glitches stops in middle of program-returns to start menu-freezes screen all on its own. picture will stop but audio will continue on. None of these problems occur on my rokus that are connected much further from the router and in different rooms. Also took many tries to download updated software upon setup. I really hope amazon comes up with software fixes because I really was excited about this product. I own an amazon reader and 2 kindle fires and really hoped this fire stick would be up to amazon high standards, so far not the case. Will update this review if problems can be resolved.", "verified": true, "helpfulness": "5/6", "author": "mac"}, {"rating": 5.0, "review": "I was very nervous about how this was going to work after reading some of the reviews. I recieved my Fire TV stick today. OMG!!!! This thing is awesome. Some people said they had to wait for downloads and it took a couple of tries before it started to work. Well I had the complete opposite. It worked immediately. I LOVE IT!!!!! It was super easy to put together. This is my new favorite toy. I highly recommend this. Hope a lot of people got it when it was $20. If not it is still worth the $39.99", "verified": true, "helpfulness": "0/0", "author": "Walter"}, {"rating": 5.0, "review": "Be forewarned: Detailed essay below.  TLDR version at the bottom.The out-of-box-experience was not particularly special but then again, who cares about that. It was nicely packaged per usual and came with the oversized HDMI device (I say “oversized” because I have been a Google Chromecast user for the past year and was able to compare the two), corresponding charging cable and plug, HDMI extension (very short cable; I can’t foresee a use for this), remote and Amazon branded batteries. The charging cable was a sufficient length for my TV but the plug was a little difficult to maneuver because the prongs kept shutting on me. Most people’s entertainment center cabling is shoved in the back, forgotten and almost inaccessible, which was the same in my case. However, I was able to make it happen.After plugging in the stick, I placed the Amazon fuel cells in the remote which automatically turned on and connected with the fire stick. From then on it was smooth sailing. Automatic scanning for the wireless network took place and I was able to enter the WiFi password with ease thanks to the handy remote. We still use the default password which is printed on the modem so I was able to read the password just outside of the living room and easily enter the password. The remote capability is actually what attracted me to the device since previous Amazon Prime access required either navigating through my Vizio smart TV, which is not the greatest, or a gaming console. I’ve tried both the PS3 and PS4 Prime applications. PS4 navigation is the better of the two but still takes a few minutes to start up. Chromecast does not currently have an Amazon Prime app but even then a secondary device is required to use the device such as a smartphone, tablet or computer. With the fire stick, all that is required is an HDMI connection and wireless internet. Pretty convenient.A cartoon Amazon employee then walked me through Level 1 achievement tasks on the fire stick. It might’ve been helpful but the video was a little long and I get distracted easily. After the walkthrough, my fire stick was already registered to my Amazon Prime account from which I ordered the device.  Apparently, if you obtain the device from another source (i.e. not your Amazon account) then you will have to simply go into your account and register the device. At this point, it was ready for first time use. I didn’t waste any time navigating to the app section and downloading a Netflix plugin. After enter my account information, Netflix navigation was as simple and easy as the Amazon navigation. Thank you, Amazon, for not being bitter.All in all, it’s love at first sight. I believe with all the device’s capabilities, my Chromecast will soon be out of the picture permanently. I will try and update this review within a month to tell all the dirty details but overall I can say, this is a good buy.TLDR: It’s a go for now. Amazon has one-upped Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "bananahead"}, {"rating": 4.0, "review": "As a owner of multiple media player and streaming devices, I am very pleased with the performance of my Fire TV Stick. I have changed from the Roku Stick and added this to my DJ setup to stream videos during performances. The speed and versatility of being able to access the Fire TV Stick across multiple devices (Kindle Fire HDX , Samsung Galaxy tab 3, and Samsung Galaxy tab 4) makes it easy choice as the product to go to. I have had this for three weeks and it has been used every single day since then. I wanted to pick up a few more to give to friends for Christmas and both Best Buy and Staples were sold out this past weekend.  No worries I have ordered 3 more and they will be in by Christmas. Thank you Amazon...you did it again!!!", "verified": true, "helpfulness": "0/0", "author": "Brian Stokes"}, {"rating": 5.0, "review": "I gave a couple perfectly serviceable HDTVs that are only a couple years old. For the last several years, I have been using my PS3 to stream Amazon and Netflix content. About three years ago I had to send the thing in for service, apparently due to overheating. So I got this thing when it was $20 to reduce up time on the PS3. That is what I have to compare this to.The menu is easy to navigate. It is fast and responsive. Load times for apps and videos are faster all around. Netflix will start streaming really quickly with a lower quality stream, but it takes less than a minute for it to catch up and start streaming HD. It feels like I have a smart TV, and I only spent $20. The only thing I miss is control with my Logitech, but at the price that issue is no big deal.I would have kept using the PS3 if it were not for the sale price. $40 seems too much for something I truthfully already had. But at $20, jump on it and enjoy the device.", "verified": true, "helpfulness": "0/0", "author": "Christopher R"}, {"rating": 5.0, "review": "Great little device! Just received my preorder and am really impressed. I put it on my TV which is farthest from my WiFi and it is working great. I had a problem with the signal as the TV is in a cabinet but when I used the extender it picked up the WiFi right away. It plays seamlessly, no buffering, and the picture is great. I have had over 8 Rokus  and this stick is such an amazing bargain. Works just as well for a fraction of the cost. Can't wait to try it on the road in hotels. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 2.0, "review": "Lot's to be desired with regards to App. Just another way to promote Amazon products without offering anything new to it's customers.", "verified": true, "helpfulness": "0/1", "author": "Sanjeev Sharma"}]