[{"rating": 1.0, "review": "Very difficult to connect. I called customer service and after 3 people and about an hour we got it to work. I bought this because I thought it would be easy for my mom to use, but discovered it was too difficult to browse. Plus nothing was included, you have to pay for everything. I returned it the next day.", "verified": true, "helpfulness": "0/1", "author": "Linda morehart"}, {"rating": 2.0, "review": "Bought three of these.  Performance is very poor even when plugged into a wall outlet.  One of them must have gotten to hot or something because it no longer works with a remote (yes I changed the batteries and even tried the remote from the other unit).  The third one is still boxed up, I don't even know where it's at, I don't care, I'm not going to use it.Spend the extra 60 bucks for the fire tv unit (I have it), there is NO comparison.", "verified": true, "helpfulness": "0/0", "author": "Honeyman"}, {"rating": 5.0, "review": "As a 66 year old Grandma getting ready to retire, I  decided to  get rid of my very expensive cable TV  and land line phone and just stay with  WiFi  and my cell phone. So I  purchased  the Fire Stick.So far, it is working, after I  had to purchase  a \"smart\" TV. My other TV was only 3 years old, but was not WiFi  compatible. I  am still learning my way around the apps, etc.I  think I  will enjoy it, once I get use to it.", "verified": true, "helpfulness": "1/1", "author": "Alice"}, {"rating": 1.0, "review": "Sucks. Although I have excellent email... the fire stick. Keep asking to restore internet connection. Which really sucks sucks sucks!!!!!!!!! Thank you for my input------", "verified": true, "helpfulness": "0/2", "author": "Fred Castle"}, {"rating": 4.0, "review": "Works great!  Just as advertised, small and portable, great for using in different rooms, vacation etc.", "verified": true, "helpfulness": "0/0", "author": "Steve B"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Knox"}, {"rating": 4.0, "review": "Fantastic purchase.", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "so far, it's working wonderfully!  I love all the apps you are able to use through it.  It's nicer than having to use an additional HDMI cord to connect my computer to my tv to do the same stuff the Fire Stick can do!!", "verified": true, "helpfulness": "0/0", "author": "cheltseabird"}, {"rating": 5.0, "review": "Love it,thanks", "verified": true, "helpfulness": "0/0", "author": "Lawrence Hicks"}, {"rating": 5.0, "review": "This thing exceeded my expectations. I dislike that I cannot use it to watch The Game of Thrones but that is entirely a HBO issue. The stick works extremely well. It is user friendly. Thank you Amazon. Well done. I would recommend this item to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mikel Thompson"}]