[{"rating": 5.0, "review": "Works great, great price, and customizable with being able to side load unofficial apps. You cant go wrong for 40 dollars", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "It sounds like most the negative reviews are from people will little understanding of technology. I've had this since December, and it works great! If you're haveing connection issues, try changing the radio channels on your router (there may be over crowding and interference from your neighbors). The only issues I've had are that if certain apps that amazon theirselves didn't design.", "verified": true, "helpfulness": "0/0", "author": "Eric Suplee"}, {"rating": 1.0, "review": "Doesn't hold WiFi long enough to watch anything!  All my other devices work fine with my router, but this is a worthless dud!", "verified": true, "helpfulness": "6/7", "author": "LavndrAndy"}, {"rating": 5.0, "review": "this is a great product i would highly recommend putting a password for all items that cost $", "verified": true, "helpfulness": "0/0", "author": "michelle dawn marquis"}, {"rating": 5.0, "review": "With XBMC loaded, life without cable is possible.", "verified": true, "helpfulness": "0/0", "author": "Robert V. Hoffman \"Geek PA\""}, {"rating": 5.0, "review": "I think it's the best thing yet", "verified": true, "helpfulness": "0/0", "author": "Ann Jones"}, {"rating": 5.0, "review": "awesome job !", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "We had issues with this, buffering and telling us to check out connection. After talking with some other family members about the issues, we learned that the \"extension\" that comes with the stick is what we needed. The stick was completely hidden from sight behind the TV, but when we plugged the extension in the wireless connection was able to read the stick. We haven't had a problem since. We love it and have watched all kinds of movies and TV series we missed. Highly recommend this if you're tired of running out to rental places all the time.", "verified": true, "helpfulness": "0/0", "author": "Joyce B. Trammel \"Joyce B\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "CLinde"}, {"rating": 5.0, "review": "I love my Fire TV Stick and Fire TV Box.  I travel for a living and it makes it so easy to take along.  Would buy many more if/when they put it on special again.", "verified": true, "helpfulness": "0/0", "author": "Mr Fix It"}]