[{"rating": 5.0, "review": "So small & convenient but a little annoying that it has to be plugged into a power source during use. I was under the impression it was simply a stick. Maybe that was my own naivety so I'm not holding it against them. The price was unbeatable too!", "verified": true, "helpfulness": "0/0", "author": "Emily Elise"}, {"rating": 4.0, "review": "This is a really nice device with excellent performance.  The 1 thing that it is lacking however is a built in dlna / upnp client.  All of my other devices have dlna clients and I store all my home videos on my NAS.  All of my kindle fires, android phones, ipad, and smart tvs have built in support or can easily download free apps to watch these videos no problem, however this doesn't appear to be an option for the fire stick.I was able to side load a dlna client, however it was not intuitive and it took a long time to find one that actually worked properly.  I will gladly upgrade my review to 5 stars if they ever add builtin support for dlna / upnp (or provide a supported app that can be downloaded even if it's ad based).As far as netflix and amazon videos go, this thing has performed flawlessly with much better performance than any of my other smart tvs or mobile devices.", "verified": true, "helpfulness": "1/1", "author": "Order"}, {"rating": 4.0, "review": "Love the product. Have it on a family room 60 inch Visio. Only issue was that when I plugged the USB into the tv and started it up got a message on screen that not enough power coming from the USB and suggesting that I use the power plug for best performance.  Luckily I have an Instaoutlet so doing this was a snap.", "verified": true, "helpfulness": "0/0", "author": "Manufacturer"}, {"rating": 3.0, "review": "Amazon should make it more clear that most of the services are not available outside of the USA. Even the app doesn't allow you  to install on your phone if you are outside of the US. A lot of stuff have additional charges. Not really worth it for me. Other wise its a good device.Quick and responsive. Remote included was a plus as it works really well. The device has more potential if I could have used it...", "verified": true, "helpfulness": "1/2", "author": "Ricardo M."}, {"rating": 5.0, "review": "Works prefect. Put it on my older TV. Works as good as the Samsung smart hub on my new one", "verified": true, "helpfulness": "0/0", "author": "J. K. Sherman \"Kris Sherman\""}, {"rating": 5.0, "review": "I have a chromecast. I wasn't sure if I should get this item. But I decided to buy. The price is excellent. I think that the firstick is much better than the chromecast. It offers a lot of apps.", "verified": true, "helpfulness": "0/0", "author": "SyNy"}, {"rating": 5.0, "review": "Works perfectly! Glad I ordered it when it was $ 19.00. Easy setup and easy controls.", "verified": true, "helpfulness": "0/0", "author": "whitejs"}, {"rating": 4.0, "review": "Way behind compared to chromcast while straming videos from dailymmotion and many other sites, though quailty is very good.", "verified": true, "helpfulness": "0/1", "author": "Prasad kulkarni"}, {"rating": 5.0, "review": "This is a sure \"fire\" winner.  Very user/feature friendly, easy setup.  Kicks the crap out of Google Chromecast for the money- particularly if you have an Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 5.0, "review": "After 3 weeks we've only had one hang up to complain about and a cold start fixed it. Beats the HECK out of the Chromecast! I'm giving that dog away. Having much better consistency streaming from Amazon Prime over Netflix as well, but hey, you can do both on this device!", "verified": true, "helpfulness": "0/1", "author": "CyberPirate"}]