[{"rating": 5.0, "review": "love it! Easy to setup.  easy to use. Great movie, show selections", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 4.0, "review": "Awesome. There was a little issue when trying register the device but called tech support that got it registered very quickly. Great customer service. The only thing that I would say is a down fall is that it's always on. To put it to sleep or turn of the device is kind of cumbersome.", "verified": true, "helpfulness": "0/0", "author": "Bill V."}, {"rating": 5.0, "review": "Was able to make a no \"smart\" tv into a smart one and save a couple hundred bucks in the process.", "verified": true, "helpfulness": "0/0", "author": "Thomas K."}, {"rating": 5.0, "review": "works great. no problems at all getting it to work.", "verified": true, "helpfulness": "0/0", "author": "charles r smisek"}, {"rating": 5.0, "review": "I love it so much. I can't leave my couch.", "verified": true, "helpfulness": "0/0", "author": "Hannah"}, {"rating": 5.0, "review": "Love It! Way better than a set top box, but with all the capabilities.", "verified": true, "helpfulness": "0/0", "author": "DG2000"}, {"rating": 5.0, "review": "Love it! Easy to set up and install.", "verified": true, "helpfulness": "0/0", "author": "Natasha Lindsey"}, {"rating": 4.0, "review": "Using it is pretty intuitive, especially if you have even basic knowledge of media streaming.  There was a simple instruction video on set-up, but the brief, in-depth instructional videos were the most helpful.  Unfortunately, the system was not ready-to-use out of the box for me, due to the configuration of my TV/cable system.  I called Customer Service, and can't say enough about how incredibly helpful, patient, and easy-to-understand they were.", "verified": true, "helpfulness": "0/0", "author": "Caryn Adler"}, {"rating": 2.0, "review": "Did not work.  Neighbors worked on my TV / Internet.  Faulty product.  New in the ill be shipped in February.", "verified": false, "helpfulness": "0/0", "author": "Jerry Oldenkamp"}, {"rating": 5.0, "review": "Easy to use. Much faster than Roku. Nice.", "verified": true, "helpfulness": "0/0", "author": "Bruce Herbert \"Bruceh2204\""}]