[{"rating": 5.0, "review": "This Fire Stick was so easy to use. Literally just plug in to your TV and it is up and running.  We use it to watch Hulu Plus, Netflix and Amazon Prime.  It works perfectly. We love it!", "verified": true, "helpfulness": "0/0", "author": "David Albers"}, {"rating": 3.0, "review": "I was very disappointed to find that one has to already subscribe to HBO in order to get HBOGO. Also disappointed that there is no Pandora (as advertised) and that most of what is here is games. I am not a game player so am GREATLY DISAPPOINTED !!!!!!!!!!!!I am happy, however, that I can stream my Netflix to my TV.", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 5.0, "review": "So much faster than my old device. I was bummed at first since, but now that HBO Go is on it, it's perfect.", "verified": true, "helpfulness": "0/0", "author": "John Stone"}, {"rating": 2.0, "review": "Mine was defective. I returned it for a refund. I may try it again after a year or two once the quality is better. Until then I will just stick with Apple T.V.", "verified": true, "helpfulness": "0/1", "author": "Jason"}, {"rating": 5.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/1", "author": "RUSSELL ALLEN KITCHENS"}, {"rating": 5.0, "review": "Awesome selection and better than I expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love it but sometimes want connect to internet. Overall I love it.", "verified": true, "helpfulness": "0/1", "author": "tonia"}, {"rating": 5.0, "review": "awesome!!!", "verified": true, "helpfulness": "0/1", "author": "matt tapken"}, {"rating": 5.0, "review": "Great!Works to access Netflix, Amazon, and our Plex even when the Xbox is on the fritz with our wireless network. No complaints yet.", "verified": true, "helpfulness": "0/0", "author": "C. J Jeffcoat \"Colin 'C.J.' Jeffcoat IV\""}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to install.  I initially purchased it so that I could listen to music.  I like the fact that I can select music from the Amazon website and place the selected music into my playlists that I can then select from the TV.  My husband and I have been watching the Prime Videos and Prime movies also.  I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Rauch"}]