[{"rating": 5.0, "review": "Love my firestick!  User friendly.  I have recommended one to my aunt and daughter who have both purchased one and also love it.  Great product at a great price!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was the perfect option for our TV in our living room where the family watches netflix. We used to have to hook up someone's in the family's laptop to watch it, but this solved that inconvenience. Have had it for 6 months now and never had an issue. WELL worth the low price!", "verified": true, "helpfulness": "0/0", "author": "Alison Hughes"}, {"rating": 4.0, "review": "Good product. Sometimes operates a bit slow due to the wifi connection, but overall, a good product.", "verified": true, "helpfulness": "0/0", "author": "William Schry"}, {"rating": 5.0, "review": "Very easy to use and love it ..", "verified": true, "helpfulness": "0/0", "author": "collette mclain"}, {"rating": 5.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "DoesItMatter"}, {"rating": 5.0, "review": "The Amazon Fire Stick is awesome! We have an Xbox One downstairs but the kids were always wanting to watch TV as well. I can hook up the Fire Stick to my daughters TV and they can watch Netflix, Sling TV and even Amazon Prime movies and more upstairs. Please note that you can't access Sling TV on multiple devices at the same time though.Depending on how your TV is set up you may need to use a USB sort of plug to install it the more difficult way but all wiring comes with and directions are easy to understand.", "verified": true, "helpfulness": "0/0", "author": "Monika Clark"}, {"rating": 1.0, "review": "Poor connection. If you like watching a frozen screen with sound, order the Amazon fire stick!", "verified": true, "helpfulness": "3/3", "author": "sylvia mckinney craig"}, {"rating": 4.0, "review": "Still trying to work my way thru the amazon prime movies and tv shows.", "verified": true, "helpfulness": "0/1", "author": "diane fielding"}, {"rating": 5.0, "review": "LOVE IT LOVE IT LOVE IT", "verified": true, "helpfulness": "0/1", "author": "Rick McKeehan"}, {"rating": 3.0, "review": "Good but it can be perfect if Amazon can increase the APP", "verified": true, "helpfulness": "0/1", "author": "CHENG CHIH JEN"}]