[{"rating": 3.0, "review": "I pre ordered this stick when Amazon offered it for $19.99 and it arrived early December.  While overall I do like the stick, there is one reason I cannot in good faith give this a higher rating.The pros:1. It's fast!  I am comparing the Fire Stick to the Roku stick, Roku LT, and a Sony media player.  I love how quick the response is.  My main complaint about the Roku stick was the lagging.  Amazon hands down beats Roku with just how responsive the stick is.  Although I do notice a slight lag in Hulu search.  I also am getting that same lag on my other players.2.  The welcome tutorial.  Although I really don't have a need to watch the video, I still found it neat that they provided it for the non tech savvy as well as first time users.3.  Display.  The display looks great!  I think the main menu looks better on the Fire compared to the Roku.  All the colors look vibrant...much more alive.4.  Screen saver.  Granted a screen saver is not a decision maker for me.  When I saw the screen saver, I was extremely impressed.  Colors are deep and rich. The pictures look awesome.5. Netflix.  For some reason since Netflix updated their roku app, Netflix on roku has been absolutely disappointing.  It takes forever to load and the audio starts before the video.  The Fire Stick doesn't have that issue.  The load time is fast, it runs smooth, and audio is synced with the video.  The remote is more responsive on the Fire Stick than the Roku.6.  Prime.  If you are a Prime member, the Fire Stick is great!  The main menu starts with the focus being on Prime.  A big negative if you do not have, or intend on being, a Prime member.Cons.There are only 2 cons regarding the stick, but the primary con is major.1.  Wifi reliability.  Sure the Amazon Fire Stick is Mimo and is able to support 5gHz, it just plain sucks.  Having this for a little more than a month, I've had to factory reset or restart the stick on many occasions.  And it's not just at 5gHz.  It's also loses wifi at the slower 2.5gHz.  No, the problem isn't my router, it's a brand spanking new Asus AC1900.  Since the Fire Stick seems to be the only thing affected with this issue, I seriously doubt that the problem lies anywhere else.  In the past two days I had to reset it 5 times.2.  Media player apps.  This is where Roku gives the Fire Stick a big black eye.  I found it absolutely ridiculous that I had to pay for an app so I can see my NAS from the Stick.  I have 3 free media player apps for the roku.  Plex is a great example...free on Roku, something like $4 on Fire.  Nuts!  My antiquated Sony media player came preinstalled with an app.Until Amazon fixes the issue with wifi, I cannot recommend this.  It doesn't matter how fast or pretty it is, if it won't connect.  Certainly not Prime time ready.", "verified": true, "helpfulness": "1/1", "author": "Gabesdaddee \"Spikemarley\""}, {"rating": 4.0, "review": "what about HBO Go  with Fire Stick?", "verified": true, "helpfulness": "0/0", "author": "John E. Danaher"}, {"rating": 4.0, "review": "Great little tech , but I think the picture quality it streams i.e netflix is not that great but overall a great buy for the price", "verified": true, "helpfulness": "0/0", "author": "DONALD SANCHEZ"}, {"rating": 5.0, "review": "I like it.", "verified": true, "helpfulness": "1/1", "author": "Clark Jarnagin"}, {"rating": 5.0, "review": "Just got home from vacation and it was here when I got home.  Plugged it in and started enjoying Prime TV & Netflix.  I'm sure I'm going to be learning to use a lot more.  Love TRANSPARENT!!!!", "verified": true, "helpfulness": "1/1", "author": "renodean"}, {"rating": 5.0, "review": "Way better than a chrome cast!! I've told a ton of friends to purchase this item after using it", "verified": true, "helpfulness": "1/1", "author": "amanda schroeder"}, {"rating": 4.0, "review": "I would rate it 5 ☆'s but finding out that for ne to purchae Amazon Prime you are charged for it in one lump sum and not able to make monthly payments. I would really like to have Amazon Prime,  but I can't afford the one big payment all in one. I would prefer to be able to make monthly payments since that's the only way I could afford to buy it.", "verified": true, "helpfulness": "0/0", "author": "tripthe4"}, {"rating": 2.0, "review": "It is not anywhere close to being usable for video playback.  I have a prime account.  Yet it some times it plays videos and other times not.  Rebuffering, rebuffering  Amazon can I get some help.  Your web pages on the issue I am have aren't listed.  You have a phone number?Doesn't require an Android phone or chrome like another stick.Cannot recommed do to issues vs performance.  Spend the money on Roku III.", "verified": true, "helpfulness": "1/1", "author": "bobba rebop"}, {"rating": 5.0, "review": "Easy set up works great!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. I'm getting rid of cable now and save my money.", "verified": true, "helpfulness": "1/1", "author": "C. Anik \"niko\""}]