[{"rating": 5.0, "review": "So far I'm finding the Fire TV Stick much easier to use for navigation of the Prime site. It was easy to setup and its download speeds seem pretty quick using a cable modem network.The primary reason I bought it was that my Sony BluRay player made it difficult to access and search for movies and shows. Plus I bought it during the sale period, so couldn't go wrong!", "verified": true, "helpfulness": "0/0", "author": "Stephen Szymanski"}, {"rating": 4.0, "review": "Fantastic device! Excellent quality in the device itself as well as playback video and audio quality. Very customizable, and the remote is perfect. I will gladly add a fifth start when support for new apps are added (Google play movies, Netflix, Bush, Crackle, etc.). I have a chromed, too, and would like to have one device that covers my apps instead of having to switch back and forth.", "verified": true, "helpfulness": "0/0", "author": "E. Schmidt"}, {"rating": 5.0, "review": "Worked great out of the box.I had no problems installing the Fire Stick.The connection to the internet was made without a hitch.", "verified": true, "helpfulness": "0/0", "author": "James Swindell"}, {"rating": 5.0, "review": "Works as advertised and so far it is seems superior to Chromecast. Boots quickly and downloads and streams start with minimal delay. That's especially impressive considering my ISP is DSL. I prefer the Fire TV experience to that of X Box live and Apple TV. The remote is a nice bonus.", "verified": true, "helpfulness": "0/0", "author": "M. Plotz"}, {"rating": 5.0, "review": "This was a great purchase! I have been looking at various similar devises, but am so glad I went with the Fire Stick. It is very easy to use, the kids love the variety of prime tv shows available, and shows work instantly with no noticeable buffering.", "verified": true, "helpfulness": "0/0", "author": "Jacob Dunlow"}, {"rating": 3.0, "review": "The Fire TV Stick is easy to set up and use. I rented a movie from Amazon Instant video and the video quality was great (1080p 60hz) except that every few seconds it seemed to skip a few frames causing video stuttering. I don't think it was a WiFi bandwidth issue since the Fire Stick does a decent job of altering the video quality to accommodate the current internet speeds. I changed the settings to 720p and 60 hz and the stuttering went away. Hopefully this 1080p issue is resolved in a software update. It would be a 5 star review without this issue.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "It is easy to use and setup, it also has great options for watching free stuff.", "verified": true, "helpfulness": "0/0", "author": "BB"}, {"rating": 1.0, "review": "The TV Fire Stick needs the bugs worked out. It cuts in and out goes BLACK and FREEZES USE FAST FORWARD TO RESUME VIDEO. Don't try and tell me it is a router problem. Router is less than 12 feet away. My kindle connected to tv does much BETTER.THANKS JIM / W2AKV", "verified": true, "helpfulness": "1/2", "author": "james davidson"}, {"rating": 1.0, "review": "Would give it zero stars if possible. Tried it in all three HDMI ports of my Samsung TV and both ports of my Yamaha receiver. Does not work in any of them. Checked wall outlet for power and it is ok. Useless and frustrating. Back to Roku I go.", "verified": true, "helpfulness": "1/1", "author": "V. Urdi"}, {"rating": 4.0, "review": "Plug it in and follow directions on the screen, even the less tech savy can use with confidence", "verified": true, "helpfulness": "1/1", "author": "L. Porter \"ancientgatekeeper\""}]