[{"rating": 3.0, "review": "I totally love the concept, the features, the amount of raw power, storage, and the fact that it was an awesome gift. However, I must be the only person that has an issue with the Wi-Fi staying steadily connected! Furthermore seeking, finding or getting technical support is nearly impossible! So for everything that the FireTV Stick is, the fact that getting support and also the fact that it isn't very user friendly when it comes to troubleshooting the device (I consider myself relatively savvy when it comes to electronics) I have marked this down to 3 stars!Seriously though the Wi-Fi issue is got to go away.", "verified": false, "helpfulness": "0/0", "author": "LizonKindle"}, {"rating": 5.0, "review": "I absolutely love the Fire Stick. Easy to use. Got the voice control also and any movie or tv show I think of I want to see, I just say the name and it shows up. Only complaint is it is to easy to hit the buy button!", "verified": true, "helpfulness": "0/0", "author": "P. Batten"}, {"rating": 5.0, "review": "Amazing if you have a TV but don't want to have cable. We use it in our spare room for guests! Love it!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "My sister gifted me this, I am really loving it.It performs very well, syncs with all my devices on wifi nicely and quickly.There's some lag on some videos when watching through the Youtube App, but I guess that's all buffering issues.This is definitely a brand new way for entertainment and recreation. With Prime membership I can enjoy even more. I recommend all Prime members should have this Fire TV stick, worth for its price.", "verified": true, "helpfulness": "1/1", "author": "Prashant Srivastava"}, {"rating": 5.0, "review": "Cant beat this", "verified": true, "helpfulness": "0/1", "author": "Freddy"}, {"rating": 3.0, "review": "It's small and compact but must be low on memory.  Keeps stopping to re-load, very annoying.Finally just went back to my blue -ray player.", "verified": true, "helpfulness": "0/0", "author": "Paul L. Marc Aurele"}, {"rating": 5.0, "review": "This is one of the best purchases I've made in a while.I'm not one to purchase a digital content, so I've only explored the free content.If you're a amazon prime member there are a ton of free programs you can watch.  If you're not a prime member there are still a lot of free programs you watch through the following free apps:1) Pluto (has programming from vice and journeyman pictures)2) History Channel3) Lifetime4) PBS (Julia Child rebroadcasts, Ask this old house, american experience, frontline, etc)There are also many other free apps too.", "verified": true, "helpfulness": "1/1", "author": "BigKahunaBerger"}, {"rating": 5.0, "review": "Works great for streaming on my TV.  I use the electric plug extension as recommended for best reception and  have had no problems so far.", "verified": true, "helpfulness": "0/0", "author": "violet \"easily confused\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Natalie"}, {"rating": 5.0, "review": "Just got it yesterday, easiest set up ever! Just started playing with it but so far it works great.", "verified": true, "helpfulness": "0/0", "author": "Sheryn neelands"}]