[{"rating": 1.0, "review": "As Uncle Si would say, \"This is a piece of junk.\"  It takes a LONG time to go through all the steps to get to a show, and then it continually loses it's signal.  I have yet to complete a movie or TV show without it cutting out.", "verified": true, "helpfulness": "1/2", "author": "Billy W."}, {"rating": 5.0, "review": "Best thing I've done since I've had a TV !!! Cable Who ?", "verified": true, "helpfulness": "0/0", "author": "Robert Carr"}, {"rating": 4.0, "review": "As an Amazon Prime member, it's a good investment. I get to access my Amazon Instant Video library, plus it has Sling TV, which is nice. At times, the frame rate when streaming could be better, but it is a fairly new advice and I can definitely see it getting better.", "verified": true, "helpfulness": "0/0", "author": "Keanu Najera"}, {"rating": 5.0, "review": "Easy fast love playing pandora and watching movies", "verified": true, "helpfulness": "0/0", "author": "DEREK GOES"}, {"rating": 5.0, "review": "The fire stick is wonderful it works great", "verified": true, "helpfulness": "0/0", "author": "Donna McCamey"}, {"rating": 4.0, "review": "crisp clear picture", "verified": true, "helpfulness": "0/0", "author": "gman"}, {"rating": 1.0, "review": "It took 1 hour to type in my passwords. The remote sucks. After that it could not connect to my wi-fi. This was a total waste of my time trying to get this to work. Returning it immediately. there is also no telephone number for any type of customer support. Now I know why the price is so cheap. Come on Amazon, I expect more and better from you.", "verified": true, "helpfulness": "1/1", "author": "brad bailey"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Thousands have covered the techno stuff.  I just want to compliment Amazon for the utter ease with which you set this up and use it.  You hook it up and bing! this geeky little animated bloke pops up and he's actually as charming a he is supremely understandable.  Way way faster than our 2011 Roku -- as it should be.  Brilliant all round.", "verified": true, "helpfulness": "0/0", "author": "brityank"}, {"rating": 5.0, "review": "Great product !!  Love it", "verified": true, "helpfulness": "0/0", "author": "Mike H \"Mike\""}]