[{"rating": 5.0, "review": "excellent, has met my expectations. Recommended 100%", "verified": true, "helpfulness": "0/0", "author": "Eric Ramirez C"}, {"rating": 4.0, "review": "Having alot of fun with this.  Still exploring the apps and features.  I would have given five stars if not for the fact that the movies and shows appear darker than usual.  I have tried manually adjusting brightness and contrast, but that seems to take away from the quality of the picture.  Anyway, great device, especially for the price.  I definately recommend it.", "verified": true, "helpfulness": "1/1", "author": "bigman39"}, {"rating": 2.0, "review": "Not happy so far, it says Netflix is a free app but I cannot download it....and a lot of it is in a foreign language", "verified": true, "helpfulness": "0/0", "author": "Rogelio"}, {"rating": 5.0, "review": "More then I expected, wish I had purchased this long ago.", "verified": true, "helpfulness": "0/0", "author": "D.  Brennan"}, {"rating": 5.0, "review": "LOVE LOVE LOVE this Fire TV Stick, packaged perfectly as well!!!", "verified": true, "helpfulness": "0/0", "author": "Tamela Corbiere"}, {"rating": 5.0, "review": "Great stick fast shipping.  Perfect.", "verified": true, "helpfulness": "0/0", "author": "Billh"}, {"rating": 4.0, "review": "Works as advertised. Four stars as all products can be improved.", "verified": true, "helpfulness": "1/1", "author": "Alan Smith"}, {"rating": 5.0, "review": "I purchased the Fire Stick over competitors because of its improved method to connect to hotel networks.  So far, I have used multiple home networks of family members and it works great.  Very simple to connect and it retains all of my previous settings perfectly.I will update this post after I have tried in a few hotels.", "verified": true, "helpfulness": "1/1", "author": "James A. Tierney"}, {"rating": 5.0, "review": "no need for cable tv anymore", "verified": true, "helpfulness": "0/0", "author": "Eric B. Eichbauer"}, {"rating": 3.0, "review": "One of the main reasons I made this purchase was to watch live sporting events, but it does not do that.  I am very likely to cancel my prime account because of this.", "verified": true, "helpfulness": "0/0", "author": "James Reed"}]