[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Kim Melton \"Kimmie G.\""}, {"rating": 4.0, "review": "Missing NHL Gamecenter, otherwise an excellent product.", "verified": true, "helpfulness": "0/0", "author": "R. Richmond"}, {"rating": 4.0, "review": "I've only been able to play with my Fire TV Stick for maybe 6 hrs.  The only trouble I've had was getting the back off the remote to put the batteries in.  Lovin it otherwise.", "verified": true, "helpfulness": "1/1", "author": "Cindy Ward"}, {"rating": 5.0, "review": "Not only the package came in so fast, but its a great little thing to have.  Installation was a piece of cake, and now I can Netflix in any of my TV's.", "verified": true, "helpfulness": "0/0", "author": "katherine ceballos"}, {"rating": 5.0, "review": "The best way to watch movies or TV, no commercials and the choices are up to you. One of the best Christmas gifts I have ever gotten!!!", "verified": true, "helpfulness": "0/0", "author": "Kem R."}, {"rating": 5.0, "review": "Great product once Amazon tech support figured out that my wireless router was too slow.  You need at least an N speed router for this to work properly.", "verified": true, "helpfulness": "0/0", "author": "Wayne J. Hamilton"}, {"rating": 5.0, "review": "Enjoy very much except unable to access Netflix", "verified": true, "helpfulness": "0/0", "author": "Tom McWilliams"}, {"rating": 5.0, "review": "My family love the fire tv stick. Its easy to used, even my 4 year old use it.", "verified": true, "helpfulness": "0/0", "author": "Darline Gabeaud"}, {"rating": 5.0, "review": "It has been working perfectly, no problems and use it constantly. Very happy with it. Was a little skeptical with some of the mixed reviews, but had a chance to get it at the introductory price and I am so glad I did. Good job amazon. It works for me.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Great product.  Easy to use. Makes any new TV a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "vsf"}]