[{"rating": 5.0, "review": "Just received in mail.It seems to be all it claims to be", "verified": true, "helpfulness": "0/0", "author": "bill donahue"}, {"rating": 5.0, "review": "Easy to set-up.  Includes an extension cable in case the stick doesn't fit in the space required for your HDMI connection.  Easy to download apps and to log into them (e.g., Netflix).", "verified": true, "helpfulness": "0/0", "author": "JEFFREY S MCGURK"}, {"rating": 3.0, "review": "Is really nice for the most part.  Wish it had an external Wi-Fi antenna.  Drops WI-FI connection ALOT. We use it in the master Bedroom.  Have the Amazon's Fire TV in the Living room, if you have an Ethernet connection nearby I recommend going with the Fire TV instead of the TV STICK.", "verified": true, "helpfulness": "0/0", "author": "Ken davis"}, {"rating": 5.0, "review": "This thing is great! And for the women out there who are afraid to buy it because you are technology challenged, not to worry. If I can do it, anyone can do it! The directions are like buying an Apple product...simple, clear, and short. I have had a great time watching things I can't get through cable unless I want to pay more than I already do for TV. You get tons of choices, and they are adding more and more to Netflix and HBOGo, so that can only get better. This is a great product-5 stars for sure!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Better than cable by 100%", "verified": true, "helpfulness": "0/0", "author": "mario patino"}, {"rating": 5.0, "review": "Love it but don't like the free 30 free day trial. If youve had one before they automatically charge you. Anyways. I love the stick. Just didnt like $99 being taken out of my account.", "verified": true, "helpfulness": "0/0", "author": "ambersally"}, {"rating": 4.0, "review": "It freezes up sometimes but I was so pleased with it I bought one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "very cool app"}, {"rating": 2.0, "review": "Works good connected to tv but I have a reciver so I could not get sound when hooked up to my reciver I couldn't get it to work.", "verified": true, "helpfulness": "0/0", "author": "Jeff G."}, {"rating": 5.0, "review": "Very useful", "verified": true, "helpfulness": "0/0", "author": "natacha concepcion"}, {"rating": 3.0, "review": "It  works for a little while then it stops due wi fi disruption", "verified": true, "helpfulness": "0/0", "author": "Bryon Ingalls"}]