[{"rating": 2.0, "review": "was bought for the intentions of streaming twitch on my tv. i didnt know the fire app was garbage. its ridiculous how amazon bought out twitch and has such bad services for their own device. the resolution doesnt adjust to go higher, so all its streaming is blurry gameplay.", "verified": true, "helpfulness": "0/0", "author": "andrew cheung"}, {"rating": 4.0, "review": "The firestick is compact and easy to use, but where are the 400,000 vedios and movies?  I added up both categories and the total reflects less than 300.", "verified": true, "helpfulness": "0/0", "author": "George lim"}, {"rating": 2.0, "review": "Does not consistently work.  Our modem is not that far from the TV (15 feet?) which has the Fire TV Stick plugged in.  Connection is intermittent at best.  Wish I had not bought it.", "verified": true, "helpfulness": "0/0", "author": "LovelifeinPa"}, {"rating": 5.0, "review": "This is AWESOME!!!", "verified": true, "helpfulness": "0/0", "author": "Mz Magic \"Deva Voice Studios\""}, {"rating": 5.0, "review": "Very easy set up works like a charm. Love it", "verified": true, "helpfulness": "0/0", "author": "Jackie Sweeney"}, {"rating": 5.0, "review": "As a busy parent shuffling between work, school & activities, Fire TV is the best purchase I have made! I don't have to pay outrageous fees just to have the capability for on-demand services so my family & I can watch our shows/movies at a later time because of our hectic schedules. Won't be disappointed...", "verified": true, "helpfulness": "0/0", "author": "Aaleize-SpceKDT ZEI"}, {"rating": 5.0, "review": "Much better than Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "The Fire TV Stick did as much plus a whole lot more than I thought it would.", "verified": true, "helpfulness": "0/0", "author": "Gaye"}, {"rating": 5.0, "review": "Fire TV Stick arrived when it was expected and was very easy to install.  It does everything that it was supposed to do.  What more could I ask for?Wel,l maybe the voice command controller for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Gene Forbes"}, {"rating": 5.0, "review": "Simply Awesome! Easy setup and flawless operation. Just ordered my 2nd...", "verified": true, "helpfulness": "0/0", "author": "Big Daddy"}]