[{"rating": 5.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "I love it great investment", "verified": true, "helpfulness": "0/0", "author": "Shirley"}, {"rating": 4.0, "review": "The directions that came with the Fire TV Stick are not very complete.  I had a very difficult time figuring out how to access the TV-screen keyboard to enter my WIFI password.  However, once I stumbled upon that (many many minutes later), I sincerely enjoy accessing my Kindle Fire apps on the \"big screen\" when there is nothing else on TV!", "verified": true, "helpfulness": "0/0", "author": "Joan Buvarsky"}, {"rating": 5.0, "review": "Awesome! Just what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "naya"}, {"rating": 2.0, "review": "Don't understand it completely.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Wright"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Frank Gonzalez"}, {"rating": 5.0, "review": "Good stuff  and I willing to buy another fire stick in the near future I love my amazon fire tv stick.thank you amazon for such a great product.A happy buyer.", "verified": true, "helpfulness": "0/0", "author": "CARL WILLIAMS"}, {"rating": 4.0, "review": "Pretty well done, I do have to say.  Some minor issues with the phone remote app in terms of sensitivity to the slider pad and I've also seen some sync issues with the audio to the video where the sound didn't match the lip movement in the video (very distracting!) on the HBO GO app but as far as ease of use and installation, excellent!Overall, it is a slick concept and I'm sure I've barely scratched the surface of capability.", "verified": true, "helpfulness": "0/0", "author": "T. Geery"}, {"rating": 5.0, "review": "This thing is awesome! It's easy to use and it has anything and everything you want to watch. If you have Amazon Prime it's even better!", "verified": true, "helpfulness": "0/0", "author": "Andrea Tanory"}, {"rating": 3.0, "review": "It is hard to fine anything to watch if you are used to cable or satellite, haven't played that much with it to find the in and outs of it.", "verified": true, "helpfulness": "0/0", "author": "Deryl"}]