[{"rating": 5.0, "review": "what a gadget!! for the price it can't be beat.", "verified": false, "helpfulness": "0/0", "author": "dennis p. flynn"}, {"rating": 3.0, "review": "[REVIEW] Amazon Fire TV Stick - A capable media streaming device - Recommended with reservations. SEE UPDATE FOR REASONSI took advantage of a special pre-order deal for 2 qty Amazon Fire TV sticks. The price was right and I knew they would come in handy at some point in time. One of the reasons I wanted to have a Fire TV stick was to have a streaming media device I could use at my office or while on the road. Although standard streaming media devices are nice, they tend to be bulky. Smaller devices such as the Amazon Fire Stick and Google Chromecast are small and easy to throw into a bag.Review Summary:This summary is for those of you who aren't inclined to read the review in its entirety. It comes down to this: the Amazon Fire TV stick is nifty! If you neither want nor need a more capable full-featured device like a Roku 3 or AppleTV, then look no further than the Amazon Fire TV Stick. It easily meets my basic requirements of a streaming media device, it's well-priced, has a solid set of features, very good build quality and definitely has more to offer than its primary competitors. That's just my overall assessment of the Amazon Fire TV stick. Read on for the full review with all the details!Full Review:I didn't really need another streaming media device. I have a Roku 2 XS, an AppleTV 2, an AppleTV 3, a SmartTV and a Sony PS3. It may seem like an excessive number of devices for streaming media but each serves a distinct purpose and performs admirably. Why did I buy the Amazon Fire TV sticks? Price and convenience. The pre-order deal was an opportunity and I wanted a device to stream content while at work and on the road. The Amazon Fire TV seemed to offer a great balance between price, size and features. I wasn't disappointed.Inspecting the Amazon Fire TV Stick:I opened the box was pleasantly surprised by the build quality of the Amazon Fire TV stick. Unlike other dongle-type devices such as USB stick drives, the Amazon Fire TV stick doesn't feel like it was going to fall apart after using it just a few times. The remote has the same level of build quality and a nice feel to it. In comparison, the remote provided by Apple for its AppleTV very thin and light and uncomfortable to hold and use and the remote provided with Roku devices is heavy and bulky. The Chromecast, one of the main competitors of the Amazon Fire TV stick, doesn't even have a remote. This may not be an issue to some people because they don't mind using a smartphone app as a remote but to me, it's a reason to avoid it. I don't have my phone nearby at all times. It may be in the kitchen or bedroom while I'm in the living room. Or, on a counter plugged in a charger. Who's to say? Imagine I want to use a chromecast and my phone is plugged in and charging. That's going to make using the remote app pretty cumbersome.Here's what you get from Amazon.  The Amazon Fire TV Stick  a remote control  an HDMI extension cable  An AC adapter  An instruction ManualAlthough this should be obvious, you'll need to connect the stick to a device that has HDMI such as a port built into your TV or home theater receiver and it must have access to the Internet via wifi.Setting up the Amazon Fire Stick:The email I received from Amazon.com about my Fire TV sticks informed me they were preregistered to my Amazon account. On one hand, this is convenient. Plug in the Fire TV Stick and it's ready to go out of the box. However, I am not a fan of this type of service. What if I planned to give the stick to someone as a gift? The recipient will take it out of the box already configured for my account. Definitely not a good thing. Amazon.com should either not automatically register the device to the account of the purchaser or, at the time of purchase, give the buyer the option of having it pre-registered or left unregistered. As a result, I have to contact Amazon.com about deregistering one of the sticks because I had planned to gift it to someone. That being said, setup is a breeze.The Amazon Fire TV Stick connects to your TV or home theater system via HDMI. So, connecting it is just a matter of popping it into place. It was very thoughtful of Amazon to provide an HDMI extension cable. Unfortunately, I've come across TVs whose designers did a horrible job placing the HDMI ports on them. Sometimes they're too close together. Other times, they are placed in a manner that makes it very difficult to an HDMI cable or device to it. Fortunately, the connecting the Amazon Fire TV Stick to my office's RCA 1080p LED TV proved a non-issue. I didn't need to use the extension cable.This brings me to an idea... Why make the stick 100% reliant on juice from an ac adapter? I can't imagine an Amazon Fire TV stick uses a significant amount of electricity. I would not have minded Amazon finding a way to make it battery-operated with an option to juice it via ac adapter. Think in terms of a built-in rechargeable battery. That way, I could juice it up before I hit the road and leave the ac adapter at home. Maybe just bring a charging cable I can connect to other USB charger(s) I might have with me.The fact that the Amazon Fire TV stick requires an AC adapter for proper functionality brings to mind a concern. Just how much weight can an HDMI port support? It isn't like the cables are plugged in and screwed into place like VGA or DVI monitor connections. HDMI cables and devices plug into place with no additional support. In the case of the Amazon TV fire Stick (and its competitors), the HDMI port needs to support the weight of the device _and_ a cable that connects it to the AC adapter. And, depending on how the port is placed on the TV, it may even result in a poor connection.Using the Amazon Fire TV Stick:Once the stick was connected, I attached the cable to the AC adapter and powered up everything. As with all streaming media devices, the stick took a short time to power up. The Amazon Fire TV Stick provided a brief welcome video and then immediately switched over to accessing my wifi and configuring a basic but critical video setting.Accessing the network was easy. Choose the network, plug in the password and hit the next button. It found my network without any trouble whatsoever. Next it asked me to tweak a display setting, where I had to scale up or down a set of arrows to make sure the entire picture fit on the TV properly. Again, very easy and it took all of a few seconds. There are a a slew of other settings but I didn't delve into them too deeply. Leaving them on automatic seemed to be dandy. I did notice the Amazon Fire TV Stick has more video settings than the Roku 2 XS. Once I finished looking at the settings, it was time to explore the apps on the device.The interface of the stick is easy to navigate. I had no trouble whatsoever finding the settings and apps and such. One notable difference is the speed and smoothness of the device. It responds more quickly then a Roku 2 XS and feels just as smooth as the AppleTV 2 and 3 and the smart features built into my 2013 model year Samsung Smart TV.  This could be a significant improvement over the smart features built into your TV or may be similar or worse.The smart features in smart TVs are definitely not created equal. So, if I say the Amazon Fire Stick feels as smooth as the smart features in my Samsung TV - I forget the model # off the top of my head - it doesn't mean they will be better or worse than those in other smart TVs and devices, regardless of brand. Consider... One of my brothers recently purchased a low-end 2014 model year Samsung smart TV and the speed of its apps and its app interface is noticeably inferior to the smart features in my 2013 Samsung TV, which was near the high end of the mid-range models of its time. The design and speed of the smart interface of my brother's new TV is inferior to that of a Roku 2 XS, too. Based on that, the interface and speed of the Amazon Fire TV Stick is that much more of an improvement over the smart features of his TV.Again, the interface of the Amazon Fire TV stick is easy to navigate. It's more reminiscent of a Roku than it is, say, an AppleTV. There is a list of options on the left side of the screen, i.e. settings, my apps, etc and then the rest of the screen are the apps and such available within the chosen option. Amazon offers a wide variety and ever growing set of apps - far more than enough to satisfy 99% of the people interested in streaming content to their TV. But, while there are a ton of apps available, they aren't necessarily installed out of the box. For example, Netflix is not automatically instaleld but is readily available as a free download. It's the first app I installed on the Amazon Fire TV Stick and gave a whirl.Streaming from Netflix on the Amazon is just like on a Roku 2 XS or my iPad. You'll have to enter your login info the first time you use it. This should not come as a surprise. Once you do that, open the app, choose who is accessing the service and content is immediately available. This brings to mind a benefit over the NetFlix app built into my Samsung TV. On my TV, I can't choose the user. I hadn't had multiple users the first time I setup NetFlix on my TV and I can't find a way to log out and log in again to see if i can change the user. Very annoying. This may change when the app is updated in the future. Or, at some point, I may have NetFlix log out of every device and start from scratch. At that point, I may be able to change the primary user in my TV's configuration. Fortunately, this is a non-issue with the Amazon Fire TV Stick.The RCA TV at my office is a 1080p/60Hz LED TV. The picture is actually surprisingly good for a 24\" LED TV. Not as good as my Samsung at home or my brother's Samsung or a larger, higher quality TV but definitely more than sufficient for my office. After all, it's primary purpose is to serve as a display for our video surveillance system. But, we felt it would nice to have the option of streaming content to it over our lunch hour.My \"go to\" video for testing streaming is Marvel's The Avengers. I chose this video for the obvious reasons. Lots of fast paced action and ambient sound. That it's good fun is a bonus. There's nothing like watching the Hulk give Loki a serious beat down. And, the Amazon Fire TV stick didn't disappoint me at all. The picture quality started off marginally yuck but quickly improved to quite good. This is no different than my experiences streaming on a Roku 2 XS, AppleTV and on my Samsung TV. The picture quality is always off at first. Movement on the screen was smooth. Colors were nice. Definitely made for a nice viewing experience.Unfortunately, I couldn't assess the audio quality because the RCA TV at my office has horrendously bad speakers. A $9.99 AM transistor radio from the 70s is an improvement. As expected, the sound quality while watching The Avengers was horrible. As I said, though, this is not the fault of the Amazon Fire TV stick. Audio quality is 100% dependent on the streamed content and the sound quality of the audio-video hardware, i.e. TV, home theater system, etc. I'm betting the sound quality will be at the least acceptable to pretty good on a better TV and/or TV connected to a home theater system or soundbar.My next step was to check out Amazon Video On Demand (VOD). As with Netflix, it was a breeze. The key difference is I didn't have to doownload and app and/or log into the system. As I pointed out previously, he Amazon Fire TV Stick was affiliated with my account automatically since I purchased it directly from Amazon.com. The one thing it did ask is if I wanted to enable parental controls. I immediately told it yes and recommend everyone do the same. Admittedly, I'm the only one who's going to use the stick. However, in this day and age of fraud and insecurity, I feel requiring a PIN for purchases is worthwhile. Streaming using Amazon VOD was near identical to streaming with Netflix. Accessing the content was quick and easy. Videos had a fine picture and played smoothly. Audio quality was still horrendously bad due to the speakers of the RCA TV.Content:As with all streaming media devices, Amazon provides apps for accessing content. Amazon VOD. NetFlix. You name it. Everyone will find something. Once in an app, I can't imagine someone having a difficult time finding enjoyable content. I typically watch content from NetFlix and Amazon Prime VOD. Occasionally, I might rent a show form Amazon. I don't do it often but every once in a while when I don't want to wait for somethign to show up as a freebie on Amazon Prime VOD or Netflix or via iTunes or Verizon FIOS Video on Demand.This brings me to a key difference between the Amazon Fire TV Stick and one of its main competitors. The Amazon Fire TV Stick provides easy access to Amazon rentals and purchases. If you have a large Amazon library, then buying an Amazon Fire TV Stick is a no-brainer. No doubt about it. The Fire TV Stick will give you immediate access to all of your Amazon media content. But, If you're Apple-centric with a significant investment in iTunes content or have a large iTunes library on your computer/phone/tablet and want to stream it to your TV, then you may want to consider an AppleTV  since the Amazon Fire TV Stick doesn't offer you access to your iTunes media. There may be a way around this limitation but it seems hardly worth the trouble dealing with it.One of the reasons people choose the Chromecast or AppleTV over other streaming devices is the ability to throw content to it from a phone, tablet or computer to it to be viewed on the TV as long as they are all on the same local network. It's a cool feature, in theory. The problem is that it requires the user to actively find content on the source device, i.e. phone, computer, tablet, etc and then send it to the Chromecast or AppleTV. I've done this with a Chromecast and with Apple products and AppleTVs. It's definitely doable. But, is it convenient? Not in my experience. Who wants to futz with a computer, phone or tablet to watch content? I'd rather use the streaming media device itself and be done with it. The only time \"casting\" content comes into play is if I have something on the source device (Phone, computer, etc) that isn't accessible directly via the streaming media device.I consider this a secondary feature at best. Think in terms of a bonus that improves the overall experience of a streaming media device. However, in my opinion, a streaming media device should have ample features and usability to stand on its own without requiring a local source of content. The Amazon Fre TV Stick doesn't let you down in that regard. It has its base set of apps and an ever expanding library of additional apps. But, like an AppleTV and the Apple universe, the Amazon Fire TV Stick is very amazon-centric. Does this come as a surprise? Not at all. It's an Amazon streaming device. I would have been shocked if it _wasn't_ amazon-centric. Is this a bad thing? No. Ignore the Amazon stuff when you don't want to use it. It isn't a big deal. If this is an issue, then choose a different streaming device.A couple of other notes:The AC adapter of the Amazon Fire TV Stick connects via USB. However, don't assume this means your TV, if it has USB, can power the device. This is not necessarily the case. On some TVs, a built-in USB port is used for accessing content from an external storage device, i.e. external hard disk drive or for installing a firmware update. The port may even have enough juice to power some USB flash drives. May is the operative word. The ports don't necessarily provide much power and may not have enough juice to power the Amazon Fire TV Stick. You can try it but don't be shocked if it results in problems. Definitely check with the manufacturer or your TV for details. The same can be said when connecting the Amazon Fire TV Stick to a home theater receiver.One key benefit the Amazon Fire TV Stick will have over the competition is the ability to connect to a WiFi network that requires web browser based authentication. This is the kind of network which, when you connect to it, pulls up a web site into which you plug in a user name and password. They are common in hotels. Will is the operative word. Amazon hasn't implemented this feature yet. It will be a _huge_ leap forward in streaming devices once they have it in place. The usability of the Amazon Fire TV Stick when traveling will increase tremendously. Once this feature is active, just remember to log out of the wireless system of the given location, especially if they charge by the minute or day.Games. I'm not a big gamer, so I didn't test any of the games. However, games via media streaming devices is going to change the landscape of living room entertainment. No doubt, a Roku or Amazon Fire TV or Fire TV Stick isn't going to replace a Sony Playstation or XBox. Consoles are an entirely different market. However, games like those can be played on a smartphone, on the other hand, can be immensely fun on a TV. At some point, I'll break out a game or two and see how well they run. I definitely see kids playing games via a smart stick instead of a console.I should point out that I might have given the Amazon Fire TV Stick a 5 star review if Amazon hadn't preregistered the stick to my Amazon account and had iOS remote control software available on the device's release date. But, I like the Amazon Fire TV stick enough that I felt it still earned four stars.Final assessment:Don't hesitate to buy an Amazon Fire TV stick. It's a nifty device and a welcome player in the field of streaming media devices. If you neither want nor need a more capable full-featured device like an Amazon Fire TV box, Roku 3 or AppleTV, then look no further than the Amazon Fire TV Stick. It more than easily meets the basic requirements of a streaming media device, it's well-priced, has a solid set of features, and very good build quality. You won't regret purchasing it.JULY 7, 2015 UPDATEThe initial versions of this review reflected how happy I was with the Amaozn Fire TV Stick upon my initial purchase. However, over time, Amazon has changed the interface of the devices and I've had problems using to stream content via the Netflix app. The interface is very Amazon.com centric. While this is not a surprise since the Fire TV Stick is an Amazon device, it definitely makes it more difficult to use it with other services. As a result, navigation is more cumbersome.The other issue is stalls when using the Fire TV stick to stream content via the NetFlix app. Meaning, as I'm watching content, it will stop streaming and a percentage counter will appear and stall at 25%. This happened several times. At that point, I powered up NetFlix on my iPhone, iPad, AppleTV and on the TV itself (via its Smart features). No problems streaming NetFlix content on the non-Amazon devices. Switched back to the Fire TV stick and it stalled. This happened for several months and was annoying enough that I moved the Fire TV stick to a different room, where it's connected to a TV that isn't used for streaming that often. As a result of these issues, I've changed my rating from four stars to three stars and only recommend the stick with reservations.", "verified": true, "helpfulness": "23/25", "author": "Robert M"}, {"rating": 5.0, "review": "Absolutely amazing!", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Good so Far.  Install was relatively easy. Still exploring all of the available choices. Was surprised that most all of the choices even run of the mill network series were fee based.  The purpose seems to be to funnel you at Amazon Prime or NetFlix or Hulu, etc. so we are on the Net Flix one month free trial, and may try the Amazon Prime trial next to see which we like best.Happy with the array of available choices so far.", "verified": true, "helpfulness": "0/0", "author": "rikb"}, {"rating": 5.0, "review": "Excellent. Simple to set up. Fast. Love the content.", "verified": true, "helpfulness": "0/0", "author": "Chaochen"}, {"rating": 3.0, "review": "But that 'one' feature makes a big difference. The Fire TV Stick supports miracast yet cannot connect to a laptop or desktop with a wireless card with WiDi capabilities. Which means there is no way to mirror your laptop or desktop whereas in chromecast you can atleast mirror your browser.Since the Fire TV supports miracast I believe it only needs a software update to work with WiDi cards. If Amazon can push this update on it, this would be by far the best streaming device available.", "verified": true, "helpfulness": "0/0", "author": "Nikhil Sanil"}, {"rating": 5.0, "review": "LOVE IT! It was easy to set it up. I'll recommend it.", "verified": true, "helpfulness": "0/0", "author": "JAAO"}, {"rating": 5.0, "review": "Works as well as any \"Smart TV\" upgrade stick or box. Running over an Android OS I was able to load XBMC/Kodi on top of it and also view all of my media center content and all other add-ons without skipping a beat. For the price and simplicity there is no better option for an all-in-1 HTPC like setup.", "verified": true, "helpfulness": "0/0", "author": "Kurt"}, {"rating": 5.0, "review": "Easy to install. Easy to navigate all the features available.", "verified": true, "helpfulness": "0/0", "author": "Brenda Evans"}, {"rating": 5.0, "review": "It is very good for its price. My only problem is that it doesn't have an ios app to navigate easier. Also I like to search all of resources like Netflix and Amazon Prime when I search for a title and be able to open it right away instead of going to the app.", "verified": false, "helpfulness": "0/0", "author": "Situne"}]