[{"rating": 3.0, "review": "Not as good as the Roku 3 we have.  Not bad, though.", "verified": true, "helpfulness": "0/0", "author": "Matt T"}, {"rating": 5.0, "review": "We love it!  Super easy set-up and the quality is AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Rachel A"}, {"rating": 2.0, "review": "I am very disappointed.  There are a few good points to the stick.  However, the main reason I purchased this was to watch movies.  Not interested in games.  The first video I loaded was an episode of \"Vikings.\"  Within 2 minutes, the playback started pausing to buffer.  Eventually, I got a message saying my bandwidth was insufficient.  Huh?!  Checked my bandwidth -- over 100 mps, which should have been more than sufficient.  Shut off everything else that might be using up bandwidth, but it made no difference.  Rebooted stick (twice), still kept telling me I had insufficient bandwidth.  (And, yes I had the annoying power cord connected for \"best results.\")  Disconnected stick, connected Apple TV and tried streaming the same episode.  It played without a hitch.  Tried it on several other devices and had no \"bandwidth\" problem.  (All were HD -- same as Amazon Prime version.) If it's really a bandwidth problem, shouldn't other devices have trouble streaming the same media?  I could look around on the web and try some of the troubleshooting advice that's probably out there, but I've had my fill of tinkering with tech devices to get them to work and, at this point in my life, don't have time, patience, or energy to deal with it.  Would just like something to work the way it's supposed to right out of the box!  I'll probably give the stick away.  Wish I had not purchased it.", "verified": true, "helpfulness": "0/0", "author": "SDB"}, {"rating": 5.0, "review": "I love it /it's  like having a whole  new tv", "verified": true, "helpfulness": "0/0", "author": "Michael morris"}, {"rating": 5.0, "review": "super jazzed about having this, a no-brainer purchase to go with a kick-down old plasma screen from my brother. for years now i've been exclusively on streaming media like Netflix and TED Talks etc. so this just extends my current watch sources to my bedroom. the selection is great, i scanned through the selection of the apps i haven't heard of or used before and i was surprised at the availability for no subscription.a side not: each tv episode will usually buffer once during play, cannot say whether this is my WiFi connection or the speed of the device, but it is so minimal as to be inconsequential. also every app uses fast forward and reverse searching differently. it is not uniform for the device, but proprietary for each individual service. for example, Netflix and Amazon video operate slightly different from each other but each works the same as they did on my PS3 and my internet browser.", "verified": true, "helpfulness": "0/0", "author": "Justin Boyle"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Chris Miskowiec"}, {"rating": 3.0, "review": "Disconnects from the Wi-Fi (2.4 and 5 GHz). Barely use because of this.  It's the only device that disconnects.  For the price and size, it's not a bad deal.", "verified": true, "helpfulness": "0/0", "author": "Juan A."}, {"rating": 5.0, "review": "I had been looking for a budget streaming device for the family that they could pass around and share, and one that would have the WWE Network app. It was either between this or the Roku Streaming Stick.I have been using Amazon for a while now, and it was a tough decision because they both had their pros and cons. The Roku was more open and had no loyalty to certain services like the Apple TV, or the Google Nexus Player. I had seen that Roku didn't have the best customer service through reviews and I knew Amazon was always great about customer service. I've never had an issue with them, so I decided to go with them.I do not have Amazon Prime which this is perfect for those customers because it has a lot of features that pertain to it and the device is of course by Amazon.If your on the fence, I honestly recommend going for the Fire TV Stick just off the specs alone. The extra RAM, memory, and the controller.Pros:- Price ($39.99 for NEW? Roku charges that for a refurbished stick)- The remote- The Specs- The User Interface- The applications- Great for Prime members!- ASAP feature- The included HDMI extension cableCons:- No dedicated sleep or Off button.- Gets Hot while streaming (this just worries me for the \"life\" of this product", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 3.0, "review": "It was pretty easy to set up, but it seems that movies are interrupted frequently because the streaming isn't complete. I don't know if that will get better but it does make it difficult to watch a movie when it's broken up.", "verified": true, "helpfulness": "0/0", "author": "Linda Brandhagen"}, {"rating": 5.0, "review": "Easy set-up.  Like that it has parental controls.  Works well.", "verified": true, "helpfulness": "0/0", "author": "mom"}]