[{"rating": 5.0, "review": "Very easy to set up and use.  Works exactly as expected", "verified": true, "helpfulness": "0/0", "author": "GW"}, {"rating": 2.0, "review": "I am not thoroughly impressed by the Fire TV Stick. I debated on whether or not to purchase this or the actual Fire TV. Since my main TV is a smart TV, I was mainly looking to purchase this for the secondary TV we have for the kids. I settled on the Stick and have yet to have a single day where it actually works. My Internet services have never given me problems with my phone, tablets or Smart TV. But when we try to use the Stick on any given day, I continually have \"connection problems\". Although on my phone or tablet it shows no issues. We have yet to be able to watch a single movie, although we have played a couple of games. I am seriously debating on returning my product.", "verified": true, "helpfulness": "0/0", "author": "Natalie Valle-Garcia"}, {"rating": 5.0, "review": "Very simple to learn, use and navigate. The screen is very clean with one column and various rows to select content. I recommend this over a smart tv especially if one has an AV receiver.", "verified": true, "helpfulness": "0/0", "author": "tarik"}, {"rating": 5.0, "review": "User friendly and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "hard to use", "verified": true, "helpfulness": "0/0", "author": "RONALD B OLSON"}, {"rating": 3.0, "review": "1. Poor internet connectivity; oftentimes it will struggle to stay connected during Netflix or WatchESPN even if the network is fine on my computer or phone.2. Limited app availability means that there are some streaming services or apps I'd like to cast from my phone or computer but I can't.3. The plug cord is unsightly and sticks out from the device, which would be attractive otherwise.", "verified": true, "helpfulness": "0/0", "author": "Morgan Septer \"eragonsaphira\""}, {"rating": 5.0, "review": "Exceeded my expectations with performance and ease of use.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 4.0, "review": "The Fire Stick itself is excellent- I love it.  The REMOTE stopped working correctly after 1 day.  That's ONE day.  Not a month. Not a week.  One day. Really? Did you test it at all when you designed it?", "verified": true, "helpfulness": "0/0", "author": "Lynn Therese"}, {"rating": 2.0, "review": "I bought this to entertain myself and my kids at home and out of town. The first trip out of town I get a message in the tv and the Amazon rep tells me the tv is not capable of displaying the picture. It should be a simple transition from TV to TV that have HDMI inputs. I am extremely disappointed in the capabilities of this product. I would not recommend it to my friends and family.", "verified": true, "helpfulness": "0/0", "author": "Daniel P LaDuke"}, {"rating": 5.0, "review": "I love it and I wish I had bought one sooner. It's taken Netflix and Hulu to another level. I recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "M. H. Harley \"NC Book Diva\""}]