[{"rating": 5.0, "review": "Easy to use and works great.", "verified": true, "helpfulness": "0/0", "author": "Emily R."}, {"rating": 3.0, "review": "Quirky, needed several attempts to get it to work and download. The software that came with it is nearly plug & Play. With slower wireless networks, there is a buffer delay during Netflix streaming.", "verified": true, "helpfulness": "0/0", "author": "John Berezny"}, {"rating": 5.0, "review": "Great to use, easy and good reception. I love the Prime Movies for FREE.", "verified": true, "helpfulness": "0/1", "author": "Moe O."}, {"rating": 5.0, "review": "Awesome item. This is the future of TV!", "verified": true, "helpfulness": "0/0", "author": "Brian A Kennedy"}, {"rating": 5.0, "review": "I wasn't sure what to expect when I ordered the Fire TV Stick but even with my limited tech savvy I had it set up and running in no time.  With Amazon Prime the movies, tv, apps and games are virtually limitless.", "verified": true, "helpfulness": "0/0", "author": "Vickie rugamer"}, {"rating": 5.0, "review": "Works well!", "verified": true, "helpfulness": "0/0", "author": "W. C. Hadgigeorge \"Will\""}, {"rating": 4.0, "review": "Remarkably easy set up.", "verified": true, "helpfulness": "0/0", "author": "mike sautter"}, {"rating": 2.0, "review": "Love the idea and l lover the stick for the first day. Since day two I have had nothing but problems. I cannot keep the two sticks I have connected to the internet. I have not been able to use either stick at all. It is not my Internet as I had that checked and can stream on all other devices without any problems.if they worked they would be great", "verified": true, "helpfulness": "0/0", "author": "phoebeakame"}, {"rating": 5.0, "review": "I've always valued my Amazon Prime membership--mostly for the free deliveries. I prefer to shop for everything from dog food to pantry staples to electronics through Amazon. It's so much more efficient for me. But, I was not utilizing my membership completely until now. I bought my Fire Stick with a gift card I received for Christmas. I guess they were inundated with orders from the holidays because it took a few weeks to arrive. But, it was so worth the wait!! This is the coolest thing EVER! I set it up yesterday. It was so easy. I did order an extension cord because of the way my TV is set up. But, I have been doing a Sopranos binge all day. Quality is awesome. Also watched Amazon's Transparent. Excellent streaming quality. I am considering cancelling my satellite subscription. This is way less expensive and it seems that I will never get through all of the titles provided by Amazon prime. BRAVO, Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "A. morris"}, {"rating": 5.0, "review": "Quick and easy to install. Absolutely love watching my shows on my 40 inch tv now.", "verified": true, "helpfulness": "0/0", "author": "NY User"}]