[{"rating": 2.0, "review": "We are having a hard time getting a movie and are constantly being pressured to buy Amazon Prime.  We just wanted Netflix for $7.99 a month.  Why are we being bombarded to have to buy or rent every movie that comes up in addition to paying a Netflix subscription?  Are we just too dumb to know how to use this?  My husband is in an assisted living facility.  I am not going to pay for Amazon Prime too.", "verified": true, "helpfulness": "0/1", "author": "Nancy K. Smith"}, {"rating": 2.0, "review": "For such \"advancement\" in their technology and buffering, you would expect the Fire stick to NOT lag. It lags on everything... Netflix, Amazon Prime, Hulu. I think they need to go back to the drawing board and redesign the thing to prevent the lag. Chromecast has no issues with lagging, but of course you have to \"cast\" the program from a device. Not so thrilled with Fire TV stick to say the least.", "verified": true, "helpfulness": "0/0", "author": "Kevin Huxoll"}, {"rating": 5.0, "review": "Awesome works great and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Augustus M Conner"}, {"rating": 5.0, "review": "the fire tv stick works fine and i can see a lots of movies that i could not have seen .", "verified": true, "helpfulness": "0/0", "author": "James H Brown"}, {"rating": 5.0, "review": "Great Price", "verified": true, "helpfulness": "0/0", "author": "courtney"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "John puntervold"}, {"rating": 3.0, "review": "I have Netflix currently and don't see much advantage for fire stick. I do like that I'm able to view my photos on the TV. It was a gift so I shouldn't complain however I would not have purchased it myself", "verified": true, "helpfulness": "0/0", "author": "Richard snow"}, {"rating": 3.0, "review": "WISH THE VOICE PROMPT WOULD WORK FOR OTHER APPLICATIONS AND NOT JUST AMAZON PRIMEFor example HULU or Netflix", "verified": true, "helpfulness": "0/0", "author": "ty"}, {"rating": 5.0, "review": "Great device. Loaded with entertainment!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent, works great on my son's tv.", "verified": true, "helpfulness": "0/0", "author": "Mike J."}]