[{"rating": 5.0, "review": "Excellent device with a lot of great features!", "verified": true, "helpfulness": "0/0", "author": "Gustavo Daniel Alvarado Gonzalez"}, {"rating": 5.0, "review": "Works great. Wanted it to watch prime on my tv. But also use it on business trips since you can get into hotel wireless with it.  Unlike the chromecast. Just be sure to update it before you leave home.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "Easy to use, lots of great features. We are using it a ton for Amazon videos. They have a ton of good stuff to watch. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "dannymac"}, {"rating": 5.0, "review": "this is a fantastic product, don't know how we lived without it before.", "verified": true, "helpfulness": "0/0", "author": "J. Huther \"grandmother reviewer\""}, {"rating": 5.0, "review": "It's so easy to use and if it's slower than Fire TV it's not by much!", "verified": true, "helpfulness": "0/0", "author": "lorraine smith"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Britney Smith"}, {"rating": 3.0, "review": "The stick is amazing and so worth the money!! BUT if you can't get the app for the remote you will hate it. The remote that it comes with is utterly useless. I fortunately have an iPhone and downloaded the app the fire stick remote and it is just awesome. I am a happy customer.", "verified": true, "helpfulness": "0/0", "author": "Lavia Cochran"}, {"rating": 4.0, "review": "I like the choices but too many videos cost to rent.", "verified": true, "helpfulness": "0/0", "author": "daniel gradoville"}, {"rating": 4.0, "review": "Great product. The interface could be a bit more fluid amd better organized. I'm still trying to figure out how to play the next episode in various apps without having to back out and scroll.", "verified": true, "helpfulness": "0/0", "author": "Melissa M"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Cj Silver"}]