[{"rating": 1.0, "review": "Constantly looses connection when my other devices have no problems staying connected to WiFi", "verified": true, "helpfulness": "1/1", "author": "Nicole Reavis"}, {"rating": 4.0, "review": "Really good product. The remote is a little flaky otherwise it's a five star product.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "This turns any TV into a smart TV. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Devin Brown"}, {"rating": 1.0, "review": "Drops WiFi connection frequently.", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "So far a great experience, easy to navigate, super cheap (got it on the Prime deal) and full featured. While I like my Apple TV more, this is a perfect second TV item.", "verified": true, "helpfulness": "0/0", "author": "Rob Allshouse"}, {"rating": 5.0, "review": "Very easy to install.  Easy to use. The on screen menu is great.  Streams nicely on Prime.  Remote makes life a lot easier.", "verified": true, "helpfulness": "0/0", "author": "Barbara L. Enderlein"}, {"rating": 5.0, "review": "Easy to install.  A bit concerned about the durability of the remote, however, I've had no problems thus far.  Seems to operate quickly and efficiently.  It was a Black Friday price point purchase, and I couldn't be more pleased at this point.", "verified": true, "helpfulness": "0/0", "author": "Richard Martin"}, {"rating": 5.0, "review": "When I got this for my non \"smart\" LED TV I had an idea of what to expect as I was already comparing it to Chromcast.  First off, it offers a remote BUT you can also download an app that acts as a remote as well.  This was huge as I was immediately concerned in the eventuallity of me losing said remote.I dont have any real criticsms but if there is anything ti nitpick that would be that the remote needs to be pointed at the tv.  its not RF or at least I havent verified however its not as bad as traditional IR (since the receiver stick is behind the TV.The HDMI dongle is good thinking on Amazon's team.  When there are multiple HDMI ports as mine does the stick though flush, could make thinks a little trickier to unplug.  Having said that, the dongle extension they provide does the trick with flying colors.The interface is simple but intuitive, adding apps like Hulu and youtube took less then a few minutes.  I was up and running watching shows on hulu, amazon prime and youtube (btw, if you have an android smartphone, pair it with youtube and you can \"tell\" the firestick to show what your phone is watching!!!)I have removed my cable box from my room, which charges $10/mo, subscribing to Hulu Plus is 8 bucks..So now i have instant access to all the shows that I watch and then some.  Its worth it and saving a few bucks to boot.I plan to fully cut the cable cord once the promotional cable rate is over (its bundled with my internet).Things to consider though esp in this day and age where there are data caps to our \"unlimited internet\" plans.  Comcast offers 300gb in most if not all plans.  I strongly recommend when watching youtube or netflix to use \"medium\" quality.  It greatly reduces the amount of data in your plan.  Im going on 10 days into my plan (while using Hulu literally ALL DAY and night) along with working at home (VOIP/VPN) and only used 50gb of data.  Before I was using over 120gb+ by this time!I recommend this over the chromecast only because of the remote.  I like to have a physical remote but the OPTION of a software remote is a nice touch.  Performance is good and no stuttering observed.", "verified": true, "helpfulness": "0/0", "author": "Brian W"}, {"rating": 3.0, "review": "Had to return one out of two units purchased, since it couldn't reconnect to my WiFi after it downloaded and installed firmware update.No idea why amazon did not fully implement Bluetooth functionality. I was even able to pair it with my BT stereo headset after sideloading settings.apk , but the audio would not go to the headset.", "verified": true, "helpfulness": "0/0", "author": "Dmitri Olchevski"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bill"}]