[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Christine Bartelme Doyle"}, {"rating": 5.0, "review": "It's the best thing every, eventhough I miss VH1 and a few other channel I really enjoy my fireStick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I just purchased the Fire Stick and in general am very happy with it.  The only reason it doesn't get 5 stars is that first and foremost, I'm disappointed in the performance of the MLB.TV app for this as opposed to the other versions of the app (see my review of the MLB.TV app).  The other reason is that I'm experiencing great difficulty getting the Fire TV Stick to work with Amazon Prime Music.  This may be operator error, but until I'm able to make that work I can't rate it higher.  The biggest plus I have for this is in comparison to the Google Chrome stick.  The Amazon Fire stick will allow you to connect to wireless over the internet as is typically required in a hotel room.  If you know what I'm talking about, you travel enough for this to make a difference.  The Chrome Stick will not connect in that circumstance and the Fire Stick will.  If you don't know what I'm talking about then you don't spend enough time in hotels for this to be an issue for you.I also like a good many of the apps available for the Fire Stick, but am dissappointed that many of them are not free.  Sorry, Android has spoiled me with free apps.  That said, however there are quite a few free apps available (see my review of weather radar), but there are many more that I would like to try if they didn't cost anywhere from .99 - 1.99, especially as a Prime subscriber.  I think Amazon should consider creating a 2 week trial period for apps which cost money for Prime members.  Many of these apps may be worth the money, but I'm not willing to shell it out in case they aren't what the seem/claim to be.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey D. Kerner \"Jeffrey David Kerner\""}, {"rating": 1.0, "review": "Lot of lag. The Amazon app on LG smart TV is much easier to use actually.Got this for Sling TV. The app was horrible and crashed a lot.", "verified": true, "helpfulness": "0/0", "author": "PharmTox"}, {"rating": 5.0, "review": "Great purchase works amazingly!", "verified": true, "helpfulness": "0/0", "author": "Maggie Van Meter"}, {"rating": 5.0, "review": "getting rid of cable and replacing with the Fire TV Stick was the best idea I've had all year!", "verified": true, "helpfulness": "0/0", "author": "C. Reiman \"book lover\""}, {"rating": 3.0, "review": "The menu limiting, doesn't show enough options as far as \"prime\" content is concerned. Also missing support for google play", "verified": true, "helpfulness": "0/0", "author": "tewman"}, {"rating": 4.0, "review": "Met my expectations", "verified": true, "helpfulness": "0/0", "author": "Frank Mannle"}, {"rating": 5.0, "review": "I like my Firestick and all the media outlets. Easy to navigate and gives me hours of entertainment. My son hooked it up for me. Seemed fairly easy to do.", "verified": true, "helpfulness": "0/0", "author": "Sally DiVecchia"}, {"rating": 5.0, "review": "Fantastic... Everything I expected!", "verified": true, "helpfulness": "0/0", "author": "Daltim"}]