[{"rating": 5.0, "review": "I originally bought and tried the ChromeCast, but I returned it because it wasn't compatible with some of my devices (I.e.: kindle fire) without installing clunky 3rd party apps. I'm glad I did. The FireStick is fast superior. It does everything that the ChromeCast did, but without using outside devices. Best of all, the picture quality is much better, in my opinion. The only", "verified": true, "helpfulness": "1/1", "author": "CapnCaveman"}, {"rating": 1.0, "review": "I don't see a significant benefit.  Too many of the major network shows require additional payment to watch.  For example, old episodes of Castle,require payment while they are available from other sources.  I wouldn't recommend this product at all, which is unfortunate because I like Amazon.  This product shows no significant benefit over other online resources.", "verified": true, "helpfulness": "1/1", "author": "M. Kearon \"M.E.K\""}, {"rating": 5.0, "review": "Just a great addition for entertainment, I love it!", "verified": true, "helpfulness": "0/0", "author": "Martha Tipton"}, {"rating": 1.0, "review": "It doesn't work. One week after it was installed.....it quit working. Junk! I'll stick to my Roku. Working for years and years. .", "verified": false, "helpfulness": "1/1", "author": "Carmen"}, {"rating": 5.0, "review": "Great product.  I like it better than my ROKU", "verified": true, "helpfulness": "1/1", "author": "David A Sherman"}, {"rating": 1.0, "review": "Do I need to be a amazon prime member to get free movies? Im nit a member and everything has a price", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As advertised, easy to set up and watching movies in minutes.", "verified": true, "helpfulness": "0/0", "author": "Phil Reznick"}, {"rating": 2.0, "review": "Setup was fine, access to apps with no probs. Would like longer USB cord but no biggie. However, this skips, stutters, freezes, etc and it is no fun watching. It usually fixes itself after only a second or two but the sudden stops and starts if you are using the tv as background noise are jarring. Sometimes freezes take full power on/off sequence to fix. Also screen sometimes freezes while audio continues happily along. That always requires restart.  Since my Roku works perfectly from same spot I know these are Firestick issues.  Works fine for infrequent use. This guy will go in the guest room and my old Roku will get its job back. Expected more from Amazon.", "verified": true, "helpfulness": "0/0", "author": "BookPolice"}, {"rating": 4.0, "review": "Very cool. Wish it didn't need an external power supply.", "verified": true, "helpfulness": "1/1", "author": "L. Stevenson \"MacBandit\""}, {"rating": 5.0, "review": "Had a friend highly recommend this to me so bought it on that recommendation. I can't compare it to the larger boxes as I haven't owned those, but it's lightning fast to stream compared to things like the Wii or a Blu Ray player. Easy to get your money's worth with just Netflix and Prime.", "verified": true, "helpfulness": "1/1", "author": "Brian Murphy"}]