[{"rating": 5.0, "review": "I love this item!!!!!  ;0)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Greatest value item I've purchased in years.", "verified": true, "helpfulness": "0/0", "author": "S. Knight"}, {"rating": 5.0, "review": "Much, much more than expected. Don't let this turn you into A couch potato.", "verified": true, "helpfulness": "0/0", "author": "Will D"}, {"rating": 5.0, "review": "This is the best.. It responds fast and was easy to set up. The games are great and the whole family loves this.. A great gift for you of someone!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my fire stick. Bought one for my mom. Wish I could type my selection tho.", "verified": true, "helpfulness": "1/1", "author": "Candy"}, {"rating": 1.0, "review": "Bought 2 of these and not very happy.  It conts to boot me off when watching something or buffs every couple of mins.  I checked my internet speed with 3 diff companies and all have over 50 mbs upload and download.  If I could get my money back I would.  Would never buy again.  Save your money and buy the Sony Box that does the same thing and with more options.  You can use your Amazon Prime Membership on it too.  Hope this helps.", "verified": true, "helpfulness": "2/3", "author": "Tony C \"HONESTY\""}, {"rating": 5.0, "review": "OH MY GOSH I love this so much I go back and forth to Atlanta Georgia every two weeks and I stay at a hotel and this comes in handy every time. It's easy to hookup and easy to use I have so many people asking me where I get from I just say duh Amazon but of course.", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 4.0, "review": "Simple to install and easy to program", "verified": true, "helpfulness": "0/0", "author": "Sandra Solano"}, {"rating": 5.0, "review": "Fantastic value. A added to supplement Netflix as a movie and TV show source. I can use it stand alone to watch Netflix and music and....and the list goes on.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I didn't realize this needed to be plugged in to the outlet in order to work.  Part of the reason I bought it was because it was so small but now I have a cord hanging down from my tv.  Also the cord is way too short and I need to use an extension cord! Annoying!", "verified": true, "helpfulness": "0/0", "author": "Caitlin Rubenstein"}]