[{"rating": 5.0, "review": "Excellent time. Just as advertized..", "verified": true, "helpfulness": "0/0", "author": "Joe Randy"}, {"rating": 5.0, "review": "I'm enjoying it. But have to remember that you will receive all TV shows etc. which are on cable or satellite if you're already subscribed to cable or satellite. And if your not, the good thing is that you can purchase your favorite shows for the entire season at a cheaper rate through Amazon without actually signing on to cable or satellite and getting channels you don't want and paying much more. This is probably confusing.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Michael Garfinkel"}, {"rating": 5.0, "review": "Love the fire stick!  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Trisa Laughlin"}, {"rating": 4.0, "review": "super easy to use and link up with your amazon account.  you can download other apps as well.  even with so-so internet speeds you still get great video streaming without lag.  if it could do casting similar to the chromecast then it would be the ultimate.  otherwise im happy with this so far.", "verified": true, "helpfulness": "0/0", "author": "Darkknightt"}, {"rating": 5.0, "review": "OK, I guess I should have bought one of these when they were on sale cause it stinks having to spend $40 on it. But let me tell you, it is super easy to install. But... I wish it would have come with more instructions on how to add aps and stuff like that. I still haven't figured that out. I also don't know if all the apps I have to separately sign up for. My son-in-law has Apple TV and they have basically gotten rid of their cable bill. I don't have that patience but it is really nice to now be able to actually use the video portion of my Prime membership. I am also looking forward to trying it out when I travel and have free wifi. I'm interested in seeing if I can actually use it in a hotel room. I am also interested in seeing if it will work in Mexico.", "verified": true, "helpfulness": "0/0", "author": "CSK 20"}, {"rating": 5.0, "review": "PERFECT", "verified": true, "helpfulness": "0/0", "author": "Sleepy"}, {"rating": 5.0, "review": "I am so impressed.  This has been an awesome blessing in our family.  Now we can watch Netflix in a room where there is no cable connection.  So happy I purchased this item.  The kids are happy as well.", "verified": true, "helpfulness": "0/0", "author": "Victoria98513"}, {"rating": 3.0, "review": "I love all of the variety of shows/movies available, but I'm disappointed with the connection problems I keep seeming to have. I have owned this product for less than a month and I feel like I keep reconnecting to our wireless again and again. Our router is less than a year old, so it shouldn't be a problem. I have connected the TV stick to it's adapter and into the wall so it has the best connection and it still seems to lose connection off and on. I'm a little disappointed but I wanted a product that had Hulu Plus, Netflix, etc. all in one place because I'm over cable! Perfect for what I need, but I'm not sure how to fix the connection issue.", "verified": true, "helpfulness": "0/0", "author": "April Keeley"}, {"rating": 2.0, "review": "IMHO the interface is not at all user friendly.Could not find out how to turn it off.  Ended up unplugging it.", "verified": true, "helpfulness": "0/0", "author": "PA Shutterbug"}]