[{"rating": 5.0, "review": "Love it!  Watching some great movies!", "verified": true, "helpfulness": "1/1", "author": "Rose Bobak"}, {"rating": 5.0, "review": "I really like the fire stick.  We run Netflix through our wireless dvd players in our other rooms, but tried the fire stick for our downstairs tv.  I like it much better than using the dvd players.  There are more options and the prime movies/ tv are great additions to having in addition to Netflix.", "verified": true, "helpfulness": "0/0", "author": "R. Miller"}, {"rating": 4.0, "review": "The Firestick works great and streams the video signals really well. The Amazon content in particular loads very fast. The SlingTV app is a little clunky and is not programmed intuitively like the Amazon content. The controller is good but the click wheel at the top is too sensitive and often overshoots the targeted selection. Overall it has been a good purchase, though.", "verified": true, "helpfulness": "1/1", "author": "Chris Mason"}, {"rating": 1.0, "review": "Unable to use,will need to call. I have scenes but  no sound!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'd love to say it's great, because it probably is.  I'd  love to use it, but my Verizon connection is too slow. It was easy to hookup and everything worked fine until I choose a movie to watch. After a long \"buffering\" time, I got a note on screen that said my internet speed was too slow. I have Verizon Fios at 50Mbps, but my real ping time is 23-27Mbps. I wonder what speed the Stick requires? hmmm. Didn't check that before i bought it.", "verified": true, "helpfulness": "0/0", "author": "Rudy"}, {"rating": 5.0, "review": "I absolutely love my fire stick. It's more than I could've hoped for.", "verified": true, "helpfulness": "0/0", "author": "Ben Trautlein"}, {"rating": 5.0, "review": "excellent product a lot of power for such a small stick will  recommend. strong wifi connection with dual band. excellent HD reception very high quality amazon knows exactly what it's doing strong competitor to any stick or Android tv box.  remote control is efficient and very responsive.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Amazn!!Once you get the hang of it!!", "verified": true, "helpfulness": "0/0", "author": "Beatrice Guzman"}, {"rating": 1.0, "review": "Unfortunately,  I just cant stand the fact that it will constantly stop the playback, specially on Amazon Prime video saying my Internet Connection is too slow.... The router is giving me a 30MB of download speed, I have the router very close to the device and stop any other device connection, after 90 minutes of streaming it will stop... Then I have to restart the device or unplug it to have it back streaming... Very very slow also streaming music! In short, unusable! I'm really sorry about that because I'm very happy with amazon in general and their other devices. Tried the forums and technical support with no luck.", "verified": true, "helpfulness": "2/2", "author": "Jose A. Hernandez"}, {"rating": 4.0, "review": "Easy to access, plenty to watch.", "verified": true, "helpfulness": "0/0", "author": "Gary Johnson"}]