[{"rating": 1.0, "review": "I got this for streaming Sling TV . And it is piece of junk. Keeps disconnecting.", "verified": true, "helpfulness": "0/0", "author": "Rajeev"}, {"rating": 5.0, "review": "Let's your TV do anything entertaining you'd use your laptop for. Netflix, prime video, and really like showing a group of people YouTube videos.", "verified": true, "helpfulness": "0/0", "author": "Kevin Wulff"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ken Taylor"}, {"rating": 5.0, "review": "Inexpensive, free 2-day shipping, super user-friendly, awesome so far!  I use it to stream Netflix & Prime videos/music instead of having cable. Perfect choice for us!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 4.0, "review": "The Fire Stick met my expectations and more. I had a Net Gear that was very weak and did not work very well. The Fire Stick is awesome. Only issue I have is not being able to use some apps unless I have Amazon Prime which I find is not a good value as well because of all the things you have to continue to pay for in order to use and view.", "verified": true, "helpfulness": "0/0", "author": "Michboater"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 4.0, "review": "I have both a Chromecast and Fire TV stick, and I honestly prefer my Chromecast over the Fire Stick.  Chromecast has a much more intuitive and integrated user interface, which allows me to launch from in the apps themselves and not Amazon's Fire TV app.  I don't care for the Fire TV app, it is clunky and hard to use (do I swipe left to right or right to left to make the selection move right???).  The little track pad in the Fire TV app would be much better as a D-Pad instead.  Then I could just arrow up and down, left and right as many \"clicks\" as I want.  I guess, let me pick if I want the touchpad or the d-pad.  Give me the d-pad option and I'd rate it 4.5 stars.One big advantage of the Fire Stick over Chromecast: Prime Instant Video (90% of the reason I got the Fire Stick).Both work great, just wish Amazon didn't force me to use their app to watch videos or do anything else.", "verified": true, "helpfulness": "0/0", "author": "Adam KM"}, {"rating": 5.0, "review": "Works great! I love that I can watch Amazon Instant Video, YouTube, Netflix, Flixster, and more on our tv--instead of on the iPad. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Shannon Hunsberger"}, {"rating": 5.0, "review": "With the Fire TV Stick and Roku the cable and Netflix ties will be history.", "verified": true, "helpfulness": "0/0", "author": "moc"}, {"rating": 5.0, "review": "This is a great product and much better than others that require a computer hookup. No issues so far. Hookup was easy and it is speedy over my internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]