[{"rating": 5.0, "review": "What the heck? This thing works just as good as my Fire TV box, but it doesn't take up any space on the shelf. I just wish I had caught them when they were on sale for $19. Still, at $35, the Fire TV Stick is a bargain, and it functions much better than the two Roku devices we've had. I'm thinking of buying another one for the other bedroom as well. Definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works great!!... Good but at $29.Great buy at $19! Regifting Google Chromecast....since Miracast works on Fire Stick, no need for Chromecast...", "verified": true, "helpfulness": "0/0", "author": "Ken Wilson"}, {"rating": 4.0, "review": "Takes a LOT of data! We have to pay per data use and it sucks all of our data within 2 days!", "verified": true, "helpfulness": "0/0", "author": "BaseballMom"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Denise  Caserotti"}, {"rating": 1.0, "review": "Piece of junk.  Will not connect to my internet for more than a few minutes, then get \"connected with problems\". Did last update (finally) but did not help.  My internet is fine - everything else in my house (and in the room) has a great connection.  Amazon customer service has been horrible - my third phone call (to India I'm guessing) is extremely frustrating.  They promised me a replacement but it never came.  On the phone with them again.  Another frustrating phone call.  I'm pretty much ready to throw this out and call it a day...", "verified": true, "helpfulness": "3/5", "author": "swv"}, {"rating": 5.0, "review": "I love the stick!", "verified": true, "helpfulness": "0/0", "author": "MAURICE LA MONS"}, {"rating": 4.0, "review": "Got it in Staples Monday before Thankgiving for 24.00 love it worth every penny.", "verified": true, "helpfulness": "0/0", "author": "E. Armenia"}, {"rating": 5.0, "review": "Like it great product and price", "verified": true, "helpfulness": "0/0", "author": "JPO"}, {"rating": 5.0, "review": "This is great little device, and I was one of lucky few who ordered it when it was out for $20 promo. I hooked this up today, and it was working great in 5 minutes. It may not have all the bells and whistles as the Fire TV, but it still packs a punch. I would recommend this to anyone who wants a small portable device to take with them anywhere. You don't even have to have an extra outlet for it as it can plug into both you TV or and outlet. Amazon recommends using the outlet, so I would go with that option first and foremost, but if need be, it can plug right into your TV for power. The remote is great, and I don't even miss the voice feature as I don't use it much on my Fire TV much anyway. Setup was easy as pie, and my boys love it. I bought it for their room and for taking with us when we go camping. They really like it for not just the video streaming but for the gaming. It does not support all the games that Fire TV does, but they do have enough to keep my boys happy. Who needs a gamebox anymore, when their more than enough mobile games out there. I would not even think about buying a gamebox ever again. At the current price, I still think this is well worth it, just as the Fire TV is. They are better than other device I have used in the past, and because they are sold by Amazon, you get the great customer service I have come to enjoy over the years.", "verified": true, "helpfulness": "0/0", "author": "James Bennett \"Second star to the right, and straight on till morning\""}, {"rating": 4.0, "review": "Perfect replacement for a smart tv. Since, it uses wifi takes a while before the picture quality gets better. Other than that comes with loads of appsand easy to install any Android apk", "verified": true, "helpfulness": "0/0", "author": "Sudhir"}]