[{"rating": 5.0, "review": "Such a great idea!", "verified": true, "helpfulness": "0/0", "author": "Mpaige"}, {"rating": 3.0, "review": "Buffers a lot on movies even with a strong WiFi signal. Very restricted choice of movies.", "verified": true, "helpfulness": "0/0", "author": "Dave Larson"}, {"rating": 3.0, "review": "Great unit with fair performance.  It would be better if it had a USB port. Also The voice command feature  should work with any video application not only Amazon. Example you cannot voice command  a video search in YouTube.", "verified": true, "helpfulness": "0/0", "author": "ELMER GUEVARA"}, {"rating": 5.0, "review": "This was a great purchase. Works very well and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Edgardo Rivera"}, {"rating": 5.0, "review": "Heard about the Fire TV Stick, decided to order one. I am so glad that I did, we are enjoying it very much.My order also was sent out quickly. Thank You.", "verified": true, "helpfulness": "0/0", "author": "Katherine Baltierra"}, {"rating": 5.0, "review": "I have the larger FireTV as well and love both.", "verified": true, "helpfulness": "0/0", "author": "Sarah Catherine"}, {"rating": 5.0, "review": "Up and running immediately.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Runs slow. Lags.", "verified": true, "helpfulness": "0/0", "author": "Emily Lee"}, {"rating": 5.0, "review": "Best streaming device on the market and certainly beats the competitor.There are folks that give this device one start, possibly because they don't know the potential of this unit.  I've had a couple of this and also the FireTV (original) since it came out.  I have since sideloaded SPMC or Kodi in each of the devices throughout my house.  Since owning these devices, I have already saved at least thousands of dollars from paying cable/satellite monthly bill.  I suggest that if you are going to buy this, watch some YouTube videos on how to sideload SPMC or Kodi so you can unleash the potential of the device.  There are other streaming devices out there that can stream Hulu, NetFlix, HBO, and others, but if you are unfamiliar w/ XBMC and Android, then this device isn't for you.  This unit is based on Android OS which means anything you can find on Google PlayStore can potentially be installed on this device.In any case, I take this device with me when I travel cause I can easily hook it up to hotel's WiFi and if the ports are open, then I can stream my favorite movies or shows.  Even my now 5 year old nephew can operate the remote and navigate around the SPMC/Kodi interface and watch his favorite shows for free and on-demand.  Do your research before you return this device because I can tell you that other similar units in the market can't match the capability of this unit.  I've own RPI, Apple TV, custom HTPC, and others, and this is by far my favorite.  If you have and iOS/Android device, after installing SPMC/Kodi -- load a Kodi remote and control SPMC/Kodi using your smart device.I'm hoping the next release will have better hardware specs and larger storage capacity.", "verified": true, "helpfulness": "1/1", "author": "Y. Velazco \"flip phinoi\""}, {"rating": 1.0, "review": "Purchased for $70 at best buy and all it did was over heat and reboot. Never worked and getting any assistance was a joke. Now I own 4 Roku players and have never had a problem. Save yourself some hassle and do the same.", "verified": true, "helpfulness": "0/0", "author": "Angie Peterson"}]