[{"rating": 5.0, "review": "I love this gadget! The setup is super easy and the ease of use with the remote is great. I have a chromecast for another TV and this trumps it! The Fire Stick enables the user to control the apps on the tv and not through your phone like the chromecast. We've had issues with the chromecast and connectivity, not with the Fire Stick. This was an excellent purchase! Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "C. Smith \"iPhoneCynthia\""}, {"rating": 5.0, "review": "My wonderful son and his family gave me a Fire TV Stick for Father`s Day this year.As someone who already owns a Roku Streaming Stick,I must say that the Amazon device is superior in every discernable aspect.In ease of use,response from its remote,programming selection,in every way......the Amazon Stick is superior.", "verified": true, "helpfulness": "0/0", "author": "Gilbert L. Jones \"Movie Guy\""}, {"rating": 5.0, "review": "Just got the Fire Stick this week and I have to say it was easy to set up in a short time and I was playing Netflix movies on my living room HDTV from a router in my bedroom, flawlessly. I do have a high speed cable internet connection (55 mbps). There has been no buffering during the movies. I have not tried it yet with any other applications. I got it mainly to use with Netflix. It takes a little time to get used to the remote to navigate but it's not difficult. I tried to download the Fire Stick app to be used as a voice search app on my cell phone but it hasn't worked well. That is a separate issue though that has nothing to do with this product. It's typing in the search info onscreen that I was trying to avoid each time I wanted to find a movie title. They do make a voice remote for an additional cost. I could not find a way to manually turn off the device, but I assume that it will shut itself off  when it's in the home mode for an additional period of time. Since I change inputs on the TV to watch DirecTV, it may not matter whether the Fire Stick remains on or not. When you go back to the Fire Stick input (HDMI2) you have to touch the remote to get it to wake up. Since I only have one cable modem for the Internet, it's nice to be able to use this product and a router to get Netflix and other apps to my living room HDTV.", "verified": true, "helpfulness": "0/0", "author": "DBHGADAWG"}, {"rating": 3.0, "review": "Love the product. But I don't like how I got pulled into purchasing a amazon prime account. Was trying to do the free 30 day trial ended up paying for a year.", "verified": true, "helpfulness": "0/1", "author": "javier flores"}, {"rating": 5.0, "review": "Great product. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Jorge Lopez"}, {"rating": 2.0, "review": "I have had nothing but problem after problem,,,have spent HOURS with their tech support in Manila", "verified": true, "helpfulness": "0/1", "author": "James l"}, {"rating": 3.0, "review": "I have a Roku and this.  The Roku is far better.  Much easier to use than this is.  This is very slow to respond and tonight it has stopped working completely and it is seldom used so should not have gone out this soon.", "verified": true, "helpfulness": "0/0", "author": "zzz"}, {"rating": 5.0, "review": "With summer reruns everywhere it is so nice to sit down and watch a great movie. And no commercials!!", "verified": true, "helpfulness": "0/0", "author": "Brandi Benson"}, {"rating": 4.0, "review": "Had some issues connecting to my router in the same room as the router.  moved Fire TV Stick to another room away from the router and it works great.", "verified": true, "helpfulness": "0/0", "author": "jeremy gibson"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Nicole A Ransom"}]