[{"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "tinkbelle"}, {"rating": 1.0, "review": "Slow in Performance.", "verified": true, "helpfulness": "1/1", "author": "Abhishek Patel"}, {"rating": 4.0, "review": "is very nice thank you", "verified": true, "helpfulness": "0/0", "author": "Joao Garcia"}, {"rating": 4.0, "review": "Headline says it all. The Fire TV box is better than the stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So simple and so great!", "verified": true, "helpfulness": "0/0", "author": "ggmarie"}, {"rating": 5.0, "review": "I love it, it is so convenient.", "verified": true, "helpfulness": "0/0", "author": "Rasean Clayton"}, {"rating": 5.0, "review": "Great interface, they finally added HBO GO so it stands alone as a great streaming device. Got it for 19, well worth it.", "verified": true, "helpfulness": "0/0", "author": "Joseph Sardashti"}, {"rating": 4.0, "review": "Installed myself.  Was pretty easy.  So far I'm enjoying the shows through the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Pam Bayer"}, {"rating": 2.0, "review": "This device has been a blessing and a curse over the short time we've owned it. I pre-ordered one as soon as the introductory price was advertised ($20 for Prime Members) and received it shortly after they were released due to the delay, and immediately set it up, and started using netflix & hulu. Unfortunately from the start there was a problem with the device cutting out, and lagging, then the entire screen would turn gray and take 30 seconds or so to catch up and fix itself. The Fire TV Stick has since released an update to fix this, BUT now instead of cutting to gray, the entire screen stops any movement while the show's audio keeps playing, then it quickly speeds through all the video you've missed until it catches up to where it should be. This skipping/lagging/cutting out makes this device entirely worthless to us since we can't even watch the shows we bought it for; we miss a good 5 minutes of every 20 minute show.. Occasionally restarting the device with alleviate the issue for a short time, but the problem always returns, and the device ALWAYS runs incredibly hot compared to devices like the Chromecast or Roku.. We have never experienced any of these issues using the \"inferior\" chromecast, and we will be switching back in the near future if these problems are not addressed.. Hopefully we just received a dud and none of you experience these issues as well..", "verified": true, "helpfulness": "1/1", "author": "Ian M."}, {"rating": 5.0, "review": "Works great, easy to use. Sure beats paying for cable.", "verified": true, "helpfulness": "0/0", "author": "Richard Winters"}]