[{"rating": 4.0, "review": "I like the fire stick but what you don't see or they tell you is, there is a wire to connect to the stick. I brought it because I like the fact there were no wires..Not True..I do like having the remote.", "verified": true, "helpfulness": "2/2", "author": "Sheriery Phoenix"}, {"rating": 5.0, "review": "WOW! Is this Fire Stick F-A-S-T !! Am really impressed after using ChromeCast dongle and a small computer hooked to TV ... easy to use, easy to hook-up and because we have good internet speed - buffering is quick and POOF! done ... am also impressed with the content offered with my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "flbmwgirl \"flbmwgirlr1100rt\""}, {"rating": 5.0, "review": "Very very cool", "verified": true, "helpfulness": "0/0", "author": "tina"}, {"rating": 5.0, "review": "Very cool.  Exceptionally easy to install. Pictures were perfectly clear.  I wish I had purchased this earlier.  Really enjoy watching my prime movies on the wide screen.", "verified": true, "helpfulness": "0/0", "author": "kathryn hill"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lib"}, {"rating": 3.0, "review": "The mobile app is not user friendly and I hate that 3rd party apps aren't integrated. I don't want to have to search for HBO go and Netflix amongst the millions of flappy birds and bowling games my kids download.", "verified": true, "helpfulness": "0/0", "author": "Anne Kenny"}, {"rating": 4.0, "review": "I really want to love this thing. And I kind of do. No I really do. BUT it freezes randomly dropping frames while playing back video periodically. Mostly in other apps and not in it's native Amazon Prime player. Netflix suffers the most I think. I can't stand dropped frames. My chromcast by comparison NEVER drops frames. I mean never. I've never seen it ever happen. My network will stop the stream or cut off sometimes but it's never dropped frames or froze. With the Fire Stick It's kind of like when flash player on your computer gets over loaded and needs to catch up, or your memory has issues. I'm positive it's not the network as it's solid most of the time where as the Firestick simply just lags. Like I said more like when you're using flash on a computer.", "verified": true, "helpfulness": "0/0", "author": "James Brown"}, {"rating": 5.0, "review": "Awesome. Only if my iPad or iPhone synced!", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "dean hoffman"}, {"rating": 5.0, "review": "Can finally watch prime TV, and with our TV, did not need any additional equipment to use right away.", "verified": true, "helpfulness": "0/0", "author": "Kelly M. Payne"}]