[{"rating": 5.0, "review": "Easy installation. I loved the fact that it was allready tied to my account.", "verified": true, "helpfulness": "0/0", "author": "Veljko T."}, {"rating": 3.0, "review": "description was not thorough enough for me to know for sure what the product could and could not do, bought it only to realize it offers the exact same things I already have", "verified": true, "helpfulness": "0/1", "author": "Sharon \"Book Addict\""}, {"rating": 5.0, "review": "I love this service. It makes utilizing my prime membership extremely easy for watching videos, yet still has Netflix easily accessible as well. I love that I can download games if I chose to, and it has apps for exercising, music, weather, and other free movie and TV apps. I haven't had any issues with it at all, and we've been using it for over a month. I prefer this over a gaming systems interface.", "verified": true, "helpfulness": "0/0", "author": "amberbaker"}, {"rating": 5.0, "review": "I always appreciate when something works right out of the box!  I will likely buy another one for my other TV.  One thing to note: the stick requires AC power which is not shown in any of the ads or photos.  That should not be a problem since your TV needs power too or has a USB port.", "verified": true, "helpfulness": "0/0", "author": "Thomas S Cull"}, {"rating": 5.0, "review": "I like it.  Thinking about getting more!", "verified": true, "helpfulness": "0/0", "author": "kcheks"}, {"rating": 5.0, "review": "Love the Fire Stick.  It was easy to set up.  I used my prime to watch movies and TV shows.  There are no issues with bandwith.  The picture quality is excellent.  I would buy again when for a second TV.", "verified": true, "helpfulness": "0/0", "author": "Hillstreet99 \"hillstreet\""}, {"rating": 3.0, "review": "Let's just get this out of the way. This device is cheap. I got it for even cheaper at $19. So I didn't expect it to perform as well as its bigger brother, the Fire TV player. However, it still managed to disappoint.Here's what I like about it:1. It's cheap.2. It's a stand-alone device, unlike the Chromecast. Comes with a remote so you can just set it up once (for your parents) and be done with it.3. Supports 5ghz Wifi. This is great for Plex and streaming high-bitrate videos, which is basically what I use it for. So yeah, works great!4. Supports most major streaming apps like Netflix, Hulu, WatchESPN, Pandora etc.5. You can sideload even more apps and games on it, relatively easily.6. Looks nicer than the Chromecast.7. Amazon Prime Videos!Here's what I absolutely hate about it:-1. It's so sloooow. You get what you pay for.-2. The interface. I hate it. Not confusing, but so much unnecessary crap on screen. Can't I just hide whatever I don't want to see? Why isn't there a FAV section?-3. The remote feels cheap. Is cheap. You can buy the better one that comes with the Fire TV, but then might as well buy the player.-4. Smartphone remote app works half the time, if it loads.-5. USB (power) port is on the side. Who made this stupid decision??? If your TV is like mine, it'll have HDMI ports right next to each other. I had to rearrange my devices just so I can plug in the USB cable.-6. No HBO Go, for now.Conclusion? Buy this if it's on sale. Otherwise, go with a Roku (if you need standalone) or Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Linh Nguyen"}, {"rating": 3.0, "review": "I was anxious to receive my Firestick, love being able to watch Prime movies, Netflix etc.I dislike having to put the pin on every time you switch movies.", "verified": true, "helpfulness": "0/0", "author": "Brenda Bullock-mccollough"}, {"rating": 5.0, "review": "Very easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Phyllis"}, {"rating": 4.0, "review": "to early to tell if I like it will post a review later", "verified": true, "helpfulness": "0/1", "author": "walter"}]