[{"rating": 5.0, "review": "Excellent !!! love this FireTV stickjust installed it and already watching great shows.!gonna get the game controll nextThank youAmazon !!!!", "verified": true, "helpfulness": "1/1", "author": "Donna"}, {"rating": 4.0, "review": "Better than I expected.  Enjoying my Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Pamela Smith"}, {"rating": 5.0, "review": "Does what it says. Slower than the fire TV.", "verified": true, "helpfulness": "0/0", "author": "tamyk14"}, {"rating": 5.0, "review": "Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 2.0, "review": "Had some trouble installing it. It worked the first time but have not been able to get back into it .", "verified": true, "helpfulness": "1/1", "author": "Fred Littenberg"}, {"rating": 1.0, "review": "The FireTV stick was simple to set up, so I was optimistic, but once I tried to actually use it my experience went downhill rapidly.It took three updates for it to remember my wifi password, the controller sometimes lagged and was sometimes hyper-sensitive (a problem compounded by its insistence on using an Apple-copied round control instead of a cross-control).  I was able to log into Netflix, but unable to watch content.  Ditto for Amazon Prime video.  I would've tried an app, but it only supports Android, so none of my Windows Phones or devices can be used.Twice the lag got so bad that I unplugged it to reboot it because it simply became unresponsive (almost like Windows Media Center back in the Windows Vista days).  Finally I just gave up, unplugged it, and returned it.  It was a good first try, but the FireTV stick is not ready for prime-time.", "verified": true, "helpfulness": "1/1", "author": "Rich"}, {"rating": 5.0, "review": "Unlike the chrome-cast, this worked the first time I plugged it in. Simply entered wifi info, and entered Amazon account info. Done.", "verified": true, "helpfulness": "0/0", "author": "Yael B. Rootberg"}, {"rating": 5.0, "review": "Extremely responsive, content loaded, convenient, and powerful device in small form factor. Would be great if application store would provide Sky news and more news channels. Download and installation is quick, picture quality is awesome and the fact that users can play games seals the deal.", "verified": true, "helpfulness": "0/0", "author": "SL"}, {"rating": 5.0, "review": "So easy to install and as an Amazon Prime member I have access to tons of content like movies, tv shows, music for free. This has been a nice feature for my children as well!", "verified": true, "helpfulness": "0/0", "author": "Green28"}, {"rating": 4.0, "review": "Had this product for a few days now, I also own the fire tv, but wanted movies and music on another screen in the house and couldn't pass up the 20 stick. I will say it is much better than chrome cast for me personally, my only gripe so far has been that tv shows sometimes buffer right in the middle of a show. Otherwise if you just want a cheap stick that can do a little more than just movies this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Justin Reto \"Justin R\""}]