[{"rating": 5.0, "review": "Great does exactly what I expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast setup  connected to network with no problems wish there were more apps.", "verified": true, "helpfulness": "0/0", "author": "tomb1013"}, {"rating": 5.0, "review": "Faster than my apple tv, great buy specialy if you have Prime.", "verified": true, "helpfulness": "0/0", "author": "Gleasca"}, {"rating": 4.0, "review": "A good start; now make it better.", "verified": true, "helpfulness": "0/0", "author": "Gary Thomas"}, {"rating": 1.0, "review": "Will not complete the initial software update, rendering it useless", "verified": true, "helpfulness": "1/1", "author": "Adam M."}, {"rating": 4.0, "review": "Faster than many of its competitors.. I like how responsive the functions are on the remote.Played a few games and they load and run without any problems.The video/music is limited to the content on amazon and looking forward to see if they open up casting web-video or media on network drives. Waiting for the IOS-app to try out the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "SK"}, {"rating": 5.0, "review": "I've only used TiVO thus far, but trying to stream Amazon movies from my Romio box looks like crap compared to streaming my Netflix movies. I got this stick on a whim because the price seemed reasonable and I was curious about how these HDMI stick devices worked. I was pleasantly surprised with the ease of set up. The interface reminds me of the Netflix interface and is easy to navigate. The picture quality is very good, as I had hoped. I had one glitch where it lost wifi connection in the middle of my test movie watching, but after checking my connections, it went back to working just fine.", "verified": true, "helpfulness": "0/0", "author": "Gwen Golub"}, {"rating": 5.0, "review": "Great for taking on trips. Same quality as  the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Gloria Reveron"}, {"rating": 1.0, "review": "I purchased this on special for $19 and in comparison to the Roku 3, I much prefer the Roku 3.  The device was time consuming to set up, had to reset it several times, then had to watch the built in cartoon character about how to use the simple device.  It took about 45 minutes to install and update the software.  Once, I had it working, it then stopped working and I had to reboot it again.  Finally it is working and the video quality is different from the Roku 3.  The Fire Stick video image is softer and more muted in color and takes some getting use to.  Again, the Roku seems faster to upload video and the video quality on the Roku 3 seems more suited to my tastes.Ok bought another one as replacement and it was worse than the first.  Don't waste your time on this device.", "verified": true, "helpfulness": "2/2", "author": "Sailor"}, {"rating": 5.0, "review": "Best thing since sliced bread! I use it ALL the time!", "verified": true, "helpfulness": "0/0", "author": "Andrew Fraczak"}]