[{"rating": 5.0, "review": "Makes any Plain Jane HDTV the smartest TV in the house. Super easy to install. Huge amount of added Movie and TV content - especially if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Nicholas C. Belmonte"}, {"rating": 5.0, "review": "We love, love, love the Stick.  It was super easy to set up on our tv and we use it almost daily.  The good thing is that it can be moved from one tv to another or take it with you when you travel.  Jan Lohman", "verified": true, "helpfulness": "0/0", "author": "Jan Lohman"}, {"rating": 5.0, "review": "We are enjoying the fire stick very much!", "verified": true, "helpfulness": "0/0", "author": "Michele Macleod"}, {"rating": 5.0, "review": "Bought this specifically to play Netflix, once I figured out I needed to link one click pay to get Netflix all was good.  The quality of the picture and wireless signal reception are excellent.", "verified": true, "helpfulness": "0/0", "author": "George Massey"}, {"rating": 5.0, "review": "My chromecast quit working so I got the fire stick, and I love it. It works awesome, and is so much better than chromecast. You don't have to sync it to a phone or computer for it to work, just plug it in and go.", "verified": true, "helpfulness": "0/0", "author": "wantdd214"}, {"rating": 5.0, "review": "Oh my! I have had my Fire Stick for a two days now and I'm in love!  Absolutely amazing. Speed is great, no lagging. Apps are amazing. Love my choice in movies.  I have Netflix so I use that but more than anything I use my amazon prime now.  The free movies  on there seems to be a better selection. I am impressed with all the options for kids.  I have 4 and this has been more fun for them than myself I believe.  They play games,  and there are plenty of free educational apps that are just outstanding, watch movies, and watch some of their favorite TV shows from their favorite channels. Again, most all of these are completely free with a prime membership. I enjoy having my music, photos, apps, YouTube, and Pandora  in my tv. Seriously,  this is a win all the way around. And for the price... you just can't beat it.  The remote is easy to use. It was extremely easy to set up and install.  Nothing in the least bit complicated about it.  I am an avid online shopper and this is my most favorite purchase this year by far!", "verified": true, "helpfulness": "0/0", "author": "Desirae Bennett"}, {"rating": 5.0, "review": "Great little piece of hardware!  It runs much faster than my Chrome-cast and has more storage space for apps.  It is much more flexible than Chrome-cast.  Apps are built into it, so I don't have to case WatchESPN from my phone or tablet it's already on there.  The number of apps to choose from is great as well.  I am very impressed with it.  I had a little trouble initially to get it to recognize my WiFi.  I re-started my router, and it picked it up immediately.  Other than that the initial set up was very easy and quick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it, my kids can watch neflix on her big tv", "verified": true, "helpfulness": "0/0", "author": "kieutien tonnu"}, {"rating": 5.0, "review": "Has everything I wanted. Now I hope Amazon gets a deal with HBO & Showtime to set up accounts without the cable companies being middle men.", "verified": true, "helpfulness": "0/0", "author": "J. H. Gordon"}, {"rating": 5.0, "review": "AAAAAAAAAA+++++++++", "verified": true, "helpfulness": "0/0", "author": "Raymon M Singler"}]