[{"rating": 2.0, "review": "You have to plug in the stick to the wall outlet.The electric cord is never shown in the ads.I thought it was running off of the tv power.I do not want one more thing to plug in to the wall!", "verified": true, "helpfulness": "0/2", "author": "M Brooks"}, {"rating": 4.0, "review": "It works and gets several channels, but it doesn't beat the flexibility of my Roku.  I almost returned it, but it was worth keeping as I was able to get it at the discount price. Not bad - I can access my Amazon Prime and Netflix easily.  However, the remote interface is a pain for typing in IDs and passwords, and it has a LOT of trouble mirroring my Amazon Kindle HDX (my Roku does this easily).", "verified": true, "helpfulness": "3/5", "author": "S. Suarez"}, {"rating": 5.0, "review": "I am doing a lot of research for cutting the cord. I own 2 Apple TV's, a Roku 2, a Samsung Smart TV, and a Western Digital WD TV. I just bought a Google Chromecast this week and received my new Amazon Fire Stick today (I ordered it on a whim back in October for $19.95 on a Prime Special Offer). I must say that the Fire Stick was the best installation yet. It started with a video and then went to the setup. Boy, was it easy. The Apple TV was also very easy (I'm a Mac person from way back, so I appreciate most things Apple). If Apple and Amazon merged, they would own the world. They both seem to be stressing ease of use. I was unable to get the Google Chromecast Roku App to work with my Apple Routers, but it finally connected with my Comcast wireless router. When I tried to do HuluPlus playback, it was terrible. Not watchable in any way because of the constant pause for downloading. I have Comcast with 50Mb+ download speeds, so that was not the problem. I use my Apple TV and my Samsung Smart TV to stream video with no glitches. I feel the problem was probably with the Roku 2, which is several years old. I gave up and never tried to get it to work using my iPhone as a remote. I may try again later before I return it. The Fire Stick has it's own remote and works flawlessly. I give it 5 stars and would recommend it to anyone (if you have Apple TV, you can't stream Amazon or vice versa, so you should get both).I have added HuluPlus, Netflix, Vevo and several other apps and they work fine. I may update this after a few weeks of use.", "verified": true, "helpfulness": "3/3", "author": "Jim Melton"}, {"rating": 5.0, "review": "I ordered this on the special for $19.99 - expected delivery was January, it arrived today! Superb!Setup - VERY simple - plug into the wall, plug into the TV, batteries into the remote and follow the instructions.Connect to the wifi and off you go!Very nice introductory video starts playing right away - great resolution and easy instructionsIf you are familiar with Apple TV - this will make a lot of sense - the remote is FAR more user friendly and not a lot larger than the apple TV remote.Content - AWESOME - as a Prime member, there is a HUGE amount of content both audio and video available for no extra cost. Truly impressive!Easy interface, simple watchlist setup, what more could you want?I am VERY impressed - even at the current price a steal! Get this!", "verified": true, "helpfulness": "1/1", "author": "James Ridgway"}, {"rating": 5.0, "review": "What's not to like? It is geared for amazon use.", "verified": true, "helpfulness": "0/0", "author": "Lisa Kennedy \"lovin'Circ\""}, {"rating": 5.0, "review": "This is the beast streaming device I've ever had!  It is a must if you are an amazon prime member.... And if you're not am amazon prime member, you should be!  It the BEST THING EVER.  Back to the device-- Shipped a lot earlier than expected, had everything set up in about 2 minutes, and we were streaming :).  Buying more for gifts for my other prime friends as we speak.", "verified": true, "helpfulness": "0/0", "author": "Jessicam621"}, {"rating": 1.0, "review": "Not really much to offer even with having Prime account. What a waste.", "verified": true, "helpfulness": "0/3", "author": "James Mitchell"}, {"rating": 5.0, "review": "Works well. can't wait for IOS App for remote with voice", "verified": true, "helpfulness": "0/0", "author": "christopher cioffi"}, {"rating": 5.0, "review": "I just got my Fire TV Stick today. It was hooked up and ready to go in less than 15 minutes and I am no geek. The selection of movies and TV on Prime is great and I can even get Netflix. This is an amazing piece of technology. The only slightly annoying part s that I only have one plug in on my tv so I have to disconnect my cable to use it. But I'll find a way around that I'm sure.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Horton-Newton, Author \"Elizabeth Horton-Newton, Author\""}, {"rating": 5.0, "review": "This product is a definite must if you want something small and easy to control. Most people who want the remote and something that will not take up space while playing their basic needs. This product is a definite must. Unlike the chromecast this is a product all on it's own and it doesn't require a \"cast\" in order to play stuff. It also allows amazon prime videos and netflix. The only complaint I have is the forward and rewind could be a lot better.", "verified": true, "helpfulness": "0/0", "author": "shadez82"}]