[{"rating": 5.0, "review": "Still learning and getting familiar with it, but like it so far. The only problem I have had so far is when using YouTube. It will keep freezing and loading. I don't know if that is an internet issue, or if it's because we have three other devices that use WiFi in our home (Though we have a very strong wireless router) or if it's a YouTube problem, or what. Our Netflix has no loading issues though. But we like the Fire Stick so far.....", "verified": true, "helpfulness": "0/0", "author": "Susan M. Davies"}, {"rating": 5.0, "review": "Love this Fire TV Stick!!!! Got to watch all the Downton Abbey seasons 1-4.", "verified": true, "helpfulness": "0/0", "author": "Mthweatt"}, {"rating": 5.0, "review": "Loads internet much quicker than going through my blu-ray player", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 4.0, "review": "Love with one exception... I wish I could log into more than one prime account, so that my husband could use his play lists etc...", "verified": true, "helpfulness": "0/0", "author": "Dusty Sash-Montgomery"}, {"rating": 3.0, "review": "I am constantly having to reset my firestick. Programs and movies constantly freeze up.", "verified": true, "helpfulness": "0/0", "author": "Terry Petocz"}, {"rating": 5.0, "review": "Excellent video streaming device. Very easy set up.", "verified": true, "helpfulness": "0/0", "author": "Jay-Cee \"J.C.\""}, {"rating": 5.0, "review": "Love the Fire TV Stick!! So much better than the Google Chrome. Much easier to use. Love that it comes with a remote. My mom has a google chromecast and she always has issues with hers. I've never had an issue with my fire TV stick. Format is very simple and set up takes 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Leanne Gefell"}, {"rating": 5.0, "review": "LOVE this...I can move it from room to room....", "verified": true, "helpfulness": "0/0", "author": "cathy gilbert"}, {"rating": 2.0, "review": "Not what I thought it would be.  I think I need a tutor!  Lol", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 4.0, "review": "4.5- really quick on HD, great response, fast, good selection and friendly familiar user interface- easy to use. Would be nice if was cordless- constantly plugged in with a wire is an opportunity. Overall, innovative quality product, will recommend.", "verified": true, "helpfulness": "0/0", "author": "Ms Rosered"}]