[{"rating": 5.0, "review": "Very good alternative to the chrome which is more expensive. I recommend this cheap piece of technology to anyone who needs their streaming shows anywhere in the house. I watch and listen to series while relaxing in my shop between buildd kit cars", "verified": true, "helpfulness": "0/0", "author": "Josiah Moering"}, {"rating": 5.0, "review": "We have been limping along watching Amazon Prime and Netflix via an older BluRay device that is just not sufficiently speedy to do a good job.  Frequently it would hang up about 20 minutes into a movie and make the movie impossible to watch.  Our other choice was to watch a non-HD video via our Wii, but that was a little irritating on a 60-inch TV.  We have had this since Christmas, and it is very fast, easy to install, easy to program according to your likes and preferences.  Every movie has been in gorgeous HD, it plays without any pauses, and we love it.  (Bought it on a two-for-one deal when it first came out, so the bedroom TV gets it too!", "verified": true, "helpfulness": "0/0", "author": "knittygirl52"}, {"rating": 2.0, "review": "I have been unable to use on my Samsung TV.  \"Not Supported Mode\".  It does work however on my downstairs TV (VISIO) but I believe my internet speed is not adequate for proper viewing.  Amazon Prime was also disappointing with TV/Movies available free of charge.I can see how some would love this and some would hate it.", "verified": true, "helpfulness": "0/0", "author": "Casual Shopper \"Jackie\""}, {"rating": 5.0, "review": "Very happy that when it turns off it is off and not that floating screensaver on the screen. The screen is blank until you turn it back on ,the other product I use to unplug to turn off .Image burn is no longer a concern with my Plasma TV. Fire Stick also has a better quality picture than my old product.  Thanks for a Great Product!!", "verified": true, "helpfulness": "0/0", "author": "Gloria  Barney"}, {"rating": 5.0, "review": "awesome product", "verified": true, "helpfulness": "0/0", "author": "raven webster"}, {"rating": 4.0, "review": "a quality product.  However, I needed to add a signal splitter since my TV only has 1 hdmi port", "verified": true, "helpfulness": "1/1", "author": "John K Bostic"}, {"rating": 5.0, "review": "Very easy to install. Purchased the USB Power cable (separately) bid did not need. So far, so good.", "verified": true, "helpfulness": "0/0", "author": "Herman Bryant"}, {"rating": 5.0, "review": "With Amazon Prime, this is great! Since I don't have a DVR this gives me all the options I could possibly want to watch TV shows that I missed. I'm not a big movie watcher, but when I'm in the mood, it's nice to have tons to pick from. I can also access a shared Netflix account and other movies and shows that others in my family have recorded.", "verified": true, "helpfulness": "0/0", "author": "Susan Burciaga"}, {"rating": 2.0, "review": "It is nice when it wants to connect to my WIFI.  When it fails to connect to my WIFI and also fails to scan for WIFI networks I have to unplug the stick and plug it back in.  This is also the only device that has issues connecting to my WIFI so that means it is not my routers fault.  When this problem happens it fails to scan and see my neighbor's WIFI too which also tells me the problem is with this product and not my router.  Another issue is it sometimes tells me my connection/bandwidth is too slow.  But I can then open my notebook, web to Amazon and start streaming the exact same video without problems.  I thought this would be a great replacement for browsing and streaming Amazon videos since Amazon's web interface for browsing is junk.  I'm glad I only paid $20 otherwise I would return it.", "verified": true, "helpfulness": "4/4", "author": "e.p."}, {"rating": 5.0, "review": "Love it!! :)", "verified": true, "helpfulness": "0/0", "author": "Danni"}]