[{"rating": 5.0, "review": "This item is a great buy!!", "verified": true, "helpfulness": "0/0", "author": "Gabriela M. Baez"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Phil Montgomery"}, {"rating": 4.0, "review": "I wish the remote app was more like the physical remote other than that it's ok.", "verified": true, "helpfulness": "0/0", "author": "Steven A. Harris"}, {"rating": 5.0, "review": "We love it...so many free shows.", "verified": true, "helpfulness": "0/0", "author": "Lynne Forrestal"}, {"rating": 5.0, "review": "Simple to set up and use. An inexpensive access to Amazon Instant Video and Netflix.", "verified": true, "helpfulness": "0/0", "author": "RD101"}, {"rating": 5.0, "review": "I really love this product. It was really easy to setup. I brought 2 of them, one for my tv and one for my kids tv and they love it. It has everything on there to keep you occupied,  my kids love being able to play all those games they have , as well as being able to watch tons of different movies. We love it", "verified": true, "helpfulness": "0/0", "author": "LATISHA"}, {"rating": 5.0, "review": "Incredibly easy to hook up", "verified": true, "helpfulness": "0/0", "author": "Barry A. Barnett \"barryb\""}, {"rating": 4.0, "review": "A purchase that is cheap but comes with powerful uses.  Ease of use is very convenient.  The only reason I didn't give 5 stars is that HDMI is recommended with power use and IPAD app could be little more use - There is nothing to use on the app other than voice command that searches Bing (Not sure why defaults to Bing however, Google, Yahoo would be nice)  .  So I had to locate a terminal.  Overall, ease of using with Amazon Prime and purchase is much easier than my century old Sony BlueRay Player's Amazon app. Browser will make this item fly to the stratosphere.", "verified": true, "helpfulness": "0/0", "author": "ZuluNiner"}, {"rating": 5.0, "review": "My whole family enjoys and uses daily.  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Lesley Olds"}, {"rating": 5.0, "review": "So easy to setup and use. Love it.", "verified": true, "helpfulness": "0/0", "author": "BETTY F BYRD"}]