[{"rating": 5.0, "review": "This is a wonderful device.  I love voice detach and it really does work. It streams movies and tv shows very fast I have had problems with other streaming boxes buffering the problem disappeared with the fire tv plus I also bought the game controller and the grandkids love that they can play some of the games from their kindle fire on the big screen.  I highly recommend and I will be buying more for gifts", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love how easy it was to setup and access.  I especially love the android app that allows you to perform a voice search of your favorite shows.", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 5.0, "review": "I Like It So far, Still Figuring It out", "verified": true, "helpfulness": "0/0", "author": "CHERYL CLAYTON"}, {"rating": 5.0, "review": "I had already purchased the Fire TV and I knew I would enjoy the Fire TV stick, it is very easy to connect and that is so important to me.When the HBO-Go app is added it will really be great.ThanksCindy", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I give this firestick 5 stars. My use is a little different than most, however this stick delivers what it's intended to deliver quite well, the menu although it could benefit from perhaps a little overhaul in organization, is easy enough to use.As far as intended function, the only suggestion i would have is to allow a little menu customization to remove categories, and bring apps from the SETTINGS>manage all apps section to the load screen at least and even better if it could automatically boot to a specified app on startup.Now I specifically, only use this for XBMC/KODI. This is one of the most popular home theater application around, and what makes this little device worth it for me.From the start, this device for use with XBMC i give it 4.5 stars. Losing only half a star for the combination of long menu click wait times (reasonable by all means, but a little longer than i like to see) and sometimes poor video quality on the big screen. See below.I will not walk through the complete install process here, a simple google search with provide tons of methods, but more of a general overview.After initial fire stick set up, you will need an application on your pc \" ADB Utility\" and your choice of Xbmc android builds. I personally love tvmc from tv addons. Preconfigured with the best add ons already in place! Any current instruction that advises you of stopping updates and such from the stick, you're too late. The latest firmware is already installed.After opening the above mentioned application on a computer, follow the directions to install, really really easy.To launch from amazon main dashboard, scroll all the way to settings, down to application, over to manage all applications,  xbmc will be towards the bottom, launch and viola. Your into Xbmc menu. I will assume you can take it from there, otherwise there are a million resources on google, i recommend TVaddons they have great walkthroughs.As mentioned above, The menu time between selection a selection brings up the working hud, a little longer than i would like.Also occasionally hitting say the back arrow on the remote just once will make the xbmc system keypress sound multiple times as it hiccups its way back to the xbmc dashboard.I consider these very manageable quirks, part of using a device for unintended purposes.Lastly, i have found that occasionally some of SD sources, that same source looking fine on my big screen tv through my media pc, look rather pixelated. This may vary greatly from tv to tv and individual circumstances. On my 32\" bedroom tv, most if not all sources look great. So since it is a standard def source stretched out, (kinda like zooming on say a cell phone picture) the  same result is not had from media pc, meaning its just the video processor of the stick, is just not as strong as the pc. Which obviously is to be expected. I use HD sources when possible, with no issues of blocky or pixelated screen. And not all sd sources do it there is a good chance that the source is just that poor of quality. Also another possibility is the codec the stream is encoded in may struggle to be rendered by The stick. Again a small Quirk that isn't often a problem, expected with the unintended purpose of the stick.For those who find it important, the amazon remote has no volume button, and my media center remotes while they do move the xbmc volume slider on screen, it does not actually adjust the volume.Despite the above mentioned quirks, which were to be expected, having come from using chromecast, and a few other attempts,  This amazon fire stick delivered well beyond my expectations for Xbmc/Kodi. And i would recommend it to anyone.You will soon be able to check out the Kodi forums and tv addon forums for a list of android tv devices, how do they all stack up, who sits at the top. Expected to be posted in FEB.If this review helped you , please click on the little link below, so i know i am hitting the things you need to know and that my reviews are helping people. Thanks", "verified": true, "helpfulness": "7/7", "author": "Testblake"}, {"rating": 3.0, "review": "internet connectionis a problem. Tv looses signal. Could be the IPS, but don't know.", "verified": true, "helpfulness": "0/0", "author": "charles dougherty"}, {"rating": 5.0, "review": "Great price easy to install and use. I was watching movies 15 minutes after install", "verified": true, "helpfulness": "0/0", "author": "Dennis Stark"}, {"rating": 4.0, "review": "This works fine, and accomplishes the purpose that I wanted it for, mainly being able to see Amazon streaming content which I wasn't able to do on my other video equipment.  A few concerns however:  I didn't realize that it needed to be plugged in to a power outlet to operate when I ordered it.  Luckily  I had one near to the set that I could use, but this could be a problem for some.  I am happy that the pictures that I have uploaded on the cloud with Amazon Prime are viewable with the stick and was expecting to be able to hear the music that I had on the cloud as well.  For some reason only two albums outs of hundreds that I have uploaded seem to be available for listening with the stick.", "verified": true, "helpfulness": "0/0", "author": "M. Burrows \"mushbigdog\""}, {"rating": 5.0, "review": "Love it.  It's easy to use and even if you DON'T have a good internet, it will take the buffering a few minutes but then it will play just fine.  My in-laws have less than 5mb download speeds and it was working just fine.  It took about 5min to buffer.  I wish the power cable could be longer, but that is my only complaint so far.  I just got, so I will update in a month.", "verified": true, "helpfulness": "1/1", "author": "SantoS"}, {"rating": 5.0, "review": "I use it everyday!", "verified": true, "helpfulness": "0/0", "author": "sarah serio"}]