[{"rating": 5.0, "review": "it's great I love it. had no problems installing it or anything easy as 123.", "verified": true, "helpfulness": "0/0", "author": "nice and easy \"randy\""}, {"rating": 3.0, "review": "It is really a little early in my experience for me to adequately rate Fire TV Stick.However, a few things are noteworthy. For one, installation is fairly simple. Of course, operational ease increases as you get the hang of the remote. It takes a little practice.In addition, the mobility of moving from one television to another in another room is convenient.So far, I am not overly impressed with the various offerings available, especially movies. I like old movies. It seems that those are either not available free with Prime or not available at all.Perhaps the more familiar I become with the unit, the more I may learn to like it in the future.", "verified": true, "helpfulness": "0/0", "author": "Jim Salles \"jimsalles\""}, {"rating": 5.0, "review": "Worked as advertised", "verified": true, "helpfulness": "0/0", "author": "odell"}, {"rating": 5.0, "review": "Works great  we realy like the prime settings it is fast and works better then previous systems Ive tried also it was easy to install but more then the add on TV  suggest  of just pluging it in . very good product.", "verified": true, "helpfulness": "0/0", "author": "Leonard T. Nanna"}, {"rating": 5.0, "review": "Buy this. You won't regret it. It has fundamentally changed my TV habits as much as my first TiVo machine did ten years ago.", "verified": true, "helpfulness": "0/0", "author": "John Kohl \"kohlwpb\""}, {"rating": 5.0, "review": "I love my fire stick I leave it plugged into my TV 24/7 and can switch over easy and fun to use", "verified": true, "helpfulness": "0/0", "author": "lauriejw55"}, {"rating": 5.0, "review": "Very easy to use simple to set up, have not used netflix but fine the firestick changing how we view entertainment", "verified": true, "helpfulness": "0/0", "author": "adpratt"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "So simple even I could use it! Great product to use with Amazon Prime. Highly recommend it for anyone who likes to watch TV a lot!", "verified": true, "helpfulness": "0/0", "author": "Wetzy"}, {"rating": 5.0, "review": "I cannot believe this thing is $39.  So easy to set up, use, and watch things on my TV instead of my laptop.  And, by the way, Transparent is just about the greatest show ever made. Not for the easily offended or uber conservative, but the writing and acting is just incredible.OK, I have also heard people say that the streaming stops and is jittery.  I've watched for at least 7 hours and have not had that happen once.I love love love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Soph"}]