[{"rating": 3.0, "review": "We're most disappointed by the fact that you have to plug in the Fire Stick for it to work.  I guess we didn't notice this because it wasn't in the initial description or we assumed that the stick only needed plugged in for updates.  Instead, it needs to be plugged in ALL THE TIME.  We were just surprised to find that it needed to be plugged into an outlet where other streaming sticks, like the Chromecast don't.  It certainly takes away from the ease of use.  Now, I'm not able to move the stick easily from one TV to the next if I want to hide the wire the same way I hide my other TV cords.  It's just an eyesore.  If it weren't for this, we'd give it 5 stars!", "verified": true, "helpfulness": "1/1", "author": "Jenn"}, {"rating": 5.0, "review": "Can mirror my Samsung s5 screen. Awesome speed compared to Chromecast.Needs to default the YouTube app.", "verified": true, "helpfulness": "0/1", "author": "Ryan A."}, {"rating": 3.0, "review": "It's a fairly decent product.  It freezes every now and again,  but only for a second or two.  I do wish it had a couple of other apps to choose from,  like Vudu.Aside from those two things,  I like it!  :)", "verified": true, "helpfulness": "0/2", "author": "Lana Suggs"}, {"rating": 1.0, "review": "Have to wait a month and a half after ordering/paying for this item when Best Buy sells them for same price...NOW! I am now waiting for no legitimate reason.", "verified": true, "helpfulness": "2/5", "author": "MastyrOfPuppitz \"MastyrOfPuppets\""}, {"rating": 1.0, "review": "HDCP authorization in this device does not work with my TV which has first generation HDMI. However PS3, PS4, Xbox 360, Xbox One, and Chromecast all work with my TV with no problems. In short, if you have an older TV this product may not work for you.", "verified": true, "helpfulness": "2/3", "author": "Ricks Davis"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick provides very good value. Initial set up was easy, although the software update took quite a while. I found that my TV's USB port will supply enough juice to power the stick which was nice since the wall wart provided is a little weirdly shaped and didn't really play nice with the surge protector I was using.  The remote is small but well put together and intuitive. There are a couple of help videos to help you get started but honestly they were not necessary. The video viewing apps (Netflix, Hulu, Amazon, Showtime Anytime, YouTube) that I tried worked very well. If you are a Prime member then the this is the streaming stick for you.  The only drawback of the device is a few missing video apps. First, and most importantly. is HBO Go. While there is a lot of HBO content available thru Prime the lack of current programming and Game of Thrones is disappointing. I believe the lack of HBO Go support will be rectified in the new year. The other app that I would like to see is FX Now, especially since every episode of The Simpsons is now available through that service.  The unit doesn't really power off, there is a screen saver that pops up after a bit (configurable) and then the unit goes to sleep. They device wakes up quickly with push on any of the remote buttons. I can't speak to the game play on the device as that's not why I purchased the unit and haven't tried those apps.  I also haven't tried any casting with the stick but I will soon.  All in all I have not run into any problems and would definitely recommend this to a friend.", "verified": true, "helpfulness": "0/1", "author": "Ray"}, {"rating": 5.0, "review": "greatest thing to have thinking of getting more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Pretty cool, though there aren't a great selection of games and a lot of them are laced with in-app purchases. Also, the video streaming quality doesn't appear to be as good as my other smart devices for some reason. Good investment otherwise though!", "verified": true, "helpfulness": "0/1", "author": "Caleb"}, {"rating": 1.0, "review": "Disappointed....I purchased the TV stick and I was really excited to try it out. I have been using Rok for years and have found nothing to even remotely give the ease of use and dependability of Roku. So hookup for the TV stick was pretty much straight forward. But connecting to the internet was horrible. I tried and tried and then I tired of trying, so I made arrangements to return and get another (thinking surely it was the box, because everything else works that needs the internet, so it couldn't possibly be my network). Well, I got the other one and guess what? After working with it for what seemed like forever, it finally connected to the network...then kicked me out of it. I wasn't able to get it to work to try it. I am envious of those who have tried it and adore it. I love my kindle and would love to be one that loved anything amazon would put their name on, but unfortunately this was a bust for me. Good luck to those that purchase, surely your luck will be better than mine. I do believe in my heart that had it connected and maintained the connection that I would have been happy with it. But I guess I will never ever know.", "verified": false, "helpfulness": "2/3", "author": "Kendra Armprester"}, {"rating": 4.0, "review": "Its a great little device! I wish there were more games available for it that used only the remote but I'm sure that will change with time. Searching through Amazon's music library could be streamlined for better results. The video playback is excellent. If it could cast your screen like the Chromecast can, this device would be top notch.", "verified": true, "helpfulness": "0/1", "author": "Gabe Reed"}]