[{"rating": 5.0, "review": "Watching Amazon video right now with it.", "verified": true, "helpfulness": "0/1", "author": "LB"}, {"rating": 5.0, "review": "Awesome Product. Excellent Wi-Fi! Excellent Picture. Excellent Value $19. Would like to see Amazon.com Home Page and easier way to find Free Media, maybe a separate category!", "verified": true, "helpfulness": "0/0", "author": "JAYSDE"}, {"rating": 4.0, "review": "Love my fire stick", "verified": true, "helpfulness": "0/0", "author": "Scott Durnford"}, {"rating": 1.0, "review": "Outstanding product when it works.  Constantly has problems staying connected to WiFi.  Can only watch it for a couple of hours at a time, and then you have to cycle power yo get it to reconnect.", "verified": true, "helpfulness": "1/2", "author": "david w. cooper"}, {"rating": 5.0, "review": "This thing is considerably better than chromecast.  I recommend getting a prime account though.", "verified": true, "helpfulness": "0/0", "author": "L. Littlejohn"}, {"rating": 5.0, "review": "I was lucky to grab this item at about 1/2 price when Amazon advertised it a few months ago. Well worth the small price. Installed easily, didn't interfere with my Roku device, and works well.  Easy to navigate and offers lots of content.", "verified": true, "helpfulness": "0/0", "author": "Mark in New York"}, {"rating": 5.0, "review": "Like it in comparison to the roku. Definitely a better remote. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "So easy to set up.  I absolutely love it.  So much access to other venues.  Amazon comes thru again.  Navigates easily also.", "verified": true, "helpfulness": "0/0", "author": "stampit6"}, {"rating": 5.0, "review": "I am so glad I bought this. It connected after three tries, mainly because I had password trouble. However, it works just fine. I have been on YouTube and watching that on a full size screen is fabulous. The content available to Prime members is vast. This is a wonderful purchase.", "verified": true, "helpfulness": "0/0", "author": "L. Schad \"lschad\""}, {"rating": 5.0, "review": "I LOVE LOVE LOVE this thing!!!! I was already a Prime member and bought it when it was on special for members. I have to admit it wasn't sent out right away. I think I had a month or more to think about whether I really needed/wanted this thing. I  almost cancelled it on more than one occasion. I had originally purchased it for the bedroom because I have the newest Roku for the living room but the more time that passed the more I thought I really didn't need it and probably wouldn't use it. I was wrong. I like it better than the roku with the only exception being that the Fire TV Stick doesn't carry Acorn TV. I'm hoping they will soon. Amazon if you are reading this please please add Acorn TV ASAP. I know I'm not the only one who watches it. As I said other than that I love it. I didn't buy the voice activated remote because I have a smart phone and downloaded the remote app which does all the same things so I saved money there. The games are better than Roku, the remote is way easier and just overall my whole family enjoys it more. And lets face it for the money how can you beat it. I mean even for the Prime itself it's a deal! We get the music, the movies, the two day shipping which I use the heck out of around Christmas and birthdays (well and way too much all the rest of the year). Amazon as far as I'm concerned goes out of it's way to treat it's customers well in most ways and Fire TV Stick is another great service.", "verified": true, "helpfulness": "3/3", "author": "P. Schuhmacher \"Mom 2 four\""}]