[{"rating": 5.0, "review": "Love this! Just make sure you have a plug in close by and good Wi-Fi!", "verified": true, "helpfulness": "0/0", "author": "Dana Lynn"}, {"rating": 5.0, "review": "Combined with our amazon prime, we really don't have a need to purchase TV services. Everything we need is easily accessible with our Fire TV Stick. It was super easy to set up, and runs great on our high-speed DSL.", "verified": true, "helpfulness": "1/1", "author": "B&P Abrams"}, {"rating": 5.0, "review": "I LOVE IT!!! IT WAS VERY EASY TO SET UP AND USE NOW I CAN ENJOY MY NETFLIX, AD IT ALSO HAS SEVERAL OTHER APPS AND GAMES TO ENJOY!! WORTH EVERY PENNY!!!", "verified": true, "helpfulness": "1/1", "author": "LaShawn"}, {"rating": 5.0, "review": "Low-cost version of the Amazon Fire TV (for most things). The UI is mostly the same as the Fire TV, and the streaming works well.", "verified": true, "helpfulness": "1/1", "author": "J"}, {"rating": 1.0, "review": "While inexpensive the Fire TV stick may still not be worth the hassle. I ordered two and both continuously reboot, buffer, skip, and reset logins. My internet speed is 60 Mbps and both Apple TV and Roku streams work fine. It seems like the Fire TV stick just does not perform as well as more expensive alternatives.", "verified": true, "helpfulness": "0/1", "author": "Jonathan Hyman"}, {"rating": 5.0, "review": "Great product...easy to setup....easy to use", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "I have been debating on buying this for probably a year! I finally bit the bullet when the stick went on sale for $34. I should have bought it a long time ago. I initially hesitated because we have chromecast. This stick is a whole different beast! We love it! We dont touch our chromecast anymore. And it has a remote that is much more responsive then our roku box. I can see buying more as gifts soon", "verified": true, "helpfulness": "2/2", "author": "anthony"}, {"rating": 4.0, "review": "A great, cheap product if you're looking to watch Netflix, Hulu, Twitch, YouTube, or Flixster. I do have issues with it though, and I hope that one can be fixed by a patch or something. The other problem cannot be fixed.After a long period of time, the Fire Stick will start to get a bit hot, but never too noticeably hot. Once this happens, all videos start to lag. I find myself having to unplug it from the outlet and wait a couple of minutes before resuming.The remote is made of cheap material, I think? One issue I have with this is its constant moving. Whenever I'm browsing through videos on YouTube, the remote goes out of whack and passes through pages upon pages of videos, making me re-track my steps. Very annoying!", "verified": true, "helpfulness": "0/0", "author": "Rykr"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "larry iest"}, {"rating": 3.0, "review": "Love the concept! Unfortunately, even with a strong wifi connection, it buffers far too often. I couldn't even make it through a 20 minute show :(", "verified": true, "helpfulness": "0/0", "author": "Jennifer Schaefer"}]