[{"rating": 5.0, "review": "Easy install and works great.", "verified": true, "helpfulness": "0/0", "author": "B. Zerangue"}, {"rating": 5.0, "review": "The fire stick was very easy to set up and run. So far we have been enjoying it. If you are already a prime member you should get it. No reason not to. Easy to operate and a ton more movies and games instantly even if you already have a dish or cable.", "verified": true, "helpfulness": "0/0", "author": "CVB"}, {"rating": 5.0, "review": "I love the fire sticks, they work great.", "verified": true, "helpfulness": "0/0", "author": "cookies and cake pops how cool"}, {"rating": 5.0, "review": "LOVE THIS! It is so much more than the Chromecast stick. We are thinking about ditching the cable company again and were looking into Sling - they suggested this as a means to use their app. This is a GREAT alternative to cable. The kids love the games and the other apps - like karaoke and TED Talks, etc. are awesome perks that I didn't know we would get!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great seller, great price  thanks", "verified": true, "helpfulness": "0/0", "author": "Terry Jordan"}, {"rating": 5.0, "review": "I love the product, specially the flexibility for taking it wherever you go is priceless. I do have kids and it makes a lot of different when traveling with them that you can stream all the content they love soo much. I have stayed at hotels within the States and abroad and by just connecting to the Internet you are done and ready to play.", "verified": true, "helpfulness": "0/0", "author": "Claudio"}, {"rating": 5.0, "review": "Hell, if I had this last year, I would have never purchase on-demand services from Verizon.", "verified": true, "helpfulness": "0/0", "author": "Donald Lakey"}, {"rating": 5.0, "review": "Great buy. The fire stick can stream just about any app you could want plus more. The menu is easy to maneuver and had a great layout.", "verified": true, "helpfulness": "0/0", "author": "tyler henry"}, {"rating": 2.0, "review": "A little slow on app loading but reasonable given its a stick. Bought it for HBO NOW but the app performs horribly and is constantly buffering. It does run Netflix well...but I have a PS3 for that so I'll probably just gift it to lowly family member since the price of $34 isn't worth the effort of returning.", "verified": true, "helpfulness": "0/0", "author": "Daniel Richard"}, {"rating": 5.0, "review": "Snatched this baby up when Amazon offered it presale for Prime members.  I didn't even have a need at that time, but I knew it was worth the offer price.  I use it regularly now; I have it powered via usb on the TV itself to minimize cables.  I won't lie, the user interface isn't up to Apple TV standards.  My Apple TV blows this away in terms of the interface.  Somehow Apple manages to make it easy for the technologically deficient.  Like me.  Having said that.  It is not difficult by any means.  I mostly use it to watch Prime videos and Sling TV.", "verified": true, "helpfulness": "0/0", "author": "Patricia"}]