[{"rating": 4.0, "review": "Bought this for my parents and it works great. The only thing I didn't like is that you have to put a credit card on file to use the stick.", "verified": true, "helpfulness": "1/1", "author": "David NC"}, {"rating": 5.0, "review": "If i could give it a 10 star review i will  im just loving my  Fire tv stick", "verified": true, "helpfulness": "0/0", "author": "lenissa"}, {"rating": 1.0, "review": "Keeps losing connection. Other reviewers complain of the same issue. It's not my WiFi because my laptops work just fine.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "I couldn't be happier with this streaming device.  Easy to set up.  Easy to use.  We should have 'cut the cable' a long time ago !", "verified": true, "helpfulness": "0/0", "author": "Motherina klock"}, {"rating": 1.0, "review": "I purchased the Fire TV stick for the sole purpose of using it for a Sling TV subscription (not yet supported by Apple TV). I wish I had paid more attention to the negative reviews, especially where Sling TV is concerned. The Fire TV stick simply cannot stream quickly enough - regardless of internet speed. As such, all apps (not just Sling) buffer horribly every few minutes. I've never seen anything like this before, and I sincerely hope Amazon fixes these issues for the next release - or trashes the concept altogether.", "verified": true, "helpfulness": "0/0", "author": "mr&mrs; pitviper"}, {"rating": 5.0, "review": "It is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Patricia R. Podach"}, {"rating": 1.0, "review": "It worked great for a day. Now I can't do anything on it except for watch amazon prime. I spent hours tinkering with it and I contacted customer support. No help thus far. I'd give it 5 stars if my unit worked. I got one day out of it and it just quit downloading my apps. No Netflix, no YouTube, no nothing. I am very disappointed with this unit. If I get a replacement that works, I would give it a 5 star. Either these are crap units or I was just unlucky with mine. I'm not happy with this purchase.", "verified": true, "helpfulness": "1/1", "author": "kevin"}, {"rating": 2.0, "review": "Just not pleased with the Amazon prime. Also I would think if Amazon knew charter communication didn't participate in the app program they would tell people in charters area.", "verified": true, "helpfulness": "0/0", "author": "Dirk DeFord"}, {"rating": 5.0, "review": "best streaming device on its price range.", "verified": true, "helpfulness": "0/0", "author": "MrRhyne"}, {"rating": 2.0, "review": "Over it is an ok product. Do NOT buy if you want to watch Hulu Plus. It rarely works. I am disappointed that I bought two. I would not recommend buying the Fire Stick. It also randomly restarts on my fire stick", "verified": true, "helpfulness": "1/1", "author": "Darci Brush"}]