[{"rating": 5.0, "review": "Okay, apparently Amazon doesn't think that 30.103 reviews of the Fire TV Stick is sufficient, as they sent me an email with a link to \"Review Your Purchases\". So here is review # 30,104:Great device, works flawlessly with both Amazon Prime and Netflix, and I'm glad I bought it. I replaced an older generation Roku box that did not support SlingTV (no app). Note the TV I have it connected to is only 25 feet from my wireless router, in case that makes an difference. And SlingTV can be problematic with occasional freezes requiring an app restart. However, I think that's a server side (SlingTV) issue because Amazon Prime and Netflix both stream flawlessly. I also have a Fire TV on another TV, and the Fire TV Stick does just as well for what I do (I don't talk to either).", "verified": true, "helpfulness": "0/0", "author": "Not Mark Twain \"UkeDoggy\""}, {"rating": 3.0, "review": "Really like this fire stick, keeping the fifth star because on my apple products Netflix has option of casting back and forth between your ipad and fire stick. Have to get a fire stick remote app to use your apple products... Withholding 2 stars for this feature alone", "verified": true, "helpfulness": "0/0", "author": "chaddius"}, {"rating": 5.0, "review": "I intentionally waited a couple of weeks for the \"honeymoon\" period to pass, before writing my review.  Either we are still in the \"honeymoon\" period or this is the real deal.  We ordered directly from Amazon with the 3 months of pre-purchased Sling. We have watched the entire NCAA tourny via the Sling app without even a hiccup.1) Have had an Apple TV since 2011 and love the product.(It is now on a secondary TV).2) We are \"cord cutters\" haven't had Sat/Cable for several months3) We had a Chromecast and returned it the same day.We weren't sure about the setup so we plugged it into a secondary TV for the setup and had it up and running in exactly 3 minutes. Downloaded several apps and setup our log ins to Netflix, Sling, ect. No need to setup our Amazon Prime it was preloaded just entered our password.Not having the voice control is no big deal since if you really need it the app for your phone has that covered. It is a bit sensitive but functional. The included remote not needing line of sight is a nice perk we were not expecting to enjoy as much as we do.We will never use anywhere close to all the apps or for the gaming not out thing so we can't comment there, however for movies/TV shows on demand the immediate loading makes the Apple TV look really slow. I'm guess Apple knows this and has to have something in the works to keep up.We chose the Fire TV Stick over the Fire TV base on some of the negative reviews, cost and our personal needs. We are not disappointed; we made the right call.Finally, after getting the FTVS setup on the secondary TV and knowing it was working we took a shot at plugging it directly into an open HDMI slot in our A/V home theater system rather than into the TV.  (Logically it should work, right?) Wishful think became reality. It worked! We can seamlessly go from our ChannelMaster DVR to FTVS to BlueRay player with a push of a button. I had purchased this thinking we would use it sparingly and I would be able to take it with me on the road when they get the \"hotel\" login feature up and running. I'm going to have to purchase a second one for that now, there is no way the family will let me take it from them it is watched at least 50% of the time.", "verified": true, "helpfulness": "0/0", "author": "Kelly in TX"}, {"rating": 4.0, "review": "Great product. I purchased one for all TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "Saleeta Thomas"}, {"rating": 4.0, "review": "Works great...", "verified": true, "helpfulness": "0/0", "author": "James Respicio"}, {"rating": 5.0, "review": "Nice purchase got free when ordered sling tv", "verified": true, "helpfulness": "0/0", "author": "chuck blackmon"}, {"rating": 5.0, "review": "I absolutely love it.  I've been watching movies since I received it.  The only one small thing is I was surprised that it has to be connected electronically.  I've not seen a USB that needs to use an electrical socket.  I had to connect it to an extension cord.  That's my only, only thought. Other than that, I recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Brenda J. Spicer"}, {"rating": 5.0, "review": "well worth the purchase", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 4.0, "review": "I like the stick because it doesn't take up much room. We have both the stick and fire tv. My complaint is that it freezes up alot. This happens with both the stick and tv so it's not just an issue with one. Its nice to have though.", "verified": true, "helpfulness": "0/0", "author": "D. Blackburn \"Dawn B.\""}, {"rating": 5.0, "review": "We enjoy it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]