[{"rating": 5.0, "review": "Absolutely AMAZING!", "verified": true, "helpfulness": "0/0", "author": "Imelda colin"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "eric brummett"}, {"rating": 4.0, "review": "Like it better than the Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Raymond Dion"}, {"rating": 2.0, "review": "Loses connection frequently while streaming Netflix. Rebooting the device multiple times a day to keep video going is a real hassle. Device has to be rebooted at least once a day no matter what due to connection loss. No other wireless devices in the house have this issue. Fire stick is literally  less than 10 feet from the wireless router and has these network issues. Amazon really should have done more in house testing before releasing this device.I use a ASUS 802.11ac Dual-Band Wireless-AC1750 Gigabit router for reference.", "verified": true, "helpfulness": "1/1", "author": "Matthew J Robert"}, {"rating": 3.0, "review": "It drops connection while watching, but my router is in a bedroom and my tv stick is in my living room.  When it works it's pretty good", "verified": true, "helpfulness": "0/0", "author": "michael d solemina"}, {"rating": 5.0, "review": "my kids love it. Its so simple to use and I am thinking I need another one.", "verified": true, "helpfulness": "0/0", "author": "happy mom"}, {"rating": 5.0, "review": "Love it,just letting know if there is anyone who has a Yamaha receiver A720 , the remote works well with firetv stick", "verified": true, "helpfulness": "0/0", "author": "FAITH SANG"}, {"rating": 5.0, "review": "Wicked Awesome!  Couldn't live without it!  Just buy one and try it.  You will be pleased.  I only have one bad thing to say:  Why the hell does screen mirroring not work with my galaxy S5?!", "verified": true, "helpfulness": "0/0", "author": "J. Knight \"J-Dizzle\""}, {"rating": 5.0, "review": "This thing is awesome!  We have had no problems with our Fire stick.We have a Samsung television, which I've read in other reviews, can cause problems with the fire stick.Luckily, we haven't had an issue.We have found crazy obscure movies that aren't on Demand.  It's great.We love it!", "verified": true, "helpfulness": "0/0", "author": "laura m"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Sue Fowler"}]