[{"rating": 5.0, "review": "The Fire TV Stick was super easy to set up.  It takes up little room and I would be able to move it to another room easily.  I have both Netflix and Amazon Prime, and I am excited to be able to watch those shows on my big screen TV just like I can any other show.I know that there are other apps, I have really been focused on catching up with some favorite shows, so I haven't explored other capabilities.", "verified": true, "helpfulness": "0/0", "author": "E. Feliciano"}, {"rating": 5.0, "review": "I was quite pleased with the stick and was glade I got it.", "verified": true, "helpfulness": "0/0", "author": "deborah robinson"}, {"rating": 3.0, "review": "About once a day on average, my TV screen is blue and I have to unplug it for 1/2 a minute to get it running again.  I also expected the search function to consolidate my Apps/streaming services (Netflix, etc..) so that I don't have to conduct multiple searches, so that was a disappointment.  Made a mistake in the beginning and ended up paying for a show through Amazon that was already included with Netflix.  Finally, missed the controller in my son's pants pocket before washing, and so, it's only working some of the time.  I have to use the phone controller app sometimes.  So, overall not a great experience, but still functional.", "verified": true, "helpfulness": "0/0", "author": "Elaine Palmquist"}, {"rating": 5.0, "review": "My husband loves it. We both enjoy Bosvh. Best money I've ever spent. Thanks Amaxon", "verified": true, "helpfulness": "0/0", "author": "Sharon Krause"}, {"rating": 5.0, "review": "Love it.No cables.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 4.0, "review": "My brother got me the fire stick for christmas and I like it.. The only bad thing is when using netflix it freezes a lot!!! And then you can see the lips move of the ppl on tv before you hear them speak..", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 4.0, "review": "Lots of titles to choose from easy to use  definitely  worth it", "verified": true, "helpfulness": "0/0", "author": "crusher"}, {"rating": 3.0, "review": "Having a lot of trouble during the movies. It stops during the movie to upload yet I have a strong single from my wi-fi. Frustrating when the movie stops to load every minute.", "verified": true, "helpfulness": "0/0", "author": "Gloria \"Van Davison\""}, {"rating": 5.0, "review": "Easy to use!  I love it and may order another.  It is portable but I think it would be easier to have two.  The grand kids are playing games and I'm getting more use from Amazon Instant Video!", "verified": true, "helpfulness": "0/0", "author": "Just Suze"}, {"rating": 1.0, "review": "I have a chrome cast and very happy with the product.Bought a fire stick and seems like Im very fortunate that it is broken.I just get the amazon logo and nothing happens.Contacted support and they will send a replacement.Not very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "K. Vindas Leiton"}]