[{"rating": 5.0, "review": "", "verified": true, "helpfulness": "1/1", "author": "laura harris"}, {"rating": 3.0, "review": "It's nice.  Very convenient - but the capability of it receiving WIFI signals is questionable.  Placed it in the TV on the main level about 20 feet from he router - flawless.  Put it in the basement about 40 feet from the router - can't find a signal - I have WIFI on the phone so I know the router can reach- but the stick can't get anything.  Just be aware of where you might use it and how far from the router.", "verified": true, "helpfulness": "0/0", "author": "Michael E. Johnson"}, {"rating": 5.0, "review": "This works well. It is so portable!", "verified": true, "helpfulness": "0/0", "author": "Naomi Gardner \"Nbgardner\""}, {"rating": 4.0, "review": "Works well, easy setup, and easy to use.  Lots of apps available. Only concerning item is the stick gets really hot during use.", "verified": true, "helpfulness": "0/0", "author": "Laura K. Hall"}, {"rating": 5.0, "review": "It performed as advertised.", "verified": true, "helpfulness": "0/0", "author": "David M Abernethy"}, {"rating": 5.0, "review": "Love it, easy to use with lots of viewing options.", "verified": true, "helpfulness": "0/0", "author": "asusd98"}, {"rating": 5.0, "review": "Works great! Our issue is that we have DSL service and a slower modem that causes buffering often during movies. We also have to have the Fire stick on the TV nearest to the modem. Our household problems not the Amazon Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Karen R Dowd"}, {"rating": 5.0, "review": "We are not computer or elelectronic savy, but the firestick was so easy to use, and it has provided many hours of movie fun with the grandkids, as well as some great nights for us as a couple.  Wonderful purchase.", "verified": true, "helpfulness": "0/0", "author": "bp \"concerned daughter\""}, {"rating": 5.0, "review": "Great product to watch movies and TV :)", "verified": true, "helpfulness": "0/0", "author": "Sherry Fong"}, {"rating": 4.0, "review": "Really like this product works good and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daniel Villasana"}]