[{"rating": 5.0, "review": "This hgas given us a whole new way to think about TV.", "verified": true, "helpfulness": "0/0", "author": "Bill SR."}, {"rating": 5.0, "review": "Enjoying the stick.", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 5.0, "review": "I love this! We bought the firestick primarily to put XBMC/Kodi on. The firestick is very fast and responsive. It runs all apps very easily and is perfect for watching Amazon Instant Video. It is very simple to connect to your TV or computer and I really like the remote that comes with the firestick. It is very responsive and comfortable to use. I would definitely recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Jim"}, {"rating": 5.0, "review": "Works great! Very easy to set up and switch from room to room.", "verified": true, "helpfulness": "0/0", "author": "Melissa J."}, {"rating": 3.0, "review": "I was replacing my Roku because it couldn't run HBO Go but I discovered that the FireTV stick doesn't support Hulu (not HuluPlus) and does not support Playon. I had to purchase and HDMI switch.", "verified": true, "helpfulness": "1/1", "author": "Melody Ragle"}, {"rating": 4.0, "review": "Fantastic device. It was single handedly one of the best purchases I've made. I just wish it had more apps like Nick jr. Otherwise its fantastic. The menu for prime videos could be better to allow for selecting recently added and search by genera.", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "Love this product. More than I expected.", "verified": true, "helpfulness": "0/0", "author": "Charles Palmer"}, {"rating": 2.0, "review": "not very impressed", "verified": false, "helpfulness": "0/1", "author": "GLENN CONROY"}, {"rating": 5.0, "review": "has everything i need. just purchased another for my guest bdr", "verified": false, "helpfulness": "0/0", "author": "Michael Kelly"}, {"rating": 3.0, "review": "Is adequate", "verified": true, "helpfulness": "0/0", "author": "Patrick \"DryPenguin\""}]