[{"rating": 1.0, "review": "I had to unplug and plug the Stick's power cord  every time I turned ON the TV in order to get the stick to boot.", "verified": true, "helpfulness": "0/0", "author": "RC"}, {"rating": 5.0, "review": "Very easy to use, it has too many option, great capacity, very nice to see the pictures and video directly on tv. In my opinion, It could be better if the added App appear directly at home page.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Great, just as good as roku and less expensive !", "verified": true, "helpfulness": "0/0", "author": "kathleen guerrier"}, {"rating": 5.0, "review": "The Amazon fire stick it so easy to use. My husband was able to set up this device in 30 minutes and we were ready to stream on Amazon prime,Netflix and Hulu plus. I will be purchasing another one.", "verified": true, "helpfulness": "0/0", "author": "susan"}, {"rating": 5.0, "review": "I love it! Easy to use! Everyone in the house wants one.", "verified": true, "helpfulness": "0/0", "author": "Tina M."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Rose"}, {"rating": 5.0, "review": "My daughter absolutely loves it!  She used to watch Netflix on her computer and now can watch it on the television.  Well worth the $$ and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "I was easy to set up and use!!  Brings more choices!", "verified": true, "helpfulness": "0/0", "author": "J. Cruz"}, {"rating": 5.0, "review": "Very happy with this purchase. Super easy to install. Works really well. Wish I had known about the Firestick sooner.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "i WAS DISSAPOINTED BECAUSE i COULD NOT USE IT WITH MY CONTROLLER. iT WOULD BE NICE IF THEY HAVE A LIST OF REMOTES THAT DO OR DONT WORK", "verified": true, "helpfulness": "0/1", "author": "N. Winling \"reading grandma\""}]