[{"rating": 5.0, "review": "Nicer user experience than the Google Stick.", "verified": true, "helpfulness": "0/0", "author": "KAL in SB"}, {"rating": 2.0, "review": "Terrible connection! Frustrating as all h@**!", "verified": true, "helpfulness": "1/1", "author": "jeff dahlke"}, {"rating": 3.0, "review": "Works ok.  Just not a lot of choices for movies.....", "verified": true, "helpfulness": "1/1", "author": "Becky Williamson"}, {"rating": 5.0, "review": "Best investment yet! The quality is superb and I recommend it to everyone who are movie buffs! We've purchased 2 of them so far.", "verified": true, "helpfulness": "0/0", "author": "Judes67"}, {"rating": 5.0, "review": "The stick was easy to install and the video instructions was informative. The only thing that I noticed was that the stick seems a bit on the warm side when in use. Otherwise I'm very content and have watched an Amazon Prime show on my watchlist. I have to try out the photo storage and the games. Now I can use a gaming TV for streaming movies and shows.The remote control works fine with no appreciable lag.", "verified": true, "helpfulness": "0/0", "author": "Tyson Eng \"Ty\""}, {"rating": 5.0, "review": "Great functionality!", "verified": true, "helpfulness": "0/0", "author": "Joshua MacDonald"}, {"rating": 5.0, "review": "Amazing device,from set up to surfing ,to watching your favorite shows,it's well worththe money,I recommend it to everyone. I went from 65.00$ a month to 14.00$a month,with just a 45.00$ Investment.!!!", "verified": true, "helpfulness": "0/0", "author": "clifton miller"}, {"rating": 3.0, "review": "It was a little hard for me because I'm not gadgets savvy. It also didn't support the main reason I brought it for: to watch my vudu movies on tv comfortably. It's still a good product and I would buy it again if it wasn't for watching movies", "verified": true, "helpfulness": "1/1", "author": "darlene bell"}, {"rating": 1.0, "review": "I was disappointed. I have Netflix and almost every movie or show was on the fire stick.alot if repeats. I barly use it cause I have to unplug the playtion or the cable box to make room to plug it in.it was easy to set up", "verified": true, "helpfulness": "1/2", "author": "kelli"}, {"rating": 5.0, "review": "I ditched cable and after using a FireTV box on the large TV in my living room, and thinking it was the best thing since sliced bread, I just got the stick for tye small TV in my bedroom.  Love the stick!!  There have been no snags, no network drops (unless the fault was with the network) and performance has been seamless.  I can start watching something in the living room and finish it in the bedroom.  I use the toggle - you just pop the device into an HDMI port and you're good to go.  Awesome!  8)", "verified": true, "helpfulness": "0/0", "author": "Wendy Ritch"}]