[{"rating": 5.0, "review": "it is fine. I like it.", "verified": true, "helpfulness": "0/0", "author": "dongyangxu"}, {"rating": 1.0, "review": "The remote did not work unless it was 5 inches from the Fire Stick. I have issued a return and will check back when I get the new one.", "verified": true, "helpfulness": "1/1", "author": "Matt Luker"}, {"rating": 4.0, "review": "It comes with very poor instructions for getting started. The round thing at the top of the remote is two wheels which are used to enter the password. Mine didn't work and I had to call customer service. The first rep spoke English quite well. She forwarded me to the Fire services. I spent five miserable minutes on hold while subjected to a scratchy tape of pounding music before the call was terminated. I called back and got a rep who barely spoke English and was difficult to understand, probably from India. She passed me off to another rep, so I was again subjected to the miserable \"music\" for 9 minutes. I got a rep who spoke English and she sent me back into the queue for the Fire technician. Another five minutes of torture on hold. He reset the remote and stayed on the line until I got connected.  Then it played a video which included instructions it would have been nice to have BEFORE attempting set up. After all the unnecessary aggravation, it seems to be working nicely. Amazon gets zero stars for outsourcing jobs to India.P.S. After using it a few days, I am happy with it. It is nice to not have to hook up my Kindle to the tv and to have a remote for navigating. The screen savers are lovely.", "verified": true, "helpfulness": "1/1", "author": "Sockosim \"Socko\""}, {"rating": 2.0, "review": "It arrives with full access turned on to photos inside account holders Amazon Cloud Drive.  If anyone takes it during transit or at delivery, they will be able to see your private images.  It does not need to be validated with a password, it is already enabled and ready to use by anyone who plugs it into an HDMI port.This is simply a security issue that shouldn't exit.Also, there is NO way to remove the associated account holders Amazon Cloud Drive so anyone with access to the TV will have access to all your photos that are backed up to AMZ Cloud Drive.  For those who may take reminder images of gift ideas, etc. this is not idea.  One also may not want to share their personal images and document scans with the maintenance person or the housekeeper.  If you use Amazon Cloud Drive, your photos will be always shared with this device unless they fix this.As far as a device, it's flaky, often freezing, if only powered from the TV's USB.  The FireTV Stick may require the included AC adapter (and probably an additional extension cord) with some TV's although I had no problem with a Chromecast while it was powered by the same TV.If the forced sharing of an Amazon Cloud drive is not an issue, then overall it's a reasonable and inexpensive way to get Amazon Prime content to a TV.  It's not as polished or solid as an Apple TV, nor does it cost as much. It also works well as a stand-alone device unlike a Chromecast.", "verified": true, "helpfulness": "1/1", "author": "D. Daugherty"}, {"rating": 5.0, "review": "Far better than ChromeCast and the others!Staples had the best deal on these.", "verified": false, "helpfulness": "0/0", "author": "Gary Doney"}, {"rating": 2.0, "review": "They don't show the power cord in the adds that you need to run it kind of misleading. You will need to plug it into the wall for it to work correctly.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 1.0, "review": "Zero stars, does not work. Stick with Aplle TV!!!", "verified": true, "helpfulness": "0/3", "author": "Jocelyn F. Camara"}, {"rating": 5.0, "review": "This is great. Find something else every time I log on. Sure would be nice if the remote control were larger.", "verified": true, "helpfulness": "0/0", "author": "David C."}, {"rating": 5.0, "review": "Awesome product, easy to use and easy to set up. The remote doesn't feel all the strong but what do you expect for the price. I also read somewhere that you can download an amazon app to control it. I haven't gotten that far yet. But awesome product to do plex, hbo, netflix, hulu plug and amazon instant video", "verified": true, "helpfulness": "0/0", "author": "kyle reasoner"}, {"rating": 5.0, "review": "I am very happy with this amazon fire stick , I plugged it in the back of my set, turned tv on, it found my wi fi connection, entered password and it walks you through set up with a tutorial which was very easy to understand. Navigation with the fire stick is also very easy and set up nice. This is a top notch product and would recommend this to anyone interested in a streaming device", "verified": true, "helpfulness": "0/0", "author": "Jon"}]