[{"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Steven Priddy"}, {"rating": 5.0, "review": "Works great! Really easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brooke Leary"}, {"rating": 5.0, "review": "Works exactly how it says it will.  Very easy to use, just plug it in and connect to WiFi and begin watching or playing games.", "verified": true, "helpfulness": "0/0", "author": "Broc Wallace"}, {"rating": 5.0, "review": "Super easy to install and use. And you cannot beat the price", "verified": true, "helpfulness": "0/0", "author": "Stephanie Myers"}, {"rating": 5.0, "review": "Great value. All the apps and shows Iyou need plus more I didn't even realize I was missing", "verified": true, "helpfulness": "0/0", "author": "N Russell"}, {"rating": 4.0, "review": "I give this 4 stars...bought for my husband and he loves it. Its really neat and there are several programs offered through the stick simply by plugging it up and attaching the drive to the tv. I would give it a 5 except I am not too pleased that it does require Amazon Prime to watch some of the most recent movies.", "verified": true, "helpfulness": "0/0", "author": "SWD"}, {"rating": 5.0, "review": "so far I really like the fire TV stick- the remote is great and the product works very fast and reliably", "verified": true, "helpfulness": "0/0", "author": "jja"}, {"rating": 5.0, "review": "Love the Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Lee31"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick, met and surpassed our expectations.  We received the Fire Stick as a gift at Christmas, we just set a couple of settings plugged it in a PRESTO, connections to our PRIME TV, Video and music, plus Netflix, HULU, games and more.  Add to that, the Fire TV App for our Android phones (pretty sure there is an Apple one as well) and know we can view our phone pix and video, as well!  Just perfect.", "verified": true, "helpfulness": "0/0", "author": "Patrick Brown"}, {"rating": 2.0, "review": "i have the best internet service available, and still i keep getting messages tha I need more.  I'm kind of disappointed in the FireTV Stick.", "verified": true, "helpfulness": "0/0", "author": "Doris"}]