[{"rating": 5.0, "review": "Exactly what we were looking for! Can't beat the price!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Henderson"}, {"rating": 1.0, "review": "Netflix impossible to view, you get nothing of what you subscribed for.  Device will not hold a connection - imagine to have to bounce in and out (entirely) to try to continue with whatever you're trying to see.  HBO GO virtually does not function on this.  Garbage.  Don't know what to do as an alternative, because haven't had luck with Roku stick.", "verified": true, "helpfulness": "0/0", "author": "West Hollywood"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Rflores"}, {"rating": 5.0, "review": "Wasn't what I thought.  Having fun exploring and getting to know my new kind of TV", "verified": true, "helpfulness": "0/0", "author": "Debbie Beland"}, {"rating": 3.0, "review": "It's a very handy piece of tech and very easy to set up and use.  The only problem I have with it is a major problem:  while watching shows via the Netflix and the amazon prime app, it loses wifi connection frequently (sometimes up to 2 and 3 times per show).  I've tried troubleshooting it with suggestions on the website and keep the software up-to-date, but it keeps dropping the wifi.We have a very old Nintendo Wii in the same room (that we used for Netflix) and its wifi never dropped out, so I really don't think the problem is with the distance to my router.", "verified": true, "helpfulness": "4/4", "author": "A. Jaffrey"}, {"rating": 3.0, "review": "It gets the video to my TV and my kids can use it but interface is a bit clunky and can sometimes be slow. When using the Youtube app it's almost unbearably slow.  I have the Fire controller app on my iPhone but when searching it won't even let me use a keyboard to enter search terms on the Youtube app.", "verified": true, "helpfulness": "1/2", "author": "B. Cook \"DigMe\""}, {"rating": 5.0, "review": "I love it.  I hooked it up in less than 5 minutes and it was ready to go.  On screen instructions were very easy to follow.  Remote was veryeasy to use.  All in all the Fire TV Stick is a great product!", "verified": true, "helpfulness": "0/0", "author": "jlsperry"}, {"rating": 5.0, "review": "Love it, particularly the remote which makes the browsing and viewing so much easier and faster!!! Another big benefit to me is using Amazon tablets' mirroring to watching online movies/apps on large screen TV.", "verified": true, "helpfulness": "0/0", "author": "X. Li \"Lee\""}, {"rating": 4.0, "review": "Works pretty good does  have to stop an catch up once in awhile still have to buy some apps to watch  most new programs but better ,cheaper than satellite or cable . Picture  is great", "verified": true, "helpfulness": "0/0", "author": "sporter willey"}, {"rating": 5.0, "review": "Its Great", "verified": true, "helpfulness": "0/0", "author": "Yolanda F."}]