[{"rating": 5.0, "review": "Great device.  Easy to use. Instinctive versus technically complicated. Great alternative for avid TV person.", "verified": true, "helpfulness": "0/0", "author": "acs"}, {"rating": 5.0, "review": "Love this product!  Easy to use and delivers as stated!", "verified": true, "helpfulness": "0/0", "author": "randy"}, {"rating": 5.0, "review": "Only had it for a day so far but if you don't have a smart tv this is awesome! Very fast and responsive, does what it is supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Paddington and Pooh's"}, {"rating": 1.0, "review": "We had a great deal of trouble getting the fire stick to work wit our brand new smart TV. The TV actually took over the control of the fire stick. We don't use the remote of the fire stick at all. It would have been helpful to know that might happen.", "verified": true, "helpfulness": "0/0", "author": "Rogan"}, {"rating": 4.0, "review": "Pros: Easy to install. Provides easy user interface and allows our family to add several additional channels (such as ESPN) to augment our bare bones cable.  We got the Fire Stick for free as a prime member during a deal week - only pay 20/month.  This was much cheaper then adding the same channels onto our cable package.Cons: Relies on WIFI - if you have disruptions in your WIFI service, obviously causes you to lose service. Overall, the stick will have to buffer a few times an hour resulting in a short outage for 10-20 seconds.  Not terrible, but a little frustrating when you are watching sports.Overall - would purchase again (for free). It is easily worth the cost of Sling TV (20/month).", "verified": true, "helpfulness": "0/0", "author": "Jonathan T. Frerichs"}, {"rating": 1.0, "review": "Returned it due to it dropping network connection constantly, barely worked. I was right near the router and it never worked. Got a Roku stick and worked perfectly", "verified": true, "helpfulness": "0/0", "author": "john crenshaw"}, {"rating": 4.0, "review": "It is what I thought it was...and that's good. It can be a bit \"buggy\" at times but its perfect if you want to turn your TV into a SMART TV either in your bedroom, office or on the go.", "verified": true, "helpfulness": "0/0", "author": "Chris Alvarez"}, {"rating": 4.0, "review": "I am actually enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "Ellen Mead"}, {"rating": 5.0, "review": "Excellent product easy to use.Very well made.", "verified": true, "helpfulness": "0/0", "author": "ricardtaylor"}, {"rating": 5.0, "review": "very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]