[{"rating": 5.0, "review": "Worked right out of the box. No issues. Bought two.", "verified": true, "helpfulness": "0/0", "author": "_Ritch"}, {"rating": 5.0, "review": "I am very pleased with the Amazon Fire TV Stick.  I like that you can easily take it from TV to TV without a huge setup process.  It has more apps then my Roku like Starz which is the main reason I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Purchased the Amazon Fire TV Stick to turn my secondary dumb TV into a smart one.  Was simple and easy to set up and has worked flawlessly ever since.  Also, have used it in my large smart TV as it must have a weak Wi-Fi antenna and doesn't like connecting frequently.  The Fire TV Stick hooked right up and I used it to stream several movies with no circle of death incidences.  Also, took it on vacation with us and used it at other family members homes where it hooked up and played flawlessly.  Great device for getting and streaming digital services.  It's kind of like taking your home TV with you where ever you go...", "verified": true, "helpfulness": "0/0", "author": "tiv1"}, {"rating": 5.0, "review": "This thing is a great deal and, because it's android, you can load KODI (XBMC) onto it. I'm thinking about getting the fire box but not sure it's necessary unless you want to play games.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Easy setup, basically plug & play.... Works great...Tons of viewing choices.....I also have a R*** ...The fire stick is by far the best of the two....If I would have bought the Fire stick first I wouldn't have purchased the other device.....Delivery was fast(arrived a day earlier than expected)....W.E.R.", "verified": true, "helpfulness": "0/0", "author": "W. E. R."}, {"rating": 4.0, "review": "needs large bandwith", "verified": true, "helpfulness": "0/0", "author": "Howard D. Wolfson"}, {"rating": 3.0, "review": "Two major flaws: First, you will have to plug this thing into your wall outlet if you want to have a chance to get reception. Yet another device to plug into an already stuffed power strip. This is barely talked about in the sales literature. Second, if the device has network problems, trying to recover through the Settings does no good; you must unplug the thing and let it reboot. Other than these really annoying things it works really well and has an easy-to-use interface.", "verified": true, "helpfulness": "0/0", "author": "John B. Baker"}, {"rating": 5.0, "review": "Love the Fire Stick.  I can stream from all my various devices, phone, kindle, laptop.  Some of the channels are kind of quirky, but love the access I have to Pandora, You Tube, Netflixs etc.  Even like the screen saver.  Great little device!", "verified": true, "helpfulness": "0/0", "author": "Luv2read \"Luv2read\""}, {"rating": 5.0, "review": "Wonderful! I would highly suggest the 16 gb version, however. Bright, very clear HD. CAN SEE pimples on teen actors faces! Very easy to use. Fast.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 5.0, "review": "Love my fire tv stick!", "verified": true, "helpfulness": "0/0", "author": "Kelly Matthews \"webdiva69\""}]