[{"rating": 4.0, "review": "Would be nice to plug head phones in to the remote", "verified": true, "helpfulness": "0/0", "author": "Tony Regennitter"}, {"rating": 5.0, "review": "Best thing since sex.", "verified": true, "helpfulness": "0/0", "author": "Glenn Harvey"}, {"rating": 2.0, "review": "I would have rated this 5 stars if I was able to watch HBO, Showtime, and Starz.  Since Xfinity is not listed as a TV subscriber on the fire stick, I am unable to.  This is something that needs to be fixed ASAP.  I would have not purchased it if I would have known that.", "verified": true, "helpfulness": "0/0", "author": "Cutsie"}, {"rating": 1.0, "review": "I am continually loosing connection with the servers. The error message states Connected With Problems. It's the stick because I have never have this issue with any other devices at the same time. Very annoying. Work out this issue and a few others and it will be a great device.", "verified": true, "helpfulness": "0/0", "author": "Angela King"}, {"rating": 5.0, "review": "Easy to set up very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mary W. Fox"}, {"rating": 5.0, "review": "AWESOME, how did I not find this sooner. Sooo much easier than watching off the iPad or hooking the computer up to the tv to get Netflix. this thing is worth every penny, and its not even that much", "verified": true, "helpfulness": "0/0", "author": "Eric Goral"}, {"rating": 3.0, "review": "I love having a remote that is separate from my phone. however, I was an avid Chromecast user, and still am. I prefer to have volume control, more interaction from my phone, and I am not fond of using directional buttons to log into my various accounts, or search. I really enjoy having a separate interface for the streaming stick. but I'm really sticking to my Chromecast for most of my streaming needs.", "verified": true, "helpfulness": "0/0", "author": "Ric S"}, {"rating": 5.0, "review": "My son loves it!  He can stream his amazon collection or netflix and Hulu plus play games!  Amazing clarity and super easy to start up", "verified": true, "helpfulness": "0/0", "author": "Misty Wilson"}, {"rating": 5.0, "review": "My favorite streaming experience to date.", "verified": true, "helpfulness": "0/0", "author": "Ryan T"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Matthew Wood"}]