[{"rating": 4.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Connie Bown"}, {"rating": 5.0, "review": "Great item!  Well worth the money!  I would give it 6 stars if it had an optical out for 5.1.", "verified": true, "helpfulness": "0/0", "author": "Michael Lee"}, {"rating": 4.0, "review": "I bought this on pre-sale for $20. I wasn't expecting much but I'm surprised by how well it works. It's not perfect, has a few glitches with connecting to my iPad now and then, but it usually resets after I redo the paring. I like the new software upgrade. It did organize things better.", "verified": true, "helpfulness": "0/0", "author": "Magpookie"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Tho Nguyen"}, {"rating": 5.0, "review": "Works great and the cable is gone.", "verified": true, "helpfulness": "0/0", "author": "Terry L Barreras"}, {"rating": 5.0, "review": "It has all the apps I need and portable!", "verified": true, "helpfulness": "0/0", "author": "Michael Martinez"}, {"rating": 4.0, "review": "The firestick itself- DID NOT need to be replaced! It was simply updating the current one on a new tv and then using in an older tv.... so.... JUST FYI. NOW, I have to return one of them- creating more craziness in my life! Also, the replacement FIRESTICK- DID NOT COME with the remote control- as shown in this picture- so had I lost it in our move- or couldn't find it, it would be worthless anyways.... you cannot use a firestick without the special remote....", "verified": true, "helpfulness": "0/0", "author": "trimomsarah"}, {"rating": 4.0, "review": "Easy, simple, and fast. Amazon has another star product. Only grip would be lack of available free media.", "verified": true, "helpfulness": "0/0", "author": "Louis Cetano"}, {"rating": 4.0, "review": "Nice product, quick fit to the tv, easy access, able to pull up variety of videos and games. I like the portability. One draw back, although it can be 2nd screen for my kindle fire for video choices- I have Not been able to Mirror the kindle. The online help directs me a screen on my kindle but my kindle does Not contain the option to Mirror. This is a major drawback for my original purpose- I wanted to be able to share specific website actions on the big screen with my family, Maybe I don't have the newest version, but I recently added the 6\" hd fire to my collection, I thought that was the most current version. sigh.....Update:  I spoke with Amazon support, only the HDX fire tablets can mirror.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 2.0, "review": "I would like to see fire TV stick stream any TV series that's available at Amazon that's sold in different regional coded areas !", "verified": true, "helpfulness": "0/0", "author": "Gary A. Matzke"}]