[{"rating": 5.0, "review": "My family typically uses a Roku to watch TV in the family room, but when the offer for Prime members to buy this for $19.99 was happening, I couldn't pass it up.  I have no issues with lag between channels and even though yes, there are things I need to pay for, there are an abundance of shows that I can stream for free as a Prime member who also has Netflix.  If only the main networks streamed their shows through Fire-capable apps!Also, by far the best bonus perk for me was the Cloud Drive with unlimited space for my photos as a Prime member.  I don't have to worry about plugging my phone into my computer, this auto-saves all of my photos as soon as I connect to WiFi!  Awesome!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 3.0, "review": "We received this as a gift, as my husband is a movie lover. We're disappointed at the movie selection, especially since I'm a prime member. Most of the Prime movies are at least ten years old and mediocre at best. Would like to see more variety for adults. Lots of kid stuff though... I would rather rent a movie from RedBox than rent one from the FireStick for $4.99+. The apps you can download, like Hulu Plus, are slow and freeze in the middle of movies. We still use it but wouldn't recommend to others.", "verified": true, "helpfulness": "0/0", "author": "sdustin"}, {"rating": 3.0, "review": "Little bit disappointed free channel and apps.", "verified": true, "helpfulness": "0/0", "author": "Charlie  Yoo"}, {"rating": 5.0, "review": "This makes streaming movies and other content very easy.  I love it!  Amazon price is very good for what it does.", "verified": true, "helpfulness": "0/0", "author": "M. Thompson \"Dyson Diva\""}, {"rating": 4.0, "review": "You would think the stick would support all apps as FireTV, but it doesn't. HDHomeRun app is not available for the stick.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "samantha faison"}, {"rating": 3.0, "review": "It still requires plugging in, it isn't powered by the tv.  That is probably the biggest flaw.  I prefer my Roku box for ease of use.  This is definitely an Amazon product. While it runs the Prime stuff great,  it lacks features to support other \"channels\" like Hulu Plus, Netflix or PBS.  You can use those channels, but you can't do an overall search for a show like on the Roku, where it tells you which channel offers what you are looking for.", "verified": true, "helpfulness": "1/2", "author": "HopeSprouts"}, {"rating": 4.0, "review": "Super simple, amazing technology for the price.", "verified": true, "helpfulness": "0/0", "author": "wanderlust"}, {"rating": 5.0, "review": "Love my Fire Stick!!  My wife and I each have a Kindle Fire HD, and I always wished that we could watch the content that we get on the Kindles on our 56\" flat screen TV.  A friend told me to get a smart TV.  But for just $30, I purchased the Fire Stick and now have my NetFlix, Hulu, and Amazon Prime accounts all on the big screen.  And it's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jim Bono"}]