[{"rating": 5.0, "review": "I LOVE this item. I wish I would have ordered 2 more at the promotional price. We do not have smart TV's nor streaming devices in our bedrooms. This product is easy to install-plug into TV, plug into outlet. I can access both my Amazon and Netflix accounts. The remote control is small, but has easy functionality. I find this much easier to use than the playstation and have used it almost daily since I received it!!", "verified": true, "helpfulness": "0/0", "author": "Tiffini"}, {"rating": 5.0, "review": "Way better than my Chromecast. I just wish it was powered by my TVs USB instead of the AC adapter. Other than that I love it. The remote is so much more convenient than casting from my phone (which it can also do), AND I can finally watch Amazon Prime shows, a feature the Chromecast is sorely lacking. I still use the Chromecast to stream Pandora on my stereo, but for TV Fire Stick is where it's at.", "verified": true, "helpfulness": "0/0", "author": "D. Soards"}, {"rating": 5.0, "review": "I am very happy with the TV Fire Stick.  It was so easy to set up and so easy to use.  Great Purchase!!", "verified": true, "helpfulness": "0/0", "author": "sdkid"}, {"rating": 5.0, "review": "The Amazon Fire Stick is a wonderful item to have while traveling. Instructions for use are very clear. Set up is so simple, one can put it to use instantly. It gives access to all programs from home. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Maria R. Burcroff"}, {"rating": 4.0, "review": "Woks better than streaming through my dvd player. Doesn't seem to buffer as much.", "verified": true, "helpfulness": "0/0", "author": "My thoughts"}, {"rating": 5.0, "review": "I love it love it love it!", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Simple setup. Easy viewing. I was streaming videos 10 minutes after I opened the box. Highly recommended for streaming movies. Gaming apps are available, but I'm not a gamer.", "verified": true, "helpfulness": "0/0", "author": "James Richmond"}, {"rating": 1.0, "review": "I am not totally tech savvy, and it isn't clear what to do for installing this feature.  Some more instructions would be handy.", "verified": true, "helpfulness": "0/1", "author": "ray nagai"}, {"rating": 1.0, "review": "Great product I loved it, i use it all the time............ so much better than my chrome casts and roku sticks.I am giving it 1 star because 3 times I have set pin protect purchases, 3 times this feature has turned itself off.3 times now I have had to ask amazon for a refund because it immediately starts streaming after the purchase.My guess is it is a glitch, some sort of bug, perhaps updates revert the setting to off.  Regardless I can't use this product nor should anyone.  Roku makes a great stick and I have never had a problem with it.Go with a roku it does everything the fire stick does, just not as well.", "verified": true, "helpfulness": "0/0", "author": "Michael C. Mantion"}, {"rating": 4.0, "review": "Easy setup...buffers a little. Overall good purchase.", "verified": true, "helpfulness": "0/0", "author": "Lowell A Cooper Jr"}]