[{"rating": 1.0, "review": "cannot  get  iot  to  work  with  mt  tv  even  after  spenging  3 to 4 hours  with  the  support  team", "verified": true, "helpfulness": "0/1", "author": "Terry Corredato \"DATO547\""}, {"rating": 4.0, "review": "Just what I wanted it for. Easy to install except it somehow ended up in German(?) and I had a really difficult time figuring out how to change it to English in the settings, but ultimately did.", "verified": true, "helpfulness": "0/1", "author": "Donna Williams"}, {"rating": 5.0, "review": "I have enjoyed the Amazon Fire TV Stick.  Once you over come a few false start it is just click, click, click as easy as pie.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Connie Burroughs"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Greg Correll"}, {"rating": 1.0, "review": "Never has worked for me.", "verified": true, "helpfulness": "0/0", "author": "philip geyer"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Tonya Estes"}, {"rating": 1.0, "review": "I was very excited and made up a nice long watch list.  I went to watch one but had to pay, so I went to another then another! Needless to say not one movie on my list was on the Prime list, to say I was upset was putting it mildly. I felt we were mislead into buying the fire stick. I would not even give it one star but had to to get the opportunity to tell someone how we felt.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Nothing but problems keeping a constant connection. Done everything and Netflix has never loaded properly", "verified": true, "helpfulness": "0/0", "author": "Raymond A"}, {"rating": 4.0, "review": "It is a great product", "verified": true, "helpfulness": "0/0", "author": "T.A."}, {"rating": 5.0, "review": "Loaded Kodi on this and we use it to watch new movies all the time, as well as pretty much any TV show that you want to watch!  Its great!  Highly recommend it - this is if you have a strong internet connection..", "verified": true, "helpfulness": "0/0", "author": "Patrick J. Morris"}]