[{"rating": 5.0, "review": "Working great as of three weeks, I don't use the plug into the wall outlet, instead just use the USB port on the TV to run the power to it, and this is great so far,.. Firestick is playing well with Slingplayer where the Chrome would not play at all.. I don't use it for anything else just Sling, I think I have saved approx. $50 per month for the last 72 months, by just slinging the extra TV that sits in my friends basement and nobody watches..sure every once in a while a slow internet blip(I am talking minor blip), but instead of donating $7k to ATT Uverse, it is great to purchase the Slingbox for a one time charge of $200 and then only watch the Fox News or Fox Sports for a half hour each night.. really great with traveling because then can watch your local TV while out of the country", "verified": true, "helpfulness": "0/0", "author": "james murphy"}, {"rating": 4.0, "review": "Love my fire tv stick.  Had a bit of trouble hooking it up.  But, I enjoy it immensley", "verified": true, "helpfulness": "0/0", "author": "Joy Poston"}, {"rating": 5.0, "review": "love it, works great , and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Sydney"}, {"rating": 5.0, "review": "Love it! I've had Apple TV for a few years but was always frustrated by my inability to watch Amazon shows. I subscribe to services rather than buy shows so I don't miss the ITunes feature on Apple TV.  We take our Fire stick whenever we travel. Great for the 5th wheel and Air Bnb weekends.", "verified": true, "helpfulness": "1/1", "author": "Shelly"}, {"rating": 5.0, "review": "Super easy to install. Love it!", "verified": true, "helpfulness": "0/0", "author": "Shawnna Hitchcock"}, {"rating": 5.0, "review": "very easy connect and works great!", "verified": true, "helpfulness": "0/0", "author": "KCLADY \"KCLADY\""}, {"rating": 5.0, "review": "pretty awesome.. really good quality...", "verified": true, "helpfulness": "0/0", "author": "myron"}, {"rating": 4.0, "review": "I think it works well, would be better with more ram", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good. I had no trouble installing the fire stick. Set up was easy and everything worked well. I have had trouble streaming in the past with different devices. This one worked right away.", "verified": true, "helpfulness": "0/0", "author": "Carlotta Salemi"}, {"rating": 5.0, "review": "Super easy to get installed! Great programming to choose from. I love that my iPhone can also be the remote!", "verified": true, "helpfulness": "0/0", "author": "Jbdink"}]