[{"rating": 4.0, "review": "Works great.  Only Drawback I see is on the iphone app.  The screen works but is blank.", "verified": true, "helpfulness": "0/0", "author": "Wade fowler"}, {"rating": 5.0, "review": "easy to set up, easy to follow and use", "verified": true, "helpfulness": "0/0", "author": "Lisa Kennedy"}, {"rating": 5.0, "review": "This is a nice product. It works great and i do not have to watch netflix on my computer, it goes right to the tv. I love this product and think it is a great streaming device.", "verified": true, "helpfulness": "0/0", "author": "robert reed"}, {"rating": 4.0, "review": "Down load speed was great. Needed a 3 port switcher since my HDTV only had 2 HDMI inputs.", "verified": true, "helpfulness": "0/0", "author": "Michael E."}, {"rating": 5.0, "review": "Love this thing", "verified": true, "helpfulness": "0/0", "author": "carol savner"}, {"rating": 4.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Eric V."}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Great product.  Easy setup.  Easy to use.  Lots of features. Got ours for Netflix, but soon upgraded and got the game controllers as well.  The optional game controllers really makes this a complete entertainment package for a vey reasonable price.", "verified": true, "helpfulness": "0/0", "author": "John P. Hayes"}, {"rating": 5.0, "review": "After using the fire Stick for almost a month. I find it easy to use and works perfectly on any Hdmi device it is attached to. I feel it was a real good investment with ton/s of features.", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 3.0, "review": "I am a bit disappointed in the range for the wifi.  It comes with a booster but that does not seem to make much of a difference in the streaming.  Not sure what to do other than contact Amazon and see if they can offer a better solution", "verified": true, "helpfulness": "0/0", "author": "Bridget Labrie"}]