[{"rating": 5.0, "review": "Benn using the Fire Stock for a few months now and have never had a problem.  Love how small and portable it is!", "verified": true, "helpfulness": "0/0", "author": "Hoff"}, {"rating": 3.0, "review": "When internet weak fire stick gives up whereas Apple TV works great", "verified": true, "helpfulness": "1/1", "author": "Michael P. Mcintire"}, {"rating": 4.0, "review": "Good, but I did have to return one that stopped working. Customer support was awesome on this. No 'casting' ability, but lots of included apps.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Ridiculously easy to use! We just got this last week and we love it! Set up was easy and quick and signing in was super simple with the Fire TV app. There's a keyboard function so typing is as easy as texting. Connecting the app to the stick is simple, just connect to the same wifi network and select the stick when it comes up and enter a code from the TV. The response time is snappy and quick. Netflix works great, as does Hulu plus (yes, there are ads but that's just how Hulu is) but the star is Amazon video. The voice search function only searches Amazon video but it works really well for that.The remote is minimal but has everything it needs. I would still recommend getting the iPhone app since it has the keyboard function and voice search without having to buy the separate voice search remote.Update: 8/1/15 we love the fire stick still but here are a few notes1. With the power cord plugged into the wall, you can press a button on the remote and it will turn on the stick and the TV. We got the short usb power cord for the sake of not having more cords hanging down and this function is no more.2. I'm not sure if it is the usb power or the fact that I listened to another reviewers suggestion but when I changed it to the usb cord, I also moved the stick so that it is standing up and the reception has improved. It used to lag sometimes on Hulu but now it doesn't at all.", "verified": true, "helpfulness": "0/0", "author": "N. Gu"}, {"rating": 5.0, "review": "I personally love the Kindle Fire Stick.  I had a small hiccup in the beginning because I had the Stick plugged into a surge protector but once I moved it off the surge protector and plugged it into the wall directly, it hasn't given me anymore problems.  Great little device for the money.", "verified": true, "helpfulness": "0/0", "author": "Nicole Mayer \"Nicole Mayer\""}, {"rating": 2.0, "review": "Fire TV stick has issue with skipping and playing back.  It doesn't queue up and plays as un-interrupted as advertised", "verified": true, "helpfulness": "0/0", "author": "Mansour Faraji"}, {"rating": 4.0, "review": "Love it. I just wish I had more time for watching some good old programs", "verified": true, "helpfulness": "0/0", "author": "James Wilson"}, {"rating": 4.0, "review": "I love the fire stick! it's so nice now that I am able to watch Netflix and Hulu on my tv instead of on my computer. The only downfall is that is has to be plugged in. I was not aware of this when buying.", "verified": true, "helpfulness": "0/0", "author": "Carrie P."}, {"rating": 5.0, "review": "We had Chrome cast before this and I now only use this fire stick.  It works very nicely.", "verified": true, "helpfulness": "0/0", "author": "Lisa S. \"Lisa\""}, {"rating": 3.0, "review": "Has to be in the same room as your router.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]