[{"rating": 5.0, "review": "This is a great interface. It has a ton of apps to choose from and it has all my amazon streaming needs met. I wish it had Youtube on it as well. I can't wait for HBO Now to be added too. I like this so much that i plan on having one added to my bedroom so i can be entertained as well!", "verified": true, "helpfulness": "0/1", "author": "Megan"}, {"rating": 5.0, "review": "Works exactly as I expected", "verified": true, "helpfulness": "0/1", "author": "Julie Brown"}, {"rating": 1.0, "review": "Intermittent connection to internet despite being less than 10 feet from the router. Miracast does not mirror screen consistently. Limited WiFi connection range drops connection every 2 minutes so every movie I start is immediately stopped. Wish I could have invested in a technology that would have actually worked.", "verified": true, "helpfulness": "0/2", "author": "David Yip"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Jose Colegio"}, {"rating": 5.0, "review": "I love it and am going to cut my Dish Network viewing package down by about half. I also love no commercials.", "verified": true, "helpfulness": "0/1", "author": "E. Strickland \"grandma\""}, {"rating": 4.0, "review": "We ordered this Fire TV Stick but found that it would not stay connected to our wireless network.  Sometimes it wouldn't even find our network.  It was plugged into the HDMI at the back of our set.  We ended up ordering an extender after all other attempts to connect failed (read through all of the troubleshooting ideas on Amazon but none worked).  We ended up ordering an extension HDMI cable from CABLE-MIX ($7.99) and it solved the connectivity issues perfectly!  We are now enjoying watching Amazon Prime shows & movies.", "verified": true, "helpfulness": "0/1", "author": "TXbornlady"}, {"rating": 5.0, "review": "Easy to use and i love the access you have at the tip of your fingertips.", "verified": true, "helpfulness": "0/1", "author": "Isabel Coblentz"}, {"rating": 5.0, "review": "Order received in two days. Exactly what I ordered. Easy to install and use.", "verified": true, "helpfulness": "0/1", "author": "E.A.S."}, {"rating": 5.0, "review": "When I first bought item, I thought certain subscriber programs, like Netfix and Hula Plus were included in the software. It wasn' t so you had to subscribe to each program individually. bummer", "verified": true, "helpfulness": "0/1", "author": "GraemeD"}, {"rating": 5.0, "review": "Was easy to install and has given us many options for TV programs and movies", "verified": true, "helpfulness": "0/1", "author": "Bonnie Butler"}]