[{"rating": 5.0, "review": "Trouble free easy to install and a pleasure to use. I love amazon", "verified": true, "helpfulness": "0/0", "author": "Zamir Tarmu \"z\""}, {"rating": 5.0, "review": "I am very pleased with this device!Solidly built, all the pieces included were well though out logical components;USB/AC brick small enough and with folding prongs to be travel friendly,USB cord long enough to be useful,HDMI 'extension' dongle (which I use at home) to help fit high density plug areasInstant WiFi setupSo far the menu has been easy to use, with seamless mobile app/device integration (Samsung Note 3) voice search and shared watchlists work well.  And having Prime Video  remember play stop locations on the Stick is just plain cool.The PIN to purchase is a great addition for multi-resident/child homes. And quick enough to not slow down normal viewing.Definitely recommending this to friends as a great wi-fi streaming device, both home and portable.", "verified": true, "helpfulness": "0/0", "author": "Celebrin Veladorn \"CV\""}, {"rating": 5.0, "review": "I want to start off by saying this is my first device of this nature. I have only used my Kindles to stream video, so this was a great treat to be able to purchase for such a low price. I have a media center that is set up to accommodate many HDMI devices so it was a snap plugging it in and getting it power (I have a power strip right by my HDMI port hub). It did take some time to get going as it has to update itself, so be patient. Once it is going though, it was very easy to use. It has a very simple interface, which is nice. It is streaming very well. The only streaming issue I have seen is when we have several devices in our home trying to stream all at once. My 4 year old has started watching more of her cartoons on the TV now and not 2 inches from her kindle. It is just a great device and I am very happy about my purchase.", "verified": true, "helpfulness": "0/0", "author": "Sarah B \"Sarah B\""}, {"rating": 4.0, "review": "i like the functions better than apple on the controller", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 1.0, "review": "keeps dropping wifi, worked for 10mins, not worth the hastle", "verified": true, "helpfulness": "1/1", "author": "Luke"}, {"rating": 5.0, "review": "I am no techy. this was easy to use and works well.", "verified": false, "helpfulness": "0/0", "author": "Adele Barnett"}, {"rating": 5.0, "review": "extremely good for prime", "verified": true, "helpfulness": "0/0", "author": "Kenneth Howell"}, {"rating": 5.0, "review": "receptive, fast buffering, has all the apps i need and lots more. I like it better than my Panasonic 3 yr old TV built in media player which is good but this is much better.", "verified": true, "helpfulness": "0/0", "author": "Richchard Lewis"}, {"rating": 5.0, "review": "I love this! I bought it during the presale because, why not! I swapped out my chromecast in my bedroom and plugged this in. It is so far superior and easy to use it is unbelievable. Amazon beats Google AGAIN.", "verified": true, "helpfulness": "0/0", "author": "retrosnowwhite1979"}, {"rating": 3.0, "review": "everything is OK ! but I have fire TV in one room and fire stick on my TV. now I can get mirroring to work from Kindle fire HDX 7 to work on my TV with fire stick. And I can not disable enable mirroring on other TV with fire TV. amazon support on these things \" SUCK\"otherwise I am ok on stick", "verified": true, "helpfulness": "0/0", "author": "prakash"}]