[{"rating": 2.0, "review": "I originally plugged in the HDMI by its USB dongle into my TV. It wouldn't perform software updates and its performance was subpar. I gave up on the USB dongle and plugged the HDMI by its power outlet. The remote was very hard to open to insert the batteries and I nearly broke it. At the very first start up of the Fire Stick - the opening introductory videos were not closed captioned or english subtitles - I'm deaf and the opening introductory videos were rendered useless to me. I've had this for a month now and my remote is ficky and I often becomes frustrated with how crappy its built. Just the other day, I got notification from Fire Stick that my remote batteries were low and I was shocked, its only been 30 days and its batteries needs to be replaced, what the?! I have Prime, Netflix and Hulu Plus and I am unable to universally search for a movie, I have to individually search each one of them to find out if they have the movie available for me to watch. I have young kids and they easily figured out my secret Prime Pin - it is ridiculously poor designed. My boy could easily order on-demand movies and I'd be stuck with the bill because he knows my pin. The only good thing about the Fire Stick is that it is amazingly fast and the video quality has much improved.", "verified": true, "helpfulness": "0/0", "author": "Sonny Wasilowski"}, {"rating": 5.0, "review": "I am surprised I even leave my house anymore. Netflix, Pandora, Spotify, Twitch...all with one remote. And not through my bonkers PS3.Easy to use, and I'm signing up for Amazon Prime just to get to use that feature. Would LOVE to see YouTube functionality on this little gizmo, then I will never speak to anyone ever again.The remote is a little small and gets lost in the couch, but that just gives me an excuse to peel my bum off the couch. (I joke about being so slovenly and sedate, but Netflix binges are made so simple with this.)", "verified": true, "helpfulness": "0/0", "author": "Libby Liming"}, {"rating": 4.0, "review": "I have had it for about a month and I really can't say anything bad about it.  It's easy to set up, easy to use and has performed flawlessly for me so far.  If I find any problems with it, I will update this.  I have used it on 2 different vizio televisions (one of which I had initially forgotten had an amazon video app included in it which is why it is now on the second tv).  The only reason for 4 stars instead of 5 is because as with any such devices, they have their loyalties to particular apps and services and this will ultimately prevent it from being a perfect device.  That said, if your main goal is an inexpensive way to watch amazon video on your tv, you would be hard pressed to find something better.", "verified": true, "helpfulness": "0/0", "author": "R. Yetter"}, {"rating": 4.0, "review": "Did not have HBO to Go and MAX to Go, but the rest is excellent.  Plug and Play is you have an account already", "verified": true, "helpfulness": "0/0", "author": "Betsy E. Phillips \"Betsy\""}, {"rating": 5.0, "review": "love this thing", "verified": true, "helpfulness": "0/0", "author": "Devon T. Zambon"}, {"rating": 5.0, "review": "I just got the Fire Stick. It was easy to set up and simple to connect the remote and I was watching Prime Video. It is well worth the price!", "verified": true, "helpfulness": "0/0", "author": "Don J. Llewellyn \"High Roller\""}, {"rating": 5.0, "review": "Really love this item, works extremely well, easy to set up and with Prime allows a wide variety of entertainment availableI just completed an HBO series on JOHN ADAMS which was incredibly great to watch and understand more of what our founding fathers endured to accomplish Freedom for the great USA", "verified": true, "helpfulness": "0/0", "author": "Scotsman \"Scotty\""}, {"rating": 5.0, "review": "Much better than Chromecast.  I was able to use many more apps with the FIRE stick.", "verified": true, "helpfulness": "0/0", "author": "bulletbob"}, {"rating": 5.0, "review": "Works better than I thought possible.  I am on a slow DSL internet connection and movies still come across in full resolution without long pauses to buffer.  I dropped HBO and Stars once I had it a week.", "verified": true, "helpfulness": "0/0", "author": "Terry Jones"}, {"rating": 5.0, "review": "not single problem yet! amazing item and glad i got in at the intro price.", "verified": true, "helpfulness": "0/0", "author": "Tom mleko"}]