[{"rating": 4.0, "review": "Nice remote and internet access for not Smart HD tvs.  Works great", "verified": true, "helpfulness": "0/0", "author": "Jake Orbin"}, {"rating": 5.0, "review": "The fire TV stick works great. I had a few connection issues in the beginning but once it got up and running it worked perfectly. I use it on my son's TV to give him access to amazon instant video. He loves it. He is too young to just have a DVD player or other system out and this unit easily connected to the back of the TV. It was a great purchase. If you have another device that connects and does what you need, you don't really need this.", "verified": true, "helpfulness": "0/0", "author": "PB"}, {"rating": 2.0, "review": "This should be a great device, but only in theory...  They won't allow Apple users to get their \"remote app\" and can't stream even lowdef tv shows do to the fact that it won't keep an internet connection for more than 2 min! Apple TV may be expensive but it's a far better product with zero technical issues, get it instead", "verified": true, "helpfulness": "0/1", "author": "Jessica Watts"}, {"rating": 5.0, "review": "Easy installation and buffers data preventing stopping of movie for data movement while streaming.", "verified": true, "helpfulness": "0/0", "author": "Texas D \"Don\""}, {"rating": 5.0, "review": "Lot of movies , lots of games, many of them free, some you pay for. No problems so far with this thing.", "verified": true, "helpfulness": "0/0", "author": "Perry S \"Perry S\""}, {"rating": 5.0, "review": "This is the BEST thing I bought for Christmas!  I bought Fire stick so I could play my Amazon music on my home stereo system. Wow, it does this does that and so much more! I can play all my Prime movies and my uploaded my photo albums. Great speed, no lag or interrupts.", "verified": true, "helpfulness": "0/0", "author": "J. Ramirez \"J. Ramirez\""}, {"rating": 5.0, "review": "FireTV stick has been a wonderful upgrade to viewing experience of our old Xbox 360. I wish the darn remote was a bit bigger so it was harder to lose but Ill live. Controls are intuitive and it literally came out of the box loaded with my Amazon Prime account. it was a pleasure to setup, one of the best unboxing experiences I've had.", "verified": true, "helpfulness": "0/0", "author": "DustinLeblanc"}, {"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "kenneth peaden"}, {"rating": 5.0, "review": "I will expand only a little on my review of the FireTV. I took advantage of the $19 special for Prime Members and bought the FireTV stick as one of two presents to myself for Christmas. It came attractively and professionally packaged a la the fruit company. In addition to the stick you get the non-voice remote, power connector and cable with HDMI extender as well as batteries for the remote.I didn't opt for the voice remote as I rarely use it on my FireTV. I had it installed and updated in less than 10 minutes. Given I bought it from my Amazon account it was already registered to me. At start up it asks if you want to register as yourself or add a new account. The intro video was changed to reflect the FireTV stick and nowhere did they say FireTV incorrectly. It is a very good intro video BTW so pay attention. It's a nice touch that you can watch it again if need be. The set up also prompts you to connect to your WiFi network which it did without fault.I tried a few apps and installed Plex which works wonderfully with FireTV/Stick. I run a server with most of my media and my old AppleTV was beginning to struggle with these duties. Speaking of media if you upload all of your pictures to Amazon for free you can see them on the FireTV devices.To me the performance was as good as the full FireTV box for a lot less money. I don't play games so I can't comment on that type of performance. It can use a remote or game controller just like the FireTV. You can buy the voice remote, but that is more than the special $19 price for the stick so I opted out.I won't repeat the interface review like I did on the FireTV. It is a bit busy, but you get used to it. My thought are otherwise the same. Good performance at a good price. If you are heavy into the Amazon service this is a no brainer as it lets you easily cruise the Amazon ecosystem such as Prime Videos, Prime Music, Photos or other media you have on Amazon. I do have all my  mp3's on Amazon so I can listen to them through the FireTV/Stick. Other similar devices list over 1500 apps, channels, etc. I only use a few and FireTV/Stick has all of them and so far I am pleased with both devices.", "verified": true, "helpfulness": "1/1", "author": "awraynor \"awraynor\""}, {"rating": 1.0, "review": "Slow and buggy. Remote keeps locking up. Can't get the Kindle Fire HDX 8.9 to cast the display, but will display from my Galaxy S4 Active. Quality of picture from casting is horrible, jerky and freezes. Don't see how this is Miracast compatible if that won't work from their own device. Glad I only paid $20 for it.", "verified": true, "helpfulness": "0/0", "author": "w.sawyer"}]