[{"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Lissandra Salinas"}, {"rating": 2.0, "review": "Great tool but slow right out the box. Every move you make with the remote control has a 1-2 second delay. If it was faster would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I decided to order the amazon fire stick as an early father's day present for my husband (he really wants the tv, but  this was as close as I could get lol!). We had gotten rid of cable about a year ago and simply stream television through our ps3. Unfortunately, our ps3 has been nearly depleted from use (we also used it for our movies for the kids). I decided to check out the different fire devices available and after reading some reviews and asking hubs what he thought of it, I bought it. We have been pretty happy with it so far. The only issue is when attempting to watch anything on hulu, it pauses CONSTANTLY! it is really irritating! I am still researching the issue. With everything else (Netflix, Amazon Prime TV) I am very pleased with it and my husband likes it too :) I would definitely recommend it, just be prepared to have hulu pause a lot if you use it (If I find a solution I will post it).", "verified": true, "helpfulness": "2/2", "author": "Firefightingmama14"}, {"rating": 5.0, "review": "perfect for child's bedroom t.v.", "verified": true, "helpfulness": "0/0", "author": "Jane A."}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "jerry noe"}, {"rating": 5.0, "review": "Really good", "verified": true, "helpfulness": "0/0", "author": "Barbara Ann Meadows"}, {"rating": 3.0, "review": "Convenient and simple.  Cannot use the power via usb port from TV set.", "verified": true, "helpfulness": "0/0", "author": "Spot"}, {"rating": 3.0, "review": "Apps are good.  Performance is spotty.  Some days it's like broadcast tv...some days it's not usable (buffering and disconnects).  Not sure if it's a problem with the Fire TV Stick or the Time Warner Cable connection or something else", "verified": true, "helpfulness": "0/0", "author": "JC in Durham"}, {"rating": 5.0, "review": "It is easy to set up and we like the form of the menu.", "verified": true, "helpfulness": "0/0", "author": "Tippy"}, {"rating": 5.0, "review": "This was a gift for my father. He loves it and says he is in \"sci-fi heaven.\" It was extremely easy to set up and could be considered 'plug and play.\" The available apps are endless. After a week of use, it hasn't had to buffer once. In my opinion, the Fire TV stick is well worth it.", "verified": true, "helpfulness": "0/0", "author": "Watersmeg"}]