[{"rating": 5.0, "review": "This was the BEST Christmas gift. So simple to set up & use.  Love having access to TV & movies.  Everthing about Amazon (products, customer service, returns/exchanges, etc.) is AWESOME ... including the Fire Stick!", "verified": true, "helpfulness": "1/1", "author": "AHV"}, {"rating": 4.0, "review": "pretty cool, is there no sleep mode were  you can set it to turn off in like1 hour 3 hours ...? the power chord  is not long enough to reach the wall. also sucks with amazon prime video, you can not see while you are fast forwarding, or see screen shots like netflix.  The remote gets stuck fast fowarding and if you barely bumb itCant watch hockey on here", "verified": true, "helpfulness": "0/0", "author": "cc \"winst\""}, {"rating": 4.0, "review": "Perfect for Hulu.Very glad it came with a short HDMI cable because my TV's port is vertical.Two complaints:The micro-USB port should NOT be perpendicular to the device, it should be parallel. It's an awkward design that looks ugly, tangles my wires, and bends the cord. They only put it on the side to distinguish the device from Chromecast.The regular remote is tedious in text searches. I can see why people buy the voice remote.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 1.0, "review": "I am not happy with this order. The product is ok but it needs an adapter to fit my TV. When talking with a co-worker he got the same product from Amazon for less money and itcame.with the adapter. Not only did I getovercharged but I was shorted the adapter. Not good.", "verified": true, "helpfulness": "0/0", "author": "Pamzcakes \"Pammy\""}, {"rating": 4.0, "review": "Love kodi but wish i could see my installed apps on the recent page.", "verified": true, "helpfulness": "0/0", "author": "Heroina Fernandez \"uss809\""}, {"rating": 3.0, "review": "I loved this at first... Then came the constant freezing. Every time we wAtch a show. I even have a wifi booster so that's not the problem! I am considering returning it.", "verified": true, "helpfulness": "0/0", "author": "Amarie0070"}, {"rating": 5.0, "review": "Bought this to use in our 5th wheel and have no complaints!", "verified": true, "helpfulness": "0/0", "author": "Sommer"}, {"rating": 3.0, "review": "It would be a 5 if it wasn't constantly buffering.  My WiFi connection is strong, but it still stops several times throughout streaming.", "verified": true, "helpfulness": "1/1", "author": "tiff hayes"}, {"rating": 5.0, "review": "This product provides me with endless entertainment so far. I haven't watched TV for a long time since I bought this. Easy to install, fast download and streaming, and everything you need to replace your cable company.", "verified": true, "helpfulness": "0/0", "author": "koprok"}, {"rating": 5.0, "review": "Love it so much we bought another one!", "verified": true, "helpfulness": "0/0", "author": "barbling"}]