[{"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "SheilaAnn65"}, {"rating": 5.0, "review": "The Fire TV stick is great!", "verified": true, "helpfulness": "0/0", "author": "Randi Clatchey"}, {"rating": 4.0, "review": "I like the operation and the content. My TV picture, which us adjusted perfectly for cable and OTA is dark with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Smooth Charlie J \"SMJ\""}, {"rating": 5.0, "review": "We love this!  Now seeing our favorite college teams and many new tv series-nearly all for free through Amazon Prime and Netlix.We are avid tv viewers and are always searching for that next great series or documentary and it's all here.The enclosed extension adapter makes the plug in simpler: the remote is effortless to use, and navigating is a breeze.LOVE it!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"MEJ\""}, {"rating": 5.0, "review": "I am very impressed so far with the Fire Stick, it works much better on my Sony non WiFi set than the onboard WiFi works on a much newer Samsung. Great picture quality, good interface, Very quick to load, and the remote is well designed and intuitive to use.I may end up getting another for my other set if the new router Xfinity sends is not any better than the current one. Xfinity has been a BIG disappointment, BTW, but I am basically stuck as it is part of a package negotiated by my HOA.", "verified": true, "helpfulness": "0/0", "author": "David R. \"m14e2\""}, {"rating": 5.0, "review": "I have fallen in love with this television add-on. I'm able to keep all my media apps in one spot while being able to watch the Prime video selections.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "Easy to install and easy to use. I've never tried to stream anything and it talked me all the way through.", "verified": true, "helpfulness": "0/0", "author": "Susan Hayes"}, {"rating": 5.0, "review": "It works great.", "verified": true, "helpfulness": "0/0", "author": "JEB"}, {"rating": 5.0, "review": "Dear Amazon, using Amazon Prime videos on other devices tended to be clunky and slow, no good watchlist, no way to find what I wanted while wading through the immense volume of content. THIS CHANGES EVERYTHING. The interface is fast, and I mean fast, and smooth, and perfect. It is easy to use, easy to find my videos, prime videos, videos I've already watched, and everything else. Dear Netflix: Take notes, your apps have been running really really slow on everything I use lately, they take forever to load. Amazon Fire Stick here destroys Netflix in responsiveness.", "verified": true, "helpfulness": "1/1", "author": "Don Cristobel"}, {"rating": 4.0, "review": "My daughter gave the fire TV stick to us as a Christmas present.  We are pleasantly surprised by all the movies and TV shows that we now have access to via the Fire TV.  Great gift!", "verified": true, "helpfulness": "0/0", "author": "Melva Meminger"}]