[{"rating": 4.0, "review": "I love the way I can use amazon file for all different apps.", "verified": true, "helpfulness": "0/1", "author": "Rachna Pathak"}, {"rating": 5.0, "review": "Totally has replaced my Blu-Ray Wifi DVR player.  Very easy set up to the TV and to my Netflix, HBO, and Showtime.", "verified": true, "helpfulness": "0/0", "author": "jeannine612"}, {"rating": 4.0, "review": "Great Investment. I am a Certified Personal Trainer and the access to the music is great, especially the access to the 80's songs, love it... Also the movies are great and I have found a few TV series that I have watched that I had never even heard of before.  Recommend!!", "verified": true, "helpfulness": "0/0", "author": "Vic Whitehead"}, {"rating": 4.0, "review": "Bought this as a gift for my parents and they are very pleased.  Easy to work and now they are able to view Amazon Prime and Netflix through their TV.  Solid Product!", "verified": true, "helpfulness": "0/0", "author": "TXMOMOF2"}, {"rating": 5.0, "review": "YUp- well worth the money spent", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Met all our expectations!  Easy to install, easy to program.  Had a little trouble navigating the remote until I looked it up on the internet and found out what all the buttons meant and how to navigate.  Including that information in the box would help.  We were worried our WiFi wasn't working, or sending a good enough signal, because our $1,000 plus blu-ray sound system would no longer connect to the internet.  So we were delighted when we plugged it in, and it connected with the internet immediately and we were able to start streaming movies with no stops for \"buffering\".  We are going to order another for our other not-so-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Linn"}, {"rating": 5.0, "review": "Awesome, just as good as the Fire Tv in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Toni de la Vega"}, {"rating": 2.0, "review": "I had little luck with the fire stick.  After multiple attempts to get it to work well and even getting a replacement, Amazon did give me a refund which was nice.  The layout and design is great.  Its just that the functionality is terrible.  Constant buffering on netflix and streaming apps ruined it for me.  Prime even buffered at times.  It seems the device is a great work in progress, but not worth the headache.", "verified": false, "helpfulness": "0/0", "author": "matthew wanat"}, {"rating": 4.0, "review": "The fire stick is much better than many of the android boxes I bought over the years. It is a real value for money . Yes it has less power than many of the boxes in market today but it is stable and well supported .", "verified": true, "helpfulness": "0/0", "author": "alik"}, {"rating": 1.0, "review": "I tried to buy this on your \"Black Friday\" sale yesterday at 6 am and they were sold out. How many did you put aside for this sale, 5? It wasn't just about this Fire Stick as there was a lot of items gone before I could get to them.", "verified": false, "helpfulness": "1/7", "author": "Beverly Chivers"}]