[{"rating": 5.0, "review": "We have only watched the Michael Connelly series so far but really like it.  We are not very technical savvy but find it easy to use. It was a gift and they installed it and showed us how to use it.  We have a second home and it is easy to take there because it is so small and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Gramma"}, {"rating": 1.0, "review": "It's a good idea, but it frequently freezes and has to be rest. I wanted it as a replacement for streaming via my computer/tv Hdmi connection, but it is turning out to be more of a pain than it's worth. Also, the tablet/phone app is almost useless, try something else.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Could NOT be happier with this purchase!  VERY easy to set up and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "findjul"}, {"rating": 5.0, "review": "I am happy with the Fire TV Stick.  It was easy to install and provides a variety of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Anita McFarland"}, {"rating": 5.0, "review": "It's ok. Thanks", "verified": true, "helpfulness": "0/0", "author": "Mary Alvarez"}, {"rating": 5.0, "review": "Awesome.  Live the stick.", "verified": true, "helpfulness": "0/0", "author": "David W. Wilson"}, {"rating": 5.0, "review": "This is GREAT and saved me from buying a new Smart TV.  It came today and I have been watching Netflix, enjoying my music and already uploaded all my photos from my phone.  I just went back a ordered 2 more as gifts.", "verified": true, "helpfulness": "0/0", "author": "wando"}, {"rating": 5.0, "review": "Easy to set up. So far, so good.", "verified": true, "helpfulness": "0/0", "author": "B. Kauntz \"Beaver\""}, {"rating": 5.0, "review": "It's ok. I  love It", "verified": true, "helpfulness": "0/0", "author": "Edgar A. Diaz Mendoza"}, {"rating": 5.0, "review": "Provides endless choices for entertainment.  Wish I would have bought a long time ago.", "verified": true, "helpfulness": "0/0", "author": "jdt2013"}]