[{"rating": 5.0, "review": "Works much better than Roku when the signal is not strong!", "verified": true, "helpfulness": "0/0", "author": "Ebquillen"}, {"rating": 4.0, "review": "Easy to install, a little clunky to use.  I am replacing cable so it is tough to go from \"Channel Up\"-ing through 100 channels.  The quality is fine.  Good or bad, the Fire TV stick has substantially cut down on my TV time.  I bought Sling TV to get a few cable channels and I hooked up an HDTV antenna to get the local DFW channels.  Saving almost $70 per month makes it all worth it.  Considered adding one of the $5 add-on packages on Sling, but will save that decision for the end of the 3 month free trial.  Sling costs $20 per month and if you pay for three months in advance, the Fire TV stick is free.  I wonder if I would watch more Netflix if it were in channel format - Netflix Classics, Netflix Action, Netflix Cartoons, etc.", "verified": false, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "Works well, but the picture comes in very pixelated and freezes every now an then due to slow internet connection if anyone else is using the internet at the same time.", "verified": false, "helpfulness": "0/0", "author": "John Sparks"}, {"rating": 5.0, "review": "Great performance out of the box.  Works beautifully with our Wifi and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Paula Deen \"chief cook\""}, {"rating": 5.0, "review": "It's great to see my favorite Netflix movies and TV shows on my big screen TV. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "kathryn J. Mohney"}, {"rating": 3.0, "review": "It is great for watching Netflix.  I just was hoping for more apps like AMC, CMT and MTV so that I can also watch the other shows I like. Hopefully that will come in an update but I think I might have to wait on that.", "verified": true, "helpfulness": "0/0", "author": "Sean Scott"}, {"rating": 4.0, "review": "A little difficult to install because of my wall mount but works great", "verified": true, "helpfulness": "0/0", "author": "Gary W Langley"}, {"rating": 5.0, "review": "I absolutely love it! I got the Google chrome first, I was at Wal-Mart, and its not compatible with my phone and Kindle Fire tablet, and no remote. Needless to say, I returned the Google chrome and went 15 miles to another town to go to Best Buy. Sooooooooooo very happy with my Fire stick.and I love my Kindle Fire tablet, which I've had for 3 years. I'll stick with Amazon.", "verified": true, "helpfulness": "0/0", "author": "This game is so cool!!!! I downloaded the App for my grandson but I love the game."}, {"rating": 3.0, "review": "I purchased this for my mother because, unlike a chromecast, the Fire TV Stick has a dedicated remote.  Unfortunately, the interface is extremely Amazon centered and, as my mother isn't very good with technology and the interface doesn't allow the user to filter out content that has an additional cost vs. content that is free with your Amazon Prime Instant Video service, she is always fearful that she will accidentally buy something and avoids the Amazon Video Content entirely.  I guess it is a win-win for Amazon.  They get the money and accidental purchases or they don't have to render any services and get the money for free.Also, the voice search functionality only works with Amazon Instant Video and, because of the above mentioned limitation, is therefore useless.  If it weren't for the fact that older generations are often more comfortable with a dedicated remote I'd honestly have preferred a chromecast. She is, however, managing with the Fire TV Stick well enough.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 3.0, "review": "It's cool to have all the APP \"in\" the device and be able to navigate using the remote. But at the same time, there is a limitation regarding the apps you can use with it", "verified": false, "helpfulness": "0/0", "author": "Pablo R."}]