[{"rating": 5.0, "review": "Plug it in and Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Toni Y"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Fred Heiss"}, {"rating": 3.0, "review": "Serves the purpose:This was my first streaming stick and what I read about the stick through reviews did not give me the full picture of what this included and did not include.  I thought I would be able to watch my iPad content from the stick but it does not allow that with apple products.  If you are Amazon Prime member this is probably the perfect stick for you.  I did find I can watch HBC GO and the reviews said that wasn't an option.  But between HBC GO and Netflix, that is all I can watch.  I tried Crackle but it would not stream well.. and at times HBC GO doesn't stream well either, but Netflix always seems to work well.  It's like that is the application that this was designed to show.  Buying this didn't give me the options I had hoped for but it did allow me to disconnect from cable for at least one TV at our house.", "verified": true, "helpfulness": "0/0", "author": "S. M. Brown \"Emerald Eyes\""}, {"rating": 5.0, "review": "I'll never go back to cable AGAIN!!!!! I'm about to upgrade my student prime membership so that I can get Amazon instant video. I AM SUPER IMPRESSED!!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelente !¡¡", "verified": true, "helpfulness": "0/0", "author": "fausto espinal"}, {"rating": 5.0, "review": "LOVE IT.", "verified": true, "helpfulness": "0/0", "author": "Michael Burns \"Burnsie13\""}, {"rating": 3.0, "review": "It works ok, just wish it had more Apps. Like GETV, Feeln, Joyce Meyer and I noticed while watching it choppy streaming on some apps.", "verified": true, "helpfulness": "0/0", "author": "BigBoiJ"}, {"rating": 3.0, "review": "The device is ok but the remote is a piece of crap. Use a regular tv remote with it.", "verified": true, "helpfulness": "0/0", "author": "plata"}, {"rating": 2.0, "review": "I purchased the Amazon Fire TV Stick. So far I love it. It is a very convenient way to watch Amazon Prime Videos without extra cords, I am very happy so far, and the price is great. I have yet to explore the other features of the Fire TV Stick, but it is definitely a great deal. Or so I thought. I can't use other Wi-fi devices while watching prime videos.", "verified": true, "helpfulness": "0/0", "author": "Pat from Philly \"Pat from Philly\""}, {"rating": 5.0, "review": "This is just to cool!!!", "verified": true, "helpfulness": "0/0", "author": "Charles Eduardos \"Transformation Coach, Motivational/Inspirational Speaker\""}]