[{"rating": 5.0, "review": "So many apps on the home page! Everything from movies, games, TV shows and live TV. The Fire TV Stick is unbeatable!", "verified": true, "helpfulness": "0/0", "author": "JW"}, {"rating": 5.0, "review": "I LOVE my Amazon fire stick.  It is so easy to install and I have been able to view multiple seasons of TV shows that I never had the opportunity to see.  I love how there are no commercials during the shows and that it automatically goes from one episode to the next.  They also have a great selection of movies to view.  My only regret is that I did not buy this long ago. It has already paid for itself because my local cable company charges a ridiculous amount for earlier seasons of TV shows that I was able to view at no cost after purchasing my fire stick.", "verified": true, "helpfulness": "0/0", "author": "Pat Halbe"}, {"rating": 5.0, "review": "The Fire Stick works remarkabley well. The instuctions that were included,though, were very basic and vague. It would've been helpful to have more detailed instructions on how to navigate the set-up with the remote. We discovered how to do that by trial and error and it was alittle frustrating. The product itself, however, is awesome!!", "verified": true, "helpfulness": "0/0", "author": "Khuriun"}, {"rating": 5.0, "review": "Quick delivery easy set up.", "verified": true, "helpfulness": "0/0", "author": "maria"}, {"rating": 5.0, "review": "Love it! Addicted to prime!", "verified": true, "helpfulness": "0/0", "author": "Denise McKee"}, {"rating": 5.0, "review": "Exceed my expectations.  Unlike Google stick which can only be controlled by phone (with app) and no include remote, or Roku,  which does not offer cell phone control, this has the best of both worlds.  Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Got it for the discounted price early on. We don't have an internet TV but not I feel like we do. Basically use Amazon Prime Music/Video, YouTube, and Netflix. The all work great. The reason it gets a four is b/c sometimes we have connection issues with the firestick - it's definitely the fire stick b/c our laptops, kindle, phones, and ipad do not have issues.", "verified": true, "helpfulness": "0/0", "author": "Shawn E Fellows"}, {"rating": 3.0, "review": "Viewster doesn't work fine (Fire TV control is weird on this app), Crackle doses't work at all and when I use CrackleR it displays \"script error\" so I can't see movies. IGN and WWE Network work fine.", "verified": true, "helpfulness": "0/0", "author": "Norman Urbina"}, {"rating": 5.0, "review": "Soo cool love this this thing", "verified": true, "helpfulness": "0/0", "author": "Cara B."}, {"rating": 5.0, "review": "Love this, hardly watch netflix any more. very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Selina TX"}]