[{"rating": 4.0, "review": "What one gets for the price makes it a great purchase.  I love the fact it comes with a remote.  I received the product when promised and it was very easy to set up and begin using.  Over the course of about 2 or 3 weeks however the remote would seem to stick.  It got to where when I tried to scroll up, down, left, or right to make selections the scrolling would not stop until it went as far in one direction as possible...can't just scroll 1 item as a time. Before this issue the device was a dream to have.", "verified": true, "helpfulness": "1/1", "author": "Vincent Lancaster"}, {"rating": 1.0, "review": "Do not buy.I don't normally leave reviews (although appreciate those who do) but this product is pointless. It can not keep network connectivity at all. I have no issue with other devices at home, but this streams for a couple minutes and then freezes or buffers. I have now read multiple reviews with the same comments but not anything from amazon on how to rectify. The box might be better to correct direct but the stick is not a good purchase if you want to stream off wifi. Boo amazon.", "verified": true, "helpfulness": "1/1", "author": "Jesseca L. Marchand"}, {"rating": 4.0, "review": "I usually use by blue ray player to connect to netflix, amazon prime etc.  The fire stick is quicker access, but the menu is not user friendly and I find myself going back and starting over when I can't find what I am looking for.", "verified": true, "helpfulness": "1/1", "author": "smgill70"}, {"rating": 5.0, "review": "Works nice if you have Amazon", "verified": true, "helpfulness": "0/0", "author": "Robert T. March"}, {"rating": 5.0, "review": "So easy to use, I love amazon prime but had never used the video offers. This is a great product.", "verified": true, "helpfulness": "0/0", "author": "S. Verross"}, {"rating": 5.0, "review": "It's great!!!!", "verified": true, "helpfulness": "0/0", "author": "marvin reeves"}, {"rating": 5.0, "review": "Very Happy With This Item!", "verified": true, "helpfulness": "0/0", "author": "Curtis Jones"}, {"rating": 5.0, "review": "EXCELLENT!", "verified": true, "helpfulness": "0/0", "author": "Juanita"}, {"rating": 5.0, "review": "Love it! We mainly use it for Netflix and Spotify", "verified": true, "helpfulness": "0/0", "author": "Emily Gonzalez"}, {"rating": 4.0, "review": "Great, sometimes has trouble connecting to internet but usually ends up working.", "verified": true, "helpfulness": "0/0", "author": "Mike Latocha"}]