[{"rating": 2.0, "review": "Advertised that you could stream your video's from your kindle to your Television. FAIL, you can only do this with Amazon video's. I like to watch CBS, ESPN, TNT..... and others.  If I am watching amazon on the tablet I would just turn on the Television and access Amazon through the stick.  I envision being able to do away with the an HDMI cable running from my computer to the Television or relocating my laptop, Definitely not what was advertised, going back to ROKU.amazon is proprietary: You cannot access GOOGLE store from a Kindle Tablet....., AMAZON should be careful or they will find themselves like BETA.  Going back to my ASUS tablet and ROKU.", "verified": true, "helpfulness": "0/1", "author": "Mike C."}, {"rating": 5.0, "review": "As an Amazon prime member for several years and a huge amazon fan, this is a perfect addition to the Amazon family of products.  Streams movies, TV shows, etc seamlessly. I have tried the Comcast in the past, and it did not work at all.", "verified": true, "helpfulness": "1/1", "author": "Melinda Van Kooten"}, {"rating": 5.0, "review": "i'm love this thing FOREVER i love itd it i'm the happiest girl EVER just saying", "verified": true, "helpfulness": "1/1", "author": "Ashlyn"}, {"rating": 5.0, "review": "Fantastic and easy to use", "verified": true, "helpfulness": "0/0", "author": "Paul Wersten"}, {"rating": 5.0, "review": "Is better than roku si faster is  cheaper i give 5***** to this item", "verified": true, "helpfulness": "0/0", "author": "saul"}, {"rating": 4.0, "review": "Amazons Firestick met my expectations as a useful add-on to my TV set.  My son-in-law installed it in about 20minutes.  Apps are easy to get and use once you get an account with Amazon.  I like the idea of an RF wireless controller design as there's no issues with making sure you have to point it to the device.  The only down side to the regular controller is sometimes it double clicks which means you can pass the selection you want to make and you have to back track.  I'm going to get the upgrade controller soon because of that.  It's too bad I can't use my Kindle touch with the Fire stick as I could use it to type in text for searches much easier.", "verified": true, "helpfulness": "0/1", "author": "Mike Chibnik"}, {"rating": 2.0, "review": "Will not play Dolby Digital 5.1 audio over HDMI, insists on using Dolby Digital Plus only.  Guess it's back to the PS3 for Netflix.  Stupid.", "verified": true, "helpfulness": "0/0", "author": "Zefram"}, {"rating": 3.0, "review": "I only say this because I never gout it to download ! Then I found out it was my phone company Cenrturylink which said I have the seep but not with a wifi so I can't even say if it works or not but not on my system I'm not blaming the fire stick but I can't rate it other than my download speed!", "verified": true, "helpfulness": "0/0", "author": "Rosario R Felice"}, {"rating": 2.0, "review": "I am so disappointed with this product.  When I first got it, I loved the look of it.  The changing pictures with each show on Netflix were awesome.  However, I had to start unplugging it to reboot more and more frequently.  I got so frustated that I moved it to a different TV.  Same problem.  This is totally ridiculous!", "verified": true, "helpfulness": "0/0", "author": "Z Man \"Z Man\""}, {"rating": 5.0, "review": "We have used this product daily!! The whole family has enjoyed having access to ALL the movies and TV shows available for free since we have Amazon Prime. It was a terrific investment and we are planning on soon cancelling our service provider since there are so many options with this little TV stick.", "verified": true, "helpfulness": "0/0", "author": "Tracy Miller"}]