[{"rating": 2.0, "review": "Wifi on it works only half the time. Plus didn't have an app that was supposed to work on itm", "verified": true, "helpfulness": "0/0", "author": "fred rentz"}, {"rating": 4.0, "review": "Works as you would hope. Easy set up and pretty intuitive. No brainer if you have Prime already.", "verified": true, "helpfulness": "0/0", "author": "Robb P"}, {"rating": 5.0, "review": "Can't beat the technology for the price", "verified": true, "helpfulness": "0/0", "author": "Scott E"}, {"rating": 2.0, "review": "dissappointed", "verified": true, "helpfulness": "0/1", "author": "Jessie McDougald"}, {"rating": 5.0, "review": "The performance is awesome for such a little thing. The only problem is that it doesn't go to sleep automatically. i.e. it continues to use energy even when you are not using it for hours. I wish they fix this issue with a firmware update or something.Even if they fix this issue as this stick needs its own charger (as it needs a currency that can't be provided by regular usb connections), the energy consumption is unnecessarily high even if it goes to standby or something as chargers in general waste energy even if the device is off.", "verified": true, "helpfulness": "0/0", "author": "Amir"}, {"rating": 3.0, "review": "Needs HBO go and mine seems to buffer a lot", "verified": true, "helpfulness": "0/0", "author": "Schalim Tyrrell"}, {"rating": 4.0, "review": "Really nice product. No problem connecting it to our wireless network and it works great for accessing Amazon Prime content. The screen mirroring feature is well behind the Google Chromecast device. I purchased this device for Amazon Prime access and it is a star for that. Too bad they didn't spend a little more development on the screen sharing feature. Would have made it a \"10\" if they would have.", "verified": true, "helpfulness": "0/0", "author": "B. Guffey"}, {"rating": 5.0, "review": "My son and I love it!", "verified": true, "helpfulness": "0/0", "author": "Petula Kelly"}, {"rating": 4.0, "review": "had problems with setup. contacted customer service and they tried to resolve problem. went as high as 2nd level tech services and problem was resolved. a few days later. its still working.", "verified": true, "helpfulness": "0/0", "author": "Richard Berezanich"}, {"rating": 5.0, "review": "Perfect item.Small size, big use.Can install android APP very easy by 3rd party software.It's one I want.", "verified": true, "helpfulness": "0/0", "author": "Bin Zhang"}]