[{"rating": 5.0, "review": "So far, so good. The video and audio are excellent. My concern was the streaming. We have a mid-level DSL speed service and there has been absolutely no buffering at all. My wife says the \"heck\" with Redbox!", "verified": true, "helpfulness": "1/1", "author": "H"}, {"rating": 5.0, "review": "Love that it comes with a remote. I'm giving one to my mama and she doesn't have a smart phone so this is great for her!", "verified": true, "helpfulness": "0/0", "author": "sumrniam"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "RIKKI CHILDS"}, {"rating": 5.0, "review": "amazing product!", "verified": true, "helpfulness": "0/0", "author": "Daniel Hussey"}, {"rating": 5.0, "review": "This Fire TV Stick is awesome. My only regret is that I  didn't purchase  2. Good  product!!", "verified": true, "helpfulness": "0/0", "author": "Glenda Hunt-Wright"}, {"rating": 5.0, "review": "So far I love it!", "verified": true, "helpfulness": "0/0", "author": "Katie Lewandowski"}, {"rating": 4.0, "review": "Love this unit.  the only problem I've had is that it will drop my wifi occasionally requiring me to unplug the power to restart it.  Wish there was a software boot option (not just the reset option which removes all settings).", "verified": true, "helpfulness": "1/1", "author": "Keith Salisbury"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "Eugene Gimblet"}, {"rating": 5.0, "review": "Turns a non smart tv into a smart tv. Works great", "verified": true, "helpfulness": "0/0", "author": "TSKW"}, {"rating": 4.0, "review": "If you are not tech savy, this item is absolutely amazing.  But chromecast is still better in my opinion.  The acess to Amazon's services is quite amazing, and useful.  But there are downfalls.  The pros other people have listed are valid.  Though I decided to give mine to my parents instead, it is still quite a nifty device.  Here's some info though that might affect your decision to buy one though.- The GUI is quite cluttered, and almost confusing.  The layout is not very easy to use.- For having 4x the power of the chromecast, it actually seems slower to respond (Probably because of the cluttered and overly busy gui taking up it's resources).- You can not stream files from your computer like the chromecast can with the videostream app (Which is the main reason I bought the chromecast).  Now, keep in mind the chromecast did not have this ability at first either, but was later added as a third party app after launch - so the same thing might be true for the fire tv.  If that's the case, I may have to buy another one!", "verified": true, "helpfulness": "1/1", "author": "Zach Torino"}]