[{"rating": 5.0, "review": "Love this thing.  Great selection of programs to watch.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Sandra Kluck"}, {"rating": 5.0, "review": "My son got me this for my birthday and I love it!  The set up was very easy and the range of options the Fire TV Stick is very wide.  I'll team it up with Amazon Prime and perhaps one other streaming source and be completely content.  We gave up cable/satellite a while ago and I feel like we're getting everything we liked and losing all we didn't like or didn't use.  It'll cost a small fraction of what we were paying before.", "verified": true, "helpfulness": "0/0", "author": "Steven P Jewett"}, {"rating": 4.0, "review": "Well over all its a quality item but we have had some problems with it like the speed and connection and has had glitches has been a problem and its notmour internet. But like i said its a good investment with a unbeatable price $39 is a cheap price. I have to give amazon two thumbs up.", "verified": true, "helpfulness": "0/0", "author": "Cecile Gabriel"}, {"rating": 5.0, "review": "Works great !", "verified": true, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 5.0, "review": "This thing works well and it's the cheapest way to watch Netflix on a non-smart TV without hooking computer to television.", "verified": true, "helpfulness": "0/0", "author": "Cameron"}, {"rating": 5.0, "review": "gift for mother works great loved it", "verified": true, "helpfulness": "0/0", "author": "Sarah \"sarah\""}, {"rating": 1.0, "review": "I bought a Roku 2 last year and we loved it and after just a month my family realized that we had not used regular cable at all.  This led us to \"cut the cable\" and we bought two Roku Sticks for the bedrooms. Again, Loved.  We did miss live sports, so when Amazon had the Sling offer, we jumped on it.  A free Fire Stick! Just pay $60.00 for 3 months of Sling. OK.  This stick is nowhere near the quality of the Roku.  It freezes, buffers, stops working and re-connects to wifi about 30 times a day if not more, and that is when we can get it to work at all!  It also likes to say that the wifi signal is poor or that it is not connected at all.  It sits about two feet from our brand new router connected with the highest internet speeds available from Time Warner Cable.  I cannot recommend this product.  It is just too poor of a quality.  Just wish that I would have bought the Fire Stick on it's own.  At least then I could have returned it for a refund.  Instead, I took a \"deal\" and ended up costing me more that the retail value of the Fire Stick and am unable to recoup any of my money at all.  Buyers Beware!", "verified": true, "helpfulness": "1/1", "author": "tiffany david"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "thuan phan"}, {"rating": 1.0, "review": "It's the worst streaming device I have ever used. We got it so we could watch Netflix in the bedroom and 90% of the time movies and videos are unable to fully load. If you have money to blow, I'd suggest anything but this piece of junk.", "verified": false, "helpfulness": "0/1", "author": "Patrick Riffe"}, {"rating": 5.0, "review": "I love it. It's so easy to operate.", "verified": true, "helpfulness": "0/0", "author": "YBaxter"}]