[{"rating": 1.0, "review": "It was easy to install but it was also our 2nd one but terrible streaming.  Will select, stream for 5 mins max, then cut out to build then same process over again.  Don't evan try to use now!!!", "verified": true, "helpfulness": "0/0", "author": "Patricia Yankovich"}, {"rating": 5.0, "review": "For something so small, this works great.", "verified": true, "helpfulness": "0/0", "author": "ML"}, {"rating": 5.0, "review": "Easy to install.  It made installing Netflix simple.  A friend also has Fire stick and loves it.", "verified": true, "helpfulness": "0/0", "author": "Kay F. Dooley"}, {"rating": 3.0, "review": "Set-up was easy. I could not get HuluPlus or Netflix to work with my TV. No problem with either Netflix or HuluPlus on my laptop or tablet.", "verified": true, "helpfulness": "1/1", "author": "Stephen J. Meyer III"}, {"rating": 5.0, "review": "I LOVE the Amazon Fire TV Stick! So simple to set up and get going and it works beautifully! Because of where my TV is located in the house I was unable to get any local reception and the game box I was previously using to stream Netflix was no longer working consistently so I was out of luck when it came to watching movies or shows... and now it's all back! No buffering, no error messages, no fuzzy picture. Thank You!", "verified": true, "helpfulness": "0/0", "author": "Mary K. Weinhagen"}, {"rating": 5.0, "review": "Works excellent. VERY FAST AND FLUID. I want more popular apps (YouTube Oficial and Social Networks apps)", "verified": true, "helpfulness": "0/0", "author": "Jeffry Guillen"}, {"rating": 5.0, "review": "aweaome", "verified": true, "helpfulness": "0/0", "author": "Anthony Rios"}, {"rating": 4.0, "review": "Very good product.. A great addition to my prime membership..much easier to watch on my large tv rather than my i pad..", "verified": true, "helpfulness": "0/0", "author": "john richards"}, {"rating": 2.0, "review": "Many of the movies I have rented wont play or it says \"your internet connection is too slow.\"  I have the fastest internet my cable company allows.  I love the fact I can watch free movies when it works, but some of those movies you also have to pay for, that is the downside to it.  I love amazon but I wish the stick worked better", "verified": true, "helpfulness": "0/0", "author": "Kelly L Makuen"}, {"rating": 5.0, "review": "Exceeded my expectations. Easy to use and simple to set up. Will be buying two or three more of them!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Rutledge"}]