[{"rating": 5.0, "review": "The grands heads straight  to the tv when they are visiting to watch movies. I have to remind them they are here to visit and keep my company.", "verified": true, "helpfulness": "0/0", "author": "patricia r."}, {"rating": 5.0, "review": "I have been a 'Prime\" member for some time, but not using the Video/TV/movies feature. I had just about decided to stop it. Then enter Fire TV. . We have watched several movies, but what I am most happy about is being able to watch earlier episodes of TV shows. We are now watching Extant, which we got started in the current year, for example. So now I record but don't watch the current shows, but watch the earlier emisodes, 2 or 3 evenings a week.After a while we will work up to real-time.As for a couple in our seventies, the Fire TV is very useful and I recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The remote is so bad, i had to take 2 stars off. It is unusable.  It is twichy and goes from unresponsive to over responsive.  You will spend more time trying to get it to select anything and not go past it, or double select.. its impossible.Yes, there is an app remote for Android and IOS, but that is no excuse.  This remote is more unhelpful, than helpful.", "verified": true, "helpfulness": "0/0", "author": "Brian H."}, {"rating": 5.0, "review": "After purchasing the Amazon Fire Stick my TV  is now open to a world of viewing possibilities.Dalton Abbey and many others are free. Love it.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Gary Shaw"}, {"rating": 5.0, "review": "I purchased this on Amazon Prime day because of the discount and because I travel and wanted to use it when I travel. Even with slower internet speeds in hotel rooms it worked just great, so I'm not stuck with what the hotel offers me for in-room entertainment.", "verified": true, "helpfulness": "0/0", "author": "Allen M. White"}, {"rating": 5.0, "review": "Works much better than the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Love my fire stick and have been using it for nearly 7 months with no complaints.  I move it between 2 TV's regularly and it's no problem as long as their is a nearby outlet.  Lots of apps and an easy to use remote and interface.  Highly recommended for Prime users especially.", "verified": true, "helpfulness": "0/0", "author": "Brad S"}, {"rating": 5.0, "review": "Great but!", "verified": true, "helpfulness": "0/0", "author": "Barbara D. Garrow"}, {"rating": 5.0, "review": "Bought this for my college bound son...works great and can't beat the price.  Prime Day was great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]