[{"rating": 5.0, "review": "Worth buying. Easy to set up and use....update...Had this a couple weeks now and at first it was awesome. Now it's constantly freezing and pausing while watching movies on netflix. It just started yesterday and I've tried several fixes with no luck. I'm starting to realize it wasn't worth the money and I'm going back to my ps3 for netflix since it doesn't have any issues.", "verified": true, "helpfulness": "0/0", "author": "Michael G."}, {"rating": 5.0, "review": "Wonderful product!!", "verified": true, "helpfulness": "0/0", "author": "Shilo Fisher"}, {"rating": 5.0, "review": "I can't the believe the power this little stick packs. Super quick downloads along with seamless playback. I'm buying several more over the next couple of months and replacing all of my older Roku players with this little beauty.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Roehl"}, {"rating": 5.0, "review": "Exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Sheila Proctor"}, {"rating": 5.0, "review": "Very easy to set up.  Although I call myself a technohag at age 70, in reality, I'm probably just barely more than basic.  Yet I had no trouble at all.  Being an Amazon Prime member also made it very easy.  It recognized that right away.  I also was able to download my Netflix to it without a problem as well.I bought a book on Amazon to help me with the Fire TV Stick, but found I didn't really need it.  If you're going to do gaming or if you have a Kindle, the book might be helpful.I'm looking forward to having it on my TV.", "verified": true, "helpfulness": "0/0", "author": "Marens MomMom"}, {"rating": 5.0, "review": "Very good if u have prime", "verified": true, "helpfulness": "0/0", "author": "hud morgan"}, {"rating": 5.0, "review": "Awesome, so many choices!!!!", "verified": true, "helpfulness": "0/0", "author": "Linda Loffredo"}, {"rating": 5.0, "review": "We've had our Amazon fire stick for a couple of days. Setup was extremely easy. Took about 10 minutes at the most. The connection speed is great. Definitely happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Leticia Krier"}, {"rating": 5.0, "review": "The Fire TV Stick delivered everything as promised!", "verified": true, "helpfulness": "0/0", "author": "William Kopald"}, {"rating": 5.0, "review": "Great I like the portability to be able to move from TV to TV", "verified": true, "helpfulness": "0/0", "author": "jwesleyj"}]