[{"rating": 1.0, "review": "Well mine only lasted a couple weeks. Netflix started hitching more and more and after a couple days of doing that a movie just stopped buffering completely. I went back to main home page on the device and then it went blank and never came back. I tried  unplugging the device from the TV and the power cord from the wall and back in but no luck. My TV knew something was plugged in as it would say 1080p but again nothing but a blank screen so the device is certainly dead.", "verified": true, "helpfulness": "2/2", "author": "robert edwards"}, {"rating": 5.0, "review": "Quick, easy installation.and setup.  Provides a huge variety  of catagories and programs within esch.", "verified": true, "helpfulness": "0/1", "author": "SD"}, {"rating": 5.0, "review": "Works well, use for Prime Instant Video, Netflix, and Plex.  All work well.", "verified": true, "helpfulness": "0/0", "author": "William Dupuie"}, {"rating": 5.0, "review": "Pleased", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Update 5/10/15 - I decided to give it a shot one more time hopeful that maybe software was updated in the last five months.  Here is my update.  Plugged it in and waited for the software update, took THREE hours and 10 Minutes to download via DSL.  Installed the download and unplugged and plugged it back in.  Attempted to play The Pacific via Prime, got a message about my connection being too slow and It lost my wifi about 5 times,  I cleared the cache for Amazon video and tried again, got the same message about connection too slow  but proceeded anyways.  the show ran it's entire length without buffering.  Tried Hulu and that also worked, other than some issues with the commercials.  So I am changing my review to 3 stars.  It's still not as good as Roku LT, but at least you can play Hulu and Prime without the constant buffering.  I'd like to review this after a few more days, but I'm turning off DSL this week and installing CABLE on Tuesday.  I'd still stay with Roku if you have DSL, maybe try Fire TV after a couple more updates.Original review in Dec 14 -Ok, I plugged it in and first off it updates the stick.  It took 1 hours and 45 minutes to update..Definitely not ready for DSL.  I finally got to log into my prime account and started an episode of Enterprise Season 2.  It ran for about 30 seconds and then buffering, another 30 seconds and more buffering, finally it displayed a message saying my internet was too slow for Prime.  At that point I plugged my Roku LT back in and watched the exact same episode with no buffering, no issues.So I guess with DSL it is better to have a single core, single band, 512 MB Roku than a dual core, dual band, 8 GB Fire Stick.Very disappointing.  Unusable for me..", "verified": true, "helpfulness": "1/1", "author": "mike in mass"}, {"rating": 2.0, "review": "I would suggest waiting until more app functionality is released, especially with regarding streaming videos from websites. For users that like to get their media fix outside of the standardized apps such as Amazon prime, netflix, hulu, or whatnot I think you are better off with an HTPC, laptop, or perhaps a chromecast (I find chromecast to be rather buggy and slow though). I don't have another fire device so perhaps if you had a Fire tablet it would be more convenient to cast videos you are watching.", "verified": true, "helpfulness": "1/1", "author": "KL"}, {"rating": 5.0, "review": "Easy to use- plenty of available apps!", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Great way to stream Amazon Prime. I'm sure this device is great for streaming other apps like Netflix but I only use it for Amazon as I am primarily an Amazon user. The ability to stream albums I have purchased via the Amazon market is a nice bonus. Nice and compact size makes it easily portable when I need to switch tvs.", "verified": true, "helpfulness": "0/0", "author": "BassJas"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "David Quenah"}, {"rating": 1.0, "review": "I have purchased a ton of things from Amazon. That said I have usually been pleased with what I have ordered. The Fire Stick is a piece of crap, real crap. I ordered it a few months back, it was set for a late January release. Of course they had to get it out before Christmas. Two things wrong right off the bat, the remote skips spaces sometimes it won't stop skipping. Second it has problems connecting to the wifi. Tried new battery's in the remote and hooked it up to two different TVs in two different houses. Just don't waste your money..", "verified": true, "helpfulness": "1/2", "author": "Carl V. Koontz"}]