[{"rating": 4.0, "review": "Works great on my newer Visio. Tried to move to my older Visio and would get the splash screen then nothing. Even switched HDMI ports that i know work and got the same. Put back on other TV and it works fine. Wanted to buy another for my other TV but now won't since it doesn't work on it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I was unaware that this also had to be plug in a wall outlet to work. Luckily, I had one close so it wasn't an issue. One of my favorite amazon purchases! I mainly use it for Netflix but there are some other awesome free apps. If I was a prime member I would totally take advantage of the amazon instant video. Love this regardless!", "verified": true, "helpfulness": "0/0", "author": "MrsColburn"}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "Dennis Satterfield"}, {"rating": 5.0, "review": "Works awesome! It's so nice to have a simple device that is easy to use to be able to watch shows without paying the big bucks for cable. Came within a few days and works with a regular charger. No need to purchase the small cable that plugs in the the USB port on the tv", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "You can run the slingplayer on this and watch your slingbox on any TV while you're away!", "verified": true, "helpfulness": "0/0", "author": "Yutgong Au"}, {"rating": 5.0, "review": "We purchased this device hoping it would help our Netflix streaming problems, I have to say I'm real impressed I don't think we have had one rebuffer since we started using the stick. Great buy!!!", "verified": true, "helpfulness": "0/0", "author": "John Baker"}, {"rating": 3.0, "review": "I would like it a whole lot better if you all would partner with VUDU.", "verified": true, "helpfulness": "0/0", "author": "William P. Guzewicz \"William P. Guzewicz Sgt. USMC Ret.\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jarvis Henderson"}, {"rating": 5.0, "review": "Simply superb!", "verified": true, "helpfulness": "0/0", "author": "M Dimayuga"}, {"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Donna C"}]