[{"rating": 5.0, "review": "I love it - easy to install. The only problem I had was trying to open the remote to put the batteries in. I had to go online to find a video on how to open the remote. Things that should be simple are no longer necessarily simple. I still find it hard to remove the battery cover on the remote.", "verified": true, "helpfulness": "0/0", "author": "Cathy B."}, {"rating": 5.0, "review": "I love my fire stick! Wish it had a bigger remote and the Google or Safari app to browse the web.  But you can download the remote app for your iPhone.", "verified": true, "helpfulness": "0/0", "author": "C. Jones \"kk729\""}, {"rating": 4.0, "review": "I have been generally very happy with this product. I use it to stream prime movies and the NBA League Pass App is great. No skips or lags and the audio syncs perfectly. However, I take huge issue with Amazon marketing Fire TV as a way to watch the new \"Game of Thrones\" season. While it is technically true that you can now use the HBOGO App on Fire TV, a Comcast customer MUST also have a cable tv package in order to access HBO. If you have only Comcast internet (which is the case for millions), Fire TV alone will not be a way to legitimately watch HBO shows.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best purchase I ever made!! My hubby has taken it over...lol...seriously...you must get one...you will not regret it...", "verified": true, "helpfulness": "0/0", "author": "Seventyschild"}, {"rating": 5.0, "review": "OMG! I love this thing! I love everything about it, the movies, games, music that are readily available with just a press of a button. I especially LOVE the lyrics scrolling as the songs play. I also love that if I travel, as long as where ever I go has wifi, I'll be able to take it with me. Fantastic little device!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "mdpowershopper"}, {"rating": 2.0, "review": "Some apps have bugs where you go to open it and it starts the show you just watched instead of the home page. I have had to uninstall and reinstall some apps every time I want to use them. Also, there is way to much buffering and skipping. I had a roku attached to the tv I am currently using the stick on and it never buffered and skipped as much as the Fire Stick does. For an amazon product I am really disappointed in it.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 5.0, "review": "Love, Love, Love it! Best investment I've ever made. It was on back order, but was filled and delivered a week before the scheduled delivery time.So easy to use, and so many choices!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I'm still having been able to use it,got tired,dumped", "verified": true, "helpfulness": "0/1", "author": "Manuelrz65"}, {"rating": 2.0, "review": "What a terrible device.  I was looking at the Fire Stick and comparing it to the Chromecast device while it was on sale and about the same price.  I ended up deciding on the Fire Stick since it supports Miracast (the more widely standardized wireless screen sharing method) as well as being one of the few products Amazon has deigned to allow access to Amazon Video (that has some free content with my Prime membership).One initial word of warning on this product, they list that Fire TV Stick is _capable_ of doing voice input searches, but what they don't make obvious is that you have to purchase a separate remote control that can actually do the voice input, the standard one does not have voice input at all.  I noticed this before I purchased the Fire TV Stick, but the advertising was very misleading and sketchy so I thought I'd point it out.The installation and setup was a breeze, especially compared to the weird and misleading setup I ended up going through when I eventually bought my Chromecast as well.  Fire TV Stick was just a simple plug-in, connect to your WiFi using the onscreen prompts, and sign in to your Amazon account the same way.  After that it was ready to go and you could start watching movies or TV immediately if it was from Amazon Video.Fire TV Stick runs Amazon's Android fork, much like they're Fire phones, tablets, TV, and other smart devices, but they don't seem to have learned anything from the utter failure of Google TV that tried to do the same with a special fork of Android provided by Google itself.  Most video sources like HBO, Showtime, ESPN, Netflix, and Hulu are just the Android apps with a little UI work from Amazon to make them show up on TVs better.  This does make the in-video experience better than Google TV was, but they don't do anything to help with the navigation and use when you're not in-video.  Navigating the UI is terrible, you have a 4 direction pad with an OK button in the middle for your remote, but the up and down directions are only used as actual directions about half the time with the up direction working like a back button and the down button working like the OK button the other half of the time.  This is particularly annoying when you're trying to interact with the large poster based lists the UI is based on.  You navigate from the home screen up and down to one of the fixed categories Amazon has provided (you can't actually change these, they've already decided them for you) and press right or OK to enter the list.  The screen then changes to a single left-right sliding list of posters with 3/4 of a line of text below each.  They seem to have made sure the 3/4 of a line of text is just enough that you can't get any useful information out of it without actually opening whatever's associated with the poster.  Pressing down (to navigate to the apparently expandable text below the poster) or OK will expand the poster to add two long buttons below the poster and above the text that are context related (i.e. \"add to watchlist\" and \"watch now\").  If you press down a few times you'll eventually be able to reach the text itself, which is a selectable button, so you can expand it and see more lines of description (still terse and generally not enough to be useful).  If you press up at this point, expecting to navigate from the text you just selected back up to the buttons above it, you'll be surprised to find that it actually didn't leave the text or any of the buttons selected, but reselected the poster at the top (which has no indication when it's selected once the buttons are expanded) and pressing up will act like a back button, kicking you completely out of the list.  \"Ok, there are some kinks in how you interact with the UI\" you might be thinking, \"that's no reason to give up on the whole system\".  I would tend to agree, however it gets so much worse.Let me start by pointing out that Netflix is an app that actually comes pre-installed on the Fire TV Stick, an app that works basically exactly the same as on any SmartTV, Smart Blueray Player, and most mobile devices.  This was a necessary decision for Amazon, but ends up very very bad for them.  Netflix has a nice smooth UI, presenting both TV shows and movies with nice detailed descriptions about the content (maybe slightly lacking in the specific episodes for TV shows case), and organizes things in a coherent layout using the same left-right large scrolling poster layout as Fire TV Stick.  They have a single entry for a TV show, and then have all seasons of the show listed under it followed by individual episodes listed under each season.  They show your last tracked progress through each of the TV episodes and movies from any device you might have watched it on.  Fire TV Stick manages to fail miserably at doing basically any of this.  They have a \"recommendations\" section for Amazon Videos limited to Prime videos (free with Prime membership) as well as one that's not limited to Prime videos, and movie/show types in lists under those headings, but that's where organization and logic stop.  TV shows aren't under a single heading, they're scattered about by season.  If a show  from the recommended list looks interesting, there's a 90% chance you're going to have to exit back to the main menu and perform a manually typed text search for the show name in order to find any one specific season (i.e. the first season).  The search results will not be ordered by increasing season number, they'll be randomly thrown together, and there's no easy way to determine which one of the many hits (some that simply don't have posters for a show in which other seasons do have posters) corresponds to which season since the only indication is in the first line of the description that doesn't show up until a poster is highlighted.  Even better, if the show has a name more than about 25 characters long (including spaces) then the season number will be past the end of the 3/4 line cut off for the brief description that shows up when you highlight a poster and will require you to highlight the poster, navigate down to the text (3 buttons down), and finally select the text.  Once you've selected the text, the previous navigation problems apply, focus has been invisibly reset to the main poster and hitting the up direction will actually kick you out of the entire search, requiring you to type the entire search request again to get the list back (sometimes in a different order this time).  These negative comparisons to Netflix don't stop there though, Amazon has apparently decided that if you want information about a movie or show, you should probably look it up on IMDB or google it yourself on your phone or computer.  They provide next to no information about the actual content they provide, only having enough to allow you confirm it's what you're looking for if you already know the exact thing you're trying to find.  For a product in which a large portion is dedicated to providing recommendations, this is a massive failure.  Netflix provides basic things like production date (so you can tell if it's the original or a remake at a glance), lets you actually enter your ratings for content directly in the UI (Fire TV Stick makes you go to your computer to look it up manually if you want to rate it and get better recommendations), lists some key actors in the movies, and gives a nice synopsis paragraph that makes it about equivalent to what you could find on the back of a DVD case.  Amazon gives you 3 sentences, with the first sentence being the name of the show or movie, and the other two frequently being as useful as \"The New York Times rave reviewed movie of the year in 2009\" instead of any description of what it's about if you don't already know.Overall the UI and access to content is so terribly done, I'd give the Fire TV Stick a hard pass.  Already having it I'll keep it, but mostly because it was only $35 and there's the outside chance they might update it to be something useful.  The only selling point of the product is that you can actually access the Amazon Video content which is extremely limited in mobile and TV connected devices and so terribly done on full blown computers as to be nearly impossible.", "verified": true, "helpfulness": "0/0", "author": "Michael Alexander"}]