[{"rating": 5.0, "review": "I haven't had much time to play with it but so far I love it.  The picture seems better than when I would stream from my PC.  Watching movies it is fast and clear.  If you don't have a smart TV this is the next best thing.Setup took me about a minute, couldn't be easier", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "William Brugger"}, {"rating": 5.0, "review": "If you like movies and remember old ones that you want to see get this ASAP!  For a long time I had remembered seeing \"Paper Moon\" starring Ryon O'Neil and his daughter Tatum, but could never find it to watch.  That changed when I bought the \"Firestick.\"  Now I have access to almost any movie I want to see again. Easy to install and operate - Get it!", "verified": true, "helpfulness": "0/0", "author": "EDMOND P. LULL \"Edmond P. Lull\""}, {"rating": 5.0, "review": "love  it", "verified": true, "helpfulness": "0/0", "author": "PROVIDIAN"}, {"rating": 5.0, "review": "We needed something for our guest room tv beyond just a DVD player. We looked at the major streaming sticks (Fire Stick, Roku, and Chromecast). We loved the idea of using an app on your phone to control Chromecast but that may have made it difficult for guests. On the other hand we have 2 young kids who are obsessed with losing remotes, so we didn't like that Roku didn't offer the app to control it. We found the Amazon Fire Stick to be a perfect happy medium, both in price and in the feature we were looking for! So far we haven't been disappointed. Great picture quality and speed. So far were very happy with our purchase!", "verified": false, "helpfulness": "0/0", "author": "S. Peterson"}, {"rating": 5.0, "review": "Love it. Worth every penny.", "verified": true, "helpfulness": "0/1", "author": "ward1999"}, {"rating": 5.0, "review": "I know there are many options out there for Android or AOI television, but I think Amazon Fire TV Stick is one of the best options right now. I know it's annoying that Amazon Apps are always way behind the Google Play Store, but no one regulates the Google Play Store. Some Apps have approval for things they should NEVER even be near! Want an example? Look at ANY flashlight app. WHY does it need access to your contacts, network, camera, google account, and need administrator rights to your device? What does putting on a light on your device have to do with those things? NOTHING. Fire TV is the only place I can watch Prime Movies and Prime TV shows (Apple and Chromecast do not have it). I can also watch Netflix and Hulu. I like that I can use an app on my Kindle or Cell Phone to control my Fire TV Stick. I have had this device for several months and my son has downloaded several games. There seems to be no problems with not enough memory. Overall good purchase and I look forward to the Apps that will become Fire TV friendly in the future.", "verified": true, "helpfulness": "0/0", "author": "Kelly \"Kelly\""}, {"rating": 2.0, "review": "I have a Chromecast on my bedroom TV. I decided to get this because I thought it would be better for the living room. I figured it came with a remote and you didn't need to use your phone so anyone could just use it and it would be simpler. I also got it because I decided to pay for prime mainly for the shipping but might as well get something for the video on my tv.I'm ordering another Chromecast.It's very laggy at times. Sometomes the video has to catch up with the audio. But the most annoying thing is when you go and play a video and it just returns to the home screen. Every time. All the time. I give up. Sending it back.The ui was nice though. Good luck.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great way to view your Netflix. No mess with the computer. Easy as pie to use as long as you know how to change the imput on your TV set. I love it.", "verified": true, "helpfulness": "0/0", "author": "Trisha Bee \"Trish\""}, {"rating": 5.0, "review": "Great price and works great!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}]