[{"rating": 5.0, "review": "Let me start out by providing the answer for most of the poor reviews out there.YOU MUST PROVIDE POWER TO THE STICK!!Many people assume from the poorly written instructions that the stick does not need power to run but that's not true. The stick can play videos you load yourself like a USB but that is all. In order to access apps, Amazon video, etc... You need WiFi which requires you plugging the power cord in (not all TVs can support the cord being plugged into the back so you may need to plug it into an outlet).Once you get the stick up and running the interface is simple, easy to use and quick. My 5 year old mastered it in minutes and I've been impressed overall at how much better it works that my Samsung TV apps or Panasonic & Samsung bluray players.For under $45 at full price, delivered this is a no brainer to buy.", "verified": true, "helpfulness": "0/0", "author": "Nathan Rasmussen"}, {"rating": 5.0, "review": "The Fire TV stick is excellent for the price so I'm giving it 5 stars, though on an absolute scale it would be closer to 4 stars rather than 5. The big pluses are:1) Voice search from phone app is so much easier than typing2) Even keyboard is a lot faster than the Samsung Smart TV keyboard which is slow3) User Interface is also blazingly fast4) You can \"cast\" from Youtube, just like you can to a Chromecast.5) The Airplay/DLNA receiver app in the app store turns this into an Airplay receiver, making it possible to mirror my Macbook laptop screen, which is useful for mirroring videos not on Youtube/mainstream apps.6) Miracast support for mirroring also works well with my Kindle Fire tablet. It doesn't seem to work as well with my Android phone however.The main minuses I've found are:1) Voice search only supports a limited set of apps (as many others have pointed out)2) Airplay mirroring support with the third party apps like Airplay/DLNA receiver is adequate, but not always great - sometimes the resolution isn't as good, or there are interruptions. This isn't of course a problem with Fire TV Stick itself, but more that the lack of a high quality Airplay receiver app is felt. Google's Chrome tab casting seems more robust to the Chromecast when I tried it, though it has its own failures.3) For some reason, the Youtube website and app are able to cast to the FireTV (just like with a Chromecast) but my android phone is unable to do the same - is this because the Chromecast uses its own protocol and not DLNA? Not sure, but its a limitation.I don't experience any lag. But of course I haven't tried the full FireTV so don't how this compares to that in terms of speed. It seems plenty fast for me coming from a Smart TV (which is excruciatingly slow).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Install xbmc and you are good to go!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice product and interface. Cancelled Netflix and now I am using Amazon Prime. Netlix library is diminishing over time, as Amazon add new stuff regularly.", "verified": true, "helpfulness": "0/0", "author": "sbatya"}, {"rating": 2.0, "review": "I am a loyal Prime member and have been for 4 years now. All my music, movies and apps are purchased through them. I also purcahes cloud storage that I use for my music, pictures and video. They are a great company that sells valuable services and products. When I saw that Prime Members could get the Fire TV Stick at a discounted rate, I was onboard. We already have a Samsung Smart TV and a Roku LT in the house. The Fire TV Stick would be used when travelling. After receiving the unit last week, I couldnt wait to plug it in and give it a run. The TV I plugged it into is the Smart TV that has multiple Amazon APPs installed on it. I have no issues with any of these Amazon APPs that run on this TV. Below are my results of using the Fire TV Stick after one week:1) When first plugged in, I received a message that the power adapter I was using would not work. Really? I am using the adapter that shipped with the unit. It allowed me to press 'OK' to bypass this message.2) I connected the unit to my Wi-Fi and Amazon accounts with no issues3) Setting up Parental Controls locked up the Fire Stick. I had to reboot. It locked up a second time as well, so I decided to skip this step.4) Trying to stream Amazon Prime movies or TV shows, takes forever to load. Then, while watching the content after a few minutes, it will buffer. This buffering continues off/on throughout the show. I do not have this problem with my Smart TV or the Roku LT.5) I have over 5000 songs stored in the Amazon Prime Music Application that I uploaded to Amazon. There is no built in Search function to find a specific song. I need to use the mobile app for this. How could Amazon not build a Search function into the Fire TV sStick is beyond me.", "verified": true, "helpfulness": "0/2", "author": "D. Martyn \"Dan Martyn\""}, {"rating": 4.0, "review": "You do not necessarily need to plug this into external power. It works perfectly well plugged into my TV's USB port for power. I have a 2014 LG.This stick is good, and amazing for the price point. It's a no brainer for anyone who wants to watch Amazon Prime.I will say that the UI needs some work. It's not very intuitive to do stuff other than watch Prime...but I suspect that will improve with time. Also some key apps like HBO GO are missing from the App store.", "verified": true, "helpfulness": "0/0", "author": "freethinker \"jason\""}, {"rating": 5.0, "review": "So fast and smooth. Such a beautiful interface!", "verified": true, "helpfulness": "0/0", "author": "Kris Ramsey"}, {"rating": 5.0, "review": "I'm impressed.  For anyone who is reluctant because they're not a \"techie\" - well I'm a 70 year old great grandma and it took me about 10 minutes to get it up and working.  Very intuitive set up.Great picture quality.  Great sound quality.  Great selection of activities.  Movies, TV, Games and more. This is a gizmo that never comes with buyer's remorse.", "verified": true, "helpfulness": "0/0", "author": "Miss Barbara"}, {"rating": 5.0, "review": "Every bit as good as I expected, i am now using this instead of my apple tv which will not allow you to view Amazon Prime, will order another and not use apple tv at all.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 1.0, "review": "Bought it for Miracast to mirror laptop computer with Windows 8.1.  It does not work. False advertisement...", "verified": true, "helpfulness": "3/5", "author": "tho"}]