[{"rating": 3.0, "review": "The screen for the tv is really small and hard to read making searching for shows difficult. Product works.", "verified": true, "helpfulness": "0/0", "author": "Dawna Morse"}, {"rating": 5.0, "review": "Love the fire stick! I am so glad I bought it. We have so may options on it, whether  it is movies, games, TV or music. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "jenise lynch"}, {"rating": 5.0, "review": "Bought this for my parents to use and so far they love it. They haven't had any issues with it and they have figured out how to browse through the apps, so it's promising.", "verified": true, "helpfulness": "0/0", "author": "AbsurdAshbee \"Ashley Braybrook\""}, {"rating": 4.0, "review": "I like it.  It has a great interface, easy to navigate.  The remote get's \"stuck\" sometimes and takes off on me.  Its easy enough to correct, but can be pain.  I would have given it 5 stars if it wasn't for that.I'd like to add a suggestion for searching for items.  As far as I can tell, you can only search for Prime items.  It would be nice if the search function gave you the option of where you wanted to search.  E.g. Prime, Sling, Hulu Plus, Netflix etc...  You would select search and then if an app is installed, put a check mark in front of it.  It would then search that app for the program that you were looking for.  Not just Prime.", "verified": true, "helpfulness": "0/0", "author": "Jim Gamboe"}, {"rating": 5.0, "review": "This is the easiest piece of technology that offers the most! I love this. So simple to use, smooth downloads!", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 4.0, "review": "I like the fire stick EXCEPT for the remote.  I had to google how to open it to put the batteries in.  I found dozens of videos showing how to get it open and finally did with the help of a screw driver.  Now I have a scratched up remote.  DESIGN FAIL!!!! If you have arthritis or carpel tunnel you will NOT be able to open this up.  I think Amazon needs to change the design AND send me a new remote since the only to open this is to damage it.  There are hundreds of reviews on the web concerning this EPIC FAIL!", "verified": true, "helpfulness": "0/0", "author": "ClassyGeek"}, {"rating": 5.0, "review": "Muy bueni.", "verified": true, "helpfulness": "0/0", "author": "Julio Torres"}, {"rating": 5.0, "review": "I had the chromecast first and was getting so frustrated with having go download the apps to my phone because chromecast isnt compatible with my Kindle.  After a few month my mom bought me the fire stick and its amazing.  Just having a remote is great, but there are so many other features. I like that its linked to my amazon acct. 1 click payment.  Very convenient for renting movies...", "verified": true, "helpfulness": "1/1", "author": "tonya \"It's been Fun.\""}, {"rating": 5.0, "review": "I believe have now had this product for 5 or 6 months. observations so far are that the stick gets hot. I do not like the fact that there is not an on/off switch on the stick. I believe there is constant power at the usb port on my tv. I am not sure if that is the case with other manufacters, but it is with my tv which is a vizio smart tv. the functionality of the product is great. by the way the product doesn't work anymore.", "verified": true, "helpfulness": "0/0", "author": "john h"}, {"rating": 5.0, "review": "GREAT!  for my needs this works out great!", "verified": true, "helpfulness": "0/0", "author": "Marjorie Semensow"}]