[{"rating": 5.0, "review": "Just awesome!!!  We don't have cable and perfect for watching  dramas and movies on our TV. Best part is you can take this anywhere you want to!!!", "verified": true, "helpfulness": "0/0", "author": "Windrider"}, {"rating": 5.0, "review": "Beats the Chromecast. Download the free remote app if compatible with your phone.", "verified": true, "helpfulness": "0/1", "author": "Wer4jc2"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Nancy Werner"}, {"rating": 5.0, "review": "This is a very similar product as the Fire TV (and cost so much less). Unless you are going to be playing lots of games (and you can play games on the TV stick as well) just go with this and not the Fire TV. It's not worth spending the extra money for.", "verified": true, "helpfulness": "0/0", "author": "dc757575"}, {"rating": 5.0, "review": "I purchased this when it was released for $19.00 for Prime Members.  After using this, and comparing the cost of xfinity monthly HD service, I decided to pull the plug on cable and use this for streaming Netflix, Hulu Plus, and of course Amazon prime shows.  I now have two sticks, one for each TV in the house with streaming service.  I now watch only the shows that I enjoy, and instead of surfing mind-numbing TV shows at night I read more often - that is a good thing.  Not to mention the $900 a year that I now saving after dropping cable.The interface is extremely easy to use, my 5 year old son can use it to get the shows that he wants (and is allowed to watch!).  Shows load amazingly fast using Prime Service, and with very limited initial buffering on other streaming services.We have kindles and fire phones, and the interaction between the Fire TV Stick and other Prime services is seemless and a plus - with a click I can show a slideshow of pictures and video's from the cloud, \"flick\" movies and video's from my kindle to the TV screen (which is also useful for putting a new kids show on the screen from another room using my kindle!).", "verified": true, "helpfulness": "0/0", "author": "S. Fordham"}, {"rating": 5.0, "review": "It's awesome and portable!", "verified": true, "helpfulness": "0/0", "author": "Stephanie M Morales"}, {"rating": 4.0, "review": "kinda makes my hd tv  a smart tv.", "verified": true, "helpfulness": "0/0", "author": "sharong"}, {"rating": 5.0, "review": "I love this thing.  I'm glad I got 2 when it first came out for $20.  Wish I gotten two more using my wife's account.  I ended up getting a fire tv that wasn't worth it compared to the stick.  I have 2 chromecast that we stopped using after a few months because netflix kept having issues with it.  If our devices went to sleep and we wanted to pause the show, we would have to close out the app sometimes and reopen it.  Remote and Amazon prime video rocks!", "verified": true, "helpfulness": "0/0", "author": "Uipt"}, {"rating": 5.0, "review": "This was very easy to install and very easy to use. I really like it", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "This is the best streamer, so much fuctionality, much more than i expected when I ordered it.  the only thing missing is a way to use chrome browser.I sideloaded it but it doesnt work properly. Maybe I just need to figure it out. I always recomend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "evalia vazquez medrano"}]