[{"rating": 5.0, "review": "The Fire Stick is a no-brainer if you have Prime and are looking to get into a streaming device. For me, I got in on the $19 sale and decided to add it to a different TV than my AppleTV3, but now have them installed side-by-side, because they have very different content (now...see below). It works well right out of the box. Had no issues with a Sony LCD from 2008; it gets power from the USB port that was only for firmware updates. Where this thing blows AppleTV3 out of the water is, with a little no-how, you can also easily install XBMC/Kodi (or other apps) onto the Stick....and now you can stream the whole internet! Riki can do the same, but not for the price.", "verified": true, "helpfulness": "0/0", "author": "FP-Doc"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "STACI BOLDEN"}, {"rating": 4.0, "review": "Works good but amazon needs to get movies  available for free like netflix!!", "verified": true, "helpfulness": "0/0", "author": "tb"}, {"rating": 5.0, "review": "Incredibly easy set up and very user friendly thereafter.", "verified": true, "helpfulness": "0/0", "author": "Leah Bayens"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Linda holland"}, {"rating": 5.0, "review": "Firestick was everything I wanted and more. Just too bad it took 2 weeks to get to me after placing my order.", "verified": true, "helpfulness": "0/0", "author": "Al H"}, {"rating": 5.0, "review": "This really is amazing!!", "verified": true, "helpfulness": "0/0", "author": "JJ123"}, {"rating": 5.0, "review": "Love it!  Easy to hook up and easy to use.  We bought it because we have a really nice LED TV that is not a smart TV in our master bedroom but didn't want to get rid of it yet.  So the Fire Stick turned it into a smart TV.  We love it!", "verified": true, "helpfulness": "0/0", "author": "JaLaTx \"JaLaTx\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Julio Torres"}, {"rating": 5.0, "review": "Great product.  The device is fast to response to any command.", "verified": true, "helpfulness": "0/0", "author": "Petrus Handoko"}]