[{"rating": 5.0, "review": "amazing! not sure how I lived without it!", "verified": true, "helpfulness": "0/0", "author": "Nora McMurrey"}, {"rating": 5.0, "review": "My family and I LOVE this! We have one in two rooms. Plus, we have Amazon Prime with lots of free shows and apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It is nearly impossible to stream anything with any consistency with this stick. Hulu constantly stalls out and the picture quality is always changing, same with Netflix. Cannot get any reliable streaming out of this. I went back to Chromecast and have not had a problem.", "verified": true, "helpfulness": "1/1", "author": "Scott"}, {"rating": 1.0, "review": "I have used it just two or three times, but it is nice so far.  Easy to use, I do miss a search area, I couldn't find hebritish mystery I wanted.  Went to my Kindle 'fire to find it, and then it was on the TV.fw", "verified": true, "helpfulness": "0/0", "author": "B. McGraw"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Michael Rushing"}, {"rating": 5.0, "review": "I said bye bye to my cable bill and purchased a Fire Tv Stick. Love it", "verified": true, "helpfulness": "0/0", "author": "rachel"}, {"rating": 5.0, "review": "So far is a great thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really like... now I use the device more than my chromecast", "verified": true, "helpfulness": "0/0", "author": "Esteban"}, {"rating": 4.0, "review": "Thought I would get much more with Amazon Prime. I have to pay for most things I want to watch and none of the movies I search are available. Netflix has more in my opinion to offer but the Fire TV stick is great.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Troyer"}, {"rating": 5.0, "review": "Received right on time! So easy to install to the back of my tv's. Took me all of ten minutes.  Price is amazing for what you get!", "verified": true, "helpfulness": "0/0", "author": "Andy"}]