[{"rating": 5.0, "review": "This is absolutely perfect, it even comes with an adapter for hard to reach tv's. The menu screens are great and it loads up instantly. I will be buying one for every tv in the house.", "verified": true, "helpfulness": "0/1", "author": "Kenneth E."}, {"rating": 4.0, "review": "For a portable version of the Fire TV, this is great. I bought one for my secondary tv. Not as full featured as full Fire TV,  but a good product nonetheless.", "verified": true, "helpfulness": "0/1", "author": "Martha A Collins"}, {"rating": 5.0, "review": "A lot of streaming power in a little stick. Great WIFI connection, good picture and nice menu.", "verified": true, "helpfulness": "0/1", "author": "Jerome Lebanner"}, {"rating": 5.0, "review": "Works as indicated. easy set-up. Great picture quality. I love it.Does more then I expected..", "verified": true, "helpfulness": "0/1", "author": "R J Takacs"}, {"rating": 4.0, "review": "I have a Roku 2, an Apple TV, and various brands of Smart TV. I like the Fire TV stick as well as any of them. The remote works well. There are no issues with the stick being mounted behind the TV and responding to commands from the remote. Picture is good. I have tested Netflix, Plex, and Amazon. All work well with solid interfaces. At this price point, I would be hard pressed not to buy the Fire TV Stick for any new TV.Edit 4/12/15After spending more time with the stick, I have decided to edit my review. Over all, I still really like it and use it daily. I have seen issues with it getting out of audio/video sync on Netflix. It also occasionally freezes for a second here or there during video playback. This seems to cross applications as I have seen it in Netflix, Amazon, and Plex.Things I would really like to see Amazon add to get back to a 5 start rating:1) a software reset button!!!!!!!2) more support for audio codecs. I frequently have to switch to Apple TV to watch some of my MP4 videos with 5.1 sound.3) improve performance to eliminate streaming issues.4) allow for USB power from the TV and eliminate the wall wart.", "verified": true, "helpfulness": "1/2", "author": "swd"}, {"rating": 4.0, "review": "so far so good.", "verified": true, "helpfulness": "0/1", "author": "jaimed"}, {"rating": 5.0, "review": "Overall this is a great device for the price. Video streams nicely. Good selection of apps and content. Don't buy it for the games. The selection is fairly limited, and it's even worse if you don't want to shove out extra for the controller. Setting it up is kind of annoying,. It took like thirty minutes to download updates, and it forced me to watch an introduction video, a video that contained absolutely no useful information for someone like me. Amazon's version of Plex will cost you a few bucks. Even with these minor complaints, I cannot recommend this enough for those who just want a simple streaming device.", "verified": true, "helpfulness": "0/1", "author": "M.S"}, {"rating": 5.0, "review": "I've been using this for the past two days and I'm liking it a lot. If you subscribe to Amazon Prime, this is definitely a must have! It is fun, intuitive, and very easy to use. It is smooth and performs surprisingly well considering its size. The remote is nice and easy to use. The stock software is really simple and I think that even my grandma would be able to figure out everything to use it within minutes. I'm really starting to like amazon's line of products and I'm looking forward to see what the future holds for this awesome little device.Also, being a geek that loves to tinker with my toys, I love the ability for custom android modifications so thanks Amazon for not completely locking this down! :) For now, its definitely a must have especially for that geek on your list who likes to tinker with their toys.One minor drawback is that it does get fairly warm to the touch (the device NOT the remote) but since you aren't holding it in your hands, this isn't really an inconvenience.", "verified": true, "helpfulness": "1/2", "author": "Nash Fam"}, {"rating": 2.0, "review": "Interface is visually appealing but the overall performance and responsiveness of the OS leaves a lot to be desired. I could stream some content but not all. Couldn't stream my purchased content at all. Hopefully updates address these issues. Glad I only paid $19 for it. Not worth more than that.", "verified": true, "helpfulness": "2/2", "author": "Rob Ippolito \"Ultimate Amazon Shopper\""}, {"rating": 5.0, "review": "Really surprised with the features. Obviously Android oriented but many good free apps.", "verified": true, "helpfulness": "0/1", "author": "hev"}]