[{"rating": 4.0, "review": "This is a good streaming device for the price you pay. Here are some observations (Likes and Dislikes):1. The specs on the device is amazing.  It is fast and with a good amount memory and storage. It has a straight forward setup and moving around is pretty fast.2. There aren't much free stuff online.  You would need to subscribe to Prime or have individual subscriptions to other providers to get content.  Since I already have a few connected devices this was just a toy to have for the price.3. The interface is user friendly.  However, it feels like Amazon wants you to buy everything.  There is no way to know if something is free or the cost.  You will have to go couple screen deep to find out that you didn't want to pay for it.  Amazon, please modify the images to include the cost.4. I am not fond of the Fire Stick design.  The USB power input is on the side.  Which means you can't use the HDMI next to it. Before you buy this device, please make sure you have room.  I could barely squeeze it in :(.  The HDMI extender cable can help you but then it is short and will dangle around and look ugly...Not ideal.5. The Remote is pretty simple and does what it is meant to. What we need is a keyboard.  Searching for content using the remote is a chore.  Wish Amazon comes up with a remote with keyboard feature. There isn't any external USB input that you can use for a USB keyboard either.6. Content delivery is pretty fast and I haven't experienced any lags.  However, Fire Stick can only use WI-FI.  So, you will have to make sure that your router is close by and have good reception so that you get good streams.7. Amazon's Fire TV Remote app is a companion to your device.  Please download it and it will save you time.  It does have the keyboard feature that may come in handy.  Please note that the navigation is not intuitive...You will be moving around all over the place.  It does come with a voice feature to search...didn't work for me very well though.8. For those who have kids and want to set up parental control, Fire Stick comes with it.  It is a basic 5 digit code that you can set up.9. Last but not least, I wish the it had a built-in browser app for web surfing.Overall, for the price you pay, it is a good device to have.  If you are tech savvy, you can go about adding other streaming and productivity apps but I won't bore you with those :).  Good luck with yours..", "verified": true, "helpfulness": "0/0", "author": "Shafiq Islam"}, {"rating": 5.0, "review": "Works for me!  I have a guest/sewing room in my home that has no cable hook-up, but wanted streaming content from Amazon, Netflix, Hulu etc, so I purchased a reasonably priced flat screen TV with inputs on the back and inserted the Fire TV Stick. In no time at all I was streaming movies, TV shows, and spending more time in my sewing room than ever before because I WAS CONNECTED!!! Love this little stick!", "verified": true, "helpfulness": "0/0", "author": "Pamela J. Nesler"}, {"rating": 3.0, "review": "So I was really excited that I got one of these during the $19 sale and it arrived today. My first impression out of the box was great, just what I've come to expect from Amazon, minimal packaging and quickly opened. I plugged the stick into my TV and then into the USB port of my TV where I encountered my first disappointment, a warning that I needed to use the wall power adapter for the best performance. Back to the box and I plugged the stick in to the wall (not needed with my Chromecast). Then I needed to connect to my network. That took two tries because I use a random security key that I have to enter using the remote on a non-QWERTY keyboard since the phone app with a keyboard doesn't work until you're on the network. Once I did that I had to sit through a tutorial video that I had no way to skip.Now, once the device is set up, I have zero complaints. It's fast, easy to use and the keyboard makes logging in to the other apps a breeze. I also like that ordering one from your account auto links the two so I don't have to log in when it arrives. All in all I think it's a solid product and it will compliment my viewing, if only because Amazon doesn't let you Chromecast from their video app.", "verified": true, "helpfulness": "0/0", "author": "T. Webb"}, {"rating": 5.0, "review": "Fantastic now. If you were having trouble with Netflix buzzing and slowing down I managed an easy fix. One, I plugged it into a more reliable power source- no extension cord, but a power strip. Additionally, my TV is HD but only 720p, so I set the fire tv stick to 720 60hz instead of auto. When I first got the Fire TV stick, I tried to power it via the USB in the back of my TV. It does not like this, and it would not start up consistently. It needs one reliable power source and use the adapter included. No more lag or annoying buzzing! Hope this helps some people.That being said, it is the perfect media streaming stick. Great for Netflix, Amazon Instant Video, and Amazon Music. Over the years I have been looking for the perfect Netflix \"box\". I have used a blue-ray player, wii, Wii-U, xbox 360, and the Fire TV Stick is my current favorite. The best feature is that it is designed to always be on, no start up loading, so you get to everything quicker.Remote is tiny but functional. If you're like me and have a kindle fire, you can pause and fling stuff to your TV, which is cool. I highly recommend picking one up.", "verified": true, "helpfulness": "0/0", "author": "AcidBot"}, {"rating": 5.0, "review": "Much better than expected", "verified": true, "helpfulness": "0/0", "author": "Anthony B."}, {"rating": 3.0, "review": "Good for apps or music but unless you have Amazon prime movies and shows cost a lot", "verified": true, "helpfulness": "0/0", "author": "phillip bryant"}, {"rating": 5.0, "review": "Plenty of reviews here. Just a few quick additional perspectives for this ridiculously strong offering that really ups Amazon's game in this space, as in wow!1) SET UP: What \"they\" are telling you is accurate. It is ridiculously easy. I bought two of these puppies when offered at half price to PRIME members. Setup for both, combined, took me 20 minutes.2) USER INTERFACE: Easy and awesome. I'm an Apple fan boy. If Apple is serious about this market, they need an Apple TV update yesterday.3) RANGE OF CONTENT: What can I tell you? I bought this as a screaming solution to stream Amazon Prime content without firing up a DVD player, without AirPlaying my iPhone, etc. In addition, there are quite a few (not a lot of) other choices. Pandora and Spotify are nice touches for audio. The TuneIn app is extremely well done if you have already set this up for your other devices.4) PERFORMANCE: With Amazon content, it is excellent. It's early days for me so far, but on VIMEO content in particular, I get some latency. I imagine this must be a Vimeo issue? PBS performance is erratic.5) TRUE DOLBY YADDA YADDA FOR YOUR HOME THEATER RECEIVER: I'm not getting some of the other comments, but perhaps I'm missing something. My 2011 Samsung HDTV runs through my Denon home theater receiver. Depending on the OTA signal I'm tuning in, I get bona fide Dolby quality through my receiver. THIS UNIT is essentially a dongle connected to my TV. I've tested it with multiple programs, I've checked each of my speakers up close, including my two rear surrounds. I am distinctly getting \"the real thing\" versus \"stereo through four speakers.\" If you're a purist looking to run everything directly through your receiver, this solution is not for you. If you're simply seeking to ensure you get the audio quality you think you should be getting....ummmm....I think this unit provides it.For $40 I think this is a very compelling product. For $20 (what I paid), it is jaw droppingly awesome.", "verified": true, "helpfulness": "2/2", "author": "Highly Opinionated Man"}, {"rating": 5.0, "review": "Good deal on a system that functions like the Fire TV. A little slower processing and voice search by app only but a great deal.", "verified": true, "helpfulness": "0/0", "author": "Matt Korf"}, {"rating": 1.0, "review": "This is a waste of money!  Cannot hold connection to wifi for more than 60 seconds and the router is 2feet away from the fire tv stick.  Good idea....terrible execution.  I have tried other routers and all the troubleshooting I could find, it still won't work, calling Amazon and returning this junk.", "verified": true, "helpfulness": "1/1", "author": "Catherine A Koury"}, {"rating": 3.0, "review": "The setup was annoying. The interface is cumbersome. It surprisingly feels slow in many apps. Youtube is almost unusable.Otherwise I love it and prefer it over my PS4 as it has much more content. Great price too.", "verified": true, "helpfulness": "0/0", "author": "Bryan D"}]