[{"rating": 5.0, "review": "So far works good", "verified": true, "helpfulness": "0/0", "author": "John Moody"}, {"rating": 5.0, "review": "I love this thing.", "verified": true, "helpfulness": "0/0", "author": "Kimberly S Murphy"}, {"rating": 5.0, "review": "love it thanks", "verified": true, "helpfulness": "0/0", "author": "troy toler"}, {"rating": 1.0, "review": "Don't make the same mistake I did. This does not work if you use anything other than your TV for sound (e.g. receiver). If you want to use this with surround sound, you won't be able to. There is no workaround or fix.", "verified": true, "helpfulness": "1/1", "author": "Seanna M."}, {"rating": 4.0, "review": "wasn't happy that it wouldn't work with Comcast Xfinity, I couldn't watch showtime on demand or hbo go", "verified": true, "helpfulness": "0/0", "author": "Bobbi Jo Jensen"}, {"rating": 5.0, "review": "This is exactly what I have been waiting for. Full-on cord cutting!", "verified": true, "helpfulness": "0/0", "author": "Michael Lynch"}, {"rating": 3.0, "review": "The Firestick was very difficult to set up.  It took several calls to technical support, and several days to get it to work properly; in the end their technical dept. made adjustments that finally permitted me to use it.  Also, the remote was very erratic when I first started to use it.  As I would use it to put in my password, I would barely touch it and it would jump 3-5  spaces--very, very frustrating, especially as I was having to repeatedly enter the password as I was working with technical support.  However several days later, it seemed to settle down and work OK.  Now that it is working, it works OK and I have enjoyed it.  I must say, customer service was very good, calling me daily after submitting my issue to their technical support", "verified": true, "helpfulness": "0/0", "author": "ssdsgo"}, {"rating": 5.0, "review": "I got it for Xmas I love it had to wait for my son to help me hook it up. I enjoy it very much and would recommend", "verified": true, "helpfulness": "0/0", "author": "LindaSC"}, {"rating": 3.0, "review": "The interface is easy to use but it buffers quite often and kicks me out of shows periodically. If I could do it again, I would have purchased the box instead of the stick.", "verified": true, "helpfulness": "0/0", "author": "D. Eastman"}, {"rating": 5.0, "review": "Great interfac", "verified": true, "helpfulness": "0/0", "author": "Brittany Bologna"}]