[{"rating": 2.0, "review": "the remote is very hard to control while signing in and moving the cursor I keep hitting numbers and letters causing me to deleat and start over.", "verified": true, "helpfulness": "0/0", "author": "ed russell"}, {"rating": 4.0, "review": "The wireless receiver is decent on the device. I have had some lag and a couple of drops with the stick. My PS4 that is located next to the stick does not have these issues on a wireless connection. It is a great product when placed near wireless source", "verified": true, "helpfulness": "0/0", "author": "Jeremy A Kunkel"}, {"rating": 5.0, "review": "The Fire TV Stick exceeded my family's expectations. It is easy to use and very convenient whether you have a smart TV or not. Being a Prime member is a PLUS! Bought two additional ones for other rooms in our house...We are hooked!", "verified": true, "helpfulness": "0/0", "author": "KDD"}, {"rating": 5.0, "review": "have enjoyed having it more for the old children's programs,", "verified": true, "helpfulness": "0/0", "author": "raynelle"}, {"rating": 5.0, "review": "Cancelled my cable provider, and purchased a fire stick.. Easy to use , my kids love it, and saving money !! All is needed is WiFi...", "verified": true, "helpfulness": "0/0", "author": "robin hart"}, {"rating": 1.0, "review": "It was unable yo stay connected to my satellite.  I returned it", "verified": true, "helpfulness": "0/0", "author": "Betty B."}, {"rating": 4.0, "review": "Pretty cool and a lot of options. Remote is awful and slow but the price might make it worth it......", "verified": true, "helpfulness": "0/0", "author": "Morgan Zollner"}, {"rating": 4.0, "review": "Pretty good performance for such a small device. I had an old Roku and the Fire TV Stick definitely works much better. Everything is so fast in the UI and since you don't have to actually point the remote to the device, make navigation very easily in comparison to the Roku.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Easy to install and easy to use", "verified": true, "helpfulness": "0/0", "author": "BARBWILLIAMS"}, {"rating": 3.0, "review": "It works great. Just bit happy with how many things you actually have to purchase to watch", "verified": true, "helpfulness": "0/0", "author": "lindy"}]