[{"rating": 4.0, "review": "easy to understand instructions.", "verified": true, "helpfulness": "0/0", "author": "Horst Motz"}, {"rating": 4.0, "review": "Easy to use, once you get used to the menu", "verified": true, "helpfulness": "0/0", "author": "Kurt Hathaway"}, {"rating": 5.0, "review": "Be sure you have bandwidth sufficient to download movies before trying to use this.  We thought we had that but discovered that the internet provider we were using did not provide enough bandwidth to our area (it wasn't even a matter of upgrading our account, the service was just not available).  After changing to another provider, the Firestick worked perfect. We did buy one first time user ebook, but found that the installation was easy for my husband to figure out without help.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Williams"}, {"rating": 5.0, "review": "So simple to use! The price was great. Truly enhances the media experience!", "verified": true, "helpfulness": "0/0", "author": "Rebecca (Gray) Arkenberg"}, {"rating": 5.0, "review": "i like being able to watch movies I have recorded on amazon on tv", "verified": true, "helpfulness": "0/0", "author": "Diane P."}, {"rating": 4.0, "review": "Works well but when it is advertised that you have access to thousands of TV shows and movies, it would be nice to know that you have to pay for them.  It would be better to set it up like Netflix or Hulu.", "verified": true, "helpfulness": "0/1", "author": "Daryle Greene"}, {"rating": 5.0, "review": "It's great .", "verified": true, "helpfulness": "0/0", "author": "kai"}, {"rating": 4.0, "review": "After we figured out how to hook it up it Works very well", "verified": true, "helpfulness": "0/0", "author": "Barbara DelPrete"}, {"rating": 5.0, "review": "The Fire TV Stick  gives us so many different choices of shows to watch. We have already watched several great movies as well as TV shows too. Last weekend we had a problem with our TV service, and we could not receive any shows. We were so very thankful that we could still watch movies and TV shows because of the Fire Stick. The Fire TV Stick gives you great old and recent TV shows and movies to watch, and it has greatly added to our TV entertainment.", "verified": true, "helpfulness": "0/0", "author": "iroth"}, {"rating": 5.0, "review": "So far, it's great, very easy set up, out of the box and watching a movie in 10 minutes!", "verified": true, "helpfulness": "0/0", "author": "Sharon Nutter"}]