[{"rating": 5.0, "review": "It is easy to use and has a low profile.", "verified": true, "helpfulness": "0/0", "author": "John Mierau"}, {"rating": 5.0, "review": "I like the devices I'am enjoying now my neflix in my bedroom at night. Before I can watch only in my living room. Plus too many option I can select to watch. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Enercita F. nacorda"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Paula Tucker"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "vrdean"}, {"rating": 4.0, "review": "Not quite as user friendly as Apple TV yet.Good for gaming with controller. This plus the price make it a great value.Prime video is good but it's hard to find things due to the UI.", "verified": true, "helpfulness": "0/0", "author": "Evan"}, {"rating": 4.0, "review": "Lover it!", "verified": true, "helpfulness": "0/0", "author": "Carlos Rios"}, {"rating": 4.0, "review": "Works well. Surprised to see that it has to be plugged in for power.", "verified": true, "helpfulness": "0/0", "author": "Aaron V Witkowski"}, {"rating": 5.0, "review": "Just what we needed.", "verified": true, "helpfulness": "0/0", "author": "Jessica Creekmore"}, {"rating": 2.0, "review": "I bit confusing on what's free and what I have to rent or pay for. Not really what I expected. There's no off button on the control which I don't like. I'm still in the process of learning what free and what not.", "verified": true, "helpfulness": "0/0", "author": "SeaGolfer"}, {"rating": 5.0, "review": "Easy set up. Great picture and sound. Not as many apps as my Roku, but for the grandkids room, it is sufficient. If you have Amazon Prime, it is definitely a plus. Once you sign in, it welcomes you by name and has any app you have purchased through Amazon already loaded. I was able to view my security cameras at work because I had purchased the IP Camera Viewer from them.", "verified": true, "helpfulness": "0/0", "author": "esquaredracing"}]