[{"rating": 5.0, "review": "Love it so far, seems just as good as my Fire TV's just cheaper and I don't mind leaving it in my patio TV. XBMC on my patio, I'm very happy!", "verified": true, "helpfulness": "0/0", "author": "MxChris"}, {"rating": 1.0, "review": "Piece of s*** won't let you skip the intro video. I threw it on the ground.", "verified": true, "helpfulness": "3/5", "author": "ziddey"}, {"rating": 5.0, "review": "Works great. Easy setup.  I plugged into into the HDMI input of my receiver.  Have streamed Amazon, Netflix & YouTube, with very nice picture.", "verified": true, "helpfulness": "0/0", "author": "Tim Trippel"}, {"rating": 4.0, "review": "Works well, seems to be fast, good picture.  It would be nice if there were more apps that worked with Fire TV", "verified": true, "helpfulness": "0/0", "author": "L. Haas"}, {"rating": 4.0, "review": "Mobile remote app doesn't see the fire stick on the network. Else, i would have given 5 *s", "verified": true, "helpfulness": "0/0", "author": "gamerkong"}, {"rating": 5.0, "review": "As an owner of both an AppleTV and a Roku, I don't know why I bought the Fire TV Stick other than it was $20 for Prime customers. But I'm actually very happy that I did. It's a really solid little device, gives easy access to Prime videos and works incredibly well with the Amazon ecosystem. It's a great low cost streaming device, easy to use menus, and very intuitive. I have mine running through a 5 port HDMI switch with no noticeable issues.", "verified": true, "helpfulness": "0/0", "author": "Jared Matfess"}, {"rating": 2.0, "review": "Does not access my Prime acct.  Ordered two for our home and no Prime videos appear as free. I am a prime member.  Maybe it just needs some time.  Also, Prime movies cannot compete with Netflix.", "verified": true, "helpfulness": "2/4", "author": "MommyHuggin"}, {"rating": 5.0, "review": "I plugged it into a HDMI in the back of my AV Receiver. Set up was quick. Found my wifi and connected and it updated the Fire Stick right away. Whole set up time was less than 10 minutes. I have Netflix and Prime also. Works great (no lagging) and sounds really good through my AV Receiver. The remote works fine with the stick plugged in the back of the receiver, does NOT have to be line of sight like I have seen on other reviews. Not sure why they would say that.Glad I got it. Anyone can set this up themselves.", "verified": true, "helpfulness": "2/2", "author": "Gregg \"Gregg\""}, {"rating": 5.0, "review": "The biggest advantage this has over the Chronecast is that this comes with a remote. But I do love it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Seems to work ok for Amazon Prime, but that service is severely limited in selection, so it is not very useful.  I was hoping to be able to stream similar to chromecast.", "verified": true, "helpfulness": "1/3", "author": "Jon Dobkin"}]