[{"rating": 4.0, "review": "well worth the money", "verified": true, "helpfulness": "0/0", "author": "jpage10"}, {"rating": 5.0, "review": "I am not a techie but I decided to try this after reading several articles about it and talking to  friend who is an internet security expert.  After I received the package, I didn't open it immediately because I was worried I might not be able to set it up without assistance.  I finally told myself to just to give it a try.  My worries were completely unfounded.  Set-up was so simple, it surprised me.  I have not yet explored all of its capabilities but I am already watching TV shows and movies without difficulty.  Now, I am seriously thinking about telling my cable company to take a hike.", "verified": true, "helpfulness": "0/0", "author": "gwenshuman"}, {"rating": 4.0, "review": "Great product.  Easy set up right out of the box.", "verified": true, "helpfulness": "0/0", "author": "jon pizor"}, {"rating": 2.0, "review": "The content of the stick was great. Lots to choose from, many services in one location.However... This thing is slow and full of bugs.Despite having excellent connectivity and full wifi bars, it operated like 90s computer. It often showed error messages and buffered and loaded forever. The apps, like Netflix and YouTube are especially slow and often just plain don't work. After speaking 4 times with Amazon reps, we were told this was all due to the weak processor on the stick. We have decided to return the stick and let Amazon have the chance to redeem itself by purchasing the Fire TV.Hopefully, there will be no issues with it. Or maybe we are just used to the instantaneous functions of all of our Apple Products.", "verified": true, "helpfulness": "0/0", "author": "Kara Sylvester \"Lactess\""}, {"rating": 5.0, "review": "Awesome!!! Now our family can enjoy movies together, the kids can play games, and I can use the fitness apps to workout from home.", "verified": true, "helpfulness": "0/0", "author": "MO Mom"}, {"rating": 4.0, "review": "Still fairly new to me, hoping to replace cable with it to save $ so many apps a Lil bit of buffering from time to time, but all in all I am happy with my purchase, I have been recommending to friends.", "verified": true, "helpfulness": "0/0", "author": "tigerclawz"}, {"rating": 5.0, "review": "Convenient, a value, and I cut the cord!", "verified": true, "helpfulness": "0/0", "author": "J. J."}, {"rating": 5.0, "review": "This is a fantastic little device.  it's speedy and does everything I want it to do.  It's currently plugged into our bedroom TV and we love this thing.  It's way faster than my Roku 2 and even a tiny bit faster than my chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jeff Belfiore"}, {"rating": 5.0, "review": "Great device and it came already to plug and go!", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 5.0, "review": "Wow, thank you Amazon.  This is fantastic and I had no problem setting up. It took me about 10 minutes or less set it up, and what I like is the large selection of movies and shows along with other  entertainment.  Well worth the price in fact I used one of my Amazon Gift Cards to make the purchase.", "verified": true, "helpfulness": "0/0", "author": "STEVE O."}]