[{"rating": 4.0, "review": "excellent and easy to use...", "verified": true, "helpfulness": "0/0", "author": "John A. Daly Jr"}, {"rating": 5.0, "review": "This is awesome.  No longer do I have cords coming out of my tv to my Kindle Fire.  Push a couple of buttons and you can look at anything you have on your Kindle or anything you want to purchase or rent. I never have to get up unless I wish to. Technology is great.  Keep up the good work.", "verified": true, "helpfulness": "0/0", "author": "Zigzag67"}, {"rating": 2.0, "review": "It's ok, but interface is not as smooth as the Chromecast. It is difficult to find the streaming content from Amazon, and seems to push the paid content and not the stuff that is no charge through my Amazon Prime membership. For netflix or youtube viewing, it works well, but so does my Chromecast.", "verified": true, "helpfulness": "1/1", "author": "J. P. LARSON"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "yolanda green"}, {"rating": 5.0, "review": "I love the FireTV Stick!  It's Incredible to say the least.  A worth-while investment!", "verified": true, "helpfulness": "0/0", "author": "Charles Verschage"}, {"rating": 2.0, "review": "I have found this to be a disappointment.  In the middle of streaming, it suddenly loses the signal.  When I check the connection, it says the signal is strong but has connected with problems.  Sometimes it works like a charm but this seems only to be every other day.  Opening the compartment to insert the batteries took over 30 minutes.  Was considering getting another one for a different TV in my home but I think I will stick with my other streaming device which does not get Amazon Prime content.  Which will also translate into not getting another Amazon prime membership next year.", "verified": true, "helpfulness": "0/0", "author": "Analyst Gal"}, {"rating": 1.0, "review": "Doesn't work with Linksys E1200 router", "verified": true, "helpfulness": "1/1", "author": "Graham E Garrenton"}, {"rating": 4.0, "review": "Really wanted it,but it won't work with my tv.and my tv is new but could not get it to fit anywhere.sucks so I sent it back.sad to say.looks nice.", "verified": true, "helpfulness": "0/0", "author": "susan"}, {"rating": 2.0, "review": "Doesn't always work. Locks up, says no signal. But works on laptop while stick sit there doing nothing.", "verified": true, "helpfulness": "0/0", "author": "Denise D Lukawski"}, {"rating": 5.0, "review": "fantastic  surpasses all expectations", "verified": true, "helpfulness": "0/0", "author": "Natalie"}]