[{"rating": 5.0, "review": "Everything you could possibly want in a compact package. I took advantage of the Prime members presale and picked one up for $19.  Worth it at twice the price!I had a Roku box, and had entertained the idea of ordering a Google Chromecast or Roku Stick.  When I saw the Fire Stick, based on my previous experiences with Amazon products,I knew it was what I needed.  I cut the cord on Cable several months back.  Around May of 2014.  The Fire Stick lets me stream a ton of content and doesn't need a space to sit like the boxes that do the same.  I like the interface.  And the variety of channels and apps is great.As a bonus, if you have a smartphone, there is an app that can be used as a controller.  It helps when you are searching to be able to use a keyboard on your phone instead of the text entry on the remote.I also noticed that on my new Kindle Fire 6, that you can put content from the Kindle on your TV through the stick.  I'm sure there is some sort of remote function as well, but I haven't researched it.", "verified": true, "helpfulness": "1/1", "author": "rda"}, {"rating": 5.0, "review": "Waited awhile to get but installed quickly and started using.  It's great!", "verified": true, "helpfulness": "0/1", "author": "Peter P. Forrest"}, {"rating": 5.0, "review": "AWESOME! Easy to install, took 5 minutes! Now I can watch movies, TV show etc. on my TV screen instead of my Kindle. Wish the remote was a little bigger but, no problem.", "verified": true, "helpfulness": "0/0", "author": "Linda D. Ferreira"}, {"rating": 5.0, "review": "Love my Fire TV - it gives me so many options ... saves me so much money on cable and so many channels to watch movies, series and news.Easy to use and what a terrific bargain price.. highly recommend.  buy it ... buy it...", "verified": true, "helpfulness": "0/0", "author": "Maria E. Cormane"}, {"rating": 5.0, "review": "Like real well...works great! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ricky E."}, {"rating": 5.0, "review": "I received my Fire Stick yesterday. It is fantastic. The instructions on how to hook it up were so simple and precise. I had the stick in my TV and was watching a movie in under 20 minutes. I also am receiving a 30 day free trial of Amazon Prime and believe me I will definitely be signing up for it after the free trual. I am so going to love this!!!! Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Marie Corless"}, {"rating": 5.0, "review": "I love itEasy to hook up,  was ready to use within minutes. I like how its connected to my account and comes with parental locks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is easy to set up and start watching. The only thing I have trouble with is the controllers I get echo and fire TV stick mixed up. LOL", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Fire stick was very easy to set-up.  I have no complaints only compliments, and will be sending my friends, and some family members, a birthday fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "Mercedes P. Brown"}, {"rating": 5.0, "review": "We purchased and installed the Fire Stick in order to increase the value of our Amazon Prime, and it truly does!  The Fire Stick arrived already recognized by Amazon and we then easily added our Kindle as a control device -- what fun to use voice commands to control the unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]