[{"rating": 4.0, "review": "Awesome..we have one in every room.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Garcia"}, {"rating": 3.0, "review": "Could not access ESPN using the fire stick. I was not aware you had to have a subscription in order to view for free. That was the intention of purchasing the stick, so I can access channels that I cannot through DISH.", "verified": true, "helpfulness": "0/0", "author": "Roy Abeyta"}, {"rating": 5.0, "review": "I was afraid it would be more difficult to use but it is so easy. Finally I can watch Amazon Prime on the big screen. Though I do watch on my smartphone and my Kindle HD depending on the situation.", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "I am so happy I bought this. It works perfectly, exactly as advertised. I do not have an HD tv, but there is an HDMI port. I used to plug the HDMI cable from my laptop to the tv, and have to use the mouse to navigate. Slow and not user friendly. This firestick is fast and all shows are easy to find, the remote is so nice to have. I do not subscribe to any tv cable service, so this is perfect for Netlix, Hulu, Amazon Prime etc subscribers who just want to watch random shows and movies.", "verified": true, "helpfulness": "0/0", "author": "laissez-faire"}, {"rating": 5.0, "review": "Better than the chromcast I like it", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 4.0, "review": "Great Item....Perfect for Hotel on Vacation.....", "verified": true, "helpfulness": "0/0", "author": "S.G."}, {"rating": 5.0, "review": "Way better than chromecast, cheaper, too.", "verified": true, "helpfulness": "0/0", "author": "Victor Mancini \"Vic\""}, {"rating": 4.0, "review": "I like it.  it was easy to install too.", "verified": true, "helpfulness": "0/0", "author": "Nancy E. Hamburger"}, {"rating": 5.0, "review": "LOVE OUR FIRE TV STICK!", "verified": true, "helpfulness": "0/0", "author": "Brandon L."}, {"rating": 5.0, "review": "At first I got a roku, then I got an Amazon Fire Stick.I love the firestick and would recommend over roku ONLY because Sling plays better on the FireStick", "verified": true, "helpfulness": "0/0", "author": "Halejn"}]