[{"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "valerie nelson"}, {"rating": 5.0, "review": "so far so good :)", "verified": true, "helpfulness": "0/0", "author": "Carol from TN \"xcptnl\""}, {"rating": 5.0, "review": "We love the Fire TV Stick. Since we're cancelling our satellite TV, we've been looking at options for TV when we want it. Fire TV gives us access to a great many show and movies and we also signed up for Netflix through Fire TV, which is really convenient.", "verified": true, "helpfulness": "0/0", "author": "jerseylover"}, {"rating": 3.0, "review": "Not quite ready for daily use.  The software is well done and the form factor is ideal.  Unfortunately I've seen a significant number of malfunctions that may be heat related.  I've also had the device lose my login information for apps like netflix, making me repeatedly input them using the remote control.I'm sure that when Amazon works the kinks out of this new device it will be excellent, but the user experience is still a bit painful.3 stars because it's so inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Pete Pulliam"}, {"rating": 5.0, "review": "We ditched DirectTV last year and avoided a ridiculous cable bill by just using cable internet with Prime. The only thorn in my side being that we had to lash a computer to the TV to watch our shows (mostly Dr. Who, and a few movies). I saw the Fire Stick as a possible investment - better than buying new adapters everytime a computer crashed or became incompatible. It has been a great investment to no longer fool with cables and adapters, and the occasional freak incompatibility. To boot, we took the Fire Stick to grandparent homes, hooked in, and voila - they could (cough) enjoy the shows with us!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Help can't get the controller to stop scrolling...not sure what's going it's been perfect till just now.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome device", "verified": true, "helpfulness": "0/0", "author": "Health Padge"}, {"rating": 5.0, "review": "Love it. The fire stick works perfect for the flat screen on the wall. No need for an added shelf to hold a box so that we can watch netflix or amazon prime videos.", "verified": true, "helpfulness": "0/0", "author": "Slh"}, {"rating": 4.0, "review": "Been very happy with the Fire TV Stick.  Would have given it 5 Stars but it does not have HBO Go at this time", "verified": true, "helpfulness": "0/0", "author": "M. OMalley"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]