[{"rating": 1.0, "review": "It doesn't work. Only watched a couple of times and it stopped working. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "linda rozsa"}, {"rating": 5.0, "review": "Works exactly as expected. Love it.", "verified": true, "helpfulness": "0/0", "author": "Michael Garton"}, {"rating": 5.0, "review": "this product was was very good and the price was right", "verified": true, "helpfulness": "0/0", "author": "Barbara Powell"}, {"rating": 4.0, "review": "Pros:- Inexpensive- Easy setup- Superior HD streaming- Christmas gift for Dad? Covered.Cons:- No iOS companion app, leading to...- ...another remote [for now]Background:We've had a Gen 3 Apple TV since 2012.  We love it.  But we use Prime Streaming a lot, and tying up an iDevice to AirDrop Bubble Guppies for the kids gets old.  So I pre-ordered two Fire Sticks at $19.Setup:Similar to Apple TV, but even easier.  Plug it in, set up Wi-Fi, let it update, and you're good to go. (On that note, I don't understand people complaining that their television's USB port won't power it.  This thing has a dual-core processor, chewing through gigabytes of HD video...it's going to need some juice.)One cool surprise: Amazon links the Fire Stick to your Prime account before shipping, so there's no account sign in...which saves a minute or two of on-screen keyboard pain.  Very smart.  Navigation is simple, and the remote is RF (radio, instead of infrared)...so it doesn't care where I'm pointing it.  (One suggestion for Amazon, though: Allow users to skip the intro video.)Fire Stick is capable of music, Hulu, games, and some other things, but I haven't touched them.  (My wife digs General Hospital, but I don't care who Sonny killed this week...so Hulu is her thing.)  I bought this for one reason: Cheap Prime Streaming.  And it's great, for two key reasons.First, the menu allows you to start watching right away, whereas Apple TV forces you a page further into the menu to find a \"watch now\" button.  That may not seem like a big deal, but I found it hugely convenient.And the big one: \"Time To Stream\". It's a term I use to represent how long it takes to navigate the menu and actually start watching. Amazon obviously had a goal of fewer clicks and minimal waiting...and it's extremely well done. Bottom line, you're watching an HD stream *less than one second* after pressing Play.  In total, Fire Stick's \"Time To Stream\" is 5-10 seconds quicker than what I'm used to with Apple TV.  (My wife even commented on it, so it's not just a \"techie\" observation.)  I'm running a three year old, refurbished Wi-Fi router at home, so color me impressed.I've read mixed reviews about the Android companion app to control it (and search, which would be cool), but that'll improve quickly now that Amazon is shipping them and getting feedback.  The iOS version is due out \"soon\", so until that hits I've nothing to add.  One thing I really wish they'd have borrowed from Roku is the headphone-jack-in-the-remote feature.  But oh well.Nice job, guys.", "verified": true, "helpfulness": "0/0", "author": "Sean Sparacio"}, {"rating": 5.0, "review": "So far I really like the Fire TV Stick. Defaulting to the Amazon Video menu is nice, and all the Amazon content comes up very quickly. Hulu and Netflix work well, probably not quite as snappy to start up as on my Roku devices, but once it's streaming there are no issues. Installing the Hulu and Netflix apps was very easy. The interface is easily navigable with the remote.", "verified": true, "helpfulness": "0/0", "author": "Timothy J Wingfield"}, {"rating": 5.0, "review": "Love it !!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jay Carter"}, {"rating": 4.0, "review": "First off, as a pre order device, it's pretty solid. The software is easy to use. The device is easy to set up, a part they forgot to mention is the external power source used to give it some oomph. Still, it wasn't an issue.My main concern is the ability to prevent unauthorized purchases made by children. I'm excited an iOS app is coming.", "verified": true, "helpfulness": "0/0", "author": "David H."}, {"rating": 5.0, "review": "Fast , Simple ,easy , and fun. Also use my cell to control it and it works great.", "verified": true, "helpfulness": "0/0", "author": "Count"}, {"rating": 5.0, "review": "Surprised at how well the Fire Stick worked.  Actually works better than my Chromecast, that seems to need to be re-plugged in before each use.  The Fire Stick starts right up.  I like the remote.  Sometimes a little sluggish in response, but overall my goto device now. (Out of Chromecast, Roku 2 and Apple TV 3)", "verified": true, "helpfulness": "0/0", "author": "the hoz"}, {"rating": 5.0, "review": "Excellent device for any monitor/TV with an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "David"}]