[{"rating": 5.0, "review": "I love this little thing.", "verified": true, "helpfulness": "0/0", "author": "MrNate"}, {"rating": 4.0, "review": "It's cool, glad I got it for $20, would not have paid more for it.", "verified": true, "helpfulness": "0/0", "author": "nom de plume"}, {"rating": 5.0, "review": "I have been looking for a means to watch Netflix and Amazon movies on my bedroom TV for a long time. I came across this Fire Stick and thought it might work. I am 63 years old, disabled and live alone so was hopeful that it would be as easy to install as stated. I opened box, put stick in HDMI slot then followed directions on the screen and it worked immediately. Unbelievably easy. The hardest part for me was getting the remote open with my arthritis to get the batteries in. Amazon Prime movies worked great but I couldn't get Netflix to do anything but buffer. I was quite unhappy but felt that it was still worth the price to just watch my Amazon movies. But, I went online and read the Amazon forum on the subject of Netflix and there was a solution posted by a man who said that the Amazon techs suggested how to fix it. I went back to my room, followed the instructions and Voila.....Netflix now works perfectly. I absolutely LOVE my Amazon Fire Stick and highly recommend it to everyone. I just wish I had bought it a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This TV stick is pretty cool. I can install apps as I want and watch videos within the apps. I can search videos on my phone/tablet in YOUTUBE and cast it to TV. That's really convenient! No need to connect my laptop to TV to watch videos.However, the specs are so low that everything is slow on it. It takes minutes to load apps and apps crash a lot.The default launcher is not friendly to load user apps. You can install the wukong tv remote on tv stick and your android phone. after that, you can open apps installed on tv stick from the phone easily. I also installed a third part launcher on the stick. each time I turn on the tv/stick, the launcher will open automatically after the default launcher is opened. the third part launcher is much more enjoyable to access apps on the tv stick.I love the TV stick but it needs a lot improvement though, especially in the hardware specs.", "verified": true, "helpfulness": "1/1", "author": "Jenny"}, {"rating": 4.0, "review": "Nice system. Traded in my Roku. My Roku kept freezing so decided to try the Fire stick. First took off one star and maybe this is my own fault also. Took me awhile to figure out the remote and instructions were not helpful. But, after got that figured out the amazon stick is a great little media streaming device. Easy setup, then added all my apps, very quick response time and loads my netfix shows in just a couple of seconds. Easy navigation. All in all very worth the 39.00. By the way, the remote circle is not like a ipod. You just click n,s,e,w. Not in a circle. : )", "verified": true, "helpfulness": "0/0", "author": "M. Hall \"Voyager\""}, {"rating": 5.0, "review": "This is a wonderful device. It's very easy to use and has all the apps one could possibly want including Netflix, Hulu Plus, HBOGO, Encore ,Starz, Showtime, and hundreds of others including Prime Music !A note of caution to Comcast subscribers : recently on all my devices Amazon Prime video content has been dramatically slowed . This does not affect  video content on any of the other numerous apps. My internet speed is 28 to 30 mbps (very fast ) . This was a problem for Netflix a year or so ago until they cut a deal with Comcast for a fast lane , now they are 1080 P on this device . ( Amazon may need to talk with Comcast re a fast lane ) .", "verified": true, "helpfulness": "1/1", "author": "MissMB"}, {"rating": 4.0, "review": "Easy to install & navigate with.  Would recommend this product to others.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 3.0, "review": "So easy to use! Will have to learn more of it when I have some time. Love you can download apps. Wish it had a better selection of newer movies and not ask you to purchase for 19.99 when you're a prime member already! Will re re-view in the future.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "Awesome product!!!", "verified": true, "helpfulness": "0/0", "author": "Mary Mackey"}, {"rating": 5.0, "review": "OMG I'm in love with this fire stick!!!!! I bought this as a gift for my husband who was dropping hints for WEEKS! Finally got it for him and we're both hooked....like I mean we are obsessed with this gadget. When we just got it we never left the room for a whole day lol we watched our favorite shows and what I really like about it is the ease of use. Like if I'm on my phone using an app like youtube there is an icon within my youtube on my phone that I click and voila it's on my tv :O It's pretty cool! The remote is extremely responsive which I love, the only thing I can't do with that remote is turn up the volume but no matter its great either way.I'm thinking of getting the game controller next because you can play games with it too. It was definitely a good buy and I've never seen my husband so excited over a little gadget that looks like a thumb drive lol", "verified": true, "helpfulness": "1/1", "author": "Kelly"}]