[{"rating": 5.0, "review": "Works great! Love all of the options for viewing. Plus, that you can use it on any newer TV. Great price,too.! Yay! :)", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is awesome, works great.  We are getting rid of our cable bill.", "verified": true, "helpfulness": "0/0", "author": "elsachelle"}, {"rating": 5.0, "review": "Great interface, and love the phone app for the remote.", "verified": true, "helpfulness": "0/0", "author": "B's mama"}, {"rating": 5.0, "review": "I love it. It is exactly what I ordered. Super fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Theresa Buckner"}, {"rating": 2.0, "review": "The fire stick is OK.  I am really nervous about how long it will last.  It gets VERY HOT when plugged in for about 2 hrs.  There is no way I would want to let it plugged in to my TV for an extended period of time.", "verified": true, "helpfulness": "0/0", "author": "Roberta Getz"}, {"rating": 5.0, "review": "Absolutely LOVE!  Way better than the google chromecast I had before purchasing this.  Now there's no need to use my tablet or laptop to watch my shows and movies on Amazon Prime or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Tvesbrink"}, {"rating": 5.0, "review": "Fantastic! I own a chrome cast and now the Firestick. The Firestick wins hands down. Easy to use, no glitches, love it!!", "verified": true, "helpfulness": "0/0", "author": "Peter Rustad"}, {"rating": 5.0, "review": "Much better then Chromecast", "verified": true, "helpfulness": "0/0", "author": "docs22"}, {"rating": 2.0, "review": "I knew that they would be slower than the Amazon Fire box, but I am not happy with how much slower they are. These sticks often will freeze while streaming, and I don't have that same problem with my Fire box.  Given the choice again, I would rather have purchased a second Fire box.", "verified": true, "helpfulness": "0/0", "author": "JARED R CLEMENCE"}, {"rating": 4.0, "review": "Great price for what you get, I like how the kindle fire links up to this, I can use my iphone to navigate this.  Sometimes it resets itself.  It does get very hot after a little while running.", "verified": true, "helpfulness": "0/0", "author": "B-MAC"}]