[{"rating": 4.0, "review": "Great streaming device! Super fast and runs smoothly!Pro: unlike chromecast the Fire TV Stick runs by itself. No need to tie up a device to stream!  Big pro!Con: there is no way to shut it off unless you unplug it. Not a huge deal as it has a sleep mode but shutting it off would be a nice option", "verified": true, "helpfulness": "0/0", "author": "Thajawn"}, {"rating": 5.0, "review": "Works Excellent, Side-loaded Kodi. Plays wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lally"}, {"rating": 3.0, "review": "I wish I had known before purchasing this, that I still needed to plug this device into an outlet. Apparently, my TV (<5 yrs old) does not produce enough power on its own to support the stick without it being plugged into an outlet. I'm still getting familiar with everything else, so I'll edit this review when I have more information about the user interface.", "verified": true, "helpfulness": "0/0", "author": "Sara Therrien"}, {"rating": 5.0, "review": "Missing youtube...", "verified": true, "helpfulness": "0/0", "author": "justin1643"}, {"rating": 5.0, "review": "Surprisingly easy to set up and great selection.  Need wi-fi, broad band and best to be a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Paul Jobs"}, {"rating": 3.0, "review": "Have very difficult time using on wifi even though  other devices work fine.  Keep getting message that download speed is not sufficient to stream video.  Finally switched to Roku and not having any problems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am very happy with this device.  It is very easy to install and navigate, with many pleasant surprises.  It has shut down a couple of times, but it easy to restart.", "verified": true, "helpfulness": "0/0", "author": "Douglas"}, {"rating": 5.0, "review": "Very comparable to the Roku I already had. I bought this for a second TV, tried the Fire TV Stick due to lower price and the neatness of the plug in stick vs. the stand alone Roku box. It streams really well even though it sits in the next room away from the router and not in direct line of sight. The Fire Stick is just as easy to install and setup especially if you buy through Amazon. It comes pre-registered.  I also downloaded the Fire Stick app on my Android which comes in handy if you are surfing without sufficient light, the phone stays lit to see remote buttons better.After a quick learning curve in maneuvering the menus I was watching movies within 5 minutes of installation. I cant really find any negatives on anything yet even after several weeks. Very easy to use and overall just as happy with the Fire Stick as the Roku.", "verified": true, "helpfulness": "0/0", "author": "Happy in AZ"}, {"rating": 3.0, "review": "Don't love it. I don't like that it has to be plugged into an outlet, I didn't know that before I got it. It's inconvenient because you have to make sure you have an outlet close by, and the cord is not that long. Otherwise I think it's as described. comes with the cute remote, easy to use, sign onto your amazon account and voila.", "verified": true, "helpfulness": "0/0", "author": "hsaho"}, {"rating": 5.0, "review": "Amazon did well by this device. It is more powerful and more feature rich that its competitors. Also with some amature/intermediate tinkering additional programs can be installed to enhance the experience. Example console Debs, Lorraine just called to indicate she is having some trouble interpreting your Appendix on the Fit and Proper Schedule. She does not understand what exactly are the changes we would like made. She said you can clarify in an email to her so she can make the change emulators and various media streaming software.", "verified": true, "helpfulness": "0/0", "author": "Rene Devon Singh"}]