[{"rating": 5.0, "review": "Works great and responds fast!!!", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "I had a problem with the first fire TV Stick and returned it.  Amazon extended my trial period.  The second one worked great.", "verified": true, "helpfulness": "0/0", "author": "TBowser"}, {"rating": 5.0, "review": "I was worried that this stick wouldn't get a good signal from my crappy WiFi, but it has really worked.  Really easy to setup with a cute little video and since I was a Prime Member, it was already signed into and ready to go with my account. I'm alittle bummed though. I bought this because my LG TV Amazon App was expiring, so I was forced to buy the Fire Stick.  A week after I bought the stick, they sent me a code for $10 dollars off. Thanks Amazon, I already bought the stick!", "verified": true, "helpfulness": "0/0", "author": "rjv4EVER"}, {"rating": 5.0, "review": "Love the Fire Stick! Works excellently, no issues!", "verified": true, "helpfulness": "0/0", "author": "GolferGuy85"}, {"rating": 5.0, "review": "We have a 55\" LCD TV and have been considering purchasing a new TV for the \"smart\" functions of watching NetFlix, Amazon Prime and other streaming movie services. We were tired of connecting the iPad to the HDMI where we had no pause/rewind functions and it would commonly freeze up requiring a restart.I came across the Fire Stick on sale and decided for less than $30, I'll give it a shot. WOW! I can't believe how amazing this little and inexpensive gadget is! My wife, who hates everything, LOVES this purchase. It comes with everything needed to plug and play. I just wish I had bought it sooner.", "verified": true, "helpfulness": "1/2", "author": "J. T. Turner"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Tracy Saylor"}, {"rating": 5.0, "review": "It is a great", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Thanks very good. I really like it", "verified": true, "helpfulness": "0/0", "author": "LIND A SMITH"}, {"rating": 3.0, "review": "This device is sleek, modern and easy to navigate. It also has a nice interface which is user friendly. However, after spending time using the device, l unfortunately came across some things which are deal breakers for me. For starters, the media content appeared washed out after loading it onto the screen. I kept hoping the color/display would sharpen after a few moments but it never did. Next, simple apps which l used on my Roku player did not grant me permission when downloading them thru the Amazon app store. Overall, l feel this media player is too micromanaged. It offers little to no options for exploring, unlike Roku who seems to encourage and welcome such things. As much as l wanted this purchase to work, l will inevitably have to rtn the system.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 2.0, "review": "It's worth paying extra for apple tv. Fire stick just doesn't have the features that I want.", "verified": true, "helpfulness": "0/0", "author": "Hunter Glover"}]