[{"rating": 5.0, "review": "It was so easy to setup. It took about 5 min to get it setup and my son was watching a movie.  We were worried about the streaming since our XBox 360 used to freeze while watching netflix and considering it was on the 3rd floor where the router is on the 1st floor, but it didn't! I love Amazon's fast shipping!", "verified": true, "helpfulness": "0/0", "author": "Desiree"}, {"rating": 5.0, "review": "Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Wille Esco 818"}, {"rating": 5.0, "review": "It,s was easy to install but the prime movies package had no up date movie", "verified": true, "helpfulness": "0/0", "author": "william a watkins"}, {"rating": 5.0, "review": "Easy to install.  Great user interface.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Marie I."}, {"rating": 5.0, "review": "I really like this Amazon Fire Stick.  I love watching shows on Amazon Prime and Netflix.  I also have Hulu Plus and this Amazon stick works great.", "verified": true, "helpfulness": "0/0", "author": "Cheryl P"}, {"rating": 2.0, "review": "Love the features. There's a lot of options that being said.  It freezes up a lot!  I have an old bluray that had less lag. I really wish this product was more efficient because I love the portability of it but I should have invested more money and went with the roku. My advice is to bypass this product.", "verified": true, "helpfulness": "0/0", "author": "Shiloh Worman"}, {"rating": 4.0, "review": "Great product got it for my father very simple to use. Could come with a longer power cord seeing that most TV is a are not strong enough to support powering the stick.", "verified": true, "helpfulness": "0/0", "author": "Stephen M."}, {"rating": 1.0, "review": "i received it only for it to work for a week and then starts to act up. my internet/wi-fi work great with everything except this product. i can get on my kindle and watch anything.i use the kindle fire stick and it takes forever to load then acts like the wifi is down then other times it loads and i can watch the show for a few minutes then in buffers and then drops it. i am more then furious with this product.", "verified": true, "helpfulness": "0/0", "author": "Evan M Thomas"}, {"rating": 5.0, "review": "easy to use, no issues with the wifi and excellent picture!", "verified": true, "helpfulness": "0/0", "author": "andrew gzibovskis"}, {"rating": 4.0, "review": "This is the second fire stick I have bought and I have been extremely pleased with them.  Easy to install and operate, looking forward to the HBO Go app.", "verified": true, "helpfulness": "0/0", "author": "Ronald Bailey"}]