[{"rating": 1.0, "review": "this thing constantly loads, and a lot of time when you are watching something it just turns off", "verified": true, "helpfulness": "1/2", "author": "Joshua Myers"}, {"rating": 5.0, "review": "Great price. Simple setup. Awesome product overall.", "verified": true, "helpfulness": "1/1", "author": "Gully.Girl \"What happened to my bag of doughnuts?\""}, {"rating": 5.0, "review": "Everything worked as advertised. I really like the remote that came with the Fire Stick. Chromecast doesn't come with a remote. IEasy to install (you need to know how to change source on the TV and your WiFi pin). It has many more features than I imagined, like you can load your personal pictures to be the screensaver slide show. Great Buy!", "verified": true, "helpfulness": "1/1", "author": "tlearned"}, {"rating": 4.0, "review": "I love this!!! I've had it for a little over a week and it's great (I have access to Netflix, Hulu, Showtime, and HBO accounts.) It turned my 50\" flat screen into a smart TV! I'll show you all a Pros vs. Cons list though, for the hesistant shoppers:PROS* Easy setup (literally plug it into the HDMI port, plug the other end into the USB, connect to wifi and you're golden)* So many movies/tv shows/channels I don't think I'll ever watch them all* Diversity in movie and TV options (Action, News, Sports, Lady channels, etc.)* Sling TV (live TV with a free 2 week package, then $20/month, with only a wifi connection)* Free initial seasons of popular HBO shows (i.e. Six Feet Under, True Blood, etc.)CONS* Unless you already have a Netflix, Hulu, Showtime, HBO Go accounts, it's not as fun. The movies available through Prime are a little bit better than the ones offered through Netflix, but not by much*The games are pretty boring, but I didn't buy it for the games. If you're looking for better games, buy the Amazon Fire TV packageOverall, I'm very happy with my purchase and I look forward to watching TV for the rest of the summer!!", "verified": true, "helpfulness": "1/1", "author": "Jillian"}, {"rating": 4.0, "review": "Would have given it Five Stars but PRIME is not available in the United Arab Emirates, when that changes I'll give it a five.", "verified": true, "helpfulness": "0/0", "author": "Trad Hughes"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Pete Duncan"}, {"rating": 5.0, "review": "Awesome awesomely awesomeness", "verified": true, "helpfulness": "0/0", "author": "Annette"}, {"rating": 5.0, "review": "I borrowed my friends fire stick and believe me this thing is the \"BEST\" no issues not a one and my 7 year old installed it. I'm definitely buying my own two thumbs up Amazon!!!!", "verified": false, "helpfulness": "0/0", "author": "kareem g"}, {"rating": 5.0, "review": "LOVE IT, Have it in my man cave and what better way to watch streaming media? Easy and so affordable.", "verified": true, "helpfulness": "0/0", "author": "bigshow"}, {"rating": 3.0, "review": "Works well for the most part and certainly allows access to Prime programming. However, MLB.TV is terrible on Fire Stick. It constantly buffers and the image is not the highest definition. I bought AppleTV. Better interface. MLB is crystal clear no buffering issues.", "verified": true, "helpfulness": "0/0", "author": "Matty C."}]