[{"rating": 5.0, "review": "Love it, no need for a smart tv you have it with the amazon stick.", "verified": true, "helpfulness": "0/0", "author": "Danita Bowen"}, {"rating": 5.0, "review": "Does exactly what it was advertised to do, very easy to hook up.", "verified": true, "helpfulness": "0/1", "author": "renee crocker"}, {"rating": 3.0, "review": "I thought this would be a great purchase so we could stream Nexflix and Amazon prime, however after about 10 hours of use, we are getting an error message that it's not connecting to the WiFi (in the middle of a show we are watching).  After reading some other users having the same problem and what they tried to solve the problem, I may still be returning this item if I cannot get resolve soon.", "verified": true, "helpfulness": "2/3", "author": "Barbara A"}, {"rating": 1.0, "review": "This worked great for a week. I threw the box away and am not sure if I can return it now. It will not work in ANY hdmi port I try it in now. It won’t do anything. It was working great and then just stopped in the middle of a show. :(I’m sad because the first week, it was so great.", "verified": true, "helpfulness": "2/3", "author": "J. \"J.\""}, {"rating": 5.0, "review": "Excellent simple device to use.  Why pay 3 times more for Apple TV when you can get comparable features with this device and it can be hidden from view.", "verified": true, "helpfulness": "0/0", "author": "P C"}, {"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/1", "author": "Sahak G."}, {"rating": 5.0, "review": "Love my Amazon Fire stick!  It makes watching amazon instant video readily available.", "verified": true, "helpfulness": "0/0", "author": "M. Vaughan \"GFCF Mom\""}, {"rating": 5.0, "review": "Luv it but got quantity of two.  Think I'll keep for gift or another home tv.  Thx luv it", "verified": true, "helpfulness": "0/1", "author": "debbs \"poldarksearcher\""}, {"rating": 5.0, "review": "the only way to make it better would be to add you tube or vevo type apps for music videos", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"pog1187\""}, {"rating": 5.0, "review": "Awesome. So easy to use, especially if you have amazon prime.  I prefer it to roku. Fire stick is Easier to set up!!!", "verified": true, "helpfulness": "0/0", "author": "nikkimc11"}]