[{"rating": 5.0, "review": "Very good. Lots of content.", "verified": true, "helpfulness": "0/0", "author": "sandy fisher"}, {"rating": 5.0, "review": "It's great with powerful memory and lots of options on apps like Prime video, Netflix, Hulu etc. Am sure HBO Now will land up here too. Remote works very well ... Like the User Interface! Great for turning an old non-smart TV into a connected one, saving me boatloads of money until technology evolves again.", "verified": true, "helpfulness": "0/0", "author": "Steven Fernandes"}, {"rating": 5.0, "review": "Great product. Work just like it's supposed to. Sometimes the picture can get bad but I think that's got more to do with the Internet conmection than the actual device. Highly recommended to anyone who wants stream shows on their HD TV.", "verified": true, "helpfulness": "0/0", "author": "Christopher C Stein"}, {"rating": 5.0, "review": "Great device!!  Very easy to hook up, able to access all my favorite shows.  Very reasonable price!", "verified": true, "helpfulness": "0/0", "author": "Meaghan Ellis"}, {"rating": 5.0, "review": "I don't usually write reviews, but I thought I should since there are so many options when it comes to streaming. First, it hardly takes up any room and the set up is easy. I do not like a lot of cords around the back of the tv, this simply plugs into the HDMI port and the adapter plugs into the wall. I am pretty tech savvy but I prefer simplicity when I am hooking up things (don't we all!) I immediately started watching Netflix after everything was done. Everything has been a breeze. I've had it for about a month and I love it.", "verified": true, "helpfulness": "0/0", "author": "R. Coleman"}, {"rating": 1.0, "review": "I don't get any fox news or any free TV", "verified": true, "helpfulness": "2/4", "author": "Elizabeth Ross"}, {"rating": 5.0, "review": "Works great.  Simple to plug in and set up.", "verified": true, "helpfulness": "0/0", "author": "Helmer Van Vuren"}, {"rating": 5.0, "review": "Super easy to navigate with.I recommend this product,you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "i like it i can watch my movies on my big screen seems to work well so far", "verified": true, "helpfulness": "0/0", "author": "Gregory Renner"}, {"rating": 5.0, "review": "Great item 👍", "verified": true, "helpfulness": "0/0", "author": "Alex"}]