[{"rating": 4.0, "review": "Great, it's tiny & does everything that I need it to. Very easy to use", "verified": true, "helpfulness": "0/0", "author": "kelsie murphy"}, {"rating": 5.0, "review": "I dropped cable a few months ago and I don't miss it, Fire TV Stick made it easy. I just select a movie or TV show from one of many sources, including my personal favorites Amazon Prime and Netflix.  For music I listen to Amazon Prime Music or Pandora, radio is available but I haven't tried it yet. Installing the Fire Stick is easy and simple to use. I consider myself a tough customer and do my research, this product has exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Tricia Moran"}, {"rating": 5.0, "review": "Excellent product.  Super with Prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Anne Copp"}, {"rating": 1.0, "review": "i have to connect to the internet via a web browser and this does not work - sucks.  simple thing that amazon choked on", "verified": true, "helpfulness": "0/0", "author": "Ryan toner"}, {"rating": 1.0, "review": "Does not hold wifi connection.  Repeatedly sends me to connection setup even though it indicates a very strong signal.  Other wireless products work in the same location in my apartment.  Very unreliable.  The times it is up Netflix rarely streams even though Amazon will.  The interface is nice but I wish it would just work.  I suppose it's not an issue that can be fixed with a firmware update.  These units must have a very weak antenna.", "verified": true, "helpfulness": "0/0", "author": "andrew"}, {"rating": 5.0, "review": "I love this thing, great for my kids😁", "verified": true, "helpfulness": "0/0", "author": "Allisa S Boeke"}, {"rating": 4.0, "review": "I like all the programs and movies I can not get on cable . It is a bit of a trouble to switch from one to the other. I do feel it provides me with more entertainment and is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Marilyn F. Cohen"}, {"rating": 4.0, "review": "Could use more free streaming content.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Like any device, it has its good and bad, but I'm not going to go into too much detail.  There are too many folks out there on youtube and other media that have reviewed this device and they'll give their biased opinion based on their use of the device.  For me, it does everything perfectly!Availability of games, number of apps and native support for Kodi makes this device unbeatable in terms of price, portability and functionality.I give it 5 stars all the way.I'm sure with future firmware updates from Amazon, this device will only get better.", "verified": true, "helpfulness": "0/0", "author": "Sohail A. Khan"}]