[{"rating": 1.0, "review": "Not to happy with it, just about everything on it you have to pay for it. I will stick with my dish network.", "verified": true, "helpfulness": "0/0", "author": "Darrell Finley"}, {"rating": 5.0, "review": "The firestick works very good. I waited for awhile,but when I received it, I was surprised at how easy it was to connect & how well it worked. I am very pleased & would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "darrell kassinger"}, {"rating": 5.0, "review": "Even that Roku has a remote control too, the size of this is amazing.  It's powerful and the user interface is user friendly.", "verified": true, "helpfulness": "0/0", "author": "Guillermo Betancourt"}, {"rating": 4.0, "review": "Enjoyable & easy to use.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "fun, easy to use", "verified": true, "helpfulness": "0/0", "author": "Mary Wightman"}, {"rating": 5.0, "review": "Great little gadget to stream content from the web.", "verified": true, "helpfulness": "0/0", "author": "John J Aupperlee"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's a whole new world out there. Seriously considering scaling back our satellite package, with all of the options available now. Prime is a great addition as well!", "verified": true, "helpfulness": "0/0", "author": "Margaret B"}, {"rating": 5.0, "review": "All I can say is AWSOME item.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Gruszka Sr"}, {"rating": 4.0, "review": "This has been great! I don't own a gaming system...not into video games and was watching Netflix on my laptop or tablet. No more! Now, I can see them on the big screen. It was a breeze to set up and navigation is intuitive.Just one, tiny complaint--not sure who designed the remote, but they missed the mark on the opening feature for inserting batteries. It is very difficult to open. Because it is smooth, there is no clear way to gain grip or determine where to apply force. There is no indication where to push or in which direction. I spent 15 minutes trying to open it, getting frustrated, feeling stupid and finally calling customer support. Fix this slight flaw and five stars would be yours.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]