[{"rating": 4.0, "review": "I love the fire stick but does anyone run into the issue that you need to have it pluged in all the time. I got the Fire stick to make the transfer from the living room to the bedroom easy and it pretty much is but the power cord dosn't reach the outlet, and that makes it more difficult. Does anyone know what I can do about this? I figured when I bought it if I wanted to use it temporarily in the bedroom I could run in a charge am I wrong?", "verified": true, "helpfulness": "0/0", "author": "eve m. baxter"}, {"rating": 3.0, "review": "I like it, just don't use it enough.", "verified": true, "helpfulness": "0/0", "author": "avdrav"}, {"rating": 5.0, "review": "Amazing!! Easy to use and hook up. We have already learned to use it.", "verified": true, "helpfulness": "0/0", "author": "Melinda Herren"}, {"rating": 5.0, "review": "So easy to install, Amazon, you work wonders !! Works perfectly !!", "verified": true, "helpfulness": "0/0", "author": "Amazon Fan"}, {"rating": 1.0, "review": "kept dropping my internet signal so i couldn't watch anything.  TV is right above my modem and router....returned it.", "verified": true, "helpfulness": "0/0", "author": "Raquel Escorcia"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Denice Thompson"}, {"rating": 1.0, "review": "No alot of truth in advertising", "verified": true, "helpfulness": "1/2", "author": "William P. Henson"}, {"rating": 5.0, "review": "Works great!  Use it mostly for Netflix, Youtube and Pandora. No problems so far. Except losing the remote.... where did I put it... there it is, nevermind. :D", "verified": true, "helpfulness": "0/0", "author": "Abraham Thomas"}, {"rating": 4.0, "review": "I think the concept is great but I experienced a lapse in streaming. I upgraded my Internet speed, that seemed to help a bit. Every so often a message displays on my screen saying \"catching up\" a bummer when it's at a part in thestory line thats interesting. Like Zombies and what not.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Lulah\""}, {"rating": 3.0, "review": "To play the TV Stick, you have to be close to the wireless connection which is approximately 6-10 feet.  We cannot play it on other TV's in different rooms.  The connection is sometimes lost and is not consistent.", "verified": true, "helpfulness": "0/1", "author": "Fedora Lover"}]