[{"rating": 5.0, "review": "Very easy and exactly as described. We use it mostly to stream netflicks and Amazon  prime.", "verified": true, "helpfulness": "0/0", "author": "Kate Dee"}, {"rating": 1.0, "review": "Don't buy this. It's cheap because it's bad and incredibly underpowered. All the menus are incredibly slow and it can't deal with 5G networks very well (and when it can't, it just spins and spins and never connects)", "verified": true, "helpfulness": "0/0", "author": "Daniel A Salinas"}, {"rating": 5.0, "review": "This has opened up a whole new world!", "verified": true, "helpfulness": "0/0", "author": "Weaver"}, {"rating": 5.0, "review": "Haven't had it long so cannot speak about longevity.Very nice format, super easy to use. I like that it cannot be seen and that it is tucked behind the TV with the cords behind. I get tired of cords and cords going from front to back. The remote is easy and has nice functionality. It has all of the functions of my Roku and is faster both in response to the remote and in streaming. There seem to be fewer \"pauses\" to reload the next piece. Does well with my super high speed internet connection.I am hoping that they put it on one of the day sales because I'm going to get one for each TV. Not a bad price anyway though.", "verified": true, "helpfulness": "1/1", "author": "Lu"}, {"rating": 4.0, "review": "The video quality is great, the audio quality seems a little warbly but otherwise I see no issues.  The user interface is slick, with a lot of info available in many layers of presentation.  As should be expected, the interface is very focused around Amazon Prime.  All the Amazon Prime options (like your watchlist, your purchased videos & music etc.) are on the main menu, while all extra apps like Pandora, Netflix etc. are tucked away in a little menu called Apps, most of the way down the list.  The apps selection is pretty limited, and some stuff isn't available in their own apps if it's available for sale in the Amazon Prime video store (I'm looking at you, Jon Stewart full shows).  I don't really game so the games options are not something I can review.I wish there were more apps to enjoy.  I also wish there was a way to connect a usb drive with my own media, instead of having to load everything on my computer's Plex server and then running the Plex app on the stick. It's not an elegant workaround but it works fine.  It's not really a powerful media stick, but what it does offer is a slick and clean presentation, very much like a smart TV in your home theatre.I just got this a few days ago and am still getting used to the experience.  I don't know how durable it'll be, I hope it lasts.", "verified": true, "helpfulness": "0/0", "author": "marco l"}, {"rating": 5.0, "review": "easy and cool", "verified": true, "helpfulness": "0/0", "author": "Ms. Tallchief"}, {"rating": 1.0, "review": "This has been the most disappointing purchase and customer service interaction with Amazon I have ever had. I could not get a stable, quality wireless connection with it. I tried every trick and tip I could find thru Amazon before making voice contact. I was asked how far away it was from the router and I said between 25 and 30 feet and was told they recommend a maximum of 15 feet. Nowhere in the product information online or in the packaging can I find any such recommendation, and if I had, I never would have purchased it. While the customer service representative was on the phone he asked me to play a video (we did several times) and he told me he could see that I was only getting 1/2mbps connection speed and had a bad internet connection. I explained that my connection speed routinely runs 15-27mbps and the slow rate was because of the Fire TV Stick not being able to make a good connection to the network. (So, at best the Stick could only connect at 4% of my normal speed.) I routinely stream HD programming to multiple devices in the house without problem. I can set my laptop, tablet and phone at the same location as the Fire TV Stick and they connect at high speeds, running flawlessly streaming HD and not dropping connections. The representative acted disbelieving and condescending and I ended up talking to his supervisor. I am returning the product and at this time am not even willing to try a Fire TV box. There is no excuse for Amazon to have released a device this crude in connection ability. The rep blamed it in part on the fact that the Stick is so close to the TV, even with the extender cable provided. It's an adapter intended to be right at the TV!!! It is a pity, good concept, decent user interface, just terrible execution to the point of being worthless for me.", "verified": true, "helpfulness": "1/1", "author": "James E."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Treasured Smiles"}, {"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Zinz \"Z\""}, {"rating": 5.0, "review": "I love it! With Kodi works wonderful!", "verified": true, "helpfulness": "0/0", "author": "Camelia Lazarescu"}]