[{"rating": 5.0, "review": "Really easy to set up.  Not complicated and a great alternative to Roku", "verified": true, "helpfulness": "0/0", "author": "Sonya"}, {"rating": 5.0, "review": "I thought I owned a high-tech high-end led 1080p TV turns out I am missing AMAZON prime! So I looked at the special offer I received from AMAZON & I found the FIRE STICK! I checked the mail every day until I received it. With simply plugging it in to my hdmi port & power I NOW OWNED THE BEST TV on the MARKET!", "verified": true, "helpfulness": "0/0", "author": "sam haleem"}, {"rating": 5.0, "review": "quick and easy setup, menu is very intuitive and easy to navigate. Love to option of the stick to take from room to room and play movies on Prime for the kids. Much better option for our family than our Apple TV", "verified": true, "helpfulness": "0/0", "author": "J Porter"}, {"rating": 5.0, "review": "Awesome piece. Definitely better than Chromecast. I recommend it. Specially with amazon prime. Games for the kids and all. My 4 year old daughter loves it.", "verified": true, "helpfulness": "0/0", "author": "tito feliciano"}, {"rating": 3.0, "review": "I like it, I just like that I can't rent shows I have to pay for them.", "verified": true, "helpfulness": "0/0", "author": "Sara DeRosa"}, {"rating": 5.0, "review": "I am LOVING this thing. A very portable version of FireTV. The streamin' ability and quality is spot on for Netflix and Prime video. I have an LED tv and I think this device brought out the real capability of this new technology (new for me anyway...i thought HD was the latest lol) Not only visual quality but the audio is outstandin'. I look forward to them addin' more apps to this, and the other device that i soon hope to own. The only thing as a customer tryin' to figure out which one of these to get needs to think about is: do i need the portability of a FireTV Stick, or do i need somethin' with abit more storage space and slightly beefier hardware inside that can be a more permanent fixture at home? As that is the only difference between the devices that i can tell from the descriptions and havin' only experienced this one and not the other yet. The only caveat is that i feel that amazon should dedicate more time into the amount of apps (as well as quality i.e. brands to bring on board) as well as more quality game apps....Google Play store still dominates on the games variety and i hope that'll change (unless i'm not seein' the full selection by my own error/ignorance or for the fact that this stick has just launched outta the box) To sum this all up: this is a great gift that's quick, easy, and worth the price they ask. Even if you think it isn't right now...remember that these devices will always be updated/expanded with time. All i know is that it's a fact NOW, that i have been turnin' off my xbox for streamin' apps finally and find myself immediately on this thing. There's no hesitation switchin' from one app to another, and it saves your place in each with episodic television. A great gift for any occasion. Very glad i snagged 2 of them at $19/a piece durin' the first 24 hours after they announced it and offered it to Prime members at that. It's made my investment in Amazon all the better for it :D", "verified": true, "helpfulness": "10/11", "author": "StarbuckUnited \"I love sci-fi/fantasy and mysteries and am open minded on what seems like a good read. Feel free to follow me and help find good reads :)\""}, {"rating": 5.0, "review": "This is a great product. Easy to set up and use. It was worth it to have it😊", "verified": true, "helpfulness": "0/0", "author": "heinzilla"}, {"rating": 3.0, "review": "I was expecting something like Roku and chromecast combined but it's not.. for the money it's OK. I only spent $26.55 bestbuy gave a $15 discount..", "verified": false, "helpfulness": "0/0", "author": "RAYMOND"}, {"rating": 5.0, "review": "Amazing Amazon Fire TV Stick!Love the ease and simplicity at which the setup to TV is. I also really like the Interface and Menu layout, I believe it to be better than that of Apple TV and Google TV products. It actually has many more Apps, Games and personal option's than both the Apple TV and Google TV. It even has the Air Play/ DLNA feature for connectivity to my other devices, I.E., phone, tablet, etc...", "verified": true, "helpfulness": "0/0", "author": "D. J. Robesky \"Waveguy\""}, {"rating": 5.0, "review": "Very easy to install.  Helpful video to get you started - super easy.  So far I am loving it!", "verified": true, "helpfulness": "0/0", "author": "Amy Wojcik"}]