[{"rating": 4.0, "review": "sent and received as ordered", "verified": true, "helpfulness": "0/0", "author": "gar"}, {"rating": 5.0, "review": "Works great and is east to set up and use. It works well with Prime.", "verified": true, "helpfulness": "0/0", "author": "A.L. Pearson"}, {"rating": 2.0, "review": "Somewhat disappointed in this product. First of all, I never saw any mention of minimum internet connection speeds (or maybe I missed that). My internet connection is too slow to stream seamlessly, so now I will have to pay to upgrade my speed. The stick also interferes with my regular tv viewing (frames freezing, sound going in and out) so I have to unplug the stick when not in use.  Was also very disappointed to find so many shows that you have to pay to watch. Honestly, I find a better selection of free movies/shows at my local library!  Would have expected a lot better from Amazon.", "verified": true, "helpfulness": "0/0", "author": "A. Covert"}, {"rating": 3.0, "review": "Too many programs to buy and not enough free", "verified": true, "helpfulness": "0/0", "author": "Terry Robison"}, {"rating": 1.0, "review": "Do it work with out internet", "verified": false, "helpfulness": "0/1", "author": "pinky"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "katrine diehl"}, {"rating": 5.0, "review": "Haven't really tried a lot of these devices, but the Fire TV Stick is quite impressive. I mainly use it to turn a standard HDTV into a Smart TV, and it works great for that. It also does something with pictures, but I haven't tried/needed that. Great for Netflix, Hulu, and Prime. Cheaper than Cable.", "verified": true, "helpfulness": "0/0", "author": "David Wiese"}, {"rating": 5.0, "review": "Love it so easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Darlene K."}, {"rating": 1.0, "review": "I can n not recommend this product because its poor connectivity resulting in choppy video, which freezes, and stops and the voices of the actors are always not in sync with their lips.  I may be a fool, but I am going to buy the Amazon Fire instead of the stick, hopping it will perform better.  I connected my PS3 to the same TV and watched the same episode on Netflix and is was as smooth as whipped creme.  When I switched over to the fire stick, the exact same program was choppy, freezing all the time, and unbearable to watch.When you have Verizon Fios and are getting 866.7 mbps in the air using my laptop next to the TV, its not a shortage of bandwidth.  I was hoping Amazon would take back the fire stick and apply the difference towards the Amazon Fire, but they won't.  I will look around Newegg, Best Buy, Radio Shack, and look for a sale.", "verified": true, "helpfulness": "1/1", "author": "Flex"}, {"rating": 5.0, "review": "I recently bought the TV Firestick from Amazon after trying for two years to use another box with a name starting with RO... Ro.. worked only when it felt like it. which wasn't very often. When my Amazon Firestick arrived I had it installed & working in ten minutes. Easy, easy installation. It works perfectly every time. Easy to install & easy to use Couldn't be more satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "A.G. Armstrong"}]