[{"rating": 4.0, "review": "I had a Chromecast before, but this Fire Stick does a lot of things the Chromecast does not (HBO Go, Amazon Prime, and more). I also prefer the ease of using the remote (vs the Chromecast which is primarily controlled from your mobile device). It is worth paying a little more for a Fire Stick because it can do so much more. All in all, a great product. I definitely don't miss my cable anymore.The downsides? While I still consider it the better device, I don't like the following:1) I have noticed the video sometimes freezes and then has to catch up with the audio. My Chromecast never did that.2) On my tiny television, I sometimes can't read the text on the Netflix app without getting closer to the screen. And I have good vision (no glasses or contacts).  This would not be a problem on a larger screen, though.", "verified": true, "helpfulness": "0/0", "author": "S.H.D."}, {"rating": 5.0, "review": "would buy it again", "verified": true, "helpfulness": "0/0", "author": "tommy george"}, {"rating": 3.0, "review": "Unlike the Chromecast, it pops up errors if you don't connect it to wall power - well guess what, i don't have wall power anywhere near where I need to plug it in. If it can't work by drawing 3-5V off the USB port right beside it then what's the point? This is supposed to be a device that is portable - bad engineering design. The menuing is OK, the UI is a bit basic but it's usable and gets the job done. I don't much use this as it's not enticed me enough to ditch the Roku, but it's nice to have as a backup.", "verified": true, "helpfulness": "0/0", "author": "Troy Engel"}, {"rating": 5.0, "review": "The Fire Stick performs exactly as expected. It is intended to replace my Roku. The Roku has an IR user interface and has always been a source of agrevation to me since you must position the remote directly in front of the unit for it to respond. I appreciate the radio interface on my Fire Stick since it can even work when it is located out of view from the control unit. The set-up was easy and I have since bought 2 more Fire Sticks for my other TV's.", "verified": true, "helpfulness": "0/0", "author": "Clarence Dye"}, {"rating": 5.0, "review": "Easy to install and very easy to use! The remote is simple and adding the app to my phone and iPad allows me to simply say what I want to see and it comes up instantly. We love this product!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Dalto"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "vicky"}, {"rating": 1.0, "review": "kept loosing connection and was very slow.", "verified": true, "helpfulness": "0/0", "author": "John Rodriguez"}, {"rating": 5.0, "review": "Easy to install, great to use! Enjoying all the extended tv, movies and episodic viewing.", "verified": true, "helpfulness": "0/0", "author": "Barbara E. Kertis"}, {"rating": 4.0, "review": "Easy to install and easy to workOnly comment is remote back was extremely difficult to open to insert batteriesI'm keeping the back off and have a rubber band holding batteries in placeOther than that works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For me, this is a great stick. It's quick, has all the apps I want and is portable. I can take from my house to my car. Easy to use. I'll be getting a 2nd one for the kids.", "verified": true, "helpfulness": "1/1", "author": "Brian S. Baldridge \"with_teeth\""}]