[{"rating": 4.0, "review": "love it! should've got the stick a long time ago!", "verified": true, "helpfulness": "0/0", "author": "Daniela Cunha"}, {"rating": 5.0, "review": "Excelent I am so glad of getting one", "verified": true, "helpfulness": "0/0", "author": "Pablo Murillo Arias"}, {"rating": 5.0, "review": "This is just perfect for what I needed in my bedroom to watch channels other than what I could view on TWC.", "verified": true, "helpfulness": "0/0", "author": "Dawn S. \"EDSmith\""}, {"rating": 4.0, "review": "I've only had it for a week or so,  its cut off once, for a long time, not sure why.", "verified": true, "helpfulness": "0/0", "author": "Stacie"}, {"rating": 4.0, "review": "My old LG tv doesn't carry the YouTube feature anymore so I went out and purchased the Fire Stick. It plugged in easily and YouTube was back in minutes. Thanks.", "verified": true, "helpfulness": "0/0", "author": "David A. Kaiser"}, {"rating": 4.0, "review": "I travel a lot this is great.", "verified": true, "helpfulness": "0/0", "author": "Franklin Newell"}, {"rating": 5.0, "review": "I love it. Exeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "PLempi"}, {"rating": 5.0, "review": "We bought one when they first came and liked it so well we bought a second one for our bedroom. It's great for watching Amazon Prime shows or listening to music. Netflix and Hulu Plus stream seamlessly through the Firestick.", "verified": true, "helpfulness": "1/1", "author": "Shelley A. Rop \"S. Rop\""}, {"rating": 4.0, "review": "Nice to be able to move it from tv to tv to watch", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 3.0, "review": "I'm sending back my fire tv stick. Really disappointed with the latency when mirroring from my fire HDX to my TV trough the firestick. With Amazon taking away my ability to download movies to my Tivo I'm searching for a solution and thought the fire stick would be the answer but the quality and latency just doesn't cut it when I download a movie/tv show onto my fire HDX. I have been on the phone with technical support and the ending of the conversation was if all they suggested worked could I let them know. Not very comforting.  I just bought a Kindle Fire second gen from Ebay to download onto that and use a HDMI cable to see how that works. Not happy they took away downloading to Tivo.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]