[{"rating": 5.0, "review": "Exceeded expectations. Simple to set up, streaming is good no reload pauses, don't have to get out of my chair to access it. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "thomas mccabe"}, {"rating": 1.0, "review": "Will not work with MLB.tv says it will but it will not work at all I have 50 mb download speed and it stops and starts and stops and stops wish I never bought this netflix amazon prime playing app", "verified": true, "helpfulness": "0/0", "author": "J Trembley"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "F. Flor"}, {"rating": 5.0, "review": "Easy setup just plug in and start watching. Easy to add your accounts very user friendly", "verified": false, "helpfulness": "0/0", "author": "christin page"}, {"rating": 5.0, "review": "Fantastic product!! Does exactly what is says it does in the description and better even, it doesn't weigh down my network!", "verified": true, "helpfulness": "1/1", "author": "Lindsey"}, {"rating": 5.0, "review": "Great Little Device works as advertised easy set up!", "verified": true, "helpfulness": "0/0", "author": "Jerry w Powell"}, {"rating": 2.0, "review": "Site is not always available forewing.", "verified": true, "helpfulness": "0/0", "author": "Gene B."}, {"rating": 5.0, "review": "Zero setup required, plugged it in and it worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "A. Schwartz"}, {"rating": 4.0, "review": "Happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Kathleen M. Rotondo"}, {"rating": 1.0, "review": "I've had the Amazon Fire TV Stick for 5 months now and I've probably used it a total of twice. Whatever Wi-Fi hardware the stick uses is awful, as the thing can't keep connected to a network (I am about two rooms away from my router). When it does stay connected to the network...you're met with infinitely long \"Loading\" screens that eventually end with your network connection being dropped. I'd be better entertained folding 40 $1.00 bills into paper airplanes and sailing them from my rooftop.", "verified": true, "helpfulness": "1/2", "author": "Brian Slivka"}]