[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Trinae W. Perry"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Bumki Kim"}, {"rating": 5.0, "review": "Works great, easy set up!", "verified": true, "helpfulness": "0/0", "author": "Mic"}, {"rating": 5.0, "review": "Great product..", "verified": true, "helpfulness": "0/0", "author": "hunnybear"}, {"rating": 5.0, "review": "This has changed our TV watching lives. (We don't watch TV all the time, but now we have so many better choices when we do) My husband used to go the the library to get cable  or other series or movies for us to watch, which was fine, and he still does, but now, with the Fire Stick, we use the remote to choose from many, many TV and cable series or movies. We don't get HBO and some of the other good cable channels so we miss a lot of good series. It has been so much fun. Installation was fairly easy. My husband did the easy \"installation\"  and once plugged in, it walked you through the set up, took about 10 minutes.Great value. We may get a second one for the bedroom, but for now having it in the living room is enough.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Apple TV is better and much more user friendly.Fire Stick get points for compact and easy to travel with.", "verified": true, "helpfulness": "0/0", "author": "Willie"}, {"rating": 2.0, "review": "The screen mirroring future sucks, doesn't work at all like I wanted. It was the whole reason I bought the fire stick. The other features are rather disappointing as well. The Twitch app needs major updates to be worth it, a lot of the games are glitchy, the whole fire stick interface is laggy, seems to freeze up while I scroll through menus. I don't really like the idea of being forced to pay for an Amazon Plus membership in order to get some movies and shows for free that I can't already get between Hulu Plus and Netflix. The Hulu Plus and Netflix apps are pointless, because I already get those through my Ps3. So as far as I can see, the fire stick is a horrible value, glitchy, barely worth it. I really wish I hadn't bought it, but I figured I would hold onto it in case Amazon gets their act together and fixes these major setbacks!", "verified": true, "helpfulness": "0/1", "author": "Daniel Cameron"}, {"rating": 4.0, "review": "Easy and simple to install and use.", "verified": true, "helpfulness": "0/0", "author": "Florence E. OToole"}, {"rating": 5.0, "review": "So far it's been Great!...haven't had enough time to play with it.", "verified": true, "helpfulness": "0/0", "author": "mimi mo"}, {"rating": 4.0, "review": "Good so far.  Still figuring out some of the apps.  The long list of shows and movies tend to be repetitive so there are not as many as there seems at first, but  even so there are a fair number.", "verified": true, "helpfulness": "0/0", "author": "Historybuff"}]