[{"rating": 5.0, "review": "Turned my regular TV into a smart TV!!! It amazing and very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Darwin A."}, {"rating": 5.0, "review": "Love how easy it is to use. Was pleasantly surprised that the songs I have on the Kindle actually shows the words to the songs as it plays on the TV. I have ordered another Fire TV Stick, all the TV's  in our home will have the Stick. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Donnak"}, {"rating": 4.0, "review": "I previously owned a Chromecast and really like it.  When I saw that there was a promotion for prime members to get the Fire Stick for only $20 I figured I would give it a try just to compare.First impressions were great.  The packaging was very nice, the finish on the unit and remote is just wonderful, and the included cable is extremely high quality.At first I had the urge to plug the Chromecast back in but after a few weeks I adapted to the Fire Stick and I really like it.  The remote is nice and simple, you can of course use your phone instead but having a remote is kind of nice.  The layout is my biggest gripe with Amazon content being featured over other stuff like Netflix.  It is a bit annoying and I wish it was organized differently but not a deal breaker.  The Netflix app is ok.  There is a noticeable amount of lag when you browse through the titles, the preview takes way too long to load.Overall I am happy with it and I will continue to use it over the Chromecast.  The remote is very nice and being able to browse without grabbing for my phone is great.  I removed a star because of the Amazon content being showcased over other stuff, I wish it was just another app to load into, and because the Netflix app is a little lackluster.  I know that the Netflix app will be updated over time so hopefully they get it to load a bit quicker.", "verified": true, "helpfulness": "0/0", "author": "JStewart"}, {"rating": 2.0, "review": "No way to control volume with remote or app, and need to login in all apps on the fire stick itself (compare to the ability of opening Netflix/pandora/songza/etc app on the phone and just hitting the chromecast button)", "verified": true, "helpfulness": "0/0", "author": "Zouhair Mahboubi"}, {"rating": 4.0, "review": "Enjoy using on our tv...", "verified": true, "helpfulness": "0/0", "author": "tpqueen1"}, {"rating": 5.0, "review": "Excellent good portability.", "verified": true, "helpfulness": "0/0", "author": "Jesus Ernesto Dueñas \"JDuenas\""}, {"rating": 5.0, "review": "We absolutely love it. Simple to install and set up. Great variety of movies and speed is fantastic", "verified": true, "helpfulness": "0/0", "author": "Maria L."}, {"rating": 5.0, "review": "One of the best items I have purchased!  And, was only $35.00 dollars.", "verified": true, "helpfulness": "0/1", "author": "connie darpel"}, {"rating": 5.0, "review": "Heck yes! I completely love this product.. I even stopped using my Chromecast. With a faster overall performance and even AirPlay support via third party apps, I'm totally sold. Works right out of the box tied to your Amazon account. Tons of things to watch... even Twitch! I could go on but... all I gotta say is get one.. get one now!", "verified": true, "helpfulness": "0/0", "author": "Nairbdes"}, {"rating": 1.0, "review": "I am a Dish TV user.  Will Amazon Fire Stick count against my data usage?", "verified": false, "helpfulness": "0/2", "author": "Sheilag"}]