[{"rating": 5.0, "review": "Love this product! Good job Amazon.", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "Great new toy", "verified": true, "helpfulness": "0/0", "author": "Morry Morganstein"}, {"rating": 5.0, "review": "Love watching You Tube on the big screen!  Also love the screen saver feature.  Fire TV is a must have for all Amazon Prime members!", "verified": true, "helpfulness": "0/0", "author": "JMG"}, {"rating": 5.0, "review": "I LOVE IT! I USE IT EVERYDAY!", "verified": true, "helpfulness": "0/0", "author": "Sarah Plain \"Chewys Mom\""}, {"rating": 5.0, "review": "It exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "Got this at the discounted price when first came out for my parents.  Figured it was cheap enough so why not?  They don't have smart TV's, but have the smart Blu-Ray players.  But it is limited on what it has, and doesn't offer Amazon Instant Video.  So I got them this, and is way less complicated than the blu-ray remote and much more responsive!  And the remote is small, and I don't need a guide to tell my Mom how to work it!", "verified": true, "helpfulness": "0/0", "author": "Sadie M"}, {"rating": 5.0, "review": "I got this for $20 as a Prime member before the holidays, so I've had it a couple of months so far. I figured I'd try it out. I have a few Roku players at home but they no longer provide the new software for them, so I cannot continuously play shows and the interface/software isn't very convenient to navigate thru.  So annoying.  And the quality was hardly ever full HD with the Roku. With the Fire TV Stick, it's always HD and it takes no time at all for it to automatically play the next show. It's just so useful, for both kids and adults. Setup was the easiest thing ever...I plugged it in, connected to my WiFi, and it showed my name on the screen and asked me to accept.  So friggin easy. I can finally utilize my Fios high speed internet while streaming movies and shows.I purchased another one for my kids' TV a couple of days ago and it's on back order for a month. I do have one minor complaint, which could be just an issue with my TV and not the Fire Stick: normally, I just hit a button on the Fire Stick remote and it turns the TV on & connects to the home screen of the stick.  But it's inconsistent.  Sometimes it doesn't work and i have to reboot the stick's power. Again, the issue may just be my TV.  It also stopped working on one of the HDMI ports, so I put it in a different one and it works fine. Although I have a pretty new HDTV, I need to troubleshoot this to see what the issue really is.I recommend this little device to anyone.  Especially if you binge watch shows!", "verified": true, "helpfulness": "0/0", "author": "Jen H. \"Jen\""}, {"rating": 2.0, "review": "Pre-ordered this back in the fall and it arrived in December.  We were still in the process of moving and had no internet connection in the new house, so it sat in a box until last night.The packaging is nice, visually appealing, and easy to open and unpack. Installation was very easy to our bedroom setup, which consists of a Sony Bravia TV, Sony Blu-Ray player, and Sony soundbar.Even though our Blu-Ray player streams Amazon and Netflix very well, we don't yet have a network cable installed in the new bedroom. Since the Fire TV Stick uses wireless, it seemed like a good fit. Even better, the Fire TV stick can show subtitles - a feature my first-gen smart Blu-Ray player lacks.Installation was simple and only took a few minutes. After entering our wireless passphrase, the unit updated itself, then played a short intro video.I am an existing Prime member, and the unit was already pre-registered to my account, a nice touch (if a little creepy).The interface is easy to navigate, and in no time I had installed the Netflix app and was watching a movie.After an uneventful playback, and realizing it was still not time for bed, I started a second movie in a fit of laziness. About halfway through the second movie, the screen started going black, then coming back. I could still hear audio. I paused the movie, then resumed it. The picture reappeared and I continued watching, chalking it up to our new, slower, internet connection. A few minutes later, the screen went blue, displaying \"HDCP UNAUTHORISED CONTENT DISABLED\", and remained there.Knowing that HDCP technology is centered around ensuring that a copyrighted program is played to an actual television, computer screen, or projector (and not first intercepted by a recording device), I started by turning off power to the TV and everything attached to it. Then, I  removed and reconnected all the HDMI cables. Upon powering everything back up, I was able to complete the movie without further interruption.This morning, I searched the web for this error and found that a great many people are reporting similar problems with this device.Hopefully, Amazon can fix this overly - aggressive HDCP triggering in a firmware update. Until then, I can't really recommend a device that frustrates so soon after installation. Our old Blu-Ray player is fully HDCP compliant as well... and it hasn't once triggered any rude messages in all its years of service.", "verified": true, "helpfulness": "2/2", "author": "spctrbytz"}, {"rating": 4.0, "review": "I really like the speed and selection of apps.  But, it has been freezing on and off for us!? What is up with that?  Had the basic roku and roku HD - favor the Fire Stick more....when it's working properly.", "verified": true, "helpfulness": "0/0", "author": "KristenK"}, {"rating": 4.0, "review": "Great controller for internet TV. Was concerned when first ordering that it would be too Amazon-centric but it's not. It accesses all channels easily - not just Amazon. Fast response time that compares favorably to my ROKU 3.Wish the remote was a little bigger. It's very small and easily slips out of your hand or falls between the couch cushions.", "verified": true, "helpfulness": "0/0", "author": "Tradewinnz"}]