[{"rating": 5.0, "review": "I am completely pleased with the Fire TV stick.  It was so easy to hook up, and begin watching Netflix and Prime.  I have only had it a few days, so I haven't completely explored all the possibilities.  My biggest concern was whether my husband would use it.  He has always watched Netflix through our Wii.  He usually resists change of any kind, but I thought it'd be nice if he could enjoy some of the movies on Prime.  He had no trouble navigating it.  I also really enjoy being able to listen to my Prime music with it.", "verified": true, "helpfulness": "0/0", "author": "Tracie A. Smith"}, {"rating": 2.0, "review": "I'm having the hardest time getting this gadget to work.  It takes forever to find our wifi connection and when it finally does, it takes forever to load my Amazon information.  It's hard to navigate from one menu to the next as it seems to lose connection very easily.", "verified": true, "helpfulness": "0/0", "author": "Rosario"}, {"rating": 1.0, "review": "Did not work with the movie program I bought it for.", "verified": true, "helpfulness": "0/0", "author": "Michelle.Thielenhaus"}, {"rating": 5.0, "review": "Easy to install and easy to use, once you find your way around.  Had to get help syncing the \"mirror\" feature, but after it was set up, it was just a few taps on my Kindle.  Great value for the price.", "verified": true, "helpfulness": "1/1", "author": "M. Vessels"}, {"rating": 4.0, "review": "Stick worked better than Apple TV until after two months the supplied Amazon 5W charger/power supply went intermittent. Charger tested bad on Kindle Fire too. Requested replacement, but was issued $19 refund instead, with no need to return failed hardware. We'll see how long the Stick itself keeps working. Glad to have Apple TV as a backup.", "verified": true, "helpfulness": "0/0", "author": "OldAmazonian"}, {"rating": 5.0, "review": "It is great.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 4.0, "review": "The Fire stick works great, just like my Fire TV box. The exception is it interferes with my over the air reception when plugged into the USB port on the TV for power.", "verified": true, "helpfulness": "1/1", "author": "DG 87"}, {"rating": 4.0, "review": "Haven't had this long enough to check out everything, but as faar as I can see, it meets our expectations.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "Works as I expected!", "verified": true, "helpfulness": "0/0", "author": "JovasX"}, {"rating": 5.0, "review": "Nothing to review, but not allowed to continue without putting something in this field", "verified": true, "helpfulness": "0/0", "author": "Jasen"}]