[{"rating": 5.0, "review": "love it!!! grate price...preorder and save$$$$$$", "verified": true, "helpfulness": "0/0", "author": "MRSR"}, {"rating": 5.0, "review": "I LOVE the Fire TV Stick. It's so easy to connect to a variety of services on a big screen.  Watched some great Smithsonian programs and downloaded cooking classes. I'm enjoying the variety of apps. I have a good stereo and the sound coming out is, as expected, great.My only complaint is the battery compartment on the remote is impossible to open. Fortunately, I was given the voice remote along with my fire stick as a gift, and that battery slot opens just fine.", "verified": true, "helpfulness": "0/0", "author": "Author Ronda Del Boccio \"Ronda Del Boccio, The Story Lady\""}, {"rating": 1.0, "review": "not able to use yet i don't have enought network power to stream any movies.", "verified": true, "helpfulness": "0/2", "author": "Margery Kirby"}, {"rating": 5.0, "review": "AMAZING! I am finding more and more as I explore what is available with the Fire TV Stick. Great picture, easy to use, seamless presentation on every single thing we've watched so far. I have dropped my cable TV service and now use this for all my movie watching and watch news using a digital antenna; I'm saving over $60 dollars a month and really feel like I have more options than I did with the cable line up. A GREAT product!!", "verified": true, "helpfulness": "0/0", "author": "rustyfiddler"}, {"rating": 2.0, "review": "I have dsl internet about 1 mgps and that's the best offered by Frontier to me. It's not enough to operate Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Marcus Pete Hoover Jr"}, {"rating": 5.0, "review": "LoveLoveLove it - I wish I had bought a second for the road while they were on sale!", "verified": true, "helpfulness": "0/0", "author": "K. Dalton \"Kari\""}, {"rating": 5.0, "review": "LOVE  LOVE  LOVE!!!!  A must have for any prime members  and movie lovers. Has netflix and prime music.  Works great and can put my photos  on. Just wish had more apps for photos.", "verified": true, "helpfulness": "0/0", "author": "Patricia Morgan"}, {"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/0", "author": "alexander"}, {"rating": 5.0, "review": "Very convenient! I haven't had streaming trouble either. That alone is a huge plus in my opinion!", "verified": true, "helpfulness": "0/0", "author": "Z. Bridges"}, {"rating": 1.0, "review": "Cannot Install it!  USELESS  DIRECTIONS TO INSTALL!", "verified": true, "helpfulness": "0/1", "author": "Robert L. Hayward"}]