[{"rating": 4.0, "review": "The Amazon Fire TV Stick has worked perfectly for me.I bought it primarily because I travel for work and was tired of using my laptop for watching my Netflix and Prime.  It worked exactly as it was supposed to and I was very pleased.  I also use it in the master bedroom to take the place of my playstation.The only con is that I wasn't aware that it still needed a power cord to power it.  It's not a big problem, but you need a power source pretty close by because the cord isn't that long.", "verified": true, "helpfulness": "0/1", "author": "dusty miller"}, {"rating": 5.0, "review": "Works great. Definitely opens up a lot of viewing possibilities.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Firestick was purchased to replace a Nintendo Wi as a Wi-Fi point for a bedroom TV. After an upgrade to an Xfinity Cable Moden/WI_Fi  Router, the Wi had connection problems.After connecting the Fire TV Stick and configuring the WI-FI connection, and purchasing Amazon Prime for access to video on demand, everything on the Fire TV Stick worked great. After loading the Netflix/Hulu/Pandora APPS, Firestick allowed easy access and control of all content that I am seeking. The remote device is radio based vs IR ( no line of sight required) and will control all of the content easily and the remote is easy to understand. Access to Pandora and Prime Music is a plus. The IOS app works well as an alternate control/search  device.In summary, Fire TV Stick is well conceived, easy to implement and use with access to a great deal of content for most every user! A good value for the money!", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 5.0, "review": "LOVE the Fire TV stick! So easy to use. I just plugged it in and was able to start streaming my Netflix and Amazon Prime in less than 2 minutes. I'm so so so happy I bought this! I only wish I knew it was going to be on the Amazon flash sale. I literally bought it 2 days before it went on sale.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "First thing we looked for told us we could rent it for $4.95.....who needs that!  If it turns out that's the case for other services, I just wasted my money.", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "diane"}, {"rating": 5.0, "review": "Better and easier to use and hook up than I expected.", "verified": true, "helpfulness": "0/1", "author": "yvonne ramos"}, {"rating": 5.0, "review": "Wish I could get all of my TV viewing from this and drop UVERSE", "verified": true, "helpfulness": "0/1", "author": "Paul A. Kranz"}, {"rating": 5.0, "review": "Easy to use from my iphone", "verified": true, "helpfulness": "0/1", "author": "Dave Y"}, {"rating": 5.0, "review": "We wanted one of these but didn't need one; we figured we'd wait until we saw them on sale again. On Prime Day, they had a lightning deal of $24 and I didn't heaitate; great product, especially for non-Smart HDTVs! Netflix and Amazon Video make them worth it alone, but they have numerous other great apps, as well.", "verified": true, "helpfulness": "0/1", "author": "XDanteX"}]