[{"rating": 5.0, "review": "very good product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"the Queen\""}, {"rating": 5.0, "review": "I love this product.  I use this when I travel since I am a Prime Member and have Netflix as well.  I am able to watch movies on the TV without having to deal with trying to find something to watch on regular TV.  I sometimes have \"challenges\" when it comes to technology but I am able to use this without issue.  This is now one of my travel essentials when packing for business trips.", "verified": true, "helpfulness": "0/0", "author": "Tmrodgers"}, {"rating": 5.0, "review": "A home run for Amazon. Better than iTV and at half the price. I even like the remote better. Kudos!", "verified": true, "helpfulness": "0/0", "author": "jbrant"}, {"rating": 5.0, "review": "I really liked the Amazon Fire Stick. I enjoyed it very much.", "verified": true, "helpfulness": "0/0", "author": "Eva Montrose"}, {"rating": 4.0, "review": "Love love love it! I was going to get Apple TV but the price turned me off. Works better than expected. Picture is great!  Although, I have a slight problem. It will not except my flixter account. I can start my flixter on all my other products but this. I wish it had vudu instead. Will get more for my other rooms.", "verified": true, "helpfulness": "0/0", "author": "S in Lexington,Ky"}, {"rating": 5.0, "review": "Love this thing! It has far more apps than I had initially expected! Well worth the $39!!", "verified": true, "helpfulness": "0/0", "author": "Stephen F. Harrington"}, {"rating": 5.0, "review": "Exceeds my expectations.", "verified": true, "helpfulness": "0/0", "author": "TM 1952"}, {"rating": 5.0, "review": "We use our Amazon Fire TV Stick all the time. As a Prime member, it's well worth the purchase, and the apps keep getting better. So happy they finally have HBO NOW! :)", "verified": false, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 5.0, "review": "At first I was hesitated to invest in this product but I've decided to give it a try. I was impressed with the quality and speed. What I love most is I can use at the hotel. It pop up for me to put in my room number and other information in order for me to connect to the Internet.", "verified": true, "helpfulness": "0/0", "author": "Kenphal"}, {"rating": 2.0, "review": "We have two Roku boxes, one Google Chromecast, and the Amazon Fire TV Stick.  With three TVs in the house, we had one of each type plugged into a television. The Roku and Chromecast are both more reliable overall and easier to use. I have found that the Fire Stick is frustrating to operate having the tendency to not follow the commands.  It seems to get stuck so perhaps the remote control is just faulty, however, it has been doing this since the day we got it in the mail. I click the scroll right arrow once, and it starts scrolling nonstop as though it is stuck.  This happened constantly with it.  The layout isn't the best either. It is clunky and not the best layout for ease of use by the viewer. I found watching tv to be a frustrating experience with this device.If I had to rate all three devices I would rate the Roku first for its easy of use, remote control, and layout.  I would rate the Chromecast second because it doesn't come with a separate remote. Your cell phone or tablet serves as a remote to control it.  I would put the Fire Stick last. The interface is clunky and it is riddled with issues right now that just don't make it as user friendly as the other devices.Of course, this is their first attempt so I assume many of these issues will be addressed in their next version of the device. In the meantime, our TVs will stick with Roku and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "JTaylor"}]