[{"rating": 3.0, "review": "On the face of it, the fire stick looks very attractive.  When I got started with it, I was sorely disappointed that I could find NOTHING to watch for free...not even old, old TV shows.  Maybe I'm missing something.  I'll keep trying.", "verified": true, "helpfulness": "0/0", "author": "Collette Bailey"}, {"rating": 5.0, "review": "Love it....", "verified": true, "helpfulness": "0/0", "author": "Olivia Lee"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this after using the DVD player that has wifi support. With this stick, it is much easier to watch prime tv. We are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "y."}, {"rating": 5.0, "review": "it was ease to install and it delivers as advertise.", "verified": true, "helpfulness": "0/0", "author": "Jaime Novoa"}, {"rating": 5.0, "review": "Works.great", "verified": true, "helpfulness": "0/0", "author": "Barry E. Campbell"}, {"rating": 5.0, "review": "Millions better then the Apple TV and google chrome cast.  U can side load other apps to watch XBMC", "verified": true, "helpfulness": "0/0", "author": "Toan Au"}, {"rating": 1.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "summer"}, {"rating": 5.0, "review": "I love it....", "verified": true, "helpfulness": "0/0", "author": "angela"}, {"rating": 5.0, "review": "I bought this because my dad had one and I loved it.  He actually bought my first one for me and I decided I liked it so much I bought one for the TV in another room. I realize this is easily inserted from TV to TV, but I wanted the ease of just turning on my TV and having access when I wanted it.  I can also take this to work and put it on my TV at work.  This takes all of my digital viewing everywhere I want to watch it.  I am extremely please with the ease of set up and how quickly I can navigate with this fire stick.  I am not computer or tech savvy and this was a breeze for me.", "verified": true, "helpfulness": "0/0", "author": "Tammie \"Scrapper Mom\""}]