[{"rating": 2.0, "review": "Does not work well.  I have wi fi that works great with my laptop, tablet and smart tv.  I have tried this on 3 different tvs and it does not work well.", "verified": true, "helpfulness": "0/0", "author": "Dolores D."}, {"rating": 5.0, "review": "wow I am impressed! So many different options, so many different things to watch!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Absolutely love my new Fire TV Stick! I previously had a PS3 that I was using to watch my streamed options, but decided to get something a little more dedicated. And I'm extremely impressed how well this works! It's even faster streaming than my PS3! I'm using it mostly to watch videos on Prime, but so far the speed is great with no problems connecting to my wifi signal in a fairly wifi busy apartment building. Plus the included remote doesn't use a IR to signal the device, I can only assume it's blu-tooth. Which is great since I don't have it facing the tv when I'm using it, plus it's a lot faster than a IR signal. At it's low price I think this is a great product and heartily recommend it.", "verified": true, "helpfulness": "0/0", "author": "Matthew Miller"}, {"rating": 5.0, "review": "Wonderful! Provides easy access to all content. Not complicated.", "verified": true, "helpfulness": "0/0", "author": "Anita from Pittsburgh, Pa"}, {"rating": 5.0, "review": "Great product and I caught it on sale during the holidays, very good streaming device", "verified": true, "helpfulness": "0/0", "author": "Glenn"}, {"rating": 3.0, "review": "It took a half hour to get the back off the remote to put the batteries in. I had to point the remote behind the TV to get it to work. Returning it.", "verified": true, "helpfulness": "0/0", "author": "T."}, {"rating": 5.0, "review": "Super easy to use!  I like it better than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "D.S. Bass"}, {"rating": 5.0, "review": "We have Amazon Prime, Hulu, Netflix and currently trying out Sling TV. For about $40 a month you can have practically everything. On top of that, you can download apps (Lifetime) and watch shows through an app.. You can listen to music.. I'm just amazed by this technology. We've canceled our satellite. I love that we can cancel any of this stuff without a penalty. My only \"complaint\" is how small the remote is, you can easily lose it. The device itself is portable but we ordered another one for our bedroom. Love it!", "verified": true, "helpfulness": "0/0", "author": "Megan K."}, {"rating": 5.0, "review": "I love this thing!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Brian Sheerin"}, {"rating": 2.0, "review": "Don't waste your money on this.  Get either a ROKU or Chromecast.  All aps are costly!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Burroughs"}]