[{"rating": 3.0, "review": "The speed and design of the platform is incredible.  Performance seems to be much better than what I've experienced using Apple TV.  However, if you have Comcast Xfinity, this is likely not the best option for you as HBO Go and Showtime Anytime are not available options.  I purchased for a bedroom TV to play Hulu Plus, Nexflix, HBO, and Showtime and was disappointed that the latter two options aren't available.  Will keep considering the price is low and hoping that they might be added as an option sometime in the future.", "verified": true, "helpfulness": "0/0", "author": "Masseratti185"}, {"rating": 5.0, "review": "It's easy to install and way more convinient to move then other devices.", "verified": true, "helpfulness": "0/0", "author": "J. Loeffler"}, {"rating": 1.0, "review": "My netflix won't work on the firestick. i called firestick they set me up with some outfit who you couldn't even uderstand . and they said they could fix it for 560.00. Someone from firestick should call me and fix it.....!", "verified": true, "helpfulness": "0/2", "author": "paul jones"}, {"rating": 4.0, "review": "Awesome and very easy. I only wish it was wireless...", "verified": true, "helpfulness": "0/0", "author": "Michael Arciero"}, {"rating": 5.0, "review": "I should have dropped satellite & cable tv years ago.  Fire Stick is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Appliance Queen"}, {"rating": 4.0, "review": "Pretty good. Waiting to see how it improves.", "verified": true, "helpfulness": "0/0", "author": "Judd Rogers"}, {"rating": 4.0, "review": "I love the device. I had a bug with mine initially and had to do a factory re set after going through everything with technical support, but it seems to work good now.  I noticed the mirror function has a small delay from the phone to the TV, but that could also be my internet. Besides this, the stick seems to work just fine!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S Spatz"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Jimmy Barbosa"}, {"rating": 5.0, "review": "I can't imagine why I waited so long to buy the Fire TV Stick. I absolutely love it. It is easy to install and use. I am enjoying the movies and especially the documentary series. My grandkids love the kids and family selections. My granddaughter who just turned three uses the remote to choose her favorite Kipper and Barney programs. I can't stop recommending it to family and friends. This is an amazing device.", "verified": true, "helpfulness": "0/0", "author": "Cheryl A. Parker"}, {"rating": 5.0, "review": "The first TV stick is excellent, easy to use, and I'm very satisfied and would recommend the fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "Christy Zavaleta"}]