[{"rating": 4.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "jac1640"}, {"rating": 4.0, "review": "I decided to go with the Fire TV Stick because I was able to get a good deal through a discount site my employer provides us access to and the fact you can use with web authentication in places like hotels.  I haven’t tried that feature out yet, but wanted a streaming stick for when I travel (it’s perfect size for portability).The Fire TV Stick is fast.  Browsing through the menus is a breeze and videos load quickly.  Amazon content is front and center and there is some additional navigation required to pull up an app.As far as content the big names are here; HBO Go, Netflix, Hulu, Watch ESPN, and even Starz/Encore Play.  However Starz/Encore Play is not available for as many cable providers as HBO Go or Watch ESPN.  It’s available for the bigger cable companies, but my smaller, regional cable company (WOW!) is not available on the Starz/Encore Play app.  Slingplayer is an app available for the Fire TV Stick that would be great to use and connect my Slingbox to, but Sling does not support the older Slingbox Solo.  Sling has always been shady about app support and this decision is irksome (a downgrade for Sling, not for Amazon).Compared to Roku (Roku stick available for $10 more) or even Apple, the Fire TV Stick has a long way to go in regards to content.  Most notably for me is FXNow.  As a Simpsons fan the Simpsons World on the FXNow app is incredible and would be a welcome addition to the Fire TV Stick.  Hopefully Amazon works towards adding additional content.", "verified": true, "helpfulness": "0/0", "author": "Tom E G"}, {"rating": 5.0, "review": "Only had it for two weeks but so far I love it. Easy to set up and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Brad Cox"}, {"rating": 5.0, "review": "Excellent product. Very easy to set up. I was watching Prime and Netflex in less than 15mins", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 4.0, "review": "I had a small issue when I first set it up of the remote going crazy and not being able to use the on-screen keyboard. I unplugged the power cable several times after reading that suggestion in the FAQ area, still with no luck. I finally moved the stick to a new HDMI port and it worked immediately. It's a very cheap and easy way to turn any TV in the house into a smart TV. I'd definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Biceps and Broccoli"}, {"rating": 5.0, "review": "Works", "verified": true, "helpfulness": "0/0", "author": "SB"}, {"rating": 5.0, "review": "This is easy to install and it is great for streaming on my bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "L. Consol"}, {"rating": 2.0, "review": "The streaming was very slow. I have one wifi TV with limited apps. I wanted to use fire tv to use few other apps that were not built in the tv. I was disappointed. Even streaming for Netflix was slow. The built in tv netflix app was fine. I had to return fire tv.", "verified": false, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Love my Amazon fire stick.!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Greaves"}, {"rating": 5.0, "review": "Amazon Fire TV Stick is very easy to use. Because I have a Prime account it came already knowing my info. So I just had to plug it in and let it find my WFI and off we went. Love it.", "verified": true, "helpfulness": "0/0", "author": "D. Hansen"}]