[{"rating": 4.0, "review": "Works perfectly fine..Although menu is not as easy to navigate as Apple TV's, it has a lot more content..I was able to download apps to watch French and German TV.Content is pleasing..BUT, it is very difficult to browse only the free ones..Amazon is trying to sell paid content, and mixes them with free prime items..marketing gimmick,..I would not play games with the given remote..I purchased the better remote which takes voice commands well..still, not for playing..Overall, however, I am pleased with it. Prime content which is free with our prime membership is sufficient..", "verified": true, "helpfulness": "0/0", "author": "Hans Blix"}, {"rating": 5.0, "review": "Great unit. It's lightening fast. Ton of apps.Very easy to use and set up.Highly recommended", "verified": true, "helpfulness": "0/0", "author": "J. Lerner \"Ny Ranger fan\""}, {"rating": 5.0, "review": "This is a wonderful product! I haven't had any problems with it so far. It's great to be able to stream things from Netflix to my TV and listen to Pandora.", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 3.0, "review": "The device is working better now. Initially it had a hard time streaming movies. It does mess up occasionally but hopefully it operates the way its supposed to you.", "verified": true, "helpfulness": "0/0", "author": "Young Lou"}, {"rating": 3.0, "review": "Not now.", "verified": true, "helpfulness": "0/0", "author": "Mike Faubion"}, {"rating": 5.0, "review": "Excellent  very easy to install", "verified": true, "helpfulness": "0/0", "author": "Jerry Natt"}, {"rating": 5.0, "review": "EASY SETUP", "verified": true, "helpfulness": "0/0", "author": "MILTON DAVIS SR"}, {"rating": 5.0, "review": "Bringing the computer to direct stream on my t.v. is the best!!!  Was previously an Amazon Prime member so it was perfect timing before Christmas when this amazing stick was advertised at a half price special.  Easy to operate the remote control.  My 15 year old son installed it on our t.v. so that must be easy as well.. Thank you Amazon for making my t.v. a smart, up to date screen our entire family can enjoy.", "verified": true, "helpfulness": "0/0", "author": "Terri Simmons"}, {"rating": 3.0, "review": "I love this so much! Only flaw is that i sometimes doesn't work due to my poor wifi connection :(", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "roberttwalls"}]