[{"rating": 5.0, "review": "Love it. I want to order another soon.", "verified": true, "helpfulness": "0/0", "author": "S Petersen"}, {"rating": 2.0, "review": "Pretty disappointing. UI is clearly more thought out for Prime content (to be expected, I suppose) than other apps. Spotify app is only Spotify CONNECT, not a full Spotify client (they should call this out in the specs), Netflix UI is bad, search doesn't include Netflix, AND it dropped my wi-fi connection 3/4 of the way through a Netflix movie last night, but the network was up. Had to restart the stick, and stop/restart the app a few times to get it to reconnect. ALSO - HBO Now was a primary reason I purchased, and the HBO video is very stuttery, nigh unwatchable. Netflix, Prime video streams fine. Problem is likely with HBO's streaming, not the stick - but it's a problem. Guess I expected more, this device is getting returned. And - why can't you turn off music lyrics when playing Prime music? Very poor UI choice, IMO.", "verified": true, "helpfulness": "0/0", "author": "Rex Parker"}, {"rating": 5.0, "review": "Have only used once but am looking forward to having access to Netflix and watching the shows my kids talk about.", "verified": true, "helpfulness": "0/0", "author": "George G."}, {"rating": 5.0, "review": "Great product! Easy to use! I would buy again.", "verified": true, "helpfulness": "0/0", "author": "R. Lindsay \"Reg\""}, {"rating": 5.0, "review": "Great product. Bought this for my parents since their DVD/Netflix player went out.", "verified": true, "helpfulness": "0/0", "author": "Ryan Parker"}, {"rating": 5.0, "review": "The only thing that I would like is for this to stream my information from other electronic devices. That was the only thing I miss about CHROMECAST. Other than that alot more choices to stream vs. your competion. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Robert Reynolds"}, {"rating": 5.0, "review": "Kodi works great on it", "verified": true, "helpfulness": "0/0", "author": "James B."}, {"rating": 5.0, "review": "Works great with minimum installation time. Large variety of material to choose from in many categories.", "verified": true, "helpfulness": "0/0", "author": "Russell C"}, {"rating": 4.0, "review": "The Fire TV Stick is awesome overall!! It does everything I wanted and more. My only complaint is the amount of ads and commercials I see while watching a movie, TV show or playing a game. I understand that is what I get for getting access to free movies and games. But sometimes it seems a little much.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Grabek Jr."}, {"rating": 5.0, "review": "Absolutely fantastic!!! Easy peasy setup and navigation. So much better than my ROKU 2....and PORTABLE! It's like traveling with your smart TV...I take it to hotels in my RV.....to my workshop.  If u have wifi Servce  and an HDMI TV you can use this anywhere", "verified": true, "helpfulness": "0/0", "author": "Susan R. Schrank \"garden bug\""}]