[{"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use, works as expected.", "verified": true, "helpfulness": "0/0", "author": "Stephen Philbrick"}, {"rating": 4.0, "review": "Works great I would have given it 5 stars if I could have brought the amazon screen up for viewing and buying off of amazon in the firestick programs", "verified": true, "helpfulness": "0/0", "author": "scotty"}, {"rating": 5.0, "review": "Fire stick is working out great! The remote is easy to use. We enjoy watching our favorite Amazon selections as well as a few Netflix choices. We are considering getting rid of cable. If we could stream sports, I think we would.", "verified": true, "helpfulness": "0/0", "author": "Jls"}, {"rating": 5.0, "review": "I own both the Fire TV and the Fire TV Stick and both are amazing. The Stick is by far the choice for anyone looking to add smart TV functionality with 1080P to their TV. It also remembers all the wifi password you program in it so if you're a person who wants to move it around you won't have to change the wifi every time you move it.", "verified": true, "helpfulness": "0/0", "author": "Jesse D. Stever"}, {"rating": 1.0, "review": "Not What I Expected After Paying 45 Bucks....Still Have To Pay Upwards Of 3.99 To Watch Anything....I Returned It After An Hour Of Use", "verified": true, "helpfulness": "0/1", "author": "Eric Jeffrey"}, {"rating": 4.0, "review": "We love our Fire TV Stick.  The only draw back so far is the buttons seems to get stuck... otherwise we are very pleased", "verified": true, "helpfulness": "0/0", "author": "Greg Sailors"}, {"rating": 5.0, "review": "I love it !!!", "verified": true, "helpfulness": "0/0", "author": "kiery"}, {"rating": 5.0, "review": "Great.  Easy to install and use.  Now I can catch up on viewing I missed.  Loved the fact I could pause viewing on one TV and pick it up on another.  Prime music is also a big plus.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Fran"}, {"rating": 5.0, "review": "Seamless, simple to install, and works perfect.  Netflix and Pandora apps are surprisingly good too...wasn't expecting much since this is geared towards Prime users, but they actually function better on this then they do on my PS4.  I will however mention that I bought 2 extra as gifts and one of them has been DOA...working on getting that one warrantied.", "verified": true, "helpfulness": "0/0", "author": "V. Condry \"bargain hunter\""}]