[{"rating": 4.0, "review": "good selection but confusing what is free and costs", "verified": true, "helpfulness": "0/0", "author": "douglas shoaf"}, {"rating": 5.0, "review": "Thank you Amazon!!! Love the fire stick!!! So easy to use. Recommend this to anyone that wants a smart tv but can't purchase one.", "verified": true, "helpfulness": "0/0", "author": "unknow"}, {"rating": 4.0, "review": "I love this over Chromecast.  It was easy to setup, using a remote as opposed to needing another device to get it connected.It works great in the living room, but even with 'excellent' signal in the bedroom doesn't work so well.  I have to extend it by using a 3\" HDMI cable and HDMI coupler to get it to work.  Otherwise it just indicates it cannot get a signal even though it shows full bars.Hulu playback is iffy.  But the more the Hulu apps on any device are updated, the worse they get.", "verified": true, "helpfulness": "0/0", "author": "Sliverbaer \"good times\""}, {"rating": 5.0, "review": "Easy to install and use if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Peggy V."}, {"rating": 4.0, "review": "The only thing that is needed is the 'voice search' function on the remote that the fire tv box remote comes with.", "verified": true, "helpfulness": "0/0", "author": "Hiphopgranny"}, {"rating": 5.0, "review": "Works great!!! Price was good. Delivery fast!!!! Would recommend!!!!!", "verified": true, "helpfulness": "0/0", "author": "C. Benson \"CSB\""}, {"rating": 4.0, "review": "Love the Firestick. Easy to use. Only problem I have is not being able to make the movie have a full screen. Cant adjust it with tv remote. Remote that came with it has no screen adjustment.", "verified": true, "helpfulness": "0/0", "author": "Stormy Gail"}, {"rating": 5.0, "review": "Love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "Nena Patterson"}, {"rating": 5.0, "review": "It works easily and provides us many more program than we could get otherwise.", "verified": true, "helpfulness": "0/0", "author": "Cathy Ehrhardt"}, {"rating": 4.0, "review": "Just starting to use it", "verified": true, "helpfulness": "0/0", "author": "Anne Enright"}]