[{"rating": 5.0, "review": "I love this thing. My bedroom TV was the only one in the house that did not have Amazon, Netflix, etc... and this gave me everything I wanted. Easy to install and easy to use. As a Prime member there really is no reason not to get this. It does come with an external USB power plug and if your TV does not have powered USB ports you will need to use something like a phone charger to power it. That is about the only downside, but if you read up on the product you would know about that already.", "verified": true, "helpfulness": "0/0", "author": "James Waymire \"Rabid Code Monkey\""}, {"rating": 1.0, "review": "Information available during pre-order suggested TWC should work - it did and still does not. Collects dust next to my Roku.", "verified": true, "helpfulness": "0/1", "author": "JAN B."}, {"rating": 3.0, "review": "For as much entertainment this device offers, it's worth the expense. However, since receiving my Fire Stick a little under a month ago I'm frustrated with the amount of technical glitches I've experienced.  Network issues, being disconnected automatically,  buffering, and the over sensitivity of the remote drove me mad. I considered returning it to try the roku, which my mom has and it's never given her any troubles. But again I have to say the price is pretty fair and overall I'm more satisfied than not.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Hutchinson"}, {"rating": 5.0, "review": "great, i can fix. Thank you.", "verified": true, "helpfulness": "0/1", "author": "Man of the year \"man\""}, {"rating": 3.0, "review": "my remote stopped working and my remote app only connects about 20% of the time.", "verified": true, "helpfulness": "1/1", "author": "shayna shayna"}, {"rating": 4.0, "review": "I like it Movies are hard to find a title already like and want to watch.", "verified": true, "helpfulness": "0/1", "author": "Marsha Birdwell"}, {"rating": 5.0, "review": "Sure saves cutting the cable and saving money", "verified": true, "helpfulness": "0/0", "author": "James Coe"}, {"rating": 5.0, "review": "Wow! Did not know all this was so easy to do, just simply plugged it in, ran through the start up and watched movies! Really enjoying it and it gives the family another excuse to get together and spend time with each other", "verified": true, "helpfulness": "1/1", "author": "Wing Rider"}, {"rating": 2.0, "review": "Easy to set up and use.  But not compatible with Harmony Universal Remotes, and streaming quality is very poor - sometimes the programs are nearly unwatchable.  (Apple TV on same network is much better).", "verified": true, "helpfulness": "0/0", "author": "jg70124"}, {"rating": 1.0, "review": "When I first got this product I was impressed. But the honey moon period is over. It constantly freezes, crashes, and simply doesn't work well. Very disappointing. I urge you to look at other options.", "verified": true, "helpfulness": "0/0", "author": "Teresa K"}]