[{"rating": 3.0, "review": "It's great, i love it!!!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "Love.", "verified": true, "helpfulness": "0/0", "author": "Albojungo"}, {"rating": 4.0, "review": "Not quite as easy to set up as initially advertised; however, now that we finally got it set up, we are very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Book Lover"}, {"rating": 5.0, "review": "It's a great solution to streaming content on my TV.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 5.0, "review": "I'm glad i bought this item, no regrets!", "verified": true, "helpfulness": "0/0", "author": "JT"}, {"rating": 5.0, "review": "Performs as advertised", "verified": true, "helpfulness": "0/0", "author": "Robert Kowerduck"}, {"rating": 2.0, "review": "IT FREEZES ALOT AND IN ORDER TO SEE CERTAIN MOVIES YOU HAVE TO SIGN UP FOR AZAMON PRIME AT $100.00 WHERE AS ROKU YOU JUST NEED TO DOWN LOAD IT", "verified": true, "helpfulness": "0/0", "author": "tiffany jackson"}, {"rating": 5.0, "review": "Love this device ... It saved me money for a new consule(my second xbox died & I only used it for streaming) instead of buying a new one I just bought this. It has no problem with Hulu, Netflix , and it all ready detected my amazon prime info. Remote is easy to use. Only had a small problem when I was plugging in the power. since I ran everything thru the wall, Cable it came with was just a bit shorter than what I needed. But thats my problem not the products faultTo sum it up I love it ...", "verified": true, "helpfulness": "0/0", "author": "Another User"}, {"rating": 5.0, "review": "I wish I would have purchased this item when it became available.  Easy to set up and easy to use.  I have joined Amazon Prime, and get extra free movies.  Those which are not free are very affordable.  Each time I use the Fire Stick I learn more about the set-up and see more of what is available thru this device, which is plenty.  Free shipping on all Amazon Prime products, a great deal.  I receive e-mails telling me what movies have been added to the free watching.  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "SueM."}, {"rating": 4.0, "review": "Wish I had a stronger connection in home! But the stick works great", "verified": true, "helpfulness": "0/0", "author": "Tyreece Johnson"}]