[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "DIANE HURST"}, {"rating": 5.0, "review": "Good....Work great i give A+++++++", "verified": true, "helpfulness": "0/0", "author": "Niurka Porras"}, {"rating": 4.0, "review": "Good stick met all expectations.Setup, however, was not particularly great.  Had to watch a tutorial that seemed to go on forever on how to plug the stick into HDMI and navigate.  Not terrible but you can't skip it, so small gripe but annoying nonetheless.  Loved going through photos on it and video playback was great.  Miss not having HBO GO but I knew it going in, here's hoping.Also, love the fact I could connect to 5Ghz band.", "verified": true, "helpfulness": "0/0", "author": "me"}, {"rating": 3.0, "review": "I purchased my fire stick from Best Buy. I have had constant troubles with it freezing buffering and making odd noises.", "verified": true, "helpfulness": "1/1", "author": "ryan kromer"}, {"rating": 1.0, "review": "no AirPlay support for apple devices ! Dont buy it if you want to mirror your iphone or ipad", "verified": true, "helpfulness": "1/2", "author": "ali payani"}, {"rating": 5.0, "review": "Sweet love it with xbmc in it", "verified": true, "helpfulness": "0/0", "author": "Joel Rodriguez"}, {"rating": 5.0, "review": "Pre-ordered one of these as I was looking to replace my Roku 2 that has never received and updated Netflix app.  This is a great product for the price, it's fast, easy to setup and has worked wonderfully so far.  If you have devices that stream and need an upgrade, definitely think about the Fire Stick or Fire TV", "verified": true, "helpfulness": "0/0", "author": "Charles Dumbaugh"}, {"rating": 5.0, "review": "I love it, it's not perfect but then for this price it's a great option to other similar priced items out there. I've noticed that screen animations aren't completely smooth, there are some slight hangups once in a while with animation transitions. The screen saver app photos are jerky on screen as well. I picked this up to use in hotels when I travel for work, I will find out soon enough how it works with hotel wifi. I also have several Apple Tv's and a Roku 3 to compare to as well as a Xbox One. The main winner of this device over the chrome cast is the RF remote, having the remote is great out of box as you don't have to launch an app on your smartphone every time you want to do something.... Also I appreciated the touch amazon did where the Fire Stick is already linked to my Prime account so no setup was required as far as adding my account information to have access to my Amazon library.", "verified": true, "helpfulness": "0/0", "author": "Krewger"}, {"rating": 5.0, "review": "Quick setup.  Works well with my WiFi.  Picture and sound quality are both excellent.  No problems streaming TV shows or movies from Amazon.  Remote works well.  (Can't say the same for the Android app.  But that does not distract from the Fire Stick's excellent performance.)", "verified": true, "helpfulness": "0/0", "author": "M. Reilly"}, {"rating": 5.0, "review": "Absolutely amazing little device. You get the most out of it if you have prime. Like it a lot better then the Roku's it has replaced.", "verified": true, "helpfulness": "0/0", "author": "Frank"}]