[{"rating": 5.0, "review": "I love this!  This is all my favorites in one item.  It has netflix, amazon prime, spotify and other additional apps that are useful.  Great price and easy to use.", "verified": true, "helpfulness": "0/0", "author": "R. Fox"}, {"rating": 5.0, "review": "Really awesome device, fast with a slick interface.  I was surprised how many apps/games are available for it.  I like it more than Roku 3, so does my wife.  However, not crazy about the android remote app (for smart phone/tablet to use as a remote), voice recognition works O.K. but the rest is not very intuitive; in that department I like the Roku remote app better.", "verified": true, "helpfulness": "0/0", "author": "Gregory Ostrowski"}, {"rating": 2.0, "review": "This needs more work! Buffers alot!?! And I have great Internet ! What a shame!", "verified": true, "helpfulness": "0/0", "author": "Cafe man"}, {"rating": 5.0, "review": "Awesome. All the things I didn't know I wanted, right in front of me. Couldn't ask for a better streaming device.", "verified": false, "helpfulness": "0/0", "author": "Jonathan Middle Man Hobbs"}, {"rating": 5.0, "review": "Good item!! Not sure how the remote works but my T.V. remote works for it!", "verified": true, "helpfulness": "0/0", "author": "Michael Book"}, {"rating": 4.0, "review": "For the money I really like the Fire TV Stick. If you have Prime and no other easy means of getting the content get this stick, it will make you use the subscription more. The interface is easy to navigate, I can give the remote to anyone and they figure it out within moments.Two gripes that prevented a 5 star rating. One, when streaming HD video the video hiccups ever so slightly every few seconds. My internet connection (40mb/s down and measured peak at 56mb/s) is more than adequate to stream HD. Chromecast did this initially too and was resolved with subsequent software updates.Gripe two, I cannot for the life of me seem to get surround sound out of this device. My receiver is a bit older and does not have HDMI ports on it so it is plugged directly in to my TV which does support 5.1 surround output through optical to the receiver when it is selected in the menu, but the TV does not recognize that it has a surround source plugged in to it.For the time being I use this for casual TV watching in standard definition, but if I'm watching a movie it goes through my PS3 for smoother picture and surround sound.", "verified": true, "helpfulness": "1/1", "author": "Rick \"Rick\""}, {"rating": 5.0, "review": "Easy to install and works great!!", "verified": true, "helpfulness": "0/0", "author": "Regina K Hackney"}, {"rating": 5.0, "review": "Very easy to use and set up, especially for a technically challenged person as I am.", "verified": true, "helpfulness": "1/1", "author": "Detra Grey"}, {"rating": 5.0, "review": "We love our Amazon stick! No complaints", "verified": true, "helpfulness": "0/0", "author": "Nikki Morrison"}, {"rating": 5.0, "review": "A great gift, easier to use than a roku.", "verified": true, "helpfulness": "0/0", "author": "William R. Redmaster"}]