[{"rating": 5.0, "review": "Only problem with this TV stick is finding one. Ended up locating one at a Best Buy after trying several stores, including Amazon. I can see why. It works great and the reviews proved true. Checked with co-workers who purchased competing brands and the Fire TV Stick outperforms them all.", "verified": true, "helpfulness": "0/0", "author": "Mike D."}, {"rating": 4.0, "review": "Pretty much works as advertised. Easy to set up although slightly awkward to get into some HDMI slots with the power supply wire hanging out of it. Now I have way more TV to watch than I'll ever possibly need and I haven't even scratched the surface of what's available. Well worth the $40 I spent.", "verified": true, "helpfulness": "0/0", "author": "Randall Lewis"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Robin Fattal"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "GW"}, {"rating": 4.0, "review": "So far so good. Easy to use but still am not sure about all the features. I was under the impression that the movies were free with prime. So far both movie s we wanted for our grandson I would have to rent or purchase", "verified": false, "helpfulness": "0/0", "author": "Kenneth L. Ferguson"}, {"rating": 5.0, "review": "It is wonderful.  We use Netflix for the whole family and do not have to watch on the computer.  We are also enjoying the Amazon movies, but wish there were more of the popular ones.  We also use you Tube.", "verified": true, "helpfulness": "0/0", "author": "Gmom"}, {"rating": 5.0, "review": "Great. Easy to install and works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Marco"}, {"rating": 5.0, "review": "Great purchase! I'm still learning my way around it.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "The best. I enjoy using it.", "verified": true, "helpfulness": "0/0", "author": "VISID ANGKATAVANICH"}, {"rating": 3.0, "review": "It will run netflix/hulu/etc. very well. Starts up quickly. Easy to navigate.Other than the above, it is basically just an advertising platform for amazon's prime content. If you are not a subscriber to netflix or any other streaming media the firestick will be worthless to you.I was really really excited to be able to play content from my phone to my TV however after several attempts I am still unable to get it to work.", "verified": true, "helpfulness": "0/0", "author": "Adam Killen"}]