[{"rating": 5.0, "review": "Awesome way to get more benefits from your Prime Membership!", "verified": true, "helpfulness": "0/0", "author": "Donna W."}, {"rating": 5.0, "review": "Easy to use, great addition", "verified": true, "helpfulness": "0/0", "author": "Joseph Marocco"}, {"rating": 5.0, "review": "This product is awesome! Works fast and smooth, also easy to set up as well.", "verified": true, "helpfulness": "0/0", "author": "Chad A Hyatt"}, {"rating": 5.0, "review": "Yes, I am inpressed", "verified": true, "helpfulness": "0/0", "author": "Len G \"Len\""}, {"rating": 5.0, "review": "Once I followed directions it worked fantastically. I've had it about a week and love it.", "verified": true, "helpfulness": "0/0", "author": "Terry Kurr \"T.K.\""}, {"rating": 5.0, "review": "I absolutely love the Amazon Fire Stick. Tons of streaming options and the picture is great quality and speed. I have been using this nonstop since Friday and it has not buffered once.Awesome product! I will be ordering another for my living room so I don't have to keep unplugging it and moving it around. I will say installation is easy and fast and it is not hard to disconnect and plug up to any tv in your home. I just prefer to have 2.Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Seems fine. I had no idea the black circle was a button. Thought it was a microphone. Duh. Called and got immediate tech support. I signed up for the Amazon Prime trial. It looks like there is very little worthwhile programming that you don't have to pay additional $$ for. Probably won't continue with it.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Love it !!", "verified": true, "helpfulness": "0/0", "author": "Penelope V. Cooper"}, {"rating": 5.0, "review": "Seriously, this is one of the best things that has happened to me as far as streaming video goes. I use to use the Xbox 360 solely for netflix, and since I didn't want to pay the Gold membership fee, I decided to grab one of these on prime day. So glad I did! The iPhone app that you can get for this works like a dream as well. Not to mention, you hardly had to lift a finger to find your Fire Stick and start taking control. Awesome piece of technology, very fast and easy to setup, I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Daniel Dalton"}, {"rating": 4.0, "review": "This is great for my sons bedroom but I wish it has a Netlfix button on it. Otherwise perfect and I really like the Amazon pin to safeguard purchases.", "verified": true, "helpfulness": "0/0", "author": "Tee Adams"}]