[{"rating": 5.0, "review": "I really like the fire stick more than my smart tv! It makes choosing a prime movie or show a lot easier I really like the layout!!!", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 4.0, "review": "The Fire TV Stick is just what I expected. It's a great unit for movies, TV series and such. I would love to see Slingplayer added. I will give it 5 stars if that happens.", "verified": true, "helpfulness": "0/0", "author": "DCHURCH"}, {"rating": 5.0, "review": "Quality MORE THAN EXPECTED! LOVE THE APP FOR MY PHONE!SO EXCITED TO HAVE AMAZON PRIME AND MY FIRE STICK! YES IT IS BETTER THAN MY ROKUI LOVE MY ROKU TOOTHIS IS BETTER!", "verified": true, "helpfulness": "0/0", "author": "susan l thorvick"}, {"rating": 5.0, "review": "Easy to set up, easy to use, easy access to my computer favorites, what's not to like?", "verified": true, "helpfulness": "0/0", "author": "Ovid Thompson"}, {"rating": 5.0, "review": "I bought a new tv for the upstairs bedroom and normally would have hooked up a ROKU as I have on the other TV's in the house.  I had purchased one of these Fire TV Sticks to carry around when I travel to have easy access to my TV services.When I loaded it up on the TV to test it out, it had to download new software -- this took a bit of time - 15-20 minutes, but when loaded and rebooted, things went exceptionally smoothly.It's small, does \"highly recommend\" attaching the external power supply - which was not a problem, but installation is a snap.So far, it works great!  I highly recommend it..", "verified": true, "helpfulness": "0/0", "author": "Bob \"Rutle8\""}, {"rating": 3.0, "review": "Nice device, but does not support Showtime Anytime with Comcast. That's weird. Tons of providers listed, but no Comcast. Secondly, they need MLB and HBO. Smooth software. No issue with the device.....just the content.", "verified": true, "helpfulness": "0/0", "author": "R. Beaton"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "luis"}, {"rating": 5.0, "review": "Absolutely Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Rhonda Treu"}, {"rating": 4.0, "review": "So far so good, only once in a while the bluetooth between remote and fire stick is disconnected, once I reset the power on the fire stick all is good.I have no doubt the next software update will resolved this. All in All excellecnt for Prime viewing and Netflix viewing.", "verified": true, "helpfulness": "0/0", "author": "Mick"}, {"rating": 3.0, "review": "thx", "verified": true, "helpfulness": "0/0", "author": "gobs1 \"dennis j\""}]