[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Henry E. Chen \"guest\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "kent archbold"}, {"rating": 5.0, "review": "So far I'm loving this product,  it's easy to use and works pretty well even when my Internet connection is going a little slow.that being said I can't compare it to other products like because I haven't tried others. I was previously using my Wii to stream my amazon content. All I can tell you is that this works better, the battaries in the remote will last longer and it's cheaper than a gaming system so in that comparison this product is better.", "verified": true, "helpfulness": "0/0", "author": "Wendy Brumback \"Wendy's Words\""}, {"rating": 5.0, "review": "Works great.  Opened it.  Plugged it in. Turned it on.  10 minutes and it was working.  Did not watch the instructions so I am still finding new things I like.Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Mark V. Mckandles \"Remarkable\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "maureen"}, {"rating": 4.0, "review": "pretty good so far. the only problem i have noticed is that sometimes i cant access netflix or youtube or prime. after a couple of attempts it works fine", "verified": true, "helpfulness": "0/0", "author": "jamaki"}, {"rating": 3.0, "review": "Easy enough to install. Good remote. Does budget more than I'd like.", "verified": true, "helpfulness": "0/0", "author": "James Dean"}, {"rating": 5.0, "review": "Exceeded expectations....brings a whole new world of entertainment to me....Thank you.", "verified": true, "helpfulness": "0/0", "author": "Toby S. Gridley"}, {"rating": 1.0, "review": "Warning! Never Ever Buy This Product, its completely waste of  money.the time we purchased this product we did not get a chance to plug in right away and took us few weeks, the first time I plugged in to my TV it freezes up on itself and keep re-booting it. We did not pay attention and wasted few more days before time to return. I wished I bough similar Chrome from COSTO and I do not have to worry about return policy. Amazon return policy should be changed to reflect a trusted company.", "verified": true, "helpfulness": "0/1", "author": "jazzy"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "sollex"}]