[{"rating": 5.0, "review": "Does exactly what I need.", "verified": true, "helpfulness": "0/0", "author": "Russ V."}, {"rating": 3.0, "review": "Work well for what it is.", "verified": true, "helpfulness": "0/1", "author": "Fred Lewis"}, {"rating": 2.0, "review": "Our family has owned the Roku LT streaming media player for a couple of years now. That unit, although slow now, with the occasional needing of a reboot (I blame that on it's age, at this point) once or twice a year, is leagues ahead of the poor experience that I've had with this thing. Let's break down the issues:1. Buffering/stuttering: The amazon fire tv stick buffers a lot, even on content that the Roku has no problem with. This is even though the Fire TV stick is twice as fast with it's processor. I'm not sure what the deal is, but my friend has the Fire TV (not the stick) and he says the same about the buffering. It's terrible.2. Dropping my internet connection:  I NEVER have had problems with our connection dropping on the Roku. The Fire TV stick has dropped our connection several times. I've checked everything else out, as we have several other devices connected wirelessly, but the TV Stick seems to be the culprit here.3. Had to pay for an app that was free on the Roku. Seriously? Our family loves to use the Plex app for watching our home videos from our computer. This app is totally free on the Roku and works great. Amazon Fire TV stick? It's not only 4.99 for the app, but it also crashes constantly. Totally a waste of money.The conclusion for me is that this device is not yet ready. Don't get me wrong, I LOVE Amazon. We have prime and have been users of it for a few years. I probably drop most of my money into Amazon all year long, but this device is just a big letdown to me. Our family is strongly considering purchasing a newer Roku player that is a bit faster than our out-dated LT model. If you are looking at the Fire TV Stick, I'd have to say that waiting a bit might be a good option. Sure, it's pretty cheap, but for 20 more dollars, you could have a great ROKU device that just works so much better.", "verified": true, "helpfulness": "1/1", "author": "Albert Jurina III"}, {"rating": 5.0, "review": "Relatively easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Craft"}, {"rating": 1.0, "review": "I bought the fire TV stick mostly so I could use the watch ESPN app. But it turns out that I can't use the app at all. When the app asks you to sign in with your provider, Charter is not an option. I can't use the Watch ESPN app so the stick is 100% useless to me", "verified": false, "helpfulness": "1/1", "author": "leah lukens"}, {"rating": 5.0, "review": "Easy to set up, easy to use, so far really enjoy using it.  Been using this much more than cable TV shows.  100% happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Stephen R. Shelley"}, {"rating": 5.0, "review": "Amazing streaming stick; reliable and working like a charm.I compare it to AppleTV, both have dual band antenna, so I can use either 2.4 or 5 GHz band. Amazon TV stick has more Advantage than AppleTV because it operates with Android system, So far, I love Amazon TV stick performance with reasonable price compare to Apple TV and Amazon streaming device.", "verified": true, "helpfulness": "0/0", "author": "TuRau \"Movie lover\""}, {"rating": 5.0, "review": "It is everything I expected, thank you. Another fine product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Ben Williams"}, {"rating": 1.0, "review": "This device just does not cut it.  It's more frustrating than anything because I bought this so I could more easily stream from Amazon I really wanted to like it.  I have tried a lot of things and I really wanted it to work but it doesn't.  It clearly has networking issues.  There are a ton of complaints and failed troubleshooting processes out there but from what I have seen others have not been able to get this thing to work well either.  All other devices on my network work fine but the AFS starts stuttering or dropping  connection within an hour of starting.  When prompted to go to the network settings the only thing offered is Very Strong signal and  connected with problems.  Nothing else.  Does not say what the problem is.  Does not allow you to disconnect and reconnect from the network  only forget the network and then rejoin so you have to enter the password all over again and again the result is the same.  A connection for a while and then after it becomes connected with problems.  How does one do you diagnosis of the problem when it says it connects with a strong signal but nothing else.  Never had an issue like this with Chromecast and I have heard good things about Roku stick so I guess I will eventually get one of those.  {I would get another Chromecast but I want to stream amazon prime on this tv}.  The device is flawed.  I wish it was not to late to send back because I would in a heartbeat as it is now it will just go into the box of junk for recycling.", "verified": true, "helpfulness": "0/0", "author": "M. Johnson \"Mr Bad Example\""}]