[{"rating": 4.0, "review": "This is my third tv streamer but my first for the Amazon Fire stick. So I feel when I rate this I am a bit more fair as I do have other brands to compare with it. Now don't get me wrong we bought a Roku a few years back and got rid of our satellite bill. Best choice ever. Each month I paid close to $100 to get the channels that my family wanted. And when the weather went bad there was no tv. So I looked into my choices and at the time there was no Amazon Fire. So the best on the market was Roku. But, now that I have both I must say for your money best value is the Amazon Fire! First there are so many more channels. Second there is even games don't get to excited they are little apps same as what you can play on your Amazon tablet or smart phone. But, hey they are there and on a big screen! Third you obviously still have all your movie channels like Netflix and all so the same there but what Amazon has that Roku can't hold a candle to is the Pluto channel that has many channels your going to LOVE there is news, sports, diy, cooking, anime. You name it there is even history and science. This one app alone is worth the difference. But, there is even more. So I give this the best review ever! If your in the market for a streamer DO GET THIS! It is very much worth the money. And if you want you can still watch Starz and HBO. This is so much better then cable! And I can crank up the music on this thing while I clean house.Update: Now that I have had the Fire for a while and can compare to the Roku there is one factor that has come to my family's attention. While like I said before is true the actual streaming is not as good as the Roku. So we are waiting (a lot) for buffing or loading of a show. There is nothing quite like watching the news and in the middle of key wording to have the Fire stop streaming and start buffing and once it starts you miss what the man was trying to say. So if this doesn't bother you then the Fire is the way to go.", "verified": true, "helpfulness": "0/1", "author": "Frankie L Parks"}, {"rating": 4.0, "review": "So far I have had 2 of these devices for almost 3 weeks.I really like the access it allows to Amazon Prime, Netflix and Hulu, along with PBS and Bloomberg.  It is very easy and convenient to use.  Beats the heck out of satellite or cable TV.What I don't like is that I've needed to reset them at least 4 or 5 times.  The picture freezes, but the audio continues at a normal rate, then the visual suddenly moves forward at a fast rate...very strange.  Resetting the device takes care of this for a day or several days.  Hope that the issues stops soon, or my rating will go down a notch.", "verified": true, "helpfulness": "0/0", "author": "xeric mama"}, {"rating": 5.0, "review": "This is so easy to use right out of the box and works great!", "verified": true, "helpfulness": "0/1", "author": "Valekin"}, {"rating": 5.0, "review": "I got this because my Playstation 3 stopped working.  I did the quick set up, downloaded a couple of apps and BAM! I was watching my favorite streaming content.  This was a real solution for my problem.", "verified": true, "helpfulness": "0/1", "author": "chadspence"}, {"rating": 5.0, "review": "Having tried a competitors \"stick\" and finding it clumsy and difficult to navigate, I was hesitant to try another but Amazon's excellent reputation lead me to try Fire TV Stick.  I was not disappointed.  Within 10 minutes I was enjoying programs and downloading a game.  Congratulations on a very good product.", "verified": true, "helpfulness": "0/1", "author": "Donald B. Williams"}, {"rating": 4.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Lewisr389"}, {"rating": 5.0, "review": "Love it, I use it almost daily. The remote simplifies walking through the menus.I use it to stream my music, watch Netflix and for controlling my Plex server.", "verified": true, "helpfulness": "0/1", "author": "Lee Latner"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome! Works great. Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "JimBobAnthony"}, {"rating": 4.0, "review": "works great with plex to stream your computers hard drive. Also good with amazon/netflix.", "verified": true, "helpfulness": "0/0", "author": "Dr. K"}]