[{"rating": 4.0, "review": "Pretty neat little device. I love the remote, fits nicely in your hand and can always find the buttons.", "verified": true, "helpfulness": "0/1", "author": "Marissa Suri"}, {"rating": 5.0, "review": "Excellent buy.", "verified": true, "helpfulness": "0/1", "author": "Amy Jones"}, {"rating": 5.0, "review": "Purchased this to replace a Roku on my main T.V.  Love it!  Easy to use, excellent streaming, and as a Prime member, I love that it automatically connects to all of my Prime music and video selections.  Very reasonable price.  I recently removed cable services from two secondary sets.  I moved the Roku to one that is rarely used, and purchased a second Firestick for the other.  Given an option for an initial purchase...I would purchase Firestick without question.  Very pleased.", "verified": true, "helpfulness": "0/1", "author": "pookie"}, {"rating": 5.0, "review": "It's great device. It's easy to use and has many good features such as Netflix, YouTube, and NBC and BBC news channels. I would recommend it.", "verified": true, "helpfulness": "0/1", "author": "Rsho"}, {"rating": 1.0, "review": "Worked for a while Amazon replaced second one won't work sending both back today not worth any price at any cost", "verified": true, "helpfulness": "0/2", "author": "James M."}, {"rating": 5.0, "review": "I love it.  It gives me much more options.  I can go into prime, Netflix, or Hulu Plus.  I have so many choices that I have a hard time deciding what to watch.  I love being able to watch movies on my TV instead of having to use my tablet.", "verified": true, "helpfulness": "0/1", "author": "Patricia A. Roberts"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "deborah brown"}, {"rating": 5.0, "review": "Every Prime member needs a Fire stick! Awesome product! Dump cable service and get a Fire stick with antenna. Our whole family digs it the most!", "verified": true, "helpfulness": "0/1", "author": "JonRichmond"}, {"rating": 5.0, "review": "Love it !!!!", "verified": true, "helpfulness": "0/1", "author": "Christy Allen"}, {"rating": 3.0, "review": "It's not a bad device, just had issues with a couple apps", "verified": true, "helpfulness": "0/1", "author": "louis Ingwersen"}]