[{"rating": 5.0, "review": "Works great. Much much faster than othe devices I have tried. Prime just continues to pay off.", "verified": true, "helpfulness": "0/0", "author": "DSquared \"DSquared\""}, {"rating": 5.0, "review": "A rarity it does all it claims...", "verified": true, "helpfulness": "0/0", "author": "TOM CREGAN"}, {"rating": 5.0, "review": "Pre-ordered this and got it for a promotional price of $20; you can't beat what you get for that price, period.Set up was easy. Works well for all my streaming needs. I can play local content with Plex. Plex did not play contents with 5.1 audio properly when connected to the TV directly. (I don't know if it is an issue with Plex app or the device). If you have a receiver or a sound-bar with HDMI inputs, try connecting Fire TV stick directly. My soundbar has 2 HDMI inputs and I connected Fire TV stick there and viola! you have 5.1 sound with Plex app. In general, sound is much better when it's decoded directly from the sound bar, in my opinion, than routing through optical audio out from TV. Also, when I connected directly to TV I had to adjust the screen size (shrink 3%). When I connected Fire TV stick to the soundbar, no screen adjustment was required.One issue I had was that Fire TV stick did not recognize my 5 GHz wi-fi. After some reading found out that (Fire TV) has issues with routers with third party firmware. I've had set my router (Cisco E3000 with Tomato) to auto channel selection. I tried several channels manually (52, 54, 56 did not work) and when I set channel to 36 (5.180 GHz) Fire TV stick recognized the SSID.I side loaded XBMC and it works smoothly! 500MB of video memory helps, I guess!Device gets little warm sometimes, hopefully it won't be an issue. Didn't try gaming so can't comment on that.Overall you get a very capable streaming solution for a competitive price. Recommended!Edit:Remote is little clumsy. Navigation buttons do not respond well. Sometimes it keeps scrolling through lists when a navigation button is pressed once. Minor inconvenience, but need to be improved.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Smooth interface. As good as Roku, for half the price.", "verified": true, "helpfulness": "0/1", "author": "geomath"}, {"rating": 4.0, "review": "It's neat.  Super easy setup.  The menus are easy to use.  The remote is slick.  My television remote is able to control it, which is even better, IMO.  If you've ever used a modern computer or mobile device, you will have no problem with this.For someone who travels without their computer, gaming system etc or for someone who doesn't have a lot of devices, this gives some great content in a tiny portable device that would work on any television with HDMI and a wireless network connection.To fully use all of the advertised functionality, you need an account for all of the content you want to use it for.  For instance, you need an amazon prime account for watching prime videos without paying per view or a hulu plus account for watching hulu. These services typically charge a monthly fee.  If you already have those accounts, you're already using them via your computer, game console or mobile device - this device doesn't bring much difference to those experiences.The fire stick requires a wireless network.  If you have a wireless network in your home, and a television with an HDMI port on it, you most likely also have other technology.  If you have almost any other technology that could use that wireless connection, the fire stick, most likely, is redundant.There is nothing this offers that one cannot do with a gaming console, mobile device or computer with a decent display, equally as well and conveniently - unless you travel often.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/1", "author": "George E. Anderson"}, {"rating": 2.0, "review": "Haven't been able to use because of connection issues and the trouble shooting info with the stick has not been helpful.  Still struggling with getting it to work.  May have to return.", "verified": true, "helpfulness": "0/0", "author": "furgie"}, {"rating": 5.0, "review": "The \"Stick\" works great and is better than I thought was possible for such a small device. The variety of apps need to be increased. I mean where is \"Showbox\" I have it on my Kindle fire so why not as an app on the stick?", "verified": true, "helpfulness": "0/0", "author": "Walter Scott"}]