[{"rating": 4.0, "review": "Good so far.", "verified": true, "helpfulness": "0/0", "author": "Deborah J. Gauff"}, {"rating": 4.0, "review": "Easy to set up. Great selection of apps. Best value for the price of any streaming device. Only issue is failure to get audio on some shows. Bought one for each h TV.", "verified": true, "helpfulness": "0/0", "author": "momboabo"}, {"rating": 1.0, "review": "Most of the services doesn't run in my region (South America), and it was not advertised in the product details. So I lost the money!!", "verified": true, "helpfulness": "0/0", "author": "Margarita Quadrelli"}, {"rating": 4.0, "review": "Unfortunately my internet service doesn't seem consistent and sometimes it loses the connection, otherwise I like it.  I hope more movies and shows get added.", "verified": true, "helpfulness": "0/0", "author": "katjernig"}, {"rating": 5.0, "review": "Simple setup and connection. You should have this if you are an Amazon Prime subscriber since it provides access to their Prime video and music libraries thru your HD TV.  Performs well with FIOS.", "verified": true, "helpfulness": "0/0", "author": "Ed Kwedar \"Ed Kwedar\""}, {"rating": 5.0, "review": "works great EXCEPT occasionally signal drops while loading movie and have to reload", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 5.0, "review": "Absolutely excellent. Not only did the Fire Stick meet my expectations, it exceeded them. I'm extremely pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Anthony Harris"}, {"rating": 5.0, "review": "Easy to install. Easy to use. Great speed n excellent memory.", "verified": true, "helpfulness": "0/0", "author": "Ed K"}, {"rating": 5.0, "review": "Easy to install and use.  So far, good.", "verified": true, "helpfulness": "0/0", "author": "Becky Hawkins"}, {"rating": 5.0, "review": "This is the 3rd Firestick I have purchased. I love being able to just plug in the HDMI and keep moving. No bulky box sitting on the TV stand. Setup is quick and easy.  It did not take my 4 year old long to figure out how to access and navigate. Great present at a great price.", "verified": true, "helpfulness": "0/0", "author": "Deborah Johnson"}]