[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "jodilee"}, {"rating": 5.0, "review": "freakin love it!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "billzuka"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "susan box"}, {"rating": 5.0, "review": "We bought a Roku 2 and a Amazon Fire Stick and i cant tell the difference except the Fire Stick was WAY Cheaper and super easy to use, would for sure recommend to anyone,", "verified": true, "helpfulness": "0/0", "author": "NicoleC"}, {"rating": 5.0, "review": "I am enjoying it. Best deal u can haveIt's GREAT!!!!!", "verified": true, "helpfulness": "0/0", "author": "Bernadine"}, {"rating": 5.0, "review": "This is truly a great product that does exactly what it says, and a bit more.  If you are a Prime member, and don't already own a good device for using Amazon Instant Video on your main tv(s), this is the best affordable way to fully take advantage of the video (and audio) benefits that come along with your membership.I have been using Amazon Instant Video (AIV) for a long time using various devices I already had in my main entertainment center (Smart TV, PS4).  I have never had any issues because my router is in my entertainment center, so all of the devices were connected by ethernet.  However, since moving into a house with my bedroom on the second floor, I had difficulty getting a good connection using various wi-fi devices (Smart Blu-Ray player, Smart TV).  So, after reading many positive reviews and given the low cost of $40, I finally decided to give the Fire Stick a try.Right out of the box, the Fire Stick was the perfect solution for using AIV wirelessly.  It's extremely easy to set up, very user friendly, and the wi-fi connection is great.  I no longer have problems streaming HD movies or shows, and I have the added benefits of my Amazon Music Library (and Video) being easily accessible.  Also, the interface is really easy to use, and quite fast.So, all in all, for $40 it's really a great product.  And if any of the above applies to you, I highly recommend the Fire Stick as a solution.", "verified": true, "helpfulness": "0/0", "author": "Raymond Pearson"}, {"rating": 5.0, "review": "Really a good solution for a flatscreen just used for Internet streeming.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "daisy dixon"}, {"rating": 3.0, "review": "Doesn't seem to be a very strong wireless receiver but I guess that goes with the size.  MLB app is always glitchy and slow.  SlingTV is ok at times but still with lower signal reception than my Roku 2 XD or Xbox 360 the Fire TV Stick is just so/so.  I got it on sale so bang for the buck it's not too shabby.", "verified": true, "helpfulness": "0/0", "author": "AZ_Keith"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jena Davis"}, {"rating": 3.0, "review": "But i only gave it 3 stars because of not being able to stream premium cable due to Fire TV not being support by Charter. Aside from that its pretty cool and Netflix works great.", "verified": true, "helpfulness": "0/0", "author": "Dache B."}]