[{"rating": 5.0, "review": "it works great, eliminated buffering that I had with my Blu ray player", "verified": true, "helpfulness": "0/0", "author": "quinn"}, {"rating": 5.0, "review": "I love my Amazon Fire TV Stick.It does everything its suppose to do.And if your an Amazon Prime member like me.You have tons of movies, TV series and music available to you for watching or listening.", "verified": true, "helpfulness": "0/0", "author": "Banny"}, {"rating": 5.0, "review": "I was having issues with streaming with one of the first generation rokus and this fixed the problem.  Easy to install and stream.  It was weird how it has apps though but great job.", "verified": true, "helpfulness": "0/0", "author": "Eric Lienert"}, {"rating": 5.0, "review": "easy to set up.  easy to use.  I love it", "verified": true, "helpfulness": "0/0", "author": "Laura Penton Lee"}, {"rating": 5.0, "review": "Simple to operate and set up.  Fantastic access to so many movies and documentaries, etc.  Can't believe I never bought one earlier. Has allowed me to downsize my current satellite TV service and save money.", "verified": true, "helpfulness": "0/0", "author": "Robin P Ives"}, {"rating": 5.0, "review": "we love the stick and all the movies we watch.", "verified": true, "helpfulness": "0/0", "author": "diane ryan"}, {"rating": 5.0, "review": "This works great. Use it to stream from Netflix and Pandora. Also have our pictures uploaded to Amazon to play slide show. I wish I bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Christopher Scott Bruno \"CB\""}, {"rating": 4.0, "review": "Has all the \"channels\" I wanted and then some. Easy to set up and to use. One complaint: Perhaps because of the limited memory space, shows/movies sometimes freeze and then drastically speed up to catch up. This happens once or twice per show, when it happens.", "verified": true, "helpfulness": "0/0", "author": "Gary Weber"}, {"rating": 5.0, "review": "Easy to setup and install.", "verified": true, "helpfulness": "0/0", "author": "Ungra417"}, {"rating": 4.0, "review": "I have a PN8500 series Samsung plasma with external speakers.  The only way I could get audio at all was when I plugged the unit directly into the receiver's HDMI input.  Works fine now.  Love the little remote.", "verified": true, "helpfulness": "0/0", "author": "Michael Cornforth"}]