[{"rating": 5.0, "review": "Have two TV's not connected to cable and this turns them into smart TV.  Saves on cable bill.  I use it for exercise videos. on youtube.", "verified": true, "helpfulness": "0/0", "author": "ParTcake \"Mams\""}, {"rating": 5.0, "review": "Exactly what I wanted! Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Dawn Briscoe"}, {"rating": 1.0, "review": "This product is a player for streaming channels. It happens that one of those channels is their own Amazon channel, and the device shows extreme favoritism for that channel, instead of treating them all equally. On competing products like Roku, when you do a title search from the Home screen, it searches all channels. The Fire TV Stick treats the entire Home screen as if it is \"owned\" by their own Amazon streaming channel, instead of being a global screen where all channels are treated equally. Just because the product is made by Amazon, doesn't mean it's an \"Amazon Instant Video channel\" player. It's an alternative to Roku, and like the Roku it should provide the same access to ALL channels. While this stick does have other channels on it, the interface and the search features are geared specifically to Amazon Instant Video. The voice search will search ONLY in Amazon Instant. Even if you search for a free Netflix title, the voice search will take you to that same title on Amazon Instant Video, where it is a paid rental.", "verified": true, "helpfulness": "3/3", "author": "Customer From NJ"}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "Diana F."}, {"rating": 5.0, "review": "We're hooked! Got tired of watching old DVD/Blu-rays. Got Prime video with Prime sign up.", "verified": true, "helpfulness": "0/0", "author": "Y. Melich"}, {"rating": 5.0, "review": "I love it! I didn't pay much for it and I don't have to pay every month to watch anything like I would if I had cable or satellite.", "verified": true, "helpfulness": "0/0", "author": "Joli Etoile"}, {"rating": 3.0, "review": "have issues with it freezing", "verified": true, "helpfulness": "0/0", "author": "shannon m territo"}, {"rating": 5.0, "review": "I was visiting a friend and they told me about this device, which turns out to be the best purchase I ever made.PROS- only costs $39- connects to the internet so you can download apps like Sling, Plex, YouTube, Netflix, & HuluPlus to make any screen a smart TV- mobility (I love how I can unplug this device and take on trips with me and watch any shows I want anywhere)- Sling app (you must check out this app - it allows you to watch basic cable for $20/month)- allows you to use your Amazon Prime account to watch Prime movies & TV shows for FREE- controller is very sleek, functional, and the perfect sizeCONS- none", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 1.0, "review": "I bought the Amazon Fire TV Stick for one thing.  The Twitch app.  I already have YouTube, Hulu Plus, Netflix and Amazon Prime Video on my PS4.I could've forgiven the absolutely horrible menu design if the Twitch app was good.  But it isn't.  It's the worst Twitch app I've seen, which is surprising seeing as AMAZON OWNS TWITCH.  How on earth did this horrible app pass anyone's inspection?  Why is it so bad?First, you can't sign in to your Twitch account.  That's right, there's no way to sign in and jump to the list of channels and games you follow.But that's not all!The Twitch app has NO search feature.  So essentially you're given trending channels and games.  That's it.  You can't search for the channels you want and you have to scroll through the (slow and ugly) interface to find the game you want to watch.  This is the equivalent of having a YouTube app that doesn't let you sign in and has no search feature.  Just the front page.  It's that bad.Again, it's mind-blowing that Amazon acquired Twitch for nearly a billion dollars, yet didn't see fit to present a decent Twitch app on their device.", "verified": true, "helpfulness": "2/2", "author": "Robert S. Jones \"rjthakid\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Sean Mccullough"}]