[{"rating": 5.0, "review": "Fire TV Stick is everything I expected.  It is intuitive, easy to use and lightning quick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "complete waste of money... It does no work and there are absolutely no instructions with it.  I had to move the TV to a different location and because it took me so long it was too late to return.  I am so totally disappointed with Amazon anyway.", "verified": true, "helpfulness": "1/2", "author": "Andrea"}, {"rating": 5.0, "review": "It's awesome. I love it!", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "I am really enjoying watching movies and TV shows", "verified": true, "helpfulness": "0/0", "author": "Bonita Frederick"}, {"rating": 5.0, "review": "I had a few glitches at first where I got messages stating my internet connection was too slow, but it worked later. I also felt like an idiot trying to get the batteries loaded because I couldn't get the back off of the remote. I had to troubleshoot the question on Amazon how to get the back off. Overall, my family has really enjoyed streaming onto the television.", "verified": true, "helpfulness": "0/0", "author": "Amanda B."}, {"rating": 2.0, "review": "This is an OK device but doesn't do near what Roku and Chrome can do. Fire TV has been out for some time now and still doesn't offer IOS support or an app, though the site says coming soon as it has for months. The device also doesn't support Direct TV for Showtime on Demand; still no HBO on Demand either.While it has some use for Prime members and as a way to access Pandora and Netflix if you don't already have a way.This still leaves much to be desired.I'm a fan of Amazon and a Prime Member but this falls far short of the Amazon I'm used to.", "verified": true, "helpfulness": "0/0", "author": "C. Lackey \"Great Product\""}, {"rating": 1.0, "review": "I'm pretty disappointed, it freezes up a lot and sometimes just closes the show and takes you to the menu out of the blue. Pretty irritating.", "verified": true, "helpfulness": "0/0", "author": "Sara Richey"}, {"rating": 5.0, "review": "I switched from a wired to the wall bluray player(with apps), so I was a little concerned about using wireless, as this has been a problem with streaming devices in my house previously. Initially(through the first few days) there were some issues with buffering. It had to do it quite a bit. However, they were very quick, so it didn't bother me to much. However, those went away fairly quickly. It seems to be that way with each new streaming app, Netflix, Hulu, etc., but that all goes away very quickly. I should mention that the internet in my town is really terrible, The top you can get is 6mgb down, and I'm getting HD, and it looks good. Couldn't be happier with it! Plus I'm really excited for slingtv!", "verified": true, "helpfulness": "0/0", "author": "Neal"}, {"rating": 4.0, "review": "The function is great. In particular I like the ability to screen show  my photos which are stored on Amazon Cloud and play music simultaneously from Pandora.I wish the HDMI standard allowed the device to be powered from the HDMI port rather than USB.The remote could have more function and be bigger. Fat fingers easily make mistakes.Set up was easy but .... I had difficulty connecting to the wireless router when the device was within 8 inches of the router. Not sure if this is an anomaly or a design issue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to intall (except for the remotes batteries).  Works beautifully and we are now enjoying all the Prime movies that come with our membership.Additional note> to remove the almost impossible slide cover on the remote in order to insert the batteries, the rear cover does slide to the lower rear.  You'll find using a kitchen rubber grip for removing jar lids works best. You'll still have to be a well fit male between the ages of 18 & 25 with arms built like a gorilla's, but if you use the rubber grip and push down with all your might until you think it's going to break the remote in half, you'll be sucessful and you'll be watching movies in no time.", "verified": true, "helpfulness": "1/1", "author": "Mike"}]