[{"rating": 4.0, "review": "It amazing love it wish you could go online like a smart tv but it was a great purchase ... A must buy", "verified": true, "helpfulness": "0/0", "author": "Lydia"}, {"rating": 4.0, "review": "It does pretty much everything that it claims.  It is similar to the Chromecast and has a lot of the same capabilities as most smart TVs.  I bought three of these and had some problems.  First problem was with connecting it to my new Vizio TV.  When I switched to the HDMI input for the FS my TV said that it couldn't switch to the current resolution.  I let it go for a few days and when I tried it again it worked.  No idea what changed but haven't had the problem since.  The second problem I had was hooking it up to my daughter's older Sharp LCD TV/DVD combo.  It was manufactured in 2008 and evidently was not compatible with newer technology.  It had HDMI but after displaying the Amazon splash screen on boot-up the screen just went blank.  Spent over an hour on the phone with Amazon tech support but could not fix the issue.  We did determine that it wasn't the TV Stick because it worked on other TVs.  Called Sharp and they didn't have a resolution either.  Ended getting a deal on a new Samsung TV at best Buy and the TV Stick works fine with that.  So if you have an older flat screen TV you may have problems getting the TV Stick to work with it.", "verified": true, "helpfulness": "1/1", "author": "D. Kline"}, {"rating": 5.0, "review": "Easy to setup, worked great and as advertised.  Strong list of movies and other options for viewing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"travel hound\""}, {"rating": 1.0, "review": "No", "verified": true, "helpfulness": "1/2", "author": "Anil Neupane"}, {"rating": 4.0, "review": "It works great.  Just wish that the TV shows I want to watch were Prime Video and you don't have to pay extra for them.  examples are The Waltons , Mike and Molly.", "verified": true, "helpfulness": "0/0", "author": "T. Beaver"}, {"rating": 5.0, "review": "Great and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Debbie Duncan"}, {"rating": 4.0, "review": "Was worth it", "verified": true, "helpfulness": "0/0", "author": "Matthew Craig"}, {"rating": 5.0, "review": "It works great.  Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "DONNA COLEMAN"}, {"rating": 5.0, "review": "I fully expected this thing to be a semi-useless device, however this thing is actually amazing. It does tons of stuff, and it's ability to run android apps blew me away. Way to go Amazon! Go get you one.", "verified": true, "helpfulness": "0/0", "author": "J. Shipp"}, {"rating": 5.0, "review": "very pleased with the performance of the product.", "verified": true, "helpfulness": "0/0", "author": "Mike Swick"}]