[{"rating": 5.0, "review": "We absolutely love it. This has been the greatest Christmas gift ever.  I say we because my hubby loves it too.  I enjoy the radio stations too.  Col", "verified": true, "helpfulness": "0/0", "author": "Col"}, {"rating": 3.0, "review": "Overall good product. The only nice thing they could add is more options for news like CNN or ABC News. They do have CBS news though. The connection worked really well. We got this to replace cable, because it was getting expensive. We mostly use for netflix and that works great.  Good product.", "verified": true, "helpfulness": "0/0", "author": "Lydia Monk"}, {"rating": 5.0, "review": "This item was such a great purchase that I went ahead and bought a second unit for another TV. Love the features, apps, and ease of use that this item provides or the competition. Would highly recommend to anyone that like to stream TV shows, movies, games, etc.", "verified": true, "helpfulness": "0/0", "author": "Luis F Padilla"}, {"rating": 1.0, "review": "Doesn't let you have apps that fire tv have or apps kindle fire have .Mirror doesn't work from my kindle DON'T think I'll buy them again.unless they are working better then mine.", "verified": true, "helpfulness": "0/0", "author": "jon moffat"}, {"rating": 3.0, "review": "I am very disappointed, all the TV shows I'm interested in I have to pay per episode. If I were to watch \"one\" season of any \"one\" show that's thirty to forty dollars on top of the annual eighty-five dollars. I can buy a whole season TV show at Wall-Mart for less, and Netflix will give me a selection for ten dollars a year.I like the idea, the selection, and the convenience of your service, but I feel it's not the most economical choice.", "verified": false, "helpfulness": "0/0", "author": "CyclePassionsLLC"}, {"rating": 5.0, "review": "It's great! I use it all the time", "verified": true, "helpfulness": "0/0", "author": "Rusty"}, {"rating": 5.0, "review": "Just love it, easy to use.", "verified": true, "helpfulness": "0/0", "author": "barb"}, {"rating": 4.0, "review": "Other than that it needs a separate outlet, I really do like it.  I wonder why it doesn't operate thru the TV power but the other features are very nice.  So long cable!!!", "verified": true, "helpfulness": "0/0", "author": "BETTE DAVIS"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to operate.  A great addition to our second home.", "verified": true, "helpfulness": "0/0", "author": "gkj"}]