[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Luis A. Almodovar"}, {"rating": 5.0, "review": "Great! We love all the features! Very excited not to have to pay the high costs of cable t.v. ever again!", "verified": true, "helpfulness": "0/0", "author": "Jennifer L Keeney"}, {"rating": 5.0, "review": "Extremely easy to set up.  The only problem I had -- old house, not a lot of \"nicely\" located outlets.  But did use a surge protector in a free double outlet and only the Fire Stick is plugged into it.  Otherwise, worked right out of the box and because I was already a Prime Member, everything was set to go.  So far looked at all of ALPHA House season 1. Do not have a \"Smart TV\".", "verified": true, "helpfulness": "0/0", "author": "D. Cloud"}, {"rating": 4.0, "review": "We enjoy the Fire TV Stick.  The preloaded apps work great (Netflix, Showtime and HBOGo).  The only negatives are lack of other apps (AMCTV and FX aren't compatible).", "verified": true, "helpfulness": "0/0", "author": "SWagner in PR"}, {"rating": 3.0, "review": "It's okay, but it would be good if they had more functions the remote control and the software", "verified": true, "helpfulness": "0/0", "author": "Horacio Daniel Iglesias"}, {"rating": 4.0, "review": "We now own two and love the ease of use. Amazon Prime is the best source for streaming films.", "verified": true, "helpfulness": "0/0", "author": "Druce Reiley"}, {"rating": 5.0, "review": "Works well - It picked several Wi-Fi's networks in the neighborhood. My WiFi unit is in the bedroom away from the TV but setup showed excellent signal strength for it. Some of the other reviews said they had trouble with strength but I didn't. Crashed once right after set up but I un-plugged the fire stick from the TV and power supply and re-installed and so far so good. My \"smart\" Sony TV would no longer receive YouTube due to a Google change and thought I'd try the stick rather than buy a new TV. Now I can still receive YouTube. Remote is a little hard to work - kinda' small - but not a real problem.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Great product, best streaming device and very cheap.", "verified": true, "helpfulness": "0/0", "author": "Aladdiyn Hardy"}, {"rating": 5.0, "review": "Was well worth the purchase. Who needs cable, NOT I.", "verified": true, "helpfulness": "0/0", "author": "Toni \"Toni Clark\""}, {"rating": 4.0, "review": "I love it. I just can't figure out how to get my photo's, or more specifically the folders, to jive with what I have in the cloud.", "verified": true, "helpfulness": "0/0", "author": "Brian Harmes \"fred\""}]