[{"rating": 5.0, "review": "Wife loves the convenience.", "verified": true, "helpfulness": "0/0", "author": "Keith Rhodes"}, {"rating": 5.0, "review": "I absolutely LOVE the Fire TV Stick!  I still have a Roku box in the living room, but the Fire TV Stick is more reliable, has less interruptions even during a bad storm, and I prefer the layout.  I highly recommend to anyone looking for their first or a new streaming device!", "verified": true, "helpfulness": "0/0", "author": "Patty Summers"}, {"rating": 5.0, "review": "Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Nick MacDonald"}, {"rating": 5.0, "review": "Great!!  I need to buy another one for a second TV.", "verified": true, "helpfulness": "0/0", "author": "Sandra F. Gerner \"stretch13666\""}, {"rating": 1.0, "review": "Can't get vudu on the device,  you can't use Bluetooth headphones unless you buy the more expensive one. It is faster and works better than the roku stick does", "verified": true, "helpfulness": "0/1", "author": "matthew"}, {"rating": 2.0, "review": "It should be stated that popular channels like HBO GO and ESPN Watch are not available on Fire TV through many cable carriers. Also, doesn't mirror the iPhone. I returned it. Going to stick with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Cedotal"}, {"rating": 5.0, "review": "We bought this for our television in our living room but it seems to have found it's way into the daughter's bedroom. Works great and have to problems.", "verified": true, "helpfulness": "0/0", "author": "Patrick Flynn"}, {"rating": 1.0, "review": "Very unfortunate since I enjoy everything else that Amazon does and sells! Playback of Netflix stutters and Plex won't play certain files. Menus are slow to come up and apps seem to be quite limited. I almost can't believe this is an Amazon product! I will be returning and getting yet another Roku. I had high hopes but in the end, the Fire TV Stick just doesn't cut it.", "verified": true, "helpfulness": "1/2", "author": "Derek Norman"}, {"rating": 4.0, "review": "Love my new fire tv stick. So simple. I give it a 4 because it recommends to use the power cord for the stick while in use. The power cord isn't long enough for a mounted tv. The cord won't reach my power strip.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Eastep"}, {"rating": 1.0, "review": "Absolutely awful.  Does not stay connected to wi fi.  Worked for about a month and then just stopped connecting.", "verified": true, "helpfulness": "1/3", "author": "Edward Twardoz"}]