[{"rating": 5.0, "review": "like", "verified": true, "helpfulness": "0/0", "author": "craig calamaio DVM"}, {"rating": 5.0, "review": "I installed Kodi and TVMC on it and it was great!!!", "verified": true, "helpfulness": "0/0", "author": "Drake Best"}, {"rating": 5.0, "review": "My husband & I both like the fire stick especially because we only have an antenna and get a few channels.  Now, we have the ability to get a variety of programs that we couldn't get otherwise.", "verified": true, "helpfulness": "0/0", "author": "Kerry A. Barndt"}, {"rating": 4.0, "review": "Decent. I don't watch TV or many movies as it is, so the more limited selection of Prime doesn't bother me. I don't use any other apps on the device. The remote is easy to use, but also annoyingly small. I also find it weird and annoying that there is no off/on button on the remote, yet if you touch it at all (not even touching any buttons) it will turn your TV on. This streaming feature and inexpensive Fire Stick is a nice bonus to Prime, but not my reason for having Prime (which is for free shipping).", "verified": true, "helpfulness": "0/0", "author": "D.Nuttz"}, {"rating": 3.0, "review": "the remote is terrible, streaming on my play station seems to work better. On the fire stick it acts as if the internet is to slow but works fine on the play station.", "verified": true, "helpfulness": "0/0", "author": "Kevin Jones"}, {"rating": 5.0, "review": "easy to use - works great", "verified": true, "helpfulness": "0/0", "author": "Helen Cassell"}, {"rating": 1.0, "review": "What a disappointment. My first Stick started showing flashing lines and having momentary shut-offs from the moment it was installed (I used the AC power cord) and before it was connected to Wi-Fi. We were able to set it up and watch TV as long as we accepted the flashing and sudden shut-offs. These left the screen in a pause-mode and required us repeatedly to press the play button. We were able to watch a program in this most uncomfortable way..I called customer service and was immediately sent another Fire Stick. This second one shorted out and cut off so badly that it would not even allow two letters of my internet password without shutting off completely. What followed was a complete rebooting that required us to watch the instruction video for a second time. Again, it completely shut off and after the third time of complete reboot, I gave up. The second call to customer service was over 18 minutes long as the first representative, who barely spoke English, could not understand why I wanted to return the second Stick and finally said I had to speak with a customer representative in the \"technical\" department. This second person reluctantly allowed me to return the item: Not what I expected from Amazon service.Please note, that I checked out my TV's HDMI input and it was fine. There were two other HDMI cables inserted in other HDMI input slots. Perhaps, these Fire Sticks had poor shielding. I have purchased a Google Chrome device and will soon test it out. I hope it will work well.", "verified": true, "helpfulness": "0/0", "author": "sexy grampa"}, {"rating": 3.0, "review": "At times picture freezes and you can't search for other programming while watching a particular show", "verified": true, "helpfulness": "0/0", "author": "pamela pollock"}, {"rating": 2.0, "review": "The only thing that works right on an amazon fire stick is amazon instant video. The Hulu and YouTube freeze up repeatedly. You will have to reboot it at least every couple of days.", "verified": true, "helpfulness": "0/0", "author": "rachel hensley"}, {"rating": 5.0, "review": "My favorite stick!", "verified": true, "helpfulness": "0/0", "author": "Guillermo Trovato"}]