[{"rating": 5.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Nichols"}, {"rating": 3.0, "review": "Got a strange blue screen \"content unavailable \" for the 1st two days I had it but had sound in all my movie apps on the stick.Took a ton of trouble shooting, port cleanings, power cyvles to just get it started. Had to shuffle the stick around in my home hdmi ports and power cycle it multiple times in order to finally see a show. Additionally to truly power cycle it I had to physically remove it from the port after unplugging the power supply as opposed to just unplugging the adapter. It would nit restart unless i did so. A real nuisance for my wall mounted LTD and Plasma. Had it for 3 days now and will amend review as updates come along. It's a \"beta\" stick for them so I hope for a more stable solution or off to Chrome I go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Shipped as expected", "verified": true, "helpfulness": "0/0", "author": "parker Hand"}, {"rating": 5.0, "review": "Much more you can do than with Chromecast,", "verified": true, "helpfulness": "0/0", "author": "Rene Tenas"}, {"rating": 5.0, "review": "Easy to get up and running, even for a techno challenged person like me. With Amazon prime it is awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Patricia Mattucci"}, {"rating": 3.0, "review": "Fair still testing prime", "verified": true, "helpfulness": "0/0", "author": "eugene mazzola"}, {"rating": 3.0, "review": "This device performs well on my Sony Bravia that has only one HDMI port.  Amazon advertising was misleading when it advertised just plug the stick into the HDMI port.  You need a power source to plug into. This was very difficult in our case as our TV is housed in an entertainment unit. Tense moments ensued when we learned we needed another LONG extension cord to plug it in as everything was fed to the back of the unit.  The lack of an APP for Acorn TV  was disappointing. I have Apple TV and I can at least do the mirroring with my iPad for Acorn TV.", "verified": true, "helpfulness": "0/0", "author": "Pandora"}, {"rating": 5.0, "review": "quick fast and easy to install it turned a 4 year old not smart tv into a great smart tv. never seen a loading screen so far. great quality on the picture too!!", "verified": true, "helpfulness": "0/0", "author": "JFL"}, {"rating": 3.0, "review": "For the price, the device is good, but there are some performance issues that hinder the experience. Sometimes the device will hang for a few odd seconds when transitioning. The device also froze on us within 30 minutes out of the box. Also the device has a very steep learning curve due to the odd menu layout. Amazon needs to figure out how to make an easy user interface because as it stands, the Fire TV interface is a pain.However, when you get down to it, the Fire TV Stick does what it says it does and offers content from multiple sources.", "verified": true, "helpfulness": "0/0", "author": "B. C. White"}, {"rating": 5.0, "review": "Easy to use and great idea!", "verified": true, "helpfulness": "0/0", "author": "Jewell W."}]