[{"rating": 5.0, "review": "It can't get much easier than using the Fire Stick. Reall nice.", "verified": true, "helpfulness": "0/0", "author": "Sher"}, {"rating": 5.0, "review": "excellent device... worked better than expected!", "verified": true, "helpfulness": "0/0", "author": "Sherry Singleton"}, {"rating": 5.0, "review": "Having used smart tvs, a wii, an xbox and chromecast, I got to say nothing comes close to the firestick. The homescreen is extremely easy to navigate and loads up instantly (yes, its that fast), and the serues are organized in an easy to understand fashion. Getting apps sideloaded into it is extremely easy, and there are a lot of games that you can play in it, either by casting or just downloading it into the firestick. I would recomend this over any other option, even the roku or apple tv. For the price, this is the best you can get.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Marrero"}, {"rating": 3.0, "review": "It's really nice does a lot but I can't get a good enough wifi signal on my fire stick on my tv in the basement", "verified": true, "helpfulness": "0/0", "author": "Derreill Reynolds"}, {"rating": 5.0, "review": "The Amazon Fire TV stick is an easy and convenient way to get prime and other media on your tv. I no longer pay for television service that delivers lousy programming and channels I don't want.  A little creativity and the fire stick gets me everything I need in the tv department.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "Adrian aldaz"}, {"rating": 2.0, "review": "I got no satisfaction what so ever from this product. The initial set-up process took me around 30 minutes because it could never connect to my internet or connect to my fire stick. After that headache it took several hours for it to finally connect to my Netflix account, once that was done it took another several hours for all the Netflix data to load; **Menus, titles, etc.* Most of the time I was reconnecting the device and restarting it because of a failed Netflix signal or having no menu at the Netflix load screen. I tried downloading the karaoke app as well, this took around 3-4 hours to work; finally after getting it working all we could hear was an echo while we were singing..even the apps were a totally disaster. This little device was not worth the $24.99 I spent on the awful Amazon prime day.....sold it to my sister, Thank God I got rid of it. I'm going to try other brands just to see what else I can find besides this little device of doom.PRO:.....noneCONS: Never stays connected long enough for me to finish an episode of any show on Netflix, complete waste of money and time. If you buy this make sure you have internet speed that matches the speed of the flash.", "verified": true, "helpfulness": "0/0", "author": "RevengeOfTheWizard"}, {"rating": 5.0, "review": "Could have a better Wi-Fi range", "verified": true, "helpfulness": "0/0", "author": "Christian Aran Tuter"}, {"rating": 3.0, "review": "I can not get HD quality with the stick for the movies.  Pictures are HD. Music is fine.  I don't play games.", "verified": true, "helpfulness": "0/0", "author": "DaBenz"}, {"rating": 5.0, "review": "EASY TO USE", "verified": true, "helpfulness": "0/0", "author": "Marysol Calvillo"}]