[{"rating": 5.0, "review": "So good that I am considering buying another one for our bedroom to replace a Roku.  I did have some initial trouble getting the iPad and Android apps to find and recognize the device.  Perfect companion to Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Tom B."}, {"rating": 1.0, "review": "This device donot have browser that is the major drawback in it. What I realize this device is only made for Amazon store", "verified": true, "helpfulness": "0/2", "author": "prashant"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "NOURA ALALI"}, {"rating": 5.0, "review": "Good buy, good results", "verified": true, "helpfulness": "0/0", "author": "john thomas"}, {"rating": 4.0, "review": "It was easy to install and I dropped my cable service.It is so much better.Absolutely no problems.", "verified": true, "helpfulness": "0/0", "author": "Dotty R."}, {"rating": 5.0, "review": "Love the fire tv stick, very simple and easy to use. The perfect streaming device", "verified": true, "helpfulness": "0/0", "author": "Supreme Jones"}, {"rating": 4.0, "review": "Still learning about all features and benefits.  So far so good.", "verified": true, "helpfulness": "0/0", "author": "Dbdbdbd"}, {"rating": 4.0, "review": "There are things I like about fire stick and things that I prefer Roku for.  Roku has apps such as PBS that firestick does not currently have.  Roku's remote is more intuitive.  Firestick has a remote with a circle that you have to press right, left, up down to move and the middle for OK.  I prefer a remote that has the arrows.  Firestick is easier to access Amazon Prime (but not that much easier).  I initially had more trouble setting up the firestick.  It worked for a while and then it didn't.  Customer support though is excellent and we discovered together that your firestick must go directly into an outlet not a power saver outlet.  So I have both the roku and the firestick.  I like them both about the same.  One advantage to the firestick is the ability to mirror what is on your kindle.  We no longer have local television and are too far away to pick them up without a huge antenna.  During bad weather, I was able to get on the internet with my kindle, access the local news and mirror it.  Not a great picture but it was adequate.", "verified": true, "helpfulness": "0/0", "author": "sushicatlover \"sushicatlover\""}, {"rating": 4.0, "review": "Quick and easy - was up and running in minutes", "verified": true, "helpfulness": "0/0", "author": "Kim D"}, {"rating": 2.0, "review": "The Fire stick itself functions well in getting programs for me however the remote is useless.  It has a range of about 4 feet and I have also tried other remotes provided by Amazon as a replacement and they perform the same.  This leaves me believing the receiver/transmitter in the Firestick is not working well except for the fact that my Visio TV remote works beautifully past ten feet doing all of the functions of the Amazon remotes just using different buttons.  I think Amazon needs to talk with the Visio engineers.  Also wish they would have a easy video casting/fling built inUpdate on problem- It did turn out to be a defective Fire Stick.  The response from Amazon was excellent, all items were shipped free and quickly..", "verified": true, "helpfulness": "0/1", "author": "JB Palkki"}]