[{"rating": 3.0, "review": "If you already have these services on your DVD player or TV, then there is no need to own this.", "verified": true, "helpfulness": "0/0", "author": "Nancy R. Arevalo \"narevalo\""}, {"rating": 5.0, "review": "Really love how easy it is to connect.  We also took it with us when visiting family...just plugged it in and we had all our favorites with us.", "verified": true, "helpfulness": "0/0", "author": "S Huntz"}, {"rating": 4.0, "review": "I received this as a Christmas gift. i just want to state that the video that come from this lil device is so clear. now not all videos are in Hd but the ones that are is amazing. note that not everything is free if you have Prime. there are videos and movies that you have to buy. I got to see how prime is for a month and i didn't get to use it as much as i should of but thats ok. Twitch tv wasn't as clear. using chromecast to stream twitch.tv was much much better. also if you dont have any accounts to like netflix or hbo go or stuff like that these devices are useless and if you have a smart tv. its still useless just another remote to have.", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 2.0, "review": "Perhaps once all the bugs are worked out it will be alright. My experience living in Maine with DSL is that I cannot get the 'Help' vids to play that came installed. Things never stop 'loading'. I purchased a fireplace app for Christmas and after spending half an hour or so trying to get it to work I moved on frustrated. I noticed yesterday that a couple of the 11 screen options are working but still not all. Looks awesome but lacks functionality. Trying to find the options for importing local files (without buying additional items - an android operating system driven device smartphone or tablet) is impossible without something like another expense purchasing an app like PLEX. If I had dumped cable or sat for this I'd be bumming for sure. Hoping for brighter days ahead. I hear the Fire box is a good product - but that is not the one I have.", "verified": true, "helpfulness": "0/1", "author": "Whitey French"}, {"rating": 4.0, "review": "Very user friendly, but missing some of my favorite apps (possibly due to copywright from competing products)  No Vudu/Ultraviolet or Google Play streaming capabilities.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"JDC\""}, {"rating": 5.0, "review": "Great piece of technology.  Makes my life easier and more enjoyable being able to access different services through one device!", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 4.0, "review": "Works well and is worth the money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! It is easy to use and fast getting in and out of the application.  Got one for my inlaws, my parents grabbed one before I had a chance to get them one.", "verified": true, "helpfulness": "0/0", "author": "kevin J Grant"}, {"rating": 5.0, "review": "Gonna buy another for other TV.  Glad Comcast is gone.", "verified": true, "helpfulness": "0/0", "author": "TBlaze02"}, {"rating": 5.0, "review": "The Fire TV Stick is an great way to take your streaming video anywhere. The works great on all the TVs in my house and sets up in seconds.", "verified": true, "helpfulness": "0/0", "author": "Stanley T. Myles \"techsan68\""}]