[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I'd expected that as an Amazon device they had figured this would need to be as portable as my kindle and would work anywhere. it doesn't.I'm a UK amazon customer, living in the US, where I bought the stick, expecting it to work fine. despite resets and software updates it fails to be able to connect to the amazon content servers to stream anything BUT the music content (which works fine) the error messages are cryptic and whilst its promised that a future update will make it work with captive portal wifi (like in hotels) it doesn't yet.eventually i discovered that as its 'digital delivery' I need to change the location to the US on my account. there's nothing I've seen in any of the overly simplistic documentation that refers to this. I made the change, unfortunately its still a useless item.the stick has another few days before its going back.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is cheap but neither is it very good.  Compared to a Roku there are very few channels.  But most importantly it freezes during streaming.  It definitely needs better software; I'll buy a Roku instead.", "verified": true, "helpfulness": "2/2", "author": "docj"}, {"rating": 4.0, "review": "Great deal.  A bit slower than the full \"puck\" unit but not bad considering the small form factor.  Remote is a bit flimsy.", "verified": true, "helpfulness": "0/0", "author": "Mochi's uncle"}, {"rating": 5.0, "review": "We love it!  It is very easy to use and I love having the rental option.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "With the Fire Stick and Amazon Prime I have a whole lot of entertainment available.  The device and the program lay-out is easy and fun to use.", "verified": true, "helpfulness": "0/0", "author": "Michele Martell \"Queueme\""}, {"rating": 5.0, "review": "BEST THING I HAVE PURCHASE FOR MY HUSBAND  HE LOVES IT!!!", "verified": true, "helpfulness": "0/0", "author": "Cynthia R."}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Cindy Richards \"booklover\""}, {"rating": 5.0, "review": "What a bargain!  We belong to the Prime program, we get to watch thousands of videos at no extra cost.", "verified": true, "helpfulness": "0/0", "author": "Ron Hoag"}, {"rating": 5.0, "review": "Love it.  Easy to set up and use.  I see cutting the cord in our future.", "verified": true, "helpfulness": "0/0", "author": "Kneeps"}]