[{"rating": 2.0, "review": "Background info about our TV and streaming setup.  We ditched cable TV 2 years ago and currently subscribe to Netflix, Hulu, and Amazon Prime.  Heavy users of Hulu, Netflix and YouTube (daily for hours at a time).  Have 2 Chromecasts at home, one of which was meant to be replaced by the Fire TV stick.  Before that, we used an Xbox but got rid of that over a year ago so we wouldn't have to pay a monthly fee to access apps.My husband and I were really excited to finally get our hands on the new Fire TV Stick.  We waited patiently for weeks before a new batch was in stock and shipped out.  When it finally arrived we immediately unplugged our old Chromecast from the living room TV and setup the Fire TV stick.  We loved that it came with a dedicated remote control (Chromecast does not have one) and that you could also control it through an app on your phone or device.  We were also really excited that we would once again be able to watch programs on Amazon including digital movies that we rented or purchased AND Prime Amazon Instant Video content.  Things were great for the first couple of weeks but then we started running into problems:- Hulu and Netflix skip and stop frequently during playback (but Amazon shows don't)- YouTube is difficult to navigate (takes FOREVER to type something into the search bar)- The keyboard on the iPhone app doesn't work- The \"cast\" button that you use with Chromecast recognizes your fire stick (YouTube app on iPhone and in the Chrome browser on your computer) and it says that it works but it doesn't.- Can't add things to the TV queue with YouTube the way you can with Chromecast- Because the Chrome browser cast button doesn't work (even though it sees your Fire TV and says that it will work) you can't share your desktop or your browser screen on the TV.Overall we are just disappointed with Fire TV.  We really thought it was going to have greater capabilities than Chromecast, but in reality it's just the opposite.  Now we are planning to go back to our Chromecast.  I think that Fire TV will be a secondary device in our house.  The only use I'll really have for it will be to watch any shows or movies that we buy, rent, or stream from Amazon from time to time but for the big players (Hulu, Netflix, YouTube) we will be using Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Arthus \"Student09\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "jorgepomalaza"}, {"rating": 3.0, "review": "This certainly has a lot of options, but I'm not happy with the constant buffering and skipping when I watch anything on Netflix.  It is not a Netflix issue, because I can use the Chromecast and cast from my laptop without a problem.  I have not done any research to solve this problem.  If I find something that works then I'll change my review.", "verified": true, "helpfulness": "0/0", "author": "Jen \"Jen\""}, {"rating": 5.0, "review": "Soon as I get it all figured out It will be great.", "verified": true, "helpfulness": "0/0", "author": "B. C. \"bac\""}, {"rating": 5.0, "review": "Omg the best thing that could happen! I have my whole family ordering one!!!! I have 2 now no need to order my daughter one.", "verified": true, "helpfulness": "0/0", "author": "Nicole Wilson"}, {"rating": 5.0, "review": "Can't wait to see more new programs or apps showing up on this.  Could be the end of cable.", "verified": true, "helpfulness": "0/0", "author": "Robert Perry"}, {"rating": 2.0, "review": "I buyed this device to share my kindle screen on any tv, But amazon told me this is not possible with my HD 6 kindle, they offer a free usb-hdmi converter. Big mistake. WARNING! this device need power source, provided in the box, is like an usb charger, unexpected since no pics show it, and unpractical for what I want. Beside, almost every app, movie, music and TV show, are pay, I think amazon should give this device for free if planning to charge me on all that.", "verified": true, "helpfulness": "0/1", "author": "Luciano CCS"}, {"rating": 5.0, "review": "Great. Would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Megan Monestina"}, {"rating": 5.0, "review": "Easy to install and register. Have not used it much though since installing it. Seems to work as well as the Roku we bought a few years ago at twice the price.", "verified": true, "helpfulness": "0/0", "author": "Roval"}, {"rating": 1.0, "review": "you can use existing accounts like (Netflix) you have buy a new one..", "verified": true, "helpfulness": "0/1", "author": "kerry"}]