[{"rating": 5.0, "review": "I love this, BEST thing they could've invented! !", "verified": true, "helpfulness": "0/0", "author": "K. Kulp"}, {"rating": 5.0, "review": "As advertised. I am enjoying using it. The high definition pictures that come with it are worth the price.", "verified": true, "helpfulness": "0/0", "author": "George J. Joustra"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "RM"}, {"rating": 4.0, "review": "very satisfied", "verified": true, "helpfulness": "0/0", "author": "MzJLove"}, {"rating": 5.0, "review": "This little device is the cat's meow for an inexpensive way to convert your dumb TV to a smart TV. Data entry is too hard to do much web surfing but your Netflix movie/show works great. Have not tried Amazon prime but others report it is smooth as silk.", "verified": true, "helpfulness": "0/0", "author": "Terry D"}, {"rating": 5.0, "review": "I love this! My tv always had a really slow internet connection and couldn't load apps like Netflix or Hulu. The fire stick makes runs these apps really fast! Haven't had any problems with it!", "verified": true, "helpfulness": "0/0", "author": "Amanda Sessions"}, {"rating": 5.0, "review": "This seems to work much better than a Roku stick that I had purchased and had to return because it constantly locked up and had to be reset.", "verified": true, "helpfulness": "0/0", "author": "Carol Gasper"}, {"rating": 4.0, "review": "Fairly easy to set-up and it was working nicely for two weeks...then it stopped working for several days and I tried several times to go back through the set-up process. Finally, I was able to re-install the fire stick and it worked once again.", "verified": true, "helpfulness": "0/0", "author": "Peter A Dall, SR"}, {"rating": 3.0, "review": "It's okay!", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 5.0, "review": "It's great.  Netflix would not work half the time on our LG smart TV bur the stick works great.", "verified": true, "helpfulness": "0/0", "author": "J. Kincaid Smith"}]