[{"rating": 3.0, "review": "I won't do a detailed review since others already have, but long story short, the Fire Stick works well, no hiccups, and will completely replace my Apple TV, but the Amazon content is weird. Example, a 2014 movie is free with an Amazon Prime account, but Some older movies cost $3.99 or MORE! Netflix vs Amazon Prime? I'd go with Netflix. Why? You won't mistakenly pay for a movie that you might assume is free whereas Prime mixes free and Pay Per View. Personally, to me, the best feature of the Fire Stick are the apps, specifically Plex! Now I can watch all my ripped DVDs stored on my computer on any TV in my house.", "verified": true, "helpfulness": "0/0", "author": "Zackry Cephas \"Cream of Beats\""}, {"rating": 1.0, "review": "Constant wifi connection problems. I have never had this much trouble with a wifi device. (kindle, tablet, phones, ps4, pc, roku, chomecast, all work fine) I will wait a few weeks to see if Amazon has a solution. If not, it will be returned for refund.", "verified": true, "helpfulness": "1/2", "author": "John J Downing"}, {"rating": 5.0, "review": "love it! all set up when i got it!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I will give a 4 star.  I mainly use this to get PLEX for my main TV. I used to use PS3 as media server but I had little lag issues with 1080 playing.  This one also skips few as I played some 1080.  But at least Fire stick gives me option to downgrade the quality of video so I don't have to skip the plays.  I got it during the $19 promition so I won't complain for 20, you cannot beat the price.", "verified": true, "helpfulness": "0/0", "author": "Cloud"}, {"rating": 5.0, "review": "Worked as stated.", "verified": true, "helpfulness": "0/0", "author": "EDUARDO RODRIGUEZ"}, {"rating": 5.0, "review": "Turned my tv into a streaming entertainment center. This is a must have for anyone with a non-smart tv.", "verified": true, "helpfulness": "0/0", "author": "D. O'CONNOR"}, {"rating": 2.0, "review": "Operates Fine. Registration sucked! The installation is simple as one would expect. It started up, I added the necessary info to connect to my network and it checked for updates. Simple.The trouble began while I was trying to register it. I typed my Amazon email address and password into the appropriate boxes and submitted. The screen changed to indicate a process was occurring but, at the end, I was kicked back to the screen for the email address with an error to the effect of \"no such Amazon account\".I carefully double checked my entries as I don't often type (really never since I use a password vault) my Amazon password. After seeing everything was correct, I submitted with the same error as the result. I tried powering off and then on the Stick: same old, same old. I did a hard reset (hold the play/pause and center button until it resets) and started over from scratch: NOPE!Finally, I turned to the forum and found the link to customer service for Fire TV: https://www.amazon.com/gp/help/customer/digital-video#aI found the link in the forum in a reply from customer service to a complaint from another user with the same issue. This was after an exhaustive search of the help pages. I think there needs to be created a few more EXPLICIT categories in the customer service \"Contact Us\" area.I started a chat with the rep and I was asked for the DSN# from the package. I had to pull out the scanning electron microscope as my reading glasses weren't up to the task of reading the 6 pt type. After a couple of minutes, I was informed that the device was registered and I was asked to power off and restart (I ignored that). I hit submit from the, by now, hated registration screen and, after 15 seconds, I was greeted by an introductory video.This all took place over the period of about 2 hours!Best that I can understand, the devices go out tied to your account in some way. Evidently, they were not processed correctly so they cannot be registered. Seems strange but that is what I have read.So, if your registration fails more than once with good email address and password, use the link above to chat with customer support. Be prepared with the DSN and ask that the device be registered for you as your attempts to do so have failed.I would give 4 stars were it not for the time-wasting hassle. The Stick works smoothly and, at least for me, streams beautifully. I would not give 5 stars because the device doesn't seem special and it should include, as part of the design, the ability to stream by DLNA so I can ditch other devices. The available apps I have seen to accomplish DLNA get mixed reviews with only PLEX getting more than an average rating.As far as PLEX goes . . . MEH. A bit buggy for me in that it won't recognize and add to the library videos that should be compatible. I have checked and compared them with a software tool that reads the characteristics of the encoding and I can find no substantive difference between those that are recognized and those that are not. I have searched the PLEX fora and help and I can't nail down the problem. If anyone knows the answer, comment here as I will be receiving updates.", "verified": true, "helpfulness": "3/3", "author": "B. Williams"}, {"rating": 3.0, "review": "Works great with Amazon videos, not so great with everything else, can't get it to play more than 5 minutes of video on PLEX without crashing, Netflix is slightly better but still crashed way to often and it drops its connection constantly. I have to restart it so often that I have put it on its own power strip so I don't have to keep reaching behind the TV to unplug it.Hoping Amazon send down some updates to fix all the issues.So for now I'm using it only for Amazon Prime videos, PLEX and Netflix are running perfect on my first generation Roku.I got it when it was on sale for $19 so I don't feel like I have been ripped off, but if I had paid $39 I would be returning it.I feel like I paid Amazon $19 to be a Beta tester.", "verified": true, "helpfulness": "3/4", "author": "A. Mitchell"}, {"rating": 1.0, "review": "Have to reboot on a daily basis.  I own a Fire TV and it is great.  I was offered a Fire Stick at $20 to beta test?  Loses network connect even though it is next to router.  Only way to fix it is to unplug and reboot.", "verified": true, "helpfulness": "1/2", "author": "Scott"}, {"rating": 5.0, "review": "UPDATED 3/27/15:I don't know if it's because I updated my Android OS to Lollipop, or if there was an update pushed to my Fire Stick, but screen mirroring works, and works well.Also, HBO GO has been released for the Fire Stick.We'll have to wait until the fall to see if NHL GameCenter/Center Ice is available.I am now pleased with this product.ORIGINAL REVIEW: I will start with a big negative: Screen mirroring with Samsung Galaxy S5 does not work. My phone recognizes the Fire Stick, and the Fire Stick apparently recognizes my phone. When I try to do the screen mirroring, my TV says that it is preparing to mirror with my phone, and it calls my phone by name. So I'm pretty sure the two are talking to each other. However, after several seconds I get an error message saying that they can't mirror. Wireless screen mirroring is a big reason why I bought this. I have plenty of other ways to stream Netflix, Amazon movies, etc to my TV. I have done some internet research and it appears that nobody else has successfully mirrored their Galaxy S5 with the Fire Stick. Second negative: No HBO GO (supposedly coming soon) and no NHL Gamecenter Live. I guess its my fault for not doing more research before buying and finding out ahead of time that those two apps aren't available. Fortunately I pre-ordered the Stick during the sale period and only paid $19. If I had paid full price I would be returning it. Positives: Easy to set up, easy to use, seems to have a faster connection to my WiFi than my PS4. I haven't experienced any low quality video or buffering while using Netflix or Amazon movies.My recommendation: If HBO Go, NHL Gamecenter, or screen mirroring are important to you, I would wait a while to buy this and maybe the apps will be available and maybe the screen mirroring will be fixed.What's really frustrating me is that the Galaxy S5 is the most sold Android device in the US. You'd think that Amazon would have released a product that works properly with the most popular Android device. If the screen mirroring doesn't get fixed soon, if HBO Go isn't added soon, and if NHL Gamecenter isn't available next season, the Fire Stick is quickly going to become another obsolete device in my junk drawer.", "verified": true, "helpfulness": "1/2", "author": "benrb"}]