[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ana Maria Aguilar"}, {"rating": 3.0, "review": "So far so good. Haven't had a chance to use it to it's full potential yet.It works mostly like Netflix but has a lot of other apps to choose from.", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Yahmin Norwood"}, {"rating": 5.0, "review": "good, I wish there was more live stuff, and disney doesn't work in hawaii", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "A Quick question? Paying the Fire TV stick price, I won't have to pay the Netflix monthly charge anymore?", "verified": false, "helpfulness": "0/0", "author": "Pablo Condeza"}, {"rating": 5.0, "review": "Best stuff ever", "verified": true, "helpfulness": "0/0", "author": "Stephane L."}, {"rating": 1.0, "review": "I would give this a 0 if I could.  We could not get it to work, we wound up buying a splitter and apple T.V., which is much better.", "verified": true, "helpfulness": "0/1", "author": "Lisa Buckalew"}, {"rating": 5.0, "review": "Love, love, love!  Great idea, can't be seen and works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Dexter \"ljkukla\""}, {"rating": 5.0, "review": "AAA quality and works great.", "verified": true, "helpfulness": "0/0", "author": "James P. Burrow \"Peedlum\""}, {"rating": 5.0, "review": "I am impressed. The choices on the opening many Icons are almost overwhelming in choices. Well thought-out, while going through the many choices. Unless you are a \"Prime Member\", you probably will not get much of the full benefit? For those thinking that they will be watching \"live\" TV like HSN or QVC? That is not one of the choices. Free Prime movies and watching old TV series that I may have missed, are my personal main uses. Games are available when bored. If you are a TV addict like me? You will love the Fire TV Stick when there is nada on Cable that I am interested in at the moment. Can you say \"fun\" to peruse what is available on the stick? lol", "verified": true, "helpfulness": "0/0", "author": "Leo A. Wright"}]