[{"rating": 4.0, "review": "The fire stick performs just like it's competitors but only reason for the lack of 5 stars is the seach function on the home screen only searches amazon instant video and not the major apps like Roku does.", "verified": true, "helpfulness": "0/0", "author": "Dean Medlock"}, {"rating": 5.0, "review": "easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Veronica"}, {"rating": 5.0, "review": "Amazing It's so much better than chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Melissa Minor"}, {"rating": 5.0, "review": "I love it love it l", "verified": true, "helpfulness": "0/1", "author": "crystal s. henderson"}, {"rating": 3.0, "review": "The stick is not so great but good enough for its price. I have problems with buffering in the midst of watching a show or a movie and sometime problems with pixels. I have a high speed internet from Comcast and the Firestick is literally a couple of feet away from my router and I still have issues with this device. Youre better off buying a Neotv for $25.00 bucks! Plus the Firestick doesnt have VUDU which sucks too!", "verified": true, "helpfulness": "0/0", "author": "roy dela calzada"}, {"rating": 5.0, "review": "Easy to install and works great for streaming", "verified": true, "helpfulness": "0/0", "author": "Megan Prince"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV Stick when it came out the first time. I loved it so much and I am still now. The stream quality is good and I am able to get it running in a small amount of time. No hassle.Recently, I brought the stick during our vacation so my kids can still see their favorite cartoon shows. Surprisingly, it works great! I am able to connect to the hotel's wifi and get the channel that my kids wanted.I truly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Devote \"hw\""}, {"rating": 5.0, "review": "It's a very good streaming device, easy to setup and to use.", "verified": true, "helpfulness": "0/0", "author": "rafaelrsv"}, {"rating": 5.0, "review": "Received it earlier than expected, plugged it in and we were watching netflix within a few minutes. very satisfied and I would highly recommend this anyone.", "verified": true, "helpfulness": "0/0", "author": "Amanda Cross"}, {"rating": 5.0, "review": "Amazing product.", "verified": true, "helpfulness": "0/0", "author": "Jose Edenilson Ruiz"}]