[{"rating": 5.0, "review": "This things is freaking amazing! That is all anyone needs to know. All your subcriptions in one! amazon instant, netflix, HBO Go and HBO Now, youtube, and many more! If you do not have a tv that can do all that already then you need to get one!", "verified": true, "helpfulness": "0/0", "author": "Ronald Hoch"}, {"rating": 5.0, "review": "Great....", "verified": true, "helpfulness": "0/0", "author": "Ebonee"}, {"rating": 5.0, "review": "Works like a charm!  Unfortunately, our 2011 LG smart TV is not smart enough to keep up with the Amazon Prime app that Amazon now uses, so it was discontinued (I'm not sure whether LG or Amazon is at fault here, but it seems really chintzy that they would cut off a TV service like this, when a little software fix could have solved it).  So we had to purchase the Fire TV stick.  It's luckily very affordable and easy to install (with one exception--the two AAA batteries that power the Fire TV stick remote fit into the remote in the SAME direction (most batteries go in opposite + and - directions).  At first, I couldn't make the remote work and thought the batteries that came with it were dead.  When I took them out, I noticed that the + ends of the batteries were supposed to point the same way.  This should have been noted in the installation instructions, in my opinion.  As soon as I corrected the battery placement, everything worked perfectly, and we have enjoyed Amazon Prime very much.  I installed it in the extra HDMI input on my receiver which handles all the audio and video for the TV and used the included \"dongle\" to make the stick more visible to the remote's signal.  Listening to Pandora through the Fire TV Stick now on the surround sound for the TV now!", "verified": true, "helpfulness": "0/0", "author": "A. Matheny"}, {"rating": 4.0, "review": "It's OK, but a little disappointed that there is so much content that you have to pay for. Also, my TV provider is Dish, and they do not support almost none of the apps that are on the stick. Probably won't use it as much as I was hoping to.", "verified": true, "helpfulness": "0/0", "author": "Phillie"}, {"rating": 5.0, "review": "Highly recommend", "verified": true, "helpfulness": "0/1", "author": "Donald A."}, {"rating": 5.0, "review": "I love my fire TV Stick", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "Renaldo Pires"}, {"rating": 1.0, "review": "Nope.  Constantly loses connection, won't stream for more that a minute or so. Roku isn't having this problem, so I know it isn't the fault of my wifi.  So nope.  Not good.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Have not had time to explore all the fire stick has to offer but so far it is fantastic!! Especially for the Amazon prime customers!", "verified": true, "helpfulness": "0/1", "author": "Cheryl Roberts \"amz fan\""}, {"rating": 2.0, "review": "Now that I have had the fire stick for a couple months, I can give a true and honest review of this product.  I like the idea of the capabilities but the fire stick I have often malfunctions...jumps to a whole different application while viewing, remote jumps though selections randomly, skips during viewing.  I like it but feel mine either has problems or this product needs improvements.", "verified": true, "helpfulness": "0/0", "author": "Robin Moon"}]