[{"rating": 3.0, "review": "I have had this firestick now for about 6 months. It was recently updated and mentions that you can take it anywhere with you (hotel/vacation) (as long as you have wifi/internet, obviously) but thats not the case. I have been to NY city for a conference and didnt work in my hotel. I recently just got back from Vegas, stayed @ the bellagio and did not work. Keep in mind both hotels are high class with free wifi from hotel (just need to sign in with their passwrd) The amazon fire stick says its connected (4 bars/excellent) but when you try to view anything , it just tells you not connected and sign in to another network. I had to download a wifi app on my samsung android phone to be connected but that only lasts a couple minutes as well before it crashes. Very frustrating because i wanted to catch up on some game highlights so, Im just getting the word out in case you plan on using it elsewhere besides your home!! Be careful or be warned u mite have issues connecting when staying at a hotel.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "This is seriously one of the greatest thing Amazon has come out with!  So easy to use and tons of great movies and TV shows!  Price point is amazing!  The could have charged more and I still would have loved it!", "verified": true, "helpfulness": "0/0", "author": "Christina Knapp"}, {"rating": 5.0, "review": "i havent used it much... but its cool", "verified": true, "helpfulness": "0/0", "author": "Alonzo0412"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "You bet"}, {"rating": 5.0, "review": "Excellent device that's easy to install just plug it in and start watching any all the movies and shows that Amazon provides. This is excellent for other rooms of your home where you can enjoy the Fire Stick in one room while others can enjoy Amazon's Fire TV in another. It came at a great price too so everyone should have one of these.", "verified": true, "helpfulness": "0/0", "author": "Marcy"}, {"rating": 5.0, "review": "So far we have been very pleased with the Fire Stick. It's easy to use and simple to set up.", "verified": true, "helpfulness": "0/0", "author": "Lesluez"}, {"rating": 5.0, "review": "Very Very good", "verified": true, "helpfulness": "0/0", "author": "jorge"}, {"rating": 5.0, "review": "Wow! and the screen saver photos are wow!", "verified": true, "helpfulness": "0/0", "author": "Jordan P."}, {"rating": 5.0, "review": "very happy with purchase", "verified": true, "helpfulness": "0/0", "author": "David Anderson"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "David J Porter"}]