[{"rating": 5.0, "review": "Love it!!!  Easy to set up. And hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "KLR"}, {"rating": 5.0, "review": "Easiest set up ever! Doesn't interfere with my antenna. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lori Hiatt"}, {"rating": 5.0, "review": "Love!!!  I am able to observe what my children watch.  The convenience of prime is nice.  And renting from home is the best.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I heard great things about this product, my boyfriend has the fire tv box one & I really wish I would have purchased this instead of the Google chrome cast one.", "verified": false, "helpfulness": "0/0", "author": "Angelica"}, {"rating": 3.0, "review": "i was excited to recieve this in the mail today.  But, hooking it up was a disappointment.  If you have Comcast as your cable provider, neither the HBOGo app nor the Showtime Anywhere app will work.  Comcast is not supported as a cable provider.  I was looking forward to using this to watch HBO, Showtime, Netflix and Amazon Prime movies.  Having only 50% of my expectations met has me wondering if I should just return this.7/22/15 - I learned today that Comcast has reached an agreement with Amazon about supporting the Fire Stick.  I'm going to try this tonight and if it works, I will be a happy camper.7/23/15 - Well, Starz, HBO and Showtime are now available, but History, A&E;, etc. are still not.  So, my review stands as is.", "verified": true, "helpfulness": "0/0", "author": "Jon V. \"Jon Vogel\""}, {"rating": 1.0, "review": "Really disappointed about the stick, slow, reduced in apps...", "verified": true, "helpfulness": "0/1", "author": "DAVID"}, {"rating": 5.0, "review": "I enjoy useing my new fire stick it's fast and easy to use will tell friends and family about it", "verified": true, "helpfulness": "0/0", "author": "Johnny Wright"}, {"rating": 5.0, "review": "it is one of the best product that i have ever bought it is better then the roku stick chomecast", "verified": true, "helpfulness": "0/0", "author": "Jonathan England"}, {"rating": 4.0, "review": "I finally got HBOGo to work as well as Hulu Plus. It works well", "verified": true, "helpfulness": "0/0", "author": "crayfishkc"}, {"rating": 5.0, "review": "Great value for the money.  One of the better products for home viewing on the market.", "verified": true, "helpfulness": "0/0", "author": "Beverly McDonald"}]