[{"rating": 4.0, "review": "The  current digital age  has spoiled the millennial with streaming music, games and movies usually dedicated on expensive gaming consoles and smart tvs and tablets. Entering into the arena of a la cart entertainment is Amazon with it's plug and play Fire stick. Once you plug the device into your hdmi outlet, coupled with a WiFi connection, you are treated to a plethora of entertainment options for the whole family. Fromgames to movies, music and more, this is all built into thepowerful slick piece of tech at an affordable price. Favorites like Netflix, Hulu, Pandora , there is plenty of entertainment to be enjoy for the whole family. Highly Recommended.", "verified": true, "helpfulness": "0/0", "author": "michael haynes"}, {"rating": 5.0, "review": "easy to setup and works great", "verified": true, "helpfulness": "0/0", "author": "david m. verducci"}, {"rating": 5.0, "review": "I bought this for my daughter and she loves it! She can now watch netflix and Downton Abby when she misses the broadcast.", "verified": true, "helpfulness": "0/0", "author": "TRoss"}, {"rating": 4.0, "review": "This would get 5 stars from me if the movie search included a release date - that would make it so much easier to find a golden oldie or a newer release.", "verified": true, "helpfulness": "0/0", "author": "steven t. villella"}, {"rating": 5.0, "review": "Firestick has made a smart TV out of my \"Plain Jane\" model. It was simple to install, very easy to use once I learned to change input sources on my set, and it opened up an entire world of commercial-free programming that met my specific viewing criteria; easily one of the best entertainment investments I've ever made.", "verified": true, "helpfulness": "0/0", "author": "Ray Dunn"}, {"rating": 3.0, "review": "idk what it is but sometimes im using this for netflix and it will just randomly close the app and i have to completly go back in and find my show all over again and fast forward to my place and it wont save the episode. idk if its thats its getting over heated or what but it bothers me every time it does it which lately has been happening a lot. im in summer so im using it a LOT more frequently like 12-18 hours a day but still.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very fast. Beats the Apple TV by miles!", "verified": true, "helpfulness": "0/0", "author": "W. PERKINS"}, {"rating": 5.0, "review": "I really enjoy I don't even watch my cable anymore just the news the set was very easy I hooked it to my TV and surround sound its like I'm at the movies all day every time I'm in a conversation with someone I tell about the fire TV stick and how they really need to get one.", "verified": true, "helpfulness": "1/1", "author": "Michele Lee"}, {"rating": 3.0, "review": "I'd love this thing if it would stay connected to the Internet. It has waaaay too many connection issues. But when it does work, I'm in love with it 👌!", "verified": true, "helpfulness": "0/1", "author": "Neysha"}, {"rating": 5.0, "review": "I absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]