[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Julie A"}, {"rating": 4.0, "review": "I have a question about item, my television only has one HDMI input, and a USB input what type of adapter would you recommend ??Please reply at your earliest convenience to senahrndz31@icloud.com.Thank you", "verified": true, "helpfulness": "0/0", "author": "senahrndz33 \"Serena Hernandez\""}, {"rating": 1.0, "review": "Horrible connection. I have this closer to my router then my smart TV and the smart TV picks up way better.", "verified": true, "helpfulness": "0/0", "author": "K Blank"}, {"rating": 5.0, "review": "It is amazing, love it so much more than chrom.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Witherspoon"}, {"rating": 5.0, "review": "Love it. Very easy to install and easy to use with remote. Had used chromecast before this but it was quite a process to set up and had to go through my IPad. I was able to set up the fire stick directly from my TV in a few minutes. Amazon prime has a larger selection of movies and shows to watch. I am very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "tere"}, {"rating": 3.0, "review": "This works well unless you have a TV that's older than a few years old. If so you won't be able to use it due to HDCP regulations. You just see a blue screen.  Google fire stick blue screen for more info.If you have a tv that's older like ours you'll need this in addition:http://www.amazon.com/gp/product/B004F9LVXC/ref=oh_aui_detailpage_o00_s00?ie=UTF8&psc;=1This will bypass the HDCP stuff.  Why Amazon doesn't disclaim this is beyond me. I just hope I can save someone else the time and headache.", "verified": true, "helpfulness": "0/0", "author": "Dave Shocker \"shock\""}, {"rating": 5.0, "review": "Works great. Works great with Netflix's", "verified": true, "helpfulness": "0/0", "author": "kevin slunecka"}, {"rating": 5.0, "review": "I really, really like.  So much better than trying to stream over a Wii or XBox.", "verified": true, "helpfulness": "0/0", "author": "Bull Sheriff"}, {"rating": 5.0, "review": "I received mine earlier today and I'm addicted.I don't understand why there are so many 1 star reviews.  This is so easy to set up and use.  Now I want to be the whole day watching tv.  Thanks Amazon for this amazing product!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Santiago"}, {"rating": 2.0, "review": "Can it be use on any tv", "verified": false, "helpfulness": "0/1", "author": "Christina Cooper"}]