[{"rating": 5.0, "review": "Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "William D Dominguez"}, {"rating": 5.0, "review": "Great product at a great price.  This item has become a household favorite.", "verified": true, "helpfulness": "0/0", "author": "Bkayzfinest \"You can't handle the truth...\""}, {"rating": 4.0, "review": "Works very well but needs more content and editable content. It would be nice to hide or get rid of the content that you just will not use an a regular basis (monthly at most)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Everything appears to work fine. Setup and installation was easy and straightforward. The only thing that needs improvement is the user interface. It could use a little tweaking. Main interface is a little busy and not having a permanent position for app placement is a huge miss. Other than that, it works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Bryant Robinson"}, {"rating": 5.0, "review": "LOVE IT  I have one on both family room and bedroom TV,  Now what  I watch is always my choice!!\\Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Mutante2182"}, {"rating": 2.0, "review": "screen sharing is week for any sort of real business or general apps on an android device.  It starts and stops or is not supported.  Returned the product for now.", "verified": true, "helpfulness": "0/0", "author": "d funk"}, {"rating": 5.0, "review": "Love it.  I have 2 and am ordering another one!", "verified": true, "helpfulness": "0/0", "author": "Mary White"}, {"rating": 2.0, "review": "I wanted to like it so much because I love Amazon but I had to return it for a Roku. I have Comcast and a lot of the apps on there don't work with Comcast on the fire stick. So I got an amazing device that looked dope but I couldn't use a lot of the apps. Amazon disappointed me for the first time ever", "verified": true, "helpfulness": "0/0", "author": "Edwin Sevilla"}, {"rating": 3.0, "review": "It's a great device just a lot of network issues fail on Netflix", "verified": true, "helpfulness": "0/0", "author": "shaprea ziegler"}]