[{"rating": 1.0, "review": "VERY DISAPPOINTED, YOUR WORKERS TRY BUT DIDN'T MAKE IT WORK FOR ME, WAS NEVER ABLE TO PICK AUDIO FROM ANY MOVIE????????  SO I RETURNED IT TO BEST BUY.", "verified": true, "helpfulness": "1/1", "author": "tony rodriguez"}, {"rating": 2.0, "review": "In summer, this thing gots hot and starts flicking green screen 5 mins into streaming.  Can't watch anything until unplug/cool down.", "verified": true, "helpfulness": "1/1", "author": "Yi-Chen Li"}, {"rating": 5.0, "review": "awesome WHAT CAN I SAY that hasn't been said yet", "verified": true, "helpfulness": "0/0", "author": "Hannibal Hector \"Just be nice.........\""}, {"rating": 5.0, "review": "This device transformed my bedroom TV into an entertainment center. I didn't realize the selection Amazon Prime Instant Video had until I got it. I have the student discount so I only have to pay ~$50 and it's well worth it. I can watch shows on multiple devices and thanks to this, I get to watch my favorite shows/movies as I fall asleep. I rarely have buffer issues.If you want to play game apps I recommend the FireTV and not the stick. If you only plan on streaming videos, this is an amazing device.", "verified": true, "helpfulness": "0/0", "author": "Doctor Feel Good"}, {"rating": 5.0, "review": "One of the best things I ever purchased from amazon.", "verified": true, "helpfulness": "0/0", "author": "Vishwanath"}, {"rating": 3.0, "review": "I like the stick, but Amazon's email to me asking to rate it said \"how did this item meet your expectations?\" and it didn't.  I am going to return it.  Here's why:  I use a Yamaha YSP-1000 sound projector on my 65\" TV and there's a problem:  the stick only used the TV's speakers and doesn't take over the Yamaha sound projector like my DVD player and Cable Box do.  So watching movies through The Fire TV stick has pretty crappy sound.  I talked to the service people at Amazon and there's no fix.  They apologized.  About the only thing I can do is by the Fire BOX for $99 instead and get an optical cable and plug the box into the sound projector, and they didn't promise that would work either.  The box has provisions for an optical cable and so does the Yamaha YSP-1000.  So that's my next step.  For the Amazon engineers that might read this: it's a programming step in the stick!  An easy fix if you'll do it.  My other devices look for add ons and tap into them, yours doesn't!  Disappointed that my three year old DVD player can do this correctly and your brand new stick cannot.", "verified": true, "helpfulness": "0/0", "author": "Gregg"}, {"rating": 2.0, "review": "Roku's laid out so much better.", "verified": true, "helpfulness": "0/1", "author": "Miss Pita"}, {"rating": 2.0, "review": "My screen goes dark for many seconds at s time whenever I switch to the HDMI input with the fire stick in it. For every hour I try to watch I have about 10 minutes of black screen. No matter what TV I use. I hate the whole return and exchange process so I'm dealing with it but I feel like I wasted 40 bux", "verified": true, "helpfulness": "0/0", "author": "Russ"}, {"rating": 5.0, "review": "Easy to install and easy to use.  I just didn't realize that not all movies are free.", "verified": true, "helpfulness": "0/0", "author": "Barbara \"metromomma\""}, {"rating": 3.0, "review": "Product does not work as seamless as my Apple TV. Had quite a few issues when trying to connect to my Samsung Smart TV but worked great with my Insignia TV. Daughter also tested inside her wooden armiore (she has an 2006 Insignia TV as well) and had troubles with reception whereas Apple TV didn't. I need to clear the cache every day for HULU otherwise it seems to slow slow down or lockup. My understanding is it has to do with the way HULU streams their content. For the price you are paying the Fire Stick is well worth the cost. If you want a more dependable product, you might want to upgrade to their Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Binkiekittie"}]