[{"rating": 4.0, "review": "The equipment and user interface are all decent but could use a little improvement.  Overall this is a great tool for accessing general and Prim Amazon content.  The few minor gripes below are far outweighed by all the cool things you can do with this Fire TV Stick.Equipment: It was disappointing that the Fire TV Stick cannot be powered by an available USB port on my television rather it has to be plugged in.  After attempting to power it via USB the unit kept restarting until it was plugged into a 120v outlet, and with enough other \"stuff\" already plugged in it was a bit of drag.  The remote is a bit flimsy and feels like it is not going to last as long as the Stick itself, but there is an option to download the app for your smartphone and use it as the remote.  Other than that, there is a very well thought out HDMI dongle/extension included in case your television has a limited nook or crannie where the HDMI ports are.  In general the equipment is decent, just a little odd.Interface:  The interface is a bit goofy from a navigation aspect and there is no way to turn this thing off without unplugging.  See the equipment comment about power above for discussion of the hard power requirement.  The navigation is a bit linear without easy ways to navigate through watch lists or music playlists without scrolling thru the entire thing.  If you have long watch or play lists hopefully you also have some patience.  There is also a tendency for the scrolling feature from the remote to skip through 4 menu items up or down with a single click, which can give you a Wheel of Fortune type feeling when trying land on a specific menu item.  Generally the goofy interface and other navigation issues are minor compared to the benefits.  At least there is direct interface to this device unlike the Google competitor (which I love and use regularly as well).", "verified": true, "helpfulness": "0/0", "author": "Esteban"}, {"rating": 2.0, "review": "It's only getting two stars from me for two reasons:I don't really like the graphic user interface. It really needs some improvement. its just too clutter with all its movies and apps. It be better if there was a feature where I could control what's display on the home screen.I'm also only give it two stars for the fact when you first get this you're suppose to get 30 days free of Amazon Prime. Well when I accept the 30 days free, Amazon actually end up charging me a year of service on my credit card without my permission. I end up getting this resolve though through customer service.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 5.0, "review": "I just started using my fire stick and I love it, it was very easy to set up and I would and have recommend it to a lot of people already. ...by by cable", "verified": true, "helpfulness": "0/0", "author": "claudene"}, {"rating": 5.0, "review": "Other than the fact that my productiveness has been significantly diminished, I have nothing bad to say about this gizmo.", "verified": true, "helpfulness": "0/0", "author": "Joel Meister"}, {"rating": 5.0, "review": "I love my Fire Stick.  I am just figuring out all of the things that it can do; however, up to this point we are totally happy with it!", "verified": true, "helpfulness": "0/0", "author": "Brian S. Brown"}, {"rating": 5.0, "review": "Perfect for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Jesse Liebig"}, {"rating": 1.0, "review": "No different then Nex-flix. Can't see 200,000 movies as advertised on your TV. You have to get on computer and spend hours going through old movies then transfer them to your TV watch list. Not worth the yearly $99.00 fee. Plan on returning it to store.", "verified": true, "helpfulness": "0/0", "author": "George Cameron"}, {"rating": 3.0, "review": "It has a nice interface and I had high hope. But when we are watching Netflix we keep getting hiccups, little pauses periodically. Not unusable but still worse than my Blu Ray player Netflix app. Disappointing.", "verified": true, "helpfulness": "0/0", "author": "Jane Doe"}, {"rating": 3.0, "review": "I expected more free movies and shows being a Prime member.  They should also tell you that you need to have a paid subscription to Netflix to use it.", "verified": true, "helpfulness": "0/0", "author": "Kirsten"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]