[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Bonnie M."}, {"rating": 5.0, "review": "Absolutely LOVE this thing.  Set up was a breeze and it made my \"not smart\" TV into a Smart TV with an easy to use interface, great speed, clear picture, and the convenience of being able to control things from either the included remote, or my smartphone app.  I really regret recently spending the extra bucks for a Smart TV in the other room.  I could have saved $100 on the TV and just bought an extra Fire TV Stick.  Am already thinking about buying another for the dumb TV in front of the treadmill.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 2.0, "review": "Dont bother if your internet is shoddy. Nothing but lag.", "verified": true, "helpfulness": "0/0", "author": "Carol Martin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tasha Clay \"True Essence\""}, {"rating": 5.0, "review": "Love it! Hardly ever watch regular cable anymore!", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 2.0, "review": "The items that can be watched free are mostly ones that you wouldn't want to watch anyway.  To watch something that is recent costs extra money.", "verified": true, "helpfulness": "0/0", "author": "Ed Hart"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Karen Slanicka"}, {"rating": 3.0, "review": "Loses WiFi signal more than expected.", "verified": true, "helpfulness": "0/0", "author": "Darla M."}, {"rating": 1.0, "review": "Can't download/Install Netflix.Navigated the built-in help for support, and \"Unable to connect you to a service specialist. Please check the number or try again later.\" pops up on my screen (and yes, that is the correct number that \"Where can we call you?\" displays.This is crapware. Sending it back for a refund, and going to the Apple store to buy the new Apple TV. At least they answer the phone, or call you right back, if you don't feel like getting off the couch to walk over to the actual store to speak to a human being face to face.I'm a big fan of Amazon and a Prime member, but this is sorely disappointing. SMH in disgust.Don't believe me? Search Amazon for the Netflix forum and read on.", "verified": true, "helpfulness": "0/1", "author": "Balisani"}, {"rating": 1.0, "review": "It simply doesn't work!! The constant loss of connection is more than I can bear!", "verified": true, "helpfulness": "1/1", "author": "gabnb"}]