[{"rating": 3.0, "review": "Overall it works well, especially for the price.  But I am knocking off two stars until Amazon supports Mira-cast fully (as it advertises it does).  Mira-Cast works form my Android devices, but it doesn't support Windows 8.  True Mira-cast is not platform specific.  It should work across any devices that claim to be certified.  Google it for more information.  Amazon, please fix this!", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 4.0, "review": "Works good and it is fast when moving thru the menus.", "verified": true, "helpfulness": "0/0", "author": "Moby"}, {"rating": 5.0, "review": "The Fire Stick is even more than I expected. We love it. Have been amazed at how well it ties in with my Kindle and Fire Phone. Very easy to move from one TV to another, we even took it to the beach with us. Only problem we experienced was with our large TV which is attached to a speaker system and a cable box. It took us a while to figure out that you should only have the TV turned on and not the total system or you will not get sound.We could not be more pleased", "verified": true, "helpfulness": "0/0", "author": "Gin"}, {"rating": 1.0, "review": "NETFLIX DOESN'T WORK ANY MORE WITH THE NEW SOFTWARE! Plus the selection of movies on Prime is terrible!", "verified": true, "helpfulness": "0/0", "author": "Lucy's Mom"}, {"rating": 5.0, "review": "I absolutely love this! My kids enjoy this better than the roku.....it takes a little while to get use to the interface and layout use because it's different than the roku. I love that you can watch prime tv shows....this device offers so much more than any other ones! I just recently purchased the voice remote and works great with the fire stick! And I love the size of the remote compared to the one that comes with the fire stick! I definitely recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Amy Gevens"}, {"rating": 4.0, "review": "The fire stick works great my only suggestion is to make a section on the home screen that has all tv channels like discovery and national geo", "verified": true, "helpfulness": "0/0", "author": "Jason brown"}, {"rating": 5.0, "review": "Easy to set up, remote very handy.", "verified": true, "helpfulness": "0/0", "author": "Joyce Ornelas"}, {"rating": 5.0, "review": "My wife immediately migrated to the more user-friendly user interface of Fire TV over our old stand-by media streamer, a PS3.  I like not only the layout of menus and speedy ease of navigation, but also am impressed with the apparent ability of the stick to stream higher quality video over my wireless network. To do it justice, I now need to upgrade my older Netgear router to take full advantage of the Fire Stick's capabilities. What's a tech nerd to do? Such a first world problem.Set up was simple. It may be overkill, but I use MAC filtering on my network and found the Fire Stick's MAC address under Settings > System > About. Such a configuration is by no means necessary, so don't worry if that \"MAC filtering\" is Greek to you. Though the stick itself plugs into a USB port on your TV, be advised that the Fire Stick will not work properly using power from a USB port. You WILL need to give this device AC power from an outlet with the hardware provided. But really, what's another wire in my rat's nest anyway?Now I'm tempted to get the super-duper voice remote to go with...", "verified": true, "helpfulness": "0/0", "author": "Red Insight"}, {"rating": 5.0, "review": "I am a prime member, so I get  my money's worth and more. This device is great, much faster than my older ROKU. A fine way to \"cut the cable\". (Don't forget to keep your internet, though.)Update: Had a problem with the Fire keeping up with a movie rented from Amazon, it kept stopping to spool up. I had said nothing to amazon yet, but they keep a virtual eye on these things, apparently.I received an email from them stating that they noticed the glitch, and REFUNDED MY $$ for the rental! They did make a point that Refunding of Rented Video is not something they normally do, and i think it is not likely to happen again anytime soon, but still, great service.They went on to tell me how to clean off the 'Stick's apps and info, to get it rebooted, so to speak. I haven't done it yet, but will today. (LINK PROVIDED BELOW)I have never had service like this from any other streaming service. I did have the problem, but Amazon cared that I had it, and they made it right.Although I have a full (FIOS 50/50) Wireless signal within 24 inches of the FireStick, and nothing else taking bandwidth (so it was not my equipment or my signal) I know that setup of equipment sometimes loads up memory with junk. Cleaning it up just might do the trick.Here's a copy of the \"troubleshooting\" link for ways you can \"potentially improve your viewing experience\":You can copy and paste it in a browser.http://www.amazon.com/gp/help/customer/display.html?nodeId=201431300", "verified": true, "helpfulness": "0/0", "author": "greyman"}, {"rating": 2.0, "review": "This thing has some serious issues. The connection to my wifi consistently fails, while all my other devices work great. It has some serious loading issues when it is connected. The stick get extremely warm. Outside of Prime and Crackle it lacks any other decent video support. The History and AE apps dont offer anything to get excited about.", "verified": true, "helpfulness": "0/0", "author": "bradick Herring"}]