[{"rating": 2.0, "review": "This device CONSTANTLY loses the network connection and once it does there is absolutely no way, short of unplugging it and plugging it back in to reload the home page. Even when the network shows as CONNECTED with a strong signal, it will NOT reload the home page. The fire stick has a lot of good features but this horribly annoying trait has made me very reluctant to move on to the Fire TV. This is just bad design, plain and simple.", "verified": true, "helpfulness": "0/0", "author": "Janice Jarrell \"Jan\""}, {"rating": 5.0, "review": "Between Prime Movies and Netflix, I am in heaven!! LOL  Fire Stick is definitely better then Chrome!!", "verified": true, "helpfulness": "0/0", "author": "J. Swan"}, {"rating": 3.0, "review": "smart phone(s) mirroring does not work as it is mentioned.smart phone(s) work as a remote control.most of the apps there needs to apply for a service.most of the movies are old movies", "verified": true, "helpfulness": "0/0", "author": "Nagi Soliman"}, {"rating": 5.0, "review": "I never realized how easy it is to catch up on former TV series and older movies I missed.  Even though the programs have run their course, with Prime, and the Fire TV Stick, I am enjoying content without all the commercials.", "verified": true, "helpfulness": "0/0", "author": "olblu92 \"olblu92\""}, {"rating": 2.0, "review": "Didn't know the Fire Stick would mainly be set to use Amazon programs. I do watch Amazon programs, but I also like PBS, Acorn TV and many others. You have to hunt a lot to find those other channels. I got the Fire Stick to replace a Roku.After fighting too hard with the Fire Stick I bought another Roku. Sorry, Amazon. You are still my my favorite site for shopping.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 4.0, "review": "Works...", "verified": true, "helpfulness": "0/0", "author": "Neil T."}, {"rating": 5.0, "review": "I love this thing! It takes up no space and charges directly from the USB port on my TV. Worth every penny. The only thing I wish would be added to the apps is Starz and Epic.", "verified": true, "helpfulness": "0/0", "author": "Laurie Tannehill"}, {"rating": 3.0, "review": "Glad I picked up the  stick. Easy to install, setup and  use.", "verified": true, "helpfulness": "0/0", "author": "Chiefdnd"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Matt M."}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "John F. deVeaux"}]