[{"rating": 5.0, "review": "I got this for Christmas and I love it. So easy to set up and within minutes it was connected and ready to use.", "verified": true, "helpfulness": "0/0", "author": "M. Kelley"}, {"rating": 2.0, "review": "If you don't know computer  it is very hard to get started but worth it.", "verified": true, "helpfulness": "0/1", "author": "Anna Clay"}, {"rating": 5.0, "review": "I love my fire stick! It's everything I hoped it would be.", "verified": true, "helpfulness": "0/0", "author": "no one \"nine\""}, {"rating": 5.0, "review": "All I can say is GREAT! And I am so glad I brought this with the gift cert a friend gave me...do not care fire the app, doesn't work as well as the remote", "verified": true, "helpfulness": "0/1", "author": "crb"}, {"rating": 5.0, "review": "This was so amazing. I have now purchased three of them and recommended it for others for gift giving.  So easy to set up. So many options for viewing, especially being a prime member.", "verified": true, "helpfulness": "0/0", "author": "Michelle Sweet"}, {"rating": 1.0, "review": "Sorry Amazon, I returned it for a Chromecast. With out spending more money for the apps, It just couldn't do what the Chromecast does. The remote was nice but thats it The Chromecast still rocks it.", "verified": true, "helpfulness": "1/3", "author": "Tracy S Johnson"}, {"rating": 5.0, "review": "So far I love it! Super simple installation and very intuitive operation. 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have not had a chance to use my Fire Stick yet, but installing it was easy, even for a non-techy like me!", "verified": true, "helpfulness": "0/0", "author": "Arleen Mc Cartney"}, {"rating": 5.0, "review": "Sling player on the big screen and free ESPN... that's all you need to know.", "verified": true, "helpfulness": "0/1", "author": "Nick Raab"}, {"rating": 2.0, "review": "The forward/backward control is difficult to use with desired precision and it seems to buffer to much", "verified": true, "helpfulness": "0/0", "author": "Mark W."}]