[{"rating": 5.0, "review": "love this device. I had a roku so glad i got the fire stick the download is so much faster.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Meza"}, {"rating": 2.0, "review": "Works great. Easy setup. I didn't have any issues like other reviewers described when connecting to my WiFi and my amazon account.Pros:Easy setupPicture looks great.Easy to useWorks great but I do have some issues with it.Cons:The video at t he beginning when setting up you can't skip. There should be a skip button. Why force people to watch it for those who have the Fire TV.Why is the remote not as good as the Fire TV one???This remote sticks and works when it wants to. It also doesn't have a voice search button. Which is one of the factors I like about the other remote.The is this popping noise when watching or listening to the Stick. Whatever it is someone needs to fix it. It is annoying.Things I'm indifferent about:Having to plug it in. No big deal...I do like the extender could be longer though...Amazon fix these things and I'd give you 5 stars and recommend it to other.I do prefer the Fire TV.", "verified": true, "helpfulness": "2/3", "author": "I.D. Madrigal"}, {"rating": 4.0, "review": "Works well.  Easy set up. The only drawback is I vougt it to travel and to watch movies.  But outside of North America it will not work and we travel a fair amount. It will not work in Australia so far.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey C. Zorn"}, {"rating": 3.0, "review": "great for content, have to use remote though. App crashes,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dave Mac\""}, {"rating": 4.0, "review": "It's fun and I like the portability but it has limitations. For example, the YouTube app doesn't allow streaming of live events. But it's easy for the kids to navigate and the price was right for what it offers.", "verified": true, "helpfulness": "0/0", "author": "Stephanie \"edenza\""}, {"rating": 1.0, "review": "Not happy with this. It is making the sound on my TV sound like chipmunks. Can't even use it. Very upset. It also is disconnecting my internet connection whenever I try to use it. Will probably just buy a TV that has Netflix and Amazon Prime Instant video.", "verified": true, "helpfulness": "5/6", "author": "andrea"}, {"rating": 5.0, "review": "I won't go through each of the technical details like everyone else has.  We happen to love it! Simple, easy to use - makes a great gift! Low profile and small, but simple remote.  Have your own Amazon library right at your fingertips! Love it more than the Roku!", "verified": true, "helpfulness": "0/0", "author": "Sl Judge \"gatormomz\""}, {"rating": 5.0, "review": "Love it so far, seems just as good as my Fire TV's just cheaper and I don't mind leaving it in my patio TV. XBMC on my patio, I'm very happy!", "verified": true, "helpfulness": "0/0", "author": "MxChris"}, {"rating": 1.0, "review": "Piece of s*** won't let you skip the intro video. I threw it on the ground.", "verified": true, "helpfulness": "3/5", "author": "ziddey"}, {"rating": 5.0, "review": "Works great. Easy setup.  I plugged into into the HDMI input of my receiver.  Have streamed Amazon, Netflix & YouTube, with very nice picture.", "verified": true, "helpfulness": "0/0", "author": "Tim Trippel"}]