[{"rating": 5.0, "review": "Love it! I have had no issues connecting to the Internet. Ordering one for my mom today.", "verified": true, "helpfulness": "0/0", "author": "d.stor"}, {"rating": 3.0, "review": "The firesick is awesome.  It works better than roku .... However, I bought this extra one as a gift, and gave it to a friend.All my personal Amazon information had been loaded onto the packaged fire tv stick.  I was shocked to find this out from my friend that I gave it to.  BE CAREFUL", "verified": true, "helpfulness": "0/0", "author": "J. Sutherland \"giftbuyer\""}, {"rating": 3.0, "review": "My problem is not the fault of the Fire stick; it's the crappy modem/router from Comcast that I'm forced to use.  That makes it impossible to truly appreciate the product or write a comprehensive review.", "verified": true, "helpfulness": "0/0", "author": "margretmh"}, {"rating": 3.0, "review": "Quality goes in an out.  Might have to do with the Internet speed however I have cable which is pretty fast", "verified": true, "helpfulness": "0/0", "author": "Scott Curry"}, {"rating": 5.0, "review": "Arrived quickly, installed instantly, unlike the the chromestick I returned, this actually works and works extremely well.", "verified": true, "helpfulness": "0/0", "author": "Poppy"}, {"rating": 5.0, "review": "We use this for back patio tv and it works great.  So nice to be able to sit out on the patio and watch Netflix and Amazon Prime Movies/TV without the hastle of cable or satelite hookup.  Buy one!", "verified": true, "helpfulness": "0/0", "author": "Kristy B"}, {"rating": 5.0, "review": "I am happy with this product thank you", "verified": true, "helpfulness": "0/0", "author": "ANGELO MORALES"}, {"rating": 5.0, "review": "So far, I am really thrilled with it.  Wish there were more classic films, but overall, we are very excited about it.", "verified": true, "helpfulness": "0/0", "author": "Genny Sailsbury"}, {"rating": 5.0, "review": "So easy even a 72 year old like me can figure it out. Now I can take my Netflix (and a bunch of other neat stuff) with me wherever I go!", "verified": true, "helpfulness": "0/0", "author": "Donald A. Smith, Jr."}, {"rating": 2.0, "review": "I decided to try this because I basically got it for free. I have 2 Roku streaming sticks and wanted to see how the Fire TV Stick compared. Overall it is a disappointment. The interface is clumsy and it is slow. One of my wife's and my biggest gripes is that to activate and deactivate the parental control, you must log in to you Amazon account via computer to enable and disable. This is absurd. The power/USB cable plugs into the side rather than the back end which gets in the way of plugging it into some TVs. Amazon provides a 3 inch HDMI adapter for such instances, but why not just design it properly in the first place. overall, I would not by one of these. You are better off with a Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mark I."}]