[{"rating": 5.0, "review": "Love it! Even came sooner than I expected .", "verified": true, "helpfulness": "0/0", "author": "Laura Skelton"}, {"rating": 4.0, "review": "The device itself is easy to use and performs as described.  It's very easy to access Amazon Prime programming.  The missing 5th star relates to the documentation for remote and for customer service.  Setup itself was simple.  But I had to access you tube video to figure out how to open the battery door to the remote.  In trying to complete the set up online, I needed to contact customer service to figure out how to navigate using the remote.  The answer was simple and was explained in the online video that FOLLOWED the set up requiring navigation.  Better documentation for these two issues packed with device and/or in help section online would have prevented substantial frustration.  And for heaven sake, please hire customer service reps who speak English!  Woman i spoke to was quite nice and she understood me.  But I had to ask her to repeat each comment 3-4 times before i could understand her.", "verified": true, "helpfulness": "0/0", "author": "Gail L."}, {"rating": 4.0, "review": "Simple installation and great picture quality.  We are hopeful that there will be more apps available as time goes by so we can get rid of our satellite espense.  Having more than one makes it easy to move from one room to the other and saving viwing history, while being able to resume what we were watching on the other tv.  We don't plan to purchase Prime as it looks like it can be expensive. First we'd have to buy the subscrription and then many of the films that we'd be interested in are not free and the rental rate is much higher than just going to Redbox.  Also, selecting from the Prime menu is requires that you open each one of interest to see the price unstead of just adding the films to your watchlist so even with a free month, we never watched anything on Prime.", "verified": true, "helpfulness": "0/0", "author": "Kindle lover"}, {"rating": 5.0, "review": "It works great. We are enjoying watching movies and TV shows on the big screen instead of on the Kindle Fire's small screen.", "verified": true, "helpfulness": "0/0", "author": "Diann"}, {"rating": 5.0, "review": "This is a great product! We can watch so many shows on this.", "verified": true, "helpfulness": "0/0", "author": "ACB \"AB\""}, {"rating": 2.0, "review": "it freezes every app other than amazon prime instant video.  This is so frustrating considering it boasts the fastest processor and streaming storage of all the streaming stick devices.  I have a Roku and Love it, but decided to go with Amazon for a second device considering who they are and the clout they will inevitably have in the market.  I would not recommend this product to anyone who wants to watch more than just Amazon Prime Instant Video.", "verified": true, "helpfulness": "0/0", "author": "JNA82"}, {"rating": 5.0, "review": "I am very impressed with the Fire Stick it's easy to set up. Now I can watch endless movies I will recommend any to get it it's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Margaret Jules"}, {"rating": 4.0, "review": "Had problems getting it to work at first. After a little research, disconnected the DVD player and worked like a charm. My only problem now is deciding what to watch!", "verified": true, "helpfulness": "0/0", "author": "Susan Helton"}, {"rating": 5.0, "review": "very pleased connection was easy and fast service excellent only negative is the image on screen its darker than it should be with no adjustment available", "verified": true, "helpfulness": "0/0", "author": "gary hampton"}, {"rating": 4.0, "review": "First off, the FS makes accessing Netflix and Prime much easier on my ' dumb'  TV than hooking up my laptop to the TV and finding somewhere I can sit it without obscuring the TV screen as I watch.  The streaming is almost flawless, unlike my laptop/TV set up.  At $39, it sure beats buying a new TV!The negatives--  with arthritis, it was almost impossible to open the remote.  After a search, I found several YouTube videos that helped, but I still had to wedge a narrow blade in to get the process started.  The other problem was unlocking my wireless.  I do not know about anyone else, but I have a passkey for the router, a password for my account, another password for Internet access on my computer...  It took me time and patiende to find the right one.  If you enter the wrong one, the screen tells you that and tells you to try again, which did not work.  What did work was turning the TV entirely off, then on again to try the next password/passkey.Definiteley worth the effort, as long as you are stubborn, like me.", "verified": true, "helpfulness": "0/0", "author": "Judith Campbell \"Mum-Z\""}]