[{"rating": 2.0, "review": "I thought it would do more, but it doesn't so I returned it. Its a chromecast by Amazon", "verified": true, "helpfulness": "0/0", "author": "AndyL"}, {"rating": 5.0, "review": "Exceeded my expectations. About 2/3 of Netflix movies are free.", "verified": true, "helpfulness": "1/2", "author": "Bernard Littman"}, {"rating": 4.0, "review": "Great device,a must have for your non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 3.0, "review": "works  could e  better", "verified": true, "helpfulness": "0/1", "author": "Cabelas \"stan the man\""}, {"rating": 4.0, "review": "Works well, have it plugged in my receiver and use it for Netflix and YouTube mainly.  The remote works even with a the cabinet closed.  At times I have noted the software to be a bit leggy and overlay the menu on the icons for the various apps. Just have to restart it otherwise you can not really see what you are doing.  One of the cheaper ways of making a non smart tv a smart tv.  For the price it is very good.  I own an Apple TV and although it can not compete with the Apple TV it has a better price to performance ratio.", "verified": true, "helpfulness": "0/0", "author": "KT"}, {"rating": 5.0, "review": "works great and is  the remote is very small fits nicely in my palm, great for amazing my grandkids", "verified": true, "helpfulness": "1/2", "author": "Me"}, {"rating": 4.0, "review": "It locks up and it has to be unplugged almost everyday-I do like they way it work just wish it was cheaper", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 4.0, "review": "PRetty awesome tool. For 40$ You really cant beat it. Wish it had a few more app choices but im overall happy with it. I may even get the Amazon Prime. Cant afford it but im really thrilled with the free trial so far. Again for 40$ you cant beat this streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 3.0, "review": "I really don't see the benefit, because most of the movies you will have to rent on the Stick, which will lead you to spending a lot of money before you realize it.  You might as well just rent it from Red Box for cheaper.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "All the fun of Amazon prime on a little stick", "verified": true, "helpfulness": "1/1", "author": "Phil M"}]