[{"rating": 5.0, "review": "Love this little gadget!!! Perfect for traveling!!", "verified": true, "helpfulness": "0/0", "author": "Alynn Terry"}, {"rating": 1.0, "review": "Not what i expected!!!", "verified": true, "helpfulness": "0/0", "author": "Jesus ledesma"}, {"rating": 4.0, "review": "These are excellent. We bought one to take with us when we travel since we have the fire tv boxes on our tvs. It has done everything you would expect with no performance issues. The one concern I have is that it does seem to get pretty warm. Other than that works great.", "verified": false, "helpfulness": "0/0", "author": "Emilie"}, {"rating": 1.0, "review": "worked the first day the I got an error message indicating that there was no internet connection even though my router was up and running and the device itself indicated I was connect and the signal was strong.  I tried to connect several times over the next couple of days but got the same result.  I guess I got scammed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV Stick is amazing!  We live in a rural area where they haven't yet upgraded our phone lines, so our internet connection is not the greatest.  We were streaming Amazon Prime, Hulu & Netflix through a Wii in one room and a Roku in the other.  Both would freeze up regularly.  The Fire TV stick streams so much better than either of those items, it has been a lifesaver.  I cannot recommend it enough!!!", "verified": true, "helpfulness": "0/0", "author": "CATX"}, {"rating": 5.0, "review": "This device is actually surprising for how good it is. With the addition of being able to use it for public Wi-Fi locations, it makes it flexible enough to use anywhere. With the addition of numerous applications that allow you to add functionality, it becomes greatly versatile. So glad that I got it! Recommend to anybody. Not the easiest interface to interact with but if you take your time it becomes more easily understood.", "verified": true, "helpfulness": "0/0", "author": "Will (Virginia) \"Chrissy\""}, {"rating": 5.0, "review": "Works as well as the box.", "verified": true, "helpfulness": "0/0", "author": "Ladycop 415"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing. Very fast and easy to use. Phone app works perfectly as a remote control. A must have with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Boiler98"}, {"rating": 4.0, "review": "As an owner of chromecast, roku and the fire stick I have used a lot of these kinds of devices. In general the Amazon fire stick works very well and is my current go to for my main TV. It does a very nice job presenting the whole Amazon video ecosystem, even putting all the free prime items together in one place, rather than doing some weak marketing attempt to force users to wade through paid content to get to the free - a very nice touch.  Two things I really like that are not obvious. First the parental controls are head and shoulders above other solutions. Part of the issue is that services like Netflix which have apps for fire stick have horrible approaches to this. So having them in decent form on the fire stick is really great, helping cover for inadequacy in the numerous apps I have loaded. The second thing I really like is the selection of apps is really much better than expected. In fact there is even one that turns the fire stick into an AirPlay compatible device, which if you are on ios is really great (think it was $.99 for that app though. Well worth it!)A couple nit picks I hope will get addressed through an update. The parental controls should be set up so that the parent can okay a show or an app use one time at a time, as well as an option to allow use for some time period. Right now it prompts you to just disable the setting, which means after a show you have to remember to go in and turn the setting back on. The other item is that I really wish they had the simple.tv app available for it, like it is on roku. Again, these are but picks because in so many ways the fire stick does everything else really well!Update - changing to 4 star because of the parental control not auto-engaging after allowing access to an app. What this has ended up meaning is that more often than not the parental controls get forgotten. There really needs to be options for: 1 time approval for that one app/show/etc., a time based approval (for next 1/2/4 hours), and then a permanent off option (which is basically what it is now). This should be integrated into the UI right at the point where the content is blocked.", "verified": true, "helpfulness": "0/0", "author": "D. Rosing"}]