[{"rating": 1.0, "review": "This device set up on my regular TV just fine but when I tried to set it up through my receiver it would not display a picture just sound. After reading other reviews I found out it is not working in this environment", "verified": true, "helpfulness": "8/10", "author": "Thomas A. Natale"}, {"rating": 5.0, "review": "great better than I expected  ...........Bypassed ROKU  picture quality on my smart Tv", "verified": true, "helpfulness": "0/0", "author": "K. Evilsizer \"little one\""}, {"rating": 5.0, "review": "Ridiculous value. This thing is awesome. Took over my old PS3 as the media player for the house. It loads fast, great video quality and I haven't seen it buffer or lag. Will update in a month or two.", "verified": true, "helpfulness": "0/0", "author": "Danny Garcia"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Tracie Markunas \"Raven\""}, {"rating": 5.0, "review": "Very fast, nice to not have any buffering. Easy to use interface. My only company is that I can't use second screen with my ipad, because it only works with kindle fire's.", "verified": true, "helpfulness": "0/0", "author": "Willyb05"}, {"rating": 5.0, "review": "Excellent little product that destroys Chromecast. Nuff said.", "verified": true, "helpfulness": "0/0", "author": "AR982"}, {"rating": 5.0, "review": "I love the Fire TV stick.  It is very low profile, easy to install, easy to use. Great buy!", "verified": true, "helpfulness": "0/0", "author": "RGM Amazon Customer"}, {"rating": 4.0, "review": "Working very nicely, the only drawback I can see so far is the lack of HBO GO which means you have to have another device to cover this.  Also, this is a great tool for AMAZON to keep you enrolled in Amazon Prime.  Price wise this was a very good purchase.  Also, being able to use my Note 2 as a remote is definitely a big plus.", "verified": true, "helpfulness": "0/0", "author": "Guy Hoyt"}, {"rating": 3.0, "review": "I do like the interface, however there seems to be some kind of buffering glitch, no matter what i am doing like watching Amazon Prime or HULU Plus or NETFLIX or listening to Pandora,  am experiencing constant hiccups. My ROKU XS does not do any of that. I like the variety and amount of gaming options there are, but there is no option to play offline. A little bit bigger remote with a QWERTY pad on the back would be greatly appreciated and keep all on screen text option in QWERTY fashion, which they are not. Overall, it's a little less than what i expected, just due to the buffering hiccup i am experiencing. Maybe an update will correct that in the future.", "verified": true, "helpfulness": "2/2", "author": "Tunny Bones"}, {"rating": 5.0, "review": "Whoa, blows chromecast out of the water. fast interface, good wifi and a REMOTEWay to go amazon.Like it as much as my roku,and a 1/3 of the price.", "verified": true, "helpfulness": "0/0", "author": "Brian Adler"}]