[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Leslie Lavin"}, {"rating": 4.0, "review": "I Love it.  Thank You", "verified": true, "helpfulness": "0/0", "author": "M. K. Koenig"}, {"rating": 2.0, "review": "Had the Fire Stick for 6 months and it just stopped working.  I did all the customary and instructed trouble shooting, including unplugging/plugging it in, unplugging/plugging router, etc.  I tried it on 2 different TVs and nothing.  Other mobile devices work on both TV's so that tells me it's the Fire Stick.  The period for return/refund is over and I can't find warranty information so sent email to Amazon. Will update this review if I hear back from them.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Pelletier"}, {"rating": 5.0, "review": "Easy to install, set up and use! I like that it has a remote control", "verified": true, "helpfulness": "0/0", "author": "ken_210"}, {"rating": 5.0, "review": "Love the firestick!", "verified": true, "helpfulness": "0/0", "author": "L. Gomez"}, {"rating": 4.0, "review": "It is doing as advertised.  Wish it had more programing on it at no extra cost.", "verified": true, "helpfulness": "0/0", "author": "helen phillips"}, {"rating": 5.0, "review": "It'sAwesome!", "verified": true, "helpfulness": "0/0", "author": "Alena Wheeler"}, {"rating": 5.0, "review": "Dear FireTV Stick,you are the best thing that happened to our family.  Combined with amazon Prime, this is a powerful device.  We have a chromecast and thought that was great, but with the Fire TV stick, we can do so much more.Since many reviews tell you about the product, I will share with you our traveling experiences.  We travel a lot and stay in many hotels.  Most hotels require you to go through an authentication process with their password when signing into their internet service.  With the FireTV stick, you select the wifi network to connect to and then if authentication is required, a page pops up asking you to sign in.  You sign in using an alphanumeric keyboard on-screen then hit the back button to return to the previous screen.  After a moment you are connected and your settings are just as you've left them before.The only frustrating part is that hotels often make you re-enable wifi every day, so you will be repeating this process often.  We haven't had success with our chromecast while traveling and this feature sets the FireTV stick apart for sure!  We can watch all of our shows on the hotel TV while away.The hotel room needs a TV with an HDMI port (there are some hotels who are still using old tube TV's- it doesn't work on them) Most hotels have this but some smaller hotels (usually in the middle of nowhere) don't have them.  For those visits, we just use our laptops.Don't forget to take it with you!  I have a reusable snack bag I keep it in and keep my car keys in them so I don't forget to take the FireTV stick with me.Ok, now about the product itself...Pros:It keeps the memory- we don't have to keep entering the WIFI code over and over againwe used it at a hotel and it was easy to connect- even through their verification interfacethere is a remote that doesn't have to be pointed directly at the TVYou can view prime only selections if you don't want to purchase itemsResets itself when there is an issueAutomatically connected to my amazon account out of the box (note- see below)Keeps a recently viewed tab to pick up on series that you left off on.stays connected longer than my chromecast doesVisually appealingCOnnects way better than our Chromecast in rooms that are pretty far from the router.Cons:Designed to be used with Prime- if you don't have a prime account, you can still use apps though.I wanted to cancel my prime membership this year (I don't care about free shipping because my orders are always over $35) but now  I think I'll keep it.Haven't figured out how to screencast.My son doesn't watch television so he doesn't know what commercials are.  He gets frustrated when we watch TV and there are commercials.  I blame you, Fire TV stick.Other Notes:I have some glitches but its often due to my own internet connection.I haven't used any of the games so I can't comment on those.", "verified": true, "helpfulness": "0/0", "author": "Questionmyworld"}, {"rating": 5.0, "review": "Enjoy it so much I purchased two. So I can take one with me while traveling", "verified": true, "helpfulness": "0/0", "author": "PSmith Ynot"}, {"rating": 4.0, "review": "Amazon show seem to stream pretty gods, but Netflix and Hulu constantly y freeze up.", "verified": true, "helpfulness": "0/0", "author": "Annie C"}]