[{"rating": 3.0, "review": "It was vary nice and quick the only thing I would like to be able to marrow from my Pendleton it the wee network.", "verified": true, "helpfulness": "0/2", "author": "bertrandjohnson"}, {"rating": 5.0, "review": "Great technology works great", "verified": true, "helpfulness": "0/0", "author": "Dougie"}, {"rating": 5.0, "review": "The stick is great!! So easy to use .Great options Very happy with another great Amazon product!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeanne"}, {"rating": 5.0, "review": "It is easy to use and aesthetically pleasing. I am enjoying using the many features it includes, like the child protection password for movie purchases. I prefer using the Fire TV stick over my blu-ray player even though they both have similar features (Netflix, games). I find the Fire TV stick more accessible.", "verified": true, "helpfulness": "0/0", "author": "MJgui"}, {"rating": 4.0, "review": "It was easy to set up. Initially I had a problem loading movies but after I unplugged it for a minute it worked fine.", "verified": true, "helpfulness": "0/0", "author": "Linda C. Harlan"}, {"rating": 4.0, "review": "It is awesome and works like a charm with my Vizio 39 inch hdtvWas able to use the yupp tv app with this", "verified": true, "helpfulness": "0/0", "author": "Chandrasekar"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Allen A."}, {"rating": 5.0, "review": "This is great I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Sherry Hampton"}, {"rating": 4.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am Thrilled by the Fire Stick. Not only can I now get Netflix, in another room without it being hard wired, it also has a Ton of other Neat Shows & even a few Free Slot Games to enjoy.  I have already recommended the Stick to several Friends.  If your looking for a Simple WiFi stick, this is the one for you.", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Cox"}]