[{"rating": 5.0, "review": "Wow this stick is so amazing!  So many things on it and all we had to do was plug it in.  All our pictures, music, etc. were right on our screen for us.  Thanks Amazon, you are the best!!!", "verified": true, "helpfulness": "1/1", "author": "Maggiegreeneyes62"}, {"rating": 4.0, "review": "Works great! Only issue is I can't get the sound to go through my stereo system which is hooked up to the TV. When I had my Blu-ray hooked into the same HDMI outlet it would play through the stereo.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Great gift for my son, he uses it everyday.", "verified": true, "helpfulness": "1/1", "author": "Don Helms."}, {"rating": 5.0, "review": "I really give this a 4.5 out of 5. I have owned the fire stick since early December and ordered at special price as I was a Prime Member. The fire stick has been wonderful! I have no issues with connectivity, no blackouts or flickering of picture while watching shows on various apps. On installation, I do recall it took a few attempts to connect to my internet but since then the fire stick has remained connected. Sometimes when I switch my TV input mode to the Amazon Fire stick port the screen will be blank but this is simply because the fire stick is on sleep mode and pressing the home key or any button for that matter on your fire stick remote will awaken it. The reason I dock some points is because they don't have an a app for vudu or HBO GO (which appears they are). I am not super upset about HBO GO because they do have individual HBO shows available. Lastly I wish there was a way to easily search prime videos that are available for rent only.One other thing, while the remote included doesn't support voice search there is an app available on droid as well as iphone which does support the voice function without having to purchase the separate remote.", "verified": true, "helpfulness": "1/1", "author": "Book_thyme"}, {"rating": 5.0, "review": "so quick and easy to setup! Less then 5 min!! And very clear pictures.", "verified": true, "helpfulness": "1/1", "author": "Colleen"}, {"rating": 5.0, "review": "This device is wonderful. This now makes it so much easier to watch the videos included with Amazon Prime on our television.", "verified": true, "helpfulness": "1/1", "author": "Robert E Fadoir"}, {"rating": 4.0, "review": "The stick works great for watching shows. There are a couple of problems which keep it from 5 stars:1) Occasionally it will lose the ability to do WPA-PSK WiFi. When this happens, it will not connect to my WiFi, it always says the password is invalid. I have to remove USB power from the stick to reboot it to get it to work again.2) During some shows on Netflix and Amazon services there will be frames dropped and audio samples lost. I assume this is the device not being able to keep up with the stream. We don't experience this with the other Netflix / Amazon devices in the house (PS3 / Xbox).That said, the speed of the device is SO much better than the build in players on our Sony TV and Blu-Ray or our Vaio TV. The UI is intuitive and responsive.", "verified": true, "helpfulness": "0/0", "author": "UFGeek"}, {"rating": 1.0, "review": "This would be an awesome purchase If It Ever Worked Properly.  This was my first time buying anything like this and I was so excited Only to be let down repeatedly...All throughout the day and night ! It is Constantly, and I mean Constantly shutting down and saying connection error And trying to buffer itself. It seems I am not Alone as I read other reviews. The Only way I have found to fix the error is to physically unplug it and plug it back in the t.v. Until it decides to reboot itself. I really wouldn't mind if it was only on occasion but its 6-10 times a day. Why can't this be fixed? It's the only problem I have with the fire stick But its become a Big Problem as it just gets worse and worse. At this point I would Not recommend and I would Not buy this again Unless this was a guarantee fix.", "verified": true, "helpfulness": "0/0", "author": "Peggiann"}, {"rating": 4.0, "review": "I would have liked to have had a users manual come with the Fire TV Stick. Do not think i should have to pay to get the users manual. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Jan A."}, {"rating": 5.0, "review": "Device As Is:The best way to access prime content and Amazon Instant video Rentals. I love how easy it is to access all Amazon content. Before getting this i had considered getting rid of prime but with this and the recent addition of prime Music I think I will continue with prime always. I could describe this with more detail but at the end of the day it ties in beautifully to amazon content. It is also a nice way of accessing Netflix, i have an older Smart TV, First Gen I think and its Netflix interface is almost worthless. The FireTv version is a significant improvement. Games are good too. My wife and I fought a little over playing Tetris on it when we first got it but overall we use it for Video and music. Watching Prime is almost constant in our household now. We got cable in our house for the first time ever in march to get a better internet connection and since some channels were included  we figured why not try it. at first we used several channels then just Disney (we have a toddler) now we don't really even bother with it. there is plenty of child friendly content on prime. i'm even thinking of giving up Netflix as it seems we almost never watch anything there now that prime is more convenient (My smart Tv did support it but hardly usable at all) and the content selection is getting better all the time including more recent releases. Plus Amazon is a better Value if you use every prime benefit (I tend to) with Free Books that are next Months New Releases, 1 free Book rental, Now prime Music, the Prime instant Video, and 2 day shipping it is insane that Amazon hasn't raised the price again. Maybe next time they should create a choose your selection price increase. If you want it all it will be YYY but if you don't use most of the features the price won't change.... At the current price of $99 a year I think that's less than my current basic Netflix subscription. (8*12=96 and i think its actually around $8.50 so around $102 a year)This device does pretty much all i could hope for in such a device. still some room for Improvement as noted below.Sideloaded Improvements:I have sideloaded several things to this of which XBMC soon to be known only as Kodi is my favorite for playing any media from your network or the internet it really is hard to beat and so far it seems to work flawlessly. It pulls metaData for all your movies and music. Using XBMC with it makes the FireTv stick the best thing I have found for streaming your own digital collection to your tv.If you don't want to sideload you can use Plex for similar capability but it places limits on file structure for your existing Movie collection (must be in a self contained wrapper file not the direct DVD like multi folder structure. Kodi (XBMC) handles either and even full dvd files allowing you to have the menu features of the DVD intact.Before looking at this next part remember i rated it 5 stars. Faults often are easier to have a lengthy discussion about but I do love this device overall.Room For Improvement:Enabling reordering of the main Screen left menu structure would be a big help Music is one of the things i access most and it is near the bottom. Prime and netflix are my most acessed and prime is one down from home so that is correct by default but if its been a while since i last used netflix it is rather inconvenient to get to which is my next point:Allowing placing/locking things to home really is vital. The Fire phone allows pinning frequently used things to the home carousel. Home is mainly a list of suggestions from amazon, 1/3 of the space is recently accessed content (Music, Prime videos, Videos in your library, apps)  the rest is \"suggested\" content.The suggestions are fine sometimes what you want but a better approach would be 1/3rd recent 1/3 favorites (same content as recent but user selects what goes there and the order and it doesn't change without their direct request.) 1/3 suggestions.It needs a way to access an existing Disney Movies anywhere collection. I wish it could access Vudu for Disney Anywhere collection access built in. Ultraviolet is possible through flixster but that doesn't incorporate an existing Disney collection since Disney ins't part of the UltraViolet Consortium. Though Disney Digital codes do work with amazon instant video quite nicely. As I understand it you can get a sideload of Vudu for android to work on the fire tv line. I installed it no problem but since its designed for touchscreen it doesn't really work with the amazon remote. I wish Amazon, Vudu (walmart), etc would stop trying to compete by making customers choose one ecosystem but not allowing you to use their devices with another ecosystem. Amazon compete by making your ecosystem better and allow access for the times when someone else's is preferred in the end you will win. However I prefer amazon video on this to Vudu. Vudu's interface isn't as convenient to watch movies you own from People complain about amazon being sell sell sell but while purchasing options are conveniently placed and \"Suggestions\" really are omnipresent on the home screen you can readily access content you have already purchased or that you subscribe too. Granted they allow Netflix which competes with prime so it could be entirely Vudu who is unwilling to have more open competition. And it really wouldn't matter to me if Disney Movies Anywhere could link directly to amazon. (it links to Google play, itunes, and vudu)", "verified": true, "helpfulness": "1/3", "author": "Josh EE and all Techcentric"}]