[{"rating": 5.0, "review": "I love it. Just wish it had show box on it", "verified": true, "helpfulness": "0/0", "author": "nicole"}, {"rating": 5.0, "review": "I'm not sure how I lived so long without the Fire Stick. I absolutely love it. Set up was a snap, in just minutes I was up and running. Having the Fire Stick makes me dread business travel a little less. I now know I won't have to fear hotels that have five sports channels and one news station and not much else.  Amazon has once again enriched my life.", "verified": true, "helpfulness": "0/0", "author": "HarperLee Kitty"}, {"rating": 5.0, "review": "Easy to use and cheaper than upgrades. Wish there were moral values reflected in the possible choices for viewing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ready Reader\""}, {"rating": 5.0, "review": "Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Ahunsick"}, {"rating": 5.0, "review": "Creat Stuff And cheap.", "verified": true, "helpfulness": "0/0", "author": "Rafael adames"}, {"rating": 2.0, "review": "has a generic remake version of YouTube, limiting its compatibility with casting devices.was hoping this would be an upgrade from our Google chromecast, however quickly we discovered it was not as compatible as the chromecast with most services. while the first it has a little bit better buffering and load capacity, ultimately we ended up using both chromecast and the fire stick which is a disappointment.", "verified": true, "helpfulness": "0/0", "author": "L.P."}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Excellent as advertised!", "verified": true, "helpfulness": "0/0", "author": "Virginia Trevathan"}, {"rating": 5.0, "review": "very good device i like itbut there is not specific application for it in android nor IOS", "verified": true, "helpfulness": "0/0", "author": "akram abdallah"}, {"rating": 1.0, "review": "It does not work. I used it two days and things were ok. But, now the response is that is not connected to the internet, of course it is. Any ideas of what is happening and how to correct?", "verified": true, "helpfulness": "0/0", "author": "William R."}]