[{"rating": 5.0, "review": "Only had it a few days but to this point it works very good. Have some issues with my wifi but this isn't due to the TV stickI have nothing but good prase for it😄", "verified": true, "helpfulness": "0/0", "author": "Warren D. Cory"}, {"rating": 3.0, "review": "I have been using two of these alongside with a chromecast in the household. Despite the higher spec of this device, I find it doesn't perform much better than the chromecast. In fact, a lot of my media that streams perfectly on the Chromecast will tend to stutter on the Fire TV Stick (this is especially true for media streams via Plex). That being said, the interface is very convenient, as is the included remote. For basic usage with Amazon Instant Video and Netflix, this is perfect! For Plex media streaming, I would stick with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Vlad P"}, {"rating": 5.0, "review": "quick to set up and I have access to all the shows I  personally watch with a normal cable package....I also like the remote control", "verified": false, "helpfulness": "0/0", "author": "CFrances"}, {"rating": 4.0, "review": "Seems to work as expected.  I have not used it extensively yet as I am still learning about it.", "verified": true, "helpfulness": "0/0", "author": "Timothy A. Davies"}, {"rating": 3.0, "review": "Expected some free programs. So I guess you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Jim Frye"}, {"rating": 4.0, "review": "Works very well.  Was relatively easy to install.  Will probably sign up for Amazon Prime and possibly cut the CABLE!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 2.0, "review": "I don't like to have to connect to the energy, I thought that the device works without energy.", "verified": true, "helpfulness": "0/1", "author": "Peter McClelland"}, {"rating": 5.0, "review": "Got one of these for both my kids for Christmas...they love it!!! Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "laurie"}, {"rating": 5.0, "review": "Came up quickly as one of the HDMI inputs to our AV Receiver. Very thoughtful HDMI 'extender' allows the stick to reach above the receiver so that the remote can talk to it. Interface to content, and for setup, is wonderful, the best of all our inputs including Comcast, AppleTV. Content selection is awesome.", "verified": true, "helpfulness": "0/0", "author": "Carlick"}]