[{"rating": 5.0, "review": "Easy to install. I was kind of surprised that the fire stick was pre programmed with my account information. If it was stolen before I received it, someone else could plug it in and start using without need for a password. However, I absolutely love the speed and functionality of the fire stick. It was also easy to install Netflix as well. Nice job Amazon!  Bye bye to my old bluray that had Amazon and Netflix installed on it.", "verified": true, "helpfulness": "0/0", "author": "Cranky"}, {"rating": 5.0, "review": "Does everything it says it will do.  Easily connected. I was using it in less than fifteen minutes.  Great purchase!!", "verified": true, "helpfulness": "0/0", "author": "Ronald Box"}, {"rating": 1.0, "review": "I will not be renewing my Amazon Prime. It is a rip off to pay a yearly fee and then have to pay additional money for a majority of the programs they offer. Netflix is a much better deal.", "verified": true, "helpfulness": "0/1", "author": "Joanie Tucker"}, {"rating": 5.0, "review": "I love the Amazon Fire devices. I have two the stick and the little box I love them both. Will be moving on to a digital antenna also.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "Yes I am pleased with the performance and recommend it.  It was easy to install and provides a great picture.", "verified": true, "helpfulness": "0/0", "author": "c Zanders"}, {"rating": 5.0, "review": "Its really good", "verified": true, "helpfulness": "0/0", "author": "Bjorgvin Halldorsson \"bohall\""}, {"rating": 5.0, "review": "Great picture.  Easy to navigate program.  Really happy with it.", "verified": true, "helpfulness": "0/0", "author": "Roseann Woodward"}, {"rating": 5.0, "review": "Yes I like it a lot.  Have a bunch of pics and videos on it. Also have been watching a lot of movies", "verified": true, "helpfulness": "0/0", "author": "michael berkovitz"}, {"rating": 5.0, "review": "I was doubtful as to the utility of the Fire Stick since I already have a smart TV. This thing is great! The content on my smart TV hasn't been updated in ages, playing Plex content is wonky, finding things on Netflix is a nightmare and I still can't seem to make the Amazon app work right. The Fire Stick fixes all of that!", "verified": true, "helpfulness": "0/0", "author": "James Wright"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]