[{"rating": 5.0, "review": "I love the Fire TV Stick. It worked right out of the box, and has access to everything at the touch of a button! The kids love it too, it's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Queen Erzulie Dantor \"Light Love Life\""}, {"rating": 5.0, "review": "We're very happy with it and look forward to enjoying it for a long time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Welshcobdrivinggrams\""}, {"rating": 5.0, "review": "I got mine with the discount and works perfect especially if you have prime and Fire TV and a good internet connection with wifi like I do ! I'm happy , thank you", "verified": true, "helpfulness": "0/0", "author": "Teresa"}, {"rating": 2.0, "review": "I have had a couple of days and have mixed feelings....does not work with kindle tablet (purchased earlier this year)...charter cable does not support apps that are available and Google nexus 7 tablets cannot cast (all OS versions are latest).Prime works well, no issues streaming...just disappointing that I cannot use casting or other apps that are in store. (I called Amazon support and they claim the kindle purchased 2 months ago is too old to support cast functionality).  I did only pay 19, so may keep and hope that as time goes on these issues are worked out.", "verified": true, "helpfulness": "0/1", "author": "Darby Muia"}, {"rating": 3.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "M Donofrio"}, {"rating": 4.0, "review": "The stick is nice. With a lot of apps to choose from and a lot of things to offer. Im not sure if it's just me, but i have to keep it plugged in the wall for faster connection otherwise it will freeze a lot, which I'm not too fond of because I don't like seeing any cords visible from my tv. Also a lot of times when I'm watching something, it freezes a lot.. But that could just be me and my connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great streaming device.  I purchased 2 to wise up some not so smart TVs.  Like the fact that they are portable and can easily be moved to a different location.  Both Fire TV sticks work great thus far.  Set up was hassle free.  After connecting both units, they completed an update (that did take 10-15 minutes) and I was able to start streaming prime content and more.  The interface is easy to use and quick.  I was surprised to see lyrics (for most songs) on the screen when I tried the Prime Music app.  I am looking forward to exploring more features as time permits.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 5.0, "review": "Very nice, easy and convenient to set up. Though, when signing up for Disney Jr. I find it is not available at least with my carrier, Directv.  Still liked the ease of sign up and use", "verified": true, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 4.0, "review": "Great little device, it would be perfect if the remote included a microphone for voice search,  and if they offerd  multiple users account option or a guest account option.", "verified": true, "helpfulness": "0/0", "author": "Chump"}, {"rating": 5.0, "review": "Love this no more shaking WII remote. This is so much easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]