[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Veronica Montgomery"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "mazdamaniac \"mazdaman\""}, {"rating": 4.0, "review": "real easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Supriyo Sanyal"}, {"rating": 5.0, "review": "This is our first experience without cable, and the Fire TV Stick is making it a smooth transition.  (I should caveat that statement by saying that we don't watch too much TV in the first place, just a few specific channels.)  We can download apps that let us watch HGTV, ESPN, TBS, TNT, and other channels; we can listen to music via multiple apps and programs; we can move the Fire Stick between rooms and devices... all in all, it's FANTASTIC!", "verified": true, "helpfulness": "0/0", "author": "Janelle Johnson"}, {"rating": 5.0, "review": "Set up was a breeze. Just plug it in.  I do get messages that my internet speed might be too slow for uninterrupted playback but I just click to watch anyway and haven't had a problem- even with the kids playing xbox in another room.", "verified": true, "helpfulness": "0/0", "author": "Sharon V. Seidl \"Sharon\""}, {"rating": 2.0, "review": "WIFI connection issues. Not worth it until they fix it...", "verified": true, "helpfulness": "1/1", "author": "karin schroeder"}, {"rating": 3.0, "review": "The fire stick has many options for apps and shows. it also gives movies with the option of close caption.  I gave it three stars because I am unable to control it through my phone because it keeps asking for a pin number and I don't see anything on the unit nor the box igives me a pin number.to enter. Does anyone know.  How to find it?", "verified": true, "helpfulness": "0/0", "author": "Rosemarie"}, {"rating": 5.0, "review": "I love this stick!!  It works so much better than the other devices that come adapted with the Netflix, Hulu, Youtube, etc. It picks up my WIFI better.", "verified": true, "helpfulness": "0/0", "author": "laurie thomas"}, {"rating": 4.0, "review": "Purchased when Roku started to go on fritz. I'd been planning to purchase since I am already a Prime member and wanted access to instant streaming account on tv. HBOGO was anticipated bonus.Overall, product meets expectations. Set up was easy. Navigation may be a bit unwieldy if members of your household aren't tech savvy. (Sometimes recently used apps like Netflix and Hulu don't load from most immediate menu and you have to scroll down to apps menu instead.) The remote works just fine and is better quality than some I've seen for comparably priced boxes.The only drawback: I was unable to access HBOGO. App downloads and operates, but I guess Amazon still has yet to iron out differences with some cable providers (Comcast Xfinity).", "verified": true, "helpfulness": "0/0", "author": "Melissa Walker"}, {"rating": 5.0, "review": "Love my fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Sheri S. Parker"}]