[{"rating": 5.0, "review": "Easy to use.  Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Sue H."}, {"rating": 5.0, "review": "very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Lisa Lowe"}, {"rating": 1.0, "review": "I'm hoping to \"cut the cord\" and stream all our entertainment. The stick worked moderately well for 2-3 days then cropped out. The stick would drop the wireless signal, after calling customer support and troubleshooting they sent a replacement stick. The replacement arrived today same issues. I also have a FireHD tablet and it streams video perfectly as I'm standing next to the non-functioning Fire stick. After ANOTHER 40 minutes on the phone with customer service a 2nd replacement is on its way. If anything changes I'll update but as for now this product is worthless.", "verified": true, "helpfulness": "0/0", "author": "OhioPop"}, {"rating": 5.0, "review": "Incredibly easy to set-up as the device is essentially preloaded with your current Amazon Prime account. As a prime member, I think this is by far the best option for streaming multiple TV apps, including Netflix, Hulu and HBO Go (if you or an amiable family member are subscribers).  Moreover, the Fire TV app can be used on your phone and includes voice search, as well as additional control/menu options.", "verified": true, "helpfulness": "0/0", "author": "doorbell"}, {"rating": 4.0, "review": "good wifi reception - fast responsiveness for the programmed media channels it came with. We'll see how long the remote lasts.  I am struggling to stream my Blu Ray Rips from PC (VLC media player) to this unit- but I cannot blame this on the stick.  So far so good.", "verified": true, "helpfulness": "0/0", "author": "Tim Pratt"}, {"rating": 5.0, "review": "It work great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "k carmino"}, {"rating": 4.0, "review": "Very pleased except that our cable carrier doesn't provide hbo go access through fire stick. I got it pretty much just for that!", "verified": true, "helpfulness": "0/0", "author": "Katrina I."}, {"rating": 5.0, "review": "I LOVE MY FIRESTICK TV now I watch Netflix HULU Plus and others and its GREAT", "verified": true, "helpfulness": "0/0", "author": "The Reader"}, {"rating": 2.0, "review": "Works most of the time, but you also get skipping video that then quickly speeds up to sync with the audio. This happens in Netflix and Hulu. MLB.tv app is totally useless (skips terribly tells me my Internet speed is too slow) which is one of the main reasons I bought it. After seeing these issues, a quick search finds that this is totally common, none of the fixes work for very long. It's just not a good device. Went with this over Chromecast for the remote, but now that i find MLB.tv stinks, I'm regretting my choice and it's too late to return it. Nearly none of the games are playable unless you buy a $40 controller. I like the slideshow screensaver, that's about the best thing I can say for it. The remote works fairly well. Before this I had a Roku that worked great but maxed out at 720p and was starting to get glitchy after a few years. Some of my friends have Chromecast and rave about it, but we wanted a dedicated remote.", "verified": true, "helpfulness": "0/0", "author": "C. Hedstrom"}]