[{"rating": 5.0, "review": "Very happy with this product. Does just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "scott ebbeling"}, {"rating": 5.0, "review": "I thought this would not be as fast as the larger fire TV box but, it's amazing. This little thing is fast.  I use it as my choice streaming device.", "verified": true, "helpfulness": "0/0", "author": "ShawnD"}, {"rating": 4.0, "review": "I love the fire stick.  However, I was disappointed to find out that I could not activate HBO through Xffinity.  It would be nice to have this problem resolved.  I'm hoping that Amazon will let their customer's know when HBOgo can be activated through this provider.", "verified": true, "helpfulness": "0/0", "author": "Katherine Moore"}, {"rating": 1.0, "review": "Not sure why the device requires so much bandwidth, but it does not work with Verizon Enhanced DSL.  We stream from many services with our iPad and we're looking for the convenience of a Fire Stick.  Alas, we are back to using the iPad.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Works nicely with the android app, and the fact that I can mirror my phone with it is a huge plus.Because I like it so much, I'll end up signing up for Prime.Nice job Amazon", "verified": true, "helpfulness": "0/0", "author": "BILL DELVAUX"}, {"rating": 4.0, "review": "Works so much more effectively than the Chrome cast, and I really wanted to say the opposite because I love Google. The only reason I don't get rid of my chrome cast is that to date I am not aware of a way to mirror my non-android device (i.e. my PC) onto my Amazon Fire stick. For this lack of function, I've dropped a single star. The fact that it has an interface with device-ready apps is really what gives the Fire stuck a leg up.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Plenty of choices.  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Mel N"}, {"rating": 5.0, "review": "Bought the rival brand first and that was a mistake, waste of money. Then I bought the Fire Stick and boy, what an improvement. Only had the fire stick a few weeks so can't say about durability, but the other brand I tried was a piece of junk, lasted less than 4 months. This is by far the best product from the start!", "verified": true, "helpfulness": "0/0", "author": "Drenee"}, {"rating": 4.0, "review": "So far so good.  Content is more or less as expected.  Navigation is smooth and pretty intuitive.  Looking forward to the portability of taking the stick on vacation and such.  It has already enabled the ability to watch Amazon Prime content on one of my TVs that did not have any built-in or downloadable Amazon app.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lingle"}, {"rating": 4.0, "review": "cord cutting is fun. amazon prime slingtv and Netflix all you can watch buffet", "verified": true, "helpfulness": "0/0", "author": "john a mcphail jr"}]