[{"rating": 5.0, "review": "We are really enjoying our fire stick. This was a great purchase for our home.", "verified": true, "helpfulness": "0/0", "author": "Deanna"}, {"rating": 5.0, "review": "This stick works great and has a ton of apps...Wish it had a browser to surf the Web like my smart TV,  but really that is just nit picking,  great device and highly recommend it...", "verified": true, "helpfulness": "0/0", "author": "Tealtrack"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Brian Moreno"}, {"rating": 5.0, "review": "love it!  works great and will be buying another one for my bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "dee rogers"}, {"rating": 5.0, "review": "Way better than my old Wii", "verified": true, "helpfulness": "0/0", "author": "andrew"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "todd harris"}, {"rating": 5.0, "review": "This device is very easy to use and extremely convenient. Primarily, I use it with a second TV in the den instead of having to pay for an extra cable box. It comes with prime instant video built in (and a better interface than the PS3 app). It has all of the apps I'm most interested in: HBO, Showtime, Starz, Flixster, and even PBS. [Note: you need a subscription for the premium cable channels like HBO, but that's standard and out of Amazon's control.] I debated getting the larger fire TV because it has a faster processor and more space, but decided to try the stick first since it wasn't that expensive. I haven't regretted this choice at all. The remote fits comfortably in your hand (it's small) and since it uses bluetooth, you don't even have to be facing the TV to use it. I love how small and easy to set up it is. I can take it anywhere (even works in most hotels) and be watching my favorites in HD in 5 minutes!", "verified": true, "helpfulness": "0/0", "author": "EP"}, {"rating": 2.0, "review": "Was very excited to get this and it does work as specified.  I have been a long time Amazon advocate (aside from the recent news of employee \"policy\") and they have always had great experiences.  The content with this is great, but plain and simple....it's pretty slow and choppy when searching.  I would also get lines on the screen in the middle of videos from time to time even though I have a dedicated internet connection.My biggest point of contention is the fact that it freezes virtually every time when left playing and TV is shut off forcing me to unplug and restart it...every time without exception.  But go figure it's a stick not a box and you get what you pay for.My advice to anyone reading, save your money and buy a Roku 3.  Way fast and super smooth.  Yes you will pay more and I don't think you can jailbreak them, but the speed and smoothness is second to none including Apple TV.  I already had a Roku, but returned the Fire Stick to get another one for a second room.Do yourself a favor and spend a little extra, it's well worth it and still far below others like Sling TV. Oh and by the way you can still get Amazon Prime and Sling on Roku so it really doesn't matter in the long run.Hope this helps!!", "verified": true, "helpfulness": "0/0", "author": "Sean Kennedy"}, {"rating": 5.0, "review": "I love it can take it with me anywhere that has wifi and always listen to music or watch my shows", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Great for on the go...toss it in my backpack and watch what I want when I want.", "verified": true, "helpfulness": "0/0", "author": "Marcus Ruffin"}]