[{"rating": 1.0, "review": "the first one i received was defective which means in my case that i was able to surf through the different menus and select different shows and movies to watch but the wireless internet connection would drop out. This is not a problem with streaming on any other device in the house on the same network. I have tried updating the firmware and also trying factory resets. This seems to be a hardware/software issue that amazon is aware of. Although it doesnt seem like everyone is having this issue. So amazon replaced just the fire stick but not the remote or cables which is fine. The second one i received had the same problem so i returned it and received only some of my original investment. Not a bad device if it worked correctly. If i were to buy another amazon streaming device I would probably go with the Fire TV Box which seems to be more dependable with better hardware.", "verified": true, "helpfulness": "0/0", "author": "Brian Smith"}, {"rating": 5.0, "review": "This review pertains to the Fire TV stick only, as I had other items delivered with this order and i don't want the reviews mixed.  First, there are two other pieces that come with your Fire TV Stick that are not shown - an adapter that changes the stick from USB to HDMI and a cord that plugs into wall.  Very important that you plug it into the wall for better connection and power.I connected all the parts, while telling myself \"I don't think I am going to like this.\"  My skeptical thoughts were based on reading tech reviews on speed or lag while moving from one place to another. I also kept saying to myself, \"I wonder if I should have gotten the Five TV box versus the Fire TV Stick.\" However, I like to try things for myself before I agree with the majority.The Fire TV stick was so easy to set up...plug into HDMI; plug cord in wall; turn on tv; and viola up pops the little guy who walks you through connecting to wifi and also lets you know that is a manual there should you need it.  The Fire TV stick came registered to my Amazon account already, but please know if you are giving this as a gift to someone else, then chose gift so that it does not arrive to the other person registered to you.  They will have to register it for themselves.Now for the good stuff, in my humble opinion.  As a prime member, the entire library of shows, movies and games were available to me.  Netflix, Tubitv and Pluto Tv is also available for you to register for.  It has free shows and movies.  I am uncertain if there are paid shows or movies there as well because I did not venture that far yet.  I did log into my Netflix as I wanted to see what the lag rate was for me; again, please be aware that again in my humble opinion, the amount of time it takes to navigate or load a movie might be based on your ISP upload and download rate.  So if you have the basic internet service it might take a bit longer than the 4 secs it took to load a movie or navigate.I purposely jumped around between TubiTV, Netflix, Prime Instant Videos, and Pluto Apps just to see how long it would take to load or play a movie or show.  On good weather days the load time was about 2-4 seconds; and on the days it was raining very badly it took about 2-6 seconds.  The bottom line is that things loaded extremely faster than i imagined.  Even if I had to pause my show, the restart time was almost instantly.Initially, I connected the Fire TV Stick to my Television in the living room so that I could watch while I crafted.  That night, I just unplugged it from that television and plugged it into the HDMI slot in my bedroom and viola everything started from where I left off.  I only had to click on my recent Button and my movie started again. To further test, I went to visit a friend 82 miles from my home and took my Fire TV Stick with me.  I plugged into their television and the only thing I needed to do was to connect to their wifi.  Amazing!Last, I downloaded the Fire TV app from the Google store and turned my LG G3 into a remote control where I could voice search.  I have not tried to play the games using my phone as a remote yet, but have used the remote control that comes with the Fire TV stick...fun fun.I honestly have nothing bad to say about the Fire TV Stick, which is surprising since I am my worse critic, as I have been told.  I give the Amazon Fire TV Stick 5 stars, because it has lived up to everything that it advertises it can do.  Perhaps for Christmas I will get a couple of Game Remote Controls for the Grands to play with.In my opinion, sometimes, Less is more and big things definitely come in little packages.  I have recommend this to quite a few family members over other brands and perhaps one day I will be afforded the chance to try the Amazon Fire TV Box.  But until then, I am extremely happy with my purchase.If you have any questions that I am able to answer, I will share.  Please be aware that I am just a user and and am still learning all the features available on the Fire TV Stick.  I do not have the upgraded remote control or the Game remotes.Have Fun!So I have", "verified": true, "helpfulness": "1/1", "author": "Cherokeechild"}, {"rating": 5.0, "review": "Just as expected!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "Great addition to my flat screen as I have cut the cord!", "verified": true, "helpfulness": "0/0", "author": "kenny spahn"}, {"rating": 5.0, "review": "User friendly and everything I needed.  I have TWC everyday low cable and this thing plays movies on Netflix and SlingTV with minimal to know buffering.  Worth it if you want to stream.", "verified": true, "helpfulness": "0/0", "author": "Jon D. Lemessurier \"Jonny LeMez\""}, {"rating": 5.0, "review": "Very easy to set up. Very responsive. Never a lag. Menu is easy to use. I really like it. The Fire TV box is probably even better but this is much more than I had hoped for so I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Doyle \"Mustang fan\""}, {"rating": 1.0, "review": "Sucks. It freezes all the time. I gave up on it a week after I got it. Waste of $.", "verified": true, "helpfulness": "0/0", "author": "Angela L Kaullen"}, {"rating": 5.0, "review": "Love this product, only really beneficial when purchased with Prime", "verified": true, "helpfulness": "0/0", "author": "Chris10"}, {"rating": 5.0, "review": "Fire Stick's performance is far superior to the Chromecast.. straight out of the box", "verified": true, "helpfulness": "0/0", "author": "Masud Kadri"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Michelle Steffin-Sullivan"}]