[{"rating": 5.0, "review": "Works great. No more Roku for me", "verified": false, "helpfulness": "0/0", "author": "James Atwell"}, {"rating": 5.0, "review": "Amazing.", "verified": true, "helpfulness": "0/0", "author": "Jorge Arellano"}, {"rating": 5.0, "review": "Fire Stick works perfectly! Great option if your TV doesn't have apps built-in.", "verified": true, "helpfulness": "0/0", "author": "Marc Wolfinger \"wolf\""}, {"rating": 5.0, "review": "Very easy to use. Like that this portable.", "verified": true, "helpfulness": "0/0", "author": "Michelle17"}, {"rating": 5.0, "review": "Love it! Will recommend to any one.", "verified": true, "helpfulness": "0/0", "author": "Natasha Ulery"}, {"rating": 5.0, "review": "Love it!  It works like a charm. I don't know why I waited so long. I bought 1 for my bedroom and one for my daughters room. The only smart TV we have is in the living room. We are very pleased and the price is fair.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "Love the responsiveness if you have a good internet connection. Would love to see this being open to other streaming capabilities other than plex from our NAS.", "verified": true, "helpfulness": "0/0", "author": "scb"}, {"rating": 1.0, "review": "Could never get it to work.  Got it connected to wi-fi, it would try to download update but would hang.  Tried on 3 different TV's and 2 different wi-fi networks, with and without the included HDMI extender cable.  Bummer.", "verified": true, "helpfulness": "0/0", "author": "Michael S"}, {"rating": 5.0, "review": "This does exactly what we wanted it to do. Our setup in the bedroom TV didn't have any streaming capabilities beyond the On Demand programming, and we wanted the ability to watch Netflix/Prime in there.Set up was plug-and-play easy. We had it up and running within minutes of opening the package. The introduction video is probably helpful if you're not at all accustomed to streaming tech, but most users can probably skip right over it. Not sure why it includes a bit on how to plug in the stick, as you've obviously completed that step already if you're watching the video.We haven't moved it around much, but portability seems like it will be a nice bonus.", "verified": true, "helpfulness": "0/0", "author": "Philip J. Vogt \"pretty average guy\""}]