[{"rating": 5.0, "review": "I love it! It's like having a smart TV!", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Love it.  Great for travel.", "verified": true, "helpfulness": "0/0", "author": "Robin A, Rose"}, {"rating": 5.0, "review": "This is an amazing device, and a bargain as well.", "verified": true, "helpfulness": "0/0", "author": "Vizsladog"}, {"rating": 5.0, "review": "It's Like Having A Cable Box in Every Room - Without Paying Every Month! Worked Immediately and effortlessly. I love this product. I'm buying 2 more next pay so I can have one for every TV in my house. :)", "verified": true, "helpfulness": "0/0", "author": "Nate Sturgill"}, {"rating": 5.0, "review": "This replaced the use of my blue ray player that I used only for Amazon Instant Video. My 70\" Sharpe TV doesn't have the Amazon app.  Its really a great addition to my entertainment system. Responsive and easy to use. Also Miracast compatable for my Motorola Droid Maxx which Chromecast is not.", "verified": true, "helpfulness": "0/0", "author": "Jim D"}, {"rating": 5.0, "review": "Amazing device.  Perfect to filter internet Amazon Prime and Netflix without having to have a game system. I can also take it with me when I travel.  LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Melonie B. Hill"}, {"rating": 5.0, "review": "I love this thing!  As a prime member, this opens up a world of ciewing options for me that I haven't ever taken advantage of until now.  Set up was super easy - the magic of the internet ensured that because this is an Amazon product, and I ordered it here, it was already associated with my Prime account.  Nice!  Get it, you won't be sorry!", "verified": true, "helpfulness": "0/0", "author": "DzlJohn"}, {"rating": 5.0, "review": "I love Amazon fire stick. It was easy to set up, easy to use, and I love the parental control settings", "verified": true, "helpfulness": "0/0", "author": "A.H."}, {"rating": 5.0, "review": "It's great! I love it.", "verified": true, "helpfulness": "0/0", "author": "Eddie Shades"}, {"rating": 5.0, "review": "I bought this for my mom and she LOVES it!!  Makes watching TV so much easier!", "verified": true, "helpfulness": "0/0", "author": "Janeen E. Redman"}]