[{"rating": 2.0, "review": "WiFi spotty even when within 5 ft of WAP. Roku and Chromecast has superior connectivity at same range", "verified": true, "helpfulness": "1/1", "author": "Henry Chan"}, {"rating": 5.0, "review": "Love it, much faster than the two Roku's we have for our other TV's. Instantly starting up streams is amazing. Almost everything I watch has no buffering time. It's great. Definitely gettng more of these to replace my Rokus, once they start dying.", "verified": true, "helpfulness": "0/0", "author": "Sprinkles"}, {"rating": 5.0, "review": "I love mine no problems getting started to watching shows.  I have not tryed any games on it but love that I can take it with me where ever I go in my home to on the road.", "verified": true, "helpfulness": "0/0", "author": "alynana"}, {"rating": 2.0, "review": "Let me begin by saying that I am very much interested in the products that Amazon has to offer. However the Fire Stick was not one of them that impressed me. There is a lot of scrolling to find anything. You need to connect your Android/Fire device to the stick to have voice command. Maybe they will include apps for other OS's but at this time is quite limited.Its mainly an apps device. If you do not have a gaming console/tv/DVD/BlueRay player with app support then this device may be for you but at this time its only good for apps and only sort of good - back to the scrolling issue. I have an xbox that fills the need for apps. I honestly purchased this since I saw that it had Miracast support to wirelessly cast my display onto the tv. Well, after hooking it all up and researching it is only for again, Android and their Fire devices. I was hoping to have the ability to cast my Windows 8 computer display onto the tv. Sorry - no support. At least at this time. Did some research and could not find whether they were looking to expand support on Miracast.I purchased two but am really considering returning both. I am very sure I will be returning one at the least so I can have a portable app player wherever I go. That way I don't need to sign into everyone's tv.", "verified": true, "helpfulness": "3/4", "author": "James \"James\""}, {"rating": 1.0, "review": "Completely conflicts with my tv and Apple TV. It interferes with transmission creating snow and flashes in and off. I have to return it", "verified": true, "helpfulness": "1/1", "author": "Alex Chavez"}, {"rating": 5.0, "review": "Karaoke!  That is all!", "verified": true, "helpfulness": "0/2", "author": "Sknab"}, {"rating": 5.0, "review": "I love this product. The only thing that could make it more perfect is if I could mirror my laptop or tablet to this thing.", "verified": true, "helpfulness": "0/1", "author": "D. L. McClain"}, {"rating": 1.0, "review": "Cons:Plugged it in, it immediately wanted to update its software. It was unable to update its software. It refused to run until updated, making it effectively a brick.After a number of reboots and a multi-hour-long download, it rebooted and presented me with a loud, obnoxious, and unskippable intro video.  At this point I removed the Fire Stick from my TV, broke it in half, put it back in the box, and burned the entire thing before its virulent disaster of a user interface could spread to nearby devices.Pros:Included batteries for the remote.", "verified": true, "helpfulness": "1/2", "author": "PNW Adventures"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "James Helfrich"}, {"rating": 4.0, "review": "I currently own a Roku stick, but when the Fire Stick showed up for the promotional price of just $19, I couldn't resist giving it a try.The first thing I noticed was how much faster (responsive) the Fire Stick was.  The Roku seems to have to \"think\" before it responds and preview pictures in Netflix take longer to load.  The fact that Fire has a dual-core processor vs Roku's single-core makes a big difference.Voice search also works very well and is quick.  Keep in mind, that although the Fire Stick does not come with a voice remote, you can use the phone app to control the screen with touch and voice.  I do wish that voice also worked for searching Netflix, however it only searches on Amazon (that I can tell).  That's one of the reasons I did not give it 5 stars.  But Roku has no voice option, so something is better than nothing in this regard.For the price, this was a great investment, and even at the full $39 price, it still beats Roku Stick at $49 (and is faster!).  I went ahead and ordered another one so all of our TV's have something to gain access to Netflix, Hulu Plus and Amazon movies.The main reason somebody might not want a \"stick\" is because it really limits your audio options.  There is no output for hooking up to a surround sound system.  This was not an issue for me because my home theater receiver has HDMI inputs for Bluray, DVD, etc, then it goes out to my TV.  So my receiver can decode the audio and I can enjoy movies in surround sound.However, if you are plugging this straight into your TV, you will be limited to your TV speakers, unless your TV has outputs to your home theater receiver.  If not, a \"stick\" may not be the best option and you may want to go with the \"box\" that has audio outputs for your receiver.  Just something to keep in mind ;)", "verified": true, "helpfulness": "1/1", "author": "Chad C."}]