[{"rating": 5.0, "review": "Works great - easy to set up and use.", "verified": true, "helpfulness": "0/1", "author": "Shelia Hill"}, {"rating": 4.0, "review": "My prime trail won't work with my stick", "verified": true, "helpfulness": "0/0", "author": "Christine meador"}, {"rating": 2.0, "review": "You cannot just plug this device into the HDMI port and go.  I had to reset it several times before it would show me any networks.  I followed all the directions.  Then, once it finally connects to the internet/WIFI, it has to download the latest software.  Seriously?!  It's brand new.  How many software updates are availabe already?  At any rate, I've been at it for 35 minutes now and still haven't gotten past the software that is still updating and downloading.  I gave it two stars only because right now, I don't like it.  I may change my mind once I can finally use it.", "verified": true, "helpfulness": "4/6", "author": "Lynn N. Adams \"my cat mitch\""}, {"rating": 4.0, "review": "I love this fire stick. It has so many great services and great apps.  The only thing I have not liked is that it has this horrible interruption with sound. It makes this really loud sounds and interrupts playing. I know it's the stick because it doesn't happen with chrome cast or with integrated LG apps.", "verified": true, "helpfulness": "0/0", "author": "Penelope"}, {"rating": 4.0, "review": "So far the device is great...Pros: Size and it's easy to use.Cons:My main issue is the lack of some apps. I know it's not a knock against the device per se, but it's the price of being new.Other issue is sometimes when I click down, the button gets stuck. Super minor and not all the time, but the remotes could have an issue...", "verified": true, "helpfulness": "0/0", "author": "Austin W"}, {"rating": 4.0, "review": "It worked for a couple of hours then stopped. Got it working again, however, I can't use it because it does not work through my 5.1 HTMI sound system. My sound system works when I bypass the stick and go directly to Amazon Prime and select a movie. It also kills my Netflix sound. I have to go directly to Netflix in order for my sound to work. At this point, I really have no use for it.Update: It is working Great through optical connection on my TV. However, its 2.1 surround sound. Netflix sound is now working perfectly", "verified": true, "helpfulness": "3/3", "author": "NotStereoType"}, {"rating": 1.0, "review": "I bought 2 of these because it states it supports Miracast (the ability to throw or \"project\" your PC to the Fire TV stick).  It just won't work between Fire TV Stick and my Lenovo Windows 8.1.  I didnt realize the Roku3 supported this as of October 2014.  It works perfectly on the Roku3, does not work at all Fire TV Stick.Not sure if I will return it.  After using the Fire TV stick for 2 day i would recommend the Roku3 over this product.  It simply has a better interface and the functionality is superior.", "verified": true, "helpfulness": "2/4", "author": "Rudy1150"}, {"rating": 1.0, "review": "Disney Junior not working as that is the main reason I got it", "verified": true, "helpfulness": "1/3", "author": "Karthikeyan"}, {"rating": 5.0, "review": "Love it, excellent quality overall!", "verified": true, "helpfulness": "0/0", "author": "coldhluke"}, {"rating": 4.0, "review": "This is my first amazon TV device. The unboxing and setup was straight forward.  I was surprised that there was an included HDMI extender, which I used, in the lower end option for amazon TV. The device took some time to download the updates but I also received it the same time as a lot of other people so I assume the server(s) were getting hit pretty hard.  I activated all of my shared applications - Pandora, Netflix and Hulu plus.  The connection is seanless and its hard to believe its going over wireless.  I streamed a couple of TV shows and movies and had minimal if any lag time.  I plan on exploring the options of the device more as the weeks go on. I have heard that HBO GO maybe included in the future and that is a feature that I'm really excited about.  This device has replace my smart TV option and the family is loving it.", "verified": true, "helpfulness": "0/0", "author": "Keith Erichsen"}]