[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Richard Durden"}, {"rating": 5.0, "review": "Excelent.", "verified": true, "helpfulness": "0/0", "author": "Cliente de Amazon"}, {"rating": 2.0, "review": "Not real impressed. Issues with getting the apps to run. Changed to a different brand of \"stick\"", "verified": true, "helpfulness": "0/0", "author": "Buzz Bruno"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Aries"}, {"rating": 5.0, "review": "Greatest part of this device is the supplied remote. It comes pretty loaded with almost all the apps needed.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "It does as advertised. Another great Amazon product. Even an electronic naif like me can plug it in and use it.", "verified": true, "helpfulness": "0/0", "author": "Donna Haworth"}, {"rating": 5.0, "review": "Really really a fan.  I have Pandora playing all day in our kitchen on a small TV, and we can transport the USB firestick to the larger TV to do movie night.  Defintely worth $40.  Had problems in the beginning with it drawing off the wi-fi pretty slowly, but it has seemed to have fixed itself after 2 months and has been amazing!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Pekarek"}, {"rating": 4.0, "review": "I have been using it quite some time now.  The only thing is sometimes it just keeps loading the show and then I just have to unplug and plug it again to make it load faster.  Other than that, I don't have any other problem with it.", "verified": true, "helpfulness": "0/0", "author": "Drj2zee"}, {"rating": 1.0, "review": "Worked for a month.  Now blue screen and content disabled .  Looked it up and no real fix.  I am returning", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 1.0, "review": "We have 3 different devices to stream video and this is the worst of them. It freezes, locks up, doesn't connect etc. Spend less money promoting your defective product and fix it!", "verified": false, "helpfulness": "0/0", "author": "Eric Schauer"}]