[{"rating": 4.0, "review": "don't hook cable up to your 2nd (third, fourth...) TV, just plug this in. done.", "verified": true, "helpfulness": "0/0", "author": "oneformula \"oneformula\""}, {"rating": 5.0, "review": "This is by far the most useful online streaming device I have bought. Amazon videos, nexflix, youtube,.... all in one place and of course portable. Any hotel has nowadays HDMI port and bringing this device will allow me to avoid watching useless TV chanels in hotel while traveling. Also attaching it to car Video system will allow kids watch some movies on iphone hotspot! Overall this is a great buy specially if you have prime membership to take advantage of on demand movies that Kids would watch anytime and anywhere.", "verified": true, "helpfulness": "2/2", "author": "Amazon-NJ"}, {"rating": 3.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S. Robinson"}, {"rating": 4.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Skyler Lawrence"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "al"}, {"rating": 5.0, "review": "I really enjoy the shows on Amazon and the ease of use to watch netflix.", "verified": true, "helpfulness": "0/0", "author": "steven culverwell"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "JABALI K. JOHNSON"}, {"rating": 1.0, "review": "Unusable.  At first I thought the issue was that I didn't have a good enough WiFi signal, so I moved it right next to the router.  Now, the thing either freezes up completely or works so slowly and chopily (both problems requiring me to unplug/replug to fix) that it's easier for me to simply boot up my Xbox to watch Netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Jonathan P Olson"}, {"rating": 4.0, "review": "Well worth the price. Easy to install, works great.", "verified": true, "helpfulness": "0/0", "author": "Harry Knowles"}, {"rating": 4.0, "review": "Great price and lots of applications and uses.  I take it with me to hotels to watch and for a guest room to give guest something to watch without having to buy another box.", "verified": true, "helpfulness": "0/0", "author": "VIP910"}]