[{"rating": 3.0, "review": "Its a good device problem is  if you arent close to your wifi it buffers alot other than that i wish i could play  my own media through  usb but overall good device", "verified": true, "helpfulness": "0/0", "author": "Max Steel \"Heat\""}, {"rating": 2.0, "review": "there is a lot of buffering that occurs with this fire stick", "verified": true, "helpfulness": "1/1", "author": "lawrence r allen"}, {"rating": 2.0, "review": "Only had it for 3 days and it went to crap. I would just lightly tap the remote and it would jump all over the screen and randomly select a bunch of items. Very frustrating when trying to navigate or play a game. Tried resetting it, but that didn't work. I think that actually made it worse. Ended up  returning it. Now that I read a few pages of the reviews on both the FireStick and Regular Fire TV, sounds like most of these systems are having this issue. If amazon fixes all the kinks and glitches, I would buy another one and sign up for a prime account.", "verified": true, "helpfulness": "2/2", "author": "Not Happening"}, {"rating": 3.0, "review": "Biggest issue is that there is no VPN app capability. I mean, I have a very portable device that I cannot use outside the U.S.  I'm a Prime Member, so I have paid Amazon for this service, why won't you build in the ability for a VPN. I can watch Amazon streaming video through other devices with a VPN app....why not the Fire Stick. The only use I get from the Fire Stick is Hulu Plus and Netflix (non-U.S.). And because the Fire Stick still connects to the WiFi, I cannot use any mirror app, which would be extremely useful. Additionally the Fire Stick is very glitchy. Not sure why, and it's not the WiFi, but often the picture freezes or the app drops off.  I have to unplug the Fire Stick, it resets, and then it's good for only a short while.", "verified": true, "helpfulness": "0/0", "author": "Risk2210"}, {"rating": 5.0, "review": "Nice little gadget to add to a non smart tv, quick interface and loads fast.", "verified": true, "helpfulness": "0/0", "author": "Edgar"}, {"rating": 3.0, "review": "Nice. I do wish I had the money for the \"spoken\" vocal, remote.  I hate to hunt and peck to search.", "verified": true, "helpfulness": "0/0", "author": "Irisandu2"}, {"rating": 4.0, "review": "Love it . Very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Mrs Jackson"}, {"rating": 3.0, "review": "a bit slow and buggy at times", "verified": true, "helpfulness": "0/0", "author": "Anibal Guzman \"El Bob\""}, {"rating": 5.0, "review": "Awesome item.  Connection was a breeze❗️We were watching a movie within 15 minutes of hook up💥", "verified": true, "helpfulness": "0/0", "author": "barb0710"}, {"rating": 4.0, "review": "A lot of the offerings have monthly charges but there is a lot that is part of the package as well.", "verified": true, "helpfulness": "0/0", "author": "Lynn Primo"}]