[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Flair pens"}, {"rating": 5.0, "review": "Exactly what I wanted it to be. Only downside and this isnt the products fault is that you still have to have cable to get some streaming apps such as watchespn. We were trying to get away from buying cable and this helps alot but not quite 100% there yet.", "verified": true, "helpfulness": "0/0", "author": "Cody Weed"}, {"rating": 4.0, "review": "We really like this thing.  The only drawback I find is that it is an Amazon product.  When you use \"search\" it only searches Amazon Videos.  The Roku would search all the streaming services for you.", "verified": true, "helpfulness": "1/1", "author": "siterkittyutah"}, {"rating": 5.0, "review": "I love the Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amber Thimons"}, {"rating": 5.0, "review": "Absolutely love this thing. Incredibly easy to install - pure plug-and-play once you put in your WIFI password.Picture quality is phenomenal and sound is vivid and clear. The remote is very responsive. An added bonus for me was paying half price as a A Prime pre-order. Strongly recommending you try this out.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "It's fantastic!Sometimes the picture freezes", "verified": true, "helpfulness": "1/1", "author": "Dathan Byrd"}, {"rating": 3.0, "review": "Only thing that bothers me is not having a browser like IE or Chrome or something like that as a service in this TV Stick, rest good. I know atleast 15 friends who did not by Amazon TV Stick just coz it does not have browser.", "verified": true, "helpfulness": "0/0", "author": "Saurabh Pahuja"}, {"rating": 1.0, "review": "Has great promise if you're in the Amazon ecosystem and, for the price, this could be a good purchase if and when Amazon deals with the wi-fi connection issues. It's a widespread problem that is acknowledged by Amazon, but so far they don't have a fix for it. Until they can make this product work reliably, it gets one star. If you're contemplating a purchase, hold off until it's confirmed that they have resolved this.", "verified": true, "helpfulness": "0/1", "author": "Bruce Mc \"Bruce Mc\""}, {"rating": 2.0, "review": "I have two major streaming devices and all the current gen, last gen, last last gen and a few other game systems.  I saw that I could get the Fire stick for $19.99.  I got it for the games.  It arrived today.  I was surprised I had to plus it into the wall.  Not sure why, but I thought it was powered by the USB.I had already gotten a bunch of free games to play.  I turn it on and almost none of the games work.  I thought that all the fire TV games would work on the thing.  I was wrong.  So, that kind of bothered me.  I am sure it says on their site.  But I have 8% of my vision, so I often miss things.  On top of the let down of the limited games that would work, for the few that did, only one of them worked.  It kept telling me I did not have the right controller.  So, they sell you a device that requires you to purchase another device to use it at it's full potential.  That was the second let down.I started the game.  I was shocked.  The thing is so slow.  Of all the devices I have, it is by far the slowest.  On top of that, when it was not slowing way down, the thing would just freeze.  I would just be starting at a frozen screen.  That was it.  I had thought of getting the Fire TV with the controller to play games, but realized that would be rather pointless.  If I have the Fire TV, there is no need for the stick.  Thus, I am returning my Fire TV Stick, whenever UPS picks it up.  This thing was a huge letdown.  If you want this for games, I would highly suggest you get the full Fire TV.I forgot to mention what I did like.  I really liked the setup of the thing.  Everything was easy to see and navigate.  If you are a Prime member, you should check out the Fire TV.  I just can't recommend the stick.", "verified": true, "helpfulness": "0/1", "author": "Joshua Glowzinski \"Gman\""}, {"rating": 4.0, "review": "The firestick is very responsive. Much more so than the Roku stick. The physical remote is a nice touch, too.The sub extender is great.The parts don't feel cheap to me.The user interface could use some work. It's just a wall of tiles, with a very odd hierarchy.When's iOS app coming?", "verified": true, "helpfulness": "0/0", "author": "ChrisandAmy Baunach"}]