[{"rating": 4.0, "review": "Great product. I usually don't like Amazon tech products, have tried, owned or tested many of them. But this one is great. Amazon Instant Video, Netflix, Miracast, etc. all work great. The fact that it doesn't have a native YouTube App (only browser shortcut) takes off that one star for me. I know that is a Google-Amazon 'thing'. Overall highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Rakesh Koul"}, {"rating": 4.0, "review": "Excellent devise and reasonable price.  It would be excellent to have buttons on remote labeled.", "verified": true, "helpfulness": "0/0", "author": "Louise McAdams"}, {"rating": 3.0, "review": "It's a nice little toy but I find issues all the time, think they needed a better QA job on quality.If you leave the device idle for a week or so just using the TV, not the firestick, it locks up, I have to unplug it to reboot it.If you pause for to long and come back and press play, it starts over or start at a much earlier positionESPN: if you press the button above the play/pause instead of play/pause you exit, if you re enter the video stream the back / FF no longer work, you have to exit to the root ESPN menu and restart the video stream and FF to where you were located.So just little thing, but work pretty good, thinking I should have gotten the box", "verified": true, "helpfulness": "0/0", "author": "Owen West \"ozoneauction\""}, {"rating": 5.0, "review": "The Fire TV Stick is great and easy to install.  Very easy to use.  The remote is very basic but works well.  If there is a down side, the remote is very small and is easily misplaced.", "verified": true, "helpfulness": "0/0", "author": "Elisa Spangler"}, {"rating": 1.0, "review": "I wouldn't recommend since it only last exactly  90 days and Amazon did not show interest in replacing it  or fixing it. I waited 7 days for them to respond to my email; however it was great while it work,...", "verified": true, "helpfulness": "1/1", "author": "Francisco Hernandez Jr. \"medisage\""}, {"rating": 5.0, "review": "This little miracle and a Prime membership are a perfect match. It works perfectly well, everything it was advertised to do, everything I hoped it would be. I'm watching a movie right now, in fact.", "verified": true, "helpfulness": "0/0", "author": "KellysHero718"}, {"rating": 5.0, "review": "So simple & works", "verified": false, "helpfulness": "0/0", "author": "Bijan Dabiri"}, {"rating": 5.0, "review": "Has been fun and easy to use. Can take it to friends house and plug in to their hdtv...", "verified": true, "helpfulness": "0/0", "author": "Mallory Yerger"}, {"rating": 5.0, "review": "easy to set up even for this ol gal!", "verified": true, "helpfulness": "0/0", "author": "Standing Tall"}, {"rating": 3.0, "review": "I just purchased this because I wanted to watch Netflix on my bedroom tv instead of the PS3 in the living area. We had trouble with connecting to the Internet at first but my husband was consistent and finally got it to work.  The ease of setup was amazing since I dislike reading instructions. I tend to jump and get it setup and if I have problems I read. The picture quality at first was disappointing but as the picture played the quality increase. I would recommend purchasing because it's inexpensive for the benefits you get.", "verified": true, "helpfulness": "0/0", "author": "S. Robinson"}]