[{"rating": 4.0, "review": "doesn't have all the movies and no soap operas", "verified": true, "helpfulness": "0/0", "author": "Bernadette D."}, {"rating": 3.0, "review": "We have used apple tv for years and never have a problem with the internet connection. Since using this device, we have had a lot of problems with it staying connected to the internet.This product would be great if it would stay connected.", "verified": true, "helpfulness": "0/0", "author": "Chris Civitate"}, {"rating": 5.0, "review": "Good item!", "verified": true, "helpfulness": "0/0", "author": "Mr Sand"}, {"rating": 1.0, "review": "I cannot hook this up to my RCA jacks on my older TV. I can see video but cannot get audio to work. Any help anyone can be would be gratefully appreciated. I called customer service and ordered a box but it did not work leaving me with a fire stick I cannot use", "verified": false, "helpfulness": "0/1", "author": "Kristin Kaminski"}, {"rating": 5.0, "review": "I have a chromecast device as well and am really happy with the improved performance of this device.", "verified": true, "helpfulness": "0/0", "author": "Michael McDonnell"}, {"rating": 1.0, "review": "I am unable to view Seinfeld episodes. This has been reported to the development team and is being worked on for resolution. It has been close to 3 weeks and the Crackle app is still not functioning properly. ALL movies freeze, if I am lucky to get them started. Issue needs resolved.", "verified": true, "helpfulness": "0/0", "author": "ecgreen"}, {"rating": 4.0, "review": "Works well, offers good options to make up for cable.", "verified": true, "helpfulness": "0/0", "author": "LYDIA  WILLIAMS"}, {"rating": 5.0, "review": "Great product for the Price! Great selection of apps. I use it to watch Hulu +, Netflix and Amazon instant video. Works great on all of them!", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 4.0, "review": "So far, so good. Excellent streaming from Netflix, Hulu, HBO Go, etc. without any interruptions. Love the interface as well. The only drawback is accessing the battery compartment on the remote. It needs a better design otherwise it is a struggle to open.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Tammy L. O'Neal"}]