[{"rating": 5.0, "review": "Amazon got it right! I bought the Fire TV Stick during the Prime member sale. At that time I experienced the same WiFi connection problems the many others complained about. I sent it back for a replacement and now its great! No connection problems at all.The playback is far superior than most other similar devices. You don't have to start each program individually unlike BluRay streaming players. Content loads very quickly. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Robert Yale \"Pyro Bob\""}, {"rating": 5.0, "review": "Works great! I love that it comes with a remote and you don't have to use your phone or iPad like you do with Chromecast. I think this device is much easier to use and has more features. I am thinking of purchasing a second device for another TV in my home. Good buy!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "I was fortunate to buy my stick during the 2 day sale for Prime Members. It arrived earlier than Amazon originally forecast it shipping to me and I wasted no time in setting it up. Set up was easy and relatively pain free. I did have to do an update right off the bat but after a few minutes, I was up and running. Easy to navigate, crystal clear image, and load up times are fast. I'm most likely going to buy another one soon. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Fire Stick works as advertised.  I'm quite pleased with the easy set up and overall performance.  The Fire Stick can't be beat by anythingin this price range.  Great product for everyone.", "verified": true, "helpfulness": "0/0", "author": "Robert J Brown"}, {"rating": 4.0, "review": "As advertized", "verified": true, "helpfulness": "0/0", "author": "Marion F Hughes jr"}, {"rating": 5.0, "review": "Listen up cinephiles and tubephiles! What you have been missing in your life is the Fire Stick! I used to hate my Netflix and Amazon menus on my BluRay player, but not anymore! The Fire menu is SO user friendly. You can search by Actor or name and it will locate what app has it immediately. It does all the searching for you in one place. Very excited to see the Showtime Anytime app on here- giving you access to all of Showtime's library, as well as HBO GO. The whole design of the menu is the best I've ever seen on any device, trust me! You may notice when you haven't touched the Fire remote in a few minutes, it will begin a series of screensaver images of the seven wonders, or celestial greeneries, and calming oceans. You may find that after you smoke a little, all you want to do is continue watching this picturesque montage of breathtaking screensavers. The ONLY BAD thing is that it doesn't have a Power Off button! I think they must have forgotten haha. Just unplug it from the wall so it doesn't use up electricity all night. May the Fire be with you!", "verified": false, "helpfulness": "0/0", "author": "Lale Haddadian"}, {"rating": 3.0, "review": "It's OK-I find it very sluggish after using Netflix or Amazon Instant Video. Seems to need more RAM. Perhaps it needs better software optimization but so far it needs some polish.", "verified": true, "helpfulness": "0/0", "author": "P. Craig"}, {"rating": 1.0, "review": "Boxed it up after and sent it off for a return within 30 minutes of trying to get my PC to stream on my tv via the firestick. My sole reason for buying it.", "verified": false, "helpfulness": "1/1", "author": "James Palaszczuk"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 4.0, "review": "is great. Lot of choices in it and good conection.", "verified": true, "helpfulness": "0/0", "author": "Jose A. Mireles"}]