[{"rating": 5.0, "review": "I am a tech dummy and I was able to download it all by myself. I love all the features and they work great. I had a few minutes of trouble figuring out how to \"find\" all the selections. and click on them I gave 4 firesticks as Xmas presents and everbody LOVED it!  I love  being able to stream movies so easily on my 4 year old flat screen.", "verified": true, "helpfulness": "0/0", "author": "Sarah Taylor"}, {"rating": 5.0, "review": "Everything they say it is and more", "verified": true, "helpfulness": "0/0", "author": "Joseph O'Neal"}, {"rating": 5.0, "review": "Amazing what you can do with a Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Before getting the Fire TV Stick wile streaming the picture on my TV was something less then standard definition as for as picture quality is concerned. Now I'm getting something very close to HD. I'm very happy.", "verified": true, "helpfulness": "0/0", "author": "Charles B."}, {"rating": 5.0, "review": "Great product very cool it does everythig", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 4.0, "review": "Simple to set up and use. Program selection froze up a couple of times so have slowed down making changes. Much prefer the optional voice control remote to the one included. Like having my photos from the cloud so easy to access.", "verified": true, "helpfulness": "0/0", "author": "Sidney"}, {"rating": 4.0, "review": "Very easy to use and set up....love the movies but I can rent a new release for less than $2 on red box Compared to the $5.99 on the fire. Overall it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 2.0, "review": "Very patchy wifi connection. Roku3 much better. Bought both at the same time", "verified": true, "helpfulness": "0/0", "author": "Bj's Poultry"}, {"rating": 1.0, "review": "I ordered this because of my love of Amazon and Prime services.  Low and behold... after waiting for a MONTH because the device wasn't available, I was sent a BRICK.  No signal.  Changed HDMI ports, changed power, used the HDMI adapter, NOTHING.  Was told by my Amazon Fire Customer Service representative to plug the fire stick directly into an outlet -- because it supposedly WON'T WORK when plugged into a surge protector!!  Seriously?!?!?  It still didn't work - glad I wasted my time on that \"fix\" to my problem.I'm buying a Roku.  Hope you will too, because Amazon clearly knows how to make basic cables, but they fail at making anything more advanced.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 2.0, "review": "If u like to watch a tv series that has been on for several years or a movie from several years ago  then the Fire Stick is the way to go.I personally prefer watching current tv and movies", "verified": true, "helpfulness": "0/0", "author": "Steven Schwid"}]