[{"rating": 5.0, "review": "Everything I expectedand then some", "verified": true, "helpfulness": "0/0", "author": "John Romaire"}, {"rating": 5.0, "review": "Fire TV stick was a gift to my husband and he loves it.", "verified": true, "helpfulness": "0/0", "author": "Sunny"}, {"rating": 4.0, "review": "It's a cool little device, it's actually pretty amazing what a small piece of electronics equipment like this can do.  The only problem is it's really hard to navigate, for my Amazon prime or my Netflix I found it's easier to browse for the content on my computer put it in my watchlist and then pick it up there on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Victor the inflictor."}, {"rating": 5.0, "review": "So far, so good. My kids have messed around with it. It seems easy to use.  They have found some free games, and all of them have turned their smart phones into remotes for the device. I have prime, and the Fire TV Stick makes using it so much easier. Previously, I would have to hook my laptop up to the tv via cords and cables.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Sloan"}, {"rating": 5.0, "review": "Awesome between the Fire stick with hulu and Netflix and an OTA HD antenna I will be eliminating half of my cable bill. Sorry Comcast you usefulness is becoming limited.", "verified": true, "helpfulness": "0/0", "author": "Longbow2"}, {"rating": 2.0, "review": "Overall, it's nice to be able to stream the Amazon Prime benefit to my TV. I already have an Apple TV (and a smart blu-ray I don't use) to deliver my music, Netflix, and Hulu Plus so I didn't buy this for those.The biggest issue I've had with the device is that the wifi signal from the device significantly interferes with my HDTV antenna signal. I have a high-powered whole-house antenna with amplifier and I live in a major U.S. city, so reception isn't the issue. I finally pinned down the issue being the proximity of the stick to the coax connection on my TV. I can only use the stick if it is at least two feet from the back of the TV, which defeats the design.A few other issues with the device:- The interface is clunky and not easy to navigate- There doesn't appear to be an easy way to put the device to sleep - which is not energy efficient and contributed to my problem above- The Amazon images are a little misleading and do not include the power cord that the device needs to operate", "verified": true, "helpfulness": "1/1", "author": "Eddie D"}, {"rating": 5.0, "review": "We had an old roku and needs something better. Got the fire stick for $20 Bc im a prime member. It's awesome! It's like a chrome cast with a remote plus the interface is way more beautiful. Love this", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Love it.  Better than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Derek"}, {"rating": 2.0, "review": "LOVE THE FIRE TV STICK VS CHROMECAST.... EXCEPT: I am a Directv subscriber and Showtime Anytime App is not supported by Directv, so if you are looking to watch Homeland etc and have DIrectv, YOU CANNOT USE THE STICK!!! Haven't checked all the other apps yet. VERY DISSAPOINTED THIS WAS NOT MADE CLEAR BEFORE PURCHASE!!!!", "verified": true, "helpfulness": "0/0", "author": "Dennis C Alloy"}, {"rating": 3.0, "review": "Can move around the menu faster on the Firestick vs my old Roku device. However, the Firestick does not stream rented movies on Youtube. I had to go back to my Roku to watch The Interview. It's probably a software bug wth the stick because movie streaming works with HuluPlus and Amazon. Amazon device support did not provide any help to troubleshoot the problem", "verified": true, "helpfulness": "0/0", "author": "crud blue"}]