[{"rating": 5.0, "review": "I have a smart TV in my front room I enjoy the features on that.  Have a bedroom TV that I want those features on so I bought this fire stick.  I like the ops on the fire stick better at them on my smart TV.  It is easy to install and easy to work.  I would highly recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Steven VanDyke"}, {"rating": 4.0, "review": "Makes watching my Netflix and Amazon Prime so easy to watch, I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Kiyak"}, {"rating": 5.0, "review": "LOVE!", "verified": true, "helpfulness": "0/0", "author": "chelsea"}, {"rating": 4.0, "review": "I would like a litle different lay out for the catalog. I had netgear and found it more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"The island Princess\""}, {"rating": 4.0, "review": "Connection simple,came pre-assigned to my account. Love it so far. Would like more polished YouTube support. Love the photo app.", "verified": true, "helpfulness": "0/0", "author": "PaulCr125"}, {"rating": 5.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Erik Munson"}, {"rating": 5.0, "review": "Has every app that I like on this fire tv stick, so glad that they came up with this", "verified": true, "helpfulness": "0/0", "author": "lashawn"}, {"rating": 2.0, "review": "I HAVE HAD THE FIRESTICK FOR ABOUT 3 WEEKS AND HAVE YET TO  BE ABLE TO WATCH  ANYTHING, I HAVE SOME GREAT SCREEN SAVERS AND A MENU GUIDE BUT I CANNOT ACCESS THE MENU AND NO AUDIO. I HAVE 1 HDMI PORT SO I BOUGHT A SWITCH/SPLITTER STILL COULD NOT ACCESS ANYTHING.", "verified": true, "helpfulness": "0/0", "author": "Wagner"}, {"rating": 5.0, "review": "It works as promised. Great product.", "verified": true, "helpfulness": "0/0", "author": "Link169"}, {"rating": 5.0, "review": "Bought this for my daughter to stream Netflix. I was a little hesitant after reading a few reviews say without amazon prime that they had issues with it being slow and not streaming Netflix well, but she has had no problems or complaints with it at all! Works PERFECT, just as well as my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Alicia"}]