[{"rating": 5.0, "review": "I was amazed with how fast this thing is.  It would be awesome if loading third party Apps were a little easier.  XMBC/KODI looks fantastic.", "verified": true, "helpfulness": "0/0", "author": "J. fuller"}, {"rating": 4.0, "review": "Easy set up.  Easy to use. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Miguel Sanchez"}, {"rating": 3.0, "review": "If you have kids...The remote is so easily lost- it is small and thin. Ours was gone within a week. We downloaded the app onto our phones but it just does not work as well. It is hard to navigate by swiping, especially for younger kids. Sometimes it wouldn't pick up the commands at all and we wouldn't be able to select anything- it would bounce around. Also, it means handing your phone over to the kids. :/Obviously it is geared toward people with amazon prime with all the prime shows, movies, etc on the home page with the apps. The apps are organized by most recently watched. If we watched something from amazon it would prioritize that over other apps. you would have to scroll past these to select netflix or hulu. I like the organization of the Roku home screen much better because you can organize the apps in any order.There were a lot more glitches with the Fire TV- more frozen scenes, minor skips, and longer loading times. Although this didn't happen every time, it was noticeably more than the Roku. One positive is the profiles on the netflix app that were not available on the Roku.We replaced our three year old Roku box with this, but I think we may be going back. All in all, the Fire Stick is okay. I think it would be better suited towards customers who do not have kids.", "verified": true, "helpfulness": "2/3", "author": "E Greer \"E Greer\""}, {"rating": 5.0, "review": "Great piece of equipment! Easy set up.Turns your dumb TV into a smart TV. Have just tried it with Netflix and Amazon Prime, so far, so good.", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Marsden \"Steve\""}, {"rating": 5.0, "review": "I ordered this on impulse when it was on sale for Prime customers, with really no expectations.  Once we started using it, though, we fell in love and considered giving away the Chromecast that we've been using every day for a year.  The ability to easily stream Amazon Prime to the TV is so good that I think I've finally convinced my significant other to get rid of cable.  Aside from the selection, the remote is really what pushes the Fire TV Stick way past the Chromecast.  I don't have to rely on some buggy app just to pause the TV or switch the song!  For such a small consideration, it's really a huge advantage.  This is a great contender in the under $50 crowd.", "verified": true, "helpfulness": "0/1", "author": "Karen"}, {"rating": 5.0, "review": "This beats the ROKU in ever regard.  I've had zero issues with the device since the simple install.  My children can easily use the device and it has rather robust features for something in this price range.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Eric Rosenthal"}, {"rating": 5.0, "review": "LOVE", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "Beats Apple TV to pieces. Great performance and great UI.", "verified": true, "helpfulness": "0/0", "author": "Mark E. Peltz \"Marked\""}, {"rating": 5.0, "review": "excelente!!!", "verified": true, "helpfulness": "0/0", "author": "Francisco Nuñez"}, {"rating": 5.0, "review": "We are impressed with this TV stick.  It is user friendly and up to date.  It has opened up a whole new world of TV watching for us.", "verified": true, "helpfulness": "0/0", "author": "Sandra D. Beeman \"Sandra in PA\""}]