[{"rating": 5.0, "review": "maybe because i am old.  we didnt get our first tv until i was 12 years old but to me the computer & internet is the greatest thing ever!  i'm pretty much alone, except for cats,  and though i dont go to social networks or chat rooms ,i feel not as alone.anyhow  i got the fire stick for $20 and i have the fire hdx 8.9  and today i played a couple of games on my tv, i have watched a movie with prime(though the horror selection is pretty crappy) and i am just amazed at what technology has done.  i know my way around computers a little but i tell you amazon makes everything so easy.  this would make a wonderful gift for some old granny who is not too technically inclined  that it would be simple to operate.  i love it.and  i dont see me ever not being a loyal amazon customer. thanks amazon", "verified": true, "helpfulness": "0/0", "author": "HRH Spider \"Spider His Royal Heine\""}, {"rating": 5.0, "review": "Absolutely great! So easy to use & install. Got one for home and for my mom and she loves it. I would recommend this over any other it's so easy with its own remote control & plenty of apps.", "verified": true, "helpfulness": "0/0", "author": "Barbara MacDonald"}, {"rating": 5.0, "review": "So clean and fast. Makes chrome cast look like a rip off", "verified": true, "helpfulness": "0/0", "author": "Hector I. Morales \"Isaac Morales\""}, {"rating": 5.0, "review": "Easy set up. Easy to move among options, great product. Made my smart tv even smarter.", "verified": true, "helpfulness": "0/0", "author": "Kelly J. Brinker"}, {"rating": 5.0, "review": "Works great and we all really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great purchase!! We love the build in apps. Wishing that I can mirror Apple devices to it", "verified": true, "helpfulness": "0/0", "author": "Cleofe Intriago"}, {"rating": 4.0, "review": "I bought this to supplement my Google Chromecast with Amazon's good selection of TV shows and movies. This little dongle takes up little space and packs quite a punch in entertainment. The streamlined UI is simple and intuitive to use. I bought this when it was $20, which I consider a great deal. At $40, it's a decent deal, but I would have hesitated to buy it. There are a few reasons for this:- Set up wasn't super easy. It didn't read the device at first. I had to unplug it a few times before it finally would allow me to set it up. It took me about 25 minutes of playing around to finally get it all set up. Chromecast was a lot faster.- It freezes sometimes. Not all the time, but I've had it lag super bad on a few occasions.- Not always reliable. I've tried to watch Netflix and ESPN and it would time out and give me errors. When I switched over to the Chromecast, it worked fine.- It's a first generation device. These quirks and bugs are bound to come up.Overall, its a good product. I've definitely gotten my money's worth for $20. $40 isn't a huge investment, but some of the issues definitely frustrate me. If you have Amazon Prime, it's a great way to watch all the content on your TV instead of your computer. If you don't, I would recommend the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Corey M"}, {"rating": 5.0, "review": "The stick is nice and fast.  You can get voice search through the mobile app and it works great. For the price you can't argue with this performance!", "verified": true, "helpfulness": "0/0", "author": "No! \"schmeekle\""}, {"rating": 5.0, "review": "This is so cool! Got to get one", "verified": false, "helpfulness": "0/0", "author": "eric davis"}, {"rating": 3.0, "review": "only plays music - i thought it would have \"casting\" functionality from laptop to tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]