[{"rating": 4.0, "review": "Only thing keeping it from getting 5 stars.... opening the remote! Finally opened it with a penknife... hopefully the remote has good battery lifw!", "verified": true, "helpfulness": "0/0", "author": "Jana"}, {"rating": 5.0, "review": "Such a cool device! Love it so far!", "verified": true, "helpfulness": "0/0", "author": "toeknee"}, {"rating": 5.0, "review": "Wow made my TV picture look brand new", "verified": true, "helpfulness": "0/0", "author": "Sweet P"}, {"rating": 5.0, "review": "Better than a cable or satellite bill.", "verified": true, "helpfulness": "0/0", "author": "Matthew W Irvin"}, {"rating": 4.0, "review": "Pretty good so far, lags once an a while though.", "verified": true, "helpfulness": "0/0", "author": "seanyy11"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Jerry L Riggins"}, {"rating": 3.0, "review": "I might have been expecting too much from this little device. I planned on using it mainly for Sling TV but, its so slow and lethargic, I probably should have stuck with the regular Fire TV. Coincidentally, I got the Stick from a Sling+Amazon deal. Both Sling and Plex crash at least once a day while streaming. It does Netflix and Hulu well enough. The remote is cheap and flimsy, I may get the Fire TV remote to replace it. I have to use the included wall wart for power, since my new TV doesn't supply enough juice. Kinda disappointing.", "verified": true, "helpfulness": "0/0", "author": "Ethan"}, {"rating": 5.0, "review": "For my kids and they love it", "verified": true, "helpfulness": "0/0", "author": "Cade LaFargue"}, {"rating": 5.0, "review": "Greatest thing since sliced bread.", "verified": true, "helpfulness": "0/0", "author": "DOROTHY MCDERMAID"}, {"rating": 4.0, "review": "Very easy setup, large selection of movies just a lot of them or either outdated far as classic that everyone has seen before, wish it was more new current ones available", "verified": true, "helpfulness": "0/0", "author": "Savonia Adams"}]