[{"rating": 5.0, "review": "This is great!However if you have a gameconsole it might be a little redundant.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Darkz"}, {"rating": 2.0, "review": "Doesn't work well with my wireless, the connection keeps cutting in and out, had to return it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I cannot say enough about this. I gave some as gifts and we kept one. We loved it so much we purchased another one!!", "verified": true, "helpfulness": "0/0", "author": "TERRI MARTIN"}, {"rating": 5.0, "review": "I am very happy with the Fire TV Stick. I had previously purchased a Fire TV and loved it. When the Fire TV Stick went up for sale I decided to pick one up for my father on the off chance he might be interested in what it could do. I'm happy to report that he loves it. It may have been the perfect purchase for him since he is retired and has a lot more time on his hands lately.The device itself is not much different from the Fire TV except for the obvious hardware and software limitations. I was expecting the Fire TV Stick to perform much slower and to be much more limited than it is. After a few weeks of using it and comparing it to it's more expensive sibling I can definitely say I am impressed. I'd definitely recommend this to anyone curious about online streaming. My father is now considering cancelling his cable service completely and just using his Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 1.0, "review": "Streaming is lagged, buffering is horrible. This is not even remotely close to the efficiency of the Chromecast, Roku, or PC.  I wish I could get a refund.  Even with the latest firmware, still stutters and at best shows with pixelation. Sad and disappointing wait for this.", "verified": true, "helpfulness": "0/2", "author": "AdoptAPet \"Adopt a shelter pet PetFinder.\""}, {"rating": 3.0, "review": "It was a great price for $19 to stream to a small TV for the kids.  Interface looks very close to the Plex Home Theater interface (not a bad thing).  However, I personally don't like the navigation.  Beautiful and smooth and you get right to content if you are just running Prime.  However, Hulu, Netflix, etc.. seem to require a few extra clicks. Funny, when I use my brother-in-law's Apple TV or my own Roku I don't have this particular thought.  Maybe it is because I can pick back up on a show from the menu if it was Prime but I can't from another app.  Also lack of support (I don't see this changing anytime soon/ever) for accessing the Google Play Store or any official Google Apps just kills the potential for this beast of a stick.  I bought this stick with the sole purpose of access the Prime content but also Netflix as well and that is it.  So it is serving it's purpose.  However after use, I lost my enthusiasm to buy the $99 Fire TV for my main TV.", "verified": true, "helpfulness": "1/2", "author": "asif"}, {"rating": 2.0, "review": "Would be great if it actually worked without having to hard reboot it every time ( unplug then plug back in ). I have yet to see a post to correct this problem.", "verified": true, "helpfulness": "0/1", "author": "GeorgiaT"}, {"rating": 5.0, "review": "For price and ease of use, I definitely whole-heartedly recommend the Fire TV Stick!I bought Chromecast for my Dad and the Fire Stick for me, and the Fire Stick is definitely the winner in my book. Had it been available when I bought the Chromecast, the Chromecast definitely would have gone back. They offer very similar things, and maybe an advanced user would have more fun with the Chromecast. But when you're trying to help a 64-year-old man use Netflix and HBO Go, the fewer the devices, the better. Showing him how to download the software on his phone and sync it to the TV was way more work than just pointing the Fire Stick's remote at the TV and using menus that look just like cable menus. And now I've downloaded the Fire remote app, so I don't have to go digging through the couch cushions every time the actual remote disappears.Occasionally I have an issue when I've left it on screensaver mode too long: the audio works but the screen is black. Simply unplugging the device and plugging it back in seems to solve the issue. I'll update if it gets any buggier, but I don't anticipate any problems.", "verified": true, "helpfulness": "3/3", "author": "J. Calvert"}, {"rating": 4.0, "review": "Works great, has one of the best interfaces I've seen for a streaming device. Only annoying aspect is how Amazon has a different UI for every app. I don't see why the UI for this Fire Stick can't be applied to the PS4, smart TV etc.", "verified": true, "helpfulness": "0/0", "author": "JCinFL \"JC\""}, {"rating": 5.0, "review": "love it!!! grate price...preorder and save$$$$$$", "verified": true, "helpfulness": "0/0", "author": "MRSR"}]