[{"rating": 5.0, "review": "Great little item...works great..", "verified": true, "helpfulness": "0/0", "author": "Rito Zuniga"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Gerhard Van Rooyen \"HendrinaCM\""}, {"rating": 5.0, "review": "It was effortless to set up & get working.  A lot of content & great quality!!", "verified": true, "helpfulness": "0/0", "author": "Gamer Larry"}, {"rating": 5.0, "review": "The power stick  was exceptional I am well please with it use.", "verified": true, "helpfulness": "0/0", "author": "warren mingleton"}, {"rating": 5.0, "review": "I've only had my fire stick a few weeks but so far so good. I haven't had any trouble watching shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as advertised!", "verified": true, "helpfulness": "0/0", "author": "Yap Wai Sung"}, {"rating": 5.0, "review": "i love it. just need to learn how to use all the different things you can do with it. the Amazon team is amazing when i call for help.", "verified": true, "helpfulness": "0/0", "author": "maria minic"}, {"rating": 5.0, "review": "While in search for something I could use while I have an extended stay at a hotel to watch my Netflix, I came upon this life saver! I have a Roku and absolutely love it. I was very excited to get my Roku plugged into my hotel TV room so I could continue watching my TV show and then I realized it wasn't connecting to Netflix. I didn't understand why and started googling (since I had already started paying $5 a day for video capable streaming Wi-Fi..) I realized I couldn't bypass the hotel screen where I have to enter my hotel room and name on the Roku. I then found the Amazon Fire TV Stick and how the new updated version WAS able to get to the screen for you to type what you need to! IT WORKED! I absolutely love it. Has almost all and maybe even more features than the Roku and I have no connection problems at all. It's a great little device and for $39.95 at Best Buy, you can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Marisa"}, {"rating": 1.0, "review": "YOU KNOW THOSE FIRST GEN PIECE OF CRAP SMART TVS????? YEAH THIS IS THAT> I don't know who's fault it is-- TIME WARNER or AMAZON but this product is a piece of sh*t. The interface is so incredibly delayed. You clock right and 2 seconds later it works. It often just crashes out of apps and I have to restart. Just like all big business it used to be cool when it was new. Now that its top dog its an evil company. Walmart and Amazon are taking meetings hell.", "verified": true, "helpfulness": "0/0", "author": "Alec Mahon"}, {"rating": 1.0, "review": "This product could be great if I could log onto my network. It tells me it can't log onto my network. then it tells me it can't contact Amazon....Wish there was a telephone # i could call for support. I've done everything it says to do on the amazon.com/devicesupport web site. No luck. If I don't get hooked up soon. I will be returning this item. :-(", "verified": true, "helpfulness": "0/1", "author": "Dara Poche"}]