[{"rating": 5.0, "review": "Great little device! Much more affordable than others with better quality. Amazon had done it again!", "verified": true, "helpfulness": "0/0", "author": "Jalene Vasquez"}, {"rating": 3.0, "review": "The interface is a bit complicated and slow and the apps tend to be glitchy. Also, the HBOgo on the Fire Stick does not work if you have Comcast internet", "verified": true, "helpfulness": "0/0", "author": "Mariano R. Garcia"}, {"rating": 5.0, "review": "No need to ever have cable again. All you need is Netflix, Hulu and the fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Marianne Peterson"}, {"rating": 5.0, "review": "Amazing,got it for my mother and she loves it!!!", "verified": true, "helpfulness": "0/0", "author": "Raymond Genova"}, {"rating": 5.0, "review": "So easy set up and use! I have had it less than a week, and have already it daily. It's also the easiest way to use Amazon Prime videos!", "verified": true, "helpfulness": "0/0", "author": "V. Marshall"}, {"rating": 5.0, "review": "Well right from the beginning . it is an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Lori G"}, {"rating": 5.0, "review": "This is one of the niftiest items I've used to facilitate computer-to-TV streaming video.  It's very small and weighs a couple of ounces; it's easy to use and makes movie watching a breeze.", "verified": true, "helpfulness": "0/0", "author": "bonnie brooklyn girl"}, {"rating": 5.0, "review": "Best gift I ever bought my husband. He loves the easy access to all the free Amazon Prime content on his flat screen (though not a smart tv). He had been systematically working his way through all the HBO episodes he missed. Now if I could only get him to watch while on the treadmill instead of in a recliner.....", "verified": true, "helpfulness": "0/0", "author": "Gia Mom \"Busy Mom\""}, {"rating": 5.0, "review": "We have a smart TV in my granddaughters room that includes Amazon Instant Videos and other stuff. We also have a WII attached to 1 TV in the master bedroom that allows us to access Amazon Instant Videos. We used to move the WII between the master bedroom TV & big screen TV in the family room and that was a pain. Now we have the Fire TV Stick in the family room on the big screen and its NICE!! We have not had any problems with it. I downloaded the Fire TV Stick remote app to my cell phone and it works. We can now jump from room to room and keep watch Amazon videos.", "verified": true, "helpfulness": "0/0", "author": "Read Salot \"Read Salot\""}, {"rating": 5.0, "review": "I have the Roku box.  But I find it always freezes up on me.  Always have to reset the remote.  After reading the reviews on the Fire TV stick, I have decided to try it.  The stick is fantastic, no more freezing up and no more Roku for me.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Helen S"}]