[{"rating": 4.0, "review": "I misunderstood the abilities of this device and thought I could see regular TV and other channels without cable but it isn't that powerful.  It is great for movies and netflix however.", "verified": true, "helpfulness": "0/0", "author": "Bertha Wallace"}, {"rating": 5.0, "review": "I love the Fire Stick...Surfing for movies and shows has never been easier!!!", "verified": true, "helpfulness": "0/0", "author": "Melissa E. Corbin \"mcorbin34\""}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Ms. Amber R. Pombrio"}, {"rating": 5.0, "review": "I HAVEN'T USED IT YET.", "verified": true, "helpfulness": "0/0", "author": "Ricky King"}, {"rating": 5.0, "review": "Everything  I expected!", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "easy set up for the kids TV.  lots of channels.  perfect to binge watch shows-better than cable", "verified": true, "helpfulness": "0/0", "author": "Dbeautyangel"}, {"rating": 5.0, "review": "Better than Roku...easy hookup...reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "royce johnson"}, {"rating": 3.0, "review": "It's not all it's advertised it should be. Once I finally received my long-awaited purchase, I installed it right away (of course). Then the problems began... ***(If you intend to buy one, read all of this)***1) It appears that my T.V.'s HDMI port does not provide enough power for the device. That's okay, the device comes w/its own cord and brick (nice and pretty/shiny).2) Device does not work, at all, with the HDMI extension cord included with device. This a big problem as the ports are recessed. The device was a very snug fit in order to plug directly into the HDMI port.3) When the T.V.'s USB port did not provide enough power to the device, I, naturally, used the brick that was supplied with, and recommended for, the device. All should be well, right?4) Using the included micro-usb cable plugged into the included \"Amazon\" AC power adapter I get the following message (paraphrased) when the device finally boots up, \"You do not have enough power for your device. Please use the power supply provided by Amazon. Press \"Select\" button to continue without it.\" So, I pressed continue.5) I have a 30Mbps service, yet this device spends a great deal of time caching. Sometimes, it crashes the program I am viewing (mostly: Hulu Plus). There is not a time/day/service/show that does not hesitate/stutter/stall. The only thing that does not hesitate are, naturally, commercials (imagine that).", "verified": true, "helpfulness": "0/0", "author": "ColoRad0 \"Honorous Supremous Omne - Honor Above All Things, ColoRad0 (since 1987)\""}, {"rating": 5.0, "review": "better than chromcast", "verified": true, "helpfulness": "0/0", "author": "Travis Frayard"}, {"rating": 5.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}]