[{"rating": 5.0, "review": "Better than the Roku stick. Not better than the Roku 3. But that's not a fair fight. I like the chromecast... However having a dedicated remote is nice. So in the end, for a cheapish media player/bridge... This thing works well.At the 19 I paid I would order a few more. At 40... I have to mull it over.", "verified": true, "helpfulness": "0/0", "author": "Kris Hamilton"}, {"rating": 2.0, "review": "Wont connect to the internet for more than 15 seconds at a time", "verified": true, "helpfulness": "0/0", "author": "Janice M. Parro"}, {"rating": 5.0, "review": "Easy setup. Ideal for an Amazon Prime member", "verified": true, "helpfulness": "0/0", "author": "sure2rain"}, {"rating": 5.0, "review": "Easy to install. Great item Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ben Ouziel"}, {"rating": 5.0, "review": "This is a very awesome product. We had a chromecast, the fire beats it, hands down!", "verified": true, "helpfulness": "0/0", "author": "Dan L. Wilson \"Danno\""}, {"rating": 3.0, "review": "It is only worth 20 dollars which is what I paid thank god.", "verified": true, "helpfulness": "0/0", "author": "sydney king"}, {"rating": 4.0, "review": "Used Chromcast for a year, Fire TV stick is superior, although I haven't found the volume control yet. I was disappointed in the Chromecast because I was working out of town for several months, and the hotel network would not let my phone talk to the Chromecast. I hope the Fire TV stick doesn't have the same issue between the stick and the remote..", "verified": true, "helpfulness": "0/0", "author": "Tjscali \"Student\""}, {"rating": 5.0, "review": "Excellent product.I have a Roku, a Chromecast and a Fire TV Stick. I primarily use it for Netflix and Amazon Prime.The Fire TV stick is the best of the three. The remote makes it better than Chromecast and it seems faster and easier to use than the Roku. It's also the newest of the three. These things do tend to improve over time.", "verified": true, "helpfulness": "0/0", "author": "Jemmie Wang"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "sara \"sara\""}, {"rating": 5.0, "review": "it's great I love it. had no problems installing it or anything easy as 123.", "verified": true, "helpfulness": "0/0", "author": "nice and easy \"randy\""}]