[{"rating": 1.0, "review": "I can get Amazon Prime movies to work but not Netflix...which has better movies.  It always says \"aan error has occured with this program, please try another\" and it does that for every program...so far it is a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 4.0, "review": "It's got some bugs but overall I am very impressed with all of the amazing things this little device can do.  If twenty years ago I had shown someone this device and demonstrated it in action I would have been called a witch.  Or whatever they call a witch who is a dude.The Netflix part of it has been a little choppy lately but I suppose that's not why Amazon sold these devices.  They want you to buy Amazon content and my Amazon Prime video watching has been pretty flawless unless I am having internet issues.", "verified": true, "helpfulness": "0/0", "author": "Travis Gagnon \"Rebel With A Camera\""}, {"rating": 5.0, "review": "We pre-ordered this when it first appeared, and have been really pleased with the ease with which we can watch Prime movies and TV shows! We used to hook up my laptop to the TV with an HDMI cable. But it was a bit inconvenient, and I couldn't use the computer while we were watching TV.  We have since purchased the larger AFTV unit with remote control for our family room TV.", "verified": true, "helpfulness": "0/0", "author": "Tom S. \"Math Rookie\""}, {"rating": 4.0, "review": "Easy install. Great video instructions!", "verified": true, "helpfulness": "0/0", "author": "Billy"}, {"rating": 5.0, "review": "Was really surprised how easy it was to install and running in no time. Works as advertised. Completely satisfied", "verified": true, "helpfulness": "0/0", "author": "Tom Maldonado"}, {"rating": 2.0, "review": "I had a real hard time to connect the stick to the internet. Finally after spending many hours It was connected. But  now every time I turn it on I have to rescan for connection to WIFI again (5 to 10 minutes). As a matter of fact I am planning to return it. I noticed a lot of people had this problem. Just Google it.", "verified": true, "helpfulness": "0/0", "author": "Bijan G. Tabrizi \"Bitab\""}, {"rating": 4.0, "review": "have not used it much as yet, comes up on TV screen faster than what I did have", "verified": true, "helpfulness": "0/0", "author": "Anthony Tremblay"}, {"rating": 3.0, "review": "Great product not happy that the plug is so short. Even with the extender which is very short as well. Make a longer cord and I'll give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Leslee Ferran"}, {"rating": 4.0, "review": "Very easy to set up, basically a plug and play.  Lots of the popular items (Pandora, Hulu, Netflix), I hear HBO Go is coming soon.", "verified": true, "helpfulness": "0/0", "author": "Greg Hibbard"}, {"rating": 4.0, "review": "So far this is my favorite streaming device. It supports 5.1 audio, Prime Video, Netflix, Sling and Kodi. The interface is modern looking and snappy.", "verified": true, "helpfulness": "0/0", "author": "Eric"}]