[{"rating": 1.0, "review": "I was very disappointed with the Firestick. It was not advertised that you had to purchase movies. Only that you could stream free. Real big issue with me. I love Amazon  but you need to make it clear that you must buy the better movies.", "verified": true, "helpfulness": "0/0", "author": "S.A. McCaffrey"}, {"rating": 5.0, "review": "Really easy setup and excellent performance.", "verified": true, "helpfulness": "0/0", "author": "TOP \"TOP\""}, {"rating": 5.0, "review": "I love this thing. So easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "CASSANDRA J. TRICE"}, {"rating": 5.0, "review": "Excellent alternative to Netflix and Hulu... Costs less than carrying those plus I've found much better content.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Lockhart"}, {"rating": 2.0, "review": "I've had this a few months now and I really do have a love hate relationship going with it. When it works, its great, but man on man does it give me hassles with wifi. I get error messages saying it's not connected to the wifi and to \"Check Network Settings\" only to check and it's say connected and strength is very good. Or your connection is to slow and wont play the show. EVERYTHING wifi in my house works great BUT this device. The Fire stick and my Wifi router are less than a foot apart. I'm not sure what the deal is with this Fire Stick but I'm giving up and buying the Roku 3", "verified": true, "helpfulness": "1/1", "author": "Weescottishboy"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Pam Kilby"}, {"rating": 4.0, "review": "great for travel put in the hotel room TV and watch what you want over the Internet", "verified": true, "helpfulness": "0/0", "author": "Jim Tyler"}, {"rating": 4.0, "review": "A sweetheart of a memory stick. The operating system is still a little dodgy,hopefully they'll fix this.", "verified": true, "helpfulness": "0/0", "author": "R. Zeek Seseika"}, {"rating": 5.0, "review": "Man, this thing works well.  I have an older, store-brand TV in the bedroom, and this plugged in and worked fine.  The TV I have supports 1080 resolution and had an HDMI port, but I thought it would be too old given what the item description says.  It took me longer to find my stupid router password than to set the thing up.  To be honest, I just changed the password and then updated our half dozen other networked devices as I could not get the older password to work or whatever....  Now, I am wondering why I paid so much extra for a \"smart TV\" for the living room when I could've gotten the same quality in a \"dumb\" one and just added something like this.  Live and learn.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "August 2015 Update: REALLY DISLIKE THIS FIRE STICK! : I wish I could give it Zero Stars. Within about two months (of course, after the 30 day return period), it stutters & stalls & freezes - I have to constantly unplug it to reset it. FORGET ABOUT A GOOD BINGE VIEWING RAINY DAY - having to reset it is enough to drive one crazy!  I really, really, REALLY do NOT like it. / Original Review: Do NOT order the SLING TV / FIRE STICK Bundle !! I got on Amazon to order a new streaming device because after 5 years my netgear is done. I wanted to upgrade to a Roku streaming stick. Well, the promo for \"Buy 3 months of Sling TV & get a free Fire Stick\" popped up, so I checked it out & researched the Fire Stick & decided to try it. I paid the $65 for Sling TV, but then when went to order the Fire Stick, it is not even available until the end of April, first of May. So, I immediately called Sling TV to cancel because they do not have a \"freeze your service option\" & I wouldn't be able to use it until the stick gets here in May (I was going to reorder when they were back in stock). Well, Roxanne at Sling, then the Supervisor Joe at Sling, refused to refund my money. So, I gave them $65 fifteen minutes before I called them  for something I cannot use until MAY & then I will not get three months worth of service out of it that I paid for. That is NOT the way to treat customers when you're trying to build a business!", "verified": true, "helpfulness": "0/0", "author": "SK \"SK\""}]