[{"rating": 5.0, "review": "Best TV streaming option.  I love that this comes with a remote but you can also control with your phone if you choose.  My 7yr old uses this with no assistance needed.  It has games as well.  We have owned Google chromecast and it was terrible and inconsistent.  We replaced it with fire stick.", "verified": true, "helpfulness": "0/0", "author": "Candicesmith"}, {"rating": 4.0, "review": "Works as advertised. Some confusion initially as to how to get the Fire Stick to power on after it goes into auto-sleep mode. (Must press the enter key while in sleep mode to get the HDMI port to recognize the device.)  Also, Amazon please expedite the ability to sign-in to hotel and other 3rd party networks such as Comcast's Xfiniti public hot spots. Need some sort of webpage to allow entry of login credentials. (Reportedly in the works.)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"texas oilman\""}, {"rating": 5.0, "review": "Love love love it, easy to use", "verified": true, "helpfulness": "0/0", "author": "kim baise"}, {"rating": 5.0, "review": "I LOVE my Fire Stick! It was very easy to set up and is very easy to use in general.", "verified": true, "helpfulness": "0/0", "author": "Adrianne S."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "April Christensen"}, {"rating": 5.0, "review": "I love the Fire Stick! I bought the Chrome Cast and it was difficult to use, and was disappointed that Amazon Video was not available. Setup was very simple and the remote makes it very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Jennifer J. Clark"}, {"rating": 5.0, "review": "So glad we got this.  We had Chromecast, but this allows us to watch everything we did with Chromecast plus Amazon prime movies.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Chelsea J Kinney \"Ucsoftball24\""}, {"rating": 1.0, "review": "Not happy with the fact that the advertised picture doesn't show the entire product.The fact that a separate USB cable andA/C adapter are needed gave me no advantage over my Roku 3I had to snake new wires through my wall in order to keep the wireless look to my wall mounted tv", "verified": true, "helpfulness": "1/1", "author": "My man Shane!"}, {"rating": 5.0, "review": "Love it! However a lot of the movies on Prime Video (where you have to pay) can be obtained from Netflex on DVD (for free) if you subscribe to their service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Unless you pay for Prime, there is basically no movies. And if you don't have a cable provider, you can't get Disney, Showtime, etc.", "verified": true, "helpfulness": "0/0", "author": "Joseph Miller"}]