[{"rating": 2.0, "review": "I'm working abroad for the military. When I ordered the Amazon Fire TV Stick I didn't expect that every channel/application is Geographic Content Restricted. Except Netflix that's working fine.If somebody has any suggestions, please let me know.", "verified": true, "helpfulness": "0/0", "author": "Jansen"}, {"rating": 5.0, "review": "Workes super", "verified": true, "helpfulness": "0/0", "author": "Anna Sommers"}, {"rating": 1.0, "review": "Constantly drops WiFi signal mean while  every other device is still working. I own a fire tv that I moved to the room where the fire stick was and I have had no issues. I hate this thing, I should have bought another fire tv!", "verified": true, "helpfulness": "0/0", "author": "Richard M. Perryii \"Crazy2sigmapi99\""}, {"rating": 4.0, "review": "Excellent ^0^", "verified": true, "helpfulness": "0/0", "author": "Mikyung Nam"}, {"rating": 4.0, "review": "Compared to purple product - I found the controller to be less sturdy and seemingly \"cheaper\".  I was disappointed in that I could not find some of the apps to which I had become accustomed on the purple competitor.  Font size in menus was difficult to read from a distance at which most large screen TVs are viewed. Basically, I found nothing advantageous to this stick versus the purple competitor.", "verified": true, "helpfulness": "0/0", "author": "steven c. martz"}, {"rating": 5.0, "review": "100% recomendado", "verified": true, "helpfulness": "0/0", "author": "hespina"}, {"rating": 5.0, "review": "I love how it came already setup with my info", "verified": true, "helpfulness": "0/0", "author": "anthony ranze"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "This is literature the most amazing little device! We had a TV in our house that was never used. Initially I was looking into purchasing a blue ray player with WiFi capabilities, but came across this first. It was a perfect fit! We can now watch Netflix, HBO, stream music, and even Web videos instantly. Awesome purchase and great price", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it!!  The more I learn about it the more I adore it.  I am sure as I continue to use the Amazon Fire TV Stick my satisfaction will continually increase.", "verified": true, "helpfulness": "0/0", "author": "Roberta Johnson"}]