[{"rating": 5.0, "review": "So far so good, waiting for the IOS app", "verified": true, "helpfulness": "0/0", "author": "David M. B"}, {"rating": 5.0, "review": "Clear, simple - very satisfactory.", "verified": true, "helpfulness": "1/1", "author": "Helen Wilson"}, {"rating": 4.0, "review": "After already having a Chromecast...my early assessment of the Fire TV Stick is positive. At $19.99 (2-day special) I cannot justify giving this device less than 4 stars. I have been using it for a few days now with no hiccups.", "verified": true, "helpfulness": "0/0", "author": "Ikenna Okonkwo"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "1/1", "author": "Mark Zavattaro"}, {"rating": 5.0, "review": "Awesome streaming device. Very easy to use and i really like that I can take it with me easily when I travel.", "verified": true, "helpfulness": "0/0", "author": "Jeff Miracle"}, {"rating": 4.0, "review": "The gadget works great, though now that I have it, I'm not sure why I bought it, other than the $19.95 introductory price.  I can already access most of the features on my TV and through my PS4.  Yes, i am a gadget-holic.  Anyway, setup was simple, and Fire TV Stick is simple to use and navigate.  The only reason I'm deducting a star is that the batteries that came with the remote were DOA.  Come on Amazon.  You make a bazillion dollars a year and you're skimping on batteries?", "verified": true, "helpfulness": "0/0", "author": "Carnac767"}, {"rating": 4.0, "review": "Proximity to wi-fi seems to be key in the smooth operation of this device. I like it, but don't love it--sometimes the load is glitchy and slow. This is probably more due to my system than the Fire TV Stick. Glad for the access to Amazon Prime content.", "verified": true, "helpfulness": "0/0", "author": "TLH \"TanyaLee\""}, {"rating": 4.0, "review": "Navigation is a little slugish, but overall great device so far.", "verified": true, "helpfulness": "0/0", "author": "Ryan Vanzandt"}, {"rating": 5.0, "review": "Great deal for the $20 I paid for it.  Fast and smooth.", "verified": true, "helpfulness": "0/0", "author": "Jason S."}, {"rating": 5.0, "review": "Works as well as the fire TV box that I have in another room. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "William Owens"}]