[{"rating": 5.0, "review": "Having s great time using Fire stick. It's simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Polkadot40"}, {"rating": 4.0, "review": "Mostly I like the space saving for our kitchen TV. No more Blue Ray player to watch Netflix.  We can also take our Netflix traveling with us on vacation.", "verified": true, "helpfulness": "0/0", "author": "Maria DeVore"}, {"rating": 1.0, "review": "This streaming stick worked great, at first, but is now useless. It either won't connect at all, or will allow a show to begin streaming and then buffer until it loses signal. And the problem is not our WiFi because I can stream anything on my smart phone or kindle in the same room the fire stick is in. Such a disappointment.", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "We are still learning how to master it. But overall it pretty cool device. We see not that savvy with electronics.", "verified": true, "helpfulness": "0/0", "author": "brenda phillips"}, {"rating": 5.0, "review": "Works awesome! Loads movies fast. This works better than my smart tv. Great bargain at $34. Purchased for my parents so they could watch Netflix & Amazon Prime. They are enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 5.0, "review": "Working good", "verified": true, "helpfulness": "0/0", "author": "jose rios"}, {"rating": 5.0, "review": "This was easy to install and no we can get Prime, Netflix, and Hulu Plus in the bedroom where we don't have cable.", "verified": true, "helpfulness": "0/0", "author": "Socalkayaker"}, {"rating": 3.0, "review": "Fast accusition but the interface needs and update kinda clunky", "verified": true, "helpfulness": "0/0", "author": "Claimjumper"}, {"rating": 5.0, "review": "Love the Fire Stick! We have a Samsung Smart TV, and unfortunately many apps were missing from their App Store. We decided then we would need a streaming device to augment Samsung's shortcomings. After much debate and comparison we settled on the Fire Stick. It's been fantastic! We now have all the apps we could want or need! It's a no brainier with a Prime membership, we love the added features of getting to stream Prime music and see all our Amazon Photos on the TV.", "verified": true, "helpfulness": "0/0", "author": "Y"}, {"rating": 5.0, "review": "very prompt, does as programmed,  love it", "verified": true, "helpfulness": "0/0", "author": "ANTHONY DEORIO"}]