[{"rating": 5.0, "review": "35 bucks and it makes you tv into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Travisi"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Loretta Childs"}, {"rating": 4.0, "review": "I wanted the Fire Stick for three main purposes: Netflix, Youtube and Kodi XBMC. All of the run great with no issues at all nor lags. Of course, in order to install xbmc you need to read some tutorials because it's not on the Amazon Store. It would be great if you could access the Play Store instead of the Amazon Store.", "verified": true, "helpfulness": "0/0", "author": "galbin \"galbin\""}, {"rating": 5.0, "review": "I need to buy a couple more, GREAT product", "verified": true, "helpfulness": "0/0", "author": "Hansford22"}, {"rating": 5.0, "review": "It is fantastic. Turned my regular t.v. into a smat t.v.", "verified": true, "helpfulness": "0/0", "author": "Irma M. Nunez"}, {"rating": 5.0, "review": "Not only is this little devices one of the coolest gadgets to come along in a long time but it's ridiculous all of the things it does for the money. It's also packaged so well that I can't bring myself to discard anything either. The slam dunk clincher is the smart phone App which makes this thing a joy to use. A+. Way to go Amazon engineers!", "verified": true, "helpfulness": "0/0", "author": "Ed K."}, {"rating": 5.0, "review": "My favorite thing since Betty White!!  We have no connection problems like people have reported.  I've never had a problem with keeping network.  The remote is small, so it is lost easily in my house!  The plus side to this is, you can work the fire stick from an app that is available for just about any phone or tablet!  I've had to do this a couple times, but luckily we've found the remote each time :)", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "MILO"}, {"rating": 5.0, "review": "The Fire TV Stick is great!  It seems to do everything I could want from a streaming device. Installation and setup was quick and easy. The interface is clean and fast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Cindy"}]