[{"rating": 5.0, "review": "Works great canceled tv and just have WiFi now and its all I need no problems what so ever", "verified": true, "helpfulness": "0/0", "author": "Blake kaiser"}, {"rating": 2.0, "review": "Not as user friendly as Roku (it's TOO dumbed down), and doesn't have some of my favorite apps (which compete with Amazon's services). I'll be replacing it soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon customer"}, {"rating": 5.0, "review": "Pictures come in better than Direct tv", "verified": true, "helpfulness": "0/0", "author": "Billy Charles Hair"}, {"rating": 5.0, "review": "The Fire Stick is incredible!  This has made watching television a one remote experience.  Now I can bounce instantly from Netflix, Prime, PBS and all my other favorites.  Wonderful movies, old and new;  there for the browsing for the perfect choice!  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "carol a macdonald"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "Sharon Cardoso"}, {"rating": 5.0, "review": "I was impressed with the Fire TV stick. Small package, low price, but lots of functionality especially if you're an Amazon Prime member.Installation could not have been easier - plug it in, connect to power, set up WiFi and you're done!The user interface is fairly conventional (a grid), but easy to use and laid out well. The remote is very well-designed - small and uncomplicated, but has all the functions you might wish for in logical places. I wish it were backlighted, though. Black on black is hard to see in a dark room. I like remotes better than controlling my TV with my phone for some reason. Maybe it's this: Picking something to watch is a quite social activity, and best done on the big screen where everybody can see what's being considered. Either that or my aging eyes!Amazon's video streaming is great - titles start very quickly, and playback is stable HD (I have a decent internet connection though, so your mileage may vary).The stick supports a large number of apps including Netflix, but also obscure stuff like \"Deutsche Welle\". HBO Go is there, too, but apparently Comcast can't allow me to use it on this device. It works if you subscribe to HBO with other cable providers. Can't wait to cut these guys out of the loop!A few days ago, I had a problem with the Amazon Music app. After using it for while, all of a sudden my purchased music disappeared from the menu without a trace. Could not figure it out myself, so called tech support. I got to level-3 support within 10 minutes, and had it fixed within 15 (the solution was to clear the cache of the app, which can be done in a pretty obscure spot in the Settings menu). A good experience.All in all, I'm very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Christian Kaiser"}, {"rating": 2.0, "review": "It's very complicated to use with my TV and Comcast.", "verified": true, "helpfulness": "0/0", "author": "Diana Bond-Murphy"}, {"rating": 2.0, "review": "DON'T BUY NOW.  in the first two weeks, I would have given it 4 stars.  Plugged it in, setup the router information and away we went. Moved my Roku upstairs to the old TV that didn't support hdmi. Watch on Prime, Crackle and Netflix with no problems.  Then this week, started dropping internet connection. laptops in the house worked fine.  Roku 20 feet further away, no problem.  Fire Stick.  No Internet connection.  Network Setup screen claim \"very good\"strength.  Checked on-line and found loads of complaints. Other users have reported that that Amazon \"is aware of the problem and is working to correct it\"  In other words wait for version 2", "verified": true, "helpfulness": "0/0", "author": "Allan Lindsay"}, {"rating": 5.0, "review": "Tons of fun ...Easy to use! It's biased toward Prime....but works very well with Hulu Plus, Netflix and other services. I enjoy the remote and don't seem to get as many \"buffering\" lags when using Hulu or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Michiganian"}, {"rating": 2.0, "review": "seems to need the router w/i 10 feet...", "verified": true, "helpfulness": "0/0", "author": "Parzival"}]