[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "William K."}, {"rating": 1.0, "review": "Constantly losing wifi connection. Would not recommend it.", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 5.0, "review": "yep. its awesome. I wasn't sure if this was exactly what I wanted, but the price point convinced me to try. And I love it. It plugged in & worked SO easily instantly!! There were even more channels than mentioned and the lay out may it fun & easy to find what I wanted! everything loaded quickly and looked great on my tv.  ...I can see how the amazon tv would be an upgrade. some of the apps took a few minutes to load (but I didn't mind waiting since it was a one time download) And once they were loaded programs were brought up quickly. I'm guessing with the amazon tv box apps would load much quicker & you could load more which would be nice but I think this is a great item too.I love that the stick is portable and now that I know how much I love the layout & format and how easy it is to use I think I will ALSO purchase the amazon tv box. :)", "verified": true, "helpfulness": "0/0", "author": "B. Crickets \"not opinionated yet\""}, {"rating": 4.0, "review": "Works for me !!", "verified": true, "helpfulness": "0/0", "author": "anup"}, {"rating": 4.0, "review": "Love this and it is very affordable .", "verified": true, "helpfulness": "0/0", "author": "Lo"}, {"rating": 5.0, "review": "Love the Fire TV Stick.  Very easy to install and very easy to use.  Awesome for the money", "verified": true, "helpfulness": "0/0", "author": "Chrissy"}, {"rating": 5.0, "review": "So far its worked perfect. No issues at all. I just need to buy another one for the TV upstairs.", "verified": true, "helpfulness": "0/0", "author": "Santino G Holnagel"}, {"rating": 3.0, "review": "Really great product, especially compared with the Chromecast that I also bought since you don't need your computer at all to use it. Yet, the connectivity is a desaster. If you are more than 15 feet away from the router the TV stick will loose the signal very frequently or lag a lot, making it unusable.  Also, it would be great to have volume control on the remote to totally get rid of the TV remote.", "verified": true, "helpfulness": "0/0", "author": "Nico Lub"}, {"rating": 5.0, "review": "It was easy to hook up and seems to do what the Roku does.", "verified": true, "helpfulness": "0/0", "author": "Christy Boyer"}, {"rating": 5.0, "review": "Love this fireTV stick!  So easy to set up or change location.", "verified": true, "helpfulness": "0/0", "author": "Jeanne Dainis"}]