[{"rating": 5.0, "review": "Love it! I like the fact that I can watch Amazon Instant videos and Netflix. The remote is very convenient.", "verified": true, "helpfulness": "0/0", "author": "Sha"}, {"rating": 5.0, "review": "This device replaces a first generation \"Brand X\" unit, which has become technology past its time.  The Fire Stick is a quick set up, comes with everything, and works great.  I bought another one to update the other TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Value Appreciator"}, {"rating": 2.0, "review": "Had this for 6 months....for the first few it was decent with the occasional connection issues, no big deal. Then, about 2 months ago nothing but crappy connection and constant buffering and freezing. Thought it was my WiFi at first but my apple TV worked flawlessly. The fire TV stick just isn't good. Plain and simple. If you want a streaming stick go with ROKU it's much better and I haven't had a single issue. If you want amazon, shell out the extra dough for the regular FIRE TV.", "verified": false, "helpfulness": "0/0", "author": "W. Rapanault"}, {"rating": 4.0, "review": "I am loving my Amazon Fire Stick. We ended up having to use the dongle provided because without it the stick would pause and buffer. The stick was definitely worth the purchase. We were able to cut the cable cord for television and rely completely on the stick.", "verified": true, "helpfulness": "0/0", "author": "Holli B."}, {"rating": 5.0, "review": "works great, easy to install, fast shipping fantastic service.", "verified": true, "helpfulness": "0/0", "author": "Daniel Kovacs"}, {"rating": 5.0, "review": "Works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Aiza S. Blanchard"}, {"rating": 5.0, "review": "Quite fast in execution.  It has a sleep function they don't tell you about, so you don't have to pull the power plug when you are done with it.  The offering is certainly good.  Looking forward to using sling when football season starts.", "verified": true, "helpfulness": "0/0", "author": "issachar5"}, {"rating": 1.0, "review": "Well i like it but the movies keep freezing up then un freezing thats why i gave a one star", "verified": true, "helpfulness": "1/1", "author": "Tancy Menard"}, {"rating": 5.0, "review": "The Fire TV Stick works great easy to set-up and easy to use. The only down side you have to be closed to the wireless router.", "verified": true, "helpfulness": "0/0", "author": "Jill"}, {"rating": 5.0, "review": "Bought one for my self then bought 4 extras as gifts can not deny this is awesome. I upgraded mine to the amazon fire tv though its faster and has a usb port.", "verified": true, "helpfulness": "0/0", "author": "Richard Macias"}]