[{"rating": 4.0, "review": "I got this because it was $20.  It really is only useful if you have Prime.  The interface is fine and the device works but it is not customizable and it really doesn't fit with Apple share unless you buy the correct app.  I also hate the device for typing, so that's why I want to use my Ipad.  This probably would be WAY more useful for someone with a Fire device.  But, I am still happy with it because it does work just like advertized.  e", "verified": true, "helpfulness": "0/0", "author": "K. Hales \"brewmaster1957\""}, {"rating": 5.0, "review": "What a wonderful thing it is !!!!!  I no longer need to wonder what I'm going to watch! Everything is available to me to see with a flick of the hand .Thank you so much Amazon !!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "so much more content then I expected.  Very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "thecorn"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Chris Z."}, {"rating": 3.0, "review": "I like the fire stick however I do not like the fact that you have to purchase the shows that you want to watch, without being a prime member. Then you only get it for 48 hours and if it a season you only get the first episode and you still have to purchase the rest. I do however enjoy the convenience of the fire stick..", "verified": true, "helpfulness": "0/0", "author": "Paul g. Bettelyoun"}, {"rating": 5.0, "review": "Absolutely amazing I live the fact that I can watch shows from Amazon prime or switch to Netflix or hulu plus at a touch of a button was so impressed that I bought one for my daughter's tvI was getting tired of my satellite bill going up every month now I pay less than 25 on all three services and there is something for all of us, I was disappointed that for what ever reason I can't watch cbs shows without buying them but I'll live", "verified": true, "helpfulness": "0/0", "author": "Theresa Azim"}, {"rating": 4.0, "review": "Works great. Doesn't bog you down like a Chromecast does with \"features\" and \"usefulness\". The perfect pairing for my Amazon Fire phone and XUne media player. Destined to be on the market for a long time.", "verified": true, "helpfulness": "0/0", "author": "mollusk"}, {"rating": 2.0, "review": "Of all the major apps for the smart devices I am extremely sad to see that VUDU is not supported on this device. The function is slower than my Chromecast which Amazon shows in a comparison to Roku, Firestick, and Chromecast. The only real plus I have to the stick is the use of my prime account for prime video. Will not purchase again unless they can guarantee function is as marketed.", "verified": true, "helpfulness": "0/0", "author": "Shawn G Roak"}, {"rating": 5.0, "review": "watched some great programs with it", "verified": true, "helpfulness": "0/0", "author": "horseskipper"}, {"rating": 5.0, "review": "I LOVE IT!!!It is EVERYTHING that I hoped it would be.Super easy to set up and get going.", "verified": true, "helpfulness": "0/0", "author": "sheri berrier"}]