[{"rating": 5.0, "review": "Like it", "verified": true, "helpfulness": "0/0", "author": "fernando"}, {"rating": 5.0, "review": "Love it.  Does everything advertised and more.", "verified": true, "helpfulness": "0/0", "author": "Eddie Solis Jr"}, {"rating": 5.0, "review": "The best thing i couldve done was probably buying this baby! netflix and pandora is what i use it most for and its perfect. My only issue with it is i cant figure out how to change the language on it. Its in another language. Im so confused. Other than that is two thumbs up for this baby!", "verified": true, "helpfulness": "0/0", "author": "marileisy"}, {"rating": 2.0, "review": "really just designed to give you a huge amazon credit card bill ! any free content is so riddled with ads and pay content is still way overpriced.", "verified": true, "helpfulness": "0/0", "author": "BRUCE VERBECK"}, {"rating": 3.0, "review": "More limited in apps on the Fire Stick than Roku and strong Amazon Prime features.  Extension piece is short.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The item was received in good condition,  was easy to install, and is functioning normally.  Have not used enough to make a decision regarding content and choice. Is easy to operate.", "verified": true, "helpfulness": "0/0", "author": "James Dolsky"}, {"rating": 1.0, "review": "There should have been a direction book ncluded  I didn't know once you use the fire stick you had to use another remote to change the input back to satalite had  I known all that i don't believe i would have bought it I am a senior and feel it's difficult to try and use", "verified": true, "helpfulness": "0/0", "author": "Glenda Tichota"}, {"rating": 2.0, "review": "Image quality is drastically decreasing for every 30 mins when watching hd movie", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It was great to start but about six months in we're experiencing some serious lag (we have fast internet and no issues with other devices).", "verified": true, "helpfulness": "0/0", "author": "Blake Naudin"}, {"rating": 5.0, "review": "Its too good", "verified": true, "helpfulness": "0/0", "author": "Arvin Alexander"}]