[{"rating": 5.0, "review": "It's great. Everything I was hoping it would be. Cant wait for HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Stephen McCann"}, {"rating": 5.0, "review": "Love it. I moved my ps3 to another room. This is a great replacement. The interface is great.  It is fast and picture quality is great. I will likely get another one for my daughter's room. I should have bought 2 when they were on sale.", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 4.0, "review": "Works great with very good image quality.  Perfect for those sets that are not SMART.  Is worth it.", "verified": true, "helpfulness": "0/0", "author": "Michael O. Jagla"}, {"rating": 5.0, "review": "Wow, Fire stick is great. I just hooked it to myTV and it didn't take long at all. The choices and picture were great. Of course I was disappointed that you can't mirror with  my iPhone or iPad but this was really more than compensated by the new Sling app. I have a Slingbox 350 and can now watch my AT&T; Uverse anywhere in the world with my Fire stick.", "verified": true, "helpfulness": "0/0", "author": "canes580"}, {"rating": 4.0, "review": "I am having trouble with my bandwidth, but the product seems to work as described.", "verified": true, "helpfulness": "0/0", "author": "Paul D. Buffington \"Montanalovesongs\""}, {"rating": 4.0, "review": "It's great. It was super easy to hook up and the picture/reception is very clear. I've had no problems.", "verified": true, "helpfulness": "0/0", "author": "Jane Ehrhard"}, {"rating": 5.0, "review": "Easy setup and works great.  Love how it is set up.", "verified": true, "helpfulness": "0/0", "author": "utavsfan"}, {"rating": 3.0, "review": "It's fine. Pretty much like a roku, but smaller and cheaper", "verified": true, "helpfulness": "0/0", "author": "yourmom"}, {"rating": 5.0, "review": "This is cool! Very fast and lots of content.", "verified": true, "helpfulness": "0/0", "author": "D. Perales \"PC Addicted\""}, {"rating": 5.0, "review": "Holy cow, I love this device. So quick and easy and it works with all of the popular online streaming services I use: netflix, amazon, and hulu!", "verified": true, "helpfulness": "0/0", "author": "Microondas"}]