[{"rating": 4.0, "review": "First, I could not get the battery cover off the remote.  Postings by others said to push on it and wedge a thin knife in the crack you opened.  I did that and the cover came right off.The biggest problem that drove me crazy was the remote.  It was either not responding or jumping 10 screens at one time.  I unplugged the unit from the wall for a minute.  Plugged back in and rebooted.  The remote worked perfectly after that.Apps - A&E;, Lifetime, History - only work if your cable provider is supported.  AT&T; UVerse is not a supported provider for those channels.  Boo for AT&T;I am hoping all the apps I use on my Kindle Fire HD will eventually make it to Fire TV", "verified": true, "helpfulness": "0/0", "author": "G. Cuevas"}, {"rating": 3.0, "review": "As an Amazon Prime member, I was offered the Fire Stick at a discounted price.  I read what it offered, and I immediately ordered it hoping I could watch some TV stations using it.  It works fine for Amazon Prime and my Amazon Video and Music libraries, but I would have to subscribe to Hulu+ to get a variety of TV programming.  YouTube, the History Channel, and Smithsonian TV apps work, A&E; app works but has crappy programs (whatever happened to the old Arts and Entertainment Network? *sigh*).  I downloaded 2 free weather apps, but one won't accurately show my location unless I pay for an upgrade and the other freezes when I try to enter my location, the PBS app just gives me a code to enter but nowhere to enter it, and no local or British TV channels are offered.  I hoped that using the Fire Stick would keep me from having to hook my laptop up to the TV to see programs on local TV, PBS, BBC, and ITV, but I will have to continue to do so.", "verified": true, "helpfulness": "2/5", "author": "Kathleen"}, {"rating": 4.0, "review": "Using this to replace a Roku HD in a bedroom because of a very bright small light in front of the Roku. Absolutely no electronic clutter around the TV and fairly simple to set up(plug in, connect to WIFI and start adding channels). Of course Amazon will have their devices geared toward Amazon content because they want to make money like most businesses. Having said that, the search function could have a wider range of channels when looking for content. Once you see beyond the small limitations, this is a very good value over the competing Roku stick and somewhat limited Chromecast. I have all 3 of the aforementioned devices and I personally find the Fire and Roku stick to be more user friendly.", "verified": true, "helpfulness": "1/1", "author": "Mark A. Mitchell \"Constant researcher\""}, {"rating": 4.0, "review": "Has some software bugs, and miracast isn't working with my s3. otherwise its awesome", "verified": true, "helpfulness": "0/0", "author": "William Henry"}, {"rating": 1.0, "review": "Can't cast movie from lap top to TV. It is so pitty!", "verified": true, "helpfulness": "0/5", "author": "Jack Trinh"}, {"rating": 1.0, "review": "I started out rating this product with three stars due to setup problems, but changed this to two stars because of operational problems.  Now I'm downgrading it to one star, because of the difficulty of getting it to work reliably.  When it works it's great - seamless streaming.  But lately when I switch my TV to the stick's HDMI port chances are that it won't work at all, and following the manual procedure to reboot it many times doesn't get it going.  I've found that removing the batteries and putting them back (ie, a cold boot) generally gets it going.  But today when I did that I encountered a blue screen with the message \"HDCP not authorised\" and no picture except the subtitles on the screen.  Going behind the TV and unplugging the stick and replugiging it in got it working again, but who wants to do that every time?  Too bad, for as I said, when it works it's great.Glad I got it on the Prime special rather than paying full price.", "verified": true, "helpfulness": "0/0", "author": "M. Hillyer"}, {"rating": 3.0, "review": "Why, Amazon, why do you insist on making us suffer through using a remote and an on-TV interface? I can understand wanting to make us use your streaming device rather than Google's, but please let us use our familiar phone interface to find content and send it to the stick! To add insult to injury, I can cast Netflix and YouTube to the Fire TV Stick, but not Amazon content!There are also two main issues I've run into:1. The response to the bluetooth remote is laggy.  I've noticed that on both of the sticks I bought.  There are times when I'll press a button and nothing will happen.  After that, like most people would, I automatically think the device didn't get the command and press the button several more times.  Then, after a few seconds, the stick catches up and executes all the presses at once.  It's clearly a problem with the stick design since there's such a lag and it happens with both sticks I have.2. WiFi passwords must be manually typed in (hint: Chromecast doesn't have this problem).  This is the ONLY device I've run into that requires manual entry (TVs might as well, but at least my parents' has an ethernet port).  If, like me, you use LastPass (or a similar service) to generate your passwords, you will find this part to be hell.  The worst part is that, even if you connect the stick to an intermediate WiFi network (I used my phone's hotspot), you can't copy & paste the password using the Fire TV Remote app! It was better using the keyboard on my phone, but that's the only time when I've been thankful that I didn't make my WiFi password the full 63 characters long.  I feel sorry for anybody who uses a computer-generated WiFi password and only has iOS devices.", "verified": true, "helpfulness": "0/0", "author": "Blue Penguin"}, {"rating": 5.0, "review": "This was in easy to use and setup. Navigation of the photos is a very good feature", "verified": true, "helpfulness": "0/0", "author": "S. Nookala"}, {"rating": 3.0, "review": "Great idea. Amazon prime combined with chromecast like device. BUT,- The remote provided is very laggy. The directional navigation was making me crazy with not responding with single press and moving alllllll they way to left or right with double press. If you are fine with controlling it with your phone which most of people will, then it is fine.- It will not allow registering of multiple user account. I bought these with my girl friend's account who has prime, and I happen to have all the paid apps on my amazon account which is without prime (Plex mainly, which is absolutely awesome). It seems that we will have to either give up on all Prime video contents or re-buy all the paid apps. Again, this won't be a problem if you have all of these on a single account.For $20 I would say it is worth it. It does everything chromecast does plus you can take advantage of your Prime video. And bonus remote which doesn't really function well. However, if you already have chromecast, dont have amazon prime, or have any complications I state above, it is not worth it. I am returning mine.", "verified": true, "helpfulness": "0/0", "author": "jenny seo"}, {"rating": 5.0, "review": "I love my Fire TV stick.  Setup was super easy.  The setup video was nice but almost uneeded since it is so easy to use.  There are really nice parental control settings, which I use primarily to control purchasing on my account.  The choice of entertainment is wonderful.  Picture quality is great.  The remote is very responsive.  This is a wonderful all around streamer.  The fact that my Amazon Cloud Drive photos, Prime Music, and Prime Instant Video were all instantly accessible when I recieved it, makes it even better.  If you are part of the Amazon Eco-System, this is a must have item. I don't often totally love a product, but I love this one.  I'm so glad I gave it a try.", "verified": true, "helpfulness": "0/1", "author": "G. Allinson"}]