[{"rating": 5.0, "review": "Great streaming device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this is the best", "verified": true, "helpfulness": "0/0", "author": "Kimberly Grissom"}, {"rating": 5.0, "review": "Great product. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Dale E Szymanski"}, {"rating": 5.0, "review": "Just  love  it ,  one of the  best  purchase  I  ever  made .", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Well worth the money!  Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "DAVID KANASZKA"}, {"rating": 1.0, "review": "Really poor customer service for the Amazon Fire Stick, unbelievable for Amazon, extremely disappointed.  I spent lots of time on the phone with South Africa and even more time on the phone with the fine people in the Philippines.  Unfortunately they didn't seem to understand the term \"Aspect Ratio.\"  They had no answers with regard to billing and they couldn't seem to provide any answers about the Wi-Fi password.  I had been put on hold for about 25 minutes by a supervisor before I was conveniently disconnected.  I won’t say hung up on but we’ll just keep it at disconnected.  I did get really familiar with the piano hold music.  After I called back, another one of the fine Customer Service / Support representative asked me to check one of the settings in the Amazon Fire Stick Menus but when I came back to the phone they were also gone, disconnected again.  The lady in South Africa was nice, she said she’d check on the Aspect Ratio issue and give me a call back but that was two days ago and I haven’t heard back from her.  I kind of feel like if Amazon is going to manufacture products and they are going to have support for said products, perhaps they should at least show the customer service representatives the products and let them know how they work.  I also noticed there isn’t much content unless you sign up for “Prime” or add other services like Netflix.  Overall this was not a good customer experience.", "verified": true, "helpfulness": "0/0", "author": "S. Graves"}, {"rating": 3.0, "review": "It's works but not smoothly as I would like. Had issues getting this going, kept saying my network was unavailable. After it was step up it would loose connection to my internet. I'll keep it for future use but it's certainly not being used very often today.", "verified": false, "helpfulness": "0/0", "author": "Jayson Eidt"}, {"rating": 1.0, "review": "Complete waste of $$$.  Its a tool to sell amazon prime memberships, nothing more.", "verified": true, "helpfulness": "0/0", "author": "DJStone \"somebody\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick has been a great purchase.  I have since bought 2 others.  I use them to stream from Amazon Prime, NetFlix and Hulu, as well as from my Plex Media Server.  I have taken my Apple TV and placed it in the closet as the Fire TV Stick out performs it in a big way.It was easy to set up.  I cant say enough about how well it works for me.One of the best purchases that I have ever made.  I would give it more stars if I could.", "verified": true, "helpfulness": "0/0", "author": "Mike C"}, {"rating": 5.0, "review": "I got this during the $19 sale and, while I'm ashamed to admit it, I use this much more often than my Chromecast.I have an incredibly terrible internet connection (comes from the cable company that way thanks to the owner of the house being cheap), so casting my media from one device to another isn't really feasible.  I mostly use my Fire TV Stick to watch netflix and can usually get through a movie or tv show with minimum buffering.  Hulu has major buffering issues during the ads, but the shows themselves using stream well.  I love the remote that came with the FTVS - it's simple and intuitive.I imagine that even when I do manage to get a better internet, I would still use FTVS more often than my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Alysha Terry"}]