[{"rating": 5.0, "review": "It's great! No need to keep selecting next episodes, they automatically play. Nice remote that won't break like Roku's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent device and easy to use !  GO Amazon !", "verified": true, "helpfulness": "0/0", "author": "Jumpin Jeff"}, {"rating": 5.0, "review": "Great value, fast shipment, works as advertised and am happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "J. Alexander"}, {"rating": 3.0, "review": "Works ok. Can be fussy with wi-fi at times. The screen mirroring feature is what I was hoping would work well, but its buggy and doesn't actually support the full Miracast standard. I'm hoping Amazon will fix that soon. I like the Roku a bit better.", "verified": true, "helpfulness": "0/0", "author": "pouncepounce \"Geek\""}, {"rating": 4.0, "review": "Easily installed and works well.  Many titles for movies and a little surprised about the charges on some of the older titles.", "verified": true, "helpfulness": "0/0", "author": "Noel Giffin"}, {"rating": 5.0, "review": "Affordable and very easy set up.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Luanne Boucher"}, {"rating": 1.0, "review": "The stick works great when it works, but sometimes for no reason at all it will display HDCP unauthorized. Content Disabled and will just have a blue screen. I returned it after a few uses because it just became too annoying. It's junk.", "verified": true, "helpfulness": "0/0", "author": "Wheels McGee"}, {"rating": 2.0, "review": "I bought I thinking in as an alternative to chromecast, but I didn't work pretty well with all share cast, poor performance.", "verified": true, "helpfulness": "0/0", "author": "Reynaldo Macias Alvarenga"}, {"rating": 2.0, "review": "The Amazon Fire TV Stick is used on my Vizio Smart TV. The TV too has a Prime application and it works far better than the Amazon stick. Both the TV and Stick are connected to my home WIFI and the reception and streaming is far better in the TV whereas the Stick very often disconnects from the network and frequently stops for buffering. Both these devices are at the same distance from my WiFi modem and I don’t understand why the Stick cant stream as efficiently as the TV. It is very annoying to see ‘No Network’ message from the stick.In short, I am very disappointed with the Fire TV Stick's performance and capability.", "verified": true, "helpfulness": "0/0", "author": "Arun"}, {"rating": 5.0, "review": "Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Julie"}]