[{"rating": 5.0, "review": "It's easy to set up and navigate, just like on my blu-ray player.  It's easy to choose and scan the selections for your choice, and it comes up very fast and very clear.  It's space saving and needs no maintenance, just plug and play.  I'm so glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "Speedtyper"}, {"rating": 5.0, "review": "apple tv killer. enough said.", "verified": true, "helpfulness": "0/0", "author": "Ranrod"}, {"rating": 5.0, "review": "purchased two, just opened up a new video /digital world for me.", "verified": true, "helpfulness": "0/0", "author": "MB2 \"M BOWERS, Ed.D\""}, {"rating": 2.0, "review": "Slow and unresponsive. Freezes up all the time. Better off spending more money and buying Apple TV or something else that will work better. I own a Google Chromecast as well. Chrome cast works a lot better as well.", "verified": true, "helpfulness": "1/1", "author": "Fabian Castro"}, {"rating": 5.0, "review": "I love it!!! Not having to hook my laptop to the tv every time I wanna watch. Also I love the app because as with any remote they get lost.", "verified": true, "helpfulness": "0/0", "author": "Lori L Patchett"}, {"rating": 5.0, "review": "Awesome! Easy to set up and everything!", "verified": true, "helpfulness": "0/0", "author": "Camille Angela Bannarn"}, {"rating": 5.0, "review": "This is fantastic!  All kinds of movies and on-demand shows.  We love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"debtb\""}, {"rating": 5.0, "review": "Great product excellent value. Simple to use.", "verified": true, "helpfulness": "0/0", "author": "John L. Call Jr."}, {"rating": 4.0, "review": "It's nice back of TV 😘", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was fortunate enough to purchase this when it was $19 for Prime Members.  SO GLAD I DID.  We have been Roku Streamers for years - cut our cable long ago.  The Amazon Fire Stick has a much better platform than the Amazon Roku app and makes watching Amazon Prime shows much easier.  My only complaint is that the remote is TINY and is easily lost by any children in my room, so I have to hide it from the kids.  Way to go Amazon, I'm impressed.", "verified": true, "helpfulness": "0/0", "author": "Mrs.V"}]