[{"rating": 3.0, "review": "Remote is awful. Pushing once sends it skittering past where you wanted. Try to go back an it skitters past it the other way.I prefer my Roku stick and its remote. Much more responsive. Which surprised me. I was ready for the Fire stick to be better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "PonyMac"}, {"rating": 5.0, "review": "Way more than I expected. I had a Chromecast for over a year and I have spent a tone more hours on fire stick it's like a entire media experience I can pack up and setup anywhere I can get a Internet connection and a HDMI port", "verified": true, "helpfulness": "0/0", "author": "Jamell Moore"}, {"rating": 5.0, "review": "Everyone in the family loves this thing.  Highly recommend for anyone who has Amazon Prime.  Don't forget to get the game controller also, you will need it if you really want to take advantage of all the things that Prime has to offer on your Fire stick.  Although the specs on the stick are lower than the Fire TV box, there is no noticeable loss of quality or performance from our perspective.  The little controller is now the most fought over controller in the house.  With parental controls, you can manage purchasing and what apps get installed on the device.", "verified": true, "helpfulness": "0/0", "author": "Toddfrog"}, {"rating": 5.0, "review": "I too paid $19 for the stick, definitely well worth it, the built is solid and remote is simple enough that even a toddler can navagate the screens and find shows without problemWhat would be nice perhaps in future updates, I would like to see a spot for third party apps to display on the default launcher screen without having to go into settings, and if can Amazon can add native support for AirPlay or similar feature that a chromecast does would be great, this way I can only keep what's important plugged into my tv instead of all these different media players, for starters the roku is going to the garbage", "verified": true, "helpfulness": "0/0", "author": "alreadyposted \"alreadyposted\""}, {"rating": 4.0, "review": "A bit about me: I am an Amazon Prime user who wanted to beef-up her Smart TV.  I also purchased the Fire Stick for $20 as part of a promotion.The stick is great if you have a lot of Amazon content, photos in the cloud, and the ability to mirror devices via Miracast.  The WiFi connection is not as good as I hoped it would be (particularly as the TV's connection is nothing to write home about), but again, I can mirror my screen in a pinch.  The remote app is...interesting, but I'll put that review on its own product page.  Overall, I have not used the Fire Stick as much as I thought I would, but this is partially due to the placement of the TV it is on and partially due to the lack of FreeTime.The Fire Stick is definitely worth $20, and I think it is also worth $40 in general.  For my particular wants, I think the Fire  TV box would actually have been a better purchase, if not for the promotion.", "verified": true, "helpfulness": "0/0", "author": "AudibleQun, a.k.a. Athena Snark"}, {"rating": 5.0, "review": "Roku, Chrome Cast, AppleTV, a ton of others all do the same thing as this...so why buy the Fire Stick?You don’t live in the Apple iECO system, Roku brings nothing to the table, and Chrome is nice doesn’t have Amazon streaming (interesting Bezos)I own all of the above products and this came out and it was 50% off when preorder for Prime members, honestly at that price I couldn’t not buy it.There a lot of other reviews that will be more in-depth but I am brass tacks person and I know others are too, sooooooo....Pro -Apps (install what you want, avoid what you don’t)Speed (snappy menus and gui)Ease of Navigation (Its simple and Ui friendly)Connectivity is above average (no drops, good speed, easy to set up)Medium -The remote (its good, just not great)(phone app remote, better, but now I have 2?)Appearance (depending on where your HDMI’s are it can stick out past the TV as it does on mine)Cable (the included USB to Micro USB to supply power can been seen (see above ))Con –No HBO Go (yet…)Bottom line if you have Prime, and don’t live in the Apple world this is the ticket became it travels well, powered by USB (ps plug it back into a TVs usb port.)Its amazing, bottom line.", "verified": true, "helpfulness": "0/0", "author": "Wonky De Mateo"}, {"rating": 5.0, "review": "worked as advertised", "verified": true, "helpfulness": "0/0", "author": "Dee Dee Shullick"}, {"rating": 4.0, "review": "Everything is fine about the stick.However, there are still very few channels and apps compared to Roku and Chromecast, respectively.Moreover, the screen mirroring sometimes doesn't work with some android devices.Overall, it's good.", "verified": true, "helpfulness": "0/0", "author": "Siavashuul"}, {"rating": 5.0, "review": "love this more than chromecast , my daughter is crazy about that", "verified": true, "helpfulness": "0/0", "author": "eric mfomen"}, {"rating": 5.0, "review": "It's Great I love it", "verified": false, "helpfulness": "0/0", "author": "Richard Wiggins"}]