[{"rating": 5.0, "review": "I love it !!!", "verified": true, "helpfulness": "0/0", "author": "kiery"}, {"rating": 5.0, "review": "Great.  Easy to install and use.  Now I can catch up on viewing I missed.  Loved the fact I could pause viewing on one TV and pick it up on another.  Prime music is also a big plus.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Fran"}, {"rating": 5.0, "review": "Seamless, simple to install, and works perfect.  Netflix and Pandora apps are surprisingly good too...wasn't expecting much since this is geared towards Prime users, but they actually function better on this then they do on my PS4.  I will however mention that I bought 2 extra as gifts and one of them has been DOA...working on getting that one warrantied.", "verified": true, "helpfulness": "0/0", "author": "V. Condry \"bargain hunter\""}, {"rating": 5.0, "review": "Much better then my Apple TV love the voice remote", "verified": true, "helpfulness": "0/0", "author": "tony moreali"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "tammy hatch"}, {"rating": 5.0, "review": "Purchased for my family. As I'd hoped, it's simple enough to use that I haven't had a single phone call asking how to make it work!", "verified": true, "helpfulness": "0/0", "author": "Matt Sullivan"}, {"rating": 5.0, "review": "Only good at one thing, but it does that thing the best: Amazon Prime Video. None of my favorite Chromecast apps are on here (UFC TV, WWE Network, HBO Go) and the Netflix app seems to just open the Netflix app on my smart TV. The YouTube app is hardly usable. I bought it for Prime Video though, and so far it's a much better experience than the Prime app on my TV.", "verified": true, "helpfulness": "0/0", "author": "JV"}, {"rating": 4.0, "review": "Love, Love my fire stick. It works fine no problems yet.", "verified": true, "helpfulness": "0/0", "author": "pinky"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Dr. Penny S. Montgomery"}, {"rating": 5.0, "review": "Heads and tails better than Google Chromecast!!!", "verified": true, "helpfulness": "0/0", "author": "ZenBuyz"}]