[{"rating": 2.0, "review": "I don't like the layout of the screen interface....very confusing and difficult to navigate if you want to go to something other than Amazon.If you just like the Amazon Prime then this will be fine for you.Also, having difficulty with connection issues which I never had with Roku.", "verified": true, "helpfulness": "0/0", "author": "Brad G."}, {"rating": 5.0, "review": "Convenient and easy to use. I don't have cable but have an amazon prime and nextflix account, and this makes it easy for me to watch shows and movies from my TV.  It runs pretty smoothly and I haven't had any trouble with shows freezing or slow speeds while I'm watching. There's also lots of  channels you can upload directly from the Amazon website. The price is also pretty good and comparable/cheaper to other options such as the Roku.", "verified": true, "helpfulness": "0/0", "author": "Lena"}, {"rating": 4.0, "review": "Great product, with one down side the wifi signal gets lost and the only way to correct it is to reboot the device.  This was my second fire stick tv the first one was perfect no wifi issues over all I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Eddie Mapes"}, {"rating": 4.0, "review": "easy to set up - very user friendly.  really like the iphone app too!", "verified": true, "helpfulness": "0/1", "author": "michelle"}, {"rating": 4.0, "review": "This is a great value.  Paid $39 and has everything I used on the Roku that was $99.  Roku has more channels but I only use prime & netflix.", "verified": true, "helpfulness": "0/0", "author": "M. Ellis \"Superchop728\""}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "charles roark"}, {"rating": 5.0, "review": "Love this stick! I honestly have nothing bad to say about it. I rent movies and watch netflix all the time with this stick. Set up was so easy and it's so easy to use. Highly recommend this product!!!", "verified": true, "helpfulness": "0/0", "author": "Mandy227"}, {"rating": 5.0, "review": "LOVED IT.", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 5.0, "review": "So very cool... I can watch pretty much whatever I want whenever I want and it's easy enough my 4 year old can figure it out.  The ONLY thing that worries me is the remote.  I have it up on a shelf because like my Bose system I'm so afraid this tiny remote is going to get lost somewhere.  So far, the whole thing works well -- I can watch my netflix nice and clear on the big screen (so much quicker and easier than waiting for a playstation to link in with the computer, etc. - NTY)  I love that I can also watch my Amazon Prime movies too!  This was really easy to set up (took about 10 minutes) but anyone can do it!  So far, so good - thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "C. L. Sheehan \"wowgirl1975\""}, {"rating": 1.0, "review": "had to return it, kept loosing connectivity to my UVerse router even though it was a foot away from it.", "verified": true, "helpfulness": "0/0", "author": "L. Tadeo"}]