[{"rating": 5.0, "review": "Very Very Happy with the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Kevin J Leal"}, {"rating": 1.0, "review": "Really disappointed. Can't ever get Netflix app to load or play, ever. Also I bought the fire stuck vs the chrome stick because I am a prime member and thought I would also be able to access HBO go. We'll that's a no go... got an email from customer service on that when I asked. Hey amazon, don't advertise something that you won't provide... and then I would add movies to my prime watch list just to find that the next time I logged in, they are now unavailable to watch instant. There's no queue that says how long the movie will be available for on the fire stick or on amazon account that I saw at a glance. Not impressed with this product....", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love that amazon fire TV has its own remote. It's simple, yet very effective and convenient. I started with Chromecast on 3 TVs and I will probably switch to Amazon Fire.  Here's why:1- The Remote. It's very convenient to not have to use your phone as a remote. The amazon remote is simple but it also offers a nice variety of programming.2- As a household that does not pay for cable TV service, The Amazon stick supports amazon TV (Chromecast does not) and also Hulu, Netflix, YouTube, PBS and many other paid or free apps.3- For us, it's been more reliable than Chromecast. In not sure if it's a problem with our phones, the Chromecast app, the Chromecast TV device, our wireless, or the internet gods, but I spotted using mine because it never worked and since I bought the fire TV stick, I've been so happy.4- The remote is small. Don't lose it.", "verified": true, "helpfulness": "0/0", "author": "MOM23 \"MOM23\""}, {"rating": 1.0, "review": "Had some initial troubles with this stick not playing DHCP material, was solved somehow after a random operation of plugging unplugging, replugging....  A few chants, then plugging and unplugging and bam!  Worked great for 2 months.  Now, Hulu doesn't work, audio is fine and ocassionaly some random screen shots pop up.  25 mb download, everything else works (crackle, netflix, act). Preordered this to replace my roku 2, now just plain irritated, don't have another 2 hours tonight to call support and unplug things in a secret random order....  Almost got 2 stars for the remote being tough as nails!!!!", "verified": true, "helpfulness": "1/1", "author": "Gregory M. Tokash"}, {"rating": 3.0, "review": "It works great for everything else, but my music list. I have two kindles and a fire box which works perfectly on everything, and I still use one of the first fire kindles that amazon came out. But when I put the fire stick on my music to bring my list up. It keeps going around and around trying to load my music list. I contacted amazon customer service about the problem, and was on the phone with them  for 1 hour and 16 minutes trying to explain to every person that they transferred me to what my problem was. Streaming works great on the fire stick, I can bring up my video's, and any movie I can watch with ease. This is why I gave it three stars, and I thought I was being generous. When I gave amazon a feedback, and told them exactly what had happen. They said that some people where experiencing the same problems, and they were working on it. That was February 1 2015 and I haven't heard anything else. So to anyone that is thinking about buying the fire stick this problem could come up.", "verified": true, "helpfulness": "0/0", "author": "laredo"}, {"rating": 5.0, "review": "Works great! easy setup", "verified": true, "helpfulness": "0/0", "author": "GG"}, {"rating": 5.0, "review": "We already had the Fire TV and had enjoyed using it so we ordered the Fire stick for a TV in another room. Like the Fire TV, the Stick was very easy to set up and use. We see it as another great product from Aamzon!", "verified": true, "helpfulness": "0/0", "author": "Mcgeezer \"Kit\""}, {"rating": 5.0, "review": "So easy to set up and use - especially for someone who is somewhat challenged by technology!  Haven't used it much yet, but excited about the sheer amount of content from which to choose.", "verified": true, "helpfulness": "0/0", "author": "ritajc"}, {"rating": 1.0, "review": "Does not clear cache itself. After running for about an hour, we have to force close the app and clear the cache. If not, other applications fail to open.", "verified": true, "helpfulness": "1/1", "author": "SURESH"}, {"rating": 5.0, "review": "Great gadget! Made my dump TV Smart! Enjoying seeing great movies with having yo pay a premium!", "verified": true, "helpfulness": "0/0", "author": "Joe"}]