[{"rating": 5.0, "review": "Super easy to use. I like it more than my Apple TV! I will be buying more for my other TVs.", "verified": true, "helpfulness": "0/0", "author": "O. Hernandez"}, {"rating": 5.0, "review": "We had a few issues setting it up but we called the company and they talked us thru the whole set up.  They were very helpful and nice on the phone.  We love being able to watch our favorite shows and movies on our television at home.  Great idea for more family time", "verified": true, "helpfulness": "0/0", "author": "Cheryl Browne"}, {"rating": 5.0, "review": "Love it, works great.  I have the amazon prime , and that makes it all worth it!", "verified": true, "helpfulness": "0/0", "author": "jayne stohr"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "michelle arseneau"}, {"rating": 5.0, "review": "I haven't had a chance to use it very much yet, but it was so easy to set up that I did it without any help from my husband.  I also downloaded the remote control app to my phone very quickly and easily.  I especially enjoyed the voice feature on the phone app for searching for titles--so much easier and quicker than having to type!  We have Apple TV in our living room which we enjoy very much, but the Apple remote is really a little too small and slender for my taste.  I like the size and configuration of the Amazon remote better.  Also, the Amazon TV stick was less than half the price of the Apple TV, which is the main reason I bought it. I was happy to see that I can watch Season 2 of Extant for free since I have Amazon Prime.  Overall, I am very pleased with my Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jan in Texas"}, {"rating": 1.0, "review": "The remote started acting up the first day, and now it is dead.  Without the remote, the thing is useless.", "verified": true, "helpfulness": "1/1", "author": "Stacy W."}, {"rating": 4.0, "review": "For the price, I would give it 5 star.  For the quality, I would give it 4 star. So the average is 4 star.  The wifi got disconnected easily.", "verified": false, "helpfulness": "0/0", "author": "Diana Martinez"}, {"rating": 5.0, "review": "No problems at all. Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After the recent updates, I like it almost as much as our Roku 3. Plenty of apps to choose from and it's easy to use. We have this in our guest room instead of paying for an additional cable box. Hulu plus is the best app, well worth the $8 of month. Easy to use, especially since our TV has both a HDMI port and a USB port. So we just keep the Stick connected to the TV's USB port so that we don't have to plug it in an outlet.", "verified": true, "helpfulness": "0/0", "author": "T. Bell"}, {"rating": 5.0, "review": "Love the fire TV stick! Easy installation!  Instant movies and show at your finger tips. Easy use with remote!", "verified": true, "helpfulness": "0/0", "author": "Debra Ottena"}]