[{"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "trish gran"}, {"rating": 5.0, "review": "Easy to Install. Easy to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "claudia d."}, {"rating": 5.0, "review": "Awesome way to access your TV movies and channels.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 1.0, "review": "Not happy . I got the stick to get crackle with you advertise on your site . But I can not get. Call your trouble shoot center on 7/13 they said that they would get back to me for help with crackle. Still no word .", "verified": true, "helpfulness": "0/0", "author": "Libby Marchese"}, {"rating": 3.0, "review": "Amazon had entered the wrong product serial number on my prime account so the device wouldn't work.  Once they fixed their error I was up and running.  The device has occasional  glitches, but catches up quickly.  Overal, I'm happy with the purchase.  3 stars is more the result of Amazon's mistake than product itself.", "verified": true, "helpfulness": "0/0", "author": "Mike Stehr"}, {"rating": 5.0, "review": "It is even better than I thought!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Really upset with how PrimeDay handled the purchase of the Firestick. None available starting at 9AM. I  joined the wait list, which provided a half second flash of a dialog box that I could order, but then never provided an add to cart. This happened several times. I tried straight through 11 PM, which was like playing Whack the Mole for an entire day. I've been a loyal Prime customer since 2009 and am pretty disgusted.", "verified": false, "helpfulness": "2/2", "author": "Artsy Type"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeannie Culbertson"}, {"rating": 4.0, "review": "easiest set-up of any electronic gear.  Haven't tried many aps yet but are skeptical of reviews of Netflix ap.  Controller is great.  Problem in figuring out what is free for prime and what has to be paid for.", "verified": true, "helpfulness": "0/0", "author": "Phillip N. Woods"}, {"rating": 4.0, "review": "I'm very glad for purchasing this product, but I'm very dissapointed that in Argentina the services as Prime video doesn't work. Regards", "verified": true, "helpfulness": "0/0", "author": "nachojaure"}]