[{"rating": 5.0, "review": "This works wonderfully.  I had a Roku stick and it would have trouble staying connected to wifi.  The Fire TV Stick stays connected with strong signal.  It's user interface is also much quicker than the Roku.  The screen responds to the remote control instantly unlike the Roku which had a slight but detectable lag.  This also comes with the HDMI extension cable.  I have 3 TVs and all require the use of an extension cable due to the placement of the HDMI ports.  I would imagine I'm not alone in this and Roku's choice to not include one is puzzling.  So in summary, as compared to the Roku, it's $10 cheaper, performs better, and includes everything you need in the box.  There's no downside...get this!", "verified": true, "helpfulness": "0/0", "author": "MJP"}, {"rating": 5.0, "review": "awesome I recommended", "verified": true, "helpfulness": "0/0", "author": "IVY"}, {"rating": 5.0, "review": "I love the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Heather Padgett"}, {"rating": 2.0, "review": "Easy to use, limited choices.  We are very disappointed with the selection of programming we receive free with Prime membership.  We were hoping to stop Netflix and just use Prime.  Netflix wins hands down!!", "verified": true, "helpfulness": "0/0", "author": "Susan Scott"}, {"rating": 3.0, "review": "Need more clarity on what's included and whats a rental.", "verified": true, "helpfulness": "0/0", "author": "Robert Christian Jr"}, {"rating": 5.0, "review": "Absolutely love it! Easy to install, just plug it in. Much better than the Amazon Prime on a Smart TV, you can access/create your watch list and peruse for movies or TV shows.", "verified": true, "helpfulness": "0/0", "author": "Janelle Garner"}, {"rating": 5.0, "review": "good.....I love this..but it makes me stay up all nite...that's the only problem...", "verified": true, "helpfulness": "0/0", "author": "woo yeon kim"}, {"rating": 5.0, "review": "Well worth getting. Coupled with the free shipping part of prime this is a great service. Easy to set up, pretty easy to use and some interesting Amazon content. I only pay for cable basic tv and internet and have reduced my bill by half with the firestick... I have access to more than I did with just cable...", "verified": true, "helpfulness": "0/0", "author": "paul"}, {"rating": 5.0, "review": "Very easy to install and use. If you want to stream Amazon content, this is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Gadgeteer"}, {"rating": 5.0, "review": "So handy and makes watching our internet shows so much easier!!!", "verified": true, "helpfulness": "0/0", "author": "Karen Caves"}]