[{"rating": 4.0, "review": "I really love this little thing!  It's super easy to set up and use.  I watch a lot of videos from Prime Video and the interface with Fire TV is better than any other platform.  We have had almost no issues with the streaming and the picture quality is gorgeous.  I'm totally spoiled now and hate to go back to another device to catch up on Game of Thrones!2 minor items keep me from giving it the 5th star-It's super easy to order and pay for new videos, which I love for me, but my daughter has rented Annie 3 times now!  I'm sure there is a setting I can change, and maybe I should just buy the movie, but I haven't yet.Also, there's tons of options for other apps to enable watching video from other sources, but I still need to have an account with a cable/satellite provider to use them (including for a channel like ABC).  I'm looking forward to the day that I don't need a month cable account and can just pay for the TV I want to watch.  I think Fire TV is getting close to the a la carte approach, but not everyone else is there yet.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 2.0, "review": "I purchased the Fire TV Stick so I could get Sling TV on my TV. I have a few Apple TVs and find them to be good devices, but they do not have a Sling TV app.The FTS would not recognize my remote during the onboarding process. It took me a few different attempts with unplugging it and plugging it back in to get it to work. The device also needs to have a power outlet VERY close to the HDMI port in the TV. I could not use the device with my TV in my living room because the power outlet was too far away.The UI is sluggish and unresponsive. And, the biggest disappointment, is that the Sling TV app often does not work and returns an error. Overall it was not a good experience. I would not recommend this device to someone else.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "tho kieu"}, {"rating": 4.0, "review": "On the road for work almost every week! This has been a game changer - not having to watch Everything on my iPad or sit through random TV programming / commercials! My only issue his the iPhone App doesn't locate the fire stick everytime so I do have to make sure that remember the remote. Other than that - great purchase and would fully recommend it to anyone that travels for a living!!!", "verified": true, "helpfulness": "1/1", "author": "Derek"}, {"rating": 5.0, "review": "I love this thing. Combined with Sling, I get all I need out of it", "verified": true, "helpfulness": "0/0", "author": "Sean kirkpatrick"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Bianca Hurst"}, {"rating": 5.0, "review": "Fire stick works well,,I don't use my Xbox for apps now and have added sling.", "verified": true, "helpfulness": "0/0", "author": "Louis Saunders"}, {"rating": 5.0, "review": "Awesome product. Can use it by usb or hdmi. Many movies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "VM#1"}, {"rating": 1.0, "review": "i purchased 2 firestcks after Christmas. One stopped working after I used it only 6 times or so. The other one just broke today, May 18th, 2015. I tried them on all 3 of my tvs and nothing happens, no message, just the screen with pictures of nature.  There is nothing I can do except plug it in and out and hope it connects, no luck. I am disabled, very poor, can only afford the most basic cable package 2,5,7,9,11 and fox.  This was like a miracle for me to get all the movies and shows and I loved it!  I was able, despite one arm, to easily install each device. I emailed Amazon but was told to call technical support bla bla bla. What they can do with a blank screen would not be much. Plus I am sure it would end up being the fault of my tv, etc. Unfortunately, I did not get my firesticks for $19.  I paid $37 for each so all that money is just down the drain. Buyer Beware of Amazon a Firestick!", "verified": true, "helpfulness": "0/0", "author": "sharon kramer"}, {"rating": 4.0, "review": "Really great thing and excellent price. It has some bugs , but I'm sure Amazon is woking on them", "verified": true, "helpfulness": "0/0", "author": "Carlos Augusto Ascanio"}]