[{"rating": 5.0, "review": "It over heats and stopped working after 6 months. Amazon has replace it.YEAH Amazon.  I noticed that it is warm while in hibernation mode...hmmm", "verified": true, "helpfulness": "0/1", "author": "Prime Member Pat"}, {"rating": 5.0, "review": "I love this item!  Wish I had bought it when it was on sale since it goes on sale often but it was still worth it. Has better menu options than my televisions with the same apps built in.  And, another cool thing about it is it remembers you and you can take it anywhere, plug it into any tv, and pickup on the shows exactly where you left off.  You never have to set it up again or log in each time.", "verified": true, "helpfulness": "0/1", "author": "Smart Shopper"}, {"rating": 5.0, "review": "Love it! Way better than chrome cast", "verified": true, "helpfulness": "0/1", "author": "Jennifer Richardson"}, {"rating": 1.0, "review": "Slow, stuttery, bad wireless connections.  Was totally unimpressed with this over hyped device.  Wanted it as a kodi front end but it doesn't have the power to play HD OTA channels.  SD channels did ok.  Watched a prime video and it buffered too much for me.  Most of the video apps require subscriptions as well.  Not directly related, but a bunch of prime videos on my play list have changed to have rental charges so the whole prime as a way to watch \"free\" movies is being diluted as well.", "verified": true, "helpfulness": "0/1", "author": "barbre"}, {"rating": 5.0, "review": "Awesome!  I have Roku and Chromecast and the interface with the Fire Stick is the best.  I also like the Fire iPhone app that has voice search and a keyboard.  Roku has all the apps but has a clunkier interface.  I'm a big user of Amazon Instant Video so it's easier to access my library.  I also love the xray feature that allows you to see who is in a scene.  Chomecast is okay.  You have to open individual apps on your phone then cast them from there...another big negative of Chromecast is no Amazon Prime.  I also use it for Netflix and MLB.TV.", "verified": true, "helpfulness": "0/1", "author": "M. E. Middleton"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/1", "author": "Rick Hanley"}, {"rating": 5.0, "review": "nice product", "verified": true, "helpfulness": "0/1", "author": "hjss"}, {"rating": 5.0, "review": "Works as advertised. Too much to see and do.", "verified": true, "helpfulness": "0/1", "author": "Den"}, {"rating": 1.0, "review": "Hulu freezes on the amazon fire Stick....everything else works great", "verified": true, "helpfulness": "0/1", "author": "kim"}, {"rating": 5.0, "review": "Allows us to stream hbo go to our tv.  Also very compact and easy to travel with.  Highly recommend this product .", "verified": true, "helpfulness": "0/1", "author": "Bo"}]