[{"rating": 5.0, "review": "We love it!!!", "verified": true, "helpfulness": "0/0", "author": "Moriah Guild"}, {"rating": 4.0, "review": "This is a lot faster than trying to connect through the T.V.  It is easy to navigate and the set up walks you through everything.  I brought this on vacation though and attempted to use this in our hotel. I was able to connect to the WiFi but the hotel also had a web page that needed the terms accepted, and I could not do this (or access any web page) with the Fire TV stick.  It was very unfortunate since we had planned on watching Netflix for the three weeks we were gone.", "verified": true, "helpfulness": "0/0", "author": "Shamulove"}, {"rating": 5.0, "review": "compact and easy to use...the mobile app is tremendous! I'm 100% satisfied...", "verified": true, "helpfulness": "0/0", "author": "Michael Kato"}, {"rating": 5.0, "review": "Great way to have everything in one location.", "verified": true, "helpfulness": "0/0", "author": "Daniel Oliphant"}, {"rating": 5.0, "review": "So far I love this. I get lots of cool movies ,music.  I am still learning and the stick is really a great item , great extra for your fire phone!! 😃😃", "verified": true, "helpfulness": "0/0", "author": "DeLynn Hardy"}, {"rating": 1.0, "review": "All I want to do is watch Net Flix for now.  The FireStick is unbelievably complicated getting around all the Amazon garbage that is being promoted.  If you just want to watch Net Flix or some other pay sites like it, this is not for you.  I returned it within a week and then paid more for the Apple TV product and it is so much easier to use.just watch NetFlix", "verified": true, "helpfulness": "0/0", "author": "Howard Wright"}, {"rating": 5.0, "review": "Set up took 5 minutes..... gotta watch the pay for movies, but I use it mainly for Netflix and Hulu... dropped my cable.....You need Amazon prime....which costs $99.00 a year, but that includes free 2 day hipping on everything you buy....no minimum order Unlimited things to watch Hulu Plus $9.00 Netflix $9.00So: Amazon prime $8.25 month includes 2 day free shipping on everything  Netflix  $ 9.00  Hulu  $ 9.00Total  $26.25Vs. my old cable bill $175.00saving  $ 148.75Will add TiVo for 14.25 a monthDrop cable and save yes you need a fire stick for each TV..but you own it... for $39.00I miss some things, Pawn Stars, Lifetime, but it it's only a matter of time before Amazon has a cable network...I'm sure", "verified": true, "helpfulness": "2/2", "author": "Randall Schwartz"}, {"rating": 5.0, "review": "Solid interface, easy to use, no glitching at this point.  One month of use.", "verified": true, "helpfulness": "0/0", "author": "I am Error"}, {"rating": 1.0, "review": "This worked for a week and then I got a blue screen saying \"HDCP unauthorised. content disabled\". I tried all  the solutions provided on the forum but none worked. Additionally none of the 4 HDMI ports on my TV work now. Its a Westinghouse 42\" which  is now useless.  No amount of hard resetting fixed  the TV which is now  bricked. Check out this thread before you buy. http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_tv?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=Tx1A10FFQXCSZ2MI recommend you don't. I'm returning the  Firestick  and have bought a  Vizio  49\" TV at Costco for $70 less than the Amazon price.", "verified": true, "helpfulness": "0/1", "author": "kauhikoa"}, {"rating": 4.0, "review": "I like it, I found it easy to navigate and set parental blocks. I think it us better than my Roku XD, it seems obsolete to me now I have this item.", "verified": true, "helpfulness": "0/0", "author": "jovon"}]