[{"rating": 5.0, "review": "I have had a good experience so far.  I bought the stick as soon as it was offered.  I thought I would use it on a bedroom TV and take it with me when I travel.  It installed flawlessly and I am able to plug it in to a surge protector right behind the screen so that it is completely hidden from the front.  It comes registered to your Amazon Video account and I immediately installed Netflix and Hulu.  It doesn't have as many channels as the Roku 3 on my main TV, but frankly I didn't care because I have the most important ones.  I like the design and think it is perfect for the purpose.", "verified": true, "helpfulness": "0/0", "author": "La Jolla Library User"}, {"rating": 5.0, "review": "Just installed it tonight & it works great. A little disappointed that Showtime Anytime can't be accessed as my cable provider (Charter Communications) isn't listed yet. I can access Showtime Anytime via my computer & Android tablet app. Think it is because it is a newer device. Charter supports Roku & other mobile devices. Hopefully the cable provider list grows over time because that is one of the reasons I bought the device was the selection of supported apps.", "verified": true, "helpfulness": "0/0", "author": "D. Loenneke"}, {"rating": 2.0, "review": "setting up the Fire TV Stick was easy, staying connected is impossible. After multiple attempts (unplugging and replugging) of trying to establish a stable network connection, the connection would last no longer than 4 minutes (probably not even 4minutes). I'm disappointed, and will not recommend this product to anyone, should've went with roku.", "verified": true, "helpfulness": "0/0", "author": "timcampy"}, {"rating": 4.0, "review": "I really love it. Only issue is the length of the power cord but we managed to solve that.", "verified": true, "helpfulness": "0/0", "author": "Nicole Kolb"}, {"rating": 5.0, "review": "was a simple plug and  play  I really like it", "verified": true, "helpfulness": "0/0", "author": "Linda A"}, {"rating": 5.0, "review": "From what I can tell it works really well and was not too difficult to complete installation on your TV.", "verified": true, "helpfulness": "0/0", "author": "Brigid"}, {"rating": 5.0, "review": "The fire stick  is great and works really well with plex and xbmc", "verified": true, "helpfulness": "0/0", "author": "Rodney Clark"}, {"rating": 4.0, "review": "Seems nice, operates as promised, wish it would wake the TV using the REGZA-Link (CEC) protocol. If the TV is already on, it can/will switch to that input if the Firestick remote is operated. Just won't wake the TV, as does the PS3 when it is turned on.", "verified": true, "helpfulness": "0/0", "author": "C. C."}, {"rating": 5.0, "review": "So far, so good. Set up was quick and painless. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 4.0, "review": "So far so good easy to set up and my 5yr old is finally in his room watching netflix", "verified": true, "helpfulness": "0/0", "author": "Vincent"}]