[{"rating": 4.0, "review": "Great addition to my game room TV.", "verified": true, "helpfulness": "0/0", "author": "Paul James Micklos"}, {"rating": 5.0, "review": "Works like a charm and much faster than any other steaming device out there today! Perfectly happy with this buy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV Stick works great.  Remote works well and it was very easy to setup and connect to the home wireless.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "Remote isn't the highest quality. Everything else is A+", "verified": true, "helpfulness": "0/0", "author": "C. Toews"}, {"rating": 5.0, "review": "I purchased this on a whim since it was only 20 bucks with Prime.  I bought it hoping it would replace my aging Roku 2.  So far it has meet every expectation!Quick and simple set up.  Easy to navigate (although the home screen is a bit more cluttered than the Roku's).I am a heavy PLEX user and this device handles 1080p streams with no hiccups.  Netflix and Hulu work flawlessly as well.", "verified": true, "helpfulness": "9/9", "author": "Ollie"}, {"rating": 2.0, "review": "Seems like it looses it's signal very easy and have to reboot a lot.. Thinking about getting a chromecast by google.", "verified": true, "helpfulness": "0/0", "author": "Adam Brown"}, {"rating": 5.0, "review": "Amazing!  Runs circles around the chrome cast and similar devices... The Amazon video, Netflix, and unofficial YouTube apps run very well.  A few minor software flaws, but I have faith Amazon will iron those out with software patches.", "verified": true, "helpfulness": "0/0", "author": "J. C. Graboff \"Tech freak\""}, {"rating": 2.0, "review": "I guess I missed the fine print that you could not mirror from an iOS device.  My bad.", "verified": true, "helpfulness": "0/0", "author": "R. Paul Yuncker"}, {"rating": 3.0, "review": "It's a great little device that brings all your TV and movie needs into one. It's  easy to setup  and navigate. At times it can be slow or stop altogether which is a bummer and the in no definitive way to turn it off. You have the option of going into the setting menu and putting it to sleep or unplugging the power supply. It would be nice to have something on the main menu or even the controller to turn it off/put it to sleep.", "verified": true, "helpfulness": "0/0", "author": "Aaron Moore"}, {"rating": 5.0, "review": "I appreciated the instructions that said that the set up connection would take a few minutes. That helped to not worry everything was OK because the set up did in fact take almost 10 minutes.The interface is just like the Kindle and it is very snappy and responsive to flipping through movie/tv options. The app download of Netflix went easily and that app maybe doesn't load quite as fast as Amazon movies but it is still pretty snappy.Overall this was a great low-end tech investment. We were using an HDMI cord from our computer to our TV so the biggest appeal for us with this device was the remote.Great product overall and for the price point (which we purchased under a special Prime member-only sale) was fab.", "verified": true, "helpfulness": "0/0", "author": "Wendy E. Almeida"}]