[{"rating": 5.0, "review": "Wish I had bought this years ago.....", "verified": true, "helpfulness": "0/0", "author": "Karen A. Haack"}, {"rating": 5.0, "review": "It works great.  Enjoying Netflix everyday.", "verified": true, "helpfulness": "1/1", "author": "Helyn Blodgett"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jamie Simpson"}, {"rating": 5.0, "review": "We love the Fire TV Stick.  Some of the apps we use a lot  - History, A&E;, Hulu needs a lot of fine tuning, but I guess we can't blame the Fire TV Stick for that.  Love the convenience of the remote app as well.  We tend to lose our remote a lot, but we can still control the Fire TV Stick until we find it.", "verified": true, "helpfulness": "0/0", "author": "Carolyn"}, {"rating": 3.0, "review": "Here is a short review. I had bought the Amazon Fire Stick at $19.99 when it was initially released.There is some very poor performance, lagging and sluggish compared to the Amazon TV box. The device has also froze and crashed a few times.The GUI is nice and modern, but menu layout is just horrible. If you want to access your apps like Netflix or HBO Go, you need to scroll down to \"Apps.\" Home takes to you to most recent items and most of the time when I click on the app, it takes me to the app store then I would have to click on open. It would be great if you can rearrange the categories so I can put things like “Apps” on top. I’m not sure to Home is bugged, but like I said, it takes me to the app store of the app instead of actually opening the app. There is far too little apps available!The other thing I don't like is that the layout is saturated with Amazon Movies or TV shows that you have to pay for. The occasional ads on the top banner I don’t mind, but I am an Amazon Prime member and only want to see the Amazon Video content that I can actually play. The paid stuff should be placed better and instead of mixed in especially when searching.  It seems they force you to pay for movies or shows.The search function is cool, especially if you use the mobile version which is voice enabled, but unfortunately it only searches through Amazon movies and shows.Overall, I think I like the Roku 3 and stick better.Here is the Amazon screen layout:Search (Only Amazon)Home (shows recent stuff)Prime VideoMoviesTVWatchlistVideo LibraryGamesApps (This is where your apps are stored)MusicPhotosSettings", "verified": true, "helpfulness": "1/1", "author": "Bryant Baker"}, {"rating": 4.0, "review": "It works nice, but I thought the HBO Now app would be included - this is what I am subscribed to through my AppleTV. HBO Go is not the same. Looks like I'll keep this for my upstairs TV and continue to use my AppleTV.", "verified": false, "helpfulness": "0/0", "author": "R. G-Man \"RG\""}, {"rating": 2.0, "review": "no comcast/xfinity app available", "verified": true, "helpfulness": "0/0", "author": "Andrew M Reiter"}, {"rating": 5.0, "review": "Small but powerful !", "verified": true, "helpfulness": "0/0", "author": "Sidney Washington"}, {"rating": 4.0, "review": "I bought the Fire TV Stick with the understanding that I could run Kodi on it for my local media server. As it turns out, this version of the Fire Stick is not currently rootable, and that severely limits configuration possibilities. It works, for what I want, mostly, and it's cheap enough that I'll keep hammering on it as time goes by, to see if I can get it to do what I want, but Amazon's decision to lock it like this makes it less useful and less valuable.More of an oddity than a complaint: although I have Amazon Prime, it doesn't bring up my Prime Watchlist, and when I bring up a series that I began to watch on Prime, it wants me to watch it on Hulu (additional charge) instead. I will probably manage to figure out how to get it to play through Prime, but it seems an odd issue.", "verified": true, "helpfulness": "0/0", "author": "mondele \"maddog\""}, {"rating": 5.0, "review": "Excellent product, I am enjoying it every time I use it.", "verified": true, "helpfulness": "0/0", "author": "sandy"}]