[{"rating": 4.0, "review": "Very easy to set up if account holder bought it through Amazon, a lot of left to right scrolling to find what you want, simple access to Prime viewing", "verified": true, "helpfulness": "0/0", "author": "John H."}, {"rating": 5.0, "review": "very good assortment of programs and  movies as well as prime videos", "verified": true, "helpfulness": "0/0", "author": "Leonard Dorazio"}, {"rating": 3.0, "review": "CANADIANS, beware, this stick works like a charm but is not intended for Canadian users. All the prime movies and features are blocked, EXCEPT for NETFLIX (but like USA users, you have to have a Netflix account to use). WHAT A PITY !! We need a Canadian version Amazon !! @ $39 odd I can at least use it for Netflix, so not all wasted :-)", "verified": true, "helpfulness": "1/1", "author": "Enthusiast"}, {"rating": 5.0, "review": "I ordered this at 1100pm and recieved it 1200pm the next day! Does exactly what I needed it too!", "verified": true, "helpfulness": "0/0", "author": "Hollywood60"}, {"rating": 5.0, "review": "This is amazing. And it takes a lot to make us enthusiastic about tv shows anymore. The choices are good and varied, it works simply and always. A lot to ask of most things.", "verified": true, "helpfulness": "0/0", "author": "Marcella"}, {"rating": 5.0, "review": "This is a great t.v stick, but I just wish it had more movies. Because the choices are bland. Overall it is a great product. Recommends for Anyone likening for a portable T.v", "verified": true, "helpfulness": "0/0", "author": "FanficJunkie"}, {"rating": 5.0, "review": "Works great and very easy to install. Works as good as my Fire Tv. Hardly need cable except for the news and certain shows that we put on dvr anyhow.", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 5.0, "review": "Wayyy better then chromecast and so easy to use.  I got this for my parents and they found it super easy to use.  I would definitely recommend this to anyone looking to stream movies and shows easily.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent and easy to set up", "verified": true, "helpfulness": "0/0", "author": "Robert. Albee"}, {"rating": 5.0, "review": "Great to my TV.", "verified": true, "helpfulness": "0/0", "author": "Maria"}]