[{"rating": 5.0, "review": "Awesome - love it.", "verified": true, "helpfulness": "0/0", "author": "Paul McEnany"}, {"rating": 4.0, "review": "Excellent product for anyone who has amazon prime or netflix. Easy to setup and use.", "verified": true, "helpfulness": "0/1", "author": "dolerite"}, {"rating": 1.0, "review": "I am not happy with this product. We have several Rokus, Apple TVs, Chromecast, smart TVs, laptops, tablets, smart phones, game consoles and blue-ray players in our house. Amongst all the devices out there we can use to stream video content, the Fire TV Stick is the worse. The remote control does not work well. It's erratic. It's a pain to use. It's very frustrating. And the iPhone remote app doesn't exist so there is no way out. It's not just my Fire TV stick, it's most of them out there as this issue is common in lots of other reviews. I actually own two Fire TV sticks since they were on sale at Staples for $24 at Thanksgiving. I am a big Amazon Prime customer and we buy a lot of items from them. Trust me, it hurts me to leave a negative review because I like Amazon as a company. However, they dropped the ball on this device and didn't do the proper testing. I hope they will fix it soon, with a software upgrade or something else. I will play with the devices for a few more days but I am pretty certain I will return them and ask for a refund. It's sad because it's a neat gadget otherwise.", "verified": true, "helpfulness": "7/8", "author": "David \"David\""}, {"rating": 5.0, "review": "The stick is great - but Comcast sucks - supposedly it offers 6 meg service but many times it drops below 1 meg which is to slow for streaming.", "verified": true, "helpfulness": "0/0", "author": "John Sharp"}, {"rating": 1.0, "review": "So glad I paid half price when I did. It constantly freezes. It is not my internet connection seeing that my Chromecast works amazing. I would recommend Chromecast over Amazon Firestick. Very disappointed in the product. If it worked properly I'd be very satisfied. Very aggravating having to reset 100 times while watching tv.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Poor design, USB wire sticks out the side and interferes with other HDMI connector on TV", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 1.0, "review": "As of now my fire stick is only getting one star I love the idea. I have yet to watch anything. It took three days to connect to my wifi. Now every time I try to watch something it says there is a problem with my network. I have even tried connecting it via network sharing on my phone which I sat next to the stick. Still with no luck. I have no problem connecting my computer, kindle fire HDX or phone to my wifi while sitting directly in front of my tv. Any suggestions?", "verified": true, "helpfulness": "5/6", "author": "Samantha"}, {"rating": 3.0, "review": "How do I stop the stupid video already? Everytime I hit the back button it starts to restart the device, I can't get the stupid intro video to stop!!!. Such a waste of my time! I've let it run in the background and switch the TV to another channel.  So obnoxious. I want to use my device. I'm all excited that it's here. I don't want to have to wait through a stupid repetitive and slow video telling me the obvious.  I'm an electrical engineer.  I get it already.  Give the tech savvy people a way to make it STOP.", "verified": true, "helpfulness": "0/1", "author": "Amy"}, {"rating": 5.0, "review": "All I can is this thing is awesome. 20 minutes after installing the Fire Stick, I unplugged my Roku and Chromecast.  Set up was a breeze and connecting to all my existing accounts could not have been easier.  Everything I want and more are in one device now. The interface, the apps, and the speed of the Fire Stick blows the others away.  I love the menus; they are clean, organized, and very easy to navigate.  Everything loads so quickly, and I love that I can have Pandora playing while I browse the other apps and menu items.  I also love that as a Prime member I have access to tons of free amazon music. The sound and picture quality are amazing, and the remote picks up the stick from anywhere in the room without pointing it directly at the stick. And it's only going to get better with voice commands once the iOS app is released.  I can go on and on, but I want to get back to the Fire Stick.  If you're thinking about getting one, do it, you will be glad you did.", "verified": true, "helpfulness": "0/0", "author": "Ali Izadpanah"}, {"rating": 5.0, "review": "it's just very easy to install and what a great experience after!", "verified": true, "helpfulness": "0/0", "author": "Simon F."}]