[{"rating": 1.0, "review": "Absolutely terrible product. Bought for my wife and after a frustrating weekend of trying to use, she was unable to watch even 1 second of anything as the first stick constantly disconnects from the internet despite the network connection being listed as \"very good\". Very disappointed. We've purchased many Amazon products in the past and have always been beyond satisfied. Take this one back to the drawing boar amazon.", "verified": true, "helpfulness": "0/0", "author": "Josh Ray"}, {"rating": 5.0, "review": "Great device.  Gives apple tv good competition.  I like it. I really was impressed with the ease of installation. Recommend.", "verified": true, "helpfulness": "0/0", "author": "Bluth"}, {"rating": 1.0, "review": "Amazon limits apps and this doesn't work well with plex. there is no crunchyroll app. got rid of this and replaced it with a roku stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The interface sucks. Hard to find shows. Can't easily figure out which ones you have to buy vs. get for free with prime.", "verified": true, "helpfulness": "0/0", "author": "Matthew Dee"}, {"rating": 5.0, "review": "If there were words to say how happy I am I would tell you.", "verified": true, "helpfulness": "0/0", "author": "John LaRochelle"}, {"rating": 5.0, "review": "I love this thing. Is the best tv accessory ever.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 4.0, "review": "We received it when it was expected and you provided good service, but we have not been able to figure out how to use it.", "verified": true, "helpfulness": "1/1", "author": "Jeanette Ling"}, {"rating": 4.0, "review": "easy to install and use, love the voice search app for my smartphone.  wish more of the channels were free. TV series choices are excellent.", "verified": true, "helpfulness": "0/0", "author": "Mike Dellwo"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "John Esposito"}, {"rating": 5.0, "review": "Better than the chrome cast", "verified": true, "helpfulness": "0/0", "author": "Sean Talley"}]