[{"rating": 1.0, "review": "I travel 40-41 weeks/year, and I wanted to use this to catch up on shows, or watch something on the TV that's not in their channel line up.  The Fire Stick doesn't give you the ability to use a Web based interactive portal to get on to the internet (which is common in most hotel chains.)  This makes the Fire TV Stick useless for travel unless you go somewhere they actually give you an SSID & password to get on to their wireless.", "verified": true, "helpfulness": "2/3", "author": "Ed Dwan"}, {"rating": 4.0, "review": "I am late to the world of streaming media, and after looking at my dish bill I am gearing towards becoming a \"cord cutter.\" However, I am not quite ready to make the jump.I was able to purchase this item during a Black Friday Sale at Best Buy for under $30.  Is it perfect? No, but it does the job for anyone that`s new to streaming media and doesn't have a smart TV/bluray player.Its a nice compact introduction device, but it does lack the variety of channels/apps that Roku is famous for. The user interface is a lot  more \"friendly\" than my Sony Bluray player. The interface makes it easier to find and locate programs. I do wish it had a on/off switch.Picture and sound quality are amazing on my 720p HDTV.The device is perfect for prime users, but underwhelming to those that aren`t.  If you are looking to \"cut the cord\" I would look somewhere else.Another reviewer mentioned a glitch in Hulu Plus. I have experienced the same problems with the application, especially when the show returns after the ads have aired.The screen will freeze and the audio will continue, or the program will skip a few seconds. When pausing the program and returning to the main menu you actually have to play another episode before being able to resume the episode who you were watching. Its tedious and its happen at least 6 times in one day.", "verified": true, "helpfulness": "0/0", "author": "GretS \"freedomrider21\""}, {"rating": 4.0, "review": "Need more compatibility with other devices...and come on man YouTube....but google issues aside this device is very fast...", "verified": true, "helpfulness": "0/0", "author": "Juan Garcia \"GARCIA249\""}, {"rating": 5.0, "review": "Perfect!!", "verified": true, "helpfulness": "0/1", "author": "Amazingme"}, {"rating": 5.0, "review": "Wow, what an easy-peasy setup - especially with my old Samsung television and crappy DSL Internet service.  Plugged the power unit into an outlet, connected it to the stick, then to the only HDMI port on my t.v., and the program popped up and was looking for the Fire TV remote before I even had a chance to install its batteries.  As a Prime member, it was especially nice that the Fire TV Stick knew who I was so I didn't have to bother with anything other than keying in the password to my router so it could connect, then figuring out what I was going to watch.Except for one stutter during the welcome program, the streaming has been great (much to my surprise).  Wonderful technology, Amazon.  Thanks!  Can't wait until that iOS app is available so I can use my iPod Touch 5G for a voice search.Edited to add that my 2010 Samsung t.v. is not HD, but the streamed video quality is still excellent.  Guess I should have asked Santa for a new t.v., but heck, the one I have still works.", "verified": true, "helpfulness": "1/1", "author": "Aspasia"}, {"rating": 5.0, "review": "We have really enjoyed it. It is easy to use, not hard to install and can be moved easily if need be. We also purchased the chrome cast to see which one was better and needless to say we took back the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Hi"}, {"rating": 1.0, "review": "Lack of apps.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "WONT STAY CONNECTED.IM SENDING IT BACK !", "verified": true, "helpfulness": "1/1", "author": "Teresa Washington \"tsxymama\""}, {"rating": 5.0, "review": "This is an amazing tool, it arrived on time, was easy to setup and it really works great.", "verified": true, "helpfulness": "0/0", "author": "Dale W. Basham \"Dale\""}, {"rating": 4.0, "review": "Great so far! This really gives my Chromecast and Apple TV a run for their money. It just might replace the chromecast.Nice interface and the remote is also very nice. I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "Scott"}]