[{"rating": 2.0, "review": "I am not having a lot of success with my Fire TV Stick so far. However, I am progressing slowly.  First of all my Kindle Fire Xblah blah blah will not connect to the Fire Stick at all.  The Fire Stick is connected to the Internet and although it sometimes drops I am able to get You Tube, etc and I guess whatever apps I install.  Home screen is frequently unavailable but will eventually pick back up.  I checked with online chat and asked whether or not the fact that the Internet was not a secured network made a difference and he said it did, so perhaps that is part of the problem. I haven't relocated it to test yet.  If it works with Netflix, Hulu, YouTube and so forth I would feel that it was worth the cost. However, I would like to be able to mirror other things that I watch online as well.", "verified": true, "helpfulness": "0/0", "author": "Poet's Pen \"The Poet's Pen\""}, {"rating": 5.0, "review": "Bought it for my dad for Father's Day. He absolutely loves it!", "verified": true, "helpfulness": "0/0", "author": "Michelle T"}, {"rating": 5.0, "review": "This thing is so awesome. It's inexpensive and filed with so many features.", "verified": true, "helpfulness": "0/0", "author": "Ryan Ribas"}, {"rating": 5.0, "review": "Love this TV stick! It's very responsive and fast performance. I love using it to watch Netflix or Prime Video. It plays a helpful intro video as soon as you plug it in. So simple and affordable way to watch online TV/movies!", "verified": true, "helpfulness": "0/0", "author": "Heidi S."}, {"rating": 5.0, "review": "After some research, I choose the fire tv stick over the chromecast and roku. I'm so glad I did. I've used the chromecast before but I felt it was lacking and I wanted one that was independent that didn't need my phone or tablet to run. I use it mainly for netflix.Already having prime, the prime video's and music are a bonus. They have some game apps that are fun to play real quick. You can side load apps which is great.The wireless on the fire tv stick was better than I thought. I usually use it in my bedroom which connects to a bridge instead of the main router. When I took it out to the living room, I had forgotten to change the the network to the main router for a stronger connection, it was still connected to the bridge. I was surprised that this little stick didn't have a problem.All in all, I am happy with the fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "Lana"}, {"rating": 5.0, "review": "Easy setup.  Only took me a few minutes to connect hardware AND setup Wi-Fi and account.", "verified": true, "helpfulness": "0/0", "author": "RobertC"}, {"rating": 5.0, "review": "Needs more apps. Great other than that!", "verified": true, "helpfulness": "0/0", "author": "Jordan upchurch"}, {"rating": 3.0, "review": "When it works, it works well.  Lots of freezing up issues.  Have to restart it several times daily.  Occasionally, it freezes up so bad that I have to unplug it from the hdmi, remove the power cord.  When it freezes up, the remote control does not function.  Think there are some bugs to work out.", "verified": true, "helpfulness": "0/0", "author": "B.E Wilson"}, {"rating": 1.0, "review": "HDCP unauthorized. I tried everything Amazon has ever suggested to correct this issue. From trying different HDMI slots,clearing cache and other app data, or unplugging it for 3 minutes and plugging it back in to returning to factory settings and starting over. Beware. It works at first but then you get the blue screen of death. For me it was 4 days. For some it was 2 weeks. They suggested that my top of the line Sony HDTV is not HDCP compatible. I liked the product so well that I got two of them. If Amazon can fix this issue that so many people are having then I'll try again.", "verified": true, "helpfulness": "0/0", "author": "chris darnell"}, {"rating": 5.0, "review": "We knew there had to be something in the world better than handing a fortune over to a cable company every month who provides us with hundreds of channels we don't watch. We have an old Wii that we started using for Netflix, and then decided to try an Amazon fire stick for access to live TV through Sling. We are not tech savvy, but the fire stick was easy for us to set up. It literally took minutes. It connected to our wireless system without a problem, and we downloaded the free remote control app for our iPhones - which also worked instantly. We have not experienced any delays or lagging in watching programs, and Amazon Prime members have access to even more new tv shows and movies. This is the way to go if you're frustrated with cable!", "verified": true, "helpfulness": "0/0", "author": "Kitty Lake"}]