[{"rating": 5.0, "review": "Love it!!!  Love it!!!!", "verified": true, "helpfulness": "1/1", "author": "Robert D Bailey Jr"}, {"rating": 5.0, "review": "fast and  easy to navigate. excellent purchase.", "verified": true, "helpfulness": "0/0", "author": "s. sweeney"}, {"rating": 2.0, "review": "Cuts out horribly while playing shows on Hulu. It either pauses constantly or plays sound with no video. Absolutely horrible.", "verified": true, "helpfulness": "2/2", "author": "JenMarie2003"}, {"rating": 5.0, "review": "Really really really GREAT! Couldn't be more pleased!", "verified": true, "helpfulness": "0/0", "author": "Matt Thompson"}, {"rating": 1.0, "review": "Spent an entire Friday evening trying to troubleshoot this thing. It wont recognize my network password. I have entered it a dozen times. I know what it is, but I double checked thinking maybe it was changed.. it was not changed. I have reset my modem, I have restarted the fire stick, I have tried the number on the bottom of the modem for good measure, nothing is working. I have several Apple products and they have always been easy breezy to set up. I am majorly disappointed and probably going to send it back for a refund. I really thought this would be a cool gadget but after a long week this was the last way I wanted to spend my Friday night. UPDATE: I posted on the help forum and was given a link for technical assistance. I chose the \"call me now\" option and was called by a man with a muffled voice who was talking over me, very fast, and when I told him I could not understand what he was saying, he actually HUNG UP ON ME. Nice.", "verified": true, "helpfulness": "2/2", "author": "Deb \"D.B.\""}, {"rating": 5.0, "review": "Five star x100 great product it's a must have and the price is just a bonus.", "verified": true, "helpfulness": "0/0", "author": "Lf712611 \"Lenny F\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is great.  I would recommend the fire stick to any that does not have cable or satellite.", "verified": true, "helpfulness": "1/2", "author": "Venessa Green"}, {"rating": 4.0, "review": "However, the remote is 1\" x 4\". small and black---do you know how easy it is to lose...I'm so irritated...Fire stick:  RED.  Why not make a red remote, easy to find, and a little bigger...and obvi:  Red = FIRE..  Remotes aren't interchangeable within our house, so when one has fallen into the black couch, we can't watch Prime.Just and FYI.", "verified": true, "helpfulness": "0/0", "author": "shellerina"}, {"rating": 5.0, "review": "Got it for free as as promo gift. Since I already have a Fire TV box, I gave it to my mom. She enjoys using it to view her Prime TV content, and hasn't had any complaints.", "verified": true, "helpfulness": "1/1", "author": "Grace L. Thompson \"Industrial Engineer\""}, {"rating": 5.0, "review": "I've had this for several months now and it is pretty handy. I could do more with it but I tend to use it more for mirroring my phone to show pictures and movies. I do use it for some Prime video but not as often as I could.", "verified": true, "helpfulness": "0/0", "author": "Tessa Duvall"}]