[{"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "S. Sutton"}, {"rating": 1.0, "review": "Horrible.  Wouldn't even come up on my TV to get the install started and my TV isn't old.  I bought the Google Chromecast and it's amazing!", "verified": true, "helpfulness": "1/1", "author": "jmc628"}, {"rating": 5.0, "review": "I love this product. Watching a movie is instant. No more waiting for a movie to download.... I just search, choose and watch! Best product ever!", "verified": true, "helpfulness": "0/0", "author": "samiam"}, {"rating": 3.0, "review": "the Firestick seems to perform as advertised , however Amazon customer service dropped the ball as far as I am concerned. I tried to reactivate my suspended free 30 day trial that I suspended while waiting for the firestick to arrive, and was told that I had cancelled it and there was nothing they could do. What I cancelled was a $106 charge to enroll in Prime that was charged when I attempted to restart my trial period", "verified": true, "helpfulness": "0/0", "author": "william thompson"}, {"rating": 5.0, "review": "A well designed UI and access to tons of content make this a very useful tool for the cord-cutter.", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 5.0, "review": "Love it and the options.  Use over my Roku 2.  Works great on my TV and the choices are good.", "verified": true, "helpfulness": "0/0", "author": "David  the Techie \"Dave\""}, {"rating": 5.0, "review": "Amazing!  It so cool it has everything, all am missing is HBO GO and thats on its way", "verified": true, "helpfulness": "0/0", "author": "Ciro Mateo"}, {"rating": 5.0, "review": "Picture very clear love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I purchased the Fire TV Stick back in October and it just does not work for me, despite it being located a mere 5--feet from my router. My delayed review is purely due to the fact that I was so disappointed with the stick's performance (or rather lack of it), that I threw up my hands in frustration and didn't bother even looking at it again until a couple of days ago. I was hoping that Amazon might have thrown out a fix but, nope, no go. I am just as frustrated over the Fire TV Stick's not being able to stay connected as I was the first time I tried it. FAIL! I am going to sticking to my Roku boxes which work wonderfully. I am glad I only paid $20 for it during the initial Prime offering. I would not recommend this to anyone.UPDATE: I was sent a Certified Refurbished Fire TV Stick to replace my non-working original and encountered the very same connection problems!  I will hold on, although with much frustration, as I have hopes that Amazon will one day come up with a solution. At this point I still would NOT recommend this streamin' stick.", "verified": true, "helpfulness": "1/1", "author": "Jeanne"}, {"rating": 5.0, "review": "Had a few problems getting our existing Netflix account to work. Had to get ahold of amazon customer service and worked with them for a half hour to get it to finally work. However once we got that issue figured out the fire tv stick has been wonderful for Netflix and Pandora. Haven't used it for anything else, so I'm not sure how other apps work.", "verified": true, "helpfulness": "0/0", "author": "Krista"}]