[{"rating": 4.0, "review": "Very easy to install. Quality seems to be good. Tutorial was very helpful.", "verified": true, "helpfulness": "0/0", "author": "joanlucy"}, {"rating": 5.0, "review": "Totally in love with this stick!! Going to make my vacation less boring at night when relaxing!!! 👍👍", "verified": true, "helpfulness": "0/0", "author": "Michele Newhouse"}, {"rating": 5.0, "review": "Easy setup, great price, very responsive remote allows you to move around quickly - great buy !", "verified": true, "helpfulness": "0/0", "author": "Christine Moosher"}, {"rating": 5.0, "review": "Fast easy and cheap!Only downside is The number of things it can do makes it more complicated than id like to when we usually go straight to Netflix. It's interface is snappy fast so it's not like it adds much time to the startup, Just more button clicks/navigation.", "verified": true, "helpfulness": "0/0", "author": "Jim Weir"}, {"rating": 5.0, "review": "I love our new fire TV stick. My son-in-law set it up in 5 minutes. I find that it is easy to use and offers many more options to our TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Bikini Cat"}, {"rating": 3.0, "review": "I was able to easily install the fire stick on my non-smart tv.  I am looking forward to having Nexflix available on same.  I was disappointed in the remote provided with this package.  After pushing and pulling on the cover of same,  I called amazon and was told to pry off with a butter knife.  This seems to me to be a shoddy design.  They could have at least put this in the instructions.", "verified": true, "helpfulness": "0/0", "author": "panfish1"}, {"rating": 5.0, "review": "We love the fact that our TV is now a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Lisa Sawyer \"bookworm\""}, {"rating": 5.0, "review": "This is great!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Works best with Prime, lots of free stuff to watch!!!", "verified": true, "helpfulness": "0/0", "author": "Norsegirl"}, {"rating": 5.0, "review": "We really like this.  We were watching netflix thorough our blu ray player but it didn't do amazon.  We watched amazon through our wii but the interface was awkward.  I like having both on the fire tv stick and the interface is nice.  still figuring out all the extras but so far this has exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Tracy\""}]