[{"rating": 5.0, "review": "The Fire TV stick is awesome! It's easy to use and we can watch all our favorite shows and movies. We love it so much we cancelled our cable service.", "verified": true, "helpfulness": "0/0", "author": "Heather J Harrison"}, {"rating": 5.0, "review": "It works all the time. Prime movies are included BUT they are not all free.  I subscribe to Netflix because all of theirs ARE free with the monthly subscription and I don't waste my time browsing, finding a film I want to watch and then finding out It costs to watch it. I am subscribed to Amazon Prime and I think I should get more new movies with the Fire Stick. Oh well, lesson learned.", "verified": true, "helpfulness": "0/0", "author": "Jean B."}, {"rating": 5.0, "review": "great device,  meets all my streaming needs", "verified": true, "helpfulness": "0/0", "author": "Henry Williams"}, {"rating": 4.0, "review": "Lots of good programming but complicated to use. No operating manual.", "verified": true, "helpfulness": "0/0", "author": "Laptop Novice"}, {"rating": 5.0, "review": "Now I can watch movies or shows when I want.", "verified": true, "helpfulness": "0/0", "author": "Joan Torio"}, {"rating": 5.0, "review": "I love this I can now watch all the movies I want on my big screen TV it is wonderful!!!", "verified": true, "helpfulness": "0/0", "author": "Susie Womack"}, {"rating": 1.0, "review": "Won't work after installed. Talked to U-Verse about the technical problems. They said our internet speed was only 1.5 meg and the system needed at least 6. Said AT&T; would need to upgrade lines in our area. Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Will they show Closed Captioned at all of these channels?", "verified": false, "helpfulness": "0/3", "author": "Debra Prince"}, {"rating": 5.0, "review": "Great so far", "verified": true, "helpfulness": "0/0", "author": "DUANE A. RICHARD"}, {"rating": 2.0, "review": "My 5meg internet renders this pretty much useless", "verified": true, "helpfulness": "0/2", "author": "Christopher T. Popham"}]