[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 4.0, "review": "Had trouble getting the stick in the tv  but once it was in the rest of the set up was easy. Love it", "verified": true, "helpfulness": "0/0", "author": "Chris Ertl"}, {"rating": 4.0, "review": "Very easy to set up. My only complaint was when I used voice recognition to find House of Cards it took me to Amazon's sales site and try to sell me the DVD.", "verified": true, "helpfulness": "0/0", "author": "Harvey Stambler"}, {"rating": 5.0, "review": "I'm happy with my Fire Stick. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Orlando Cuevas"}, {"rating": 5.0, "review": "easy to set up. works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 3.0, "review": "Not satisfied or satisfied  at this time. Still learning the benefits and advantages. Dissapointed in the limited number of free movies and many of the movies available or free on networks available with Uverse.", "verified": true, "helpfulness": "0/0", "author": "James A. Glaze"}, {"rating": 3.0, "review": "I bought the product for the movies.  The selection of free movies that I'd want to watch is very limited.", "verified": true, "helpfulness": "0/0", "author": "Upstate Guy"}, {"rating": 4.0, "review": "I absolutely LOVE it!  However, there are times when I have to unplug the wire from the stick and replug to make it work.  Doesn't happen often though.  Now I'm all caught up on all the great shows I never had time to watch.Update 2/12/15:  Now, almost EVERY time I want to watch anything on the Fire TV Stick, I have to unplug and replug everything related to the \"stick\".  Tonight even that didn't work.  Now it doesn't seem to work at all.  I'm disappointed, to say the least.  It was a Christmas gift from my daughter and I haven't even used it two months!  I'll be forced to watch network TV....Noooo!  What's up, Amazon??", "verified": true, "helpfulness": "0/0", "author": "Ann Sturm"}, {"rating": 5.0, "review": "I have Chromecast, a Roku 3, and a Sony streaming Blu-ray player and this stick is generally as good as the Roku, superior to the Chromecast and far superior to the TV and Blu-ray streaming options.  Very fast, nice user interface and for the same price as the Chromecast, is much more complete.  I prefer the Fire remote to the phone app, which is very sensitive and sometimes difficult to maneuver, but better for searching.  Took no time to setup and log into my Prime account;  I'm still looking for a good sling app (like Webcaster for Chromecast), but am pretty confident that it's not far away.  I've tried Firecast and it doesn't work well for me. This isn't such a big deal because most viewing is between Netflix and Amazon Instant, which work beautifully.  I live in a suburban area that offers only really crappy AT&T; DSL service, but the Fire seems to work fine and I seldom see the \"buffering\" message or notice any lags that were so problematic on the TV's resident streaming feature.My daughter has the full Fire TV, which is maybe the only thing I've seen that works better than this - not to take anything away from Roku3, which also works great.  The main advantage is the Amazon interface to Prime shows, which is very smooth.", "verified": true, "helpfulness": "0/0", "author": "Casysdavid"}, {"rating": 5.0, "review": "Great. Got this for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Croson"}]