[{"rating": 5.0, "review": "Love it!  Much better than Chromecast IMHO.", "verified": true, "helpfulness": "0/0", "author": "Dennis C. Duneman"}, {"rating": 5.0, "review": "Not sure how we lived without this device.  LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Christine Murphy"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Buttablase"}, {"rating": 4.0, "review": "I like the fact that u can take it from one TV to another! Easy set up and easy to understand tutorial. I live using it with my kindle fire. Watching a movie on the kindle and then one tap of the finger, watching it on the TV. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love Amazon Fire!!! Ease of installation and great navigation to find the media I want.", "verified": true, "helpfulness": "0/0", "author": "Julie Moore"}, {"rating": 5.0, "review": "Crazy simple to setup, plug in and it's already configured for your account!  Very snappy interface, way less sluggish than my AppleTV.One negative is that premium content is listed side by side with the stuff you have for free, so you need to pay attention that you aren't purchasing $$ Premium stuff instead of watching free content.  Should have all the Prime / Free content in a separate window so it's easier to see what you have access to without spending addtional $, but I know why they do it, to get you to do drive-by purchases. :(  Yuck!", "verified": true, "helpfulness": "0/0", "author": "Paul A Phillips"}, {"rating": 5.0, "review": "worked just as promised.", "verified": true, "helpfulness": "0/0", "author": "joseph kwasny"}, {"rating": 1.0, "review": "I can't get it to stay connected.  I put in that I want it to connect to DLINK, put in my password, it tells me signal strength is very good, authenticating, connected, then disconnected and nothing.  I don't know what to do next.  I've had my adult children try to figure it out and they can't figure it out either.  One of them has the firestick and loves it which is why I ordered one.", "verified": true, "helpfulness": "0/0", "author": "Karen Vaughan"}, {"rating": 5.0, "review": "OK, this is way cool. Easy to set up, easy to use. So far I have had no issues with streaming movies or TV shows as others have reported. The selection of Prime shows is terrific. The remote control is intuitive and much easier to use than the one for my cable provider. Oh, and NO commercials!!!", "verified": true, "helpfulness": "0/0", "author": "harlan goodrich"}, {"rating": 5.0, "review": "it's great easy to install and to use", "verified": true, "helpfulness": "0/0", "author": "Ruth G."}]