[{"rating": 5.0, "review": "i bought it preorder with the amazon prime discount.  it works great, i also have the roku stick and the firestick is a lot faster and the mirror feature works pretty good with a little lag. i like that you can download apps and play them with the remote that comes with it.", "verified": true, "helpfulness": "0/0", "author": "mike johnson"}, {"rating": 5.0, "review": "I love Amazon Fire! I wish there was a better way to filter by free Prime Movies only, but I think that is an Amazon issue, not a hardware issue.", "verified": true, "helpfulness": "0/0", "author": "sarahe"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Susan C. Waters"}, {"rating": 4.0, "review": "Like to see more current tv.", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 3.0, "review": "Not all I expected but its ok I should have done more research.I have charter for tv and thought i could use the showtime HBO AMC ect...apps with the stick like I can with my fire tablet but I cant.", "verified": true, "helpfulness": "0/0", "author": "g161607"}, {"rating": 5.0, "review": "Love it. So worth the price.  Especially if you have a prime membership.", "verified": true, "helpfulness": "0/0", "author": "AMelia Turcotte"}, {"rating": 5.0, "review": "I have two fire sticks and love them both.  Far better than Google chromecast.  Having even a basic remote is 1000x better than dealing with using your phone or tablet as a remote like with chromecast.  I dig it, and got them on the pre-release sale for 20 bucks.", "verified": true, "helpfulness": "0/0", "author": "bigdogdeee"}, {"rating": 1.0, "review": "There are better similar devices out there. They falsely represented this item to me, claiming certain apps like Lynda.com work with ti when they don't and Amazon charged me for this item even though I returned it ( I did exactly what they asked me for the return process).", "verified": true, "helpfulness": "0/0", "author": "OwlExMyth \"ntg\""}, {"rating": 5.0, "review": "If I could give this 10 stars I would!!!  Went way beyond expectations", "verified": true, "helpfulness": "0/0", "author": "Ruby"}, {"rating": 5.0, "review": "Love this product.  Works very well.", "verified": true, "helpfulness": "0/0", "author": "Richard Scanlan"}]