[{"rating": 5.0, "review": "bomb", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Purchased for my teenage daughter. She loves it.  Works exactly how she had hoped.  Considering purchasing another for main TV and getting rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 4.0, "review": "Great TV stick, the best I've used so far. I've enjoyed a lot watching my prime TV on it.But the apps were a different story. They are very limited, allowing you to just watch clips. And most I've tried required me to go on a PC and register an account to have access to their content. Some of the annoying apps were A&E;, Disney etc.Another thing I'd add is get the voice remote control! Otherwise searching for content is painfully slow.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It's Ok. Does freeze up a bit.", "verified": true, "helpfulness": "0/0", "author": "Ramon_Tej"}, {"rating": 5.0, "review": "it works fine.", "verified": true, "helpfulness": "0/0", "author": "David H Knight"}, {"rating": 3.0, "review": "I bought the Amazon Fire TV Stick and was very impressed with it. Setup is fast, it is very responsive and easy-to-use. However, in the end, I have decided to return it to Amazon. Why? For me, the ecosystem is too limited. Channels (or apps) that are free on other systems are either not available or have been developed by a 3rd party and need to be purchased. For $7 more, I have switched to the Roku Streaming Stick, which has a much larger selection of apps, many of them free. I believe I would spend more than $7 dollars to get the content I want if I stuck with the Fire TV Stick so I am willing to pay a little more up front.I think Amazon makes great products (Kindles, Fire TV stick, etc.), but the walled garden they lock you into just does not work for me. If you use Amazon mainly for your ecosystem content, their products represent a fantastic value. But for someone like myself, who prefers to use Google services, Amazon becomes, frustratingly, a compromise I am not willing to accept.", "verified": true, "helpfulness": "0/0", "author": "Biotech Sales Guy"}, {"rating": 5.0, "review": "I am very happy with this product and havent has any issues with it.", "verified": true, "helpfulness": "0/0", "author": "Diana C."}, {"rating": 4.0, "review": "This Fire TV Stick is pretty awesome. Great apps and options. You really can't beat the price of this thing. With Amazon Prime, the options are unending. The only reason that I didn't give it five stars is because it loses connection with my network often enough to be irritating.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "You would have to be plain stupid to not invest in this little gadget. I refuse to pay for cable/satellite. I find it a total rip off. We are a Netflix family without a smart TV. When I saw this little amazing, super easy to set up, warranty offered, Amazon backed gismo, it was an instant must have. Best $40 invested. No issues to date, hooked up to my wifi painlessly, set up could easily be accomplished by an 80 year old elder with NO technology experience (c'mon, it's got a video to follow with a little cartoon man - you cant possibly mess it up), the remote works great and is tiny... perfect. Invest Invest Invest!!!! :)", "verified": true, "helpfulness": "0/0", "author": "K. Smith"}, {"rating": 5.0, "review": "I had google chrome cast and was a little reluctant to purchase this device. Wow night and day difference... this thing rocks and I use it nearly exclusively...  Great Purchase!!!!", "verified": true, "helpfulness": "0/0", "author": "Lucky Boy"}]