[{"rating": 4.0, "review": "Has everything the chromecast doesn't. Netflix/prime ie all apps run right from the device itself, so no computer/phone needed. Tons of apps. Video quality is good, dolby digital plus audio is very picky about what devices you connect it to, so check your home audio reciever or there's a chance you'll only have stereo audio. Remote is good, phone app remote is iffy, does not work with a few apps for text entry", "verified": true, "helpfulness": "0/0", "author": "sam lewis"}, {"rating": 3.0, "review": "I like the gadget, and coming from Apple TV, Google TV, Roku 2, Roku 3 and Chromecast I can say Fire TV Stick can be a perfect gift. However, after about a week of use, the Fire TV Stick stopped responding to the remote. At first it was misinterpreting commands, while going through listings, jumping through several titles at once, then confused right with left, eventually left stopped working altogether and now none of the keys on the remote work.", "verified": true, "helpfulness": "0/0", "author": "Alex Lokshin"}, {"rating": 1.0, "review": "Mine wont set up and is stuck in a boot loop.I plugged my stick into my tv. \"Amzon\" logo poped up followed by \"fire tv stick\" logo then screen goes black and my tv hdmi channel number window comes up as if the tv has no video signal. Then it repeats that over and over again. I cant get past that to set it up on my network...Info:  I have a Philips 32\" TV model#: 32PFL4507/F7 manufactured in june 2012", "verified": true, "helpfulness": "1/1", "author": "Alex Mikus"}, {"rating": 5.0, "review": "First roku like product that I have used where I thought - hey - this is as good as a roku.  For the $20 I picked it up for, a great deal!  Now I have a roku like to device in my office!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Winder"}, {"rating": 4.0, "review": "Initial set up was tricky, and I ended up having to enter the wifi information several times over the first few days. Also, it logged me out of netflix once. Otherwise, it's been great. Turns on super quickly, keeps the apps I use often accessible on the home screen. Beats the heck out of my Roku HD.", "verified": true, "helpfulness": "1/1", "author": "Danny H."}, {"rating": 1.0, "review": "Netflix does not work. Amazon prime instant video keeps going offline. The games are lame and streaming anything is a constant battle. I could say that this is a beta version.... and a pretty bad one.", "verified": true, "helpfulness": "0/0", "author": "miguel"}, {"rating": 4.0, "review": "The Fire TV Stick is a very good streaming stick.  It performed very well.  I got it for the prime special $19 and it is a steal at that price.  Previously I used a chromecast for my streaming needs but was frustrated by always needing to stream from my phone and control it from my phone.  At the MSRP of $35 for a chromecast and $39 for the Fire TV stick it is a clear choice to pick the Fire TV stick.  Unfortunately Amazon does such a good job of finding low prices that the chromecast is only $22 and for that price it is a hard decision to choose between the two.  The Fire TV Stick is able to be used independently and also seemed much faster to stream videos than the chromecast.  The Fire TV stick also comes with a remote, the chromecast does not since it can only be operated with a phone or computer anyways.  The only negative I have is that the help page says it supports WPA EAP and from what I can tell it does not.  Not a big deal, I can probably work around it at my dorm and it is possible it is a feature they are still working on implementing.", "verified": true, "helpfulness": "0/0", "author": "Luke Kuprenas"}, {"rating": 4.0, "review": "Small area so this fits perfectly and has all the apps I use often.", "verified": true, "helpfulness": "0/0", "author": "Alison A."}, {"rating": 5.0, "review": "I have an Old XD Roku with HD and there is no upgrade software offer, I do not want to spend $100 for their new box and here's Fire Stick with more memory. My old Roku doesn't have You Tube and is so sluggish. The Fire stick is great for me as I can stream Amazon Prime, Hulu Plus, You Tube, Netflix,.. with one device. The first thing you do when you get this device is the software update and then it's fine. Great product, kudos to Amazon for coming with a great product. PS. I do have chromecast, but I am using fire stick more.. hope more channels/Apps come to Fire Stick in the future", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 1.0, "review": "getting \"unable to update your fire tv stick\" error repeatedly.  Initial update took forever and then the stick kept crashing.  Chromecast is much easier to use and much more reliable.  I'm returning this product and cancelling my preorder to the echo.  Amazon simply hasn't figured out how to do hardware yet.", "verified": true, "helpfulness": "1/3", "author": "Henry Jia"}]