[{"rating": 1.0, "review": "I bought this item in October of 2014 so that I could stream from my Surface Pro 3 to my TV using Miracast. The Fire TV Stick was advertised that it could do this. It did not work. Amazon then (November of 2014) changed their product information to state, \"Miracast™ Certified (Windows 8.1 coming soon).\" That was 8 months ago and Amazon still has not done the work to support Miracast on Windows 8.1. It seems to me that Amazon is not going to support their claims in a timely fashion. If I would have known that they were not going to support their product as advertised, I would have returned it. Now, it's too late.", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 4.0, "review": "I was so excited to get this, and the setup was easy.  Just thought all I needed was an HDMI port and a USB port, which we had.  The video was clear as a bell, and the remote worked well.  However, no audio.  After 2 hours with very kind tech experts on the phone through the Amazon help line, we figured out that our 5 year old TV needed just one tenth more band (needs 1.4 or above she said) to support the audio output of firestick.  I am SO disappointed, so if you have an older TV, check that spec out, also.  Otherwise, looks like an awesome product after just a glance.", "verified": true, "helpfulness": "0/0", "author": "sylvia j collins"}, {"rating": 5.0, "review": "Great! I Love it! All of the good things you have read are true.", "verified": true, "helpfulness": "0/0", "author": "ivector10"}, {"rating": 5.0, "review": "I'm loving our new Amazon Fire TV Stick. We previously had purchased a WD Live TV.  It was a great option for us to watch Netflix and Hulu but I was CONSTANTLY fighting with the remote and having our friends kids grab the box and unplug everything.  The Fire Stick just plugs into the back of your TV, away from everything.  You don't have to worry about anything being between the remote and the stick either.  It moves smoothly between options. Our next purchase will be the Fire TV so we can plug in our external hard drive and move this one to our bedroom!", "verified": true, "helpfulness": "0/0", "author": "Devin B."}, {"rating": 5.0, "review": "Very, very easy to navigate!  Amazon seems to stream through better than on my PS3.  Even the games are fun.", "verified": true, "helpfulness": "0/0", "author": "HotKitty FromHell"}, {"rating": 3.0, "review": "Access to material and music is good but resolution on streamed TV shows is poor, not HD quality.", "verified": true, "helpfulness": "1/1", "author": "Chris H. Ford"}, {"rating": 1.0, "review": "Don't put a deal out there that Prime members can't even get before 1pm!", "verified": false, "helpfulness": "3/6", "author": "JW"}, {"rating": 1.0, "review": "Waste of money if you have a slow internet. Even with a fast internet movies cost $ and  nickle and dime you to death.No you can not mirror your Fire tablet and browse the internet.No you can not use it as an android operating system. That would be great. No it does not have a browser. I hacked it and added one butwithout a remote key board and mouse hooked to the tv. I goes no where.If it had a way to download a movie and watch it later it would be more useful.For me all it does is stutter.", "verified": true, "helpfulness": "1/2", "author": "Snowplace"}, {"rating": 5.0, "review": "I have loved having the amazon fire stick. It super easy to set up and is user friendly!", "verified": true, "helpfulness": "0/0", "author": "kacey chavez"}, {"rating": 5.0, "review": "I bought this Amazon five TV stick for two months now and I love it is very nice to be able to watch Netflix watch tons tons of videos specially if you Amazon prime member very nice  highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Mohamed"}]