[{"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Hwa-Chi Wang"}, {"rating": 5.0, "review": "The FireTV Stick has exceeded my expectations, the interface is simple, the RF remote is easy to use and doesn't have to see the other end to work as other set-tops do.  Works great with Amazon Prime, Netflix and works great with All-cast.", "verified": true, "helpfulness": "0/0", "author": "kb9szm"}, {"rating": 5.0, "review": "I have just started exploring the many facets of this product.  First off: it's much easier to use and access features than the Google Chromecast.  I have both.  Fire Stick wins hands down: easier to setup, to navigate, to view.  The remote is excellent, simple, and very useful.  Somehow , the large memories and buffers compensate for even my EXTREMELY slow dsl (0.69 mbps!!!).  There is setup lag time, but once it downloads a significant amount of stuff, the streaming is pretty good.  I did try using it with my Verizon JetPak, but streaming thru that faster tool sucks up quite a bit of data, so unless you have unlimited data, that is NOT a good option!", "verified": true, "helpfulness": "0/0", "author": "Christopher L. Lee \"noteworthy\""}, {"rating": 5.0, "review": "Excellent purchase for the $20 price paid. Works well on Hulu plus, watch ESPN and YouTube. No problem using the youtube by pairing it on my iPad. One of the best device. Now time to sell my roku HD.", "verified": true, "helpfulness": "0/0", "author": "Rishabh Halakhandi"}, {"rating": 4.0, "review": "I cut my cable cord about half a decade ago when the very first netflix player (Roku) was introduced and I have owned nearly every generation of Roku Player ever put on the market since, mostly due to my self gratification (never due to the quality of any given Roku device). So trust me when I say this Fire TV Stick in \"near perfect\". First of there is no lag time between pressing a button on your remote and achieving the desired response on your TV something you experience using the Roku streaming stick (especially if you use to use the earlier Roku box player). Second being a Amazon Prime Member the transition is seamless owing to familiarity with the service and the fact that the product was delivered preset with my account information, but guess what \"No YouTube \" now life is hard enough as it but life without You tube is just excruciating, I really hope this flaw is rectified very soon. But at an introductory price of $19.99, zero delayed response and instant access to everything Amazon Prime and the promise of much from Amazon Just Buy One NOW !!!", "verified": true, "helpfulness": "0/0", "author": "Femstar \"Femstar\""}, {"rating": 2.0, "review": "Took it out of the box.  Plugged in the included power cords.  Plugged it in to my HDMI port in my 40\" Philips TV.  Nothing - Time to get my money back I suppose.UPDATESo after trying My third HDMI port, it finally started working. Now, it seems it is hit and miss if it wants to play my shows on my library. Sometimes it works, other times, I keep getting an error and it won't play.  Not impressed, but it is nice when it does work.", "verified": true, "helpfulness": "1/1", "author": "Scott L."}, {"rating": 5.0, "review": "Works perfectly. Plugged it in, hooked it to wifi & started streaming!!! Movies come in picture perfect. Best part is you can pause, rewind & forward np!! Great job amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Mertle"}, {"rating": 5.0, "review": "I've been an Amazon Prime member for years but have very rarely taken advantage of all the movies that can be streamed for free. I'm just not a fan of watching movies on my computer or tablet. With the Fire Stick, I can finally watch all those movies on my television. The user interface is easy to navigate and runs smoothly.I have a moderately slow internet connection and was afraid I'd have to constantly wait for the videos to 'buffer' but so far I haven't had any problems. I love the HD picture quality! Might not be 100% that of a blu ray, but it's close. Includes awesome apps like Netflix, Hulu Plus, Pandora and more.OVERALL: Everyone needs one of these TV sticks, whether it be Amazon's or Google's or whoever else's, but for Amazon Prime members, this is the one you MUST get. It makes watching Amazon Prime movies unbelievably easy and also makes it easy to rent new releases. Add the Netflix capability and so many other apps, it's the coolest thing ever. So glad I purchased!", "verified": true, "helpfulness": "0/0", "author": "Tyson"}, {"rating": 5.0, "review": "I saw the two day offer a month ago or so for $19 and decided to buy it for the Sony 32\" 1080P set I use as my monitor for my desktop system, figuring that I could switch to a show if my computer was busy doing something (i.e. processing a video file, virus scan, etc.)  It took a few weeks for it to show up (as expected), so I was excited when it finally arrived.  The packaging is very attractive and for the price, I was pleased to see an HDMI extension included.  I didn't need it, as the Sony has 4 easily accessible HDMI ports that it could fit into without interfering with any of the others.Setup was as easy as inserting the micro USB cable into the stick, inserting the stick into the HDMI port on the television (TV off), and lastly, plugging the cable into the power dongle and into a surge protected outlet.  That's the order I chose to do it in, knowing the HDMI carries current, and this sequence would minimize something frying up.  I've had that happen before (HDMI current frying something), so I'm extremely cautious.From there, it was a piece of cake.  I selected my WiFi network, entered the password, and then waited while the Fire downloaded a large update.  Long enough, that I left the room and came back.  It reboot, and I had to re-enter my network info, and then was good to go.  I've been using Roku's for several years now, so the interface is very familiar, intuitive, and easy to navigate.  I watched a few prime shows and downloaded several games that can be used with the included remote.I'm very impressed.  I started using computers back in the early 80's, and to see a device this small provide an experience like it does is awesome.  The graphics in several of the games rivals full size gaming systems from fifteen years ago, and the speed of starting and fast forwarding movies is quicker than my Roku 2 XS.I really like the experience this device provides, and I really can't believe some of the one star reviews.  People dinging it for not working in their home theater receivers doesn't seem fair, as they specifically state that it's to be plugged directly into the television.  The problem very likely lies with the firmware in the receiver and not the Fire Stick.  Giving it one star for not including the voice command remote is unfair, because it clearly spells out that it's an optional accessory.  People know this going into the purchase.  To each their own, I guess, but I'm thrilled with my purchase, and it will fit the bill for what I'm using it for perfectly.  I bought the two year Square Trade warranty just in case something happens too.Overall, I would highly recommend the Fire Stick based on my experience thusfar, and will update if anything changes.", "verified": false, "helpfulness": "0/0", "author": "Trojan Jon"}, {"rating": 2.0, "review": "Meh. I don't love it.My biggest question is: Will I always have to re-setup WiFi after an update? Seriously, it's annoying having to enter my WiFi password over and over (three times in the first half hour).Setup took about 20-30 minutes. Lot's of downloads, reboots, and installs. The interface is slow and poorly designed. It's hard to see what video I have selected when the tile's color is white like the box that highlights the active tile. They couldn't have used a more distinctive color? Red? Green? Yellow? This seems typical of the lack of thought put into the Fire Stick's UI.The graphics can't keep up with fast scrolling, so you have to stop scrolling through videos for a couple of seconds or you just have a bunch of grey tiles.The remote buttons are really stiff, so my thumb was actually tired after entering my WiFi password and scrolling... scrolling... and more scrolling. It's just not a joy to use.I would go with a more mature product like Roku. At $20 I'm not really too upset, but if I'd paid full retail I would've decided to return it within an hour. I was honestly surprised that Amazon put out such a poor first attempt. I don't think I'd ever trust them enough to preorder an Amazon product again -- even at half off. I won't return it, but I could easily have lived without this uninspired product.", "verified": true, "helpfulness": "2/3", "author": "Misunderstood Computer God \"exodus203.com\""}]