[{"rating": 5.0, "review": "This was the first media streaming device I had purchased outside of my video game consoles. So far I have been extremely pleased with the Fire TV Stick. It was incredibly easy to set up. Just plug the power adapter into a wall outlet (the cable was longer than I expected), plug the power cable into the Fire TV Stick, then plug the stick into a HDMI port on your tv. Then turn your tv on and run through setting the Fire TV Stick up with your wireless router. Done! I had no problems with it detecting and connecting to my wireless router either.I have been impressed with how snappy the performance has been too. Booting up Netflix, Hulu Plus, Twitch, YouTube, and other apps has been a breeze. The image quality is very good too and things look crisp and clear. The included remote works well and doesn't feel cheap. I also downloaded the Fire TV app on my iPhone and it works well especially if you want the voice control feature. Playing games works well but it can be tricky trying to use the remote as a controller. Personally I don't plan on playing tons of games with it, but if you do you may be better off buying the Amazon game controller. All in all I have been very pleased with the overall design and especially the performance of the Fire TV Stick. I definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Ry-Guy 83"}, {"rating": 4.0, "review": "Got this as a gift for Xmas. Didn't really have a *need* for it, since I don't have Amazon Prime, but this is definitely a neat little device. You basically plug it into your TV's HDMI port (and a wall outlet), and you can access a very handy number of apps directly on your TV. I can now happily use my computer sitting on the couch while I watch Netflix.If you have Amazon Prime, I'd bet this is even more awesome. Netflix is the only relevant app to me, and I still find myself using it a few times per week.4.0/5.0 stars (instead of 5.0/5.0) simply because I think the cord for this product (which extends from the wall outlet, to the Fire stick, and to the HDMI port) could definitely use to be longer. It barely reaches my TV a few feet away; I got lucky. I'd guess it's between 4 and 5 feet long. This is probably not that big of a deal for most people, but if your TV outlet isn't very close to your TV, you will run into problems.", "verified": true, "helpfulness": "0/0", "author": "Jessica Zarrillo"}, {"rating": 3.0, "review": "This is not exactly what I expected. The signal freezes a lot and the selection of free movies and t.v shows is very limited.", "verified": true, "helpfulness": "0/0", "author": "tais dominguez"}, {"rating": 5.0, "review": "love this!  bye bye high cable prices", "verified": true, "helpfulness": "0/0", "author": "beth g."}, {"rating": 5.0, "review": "Love, love, love it! My life has been changed! This product is amazing!", "verified": true, "helpfulness": "0/1", "author": "Colleen"}, {"rating": 4.0, "review": "Very good to this point.", "verified": true, "helpfulness": "0/1", "author": "Lucille kuebler"}, {"rating": 1.0, "review": "Would not recommend this product. Have called frequently for servicing. Doesn't work easily.", "verified": true, "helpfulness": "1/1", "author": "Sandra Mitchell"}, {"rating": 5.0, "review": "Love all the apps, easy to use", "verified": true, "helpfulness": "0/1", "author": "AnnaMo"}, {"rating": 1.0, "review": "This little hdmi tv stick is great...when it's working for the first 10 minutes.  In the past month that I have owned it, I have had to disconnect and reconnect it approximately once an hour while trying to watch anything.  I had a chromecast for about 2 years prior, which worked almost flawlessly the whole time.  When I called amazon and asked them about the terrible playback quality, they waffled around the answer and said they \"had people working on it\". This fire tv stick can't play an hour long episode without dropping connection...in the exact same location relative to my router where the chromecast performed admirably.  As far as I'm concerned that makes the product non-functioning.  So don't waste your money on this piece of junk; it's worthless.  On a side note, I finally got angry enough to permanently switch back to my chromecast this weekend and am happy to announce that my streaming is once again uninterrupted.  Thanks for nothing on this one amazon.", "verified": true, "helpfulness": "1/1", "author": "RB"}, {"rating": 5.0, "review": "I didn't know what to expect, but I love this sweet little device! The more I use it the more I find to love about it!It makes Netflix so much easier to browse for movies, I actually enjoy browsing for movies now!  I found it frustrating before to search for movies on the Netflix site itself.I have Chromecast too and wasn't sure if I needed both, but there are so many different features I enjoy with both of them and use them equally as much.", "verified": true, "helpfulness": "0/0", "author": "Smart Shopper"}]