[{"rating": 5.0, "review": "works great! wife and i spent day watching 10 house of cards in a row!! love it", "verified": true, "helpfulness": "0/0", "author": "Michael Smith"}, {"rating": 3.0, "review": "This is a very good product especially when coupled with Sling TV. The need to move around with the remote to enter information is slow and the search function could be better.", "verified": true, "helpfulness": "0/0", "author": "Shane Williams"}, {"rating": 5.0, "review": "I f****** love it best s*** I've ever had in my life almost impossible to explain it all I can say is f****** great yeah I give it a 10", "verified": true, "helpfulness": "0/0", "author": "vincent skirmont"}, {"rating": 1.0, "review": "I could see where this would be useful if you didn't have a game system hooked up to your tv that you could access Netflix or Prime with, but there is no other benefit to this. I purchased this because I misunderstood and thought I could somehow purchase HBO GO and stream but turns out I still need a cable subscription to do so. I sent it back. Good idea but nothing I don't already have.", "verified": true, "helpfulness": "0/0", "author": "CindyS"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Marcin Landowski"}, {"rating": 5.0, "review": "Better than I thought it would work. It is so easy the get netflex & Amazon and the remote works better than the TV remote.", "verified": true, "helpfulness": "0/0", "author": "Gregory Riegler"}, {"rating": 3.0, "review": "I ordered my Fire TV stick back in early january before they were released. I don't watch much on the TV so this seemed to offer adequate access to content for my needs. The price and form factor  sold this form me. Even if it did not work great, i could not beat $39.I plugged this in once received and use it mainly for Amazon Prime, Netflix and Hulu. I have no complaints with the UI. Typing searches or configuring WiFi is a colossal pain given the lack of a keyboard. Fortunately the wifi setup is mostly a one time thing. I use very good complex passwords for my accounts so setup took a good two hours for everything. For searching, voiceinput would functionally be better. Mainly I brose by clicking around and the remote works just fine for that.So why did I only give it three stars?Netflix streams pretty well. Hulu flat sux though. Lots of times I only get audio. Video often cuts out. For months I though my internet was slow or my software out of date. I redownloaded the app and also ensure the stick was updated too. I even set it back to factury defaults and spent two more hours on setup again. No improvement. I gave up thinking it was my internet. Last week, i gave my iPad a try for hulu and netflix. That worked far better. No issues ever. I was using the same wifi.Today I went and got an AppleTV and plugged that into my stereo receiver and played some content on my TV. HUlu, netflix, zero problems playing. So yes it cost twice as much by it worked.So overall I like the fireTV stick concept. The price is great. I think it was easier to setup that the Apple TV was but that really was a slim difference. Both were extremely similiar in time and complexity. ATV has more features and more setup work to integrate into my personal apple ecosystem. But the ability to play the content it was intended to fell short. And that really was the bottom line. Perhaps an update to software will change this in the future. Probably a moot point though. The AppleTV will get all the use now until the fire tv stick offers something the appletv does not.", "verified": true, "helpfulness": "0/1", "author": "Michael L. Jauregui"}, {"rating": 4.0, "review": "The Amazon Fire Stick works great with my TVs, I dont have USB ports on some of my older ones but it's not a deal breaker. The only problem I have is now that I have a reliable streaming device why couldnt we put this in a Blu-Ray player?", "verified": true, "helpfulness": "0/0", "author": "D. Sosa"}, {"rating": 5.0, "review": "Love it. Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Alison R."}, {"rating": 4.0, "review": "Love this thing!! Replaced cable and haven't looked back. My only complaint is that it has difficulty connecting to my wifi at times, which causes low-quality streaming. However that could also be due to Comcast. *eyeroll*Excited to see what's added next.", "verified": true, "helpfulness": "0/0", "author": "Kyle P."}]