[{"rating": 3.0, "review": "Great streaming  device especially for the price and for those with Prime. I mainly got it to use with my Plex setup at home. The problem is I do not have internet at home and the Amazon Fire Stick will NOT work without internet even after initial setup. Without internet you can't even access downloaded apps/games like Plex. In order to use Plex on my home network I must enable and connect to my phone's tether, then switch networks back to my home network and get into the Plex app before the stick realizes the internet was lost. Once in the Plex app it's fine.In short this is a great streaming stick and works great with Plex. Just not the best local streaming solution without internet.", "verified": true, "helpfulness": "1/5", "author": "Jonathan Babb"}, {"rating": 1.0, "review": "Don't waste your time. Buy a Roku. Much better functionality and app selection. Most of the apps for the Fire TV don't work on the Fire TV Stick. Don't know what they were thinking...", "verified": true, "helpfulness": "1/17", "author": "Big E"}, {"rating": 5.0, "review": "Fantastic! Especially when installed on a TV with SimpLink or other compatible protocol which allows the TV remote to control it.I already own the $99 version. Here is why I prefer the stick.I personally don't need the voice remote and the speed of the stick is still acceptable. Not quite as fast as my Roku 3, but far more useful than a chromecast. If voice control is a must, I can control it from the dedicated remote app found in my cell phone's market.THIS VERSION HAS HARDWARE/SOFTWARE THAT ALLOWS PLEX TO USE 5.1 AUDIO CONFIRMED. I watched several shows/movies and can positively confirm that Plex plays 5.1 audio tracks on this stick.I just updated my $99 AFTV to the latest version patch, but since it is connected via an HDMI splitter to an XBOX One and then to my receiver, then out to TV, I cannot fault the $99 AFTV for audio issues until I run it directly to the TV and test.I was blown away when my LG smart tv now two years old 55LM6700 was able to control the AFTV stick out of the box. This means I don't need the dedicated remote and can effectively use the original TV remote now to control both my TV and the Amazon Fire TV stick. Why is this important? I have been using an excellent Harmony Remote control to handle all of the input switching. Now with this device (and Sonos speakers) I only need the TV remote to control my entire theatre system and eliminate the Roku if I really want to. Obviously the Roku has it's place in my setup, so this is something for me to continue to consider as the AFTV develops.I will not be testing the $99 AFTV for 5.1 audio from Plex, as my Xbox One now has Plex and this would be redundant (and time consuming, as I would have to switch out several inputs, enable ARC, or other things which I honestly, just don't need to do because the Xbox One does so much, so well.)In short. At $40 this is still a fantastic bargain. Just a tad slower than the $99, voice control is in the app only, and no reason to not buy it. Very, very impressed.", "verified": true, "helpfulness": "2/3", "author": "digitalicecream"}, {"rating": 5.0, "review": "I love it....People keep complaining about updating ..WELCOME TO ELECTRONICS!!! It works great and so easy to use....only regret is that I did not buy two...", "verified": true, "helpfulness": "1/2", "author": "Violetta C."}, {"rating": 1.0, "review": "Very disappointed. Constant connection issues on all tv's in the house. Had to switch back to the old roku's. Good news is that I got it for $20. bad news is that it was a waiste of $20.", "verified": true, "helpfulness": "9/15", "author": "zztop"}, {"rating": 5.0, "review": "I bought it at the prime dicounted price of $19, what a steal!!. So far i love the fire tv it is a chromecast and roku in one device. I would recommend it to every one.", "verified": true, "helpfulness": "1/2", "author": "aurora arce"}, {"rating": 1.0, "review": "It does not work . Stuck on update.", "verified": true, "helpfulness": "8/13", "author": "Luis Rivera"}, {"rating": 3.0, "review": "Definitely for the Amazon video ecosystem. A nice gadget which is, in my opinion, not ready for prime time.* Set up: Super easy, user friendly. Cudos for the length of the USB cable and the HDMI extension. (As suggested, I plugged it to its own power supply)* WiFi: I am using it at a distance of about 25 feet from the WiFi router and no walls in between, so I can't judge the WiFi aspect over longer distances or barriers. Still, it was  quite slow in downloading  the software update (have 15 Mbit line).* User Interface: I would expect the Fire TV stick to be user friendly, at least within the Amazon ecosystem. Sadly it is not. As an Amazon Prime customer, I would like to have an easy way to browse and search music. I believe that the search function should be content specific: the few music searches I have made almost always returned TV and movies results or VEVO video clips. What about Prime Music or my own albums?Judging from its functionality,  the device definitely needs external support in the form of a tablet or PC. The android  fire tv stick remote app can spare some heavy remote control clicking but, imho, will not solve the shortcomings of the GUI or the disappointing search function. The voice search recognizes the words but the search result problem remains. I wish they had separate searches within the specific content areas. * Casting a PC/tablet screen with Miracast: Mixed results here. It worked fine with my Samsung Galaxy Tab Pro 8.4, running Android 4.4.2 .  No luck with the HP Stream 7 running Windows 8.1: The Stream sees the Fire Tv Stick, but will not connect. I have no idea on which one is not compatible at this time. I will ask HP and Amazon....* Games: No idea, I did not try to install any and probably never will. If the main purpose is using it with Amazon video,  or any  of the pre installed  video apps, is totally worth the $20.Taking two stars off because of the user interface and the search.", "verified": true, "helpfulness": "7/9", "author": "P.M."}, {"rating": 5.0, "review": "Absolutely love this thing. Very easy to setup and use, has tons of great channels to watch and the parental controls are super easy to setup and customize.You will need an unused HDMI port on your TV to use it. For me it was easy - I just swapped out my Chromcast out for this!", "verified": true, "helpfulness": "2/4", "author": "Tim B."}, {"rating": 5.0, "review": "What a crazy deal for a great product this thing will rock your socks off.Pros:FastGreat WiFi connectionGood choice of appsSimplistic designCheapMore future-proof than competitors productscons:USB power option didn't work my TVInitial update failed for me onceBattery cover needs the hands of God to remove", "verified": true, "helpfulness": "0/2", "author": "ameyer117"}]