[{"rating": 5.0, "review": "This is well worth buying.  I have subscriptions to Netflix and Amazon and I can watch either using the Fire TV stick.  It's easy to set up and move from room to room.  You won't regret this purchase.", "verified": true, "helpfulness": "0/0", "author": "CMac88"}, {"rating": 5.0, "review": "Easy to setup and to use  I have the fire t.v. in the den and the stick in my bedroom love it !!!", "verified": true, "helpfulness": "0/0", "author": "vickie"}, {"rating": 5.0, "review": "I always hated watching prime tv/movies on a tiny screen, especially when I have a huge flat screen tv on the wall. Fire tv stick solves this problem.....Love watching programs on a big screen! Easy install, great reception, ingenious concept. Just be sure to be near your router, limited range.", "verified": true, "helpfulness": "0/0", "author": "RabbittRun"}, {"rating": 4.0, "review": "Great!!This is something for the person that doesn't want to game on their tv or has a game console . it offers most if not all the streaming services you need netflix, hulu+, prime services. with the added benefit of small casual games to kill time the game selection is small so if that what your looking for buy the fire tv box.", "verified": true, "helpfulness": "0/0", "author": "Martin D. Chavez"}, {"rating": 5.0, "review": "Very pleased with this product! !", "verified": true, "helpfulness": "0/0", "author": "Mary Ramsey"}, {"rating": 1.0, "review": "I was disappointed that it couldn't connect to 5ghz WiFi it would keep dropping.  Plus the Screen Mirroring doesn't work with Windows 8.1. The device has been returned.", "verified": true, "helpfulness": "3/3", "author": "Dave Westermann"}, {"rating": 5.0, "review": "Was not hard to set up, works great.", "verified": true, "helpfulness": "0/0", "author": "Ricardo_tpa"}, {"rating": 5.0, "review": "Works great! Fast and I use it with the remote app on my phone. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "David Park"}, {"rating": 4.0, "review": "Matches or exceeds my current experiences with Roku and other media players. I use it primarily for viewing media.Pros:App interfaces are well designed and intuitive, and the included controller is both comfortable and easy to use. No issues with dropping wireless connections that I've encountered with similar devices. Price is very reasonable.Cons:Stick has a required secondary power adapter that somewhat limits where it can be reasonably attached to a TV. It comes with an HDMI extension for harder to reach locations, but it won't afford you more then a few inches. Combined with the power adapter, this could limit where you can practically install it, though I didn't encounter any significant issues. The auto resolution feature caused significant playback issues jumping between various settings on my setup before I selected one manually.", "verified": true, "helpfulness": "0/0", "author": "Colin A. Weingarten"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Jen Combs"}]