[{"rating": 5.0, "review": "I love this fire stick.", "verified": false, "helpfulness": "0/0", "author": "shelvona butler"}, {"rating": 5.0, "review": "We have Amazon Fire TV and now a Fire Stick in the house.  We love the easy access to many programs, movies and games.  It is easy to set up and the quality of the equipment and service is 5 star.  If you are considering a streaming device, then we highly recommend you look into a Fire Tv or Stick.  It has changed our lives and how we watch tv.", "verified": true, "helpfulness": "0/0", "author": "Kevin L. Cyr"}, {"rating": 5.0, "review": "I love my firestick.", "verified": true, "helpfulness": "0/0", "author": "Dylan"}, {"rating": 5.0, "review": "Great buy !", "verified": true, "helpfulness": "0/0", "author": "Blake lloyd"}, {"rating": 4.0, "review": "I found it easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Charles Fasterling"}, {"rating": 3.0, "review": "I like that I can see movies and shows but it freeze a lot but is good for the price", "verified": true, "helpfulness": "0/0", "author": "Mildred"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "julie"}, {"rating": 5.0, "review": "I like this better than my Apple TV!  I just use it for basic functions like Netflix and Amazon Prime, but setup is simple and I've had no issues at all so far.  Price is right too", "verified": true, "helpfulness": "0/0", "author": "K. Myles \"Kirsten\""}, {"rating": 4.0, "review": "Terrific reception in our busy house. Howevdr, was disappointed there weren't many free shows to pick from. Maybe as I learn to use it and find apps that offer more freebies, my opinion will change? To watch some tv shows, you have to sign up for Amazon Prime. Signed up for the 3-day trial and will probably purchase a DVR to record tv shows for me and drop Amazon Prime, since it is $99/year.", "verified": true, "helpfulness": "0/0", "author": "Karen Meacham"}, {"rating": 5.0, "review": "This works far better than the Wii.", "verified": true, "helpfulness": "0/0", "author": "Laura"}]