[{"rating": 5.0, "review": "I have Roku and got this for comparison. I'm a subscriber to Amazon Prime and that makes a huge difference. I've taken to using this rather than Roku. More free good stuff, less of the worthless free garbage Roku offers.", "verified": true, "helpfulness": "0/0", "author": "R. Barry"}, {"rating": 4.0, "review": "Great addition for second tv viewing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Instalation was very easy. Instructions very good.  Now enjoying it very much.", "verified": true, "helpfulness": "0/0", "author": "Phylis Taft \"quilter and rosemaler\""}, {"rating": 5.0, "review": "I bought two units when Amazon has it on sale for Prime members.  At $19 a pop, it is an unbeatable deal.  I have used the stick to play Christmas songs over the holidays.  It is also nice to see the lyrics pop up on the TV while the song is playing.  The kids love it as they like to sing along.  I have been a prime subscriber for a very long time, but I mainly use the kindle library and two day shipping features.  Now with the stick, I am really making use of my prime benefits...which include free prime movies and music.The Stick does not come with a remote with mic, but I installed the Fire TV app on my Andriod phone, and it does voice search easily.  I gave the other stick away as a Christmas present to a friend, and him and his family have been having so much fun with it. I wished I bought a few more when it was on sale.", "verified": true, "helpfulness": "0/0", "author": "Ratatouille \"Vinny\""}, {"rating": 4.0, "review": "it is really cool the control remote, but is made it to work best with amazon prime, not so well with the other apps like Netflix", "verified": true, "helpfulness": "0/0", "author": "leonardo"}, {"rating": 2.0, "review": "The Fire TV stick does basically everything I'd like it to do (I don't play games on it), except that it doesn't  support screen mirroring. I have a Chromecast that I was hoping to relocate to my basement TV, but since the Fire Stick doesn't support mirroring from my device, I'm stuck switching between them. I called customer service and they said that mirroring is only supported by Fire Phone's and Fire tablet's (though it *might* work on other devices). They had no word on whether developers were working this issue or not. From what I understand the Roku supports Miracast without issue, I just assumed the Fire Stick would as well. Pretty disappointing.", "verified": true, "helpfulness": "1/2", "author": "bigbillyvegas"}, {"rating": 5.0, "review": "I am in love with this already!  I preordered through my prime and promptly forgot about it.  When it arrived before Christmas it was a pleasant surprise.  I hadn't had time to really set it up until yesterday, but WOW it was easy to set up!!  Have you always wished you could watch your prime instant video on the TV instead of just on your Kindle??  This little piece of technology is truly amazing and if you know someone who is a prime member and they don't already have this BUY IT FOR THEM!!", "verified": true, "helpfulness": "0/0", "author": "pss6908"}, {"rating": 1.0, "review": "Constant buffering, very slow. It should have come with ethernet option.", "verified": true, "helpfulness": "2/3", "author": "Milforder"}, {"rating": 2.0, "review": "If you've ever used Roku, you won't be happy with this.  Yes, it's got a fast processor, & works fine with Amazon Prime & Netflix.  But, it's limited.  You only have the 10 apps that come with it, at best.  If you are a Comcast subscriber, you can't watch your HBO GO or Showtime Anytime, as Amazon has no agreement with Comcast.  The user interface is not user friendly; I hate the remote.  You can't scan the menu 5 at a time as with Roku, you have to click it once for each item.  The buttons on the remote are difficult to press, quickly becoming an annoyance.  Onscreen menus are confusing, & just about everything defaults to:  \"go to the Amazon website\", which is not usually helpful.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 4.0, "review": "I was anxious to receive this little device over christmas and sadly I found it underwhelming. I have numerous types of streaming devices around the house (Roku's, Chromecast, AppleTV) Compared to the Chromecast if found it restrictive and lacking methods to access much of my online content. For example, I have MANY movies that are in Ultraviolet that can be accessed by apps like VUDU and Flixster that are not available (or do not have streaming functionality) on this stick. With the Chromecast you just have to have the apps on the mobile device or use the Chrome Browser on MAC or PC and you are off to the races.My kids (the primary consumer of TV) found the navigation easier than Roku but they preferred the way Chromecast worked b/c they didn't have to learn a new interface on a new system. They just used their tablets or computers like they normally do and then \"Cast\" the video/songs/webpage to the TV.Another annoyance is having to have YAR (Yet another remote). I feel like between my sound bar/TV/Blue-Ray/Electric Fan I need to have a table dedicated to holding remotes.Even with these IMHO sub par features compared to the Chromecast, I still found the FireTV stick easy to use. I liked the broad selection of games (though my children still prefer to play them on the tablets). I also found the remote easy to use.As it compares to AppleTV.. well it's almost apples to oranges. Amazon is more closely linked to the Android and Amazon ecosystem and AppleTV is obviously linked to that ecosystem. Depending on where your content is. One obvious difference is AppleTV does not have any Gaming capability. Like the Chromecast, my kids found the AppleTV easier to use in many cases.I can see this stick gaining in utility and I can see them wiping out the Roku market if Amazon continues to invest in the product. I still feel like the Chromecast will always be the best stick out there mainly b/c it's so simple my 5 year old can use it.Once VUDU or another method for access Ultraviolet content is added, I may find the device more useful in the future but until this feature is added, this stick will likely rarely get used.", "verified": true, "helpfulness": "0/0", "author": "Rhys Samson"}]