[{"rating": 4.0, "review": "I got this item for $24 thanks to the Prime Day Sale, so I couldn't pass up that deal! We used to have our wii hooked up to the TV for Netflix purposes. The Fire Stick is really handy because it plugs into the TV so it isn't taking up valuable entertainment center space. I don't like how it has to stay plugged into an outlet because that cord hanging is unsightly, but I can deal with it. Setup is extremely easy. Very user friendly. I like all of the apps that are included.", "verified": true, "helpfulness": "0/0", "author": "Courtney M"}, {"rating": 5.0, "review": "Wonderful! Easy to program just love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "grace strong"}, {"rating": 5.0, "review": "Very easy install and works great!", "verified": true, "helpfulness": "0/0", "author": "Clifton  Swan"}, {"rating": 5.0, "review": "The best!!!", "verified": true, "helpfulness": "0/0", "author": "Ram56"}, {"rating": 5.0, "review": "Easy setup and works great!  Our WiFi router is set up in our living room. We use the Fire stick in the farthest bedroom in house from WiFi, appx 75 ft away and works great.", "verified": true, "helpfulness": "0/0", "author": "Grandflanma"}, {"rating": 2.0, "review": "Too difficult to navigate. Very little free viewing, most programing had to be paid for.Wish I had bought a smart TV instead.", "verified": true, "helpfulness": "0/0", "author": "Janice M. Peffer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "corinda a graham"}, {"rating": 3.0, "review": "i like the fire tv stick but some channel don't work even when an agent try to help me solve the problem. she told me that she'll have a tech call me to help me with the error code 400-1 to make the most important channel work for my child. so i'm still waiting", "verified": true, "helpfulness": "0/0", "author": "R J"}, {"rating": 5.0, "review": "The Fire Sick was easy to install and set up. I have used it mostly every day since receiving it and found it to be easy to use and navigate through the content available. It has lived up to my expectations and everything it was advertised to do.", "verified": true, "helpfulness": "0/0", "author": "Eward F. Kipp"}, {"rating": 4.0, "review": "It does exactly what I need it to do. And I love the remote!", "verified": true, "helpfulness": "0/0", "author": "Evanna Payen"}]