[{"rating": 2.0, "review": "Already exchange one... too much stalling and stopping.  Overheats a lot.", "verified": true, "helpfulness": "0/0", "author": "Andrea Modeste"}, {"rating": 5.0, "review": "I have the Fire Stick and the Chrome Play. This is much easier to use because it doesn't require a Bluetooth device.", "verified": true, "helpfulness": "0/0", "author": "Robert E Guthrie"}, {"rating": 5.0, "review": "Screw cable.  This thing rocks", "verified": true, "helpfulness": "0/0", "author": "George Matheis Jr"}, {"rating": 3.0, "review": "The Fire TV Stick is great except for one problem.  Every few days I get an error where it won't show content.  I have to unplug it and unplug the TV to reset it.  Then it works fine for a few days.  Other than that, its great.", "verified": true, "helpfulness": "0/0", "author": "Daniel Brahana"}, {"rating": 1.0, "review": "I bought this right after introduction.  The concept is great but I've yet to be able to get it to work in the application for which it was purchased, i.e., use on hotel room TVs.  I've been unable to get the WiFi to acknowledge the device, even after discovering how to bring up a password screen (no thanks to the instructions, which were useless).This might work fine on your home TV with your home WiFi but for various reasons even that application hasn't worked for me.  A waste of money from my experience.", "verified": true, "helpfulness": "0/0", "author": "Montalvo"}, {"rating": 5.0, "review": "This 'Fire TV Stick' has got to be the best purchase I've made so far, just keep those new videos coming. Pat and I use the stick more now then Direct TV.", "verified": true, "helpfulness": "0/0", "author": "cricket"}, {"rating": 2.0, "review": "I bought this device to use with Plex. I can stream from Plex just fine to my 3 year old Sharp Smart TV just fine, even HD videos, but the tv interface is pretty horrible, so I bought the Fire Stick to get a nicer interface. It looked like a no brainer to me, simply plug this into a spare hdmi port and viola, all will be awesome!Connecting the device to my tv was simple, as well as connecting it to my network.  The wifi router is at the same location, a few feet away. Setup took about 5 minutes in total.  Streaming from my Plex server to the FireStick is pretty much unusable, even at the lowest bandwidth settings. The video will play for a few minutes, then just stop. It will USUALLY restart streaming, perhaps after 20 seconds, although sometimes the device will reboot. It makes the video unwatchable. So much for Plex. I guess its back to the horrible tv interface, or,  I can stream from Plex to my laptop or any of my phones with no troubles.  Ok, as I'm an HBO subscriber, I added HBO Go. I have the same pausing on here, though not as often. I was able to watch a movie with only 3 pauses.  When I first connected it, I had a video (apparently to stream from Amazon) in the 'My Video' category. I didn't get to try that, since after the firmware update last week, that video is now gone, so I can't test streaming from Amazon.  Next, I downloaded Hill Climb Racing. Its a fun (free, with in game purchasing.) This game periodically pauses for 1/2 second, then continue. Not a deal breaker, but not right either.  The same game is smooth as butter on 2 of my cell phones.  Performance wise, it gets 0 stars. It doesn't work very well at all for anything I need it to work for.  Setup gets 2 stars, it was quick and easy  Customizing gets 1 star. There are several menu items I would like to hide, but am unable to.  The remote gets 3 stars. It works very well.  Oh yeah, on my Sharp 60\" tv, I have it plugged into hdmi port 3. When I am watching either hdmi 1 (cable box) or hdmi 2 (dvd player), there is a low frequency hiss (more like a rumble), even with the tv volume all the way down. The only way to stop it is to unplug the Fire Stick. This is unacceptable.", "verified": true, "helpfulness": "0/0", "author": "R. Schaffer"}, {"rating": 5.0, "review": "My mother and I absolutely love love love our fire stick! When we finally figured out which HDMI port it was happy in, well now we can't stop watching it. First of all, we fell in love with Netflix and Mad Men, and watched all first seven seasons. Now we don't know what to do to watch the last season. I said to my mom, \"Well, Netflix has a television section! Mad Men is on TV. If the 8th season just finished, we must be able to view it on TV!\"But really, we have to wait. It's getting to be like an obsession. I mean, really. My God.At any rate, I think you can tell how much we love our fire stick. It's the best thing. Better than HBO and Showtime combined.--Christina", "verified": true, "helpfulness": "0/0", "author": "Christina Stachura \"ravenous reader\""}, {"rating": 5.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "Vincent Capellan"}, {"rating": 5.0, "review": "LOVE the Fire Stick! Was already configured to my Amazon Prime out of the box. Hook up was super simple.", "verified": true, "helpfulness": "0/0", "author": "Jamie J. Berry \"Jamie~Book Boyfriend Ho\""}]