[{"rating": 1.0, "review": "It is all in foreign language  --- can't get support to call me back.  Amazon care says I need to talk to support not return it.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 2.0, "review": "Why youtube is not working, although it is mentioned in the specifications that youtube is working", "verified": true, "helpfulness": "0/0", "author": "Mohamed"}, {"rating": 4.0, "review": "Remote is too small.hard to use the buttons", "verified": true, "helpfulness": "0/0", "author": "john condon"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "I did not like having to use outlet in order for it to work.  Over priced.", "verified": true, "helpfulness": "0/0", "author": "Esther Moyd"}, {"rating": 3.0, "review": "We have used this Fire TV Stick regularly since Christmas 2014 and have gotten familiar with it before posting a review.We have a Fire TV box that we have owned and used for months prior to the Fire TV Stick being released.  We are very familiar with navigating the menu and had a bit of headstart in that department.  We find the menu to be user friendly and easy to understand.  On this Fire TV Stick, we have the standard remote (no voice search) and have been able to enter search terms very easily.  We have no complaints on the remote or navigation of the menu.We use this Fire TV Stick for streaming video (tv and movies) only.  We do not use it for games, music, photo viewing, nor have we set up the FreeTime.  We have downloaded only a few apps... Netflix, Hulu Plus, Flixster... and have not overloaded our Stick's memory in any way.  I say this because we have the same complaint as others, the Stick will lose network connection very regularly.  Sometimes restarting the device will reduce the problem, and sometimes a hard boot (unplug entirely) will be of some help.  There will be regular issues with buffering while viewing videos through Amazon Prime Video Library or through apps (Hulu, Flixster, Netflix)... the Stick does not discriminate.Because of the buffering problem, we upgraded/replaced our modem and router.  We changed the location of the modem and router to better compliment the Fire TV Stick (all are in the same room).  The problem continues on this device only.  We have no issues on our Fire TV box that is used in a room 30 ft away from our router (down a hall, around multiple corners, various walls between point A and point B).  I should also mention that we did not have any buffering issues using our Sony Blu-Ray player to access Amazon Prime Video Library, Hulu, or Netflix, nor did any other devices in our home lose signal/connection while using our older modem/router.The Fire TV Stick, when working properly, is a great addition to the Fire family.  Picture and sound are clear, and portability is a nice perk.  I hope that through continued development and updates Amazon can find a way to eliminate the buffering.  Until then, based on our experience, I recommend the Fire TV box over the Fire TV Stick.", "verified": true, "helpfulness": "2/2", "author": "J. Moore"}, {"rating": 5.0, "review": "This review will not focus on features because at this point most streaming devices do the same, instead it will focus on what it can do for me.If you want to know what freq. of wifi it works or what processor it has or the codecs it can handle look at the box cause i don't know and frankly i don't care knowing that let me tell you something about this stick..Love it!!!! ...and here is why:I've own all the major players and some diy ones and i've come to realize that each and every one have a different targeted audience no single one will ever suffice and always going to be a lacking feature that will make it less than perfect.This is no exception but its really, really close to being perfect..... for me !!!!, this is what you need to understand when it comes to streaming boxes, sticks or HTPC you need to look beyond the hype and find a device that fits your needs...For example, your a fan of the fruit, nothing wrong with it, i am too and have been since it had a monochrome display, knowing that you need to know that this little device will stick out like a sore thumb because its not suitable for you, why? because you'll most certainly will have your photos in the cloud and your music in itunes, 2 feature that this device doesn't do... see were im going with this every device has it uses for example after the excitement of owning a chromecast i came to realize this is very annoying i need it to have either my phone or tablet near by to use it and that sucks when your laying in bed and you left your phone in the bathroom. Don't get me wrong its an exceptional piece of technology specially when your casting your snaps to a 65\" led  :) ....... said that this thing isn't for me thats why i found the perfect location for it in the kitchens tv where when im cooking or having coffee i stream some podcast from my phone.As a subscriber of the major streaming services all i can say is im in heaven this little thing works wonders hulu, netflix, hbogo and prime (Alpha house fan) all play wonderfully plus i just discovered the whole prime music thing and i kind of like it. I bought the stick because this was affordable enough to give it a chance and i wasnt dissapointed.", "verified": true, "helpfulness": "0/0", "author": "JATC"}, {"rating": 5.0, "review": "Awesome best device ever!!", "verified": true, "helpfulness": "0/0", "author": "Yalil"}, {"rating": 1.0, "review": "this was not what I expected and it was not made clear that purchases are necessary as there is nothing to watch that does not cost and it would have been better to purchase prime and not waste $ 42.12 I'm very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Franklyn"}, {"rating": 5.0, "review": "absolutely love the fire stick, I wish I hadn't waited so long to get it.", "verified": true, "helpfulness": "0/0", "author": "kch"}]