[{"rating": 5.0, "review": "Absolutely love it bye bye ROKU", "verified": true, "helpfulness": "0/1", "author": "Aaron"}, {"rating": 1.0, "review": "I'm sending my stick back after several frustrating days of attempted use. I've used a roku for several years with no problems, and will be plugging the roku back in tonight. I had no signal problems with my roku, even though it's several years old, but the fire stick immediately had problems maintaining a strong wifi signal. The big problem though, is that even when the signal was fine, I couldn't get videos to play. The system would just hang whenever I clicked on an episode to play. I had some luck with the device the first two days, but after that I couldn't get it to work at all. The support website is a joke. I tried uplugging several times, restarting, etc., but nothing worked. I also tried to reset the stick back to factory defaults, but the system would just hang when I entered my pin, so I couldn't even do that. Very disappointing.", "verified": true, "helpfulness": "1/1", "author": "J. Kaplan"}, {"rating": 4.0, "review": "Pros: very fast. sleek design.Cons: It recommended to use power outlet, but I use usb power either way. My tv has the usb prt next to the HDMI, so it is a little crowded. I recommend a shorter cable length, and switch the port to the end instead of on the side.", "verified": true, "helpfulness": "0/1", "author": "K. Nguyen"}, {"rating": 3.0, "review": "Hardware works fine. But good luck finding something from this decade to watch. Say your laid up on the couch after a skateboard injury and go to the search menu because the option menu only has a few choices from all of the providers that you're not subscribed to. So in this old DOS screen, you attempt to maneuver around the keys like writing a novel on your old rzr flip phone. THE  PRO.... you get typed in and YES you actually remembered a show you liked because you forgot to grab the tv guide for reference before you hobbled in to sit down. You remember, the one where Kurt Russell and Goldie Hahn were on the cover.  Cute couple is right!  Soo worth it bc now you're all set and now WHAT? Usually you can at least buy it for $2.99 even though you have a subscription to Prime but this says you need to have Hulu plus! Oh I see. I guess I'll just settle for 1989 dirty rotten scoundrels movie again. Or no wait, I still have cable. I do enjoy the screen savers tho as I loose interest and surf the net on my phone and fall asleep. Zzzzzzz", "verified": true, "helpfulness": "1/1", "author": "jarrid henderson"}, {"rating": 1.0, "review": "Dead on arrival.The screen is stuck on 'amazon' and won't go any further. So far... no impressed.", "verified": true, "helpfulness": "1/1", "author": "A.J."}, {"rating": 5.0, "review": "I bought the fire tv and the fire sticks for the kids. The sticks are great and easy to use within 10 minutes of opening the box. The interface makes everything so simple. I would highly recommend upgrading to the voice remote. Very happy with my purchase. I did find these cheaper at Best Buy.", "verified": false, "helpfulness": "0/1", "author": "Jason German"}, {"rating": 2.0, "review": "after an easy setup and nice interface the Fire TV Stick is a fast and fun device.. Amazon Prime video is useless, there is very little HD content without paying another $4-$6 for each video.. Most of this content is available in HD on Netflix.. Good thing the Fire TV Stick has the Netflix app..Amazon step up your game, HD should be included, otherwise you are no competitor to Netflix.", "verified": true, "helpfulness": "2/4", "author": "Paul Talbert"}, {"rating": 2.0, "review": "If not for HDCP issues, I would probably rate the Fire TV Stick much higher.  I'll try to explain everything without getting overly long-winded, but I have a feeling it's inevitable.First, let me say that I mostly like the remote and the device itself.  The Stick is something you probably won't see much of, as it's plugged into your TV, but it's not hideous and blends in fairly well.  As with my Chromecast, I wish the included USB cord was longer, because my surge protector is a few feet from the TV stand, meaning the cord is (almost) pulled taut--I would have hoped for a bit more slack.The remote looks nice with its understated colors.  It feels and looks better than my Roku remote with its gaudy toy-like colors.  The directional ring is responsive and clicks nicely, and though it may not be obvious to some immediately that it's a button, the \"select\" button in the center of that circle is also nice and large.  The battery compartment was actually almost frustrating to open, but it could be my specific remote-I haven't gotten to hold another one.  Another nice feature here is that, after your Fire TV Stick is set up and running, you can connect your smartphone (on the same wifi network) to it which allows it to also act as a remote--also allowing text input with a keyboard on your phone, which is more intuitive than using the included remote.The setup process is okay--connecting to my wifi network was straightforward enough, although selecting the wifi password on the keyboard is a bit cumbersome.  Chromecast, in contrast, allows you to make an ad-hoc connection to your smartphone, borrowing from it to establish its wifi connection--definitely a bit easier, although probably less intuitive for someone who's less tech savvy.  For most people ordering this for themselves, it will come with your Amazon account registered already.  If you have to enter your account info, it's a bit more cumbersome, because you need to again use an on-screen keyboard with the included remote to enter your username and password.  It would be nice if I could use my Android phone to set up my Amazon account after the Fire TV Stick is connected to my wifi network, but I haven't had any luck connecting my phone until after I'm past this point of the setup process.The interface on screen is fairly nice--better designed than Roku's, and is clearly more thought through than Chromecast (which has almost no real \"interface\", most of the time, since it's driven primarily by a smartphone/tablet).  It's certainly something I could trust my parents to figure out mostly on their own, which is not something I would say about the Chromecast.  It's also fairly snappy and responsive.  The one problem I seem to have frequently is double-input occurring--where pressing 'right' once will register as two or three clicks (or a click-and-hold) and will pass over what I'm trying to stop on.  Not a major issue but it definitely happens more frequently than I'd like, right now.The Fire TV Stick comes with most expected functionality--streaming Amazon Prime, Netflix, Hulu Plus, in addition to free services like Youtube and Twitch.  The quality is solid for wifi-only connection, and it seems to hog bandwidth a little less than my Chromecast does, but that's observational and not based on specific measurements/evidence.  Overall I'm very satisfied with streaming from these sources.Now, to the least favorable part of the device.  If it weren't for the HDCP issue I had, I would rate this either 4 or 5 stars. But after a day of usage, I decided to switch HDMI ports on my TV, and use the included HDMI extender, which allows me to give the Fire TV Stick (and TV's other HDMI ports) a bit more clearance.  After I did this, I tried using Amazon Prime Streaming and got a big blue screen indicating \"HDCP unauthorized. Content disabled\".  I tried Netflix and got the same result.  Audio played fine, but a big blue error screen appeared.  I tried Youtube and Twitch--they worked fine.I contacted Amazon support and they made some recommendations, including clearing data/cache from the device, and doing a factory reset (twice).  When this didn't work they told me they would contact me again after escalating for more information on their side.  I heard back today and the recommendation was to switch out my HDMI cable (although I was only using the extender that was included with the Fire TV Stick in the first place).  The second recommendation was to \"try another TV\".  Having no second TV, I tried switching HDMI ports on the TV, and tried removing the extender.  I tried clearing cache/data and a factory reset again, per the original support instructions--again no luck.  I found via Google a suggestion to unplug the TV from its power outlet, plug it back in, and try again.  This eventually worked, and resolved the HDCP issue--I can now stream on my premium subscription services on the Fire TV Stick.Ultimately, I really want to recommend this product, but I don't think everyone will know and understand the possible troubleshooting steps.  I don't think they should be expected to try things outside of what Amazon's support team recommends, either.  And even now, there's nothing obvious that would indicate to me that I should not use the HDMI extender--although I've heard this is an issue that might affect older TVs (mine is ~5 years old).  So I'm a bit concerned about recommending this to give as a gift, because you might not know the age/compatibility of the recipient's TV.It seems like it could be a great product--but Amazon needs to work a few things out in the Fire TV Stick itself as well as in the support process before I would feel comfortable recommending this product to everyone I know.  When it works, I like it better than my Chromecast and my Roku.  But neither of those two devices have EVER had any problems like the one I had with my Fire TV Stick--they worked out of the box, and have worked ever since.I would recommend watching review trends a bit to see if other similar problems are reported, and if they get less frequent as the holidays approach, before offering a wholehearted recommendation that everyone should have a Fire TV Stick.  I think it has potential and will get there, but I don't yet know when.Edit: For reference, my TV model is Sony KDL-46W4100.  I have no idea what bearing this has on whether my Fire TV Stick works or not, as Amazon has not provided any updates to me after supplying them with the TV model number over a week ago.  Also changing from 3 stars to 2, because effectively this product is as useful as a paperweight right now, given that the remaining functionality it has (Youtube/Twitch/etc) is done better on my Chromecast.", "verified": true, "helpfulness": "167/189", "author": "M. Donnelly"}, {"rating": 5.0, "review": "This is absolutely perfect, it even comes with an adapter for hard to reach tv's. The menu screens are great and it loads up instantly. I will be buying one for every tv in the house.", "verified": true, "helpfulness": "0/1", "author": "Kenneth E."}, {"rating": 4.0, "review": "For a portable version of the Fire TV, this is great. I bought one for my secondary tv. Not as full featured as full Fire TV,  but a good product nonetheless.", "verified": true, "helpfulness": "0/1", "author": "Martha A Collins"}]