[{"rating": 5.0, "review": "Better than Chromecast and Roku! AMAZING! However... I wish prime came free for 3-6 months at the least, or even just prime video.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Easy to setup and use. Much quicker than expected.", "verified": true, "helpfulness": "0/0", "author": "J. Silcox \"JAS\""}, {"rating": 5.0, "review": "This little thing is so amazing and easy to setup and use! I'll be ordering them for every room!! Thank you Amazon for getting me away from my wifi enabled blu ray that's forever losing signal! The picture and sound quality is amazing!", "verified": true, "helpfulness": "0/0", "author": "Thomas Martinez"}, {"rating": 5.0, "review": "Easy to install and use. No more using PlayStation to connect to Amazon Prime. Instant access and great quality for movie and show streaming for hours. Great price and value.", "verified": true, "helpfulness": "0/0", "author": "Lilia"}, {"rating": 5.0, "review": "Works exactly as promised. Very smooth interface and no lag at all from streaming.  Saves so much money over having another cablebox or computer hooked up to our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Wasn't worth the money. We use it solely for streaming TV. Our Hulu app freezes constantly and randomly quits to the home screen, even with internet speed that should be more than adequate. We have much better results streaming on my PS3.", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 5.0, "review": "Much cheaper then cable", "verified": true, "helpfulness": "0/0", "author": "Jesse Lindstrom"}, {"rating": 5.0, "review": "very happy", "verified": true, "helpfulness": "0/0", "author": "Ann S."}, {"rating": 5.0, "review": "Love it. So easy.", "verified": true, "helpfulness": "0/0", "author": "B Wolg"}, {"rating": 5.0, "review": "easy set up. easy to select choices. love amazon fire products", "verified": true, "helpfulness": "0/0", "author": "Donna L Harris"}]