[{"rating": 5.0, "review": "It's fantastic", "verified": true, "helpfulness": "0/0", "author": "Kathy Kemp"}, {"rating": 5.0, "review": "I love it very pleast with it", "verified": true, "helpfulness": "0/0", "author": "ronald richards"}, {"rating": 4.0, "review": "So dimple to connect and works GREAT!", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "Love it !!", "verified": true, "helpfulness": "0/0", "author": "james p. lamb"}, {"rating": 5.0, "review": "Terrific value...already prime members...easy to set up.  Nice!", "verified": true, "helpfulness": "0/0", "author": "Ken Mazon"}, {"rating": 5.0, "review": "Simply awesome!", "verified": true, "helpfulness": "0/0", "author": "AGomez3"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "janice kermode"}, {"rating": 5.0, "review": "NOTE:  A receiver can be used with the Fire Stick (and Fire TV) in at least 3 different ways, described below.My experience has been great so far, and other reviews summarize that well. I want to add this technical note on using a receiver, and specifically on audio. The Fire Stick can be integrated into your system in at least 3 ways:1) Plug directly into an HDMI input on your AV receiver, if it has HDMI inputs and can send video to your TV. Audio will route as usual through attached speakers. Advantage is leaving music running even when TV is off. .or2) Plug directly into your TV and use the Audio Return Channel (ARC) or regular audio cables to send the audio back to your AV receiver. The advantage of this is you can flip on just the TV to use the Stick, plus it may be more accessible for removal when traveling.3) Plug into your Blu-Ray player if it has HDMI inputs, like the Oppo.In the end, the result is essentially the same function-wise with both methods, presuming both TV & receiver are up to modern standards. I lean towards connecting it to the receiver (or BD) so I can turn the TV off but leave music going.", "verified": true, "helpfulness": "1/1", "author": "D. Hyre \"renaissance man\""}, {"rating": 5.0, "review": "I ordered this during Amazon's pre-order and waited in anticipation for it to arrive. I was not disappointed at all. The interface is easier to navigate than my Roku in my opinion and is also much more visually appealing. If you are looking for a way to stream online media I highly recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Eric W Reeder"}, {"rating": 4.0, "review": "Works as billed. Download the app for your phone to add voice search and the remote functionality. Needs a good operation manual, but pretty intuitive so you can figure it out through trial and error.", "verified": true, "helpfulness": "0/0", "author": "SouthBay Don"}]