[{"rating": 4.0, "review": "Easy to use.,No problems noted.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I am very disappointed...My Amazon Fire TV Stick just stop working and I only had it for few months, but the Roku device I purchased and have been using for almost 2 years continues to work great.  I may have to spend more money again and purchase another Roku device for our other TV to replace the Amazon Fire TV Stick that stopped working.  When the Amazon Fire TV Stick was working, it was great...:(", "verified": true, "helpfulness": "0/0", "author": "Brian K. Evans"}, {"rating": 3.0, "review": "I thought if I purchased prime mailing I would get free movies on Fire Stick - Wrong", "verified": true, "helpfulness": "0/0", "author": "Bonnie L. Brashear"}, {"rating": 4.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Hector Alejandro Prado Gonzalez"}, {"rating": 4.0, "review": "Love it love it love it! Works great, easy to use. The one thing I wish was more intuitive is the up arrow in prime. If I'm reading a description in prime and want to go back to the list of movies I hit up and it takes me back to the home screen. I could also use less categories. How bout just prime TV and prime movies???", "verified": true, "helpfulness": "0/0", "author": "ArthurG"}, {"rating": 4.0, "review": "good product but  the interface is not pretty good . the price is a very big advantage", "verified": true, "helpfulness": "0/0", "author": "ALEJANDRO"}, {"rating": 1.0, "review": "I'm taking this back.  It must be a lemon.  Can't imagine the rest of them out on the market would work (or not work) as this one.  It won't let me go from program to program of my choice.  It just starts playing things that are not even on my list.  It is so frustrating.  I am used to Roku at my other house, and that is easy and works just fine.  It goes to sleep for no reason when I am actively watching, and I can't get it back to where I was  watching.  I am reminding myself of the golfer who gets so frustrated that he throws his whole golf bag and clubs in the pond.", "verified": true, "helpfulness": "0/0", "author": "Janelle Carter"}, {"rating": 3.0, "review": "Satisfied for most part.", "verified": true, "helpfulness": "0/0", "author": "Kila McGhee"}, {"rating": 4.0, "review": "I like it but I didn't realize that in order to get HBO now or Showtime now, you had to have a subscription to your cable company.", "verified": true, "helpfulness": "0/0", "author": "M. D. McGarity"}, {"rating": 5.0, "review": "Great device to view .", "verified": true, "helpfulness": "0/0", "author": "Bruno A. Gallizzi"}]