[{"rating": 5.0, "review": "love it just plug it into a tv and your watching movies.", "verified": true, "helpfulness": "0/0", "author": "avkurt"}, {"rating": 4.0, "review": "NICE", "verified": true, "helpfulness": "0/0", "author": "ALFRED R HOCHMUTH"}, {"rating": 1.0, "review": "I loved the firestick.  Excellent sale price,  extremely fast, and  zero issues casting.  Unfortunately,  I had to get rid of it and got a roku instead.  This thing is a data hog.  250Gb data in a week and a half.", "verified": true, "helpfulness": "2/4", "author": "Bagdy Lovan"}, {"rating": 5.0, "review": "Just the thing I needed to make my Dumb tv much more usable now. I started using Chromcast, but ever since I got the iPhone I needed something that doesn't require a phone to work with and Fire TV definitely helped. Now that the HBO apps in coming, that should complete my apps requirements. I might get the Fire game remote this Christmas to try that out.The only thing I would want more is an iPhone app that can control this thing like Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Karan"}, {"rating": 5.0, "review": "Only had my Fire stick a few days but so far it's great. Had a bit of a sticky time getting it to hook up to my wireless account but followed some advice I found online and unplugged router etc for a few minutes and tried again...voila!  So nice being able to access my Prime movies and TV on something besides the tiny screen of my iPad plus I easily uploaded photos from my phone - coolness!  For the price, it is a good bet. (I had to wait several weeks to receive it which wasn't so great but that is for Amazon's customer service review, not the stick review.)", "verified": true, "helpfulness": "0/0", "author": "Maryn Hallock"}, {"rating": 4.0, "review": "After five hours of use, I like it... but adopting some of the actions used by satellite providers would make it awesome.First - SET-UP was incredibly EASY.  The booklet (5x8 trifold) is clear and concise.  But it really is intuitive.  Plug, plug and plug. That's it.  I had no issue with the Fire Stick power interface complained by several folks.  (It could be the old, \"do you need a 90 degree or 270 degree interface\" issue.)  The power cord drops directly down from the Flash Drive/WiFi. What took longest was looking up and keying in the password for my network.  The system handshake and software/firmware update were very fast.  Appreciated the introductory video, mostly for the explanation of what to expect when the HOME screen appears.Second - TV/Movies. Have done some exploring and watching.  I like the way I can so QUICKLY BROWSE TITLES.  Really like the DELETE OPTION for their recommendations.  Haven't found a \"search\" option yet - no, I'm not going to leave my voice in Amazon's cloud - but I expect to find it soon.  I like the GENRE BREAKDOWN for TV.  The cross-filing of \"Falling Skies\" under Action/Adventure and SciFi/Fantasy is good and demonstrates the thought which went into the menu design.  (A benefit of being part of of Fire TV Mark III.)  The documentary option was an wonderful surprise.  A selection there was my first choice.  Love that CLOSED CAPTIONS are available.  I can keep the volume from screaming and keep up with what's happening.  Like the various options for size and color of font, and background.  Working through the options was a little frustrating, but doable. Just keep hitting right arrow and select.  You'll eventually get what what you want.Third - Music. Again, some exploring and listening.  ACCESS to PERSONAL MUSIC is fast and easy.  Like the option of shuffle play.  Like that the MUSIC IDENTIFIERS -- album title, as well as song and musician info -- are readily apparent.  Don't like the STATIC PICTURE (changes every second or third song) and the permanent imprint of Now Playing; Show Song List; album cover on the screen for the duration of playlist/album is horrible.For software engineers:  please do something similar to satellite companies (or play CDs on a BluRay player) work music and radio channels... show the initial info for about one minute then fade to black. New song - info goes on the screen for about 15 seconds, then fade to black.  If someone wants to recall the info pressing any button should bring the screen back to light.  That will save customers:  -1- viewing singer's open mouth (yes, they're really using that kind of picture.) on the screen for 5-7 minutes,  -2- bandwidth (yeah, some of us don't have unlimited bandwidth), and  -3- prevent / minimize inadvertent burn-in for older TVs and plasmas.  This is especially a concern if the music option is used often.Hope this has been helpful.  Will update as I learn more.  Happy Christmas!  Happy Hanukkah!", "verified": true, "helpfulness": "0/0", "author": "Texas Tess"}, {"rating": 4.0, "review": "Very easy to set up an use and the inclusion of the HDMI extender cable was a life saver as otherwise the fire stick would not have fit with the way my TV's HDMI ports are located.  The remote it very intuitive.  As I got this as the prime early rate of $20 it was kind of a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Ryan D. Surface"}, {"rating": 5.0, "review": "Exactly what I expected. Love it. Ended up buying 2. Its like it turned my tv into a smart tv and love the available apps and such on it. YAY for Amazon for this!!!!", "verified": true, "helpfulness": "0/0", "author": "Brandy Lynn"}, {"rating": 5.0, "review": "So far the Fire Stick is excellent and we really love it.....", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Woolery \"woolybully\""}, {"rating": 5.0, "review": "This is a great item.  Easy hook up, less than 5 minutes.  Received the item in perfect condition and nearly a week before original scheduled  date.  I had to tweek the router a bit to get continuous streaming, however this is not a problem with the fire stick.  This thing blasts through three internal room walls, a large stone fireplace and a connection on the far side of the TV.  About 60 feet if it were a straight line. I may move it to a TV in the family room (Which is even a greater distance and more walls), just to see if it still works as good.  My neighbor has a Google something or other and is going to replace it with a Fire TV Stick.  Amazon Prime is the way to go!  Plenty of movies for the entire family.  Never had a problem with anything ordered from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Lee G. Basnett"}]