[{"rating": 5.0, "review": "WOW.  Works great.  Access all your Prime video.  Very fast, easy to use.  The death of cable.", "verified": true, "helpfulness": "0/0", "author": "Chrisrap \"Readsalot\""}, {"rating": 5.0, "review": "Great addition to TV.", "verified": true, "helpfulness": "0/0", "author": "John C. Mateer III"}, {"rating": 5.0, "review": "As a prime customer I was getting minimal value from the TV benefits. For the small outlay of a fire stick the whole family now enjoy the content from amazon prime. Highly recommended for other prime customers.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "This device more than exceeded my expectations! It basically took my non-smart tv and gives it tons of features like a smart tv. I love It!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 4.0, "review": "I have owned the Chromecast and the Fire TV Stick. The only one I use now is the Fire TV because of a couple of reasons. First of all, it has its own remote which is more convenient than having to use a smart phone. Second, it has a nice user display on the screen which lets use make choices rather than having to find out which apps will cast to the TV. The only reason I didn't give it 5 stars is because I would like to see more free shows through Amazon Prime TV instead of having to choose Hulu or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jerome Z."}, {"rating": 5.0, "review": "My Husband and I love this! I would highly recommend this to someone who doesn't watch a lot of TV but would still like access to certain shows.  Although most shows require you to be a prime member, I would say it is worth the investment.  $100 a year for prime membership is a lot better than a month payment to another TV provider.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 3.0, "review": "Freezes a lot on Hulu and YouTube. Other than that I love it!", "verified": true, "helpfulness": "0/0", "author": "Carrie S."}, {"rating": 5.0, "review": "Perfect for turning your hdmi TV into a smart tv. Great video options and apps.", "verified": true, "helpfulness": "0/0", "author": "amazonlover"}, {"rating": 5.0, "review": "I love it! Works fantastic.  Easy install.", "verified": true, "helpfulness": "0/0", "author": "S Sandstrom"}, {"rating": 5.0, "review": "The more I use it, the more I love it.  All the apps that are available on it really surprised me.", "verified": true, "helpfulness": "0/0", "author": "Michelle Tilton"}]