[{"rating": 4.0, "review": "I knew this was going to be a great product (having seen it online) but when I opened and plugged it in, it didn't even work. I contacted Amazon for a refund and the costumer service was great. I'm putting 4 stars because this is a great product, my unit was defective.", "verified": true, "helpfulness": "0/0", "author": "Yash"}, {"rating": 5.0, "review": "like it a lot", "verified": true, "helpfulness": "0/0", "author": "Wally Courie \"peace lover\""}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not a bad product i thought i could just plug and watch never realised i had to sighn up for prime, Netflix, hulu plus and so on thats the only disappointment", "verified": true, "helpfulness": "0/0", "author": "cleave paul"}, {"rating": 3.0, "review": "Some of the apps don't open and unless you have prime it's really not worth it for me. No YouTube and the music on vevo takes forever to load if it even loads. Prime offers the exact same viewing options as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Lisa Sullivan \"read and watch\""}, {"rating": 1.0, "review": "This is a terrible product. It constantly disconnects from my home wifi network causing disruptions in my viewing experience. My google chromecast never disconnects and works so much better. I was so excited to use this product, but I would discourage others from buying it until they correct its issues dropping its network connection. Google amazon fire tv stick drops wifi connection and take a look at everyone having the same issues. Don't buy this product until Amazon can figure out a solution to this.", "verified": true, "helpfulness": "1/1", "author": "Nicholas Cosmas"}, {"rating": 5.0, "review": "Didn't disappoint.", "verified": true, "helpfulness": "0/0", "author": "Lenny Spano"}, {"rating": 2.0, "review": "The stick is kind of awful. For not obvious reasons:1) I bought this for my girlfriend. Her TV does 1080i and not 1080p. The stick plugs in and works on 1080i on the first configuration, up to the point where it asks about wifi. Once configured it switches to 1080p and then the stick is a useless dongle for her.2) If you talk to people in support, they don't even have access to a fire stick. So they can't help troubleshoot this. Some didn't even know what a firestick is.I'm considering this a return, but wanted people to know in case they have a 1080i tv", "verified": true, "helpfulness": "0/0", "author": "Christopher Forsythe"}, {"rating": 5.0, "review": "Thank you.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very good product and I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Tason"}]