[{"rating": 2.0, "review": "They should also picture it with the cord attached.  You need to plug in your stick to an electrical outlet in addition to plugging it in to the TV HDMI port.  I don't want any more wires/cables to plug in.  Also this does little more than stream services that you must pay for such as netflix, hulu and prime.  Ok fine. If you want to use anything else, ESPN, CBS etc, you must be a paying cable subscriber and jump through a bunch of hoops.  I have a Roku hooked up to another TV in the house.  It does EVERYTHING this Firestick does AND it offers many free \"apps/channels\"  that I don't have to pay for such as EWTN (catholic cable channel), Crackle, other obscure specialty channels, along with streaming of day-old shows from FoxNews (multiple clips from shows like O'Reilly which essentially add up to his whole show minus commercials) and other cable channels (without having to pay for cable).", "verified": true, "helpfulness": "1/2", "author": "SAM \"SAM\""}, {"rating": 5.0, "review": "Best thing i ever did works  Great just a couple small issues on downloading once in awhile but no big issue and it works fabulous recommend it to everyone what a fabulous unit.down loading could. Be my phone again works like a charm a winner I'm very critical on electronic devices this is great.also the remote works great happy  Couldn't ask for a better remote very easy to control .dumby like me can use with easy", "verified": true, "helpfulness": "0/0", "author": "ben garcia"}, {"rating": 5.0, "review": "I love it.  It is really easy to set up and use.  The problem is I am now binge watching \" Deadwood\" with others to follow.", "verified": true, "helpfulness": "0/0", "author": "Edward M. Hommel"}, {"rating": 3.0, "review": "I preordered the Fire TV Stick at a deep discount ($20.71) October 27, 2014 and it arrived ahead of schedule in the first week of December. I was impressed that the stick came with everything in the box -- when I bought the Roku Streaming Stick, I had to by the HDMI extender cable separately. Once I completed the easy installation, I was also impressed by how snappy the user experience is. But The Fire TV Stick doesn't stand up to the Roku for my family.First, the bugs. More than once it wouldn't connect at all for some time. We've also been logged out of the Netflix app a couple of times.Where it really falls short though is Netflix and other streaming services are second class citizens. When you search for movies, it's only Amazon's service. As a family that started with an Apple TV back in the day and have tried and used many services, and still use a couple, this is a deal breaker.Our young kids found it particularly the multiple steps to go back and forth between Amazon and Netflix. Also, the remote looks slick, but without the buttons for the popular services it is not as kid friendly. Also, the small, slick remote has meant it went missing more frequently than other remotes.I'm returning the Fire TV Stick today. I look forward to checking out Amazon's next versions.", "verified": true, "helpfulness": "1/1", "author": "Lloyd Dewolf"}, {"rating": 4.0, "review": "this works great on the non smart TV, as it simply plugs into the HDMi port and streams thru the internet. I especially love that it came preconfigured for my Prime membership. The only downside (hence the removal of one star) is that it needs to be plugged into a power outlet as well. This wasn't clear in the product description, and really isn't shown in the pictures of the product.", "verified": true, "helpfulness": "1/1", "author": "Al"}, {"rating": 5.0, "review": "I had ordered this as a surprise for my family but my husband opened the package first since he thought it was his Amazon order instead of reading the shipping label! So I went ahead and set it up earlier than planned but it was easier that I thought it would be. We all really enjoy this! There is so much variety to choose from that everyone can find something they want to watch. In fact we almost have to schedule times to use the Fire TV stick so that if someone really want to just want a regular TV channel, they can do that too! It has really been great.", "verified": true, "helpfulness": "0/0", "author": "M. Fager"}, {"rating": 1.0, "review": "i was very excited to have bought something I can finally use for Netflix when my other family members had netgear devices. I was disappointed to find out how slow the stick is with all apps mostly including Netflix. Hopeful for an update", "verified": true, "helpfulness": "1/4", "author": "Matt S."}, {"rating": 4.0, "review": "It works!  The Amazon Prime Videos app works as well as the Amazon App on my Roku.  This is a WiFi only device, I have good WiFi at home and it works without any glitches.  I can't say how well it will work in a hotel room w/crappy WiFi.  But, I'm anxious to try it on my next trip.  My nephew says he likes it way better than his Chrome stick.If it works as well in hotels, I'll bump this to 5-starsIf you don't have Amazon Prime, I'm not sure I'd recommend this, but for the price, it's still a bargain.  Depends on how you plan on using.  You get what you pay for, The Roku & ATV are more full featured, more apps, ethernet; but, there're also more for an entertainment center setup.  The Fire Stick is pocketable for travel, use in many places.", "verified": true, "helpfulness": "0/0", "author": "Gadget Freak"}, {"rating": 3.0, "review": "It's a bit misleading because the unit has to be plugged into an outlet at all times when in use.  Other than that, no complaints.", "verified": true, "helpfulness": "1/1", "author": "Sabrina B"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Liz L"}]