[{"rating": 4.0, "review": "Work fine. I had to buy a WiFi extender so it would keep dropping the signal", "verified": true, "helpfulness": "0/0", "author": "James Pettijohn"}, {"rating": 5.0, "review": "Like a lot of other reviews I totally agree that it is a must have, especially for Prime members. The access to your music and cloud drive photos Is awesome! Netflix works perfect, Prime Video perfect as well. It's nice and small and can make any HD into a smart TV. I was using the X Box to watch Prime Videos and Netflix but now use this device. Setup is very simple, great instructions play on your TV as soon as it's turned on the first time.I am going to buy another one after Christmas for other TV.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 4.0, "review": "I only gave it a 4 star because I'm not sure about what's happening. but about every 6-7 days I have to unplug it and let it cool because it will freeze up and I don't know if it is suppose to do that or not. I don't know who to call or contact. I've only had it a couple of weeks.", "verified": true, "helpfulness": "0/0", "author": "chucktur"}, {"rating": 5.0, "review": "While looking for a better alternative to watching NF on the Wee, and YT on my aging smart TV, I came across Amazon's Fire TV Stick. We have a fair amount of content with Amazon, and a Prime membership, so it was a no-brainer. I'm thinking this could be the device that unifies the streaming on our main  TV to be easier for my spouse.It was also a no-brainer to set up: plug it into the TV, plug in power(my TV didn't have enough power from either the HDMI port, nor from the USB port, which the Fire TV Stick detected and recommended the adapter). The TV recognized it immediately. After putting in my WiFi password, everything was up and running--including a decent video tutorial that kept us entertained during breakfast. BTW, that's how long it took to set up: long enough to drink my coffee and eat my oatmeal before before the work commute.I'm looking forward to checking out the apps and the content, which is much easer to view and access than through the smart TV.", "verified": true, "helpfulness": "0/0", "author": "SciFiFreak"}, {"rating": 4.0, "review": "My main irk with the Fire TV Stick was the buffering -- at first. I was about to send it back but I'm pretty sure I fixed that issue. This was purchased to get the kids' Xbox and PS4 out of the living room and finally not have to rely on those devices to stream from the Internet. So, all went swimmingly with installation and wifi connecting. I settled in to give it a go and watch a show and it started, then buffer.... played... buffered... played... buffered, and so on. A message came up about the wifi not being strong enough (or something like that). Oh this can't be happening.So, I did what I do if ever any video on Youtube or any other website stalls and buffers -- I pushed the back/rewind button to let it go back and re-play something I've already seen to give it time to get the rest of the video queued up. And lo and behold, everything after that played just fine. No more buffering. I watched several shows without incident. I'm giving one less star due to the hassle, but am very happy with Amazon's new Fire TV Stick. For now. I hope this helps others having the same issue.", "verified": true, "helpfulness": "0/0", "author": "Andrea Cruz"}, {"rating": 5.0, "review": "Love It.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "iMA"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "VC"}, {"rating": 5.0, "review": "So easy to plug in and start using!  We have netflix and amazon prime and had just gotten rid of several cable channels and a few set top boxes so we were thinking of ways to have just as many programming choices and watch on more then one TV.  This is an affordable solution and the amazon prime app on this fire stick is much more user friendly and easier to navigate then the app on our Sony Google TV.  You can also stream prime music through this app on any TV.", "verified": true, "helpfulness": "0/0", "author": "Oldita Doherty \"Dita\""}, {"rating": 2.0, "review": "So far... not impressed.What the product description does not tell you is that only SOME TV providers allow the Showtime app to work. I have DirecTV and the Showtime app works on all of my mobile and streaming devises... except the Fire Stick. For some reason, DirecTV does not support Showtime on the Fire Stick. Nowhere in the product description does it list the approved TV providers so I would have no idea that this limitation existed.Sure, Netflix and Prime streaming works, but did I need a new devise to do what my PS3 and PS4 can do... nope!I got this devise so that I could use it with all of my subscriptions and take it on the road with me.... guess what, can't do that either. If you plan to use this devise in a setting like a hotel room with a web protected WiFi, DON'T GET THIS. You cannot use this devise with web protected WiFi. I just paid for something that 3 other devises in my house can do... not to mention my Ipad and Iphone as well.One last disappointment is that I cannot use my TV's on-board USB for power to this devise... It says it is not a supported power supply and it makes you plug it in to an outlet which I find to be unattractive and unnecessary.I normally love Amazon and everything they touch... this however is a huge disappointment, and if I had not received the Prime price of $19.99 I would be returning this... but for $20 I guess I can keep it.The only reason I am giving it a 2-Star and not 1-Star is because Netflix worked really well and the HD video quality was good.", "verified": true, "helpfulness": "0/1", "author": "David Orsi"}, {"rating": 5.0, "review": "AMAZING! IT REALLY WORKS AS EXPECTED.- I TESTED IN \"LATIN AMERICA\", AND IT WORKS! AS EXPECTED, AMAZON VIDEOS DOES NOT WORK.- AIRPLAY = YES!  I DOWNLOADED  \"AirPlay&UPnP;\" FOR THAT PURPOSE.- EASY TO USE, NICE INTERFACE.", "verified": true, "helpfulness": "0/0", "author": "Alvaro Munoz \"MUAR\""}]