[{"rating": 5.0, "review": "Fast and easy to use interface! I am in love with it!", "verified": true, "helpfulness": "0/0", "author": "Maria17fernanda"}, {"rating": 4.0, "review": "so far so Good", "verified": false, "helpfulness": "0/0", "author": "Diane Feather"}, {"rating": 5.0, "review": "I love it!!! It may just be the best purchase it have ever done besides my home.", "verified": true, "helpfulness": "0/0", "author": "sue Piper"}, {"rating": 5.0, "review": "The one thing they don't tell you is that it includes a power cord.  So it's not just the stick you plug in, there's also a power cord.  Works great!  Have been impressed with it so far.  Was running out of the box with no headaches.", "verified": true, "helpfulness": "1/1", "author": "ketracel \"authorneedscash\""}, {"rating": 1.0, "review": "I was so excited when the fire stick came a month early! Having said that it has failed to work at my house or my mom's house. The connection keeps dropping or the screen flickers to black and then back on. We both have strong internet, and I have it plugged into the power per the recommendation of the directions. I think it has to go back, which is disappointing.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Was easier to configure for amazon prime, but netflix was difficult. I am not using it. I will have to take more time to try to make it work.", "verified": true, "helpfulness": "0/0", "author": "Paul L. Rische"}, {"rating": 5.0, "review": "is ok", "verified": true, "helpfulness": "0/0", "author": "jesus maldonado"}, {"rating": 5.0, "review": "Great layout on screen. Very user friendly. Remote is excellent.", "verified": true, "helpfulness": "0/0", "author": "Chesterfield"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Wanda Cameron"}, {"rating": 4.0, "review": "For speed this is great - best streaming stick hardware out there.  I got this for $20 from a pre-launch promotion - didn't really need it but for $20 I was curious.The feel of the equipment is the best of the three dedicated streamers I have tried and actively used - Roku, Apple and now this.I have installed this on a basement HD projector, and it works great.  I like the Roku stick ( I prefer the seasonal aesthetics of Roku), but this is a faster piece of hardware, leading to a smoother browsing experience.The controller has a much better feel than the Apple controller (I've had 3 Apple controllers die on me over 3 years - like a lot of Apple stuff, pretty but not really built to last).  This will also run PLEX, which is a big deal for those with their own movie and video files on a home computer or server, which Roku also does, but Apple does not.", "verified": true, "helpfulness": "0/0", "author": "James T. Barringer \"Just the facts, Ma'm\""}]