[{"rating": 5.0, "review": "Thank you Amazon!  After struggling with mlb.tv on other platforms, the Fire TV Stick handles the app with smooth playback and no \"loading\" issues.  Easy set up and great responsive interface.", "verified": true, "helpfulness": "0/0", "author": "Don O"}, {"rating": 5.0, "review": "Not sure how we ever lived without this. Not as many free current movies as I had hoped......", "verified": true, "helpfulness": "0/0", "author": "JG \"Mom of Boys\""}, {"rating": 5.0, "review": "I bought this as portable alternative to my Apple TV. I'm fairly impressed. It's not as robust as Apple TV, but it shows prime instant video in addition to Netflix. Setup was easy enough and it connected to the finicky wifi at work without a problem!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "Great product if you want to stop using gaming systems as a streaming system. The software responds fast, however it does have an issue every now and then where it can jump around the menu without you pushing a button, however that is rare. I like that you can tap into other networks apps to stream their content. Otherwise a solid product. I took a star away because i feel the firmware needs some bug fixes.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey \"Steel Toast\""}, {"rating": 4.0, "review": "Good tool for accessing free or cheap content online.", "verified": true, "helpfulness": "0/0", "author": "Jon D. Dautel"}, {"rating": 5.0, "review": "Excellent Product I have been able to enjoy Amazon Instant Video, Netflix , ESPN, at HD quality.The device is fast.The device is easy to use.The device is easy to carry ( if you travel a lot)The device has a large collection of apps by the amazon market place or by sideloading apps.The device is simply amazing and at $39 you can't get any better. FACT !", "verified": true, "helpfulness": "0/0", "author": "Alexis Enriquez"}, {"rating": 5.0, "review": "As easy as can be to set up.1. Plug it into an empty HDMI slot on your TV.2. Plug in the included AC adapter and power it up.3. Add the two AAA batteries (included) to the remote, and start watching.If you are a Prime member, there are hundreds of choices of free movies and TV shows to watch.", "verified": true, "helpfulness": "0/0", "author": "Zorgdoff Parent"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jeff Pfeifer"}, {"rating": 5.0, "review": "AWESOME PRODUCT!!!", "verified": true, "helpfulness": "0/0", "author": "Rina"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "guillermo"}]