[{"rating": 5.0, "review": "Better than Netflix", "verified": true, "helpfulness": "0/0", "author": "Gretchen H. Sockwell"}, {"rating": 5.0, "review": "I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Do you charge on delivery ?", "verified": false, "helpfulness": "0/0", "author": "dey"}, {"rating": 5.0, "review": "I really love the fire stick. I am 64 and I pretty much got this up and running without a problem. The remote works very easily also. This has opened up a ton of tv watching options. As long as you have Wi-Fi and an HDMI port in your tv, you can binge watch your life away.", "verified": true, "helpfulness": "0/0", "author": "Gail Ann smith"}, {"rating": 4.0, "review": "Works ok not sure why I have to always unplug it n order for it to work and not freeze constantly. And it had nothing to do with my connection, already tried that.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 2.0, "review": "When it works, it works great. Most of the time, however, it says it's unavailable- however our devices are still able to play netflix, which tells me it's the Fire TV stick and not my internet connection. I've looked for support on the Amazon site but have been unable to find it. Not user friendly.", "verified": true, "helpfulness": "0/0", "author": "majobasm"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "LINDSAY N DOTSON"}, {"rating": 5.0, "review": "works really well,easy to control I' very happy with the 2  that i bought", "verified": true, "helpfulness": "0/0", "author": "William E."}, {"rating": 4.0, "review": "Using to get PLEX shows and Amazon Prime Content to my kids room. Works great for that purpose. It's not as zippy or fast loading as my Roku 3, but it seems to play everything fine.", "verified": true, "helpfulness": "0/0", "author": "Kyle Newlin"}, {"rating": 3.0, "review": "It is not too bad, very flimsy remote, will break or come apart very easily with the slightest bump. It did not fit directly in any of my TV hdmi, had to use the extension. Well I knew the features and app it had upfront prior to purchase so can't complaint. But of course I wish it had online web search, YouTube etc.", "verified": true, "helpfulness": "0/0", "author": "I TELL U THE TRUTH"}]