[{"rating": 2.0, "review": "I'm a little disappointed with the FireStick.  It would be better if there was an internet app, access to Hulu (not just Hulu plus), HBOGO, and Showtime videos.  I already pay for cable (HBO, Showtime) and Netflix.  It would be nice if I didn't have to pay for it all again to watch on the FireStick.", "verified": true, "helpfulness": "0/0", "author": "Brendan"}, {"rating": 5.0, "review": "After a small issue with our Prime account when we log the FireStick in. Customer service fitted the issue and the Fire Stick has been great. With a little more practice and getting formiliar with all the setting it will get even better.", "verified": true, "helpfulness": "0/0", "author": "Harry G. Wood"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "mickey daniels"}, {"rating": 5.0, "review": "Outstanding product. Works as advertised. Makes Prime even a better value.", "verified": true, "helpfulness": "0/0", "author": "Dan Erlin"}, {"rating": 5.0, "review": "Much more user friendly than the Google Chrome Cast", "verified": true, "helpfulness": "0/0", "author": "Darryl Cowan"}, {"rating": 4.0, "review": "Great buy. I love it.", "verified": true, "helpfulness": "0/0", "author": "melody brown"}, {"rating": 4.0, "review": "Easy to install.  Connected to my wireless within minutes and we began streaming.  Looking forward to expanding the capabilities.Uploaded 185 photos of a vacation into Amozon Cloud and played them on the TV with no trouble.", "verified": true, "helpfulness": "0/0", "author": "James J. Dasey"}, {"rating": 1.0, "review": "Didn't meet my expectations. Poor quality. The control not working properly. Freezes. Can't mirror from any apple device. But you can with fire Tv. Don't know why this is not possible. Any other stick works with iPhone or iPad.", "verified": true, "helpfulness": "0/0", "author": "Besnik"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "jjduece"}, {"rating": 3.0, "review": "GoodMenu could have been made more clean and fluidRemote hard to handle in working mans type hand", "verified": true, "helpfulness": "0/0", "author": "Chris Brooks"}]