[{"rating": 4.0, "review": "It's perfect for home use but I actually bought this for mom who is in a long term care hospital. It didn't work there because to use the wifi you have to first agree to their terms therefore the firestick had would not/could not connect.", "verified": true, "helpfulness": "0/0", "author": "Bookworm"}, {"rating": 3.0, "review": "Great little device, but I have to pull the power cord out of the surge protector every so often (i.e. every other day).  The unit locks up and becomes unresponsive, so a power cycle is the only way to get it back up and running again.  Otherwise, this little device is awesome and I can't wait to cut the cord (or satellite) with DirecTV and use more features.  Maybe an update will come out that will fix this issue.", "verified": true, "helpfulness": "0/0", "author": "Paul (Rochester, NY)"}, {"rating": 5.0, "review": "Loooove it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "april edwards"}, {"rating": 3.0, "review": "Like it better than the others I've tried", "verified": true, "helpfulness": "0/0", "author": "CASSANDRA M CRYSTAL"}, {"rating": 5.0, "review": "I was able to set it up pretty easily. At first I could see it as one of the sources but it wouldn't connect. I found the support site for devices on  Amazon and they showed how to 'restart', which is basically disconnecting for 30 seconds. After that it worked like a charm. So....I am Very Happy and sort of proud of myself to. Now, next step, I may want to get the sort of remote that I can listen to with earphones instead of having the sound on the TV.All Good.", "verified": true, "helpfulness": "0/0", "author": "I. Fagin \"Lewyland\""}, {"rating": 4.0, "review": "It is everything I expected", "verified": true, "helpfulness": "0/0", "author": "robin behm"}, {"rating": 5.0, "review": "Love it, love it!!", "verified": true, "helpfulness": "0/0", "author": "Catherine Sheridan"}, {"rating": 5.0, "review": "So easy to use and set up. Very pleased with the huge selection of entertainment.", "verified": true, "helpfulness": "0/0", "author": "kk \"karen kinlock\""}, {"rating": 2.0, "review": "I am outside the US.  Excellent for Netflix, but that is about it!I wish Amazon Prime and other apps would also work in other countries, after all we are living in a Globalized world now!", "verified": true, "helpfulness": "0/0", "author": "MFH"}, {"rating": 4.0, "review": "Very easy to install.  The welcome video is great!  I'm impressed with the selection available with Prime membership.  The connection cut out fairly often, but no more often than standard internet connection.", "verified": true, "helpfulness": "0/0", "author": "twinzmom"}]