[{"rating": 5.0, "review": "Love Love Love this stick.  Bought it to use on an old plasma tv to get Netflix.  Works flawlessly.  Very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Joe Johnsky"}, {"rating": 5.0, "review": "So easy to use.  This is really what you expect from Plug and play.  The only drawback is that now we also subscribed to Netflix so it is costing me.  All kidding aside this is a great product.", "verified": true, "helpfulness": "0/0", "author": "alyn"}, {"rating": 5.0, "review": "Still waiting to receive \"The Best of Chris Farley\"So I can't review it.", "verified": true, "helpfulness": "0/0", "author": "pat stinton"}, {"rating": 5.0, "review": "Love the fact that this has FoxSportsGo! So excited for my new Amazon Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Erica C."}, {"rating": 3.0, "review": "I have a Smart TV but the Fire Stick was a gift prior to my tv purchase. If I had a regular tv this would be okay. IMO it's nothing to write home about. I like that I can store my photos on there but that's really all it does for me. The whole point of getting it was bc I was moving into a new apt and not going to have cable. The only problem there is that in order for half the apps to work you need to subscribe to a cable provider. If I had a cable provider why the heck would I be purchasing this dumb stick?", "verified": true, "helpfulness": "0/0", "author": "Rylies_mommy"}, {"rating": 2.0, "review": "Great picture, but no sound. Their tech staff tried to help, but nothing worked.  Still no sound.", "verified": true, "helpfulness": "0/0", "author": "pauline frederick"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Willie Cochran Jr. \"willsman\""}, {"rating": 4.0, "review": "Overall, better than the Chromecast I own.  Loads apps fast, the remote is simple but well thought out and easy to setup than the Chromcast.  The Chromecast is better at casting your phone, tablet or computer's screen to the device than the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Burton Busse"}, {"rating": 4.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Marc Qualich"}, {"rating": 1.0, "review": "I have a Fire TV box and bought this Fire Stick because the Fire TV is not available any more.......This product is not even near the performance as the Fire TV box......I know the ram memory and the processor is not the same, but I bought it keeping the hope of having a decent performance.......But I'm totally disappointed..... The quality of videos on Netflix constantly change....I Thought could be for the wireless signal, but the Stick is in the same room that the wireless router is. I used my tablets (Samsung and IPad) to test my wireless signal and they won't chance quality of videos..........The Bluetooth remote I bough with it won't work at all, 'cause it starts working but every few seconds it stops working and then stars again. To be sure about the remote I tested it with the Fire TV box and It's working good so far..............So, Fire Stick has some issues and I can't recommend it....For me it's a totally waste of time......It do not appear to be an Amazon product", "verified": true, "helpfulness": "1/1", "author": "TNTFM"}]