[{"rating": 5.0, "review": "Awsome device we Love our amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "gerald alexander"}, {"rating": 5.0, "review": "Works great so far ... the videos that I have watched so far have played very smoothly ... as with Netflix, the available movies to stream could be greater ...", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 4.0, "review": "Big fan of Fire TV and the Stick but in my opinion you're gonna want the voice activated remote for the Stick as well  ...", "verified": true, "helpfulness": "0/0", "author": "michael cinquegrana"}, {"rating": 5.0, "review": "I purchased for my daughter, she loves it. Says she literally plug it in, turned it on and was watching Netflix in minutes!Was on back order but worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Lola G \"avid reader\""}, {"rating": 5.0, "review": "Excellent product, I have ordered a second one.", "verified": true, "helpfulness": "0/0", "author": "Doris Jones"}, {"rating": 4.0, "review": "Works good.Wish there were more pre teen shows for my son. It would be nice to be able to let the kids only select free shows and movies. Overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Momof3"}, {"rating": 5.0, "review": "We are very pleased with the Fire Stick.  Does all we wanted it for and am learning more what it can do all the time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Dont like the fact that it has to be plugged into an electrical outlet.", "verified": true, "helpfulness": "0/1", "author": "gregory morris"}, {"rating": 5.0, "review": "love the product and the capabilities it has", "verified": true, "helpfulness": "0/0", "author": "JP Collins"}, {"rating": 4.0, "review": "This is great!! Very easy to set up and navigate through. Bought this to use on the road in hotels and unless it's an open wifi meaning no login screen is needed, you can't use this without a travel router. I heard a browser of some sort will come in an update so it can be used in hotels with login screens for Internet.", "verified": true, "helpfulness": "0/0", "author": "John D Niewoit Jr"}]