[{"rating": 4.0, "review": "Week 1-2 was great.. then from then on.. there's been a lot of buffering issues and pausing. Sort of annoying.. Is there a way to clear cache or reset? Maybe that'll spring this device back to speeds.. for now my Roku has never had issues... and I prefer it due to lack of buffering and quicker response.", "verified": true, "helpfulness": "0/0", "author": "Roch Rx7"}, {"rating": 5.0, "review": "Love being able to watch on the go! I take this everywhere with me now. The only thing I thought was odd was that you don't need to turn this off; it just remains on as long as its plugged in. Just enough storage for my needs. Very pleased with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Alexandrawrrrr"}, {"rating": 3.0, "review": "I thought this was something different.  I don't need it because I have a smart TV with Amazon already.  This is in a drawer somewhere.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 2.0, "review": "Most of the good novies and shows cost money. If you have xfinity on demand and HBO you really don't need the fire stick. Personally I do not thibk it's that wonderful.", "verified": true, "helpfulness": "0/0", "author": "ssysyyhsh"}, {"rating": 3.0, "review": "Amazon sent me a Fire TV Stick with default German language.  Took me about an hour to figure out setup and discuss issue with customer service.  The customer service was good.  However, Amazon should know its American consumer base better and not ship German language default products.  It can't be that hard to figure out based on address.", "verified": true, "helpfulness": "0/0", "author": "joshua berger"}, {"rating": 5.0, "review": "Good...", "verified": true, "helpfulness": "0/0", "author": "Kareem D. Hendeson"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "alice turner"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "A.T."}, {"rating": 1.0, "review": "Never been able to get this to work.  Spent a lot of time on the phone with support and still could not get it working.  I finally just gave up.", "verified": true, "helpfulness": "0/0", "author": "jdunaway"}, {"rating": 1.0, "review": "Why don't you have cbs all access on stick", "verified": true, "helpfulness": "0/0", "author": "laurie hunt"}]