[{"rating": 5.0, "review": "Good product would be better if you did not have to have tv service already established to get certain stations and programs.", "verified": true, "helpfulness": "0/0", "author": "lawrence vodek"}, {"rating": 5.0, "review": "Bought this for my wife. She dearly loves it!  Lot's of variety, and installed in only 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Tom Tate"}, {"rating": 1.0, "review": "It wasn't jail broken I have to pay for all my movies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "We purchased the Amazon Fire Stick when our XBox stopped working in order to stream netflix and hulu through our tv. We have never had a problem with our internet connection being able to play anything from Hulu or netflix either through the xbox or on our computers or phones. After trying to connect via the fire stick for the past couple of weeks, we can't even watch a complete show on netflix without it buffering halfway through. That is when it even connects to the internet to begin with.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 5.0, "review": "Seems to work as it should. I really only watch the history channel, so I am not a very good one to ask for a review.  I would saythat if Amazon markets it, they have made sure it it well worth what they charge....as with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 5.0, "review": "I love this!", "verified": true, "helpfulness": "0/0", "author": "Jacquelyn Delaney"}, {"rating": 5.0, "review": "great for amazon tv.  I wish I had more time to sit down and see a few things.Saw the entire Transparent with this devise.  Fabulous", "verified": true, "helpfulness": "0/0", "author": "The Goose is OUT \"Shug\""}, {"rating": 5.0, "review": "Good!!", "verified": true, "helpfulness": "0/0", "author": "Edison"}, {"rating": 5.0, "review": "Outstanding", "verified": true, "helpfulness": "0/0", "author": "ADA"}]