[{"rating": 2.0, "review": "When the Fire TV Stick was announced I knew immediately I would be getting a couple.Let's be honest here: you're probably comparing the Fire TV Stick to the Chromecast. I LOVE the Chromecast. It lets you control your TV content using the strengths of your phone/tablet. It gives you control of a second screen on a per app basis. You get the content and experience from your favorite compatible app. This is the first thing the Fire TV Stick fails at... the just got it wrong from day 1. Let me explain:I thought the Fire TV stick would be great, but unfortunately it's just isn't. It feels old when you first plug it in. The navigation sucks. I totally understand the point for Amazon is to get paid content in front of their users, but this is just a bunch of ads you scroll through. It's not smart recommendations. It's not based on your history. It's not based on your taste. It's just whatever junk some movie studio is paying Amazon to shovel in front of users. As a user you have to wade through all the stuff you have no interest in to get to the few things you are. Apps, like Netflix, are relegated to a separate space, while deep content links for Amazon show up on the home screen. It's just too obvious and doesn't work right. The experience is just awful.To add insult to injury the thing doesn't even work very well. Amazon touts the Fire TV Stick as having better hardware by far than any competitor device. It's amazing that the competition seems to outperform this in every way. It feels slow. There's lag between button presses on the remote and what you see on your screen. There's playback issues with content. Constant blips and stutters. More buffering than other devices. It's quite honestly amazing that Amazon has gotten such bad performance with such high hardware specs. It's a testament to the software running the Fire TV Stick: it's bad. In all honesty it'll probably get better with time and updates, at least I hope it does.Hardware wise the stick itself is just fine. It plugs in your TV's HDMI port and gets power via a micro USB power adapter. No surprised there. The remote though sucks. The directional wheel has horrible tactile feel. The \"enter\" button (center of the wheel) feels like it'll break from day 1. I don't have high hopes for it lasting very long. At least there's a smartphone app once it breaks... but wait: it's an awful app. Slow doesn't begin to describe it. Not to mention it's just remote buttons on a non-tactile surface. It's simply everything you wouldn't want.I'm a fairly die-hard Amazon fan. I was excited I'd finally have a device that could be simple and do Netflix AND Amazon Instant Video, but this device misses the mark. I find myself still wanting Amazon to simply release a Chromecast compatible Android app for Instant Video. I'll be sticking with the Chromecast and checking back in when there's a major software overhaul.I'm glad I got in on the promotional $20 price, because I wouldn't pay the regular price for this thing I don't recommend anyone else does.", "verified": true, "helpfulness": "7/9", "author": "Jeff"}, {"rating": 2.0, "review": "Extremely disappointed. I waited for this thing for weeks, pre-ordered during the $19, Prime 2-day sale.... however, right out of the box I couldn't connect it to one of my wifi bands (2.4Ghz). No biggie, kicked over to the 5Ghz band. Unfortunately, it doesn't stay connected to the wifi router. Line of sight, 15-18ft away.The unit also suffers from frequent drop outs and freezing. When selecting the hdmi input on the tv (from any other input) it does not load, forcing me to cycle usb power. Every time. I could keep gripping about it, but I think it's enough to say that I returned it.", "verified": true, "helpfulness": "2/2", "author": "Jason Craft \"gear junkie\""}, {"rating": 5.0, "review": "This is a great buy.  I owned 2 chromecasts and loved it until Amazon released this stick. The selling point is the remote. Yes I can use my iPhone with the chromecast but an actual remote is awesome in its own right. Now the only thing I want from Amazon is HBOGo app. I ordered two and bought another five from best buy for family and friends and they all live this gadget. Definitely recommend for everybody b", "verified": true, "helpfulness": "0/1", "author": "Mr. Gill"}, {"rating": 5.0, "review": "Setup was super easy, connected to my wireless network in another room without a hitch!  Response time is very fast between remote and the Fire TV Stick.  I'm loving it!!", "verified": true, "helpfulness": "0/1", "author": "J & J"}, {"rating": 4.0, "review": "Had some issues with fuzzy/flickering screens out of the box. It quickly updated itself and have had no picture issues since then. Is a little bit of a pain as it does need AC power, but at least the cord is included. Some have described it plugging it into TV USB for power, but have not had the opportunity to test that yet. Also comes with an extension for the HDMI as it is a little bulky and can be an issue depending on how your HDMI ports are arranged. Apps are somewhat limited for now, but the common ones are covered. Wifi seems to have decent range with only occasional skipping while streaming. Not sure if that is because of the connection or software. Remote is functional and can use the phone app if you want the voice command functionality.", "verified": true, "helpfulness": "0/1", "author": "drsn97um"}, {"rating": 3.0, "review": "I like it, just a bit pricey though for a subscription....", "verified": true, "helpfulness": "0/1", "author": "BEVERLY CRAWFORD"}, {"rating": 5.0, "review": "Amazing little device that is easy to operate.", "verified": true, "helpfulness": "0/1", "author": "Donald Kollmorgen"}, {"rating": 5.0, "review": "Really enjoying the fire stick especially being able to choose a movie or show on my Kindle fire and send it to my TV to watch.", "verified": true, "helpfulness": "0/1", "author": "I. Robin"}, {"rating": 2.0, "review": "The unit can't connect to wifi on dlink dir 655. The network is recognized, but connection is never successful. The support is not organized to help with this kind of problem.The power connectors are a little sloppy.At first I thought it was DOA, but the usb power supply was not fully inserted.Two stars for the box!", "verified": true, "helpfulness": "1/1", "author": "John West"}, {"rating": 1.0, "review": "Great device, but useless on road. Most hotels require login through pop up page. No way to connect device. Going back. Sending both devices back. Sticking to Chromecast.", "verified": true, "helpfulness": "1/1", "author": "genaro rocha"}]