[{"rating": 1.0, "review": "We own a roku 3 and this device.  Needless to say my grandson does not understand why it freezes all the time.  Would tell everyone to pay the 4x the price for a roku 3.  Try again Amazon", "verified": true, "helpfulness": "1/3", "author": "Mary Lou Schak"}, {"rating": 1.0, "review": "The Roku is a much better value. Stations and programs that are free on Roku will cost you on the Amazon Fire TV Stick. Very disappointing because I am such a loyal Amazon person", "verified": true, "helpfulness": "1/3", "author": "Kelly Welch"}, {"rating": 1.0, "review": "If given the option I would rate it at 0 stars. The thing is absolutely awful, it is constantly stopping to refresh and trying to stream live tv using sling, forget it. Unless you like to stop watching for minutes at a time, then have the program restart at the commercials then get confused and then refresh itself. Now I would blame it on the sling app however, it does the same thing while streaming prime shows or netflix. It definately not the internet connection considering I have top speed. Its just a really really bad product for streaming your shows. I normally have to switch over to my xbox so i can watch the program without interruptions. OR on the off chance the product works as intended, which is rare, its slow and you get less than standard definition and audio.", "verified": true, "helpfulness": "2/3", "author": "Kyle"}, {"rating": 4.0, "review": "As advertised work well so far nothing to complain about.", "verified": true, "helpfulness": "0/0", "author": "Olin Drennan"}, {"rating": 5.0, "review": "Have enjoyed watching movies through it.", "verified": true, "helpfulness": "0/0", "author": "Cindy Frederick"}, {"rating": 5.0, "review": "I like it better than my chromecast, its fast, software is nice and the android app works great.", "verified": true, "helpfulness": "0/0", "author": "Chris Nordseth \"Chdone\""}, {"rating": 5.0, "review": "The fire stick is so easy to use!  I would definitely purchase another one if needed!", "verified": true, "helpfulness": "0/0", "author": "michelle"}, {"rating": 2.0, "review": "Where to begin,  The device is really easy to set up out the box, it even starts up with a tutorial video to help you set it up, which is nice to see.  I personally like the remote very much, there are no led's on it which i like but yet it is simple enough for you to remember where every button is in the dark though touch and the remote navigates the menus nicely.This is the first smart tv dongle/stick i have ever owned so i might have been expecting too much out of this thing, the only apps i use on it are Plex, Netflix, YouTube and Amazon live video. Plex works really well, i love it, Netfilx works fine too but it does slow down sometimes, amazon live video also works well, but the YYouTube app is outright unusable, it is very slow, and very unintuitive, navigating the YouTube app is horrendous, whenever i use it i just end up casting to it from my phone or tablet. I can't comment on other apps as i haven't used any other ones.The device also does not work properly when you plug it in your tv's usb port for power, i tried and it forces 720p and frequently crashes. when connected to the wall i also tried using a longer cable, a 12 foot cable instead of the included 6 foot one and got similar results of crashing and forced lower resolutions, so have an outlet socket free withing 6 feet to use this thing.The wifi works fine for me, runs my movies and shows in 1080pThe biggest issue i have with this device is the fact that it just does not work.  9 out of 10 times, and this is not an exaggeration, when i turn on my tv the device just does not show a display or the remote won't be connected. i have tried all the ways amazon has said to get it to come back on and none of them work and so 9 out of 10 times when i turn on my tv to use this thing i have to get up and unplug and replug it back in. At first i thought it was because i was using a 4k tv and the device had to cycle through the resolutions to find 1080p and lost input while doing it somehow, but after hearing a friend complain to me about the same issue on his 1080p tv, i am sure it isn't that.  For a tv dongle this is a pretty big issue, very much a deal breaker for me", "verified": true, "helpfulness": "0/0", "author": "NicD"}, {"rating": 5.0, "review": "Works as advertised. I have this installed in our 2015i Yukon Denali XL. We use the car's 4G hotspot for internet connection and the kids can stream video into the rear seat screens. Picture quality is only standard since GMC only has an analog input (RCA) no HDMI input.", "verified": true, "helpfulness": "1/1", "author": "Mike, CA"}, {"rating": 5.0, "review": "This is amazing!  I love it and want to get one for our other television", "verified": true, "helpfulness": "0/0", "author": "Pearlann"}]