[{"rating": 5.0, "review": "I absolutely love it!!! Couldn't be simpler to install and use. Along with having Huluplus, pbskids & Netflix apps built into it -  Amazon fireTV stick is all I need!!!", "verified": true, "helpfulness": "0/1", "author": "Barbara Copeland"}, {"rating": 5.0, "review": "This is an excellent product. Quick response, beautiful pictures. You can download any 3rd party apps such as YouTube. For most of the users, setting up should not be a problem, but let me share some tips.- Check your TVs if they are HDCP-compatible before ordering (HDCP = short for High-bandwidth Digital Content Protection). Some old models may not have HDCP.http://en.wikipedia.org/wiki/High-bandwidth_Digital_Content_Protection- If you have a Kindle account (or any other digital contents), check the country setting, which can be checked via your PC. For example, if your account is tied with co.jp, you wound not be able to watch any movies (music may be OK even in that case since it has a different contents management policy). You need to change the country to the US.At first I could not watch any movies due to the second issue, but could finally identify the root cause with the aid of the great customer support of Amazon.", "verified": true, "helpfulness": "1/1", "author": "Thomas"}, {"rating": 4.0, "review": "Works great no problems", "verified": true, "helpfulness": "0/1", "author": "john sawyer"}, {"rating": 5.0, "review": "Love this stick but it works better on my WiFi at 5mhz than at 2.4", "verified": true, "helpfulness": "0/1", "author": "Robert Perigo"}, {"rating": 4.0, "review": "once I learn how to connect correctly. I love it.", "verified": true, "helpfulness": "0/1", "author": "mazie wynn"}, {"rating": 5.0, "review": "I  enjoy the Fire TV stick, there's  so much I can watch when there's nothing on regular tv!", "verified": true, "helpfulness": "0/0", "author": "Janelle Godfrey"}, {"rating": 1.0, "review": "Very disapointed. It kept dropping the wifi signal even though all other devices in the house didn't have an issue.", "verified": true, "helpfulness": "0/0", "author": "Neelima"}, {"rating": 5.0, "review": "Easy to hook up, easy to understand and is great for the money.", "verified": true, "helpfulness": "0/0", "author": "Nola wondernine \"L\""}, {"rating": 5.0, "review": "really enjoying the movies and the Bosch series", "verified": true, "helpfulness": "0/0", "author": "Silas L. Jervis"}, {"rating": 5.0, "review": "I previously owned Google's Chromestick and really enjoyed that, however the Fire Stick has so much more and is much easier to access and use. There are a lot of apps and it is very easy to navigate. If you have Prime Membership, the Stick is even more enjoyable. Definitely great value at this price. Highly Recommended!", "verified": true, "helpfulness": "0/0", "author": "Joshua H. Bird \"StreetGang\""}]