[{"rating": 1.0, "review": "Brought several of these, looks like most of them are having a problem.  The one's I gave to my family some don't work after a month of use, and I had two fire TV's, the stick and the box, within a month or so both of them went blank.  Amazon did replace them, so that's good, but I would not recommend buying them, I think it is not stable, and has some real problems with the software.", "verified": true, "helpfulness": "0/0", "author": "lisa feldman"}, {"rating": 5.0, "review": "We love our firestick!!", "verified": true, "helpfulness": "0/0", "author": "Bookworm"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Maisam Otoum"}, {"rating": 4.0, "review": "Good. For the pirates bad.", "verified": true, "helpfulness": "0/0", "author": "Cristobal R. Garcia \"Century 1900\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Best device like it on the market. I own the Roku and Chromecast and this one kills both of those. And I like those a lot too.", "verified": true, "helpfulness": "0/0", "author": "ledfull"}, {"rating": 5.0, "review": "I've only had it a short while, but I really like it.It's portable and practical and has a ton of great movies and TV Shows available with Amazon Prime.I've had my Fire TV Stick for a couple of weeks now and I just wanted to add some things... I really love this item, a lot! When combined with Amazon Prime it opens up a ton of great content. All the shows from TV and the great movies. You've got access to movies that I could never find with Netflix and cable TV and Hulu. It's probably the only streaming device that anyone would ever need!", "verified": true, "helpfulness": "0/0", "author": "Pete Tiffany"}, {"rating": 5.0, "review": "works greaT", "verified": true, "helpfulness": "0/0", "author": "Cindy Guerrero"}, {"rating": 4.0, "review": "Very good, but not great.  More a problem with content rather then product.  Also still trying new apps  and features.", "verified": true, "helpfulness": "0/0", "author": "GKM"}, {"rating": 3.0, "review": "very easy to use", "verified": true, "helpfulness": "0/0", "author": "julio"}]