[{"rating": 4.0, "review": "Works well, just wish it had a way to increase storage; eg. sd card", "verified": true, "helpfulness": "0/1", "author": "George R. Cahlik"}, {"rating": 5.0, "review": "I am thoroughly liking the fire stick. My only complaint is that the remote is so sensitive that I have had to start most numerical or alpha entries over because of double or even triple entries. But to see the larger view of movies, games etc. on my TV screen makes it almost priceless to me.", "verified": true, "helpfulness": "0/1", "author": "B. M. Banks \"book lover\""}, {"rating": 5.0, "review": "...about how much I LOVE my Amazon Fire Stick. I want another for a new TV I will be purchasing. The games are SO FUN!!! Hulu, Netflix, YouTube.. all work flawlessly, and of course your Amazon Prime Video. For $35 bucks you can practically ditch cable - or at least the cable boxes in those rooms that you hardly watch TV in. The remote is excellent and very responsive. This is not the voice remote, however. I will be buying several more of these for other TV's. I just wish there was a way to harness the power from the TV instead of needing to plug it in.", "verified": true, "helpfulness": "0/1", "author": "Bekktek"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Ray Maxwell"}, {"rating": 5.0, "review": "LOVE LOVE LOVE.  This is exactly what I needed.  Fits my lifestyle perfect.  Super easy to set up and I have used it nonstop since I got it. Thank you for this wonderful product. I would highly recommend it.  Never had any issue with it and I love the apps I can put on it.", "verified": true, "helpfulness": "0/1", "author": "B. Hoover"}, {"rating": 3.0, "review": "Bought this as a gift for my parent anniversay to use on bedroom tv. The apps are nice but trying to stream movies and Netflix it doesn't always work. It buffers a lot especially during the middle of a movie. Hoping it's just a Wi-Fi connection issue and not issue with product. Really like the games that are featured on the stock especially pin ball my mom's favorite.", "verified": true, "helpfulness": "0/1", "author": "Niecey J."}, {"rating": 5.0, "review": "Does what it's supposed to do..", "verified": true, "helpfulness": "0/1", "author": "Dbs \"hothotkindle\""}, {"rating": 5.0, "review": "Fine", "verified": true, "helpfulness": "0/1", "author": "K. Ahlrich \"ahlrichmom002\""}, {"rating": 5.0, "review": "Fits the bill perfectly for hotels and other travel. However for home tv, nothing beats Roku for speed. This is only a \"stick\" though but it works well enough to encourage me to order the box next time. Set up very easy.", "verified": true, "helpfulness": "0/1", "author": "Reggae Lover \"Reggae Lover\""}, {"rating": 4.0, "review": "I used an Apple TV for several years, but found myself fed up with the random restarting, deleting, and adding of apps.  After purchasing the Fire Stick for my dad, I decided to get one for myself and love it!  It's a great little piece of equipment.PROS-lots of apps-relatively easy to use-fast-great apps and features-access to Netflix, Amazon Prime, YouTube, Hulu, etc.CONS-can be misleading when it comes to free vs. paid TV and movies - have to keep a close eye on that!-the interface is a little messy-searching (say in YouTube) can be frustrating-separate plug for powerOverall, I'd recommend it.  I like it a lot and am looking forward to a long and happy life together. :)", "verified": true, "helpfulness": "0/1", "author": "J. Keely"}]