[{"rating": 5.0, "review": "So easy to set up love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 1.0, "review": "So mad it doesn't work keeps on freezing no signal", "verified": true, "helpfulness": "0/0", "author": "jode"}, {"rating": 4.0, "review": "Convenient, works very well.  I wasn't aware that it doesn't handle apps, at least the March Madness I wanted :), but it holds up great.", "verified": true, "helpfulness": "0/0", "author": "D. Colombo"}, {"rating": 3.0, "review": "I'm not finding the buffering problem any better with the fire stick. That was my main objective with the purchase.", "verified": true, "helpfulness": "0/0", "author": "I read the reviews its scary but fun buy it lol just joking bad rip off"}, {"rating": 5.0, "review": "Simple, easy to use, perfect", "verified": true, "helpfulness": "0/0", "author": "Drew boy"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Jacob leblanc"}, {"rating": 5.0, "review": "I love it.  I reluctantly put a small tv in my bedroom after 15+ years.  This does the job of streaming a movie or a show, when needed.  I already had the fire tv box, on the regular tv downstairs.  Def worth $40 to be able to watch an occasional show upstairs, instead of falling asleep on the couch!", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 4.0, "review": "Seems to be OK, I haven't used it much, since I purchased a Smart TV shortly afterwards.", "verified": true, "helpfulness": "0/0", "author": "The Reader"}, {"rating": 4.0, "review": "The stick arrived on time and the packaging is exceptional. It really was a pleasure to open. The stick works great and is easy to use. The only problem I have with it is that it is attached to my account and I do not have Prime. My wife's account is the main account and she is a Prime member. This is a problem because even though I can get free shipping (same household) I CAN NOT access prime instant video. Customer service was exceptional and offered to switch it for me but the reason I went with Firestick was for SlingTV which is under my account.I'm only giving 4 stars for this reason. I hope in the future Amazon makes Prime instant video available to members of the same household just like shipping.", "verified": true, "helpfulness": "0/0", "author": "Shawn Buckingham"}, {"rating": 4.0, "review": "Love the smooth navigation and apps,WiFi connection is excellent.thumbs up!😊", "verified": true, "helpfulness": "0/0", "author": "dandre"}]