[{"rating": 5.0, "review": "I don't have cable or satellite, only over the air channels and I must say this is a great alternative. If you are not a premium channel junkie then this is a great idea. I would recommend this to anyone.", "verified": false, "helpfulness": "0/0", "author": "Josie"}, {"rating": 5.0, "review": "Awesome!  Lots of things to do with it", "verified": true, "helpfulness": "0/0", "author": "ruben"}, {"rating": 5.0, "review": "Yes, this was the answer to our \"What's on TV?\"nightly question. And the convenience of po it in, sign in to your internet service and off you go. Yes we are very happy with this product. And as Prime members, now we can use our membership to the max.Thanks for making it available at Christmas...it was a very nice surprise.", "verified": true, "helpfulness": "0/0", "author": "Margaret"}, {"rating": 5.0, "review": "Faster navigating, buffering, and load times than Apple TV. My preferred media streaming device for Amazon Instant Video, Netflix, and Hulu. I love the \"back 15 seconds\". The integration with IMDB makes searching, rating, and browsing makes the whole experience better.", "verified": true, "helpfulness": "0/0", "author": "Alex Johnson"}, {"rating": 2.0, "review": "Set up stalled several times but works great once it's up and running. Doesn't work well if a few walls away from the router.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 1.0, "review": "A huge disappointment.  I have been unable to watch one show without encountering numerous problems.It cannot hold a wifi connection.  I am constantly plugging and unplugging the power,resetting my router without success.", "verified": true, "helpfulness": "1/2", "author": "Winifred Conroy"}, {"rating": 5.0, "review": "This Amazon Fire TV Stick is awesome! I can watch Amazon Prime, stream Netflix and play games apps on my TV with this! Wish I could get another one for $19.99 as a Amazon Prime Member!!!", "verified": true, "helpfulness": "1/1", "author": "Christopher Watt"}, {"rating": 5.0, "review": "I had no problem with set up and viewing.  Very simple.", "verified": true, "helpfulness": "0/0", "author": "Susan Palacio"}, {"rating": 5.0, "review": "Love it works great", "verified": true, "helpfulness": "0/0", "author": "J. Hinton \"J Hinton\""}, {"rating": 5.0, "review": "Super easy to use!!!", "verified": true, "helpfulness": "0/0", "author": "Shari E. WInnan"}]