[{"rating": 5.0, "review": "Makes watching Amazon Prime movies so much easier than trying to get the internet on my blu ray to stream through th tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Frank Allen"}, {"rating": 3.0, "review": "I was really looking for this to be something above and beyond Roku (which I also have) but it is about the same. Plenty of extra things to buy above standard and pretty much the same movies as Netflix on the Amazon Prime movies app. All in all, if you are looking for something to buy, I would consider Roku.", "verified": true, "helpfulness": "0/0", "author": "WP \"NonaP\""}, {"rating": 5.0, "review": "I like the fact that I can be watching something on my Fire TV downstairs, then go upstairs and continue watching the same show from the Stick!", "verified": true, "helpfulness": "0/0", "author": "ilovebooks"}, {"rating": 5.0, "review": "Easy to use. Family time watching tv", "verified": true, "helpfulness": "0/0", "author": "Jdiaz"}, {"rating": 4.0, "review": "Easy to install and setup and works as advertised. The technology is excellent, it's time for the content to catch up. Yes as a Prime Account holder I have access to \"thousands\" of movies, but none of them are any good and the ones that are you have to buy, you can't rent. News flash: people don't want to own movies, that's why they buy things like Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "jordan bonomo"}, {"rating": 5.0, "review": "Working like a charm", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"MJ Hatch\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "richie"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 4.0, "review": "My wife and I like our Fire Stick very much. The only qualms we may have are: there's no way to pull up a search feature from within the music, apps, etc. menus (you have to go to the search feature at the top of the sidebar), and there's no video chat feature - something Chromecast allows you to do.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Herrera"}]