[{"rating": 5.0, "review": "My whole family loves the new Firestick!", "verified": true, "helpfulness": "0/0", "author": "Velma oliver"}, {"rating": 3.0, "review": "I wish there was better instructions.  I'm still having difficulty.", "verified": true, "helpfulness": "0/0", "author": "Connie Cole"}, {"rating": 5.0, "review": "I am not very smart with anything to do with technology, but I have put together this Fire TV Stick and right away was able to start watching PRIME Movies - way to go AMAZON - Satisfied customer  :)", "verified": true, "helpfulness": "0/0", "author": "Alba m Parra"}, {"rating": 5.0, "review": "Liked it so well we bought a second one and moved our old Apple TV to the guest bedroom.If there was a current news app we could cut the cord.We will now become Amazon Prime members when the free trial month ends.An added benefit is the iOS remote app that allows us to use our iPhones as remotes.", "verified": true, "helpfulness": "0/0", "author": "Jim Deaver"}, {"rating": 5.0, "review": "Very good product. easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Jose Luis Garza"}, {"rating": 4.0, "review": "Only reason I am not giving it 5 stars is because I purchased the Fire box and stick to eliminate my 170 dollar direct tv bill.  The wording in the description made it sound like paid for features, such as hbo go would be included with my Amazon Prime membership.  When I connected both the box and stick, the set up prompts me to choose which cable company I have to be able to watch HBO and Showtime.  Lame, the whole point of buying these items was to disconnect my cable company.  Why would I need this, if I still had cable.  Lame.  Otherwise, it's fast and has lots of great features and access to movies that do come with my prime membership.", "verified": true, "helpfulness": "0/0", "author": "j. jones"}, {"rating": 5.0, "review": "This is my third Amazon TV type product, and I love them so much, I got rid of my outdated Roku and my cable!  This is all I use and one of my favorite gifts to give.  That being said, this last one, I had an issue on the set up because it wasn't preset for my account like my others had been and apparently my DVD player was interfering with the reception of the wifi to the Amazon stick.  I called customer service at Amazon and they told me to use the extender that came with the stick.  It worked perfectly and I was able to set it up and get it running smoothly.  That being said, I have to mention that I had one of the best customer service representatives I have ever come across in all my years of dealing with, well humanity!  Maya JM blew me away with his courtesy and friendliness, and made the process incredibly enjoyable.  Kudos to Amazon for as always, hiring the best of the best!  Wish I could treat him to a cup of Civet coffee!  And I also purchased the spock socks he made me laugh about!  This guy is awesome! A true keeper.  Wish I had his direct extension!", "verified": true, "helpfulness": "0/0", "author": "M. Horton"}, {"rating": 1.0, "review": "Plugged it in, set it up aaaaaaaanndd....NOTHING! Despite my Prime account it never recognized me. The Main Prime Instant Video failed miserably! The only app available tha seemed to work was Netflix. Could not obtain any apps - and the few available, just said \"pricing unavailable\". Called support - in the Phillipines - ran me through everything, deregistered, power-cycled....no change.Sad they'll be calling back in 24-48 hours (if she can figure out the time and date where I am). They should have said screw it - we'll just rush you out another. You open it and it looks impressive, like Amazon's take on Apple packaging - this ain't no Apple product though!We'll see...........", "verified": true, "helpfulness": "0/0", "author": "Chris Newhook"}, {"rating": 5.0, "review": "I am very happy with my fire stick it was so easy to hook up. I have already started watching new programs and series.have had no problems to date. I down loaded the app and can use my phone as the remote.So far so good.", "verified": true, "helpfulness": "0/0", "author": "lodger"}]