[{"rating": 4.0, "review": "I really like that the fire tv 📺 and it was very easy to setup and I was able to get the apps that I use almost everyday.", "verified": true, "helpfulness": "0/0", "author": "purson;)"}, {"rating": 4.0, "review": "Love this little stick!Did I need yet another media device? No but, the price is right and the little device is so darned convenient!Play games, movies, ambiance apps at home or when you travel.Easy to connect to any modern TV - comes with an HDMI port dongle extender to let you plug this in when the space on the tv is too tight.Interface is snappy and quick. Took it to a hotel over New Years and used it for playing movies and games with friends.Comes with a small external power block but uses minimal power - mine has worked well by simply plugging the non proprietary usb power cable into the usb port found on most modern TVs.Pros:Small and portableCurrent GUI nice to useSips power so can be used with TV usb portCons:No power/reset switch for if it freezes (some apps may make this happen)USB is on the side instead of at the rear end of the stick - odd placement means the dongle will be needed in many cases.Doesn't appear to support the modern HDMI port power standard that would allow you to simply plug and play", "verified": true, "helpfulness": "0/0", "author": "X. IrAal \"Avid Amazon Prime Purchaser\""}, {"rating": 1.0, "review": "This device is not ready for release. Here are some of the issues:- Embedded Miracast support not working: My sony experia Z3 compact does not connect to the fire-stick. Firestick with latest software just reboots on an connect attempt. Attempts on a previous version resulted in failures to connect, reboots of the firestick,, connection drops. Casting of audio never worked.- Airplay application AirBuddy not working. Server says on, but Server settings display empty MAC address and ip address- Slightly choppy video playback for any video- Issues with fire stick audio: problems switching between dolby digital (as in amazon prime video), and back to 2 channel PCM (as in music). Bit rate gets messed up and audio sounds in slo mo.Bottom line: Return to sender", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer \"johnnyb555\""}, {"rating": 4.0, "review": "It was a gift for my daughter..she said she really likes it so far.", "verified": true, "helpfulness": "0/0", "author": "candace"}, {"rating": 5.0, "review": "Very nice device. I was surprised at how easy it it was to install and how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "Rich Sherwood"}, {"rating": 5.0, "review": "Very easy to install. It takes less than 5 minutes. Very satisfied with the purchase.", "verified": true, "helpfulness": "0/0", "author": "J. Tong \"jt\""}, {"rating": 5.0, "review": "Lots of fun, have only played with it for an hour or so, but it will be beneficial.", "verified": true, "helpfulness": "0/0", "author": "S. Phillips"}, {"rating": 4.0, "review": "Great device, turns your regular tv into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Tom,g"}, {"rating": 1.0, "review": "I bought this when it was only $19 as a prime member. I was ecstatic and couldn't wait for it to come, as I do not have a smart tv and currently was streaming everything with my laptop through a HDMI cable. Which the quality of my feed  was mediocre. After waiting over a month for my stick to arrive, I was excited as can be when it was delivered. The packaging was very sleak, and the device itself had a nice look to it. I spent 25 minutes setting the firestick up because it was quite slow. When I finally got it set up I was ecstatic to start watching something. It immediately brought me back to network settings, and stated that I was connected to the internet but with problems. I spent over two hours rebooting the system, my router, and moving the router closer to the system. I decided to just try again another day because at the point I was irritated. So i tried again about a week later, and got online with amazon customer support. They stated it was a problem with my router and that it must have a firewall up blocking my FireStick. I proceeded to get on the support line with my internet provider and we took down all the firewalls with still no luck.  I decided to try the stick at my parents house who have the roku stick and Roku 3, and were interested in getting the FireStick for another one of the TVs. We had the same issues there. I ended up returning the device and they are sending a replacement after three rounds with amazon customer support. The device was returned on Christmas eve, and now I have to wait till after February to get my new replacement. When I receive my replacement and IF it works, I will update my review , but, as of right now, this has been my worst purchase from amazon ever.", "verified": true, "helpfulness": "0/0", "author": "Lauren Hartley"}, {"rating": 5.0, "review": "I enjoy unlimited movie", "verified": true, "helpfulness": "0/0", "author": "QUINTINA HAWKINS"}]