[{"rating": 5.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "Margeaux Walsh"}, {"rating": 4.0, "review": "The stick is working fine, ut the remote stopped working on the 2nd day. Amazon customer service was wonderful getting me a replacement quickly. All is working great now! Thanks.", "verified": true, "helpfulness": "0/0", "author": "Deanna H."}, {"rating": 5.0, "review": "The best option in the market so far. I'm from Costa Rica and it works great!!", "verified": true, "helpfulness": "1/1", "author": "Jose Araya"}, {"rating": 5.0, "review": "It is easy to install and works easily.  I'm so glad I got it.", "verified": true, "helpfulness": "0/0", "author": "Reba"}, {"rating": 2.0, "review": "I have owned and enjoyed an Amazon Fire TV for some time. It is a great product. Much more responsive than the Roku 2 XS box I also own. I tried to order another Amazon Fire TV to replace the Roku box. Amazon does not sell the Amazon Fire TV so the only choice was the Amazon Fire TV Stick.  I received it and it works but is much slower than the Amazon Fire TV - it is pokey compared to the real thing. Part of the problem is the slower processor in the stick and the complete lack of a wired Ethernet connector on the stick. They also cheapened the remote control by removing the voice input function. I have switched to the Roku 3 since Amazon has stopped making the real thing - the Amazon Fire TV. The only good thing I can say about the Amazon Fire TV Stick is the fact that it is cheap - so cheap in fact that I  am not even going to bother returning it. The new Apple TV also looks good so you  might want to hold  off until you take a look at it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Doyle"}, {"rating": 3.0, "review": "Netflix works great! So does screen mirroring. Crackle not so much, has a lot of ads and sometimes does not reload the movie or show that im watching. Other than crackle sucking. Fire stick works great", "verified": true, "helpfulness": "0/0", "author": "edward"}, {"rating": 1.0, "review": "Stopped after two weeks no reason why wasted money", "verified": true, "helpfulness": "0/0", "author": "MICHAEL BORO"}, {"rating": 5.0, "review": "I love thins thing. Quick and easy access to a lot of different content, and I haven't even scratched the surface of all it can do. I'll be cancelling my cable altogether soon.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Great product. I would recommend this to anyone. It's so easy to figure out and a lot of great apps to keep you occupied. Never have a problem with the video being blurry or having to buffer. 5 stars!", "verified": true, "helpfulness": "0/0", "author": "James Slaga"}, {"rating": 4.0, "review": "Still figuring it out, I'm enjoying it so far.", "verified": true, "helpfulness": "0/0", "author": "Nick K."}]