[{"rating": 5.0, "review": "Enjoy it very much.", "verified": true, "helpfulness": "0/0", "author": "Alex Monelli"}, {"rating": 5.0, "review": "Excellent product easy to install and navigate through the different apps.", "verified": true, "helpfulness": "0/0", "author": "Michael McGrade"}, {"rating": 1.0, "review": "I can't get the damn thing to work properly. It is impossible to watch Hulu without interruption for one. I keep having to reboot the Stick AND my router just for good measure. It DID however, pull a lot of photos from my old cellphone, which I did not ask or want it to do. I wish I could send it back. I wish I had gotten the Chrome instead.", "verified": true, "helpfulness": "0/0", "author": "trixietelemetry"}, {"rating": 5.0, "review": "It is really fast and very responsive, easy to install and ready to use right away!", "verified": true, "helpfulness": "0/0", "author": "bo massie"}, {"rating": 5.0, "review": "Now I've gotten hooked on Alpha House!  Love the Fire TV Stick.  I'm about ready to ditch the cable", "verified": true, "helpfulness": "0/0", "author": "Firecracker Girl"}, {"rating": 4.0, "review": "I provides just the function I wanted. I ordered a second one for my son.", "verified": true, "helpfulness": "0/0", "author": "Lyle J Fangmeier"}, {"rating": 3.0, "review": "works fine  needs more low cost rentals", "verified": true, "helpfulness": "0/0", "author": "What for"}, {"rating": 5.0, "review": "amazon nation proud member. amazing value. simple set up. flawless operation.", "verified": true, "helpfulness": "0/0", "author": "Neil A. Depuy"}, {"rating": 5.0, "review": "Love it!  Even a technically challenged oldster such as myself was able to install it and actually use it!  Good buy - highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Tunergal"}, {"rating": 5.0, "review": "I am probably one of the least tech savvy people out there. That being said, this was super easy to install/setup and use. I'm an amazon prime member and all of my account info was conveniently preloaded on to the fire stick. If you want an easy and efficient way to get movies, music and TV, the fire stick is the way to go.", "verified": true, "helpfulness": "0/0", "author": "Christina"}]