[{"rating": 5.0, "review": "Good experience", "verified": true, "helpfulness": "0/0", "author": "Ron Barkman"}, {"rating": 5.0, "review": "This is so much better than the or any  thing out there. No buffering!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the product. I had to up my wifi carrier for better bandwidth. Wish I had done this sooner. I've had Prime for some time and did not realize how seamless and how great this added feature is.", "verified": true, "helpfulness": "1/1", "author": "Brandon D. Walker \"Happy Big City Camper\""}, {"rating": 4.0, "review": "A little unreliable when trying to stream from the iPhone Netflix app, but overall a solid product.", "verified": true, "helpfulness": "0/0", "author": "M. Elam"}, {"rating": 4.0, "review": "Love it. User feindly and work where ever you go. Amazon TV Stick is a must have if you like to watch movies and more.", "verified": true, "helpfulness": "0/0", "author": "Amafan"}, {"rating": 3.0, "review": "love the stick but had to buy plex when I all ready had it was a pain till I talk to the right girl got refund but got the run around", "verified": true, "helpfulness": "1/1", "author": "Lawrence J. Dunn Jr."}, {"rating": 5.0, "review": "Wow!  Rock solid, easy to set up and uae. UI giod but a little different.  Smashing great for all Amazon related stuff.  Haven't found many of my channel favorites from my R*K* device yet.  Add a F-F adapter and 3'~6' F-M extension cableand you have a perfect travel kit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sailing Fool\""}, {"rating": 2.0, "review": "A very important feature: ACCESS TO MY LOCAL OR REMOTE VIDEO, Pictures or MUSIC or other electronic STUFF !With Roku or even Chromecast, and many other cheap devices I can accomplish easily something that I cannot get working on the Fire Stick and Tablet for that matter. Your confusing interface managed to make me unintentionally pay for a TV show, that has some parts for $0 and some for money -- and there is no way to cancel or refund it. Is this a new way of creating revenue for Amazon?Major oversight Mr. Jeff --  now both Kindle Fire tablet and the Stick are major disappointment. I do not think I will even try the Phone.", "verified": true, "helpfulness": "0/1", "author": "Just a customer"}, {"rating": 5.0, "review": "I ordered this on a whim as a preorder so I could finally watch Amazon Prime videos on my TV. I am sure glad I did. To keep this summary short, I will just say that this is a great compliment to other media streaming devices out there. I have long refused to buy a smart TV because of all the options to add streaming to a \"dumb\" TV and in my personal situation, this device combined with a Chromecast fits all of my needs to a t.  I have an android phone and the ability to use the play store for a movie is a big plus for me, hence the Chromecast. I have long strugglednwith how to get prime video on android, which is now available but could not cast it on my tv. That's where the Fillre Stick comes in to play.  Although I can get the same streaming apps on both the Chromecast and the Fire Stick, having access to so much streaming media has solved almost all of my struggles.To conclude, the games on the Fire Stick, Prime videos and apps combined with a Chromecast and the ability to stream from my phone makes my media streaming collection, to me, just what I need.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Penn"}, {"rating": 4.0, "review": "Nice interface ! Very nice remote control and easy to set up. Just wish the service had more new movies for free", "verified": true, "helpfulness": "0/0", "author": "TURNone"}]