[{"rating": 5.0, "review": "Easy to setup and it moves relatively fast. I thought I could plug the USB into the TV or cable box for power, but it kept asking for it to be plugged into the wall adapter, so I did. The tutorial goes on a little long, couldn't skip it, but i'm sure some people need it.", "verified": true, "helpfulness": "0/0", "author": "Dr Whom"}, {"rating": 5.0, "review": "I have both the fire tv box and stick... I have been experiencing issues with the box and non with the stick.I am very pleased but wish the stick would have come with a voice activated remote like the box does but I realize then it would cost more for the stick.", "verified": true, "helpfulness": "1/1", "author": "Melfig"}, {"rating": 5.0, "review": "Small and great. I wish if it could power from HDMI, and not require power adapor.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "product worked OK for me.", "verified": true, "helpfulness": "0/0", "author": "gary johnson"}, {"rating": 5.0, "review": "Awesome! We are enjoying our fire stick greatly!", "verified": true, "helpfulness": "0/0", "author": "Pamela C. Hoffman"}, {"rating": 4.0, "review": "Easy to use for seniors.  Much better than tv.", "verified": true, "helpfulness": "0/0", "author": "Sherrod Beall"}, {"rating": 2.0, "review": "Often drops internet connection. Stops 5-6 times during any Netflix play to \"buffer.\" Cumbersome to set up. Shouldn't be this hard--come on guys! Provide the opportunity to reset RAM for buffering!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "rkd1234"}, {"rating": 5.0, "review": "When got home from work my fire stick was in the mail. I thought of setting it up the next day Saturday, since I was pretty tired and didn't want have to deal with any set up hassles.  After reading the directions decided to go ahead and give it try since it seemed easy enough. I had it up and running in about 10 to 15 minutes. It's all plug and play.  The only thing that help me up a bit was trying to open the remote control cover to install the batteries and navigating the remote to put in my wifi password (instructions on remote are non existant). In case anyone has any problems in navigation of the remote control to set up the password; use the select (big round button on the Fire TV stick remote control).  Other than that the rest was a breeze for this 55+ lady. I was able to watch a good movie in bed using my  Fire TV Stick and Amazon prime!Update:  I liked it so much I ordered a Second One for my bedroom.  Thinking about buying a third one for my daughters bedroom but waiting to see if they come out on sell.", "verified": true, "helpfulness": "0/0", "author": "onlineshopper \"LovesBooks\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Scott P Avery"}, {"rating": 5.0, "review": "It was easy as ABC to install . Does everything  as stated...so far, So good", "verified": true, "helpfulness": "0/0", "author": "Hector Marie"}]