[{"rating": 3.0, "review": "My fire  tablet connects to my Wi-Fi better", "verified": true, "helpfulness": "0/0", "author": "neil crammond"}, {"rating": 5.0, "review": "My family truly loves this product. It is absolutely user friendly, the children are able to find the program or movie they were actually looking for and other subjects, such as movies their parents told them about. Being a member of Amazon Prime pays for itself in no time. The price is unbelievable and it comes with its' own remote control, batteries included. You cannot go wrong with this product.", "verified": true, "helpfulness": "0/0", "author": "Deborah Bottai"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Carri"}, {"rating": 5.0, "review": "Haven't used it much yet, but seems to work well", "verified": true, "helpfulness": "0/0", "author": "Bret D"}, {"rating": 4.0, "review": "Works well at home. We'll see how it works on the road.", "verified": true, "helpfulness": "0/0", "author": "gcoug"}, {"rating": 5.0, "review": "I love Amazon and the fire stick. The fire stick is very responsive and connects to the Internet extremely well. We use ours in a upstairs bedroom and our router is downstairs. Thanks Amazon.com", "verified": true, "helpfulness": "1/1", "author": "Jeff"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 2.0, "review": "I really liked this device until it randomly stopped working today. No I have no signal and despite resetting, trying a different input/HDMI and various other steps suggested by Amazon's FAQ, I can't get it to work again. I want my money back.", "verified": true, "helpfulness": "0/0", "author": "Alexa Chung"}, {"rating": 5.0, "review": "love you", "verified": true, "helpfulness": "0/1", "author": "goat"}, {"rating": 5.0, "review": "Bought this for my dad.  He loves it.  He can watch hulu, netflix, and amazon.", "verified": true, "helpfulness": "0/0", "author": "N"}]