[{"rating": 5.0, "review": "A great product. Convenient, clear and simple to use. Really a great piece of technology. No frills, just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "gelasia"}, {"rating": 5.0, "review": "It's awesome,  best thing ever.", "verified": true, "helpfulness": "0/0", "author": "Hugo Navarro"}, {"rating": 5.0, "review": "Very awesome and so easy to use! Has everything I want", "verified": true, "helpfulness": "0/0", "author": "Ashly McIntosh"}, {"rating": 5.0, "review": "Absolutely love it and the support is outstanding!!!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Julie Danielewski"}, {"rating": 5.0, "review": "Kinda blew me away! Love the picturesque scenes that come on automatically when you pause (5 minutes). Makes Netflix seem old and stiff.", "verified": true, "helpfulness": "0/0", "author": "Cory S."}, {"rating": 5.0, "review": "I love Fire TV Stick! Simple setup and easy to use. I don't have satellite or cable so it is a nice addition to our limited antenna stations.", "verified": true, "helpfulness": "0/0", "author": "Brian McLane"}, {"rating": 2.0, "review": "The Amazon Fire stick just puts everything you can PURCHASE in one place. Expected a little more free watchings. The Amazon fire stick promotes how you have some things to watch for free and that prime users have a bunch of free stuff. Not really true, I'm a prime memeber and hardely have much free watchings at all. Don't expect to get more than a few hours of entertainment, before you have start buying episodes. Not what I was expecting; but then again I should have known better. I mainly use it now for the apps, like Netflix and such.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 3.0, "review": "It works okay. I only use it for netflix and sometimes have issues connecting to the wireless. Also had issues with it working with my TV that is a little older but finally figured out that every once in a while I have to unplug TV & fire stick to basically reset the system.", "verified": true, "helpfulness": "1/1", "author": "William V."}, {"rating": 5.0, "review": "Love it! Who needs cable anymore!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Johnson"}]