[{"rating": 5.0, "review": "First of all,it is lot faster than old ROKU3 I had. You can watch your videos very instantly as soon as you hit the button\"Play\".The installation,although it is as  simple as \"Plug-n-Play\", was not just as simple. With sound bar attached to my TV,when I plug it into the TV's HDMI outlet, video worked but I was not getting any audio. Finally ,I disconnected old ROKU3 from the sound bar's HDMI outlet and plugged this stick in. Ahaa ! Now I got both- audio and video.The new interface is little bit complex, but once you play around few times, you will get used to it. Much better improvements than all \"amazon prime instant video\" players in the past. I would recommend .", "verified": true, "helpfulness": "0/0", "author": "B. Amin"}, {"rating": 4.0, "review": "Unbeatable for the price I paid ($20 special deal).  Highly recommended and 4 stars if Amazon ever offers that deal again.  I'd rate it 3-4 stars at the normal price, because I expect Amazon will eventually fix a couple of the \"cons\" I listed.Pros:1. Much more responsive than Roku 2.  I have a Roku 2, and I've been getting increasingly frustrated with it, especially when using Netflix.  Netflix is almost always unresponsive on the Roku 2.  I remove a movie from my watch list, and it stays in the list for minutes.  I click on a movie/show on the Roku 2 and 5 times out of 10, it doesn't respond at all for 30-seconds to two minutes.  And at least once per month, Netflix (or any other channel) freezes the Roku, requiring a reboot.2. It has a nice user interface, though it's not always intuitive.3. I can play a game on the Fire TV Stick that I downloaded from the Android app store for my Android phone.  It apparently plays many of those games.  That was a nice surprise.Cons:1. The remote is flimsy, and it often overshoots when I try to select the next movie (or whatever).  Yes, you can use your phone as a remote, but I'm not crazy about that.  And yes, the phone remote adds voice recognition, which would be nice if I ever think to use it.  The one great thing about using the phone remote is that you can use it to type things like your WiFi password.  My password is very complex, so it was a real bonus for me.2. Fewer channels than the Roku, but I really only use a few, mainly Netflix and Hulu Plus, so this is not a con for me.  It may be for you.3. If I switch the HDMI input on my TV away from the stick, the Fire TV Stick doesn't seem to come back on when I switch back.  I have to cycle through the HDMI inputs a second time to get it to respond.4. My Internet speed has been flaky lately (I'm going to switch providers). On the Roku, I get the \"loading\" progress bar occasionally during a show.  That's annoying.  On the Fire TV Stick, I get a circle progress for re-buffering, but mostly it just stutters, which isn't as annoying -- EXCEPT, I get a buzzing noise when it stutters for a second or more.  That's incredibly annoying.Even with the 4 cons, I find it preferable to the Roku 2, especially at the price.", "verified": true, "helpfulness": "2/2", "author": "Nicholas"}, {"rating": 4.0, "review": "Our Apple TV was starting to get slow & glitchy, so we got this when it was on sale for $20.  For that price, I think it's worth it.  I dislike that we can't search by only Prime (free) streaming offerings.  The sound also glitches/freezes every once in a while.  Other than that, it works better than when we were streaming our Prime from the iPad to the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "GRRL"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Gregg"}, {"rating": 5.0, "review": "Can't wait to get this baby and hook it up to get my Prime Stuff.", "verified": true, "helpfulness": "0/0", "author": "Mark Strelecki"}, {"rating": 4.0, "review": "It was easy to set up once it found the remote control. The Android app still needs some work. It was missing HBO Go. I  am sure eventually it will be added.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Rauda"}, {"rating": 3.0, "review": "I expected this device to be glitchy at first and boy was it. I have to manually restart it by unplugging and plugging it back in because it freezes so much. The device will also get stuck in scroll mode and never stop, thus causing a reboot. The device also loses network connection randomly. So far I'm waiting on firmware updates to fix these issues.Aside from the glitches,setup was relatively smooth. It asked for my wifi credentials twice and took about 20 minutes from initial boot up to browsing due to system updates and installs.", "verified": true, "helpfulness": "1/1", "author": "Johanna Kessel"}, {"rating": 5.0, "review": "I was very hesitant to get this. I already have a Chromecast and nexus player, but since it was so cheap and I have Prime I decided to give it a try. Definitely happy with that decision. I am now enjoying content that was not previously available to me on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Carlton A. Dennis II \"voracious reader\""}, {"rating": 5.0, "review": "Works wonderfully. Pretty quick and responsive. Much better remote than the Apple TV and a better value.", "verified": true, "helpfulness": "0/0", "author": "C. S. Johnson"}, {"rating": 5.0, "review": "i finally got it and love it!  works great!  i am very happy with the fire TC Stick, my sons was so  inpressed he is getting one.", "verified": true, "helpfulness": "0/0", "author": "sadie"}]