[{"rating": 5.0, "review": "Awesome love it", "verified": true, "helpfulness": "0/0", "author": "Strider"}, {"rating": 1.0, "review": "the remote doesn't work.  Can't stop on what you want to watch.", "verified": true, "helpfulness": "0/0", "author": "Wallace Sauby"}, {"rating": 5.0, "review": "Awesome!! I use this everyday and bought a second for my sister!", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 4.0, "review": "Picture quality of streaming movies was excellent, menus are well placed.  It is very easy to use.Text font could be bigger and thicker, hard to read at a distance.  Movie descriptions could have more information.I'd like to see it be able to have content sources added from anywhere on the internet, such as CBS, NBC, ABC, etc as I do catch up on missed show episodes on those sites.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Loved it-at first. But starting yesterday it began acting odd, at first saying the signal was weak, my streaming speed too slow, and tonight despite following directions to reprogram the Firestick, we keep getting the message that there is an authentication problem and now we are stuckI'm frustrated trying to remedy the problem and can only return the firestick until February 28th...", "verified": true, "helpfulness": "0/0", "author": "DeanneRN"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "breanna dube"}, {"rating": 5.0, "review": "COOLEST GADGET...NOPE...BEST INVENTION OF THE HISTORY OF MANKIND", "verified": true, "helpfulness": "0/0", "author": "Angelo"}, {"rating": 1.0, "review": "So far, here's what I can say about my Fire TV Stick: A) I'm glad I got it when it was offered for like $19 to Prime members and B) it has 't left its box.I travel A LOT for work and bought this to save me from having to chain the laptop to the hotel TV with the HDMI cable...and yes, I understood that captive internet portal support was \"coming.\"Geezus - how long does it take to work in some kind of lightweight browser, on what is essentially an Android device, so that you can use it with captive portal internet?  Too long, apparently...so, here I am four months after I've purchased it and it is yet to be unboxed...because Amazon hasn't solved this little conundrum.  I don't need the device at home - I'm running a Tivo spread which supports Amazon just fine.  Several Kindle Fires lurk in my house too.  The stick sits. And waits....", "verified": true, "helpfulness": "0/0", "author": "R G Sanders"}, {"rating": 4.0, "review": "Works great was easy to install and use", "verified": true, "helpfulness": "0/0", "author": "wendy g"}, {"rating": 2.0, "review": "Took too long to arrive.  Not what's advertised.  Gary Busey simply plugs it in, and it works, if he can do it anyone can right?  Not true.  More to it than that.  Set it up on TV (took forever) took it to my laptop, doesn't work, more investigation or apps or something.  My point is, advertising looks simple, should be simple.", "verified": true, "helpfulness": "0/1", "author": "Jamilo"}]