[{"rating": 5.0, "review": "Awesome!!! Huge upgrade from the Roku... except no headphone jack. Really nice clear HD picture quality and loads  instantly so much faster.", "verified": true, "helpfulness": "1/1", "author": "Dianne K. Brandauer"}, {"rating": 5.0, "review": "Very easy set-up, lots of choices of channels, nice that it meshes with my Amazon account.", "verified": true, "helpfulness": "1/2", "author": "Susan O'Neill \"cromer crab\""}, {"rating": 2.0, "review": "Issues out of the box-Show stoppers:Freezes when validating pin, can't edit any settings. Looks like it is tied the network issues, why tie the pin into the network?HDCP error sometimes - no other device gives me HDCP errors. Just a big blue screen with HDCP error on it in white text ,even when mirroring my phone. (Sharp TV)Network dropping - no other device on my network drops out (chromacast, laptops, roku etc are all fine)Video playback just stops, no network error, it just stops.Annoying:During setup it asks for the wifi password and then after the first update it asked for the wifi password again.Far too easy for family members to accidently order stuff on my account. I have to enable the pin to prevent but that locks down other features such as screen mirroring.Runs hot - I have it in a well ventilated area.Edit:It is a little more stable on 2.4 GHZ than 5 GHZ. It is in the same room as my router so signal is not an issue.", "verified": true, "helpfulness": "3/6", "author": "Ryan Egan"}, {"rating": 4.0, "review": "So far so good. Performs as advertised", "verified": true, "helpfulness": "0/0", "author": "Irving Pagan"}, {"rating": 4.0, "review": "update 11/26 - so i finally moved to Fire TV box and sent the stick back. reason: Wireless mouse/keyboard support for side loaded apps - that was and is the major attraction for me. note: some apps do work on fire tv stick such as XBMC but others require mouse/keyboard - you could try getting a game controller that works with Fire TV stick to see if that provides similar input but it adds up to the same amount when you compare it with Fire TV box and obviously Fire TV box has better hardware. It shouldn't be that hard for Amazon to add a USB port to fire tv stick but its still a great deal if you got it for $20 during pre-order.update: 11/24 - some side loaded apps DO NOT take input from the remote for e.g. slingbox and dishworld are \"frozen\" at the login page. i've tried amazon fire tv remote app on the smartphone to see if it would respond via keyboard but no luck. however XBMC runs fine...... so my guess is that some apps rely on receiving input via \"touchscreen\" thus those run fine on smartphone or tablet ! just something to note if your interest is in consolidating streaming apps so you don't have some on roku, apple tv etc. am going to try Fire TV box to see if the USB mouse / keyboard would work for these frozen apps.so far its good. was able to side load apps and run'em without issues. would be great to see side-loaded apps on home page so lesser clicks to launch. contrary to other reviews, games run good too....", "verified": true, "helpfulness": "1/1", "author": "Mark Twain"}, {"rating": 5.0, "review": "This is the most amazing product. All three kids 6 thru 10 can use it. Now all my TV's are smart TV's!", "verified": true, "helpfulness": "1/1", "author": "land of misfit toys"}, {"rating": 5.0, "review": "Easy to connect and appears to work well. It actually works better than I expected. I am very impressed.", "verified": true, "helpfulness": "1/1", "author": "Rodney Bonner"}, {"rating": 5.0, "review": "I was looking for a simple, easy solution to watch Amazon Prime Video on my non-Smart HDTV in my bedroom. When the Fire TV Stick was introduced at a very low pre-order price, I jumped right on it. Now that I have received it, I couldn't be happier. It works perfect for what I wanted it for, and has bunch of other extras.Out of the box, setting it up couldn't be easier. Plug the stick into an HDMI port on your TV. Connect the USB power source. Install the included batteries into the remote, and you're good to go. Upon initial startup, you'll have to enter you network information. Afterwards, the Fire TV Stick will download any available updates. Upon my first connection, a software update was available and installed. After installation, I had to enter my network information again, and that was it. The first time you use the Fire TV Stick, you're forced to watch a fairly short cartoon tutorial video. There is no way to skip it, so just let it play. It's only a few minutes. Once it's over, you all set to explore all Fire TV Stick's features. My Fire TV Stick came pre-registered to my Amazon Account, which was a nice touch. You can change it if you wish. Since Amazon Prime Video is what I purchased it for, that is the first thing I tried. I wasn't disappointed. It's very simple to navigate Amazon's video library via the small remote control, and playback worked perfectly. HD content looked great on my modest 32\" 720p HDTV. I have a very fast Verizon FiOS internet connection, and had no issues with buffering at all. If you're not a Prime Member, you get a free 30 day trial. I also tried some of the other services, apps, and games. The apps and games are very limited, but everything I tested seemed to work well. There is an Android app to use in place of the remote control if you wish, but I haven't felt the need to download it. An Apple App is going to be released shortly. If there is one thing I wish the Fire TV Stick had but doesn't as of yet, is a web browser app. Perhaps in the future. Even without it, I'm very happy with my purchase of the Fire TV Stick. Perhaps owners of the Roku or Chromecast might feel that the Fire TV Stick isn't as good. I don't have those devices to compare, but I'm satisfied with what the Fire TV Stick can do.", "verified": true, "helpfulness": "6/6", "author": "DLH"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "1/1", "author": "ty"}, {"rating": 5.0, "review": "It's truly an amazing product!!!  We like it better than Apple TV or Google Chromecast", "verified": true, "helpfulness": "1/1", "author": "R. Perry"}]