[{"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "patches"}, {"rating": 3.0, "review": "It's nice when it is working! It is a great price!  I find it pretty difficult to figure out what is wrong with it when it goes out. The Amazon prime is awesome, I give that 5 stars! It was very easy to install, just plug it into your HDMI port and plug in the power source. The Pluto channel has great streaming video channels but they skip a lot during prime watching hours, other than that they will show really good. I also got the fire box and that works great no skipping or lags with that at all worth the price for the box? The game controller was not worth it to me at all , I think I will return that.", "verified": true, "helpfulness": "0/0", "author": "Real Thoughts"}, {"rating": 3.0, "review": "everything except amazon prime video used to buffer a lot and was not viewable and so i had to return it. otherwise easy to set up, and the remote also works fine. but problems with netflix and youtube constantly buffering, i returned it.", "verified": true, "helpfulness": "0/0", "author": "Nasty123"}, {"rating": 5.0, "review": "Perfect. Works greatNo complaints", "verified": true, "helpfulness": "0/0", "author": "Monica Gonzales"}, {"rating": 1.0, "review": "Smart TV does not link with your name and private info. But Fire stick will know every thing you do through fire stick. Include watch XXX moves and search for make bomb. I did not know this until I notice Amazon send Email to me ask feedback.", "verified": true, "helpfulness": "0/0", "author": "well known \"star\""}, {"rating": 1.0, "review": "IT TRIES TO BILL ME FOR THINGS I DID NOT  ORDER-SAYS I VIEWED THINGS I DIDN'T VIEW !!! I DO NOT WANT ANYTHING TO DO WITH AMAZON!!!!", "verified": true, "helpfulness": "0/0", "author": "James Finch"}, {"rating": 4.0, "review": "I use this everyday because it's easy to watch netflix and amazon instant video on my TV.  I just don't understand why I have to plug it into the power outlet and the TV at the same time.  I also love the feature that I can control it with my cellphone.", "verified": true, "helpfulness": "0/0", "author": "dunzo"}, {"rating": 2.0, "review": "Was given as a gift, person it was given to said it worked", "verified": true, "helpfulness": "0/0", "author": "Rigby"}, {"rating": 5.0, "review": "Love it. Great job Amazon", "verified": true, "helpfulness": "0/0", "author": "Richard Dickerson"}, {"rating": 2.0, "review": "Freezes up frequently even on a 5ghz n wireless connection to a 300 MBPS download line. Other than that, not a bad device.  Keep in mind, however, that the interface is completely geared towards serving up Amazon content.", "verified": true, "helpfulness": "0/0", "author": "BrooklynNineNine"}]