[{"rating": 5.0, "review": "Easy set up...easy to use. glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "k. play"}, {"rating": 5.0, "review": "We love it! It's so easy to love from TV to TV and its small which is the best part no more annoying box :)", "verified": true, "helpfulness": "0/0", "author": "Jenna Fidler"}, {"rating": 3.0, "review": "Slow to connect but OK. For the money it was an ok deal.", "verified": true, "helpfulness": "0/2", "author": "Sarah"}, {"rating": 5.0, "review": "I got this for only $20 during its introductory launch. However, even at its current price it is a worthwhile investment for subscribers of Amazon Prime.This is an Amazing addition to watch included and additional premium content. The Interface is as nice as Apple TVs and the device is compatible with my Logitech Harmony Smart Control so although I don't use its remote, its decent and as functional as Apple TVs.I have watched several movies already and I must say the streaming quality is excellent: 1080p and HD audio. My only 2 complaints are not really about this device but:1) As far as Amazon rental/purchase pricing goes, is that it seems that taxes for this content is well in excess of 10%2) Not 100% of the available content has Previews or is available to watch using this dongle", "verified": true, "helpfulness": "0/0", "author": "Edward Milgram"}, {"rating": 5.0, "review": "i love this thing", "verified": true, "helpfulness": "0/0", "author": "drew"}, {"rating": 5.0, "review": "Love it.  Very cool.", "verified": true, "helpfulness": "0/0", "author": "Mitch Lauer"}, {"rating": 4.0, "review": "Great device, easy to install, works as described, does require to be powered by an AC wall outlet", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 3.0, "review": "I expected more free movies even after I purchased amazon prime. Some of the \"for rent movies are free on Netflix, and most are cheaper at red box.", "verified": true, "helpfulness": "0/1", "author": "Harry Williams"}, {"rating": 5.0, "review": "Works just awesome!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gordon J. Dubs"}, {"rating": 1.0, "review": "I bought this to stream netflix", "verified": true, "helpfulness": "1/6", "author": "DaisyRoscoeSam"}]