[{"rating": 1.0, "review": "Do yourself a favor and get a Roku Stick if you want something even remotely resembling a functioning streaming stick. The interface is slow and clunky, and the hardware is crippled by connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "Nick LaFazia"}, {"rating": 5.0, "review": "easy and cheap to watch tv.thanks", "verified": true, "helpfulness": "0/0", "author": "karen garrett"}, {"rating": 5.0, "review": "AWESOME, AWESOME, AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "lovesbooks \"MLK\""}, {"rating": 5.0, "review": "This item took a while to get, because it is so popular, and I see why.  I cancelled cable, and love SLING TV.  This product is awesome as apparently so many others think so too.  From an older customer who has difficulty transitioning to new things, BUT THIS IS AN AWESOME PRODUCT!", "verified": true, "helpfulness": "0/0", "author": "sylvia j elerick"}, {"rating": 4.0, "review": "I've only use this once, but it was a simple device to use.", "verified": true, "helpfulness": "0/0", "author": "Starlet"}, {"rating": 5.0, "review": "Best investment I ever made!!! COMCAST ,DIRECT TV...DISH...KILL YOURSELF!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "luckner moise"}, {"rating": 5.0, "review": "Love the interface. Very easy to hook up and get running. I would recommend it to a friend. Just goes with Prime.", "verified": true, "helpfulness": "0/0", "author": "Char"}, {"rating": 5.0, "review": "I had read many reviews before purchasing Fire TV Stick.  I knew what to expect and this product works just as Well as expected it to.", "verified": true, "helpfulness": "0/0", "author": "Pat Bennett \"master shopper\""}, {"rating": 4.0, "review": "I like the movies offered by Amazon Prime because they  have a great variety.  I wish the offered more choices than Netflix.I wish on the music they would offer Southern Gospel Music.  Love how things are catagorized.", "verified": true, "helpfulness": "0/0", "author": "Alan George"}, {"rating": 5.0, "review": "It worked perfectly. I even started to brag about it with my friends, it is absolutely amazing. I never thought the FireTV stick could do that many things that no other company has accomplished on the TV.", "verified": true, "helpfulness": "0/0", "author": "Ayanna Causey"}]