[{"rating": 3.0, "review": "Slightly disappointing but might be the right device depending on how you plan to use it. This was my second Fire TV stick that I ordered in addition to the more powerful Fire TV (the box). While the larger Fire TV device is, basically flawless in terms of it's performance, the stick can't quite live up to the same standard. Basic services like Amazon Prime Video and Netflix work perfectly fine but the device seems to get bogged down over time after using several different application (especially Plex). The wifi connection also seems to be a bit flaky. Every once in a while the Fire TV stick refuses to connect to the network and the device requires a restart (hold down the center and play buttons at the same time). The miracast feature is also pretty much worthless to me since neither one of laptops (high end Dell XPSs) is actually able to establish a connection with the device. I would like to note that my router is a Netgear Nighthawk, which has been absolutely flawless in terms of performance and has never given me any connection problems with my devices. At this point I ordered another Fire TV (the box) to replace the stick used in my main home theater. I am keeping one of the Fire TV sticks to be used in the bedroom TV where performance is not as much of a factor.Small issues with the Amazon app ecosystem in general:-No dedicated Vudu app (and using flixster results in severely degraded video quality which makes the service kind of worthless).-Amazon Music seems to be poorly integrated. If you want to see your new playlists and albums you have to sync the device every time. Also, all of the playlists and music albums have to first be added to your account on another device since there doesn't seem to be an option for it on the Fire TV itself.Side note to Amazon:I think the wifi/performance problems might be related to the device simply overheating. Plex streaming really seems to stress the device and causes it to become genuinely hot to the touch resulting in a lot of lag and generally weird behavior.Summary:This can be a great and fairly cheap solution to bringing streaming services to all of the televisions in the household as long as you recognize its limitations.", "verified": true, "helpfulness": "1/1", "author": "Alex"}, {"rating": 5.0, "review": "Excellent device.  Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 4.0, "review": "It is great for teens, but wish it had more games campatable for the main remote without getting game controller.", "verified": true, "helpfulness": "0/0", "author": "KT Gaunt"}, {"rating": 5.0, "review": "Easy to connect, instructions were very clear. I am not a techno geek, but I hooked the Fire TV up myself. We have used it a few times for a movie, music . No problems, it is quick, picture is perfect. We like it.", "verified": true, "helpfulness": "0/0", "author": "Bernie R"}, {"rating": 3.0, "review": "Not many good options of things to watch for free on prime and I don't like that this needs to be connected to a power source.  Really that it would be more simple of unplugging and going", "verified": true, "helpfulness": "0/0", "author": "Jennifer A."}, {"rating": 2.0, "review": "I've been playing with the new Fire TV Stick for a couple of days now, comparing it mostly to the Roku Player and my Blue Ray player that has Hulu and Netflix and Pandora on it. The interface is nice, it seems well built, but overall I'm less than impressed. I got this free with a three month subscription to Sling TV.  My Thoughts:The good:-Cool little remote, which is easy to use-Featured Amazon Prime content is really nice-Good selection of apps available from the startThe bad:-Wifi tends to drop on occasion-Someone decided it would be a good idea to put the USB port that powers the device on the side of the stick instead of at the end like every other device I've used. This takes up alot of space when you have several things plugged into the TV  :(-Netflix and Hulu Plus app tend to stutter on occasion - I thought initially it was a networking problem but no other devices have this problem.  Last night I had to switch from the Fire Stick back to my blue ray player just to play Netflix and HuluThe ugly:-Amazon Prime Video playback is horrible. It stutters, for me.  This was the main reason I got the Fire Stick was to play movies from Prime-I haven't even been able to get Sling set up on the stick yet.  This is beginning to look like a huge waste of money for me-  guess I will see what happened when I get home and try to work with it some more.", "verified": true, "helpfulness": "0/0", "author": "Kandi Rae Gaus"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "louis morgan"}, {"rating": 5.0, "review": "Met all my expectations and more. I am now able to watch Netflix as it was meant  to be watched.", "verified": true, "helpfulness": "0/0", "author": "PracMike"}, {"rating": 5.0, "review": "Works way faster than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Deborah R. Edwards \"Hischild\""}, {"rating": 5.0, "review": "With SlingTV and Kodi, it's been a good cable TV replacement.", "verified": true, "helpfulness": "0/0", "author": "jasonc"}]