[{"rating": 5.0, "review": "great deal Kill the cable", "verified": true, "helpfulness": "0/0", "author": "Rochelle Charette"}, {"rating": 2.0, "review": "You have to buy just about all the movies, cheaper through my computer....\"Access to 200, 000 movies\"  prices are ridiculous.....anybody want to buy a \"firestick\" in the mud :-(", "verified": true, "helpfulness": "0/0", "author": "fjmtz"}, {"rating": 4.0, "review": "Love yhe stick, it is easy to use, but it is best used with an unlimited internet connection, It blows through your data like crazy in the 2 days I have used it I have used 10 GB. So buyer beware, I tried researching how the stick would affect my data usage and found nothing, well here it is if you shoul be wondering just no good with a limited data plan.", "verified": true, "helpfulness": "0/0", "author": "michelle mcquinn"}, {"rating": 5.0, "review": "Love it  it's great", "verified": true, "helpfulness": "0/0", "author": "Rosario Roccasalvo"}, {"rating": 5.0, "review": "Loving it..will order more for Christmas presents.....", "verified": true, "helpfulness": "0/0", "author": "wanda warrior"}, {"rating": 5.0, "review": "I don't have a smart tv. This allows me to watch youtube and it continuously plays videos similar to what I enjoy. Just a heads up, youtube plays ads for about 30 seconds after a few video watches.The other features are awesome as well.Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "The Graduate Student \"Be kind, caring, loving, empathetic, and genuine to your customers. This is where success lies.\""}, {"rating": 1.0, "review": "I've owned the Apple TV for some time now. I was disappointed that rumours of apps and games never came to fruition, but the full price Fire TV wasn't compelling enough to upgrade.When the Fire TV Stick was offered for $19, I leaped as I thought this was my in. Alas, even at $39, you aren't getting any kind of deal. Here's why:1. Everything is very, very cheaply constructed. The remote creaks and distorts under normal usage, which you might write off as it's a free remote with a cheap streaming box, but the game controller - an additional $50-60 purchase - is just as cheaply made. Amazon do not care about hardware quality.2. You will notice how cheap the remote is because you will be using it a lot to navigate the software's confusing menu system. The Apple TV may not have the apps and games, but it is way less confusing to navigate and behaves in logical ways. Voice search eases this, but you either have to buy an extra, enhanced remote with the feature, or use an app on a phone or tablet.3. 99% of the games are terrible. Besides (25+ year old games featuring) Sonic The Hedgehog, it is mostly cheap crapware knocked out by a sub-par hobbyist in his basement.4. 99% of the apps are terrible, and because Amazon quite clearly favour their own Prime ecosystem, they're harder to use than they need be. On Apple TV, Hulu Plus and Netflix and all the other alternative video services get equal billing with the iTunes store fronts.I really can't recommend this device. If you are all in with Prime Video and Music, get the regular Fire TV. But only if. The Roku range and Apple TV are otherwise vastly superior.", "verified": true, "helpfulness": "1/1", "author": "eatyrGhost"}, {"rating": 5.0, "review": "The Amazon fire stick is amazing I recommend it to anyone!!!!", "verified": true, "helpfulness": "0/0", "author": "Hassan"}, {"rating": 5.0, "review": "A very enjoyable way to watch tv!", "verified": true, "helpfulness": "0/0", "author": "Lopez"}, {"rating": 3.0, "review": "Whether a fault of the OS or the Apps, the apps seems to crash more often than I'd like. Otherwise this would be the best streaming stick on the market.", "verified": true, "helpfulness": "0/0", "author": "Andrew Rice"}]