[{"rating": 4.0, "review": "I'd probably rate it at a 3.5 or maybe 3.75 if I could.  This is because though I like the Fire Stick a lot and am impressed with how many channels it pulls in, I don't like the it seems to freeze up or buffer quite a bit.  Sometimes I have to go back and select Sling again in order to keep watching a tv show which is frustrating.  Not sure what the problem is.  One other little problem is that I can't have both my Chromecast and Fire Stick connected to two different HDMI ports at once.  I have a 50\" Samsung smart tv on which the Chromecast worked fine before I got the Fire Stick.  I've spoken with Samsung tech. support and they have no idea what the problems is....", "verified": true, "helpfulness": "0/0", "author": "Gary Wayne Smith"}, {"rating": 5.0, "review": "Easy to use. Small but perfect. Easy to hook up. I have used it regularly now and I am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Babs \"BJH\""}, {"rating": 5.0, "review": "I just received my stick and hooked it up. It was very simple to do. The only thing that I have used it for is netflix. I am very pleased with it. I am now considering getting amazon prime it looks like a pretty good deal.", "verified": true, "helpfulness": "0/0", "author": "miket"}, {"rating": 5.0, "review": "The best value of Set top box device on the market! It uses same Android 4.x system as Fire TV, so you can easily enable adb debug option and using adbfire to connect to it and loads tons of apk apps that designed for TV, fantastic!!! Can't explain how much I love it.", "verified": false, "helpfulness": "0/0", "author": "Michael Jones"}, {"rating": 5.0, "review": "Love it highly recomment", "verified": true, "helpfulness": "0/0", "author": "Son Phan \"SON -P\""}, {"rating": 5.0, "review": "Excellent.  Can't believe how fast and convenient this is to use.  Easy set up, intuitive navigation, and exceptional picture quality.  A real bargain for 39.99!", "verified": true, "helpfulness": "0/0", "author": "B. Baker"}, {"rating": 5.0, "review": "Love it. I can now use my Netflix, Hulu and WWE accounts without having to unplug the kids Xbox to do it. Easy to set up and easy to use, plus very affordable.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Soto Deon"}, {"rating": 5.0, "review": "This replaced my Chromecast. Much better investment.", "verified": true, "helpfulness": "0/0", "author": "MB"}, {"rating": 4.0, "review": "The Fire Tv stick works great!", "verified": true, "helpfulness": "0/0", "author": "macadoodle \"macadoodle\""}, {"rating": 5.0, "review": "Good,but sling buffs quite a bit so kind of optimistic about subscribing, other than that,good product and price is reasonable.", "verified": true, "helpfulness": "0/0", "author": "Edward Jacobs"}]