[{"rating": 5.0, "review": "Having got the Fire TV Stick on the 19.99 deal through Prime, I was a little worried that the first iteration might struggle, but I was wrong. My Fire TV stick works really wonderfully, and I can't think of any issues I've had that were the fault of the hardware (the Hulu app seems to struggle but it is not an issue of the hardware). This is a great option for anyone looking to stream media to their tv.", "verified": true, "helpfulness": "1/1", "author": "Swalla"}, {"rating": 5.0, "review": "Great unit for the price and takes less than 5 minutes to install and have up and running. Couldn't ask for easier!!!", "verified": true, "helpfulness": "1/1", "author": "Mike Franqueiro"}, {"rating": 5.0, "review": "So easy!! Great technology!!!", "verified": true, "helpfulness": "1/1", "author": "Carrie L Dickson"}, {"rating": 1.0, "review": "it doesnt have my provider on it which i have h2o bolt i can not use it to its full ability", "verified": true, "helpfulness": "1/1", "author": "Amber Mason"}, {"rating": 5.0, "review": "Easy to set up and worked per the spec", "verified": true, "helpfulness": "1/1", "author": "Howard"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "1/1", "author": "Dion"}, {"rating": 5.0, "review": "Love this.  We just started to tap into it's potential, but so far it is great.  We also signed up for Amazon Prime which has allowed us to dump our Dish premium channels.  It is so easy to operate right out of the box.  Thanks Amazon for a product that even a low level techie can use", "verified": true, "helpfulness": "2/2", "author": "reggie6"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "1/1", "author": "Cypress Angels"}, {"rating": 4.0, "review": "I love this fire stick but it my HBO go won't work.  I have xfinity and the HBO Go will not activate online.  super sad about it.  :(", "verified": true, "helpfulness": "1/1", "author": "Yvette C Marentes"}]