[{"rating": 5.0, "review": "Anybody playing Clash of Clans? This is really amazing! Visit [...] It really works! (Gcb4v)Fire tv stick is great! Love it.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The sound is CRAPPY for music, but I'll figure out my next move for that.  Otherwise I LOVE IT I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Julie Lorenzo"}, {"rating": 2.0, "review": "Ties in very well to Amazon Video and app store.  However, no Vudu App and no Time Warner TV app limit it's appeal.Replaced this with Roku Stick, which has both and moved the Fire Stick to a not used very often TV.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "I WISH IT WOULD FIT MY AMAZON FIRE TABLET.", "verified": true, "helpfulness": "0/0", "author": "Fred Piraro"}, {"rating": 1.0, "review": "I recently got a free Fire Stick with my subscription with Sling TV. I figured it would be a good way to stream entertainment in my bedroom, I have a PS3 in the living room, but I'm sorely disappointed. The Fire Stick is slow, logs off my internet randomly, and refuses to play my MLB.TV app (it pauses every two seconds then quits). MLB.TV works perfectly on my PS3 in my living room which is literally 15 feet away, so I know it's not a problem with my internet speed. So far I'm not a fan of this product. I'm just glad it was free, I just wish I opted for the free Roku Stick instead. My father has two Rokus and has never had a problem with either of them.", "verified": true, "helpfulness": "1/1", "author": "gmax86"}, {"rating": 1.0, "review": "Loses Internet connection about every 2 minutes. Verified it is not my Internet or router issue and had cable company come test everything. Will be returning. Huge disappointment, was my only mothers day gift for my first mothers day and doesn't even work", "verified": true, "helpfulness": "2/2", "author": "Jennifer"}, {"rating": 5.0, "review": "awesome device and surprising what it is capable of......  love it!", "verified": true, "helpfulness": "0/0", "author": "Don Popejoy"}, {"rating": 5.0, "review": "Works great easy to connect and navigate through the menu", "verified": true, "helpfulness": "1/1", "author": "joshua"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Senovio Canales"}, {"rating": 3.0, "review": "Doesn't work with our old TV - bummer!", "verified": true, "helpfulness": "0/0", "author": "Lori & Ted Irwin"}]