[{"rating": 5.0, "review": "Very impressed with the fire stick. Performance is better than Roku (I own earlier and later sold on Craigslist). Dishworld app used to buffer every 2 mins in Roku, however SlingTV works perfectly in firestick.", "verified": true, "helpfulness": "0/0", "author": "Advanx"}, {"rating": 5.0, "review": "Just fine!", "verified": true, "helpfulness": "0/0", "author": "Norman Ballard"}, {"rating": 4.0, "review": "It's works well, better then expected. I'm very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "ALAN"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick! It was so easy to \"install\" and get started. I have just started using it and as stated, I do love it and if enough shows and movies are on it, (after more investigation), I may be able to give up cable and DirecTV and that would make it the ultimate product!", "verified": true, "helpfulness": "0/0", "author": "Kristi Brown \"kbb\""}, {"rating": 5.0, "review": "Love it. And super easy to hookup. Think I will buy another one for my second TV.", "verified": true, "helpfulness": "0/0", "author": "Danette Bench"}, {"rating": 4.0, "review": "Started great but lately it takes a lot of buffering. I don't know if the stick or my internet access.", "verified": true, "helpfulness": "0/0", "author": "Melinda L Martinez"}, {"rating": 5.0, "review": "Send reminder of charge", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"G. Prince\""}, {"rating": 5.0, "review": "We needed a way to watch netflix in our bedroom and this is awesome! It is very fast and easy to use! Amazon never disappoints :)", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 3.0, "review": "We enjoy all that the stick has to offer. My only complaint is even though my wifi is 100% and showing as connected  the stick would not be logged in and we would not be able to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Bessy Martinez"}, {"rating": 5.0, "review": "We have two of them and they work beautifully.  We watch Amazon,  Netflix as well as others.", "verified": true, "helpfulness": "0/0", "author": "Jeri Gannon"}]