[{"rating": 5.0, "review": "I like it. It's cheaper, have most of the apps I use. But typing is real pain even with Fire App.", "verified": true, "helpfulness": "0/0", "author": "shiva"}, {"rating": 5.0, "review": "Bye bye cable", "verified": true, "helpfulness": "0/0", "author": "Dantepewter \"dantepewter\""}, {"rating": 3.0, "review": "Had some issues with freezing but in general a decent product.", "verified": true, "helpfulness": "0/0", "author": "outermind"}, {"rating": 3.0, "review": "You tube freezes a lot. Netflix works good. 70% satisfied", "verified": true, "helpfulness": "0/0", "author": "Virginia"}, {"rating": 3.0, "review": "Really love the concept.  Really love the idea of getting just the channels I want without having to pay for cable bundles of which I don't watch nearly 90% of.  I do not like the constant \"catching up\" and \"buffering\".  However, for the most part, I am still glad I purchased the fire stick.", "verified": true, "helpfulness": "1/1", "author": "Wendy Christian \"Wendy Christian\""}, {"rating": 4.0, "review": "I've had this for about a month and works well. Just make sure you have a good modem/router and high speed internet", "verified": true, "helpfulness": "1/1", "author": "Edgar Gonzalez"}, {"rating": 5.0, "review": "We purchased this about 2 months ago. Works great with our wifi. Runs smooth with no problems.", "verified": true, "helpfulness": "0/0", "author": "TBal"}, {"rating": 5.0, "review": "I first bought the Roku stick, the remote never worked correctly, so I returned it & got the Fire Stick. I am 100% satisfied.", "verified": true, "helpfulness": "0/0", "author": "Paige Davus"}, {"rating": 3.0, "review": "I can't stream a movie from my PC to the TV using Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "George M Eppler"}, {"rating": 5.0, "review": "love the fire tv stick. I have the chrome cast and i got this for my girlfriend. The chromecast allows you to cast items from your PC or phone to your tv, but it doesnt come close to beating the interface that the fire stick provides and the ease of the remote. Recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "danieldnmcnmr"}]