[{"rating": 5.0, "review": "Bought as a Christmas gift from Staples  ($24 & TAX ) for my son and his wife.  They just love it ,  So far has worked as expected.  Amazon continues to provide great products.", "verified": false, "helpfulness": "0/0", "author": "Randy Brantner"}, {"rating": 3.0, "review": "It works for Amazon Prime, but I had connection issues with Netflix and Hulu - It freezes in the middle of the shows and I have to restart it.  Changed the position of the stick to another HDMI connection ( fund the second one on my TV!)  and it seems that it is doing better.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "This device is very simple to operate and the video screen is very well organized.  This is well worth the money", "verified": true, "helpfulness": "0/0", "author": "Benny"}, {"rating": 5.0, "review": "A great way to access Amazon and Netflix on a television we rarely used....until now.", "verified": true, "helpfulness": "0/0", "author": "Runner Girl"}, {"rating": 3.0, "review": "never was able to get espn", "verified": true, "helpfulness": "0/0", "author": "anne j cooper"}, {"rating": 3.0, "review": "Remote doesn't work very well. I think I would get a roku instead.", "verified": true, "helpfulness": "0/0", "author": "Nathan Porter"}, {"rating": 5.0, "review": "love it !!! Very easy  to install.", "verified": true, "helpfulness": "0/1", "author": "jacstew2"}, {"rating": 4.0, "review": "Worked as described.  The picture doesn't really show it but you still need to plug the stick into the wall.", "verified": true, "helpfulness": "1/1", "author": "dan b"}, {"rating": 2.0, "review": "The ads did not indicate that the unit had to be plugged into an electrical outlet after inserting into the TV HD slot.  Additionally, I expected the unit would have all of the programs that the desktop unit had, including NETFLIX.", "verified": true, "helpfulness": "0/0", "author": "elesef"}, {"rating": 5.0, "review": "Love this! Turned out to be perfect. I have both this and the Amazon TV box and would get this again because it's the same but cheaper", "verified": true, "helpfulness": "0/0", "author": "Chris Lesner"}]