[{"rating": 4.0, "review": "great little gadget.", "verified": true, "helpfulness": "0/0", "author": "Rose O'Keefe"}, {"rating": 5.0, "review": "Still learning to use it, but so far it seems GREAT.  Very good picture quality.", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 5.0, "review": "GREATEST TV EVER", "verified": true, "helpfulness": "0/0", "author": "Carla LaMont"}, {"rating": 5.0, "review": "I ordered this product and it took about a month to get it.  With that said I am very pleased with the Fire TV Stick.  This stick turns the TV into a smart  TV.  As an Amazon Prime member it is nice to be able to watch movies for free without going through another device.", "verified": true, "helpfulness": "0/0", "author": "Retired"}, {"rating": 5.0, "review": "👍 great love it", "verified": true, "helpfulness": "0/0", "author": "Joseph Fritz"}, {"rating": 5.0, "review": "Love to able to use YouTube and Netflix", "verified": true, "helpfulness": "0/0", "author": "Abdiel Torres"}, {"rating": 2.0, "review": "Not real impressed with this item, it won't stay connected to WiFi.", "verified": true, "helpfulness": "1/1", "author": "M. Alexander"}, {"rating": 3.0, "review": "Easy navigation. Problems:  Very hard to get remote open to put batteries in.  Cannot leave power on to stick as it interferes with the digital TV signal for over the air channels.", "verified": true, "helpfulness": "0/0", "author": "James Coggeshall"}, {"rating": 5.0, "review": "I bought this when it came out at the introductory price and waited because it was back ordered. I had almost forgotten about it and then it was here. Very simple to hook up (you do need to plug it in) and it was already signed in to my Amazon.com account. It works great, the picture quality is super and it works seamlessly with my prime account. Easy to access Netflix, YouTube and all the other services /apps. The remote is a nice addition and it works very well despite looking so simple. I would highly recommend the fire stick to anyone.", "verified": true, "helpfulness": "0/0", "author": "c smith"}, {"rating": 3.0, "review": "The device itself is friendly with an easy to navigate interface. What is disappointing is the amount of Apps available for Fire TV.  If Amazon and the major TV networks can't reach an agreement to include their Apps, I don't believe this technology will last long.", "verified": true, "helpfulness": "0/0", "author": "Michael"}]