[{"rating": 5.0, "review": "About sis months ago our Logitech Review simply stopped working after three years.  I was using my DVD player's klutzy Netflix app that had buffering issues. during heavy traffic periods.  The stick?  No issues at all, even on Saturday nights and Sunday afternoons.  I can access all my Amazon content whenever I want.", "verified": true, "helpfulness": "0/0", "author": "John D. Beatty"}, {"rating": 1.0, "review": "Miracast is garbage, and the only reason I purchased it was for miracast.", "verified": true, "helpfulness": "0/1", "author": "Sergio Gutierrez"}, {"rating": 5.0, "review": "Very easy to use. Combined with Amazon prime, there is more to watch then I can get through in a lifetime.", "verified": true, "helpfulness": "0/0", "author": "LINDA \"NutLover\""}, {"rating": 3.0, "review": "Love it but doesn't connect to my iPhone to be used as remote....super sad!", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 3.0, "review": "App selection is lacking. Casting is a headache and you can only cast certain things. Need separate game controller for games.", "verified": true, "helpfulness": "0/0", "author": "Robert Napper"}, {"rating": 5.0, "review": "Works with no problem and give great picture quality. A must have!", "verified": true, "helpfulness": "0/0", "author": "Luis rosado"}, {"rating": 4.0, "review": "When connected  directly into my smart TV (Samsung) it had trouble connecting to my network and could not find amazon.com.even though TV works fine as do other devices in this high level wi-fi.Connected it through an hdmi cable to get the stick away from the TV and it works GREAT....got better picture than through the cable system.", "verified": true, "helpfulness": "0/0", "author": "Maurice A. Henry"}, {"rating": 3.0, "review": "Demand stimulated by advertising, but not available in two days through Amazon Prime.  Should not advertise the item if it isn't immediately available.  Not up to Amazon Prime standards...", "verified": true, "helpfulness": "0/0", "author": "R.B.L."}, {"rating": 3.0, "review": "Bad power plug design. takes up 2 spots....I thought tech designers had figured out how silly that is long ago. Wifi reception not the greatest, as other devices nearby never lose connection. Paused during the first movie, several times. It even came up with a \"connection too slow\" alert during the movie. This was watching a Prime movie. I have a 20MB/s connection, and have no other issues in the same room.Dolby output level is much lower than my other devices, with no way to control it. If you aren't careful, when you switch back to another source, you may blast yourself with high volume.Clunky UI, so I may not use it until more bugs get worked out.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "Love this item so worth the money. Turns your normal TV into a Smart TV!! Like a Roku but cheaper, and for me I love amazon and it has the prime TV stuff right on the stick. You can also download Netflix, Hulu, Pandora, or anything else to watch TV/movies. It's super easy to hook up and really convenient! There is even an app that you can download and use as a remote is you lose your!", "verified": true, "helpfulness": "0/0", "author": "Charisse"}]