[{"rating": 4.0, "review": "I have used this for about a month.  Overall, I am very pleased. It is very easy to navigate through the menu. Easy to add Pandora and Hulu. The wifi works very well. Makes my Netflix and Pandora accounts stream much better than they did through my blu ray player. My displeasure is in the length of the charger's cord (it is not long enough to be concealed behind my cord keeper on my wall), and there seems to be an issue with the Hulu app that no one wants to fix. The Hulu app has a black screen after commercials (audio but no video) and the video freezes frequently yet the audio keeps playing. I did take Amazon Prime and I am 50-50 on it. I find that several movies that I have already viewed through my Netflix, have to be rented on Prime. I don't understand this. I am paying for a service through both, but actually believe that Netflix offers more than Prime without further charge. There are no older TV series on Prime (except I Love Lucy, and I would like to see 70's, 80's).  Well, I suppose I should say no free TV series. Lots that you can rent. So far, I like Netflix better in that respect.  I do like the ease of renting on Prime, however.  Time will tell as to whether or not I continue Prime. If you have an older blu ray player and want some of the newer apps to stream, I would recommend the Fire Stick.", "verified": true, "helpfulness": "1/1", "author": "Gutsy Grandma"}, {"rating": 5.0, "review": "Love it.  Nothing to do but plug it in, log in to wi fi.  Would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Paul Morrison"}, {"rating": 5.0, "review": "No problems so far and very handy", "verified": true, "helpfulness": "0/0", "author": "Tyler Bridges"}, {"rating": 5.0, "review": "It is awesome! !", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Get sling tv and a satellite. Boom you just cut your cable bill and get espn espn2 and espn3", "verified": true, "helpfulness": "0/0", "author": "Chris Roff"}, {"rating": 5.0, "review": "I am having a ball seeing shows I miss, I love the no commercials aspect!", "verified": true, "helpfulness": "0/0", "author": "Charlene Christopher"}, {"rating": 5.0, "review": "This little thing is awesome. Netflix, amazon movies, YouTube, apps etc. Turns any TV into a smart TV. I was contemplating getting cable in our warehouse, but this thing does way more than cable, all you need in an internet connection and boom. Very pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "Jordi D Herrera"}, {"rating": 5.0, "review": "I am currently on bedrest and this has been a lifesaver for me!  I can plug it into any TV in the house with an HDMI port and it streams quickly.  I am an Amazon prime customer so all my music is available also.  I also belong to Netflix and can watch movies and TV shows straight from the app.  All you have to do is download it...takes just a few seconds.  The remote is easy to use and I even downloaded the remote app for the Iphone.  When I use my Iphone I also have the option to give voice commands.  All in all... great product and well worth the money! I can't believe I didn't try this sooner.", "verified": true, "helpfulness": "2/2", "author": "NickyC"}, {"rating": 4.0, "review": "Wish it had HBO now. And the app does not work well but great viewing quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great When Kodi is Installed!!!", "verified": true, "helpfulness": "0/0", "author": "Alejandro Contreras"}]