[{"rating": 5.0, "review": "Works just like our Fire TV. Ordered one for each bedroom so we can watch upstairs now as well as downstairs", "verified": true, "helpfulness": "0/0", "author": "Musicfan \"Musicfan\""}, {"rating": 5.0, "review": "Very easy to set up and use. Very impressed.", "verified": true, "helpfulness": "0/0", "author": "Kathie A. Christensen"}, {"rating": 5.0, "review": "I love how easy it is to use!", "verified": true, "helpfulness": "0/0", "author": "JAIME TORRES"}, {"rating": 5.0, "review": "Excellent!  Easy to use", "verified": true, "helpfulness": "0/0", "author": "CLIFFORD WARRICK"}, {"rating": 5.0, "review": "Great section. Should hVe done this long ago", "verified": true, "helpfulness": "0/0", "author": "Stanley Rauwerdink"}, {"rating": 2.0, "review": "Not worth it, all the good shows require an extra fee to watch them. Nothing is really free.", "verified": true, "helpfulness": "0/0", "author": "H G Keller"}, {"rating": 5.0, "review": "So much faster than anything I have used before and very intuitive. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Meagan McConaughey"}, {"rating": 3.0, "review": "Picture quality not good,netflix has alot better picture. and when using the remote it will stick on a position when trying to scroll through selection's.Not to impressed", "verified": true, "helpfulness": "0/0", "author": "suzukisamari"}, {"rating": 4.0, "review": "It was what I expected and I am very pleased with FIRE STICK", "verified": true, "helpfulness": "0/0", "author": "Neal Kludy"}, {"rating": 4.0, "review": "I love the idea I can use this on any USB PORT television in my house... It is similar to s smart tv ... My experience overall I really like it it ... It seems that the movies sometimes goes through of loading periods even with a great connection to WIFI . I would recommend this to a friend but warn him of this before buying ... I have watched several movies and it does not go through the interruptions on every movie but it has on more than a few movies. On some televisions the screen to choose moovie is sometime partially cut off and you do not see the entire menu .", "verified": true, "helpfulness": "0/0", "author": "Frequent shopper"}]