[{"rating": 5.0, "review": "For as long as I had to wait to get this item, it sure has been worth it so far. Way better than the Chromecast that I chucked out the back door after a month. Setup was a snap, took maybe 5 mins. I hardly ever have issues with the need to buffer videos or movies and the HD quality is MIGHTY IMPRESSIVE!! The remote is small and easily fits in my hand; buttons are intuitive and easy to remember. THE ONLY thing that I would change is the search functionality. When searching for movies and such, if you click on a found title, then go back to search, I'd like for it to remember what I had typed in their previously so I don't have to retype everything again.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "This is an amazing piece of technology. I have a smart TV, an Apple TV and 2 Fire TV Sticks. Set-up was more than easy, and accessing apps is a breeze. I would highly recommend the Amazon Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Judy A Ascenzi \"Judy A\""}, {"rating": 5.0, "review": "I absolutely love it! Best Christmas present. The only thing is I can't wait to be able to stream my HBO GO through it.  It's so fast and the picture quality is beautiful. Super happy.", "verified": true, "helpfulness": "0/0", "author": "leslie sopher"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Donald Russ"}, {"rating": 5.0, "review": "Love the stick!!  Makes TV's that I don't have cable hooked up to a complete entertainment center!!  Will be buying more for other tv's in my house that don't have cable.!!", "verified": true, "helpfulness": "0/0", "author": "Stacey K."}, {"rating": 5.0, "review": "Neat little device!", "verified": true, "helpfulness": "0/0", "author": "Michael M. Broadway"}, {"rating": 5.0, "review": "Works Great. Just as described.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "being used every day!!", "verified": true, "helpfulness": "0/0", "author": "Kieno"}, {"rating": 4.0, "review": "I'm not tech savvy but this is very easy to use", "verified": true, "helpfulness": "0/0", "author": "2for the show"}, {"rating": 5.0, "review": "Very well made and love the remote that comes with it; I love it!!", "verified": true, "helpfulness": "0/0", "author": "Lunagirl \"T\""}]