[{"rating": 5.0, "review": "Great I like the portability to be able to move from TV to TV", "verified": true, "helpfulness": "0/0", "author": "jwesleyj"}, {"rating": 3.0, "review": "I like the convenience of being able to access netflix, amazon videos, watch espn, etc.  I have to have it plugged into the wall at all times to use it, which was not expected.  I thought it would just be a stick that plugs into the HDMI slot that can be moved between tvs with ease and no cords.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "This is easy to set up and quite intuitive to operate. We will enjoy using it, particularly with the Prime subscription and all the movies and television series that are available free through Prime.", "verified": true, "helpfulness": "0/0", "author": "C. Reader 1"}, {"rating": 5.0, "review": "Love my new fire stick...it is amazing!!", "verified": true, "helpfulness": "0/0", "author": "Debbie Whetsell"}, {"rating": 4.0, "review": "I was under the impression that being a prime member there would be far more programming that could be watched on instant video at little or no charge but that is not the case.  If you want to watch some of the newer movies in some cases you have to pay as much as $20.00 to view the movies.  My kids do like the TV programming on instant video. I am satisfied with the ease at which you can download and watch movies but feel they need to let you know that you are going to have to pay more than they lead you to believe when they are trying to get you to become a prime member.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "I'm extremely happy with the Amazon Fire TV stick. Very easy setup and simple to use!", "verified": true, "helpfulness": "0/0", "author": "W. McKee, Jr."}, {"rating": 5.0, "review": "This met our needs perfectly!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and works well right out of the box.  Much faster access to Amazon Prime than the WII set up I was using.", "verified": true, "helpfulness": "0/0", "author": "Lou"}, {"rating": 3.0, "review": "Seems to work well. It is easy to use. I was disappointed to find out I couldn't mirror to my tv. I have a Fire HD. You need a Fire HDX. I wish they would have said that before I bought it.", "verified": true, "helpfulness": "0/0", "author": "ge2353"}, {"rating": 4.0, "review": "Finally got it  working, I think.  Very confusing having to use 3 separate remotes to get it going.  Directions could be better is included more detail.  The step of where to find an HTML button, for example was not clear at all.", "verified": true, "helpfulness": "0/0", "author": "Belle"}]