[{"rating": 5.0, "review": "Love it. Its very eady to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Cindy Hendrix"}, {"rating": 3.0, "review": "It needs to frequently be shut down and restarted. This is very inconvenient when in the middle of a show. That said it easy to use and gives a quality picture.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Southard \"scrappergirl\""}, {"rating": 5.0, "review": "It was everything and more than I expected.  VERY Easy to install and the remote is very easy to use - I Love It!", "verified": true, "helpfulness": "0/0", "author": "Sandy Z \"Sandy Zaro\""}, {"rating": 5.0, "review": "Bought a Chromecast a few months ago. Cool concept, but if u are an Amazon Prime member, the Fire Stick is the way to go. Even if you're not a Prime member, it's done right. U can't run Google play on it, but just like the Chromecast, u can mirror from another device, in my case, my Galaxy S5 can cast anything from my phone to the TV through Fire Stick. Love it", "verified": true, "helpfulness": "0/0", "author": "Anderson Sutton"}, {"rating": 5.0, "review": "Very happy with shows and movies available. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "MFG"}, {"rating": 2.0, "review": "Often buffering delays and loosing signal - I have 100MB dowload speed and TV is 1 foot from WiFI.Disappointing - think it has to do with limited memory or processing.  The Amazon Fire Box is much further from Wifi but works fine???", "verified": true, "helpfulness": "0/0", "author": "Brent Hebert"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Haven't had much time to really check out all the features but like what I have used so far.", "verified": true, "helpfulness": "0/0", "author": "Linda Ashby"}, {"rating": 5.0, "review": "worked as promised,however you have to  be sure that tv's need to be manufactured after 2009", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "jasmyn watts"}]