[{"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Glenna Davis"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Bek"}, {"rating": 5.0, "review": "This is my third fire stick! This is a perfect alternative to cable/direct tv for my kids room.  They are able to watch all the kids shows on demand and I save some money at the same time.", "verified": true, "helpfulness": "0/0", "author": "abe"}, {"rating": 5.0, "review": "Very fast! I love itand all the apps you can do on it.", "verified": true, "helpfulness": "0/0", "author": "Allyson Woodard"}, {"rating": 5.0, "review": "Really like this device, similar to Roku, Google TV and others.  But this one is linked to amazon prime", "verified": true, "helpfulness": "0/0", "author": "Dean Kirkpatrick"}, {"rating": 5.0, "review": "if you have amazon prime, this is the way to go!!  EASY to use and understand and the stick makes it cordless!!!", "verified": true, "helpfulness": "0/0", "author": "DG"}, {"rating": 5.0, "review": "Arrived within 2 days thanks to Amazon Prime. I ordered the stick due to the many features of streaming capability. And the Amazon Fire TV Remote app in iOS was a huge selling point. You can do an array of things with the pre loaded items on the stick. However if you want to unleash the full potential of this device you will need to side load Kodi on it. With this you have the entire streaming world at your fingertips. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Tommy"}, {"rating": 5.0, "review": "Great product, great price and quick shipping. We like this much better than Roku", "verified": true, "helpfulness": "0/0", "author": "Stephen C Davis"}, {"rating": 5.0, "review": "Soooooo Easy. Installs in minutes. Works exactly as advertised. Great product.", "verified": true, "helpfulness": "1/1", "author": "Kenneth Simpson"}, {"rating": 5.0, "review": "Great product.  Quick delivery", "verified": true, "helpfulness": "1/1", "author": "Anonymous"}]