[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Avid Equin \"DBA Student\""}, {"rating": 4.0, "review": "This is fun, but does not replace Directv... cannot receive Days of our Lives so I gave it 4 stars.", "verified": true, "helpfulness": "0/1", "author": "Pearl Bates"}, {"rating": 1.0, "review": "Very Disappointed with the Fire Stick with regards to MLB.com......Constantly buffers and makes watching ball games UNWATCHABLE!  I'll buy another device, ROKU,..........Very sad Amazon!", "verified": true, "helpfulness": "0/3", "author": "Penrod"}, {"rating": 5.0, "review": "works as expected", "verified": true, "helpfulness": "0/0", "author": "MILREF"}, {"rating": 5.0, "review": "Better than I expected.  And an unbelievable value for the money.  The Prime Music is my favorite part.  My playlist is growing every day.", "verified": true, "helpfulness": "0/0", "author": "Steve Fernandez"}, {"rating": 1.0, "review": "Poor wifi signal. The router is in the next room and it's constantly freezing. I've done updates and it still won't play correctly. It buffers constantly. I've read other feedback, tried numerous times to troubleshoot and nothing...I'd return it but I threw away the box thinking it would be just as great as my Amazon FireTV (which I LOVE). Too bad it's definitely not. Sad that I had to go back to my Roku (The Original) that's 9 years old to get a better wifi signal.", "verified": true, "helpfulness": "1/1", "author": "JMan1376"}, {"rating": 5.0, "review": "Love it. Does everything it should and more.", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "We plan to stop our satellite service and utilize the fire tv  instead. Will save a lot of money.", "verified": true, "helpfulness": "0/0", "author": "jwolf45887AW"}, {"rating": 5.0, "review": "I bought this so I could watch \"Bosch\" on Amazon Prime on my television in the living room rather than my computer.  And for \"Longmire\" if it ever comes to Netflex like it is supposed to.  Easy to install.  Works great.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Siame \"the beautiful\""}, {"rating": 5.0, "review": "Fantastic works great!!!", "verified": true, "helpfulness": "0/0", "author": "Jason keys"}]