[{"rating": 4.0, "review": "Easy to use once I figured out how to navigate between the Amazon Prime homepage, and the Netflix, or Hulu home pages. If I used \"Recently viewed\" I could not get the search to work properly. But if I scrolled to \"my Apps\" then clicked, everything worked. At times the fire stick takes up to 30 sec. to load into the TV;  however, if I am patient it will appear. As with any new device, practice makes perfect.", "verified": true, "helpfulness": "0/0", "author": "Donna Martin"}, {"rating": 5.0, "review": "Amazon Fire TV Stick is a great way to make a non smart TV have smart capabilities. There are many available apps to get all sorts of functionality out of your fire stick.", "verified": true, "helpfulness": "0/0", "author": "Jake S"}, {"rating": 5.0, "review": "I love this fire stick so much I use it every single day just happy that I got this as a gift very easy to use so happy with my purchase so much", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up. Prime account makes this a must get. In fact everyone should get Amazon Prime if you want to use Amazon as much as me.", "verified": true, "helpfulness": "0/0", "author": "Daniel P. Camer Sr."}, {"rating": 5.0, "review": "Live it catching up on my movies!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"JAMIE\""}, {"rating": 3.0, "review": "It has great features but Comcast does not have a deal with amazon yet to let you stream HBOgo or SHOtime on the device. I wish I knew this before purchasing.", "verified": true, "helpfulness": "0/0", "author": "Nicole W"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Colleen D."}, {"rating": 4.0, "review": "I like the way it works.", "verified": true, "helpfulness": "0/0", "author": "Stanton Sr."}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "thomas brown"}, {"rating": 5.0, "review": "Love it......great way to get extras without alot of extra money. Ordered the game remote as most of the games that say they can be played with the remote really can't - it's too hard.", "verified": true, "helpfulness": "0/0", "author": "lori neske"}]