[{"rating": 4.0, "review": "Enjoying it for the most part. I wish it came with more paper instructions.  Not tech say so I didn't know that instructions appear once you plug it in. Duuuuh. Still new to it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "If you have a newer bluray player, as we do, you really do not need this. Our Sony blu ray has wifi access and you can simply log on and have both the wifi OR the ethernet directly attached to it, plus you can double up on use of your tv HDMI port as you can get amazon prime video plus blu ray plus whatever else is on your wifi feed. These would be handy for your bedroom possibly if you have a tv there or a dorm room, but not feeling the love for it as it is. Also, your TV will need an optical OUTPUT to stream the digital sound from stick to TV through HDMI, then from tv to receiver to get 5.1 surround. If your blu-ray is connected through your receiver already and then to the TV you have only to turn that on and away you go.", "verified": true, "helpfulness": "1/1", "author": "bagpiper8 \"Mark\""}, {"rating": 5.0, "review": "Excellent Value. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Lennie S."}, {"rating": 5.0, "review": "Great device, the UI is very well thought out and I prefer it over my WD Live TV. It's very easy to set up, which is a plus, and the minimal size is great. The remote is better than I hoped, and I really love the Prime membership benefits with this device.Pros:1. Prime Videos are flawless, and Netflix works great. You aren't locked into Amazon's services, which is very cool.2. If you have a media drive in your house with movies and TV shows, you can use Plex to stream to the Fire TV Stick.3. Being able to rent new movies is really cool.4. The remote is flawless. No angling the remote to get some IR sensor to hit right!5. The device is hidden behind TV, so no clutter.6. Apps! I won't go on about the ones I like, but it's nice to have a robust selection.7. Fast!Cons:1. No restart/reboot option in the software. On the rare occasion something misbehaves, you have to unplug the power source.2. No built in DLNA/SMB support. Plex media server solves this though.3. I wish it could power through the HDMI port, but that's not a reality yet.Overall, I love this device. I just really wish I could reboot from the settings menu when my WiFi goes wonky.", "verified": true, "helpfulness": "1/1", "author": "Christopher Recouvreur \"union\""}, {"rating": 4.0, "review": "Great buy!. nice little computer to stream almost all my favorite channels. Pretty fast, even when my internet speed goes down to 2 Mbps. It also provides opportunity to experiment with sideload other channels.", "verified": true, "helpfulness": "0/0", "author": "Sreekumar"}, {"rating": 3.0, "review": "Works good for streaming  for a small dongle except for two issues I have notices in my 10 hours of usage.1) Youtube streaming has intermittent sharp clicks or beeping noises. I am not sure what is going on; it does not seem to be related to buffering because the video keeps going though I do see some jumps in the video.2) Once it got stuck in a state where it would not stream any content from Prime; just showed \"loading\" sign. I rebooted by pulling USB cord and reinserting. It has been working fine ever since.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 4.0, "review": "This is a no brianer if you like amazon content. Streams flawless, it very easy to connect, walks you throught set up, all your videos , and amazon prime ready for view. The interphase is simple and easy to use...buy the bluetooth controller for games and your kids wont need a expensive xbox, many games avaiable for download, easy to carry, and with a future update you be able to use it in a hotel wifi that use password imput. i pretty much just use for amazon video and netflix", "verified": true, "helpfulness": "0/0", "author": "M. Prieto"}, {"rating": 1.0, "review": "Still can't download Disney Channel s fir my kids", "verified": true, "helpfulness": "1/5", "author": "eina"}, {"rating": 5.0, "review": "We only wanted this for the Netflix feature and it definitely has fulfilled that beautifully.  As well when I had a question I phoned the customer support line and got a real person to speak to which was wonderful.  They were very efficient and friendly.", "verified": true, "helpfulness": "0/0", "author": "Paulette M."}, {"rating": 4.0, "review": "It works well, but I wish it had more channels. Right now the Roku has the most diverse selection of channels. I think the Fire supports Showtime, but I don't think it has HBOGo. I'm sure the increase in channel selection will come in time. I will say that I like that I can buy shows directly from Amazon without entering my password repeatedly. It's a little \"Amazon Prime\" centric, but that's to be expected. It is an Amazon Fire Stick after all. Overall, a good purchase. I'm happy with it.", "verified": true, "helpfulness": "0/0", "author": "Rosie May"}]