[{"rating": 5.0, "review": "I love this fire stick.  We more TV's than we have cable boxes.  We liked this for our TV in the basement.  It was very quick to set up and worked right away.  We just watch the free shows when we use the fire stick.  It is a very worthwhile purchase.", "verified": true, "helpfulness": "0/1", "author": "Michelle Henkelman"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Daniel R. Larrabee \"DRL\""}, {"rating": 1.0, "review": "Doesn't work well at all. I experience slow downs on an otherwise fast network all the time. Apps will sometimes quit for no apparent reason and the interface needs work too. Some apps when you click on them in the recent section will simply move the interface to where the app is instead of launching the app. I called tech support and they said to use the HDMI extender which, like powering off and on again does, \"fixed\" it for about a day. Furthermore, what is the point of having a \"stick\" device if it still needs to be plugged into a wall outlet. The remote creaks and bends easily too. As a prime member I took advantage of the pre-order so I suppose its possible I got a bad build from the first round to be manufactured. It took months from when I pre-ordered to when I actually got the device. If so, I wish Amazon would replace it with one that actually works.", "verified": true, "helpfulness": "0/1", "author": "Michael"}, {"rating": 4.0, "review": "Great. Loses connectivity often. Power cycle before every use seems to fix it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'm giving this 3 stars for now because I don't have access to premium channels.  At least give us the option to buy episodes of the most recent series like Power and the Haves and Have Nots.", "verified": true, "helpfulness": "0/1", "author": "Latanya Crawford"}, {"rating": 5.0, "review": "Was very easy to connect and it streams seamlessly.", "verified": true, "helpfulness": "0/1", "author": "E. Byrne \"No one can make you feel inferior without your consent.- E. Roosevelt\""}, {"rating": 5.0, "review": "Works great!  Great product and price!", "verified": true, "helpfulness": "0/1", "author": "Erica Zimmerman"}, {"rating": 5.0, "review": "Works great so far. Will probably order another for the other TV.", "verified": true, "helpfulness": "0/1", "author": "Geoffrey Ehrensing"}, {"rating": 1.0, "review": "I was not able to stream YouTube from iPhone on to stick even if the phone is on the same network. Every time I had to Pair devices. It's not easy or comfortable as my old YouTube app on PS3.I purchased couple of videos on youtube and those dont play either. they are playing fine on any other devices", "verified": true, "helpfulness": "1/2", "author": "Poojitha"}, {"rating": 5.0, "review": "Awesome.  So easy to use.  Household uses it every single day.", "verified": true, "helpfulness": "0/1", "author": "tigsy"}]