[{"rating": 5.0, "review": "We really like the fire tv stick better than our other media streaming device.", "verified": true, "helpfulness": "0/0", "author": "Kelly Maller"}, {"rating": 5.0, "review": "Obsessed with the fire stick! Can watch my prime tv shows and movies on my television. The ability to download apps such as netflix and flixter make it even better!", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "Worked as long as wifi was present which the would have talk more about  getting more signal with routers or antennas", "verified": true, "helpfulness": "0/0", "author": "Fred Gorman"}, {"rating": 5.0, "review": "Im really enjoying this Amazon Fire TV Stick.  Amazon is great!", "verified": true, "helpfulness": "0/0", "author": "rainmman1"}, {"rating": 5.0, "review": "Easy to install and worked well.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works great easy to use", "verified": true, "helpfulness": "0/0", "author": "stephen davis"}, {"rating": 1.0, "review": "This product did not live up to its reviews. On Hulu the video would freeze and the audio would keep playing. Also on Netflix it would buffer all the time making it impossible to watch anything.", "verified": true, "helpfulness": "0/0", "author": "Kristina Drews"}, {"rating": 5.0, "review": "I have a Roku 2 and a Chromecast. This is by far superior to both. It is fast. The UI works great. Hulu and Netflix apps both work great.", "verified": true, "helpfulness": "0/0", "author": "Robert Bradley"}, {"rating": 5.0, "review": "Love it. Great selection of movies, TV shows and of course apps", "verified": true, "helpfulness": "0/0", "author": "clouds"}, {"rating": 1.0, "review": "Misleading information: it does not connect to wifi. I thought it could be a weird problem with my wireless network (since all my other devices work fine), but I found out thousand of people have the same problem. It is impossible to use, it does not establish a working connection. Also, it does not screen mirror Apple devices and it does not work with some apps, like popcorn time. I just spent my money with something useless.", "verified": true, "helpfulness": "1/1", "author": "Amanda Sborgi"}]