[{"rating": 5.0, "review": "Absolutely love my Fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Trisha Raguse"}, {"rating": 5.0, "review": "I'm in love with this device. It definitely has the feel of an Amazon-driven device, but considering that Prime Instant Video offers so much excellent TV and a variety of movies these days, I find no issue with it. I found it only takes a little time and experience to get used to navigating the menus, after which it's smooth sailing. Compared to the 2011 Roku LT I was using (which could no longer handle Youtube or Amazon Prime at all), the Fire TV stick feels super fast. If I thought about it more, I'm sure there are some things about it that could be improved- but overall, it's an amazing product. Especially for the price!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The install for Amazin Fire stick was very simple and is very similar to my Apple TV install. The picture is great, no glitches at all. Even my Apple TV has streaming issues at times.I would reccomend this to a friend.", "verified": true, "helpfulness": "0/0", "author": "mjkrocks"}, {"rating": 4.0, "review": "Very easy to install and use. Great interface and once it has HBO GO it will earn the 5th star!", "verified": true, "helpfulness": "0/0", "author": "Pacey"}, {"rating": 1.0, "review": "I could not find a way to get apps. not listed on the firestick. It seems if it is not listed, I could not bring it in.", "verified": true, "helpfulness": "0/0", "author": "Kristy Nelson"}, {"rating": 5.0, "review": "Fantastic way to get the channels I love...and the price with Sling TV deal was great. Love it!", "verified": true, "helpfulness": "0/0", "author": "Diana Heintz"}, {"rating": 1.0, "review": "I returned this item.  I have a very fast internet connection...125 MB per second...the stick would say that I didn't have a connection, which wasn't true.  All other devices were working flawless.  I cannot recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Skip"}, {"rating": 5.0, "review": "Small easy to use and you can add apps to it for more variety. The remote is also small butnot a whole lot of buttons are needed to talk to the Stick so I love it.", "verified": true, "helpfulness": "0/0", "author": "Joseph McCourt"}, {"rating": 4.0, "review": "The Fire Stick is good, the only down fall it doesn't have a lot of apps right now.", "verified": true, "helpfulness": "0/0", "author": "david coffey \"dc101\""}, {"rating": 3.0, "review": "Does not always buffer correctly!  Drops internet connection with good signal and speed!", "verified": true, "helpfulness": "0/0", "author": "RESJ"}]