[{"rating": 5.0, "review": "I bought my Fire TV Stick for the sole purpose of being able to have the HBO Now app on my TV since this was not an app option on my Smart TV. I was immediately impressed with how easy set up was for not only the Fire Stick but for all the apps I use on a regular basis (Amazon Prime, Netflix, Hulu, Showtime, etc.). I have been using Fire Stick nightly for about two weeks and have had no difficulties. This Fire Stick has been easier to use then the apps were on our Smart TV (quicker loading, easier interface) so now I solely use this for all my non-cable tv and movie entertainment. Highly recommend...especially for the price!", "verified": true, "helpfulness": "0/0", "author": "Sara Lawless"}, {"rating": 5.0, "review": "Excellent deal at $39.95. We love it!", "verified": true, "helpfulness": "0/0", "author": "Fran Haelsen"}, {"rating": 4.0, "review": "Simple to set up and easy to use. We enjoy using it.", "verified": true, "helpfulness": "0/0", "author": "jdhddhdh7383&$"}, {"rating": 4.0, "review": "It is easy to hook to the tv and I like that I have the prime movies avail to me.I dont like that it seems to have a problem staying connected to my internet, even thought every other device I have isn't having internet problems. Very frustrating when you are watching the movie and it kicks you out, and in the settings it says I'm connected and the signal is good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Like it very much.", "verified": true, "helpfulness": "0/0", "author": "Glenda Sullivan \"GK Sulli\""}, {"rating": 5.0, "review": "I love our fire stick, good bye cable!  Everything is super clear. Awesome.. should have bought it  sooner!", "verified": true, "helpfulness": "0/0", "author": "Karyn Taglia"}, {"rating": 3.0, "review": "The way the Fire Stick is advertised... I thought this little stick had all the movies in addition to the Apps listed. Its sort of misleading.You have to have a subscription to these apps in order to access them.", "verified": true, "helpfulness": "0/0", "author": "ShoeDiva"}, {"rating": 4.0, "review": "Love it. Very cool, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Nancy Benton"}, {"rating": 5.0, "review": "Its better than I expected I really enjoyed it", "verified": true, "helpfulness": "0/0", "author": "kenton small"}, {"rating": 5.0, "review": "Very easy set up. Your Kindle photos get loaded as a slide show, any movies you have bought are easily ready to watch. When I go to my mom I bring my Fire Stick so we can all enjoy, thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "pamela"}]