[{"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Frances"}, {"rating": 5.0, "review": "Works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "David C. Armstrong"}, {"rating": 5.0, "review": "I love this! Very Happy with it!", "verified": true, "helpfulness": "0/0", "author": "Patricia Cox"}, {"rating": 5.0, "review": "Love it! I can now watch what I want instead of what is scheduled. I don't have a real fast internet connection and I can still use it without buffering while I use my laptop, except when I have to upload a large file for college. Lots of choices, too! Did take me a bit of trying to get it set up as the instructions aren't real clear.", "verified": true, "helpfulness": "0/0", "author": "fncy713"}, {"rating": 5.0, "review": "Awesome!!! Best investment ever. Get all my shows and entertainment in one spot. So easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Mary Balderas"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "It looses connection to my WiFi a lot, which interrupts my shows constaptly disrupts shows. When it actually works I like it.", "verified": true, "helpfulness": "0/0", "author": "Candace Fuentes"}, {"rating": 5.0, "review": "Love it! We also got the voice activated remote. Works great!", "verified": true, "helpfulness": "0/0", "author": "Mr. and Mrs. VV"}, {"rating": 5.0, "review": "Great little product for Prime members! Streaming quality of amazon content is surprisingly good. Convenience of the remote (compared to tethering my Kindle via HDMI cable) is a welcome addition to our viewing experience. Love the screensaver slide show, too. Haven't tried it with Netflix or any other providers/games.", "verified": true, "helpfulness": "0/0", "author": "Constance J Claffy"}, {"rating": 5.0, "review": "Worth every penny. I have used Amazon streaming video for a couple of years now thru a PS3, but this is so much better, easier & completely reliable & it's a breeze to set up. Watching Youtube on an HDTV is worth the cost, but there is so much more! Can't recommend highly enough.", "verified": true, "helpfulness": "0/0", "author": "John Feehan"}]