[{"rating": 5.0, "review": "Love the Fire TV Stick.  Will never be at a loss for movie or TV to watch again - Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Not Given"}, {"rating": 5.0, "review": "The best thing ever made i get most of my shows on hula, have Netflix and amazon prime and now hbo go added to the mix able to listen to my Pandora also the best purchase i have ever made with amazon.", "verified": true, "helpfulness": "0/0", "author": "Debra Hines"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Ms. Williams"}, {"rating": 5.0, "review": "This worked really well after I resolved the problem with my internet connection.", "verified": true, "helpfulness": "0/0", "author": "Brenda Partridge"}, {"rating": 4.0, "review": "Really works well!!! I think it has more capabilities  than I realize. ..", "verified": false, "helpfulness": "0/0", "author": "Bonnie Heimerman"}, {"rating": 5.0, "review": "My Fire TV Stick arrived in the mail and within 10 minutes I had access to a variety of programming.  Since I ordered it off Amazon, it came with my Amazone Prime already pre-registered which was great! I love this thing.  Honestly, for the low price of $39.00 I don't know why I waited so long to order it.  I love it my Amazon Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Lisa F \"catznipp\""}, {"rating": 3.0, "review": "Well it does provide what is advertised but we really need a user manual.Now I find that I Need to pay for a user manual, I am dissapointed.Also I wish I could browse on line for movies etc  it would be so much easier than on the tvI am new to this so maybe I'm missing something butt haven't found iy yet. Anyone suggestions.", "verified": true, "helpfulness": "0/0", "author": "Mel"}, {"rating": 5.0, "review": "great gadget", "verified": true, "helpfulness": "0/0", "author": "Jack O'Neal"}, {"rating": 4.0, "review": "I have issues with Hulu Plus on it. It takes a long time to load and freezes frequently where I have to start over from home. Netflix seems to work ok but is not really for someone who likes to watch TV because it's mostly movies. Haven't tried the Amazon Prime yet. The sticks were easy to set up. We bought 2 at the same time. One continues to go haywire and we have to unplug, reboot, and start all over. The other one doesn't have that problem at all. For the price, you get what you pay for. After the initial investment we cut our TV bill from $95.00 to $17.00 a month for both Netflix and Hulu Plus. Worth the value if you don't mind some bugs.", "verified": true, "helpfulness": "0/0", "author": "Donna Paoletti"}, {"rating": 5.0, "review": "Talk about your one-stop shop when it comes to entertainment. You can use Fire Stick for Netflix, Hulu Plus, Showtime Anytime, Pandora, ESPN, games, music and so much more. This is a great buy promising to provide endless hours of entertainment.", "verified": false, "helpfulness": "0/0", "author": "Dabney Struble"}]