[{"rating": 5.0, "review": "I received the fire sticker 3 days ago and used it everyday and tried to use different features and also with variaty of devices such as iPhone, kindle and iPad. It way blow my expectations for a $39 product. YouTube device paring and kindle video fling feature are my favorites. The remote control coming with the striker have a big room to improve, however, as soon as I pairing my smart phone with the sticker, I virtually no longer need the remote.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Fast.", "verified": true, "helpfulness": "0/0", "author": "Fred N Ridner Jr"}, {"rating": 4.0, "review": "We like the fire stick. Not perfect, but considering the price it's a good buy.", "verified": true, "helpfulness": "0/0", "author": "Koop"}, {"rating": 5.0, "review": "This was so simple to install and performs exactly as discribed.", "verified": true, "helpfulness": "0/0", "author": "Margaret Alford"}, {"rating": 5.0, "review": "Absolutely love this thing, we use our Amazon prime a lot more now. Couldn't live without it now. Really like that you can watch YouTube on your TV with this stick.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "Great clarity both video and sound. Great to add to a wall mounted TV.", "verified": true, "helpfulness": "0/0", "author": "Murali Nageswaran \"MN\""}, {"rating": 5.0, "review": "Think I like this better than my AppleTV, can ya port fox news to the stick", "verified": true, "helpfulness": "0/0", "author": "Natpock \"Oldest technogeek\""}, {"rating": 5.0, "review": "Love it, especially with Prime.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 4.0, "review": "So this is what a smart TV should do! My HDTV isn't smart on it's own. I had been using a Blu-Ray player to get it a brain.  Wrong move. I think the manufacturer has stopped updating the device. At least with the Fire TV Stick, I feel like I'll be able to get updates as needed with Amazon.Thanks, Amazon, for a way to get Prime content on my TV. Thank you for including other apps like Netflix. Everything runs so smoothly!  Netflix on my other device stops and starts.  No errors with the Fire TV Stick.  I'm really enjoying what I'll call bonus content like the Gaiam Channel and other workout channels. These channels have a more on-demand kind of feel and are really nice. The game selection seemed a little weak.I have a Fire Tablet and I have downloaded the Fire TV app on other devices. The app works nicely as a remote; it's taking some practice to get my swiping just right. Voice search runs without a glitch.Having a Fire Tablet is a plus. I do like switching screens as I move about the house. I have developed the habit of looking up info about the movies and shows as I watched them. Having IMDB on my Fire providing scene trivia as I watch on the TV is so cool.This is the complaints section. My major complaint is how Amazon continues to ignore Google's existence. I want the real You Tube, not a third-party workaround. I also have Chromecast. It would be nice if Fire offered similar projection functionality. I really wish either device, preferably Chromecast, would allow me to listen to Audible via my TV.", "verified": true, "helpfulness": "0/0", "author": "NuJoi \"Create with me\""}, {"rating": 5.0, "review": "This is AWESOME!!!!  It is even better that I expected!!The movie selection is vast and the \"Amazon series\" have been good so far.The access to Netflix is faster and easier than my previous method of using my blue ray player.There is nothing not to love", "verified": true, "helpfulness": "0/0", "author": "Lou Ann Prescott"}]