[{"rating": 2.0, "review": "I knew that they would be slower than the Amazon Fire box, but I am not happy with how much slower they are. These sticks often will freeze while streaming, and I don't have that same problem with my Fire box.  Given the choice again, I would rather have purchased a second Fire box.", "verified": true, "helpfulness": "0/0", "author": "JARED R CLEMENCE"}, {"rating": 4.0, "review": "Great price for what you get, I like how the kindle fire links up to this, I can use my iphone to navigate this.  Sometimes it resets itself.  It does get very hot after a little while running.", "verified": true, "helpfulness": "0/0", "author": "B-MAC"}, {"rating": 5.0, "review": "My \"Smart\" Blue Ray player was not compatible with Amazon, but with the stick I can access my movie options! YAY!!", "verified": true, "helpfulness": "0/0", "author": "Charlotte Landrum"}, {"rating": 1.0, "review": "I tried two Fire TV sticks and neither would stay connected to our network.  We have a chromecast and now a Roku that we have no issues with whatsoever.  Do yourself a favor and steer clear of the fire stick.", "verified": true, "helpfulness": "0/1", "author": "S. M. Keffer \"Cheshirecattat\""}, {"rating": 5.0, "review": "so far so good!", "verified": true, "helpfulness": "0/0", "author": "margaretb"}, {"rating": 5.0, "review": "Surprisingly good.  Video quality is great, although I can't seem to get it to work via my audio receiver.  Doesn't seem to accept my Prime subscription (obtained via my GF's account), but works with hers fine.  Not sure if that's intentional on Amazon's part.", "verified": true, "helpfulness": "0/0", "author": "Abu Amiri"}, {"rating": 4.0, "review": "Love it....", "verified": true, "helpfulness": "0/0", "author": "Lira Miranda"}, {"rating": 5.0, "review": "Better than chromecast", "verified": true, "helpfulness": "0/0", "author": "Jaime Alvarez"}, {"rating": 5.0, "review": "Great product for streaming Netflix and Prime tv/movies.", "verified": true, "helpfulness": "0/0", "author": "Joshua Ryan Baraniak"}, {"rating": 4.0, "review": "I purchased this to replace my chromecast for a few reasons: 1. to have a dedicated remote to it (so I didn't have to use my phone), 2. To be able to stream Amazon Instant Video (cannot do on chromecast) without having to use my playstation. While the remote is great, and now can watch instant video, I miss being able to \"cast\" things such as websites that support chromecast. So now when I want to watch movies on these sites, I have to re-plug in my chromecast and remove the fire tv. I have almost stopped using the fire tv for this reason. Also, I was excited to be able to screen mirror my phone to the fire tv, and have yet to figure that out. I have followed all of the steps from the fire tv and still no luck using my Note 4. It is great for what it does, but just not what I expected completed, compared to the chromecast. Still enjoy though.", "verified": true, "helpfulness": "0/0", "author": "Katherine E. English"}]