[{"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. O'Dea"}, {"rating": 5.0, "review": "Very good device never imagined it would be so great", "verified": true, "helpfulness": "0/0", "author": "Juanita McCormick"}, {"rating": 5.0, "review": "Great allot of options for small package", "verified": true, "helpfulness": "0/0", "author": "Charles Johnson"}, {"rating": 3.0, "review": "It is meh.  It's nice to have I guess. Ordered this for a weekend trip we were taking and was unaware that it requires to be plugged into the wall and the tv. Had I known it needed to be plugged into the wall, I would have forked up the extra 40 and got the box instead. It is fast, but man does it buffer alot.  My wife likes it though?", "verified": true, "helpfulness": "0/0", "author": "shadowvan"}, {"rating": 5.0, "review": "works as advertised. great product", "verified": true, "helpfulness": "0/0", "author": "D. M. Seymour \"dmsapple\""}, {"rating": 2.0, "review": "It worked for a few days and then would not hold my network.  I expected better.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brian K Morris"}, {"rating": 3.0, "review": "Great features, much better then other similar devices on the market. Only issue so far is it tends to re-buffer even though it's close to a hi-speed router. Would have been a five star if it wasn't for that.", "verified": true, "helpfulness": "0/0", "author": "Les"}, {"rating": 5.0, "review": "One of the best purchases I've ever made! Setup was so easy, worked right out of the box, was even set up specifically for me. I use this primarily for Netflix, and it works beautifully on this device. I have previously used the Roku, and I never liked how the episodes for TV shows were so unorganized. On the Fire Stick, however, TV episodes are organized by seasons, and play through to the next episode without hesitation. Works very quickly, only buffers every so often. The remote works very well, you don't even have to point it near the fire stick, it's programmed to work specifically with yours. However, I mainly use the iPhone remote app to control it. Which is wonderful in my opinion. The only little negative thought I have on this is how you must have it plugged into an outlet most of the time. It is not an issue for me, I just think they should make that known for potential buyers.", "verified": true, "helpfulness": "0/0", "author": "Rachel Dutterer"}]