[{"rating": 4.0, "review": "Powerful little stick. Streams well over WiFi. While it accepted XBMC firmware makes it difficult to access sideloaded apps.", "verified": true, "helpfulness": "0/0", "author": "David Jeremy Schneid"}, {"rating": 5.0, "review": "Exceeded my expectations. Purchased for my father and he loves it!", "verified": true, "helpfulness": "0/0", "author": "Angela Metzger"}, {"rating": 2.0, "review": "My wife uses it and has not been happy with it. If we knew then, what we know now we would not have ordered it.", "verified": true, "helpfulness": "0/0", "author": "Dale Morsette"}, {"rating": 3.0, "review": "Very disappointed in the movies and shows that are loaded, most of them I have not heard or they are so old I've already seen them.", "verified": true, "helpfulness": "0/0", "author": "Robin M Brown"}, {"rating": 4.0, "review": "Easy to setup and easy to use. The remote is a bit small if you have big hands though. The whole family is thrilled that we have amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "everything I expected happy I bought it.", "verified": true, "helpfulness": "0/0", "author": "gene brandt"}, {"rating": 5.0, "review": "I am completely satisfied with the Amazon Fire TV Stick.  It was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Nikki N. \"mystic1\""}, {"rating": 4.0, "review": "love the instant access and variety of entertainment", "verified": true, "helpfulness": "0/0", "author": "John P. Downes"}, {"rating": 2.0, "review": "Works great *when* it's right next to my wireless router.  All of my other devices work just fine all over the house.  I keep getting connection issues with the Fire Stick, however.  They even sent me a second one, still doesn't work.", "verified": true, "helpfulness": "0/0", "author": "DanaB"}, {"rating": 5.0, "review": "I love it!  I  don't know  how  I lived  without  this  for  long", "verified": true, "helpfulness": "0/0", "author": "Tiff \"Tiff\""}]