[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "N. Allbert"}, {"rating": 5.0, "review": "very easy to use  works better than I anticipated", "verified": true, "helpfulness": "0/0", "author": "Wilma Harris"}, {"rating": 5.0, "review": "Easy to set up. Works faster than the streaming through our bluray player.", "verified": true, "helpfulness": "0/0", "author": "Grace L. Albright"}, {"rating": 5.0, "review": "Love it. Works great with Prime and Kodi. I side loaded Kodi and it loads fine. No issues streaming. I use the remote for Prime and the Kodi IOS app for Kodi.", "verified": true, "helpfulness": "0/0", "author": "rockyinnc"}, {"rating": 5.0, "review": "Easy set-up and a great introduction video.  We have enjoyed it so much, that we ordered another for our son.", "verified": true, "helpfulness": "0/0", "author": "A regular user"}, {"rating": 5.0, "review": "Easy to install and works great.  I already ordered another one for a second television in our house.  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Margaret M. McLellan \"marg\""}, {"rating": 1.0, "review": "I had high hopes for the Fire TV stick. My prime videos have never worked right via my Roku unit with a full 80% of them not getting sound when selected.  So when I ordered the Fire TV stick i figured that if I was going to be able to watch prime video it would be this way.  Not happening.  Prime video loads and runs correctly as does Netflix. However, the Fire TV Stick has to buffer, and Buffer, and Buffer over and over and over again to the point that it is not enjoyable to watch anything on it.  I do not have anything approaching slow internet service, and Netflix works fine on my Roku and my Apple TV. I just wanted to be able to watch prime videos.  All I got to watch is buffer, buffer buffer.  Maybe Amazon should stick with what they do so very well. Books and packages. Diversity is only good when your product line is functional.  There's no way I'll be giving another donation to experience the fire TV itself.  No (buffer, buffer, buffer buffer) way!", "verified": true, "helpfulness": "2/4", "author": "Greg Atherton"}, {"rating": 5.0, "review": "Beautiful in its simplicity. Easy to install and activate. I was watching a movie just a couple minutes after installing it on my TV. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Glenn Calzada \"book adict\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "paula j gray"}, {"rating": 5.0, "review": "Very nice and delivered in excellent condition.", "verified": true, "helpfulness": "0/0", "author": "Joel Palmer"}]