[{"rating": 5.0, "review": "Works great. Easy to use.", "verified": true, "helpfulness": "1/1", "author": "Stephanie Altman"}, {"rating": 3.0, "review": "It was easy setup, works with my Harmony hub universal remote and is pretty quick and easy to use.  NEED MORE CONTENT!  Music and video is just lacking right now and I wanna see new movies and listen to new music but there is no way to just listen to whats new.  3 out of 5 from me but for $19 it does what it says it does.ALSO NEEDS iOS support ASAP!", "verified": true, "helpfulness": "1/1", "author": "Carlos Silva"}, {"rating": 5.0, "review": "it is excellent for the price you cannot beat it thank you Amazon", "verified": true, "helpfulness": "1/1", "author": "Dennis"}, {"rating": 5.0, "review": "Great product for the price, well worth it.", "verified": true, "helpfulness": "1/1", "author": "rm"}, {"rating": 5.0, "review": "Exceeded my expectations.", "verified": true, "helpfulness": "1/1", "author": "Rocketman"}, {"rating": 5.0, "review": "Easy to setup and navigate! I love it!", "verified": true, "helpfulness": "1/1", "author": "Katy Finuc"}, {"rating": 5.0, "review": "works as advertised! Love it.", "verified": true, "helpfulness": "1/1", "author": "Stephan Henze"}, {"rating": 5.0, "review": "Neat stick to have in the living room or take traveling.Picture quality and sound is great.At least the Tune-In Radio app supports all broadcasting formats something the Roku3 doesn't do.Hope the app developers jump on the bandwagon as this product has potential and the room to grow.Love the youtube app and hope amazon adds the Vudu app down the road.The great thing is it has enough ram not to buffer in the middle of a movie.Glad I grabbed two while prime time members could get them at $19.", "verified": true, "helpfulness": "5/6", "author": "David M. Moser \"Mike in Carolina!\""}, {"rating": 2.0, "review": "The fire TV stick does not work when attached through a receiver.  I installed mine on a Denon receiver and the screen would flicker with noise and turn off.  The unit was plugged directly into the receiver and the power into the wall socket.I was able get it working when directly plugged into an hdmi I out on my tv.  After starting it immediately attempted to update the software and failed.  The unit displayed an error message suggesting to unplug the power and reapply power after several minutes.  After the second attempt the unit again tried to download the software and was still making no progress after 15 minutes.  I restarted the unit by pressing select and play for a few seconds.  Eventually the unit powered back on and successfull downloaded the software.I searched for information on the problem and found someone had a similar issue with an Onyko receiver and amazon had requested he contact them.  Based on that, assuming I perhaps had a faulty unit, I contacted Amazon support after three reps and a phone call, they eventually told me it was not compatible through a receiver....Extremely disappointing to say the least.  I'm going to hang on the unit since I brought it when it was on sale for $19 and use it elsewhere in the house but I wish I had known about this issue before I ordered it.  The units software downloading issues also creating some frustration. Overall I'm less than impressed....", "verified": true, "helpfulness": "1/3", "author": "Ceinwyn"}, {"rating": 5.0, "review": "I had a roku 3 in my bedroom and I disliked the interface on the thing once I got the fire tv.  But I didn't want to pay for another fire tv just because I hated how the roku 3 displayed the amazon instant videos.  Once the fire stick came out it was a no brainer to get one for my bedroom.I love how easier and faster it is to start up and play a video compared to the roku 3, plus the roku ended up having problems dropping my wifi connection the last month or two.Now that I have been informed how to turn off the auto advance feature, there is no reason to not give the device a five star rating.  I had originally given it four stars because it would keep on auto advancing episodes and I wasn't aware there was an option to turn that off.  I kept looking at settings on the fire stick, not my settings from my amazon account.", "verified": true, "helpfulness": "0/1", "author": "Jonathan Mattson"}]