[{"rating": 5.0, "review": "I don't know how I lived without this item! So simple to set up! I normally take a forever reading and setting up electronics, this took me 10 mins tops, and that's cause I read the instrutions completely before touching anything! So many options, with a prime membership. Instant videos, music, u can also get apps, to play games! Access to netflix if your interested! I might down grade my cable package cause I have everything here!", "verified": true, "helpfulness": "0/0", "author": "jennifer cohen"}, {"rating": 5.0, "review": "I love this so much I bought 3 of them.", "verified": true, "helpfulness": "0/0", "author": "Gilpin Army"}, {"rating": 5.0, "review": "The quality of streaming is wonderful, and love the viewing selections", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome device !!!", "verified": true, "helpfulness": "0/0", "author": "Henry Tejada"}, {"rating": 4.0, "review": "Had a issue with my first one but customer service sent me a new unit in just 2 days. This fire stick works great. i knew there were going to be defectives out there o well. But this fire stick is a nice public viewer when you dont have a smart tv. Will be buying another one again for family. highly recommend", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 3.0, "review": "This is definitely set up best for Prime members. Most of the content that it directs you to requires Prime or to be purchased from Amazon. There is free programming but it takes time to find and you have to download several apps and then \"activate\" them on a browser. It's a frustrating process. I use it mostly for Netflix and Youtube and it works well for that.", "verified": true, "helpfulness": "0/0", "author": "sneezye"}, {"rating": 5.0, "review": "Works great!  Beautiful sharp picture. My only regret is that the remote is so small. We've lost it a number of times. I also installed the phone app for those times. We were so surprised at how easy it was to install and use, because we are not great with technology. Enjoying Prime a great deal.", "verified": true, "helpfulness": "0/0", "author": "Laury"}, {"rating": 5.0, "review": "the Wifi range on it is a bit weak, initial setup took a little bit of effort / troubleshooting, but after that, and i placed it in a room with better wifi, this thing works great, better than boxee and roku 2 for streaming video apps.", "verified": true, "helpfulness": "0/0", "author": "William Brown"}, {"rating": 4.0, "review": "Great item.  There's a slight lag at times with other devices on the network that impact performance.  Otherwise, I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Ajs2020"}, {"rating": 5.0, "review": "Love this stick think I will stick with it!!!!", "verified": true, "helpfulness": "0/0", "author": "Marvin Richard"}]