[{"rating": 5.0, "review": "Just finally got our fire  stick. Son wanted to watch a movie we had on our prime account. From box open, to movie playing took less than 5 minutes. Flawless setup and integration. Worth the purchase just for that", "verified": true, "helpfulness": "0/0", "author": "Greg Stonesifer"}, {"rating": 5.0, "review": "So handy to use. I bring it with me to hotels when i travel. Family can watch netflix and i can catch up on sports with espn app!", "verified": true, "helpfulness": "0/0", "author": "JOHN RECKART"}, {"rating": 5.0, "review": "I just love the Amazon fire stick, it allows more viewing options than cable TV.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Brown Sr. \"Avid Reader\""}, {"rating": 5.0, "review": "Super good", "verified": true, "helpfulness": "0/0", "author": "Stephanie Schmidt"}, {"rating": 4.0, "review": "It is good .I like itThnksYong", "verified": true, "helpfulness": "0/0", "author": "Yong Liu"}, {"rating": 5.0, "review": "so far im in love! it is a little confusing as most things are paid rentals.  Please make more prime videos available", "verified": true, "helpfulness": "0/0", "author": "jenmalo77"}, {"rating": 5.0, "review": "I love this fire stick. I'm able to see different movies on my tv.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth gutierrez"}, {"rating": 5.0, "review": "I bought this for my daughter (8 years old).  She loves it.  It was easy to install and it's easy for her to use.  I wish it only had more options for parental control; it's limiting in this area.", "verified": true, "helpfulness": "0/0", "author": "A_diva"}, {"rating": 5.0, "review": "Totally worth the money!", "verified": true, "helpfulness": "0/0", "author": "Kym Hewett"}, {"rating": 5.0, "review": "I had been using a Google Chromecast, but immediately replaced it when HBO Now became available for the Fire TV and Fire TV Stick.  Here are the details...With the addition of HBO Now to the Fire TV lineup, purchasing this for my kitchen TV was a no-brainer.  I already have a Fire TV for our main television, and decided to go with the smaller and more discreet Fire TV Stick for the kitchen.The result?  A smooth experience.  Adding the HBO Now app to the stick was effortless, and then all I needed to do was enter my username and password and I was set to go.I also use this for Netflix, Hulu Plus, and of course Amazon's own video streaming, and am happy with the results there, too.This uses a slower processor than the full-blown Fire TV, but the difference is barely noticeable.  I guess the stick is slightly less \"peppy\", but it does not affect the overall experience.  Note that voice recognition is NOT part of the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "N. Krumpe"}]