[{"rating": 5.0, "review": "Turn your TV into a \"smart TV\",...unbelievable low cost, exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Norma Wright"}, {"rating": 2.0, "review": "We bought this on the promotion they had for Prime members and excitedly waited for it's arrival at the end of December. We we so happy to not be using the glitchy and difficult apps of our smart TV and we really like it at first. We also have a Roku 3 and had been using it for several months prior to purchasing this. So we placed on the TV right next to the wireless router, plenty of signal strength. So immediately we had issues with using the remote to browse, sometimes after the third or fourth time you hit the next button while slowly going through the list of movies it would spaz out and jump 5-10 movies and you'd have to backtrack and then I started noticing the remote would just stop working and the only way to fix the problem was a hard reset, then we started having slow loading issues and freezing on just HBO Go then it started on Hulu and then it even started happening on Netflix, the audio would keep time and the video would freeze and then the video would speed through to catch up to the audio. We thought maybe it was slow internet, but going to the back bedroom, the furthest from the router, and using the Roku 3 we had no issues what-so-ever. So then we thought maybe it was the crappy tv, so we swapped out the Roku 3 to the same tv and it ran smoothly on every single app. That same day I ordered a Roku 3 and replaced it in the living room and gave my mom my Fire stick and I won't be recommending it to anyone.Overall: this works, it has glitches, but it works and I only wasted $19 on it so oh well. It may have just been mine, but I'm done with it and loving my Roku 3", "verified": true, "helpfulness": "0/0", "author": "Cbgb1404"}, {"rating": 4.0, "review": "Can't believe all the options available, continuing to explore great value with Prime.  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "This is the best.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Domenech"}, {"rating": 4.0, "review": "Great except that does not support my cable  company app.", "verified": true, "helpfulness": "0/0", "author": "jon emond"}, {"rating": 5.0, "review": "Works great.Easy to use my 60 year old mom can use it very easy.", "verified": true, "helpfulness": "0/0", "author": "Kevin Groh"}, {"rating": 5.0, "review": "Easy to install, easy to use and navigate through screens. So many movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Joshua A. Wertz \"joshw\""}, {"rating": 5.0, "review": "Very easy to setup and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Eunice"}, {"rating": 2.0, "review": "Even though the fire stick shows a \" very good\" connection it spends a great deal of time buffering.  It is very frustrating to try and watch TV while this is going on.", "verified": true, "helpfulness": "0/0", "author": "Danny L. Francis"}]