[{"rating": 4.0, "review": "After owning a Google Chromecast, as well as an AppleTv, and a Roku, I have to say I'm fairly impressed with the power this little stick packs.  For the cost of entry, it's a fantastic device, and interacts with the my Plex server flawlessly.  I was even able to get an app (for a very small fee) that allows me to AirPlay from my iPad, and there are some great games being developed for this platform.  Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "B. Willette \"Amazon Addict\""}, {"rating": 4.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Daddy X"}, {"rating": 5.0, "review": "A great price for a streaming device and so easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Shirley Smith"}, {"rating": 4.0, "review": "I already had a Roku. I got the Fire TV stick so I could watch my Tablo remotely. I purchased it from Best Buy when it was a deal of the day for $25.", "verified": true, "helpfulness": "0/0", "author": "Bill Eastman"}, {"rating": 5.0, "review": "I cut my Cable bull by more then half I use to pay $103. 00 now of pay $59.00 for internet a basic cable. I am happy, and in \"the welfare\".", "verified": true, "helpfulness": "0/0", "author": "karim aquil sharif"}, {"rating": 3.0, "review": "It is really slow and not responding well when running an app like Youtube on the device. Poor speed and poor interface, it is really hard to do a search and find the video you'd like to watch.", "verified": true, "helpfulness": "0/0", "author": "Zhenkun Guo"}, {"rating": 4.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Tatiana"}, {"rating": 5.0, "review": "I am truly enjoying my Amazon Fire TV Stick.  I am watching so many movies and TV shows that I had missed or wasn't able to watch for some reason or another.  Amazon you're amazing.", "verified": true, "helpfulness": "0/0", "author": "SweetPea"}, {"rating": 5.0, "review": "Works really well!", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 5.0, "review": "I love this tool. It is one of my best gifts that I gave myself. If you own a Amazon Fire, you need to buy the Fire TV Stick. I own a HD TV without wifi and no Ethernet connection. The HDTV is working fine with the Fire Stick. I was able to connect ESPN & FOXs Sports apps to my Verizon Fios subscription. I have instant updates on all types of sports all in one click. The miracast on my Fire Phone interface with the FIre Stick on my HDTV that is attached to the TV. The Fire Stick has Games, Instant videos, Apps and all types of things easily displayed on my HDTV.  In addition, the FIre Phone could be used as a remote like the Fire Stick too. You could bypass the HDTV smart  connection with FIre Stick on any HDTV.  My next purchase will be the games accessory.", "verified": true, "helpfulness": "0/0", "author": "Dean Fonts \"Dino Fontaine\""}]