[{"rating": 5.0, "review": "So great! Love it!", "verified": true, "helpfulness": "0/0", "author": "MamaB"}, {"rating": 3.0, "review": "doesn't work without more bandwidth....", "verified": true, "helpfulness": "0/0", "author": "Brenda Heyward"}, {"rating": 5.0, "review": "love!", "verified": true, "helpfulness": "0/0", "author": "Evelyn, NY"}, {"rating": 1.0, "review": "I hate this thing.  I have the fastest internet offered to residential customers by my cable company and all other devices work fine on my WiFi including the Fire box, but not the stick.  Everything I watch \"stutters\" multiple times throughout.  All selections made take a while to go through and you can press the home button, get up and go to the bathroom, and it will just be coming up when you return.  Maybe some are faster, but for us this thing is more of a headache than anything else.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "I am thrilled. Thank you again Amazon. Can't wait to get the game remote so I can play my game from the big screen.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Works great - son loves it.  Easy to set up and use.  Also makes it very easy to purchase movies on Amazon prime if you aren't careful (which is why we gave it to our son as I knew I'd end up spending too much on movies so we went back to using just net flix :)", "verified": true, "helpfulness": "0/0", "author": "country girl"}, {"rating": 5.0, "review": "I was fortunate enough to grab this at the first release offer of $19, I figured at that price I can't go wrong.This device is fabulous. Hands down. I read the one star reviews that people have and they all seemed like unfortunate technical errors. If you want a basic plug and go device this is for you. It is so easy to set up and get started. You cannot beat the price for the value you get.  Thank you Amazon! You make me question why i have cable .... because more often than not I am switching to your free videos.", "verified": true, "helpfulness": "0/0", "author": "Deanna Robitaille"}, {"rating": 4.0, "review": "Love its small size and that you can switch between tv's in your home. Using your phone as a remote is a plus. The only thing I don't care for its having to plug it in to an outlet which can make it difficult if you don't have a outlet near by. Overall satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 5.0, "review": "Great picture easy to use", "verified": false, "helpfulness": "0/0", "author": "Archie Konschnik"}, {"rating": 5.0, "review": "Fire TV is a great device in terms of streaming. I feel it is better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Kevin Zhao"}]