[{"rating": 2.0, "review": "I easily installed the Stick. However, I am getting a message my internet is too slow. What is the minimum requirements? I can't find any definitive information on this. If I can't get the Stick to work, I will send it back", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Outstanding product. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Chrome has a better phone app interface.", "verified": true, "helpfulness": "0/0", "author": "Rags96720"}, {"rating": 3.0, "review": "It works fine, however, will not fit in each size tv.  I was replacing a Roku box with this item.  The design of the stick is too long to replacethe Roku cable that went into the side of monitor.  The back of my 21\" tv won't accept the stick.  Disappointed.Found out after point of sale.", "verified": true, "helpfulness": "0/0", "author": "Barbara Wood"}, {"rating": 1.0, "review": "I can not l come up with something better.recommend this. It's good when it works. It's bad when it doesn't. Maybe if you wait 5 more years, they'll come up with something better. You could tr the fire TV. I am not wasting more money trying that either.", "verified": true, "helpfulness": "0/1", "author": "Miguel Munoz"}, {"rating": 5.0, "review": "Easiest install ever!  My only problem was getting the back off the remote the first time to put in the batteries.  Guess it was stiff from being new.  Neighbor finally got it open...but from there on it's been smooth sailing.  Prime and other services work fast and no \"buffering\" or loss of network speed through the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Doris Robinson"}, {"rating": 5.0, "review": "returned it", "verified": true, "helpfulness": "0/0", "author": "Linda Jennings"}, {"rating": 4.0, "review": "It is a little confusing on how the shows work. Which ones do I get to watch, and why do I have to buy others", "verified": true, "helpfulness": "0/0", "author": "Morton Sager"}, {"rating": 4.0, "review": "I like the product. But there has been a few times that it was not connecting to my wifi. Even though every other device was.", "verified": true, "helpfulness": "0/0", "author": "Lorretta Watson"}, {"rating": 4.0, "review": "The fire tv stick set up was easy. The device itself is vey easy to use with amazon prime video.", "verified": true, "helpfulness": "0/0", "author": "Dan Price"}]