[{"rating": 2.0, "review": "Very, very buggy. Freezes very often. Must be restarted constantly. Remote works about half the time. I would not buy this again. I should have gone with a media stick that has been around longer and has a better and more stable reputation.", "verified": true, "helpfulness": "0/1", "author": "E"}, {"rating": 4.0, "review": "Need more choices of \"classic\" shows", "verified": true, "helpfulness": "0/0", "author": "CHAD A DUNN"}, {"rating": 5.0, "review": "It did everything that I wanted and more than I expected. Very easy to set-up and use.", "verified": true, "helpfulness": "0/0", "author": "Wood Chips"}, {"rating": 5.0, "review": "Works like a charm. My daughter loves being able to access our Fire TV in her room now.", "verified": true, "helpfulness": "0/0", "author": "wasabi1 \"wasabi1\""}, {"rating": 5.0, "review": "It is definitely an amazing product for enjoying at home..", "verified": true, "helpfulness": "0/0", "author": "gunes alp"}, {"rating": 5.0, "review": "As good Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Craig Coburn"}, {"rating": 5.0, "review": "Just plugged it in, typed in my wifi password and it worked. I was a little worried picture quality would be poor because of an underpowered video decoder (it's so small!), but the Amazon videos I streamed looked nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE it!! And way more user-friendly than apple TV.", "verified": true, "helpfulness": "0/0", "author": "Jade Fisher \"jadefish\""}, {"rating": 5.0, "review": "Better than chromecast by a mile", "verified": true, "helpfulness": "0/0", "author": "Jerick Enclan"}, {"rating": 5.0, "review": "It's so simple to use once you get it set up (which didn't take too long). I had an Amazon account already which made it a quick set-up! Just started to use Netflix which has a good catalog of movies. Don't  mind not having the voice control, though Amazon should offer it as an upgrade. Plus there are many free apps/upgrades. I don't know why I waited so long!", "verified": true, "helpfulness": "0/0", "author": "denise kovacs"}]