[{"rating": 5.0, "review": "love it works really really nicely", "verified": true, "helpfulness": "0/0", "author": "Vatsal Patel"}, {"rating": 5.0, "review": "Met all expectations. Very easy to set up. Many more choices than with my Roku. Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Mary McComas \"Lovin' Utah\""}, {"rating": 3.0, "review": "I'm disappointed w/the fire stick b/c I specially bought it to access HBO Now and Showtime Now. The fire stick has neither. It has the HBO GO and Showtime Anytime both of which you have to have a cable subscription for. Other than that I am pleased with the fire stick. I like the format and I like how it automatically pull from my library.", "verified": true, "helpfulness": "0/1", "author": "Robert Eldridge"}, {"rating": 5.0, "review": "I love my fire stick. I like how I am able to watch Netflix and downloaded movies on my tv instead of on the computer. It was easy to install it took about 5 minutes or less to setup. I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Nika J \"Mz. Nika\""}, {"rating": 4.0, "review": "This is a fantastic product. Simple, streamlined, works great. My only complaint is they need HBO Now on here, but hopefully they'll get there eventually.", "verified": true, "helpfulness": "0/0", "author": "Owen Wiseman"}, {"rating": 5.0, "review": "Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Clarence Carver"}, {"rating": 4.0, "review": "Bottom line, would buy again. Setup was easy and quick. It had trouble initially connecting to wifi (though the device know it had a strong connection.) Had to call customer service and they had me factory reset which did not solve the problem. They offered to send a new one. I decided to try mine again another day and has worked since. Would recommend having it in the same room as the router, had to move mine even closer to prevent delays. Easy to operate, user friendly.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Easy to install and navigate.  Good selection of movies free with Prime.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Willems \"hogman43\""}, {"rating": 5.0, "review": "Works as stated. Easy to use and customizable", "verified": true, "helpfulness": "0/0", "author": "davidknox6010"}, {"rating": 5.0, "review": "I bought this to use with my Slingbox. The product works and Slingbox is one of the Apps, but the Firestick has a difficult way of searching for Apps. I found it on line on the Amazon site and had it sent to my Firestick instead of trying to locate the app on my Firestick, it is much easier.", "verified": true, "helpfulness": "0/0", "author": "Terry"}]