[{"rating": 3.0, "review": "Yet with a high speed broadband and good WIFI setup, movies get stopped constantly, having to reset the stick. Replaced it with the ROKU 3 making it a much enjoyable experience.", "verified": true, "helpfulness": "0/0", "author": "Oscar J. Mendez-Gordon"}, {"rating": 3.0, "review": "Cannot control voice volume control, you have to use TV remote.", "verified": true, "helpfulness": "0/0", "author": "ZHENZUO SUN"}, {"rating": 5.0, "review": "I LOVE my fire TV!  I dropped Netflix some time ago because I was never satisfied with the selection of movies for streaming.  Fire TV has 1000's of movies that you can watch for free.  It makes my prime membership worth the money just for this alone! (not to mention free 2 day shipping everything else)  It's super easy to set-up and the fire remote app for my I-phone makes it even easier as I can control my fire TV right from my phone.  I definitely recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "Alan Couture"}, {"rating": 5.0, "review": "Amazing to have I recommend", "verified": true, "helpfulness": "0/0", "author": "Minerva Perez"}, {"rating": 5.0, "review": "The Fire TV Stick is a cool device that enhances your TV programming choices by providing streaming access to thousands of movies, TV shows, music, games, web content, etc.  It's particularly useful for those who have HD TV's, without the built-in Smart TV applications, so it converts your existing TV into a Smart TV.  The best part about it is that it costs less than $50 so you don't have to go buy a Smart TV to enjoy these features.", "verified": true, "helpfulness": "0/0", "author": "dmf1975"}, {"rating": 3.0, "review": "Sometimes the episodes are skipped and I don't know how to go back to pick up the ones missed.", "verified": true, "helpfulness": "0/0", "author": "Mary Ellen Owen"}, {"rating": 5.0, "review": "Love it, it really expands my TV watching when nothing interesting is on TV.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Anne O'Shea"}, {"rating": 5.0, "review": "Great buy.  Although I have one smart TV, that TV won't show closed caption on Amazon and Netflix movies.  This fire stick works great and let's me use my iPad as a remote with the free available app which then accepts voice commands.  Much easier to search for movies by voice rather than having to scroll through the alphabet and type movie titles.  I have also used it on vacation as long as the TV has an available hdmi port, and you have access to a wireless network, which is normally the case.  I take an extension cord with me just in case there is not a nearby outlet.", "verified": true, "helpfulness": "0/0", "author": "Gordon Amisano"}, {"rating": 4.0, "review": "I have a noted cable service so I don't use Fire often. But it's a marvelous alternative. My only problem is my wife hates technology and won't try it. I would likely use Fire more often (for movies). But she loses interest quickly and retreats to the bedroom TV. Otherwise my only issue is controlling the volume. Many times dialogue is shallow and I need to turn it up. But when there is action or music it becomes too loud.", "verified": true, "helpfulness": "0/0", "author": "jerry feld"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Amanda Basham"}]