[{"rating": 1.0, "review": "Freezes constantly. Thought this would be a cheaper way to watch Netflix than buying a second Apple TV... Much rather have not had the headache and paid more for the Apple TV.", "verified": false, "helpfulness": "1/2", "author": "Christina Meyer"}, {"rating": 5.0, "review": "I'm happy with my CromCast.This one even better!", "verified": true, "helpfulness": "0/0", "author": "dyw_houston"}, {"rating": 2.0, "review": "Great product for the money, but isn't compatible with my Samsung TV (dlp55). I purchased this to specifically expand the tv viewing options in the basement, but the tv won't support the mode. Following further research online (because it isn't identified on the Amazon troubleshooting site) it appears both companies acknowledge a communication error between the fire stick and the Samsung tv, I'm sure you will be shocked to hear that neither company is taking responsibility.  However, the TV was around before the fire stick so I'm blaming Amazon.", "verified": true, "helpfulness": "1/1", "author": "ATK 824"}, {"rating": 5.0, "review": "I got this in the pre-release sale for ~$20, which was a great price.  I would buy this again for full price too.So far, it has been really nice and impressive.  The start-up (or wake-up) time is really fast, which is nice.  Our Samsung \"smart TV\" takes forever to start \"apps,\" so we've just been using this for Netflix, Amazon Prime, etc. because its so fast.The little remote works perfectly, and has just the right number of buttons.It has hung/frozen-up a couple times in the few weeks we've had it, but it can be easily rebooted, and is fine again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Better than my smart TV's built-in apps. The best feature of this device is its ability to be controlled by the TV's remote controlled. There is no need to use tiny remote that comes with it.The Fire Stick gets 5 stars but the flimsy remote gets only 3 stars hence the 4 star rating.  There is no setting to make the remote slightly less sensitive. When I press on the right or left button, the selector jumps two or more apps. It is very difficult to select the app that you like. Hopefully on the second iteration of this device, Amazon will provide sensitivity calibration for the selector.", "verified": true, "helpfulness": "0/0", "author": "dcon7776"}, {"rating": 5.0, "review": "I own a Roku Stick and Roku 3 streamer - I honestly like the fire stick a smidge more than the Roku boxes that I have.  It feels more fluid and faster than my Roku boxes.  My Roku stick crashes every couple of weeks and so far this stick has not crashed - I will be able to update accordingly if that does continue.  Great product Amazon!  :)", "verified": true, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 5.0, "review": "I have an original Roku box on my main TV, purchased this Fire TV stick for a new Toshiba 1080P TV in my study.  The Fire TV stick is extremely fast - responds instantly to inputs from the supplied remote and scrolls smoothly when browsing content categories.  The picture quality is fantastic too (equally good on content from Amazon Prime, Netflix, and the ACC TV app - go Syracuse!) even though my wifi bandwidth is only 7-15 Mbps from an old Linksys WRT54G WiFi router.  The Fire TV stick is so much better than my Roku box, but then again my Roku box is several years old.  Still, couldn't be happier with the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "ajfjc"}, {"rating": 1.0, "review": "Overheat and freeze after two hours of watching", "verified": true, "helpfulness": "0/0", "author": "h"}, {"rating": 4.0, "review": "I do like the Fire TV Stick.  It has a great interface.  The remote is simple and easy to use.  It was easy to set up; Amazon even put my account info on it for me so it already knew who I was out of the box.The things I don't like:  I have had network issues with it not liking a strong internet connection, I see others have had the same problem.  This problem seems to appear and disappear at random.  I'm not sure why.  The other problem I had is that it only allows 720p or 1080p streaming.  I have a slow internet connection and unfortunately that is what I'm stuck with in my area.  I can't even pay more to have faster internet.  The stick constantly under-buffers for 720p or 1080p.  Some lower quality streaming on Amazons end would help.  My Panasonic BlueRay Player does not have this problem when using it's Amazon app though.  It however does use a direct internet connection rather than a wireless one.All in all I like the FireTV Stick.  I just think there are still some kinks to work out.", "verified": true, "helpfulness": "0/0", "author": "Sean Lehman \"Sean Lehman\""}, {"rating": 4.0, "review": "The Fire TV Stick works great and is really fast! The only thing I don't like is the fact that you cannot add as many 'apps' as you can to the Roku (a similar unit by a different manufacturer). I can't wait to try the voice command when the iOS app is released! Be advised you DO need to connect the stick to an AC outlet. (The power supply is provided in the accessories....they just never mention it.) The remote is small and sleek!", "verified": true, "helpfulness": "0/0", "author": "Dean in NC"}]