[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Jorge S."}, {"rating": 5.0, "review": "So easy to use, and so small that it isn't even noticeable plugged into the back of the TV!", "verified": true, "helpfulness": "0/0", "author": "Dan Evans"}, {"rating": 5.0, "review": "Great after purchasing Amazon prime. Useless otherwise.", "verified": true, "helpfulness": "0/0", "author": "Tess Martinez"}, {"rating": 4.0, "review": "I prefer this to my Apple TV.  Amazon's interface is better than Apple's.  This stick is plenty powerful enough for HD watching.  Only real downside is that I can't use airplay, but I knew that going in.", "verified": true, "helpfulness": "0/0", "author": "jgeod"}, {"rating": 5.0, "review": "The Fire stick exceeded my expectations. Very easy set up with a host of options to watch TV, movies, Netflix...etc. The remote is the biggest takeaway for me. You do have the option to download the app and use your phone. More options that Google Chromecast and at the right price point.", "verified": true, "helpfulness": "0/0", "author": "A. Little"}, {"rating": 5.0, "review": "I love this product. It works very well. I'm able to watch most of the things I want to watch and there are a few little games that my kids can play on it. I just canceled cable and this is a really good way to get in some TV without the high cost of cable!", "verified": true, "helpfulness": "0/0", "author": "N. Rumeau"}, {"rating": 5.0, "review": "easy to use and great device for traveling!", "verified": true, "helpfulness": "0/0", "author": "PKAK"}, {"rating": 4.0, "review": "So far I like the idea of the Fire TV Stick. I was under the impression that some of the apps were included, such as Netflix, HBO Go etc... But it's great once you make the purchase of the applications.", "verified": true, "helpfulness": "0/0", "author": "M. Elliott"}, {"rating": 5.0, "review": "I love my fire stick. It is so easy to use and reasonably priced. I ordered another one and plan on ordering more for presents for family.", "verified": true, "helpfulness": "0/0", "author": "sandy h"}, {"rating": 5.0, "review": "Quick and easy setup. Plan to get another one for other tvs.", "verified": true, "helpfulness": "0/0", "author": "Kristy Robertson"}]