[{"rating": 5.0, "review": "Love the new fire stick.  It was very easy to set up and navigate.  I have not tried streaming movies yet but plan to this weekend.  It shipped quickly and a good price.", "verified": true, "helpfulness": "0/0", "author": "Ann Madden"}, {"rating": 5.0, "review": "Great product, easy to install and use, fast and clear! highly recommneded!", "verified": true, "helpfulness": "0/0", "author": "Tong Song"}, {"rating": 3.0, "review": "I love my fire stick...or I did, for that one sweet day when it worked.  Then my remote went haywire, and pushing any directional button would cause it to act like you were holding the button down, making it impossible to browse or select anything to watch.  I contacted customer support, and they were awesome, as usual, and offered a replacement, which I gladly accepted.  The only issue now is that I have to wait a month for the replacement (after preordering and waiting a month for the original), and then find out whether or not the replacement works.I gave three stars because I didn't get a good product, and it will be a while before I get my replacement to find out whether or not that will have issues as well.  That said, when it did work, it was awesome, and I was really bummed to switch back to my roku, because the fire stick apps are much better than the roku.", "verified": true, "helpfulness": "0/0", "author": "liz"}, {"rating": 2.0, "review": "Very slow on wifi. It gets stuck I could not watch a movie on amazon prime instead watched it on my laptop.", "verified": true, "helpfulness": "0/0", "author": "Raveendra Hegde"}, {"rating": 5.0, "review": "This thing is pretty damn nifty.  The interface is slick, easy to use, and snappy.  Would buy again.My only complaint is that it won't run 'full power' off of a standard USB connection as found on most modern TVs and requires a power source to be most effective.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "Rogerjon A. Blanco \"Rogerjon\""}, {"rating": 3.0, "review": "Setup was bumpy.Lots of restarts on failed update.Lots of updates.Operation of device is flawless.", "verified": true, "helpfulness": "0/0", "author": "John W."}, {"rating": 1.0, "review": "Lousy user interface. Associated Android app is primitive and hyper-reactive making it nearly useless. The device only seem to  work with the USB based wall power adapter which is included. Using the USB port on my Samsung TV did not work. The on-screen instructions during setup were confusing. The wording made it seem like using the provided power adapter was only recommended, when indeed it was required. I was ready to return the device thinking it was defective, but decided to use the power adapter as a last try when I was able to complete the setup.Oh, and the remote is nearly impossible to open to put the battery in!! Who approved the design of the remote? Just amazing!", "verified": true, "helpfulness": "3/5", "author": "Jay"}, {"rating": 5.0, "review": "Easy install, easy setup and I love the remote and Android application.  I was up and running in minutes.I don't think I'll miss the voice search of the Amazon Fire TV, but we'll see how that goes.  Picture quality is fantastic.", "verified": true, "helpfulness": "0/0", "author": "DJK"}, {"rating": 5.0, "review": "Yes, it takes a little getting used to how to use it , but, I have a Chrome stick, Sony player, blue-ray player, and Wii  which I have used for streaming and the picture quality with this is noticeably crisper and clearer and less buffering which I was getting even with my 50mbps connection.  I do wish it would work with Serviio for streaming videos from my PC but Plex gets the job done.", "verified": true, "helpfulness": "0/0", "author": "Timothy L Lyssy"}]