[{"rating": 1.0, "review": "Slow to process. I have wireless 5 feet away so it's not connection. Gets warm. Lags apps like YouTube. Oh, and now I get 20 emails asking me to rate \"dora\" because the kids watched it. A little disappointed on this one amazon.", "verified": true, "helpfulness": "0/0", "author": "seattle protection"}, {"rating": 5.0, "review": "I was a little concerned about buying this from reading the negative reviews, but I really love the firestick. I was sick of not being able to easily see my favorite tv shows or having to pay $2.99 to watch them, but with a prime membership I finally get to watch all those shows that are just not available on Netflix.  Keep in mind though, that this fire stick is ONLY worth it if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Andrew M. Nesbitt"}, {"rating": 5.0, "review": "Easy to install and works very well.", "verified": true, "helpfulness": "0/0", "author": "JJ Fountain Inn, SC"}, {"rating": 5.0, "review": "It is absolutely amazing and worth way more than it costs. We love it! The things you can do with it are so endless that I still haven't figured them all out. Love, love, love this product! We prefer using it over our smart tv!", "verified": true, "helpfulness": "0/0", "author": "Nikki W."}, {"rating": 2.0, "review": "I find that the Amazon Fire Stick is a very nice product for watching innumerable media, it has a bit of a learning curve.  My complaint is mostly that streams either get interrupted or stop sometimes, especially if you are not close within a couple of feet from your wireless access point.", "verified": true, "helpfulness": "0/0", "author": "Nicolas Estava"}, {"rating": 5.0, "review": "Easy plug in and play. Great value!", "verified": true, "helpfulness": "0/0", "author": "Robert Wainer"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Aneudi M."}, {"rating": 2.0, "review": "The search interface is horrible! Trying to use it on my iPad was nearly impossible. The swiping drives me crazy. I went back to my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "H. Walker \"Beach Bum\""}, {"rating": 1.0, "review": "The wifi is very slow", "verified": true, "helpfulness": "0/0", "author": "Carlos Cardenas"}, {"rating": 2.0, "review": "Did not meet my needs.  Drop the signal to often.", "verified": true, "helpfulness": "0/0", "author": "Martha Blake Norman"}]