[{"rating": 4.0, "review": "Fire stick works great, my only issue with it is the length of the HDMI cable extender. If it were about 2 inches longer, would make it even easier to install on my wall-mounted TV. As it is now, it's a bit pinched, and it was difficult to get it plugged in in a tight spot, but hopefully it will be okay long term.The OS, menus, remote are all easy to use, very intuitive interface. Good streaming experience so far, except for Netflix. Seem to get more screen pixelation/distortion on the Fire version of Netflix than when I go through my DVD player, but that could be issues with the Netflix app that are beyond Amazon's control. We'll see if it improves over time as the apps evolve and are updated.Good product overall, good entertainment value.", "verified": true, "helpfulness": "1/1", "author": "Matthew M Scotten \"matt@zunar.com\""}, {"rating": 3.0, "review": "Other than having to be in super close range of the WiFi,  this gadget is awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Movies are not very new.", "verified": true, "helpfulness": "0/0", "author": "Lynn McKenzie"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kristy Walat"}, {"rating": 5.0, "review": "Nice.. Easy... Alternative to ROKU.. Easy and intuitive to run..  Keeps place in videos watched nicely... Easy to setup... Made especially for Amazon Prime Users IMHO.  I had option to buy the newest Roku or this.. Price was not an object.  I would have paid for this, having used it for 1 week over a free Roku if it were given to me.  No slam on Roku... I just like this, as a Amazon Prime user much better.  EASY to navigate free prime video selection.. easy to clear out past searches if desired... Generally a nice unit plus it is dirt dirt cheap.  NOTE... I am plugging the fire stick into the included wall wart  and using external power vs letting it be USB powered.  No special reason other than the instructions recommended it.  There is a nice free Apple app to use with it in case you misplace the hand controls.  Nice touch.  Nothing else to buy and the only footprint on my desk is the TV.  I am sure Amazon did this to sweeten the pot to encourage Prime use.  OK.. No problem with that.  Sort of made up for the price increase this year.  It is still the best deal going IMHO.", "verified": true, "helpfulness": "0/0", "author": "KenBar"}, {"rating": 5.0, "review": "Love it. Works exactly as advertised. I've replaced my cable.", "verified": true, "helpfulness": "0/0", "author": "Jayme Cardillo"}, {"rating": 2.0, "review": "Not as great as advertised.....instructions not clear....only free shows are over 5 years old.", "verified": true, "helpfulness": "0/1", "author": "Rose"}, {"rating": 5.0, "review": "Way better than my roku stick", "verified": true, "helpfulness": "0/0", "author": "vaughn logan"}, {"rating": 5.0, "review": "love it fantastic picture quakity and speed. vitually no streaming problems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as promised out of the box. Ready to go in about 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Dan Lopez"}]