[{"rating": 5.0, "review": "I installed unit about 3-days ago and I am extremely satisfied with the product, it is quick, the remote is user friendly and the price was great, can't ask for than that .", "verified": true, "helpfulness": "0/0", "author": "Richard Truex"}, {"rating": 5.0, "review": "Buy this now!! It will turn your non-smart tv into a smart tv!! We have a flat screen 40\" in our bedroom and this Fire Stick amazes me, I'm so glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Stephanie H."}, {"rating": 5.0, "review": "Awesome. Love it!  I have an Apple TV that I like for different reasons, but the Fire Stick does what I need and is great for travel! Also love the ease of Prime movies and music!", "verified": true, "helpfulness": "0/0", "author": "Kent Burnett"}, {"rating": 5.0, "review": "I wasn't sure about Fire TV at first, but am in LOVE with it after just a few days! HD is shoddy though for Netflix and some of my channels. That could be my internet, but am excited to try on another TV to see how it goes.", "verified": true, "helpfulness": "0/0", "author": "Alixe Ingoglia"}, {"rating": 2.0, "review": "Biggest problem - It takes over HDMI input. It doesn't allow the monitor to switch to other sources, even when the Fire TV stick is off, and even when I specifically switch to other source on the TV/Monitor (it switches back immediately). It does this on both the computer monitor and the TV monitor.Also, I did not realize this doesn't have bluetooth headphone options. I was planning on using this with the monitor in the bedroom, where I need it quiet. So it is not as useful (for me) as I had expected. I guess you need to get the FireTV (not the Stick) for that, even though the Technical Details shows the same bluetooth profiles for both devices.I can see the use for this if you don't have a computer connection or a smart TV. Otherwise, it just limits what you can do.", "verified": true, "helpfulness": "0/0", "author": "EdSaid"}, {"rating": 5.0, "review": "I bought this for $20 for the offer to Prime member. I have my doubts, but for $20 why not?I have no regrets to do it. It is great device, with all the apps I need and finally I can see amazon prime movies without using my laptop. I think it is better that Chromecast and a must if you are amazon prime member and want to stream prime music or video in your TV. Recently I bought another for my sister and my brother in law and they love it. Actually the stop using their Chromecast. I recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Juan Corona \"Johnny Crown\""}, {"rating": 4.0, "review": "I love it....", "verified": true, "helpfulness": "0/1", "author": "shantay parker"}, {"rating": 5.0, "review": "I really like the Amazon Fire Stick", "verified": true, "helpfulness": "0/1", "author": "Sharita warren"}, {"rating": 5.0, "review": "Enjoy watching my prime movies and tv series on my flat screen as well as my prime music playlists.  Only drawback...having to enter your PIN every single time you switch or change movies.", "verified": true, "helpfulness": "0/1", "author": "K B"}, {"rating": 4.0, "review": "Works great, easy to switch from TV to TV", "verified": true, "helpfulness": "0/1", "author": "Enoch Contractor"}]