[{"rating": 1.0, "review": "Don't seen the advantage. Everything my wife watches, reruns of NCIS cost to watch. Am I missing something?", "verified": true, "helpfulness": "0/0", "author": "Jerry Bryant"}, {"rating": 4.0, "review": "I'm enjoying this product, however, it seems to wreck havoc on my OTA antenna signal. When I want to watch TV, I'm forced to unplug the Stick from the HDMI port. Considering the regular Fire TV if it would remedy the situation. Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "C. Ryan Woolsey"}, {"rating": 4.0, "review": "The Firestick seems to function as advertised. Short HDMI extension cable could be a few inches longer. Remote is too small. Button markings are small, hard to see. There are no markings on 5 of them. Picture stutters occasionally, probably due to WiFi. Works better than my Samsung S4 for watching Netflix.", "verified": true, "helpfulness": "0/0", "author": "Barton P."}, {"rating": 3.0, "review": "Good product, but you're forced to have Amazon Prime.Amazon prime is too expensive.I ordered 2 fireTV stick and after the price increase, I canceled the order.Will not order another stick again.", "verified": true, "helpfulness": "0/0", "author": "Rj"}, {"rating": 5.0, "review": "I love it.  I use it every single day! I just love this thing. I don't know what I would do without it it turned my regular flat screen TV into a smart TV pretty much as what it did and I love it!", "verified": true, "helpfulness": "0/0", "author": "Charleen Burns"}, {"rating": 5.0, "review": "I've been a Prime member for years and enjoy the many features and benefits. I just received the fire stix as a gift and was skeptical. How much TV can one watch - especially if your an avid Kindle reader? I must say ... I love this. Simple beyond words to install and a great library to chose from when you just want a classic or a movie missed. Performance is fast and so far not remotely \"glitchy\" as some have said. If your in the market for simple \"on demand\" viewing at very reasonable or no cost - I'd rate this a home run!  Thanks again Amazon!", "verified": true, "helpfulness": "0/0", "author": "Romeyd \"Newf Traveler\""}, {"rating": 4.0, "review": "I love it because it works good with my projector", "verified": true, "helpfulness": "0/0", "author": "lisa maull"}, {"rating": 5.0, "review": "Easy setup, fast access too content, the best way to watch Amazon prime, Netflix and so much more! Ended up buying a second Fire stick! Thank you Amazon😁!", "verified": true, "helpfulness": "0/0", "author": "Jerome J Burkavage"}, {"rating": 5.0, "review": "It is so easy to use than streaming through a game console. Much better feature as well. Also easy to bring around the household because gaming console cannot do that.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 2.0, "review": "The Fire TV Stick offers much promise, and is very intuitive to use.  But when streaming videos through non-Amazon apps, the device freezes up more than occasionally.  For example, at least twice a week I will be watching a workout video on DailyBurn (supported by Hulu) and the video will freeze, with the Fire TV Stick and remote rendered inoperable.  Even after a \"hard reboot\" the problem is not always fixed.  Again, a lot of promise with this device, but some debugging is needed. I'm wondering if Google Chromecast or even the more powerful Fire TV would perform better, albeit at higher cost.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Arevalo"}]