[{"rating": 5.0, "review": "Love how easy it is to use!", "verified": true, "helpfulness": "0/0", "author": "Darlene"}, {"rating": 5.0, "review": "Works Great, Easy set up", "verified": true, "helpfulness": "0/0", "author": "amy kitts"}, {"rating": 5.0, "review": "What a great device.  Since I'm already a prime member it's just free TV for me.  There are shows on there that aren't on Netflix so having both is great.  Love the fact that I could download an app on my phone to use as a remote control (for those times when the real remote is hidden between couch cushions). This works so much better than my current Blue Ray player for that I plan to buy a second one.", "verified": true, "helpfulness": "0/0", "author": "elvis14"}, {"rating": 3.0, "review": "Same as Fire TV", "verified": true, "helpfulness": "0/0", "author": "Dirk Tripke"}, {"rating": 4.0, "review": "Difficult to set-up and to sync with computer, but once you get the hang of it - it is great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am still new to this and learning as I go. The one disappointment is that so few programs are free.", "verified": true, "helpfulness": "0/0", "author": "Joyce Frederick"}, {"rating": 5.0, "review": "Love having this in my bedroom to watch my Amazon Prime movies", "verified": true, "helpfulness": "0/0", "author": "Elisabeth Bedgood"}, {"rating": 5.0, "review": "Love it! So easy - even I figured it out! Thank you Amazon as always for a really fine product!", "verified": true, "helpfulness": "0/0", "author": "Candy"}, {"rating": 5.0, "review": "Awesome device easy to use to update any TV with HDMI to a smart TV", "verified": true, "helpfulness": "0/0", "author": "BDL"}, {"rating": 2.0, "review": "The product description claims the fire stick is portable so you can use it in TVs all over your home. However, they fail to inform the consumer it is recommended that the fire stick be within 10 feet or LESS of the Wifi router. I didn't find this out until calling customer service because we were unable to get a decent connection for more than a few seconds on our family room TV (25 feet from the Wifi router). The product works ok on our TV next to the Wifi, otherwise it is useless.", "verified": true, "helpfulness": "0/0", "author": "Stephanie E. Dobrowolski \"Bridge Over the River Kwai\""}]