[{"rating": 1.0, "review": "Used it for the first time. In the first 5 mins it froze and restarted it self.  Tried it for 30 mins and it restarted or froze 10 times while stating wifi connection issues.  Move it next to the router and still occurred.  Also tried different power supplies and connecting usb into the TV.  Getting a replacement sent to see if I just got a lemon.", "verified": true, "helpfulness": "1/2", "author": "TwoPeasInAPod"}, {"rating": 4.0, "review": "it turns off every time the TV pauses or is turned off. I have to continually adjust the volume for different applications or stations that I watch. At that point I have to find out which remote will adjust the volume. for some reason I have four remotes associated with my fire stick and I have been unable to find a way to correct that the system will not connect to the Internet without errors", "verified": true, "helpfulness": "0/0", "author": "pj"}, {"rating": 5.0, "review": "Very happy with it so far.  Remote is easy to use and easy to navigate offerings.", "verified": true, "helpfulness": "0/0", "author": "flygirl"}, {"rating": 5.0, "review": "Luv it...", "verified": true, "helpfulness": "0/0", "author": "Ofelia"}, {"rating": 2.0, "review": "The HD quality is very disappointing.  It never really clears up.  I compared The Fire TV Stick head-to-head to Chromecast on my TV and the Chromecast won hands-down every time.", "verified": true, "helpfulness": "0/0", "author": "SEOMike \"SEOMike\""}, {"rating": 5.0, "review": "If you've not purchased a streaming stick yet, and you're a Prime member, the Fire TV Stick is the one to buy.", "verified": true, "helpfulness": "0/0", "author": "Kregg"}, {"rating": 5.0, "review": "Very happy with the fire stick, works really well, there on screen layout and menu are great. Works much smoother, and the remote functions seem to be much more responsive than with my Roku stick", "verified": true, "helpfulness": "0/0", "author": "steven hall"}, {"rating": 5.0, "review": "Works wonderfully!", "verified": true, "helpfulness": "0/1", "author": "Steve West \"Truth in Taxing\""}, {"rating": 4.0, "review": "Overall excellent, easy to set up. But two quibbles: a cluttered on-screen interface; and remote control is sleek, but at the expense of easy opening to insert batteries.", "verified": true, "helpfulness": "0/0", "author": "Don Hogsett at dhogsett@cahners.com"}, {"rating": 5.0, "review": "This replaced an entire laptop that I had dedicated to streaming media.", "verified": true, "helpfulness": "0/0", "author": "Kevin Cheatham"}]