[{"rating": 5.0, "review": "Recommended by a friend - wish I would have bought this when Amazon offered it for $20.  We don't have cable and I had an extra flat screen I did not want to have to buy an antenna for to get 'free tv' which I hardly watch. BUT...this gives me internet connection on that TV and I can watch my Amazon Prime, Hulu Plus, Net Flix and you tube shows.  This was extremely simple.  I did not even cuss one time.  Buying another one for the travel trailer.", "verified": true, "helpfulness": "0/0", "author": "Nelle"}, {"rating": 5.0, "review": "Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "James Cottrell"}, {"rating": 5.0, "review": "Inexpensive and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Stephen Gregg"}, {"rating": 5.0, "review": "I love it and it was so easy to use and start watching shows immediately. This is going to pay for itself in two weeks without the satellite.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 1.0, "review": "It does NOT work. I tried it and it did not work. I want my money back. I feel very angry and taken advantage of by amazon and the makers of amazon fire. It really makes me feel like I can't even get a modern television to work.", "verified": true, "helpfulness": "0/1", "author": "Ali"}, {"rating": 5.0, "review": "Its totally awesome and it was easy to set up", "verified": true, "helpfulness": "0/0", "author": "Linda Lanfair"}, {"rating": 5.0, "review": "The instructions included were very clear and easy to follow.", "verified": true, "helpfulness": "0/0", "author": "Maria Williams"}, {"rating": 5.0, "review": "Does everything that was promised. Who could ask for more.", "verified": true, "helpfulness": "0/1", "author": "Michael H."}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "brian rock"}, {"rating": 4.0, "review": "easy to set up and nice flexibility on one of my older tv's", "verified": true, "helpfulness": "0/0", "author": "Kevin Hickey"}]