[{"rating": 5.0, "review": "Been using a jailbroke Apple TV 2 for past 4 years or so and this thing blows it out of the water in speed and functionality.  Load Kodi ( XBMC) on it and this thing is amazing. Using the  Slingplayer app is like having another DVR in the bedroom.", "verified": false, "helpfulness": "1/1", "author": "Elizabeth"}, {"rating": 5.0, "review": "Fantastic it's clearer than,Cox cable that I have contour on with 6 programs and the newest box by ushering this web tv,as I call it its great we have Googlec crome I wish a option was the talk to clicker but it's notv", "verified": true, "helpfulness": "1/1", "author": "Michael Kelleher"}, {"rating": 3.0, "review": "I just got the Stick the other day to replace another device we were using for streaming and I would have to say I am pretty impressed. Setup was simple and it's connection to my network is better than my other device. Picture quality looked good streaming Netflix. The interface to navigate through the different menus works pretty well. The remote isn't exactly the most robust remote out there but you can use your phone as a remote which I have not tested yet. One of my gripes is the only way to turn it totally off is to unplug it otherwise it simply goes to sleep mode but it's not a deal breaker.Update - After having had it for enough time to get a good amount of streaming in I am downgrading one star. I have run in to regular issues with delays in the response of button pushes on the remote or no response at all. Unplugging the Stick then powering it back up seems to solve the issue at least temporarily. When it is streaming it works great but being unable to navigate properly is a huge drawback. Hopefully this can be fixed in a firmware update and I would upgrade my rating.", "verified": true, "helpfulness": "2/2", "author": "drumenigma"}, {"rating": 1.0, "review": "Good !", "verified": true, "helpfulness": "1/6", "author": "mtorma"}, {"rating": 5.0, "review": "Easy to use and enjoy the selection.  Owner of 4 now.", "verified": true, "helpfulness": "2/2", "author": "Cindy Latimore"}, {"rating": 4.0, "review": "fire stick works fine - Hughes net sucksHughes net is too slow a down speed to watch streaming movies, the movie keep stopping every 5 minutes to load.", "verified": true, "helpfulness": "3/3", "author": "Tim Sveen"}, {"rating": 5.0, "review": "Works great.  Easy to install.", "verified": true, "helpfulness": "3/3", "author": "Gene R."}, {"rating": 5.0, "review": "thanks had to send it back", "verified": true, "helpfulness": "0/0", "author": "philip seger"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "2/3", "author": "Janet M"}, {"rating": 1.0, "review": "hard to use and the only apps you can get cost $$$ unless you want movie trailers! $$ then you have to watch ads too!", "verified": true, "helpfulness": "0/2", "author": "Rhonda Timmers"}]