[{"rating": 4.0, "review": "My original review was One star because of...I want to like it, and it seemed good in my limited use when it worked, but it hasn't been worth the horse S time dealing with it. I got one, did the power-cycling on all devices (Fire Stick, Modem, Router); didn't work. Did tech support, and nothing. Chalked it up as a lemon. Returned, got another and same WIFI connection problems. Everything is \"Currently Unavailable\" or I am \"Connected with problems\".No issue on my laptops (2), PS3, iPhone, iPod, Galaxy Tab, Sony Smart Blu-Ray player or any other number of devices that have connected with my network along the way.Even if it is MY network/router, it SHOULDN'T be - as in, the device should be able to operate just as any of the other devices HAVE and DO.Pretty disappointing, to be honest. I love Amazon's services, but their devices have been misses (Kindle Fire and now this) with me.Lack of stock, currently, and at this point, I would just wait for a second generation.*** Update 1/16/2015I took a few nights and forgot about my headache with the unit. I had the opportunity to take the unit to my Uncle's house and signed in without issue there. In saying that, I was able to update the software there, came home, plugged it in after another hard reset of my router (which I did originally, as well), and it WORKED! I like it a lot now that it is functional. Fast, good response, good picture, the sound is a little low but fine, and the apps thus far seem good/great. The addition of Amazon music and photo viewer capabilities, is awesome as well! I do enjoy the product now that it works, and if it wasn't for the HEADACHES, I would LOVE it.", "verified": true, "helpfulness": "1/2", "author": "M"}, {"rating": 3.0, "review": "I have both ROKU and the Fire Stick (FS). I bought the FS when it was available the Prime Members for $20 and because I was running into issues with the ROKU not connecting , reliably, to my work WiFi (after consulting our it department and various blogs determined the ROKU WiFi is finicky. The FS connects to what ever WiFi network I challenge it with unconditionally. So, why 3 stars. It promised Showtime, which it has, however, unlike the ROKU it doesn't support Showtime if the provider is DirectTV (or DirectTV doesn't support the FS). This is huge for me as I have DirectTV and can not take advantage of Showtime and I suspect I will have the same issue with HBO. I do have Netflix and Amazon Prime, both work flawlessly. I might not have bought the FS had I known about the lack of Showtime support. If anyone has a solution to this issue, I'd appreciate a notification.A less important criticism, unlike the ROKU the FS can not be powered from the TV USB port, which is significantly more convenient, especially when traveling to hotels and trying to find a spare plug.", "verified": true, "helpfulness": "1/1", "author": "Drmaverick_tx"}, {"rating": 4.0, "review": "Love it but the roku stick does have more apps and channels.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this thing. You can turn just about any TV into a video streaming TV. I went around the house plugging it in to different TV's and it worked on all of them. We currently have Roku boxes but now can move this device from TV to TV instead of having a dedicated streaming device permanently attached to each TV.", "verified": true, "helpfulness": "0/0", "author": "Dipper Foxtrot"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "danielpanduro"}, {"rating": 5.0, "review": "Love it! It was so easy we plugged it in and immediatley watched a movie. Of course, prime is the best.", "verified": true, "helpfulness": "0/0", "author": "Carol Ann Pelton"}, {"rating": 4.0, "review": "So far so good. I like the smooth operation of the programming and services on it. Just wish I could mirror some things from my phone on it.", "verified": true, "helpfulness": "0/0", "author": "Guillermo"}, {"rating": 5.0, "review": "What a nice product.I'd been using a Chromecast in the living room, and my girlfriend loves watching Netflix.  The Chromecast refuses to connect to the best wifi band we have in the house, so it was spotty and clunky.  Plus it's not terribly intuitive for non-techies to use.  The Fire Stick, which i preordered for $20, is great.  Fast smooth streaming, great interface, and aside from not having Play movies on it, solves the girlfriend problem.", "verified": true, "helpfulness": "0/0", "author": "John Paul"}, {"rating": 5.0, "review": "Can't stop watching Netflix and YouTube on this thing!! The picture quality looks soo amazing since it uses the HDMI port and the sound is great too. Its easy to setup and install apps and what not. Its very fast at connecting to apps and also downloading them. Only complaint I have is that I wish there was a Sleep/Power button on the remote so that you could actually put the unit to sleep or turn it off when your not using it from the actual remote rather than having to navigate through the menus to the settings.", "verified": true, "helpfulness": "0/0", "author": "Isaih Mecalco"}, {"rating": 2.0, "review": "If you are someone with a visual or other disability, I'm afraid this product is more than likely not for you. First of all, unlike the Apple TV, which has the Voiceover feature, which works much like the one on the I Phone ,  the Fire Stick does not. That doesn't  mean you absolutely won't be able to use it, but bear in mind, it may be much harder, especially when first setting it up, because you'll need someone with you who can read the screen and imput the network and other introductory information to start using it. This unit is supposed to be capable of being controlled with the Amazon Fire Remote Ap, which has only been available on I O S  for less than a month. The problem I ran in to was for what ever reason, I wasn't able to pair the phone with the device. You may want to consult others who don't see well , if they've reviewed this product before you buy, because it is possible Amazon may have worked out the bugs already, but since I've ended up returning mine, I can't honestly say. The other issue I O S users face is if you have trouble with the Ap, you will have to call Apple instead of Amazon, and speak to their customer service team, and they do a good job and will spend lots of time with you. Amazon's customer service team as far as I could tell only was able to help with Androyd Aps bought on Amazon's Ap store, its kind of an inconvenience, but worth knowing in advance. I'm sure it works well, if you're able to see well enough to use it, and it is possible that within the Androyd platform there are aps that may let those with any disability use it easily enough. It is very compact and discreetly fits on the back of your TV, and the remote is simple enough. I must say though, I'm not sure how durable it will be, because it seems construction wise rather fragile, and with a regular price of $39, though sugnificantly less than the Apple TV, it seems like it should be possible to make something compact, but still able to with stand, being accidently dropped, or even lightly stepped on. I don't think the fire stick fits those criteria and therefore I believe it earns a low rating.", "verified": true, "helpfulness": "0/0", "author": "Jason Luokka"}]