[{"rating": 4.0, "review": "We have a roku, chromecast and apple tv (first gen) but like this one the best so far... way more apps then the others.", "verified": true, "helpfulness": "0/0", "author": "Jennifer L Drake"}, {"rating": 5.0, "review": "This was a Christmas gift from my son and I absolutely LOVE it. It's easy to operate, and functions extremely well--it does everything it claims it will.", "verified": true, "helpfulness": "0/0", "author": "MzMVH"}, {"rating": 2.0, "review": "Showtime Anytime no longer working. I was able to watch shows and movies now everything on Showtime gives me an error message on this Stick. I then tried accessing Showtime Anytime on my ipad 2 and it works fine.  Same wifi, same Showtime provider account and everything, only the device is different. So what is it with Fire Stick and Showtime Anytime?", "verified": true, "helpfulness": "1/1", "author": "TV Guru"}, {"rating": 5.0, "review": "I absolutely love it! Hooked it up, easy! Immediately it started to work and responds to the remote fast. I have another similar device that works, but I have to jump through hoops to connect it and find what I want to watch and its slow. I love the Fire TV Stick and would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Pat Foley"}, {"rating": 4.0, "review": "Overall, I'm happy with my Fire TV Stick. It works like a charm and the streaming is flawless. However, I wasn't expecting to have to download apps for every service available for the Fire TV Stick.In addition, I was disappointed that Amazon didn't warn any of us that some services might not be available. Since I don't have cable, but have legit access to DirecTV logins, I was looking forward to History Channel, A&E;, Showtime Anytime, HBOGo when it's available, and others - all in one place. Sadly, DTV and Amazon have not reached an agreement and although these channels and more are available to DTV users through Roku, Apple TV, and other products, they are not available to us on the Fire TV Stick. It would be polite of Amazon to address this issue, and advise when an agreement might be reached and those channels would be available.That said, the services I AM able to get are worth the price of the stick, and the time it takes to download all the apps, just to have this access all in one place, and recommend it to my friends - even those who only have DTV logins. :)", "verified": true, "helpfulness": "0/0", "author": "Lynda Williams"}, {"rating": 5.0, "review": "I love my FireStick!  It connects instantly. Mirrors my Kindle Fire in a snap. The picture is clear and sharp. The only thing that gives me pause is the remote. It's just so small. I'm afraid I'll lose it. The service should come with two remotes. I can use all the services I love like Prime and Netflix. This is one of my best purchases. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I've only had the Firestick for a few days and almost every time I try to watch a tv show or a movie I get messages saying my internet connection is too slow or the movie constantly cuts out because it buffers.  I have Roku, XBox One and PC's all connected to the internet and they all work fine, so I assume the problem is with the FireStick.  I had ChromeCast in the tv before I received the Firestick and never had buffering issues with.  So far I give this Firestick a thumbs down.  I have a business account with cox and my internet speeds are very quick.  Very disappointed with the FireStick.", "verified": true, "helpfulness": "1/1", "author": "CTau"}, {"rating": 4.0, "review": "I've only had it for a few days, but so far it's working pretty well.  It DOES drop WiFi more than I appreciate.  Probably once or twice a day.  That is by far the biggest gripe.  PLEASE FIX THE WIFI DROPPING ISSUE!!The Netflix app plays video like it's been through a Crayola filter or something.  I'm not sure if there's something I can do to make the video quality on that app better, but it's the worst way I've ever tried to watch Netflix (iPhone, Windows Phone, Xbox 360 and One, browser based all work fine here).  The video quality of all the prime stuff and Hulu has been great though.Since I paid very little for this I'm quite happy with the purchase.  The WiFi dropping is really the only issue I have with the device itself.  The Netflix app should be fixable by Netflix so I can't hardly dis the fire stick for that.  I would definitely suggest this to friends and family.", "verified": true, "helpfulness": "1/1", "author": "Patrick Bruton"}, {"rating": 5.0, "review": "I originally bought and tried the ChromeCast, but I returned it because it wasn't compatible with some of my devices (I.e.: kindle fire) without installing clunky 3rd party apps. I'm glad I did. The FireStick is fast superior. It does everything that the ChromeCast did, but without using outside devices. Best of all, the picture quality is much better, in my opinion. The only", "verified": true, "helpfulness": "1/1", "author": "CapnCaveman"}, {"rating": 1.0, "review": "I don't see a significant benefit.  Too many of the major network shows require additional payment to watch.  For example, old episodes of Castle,require payment while they are available from other sources.  I wouldn't recommend this product at all, which is unfortunate because I like Amazon.  This product shows no significant benefit over other online resources.", "verified": true, "helpfulness": "1/1", "author": "M. Kearon \"M.E.K\""}]