[{"rating": 5.0, "review": "It has been a great product, enjoyed by all.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "They really need better support for MiraCast and screen casting in general.  It's very spotty to date and I haven't seen much of a commitment to addressing this shortcoming.  It's great otherwise, but screen casting was a primary use case for me.", "verified": true, "helpfulness": "0/0", "author": "rayman"}, {"rating": 1.0, "review": "I just received my Amazon Fire TV stick about a week ago.  The stick gets really hot.  It keeps dropping the wireless connection and says it's unable to playback.", "verified": true, "helpfulness": "0/0", "author": "Metty Moop"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Very disappointed -- HBO Go will not work with a Charter Cable subscription (works fine with Roku, etc.).....and appears that if I had a different cable provider (which is not an option)....it would also work fine.Amazon needs to work this out with Charter....I'm thinking of returning it.It does work well with Netflix, etc...", "verified": true, "helpfulness": "0/0", "author": "Matthew Looney"}, {"rating": 3.0, "review": "Got this with the SlingTv promo. The stick works fine with regular video but SlingTv sucks. Any live TV on the stick is not only not live because it's two or more minutes behind but it's constantly cutting out and buffering at least several times a minute. So you're actually watching it cut out to buffer more than watching TV. I even quadrupled my Internet speed and checked the speed with multiple speed checking apps to insure an awesome connection with the same results.", "verified": true, "helpfulness": "0/0", "author": "Douglas Mackey"}, {"rating": 5.0, "review": "Excellent streaming device. I bought the chromecast when it came out and then another when the price dropped. One died so I gave the fire stick a shot. Kind of wish I had gotten this from the get go. Both the chromecast and the fire stick have their advantages and disadvantages but I'd definitely take the latter any day.", "verified": true, "helpfulness": "0/0", "author": "Ian Higgins"}, {"rating": 5.0, "review": "Nice Purchace delivery ontime", "verified": true, "helpfulness": "0/0", "author": "Abraham Jim"}, {"rating": 2.0, "review": "Not happy with it at all!! It won't stay connected to our WiFi for anything. We wanted this for our bedroom TV and it won't stay connected. Very disappointed!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "Like it very much", "verified": true, "helpfulness": "0/0", "author": "william p gallagher"}]