[{"rating": 5.0, "review": "Works excellant, terrific price.", "verified": true, "helpfulness": "0/0", "author": "Don Huettner"}, {"rating": 2.0, "review": "Streaming video varies from poor to moderately choppy. Sound is fine. The remote loses connection frequently. The FireTV app (on many devices) loses connection even more frequently. I have been unable to screen-cast, trying hard with Windows 8.1 notebook (attempting MiraCast), Nexus, iPhone 5S, iPad, Samsung Galaxy S5. The devices don't find the Fire TV Stick, even though the Fire TV Stick is in Mirror mode.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "My Fire stick doesn't recognize my Prime Account.", "verified": false, "helpfulness": "1/2", "author": "Aenis"}, {"rating": 5.0, "review": "GREAT DEVICE,GREAT PRICE", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Luicci"}, {"rating": 5.0, "review": "Setup was quick and easy.  To install, plug it into the TV's HDMI port, and connect the power source and you're done.  Once the unit turns on, just choose your wireless network, give it the password if any, and you're done with the basic setup.  The unit will check for updates once connected to the internet and then boot up.  There is a useful introduction video that plays when you turn the unit on for the first time to help you get acquainted with the controls and menus and you're set.  I had installed apps and was watching shows in just a few minutes.My favorite part is that the unit is small enough to hide behind the TV and the remote doesn't need to be in the line of sight.  If you want to keep your setup looking streamlined, the Amazon Fire Stick is awesome.", "verified": true, "helpfulness": "1/1", "author": "J. Naylor"}, {"rating": 5.0, "review": "Amaaaaaaaaazing", "verified": true, "helpfulness": "0/0", "author": "sazzam"}, {"rating": 5.0, "review": "I would recommend this to anyone who travels year round as I do. Small but full of options", "verified": true, "helpfulness": "1/1", "author": "Will Johnson"}, {"rating": 2.0, "review": "The Fire TV Stick is a nice product, but it  doesn't even get close to ROKU or Chromecast. First the number of actual usable Video applications is pitiful compared to Roku.  The Fire Stick interface is way too much about Prime and Amazon Instant Video and other apps like Netflix take a back seat. The arrangement of apps is terrible. Where you should at least be able to arrange applications in some order you really have no choice games, TV, Movies, New and Internet applications are all clumped in one big mess with no usable ability to arrange them as you like. Seriously Amazon, the user interface needs to be a less Amazon and a little more fair and balanced. I expect Amazon could fix all this will a software upgrade and I would strongly suggest they get with it.With that said the big plus is the Fire TV Stick has much more memory and pretty much starts playing instantly.If Amazon would fix the interface so that your apps are organizable and all apps were on an equal footing with Amazon product this would be a pretty darn great product. As it is you feel like you spent your money on a product designed to promote Amazon product over anything and everything else.", "verified": true, "helpfulness": "0/0", "author": "Bubba \"Bubba\""}, {"rating": 5.0, "review": "Easy to use and had a great amount of apps. Just plug in and go :-) we plan to order anothe one for our family room.", "verified": true, "helpfulness": "1/1", "author": "Nicole Curry"}, {"rating": 5.0, "review": "Great product !", "verified": true, "helpfulness": "1/1", "author": "lulu"}]