[{"rating": 1.0, "review": "Would love to write a review of the Fire TV Stick, however it's back ordered. So glad that they made sure that BEST BUY for their shipment instead of fulfilling their PRE-ORDERS.", "verified": true, "helpfulness": "9/18", "author": "Matthew & Jennifer Weyna"}, {"rating": 2.0, "review": "After trying a Roku stick and Chromecast I had high hopes for the Fire TV Stick.  Like the predecessors it to is plagued by abhorrent wireless connection problems. If your TV Stick is located directly above your router it works great but if it's in another room, even when the Network Status states it has a \"very good\" connection it doesn't work properly.Why oh why can't these companies make a device that has remotely equivalent connection capabilities to those in my laptop, phone, tablet, etc.. I can stream netflix w/o issue in HD on all of those devices but all I get is buffering on the Fire TV Stick and the Chromecast and Roku Stick I tried.Not worth even trying out the rest of it as it's not going to work in the room it needs to. Guess I'll continue to leave my laptop plugged in to the TV.Sad...", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 1.0, "review": "As a a prime member where is my Fire STICKll the local stores all have it but i have to wait until DEC 25th to get it what gives?", "verified": true, "helpfulness": "7/16", "author": "cmore"}, {"rating": 1.0, "review": "Total piece of crap!! Bogs down network. Can't use anything else if this is connected. Glad only paid $20. Not worth returning. It's in the trash.", "verified": true, "helpfulness": "0/3", "author": "eric"}, {"rating": 1.0, "review": "Needs a software update right out of the box; minus one star.Update fails five times in a row; minus one star.Searched XDA, Reddit, and Google for a way to skip mandatory update, just so I can try the device; minus one star.Fire Stick will not connect to the android app; minus one star.The Stick fails to buffer as well as a Chromecast, which isn't saying much, but makes streaming terrible.  The Stick will drop connection without warning, prompting a device reboot.  This is as hurried as Android 5.0 and the user experience suffers.For a $40 device, I'd never even consider such a device.  My Chromecast and Roku 3 are more than capable.  At the Prime promo discount of 50% off, it's still a pass.  This thing will only be more successful than the Fire Phone because of the low price, it's still an Amazon product that doesn't do books-only and that means fail.", "verified": true, "helpfulness": "0/0", "author": "F. Ingers"}, {"rating": 3.0, "review": "Just plugged in our new Fire Stick and NO VUDU! We are so disappointed, no way to access our digital video library :-( Still trying to decide whether to keep it or return it for the Roku stick which has VUDU. On the up side it seems to be really fast compared to the Roku2 which is what we had. Really wish it had VUDU because as of now that's the only downfall.", "verified": true, "helpfulness": "1/3", "author": "Krista B."}, {"rating": 4.0, "review": "Great video streaming and my amazon content is available for streaming too.  Awesome little stick.", "verified": true, "helpfulness": "0/0", "author": "Bradley Redford"}, {"rating": 1.0, "review": "The stick has some great capability, but it's flawed by extremely poor Wireless performance. It is 5 feet away from the router , and one bar of signal strength is already lost. Constant buffering makes watching movies miserable. I bought two of these sticks and both perform the same way. Will return them both .....", "verified": true, "helpfulness": "3/6", "author": "Anton Iliev \"AHTOH\""}, {"rating": 5.0, "review": "I pre-ordered it the day it was announced so I got it super cheap - at the price I paid, it's definitely worth it. At full price, probably still worth it - particularly if you are an Amazon Prime member.  I also have a firetv, and this provides almost the same experience, only slightly slower (and cheaper).  Even though it's not as fast as the firetv, it is definitely faster than the Roku stick, which I think is it's main competitor - the Roku stick is slow enough to be annoying.  I also have a chromecast, which some people like to compare this to, but to me, they are completely different animals as the chromecast has no functions without a phone or tablet to send things to it, while this firetv stick can operate without a phone or tablet sending content to it.  As far as recommendations, if you are heavily into amazon and it's media portals, then absolutely this firestick is the way to go, if your not into amazon prime so much and maybe watch more netflix, then the chromecast mght be a better option.", "verified": true, "helpfulness": "2/3", "author": "Ms. T"}, {"rating": 1.0, "review": "Apps do not support Charter as Cable provider. This is pointless. Stick with Roku.", "verified": true, "helpfulness": "0/4", "author": "Nate Swartz \"Zeppelin1521\""}]