[{"rating": 5.0, "review": "I didn't know had to pay for most of the best apps.", "verified": true, "helpfulness": "0/0", "author": "Elvin M."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Maria J Tapia"}, {"rating": 3.0, "review": "Generally, this is a pretty slick little piece of tech, but I have to knock it down from 5 to 3 stars because when I watch video, either on Netflix or Amazon Prime, it goes black every few minutes for a second or two. Sometimes the video picks up, but other times I have to hit play again as it will act as though I hit the pause button. This makes it really distracting and I've gone back to my PS3 for watching videos. I've tried rebooting the unit and it has had no effect. I tend to think it must be a flaw in the stick as it happens with both services.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I love this stick. It's beyond easy to use and loads quickly. I enjoy the beautiful scenes that display when in \"sleep mode\".", "verified": true, "helpfulness": "0/0", "author": "Chelsea Robb"}, {"rating": 5.0, "review": "Pretty freaking sweet :-).  The only thing I wish it had was the ability to control my TV volume as well.", "verified": true, "helpfulness": "0/0", "author": "Bob \"Bob\""}, {"rating": 5.0, "review": "If you are already paying for the amazon prime this is a great tool to go along with it. Plus if you are a huge movie collector like i am its a great way to collect without the clutter of hundreds of movies. My mother has the roku stick, first this ones cheaper, and is already hooked up to your account and second, this comes with so much more. go for it", "verified": true, "helpfulness": "0/0", "author": "Jordan M King"}, {"rating": 5.0, "review": "Plug and play, just the way I like it.", "verified": true, "helpfulness": "0/0", "author": "R. Sherwood \"Better Bagel\""}, {"rating": 3.0, "review": "It's good when it works but seems like once every couple days it'll have to be rebooted as it'll lose wireless connection and not be able to connect.  Once it's rebooted it connects with no issues.  Our Apple TV hasn't been rebooted in months without any issues.  If it was't for having to reboot it so often I would definitely give it 5 stars but it's that much of an inconvenience having to reboot it frequently.  The Fire TV Stick is the only device that has wireless issues, tried both bands and it does it on both.", "verified": true, "helpfulness": "0/0", "author": "Chester"}, {"rating": 5.0, "review": "Managed to buy when it was $20 and it was a steal.  At $39 it is still a great buy.  Small and has an adapter for TVs with crowded HDMI ports.  Streams very quickly and has a wake function so if you push the Home button on the remote it will tell the TV to change inputs.", "verified": true, "helpfulness": "0/0", "author": "Paul K."}, {"rating": 1.0, "review": "The Fire Stick would not cast the screen fom my tablet to my TV which is thenreason I purchased it, so it was returned.", "verified": true, "helpfulness": "0/1", "author": "Xray10"}]