[{"rating": 5.0, "review": "The fire stick did as it was advertised making many shows available a good buy", "verified": true, "helpfulness": "0/0", "author": "Wm. waldron"}, {"rating": 5.0, "review": "Love it. I don't use the amazon prime membership though. Wasn't for me. But the apps you can put on it is endless.", "verified": true, "helpfulness": "0/0", "author": "Tasha"}, {"rating": 5.0, "review": "It is simple to set up and easy to operate. Get to see so many programs, movies etc. And simply love it.", "verified": true, "helpfulness": "0/0", "author": "holidaypro"}, {"rating": 1.0, "review": "I was pretty excited to try the Amazon Fire Stick and thought it would be a perfect fit for my application, but unfortunately it is next to worthless due to the slow data rate that make downloading a movie impossible and even listening to music comes with multiple breaks per song.  Granted, the device is a long way from my router, but I have tried everything I can think of to improve the network connection to provide a fast enough bit rate but nothing works.  Additionally, I have Netflix streaming through a wireless DVD player connected to the same device and it works flawlessly, with full HD, no break in the action playback.  I have also speed tested my connection at the Fire dongle using my cell and have an average of 23mbps download speed, which should be more than sufficient.  For whatever reason, I think the distance from my router is the root cause of the issue, so be advised you may experience similar issues if you do not have an \"excellent\" network connection to work with.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Glad that I purchased this product.", "verified": true, "helpfulness": "0/0", "author": "jet"}, {"rating": 4.0, "review": "Works as advertised.  Has upside on many others. I like my Ruko 3 best however.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "If Amazon was the company it used to be, this would be a 5 star rating. The Fire Stick is fine, Amazon is NOT !!! I have several devices ( blu ray dvd players, smart tv's etc). The reason I purchased these particular makes/models was because they included an Amazon app so that i could enjoy my video library. After my last digital library purchase ~ NOT BEFORE ~ i was informed by Amazon that they would no longer be supporting their apps. If I wanted to continue to view my Library I had to purchase the Fire Stick. These are crappy, slimy, unethical business practices Amazon !!!! SHAME ON YOU. I have personally spent tens of thousands of dollars over the years with you, and this is how you treat me ??!! I, over the years, have come to trust Amazon and pretty much, have made all of my purchases with you with the exception of groceries. Amazon was my go to, for ALL things . That's over. I am saddened, shocked, & disheartened that you could treat such a loyal customer this way.", "verified": true, "helpfulness": "1/1", "author": "Piaffe"}, {"rating": 5.0, "review": "Love the stick the battery slot nearly drove me crazy.  Suggestion make sure you include a button, tab, something to make removing the battery cover easy.", "verified": true, "helpfulness": "0/0", "author": "Janice Ayi"}, {"rating": 1.0, "review": "It worked for a few weeks and now it will not work at all.  Tried to return it but it was past the 30 days.", "verified": true, "helpfulness": "0/1", "author": "Jay Constantino"}, {"rating": 4.0, "review": "Doesn't have all the apps I would like", "verified": true, "helpfulness": "0/0", "author": "Dr. Michael A. Stone"}]