[{"rating": 1.0, "review": "Nowhere in the ads do they show, or say that you will need to connect the stick to a power source. My tv is on the wall with all the wires hidden, so trying to connect this to a power source with the short cable they give you is not a good solution. Very disappointed.", "verified": true, "helpfulness": "1/3", "author": "L. Fuentes \"LGF\""}, {"rating": 3.0, "review": "It works and it is small.  Audio comes ONLY off HDMI, so it must plug into your audio system - if plugged into TV, you get only TV sound, wow.  I also have an AppleTV, this is not the experience that the AppleTV offers.  It also does not stream off ethernet, only Wi-Fi; the AppleTV can use either and also has a digital audio output, should you need it (or HDMI).  So not too impressed except now I can get jerky Wi-Fi of Amazon programming, should I need it, whenever that would be.  There are better options.", "verified": true, "helpfulness": "0/1", "author": "David \"Foxboy\""}, {"rating": 3.0, "review": "just like having the other amazon device slight difference....more apps.", "verified": true, "helpfulness": "0/0", "author": "''PEACHEZ'' \"PRISCILLA SANCHEZ\""}, {"rating": 5.0, "review": "This is the best item you can get for your non-smart TV..hell it may be better then your smart TV. Great UI, great load speed, works with pretty much ALL the Apps you want to use on your TV.The only con is that it does not come with the voice controller, but unless you are deep in the Amazon ecosystem(i.e you dom't use Netflix) you won't really miss it.", "verified": true, "helpfulness": "0/0", "author": "Sean DL"}, {"rating": 4.0, "review": "Buying this at the sale price makes this purchase worth it.  It does need to be reasonably close to the wireless router in order to work.  My intention for the Fire TV Stick was to use on a TV in the basement.  I hooked it up and configured the wireless (which said it had full signal strength).  I was unable to stream anything.  I relocated this to a TV significantly closer to the router, and it worked just fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The Fire TV Stake is a OK product, with some issues.  The biggest problem with this device is that it's not compatible with every wifi router.  I tried hooking it up to my new router I bought a few months ago, it was unable to connect.  Turns out it's not compatible with all routers.  So I had to go back to my old one, it connected instantly.  Then my fiber-optic Internet is at 6 megabits, which has always worked excellent doing anything I wanted to do even streaming multiple videos at a time.  But well the device was updating it kept telling me there was a problem with my connection because it was taking too long.  Apparently this device was not created for the average person but for individuals who live in the city where the Internet speed is much higher.  Also it takes a while for the device to determine what the best quality available is for playing back videos.  So well it was trying to determine that the videos are very pixilated on some of the programs, such as Disney channel.  Going into settings and picking the desired playback corrected the problem.Other than that the issues are minute. However I have a friend who used both this device and the Roku stick side by side.  Apparently this device is a cheaper copy of the Roku.  This device is slower clumsier and has a few issues.  But they cost the same at least at the time of writing this.  I purchased the Fire TV Stake at a huge discount, but I would not paid more than $25.00 for this item without it having a significant upgrade in programming.  I've also used ChromeCast and even though it is slower the programming has some awesome features especially if you're using a new phone or tablet as your remote.  And it has a good price.", "verified": true, "helpfulness": "0/0", "author": "Richyyrich"}, {"rating": 4.0, "review": "Great ; easy to use and no lag. Just wish it had hbogo, maybe by next year it will.", "verified": true, "helpfulness": "0/0", "author": "Wade Hudson"}, {"rating": 5.0, "review": "Love the possibilities with my new Fie TV Stick! Very User Friendly!", "verified": true, "helpfulness": "1/1", "author": "Donna Polk"}, {"rating": 5.0, "review": "I love this thing! AND it really is THAT easy to use.", "verified": true, "helpfulness": "1/1", "author": "Christina, NM"}, {"rating": 2.0, "review": "Nice concept and works well, once its up and running.  But all I can say is watch your internet usage if your data is capped.  My husband and I watch 4 episodes of the good wife and a movie yesterday (along with some surfing the web) and we used almost 17.5 GB of data.  We never had to worry about this when we were using our Roku.  I think this might be going back.", "verified": true, "helpfulness": "1/2", "author": "mom2kandm"}]