[{"rating": 5.0, "review": "this thing is awesome! i was reluctant to get it and mad at amazon for not allowing prime vids to play on my beloved chromecast, but this has far exceeded my expectations. i don't even have to have my computer ON, and i can watch Youtube, Netflix, Amazon vids, all of the things! i've also been playing You Don't Know Jack like no tomorrow. chromecast needs to step their game up. it's now been moved to the bedroom TV where it is hardly used anymore. love that there is a remote, so it makes navigating super easy, and it downloads apps like Netflix directly, in the way that my BF's xbox does. awesome. best $40 I've spent in a while.", "verified": true, "helpfulness": "0/0", "author": "Muze"}, {"rating": 4.0, "review": "It works really well . it does everything that I need.  I do still have issues mirroring my device and the device still stutters during Netflix or prime video playback. A restart of the device fixes the issue temporarily.", "verified": true, "helpfulness": "0/0", "author": "Nevin Jacob Chacko"}, {"rating": 3.0, "review": "Firstly , I love the product for what it SOPOSE TO do and since I'm supposed to be a prime member ( I payed for the position ) I'm still waiting to access all those movies I'm SOPOSE TO be able to access . It seems to me that either the stick is too slow to pick up the fastest data speed I purchase from my internet local provider . I already pay for netflix and got to view some things through it  hooked up to my projector but it is really annoying to continually trying to retry no less than five times and embarrassed to say this can go on for hours all because their was some problem with access to  internet , especially when my kindle fire tablet , my no name cell phone my computer and even my security system can all access the internet and show real time footage or no to little  buffering of movies. It is also embarrassing for me because  went ahead and convince more than a hand full of friends to get one  ,even before I received mine . so the stars are for when it works as a smart device but the two less is for no prime movie access and internet failures even with the extension thing ( my internet wireless networks box is actually 1inch away and still  I have to cross my fingers ) . Am praying that someone would read this , show me what I need to do extra to access my free movies at least so I might save some face with all those that's comming to my kid party next month to see it in action along with my brand new projector ( viewsonic pjd5555w)  wireless outdoor experience. STAY TUNED FOR AN UPDATE.", "verified": true, "helpfulness": "0/0", "author": "vonetta"}, {"rating": 4.0, "review": "How can something so small be so powerful.  Have used two other devices in the past; neither of which was as easyto use as the Fire stick", "verified": true, "helpfulness": "0/0", "author": "Robert Stoker"}, {"rating": 5.0, "review": "I love, love, love my Fire Stick. With Prime membership there are so many movies that are free or heavily discounted, including new releases, that I can always find something to watch. There's TV shows, music, games, and apps too which, so far, I haven't looked at with any dedication. It works wonderfully on my Phillips TV, which is more than I can say for some of the movie programs that came already installed on the set. Having to reset my wifi every time I wanted to use one of the preset programs was a pain. With Fire Stick I just turn on the TV, select the source and BAM....there it is, ready to go! I would recommend to anyone. Amazon rocks!", "verified": true, "helpfulness": "0/0", "author": "Anjelicke \"Myriam\""}, {"rating": 3.0, "review": "We really like our fire stick for watching Netflix or YouTube. But if you want to watch Hulu don't bother buying the fire stick. It is constantly stalling or resetting or the sound is going but the pictures frozen. It is extremely frustrating. I'm always checking for upgrades.....i'm hoping one day they'll fix it.", "verified": true, "helpfulness": "0/0", "author": "nick"}, {"rating": 5.0, "review": "Love my new Fire TV Stick. Definitely use the extension adapter for the best response. I haven't had a minutes problem with this my fire stick. Unfortunately, I purchased at Best Buy so I ended up paying $43 for it. I'd buy it again and this time thru Amazon!", "verified": true, "helpfulness": "0/0", "author": "igivetlc"}, {"rating": 3.0, "review": "Like it except that I cant use Surround amp with it!!!!", "verified": true, "helpfulness": "0/0", "author": "Jyum"}, {"rating": 5.0, "review": "I plugged the Fire Stick into the TV and an electrical outlet and  it worked immediately.  I couldn't get Netflix so I called the help line.  Seems I had to download it from the App Store. It's all working now and we love it.  If you're a movie and TV lover you'll be glad you bought this. The HD is beautiful & the sound is perfect.  You have to work a bit to get the CC to come up but it will.", "verified": true, "helpfulness": "0/0", "author": "J. Parbus"}, {"rating": 5.0, "review": "I love it.Thank you", "verified": true, "helpfulness": "0/0", "author": "Melissa Carter"}]