[{"rating": 5.0, "review": "If you're familiar with the Amazon TV then this will be no stranger. Works just the same as the Amazon TV and simple to set up.", "verified": true, "helpfulness": "0/0", "author": "Jose' R. Arvelo \"jrarvelo\""}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 5.0, "review": "Relatively easy to set up and met all my expectations. I have compared it with the Chromcast from Google which I also have and I find this much friendlier and more useful.", "verified": true, "helpfulness": "0/0", "author": "G. Weiner \"photoflight  1\""}, {"rating": 2.0, "review": "It's a cute little gadget that seems to set up quickly. Well not really if you count the hours I spent on the phone with tech support only to be told that my internet connection wasn't fast enough for me to view any of the Amazon prime videos or the help videos that are supposed to help trouble shoot the product.  After contacting my internet provider and having them check my connection and internet speed I was assured that my modem was working properly and that I was receiving that highest speed available in my area. The fire stick has proven to work on only Netflix videos. I see it as kind of a waste of money but it was a gift and I don't want to hurt my daughter's feelings. I'm tired of being given the run around by Amazon's tech support so I'll just use for Netflix. I wouldn't recommend this product to anyone. I have seen what Roku can do and I would suggest putting your money there.", "verified": true, "helpfulness": "0/0", "author": "Sharon Downard"}, {"rating": 3.0, "review": "This is OK for me.  I have the roku stick and it has more android type apps available.  Amazon does not have VUDU (which is where I store all my ultraviolet movies), Spotify.  This is a huge problem for me.  Which is why the next stick I get will be Google Chromecast.  I got this stick when it was on a fire sale of 19.99 and believe me, if I paid more for it this it stick would have gone back.  Amazon is trying to get exclusive like Apple, but this is a turn off when people want the apps, like Amazon product, but Amazon won't yield.  That is why that Amazon Phone was not a run away hit, because they BLOCKED alot of android apps and it is an ANDROID phone.  Whoever is making these decisions are turning people off.", "verified": true, "helpfulness": "0/0", "author": "Linda D. Robinson \"The Queen\""}, {"rating": 4.0, "review": "What directions?  I had to hire a technician to set up my Fire Stick.  There were no significant directions on starting.  No information on how to get into the Wi-fi...my internet connection had a padlock on it and I was not able to figure out how to get it removed to move to the setting.  Thus, I had to hire my computer technician to do this.  I went onto the help page but still no help!!  Is it so difficult to put down some directions for those of us not techies?????", "verified": true, "helpfulness": "2/3", "author": "Adelaide Kern"}, {"rating": 3.0, "review": "Before I got my Fire Stick I had a Sony Blu-ray DVD player which I used for streaming.  It worked great but I liked the small size of the Amazon Fire Stick.  What I don't like, however, is that I have to use 2 remotes with this one.  There is no volume control.  It's very basic for those who like simplicity.", "verified": true, "helpfulness": "3/3", "author": "Pam"}, {"rating": 4.0, "review": "Easy to set up...lots of content to choose...just wish we had the opportunity to view newer movies.", "verified": true, "helpfulness": "2/2", "author": "Lou Redmond"}, {"rating": 5.0, "review": "Yes, very happy with the Fire Stick.", "verified": true, "helpfulness": "1/1", "author": "John Morrison"}, {"rating": 3.0, "review": "product was good. Tech support was bad. Call in number did not mention the fire stick, had to wait for the operator to transfer the call.", "verified": true, "helpfulness": "2/2", "author": "Karen M. Strange"}]