[{"rating": 4.0, "review": "I have one Downton Abbey program that wouldn't load and there is occasional albeit very brief picture artifact but other than that not bad at all for a stick.  We also have the FIRE TV box and it is PERFECT!!!", "verified": true, "helpfulness": "0/1", "author": "Cindy Voorhis"}, {"rating": 5.0, "review": "Kid friendly . 3 months with no problems.", "verified": true, "helpfulness": "0/1", "author": "Sparky"}, {"rating": 5.0, "review": "WOW---WOW why I didn't get this a year ago !!!!!! The fire stick is great loved it so much / I got one for one of my kids and shipped to her in Chicago / just great love it !!!!!!!!! James r Hammond", "verified": true, "helpfulness": "0/1", "author": "james r hammond"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "srinivas"}, {"rating": 3.0, "review": "This product does not work all the time.  I'm also disappointed that few movies are available unless one is a Prime member.  I'm considering returning the fire stick.", "verified": true, "helpfulness": "0/1", "author": "Lisa"}, {"rating": 4.0, "review": "It's a little annoying when you're watching something and it stops to buffer about 5 times, but that doesn't happen ALL the time. Overall we are really pleased with the Fire TV Stick. Will probably purchase the Fire TV later this year for the extra storage. Really love all of the Prime shows and movies available.", "verified": true, "helpfulness": "0/1", "author": "linz_m_r"}, {"rating": 3.0, "review": "This is an interesting little product.  I just got it and hardware wise it works well, however a few things I have to note that were not real clear before I bought it.  It works well if you want to use it only to access hulu, netflix, or hbogo AND already pay for those, but if you really want to use the power of this you NEED to have a prime subscription for $99 a year otherwise most stuff doesn't work.  Also if you have had prime ever in the past and canceled it you do NOT get the option of a trial to evaluate this.  Another thing I found , enable parental controls when you set this up or it is very easy to accidentally order something, and amazon will charge any credit card you have given them in the past.  They don't give you a second screen to warn you.  Overall a Nice device just understand these things before you buy it.  I'm regretting not doing better research myself.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Does what it's supposed to do. I've had Roku and Apple TV's, but this does essentially the same thing only in a stick it's a lot cheaper. Makes it easy to access all the Amazon Prime video content, yet still allows me to connect to HuluPlus, Netflix, and a bunch of other apps. I would recommend for an inexpensive alternative to some other competitive devices.", "verified": true, "helpfulness": "0/1", "author": "W. Christ"}, {"rating": 5.0, "review": "wow!!  ez to set up--luvin it so far,,,,u'd think at&t; could give some speed -up on there lowsie server -hi speed--,,inapigseye!!....firestick rocks...roku is next addon---thx 4 a great product...grandsons luv the apps too!!!!", "verified": true, "helpfulness": "0/1", "author": "Mark E. Shafer \"HAROLD\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "Angel Van Driel \"2thfairy\""}]