[{"rating": 4.0, "review": "excelente", "verified": true, "helpfulness": "0/1", "author": "Alberto G. Casado B."}, {"rating": 5.0, "review": "The fire stick was a very easy to set-up, and I am \"set-up\" challenged.  I enjoy having the ability to watch additional programming on my tv.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "Nice unit for the price. It has everything my Apple TV has plus Amazon Instant Video", "verified": true, "helpfulness": "0/0", "author": "Terry W. Winzell"}, {"rating": 5.0, "review": "Great product!  Wonderful way to convert to smart tv and cut the cable bill!", "verified": true, "helpfulness": "0/0", "author": "kd"}, {"rating": 5.0, "review": "Far exceeded any expectations. I had been using Chromecast for about six months. This is much more versatile and easier to use. I is my Firestick almost exclusively now.", "verified": true, "helpfulness": "0/0", "author": "Kenneth W."}, {"rating": 5.0, "review": "Finally purchased the right apparatus to watch Amazon movies on our big screen TV.  Son had given us a Chrome to download movies, but we could never get the movies from our computer to the big screen TV.  This works great once one gets use to what categories to scroll thru to find what you are looking for.  The price is right too.", "verified": true, "helpfulness": "0/0", "author": "Terry \"Island Girl\""}, {"rating": 4.0, "review": "Love the ease of use.", "verified": true, "helpfulness": "0/1", "author": "Olivia425"}, {"rating": 4.0, "review": "Freezes from time to time, other than that amazing", "verified": true, "helpfulness": "1/1", "author": "Monica"}, {"rating": 5.0, "review": "This thing is awesome! If you have the Internet, and either Amazon Prime or Netflix, you need this. It's so easy, and fun. And you can move it from TV to TV. My family and I really like the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Samantha Bartling"}, {"rating": 5.0, "review": "Easy to use. Great item", "verified": true, "helpfulness": "0/0", "author": "Paul J. Chambliss"}]