[{"rating": 5.0, "review": "Wow now I can dial up everything who needs cable Anymore. Great site.", "verified": true, "helpfulness": "0/0", "author": "sz"}, {"rating": 3.0, "review": "Works great when using it, however....we have a Panasonic 42\" plasma flat screen and with the fire plugged into hdmi while we watch regular cable...the television will loose sound and flicker usually about once every 30 minute or so. If we unplug the firestick from the hdmi, television works fine therefore fire stick causing some sort of disturbance.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Love this.  It was easy for me to install and I know very little about computers or TVs.  The biggest problem I had was trying to open the case for the batteries on the controller.  You have to push down and slide back before you can open it.", "verified": true, "helpfulness": "0/0", "author": "Mary Crosby"}, {"rating": 1.0, "review": "Received it for Christmas. Also received a chromecast from another daughter. Tried the fire stick first. They say easy to install. I entered all the information. It ask for your amazon account. I entered it said no account. So I get on my laptop next to me and enter my account and pops right up. So I continue for over an hour trying account information and nothing. Even tried creating a new account and didn't work. Remote was difficult to use. The daughter who bought me this was heartbroken. So I try to find tech support either on line or phone. Zero Zero Zero support. Zero Zero Zero Zero Zero Zero support. Just send them your money and your on your own.So put in chromecast and started watching movies in less than 20 minutes. Used my cell phone to program. Could not have been easier.One last comment I have no attachment to either product but fire stick sucked.", "verified": true, "helpfulness": "2/2", "author": "Mike R."}, {"rating": 3.0, "review": "I expected to see a way to get Podcasts, but haven't found a way ... Yet.", "verified": true, "helpfulness": "0/0", "author": "Barry I. Gamble"}, {"rating": 5.0, "review": "puts chromecast to shame", "verified": true, "helpfulness": "0/0", "author": "johnnie brown"}, {"rating": 5.0, "review": "Easy set up, super fast, excellent selection", "verified": true, "helpfulness": "0/0", "author": "HAEvans"}, {"rating": 1.0, "review": "Not what I expected or what was advertised! The Fire TV Stick needs to plug into a HDMI port and needs power. If you have a Cable and Blue Ray player then you have to have a TV with 3 or more HDMI ports. Also the power cord which is the same as the Kindle is too short so I had to plug it into a an extension cord. The number of options advertised don't show up on my Fire TV Stick. Would not recommend. Doesn't replace a good smart TV.", "verified": true, "helpfulness": "51/65", "author": "William Denninger"}, {"rating": 5.0, "review": "Buy this, don't even bother with other stream sticks. I'd almost consider this to be a better option than the Fire Tv, I own both and they both work flawlessly the difference is this one doesn't have voice activation on the remote (but you could use your phone) and cost a fraction of the Fire Tv.", "verified": true, "helpfulness": "0/0", "author": "Fernando Fonseca \"Computer geek\""}, {"rating": 5.0, "review": "I give fire stick 5 stars!!", "verified": true, "helpfulness": "0/0", "author": "milagros"}]