[{"rating": 1.0, "review": "I'm writing a bad review just because I didn't get one of these on Prime Day! I waited and by the time I put it in my shopping cart, the deal was over.", "verified": false, "helpfulness": "11/16", "author": "Andrew"}, {"rating": 1.0, "review": "This is so unfair!!! I've been a prime member for so long and waited for prime day for a long time. And now the \"wait list\" is full and I can't get this fire stick for a discount. I got SOO happy and my boom put down so quick. Ughhhh!!!", "verified": false, "helpfulness": "13/19", "author": "GILLIAN"}, {"rating": 5.0, "review": "As described, it is a fabulous little stick!  Works perfectly, easy to set up and browse and watch.", "verified": true, "helpfulness": "0/0", "author": "Jan Button"}, {"rating": 4.0, "review": "Works well. Can sometimes slow cable connection, so I have to unplug it if I am just watching TV, but it works as expected. Glad I got it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Waited all day for the sale on this thing and they are sold out?? I'm very upset and this prime day bs is a bunch of bs and not fair at all!", "verified": false, "helpfulness": "11/16", "author": "Lisa LaShé"}, {"rating": 1.0, "review": "This is very wrong! I looked at 7am this morning and this deal was already sold out. Thanks a lot Amazon. I am a long-time prime customer and I can't even get the deal you promised. You should do better in the future with making sure you have enough deals on this for your valued customers at least through the morning time. Thanks a lot for nothing.", "verified": false, "helpfulness": "11/16", "author": "Robin"}, {"rating": 3.0, "review": "Had the opportunity to get it at a lower price on prime day and it sold out before I even woke up. How can you have a low quantity available of something you actually make. Unlucky", "verified": false, "helpfulness": "8/13", "author": "JOSEPH ALERS"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick. It works great, no issue at all!", "verified": true, "helpfulness": "0/0", "author": "Brogin"}, {"rating": 5.0, "review": "I have ordered this product to update my tv . Only fantastic works acquired it in 39 us three days ago and today is at 24 us .Hopefully amazon me back the difference.", "verified": true, "helpfulness": "0/0", "author": "Jhonatan Morel"}, {"rating": 1.0, "review": "Not happy that at 7:45 AM there are no Fire sticks for sale.  C'mon. This prime day starting to sound a bit gimmicky.", "verified": true, "helpfulness": "10/14", "author": "Jose T."}]