[{"rating": 5.0, "review": "This works great", "verified": true, "helpfulness": "0/0", "author": "Paul C."}, {"rating": 4.0, "review": "I would have liked this better if it had voice control. Comparable to the Ruku Stick. Better interface, but not as many apps.", "verified": true, "helpfulness": "0/0", "author": "Anthony Ledbetter"}, {"rating": 1.0, "review": "Full of drops and can't seem to deal with multiple devices on the same network. It's frustrating to deal with the constant loading. At first we thought it was our internet but we switched providers and had to deal with the same problems, over and over again. What is the point of having a streaming device if it can't stream. The only way we can watch anything is to not have any other internet connected. I'll take an HDMI cord and connect it to my TV and watch my Amazon Prime that way.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "There are a stunning number of reviews for this product, so I'll keep mine short and to the point: This is absolutely worth it, even if you own the competition.The good: The product is polished, it works, and the interface is easy to navigate. Amazon has joined the ranks of content producers, and Fire TV Stick makes it easy to watch. They have also managed to score content not available on Netflix or Hulu, making this a good buy even if you already own a Chromecast, as I do. The price makes it a no-brainer. HDMI protocols are supported allowing the device (and remote) to send commands to your TV and amplifier. The remote is small and basic but feels solid and doesn't need line-of-sight to the TVThe bad: The stick apparently needs more power than the USB port on my TV, so I had to plug it into the power strip. Chromecast doesn't require this. Like the others, Amazon is a part of the content wars, so no device gets you access to all the programming. Pair this with a Netflix account and you get closer, but not all the way.Now, if you are choosing between a Chromecast and Fire TV Stick, hopefully I can help. If you want to cast things from your smartphone (not Fire) to the TV, get a Chormecast (or both). If you plan on using the device on it's own or have an Amazon phone or tablet, get the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Seth A. Ratner"}, {"rating": 5.0, "review": "great product! Works well. I wish my smart tv had all of the feature fire stick does.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I use an Xbox, Apple TV and computer streaming. I thought the Fire Stick would be a good way to consolidate some of that streaming and be able to take it with me when I travel (which is frequent for work).  The Fire Stick has proven to be a simple, easy, fast way to stream. I couldn't be happier with it.It has a small form factor and the remote is small (er than the Roku), which I like.  Plugging it in and following the directions was incredible easy and took less than 4 minutes to log in, select settings and watch the tutorial.  It took a few minutes to put in my passwords for Hulu and Netflix etc. I used the iPhone app which made this process much easier, since I could type answers using the keyboard vs selecting single letters with the remote.Some people may not like that Amazon puts it's menu content front and center, but that seems a minor thing.  If you are a control freak and want to adjust every position of the menu, you may be disappointed. I found it cleanly laid out, intuitive and quick to navigate.Video quality is excellent. Shows start quickly (with Amazon content starting near instantaneous) and are clean, bright, crisp 1080p (depending on content of course).  The audio is equally excellent, streaming in 5.1 surround.Ease of use, speed, quality and function, this is an excellent product.  Why did I choose this over Roku? 1) I don't like the big, clunky outdated Roku remote. 2) Spec wise the Fire Stick has a more powerful processor, faster speed and more memory. While only a negligible difference now, as the 2 products update (and they do, my Fire Stick updated as soon as I plugged it in), the Roku will possible start to slow down. 3) I stream a lot of Amazon Prime and this is incredible fast/easy with the Fire Stick. 4) It came with an HDMI extender, Roku doesn't 5) I like the Amazon app better than Roku's. 6) I like then clean black form of the Fire Stick. Simple and it virtually disappears.[...]. Thanks for reading.", "verified": true, "helpfulness": "0/0", "author": "S Mack"}, {"rating": 5.0, "review": "Works great.  Turned out TV into a smart tv.  We love the Daily Burn, Sling, and Netflix apps.", "verified": true, "helpfulness": "0/0", "author": "Brittany Biaggio"}, {"rating": 5.0, "review": "Works great easy to set up", "verified": true, "helpfulness": "0/0", "author": "Ken W."}, {"rating": 5.0, "review": "I couldn't believe everything it can do. I think it is great and I also put the app on my phone.", "verified": true, "helpfulness": "0/0", "author": "Linda Norden-Urton"}, {"rating": 5.0, "review": "After reading great reviews about this product, I decided to purchase it myself. I am VERY happy with the Fire TV Stick and would recommend over the Chromecast. The remote is super helpful too!!", "verified": true, "helpfulness": "0/0", "author": "Dr. Holly"}]