[{"rating": 5.0, "review": "The Fire Stick allowed me to have a smart TV without having to deal with the crappy user interface of a smart TV. I love the ability to customize the interface to my desires. It is compact, sleek and lighting quick with plenty of storage for all my apps and games. A great product for the price point.", "verified": true, "helpfulness": "0/0", "author": "Cleric1stClass"}, {"rating": 2.0, "review": "So, I've got to say, I had high hopes and was rather disappointed in this device.  I've used it on vacation for almost two weeks and in a nutshell, if you're streaming content from Amazon, it's fantastic.  If you want to use it to stream from any place else (Netflix, Hulu, HBO GO, etc.) forget about it.  The Amazon video is perfect and smooth.  All other content is slow to load, choppy to play, and can be downright frustrating.  I own a Roku Box and and Apple TV and thought this would be a fun little portable device for traveling.  Don't waste your time - I wish I'd skipped this and just brought my Roku.", "verified": true, "helpfulness": "0/0", "author": "Matthew I. Halpern"}, {"rating": 4.0, "review": "Remotes are cheap and quit working or the buttons get stuck after little usage. Teh stick itself is great. I prefer it over the roku. The roku does have a better remote though. I wish they would set up bt audio though the stick.", "verified": true, "helpfulness": "0/0", "author": "American"}, {"rating": 1.0, "review": "Prime day sucks!", "verified": false, "helpfulness": "5/8", "author": "Naco"}, {"rating": 5.0, "review": "want I always wanted", "verified": true, "helpfulness": "0/0", "author": "roy williams"}, {"rating": 5.0, "review": "I really like the stick and would recommend it to anyone who does not need all the bells and whistles on the high priced streaming devices. The infrared makes it possible to use the remote from anywhere in the room, unlike my old Roku where I needed to point the remote directly at the device. Like the high priced devices, it syncs up to my iphone for youtube and other searches, which is very convenientGreat product for the money", "verified": true, "helpfulness": "0/0", "author": "J Fischesser"}, {"rating": 4.0, "review": "excellent, but could not connect to a speaker system so it did not meed my specific needs", "verified": true, "helpfulness": "0/0", "author": "bob s"}, {"rating": 1.0, "review": "Purchased Fire TV, Fire Stick bundle and one HDMI cable bundle.  Fire TV would not connect to my internet router at any of the three times I tried. Fire Stick connected just fine. Kept Fire Stick and returned Fire TV for refund.", "verified": true, "helpfulness": "0/0", "author": "Jackson G. Stewart Jr."}, {"rating": 4.0, "review": "Bought this about a month ago. mostly love it. Although, daily, I have a streaming issue. Im not sure if its the Fire Stick, or my internet. My wireless connection says that I have full bars, and excellent signal. Yet every evening, when we are trying to watch something, it will start to play, then freeze up. Audio and Video. Within a moment of two it will reload and continue playing. Only to do it again within a few minutes. OR it will freeze the video and audio, and when the video starts back, the video stays frozen and we can hear the audio. Im really not what to think about this issue. I have an Xbox and a Wii in the house, that we use for video streaming as well, and Hulu has loading issues on those devices, but its much worse on the Fire Stick. The again, Amazon Instant Video and Netflix mostly streams pretty flawlessly. So, Maybe its just Hulu that sucks. Overall, I love the Fire Stick. I really enjoy the layout, and easy of use to move around. Installation was pretty simple. I do plan to buy another one or two, for other rooms in the house.", "verified": true, "helpfulness": "0/0", "author": "Virginia S Leigh"}, {"rating": 1.0, "review": "PRIME DAY IS CRAP.  I was awake at midnight which is hard with 2 little babies to try and get this Prime Deal.  It wasn't even up on the page.  I stayed up for half an hour and still nothing.  I went to bed and woke up at 7am and all there was was a waiting list for it that makes up stay on their page all day.  Who has time for that with 2 babies?!!?  Prime day is suppose to be for Prime members but its really to get people to sign up for prime.  After being a prime member for 5 years, I feel like this day isn't for us.  Canceling my membership.", "verified": false, "helpfulness": "4/7", "author": "Angry Mom"}]