[{"rating": 5.0, "review": "So far....sooooooo good. Only had a few weeks haven't explored everything yet..", "verified": true, "helpfulness": "0/0", "author": "Carol Munns"}, {"rating": 5.0, "review": "It's easy to connect and use.", "verified": true, "helpfulness": "0/0", "author": "Andie Lickteig"}, {"rating": 3.0, "review": "Doesn't work at all if you don't plug it into an power outlet.  Although they claim you don't really have to ...", "verified": true, "helpfulness": "1/1", "author": "Kimberly Rivera"}, {"rating": 5.0, "review": "Contemplated purchasing for a while and also vasilated between the stick and just the fire tv. Glad I went went the stick. It's small and compact, easy to use, and exactly what I was expecting. It allows me to watch amazon prime and Netflix conveniently on my living room tv.", "verified": true, "helpfulness": "0/0", "author": "Stacie"}, {"rating": 3.0, "review": "Set up was easy, it's easy to use, I was a huge fan for a few days...but now I'm noticing it sticking very often.  If I pause it for a few minutes, sometimes it won't start playing again and I have to back up and replay it.  It's not as smooth as Apple TV, but it it's 1/2 the price, so I guess you get what you pay for!", "verified": true, "helpfulness": "0/0", "author": "Nadine Babu"}, {"rating": 4.0, "review": "Everything great except for the selection of apps", "verified": true, "helpfulness": "0/0", "author": "Tyson Jan"}, {"rating": 5.0, "review": "Great product. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "John M. Holloway"}, {"rating": 4.0, "review": "Had problems with it connecting and disconnecting to network on and off. Updated firmware, so far so good. Overall it's a nice device, this is my 2nd one. Didn't have any problems with my first one.", "verified": true, "helpfulness": "0/0", "author": "Jeff \"jeff\""}, {"rating": 1.0, "review": "I have been increasingly displeased with the Amazon Fire Stick since I purchased two when they were first released.  I have found that they only seem to work if you are practically sitting on top of a wireless router.  If you are attempting to utilize the Fire Stick in any other room aside from the room where your router is located, the Fire Stick will not work.  It always tells me that I'm connected to my wireless network (which has excellent signal, by the way), but \"with problems\".  No matter how often I restart the device, it always states that I'm connected \"with problems\" and will not load.  I have had the same issue using both cable internet and with DSL.  These Fire Sticks are completely useless, and I regret buying two of them.  Do yourself a favor and buy a Roku.", "verified": true, "helpfulness": "2/3", "author": "Peaches"}, {"rating": 5.0, "review": "Wonderful product...great value!  I own two--use one in Michigan residence, and other in Arizona. Programs saved one palce are saved both places.", "verified": true, "helpfulness": "0/0", "author": "E. Ferguson"}]