[{"rating": 5.0, "review": "I love the fire tv stick", "verified": true, "helpfulness": "0/0", "author": "Teri  Fegely"}, {"rating": 5.0, "review": "Great programming.", "verified": true, "helpfulness": "0/0", "author": "Jmsmalex"}, {"rating": 1.0, "review": "Although most are not going to use the fire stick the same way as I do, I'm still giving it a 1 star review because for me, it is nearly useless.  I wanted to use mine almost exclusively with MLB At Bat to watch out of market baseball games with my MLB subscription.  Of all the devices I've used (Android phone, IOS devices, PC, PS3, Roku) to watch Baseball with my MLB subscription, this is by FAR the worst.  I can't start a game that is in progress from the beginning and then fast forward a few minutes in to get past the opening 15 to 20 minutes before first pitch.  When I try it just goes back to the very beginning, 00:00:00.  Once the game is complete and archived FF works although there is lag between pressing a button and the device responding.  This is the only device I have this issue with.  Also, the games constantly, constantly buffer every 20 to 30 seconds.  It's not my WIFI signal, it's the device.  I know this because the fix is to go get the ROKU from the other room and replace the fire stick.  Or just turn it off and watch on my iPad.  No more buffering issues, no more FF issues.I've watched one movie with it and didn't have any issues with the buffering so for movies the fire stick seems fine.", "verified": true, "helpfulness": "1/2", "author": "Joe Meyers"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "We've had the Fire TV Stick for a month and it's made streaming in our favorite movies and shows so easy", "verified": true, "helpfulness": "0/0", "author": "Marissa L Horvath"}, {"rating": 5.0, "review": "Easy to setup and use !  And reasonably priced too !", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "I love it. Plus got away from high cable.", "verified": true, "helpfulness": "0/0", "author": "Really? no dc forget it then"}, {"rating": 5.0, "review": "Hulu Plus. Netflix. Amazon Prime. Plex Player. Games.All in -ONE- device?  Yes please.Its fast, easy to use and simple to setup.  I used this for my grandma's TV and she is tickled pink she can watch Netflix so easily and Prime that we got rid of her cable bill and saved her $60 per month.You cannot beat this device.  Easily comparable to a Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Kraegor"}, {"rating": 5.0, "review": "fast, good amount of different apps.  Streams well, no dropout yet.", "verified": true, "helpfulness": "0/0", "author": "Peter M Johnson"}, {"rating": 4.0, "review": "Great device. Very easy to use and with the apps for the iPhone and iPad, never have to look for the remote again. Did wish it was easier to find new apps. Seems there are only the recommended apps and it is very difficult to find anything else. Other a great and simple to use product.", "verified": true, "helpfulness": "0/0", "author": "Lyle Smith"}]