[{"rating": 5.0, "review": "I was using the RCA streamer. It constantly was freezing and shutting down. It was extremely annoying while I was recovering from surgery.This delays briefly,  but I am very happy with it, specially since I can download remote to my Andriod Phone.", "verified": true, "helpfulness": "0/0", "author": "Maxine \"Maxie's\""}, {"rating": 5.0, "review": "Was easy to attach to TV. Love it", "verified": true, "helpfulness": "0/0", "author": "Eugene A. Loose"}, {"rating": 5.0, "review": "I'm rarely on top of trends in electronics, but I use Amazon a lot to buy anything and everything, so they got me when they were plugging it on their home page for pre-orders. I did a little research and it all said the Fire Stick was promising, so I pre-ordered it and waited. The wait was well worth it. My only reservation at the time of buying it was that it didn't have HBO Go, but Amazon promised that it would be available within a year, and it was available well within that time. The screen format is so much easier to use than Roku, which was what I had before. I am an AmazonPrime member, so it is linked to my account which is really nice and convenient. I don't rent videos often (I think I've rented 2), but downloading and accessing apps, music, and those 2 videos is much easier now. And it's so small, so what's not to like about that. Make sure you have a designated spot for remotes though, otherwise the Fire Stick remote will get lost in the couch cushions before you know it.", "verified": true, "helpfulness": "0/0", "author": "Emma"}, {"rating": 4.0, "review": "Easy to set up - User friendly. Only complaint is that it constantly buffers with Netflix and Prime videos. I haven't tried Hulu yet.", "verified": true, "helpfulness": "0/0", "author": "Wendi McLean"}, {"rating": 5.0, "review": "Totally worth it!", "verified": true, "helpfulness": "0/0", "author": "Scott Schaeffer"}, {"rating": 5.0, "review": "A five star product", "verified": true, "helpfulness": "0/0", "author": "rick"}, {"rating": 3.0, "review": "The fire Stick is alright.  I have nothing currently to compare it to..other than..YES..it is cheaper than cable.  I have had it for about 1 week now and it has crashed, it has frozen, and it even stopped working for 2 days!!  I bought my daughter one for her TV and she has had only minor complaints.  I would say for the price it may be worth it, but if it crashes again I am sure to try another brand.", "verified": true, "helpfulness": "0/0", "author": "BoutDatBizz"}, {"rating": 4.0, "review": "I am happy with this device,it still works well and I don't have a high internet speed,lots of stuff on amazon prime,I love the batman cartoons.", "verified": true, "helpfulness": "0/0", "author": "Albert A."}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/1", "author": "Elda Florencin"}, {"rating": 4.0, "review": "Met my needs and was easy to install and start using.", "verified": true, "helpfulness": "0/0", "author": "Hanna"}]