[{"rating": 5.0, "review": "I really do love my Fire TV Stick! The freedom to watch Netflix without connecting to my laptop is heaven sent.Now, on to the stalling problems that everyone else has been having...I can help! This website is your best friend: www.amazon.com/devicesupport. Bookmark it!First, please try this: use the little extension cable that came in the box, it helps to move the Stick away from the TV a little. Next, on the Fire TV remote, hold down the large round Select button and the Play/Pause button at the same time until the Stick resets.Problem solved! Feel the love!", "verified": true, "helpfulness": "0/1", "author": "kk53207"}, {"rating": 5.0, "review": "Like the Amazon Fire TV, the Amazon Fire TV Stick is an outstanding media streaming device. It is even smaller, and less obtrusive, but it is just as well-constructed as its predecessor. The Amazon Fire TV Stick also has a powerful and capable processor, and a generous amount of memory and storage. It too provides superb access to a wide variety of entertainment modalities. Because of its significantly lower price point, the Amazon Fire TV Stick truly represents an excellent value, and I give it my very highest recommendation.", "verified": true, "helpfulness": "1/1", "author": "KRMD"}, {"rating": 5.0, "review": "Love this thing . Very easy set up .got it for my dad so he can stream the wwe network . But you can do so much it's crazy !!", "verified": true, "helpfulness": "0/1", "author": "david m copple"}, {"rating": 4.0, "review": "Great device for travel just wanted to point out that the unit does overheats but does give any problems just a note.", "verified": true, "helpfulness": "0/1", "author": "Darkangelomega"}, {"rating": 4.0, "review": "The Fire TV Stick is a nifty little package. I played with it for a day, and there is some roughness showing up in software, that I hope the developers can fix in short order. As such, most of this review will probably read like a bug report. To start, though, I would like to talk a little bit about the device form factor.Besides a battery-powered remote control, the Fire TV Stick consists of two boxes: a power supply that connects to a wall outlet, and the main stick enclosure. These two get connected by a USB A to Micro-B cable. The main enclosure can be plugged into a TV set’s HDMI port ether directly (if the space around the HDMI receptacle allows for it) or through an included HDMI extension cable.If you are lucky, and your TV set has a spare USB port with enough power for the Fire TV Stick to function, you may be able to get by without having to run the cable to the power supply. Do that on your own risk, though. Officially, the included power supply connection is required.It is also worth noting that the only way Fire TV Stick connects to the Internet is via Wi-Fi. Even if you have wired Ethernet connection available near your TV set, you will not be able to go forego wireless.Those who dislike adding yet another remote to their entertainment system will happy to know that Fire TV Stick is HDMI-CEC compatible. As such, if your TV set or whatever you are plugging the Fire TV Stick into is also HDMI-CEC compatible, then you can just use the remote you already have.In practice, there are some issues with that, which may be attributed to vendor incompatibility. The largest issue is that the Fire TV Stick’s home button is not properly mapped. That is not such a big deal when navigating the main Fire TV Stick interface, as instead of using the home button, one can just push the back button a few times.Another story is when using apps. Some apps, like CBS news app for example, integrate into the Fire TV Stick very well. Other apps look and feel jarringly different. An example of the latter is the YouTube app; besides looking different, for some reason it appears to have further adverse effect on HDMI-CEC button mappings: I found that the fast forward button does not work; and the back button takes you only as far back as the YouTube app’s main screen, and would not let you go back to the Fire TV Stick’s main interface.Another way to control the Fire TV Stick is with a special Fire TV android app. For the app to find the stick the android device must be on the same network, and the network should have IP multicasting enabled. I wish the Fire TV android app had more communication options, such as specifying the Fire TV IP address manually, and Bluetooth connectivity. Also, since the Fire TV stick connects to your Amazon account anyway, it would not be farfetched to envision some kind of auto-configuration option; though security and privacy issues would have to be considered in this case.The Fire TV android app contains the same six control buttons, as on the native remote. At the top of the app there are links to keyboard and voice search. In the middle though, instead of navigation buttons, there is some kind of bizarre touchpad surface. How to use that surface to control the Fire TV Stick is not intuitive at all. This part of the Fire TV android app definitely needs work.Overall, if your main needs are to stream Amazon videos and music, and your Wi-Fi network is not constrained, I would not hesitate recommending the Fire TV Stick. Otherwise, you may be better served by the full-scale Amazon Fire TV appliance, or by a media-center PC.", "verified": true, "helpfulness": "2/3", "author": "John Woods \"TObject\""}, {"rating": 5.0, "review": "So far this has been very good. Still learning about it.", "verified": true, "helpfulness": "0/1", "author": "807"}, {"rating": 1.0, "review": "Love it!", "verified": true, "helpfulness": "0/3", "author": "Marylyn"}, {"rating": 5.0, "review": "I wish I could give this 10 stars. I received it today and thought I don't want to hassle with a setup. I was just going to look it over and set up later. As I unpacked it the pieces just seemed to fall in place. I took less than ten minutes to set up and that was because I changed my pln for purchases. My Rokus are going to the rescue mission tomorrow. I need to add to this review. Warning if you don't exit out  or unplug it it keeps running and you internet usage can double. There is no on off switch and I had to pay a stiff fee for overage. It is a good product but unplug when not using.", "verified": true, "helpfulness": "1/2", "author": "RK Clark"}, {"rating": 3.0, "review": "It took me over a hour to get it set up... As soon as I plugged it up, it had updates to install. I have a nice size tv but the font is very small... Still trying to figure out everything..", "verified": true, "helpfulness": "0/1", "author": "AGilbert"}, {"rating": 5.0, "review": "Great Product.  Working in Concert with my Kindle Fire to search for the right show and then play through the Fire TV Stick is a great feature.  Very Satisfied and recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Amazon Fanatic \"G. L.\""}]