[{"rating": 5.0, "review": "Surprisingly good. I am using this more then my Roku at the moment. There were some issues upgrading the firmware at the beginning but eventually it worked.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you have Amazon prime, why don't you have this already? Easy to set up and so much to enjoy.", "verified": true, "helpfulness": "0/0", "author": "777ark"}, {"rating": 5.0, "review": "I was deciding between this and the Chromecast. I went with this because of my loyalty (and slight addiction) to Amazon. I absolutely love it! It was easy to hook up and get started. Once I insweted the batteries in the remote, it automatically synced with the stick. It seamlessly integrates with your Amazon account and if you have any games or compatible apps already downloaded, they will be ok the stick! I was able to play the game of Life within 5 minutes. I previously downloaded this app when I had a Fire tablet. This stick is pretty amazing though. Everything is super fast and the apps look great on it. I mainly use it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Zach Lonsinger"}, {"rating": 3.0, "review": "It's kind of slow. It may be good enough for some people, but not if your kids are going to use it. The lag is enough to drive the kids crazy. You hit the button, no response, you hit it again, and then it goes twice. It's ok for me. I'm patient. The kids get angry, confused, and it's just not worth it. We bought a regular Fire TV for the main tv, and hooked this to the spare. But then the remote on the regular Fire TV kept draining the battery down in 2 days. This was further driving the kids mad. So I paired the Fire Stick remote to the Fire TV. Now I don't have a remote for the Fire Stick until my new remote that I just ordered gets here. First world problems.", "verified": true, "helpfulness": "0/0", "author": "Chi Son"}, {"rating": 5.0, "review": "Love it. I had bought my kids a 40 inch TV. It wasn't a SmartTV so instead of buying q new TV I bought the fireTVstick. It wasn't easy to hook up. Trust me if I can do it everyone can do it. Now they can watch Netflix in their own room.", "verified": true, "helpfulness": "0/0", "author": "ShoniRenee \"I AM God's BELOVED destined for GREATNESS,\nDevoted to the purpose of LOVING GOD and dedicated to give Him my UTMOST.\nI am focused to fulfill my GOD-GIVEN DESTINY and live my life to its MAXIMUM POTENTIAL.\nI am determined to make a dent in this world as a WOMAN OF INFLUENCE leaving a legacy of FAITH and SIGNIFICANCE.\""}, {"rating": 5.0, "review": "Me and my husband loved it so much, we ordered another one for our daughter.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Gartrell"}, {"rating": 5.0, "review": "I bought this for my wife.  It was a snap to setup.  I have an older flat screen so I had to use a HDMI switcher since I only have one HDMI connector.  Even with using the switcher there was no problem setting it up & getting it up and running.", "verified": true, "helpfulness": "0/0", "author": "fhk"}, {"rating": 5.0, "review": "Keep up the good work", "verified": true, "helpfulness": "0/0", "author": "Edul MALESRA"}, {"rating": 1.0, "review": "At first... you notice 1st rate packaging and then super simple simple setup. that's where it goodness ends. if you had intentions of spending the evening watching tv and movies, never mind. you'll spend it clicking up and down and all around. then buffering every 2 minutes. ( no its not a connection or range thing. 3 feet away from the router and no errors) as if the amazon prime app wasn't bad enough with the 1st season being apart of Prime then the next at $15, its the 3 suggestions per page and as long as you want to watch what they want you to watch, that's great. Other wise go to Netflix. uh oh.... somehow they even managed to screw Netflix up too. 2/3 of the screen with a big pretty picture of the highlighted show or movie and then a couple itty bitty little icons of the other shows/movies. click...click...clickclickclick this is fun. BANG!I have an idea, lets cram a zillion 1/2 rate apps and games that barely work onto one pretty little stick. awwww... too late, amazon beat me to it.the reason Netflix USUALLY works is because if its on there, you can watch it. no need to enter parental control passwords for each show... because of coarse some are part of Prime and others arent, no 15 menus to click through. click the picture, pick the episode if there is one and tadaaaa. entertainment. if ever there was 10 pounds of crap in a 2oz. stick, this is it.a note to the team that came up with Prime tv/movies. your apps suck. they are click intensive, counterintuitive  and annoying. maybe you should navigate the net version of Netflix, to see how it should be done. sometimes doing it a \"better way\" has already been done. on occasion its better to follow, that be the focus of an epic fail.i wont even bother sending this back. this stick has a 16oz claw hammer in its future. the $20 i spent is a bonus to all those who had a hand in producing this worthless piece of inevitable landfill, as a way to help them sleep at night. because they obviously wont based on the quality of their work.", "verified": true, "helpfulness": "2/3", "author": "steve Deryck"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Analisa Hernandez"}]