[{"rating": 5.0, "review": "Great low cost streaming product.  Much better and faster interface than the smart DVD player that I had been using.  I have Chromecast as well.  I like that the Fire TV stick has its own interface and does not require a \"casting\" device like a smartphone or tablet.  On the other hand, I like the casting feature of the Chromecast when friends come over and want to show video.  It would be nice to have both capabilities in one product but until then I have both.  One thing I have noticed is that some TV streams from HuluPlus have some pauses in the stream that I did not experience with my Chromecast.  I have watched a number of movies on Amazon Prime and have not seen this issue in the movies. Love the voice search capability available in the remote app. and the optional remote.  Would like to see it usable within the supported apps like Netflix. Overall very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Darkstar \"Darkstar\""}, {"rating": 5.0, "review": "I love it,it is so fast!I use my smart phone as a remote wirh it!", "verified": true, "helpfulness": "0/0", "author": "Esmeralda A Lujan"}, {"rating": 4.0, "review": "I bought the Fire TV Stick because I needed it to run Sling TV. So far the results are ok. Sling TV lets cut cable and watch life TV. TBS, TNE, HGTV and more.Last night I was watching NCAA basketball and the stick kicked me back to the home screen 2-3 times. Now I don't know if this is the Fire Stick or Sling TV. I will update my review as I find out more. Fire TV is nice if you don't have a smart tv. Because it turns your basic tv into a smart tv. I own smart TV's but the Sling App is only available on the Amazon TV Stick or Roku. I am sure it will be loaded to smart TV's in the future. Then I will not need to Amazon stick or Roku. IF you want to watch TV in other rooms you need to buy one for each TV. I may try the Roku in another room for comparison. Since I want to use this for Sling TV and the results are OK I am only giving this a 3 star. IF I bought it to turn my tv into a smart tv I would give it a 5 star. Meet in the middle and 4 it is.", "verified": true, "helpfulness": "0/0", "author": "Clint Westwood"}, {"rating": 5.0, "review": "Seamless, no-hassle setup. well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Still too hard to search", "verified": true, "helpfulness": "0/0", "author": "kimball barton"}, {"rating": 5.0, "review": "Awesome internet streaming solution that helped me drop cable.  Quick setup, seamless integration with Amazon Prime, Amazon Instant Video and Netflix.  Lots of other applications too.  Better looking and working interface than Roku.", "verified": true, "helpfulness": "0/0", "author": "Wyatt"}, {"rating": 1.0, "review": "We are dedicated cable cutters & got this for free with a 3 month subscription to SlingTV.  I guess you get what you pay for because it is a constant pain in the a$$.  Our network works great because we stream to our iPads & apple TV with absolutely no problems, but this device fails frequently.  We love the idea of it, but I have had to uninstall & reinstall the slingTV app and it still has problems, problems which do not occur when using the slingTV app on an iPad.  Also it fails to stream even Amazon prime well, which...uhhhhh....i don't know, I expect those two to play nice together.  Also the child protection is terrible.  I can't just have a code for certain ratings, I have to enter the code for everything, even when switching episodes of the same children's show.  And the code is visible as I'm putting it in on the screen, so my 7 yr old will have no trouble figuring it out.  EPIC FAILURE AMAZON.  I love my kindle, Amazon Prime is fab, but this device is about to get thrown out the window.", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 3.0, "review": "Movies are pricey; remote was faulty.", "verified": true, "helpfulness": "0/0", "author": "Clinton Burhans"}, {"rating": 5.0, "review": "Works great. Just what I needed since I stopped cable.", "verified": true, "helpfulness": "0/0", "author": "C Arocha"}]