[{"rating": 5.0, "review": "Easy To Use Even For An Old guy", "verified": true, "helpfulness": "0/0", "author": "MRT310"}, {"rating": 1.0, "review": "I have the same problem it keeps going offline I've checked with my internet provider its not that all of my other devices. Work fine so what to do?", "verified": true, "helpfulness": "0/0", "author": "josephkuzniar"}, {"rating": 5.0, "review": "This was a great buy! we use it on the spare TV in the Bedroom. Almost gave that TV away but now its being used all the time.", "verified": true, "helpfulness": "0/0", "author": "AJoseph"}, {"rating": 1.0, "review": "I ordered this a couple months ago and it worked fine the first couple times we used it. We have the fire box in our living room and we have the stick in our bedroom. We've had no problems with the box but after using the stick a couple time it suddenly stopped working. I waited a little while to see if it would start working again (sometimes our internet doesn't work). It never started working again so I called customer support and they sent me a new one right away. When I plugged the second one in it showed me the amazon logo and then did nothing after that it just kept the logo on the screen no matter what I pushed.  So I contacted customer support again and they are sending me a new one again. Hopefully this one works.  I found a chat forum on line about the stick and there were a lot of people that said they had the exact same problem.  Usually amazon is great with their quality of products but I'd say they completely failed with this one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "IT IS NOT WORKING. I HAD TO ALREADY REPLACE IT. I NEED TO KNOW HOW TO SEND IT BACK.", "verified": false, "helpfulness": "0/0", "author": "Sandra Hoopes"}, {"rating": 3.0, "review": "Beautiful UI and a great concept. HBOGO does not work with my Charter account (or any Charter account) though which doesn't make sense since my charter account works with HBOGO on other platforms. This has reduced my rating by two stars since that is the app I primarily wanted to use on this device.", "verified": true, "helpfulness": "0/0", "author": "Natalie L"}, {"rating": 4.0, "review": "Sometimes the unit response is delayed, otherwise would be 5 stars. Not sure if the fire tv has the same issue, or if it could be my internet connection.", "verified": true, "helpfulness": "0/0", "author": "hank"}, {"rating": 5.0, "review": "Love this low profile, easy to use Fire stick. It has a simple remote, tons of apps, and it works very well.", "verified": true, "helpfulness": "0/0", "author": "b witt"}, {"rating": 1.0, "review": "Tried with 2 different sticks.  Got the blue screen with disabled message.", "verified": true, "helpfulness": "0/0", "author": "J. Tyler"}, {"rating": 3.0, "review": "I love the convenience of having the Fire Stick attached to my TV (that has no built in WiFi receiver), but while watching movies, it blanks out every few minutes, appears to be buffering, and then continues where it left off.  It's so very annoying and distracting and I'm not sure how to solve that issue.  It's not at all far from the cable wi-fi, so I doubt that's the problem.", "verified": true, "helpfulness": "0/0", "author": "Gailie_Marie"}]