[{"rating": 5.0, "review": "Love it! Easy to install and play my Prime videos and Netflix.", "verified": true, "helpfulness": "1/1", "author": "Meme"}, {"rating": 1.0, "review": "Piece of junk, stopped working after a day; I googled online and tried all suggested fixes -- unplug hdmi, re plug, unplug TV.... Nohing works, a waste of time and money. And then when I try to reset to factory setting, it forces me to watch the stupid cartoon intro again, I'm not kidding, there is not even a way to skip the intro! I have to sit through the annoying thing again! It's already wasted too much of my time, going back to the very old but reliable Apple TV.", "verified": true, "helpfulness": "4/10", "author": "Fay Zhao"}, {"rating": 5.0, "review": "I was fortunate enough to have received one of these at the promo rate of $19.  After about an hour of playing around with it, I quickly went to the local brick and mortar store where they were on sale for not a lot more than that and picked up a couple more as gifts.  Plenty of people have and will continue to make comparisons to all of the alternatives but, on a standalone basis for the price, this is a great value.As for the device, it is compact and well designed.  The remote is simple enough that less tech oriented folks won't be scared away.  Because it is a Bluetooth remote, it seems to work better than my infrared ones.  Almost no glitches with streaming, even in a room far from the router where the ipad struggles to hold a signal.So, well done Amazon.  In addition to the kindle I've had for the past 4 years which allows me to conjure up books into my hands in seconds in the middle of nowhere like a wizard, I can now pick and chose movies, tv and youtube clips to zap all over the place.  Can't wait to see what you all think up next.", "verified": true, "helpfulness": "1/2", "author": "Ken H."}, {"rating": 4.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "customer60"}, {"rating": 5.0, "review": "Exceeds my expectations.Setup was easy to my wireless network. Navigation is also easy at the top and at each level. Information is clear for me as a Prime member about Prime tv and Prime movie options. I installed, opened and used several apps and found that process to work well also. Movies stream without hesitation making our movie viewing experience one my wife and I enjoyed more than a couple of other services we used to use. The Fire TV Stick was a good choice for me and I primarily purchased it because I am a Prime member. I highly recommend it.", "verified": true, "helpfulness": "1/2", "author": "William Manns"}, {"rating": 5.0, "review": "Works better than I expected! Netflix, Amazon Prime, and Hulu Plus accounts work great! OS is very responsive to the remote control. So glad I purchased it.", "verified": true, "helpfulness": "1/2", "author": "Jose A Menchaca"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "1/1", "author": "Jacques St. Louis"}, {"rating": 5.0, "review": "Definitely not an awe-inspiring perfect product but by far worth the price! Was not impressed that it always has to be plug in to an outlet. Was definitely not impressed with the wall adapter design sent with it, and will never use it. Why have an adapter that the cable comes out the bottom so it has to be in the last slot of a power strip?! With all that being said, i would still purchase this product again and will probably purchase as Christmas gifts. The product functionality is great and very seamless. I have watched 3 movies on it in 2 different locations and never had it buffer. I also like that all my music is on there to play whenever I want through my surround sound system. The games is something I am glad is on there and I am sure I will explore them in more detail soon. Great product Amazon! Keep them coming!", "verified": true, "helpfulness": "6/7", "author": "Justin Mayfield"}, {"rating": 2.0, "review": "It's decent, but Chromecast beats it both in terms of features and price.", "verified": true, "helpfulness": "5/9", "author": "H. Moliver"}, {"rating": 5.0, "review": "So far so good.  Since becoming a prime member, our family has enjoyed the streaming movies and video.  Problem was that we were using our Nintendo Wii for the kids and a Logitech Revue for our two TV's.  The speed of streaming is blazing fast, and I love all the additional features including the games and apps.The only negative is that the parental controls only apply to TV shows, movies, and rental capabilities; and whether you restrict access to those features.  There is no program rating restriction (G, PG, PG-13, R) that you con choose.  When this becomes possible on Prime Instant Video, this will be the best device period.", "verified": true, "helpfulness": "1/1", "author": "Benaiawannabe"}]