[{"rating": 5.0, "review": "easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Mike McCall"}, {"rating": 5.0, "review": "The Fire TV Stick met my expectations and more, very easy to set up too.  Especially since I am tech challenged.", "verified": true, "helpfulness": "0/0", "author": "Laurie Caldwell"}, {"rating": 3.0, "review": "It is Just ok.  But if you intend to watch tv all day long, get the fire box.  The stick is slow streaming and over heats.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Purchase the device which works excellent with my netflix, however because I live in the Caribbean I don't have access to enjoy the Prime Instant Video. Amazon please make this available to all countries if you would like customers to switch to Prime.", "verified": true, "helpfulness": "0/0", "author": "karencarew"}, {"rating": 3.0, "review": "Why does the some movies on the fire stick cost something, but on Netflix I I down loaded on my computer, the same movie cost nothing? Both are the same amazon account.", "verified": true, "helpfulness": "0/0", "author": "Eugene Scandrol"}, {"rating": 4.0, "review": "This has worked great for my family, and unexpectedly my favorite feature is the free photo storage on prime that displays all of my pictures for me while I listen to Pandora or just as a screen saver. I even had an issue with the first remote I bought and Amazon rectified that for me by sending a replacement. My only complaint is that Amazon won't let me stream my Google play movies. Google has the right to sell the new Annie movie and many others that Amazon does not sell, and there is no way to stream that to my TV with this device, which is very disappointing.", "verified": true, "helpfulness": "0/0", "author": "MLWAJW"}, {"rating": 5.0, "review": "Works great! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Dono"}, {"rating": 3.0, "review": "I ordered 7 of these and one was missing the remote and two had bent power inputs.  One was reparable the other not.  Amazon did take care of me, but i think next time I order I will order new.", "verified": true, "helpfulness": "0/0", "author": "Alicia & Robert P"}, {"rating": 4.0, "review": "WAS NOT HAPPY IT DID NOT HAVE A VUDU APP", "verified": true, "helpfulness": "0/0", "author": "don smith"}, {"rating": 3.0, "review": "I'm not one who leaves my devices on 24/7. There is no easy access feature to turn it off when not being used. Instead I have to unplug it. Other than that. I love the size and how it's completely hidden from sight.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]