[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Othon E. Galindo"}, {"rating": 4.0, "review": "I bought this and then realized what I wanted was available without this. Oh well, I gave it to mom! Makes for an excellent present. Oh and I want to point out - this thing eats Google Chrome alive. Chrome rely's on your mobile device or laptop, which is all wifi related. The FireTV Stick has a nifty little controller that is super sensitive to the touch and works from half way across the house. It also has availability of a universal controller on your phone, for those people stuck in the Google Chrome era. It's just a better product and I'd recommend it.And as others have said, it's just even more useful when you have Prime.", "verified": true, "helpfulness": "0/0", "author": "CoakleytheGoat"}, {"rating": 5.0, "review": "This is my second fire stick .i also own the fire tv box. These products cant be beat .i cant waot to see what comes on version 2 .dont hesitate you wont be dissapointed", "verified": true, "helpfulness": "0/0", "author": "Dlah63"}, {"rating": 1.0, "review": "When i got my fire stick i connected it too my vizio tv nd it doesnt work!!! Dont know if its the stick or my tv... When i connect it the screen shows Amazon then turns black and starts acting dumb havent been able too use it....... How can i return it? Or fix this problem", "verified": false, "helpfulness": "0/0", "author": "alyce"}, {"rating": 5.0, "review": "Love this! Very great product.", "verified": true, "helpfulness": "0/0", "author": "Alexandra R"}, {"rating": 5.0, "review": "Best thing i have purchased for my tv. Seems to be faster than my roku and the games are fun too. Definitely going to buy more for my other tvs when on sale again.", "verified": true, "helpfulness": "0/0", "author": "sean scott"}, {"rating": 5.0, "review": "Wao. Its amazing. Great TV stuff. All your prime shows plus more... just dowload the apps. Dropping down Dish to the 19.99 pak. Stick has everything else.. Buy it. Its worth it.", "verified": true, "helpfulness": "0/0", "author": "alberto rosario"}, {"rating": 2.0, "review": "waste of money.  it stopped working after a month.", "verified": true, "helpfulness": "0/0", "author": "ANITA MORTEL"}, {"rating": 5.0, "review": "Works great :)", "verified": true, "helpfulness": "0/0", "author": "cindy miranda"}, {"rating": 5.0, "review": "Received earlier that promised (even with Prime!).  Works great.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Delostrino"}]