[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "tammy moran"}, {"rating": 5.0, "review": "This has turned out to be something I use all the time (I do have Amazon Prime, so I am watching free movies and TV; if you are not a Prime member you might see a little less value in it).Since I also have a Roku Stick, a few quick comparisons:1 - The Roku UI is arguably a little smoother, but the Fire TV is comparable.2 - With a Roku, everything is a \"channel\"; with Fire TV on the other hand you have Amazon + \"apps\" for other sources of programming; this works well enough and which is better is mostly a matter of taste.3 - Physically, the Fire TV Stick seems better built than the Roku, which is a little flimsy. I have not had a problem with the Roku Stick, but the flimsiness makes me a little nervous.If you have used Fire OS on a tablet, and you like it, you will like it here too, and you may even like it better. In spite of being only lukewarm about Fire OS on Kindle tablets, I like it a lot on this device.", "verified": true, "helpfulness": "0/0", "author": "Steve Jay"}, {"rating": 5.0, "review": "Love my Fire TV Stick!  Easy to hook up and great variety!", "verified": true, "helpfulness": "0/0", "author": "Debbie \"kddonnelly\""}, {"rating": 5.0, "review": "It was perfect, just as advertised. Single to install and set up. Wish I would have known about it long ago", "verified": true, "helpfulness": "0/0", "author": "Duane Adamson"}, {"rating": 4.0, "review": "It works well, but the interface for finding different shows/channels/movies is a bit cumbersome.", "verified": true, "helpfulness": "0/0", "author": "PC"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "TODD A. GORDNER"}, {"rating": 5.0, "review": "I love this - works great, easy set up and with the App for the Iphone, it is very easy to use.  Highly recommended, especially with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Suzanne M. Post \"REVSMP\""}, {"rating": 3.0, "review": "It works as discribed but there is no access to the internet.  Its kind of like having a Fire Tablet (which I love).  I also own a Chomecast, that is a little more powerful.  Good product but a little limiting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This stick with xbmc flawless its the best short and simple", "verified": true, "helpfulness": "0/0", "author": "Mikel Bledsoe"}]