[{"rating": 4.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "Steven M. Eichert \"Neozen\""}, {"rating": 5.0, "review": "Best present! It's easy to set up, easy to navigate, and easy to have an amazing amount of fun with the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "A. Ellett"}, {"rating": 3.0, "review": "Keeps buffering when watching netflix", "verified": true, "helpfulness": "0/0", "author": "Chad Kress"}, {"rating": 5.0, "review": "I was originally thinking of getting the Fire TV but didn't need it since I have an Apple TV and like that quite a bit.  But I really was looking for an easy way to watch Amazon Prime content and also listen to Spotify on my TV.  When the Fire TV Stick came out, I couldn't say no. It was super easy to set up and the remote and on screen menus are excellent.  I really enjoy this product and since it also supports Netflix I rarely use my Apple TV any longer.", "verified": true, "helpfulness": "0/0", "author": "Steve Cornelius"}, {"rating": 4.0, "review": "I really like the fire stick. But what I did not understand is why there is not a catagories button for Netflix. And there is no HBO go what's up with that", "verified": true, "helpfulness": "0/0", "author": "David Bohorquez"}, {"rating": 5.0, "review": "Coolio device!  Soooo Much to watch, I do not know where to start.It picked up on my Pandora and Hulu accounts.", "verified": true, "helpfulness": "0/0", "author": "Eric K. Dickinson"}, {"rating": 3.0, "review": "Amazon made me believe on their advertisements that their Fire TV Stick was simply plug in and use. Unfortunately, this is not the case. In addition to plugging the device into your TV, you must also plug in an ugly wire for a power adapter directly to the Fire TV Stick. At this point, I feel like I had been deceived by false advertising. Aside from that, the device is fine, though I still prefer either the Roku or Apple interface. Can't beat the price though, as I picked it up with the extra initial discount being a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Bennett"}, {"rating": 4.0, "review": "Pre ordered in October, received mid December. Not too happy with how long it took. Or the non-skippable intro video. Come on Amazon, we're not all 80 years old learning to use technology.  Otherwise its a Netflix stick,  does its job.", "verified": true, "helpfulness": "0/0", "author": "Sarah Marian"}, {"rating": 5.0, "review": "I picked this up for like $15 pre-release.  Made my dumb TV smart.  Even at the full price, if you're a prime user, you're crazy not to have one on every TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We had a little trouble installing it. I see there are a lot of tv shows that I missed 2, however the description says season one. Can you access season 2 after you view season 1?", "verified": true, "helpfulness": "0/0", "author": "P. Onstott \"book person\""}]