[{"rating": 5.0, "review": "I love them.  My kids n I really enjoy watching the program.", "verified": true, "helpfulness": "2/2", "author": "Felicia Tate-William"}, {"rating": 4.0, "review": "Works great, easy to get started", "verified": true, "helpfulness": "2/2", "author": "Michael Garcia"}, {"rating": 2.0, "review": "Keeps disconnecting on me!! Wifi signal strength says \"very good\" and yet it pauses or disconnects at least 6x within an hr long show. A 40 min length show will turn into a 2 hour episode. I'm thinking of going back to connecting my tv to my laptop through the hdmi.", "verified": true, "helpfulness": "2/2", "author": "April"}, {"rating": 1.0, "review": "Doesn't play Netflix.....  everything checks out.  Very disappointed.", "verified": true, "helpfulness": "1/3", "author": "alan spires"}, {"rating": 5.0, "review": "This is a really great product...nice to have these all on my TV and very user friendly", "verified": true, "helpfulness": "2/2", "author": "Mitzi H. Council"}, {"rating": 5.0, "review": "We could not install it ourselves, but it works well and we are enjoying it.", "verified": true, "helpfulness": "2/3", "author": "Terry Brown"}, {"rating": 5.0, "review": "So far so good.  Really easy to set up and works like a charm.", "verified": true, "helpfulness": "2/2", "author": "Paul M. Moretta"}, {"rating": 5.0, "review": "Easily connects to your TV's HDMI port with included cable. Could also be connected directly to the HDMI port if you have the room. Includes a USB2-to-USB2 micro cable to power the device. However, this usually does not provide enough power for the device's built-in WiFi card to connect to wireless router that isn't located close to the device. But, it also comes with a power adapter if you need it. I recommend using the power adapter. Amazon provides a wide variety of TV and movies for your enjoyment through Amazon Prime. It's a good deal since you also get free two day shipping on items ordered through the Amazon site.", "verified": true, "helpfulness": "3/3", "author": "regapal"}, {"rating": 5.0, "review": "I have used the Fire TV Stick for a couple of weeks and so far it's great!", "verified": true, "helpfulness": "2/2", "author": "Venice Swayzer"}, {"rating": 5.0, "review": "Great works great and easy😊", "verified": true, "helpfulness": "0/1", "author": "GREG GENTRY"}]