[{"rating": 5.0, "review": "Nice product.", "verified": true, "helpfulness": "0/0", "author": "D. Parakh"}, {"rating": 5.0, "review": "This device along with Amazon Prime is so worth it.", "verified": true, "helpfulness": "0/0", "author": "Mariano Zamora"}, {"rating": 5.0, "review": "I love it. Came in on time. Works great.", "verified": true, "helpfulness": "0/0", "author": "Tracy Zrzavy"}, {"rating": 5.0, "review": "Blew my mind, no lag in remote time. Makes Hulu and netflix run more efficiently. far exceeded my expectations. Interface is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brandon Waite"}, {"rating": 4.0, "review": "Only use it for Prime and Netflix....been good so far...only complaint, playback is sometimes choppy", "verified": true, "helpfulness": "0/0", "author": "Jeff Bartold"}, {"rating": 5.0, "review": "Awesome!!!!....I can stream Netflix. ..Amazon prime movies,  music, and much more. It pretty much sets itself up after plugging in. Very simple to use. My wife and I love it....", "verified": true, "helpfulness": "0/0", "author": "Ratherbshooting"}, {"rating": 5.0, "review": "I don't know why I'm just purchasing this. I absolutely love it. It's easy to use. Everything is right at my fingertips. It's perfect!", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 5.0, "review": "I wasn't aware that the Fire Stick needed it's own power source beyond the HDMI port before I ordered. Luckily I've been able to power it off the USB port on my TV so no extra outlet space is needed. Something to keep in mind however if you don't have a USB option and are tight on outlets. It loads slower through menus and searches than the plain Fire TV, but I haven't had any issues with buffering once the program has started playing.", "verified": true, "helpfulness": "0/0", "author": "Jimboslice"}, {"rating": 4.0, "review": "Not a bad product and serves the purpose. Some times the picture gets blurred.", "verified": true, "helpfulness": "0/0", "author": "Goppa"}, {"rating": 4.0, "review": "Works like a charm. Easy to set up...quick access. We have Apple TV also and this is just as easy.", "verified": true, "helpfulness": "0/0", "author": "Jeanne \"Artist's Mom\""}]