[{"rating": 5.0, "review": "Great device works supererb.One con is that it has to be connected to the wall for. Power with a short cable. Issue if ur tv is hanged up.Deffinatly get this device.", "verified": true, "helpfulness": "0/0", "author": "Baseballmachine5"}, {"rating": 5.0, "review": "Well worth the wait! So convenient and easy to use. No slow thinking time either.", "verified": true, "helpfulness": "0/0", "author": "C. Green"}, {"rating": 5.0, "review": "very user friendly.  love all the options and wide variety of applications/shows/movie", "verified": true, "helpfulness": "0/0", "author": "GAYLE M."}, {"rating": 5.0, "review": "So excited to receive our Fire TV stick.  Very simple to setup and start using.  Plesently surprised that our stick was preconfigured since we already had a Prime account so had instant access to our account and content.", "verified": true, "helpfulness": "0/0", "author": "Paul Giles"}, {"rating": 1.0, "review": "Wasn't what I expected. If your a movie buff than this is for you. I also have the ChromeCast and it lets you stream EVERYTHING from your phone, Fire Stick doesn't.", "verified": true, "helpfulness": "2/2", "author": "Jacques D. Lazenby"}, {"rating": 2.0, "review": "2 stars due to ease of set up. Receptions spotty at best - very disappointing. Get Wi Fi on everything else-don't understand. Bummer !!", "verified": true, "helpfulness": "0/0", "author": "Karen G. Spencer"}, {"rating": 4.0, "review": "It is better than the Chrome Cast, but still lacks. Many of the menus do not have enough granular categories for browsing. No one wants to look through a zillion items when browsing. And surprise, Comcast does not yet support this device for things like Showtime Anywhere.", "verified": true, "helpfulness": "0/0", "author": "Wayne in Indy"}, {"rating": 5.0, "review": "Simple to set up and great quality streaming and picture quality..", "verified": true, "helpfulness": "0/0", "author": "Stephen R Walsh"}, {"rating": 5.0, "review": "I really enjoy using this device so far. It is easy to use and convenient to carry around if you want to take it to a friends place. I would definitely recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Garrett J."}, {"rating": 5.0, "review": "A great product. Ordered the Chromecast and returned it for this. Can turn any tv into a smart tv. Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Ruffini"}]