[{"rating": 5.0, "review": "I was very pleased with this product.  I was impressed with how easy it was to connect to my television.  This cool device had opened up a world of new viewing opportunities and, having recently \"cut the satellite cord\" it has given me an affordable method for choosing programming instead of having to accept hundreds of channels, most of which were unwanted.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "dustman \"Dustin Turnmyre\""}, {"rating": 5.0, "review": "Can download apps, play games, and watch Netflix, Hulu!", "verified": true, "helpfulness": "0/0", "author": "Marcella Hodshire"}, {"rating": 5.0, "review": "If you like subscription media,it's for you. The free content is pretty weak,but if you want to stream any subscription services,like Netflix or Hulu,it works very well. The setup is super easy & it's very simple to use. One of the nice features is the memory,which allows you to take the f stick on the go. This means that as long as you have a tv with a hdmi port & wireless internet,your f stick will be your personalized f stick on any TV.", "verified": true, "helpfulness": "0/0", "author": "Seth Anderson"}, {"rating": 4.0, "review": "I would give it 4 stars because I am still learning how to work it, I just got it 3 days ago.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great. In some ways better than chromecast. I like having a physical remote. The ability to use my prime videos was key as well. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "ryan21"}, {"rating": 5.0, "review": "I just got the Fire TV Stick today (I love Prime's Sunday delivery :) ) and with only an hour of use I already appreciated it so much. It's so affordable and has so many features. I was deciding between this and the Roku Stick and I went with Amazon because it has better specs for less. I could not be more satisfied right now. I really recommend it.", "verified": true, "helpfulness": "0/0", "author": "Brandon Mohan"}, {"rating": 4.0, "review": "darn tootin, even worked for a geezer who is tech deficient.  Now I gotta figure out how to move within the offerings.", "verified": true, "helpfulness": "0/0", "author": "hdo \"HO\""}, {"rating": 5.0, "review": "Very easy to install. You do have to have an open electrical outlet though. We love ours and would recommend it.", "verified": true, "helpfulness": "0/0", "author": "DSM"}, {"rating": 5.0, "review": "Perfect for the bedroom TV!", "verified": true, "helpfulness": "0/0", "author": "Emporia"}, {"rating": 5.0, "review": "Great value for the money. It lets us stream SlingTV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]