[{"rating": 4.0, "review": "Outstanding price and feature rich.", "verified": true, "helpfulness": "0/0", "author": "Todd Rigg"}, {"rating": 5.0, "review": "Replaced my Roku 2 and never looked back.  Wish it had HBO Go, but I have my Roku 3 in the living room for that.", "verified": true, "helpfulness": "0/0", "author": "Bryann Turner"}, {"rating": 4.0, "review": "Great product........only thing is I dont think there is a way to shut it off.....which gives me trouble get my tv stations back on .....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I currently own an HD television and a SMART TV the HD television is missing all the convenience of a SMART TV. Since buying the Amazon Fire TV Stick I now have all that the SMART TV has to offer without the SMART TV cost", "verified": true, "helpfulness": "1/1", "author": "Othello Marshall"}, {"rating": 5.0, "review": "Great idea. We will be taking this with us when we vacation.", "verified": true, "helpfulness": "0/0", "author": "Cheryl M Rodriguez"}, {"rating": 3.0, "review": "Reason, it only get 3 stars is that I need to have Amazon Fire Tablet or Phone to be able to connect my movies or Photos as the cloud it works with is limited and I don't like using a cloud.Wish it would be able to work or see my computer so I can upload movies or file to my TV.  Right now I just received it a week ago since its new but thinking hard about returning it!", "verified": true, "helpfulness": "0/0", "author": "Michael Holbrook"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "tara blackston"}, {"rating": 5.0, "review": "Solid device. As a Prime member got introductory price of $19.99. Does everything the FireTV does for  Hal the price and comes with a better remote. If I'm not mistaken I think the $99 FireTV comes with a USB port or MicroSD slot that I have never used.", "verified": true, "helpfulness": "0/0", "author": "Orion29"}, {"rating": 5.0, "review": "menu is laid out nicely and this stick has replaced both the chromecast (i hated having to use a separate device to control it) and an old roku (took over 4 or 5 minutes to boot up).  now, with the remote control, i can watch amazon movies and youtube videos.", "verified": true, "helpfulness": "0/0", "author": "groundie"}, {"rating": 4.0, "review": "I like the apps and I use Amazon for a lot of things. I'm just disappointed apps like Plex for example I would have to pay  to get it download onto the Fire TV Stick. For the remote i hardly use it; the application on (Android) allows me to speak my responses in", "verified": true, "helpfulness": "0/0", "author": "Michael Goddard"}]