[{"rating": 5.0, "review": "I really do like my Amazon Fire TV Stick. it is so quick & easy to use. Thank-you for making TV watching more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "arlene"}, {"rating": 5.0, "review": "I love watching tv on here. Great channel options and the picture is perfect hd. Makes me wish I cut the cord years ago.", "verified": true, "helpfulness": "0/0", "author": "Jennifer06"}, {"rating": 5.0, "review": "Easy set up and truly has great features. The device can go with you and the family while on vacation turning your hotel room, to a theater room for many to enjoy movies while out and about and just wanting to enjoy a movie in another state with your family. Our kids love the games and the fact they can watch movies later. Amazon you've done it again as you brought us the Kindle and the Amazon Fire box and made it smaller as you gave us the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "mike & elena pickup"}, {"rating": 5.0, "review": "Was excited with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "debby"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Yohannes Temesgen"}, {"rating": 5.0, "review": "Yes, it has met every expectation.  I can compare it to my ROKU, and I find it superior in presenting the very best streaming and viewing opportunities.", "verified": true, "helpfulness": "0/0", "author": "Bauntbo"}, {"rating": 5.0, "review": "I love it.  It was so easy to install and I am able to watch everything on my TV that I used to watch on my tablets.  There are no streaming delays ever.  An amazing, affordable product.  Once again, Amazon delivers a quality product at a reasonable cost.", "verified": true, "helpfulness": "0/0", "author": "Julie Rankin"}, {"rating": 5.0, "review": "I really enjoy using my amazon fire stick.It is easy to set up and use also allowed to watch so many of my favorite shows as a prime member.", "verified": true, "helpfulness": "0/0", "author": "Ryan Gilot"}, {"rating": 3.0, "review": "The fire stick didn't meet my expectations. The first issue I've noticed is that the stick gets extremely hot after an hour use and starts to flicker. I used the power supply that was included. I'm concerned about it's safety. Another issue I noticed is that the color saturation is set too high. I'm comparing this against my PS3. Lastly, the video quality was subpar when using miracast. The videos I streamed from my other devices weren't sharp.", "verified": true, "helpfulness": "0/0", "author": "bk88"}, {"rating": 5.0, "review": "the most dependable of all the hardward for streaming.", "verified": true, "helpfulness": "0/0", "author": "Marty Krystall"}]