[{"rating": 3.0, "review": "I have been watching Netflix using an old Wii and thought the fire stick would be better...wrong! The fire stick reloads and many times stops at 25% for a minute or two.  This happens with HBO Go, and even Amazon Prime. This hardly ever happens with the Wii.  I have followed the tips listed in some reviews, such as rebooting and clearing unused apps but nothing helps and the signal strength is good. I am surprised and disappointed by this purchase.", "verified": true, "helpfulness": "0/0", "author": "D. Yates"}, {"rating": 4.0, "review": "Easy to install and use. Really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "James A. Buddie"}, {"rating": 5.0, "review": "My kids had lost the remote been looking for 2 wks. Found it after i placed the order.", "verified": true, "helpfulness": "0/0", "author": "Francisco J. Ramos"}, {"rating": 1.0, "review": "The WIFI requires too much power.  My other devices work fine off of my router but the Fire TV Stick cannot connect.  Very disappointed.  I may go out and purchase a more powerful router or a booster.  Do not think this should be required.", "verified": true, "helpfulness": "0/0", "author": "Barry T. Cuda \"Barry T. Cuda\""}, {"rating": 3.0, "review": "We have this item and a blu ray player that both stream. This item seems to buffer more and looses signal a lot. I would think it was my wifi but the blu ray player doesn't have this problem. It's great to have around the house to move from room to room and to take on vacation.", "verified": true, "helpfulness": "0/0", "author": "Bridget Dougherty"}, {"rating": 4.0, "review": "This is a better decision than the Roku, but it is kinda slow", "verified": true, "helpfulness": "0/0", "author": "Renato"}, {"rating": 2.0, "review": "Im a little disappointed with this device it doesn't buff very well and most shows aren't streaming half the time and sometimes when you do get to watch one it will cut off before you reach the end.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 3.0, "review": "It would have been awesome, if it did more than buffer. It was very simple to operate and perfect for what I wanted but I did not get the chance to watch much on it due to it constantly buffering. It literally buffered every 30 to 45 seconds. My wifi connection was perfect and my Apple TV worked fine but the fire stick just couldn't keep up.", "verified": false, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Lejla Kovacevic"}, {"rating": 1.0, "review": "Fiance gave it to me as a gift when it was on special for $20. Tried it out, immensely annoyed with the extremely long commercial that you CANNOT skip or fast forward through telling you all the ways you can give Amazon money. Seemed to be good for very little more than buying content from Amazon, pretty useless for any other content, (one example, all of the search features will only return Amazon content, with a priority for paid content). Gave it back to my fiance for her to use and she quickly got annoyed with it too and sent it back. I like google chromecast, like the Roku, this was annoying garbage.", "verified": false, "helpfulness": "1/1", "author": "Nafi"}]