[{"rating": 5.0, "review": "Pre-Ordered the Fire TV Stick and received it last week. I usually use my PS3 for Amazon Prime and Netflix viewing in my home theater. I now will use this device. 1 it consumes less electricity and the big number 2 is is is quicker to start up and the picture quality appears to be better. I love being able to boot up Youtube on my phone and push the video to my plasma. It has come in great use this week with all the great movie trailers that were released. Usually it is my wife and I huddled around one phone or iPad watching the trailer. But Fire TV stick plays the Youtube videos with no problem in HD.I have tried the mirrorcast and it did work but got disconnected pretty quick. I have not determined if it is my Moto X or the Fire TV Stick. I thought I was going to use the mirrorcast more often, but haven't used it since I first booted up the device and tested it out.If you are prime member, I believe this to be a MUST have. You get to stream your prime videos and even prime music AND your photos in your cloud drive.This device is pretty fast. I have an older roku, I believe it is generation 2. This thing is so much quicker. I originally brought this to replace that device in our bedroom, but because of the quality I don't want to remove it from my home theater system.", "verified": true, "helpfulness": "0/0", "author": "pg"}, {"rating": 5.0, "review": "I read some of the other reviews and I was a little worried.  After receiving the Fire TV stick, I was like Wow!  It's awesome.  It works great.  It took like 15 Mins. to update and install software but after it was all said and done, it worked great.  I guess I ordered one the good ones.  If you are an Amazon Prime customer you'll love this.", "verified": true, "helpfulness": "0/0", "author": "Luis Loarte \"corvin2\""}, {"rating": 3.0, "review": "I pre-ordered one of these before they were released and once I got it, it was nice.  It works well, its a nice interface and for someone who just wants to use a couple of streaming services - its great!  However if you want a more fully functional media player, you will need something else.  I don't like that you have to connect a power cord for such a small stick.  It would be nice if the HDMI specs one day allow power on the connection to avoid the need for cables like this.  I ended up selling it but it does work and does what its supposed to do well.  It just wasn't enough functionality for my home media needs.", "verified": true, "helpfulness": "0/0", "author": "Joe \"Joe Church\""}, {"rating": 4.0, "review": "Very easy setup and works great.  The app for the Droid really helps make is easier to use.  Still lacking in Apps but I'm sure there will be more coming.", "verified": true, "helpfulness": "0/0", "author": "Douglas L Lockard"}, {"rating": 4.0, "review": "Well done UI. Hopefully it'll just improve over time.", "verified": true, "helpfulness": "0/0", "author": "Don Dao"}, {"rating": 5.0, "review": "This is a great item to view online content through your non-internet ready hd tv.  Works great with Netflix, Hulu, and of course Amazon Prime.  Picture quality is great and set up is very easy (just plug it in, connect to your home network and you are off and running).  Small enough that that it is perfect for taking to a hotel with you to improve your tv line-up when on the road.  I love Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Boomer"}, {"rating": 4.0, "review": "It's good and @ $20 for Prime members when it was released, a good buy. It will be better when it will work with Apple IOS.", "verified": true, "helpfulness": "0/0", "author": "Scott Nichols"}, {"rating": 5.0, "review": "YES! I have two flat screen TV's in our home, neither is a \"Smart TV\", as they were bought in 2009, before they started building \"Smart TV's\".  I already have another device to stream all that the \"Fire Stick\" can bring to our Flat Screen, in our den and I'm using the \"Fire Stick\" for a smaller flat screen in my home office! It was a great buy!", "verified": true, "helpfulness": "0/0", "author": "JIM"}, {"rating": 5.0, "review": "Fire stick works well in first week. Easy, problem free setup is even quicker for existing Prime customers, as the fire stick is already registered. Replaced a Roku 3 with this smaller, compact HDMI plugin. Receives a router signal just as well as Roku 3 and included internal memory must buffer better than Roku 3 because we have fewer \"catch up\" interruptions with the fire stick. Can't beat the promotional price, pleased with purchase.", "verified": true, "helpfulness": "0/0", "author": "Dejavuduck"}, {"rating": 1.0, "review": "Amazon is advertising this product heavily, and I'd like to get one, but it is out of stock until Jan. 15. That's odd.", "verified": false, "helpfulness": "0/24", "author": "milo \"milo\""}]