[{"rating": 5.0, "review": "It I is wonderful..I watch tv a lot more..", "verified": true, "helpfulness": "0/0", "author": "Linda L. Smith"}, {"rating": 4.0, "review": "Works great would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "I purchased fire Amazon Fire TV Stick during its debut on an impulse on account of a $19 promotion price. The decision has proven to be filled with serendipity despite the fact that I didn't have an immediate need for the Fire TV Stick on account of having Netflix/Hulu/Amazon Prime VoD on two game consoles as well as a Roku3. But I recently purchased a Sony Bravia UHDTV for the bedroom with AndroidTV and the Fire Stick provides me with access to HBO NOW since as of this writing there is no HBO NOW client for AndroidTV. But what *REALLY* surprised me was the fact it seems TV makers and companies making products like the Fire TV Stick are collaborating in a way I hadn't expected. Specifically, when I select the input associated with the Fire TV Stick with the Sony UHDTV remote, I can control the Fire Stick with the Sony remote, but more interestingly is that the Fire Stick and Sony UHDTV process the IR blasts only if one or the other has focus. If this weren't the case, as you navigated through the AndroidTV dashboard, you would be (in the background) also be navigating on the Fire Stick since the Sony remote is blasting IR signals that both UHDTV & Fire Stick are picking up... yet somehow there's \"device negotiation\" going on. What this all means is I don't have to bother using Fire TV Stick remote and can control both the Sony UHDTV & Fire TV Stick with just the Sony remote. VERY COOL! As for Fire TV Stick itself, I've had no issues with streaming, videos starts up quickly and I've never experienced buffering issues. That being said, some people will still complain about lag/buffering/spotty WiFi reception. In my experience virtually all of these problems come down to the user's home setup (though most don't see it that way) -- too long of a distance from the device providing WiFi, operating very old equipment that hasn't kept up with the (WiFi) times, etc., etc. And just because all your other devices seem \"fine\" doesn't mean the Nth device won't have (WiFi) problems with your ancient/ISP provided WiFi home router... which could be the Fire TV Stick or the smart phone you just picked up.", "verified": true, "helpfulness": "1/1", "author": "Mario Pacheco"}, {"rating": 5.0, "review": "Difficult to use the search function but still a very good buy.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Fantastic entertainment saver. In it's own way better than Roku but some streaming I get on Roku that's important to me The Stick can't stream. But it's still I think better.", "verified": true, "helpfulness": "0/0", "author": "Jim Dickerson"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Denise Krisza"}, {"rating": 3.0, "review": "I purchased the Fire TV Stick as an easy way to access Netflix, Amazon Prime content, Showtime Anytime and HBO Go (I am not a Hulu subscriber).  Personally I don't get a lot of time to watch TV, maybe a half hour or an hour every second or third day.  Occasionally I find myself with a free space of time which I like to go back and view televisions shows I like that I've missed.  It seems like every time I try to watch something from HBO or Showtime I need a new Authorization or Access Code which means logging onto my computer (which sometimes isn't even readily available) poking around HBO or Showtime's website, trying to remember passwords that I can't remember to get a stupid access code.  It takes me 20 minutes to access content I want at my fingers.  I am frustrated.  If there was a way that I didn't have to get a new access code every time I want to watch something on HBO or Showtime I would be very happy with this product.  We frequently have to log back into Netflix but that's just an email address and password, it doesn't require us to get new authorization codes.", "verified": true, "helpfulness": "1/1", "author": "Lara N"}, {"rating": 1.0, "review": "Well got one of the first ones that came out last year for a Christmas present for a older friend that is almost anti tech in his ability to try new things.  Thought it would be perfect for him, simple and sure.  But unfortunately I just found out that it stopped working a couple months after he got it.  He gave it back recently and he was right it was defective.  The power goes on and off on it continually causing it to reboot about every minute.  It defaults back and you can not use it for anything.  Glad I got Roku and upgraded it.  Probably should get him one this Christmas too, Roku is reliable, Amazon Fire TV in my experience not so much.", "verified": true, "helpfulness": "1/1", "author": "Paul Hase"}, {"rating": 5.0, "review": "Love it incredibly useful and easy to use and very addictive and fun", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Amazing device.... wish we had gotten one along time ago!!  It's so fast and easy to install and it works well on both our hdtv!  Our son-in-law is the one who told us about it and I've thanked him over and over again!", "verified": true, "helpfulness": "0/0", "author": "Connie Heath"}]