[{"rating": 5.0, "review": "Met all my expectations.  Easy to install.  Friendly interface.  Gently sleeps or shows beautiful screen savers when not in use and wakes up with a touch of the home key.", "verified": true, "helpfulness": "0/0", "author": "Larry Welch"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Deborah L. Roberts \"D. Roberts\""}, {"rating": 5.0, "review": "Great! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "A Mom \"Game player\""}, {"rating": 1.0, "review": "Terrible product. Drops single constant! Has to be reset a lot. Will be returning!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 4.0, "review": "It work great.", "verified": true, "helpfulness": "0/0", "author": "Hector Ramos \"heckelec\""}, {"rating": 5.0, "review": "I cancelled my TV provider. This product has Amazon Prime Instant Video Player, Netflix and YouTube. That's all I need. Who wants to hear depressing news anyway and if you want there's CBS news app that you can add to your Fire stick TV. With HD Picture quality it doesn't get any better, I love it. You can also download free apps and games right from your computer and within minutes they'll show up on your TV. Amazing you can even delete the ones you don't want, instead of having them hogging your screen with apps you have no use for like the other products out there. Very easy to use too. If you're a Prime member this is a must have you'll thank me later, and if you're not a Prime member get your membership right away, you don't know what your missing.", "verified": true, "helpfulness": "0/0", "author": "Prime4Life"}, {"rating": 3.0, "review": "I want to like it... but with all the restrictions Amazon has put on it, it's limiting it's potential. Everything leads back to something you buy or rent from Amazon, on every screen is what it feels like. You have to go thru a lot of steps to side load apps. Amazon putting them burred in the settings is just plain crazy. If I could, I'd wipe it & just install an android os on it because of all these. There's so little you can personalize as it is. Was expecting more, but it is super cheap for what it is.I bought it to use Kodi & Mediabrowser on, but it's a little to slow for that for everyday use. It's great for when it's needed but not for every day use. Hopefully they'll make a beefier version soon. Remote has some issues with it's connection at times.I'm sure this thing would be great for all the Netflix & Amazon & the like apps on it. I love the tiny remote. *shrug* It's just ok as it is.", "verified": true, "helpfulness": "0/0", "author": "Jim Applebaugh"}, {"rating": 4.0, "review": "Overall a really great product. My only complaint is that the remote is significantly cheaper feeling than the regular fire tv remote (which i suppose they had to do to sell it for so much lower of a price for essentially the same thing).", "verified": true, "helpfulness": "0/0", "author": "Adam Krauszer"}, {"rating": 5.0, "review": "This thing is amazing!!! I love it, my kids love it, and so do my grand kids!!! Quite surprised at all it provides !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my fire stick!", "verified": true, "helpfulness": "0/0", "author": "micheLe \"msw183\""}]