[{"rating": 5.0, "review": "SO pleased to have bought this and now am able to stream Amazon Prime videos to my tv!", "verified": true, "helpfulness": "0/0", "author": "Lori Palmer"}, {"rating": 5.0, "review": "So easy to connect.  With the App on Kindle Fire, it makes it even easier.  So glad I have it.", "verified": true, "helpfulness": "0/0", "author": "Cris Peterson \"curious\""}, {"rating": 4.0, "review": "Not as versitile as I had hoped, but that is in part due to my lack of understanding of its capabilities.", "verified": true, "helpfulness": "0/0", "author": "Shane Johnson"}, {"rating": 4.0, "review": "Fire Stick is a solid device. The specs are impressive especially considering the price.Would have given it 5 stars but the remote control app does not work with my BB10 phone, so typing is a huge pain only being able to use the TV's keyboard and the remote's arrows.", "verified": true, "helpfulness": "0/0", "author": "watson023"}, {"rating": 3.0, "review": "Works pretty much as expected. The interface and remote are a little quirky. Not very intuitive. Over all we like it.", "verified": true, "helpfulness": "1/1", "author": "Jan-Arden Petersen"}, {"rating": 4.0, "review": "works for me.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Hawley"}, {"rating": 2.0, "review": "This is a great idea, but it doesn't work for me.  Our internet isn't the problem as we have a smart tv and amazon prime videos and netflix stream perfectly; this only works half the time.  We have to unplug it to restart it every day and it maybe improves the video quality temporarily.  I don't know if it's our geographic location in South Dakota or if it is a bad device.  Either way, I wouldn't recommend it.", "verified": true, "helpfulness": "0/0", "author": "L.C."}, {"rating": 5.0, "review": "I was surprised how easy it was to set up and use. I am still finding new things to watch and am really enjoying not having to pay for Cable TV anymore!", "verified": true, "helpfulness": "0/0", "author": "Elaine \"Elaine\""}, {"rating": 4.0, "review": "So far so good. Only issues I've had so far has been mild picture quality glitches. The games are fun, and there are plenty of TV apps. Well worth the minimal investment. Especially if you are already a Prime Member!", "verified": true, "helpfulness": "0/0", "author": "Nate Pool"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Lissandra Salinas"}]