[{"rating": 5.0, "review": "Great product. Easy to install, even for a mild technophobe like me.", "verified": true, "helpfulness": "0/0", "author": "ReviewGuy23"}, {"rating": 5.0, "review": "Very easy to set up (I have medium tech skills).  One little tip:  If you can't get the back of the remote open to install the batteries, just use a small flat-head screwdriver (small one that you'd use to tighten screws on eyeglasses) and gently pry it open.  It comes right off after that.  The quality of the programs I watched were incredible:  very high definition.  And fast!!  No waiting for the movie to download.  And so much programming to choose from.  I am really enjoying all the benefits of Prime Membership (free shipping on Prime Amazon products, lots of music and now Fire TV Stick).", "verified": true, "helpfulness": "0/0", "author": "D. Sherman"}, {"rating": 4.0, "review": "So far so (almost) good - not great - with this device. First off, the remote was nearly impossible to open to insert batteries - had to use a small screwdriver with help from a youtube video. Second, I have noticed that no matter what Wifi I connect to, it only connects on the second try (even though login is the same). Aside from this, in general it works well - I bought it for social Games with friends which it ran A-OK. Streaming using Prime online videos had some issues - delay / stutter, stopped with no reason, etc. - I added a wifi repeater with a stronger signal (using N-router) and had the same issues - cannot stream a movie without at least 1 or 2 stops / issues. On the flipside, I recommend using PLEX - I had the same issues to start but lowered the stream quality a bit and it was solved (but can only stream local network files). For the $5 PLEX add-on, totally worth it. In general I think this blows away the Chromecast in terms of options, functionality.", "verified": true, "helpfulness": "0/0", "author": "Roy Fox"}, {"rating": 2.0, "review": "Can not shut off, have to unplug from tv when done. Sound was poor but picture was good.", "verified": true, "helpfulness": "1/1", "author": "Mike New"}, {"rating": 5.0, "review": "I'm very happy. It's set-up was easy and fast.It takes no time to learn to use the remote.", "verified": true, "helpfulness": "0/0", "author": "Mark Reed"}, {"rating": 4.0, "review": "I have only had this for a week or so; I decided to buy because I became a PRIME member and the ONLY way to watch Prime video/tv outside of your computer is by buying this if you are an ANDROID person like me. I REFUSE to have to buy a kindle or other 'Amazon acceptable' device to have full use of my membership. I think Amazon should grow up and allow Android users a good platform to use their Prime membership, but I digress...Overall, compared to an older dvd/blu ray player that had 'net capability that I was using for netflix and other online services through a t.v., the Fire Stick FLIES as far as speed; but that may be due to the fact what I had been using was so slow. I will say ease of setup, intuitive use of remote, etc, is great. The sound quality is LEAPS AND BOUNDS better than the sound that was coming through my computer. I don't have an uber-expensive tv, but the sound quality through the firestick is impressive.I have not done enough 'exploring' on it to get more of a idea of overall 'value', it just felt like a necessary purchase in order to be able to expand how I was using my prime membership. I like the fact I can take it on the go and plug it in to other TV's if there is internet access and be able to use it, although I have yet to try that.I would have given it an initial score of 5 stars were it not for Amazon's inability to serve the needs of its ANDROID customer base. Grow up Amazon and give us 'Droids' some love!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "great product love it. I had it for about a month and no problems as of yet. Side note the batteries are a little hard to replace, it took some time just to get the back open.", "verified": true, "helpfulness": "0/0", "author": "T Capers"}, {"rating": 5.0, "review": "Easy to set up, nice and portable ( I use it when I travel) and has all the shows and availability of programs like Netflix that I need.", "verified": true, "helpfulness": "0/0", "author": "T. A. Smith \"TASvisions\""}, {"rating": 5.0, "review": "It arrived on time.  It works great.", "verified": true, "helpfulness": "0/0", "author": "Joann Heisler"}, {"rating": 5.0, "review": "Very good stick.", "verified": true, "helpfulness": "0/0", "author": "Lubna"}]