[{"rating": 1.0, "review": "Very slow, with long loading times.  I already had an Apple TV on my upstairs TV so I thought I would give the Fire TV Stick a try for my basement TV.  I was not impressed, the load times took for ever and I had constant buffering issues.  I think this may have to do with the fact that the unit has no hard drive and is simply a flash drive.  I thought that maybe the issue was that my router was too far from the TV, so I moved my signal booster to the basement.  This did not fix the issue, it still loaded slowly and needed to buffer every few minutes. I returned this unit and spent the additional $20 for another Apple TV and have had no issues with it.As a side note (because the photos, nor the TV ads show this):  the fire stick (flash drive) needs to connect to your TV via a wired cable (which is not very long).  If you are not expecting this, you might have to deal with covering up the wire behind your TV for aesthetic purposes.", "verified": true, "helpfulness": "0/0", "author": "Scott A. Larson \"Ti99er\""}, {"rating": 5.0, "review": "I first bought Chromecast but once I read all the features of the Fire TV Stick, I had to check it out and boy am I glad I did.  It blows Chromecast out of the water!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Reilly"}, {"rating": 5.0, "review": "Great product. I have another device that is similar to this, but the Fire Stick's interface is easier to use.", "verified": true, "helpfulness": "0/0", "author": "Regniers"}, {"rating": 5.0, "review": "This thing is amazing I want to get one for every TV in my house. Had only one issue with the picture but I was able to fix it by lowering the resolution.", "verified": true, "helpfulness": "0/0", "author": "ben nicastro"}, {"rating": 5.0, "review": "Awesome stuff. Simple to install, and even more easier to use.", "verified": true, "helpfulness": "0/0", "author": "Komail Haider"}, {"rating": 5.0, "review": "Awesome. Way better than chromecast. Got it for free by signing up for 3 months of sling tv", "verified": true, "helpfulness": "0/0", "author": "n.merritt"}, {"rating": 5.0, "review": "Very cool product! Turns your regular TV into a smart tv. Can move it around to all the tvs in the house. Download the fire stick app for your phone and it's all at your fingertips without the remote! So glad I bought this, considering dropping cable now!", "verified": true, "helpfulness": "0/0", "author": "MD,RN"}, {"rating": 4.0, "review": "A lotta bang for your buck!", "verified": true, "helpfulness": "0/0", "author": "cody tilley"}, {"rating": 5.0, "review": "This streams from my wi-fi router fast enough to watch Amazon and Netflix movies without any problem at all. I like the way the software organizes the channels and selections within each channel.Be aware that the 'stick' needs external power, so there will be a small cord running from the back of the TV (where the stick is installed) to the closest 120vac outlet.The remote is great, too. Easy to set up. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Utah Pete\""}, {"rating": 2.0, "review": "I ended up buying one but as I live in Dominican Republic amazon applications do not work for the town can only use netflix. I wonder if a vpn could work and thus enjoy my purchase to the fullest?", "verified": true, "helpfulness": "0/0", "author": "luis torres"}]