[{"rating": 5.0, "review": "I debated over getting the fire stick or the Roku and I am happy with my decision to get the fire stick. I chose it mainly because I have Amazon Prime and also Netflix. We have several HD tv's in the house and only one smart TV and this makes them all a smart tv. Like the simplicity of moving the fire stick to any of the TV's. Have not had it long enough to take on a trip. It was a tight fit on the back of the TV's but once you get the hang of it, it is ok. Menu navigation could be improved but over all I give it a 5 star rating, price is good and goes great with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 4.0, "review": "Update:  After battling the firestick for months trying to figure out what was wrong we've finally solved our problem. It was our 5 year TV that wasn't getting along with it.  I hooked it up to our computer monitor and it worked perfectly.  I'm not sure why the TV would effect the internet connection of the firestick, but whatever.  Make sure your TV is compatible!", "verified": true, "helpfulness": "0/0", "author": "Robert Ryder"}, {"rating": 5.0, "review": "This thing works awesome", "verified": true, "helpfulness": "0/0", "author": "scot hansen"}, {"rating": 5.0, "review": "Gary Busey was right!", "verified": true, "helpfulness": "0/0", "author": "justin brassell"}, {"rating": 5.0, "review": "Very user friendly and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Joseph R. Quesada"}, {"rating": 5.0, "review": "Easy directions!", "verified": true, "helpfulness": "0/0", "author": "deb"}, {"rating": 5.0, "review": "This is perfect for the TV in our master.  Good quality and easy set-up.", "verified": true, "helpfulness": "0/0", "author": "Julie T."}, {"rating": 2.0, "review": "I received this fire stick as a promotional offer for sling tv. I was given the choice between a fire stick and a roku stick. Since I already had a roku 3 box I thought I'd give it a whirl. That was my first mistake. As a streaming stick with apps, it's better than chromecast since chrome is limited to mirroring other devices. But compared to the number of tv apps available with Roku, this is definitely Roku's idiot step brother. It's not nearly as robust in selections, the remote has a tendency to jump across three tiles with a single gentle press of the directional button, the YouTube app is definitely lacking in polish, FoxNow, CBS All Access, and several others are unavailable on fire stick. If you're considering this device, pony up the other 99 cents and get the Roku. I should have heeded the advice I received so many years ago - if you play with fire, you're gonna get burned.", "verified": true, "helpfulness": "0/0", "author": "Corey Stevens"}, {"rating": 5.0, "review": "works well,", "verified": true, "helpfulness": "0/0", "author": "William E. Burse"}, {"rating": 5.0, "review": "Simple & Easy, We love it.", "verified": true, "helpfulness": "0/0", "author": "FUZHEWUZHE"}]