[{"rating": 5.0, "review": "Absolutely love it.  Don't know what I was doing without one before.", "verified": true, "helpfulness": "0/0", "author": "carlos jones"}, {"rating": 5.0, "review": "I can't say how much I love this product. We mainly use it for Netflix. We have fairly slow internet and even with that we rarely have a problem with shows not wanting to play, even in bad weather. Love love love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Summer Dixon"}, {"rating": 5.0, "review": "The Fire TV Stick performed as advertised, giving me access to my Prime content. I am still working to wring out all of its capabilities, but fully expect it to exceed expectations.", "verified": true, "helpfulness": "0/0", "author": "Fred Thompson"}, {"rating": 5.0, "review": "Love it!!!  Works as advertised and far better and faster than our brand new DVD player...", "verified": true, "helpfulness": "0/1", "author": "Robert Speed"}, {"rating": 4.0, "review": "Annoyingly heavily biased to Prime and Amazon content in general but works very well except for the alphabetically ordered keyboard, with serial input, which is mind-numbingly slow and irritating when searching for content. Hope there will be an update soon.", "verified": true, "helpfulness": "0/0", "author": "Robiyan"}, {"rating": 4.0, "review": "Love the fire stick i actually have it hooked to hdmi and running off the tv usb for power it does give a warning of low voltage power source but works perfect. So most other sticks you have to run off an external power cable.  if thats a deal breaker to you then buy the fire stick. Other than that love prime and youtube and added kodi with kodi you can practically add any tv app you want. Runs super smooth fast 1080i also the wifi connection is super since our router is upstairs but picks it up with plenty of bars.", "verified": true, "helpfulness": "0/0", "author": "Shane Beard"}, {"rating": 4.0, "review": "Simple and easy to use. ...", "verified": true, "helpfulness": "0/1", "author": "JOEY DELA ROSA"}, {"rating": 2.0, "review": "the sling tv cannot even get thru 1 show constantly \"catching up\"  circle spins for 1/2 the program.  It works with Netflix fine.  I expected better still no replacement for cable tv.", "verified": true, "helpfulness": "0/0", "author": "Gwen Hemmrich"}, {"rating": 5.0, "review": "I have a Roku player for another TV but just got the Fire Stick which I love much better. I even set it up with no hassles myself. I am not familiar with any electronic devices. It was extremely easy! The directions for setting up and watching TV was a snap! Very reasonably priced!", "verified": true, "helpfulness": "0/0", "author": "RosieH"}, {"rating": 5.0, "review": "Was very excited to receive this in a couple of days. Sat and took me 15 mins to figure this out. Don't worry doesn't take that long, I was just having issues getting the internet connected.This works great. Yes sometimes depending on weather it may have to research for signal but that is part of wireless connection. Am able to use for my prime, Netflix and sling. I have not tried the games but plan on buying the controller for that later. I am very please with this and am still learning all that it can do.", "verified": true, "helpfulness": "0/0", "author": "psylvia"}]