[{"rating": 5.0, "review": "Certainly adds to our viewing pleasures. A fine product very comfortably priced.", "verified": true, "helpfulness": "0/0", "author": "Leonard Block"}, {"rating": 5.0, "review": "We love the fire stick! Use it in our bedroom. Easy to set up and easy to use. We purchased the voice remote which is awesome.", "verified": true, "helpfulness": "0/0", "author": "Susan Crimmins"}, {"rating": 5.0, "review": "Wish I had bought this sooner.  We use it all the time now.  Such a better selection of movies than On Demand.", "verified": true, "helpfulness": "0/0", "author": "CaliMom \"calimom\""}, {"rating": 4.0, "review": "Very happy with the Fire Stick and plan to purchase another very soon. Easy directions to follow, easy to install, and works very well, we love it.", "verified": true, "helpfulness": "0/0", "author": "patricia a. hurst"}, {"rating": 5.0, "review": "Very pleased with this purchase. It was delivered just before Christmas while I was on vacation and I watched close to a dozen movies. It streams flawlessly and is extremely easy to use and set up. To really enjoy the entire experience I recommend becoming an Amazon Prime member. If you purchase a lot from Amazon, it's a no brainer.", "verified": true, "helpfulness": "0/0", "author": "mklon"}, {"rating": 5.0, "review": "Fire TV Stick is everything you said it would be!  The one question I do have, when do none prime movies flip over to being prime movies?", "verified": true, "helpfulness": "0/0", "author": "Richard R. Thayer \"Video File\""}, {"rating": 5.0, "review": "Everything and more.  Easy to use and fun", "verified": true, "helpfulness": "0/0", "author": "Carol Tungate"}, {"rating": 5.0, "review": "Easy install, works quickly and accurately.  It is so much better than that nonfunctioning, problamatic Chrome stick!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"HDLUVR\""}, {"rating": 5.0, "review": "Well worth the money", "verified": true, "helpfulness": "1/1", "author": "Sara W."}, {"rating": 4.0, "review": "Better than what I expected.", "verified": true, "helpfulness": "1/1", "author": "zadyann campbell"}]