[{"rating": 2.0, "review": "Bought it for its screen mirroring functions didn't seem to be compatible with my phone. Didn't use any of it's other features so i returned it.", "verified": true, "helpfulness": "0/0", "author": "raymond l. mariche Jr"}, {"rating": 4.0, "review": "Between the ease of use and the constant breaks of new shows we are saying good bye to cable. Amazon prime is a must. 4 out of 5 because of remote being useless at more than 6 feet away. App on smart phone is another must. Controllable from anywhere", "verified": true, "helpfulness": "0/0", "author": "Shanna"}, {"rating": 5.0, "review": "Very easy to use with a small learning curve.  Compact and light and makes access to Amazon Prime fast.  A", "verified": true, "helpfulness": "0/0", "author": "Aileen B Klawitter"}, {"rating": 3.0, "review": "Pretty disappointed because I am usually SO happy with any and everything that Amazon does. But it keeps freezing and sometimes while watching a show, it will just randomly stop and go back to the home screen. Then I go through all the clicks to get back to it, and it happens again a few seconds or minutes later. Often happens 10+ times in one episode!Other than the glitches, it's a great product. I used to have my laptop connected to my TV to watch everything so it's really nice to be able to use my computer and watch TV at the same time. Can watch Netflix, Hulu Plus, Amazon Prime, Showtime and more.", "verified": true, "helpfulness": "0/0", "author": "MFS"}, {"rating": 5.0, "review": "Love!", "verified": true, "helpfulness": "0/0", "author": "David L. Walker \"BHAMDAVE\""}, {"rating": 5.0, "review": "It was a bit of an adjustment from Chromecast, but now that I am adjusted I love the layout focusing on Prime, and love having the remote.  Also works with my android phone and with my Sony TV remote, though I've noticed it occasionally hangs with the android phone (Chromecast wasn't perfect on this either, might be my phone).  Slight problem with so many ways to control it as the kids get in change-the-channel wars.  Able to watch Youtube, Crackle, etc.  The included games are good for a few minutes of fun now and then like you might play on your phone if it had a remote.", "verified": true, "helpfulness": "0/0", "author": "Marlon R. Wood \"marwood\""}, {"rating": 5.0, "review": "As long as you have good internet service, this works great.  We tried it on DSL internet service and it would not stream seamlessly.  However it works great on our Verizon jet pack wireless but really eats up the data.  Easy to install and use.  Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Jane Allegro \"Jane\""}, {"rating": 5.0, "review": "Love the Firestick. Have even used it on other TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "B. Bowman"}, {"rating": 5.0, "review": "Awesome piece of hardware.", "verified": true, "helpfulness": "0/0", "author": "Rob Galang"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Kay Harris"}]