[{"rating": 2.0, "review": "I could never get it to work and had to ship it back.", "verified": true, "helpfulness": "1/1", "author": "anneka luna"}, {"rating": 1.0, "review": "The picture is very dark on this and the picture quality in general seems to be very lacking. There is no options in the settings to adjust the brightness or contrast, only the resolution. I had to put the brightness all the way up on my tv settings, to the point where it is way too bright for normal tv viewing (I use over the air for local channels and apple tv for streaming). Its hard to deal with the dark picture already, but on top of that the quality in general seems to be below 720p.", "verified": true, "helpfulness": "1/1", "author": "grizzlebees"}, {"rating": 5.0, "review": "Purchased for my husband-he loves it!  Easy to use, many options.", "verified": true, "helpfulness": "0/0", "author": "Cindy Davis"}, {"rating": 2.0, "review": "I spend all day figuring out complicated technology, so I wanted something simple, elegant and easy for my home TV streaming. The Fire TV stick promised that, but disappointingly did not deliver. I love the Amazon ecosystem, and admittedly, the initial installation and setup of the Stick was quite fine. I also liked the clever packaging of the product, the box held everything securely without much excess waste. Then, though, came the fatal flaw. Netflix. Like most 'net TV watchers, it's all about Netflix for me, and the Fire TV Stick Netflix app just plain would -not- work. Type in the user and password, and it churns for a moment before kicking back out to the home screen. I tried uninstalling, reinstalling, changing my netflix password, rebooting the stick, unplugging and replugging the stick, reverting to factory defaults and setting it back up, weird DNS voodoo on my firewall; Nothing would make netflix go. So sorry, Amazon, this one was a disappointment for me.", "verified": true, "helpfulness": "1/2", "author": "Lucas Moore \"Turq!\""}, {"rating": 2.0, "review": "Have a Roku 3. It was timing out with the usual messages, reset the device, the problem is your wifi network, contact your ISP, etc. Meanwhile, my Kindle Fire Tablet was receiving the same movie with no problem. Thought the Fire TV Stick would be the answer but it did no better than the Roku 3. I returned it.", "verified": true, "helpfulness": "0/0", "author": "green jay"}, {"rating": 5.0, "review": "Great very easy to set up, order arrive in like two days I purchased for my son he hardly leaves his room now", "verified": true, "helpfulness": "0/0", "author": "yvonne"}, {"rating": 1.0, "review": "As a hunter and camper I try and find as many new gadgets as possible for a fun campin experience. I wanted to make a fire that was hot and strong. Then I came across the fire stick and I knew this would make my fire awesome. Unfortunately as soon as I threw it into my fire if sparked and smoked and made my fire die. In the end it smelled terrible. 1 star. It was a cool fire work show", "verified": false, "helpfulness": "1/5", "author": "Nick"}, {"rating": 5.0, "review": "had conectivity problem with wi-fi at first had to use extension hdmi cable(supplied with unit) system works outstanding. This unit is setup in bedroom. already have firetv in living room both are great systems.Neglected to add bought amazon game controller works perfect with both fire tv and fire stick very nice addition to both systems", "verified": true, "helpfulness": "0/0", "author": "John H"}, {"rating": 1.0, "review": "This item was purchased for my wife as a birthday present.  We have a Chromecast and love love it. However, She wanted the option to stream amazon prime.  This purchase was a big mistake.  The Netflix app is non functional. We cant even get past the login page.  The log in page has a programming error. Amazon will not admit it is on there end and a hardware error.  They keep wanting Netflix to fix the problem. I have been on the phone with tech support for about a total of 4 hours they keep bouncing me around from department to department and will not replace my device.  Tech support assumes that any problem is user error and not a device error.", "verified": true, "helpfulness": "3/3", "author": "Joshua Taber"}, {"rating": 5.0, "review": "I didn't want to pay for another cable box for the bedroom. The fire stick was easy to assemble and works great! SO happy I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Queen Boss Chief"}]