[{"rating": 2.0, "review": "To start with, I work in IT and have experience setting up wireless networks. At home, my other (competitor's) streaming \"stick\" works fine. I say that because I have had nothing but issues trying to get this device to talk to my Google Nexus 5 (Android) phone. It works fine with it's bluetooth remote, but the UI is significantly more difficult to navigate using the remote than the phone. Since the connection doesn't work, none of the tie-ins work, so I can't give this device more than 2 starts. If they fix the app", "verified": true, "helpfulness": "0/0", "author": "Rowdy L Vinson"}, {"rating": 3.0, "review": "Not as good as I hoped.", "verified": true, "helpfulness": "0/0", "author": "Doodleluv"}, {"rating": 5.0, "review": "Exellent unit", "verified": true, "helpfulness": "0/0", "author": "Son"}, {"rating": 5.0, "review": "More than I expected. I love it!", "verified": true, "helpfulness": "0/0", "author": "Michael R. Carpenter"}, {"rating": 2.0, "review": "I love Amazon, but not their TV stick. I think anyone who gave them 5 stars simply has not used another brand. I have used Roku, Chromecast and Amazon Fire TV stick, and I also rank them in that order. I would love chromecast more if it streamed Amazon Video like the other two brands. Amazon Fire TV stick is like a glitchy Roku that lacks grace. Navigation causes delays and streaming causes black screens with sound only or choppy delays. It's UI is not set up well, and lacks app segregation with its searches. Spare yourself. Just buy the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super easy to set up, just as easy to operate. Very cool.", "verified": true, "helpfulness": "0/0", "author": "KristaW"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Christine Ashdown"}, {"rating": 3.0, "review": "It arrived ontime,the pacage was packed good,however it was VERY hard to place the batteries in the remote. So far it works ok just sometimes it has to reload atlot.", "verified": true, "helpfulness": "0/0", "author": "Kyanna"}, {"rating": 5.0, "review": "Easy!", "verified": true, "helpfulness": "0/0", "author": "DebA"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Claribel Rios"}]