[{"rating": 5.0, "review": "A great product with no problems and does more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Are you kidding me?  I LOVE this fire TV stick!  It is a part of my daily life, now.  I can easily see the movies I desire and move it from room to room!  Great idea!", "verified": true, "helpfulness": "0/0", "author": "Guitarplayer"}, {"rating": 5.0, "review": "Easy to set up. Love it!", "verified": true, "helpfulness": "0/0", "author": "Edwin J."}, {"rating": 5.0, "review": "Awesome!  Quality of picture is great, simple to install and easy to navigate.  Price/performance is much better than any competitor.", "verified": true, "helpfulness": "0/0", "author": "William Elliott"}, {"rating": 5.0, "review": "I bought this for my daughters room as she doesn't have cable and she loves it!", "verified": true, "helpfulness": "0/0", "author": "Mia"}, {"rating": 5.0, "review": "love it.... well worth the money spent for it...", "verified": true, "helpfulness": "0/0", "author": "Nick L Ciancio"}, {"rating": 2.0, "review": "Its awesome when it actually works i can not get it to stay connected to the wifi, I have read all the forums and tried all suggestions from other customers and from amazon with no result.", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 5.0, "review": "It is a great product", "verified": true, "helpfulness": "0/0", "author": "Aluzay"}, {"rating": 5.0, "review": "This product is a must have for every household. I've had the Google chromecast and think this product is far superior. This has more features, and apps then the chromecast. The chromecast would totally suck up all my wifi and just lag it. This product doesn't lag the wifi and I keep it running 24/7. It's sleek, fast, and fun to play with.", "verified": true, "helpfulness": "0/0", "author": "eddaddy \"eddaddy\""}, {"rating": 5.0, "review": "I bought 2 of these when they were first released for half price. They came preactivated on my Amazon account. I plugged them into the USB ports on my TVs for power rather than the wall so that they shut down when the TV is off. The interface is great and responsive. I intended to give them away as Christmas gifts but I liked them too much. I even have one of them plugged into my Smart TV because I like the interface much better. These were a steal for the $20 I paid for each of them. If I see another good deal on them I will probably put them on my other TVs.I am a little worried that the remotes might interfere with each other if you try to use multiple Fire Sticks in the same area. With one in the living room and one in my bedroom it hasn't been an issue. I haven't tried the Android remote app yet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]