[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "kathy Gross"}, {"rating": 4.0, "review": "Great to take on the go", "verified": true, "helpfulness": "0/0", "author": "william hall III"}, {"rating": 5.0, "review": "Absolutely love it. No muss, no fuss, simply connect, sit back and enjoy your favorite movies and shows.", "verified": true, "helpfulness": "0/0", "author": "laroth"}, {"rating": 1.0, "review": "When it does work (rarely) it is constantly buffering. I thought it was our internet, but the Apple TV and my other wireless devices were streaming fine.", "verified": true, "helpfulness": "0/0", "author": "Amber Duke"}, {"rating": 5.0, "review": "Where have you been all my life Amazon Fire TV Stick?  This is the next best thing since sliced bread and I am loving it!  Faster than my Sony Network Media Player.  Great applications!", "verified": true, "helpfulness": "0/0", "author": "Sonja Payne"}, {"rating": 5.0, "review": "Unexpectedly surprising. It's fast and efficient, suggesting content based on your interests. I own both an Apple TV and now the FireStick, and can say Amazon is closing the gap between itself and Apple. Great media enhancer.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Vert good, except I had to cvall my granson in order to sign in.I live in Panama and the Stick wpiuld not recpognioze my stattion.Oncew cleared, is quite a Stick. Congratulations.Ricardo Maduro", "verified": true, "helpfulness": "0/0", "author": "Ricardo Maduro"}, {"rating": 4.0, "review": "Simple review - easy to install - lives up to all its promises - love it!  Only thing keeping it from 5 stars is a little broader selection of newer TV series seasons", "verified": true, "helpfulness": "0/0", "author": "Mizzourunner"}, {"rating": 4.0, "review": "I purchased Fire TV Stick in December of 2014, It worked great and we really enjoy all the shows that are available, however, the Fire TV stick stopped working recently and couldnt get it to work, replaced new batteries, reviewed the installation procedures, and try unsuccessfully to get it to operate again, so we have repurchased a new one in hopes we have better luck with our new purchase.  I wanted to call customer service but was unable to locate the number.  I hope our new purchase will work out better for us as we really enjoy the varieties of shows available on it.", "verified": true, "helpfulness": "0/0", "author": "James R Trehearne"}, {"rating": 5.0, "review": "ITA AMAZING HOW I LIVED THIS LONG WITHOUT IT !!", "verified": true, "helpfulness": "0/0", "author": "Joanna Theodorakis"}]