[{"rating": 5.0, "review": "If you are a Prime member then why wouldnt you want this. Extends the value of your membership by allowing you to watch your movies on the Flat Screen! 55\" way better than 9\". Use your prime movies you are paying for them already!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Terrible!!!! Poor picture and sound quality and very poor customer service. Poorly designed. Don't waste your money on this product very subpar.", "verified": true, "helpfulness": "0/1", "author": "Kathie S."}, {"rating": 1.0, "review": "I already owned a Chromecast but have Amazon Prime, which does not play nicely with Chromecast. I ordered the Fire Stick to take advantage of this membership benefit.  All I can say is CUMBERSOME ! Rather than conveniently casting from ones device one must keep track of a miniature remote.  I found this annoying as I had to strain to see the screen to select letters on the keyboard.  My eyes are good but the interface is very small.  Never mind the chance of misplacing the teeny remote.  It also drives, drives, DRIVES everything to Amazon ! It doesn't flow freely to one app to the next.  I was very disappointed and returned it.  Go with Chromecast. It's easy to use and a pleasure.", "verified": true, "helpfulness": "0/2", "author": "SueF \"sfurey7\""}, {"rating": 5.0, "review": "The stick works well. The installation was easy, the operation is simple and it has no problem finding WiFi connection. The modem is 9-10 ft from it on an other level of my home.", "verified": true, "helpfulness": "0/0", "author": "biophile"}, {"rating": 4.0, "review": "I would give it five stars but sometimes it freezes for a few seconds.", "verified": true, "helpfulness": "0/0", "author": "Arilson Jose Gonzales"}, {"rating": 5.0, "review": "LOVE IT!  Definitely recommend.  Easy to use.  Fast, simple set up.", "verified": true, "helpfulness": "0/0", "author": "C Robins"}, {"rating": 5.0, "review": "great stick, works great, doesn't need line of site to be used and unlike apple that you don't get amazon on, this you get netflix, hulu an of course amazon.", "verified": true, "helpfulness": "0/0", "author": "Malcolm"}, {"rating": 4.0, "review": "Awesome so far!", "verified": true, "helpfulness": "0/0", "author": "Mokihanna"}, {"rating": 2.0, "review": "One of the first to own the Fire TV Stick w remote and although I'm a huge fan of Amazon I was disappointed by this item.  The remote just isn't designed very well and it loses signal/shuts down more often than my ROKU.  Remote design just doesn't make sense to me---u do not place the home button so close or in the middle of the most used functions.  Look at ROKU, the home button is far away from the play, rewind, forward.  Most remotes are designed this way and in Fire TV remote hitting the home button takes you completely out of the program or app you watching.  Very annoying.", "verified": true, "helpfulness": "1/1", "author": "DJL"}, {"rating": 5.0, "review": "Birthday gift for my mom she loved it very easy for her to use once set up ..", "verified": true, "helpfulness": "0/0", "author": "sarah garza"}]