[{"rating": 5.0, "review": "Best streaming stick on the market and for the price you can't beat it. Also, is Bluetooth ready in case you wanted to use a keyboard. I've had or tried many of the different streaming sticks currently out and this one is by far my favorite. It is the easiest to use and most reliable in my opinion. A bonus feature is you can actually put the Amazon stick into sleep mode when not in use. The Roku streaming stick always remains on as long as the TV is on and it gets very hot. Not the Amazon stick though. Pause your show and put it into sleep mode. Then push one button and it is ready to go out of sleep mode with no lag time right where you left off on your show. That's my favorite feature. Such a great device. 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This works pretty good.  The biggest problem is reading the very light nomenclature printed on the buttons.  You still need to pay for your subscription to Hulu, Netflix, or whatever service you are receiving.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is super and easy to use.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Cheryl M."}, {"rating": 3.0, "review": "The Stick works fine, but I'm not seeing many of my kind of movies.  I am not into R rated movies.", "verified": true, "helpfulness": "0/0", "author": "Vincent Webb"}, {"rating": 5.0, "review": "I am very happy I got this TV stick since I have now the luxury of watching my Amazon Prime movies on my TV screen.", "verified": true, "helpfulness": "0/0", "author": "Bebka \"grandma\""}, {"rating": 5.0, "review": "Wow....so glad I got this! Initially, the only reason I decided to get the Fire Stick is because I received an email from Amazon stating that effective September 14, 2015, the Amazon Instant Video app was going to removed from my 2011 LG TV. Since I watch a lot of amazon videos, I decided to get the Fire Stick. Now, I am really glad I did!! I can see that I'm going to get a lot of use out of it!Besides the instant videos, all my music and photos from Amazon are on there, as well as other apps like Hulu Plus, HBO Go, and Netflix! The quality of picture and sound is amazing as well.Guess I didn't expect anything less from Amazon! Great product....I highly recommend itAmazon Fire TV Stick", "verified": true, "helpfulness": "1/1", "author": "Vivianne0526"}, {"rating": 2.0, "review": "Kept stopping during Netflix", "verified": true, "helpfulness": "0/0", "author": "Bryan Davi"}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "Pat Raymond"}, {"rating": 5.0, "review": "I've watched 3 movies so far and decided to try Amazon Prime for 30 days free which I may keep.  So now I can watch two movies a day!", "verified": true, "helpfulness": "0/0", "author": "Thomas C"}, {"rating": 4.0, "review": "We love our Amazon Prime Instant Video and Music, so Fire TV is a must have.  The Amazon Fire TV Stick is installed on our family room TV on the other side of the wall from my ASUS RT-AC62U Wireless AC-1900 Dual-Band Gigabit Router.  The reason I mention this is because I believe this ASUS router is hands-down one of the best for home use.  Many of my co-workers that are network engineers use this router.  The Amazon Fire TV Stick is an awesome affordable product, especially if you are an Amazon Prime member.  But I do have intermittent connectivity issues where I have to unplug the AC power adapter to reset the Fire TV Stick.  I have many wireless devices in my house and only have connectivity issues with the Fire TV stick.  So... I highly recommend the Amazon Fire TV.  I have one  that always works perfectly and it is installed further away from my wireless router.  The Fire TV costs more, but you get more and it's worth it.  A complete list of the product specs and capabilities are available at http://www.amazon.com/gp/help/customer/display.html?nodeId=201640900 .  I still love my Fire TV Stick, but love my Fire TV even more.", "verified": true, "helpfulness": "0/0", "author": "Mike S."}]