[{"rating": 5.0, "review": "Love this product and all the fun it brings into one package. Great addition for the TV to combine services around the internet. You definitely need the voice activated feature, it's a hassle to find things on the search engines, letter by letter, using the arrows on the remote.", "verified": true, "helpfulness": "0/0", "author": "J. R. Estevez \"jestevez\""}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like the response time and the menu.  I do not like that Plex did not come with the device and requires another 4.99 purchase.", "verified": true, "helpfulness": "0/0", "author": "David Gray"}, {"rating": 5.0, "review": "I love this fire stick. it was so easy to set up. I connected to wifi then did the software update and I was signed into my amazon account and my Netflix within 6 minutes. the longest part was the demo/introduction. the fire stick interface is set up identical to the fire t.v. which I also own. easy to navigate and find what I'm looking for. I do like the voice remote th a comes with the fire t.v. better than the regular remote that comes with the fire stick but the remote app is pretty awesome on my android.  I recommend the fire stick to everyone that doesn't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "E-MONEY"}, {"rating": 5.0, "review": "Got for Xmas. Easy to use!! Love it.", "verified": true, "helpfulness": "0/0", "author": "Kevin McGinnis"}, {"rating": 5.0, "review": "Small, and amazing.  I have it on my tv in bedroom :)", "verified": false, "helpfulness": "0/0", "author": "Amber Jackson"}, {"rating": 4.0, "review": "Easy enough setup, works great for AMAZON, not as much for other", "verified": true, "helpfulness": "0/0", "author": "James E. Breneman \"jimbreneman\""}, {"rating": 3.0, "review": "my remote control back was super hard to removeother than that LOVE IT", "verified": true, "helpfulness": "0/0", "author": "pinkbikerchick"}, {"rating": 5.0, "review": "I love that I am able to view Netflix without hooking up my computer! It is super easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Cailan"}, {"rating": 3.0, "review": "Chromecast seems better.", "verified": true, "helpfulness": "0/0", "author": "Willie"}]