[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Mary Theresa Young"}, {"rating": 5.0, "review": "Great product.....especially if you are Android/A.azon oriented.", "verified": true, "helpfulness": "0/0", "author": "frank jolly"}, {"rating": 2.0, "review": "I am growing  increasingly frustrated with my Fire Stick.  The screen freezes while the sound continues to roll, then the stream catches up in fast mode.  This action happens in Netflix app but not in the Amazon Prime movie feed.  Netflix feed via laptop or mobile device does not freeze.  The internet speed and routers check out ok.  I'm not impressed so far.", "verified": true, "helpfulness": "0/0", "author": "Seasoned Constructor"}, {"rating": 5.0, "review": "best purchase I've made this year", "verified": true, "helpfulness": "0/0", "author": "stacy campos"}, {"rating": 5.0, "review": "Easy installation and works perfectly.  Good range.", "verified": true, "helpfulness": "0/0", "author": "LaLa"}, {"rating": 1.0, "review": "Can't get Netflix on TV after 3 months of working perfectly.  That was the main reason I got Fire stick. What can I do?", "verified": true, "helpfulness": "1/1", "author": "neeliegal"}, {"rating": 5.0, "review": "Love it. My family uses it constantly.We bought the Fire TV Stick around the same time we upgraded our old not-flat TV. At the time we were contemplating a Smart TV. We ended up going with the Fire TV Stick because it was on sale and because we felt like it would be easier to update down the line. I worried that if we got a Smart TV it might not support popular apps in a couple of years.We primarily use our Fire Stick to use Netflix and Amazon Prime, but we have also used it to stream music, play games, and to watch a slide show from my husband's iPhone. I have found it to be incredibly intuitive and easy to use. My young children can navigate using the simple remote. When the remote goes missing (annoying and unfortunate problem at my house) I can navigate with my phone.In summary, this has been a great device and we've been very happy. We also got one for my parents who are in their 60s. They are enjoying it, too. At this price point I think the Fire TV Stick is a solid choice.", "verified": true, "helpfulness": "0/0", "author": "E. B. Glass"}, {"rating": 2.0, "review": "It doesn't have very much memory and is constantly indicating that it is running out of memory.  Other streaming devices in the house have little skipping problems but I feel like this stick is resetting and freezing frequently.The remote is very cheap, feels cheaply made.", "verified": true, "helpfulness": "0/0", "author": "Anonymous User"}, {"rating": 5.0, "review": "Really like it,my son in law installed it with no problem", "verified": true, "helpfulness": "0/1", "author": "Pat"}, {"rating": 5.0, "review": "I am a huge fan of Amazon products. I already had the Fire on one tv, and decided to get the Fire stick for the other since it was about half the price. I'm not sure if it's my tv or the Fire/Fire Stick, but the menu on each tv is completely different. I enjoy the menu on the regular Fire more, but the rest of my family doesn't seem to care. The biggest disadvantage to the Stick is that the remote doesn't come with the voice control button for searching. I'm lazy. I REALLY like the voice control. I know that I could just buy another remote, but if I was spending that much money, I would've just bought the regular Fire in the first place. The Stick is also convenient because you can just unplug it and take it with you (we took it on vacation). I am very pleased with the price point of the Stick, and will probably start buying them as gifts.", "verified": true, "helpfulness": "0/0", "author": "Eva Moon \"Eva\""}]