[{"rating": 5.0, "review": "Works great, was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "mwk"}, {"rating": 2.0, "review": "My $20 Chromecast (almost a year old mind you) has volume control options. When connected to the Chromecast the volume keys on my phone support raising and lowering the TVs volume, out of the box since say one. I love my fire stick. Its fast, has all the support I'm looking for in terms of streaming capabilities but until some way or controlling the devices volume is enables, its useless to me. I don't want to dig out a rv remote to raise or lower volume when my year old chromecast can already do it. This was supposed to be a replacement to that device, and it is leaps and bounds faster and more intuitive, however, until this issue can be resolved it'll be back to my chromecast for a little bit. PLEASE PLEASE PLEASE implement a solution for this. Its out of this universe that it is an afterthought to this product. Plex can even see my fire stick and connect, even display and allow me to ff and rewind through the streaming movie, but volume does nothing. I'll stop ranting, but I hope this isn't sitting In the draw too long so that I can enjoy it for its intended purchase.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This thing does everything my Chromecast does and more! The integration with Amazon Instant Video and Amazon Prime Music is spot on, and apps such as Spotify and YouTube are all OK. It was also pretty cool that it was linked with my Amazon account out of the box without having to type in any passwords. For some reason during my first launch, I had to unplug it and plug it back into the USB charger thing that it came with because some kind of software update failed.The YouTube app isn't as good as the one on my Chromecast. Videos lag even though they are buffered enough (according to the video progress bar in the app). If another person wants to \"cast\" a video to the TV playlist, they need to pair their phone with the YouTube app on the Fire TV Stick.The Spotify app is okay, but for some reason I can't connect my phone to it unless I go into a weird tutorial screen. Also, there is no support for Spotify Connect through the desktop app, so you have to make sure that your phone has enough battery all night long if you want to play music through Spotify.Games in the App Store are pretty cool, but most are obviously just ports of Android phone games. Most games even still have their on screen controls. Overall, they are OK but not a first class experience that you would expect from a console. GameCircle (Amazon's version of Apple's GameCenter) is confusing at best, and useless at worst. I don't have a Fire tablet or phone though, so I guess I'm not supposed to get a lot of use from this feature, but you would think a company like Amazon would have put more work into the UX of this if they really want to compete with the big console makers. There's no way (that I have found yet) to view your achievements or leaderboards for games. There's also no way to add friends in GameCircle.The Fire TV Stick also suffers from multitasking laggyness just like all Android phones do. If you go to the home screen, it takes a few seconds for the UI to become responsive because Android is (presumably) freeing resources from the previous app that you had open. Also, there is a buzzing sound that I have observed occasionally from most apps (including Amazon Instant Video and Prime Music) when you try to play media shortly after running another app. It's especially apparent in the YouTube app and very annoying. The buzzing sound alone made me subtract 1.5 stars from this review because it happens ALL THE TIME in third party apps and games (less often while playing Amazon content).If you are a developer, this thing is awesome! It's extremely easy to connect over your network to it with ADB. Honestly, I would just buy this thing as a development device because it's really that great. Plus the small form factor makes it really easy to take it with you and demo your TV apps almost anywhere.", "verified": true, "helpfulness": "0/1", "author": "Eric T."}, {"rating": 5.0, "review": "Got this for my mom, who was watching Netflix on my PS3. Once the PS3 died due to old age, she was having trouble navigating through controllers on the Xbox and/or PS4. Thought about the Roku, when I saw the Fire Stick on-sale.Once connected, it took its time to update. And now that I've setup Netflix for mom, she can get to the programs that she wants with the simple remote. There's only like 6 buttons, even my mom can't mess it up. So to me it was $19 well spent.", "verified": true, "helpfulness": "1/1", "author": "hengyu"}, {"rating": 3.0, "review": "update:I bumped my rating up to 3 stars. It'll probably stay there. the stick finally managed to maintain a connection to Amazon's server and get the updates it needed. But it took several hours on a 7-megabit connection. I had to go to bed and leave it to do it's thing so I don't know exactly how long it took, but after 90 minutes it wasn't even 25% done. In my opinion, this thing should have been ready to go out of the box; after all, it's only been on the market a short time; most of the content should have been there already with only a minimal update being necessary; not several hours worth of download at 7mb/s.I browsed around the UI for a while. nothing spectacular here, but it is easy to learn/use. remote is responsive. I assume it does everything over the WiFi, though I haven't found anything telling me how the signal gets from the remote to the stick. A nice-to-know thing for tech-minded people.I haven't had time to actually try to watch anything yet, so I'll probably provide another update soon.Original:I got my device today. I usually try to wait a while before posting a negative review, but I\"m making an exception since I've had the device for about 4 hours and still can't use it.setup has failed about 8, maybe 10 times so far; I lost count. I get a message saying that it can't update the software, and I should power cycle the device and/or try again later.If I can get it working, I'll update my post and give it another star. but 3 will likely be the max it gets.", "verified": true, "helpfulness": "0/2", "author": "badbitbucket \"You mean I have to actually play the lottery to win? Bummer!\""}, {"rating": 1.0, "review": "When I read the impressive specs this had compared to Apple TV (dual core, 1GB memory in Fire stick vs single core, 512MB memory in Apple TV) , I thought it would blow my 2 year old Apple TV out of the ballpark. But, when I got it yesterday and put it through its paces, the aging Apple TV won hands down where it really counts - video quality. My iTunes movies play in pixel perfect 1080P via Apple TV, but the Prime movies look ugly, choppy & fuzzy. Particularly pronounced in action scenes (worse than some old VHS tapes) but even the normal scenes look less than DVD quality. YouTube video quality is passable but still no comparison with Apple TV. Vevo videos look downright hideous and stops frequently to buffer. I checked my wifi network in Settings and it says Very good. The Apple TV is right next to the stick - so there is no reason for network to be bad.Prime movies play perfectly fine via the 'Amazon Instant Video' app in my year old Sony Blu-ray player, which too is right next to the Fire stick. Given the specs of the stick, my guess is the problem lies with the software.Also, during initial setup, I tried to enable Parental Control to prevent my kids from accidentally purchasing apps/videos, but when I entered the PIN, it got stuck in the 'Validating PIN' modal. I canceled and proceeded with the setup, and was able to enable the parental control. But, later when I tried to changed the display settings it again said 'Validating PIN' and won't proceed further. Frustrating.Gonna send it back.", "verified": true, "helpfulness": "3/4", "author": "Sasi"}, {"rating": 2.0, "review": "I Pre-ordered this Fire TV Stick in early November 2014 on a 50% off prime member discount with an expected delivery date of middle of Jan 2015 arrival. I figured that since this was a new Amazon item for release in the new year (so I thought) so waiting 2 months shouldn't be such a big deal. At any rate, I walked into a local Bestbuy on Black Friday 2014 only to find that they had tons of them in stock for sale. I guess that's the price I have to pay just to save half the cost. Go figure!!!", "verified": true, "helpfulness": "0/3", "author": "Rayner Lizardo"}, {"rating": 3.0, "review": "First of experience out of box was bad. It did not work the first time connected to my projector. I called customer service but that did not help. Agent suggested that HDMI port of my projector was wrong. I connected it to my TV next and was able to connect to my network and update software. Once software updated it connected to projector and I was fine after that.It also does not have BT Audio streaming(A2DP), would have been cool to use my BT speakers.", "verified": true, "helpfulness": "0/1", "author": "Krishnakanth Chimalamarri"}, {"rating": 5.0, "review": "Great product, does everything I expected. Nice operating menus and organized layout. Has all my favorite streaming services together, so I can access them in seconds.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I bought 2 of these from Best Buy for $25 each. I just set one up. I wanted 2 things - to access prime movie content, which I can't do with Chromecast and to connect to 5ghz WiFi which Chromecast also doesn't do. Well, here's what Fire Stick doesn't do...at least for now - It won't stream my movies purchased on Google Play Movies, it won't connect to Web Caster to stream online content and it does something annoying when streaming my YouTube play list; between each YouTube video it does a 10 second countdown. Chromecast streams YouTube play lists much more seamlessly. For my needs, Chromecast is still a bit better  but for now I need both devices to access content from the different companies. As for the 5ghz? I haven't connected to it yet. That network is at my workplace and I won't be taking it there due to the YouTube thing. So, sorry, nothing to report  on that front. They are both great devices,  but for now anyway,  I'll use Chromecast much more often.", "verified": true, "helpfulness": "0/0", "author": "Dennis Ballin"}]