[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/2", "author": "David"}, {"rating": 2.0, "review": "Bad", "verified": true, "helpfulness": "1/4", "author": "antonio rodriguez"}, {"rating": 5.0, "review": "All things should work with the ease of the fire stick, nothing could have been simpler. Just perfect, select with ease the almost infinite choices of prime. Better than cable!!!!! Finally instructions that really worked. You will not be disappointed one bit.", "verified": true, "helpfulness": "0/1", "author": "screwed consumer"}, {"rating": 5.0, "review": "This stick is awesome! Can't recommend it enough! So good I bought another one!", "verified": true, "helpfulness": "0/1", "author": "David"}, {"rating": 5.0, "review": "I bought this for the little TV I just got for my kitchen so that I could binge watch Netflix while cooking and cleaning.  I already had a Google Chrome for another TV in the house and decided to give this a try, because you don't need to always have your mobile device on hand to use it.  I am liking using the remotes for this much better than my mobile devices for Chrome.  However, I have not yet tried it out with anything other than Netflix.", "verified": true, "helpfulness": "0/1", "author": "Jamie"}, {"rating": 5.0, "review": "Love it, so much to watch and do. My grandchildren love the games.  Need the controller now!", "verified": true, "helpfulness": "0/1", "author": "Karen Kup"}, {"rating": 4.0, "review": "Would be nice to turn on/off TV with firestick remote.", "verified": true, "helpfulness": "0/1", "author": "Paul M."}, {"rating": 5.0, "review": "As good as everybody says it is", "verified": true, "helpfulness": "0/1", "author": "Jordan Katz"}, {"rating": 5.0, "review": "As expected and fast delivery", "verified": true, "helpfulness": "0/1", "author": "L. Metzbower"}, {"rating": 5.0, "review": "If you're an Amazon Prime subscriber this is one of the best bangs for the buck out there.  Mine integrated very nicely with my flatscreen TV to the point where I don't even need the Fire Stick remote.  My TV remote controls all onscreen menus automatically.  It even comes configured to your Amazon Prime account out of the box.  What more can I say.  Buy one and you won't regret it!", "verified": true, "helpfulness": "0/1", "author": "Reza Garrow"}]