[{"rating": 5.0, "review": "This device totally lived up to my expectations! It was very easy to set up; plug it in the HDMI port of the HD tv and just follow the instructions on the screen. The device updated itself right away and started up with displaying it's home screen. Before we watched prime movies on Sony blue-ray dvd but because we have  DSL for internet we had a hard time watching movies in the evening. We could hardly watch Netflix. This device is perfect, we almost never lose signal and watching Amazon prime and Netflix is a smooth experience. I personally like that we can listen to my amazon music and look at the photos and records from the cloud on the big screen. The home screen is very easy to navigate. The only stumble was to insert the battery in the remote. It took me a few moments to figure out how to open the battery chamber. It is small but a very powerful streaming device which I would highly recommend.", "verified": true, "helpfulness": "1/1", "author": "Anna"}, {"rating": 4.0, "review": "Very easy to set up and works very well so far with very little lag time. The selection in my Prime membership is good and has different options than my NET**** subscription.", "verified": true, "helpfulness": "1/1", "author": "JC"}, {"rating": 5.0, "review": "fantastic.  I got one and gave one as a gift.  It travels well.", "verified": true, "helpfulness": "1/1", "author": "online shopping addict"}, {"rating": 5.0, "review": "well worth the price.", "verified": true, "helpfulness": "1/1", "author": "Al Lemker"}, {"rating": 5.0, "review": "I purchased my Fire TV Stick from Best Buy. At first I wasn't sure it would work as promised. However I went with the majority of the reviews and have to say it is absolutely a great device. I have seen in some of the reviews that people have streaming issues. One thing I can say is that I have seen only a couple of \"stutters\" in the 10 plus movies and tv shows I have watched from Amazon Prime. One great addition I love about it is the ability to side load apps. I have put Kodi on it and now can steam my movies from my NAS to my bedroom tv. In the past I have relied on various streaming programs and have felt all have an interface that is too complicated. The interface for Kodi it nice and easy. Having said that I love the interface of the Fire stick itself. It is very user friendly and setup was breeze. I have mine connected to my Wireless N hot spot which is about 80 feet away and I have no connection issues. I know I have has problems with ISP provided wireless routers, they have been less that reliable. I would recommend getting a good wireless N router. If you have playback issues I would look to see if the problem is with the service you are using or the WiFi connection itself. I can steam local media over my network with no stutters of any kind and it wall works great. So I know the stutters have to do with the data coming from my ISP which I have no control over. All in all I would highly recommend this device to anyone who is looking to stream online content plus the ability to stream local media. If you are going to hook this unit up to your main TV I would probably go with the Fire TV box as it has the ability for a hard connection, but for a secondary TV like in a bedroom the Fire Stick is perfect.", "verified": true, "helpfulness": "0/0", "author": "Keith G. Longley \"verdejt\""}, {"rating": 5.0, "review": "I love it. Everything I expected it to be! Recommend to everyone.", "verified": true, "helpfulness": "1/1", "author": "Melinda Ward"}, {"rating": 5.0, "review": "I'm so happy I decided to purchase this. It's super intuitive, easy to use, and fast. Plus, it's portable!", "verified": true, "helpfulness": "1/1", "author": "A. Santa \"aps11090\""}, {"rating": 4.0, "review": "I am enjoying the Fire Stick.  I am able to view old TV shows and old movies.  However like on Netflix, the good movies are really old (ie. Good Will Hunting) and there are few of them, while the bad movies that I wouldn't ever choose to watch are plentiful.  The recent movies are less than you would pay in the cinema but still pricey enough that I will wait to watch those.  I will be interested to see if they become available later on.  Sometimes while watching, the video will stop and a message comes up saying there isn't enough bandwidth.  We sit while the video is fluffing and then it will begin to play after several minutes.  This can happen multiple times during the show.  This can be frustrating but CD's from Netflix have scratches that make it skip scenes and having to rewind is more of a bother than sitting patiently letting the video gather more bandwidth.  Overall, I feel this was a good purchase.", "verified": true, "helpfulness": "1/1", "author": "Holley B."}, {"rating": 5.0, "review": "I already owned the Fire TV box with voice remote so I knew I would like the interface of the Fire TV Stick.  It plugged right into an HDMI input and a powersource.  THe next step was to connect with my network and log into Amazon & Netflix.  In 5 minutes, I was watching TV.  Such a simple concept and it is tucked away neatly behind the TV.  Remote is very intuitive and I have had no issues with the signal.  Great purchase for the price.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"gmj\""}, {"rating": 4.0, "review": "After installing, kept getting error message on Netflix (HD-CP unauthorized).  Amazon tech support said it was a Netflix problem and to call them. After calling Netflix tech support, found out that my HD TV is on the edge of being to old to stream video.  There was a firmware update for my TV. And it may or may not help with my problem.  Took ten minutes to update and I can stream videos just fine. There was no mention of this in any advertising of the Amazon stick,", "verified": true, "helpfulness": "1/1", "author": "Thomas Mares"}]