[{"rating": 4.0, "review": "Was able to set up a wifi hot spot with my phone as well as stream from home wifi. Very easy to set it up, put in wifi password and change source to the HDMI and take it with me on a trip somewhere away from home. Wherever there is cell service, I can watch shows or movies just have to watch the data usage when using hot spot from phone.Downloaded a short free clip. So far, so good. Opens up my video and tv entertainment options. Netflix worked. I used to have to physically hook up my laptop to my TV, as I don't have a Smart TV yet. This works as I wanted it to, plus I like the ability to download and store movies or shows and take them on the road, if there is an HDMI TV available.", "verified": true, "helpfulness": "1/1", "author": "Sandy C \"Sandyc954\""}, {"rating": 4.0, "review": "Works great. I would give it a 5 if it continues to impress a few weeks from now.", "verified": true, "helpfulness": "0/0", "author": "Will is Roger"}, {"rating": 4.0, "review": "I love how the amazon fire stick works", "verified": true, "helpfulness": "0/0", "author": "Gary C Schaff"}, {"rating": 3.0, "review": "I got mine at the introductory $20 price. I probably wouldn't buy this at it's full $40 price though.Netflix forgets me login information everytime I unplug the power from the device. And it's very painful logging back into Netflix with the remote (there is remote app for Android that helps, but it's kinda clunky too). I don't know if this is Netflix's fault or Amazon's, but it's frustrating since Netflix is the main app I use on this.The UI itself I find awkward to navigate around. I much prefer Roku's much simpler and faster UI.HBO Go is available on the Fire TV now. But it's still not available on the Fire Stick.", "verified": true, "helpfulness": "0/1", "author": "Ravynmagi"}, {"rating": 5.0, "review": "Terrific enjoy it alot", "verified": true, "helpfulness": "0/0", "author": "karen jomoc"}, {"rating": 5.0, "review": "Very cool!", "verified": true, "helpfulness": "0/0", "author": "Maples"}, {"rating": 5.0, "review": "The fling / mirror feature that works with the HDX tablets is awesome.", "verified": true, "helpfulness": "0/0", "author": "CHARLES TANNER"}, {"rating": 5.0, "review": "I like the way it makes my regular flat screen TV into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Margaret K. Myott \"M.Myott\""}, {"rating": 2.0, "review": "So they advertise that this is faster and better than the Chromecast but it was SOOOO much slower.  My WiFi network is stupid fast, had to upgrade it all a while back when I purchased the nVidia Shield; stellar router, T1 fiber Internet, even tried with no other devices online, tried 2.4 and 5GHz bands and only about 20ft from the router and still buffering ever 20 seconds.  This thing has many issues.  For starters, my TV wouldn't recognize it, that took about 10 minutes and then another 10 minutes trying to connect the remote.  The USB power cable CANNOT be plugged into the TV, you must used the AC adapter.  Be warned, the cable is only a few feet so if you have your TV wall mounted and don't have a wall outlet near the ceiling you will need a USB extender.If you enjoy using Allcast, give it up, doesn't work well at all with this.  When Allcast is searching for devices it finds my Roku, all three Chromecasts and.......3 minutes later it finds this firestick.  Figured I would buy this with the hopes of faster media streaming from my tablet or phone of my own media since it is dual band but I was wrong.  Streaming over my Chromecast is much faster and smoother.  Less buffering than this stick.  Save yourself the headache.Do you enjoy how playing Netflix and when a show ends the next one plays automatically after?  Give that up cause it sort of does that.  Once the fire stick is done with one episode, it buffers the next to 99% and stays there; only playing audio.  It forces you to manually grab the remote, back out of Netflix and play the next episode if you want audio and video.The device does come with some pre-installed apps, mostly just some sports worthlessness, Pandora and Netflix.  (Yaaaawn)  Very easy to navigate and find your way around.  You are able to find your Prime music and movies with great ease but transfer and buffering times are so slow I had enough time to purchase other products on amazon before they began to play.Overall I want to punch myself in the face on even buying this.  Had such high hopes, amazon usually is a step above the rest.  Switched back to my crummy little Chromecast and Roku 2.  Guess I will just endure laggy and glitchy performance till the Chromecast 2 comes out.  Please don't waste your money, I beg you.  I fell for marketing hype and fluffed up advertisement and now I have to print a return shipping label.  My vision of amazon made products has greatly decreased.  Oh well, live and learn I guess.", "verified": true, "helpfulness": "0/0", "author": "BloodAgent"}, {"rating": 5.0, "review": "I gave it to my grandson for christmas and he loves it.He used it to watch movies with his grandpa and now im buying him one too.It is great and very simple to use.", "verified": true, "helpfulness": "1/1", "author": "cathy parenzin"}]