[{"rating": 5.0, "review": "I love our fire stick!  Bye bye cable!", "verified": true, "helpfulness": "0/0", "author": "s.wright \"mom2angel\""}, {"rating": 4.0, "review": "The device(Fire TV Stick) tries hard to do it's job, and succeeds most of the time. It is a good streaming media player. My issue is with technical support, they do not seem to know much about the product. It's like it's not an Amazon product at all. The answers others, and I have received about trivial questions are very stupid, yes that is the best answer. For example, in one case Tech Support told the customer to contact an entirely different company for an issue having only to do with the Amazon Fire TV product. I was personally given an answer which was instantly proven wrong.", "verified": true, "helpfulness": "0/0", "author": "Jacob Martin"}, {"rating": 1.0, "review": "Not what I expected. Advertised it came with a free prime trial and it did not. Movie prices are expensive. Does not have any function unless you have a prime membership.", "verified": true, "helpfulness": "1/1", "author": "Elizabeth Michelli \"Nurse Mom Wife\""}, {"rating": 5.0, "review": "As advertised. Simple plug and play. Just follow the on screen instructions.", "verified": true, "helpfulness": "0/0", "author": "Numchuk"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Shawn Whipple"}, {"rating": 5.0, "review": "Instead of spending hundreds of dollars on a smart TV, just get this amazingly priced little stick and it will turn your TV into a smart TV. Worth the money and more. Amazon is an amazing company.", "verified": true, "helpfulness": "0/0", "author": "A.Whitaker"}, {"rating": 5.0, "review": "This streaming device is amazing! I love Amazon Instant Video and this makes it super easy to watch my shows. The only issue that I have come across so far is purchased YouTube videos. It will play regular YouTube videos no problem but if you purchase a video (i.e. The Interview), it will not play.Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "No streaming? If you not have a game console to get Amazon Prime then it is worth it and that the only time.", "verified": true, "helpfulness": "1/1", "author": "Mark E Darby"}, {"rating": 4.0, "review": "Fun and easy to use. The whole family enjoys the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 5.0, "review": "this is a great product, combined with Prime it is a must have", "verified": true, "helpfulness": "0/0", "author": "imchas"}]