[{"rating": 4.0, "review": "The UI is just not up to par compared to Roku for using app other than Amazon content. Performance of the device is very good compared to the Roku Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "J.Rohne"}, {"rating": 5.0, "review": "Great deal .. Best stick around better than Chrome (Have one of these also) because you don't need \"to cast\" too it .. So fully independent of a computer smartphone or tablet \"Pluto TV\" is the best so many great channels, also has nice remote control easy to use.", "verified": true, "helpfulness": "0/0", "author": "Videomike77"}, {"rating": 5.0, "review": "this is an excellent unit. I am waiting for another one with prime discount for another TV at home.", "verified": true, "helpfulness": "0/0", "author": "Y. Zhang"}, {"rating": 3.0, "review": "When it is working it works very well.  The issue i have is every time I try to use it I need to unplug it and plug it back in (reboot) to get it to work. Additionally the \"curser\" will sometimes navigate very quickly through the menu without even touching the remote.  I only paid $19 for it so it doesn't seem work it to exchange it", "verified": true, "helpfulness": "30/35", "author": "Kurt Melinda Bennett"}, {"rating": 5.0, "review": "Great much better than chromcast. Love the user interface. You can mirror your Android phone I did it with both LG G3 and Note 4. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "shak"}, {"rating": 4.0, "review": "Functions as advertised. The remote makes it unique and useful. However, it has ways to go to compete with Chormecast. I have both on the same TV and I found myself using the chromecast twice the times I use the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "Love this! So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Homchick"}, {"rating": 4.0, "review": "Great Picture & Sound !Very functional  Blue Tooth Remote,Amazon was out but got it for $10.00 off at best buy .If you have Prime you really need to check this out !", "verified": true, "helpfulness": "0/0", "author": "S. Brinck"}, {"rating": 4.0, "review": "It gives what it says it gives. It has your apps; netflix, hulu, amazon prime video, being the popular ones for watching movies. It has some music apps too along with it's own amazon music app. Difficult to watch football if you don't have cable though. You need a service provider to sign up for the espn app, and college football is on the local channels. So if you want this looking for a good way to watch sports, mainly football cause it's America and everyone should watch football, then don't get this thing. Otherwise, for what it is, the OS is pretty easy, plays movies and loads quickly, and it hasn't given me trouble at all. The way to get apps is annoying though. No App Store app or a good way to browse apps.", "verified": true, "helpfulness": "0/0", "author": "Julio Angel Ruiz"}, {"rating": 5.0, "review": "I already had a smart tv with most of these features but it was so slow in comparison to the firestick", "verified": true, "helpfulness": "0/0", "author": "Anthony c"}]