[{"rating": 1.0, "review": "Awful, unwatchable, how do I send it back?", "verified": true, "helpfulness": "0/0", "author": "William Colvin"}, {"rating": 5.0, "review": "I love the fire stick", "verified": true, "helpfulness": "0/0", "author": "Bobby Meade \"Bob Meade\""}, {"rating": 5.0, "review": "Was scared about the one star reviews that were claiming technical difficulties but am thoroughly impressed! I have a 6 Mbps internet service and this fire stick works flawlessly. I stream live tv with sling TV and it works great. I have had this product for only 3 days and hope it keeps working for a long time. The response time is amazing. Love this product, probably the most amazing electronic device I have ever witnessed.", "verified": true, "helpfulness": "0/0", "author": "Link48"}, {"rating": 1.0, "review": "Super slow and doesn't screencast well. Buy a Chromestick. we also have a Roku which seems to be more effective for streaming Amazon prime and Netflix. I bought this a few months ago and never use it.", "verified": true, "helpfulness": "0/0", "author": "Marisa"}, {"rating": 4.0, "review": "Does It work outside of the USA?  For example in South America,  Paraguay", "verified": false, "helpfulness": "0/1", "author": "Bae Kyu"}, {"rating": 5.0, "review": "Goodbye Netflix and hopefully soon Comcast when damn contract is over.  VERY PLEASED", "verified": true, "helpfulness": "0/0", "author": "Julie Bishop"}, {"rating": 5.0, "review": "Bought one of these and it didn't work. Upgraded my router and decided to give it another try. I am in love with it. Works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 1.0, "review": "Does not work outside USA ,and this is not mention in the product description", "verified": true, "helpfulness": "0/0", "author": "Freddy metta"}, {"rating": 5.0, "review": "Wonderful item! Very Happy!", "verified": true, "helpfulness": "0/0", "author": "nancyann"}, {"rating": 5.0, "review": "Works well.  I only use it for Netflix, but that's enough.", "verified": true, "helpfulness": "0/0", "author": "Gregory J. Cappello"}]