[{"rating": 5.0, "review": "I got in the mail in within 2 days which was perfect!!  I was so excited to receive it and start using it , it's now in my daughters room since she doesn't really need cable TV I decided to purchase this for her but now I'm so much loving it that I might be using it all the time! Lol. I like the display and it's so smooth to browse through the options I'm so happy I bought it!!! Now I have to learn more and more about it so I can use it to its full potential. Want to know what are nice apps to have in it and I might be setting it up for parental controls as well. ;) I totally recommend it !", "verified": true, "helpfulness": "0/0", "author": "Joha83"}, {"rating": 5.0, "review": "Love it so far - easy to set-up - a must have if you have pics & music stored in Amazon Prime Cloud", "verified": true, "helpfulness": "0/0", "author": "Thomas C. Bolan"}, {"rating": 5.0, "review": "The Fire TV Stick is an awesome device. My whole family enjoys every aspect of the device!", "verified": true, "helpfulness": "0/0", "author": "BoxCar Willie"}, {"rating": 2.0, "review": "I sometimes encounter \"stuttering\" when watching a movie ... sticks on a frame for a few seconds and then resumes.  Also, I am very disappointed it doesn't have a \"search by category\" function.  Movies shown are very limited and to chose from more I have to go on-line to pick them which is a pain.", "verified": true, "helpfulness": "0/0", "author": "Pat A."}, {"rating": 4.0, "review": "So far so good, we haven't had enough time to try all the apps yet but it is very easy to use and that's one of the main reasons for getting the fire stick .", "verified": true, "helpfulness": "0/0", "author": "Grandma"}, {"rating": 5.0, "review": "It's incredible", "verified": true, "helpfulness": "0/0", "author": "Juanjr824"}, {"rating": 1.0, "review": "After 2 month that I bought a Fire TV stick by samsung tv it didn't have a signal to connect. I had several plasma tv to connect it but it didn't work.", "verified": true, "helpfulness": "0/0", "author": "DcrfxQqfRRMA"}, {"rating": 5.0, "review": "Love it!! Getting rid of cable was the best decision ever", "verified": true, "helpfulness": "0/0", "author": "emma flores"}, {"rating": 4.0, "review": "Works well, only after moving tv.", "verified": true, "helpfulness": "0/0", "author": "Frank Moore"}, {"rating": 2.0, "review": "At first the Fire Stick worked wonderfully however after some time the glitter has worn off. The device lags between screens and often all apps need to be force closed for everything to work \"seamlessly\". Using Netflix is the biggest issue, the screen constantly freezes and the audio continues until the video plays catch up at a sped up pace. If I could go back in time I would bite the bullet and buy a Roku or AppleTV. Maybe the FireTV works better but as far as the the Fire Stick goes I'd look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}]