[{"rating": 4.0, "review": "The best tool for entertainment of 2015", "verified": true, "helpfulness": "0/0", "author": "Diane oliveira"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Scott Foster"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Carlos Garcia"}, {"rating": 5.0, "review": "I have both this and a chromecast and I prefer this by far. The dashboard is simple to use where as I find the in-app interface with the chromecast to be buggy sometimes and not want to work or cast etc.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Donald Dorsey"}, {"rating": 5.0, "review": "I love it, unlike my Roku box I can stick it in my purse and take it from place to place.", "verified": true, "helpfulness": "0/0", "author": "ChristineAlexander"}, {"rating": 4.0, "review": "Fantastic picture quality and speed when watching Netflix and especially Prime content.  Setup is easy and very straight-forward to follow and I was up and running in less than 10 minutes from unboxing the device.  USB power from some TV's is flaky, so use the supplied USB power supply and cable.  Wireless range is a bit limited with this device, so make sure you are within 10-15 meters of the wireless router.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Terrific!  I am addicted already.", "verified": true, "helpfulness": "0/1", "author": "Gordon Bulla"}, {"rating": 3.0, "review": "For the price the Fire Stick is pretty good but it is not on par with its competitors at all. It lags response, loads very slowly, and is not intuitive enough for the everyone in the household to understand as they do the Apple TV. It requires a power cord to it to function on the device itself which oddly is harder to disguise than the hdmi for the Apple Tv since the Fire stick cord is too short for most tvs that are mounted higher than a coffee table.  The App control is good but also not as smooth as the competition. It is works fine for the price which is literally a fourth of its competitors price but does leave something to be desired. Love that I can finally watch prime content but I still choose Apple Tv over this. Last, the name is a bit embarrassing to tell people what \"I got\" in shortened form. I know the \"Fire\" Brand is Amazon, but I would have stewed over the name a bit more.", "verified": true, "helpfulness": "0/0", "author": "Barrett DeLong"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "adrien wade"}]