[{"rating": 5.0, "review": "For Price, The best choice I made, also it`s the best streaming media I have owned because the android settings.", "verified": true, "helpfulness": "0/1", "author": "Juan Alvarado \"closed eyes\""}, {"rating": 5.0, "review": "Great streaming device recommend it to everyone.", "verified": true, "helpfulness": "0/1", "author": "Josh Little"}, {"rating": 4.0, "review": "Not bad", "verified": true, "helpfulness": "0/1", "author": "Ken"}, {"rating": 5.0, "review": "Love to watch Netflix this is perfect can move from one TV to another no problems.....", "verified": true, "helpfulness": "0/1", "author": "diane volk"}, {"rating": 5.0, "review": "More than worth the money", "verified": true, "helpfulness": "0/1", "author": "Sandy Hallett"}, {"rating": 1.0, "review": "Do not order this!!!!! My husband spent over an hour with tech support trying to make this piece of junk work. We were told that the router had to be within 2.5 feet of the device.  I purchased two of these along with Amazon Prime. When I said I was fed up and I wanted a full refund on both fire sticks and Amazon Prime, which I've had for maybe three weeks, the supervisor said that he would prorate the refund. I said absolutely not and he finally agreed to provide a full refund. A terrible product, misleading and incomplete product info and despicable customer service. I'm through with Amazon. Buyer beware!!!", "verified": true, "helpfulness": "0/2", "author": "Pam McGraner"}, {"rating": 5.0, "review": "Amazing works great", "verified": true, "helpfulness": "0/1", "author": "DJ"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "Boris"}, {"rating": 5.0, "review": "Easy set up. Better than expected, everything as promised.", "verified": true, "helpfulness": "0/1", "author": "sr800"}, {"rating": 1.0, "review": "It works, but it should have been free.  Despite all of the publicity about the huge number of films available to prime members, most films are not free.  The Amazon fire stick is really  a convenient catalog of all the Amazon films you can rent or buy from Amazon.", "verified": true, "helpfulness": "1/3", "author": "Durham"}]