[{"rating": 3.0, "review": "Update**When I brought this product I hardly had an issues at first. Now it barely connects to my wifi. When I google this issue it says that I may be too far away from the modem, but all my other electronics work just fine. When it does connect it works great.I got this for my mom who is not so hip with the latest technology and she loves it. Although I don't like the set up as far as prime movies and the movies that cost. It makes me feel like my mom or nephew could accidentally buy something and not even know it. The remote is great but the battery port was a little confusing I had to google how to get it open! Other than that there were no problems connecting or streaming the movies. I haven't tried out the games yet, but I am sure they won't disappoint.", "verified": true, "helpfulness": "0/0", "author": "J. Simmons"}, {"rating": 4.0, "review": "Not easy to install and keeps dropping wi-fi", "verified": true, "helpfulness": "0/0", "author": "Ari"}, {"rating": 5.0, "review": "This was easy to set up. It gives access to many sites and movies I watch.", "verified": true, "helpfulness": "0/0", "author": "John D Ware"}, {"rating": 5.0, "review": "The Fire Stick is amazing. My only concern is how much data I am using. Prime even gives access to current TV shows. If I could get sports, I would tell Direct TV to pound sand.", "verified": true, "helpfulness": "0/0", "author": "DP"}, {"rating": 5.0, "review": "I have not used it much, but do really like it.  I had one and gave it to my folks and I liked it enough to buy a second one.  very smooth and streams beautifully.", "verified": true, "helpfulness": "0/0", "author": "ar1271 \"Boilers\""}, {"rating": 5.0, "review": "I am very pleased with my Fire Stick. My nephew bought one first. He emailed me that he was surprised with the speed.HE said that the Stick was very good. We have found that he was right. The Stick is in the bedroom the great grands use. They are very happy & enjoying all the benefits of my being a Amazon Prime Member gives them.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "So far we are very disappointed. The image is blurry, the sound has poor fidelity and the movies stop a great deal through out the program. The BestBuy technician says it is the router. We have bought anew more powrful router to see if there in improvement.We have Verizon FIOS service", "verified": true, "helpfulness": "0/0", "author": "FlowerLin"}, {"rating": 1.0, "review": "Bought this product with high hopes to connect to my non smart tv's in my upper level of my home (ranch style home, router in basement).  Come to find out if your more then 20ft away it doesn't really work. Even with the extention plugged in. It connects to the internet in the menu, then disconnects when you choose a show or movie.  A big disappointment for me.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Mojica"}, {"rating": 4.0, "review": "This item worked exactly as described and I am very happy with it. The remote could be a little better, but all in all a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Linda Poirier"}, {"rating": 5.0, "review": "Awesome streaming device ! ! !  Pairs well with Prime for instant video and music as well as Netflix and many other apps.  I especially LOVE the variety of setting preferences.  You can set up parental controls easily.  It streams well and has performed flawlessly.  Great and portable device.  Makes me love Prime Services even more", "verified": true, "helpfulness": "0/0", "author": "KayKay \"Karen\""}]