[{"rating": 1.0, "review": "I'd leave zero stars if I could. This has been the biggest waste of money. It can't stream anything for more than a few seconds without loosing service. I've tried the suggestion of making sure the device is vertical with no luck. DONT BUY!", "verified": true, "helpfulness": "0/2", "author": "Mehaynes"}, {"rating": 5.0, "review": "This is an amazing TV viewing tool. I downloaded the fire stick app for my iPhone, and the voice control works great. It is easy to use, and so far we are very impressed.  We replaced a Sony Play Station that was driving me crazy with its updates. The only criticism is that when you choose a show, there is a button for \"other ways to watch\" but it only includes Amazon options. I wish it would say \"this show is available to watch on Netflix\", for example. Other than that, it's great!", "verified": true, "helpfulness": "0/0", "author": "Scott Woodland"}, {"rating": 5.0, "review": "This thing is AWESOME, especially combined with all the free movies and tv series that come with Amazon Prime. I LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Matt Baker"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Annette diamond"}, {"rating": 4.0, "review": "I like the remote and it's pretty fast", "verified": true, "helpfulness": "0/0", "author": "Raul R Aviles"}, {"rating": 5.0, "review": "Love all the choices the fire sticks opens up", "verified": true, "helpfulness": "0/0", "author": "mia powell"}, {"rating": 5.0, "review": "Easy to program,almost does it by itself.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "A must have for prime members. Great product, great purchase.", "verified": true, "helpfulness": "0/0", "author": "Jesie1214"}, {"rating": 5.0, "review": "Great purchase.", "verified": true, "helpfulness": "1/1", "author": "Michael Salinas"}, {"rating": 5.0, "review": "My non-technical self got it to work well. Love the programming available.", "verified": true, "helpfulness": "1/1", "author": "A.H.Baker"}]