[{"rating": 4.0, "review": "The Amazon Fire TV Stick is fairly impressive for how small it is. I was really surprised on how quickly the device responds with navigation and loading streaming content. 1080P streams quickly and cleanly with no \"jerking,\" on the other hand Limited apps and no HBO Go is disappointing, however, I believe I read that is coming in Feb 2015.I had to take a star off for the annoying 5 minute \"How-To\" video/Amazon Prime advertisement when you first install the device because you CANNOT skip it. I know it's only 5 minutesish but still it's a pet-peave of mine. Just gave me bad reminders of the unskipable bluray/dvd menus and ads. Something I though I left far behind when moving to digital online media.", "verified": true, "helpfulness": "0/1", "author": "Adam \"jcpudd\""}, {"rating": 1.0, "review": "Do not buy this product!!  A complete waste of money.  It keeps giving me the message \"connected with problems\" and I'm not able to use it at all! I bought one for myself and gave one as a Christmas gift.  I'm embarrassed and need to apologize to my family member for giving them something useless.  I've been a Prime member for years and will consider canceling if Amazon does not get their act together.  One more time - DO NOT BUY this piece of junk.", "verified": true, "helpfulness": "0/2", "author": "Taylor"}, {"rating": 5.0, "review": "I received this Fire TV Stick last week and have been using it along with Netflix.  It is the easiest electronic device I have ever used.  There are also games you can get for free as well.  Considering I got this for $20 with Amazon Prime, awesome deal!", "verified": true, "helpfulness": "0/0", "author": "Jesse K."}, {"rating": 4.0, "review": "Jun 2015 update:After the latest firmware updates the issues with laggy and choppy video are almost all gone. I notice them perhaps once per 10-12 hours of playing content, so it seems to be getting better. Netflix still randomly signs out, and having to go to IMDB to put my own rating of some movies or a show is a little of a hassle, but it is definitely better than it was at release.Original review:Would have been 3 stars if not for the ugly power brick and the idiot guy in the setup video. No I don't want that bulshit, it's fine if you show me technical data. And 2 months to get it shipped while still being charged as two-day ( no credit to my prime) what another joke?..The remote is actually nice, better than roku's. Here is the main problem - playback is crappy - the video is often behind the audio and then catches up rapidly. And mind you, that is on standard definition Netflix. No it's not my connection, all other devices I have play the same piece without a problem. And shipping those already activated to an account ... Are you out of your mind!?'!?!? Packages DO get lost and stollen.", "verified": true, "helpfulness": "0/4", "author": "submarine"}, {"rating": 5.0, "review": "Great addition to to my entertainment, and Kindle fire.", "verified": true, "helpfulness": "0/0", "author": "Gene Griffin"}, {"rating": 5.0, "review": "Got this little gadget as a gift for my mom and she absolutely loves it. Easy to use and the quality of the gadget is good. Oh and you don't need another device/computer to stream to it. So if your TV isn't a \"smart\" TV this device will make it \"smart'", "verified": true, "helpfulness": "0/0", "author": "Ph0b1a"}, {"rating": 5.0, "review": "The Fire Stick is amazing. Just want I wanted; a easy way to stream Prime TV and Movies on my TV. Easy to install. Plug it in; enter the passcode for your WiFi and you are all set. Could not be easier.", "verified": true, "helpfulness": "0/0", "author": "Dianne J Powell"}, {"rating": 1.0, "review": "Really Amazon, no Dish network or Direct TV? One of the main reasons I bought the fire stick was for the Showtime Anytime app and lo and behold, I cannot use the app because Dish network and Direct TV are not listed as service providers. How is that possible in 2014?  Almost everybody has Dish or Direct TV, well except for Amazon. They had a message stating that if you didn't see your TV provider listed, then it does not currently support Showtime Anytime. That may be true for Dish Network but I'm certain that Showtime Anytime is available on Direct TV, be it a laptop, tablet, phone or video game system, apple to and even roku. Just not on the Amazon Fire Stick. Why Amazon? Why does the Showtime website list Direct TV as a service provider, but you don't?", "verified": true, "helpfulness": "1/2", "author": "Raymond L. Shepard"}, {"rating": 2.0, "review": "The fire stick worked great for the first few weeks and then slowly one fine day it froze up. I restarted the device and all was well for a little bit. The frequency of this problem started increasing with each occurrence. The only way to get the device to work is to unplug it completely. I do not know if the whole line has issues or if I was unlucky enough to get the malfunctioning one. I am just glad I didn't pay full price for it and got it on sale!!", "verified": true, "helpfulness": "1/2", "author": "shriya"}, {"rating": 2.0, "review": "Our Stick worked with videos from Netflix and Amazon Prime the first day. The next day we could not get any video. I called tech support and we ran several tests to correct the problem. All to no avail. Then the tech asked how old our tv set was. We bought it in 2008. He told me all TV's had to be from 2011 forward. This caveat should be plainly shown in the material. No explanation could be given as to why we had good service the first day.", "verified": true, "helpfulness": "1/1", "author": "duffer77"}]