[{"rating": 4.0, "review": "Works very well, easy to set up.", "verified": true, "helpfulness": "1/1", "author": "JC"}, {"rating": 5.0, "review": "Great product that I feel is far superior to Chromecast. Was lucky to purchase the first day for $19 but evenat current price would recommend to anyone. Very easy setup and use.", "verified": true, "helpfulness": "1/1", "author": "BobJam"}, {"rating": 5.0, "review": "Love the firestick.No problems with it.", "verified": true, "helpfulness": "1/1", "author": "Mary Radimer"}, {"rating": 3.0, "review": "The stick itself is fine, I don't like that I have to pay for Amazon Prime to get movies free ($99/year) or pay Netflix or Hulu per year. That adds up to lots of $$$ just to watch movies. I will probably just use On Demand on my TV for movies", "verified": true, "helpfulness": "2/3", "author": "Wanda Cushing"}, {"rating": 5.0, "review": "I had know problem with set the set up was very easy I am enjoying the movies  Thank you very much", "verified": true, "helpfulness": "1/1", "author": "Darlene Thompson"}, {"rating": 4.0, "review": "Works well as advertisedOnly draw back is need for 3 remotes instead of one", "verified": true, "helpfulness": "1/2", "author": "Jo Ellen Marks"}, {"rating": 5.0, "review": "Easy to set up, easy to use and a great way to get your money's worth from Prime.  The need for a wall outlet that so many people mentioned should not be a deal breaker.  I am hoping that the movie and TV offers improve with time but for now the selections work for me.", "verified": true, "helpfulness": "0/0", "author": "Gracie C"}, {"rating": 3.0, "review": "It's pretty good but still missing many desired shows and movies - unless you pay for them individually! So the yearly membership fee to be a Prime member still doesn't include disney cartoon shows and/or movies (mickey's club house, frozen, and others...) There's a fee attached per show/movie.That also includes a lot of 'fairly' newer shows/movies...", "verified": true, "helpfulness": "2/2", "author": "RTS"}, {"rating": 4.0, "review": "As a cable cutter it fits my needs. Does it feel like the software needs further tweaking? Yup.I have a rock solid 25 mg fiber optic connection and will often completely lose connection severaltimes in a 30 minute program. This does not happen with my Apple tv on the same fiber optic andwi-fi connection, watching either Netflix or Hulu.", "verified": true, "helpfulness": "1/1", "author": "John Doe"}, {"rating": 4.0, "review": "Paid 20.00 resold for 49.00", "verified": true, "helpfulness": "1/2", "author": "tatalah"}]