[{"rating": 3.0, "review": "It is a lot slower than I thought it would be.  It freezes a lot.  It's a cool idea, but it could definitely use some improvements.", "verified": true, "helpfulness": "0/0", "author": "Karly Lowe"}, {"rating": 4.0, "review": "The Fire Stick is easy to set up and put into operation. This was especially true in my case because of my internet provider connection. I tried another brand before going to the Amazon Fire Stick and it did not work with my internet provider. If you sign up for Amazon Prime there is more stuff there than you could use in a lifetime. A good buy.", "verified": true, "helpfulness": "0/0", "author": "Patricia Wojnar"}, {"rating": 3.0, "review": "Surprised at how many movies still cost money to rent, or buy, even with Prime.  Old old movies even, would have thought larger selection for free.  I don't subscribe to Netflix on the Firestick as that is just one more expense.  Glad this was a gift, wouldn't buy one.", "verified": true, "helpfulness": "0/1", "author": "Sandra V."}, {"rating": 5.0, "review": "Best thing I ever bought!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 4.0, "review": "Does what it says", "verified": true, "helpfulness": "0/0", "author": "Skurdlybird"}, {"rating": 4.0, "review": "Sometimes freezes", "verified": true, "helpfulness": "0/0", "author": "G. McKinley Weaver Jr."}, {"rating": 3.0, "review": "It doesn't seem to have quite the horsepower to decode some videos without stuttering.  The hardware decoding seems to handle some codecs fine, and others it just doesn't have the horsepower to do it in software.  So it's fine with Netflix and YouTube, but with PLEX and higher quality video, you either get stuttering, or you transcode it to something \"friendly\" for the stick to handle.  There's extra horsepower required on one end or the other.  Right now, my computer is picking up the slack.It's bad enough that I've already ordered a different device with a quad-core processor and double the RAM for about the same price.  I get the added benefit of a wired network connection, so internet traffic doesn't have to fight local video traffic anymore.This is fine for internet streaming, but lacks oomph for locally streamed media collections without transcoding.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Easy to install. Easy to link to my phone and iPad for controls. Was upset though that the usb has to use the wall outlet. Neither my cable box nor tv had enough power output for it to even turn on which in today's technology era I found odd.", "verified": true, "helpfulness": "0/0", "author": "john hartley jr"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "elna"}]