[{"rating": 4.0, "review": "I just received the Fire TV Stick a couple of days ago, accepting an Amazon special discounted price offer a month or so ago. (I presume just about everyone who uses Prime Instant Video got the same offer.)Overall the Fire TV Stick is attractive and usable. It was also attractively packaged, very easy to set up, and paired easily with its remote and the Android remote app on my phone. I have used it on a large 40\" 1080p TV and a small 20\" 720p one, and it didn't require any different setup when moving between them. (One of the TVs does have slightly more \"overscan\" and a setup menu provided an easy adjustment for that, but it wasn't strictly necessary.)The Fire TV Stick does have a few kinks -- the menus are occasionally a bit klunky to navigate, requiring several tries to figure out which direction is needed to activate a selection. The remote also sometimes registers extra clicks, which requires going back and forth a few times to make the selection you want. The basic remote that comes with it has just enough features to operate it, but keying in text and numbers requires lots of click-click-click clack onscreen key menu selections. I suppose that's OK. Simplicity has its price, after all. The remote app for Android or an \"available separately\" voice remote (which I don't have) offer more useful features.I was slightly disappointed in the USB adapter, which (as the instructions say) is required for reliable operation. (I haven't found that the stick works at all with just the HDMI connection to my TV.) It does look cool. My disappointment is that the (non-polarized) AC prongs fold out from the middle of the widest face of it, and the USB cable plugs into one of the narrow faces at 90 degrees to the AC plug, so the assembled adapter takes up more room among your AC outlets than some similar \"Apple-design-style\" adapters do. I don't mean to complain TOO much, because it is VERY small compared to an old \"wall wart\" adapter, but to plug this adapter into a crowded group of outlets might require rearranging the other plugs or a small extension cord. They could have avoided the issue by having the prongs and the USB plug on opposing SMALL faces rather than the wide one, making it more similar in shape and size to an AC plug.My Fire TV Stick does seem to have at least one annoying problem that I'm hoping will get fixed: Every minute or two, sometimes more frequently, the TV speakers emit a random buzz, about a quarter of a second long. Also when I'm navigating the menus from the \"Home\" screen the speakers sometimes emit other random hisses and buzzes. Some of the navigation noises may possibly be intentional. But the random buzz happens whether sitting still on the home screen or a menu, or watching a movie or TV show, or (most annoyingly) listening to music in a streaming app. I found a comment from another person http://www.amazon.com/review/R3AMLRCPVUQMRQ/ref=cm_srch_res_rtr_alt_2 who mentions a similar buzz, so I know I'm not the only one.(By the way, I just mentioned the sound to my wife, and she had not noticed the sound until I asked about it. The music that was playing at that moment included a harpsichord and she had assumed the sound was in the recording. The buzz does sound something like when an acoustic guitarist touches a vibrating string. To me it also sounds like \"bleedover\" from a digital signal to an audio circuit. I hope it can be corrected in software and it's not a hardware problem or manufacturing defect.)I have not yet found an \"official\" place to bring the problem to Amazon's attention or find out if they are aware of it. Other than the Amazon Help pages I haven't yet found a dedicated support page for this device.None of that has stopped me from using the Fire TV Stick, however. I have enjoyed playing around with it. I'm not a huge TV/movie watcher, but when I do, I like being able to bring something up \"on demand,\" and the Fire TV Stick is an easy and VERY portable way to do it.", "verified": true, "helpfulness": "0/0", "author": "T. W. Trussell"}, {"rating": 3.0, "review": "The product worked great with Amazon prime instant video, Netflix and video. What I liked was that it works with Anynet+ feature in Samsung TV. That allowed to get the TV audio channeled through the Panasonic amplifier.I also own an Apple TV and love its features like AirPlay. But, Apple TV does not support Anynet+ that sucks.Reason it is 3+ because of missing AirPlay like feature. I would like to get off Netflix service since Amazon Prime offers similar service. But, their video offering does a bad job at presenting my favorite content. So, I guess, we are stuck with Netflix for litle bit longer.", "verified": true, "helpfulness": "0/0", "author": "Amar Kumthekar \"Amar\""}, {"rating": 5.0, "review": "I love the fact that the apps are pre-installed on the device.  This makes it much easier to use, and get/remove apps.", "verified": true, "helpfulness": "0/0", "author": "Tony Gilmer"}, {"rating": 5.0, "review": "As someone who already owned a Fire TV the stick works as a great alternative to taking the box when traveling. My only regret is that the app doesn't add touch to the Fire TV platforms.", "verified": true, "helpfulness": "0/0", "author": "Joe Birdwell"}, {"rating": 5.0, "review": "I just received it and so far I like it", "verified": true, "helpfulness": "0/0", "author": "bdrema"}, {"rating": 5.0, "review": "This is the perfect, flexible streaming device. It is so simple to use that my three-year-old knows how to find his shows. I love Prime, and I like the options for other apps. Great price and product.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Shepp"}, {"rating": 3.0, "review": "Not good app for music like Google music or Spotify. .the full version not te mirror", "verified": true, "helpfulness": "0/0", "author": "fer"}, {"rating": 5.0, "review": "It works great and small so you don't have to worry about big boxes and components", "verified": true, "helpfulness": "0/0", "author": "juan munoz"}, {"rating": 2.0, "review": "I'm disappointed.  I was told it would connect to my smart phone and laptop.  Only to figure I had to spend more", "verified": true, "helpfulness": "1/1", "author": "Richard"}, {"rating": 5.0, "review": "I ordered it when it first went on sale at the $19.99 price to use on one of my TVs that doesn't have built in apps so I could watch Amazon Prime Video and Netflix. I got it today, and had it set up in 2 minutes.  The picture is good, sound is good and took only a second or two for video playback to start.  I have not had any experience with Fire TV before, but I do have an Apple TV on another set.  I must say this on par with that, and much cheaper. I am very pleased with my purchase! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Samuel B."}]