[{"rating": 4.0, "review": "It's a cool device and I like it a lot. I'd give it a 5 star rating, but I'm one of those people that has to really be wowed to do that. I bought one for my daughter when they first came out and she loves it. I highly recommend this. My tv has everything I want...and then some.", "verified": true, "helpfulness": "0/0", "author": "Jeff Osterling"}, {"rating": 4.0, "review": "Don't use it much as I have other versions of this kind of channel provider... but when I do its great.. I like the speed of it for start up and changing channels... i would buy againI also brought it with my to a hotel and that was handy to have", "verified": true, "helpfulness": "0/0", "author": "Deckieg \"deckieg\""}, {"rating": 4.0, "review": "Fire Stick is sooo much better than trying to deal with ordering your shows through Google Chromecast. For a few more $'s you get a dedicated remote and the screen and start up is also much easier! Love it!", "verified": true, "helpfulness": "0/0", "author": "lilyocean"}, {"rating": 5.0, "review": "Better than my WDTV Live or my Samsung Smart DVD player.Sets up easily (except you have to listen to the Amazon Prime commercial).  Stays connected to my WiFi network.I use it mostly for Pandora so can't speak to the movie apps.Has a most recent list so you can get to your preferred apps quickly.  On the Samsung you have five preferred apps that you have to add to.  Old WD TV Live didn't have either.Also has some very nice screen savers when you pause an app for more than a couple minutes.And the price is competitive with all the others out there.", "verified": true, "helpfulness": "0/0", "author": "R. Cherye \"rcherye\""}, {"rating": 5.0, "review": "Love it. Netflix was a little buggy on it though.", "verified": true, "helpfulness": "0/0", "author": "Miguel Carzola"}, {"rating": 5.0, "review": "This item works well and is easy to set up and use. Very pleased with it after a few weeks of use.", "verified": true, "helpfulness": "0/0", "author": "Jim Z"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick.  Easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Crafter \"Crafter\""}, {"rating": 1.0, "review": "Compared to my roku this is really disappointing.  It does not seem to want to stream smoothly and has a huge issue with hulu.  Also a huge issue is not having access to vudu.", "verified": true, "helpfulness": "0/0", "author": "Jon W. Rickert"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Philip J Bandley"}, {"rating": 5.0, "review": "Have google play also and this works better. Very happy with product.", "verified": true, "helpfulness": "0/0", "author": "jenniffer thomas"}]