[{"rating": 5.0, "review": "This is great, simple, easy to install.  If you are used to regular TV, it's a little hard to get use to, but if this 65 year old woman can cut the cord, we all can. TV is fun again.", "verified": true, "helpfulness": "0/0", "author": "Margaret M."}, {"rating": 5.0, "review": "Freaking love this thing!!", "verified": true, "helpfulness": "0/0", "author": "Tygerr Recchia"}, {"rating": 3.0, "review": "Seems fine... Cant get it to completely work as advertised. Still working to understand and it and to get it functional.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Meiks-fraley"}, {"rating": 1.0, "review": "The programming available on Fire TV Stick is no different than Roku or Apple TV. Not worth the $39 I paid for it. I am not impressed.", "verified": true, "helpfulness": "0/0", "author": "J Turner"}, {"rating": 4.0, "review": "Still learning how to operate, I wish it has an easier shut down option.", "verified": true, "helpfulness": "0/0", "author": "Brittany C. Giddens"}, {"rating": 5.0, "review": "Awesome! Better than cable.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Trejo \"jugglejolt\""}, {"rating": 3.0, "review": "Something wrong with my fire stick I can't okay nextflex", "verified": true, "helpfulness": "0/0", "author": "Lamika"}, {"rating": 4.0, "review": "I got this when Amazon was offering their \"order early and save 5 bucks\" promotion.  It came in a nice box with HDMI dongle, HDMI extender, USB power cable/adapter, and remote.  At first, I opted to use my Chromecast over the firestick because the Chromecast offered more functionality in terms of direct screen mirroring of my android device to the TV, but they have since patched it and now I can mirror my phone to my TV no problem.  The good thing about this device is that it can bring a TV out of \"powered OFF\" mode.  Meaning, if your tv is OFF, and you press a button on the firestick remote, or you send a signal to start broadcasting to the firestick, the TV will turn on!  The Chromecast does not have this functionality as of yet.  I tried using the added features of games and all of the other stuff, but my interest in them has dwindled.  I only use this for netflix and phone screen mirroring.Complaints:  The only complaint I have about this vs the Chromecast is that every time I log onto the netflix with the Firestick, I have to select the netflix user that's watching.  So if I triggered the firestick to stream a video from netflix via my phone, I would have to open up the firestick remote app and select the netflix user before I can watch the video.  A work around would be just to keep sending the signal to play from the netflix app and eventually it will play the video, but Chromecast doesn't give me this problem.All in all, it does what I need it to do.  The remote is nice in that I don't have to use my phone to control the device, but because of the annoyance of asking which user is using the netflix app bumped it down 1 star.", "verified": true, "helpfulness": "0/0", "author": "Best Price/Quality Shopper"}, {"rating": 4.0, "review": "Can this be used with a tv thats not smart? I would use a RCA to hdmi converter.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Fannie Ngekia\""}, {"rating": 5.0, "review": "I love this device and use it almost everyday. I cant say enough good things about this product. If I had to find something I didn't like about this product is I don't have two of them.", "verified": true, "helpfulness": "0/0", "author": "Susan Baker"}]