[{"rating": 5.0, "review": "Love my fire tv stick, it loads everything fast", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Hamilton"}, {"rating": 4.0, "review": "Overall, I'm satisfied with the Fire TV, however was a bit disappointed that I wasn't able to locate all the apps that I want to install on it. But the system works really great!!!!", "verified": true, "helpfulness": "0/0", "author": "Rohit"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "irheaum"}, {"rating": 5.0, "review": "I just cancelled my cable service!  This thing is awesome.", "verified": true, "helpfulness": "0/0", "author": "charlana simmons"}, {"rating": 5.0, "review": "Really easy to install, started using immediately!!! Awesome product with an awesome price...would definitely recommend!!", "verified": true, "helpfulness": "0/0", "author": "tgrad"}, {"rating": 2.0, "review": "I've been getting consistent loss of connection.  While my router is 15 feet away.  My ChromeCast is able to maintain a connection.", "verified": true, "helpfulness": "0/0", "author": "Marshall Beck"}, {"rating": 5.0, "review": "Works great even tho does not plug into Ethernet i never have any problems with lagging or buffering will probably but one for every tv in my house", "verified": true, "helpfulness": "0/0", "author": "Steven Gill"}, {"rating": 5.0, "review": "I replaced an Apple TV with this and it is excellent! Has twice as much to offer as the Apple TV. We love it.", "verified": true, "helpfulness": "0/0", "author": "EricK \"sailor-scuba diver\""}, {"rating": 5.0, "review": "Love it!  Connected without issue - smooth streaming", "verified": true, "helpfulness": "0/0", "author": "Jodi G"}, {"rating": 5.0, "review": "Absolutely love it. Great item. Has things available for all ages to watch and listen too. My grandkids watched tv all weekend and was so happy their favorites were available all the time. Can't say enough about it.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]