[{"rating": 5.0, "review": "This little device works really great and is easy to use. I just plugged it into the TV and it worked right away. Remote control works great.UPDATE about a year later. This product quit working, probably due to a lightning strike that also destroyed a cable box. Both were on a surge suppressor, but apparently that wasn't enough. So, I won't downgrade the rating since this was an \"act of God\", not a product defect. Just be aware of the danger posed by lightning.", "verified": true, "helpfulness": "0/0", "author": "Kelly Carter \"kellydcarter\""}, {"rating": 4.0, "review": "Pretty easy to use and no problems or issues. Easy set up, easy to move to other TVs if you want.  The streaming video looks good coming in on a 2 to 2.5  mbps connection.  Signal sensitivity is comparable to that of a tablet device but the location of the TB HDMI socket caused me some problems with signal blocking - the socket was on the opposite side of TV from the router and I was near the max range of the signal so there were a few times when the signal was marginal and caused slow operation. I used an extension cable to place the Stick at the other end of the TV and solved that.  None of my tablets or laptop seem to support mirroring to it, so I haven't been able to try that - some of the features seem designed to work with Kindle and may not be available with other hardware.  I was able to use set-up ad a new app to the Stick, the Stick remote control on my tablet, it worked okay.  I'm still pleased with the item and will probably learn to use more of the features over time.", "verified": true, "helpfulness": "0/0", "author": "JarCie \"Cotton\""}, {"rating": 5.0, "review": "Our household LOVES this thing! We use it more than our DirectTV service...time to cut the cord.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Caylor"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "mcroom"}, {"rating": 4.0, "review": "Fantastic purchase that turned my simple TV into a smart compatible unit with applications that I can now access.  Prime video amazing and have watched many movies already besides the ones I have in my library.  Only drawback was trying to open remote to install batteries which required a great deal of pressure to slide off back panel.  Fortunately a replacement was sent without question and all is wonderful.  Well worth the money!!!  Prime membership and fire stick outstanding value!!!!", "verified": true, "helpfulness": "0/0", "author": "tjr43"}, {"rating": 5.0, "review": "Cool.  Loads up quickly and seems to have a good antenna for wireless reception.  The android app with voice commands is a plus.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "This works like a charm. I also own a Chromecast but the integration with my Amazon Prime account, Kindle Fire, and easy to get working app for my Blackberry (OS 10.x) is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Deborah Levinson"}, {"rating": 5.0, "review": "I've tried the Roku 2 and Chromecast and own and Apple TV, and the Fire Stick beats them all hands down in ease of use. The fun little into tutorial is helpful, but the menu navigation and interface comes so naturally that the intro is just icing on the cake. I would definitely recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "Kyle Craig"}, {"rating": 4.0, "review": "technology is really amazing", "verified": true, "helpfulness": "0/0", "author": "Bob Radomski"}, {"rating": 5.0, "review": "This thing works great, super easy to get set up and going.  Our TV viewing has been greatly expanded and the picture quality is excellent in HD.", "verified": true, "helpfulness": "0/0", "author": "Robert F. Steele \"piano lover\""}]