[{"rating": 1.0, "review": "This was recommended to me by the associate of the store I bought it at - I went in with a problem with my Chromecast, just expecting to get a new Chromecast. This Fire Stick seemed to have some cool channel options and a cool remote interface. Well, the channels I thought would be cool had no actual feature worthy content and the regular apps I wanted to use, along with the non worthy channel's content, wouldn't even run! Infinite buffering - the Chromecast worked way better than this. Returned it, got a chromecast, voila it works.", "verified": true, "helpfulness": "0/0", "author": "Cameron laxton"}, {"rating": 1.0, "review": "It worked for a couple of days and then it stopped. It has connection issues, for real. Every device in my house works perfectly on wifi and this thing always says \"connected with problems\" no matter what I do. Its in range of the wifi. I even bought a $40 wifi extender to help with no luck. I think Amazon released this a little prematurely. It definitely needs an update.", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Has issues with WiFi sometimes. Other than that, great.", "verified": true, "helpfulness": "0/0", "author": "Z. Queal \"~Zach\""}, {"rating": 2.0, "review": "The product did not work until about a week later.  When you first plug it in it requires your Amazon login to do anything, you can't watch Netflix or have access to any of the apps until you pass this screen, but my login did not work.  So although I was using the right passwords it wasn't updated on amazons side.  I sent them an email, no response but it started working about a week later.", "verified": true, "helpfulness": "0/0", "author": "nathan"}, {"rating": 1.0, "review": "You every movie you have to pay that not good", "verified": true, "helpfulness": "0/1", "author": "francis ravalier"}, {"rating": 5.0, "review": "Received it in the mail and within minutes I was up and running, it truly is plug and play!  Instructions are very clear and was easy to set up..I absolutely love it!  Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "lorane moody"}, {"rating": 5.0, "review": "I REALLY LIKE THE FIRE TV STICK,I HAD THOUGHT ABOUT ORDERING FOR A LONG TIME. MY NEPHEW TOLD ME HE HAD IT & THAT IF I GOT I WOULD LIKE IT, AND HE WAS RIGHT I DO LIKE IT VERY MUCH.", "verified": true, "helpfulness": "0/0", "author": "Georgia N. Ward"}, {"rating": 5.0, "review": "my daughter loves it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Bryant J."}, {"rating": 5.0, "review": "Had to call amazon help because I am not all that familiar with my new tv. But all worked out easily and fire stick is attached  and running. Set up is easy. And so is the HDML once I knew where to find it on my remote. Like I said amazon was there for me very patient and very helpful. So glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Evelyn M. \"new at this\""}]