[{"rating": 5.0, "review": "Terrific !!", "verified": true, "helpfulness": "0/0", "author": "Henry C. Rojas"}, {"rating": 4.0, "review": "Love this.  Easy to setup and use.  I have 3 Fire TV Sticks now so I can enjoy streaming movies and TV shows in any room.", "verified": true, "helpfulness": "0/0", "author": "Ron R."}, {"rating": 5.0, "review": "I love the Fire Stick.  Easy to use and convenient for family viewing!", "verified": true, "helpfulness": "0/0", "author": "Victoria Jones \"Bama Girl\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Katarzyna F."}, {"rating": 4.0, "review": "So far I am really pleased with the Fire TV Stick. It's a snap to install. A longer cable would be nice. Even with the HDMI extender, the cable is a bit short to reach the nearest outlet. The remote is tiny and seems a bit flimsy, but brand new it operates perfectly well. The streaming service is easy to use and the selection is good. If you are already a Prime member you will get considerable additional value from the Fire TV Stick. All in all, a pretty good deal.", "verified": true, "helpfulness": "0/0", "author": "G. McCarthy"}, {"rating": 2.0, "review": "This is now my second Fire TV Stick, I am returning this one for a refund, and I won't be getting a third. The device has multiple issues, and since I've now seen them in two separate devices, I know it's a problem with the device and/or software, and not just a fluke.I'll start with what I believe they got right. First and foremost, IF it worked, it wouldn't be that bad actually. I've used multiple Rokus, Apple TV Netgear GO, Chromecast, and have 3 different \"smart\" TVs, and this would actually be my choice device, IF it worked. The interface is a little wonky, (I prefer Apple TV in this category) but the App selection is phenomenal and much more my taste than Apple's. The integration of games into the device is a great idea, even it you have to purchase a separate remote for a lot of them. Any apps/games you've already purchased via the Amazon Appstore are synced with the device so you don't have to purchase them again, which was a big plus as well. Adding 5 GB of storage for Video and Picture storage was also a big plus, though neither of my devices worked long enough to actually try out this function. The introduction was nice, I felt it would help people very new to this technology, even remote controls, understand how to use it.Now for what I didn't like. Like I said, the introduction was nice, however after the second device, as well as 3 factory resets, it was actually quite annoying and only added to my frustration of having to factory reset the device. The interface is very, VERY Amazon Prime based. I understand it's a Amazon product, but it makes it actually very difficult to get to other apps from the home screen. You're only allowed to store 10 \"recent apps\" and from there you have to search for the specific app. Sometimes that can be difficult if you don't remember the exact name. The other plug-ins get this area right, having the home button bring you to all your Apps. I love Amazon Prime, don't get me wrong, but I wanted an easier way to explore all my options. The remote itself is nice, but it feels cheaply made. The buttons stick, and will scroll continuously for 4-5 clicks on occasion, which isn't a big deal for selecting apps, annoying, but still functional. The problem there lies in the ability to play games with the included remote. It makes it near impossible to control games, which takes one of the best features of the device, and makes it meaningless.Now to the issues I had with the devices. The first device I received worked great for about 2 weeks, then it would close apps automatically, play apps automatically, select settings, etc. I am unaware if this is due to the remote being much more faulty than the one I'm currently using (it still auto-clicks, but not nearly as often) or if it was part of the software. I did a factory reset, and it worked for a few more days, but then started again, so I returned it.The second device's issues are definitely more software/hardware based. This one has the same issues as the first, with the added fun of deleting apps without me, usually in sleep mode. Running apps while in the home-screen. Freezing, but still playing, for 3-30 seconds then fast forwarding to catch up. I would think that was the application itself, but it happens on every app, games included. The Wi-Fi will work for about a day after a reset, then it will only see 2 out of the 12 or so of the networks surrounding my home, mine never included. That is after it takes about 5 minutes to scan for the networks. It will stop seeing the connection, even while streaming, so I'm unaware why that happens.I honestly think it will be a great device, if they work everything out with it, but I'm not going to see if the 3rd time will be the charm for me.", "verified": true, "helpfulness": "1/1", "author": "Brian Lawrence"}, {"rating": 5.0, "review": "Super easy to set up. Great way to watch my prime movies on a big screen!!", "verified": true, "helpfulness": "0/0", "author": "Lauracc \"Laura\""}, {"rating": 5.0, "review": "Super easy to install and very easy to use. We have the Apple TV, but needed this to access the Amazon Prime videos. Great price, portable and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Dgdiver"}, {"rating": 5.0, "review": "I don't have a smart telivision in the master bedroom only in the living room so the Fire Stick is just what I needed.It plugged right in too the HTMI socket and only took a few minutes to get my Netflix account working", "verified": true, "helpfulness": "0/0", "author": "Mark Clemans \"clem61\""}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Monique"}]