[{"rating": 1.0, "review": "limited choices", "verified": true, "helpfulness": "2/3", "author": "Z"}, {"rating": 5.0, "review": "Works much better than using the Wii", "verified": true, "helpfulness": "0/0", "author": "Russell orton"}, {"rating": 5.0, "review": "Excellent Device, best Netflix/Hulu/Amazon Prime player I have, and I have a lot of them.  It's capable of quite a lot if you side load apps.  Has Bluetooth so you can connect keyboard/mouse/controller/remote.  Seems to have enough  power.  Runs XBMC.  With the remote control included, you can't beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "Patrick Bush \"Loki\""}, {"rating": 5.0, "review": "We are very happy with our Fire TV stick..  The menus are very easy to navigate and find what we are looking for.  I love all of the options for the free Prime movies and shows. I do find that we rent movies more than I expected since we search for all kinds of different movies for the kids.  It is very convenient to download to our iPads and take it on the go!", "verified": true, "helpfulness": "0/0", "author": "happylady"}, {"rating": 5.0, "review": "After sideload some interesting softwares, you will never need other boxes on my TV.", "verified": true, "helpfulness": "0/0", "author": "dminer"}, {"rating": 5.0, "review": "Amazing product so easy to use", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Love this thing no regrets you won't either", "verified": true, "helpfulness": "0/0", "author": "Michael Mullins"}, {"rating": 5.0, "review": "Awesome.  Much better than the Roku it replaced", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Was using WDTV from Western Digital, which I thought was pretty good.  I got the Fire TV Stick to take advantage of Amazon Prime, but WHOA! so much easier to use than the WD!  It is an excellent streaming device, and the opening menu is so good.  For $39, you can't do any better.Only issue I have is with setup - ultimately, very easy to do, but it would be helpful to have the descriptive video come on before setup (if only there was a way).  The remote is extremely simple to use, once you figure out how to use it.  The video explains it, but by the time you get to the video, you've already figured it out (or you wouldn't be watching the video, now, would you?).", "verified": true, "helpfulness": "0/0", "author": "J.P.P. \"prfesser\""}, {"rating": 5.0, "review": "Tho is wonderfull for the price I loved", "verified": true, "helpfulness": "0/0", "author": "maria sierra"}]