[{"rating": 4.0, "review": "It needs to have more apps available.  Like HBO go and Cinemax go, starz etc... And the major cable company apps.  I travel for work and pay for cable at home.  I bought the stick to be able to enjoy the cable that I already pay for.", "verified": true, "helpfulness": "0/0", "author": "Brian Clegg"}, {"rating": 5.0, "review": "I LOVE it", "verified": true, "helpfulness": "0/0", "author": "Karen Mileham"}, {"rating": 5.0, "review": "Super product.  One of the most easiest installs I have ever experienced and I have experienced a lot.  I used it more than 8 hours the first day I received it.", "verified": true, "helpfulness": "0/0", "author": "Louis D Cain"}, {"rating": 5.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Welchez \"Josh\""}, {"rating": 5.0, "review": "It worked perfectly.  I have tried the Roku and Chromecast and I would definitely recommend the Fire TV Stick over the competition.", "verified": true, "helpfulness": "0/0", "author": "Lori Statler"}, {"rating": 5.0, "review": "Great product , doesn't everything it is suppose to!", "verified": true, "helpfulness": "0/0", "author": "Wabasso"}, {"rating": 5.0, "review": "Very good product easy to install and to use. Besides all paid services like Netflix there are thousands of things to watch using Youtube!", "verified": true, "helpfulness": "0/0", "author": "YA"}, {"rating": 5.0, "review": "Very good product and fast shipping, congratulations!", "verified": true, "helpfulness": "0/0", "author": "GregoryHouse"}, {"rating": 5.0, "review": "This is the best product a person can buy for streaming movie second to none love it would recommend it to anyone", "verified": true, "helpfulness": "0/0", "author": "terrell jackson"}, {"rating": 5.0, "review": "Quick and simple setup!  It uses your TV's HDMI port, not the USB.  I also have the Amazon Fire box for my other TV.  The Fire Stick remote does not have the voice command capability, but if you have a smartphone you can download the Fire TV app and use the app for the voice command.  I would recommend this to anyone who wants to pay less than $40 for the ability to access Amazon Video, Netflix, Hulu, etc., but if money isn't an object, go with the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "JULIE D GLEDHILL"}]