[{"rating": 5.0, "review": "OMG!!!! I love the fire stick!! It's just like the Fire TV, except it was cheaper.  But with the same shows, same quality of shows, same great product.  Love, love, love it!!! I am totally cancelling my cable service when the contract ends!  I have games, movies, weather, news, exercise, and tv shows, ALL COMMERCIAL FREE, and 1,000s of choices to choose from!! This is great!", "verified": true, "helpfulness": "0/0", "author": "K. Y. Phillips \"Mrs. P\""}, {"rating": 3.0, "review": "Cool concept, and very compact, but there are some limitations, such as the way the apps (Netflix, YouTube, etc.) are implemented. The remote with the easy caption access is good, but the rewind functionality is poorly done.", "verified": true, "helpfulness": "0/0", "author": "I. Lamont \"Mr. Blue\""}, {"rating": 5.0, "review": "Love my Fire TV Stick! Easy set up and loads of available Prime programming. We were Prime subscribers for the shipping benefits, but we're enjoying the other perks of which we were not even aware when we subscribed!", "verified": true, "helpfulness": "0/0", "author": "Brad Stevens"}, {"rating": 5.0, "review": "Pretty Kool,  adding pictures is awesomw.", "verified": true, "helpfulness": "0/0", "author": "bigeye"}, {"rating": 5.0, "review": "LOVE IT quick, packed with awesome stuff!", "verified": true, "helpfulness": "0/0", "author": "Simply Tuned \"Richard\""}, {"rating": 4.0, "review": "I love the stick and the ability to see more programming, but I wish the grouping would allow you to search by genre, or favorites like netflix..We had trouble at first and had to buy a booster for wifi and now we can use it.", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 5.0, "review": "Love, love, love how easy and amazing this is.  Just ordered two more for our other televisions!", "verified": true, "helpfulness": "0/0", "author": "Paula Aldrich"}, {"rating": 4.0, "review": "Nice access to Amazon entertainment features. Easy to navigate and clear marking of prime items. Other than Amazon developed content, most can be accessed thru other services such as Samsumg smart tv or most blue ray players.", "verified": false, "helpfulness": "0/0", "author": "jimeagle"}, {"rating": 5.0, "review": "Use it daily very happy", "verified": true, "helpfulness": "0/0", "author": "Stacia Barton"}, {"rating": 5.0, "review": "I love it. Easy to use and the remote is wonderful", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]