[{"rating": 1.0, "review": "I'm updating this review.  DO NOT BUY THIS DEVICE.  The Fire Stick is terrible, it's a waste of money.  It constantly locks up, sometimes the remote doesn't work for unknown reasons.  Content starts and stops repeatedly.  I own a Fire TV for my office, I'll probably end up replacing this Fire Stick with a Fire TV.  I'm disappointed I can't give this 0 stars.It works well for amazon content.  The remote appears to be \"sticky\" for some other apps making it difficult to type in text with the remote.  For example entering in my Netflix password is a nightmare of watching to see which letters somehow double or triple clicked and trying to appropriately back out the correct number of letters, which also repeat clicks.  This doesn't happen with my Amazon FireTV box, but only my Amazon FireTV stick.", "verified": true, "helpfulness": "0/0", "author": "Phil DeVeau"}, {"rating": 5.0, "review": "Beyond amazed I love this device!!!!! Wish this came out sooner!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Keys4"}, {"rating": 4.0, "review": "I got my Fire TV Stick working within minutes for both Netflix and Amazon Prime.  I also side-loaded XBMC/Kodi so that I can watch my live/recorded TV as well as access my video library.  I would love to see Amazon add a DVD player and native XBMC/Kodi support - this would be the perfect product to replace many of the components in my cabinet with one device.", "verified": true, "helpfulness": "0/0", "author": "E"}, {"rating": 4.0, "review": "I like the portability. I can even get it to work. Sort of. I wanted it for miracast when in the hotel. But the software was not able to connect to the internet on the hotel WiFi. I think the software will improve and fix this. When I was connected, it worked perfectly. I'm just waiting for this new product to gain more maturity.", "verified": true, "helpfulness": "0/0", "author": "pterpening"}, {"rating": 5.0, "review": "Super-easy to set up (plug in, choose your WiFi connection, type in your password, and a little cartoon shows up to tell you how to use your new device). If you've had any other similar device (like a Roku), this will be very easy to learn. I didn't have any trouble with the remote (yet) as a few others have reported.I bought this on sale, and my primary use is with Amazon Prime, so it seemed a no-brainer to buy a device built with that in mind. I like that there's no box to take up more space on my already-crowded entertainment stand. So far, it's streaming very well and is fast to respond when I click.", "verified": true, "helpfulness": "0/0", "author": "Space Salamander"}, {"rating": 5.0, "review": "Absolutely love it.  I've had a Roku for a few years now, but this is a great replacement for it.  Only bummer is no HBO Go app (yet), but they say it's supposed to be coming soon.  Can't be beat for the price.", "verified": true, "helpfulness": "0/0", "author": "Brian Rose"}, {"rating": 4.0, "review": "Love it, but it has buffering issues compared to Chromecast or my Xbox.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Was lucky enough to get it at $19 for Prime launch offer. What a deal, it works well even though it has a few bugs. Regardless I bought two of them and use one when I travel. Very simple format.Suggested improvements:IOS compatible airplayIOS appBetter App/Movie browsingBesides these little things you can't go wrong for the price!", "verified": true, "helpfulness": "0/0", "author": "Avi"}, {"rating": 5.0, "review": "Just received the Fire TV Stick today. So far, I LOVE it! So smooth and so fast and it has a remote. I am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Janeen Porter"}, {"rating": 1.0, "review": "It's rare I have anything to complain about when it comes to Amazon but this product was not ready for release. The remote is incredibly glitchy. It either does not register you be clicked or it registers more than one click and will fly the cursor across the screen. Sometimes it's impossible to make a single click. Say I want to move Right one-time. I click Right and it goes two spaces. Then I try Left and it goes two spaces back. This was incredibly hard to set up my WiFi network when one click would send the cursor to the end of the keypad and it would wrap back around and continue sometimes. The WiFi is hit or miss and during streaming of movies like on Netflix it would skip/freeze and blast an incredibly loud screeching noise. I found this device to be more of a pain than the potential value over a roku and am switching back to Roku stick/chromecast.", "verified": true, "helpfulness": "5/5", "author": "Sam Antonio"}]