[{"rating": 1.0, "review": "Constant trouble with getting Fire Stick to connect to Wifi. Drops connection even with great Wifi signal and while sitting right next to router. I would not recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Brandon Wright"}, {"rating": 5.0, "review": "I've had it for a week and still have not been able to figure out how to sign into my Netflix account.  It won't let me go past signing into Amazon.  UPDATE: ok, I got smart and googled it, and have all apps installed.  Must say, the brief instructions were not specific to all circumstances.  I still don't know why I have to get out original tv remote to go to source/input, but I can deal with that.  Like it alot.", "verified": true, "helpfulness": "0/0", "author": "Pat D."}, {"rating": 5.0, "review": "Love everything about it.", "verified": true, "helpfulness": "0/0", "author": "Daisy's Mum"}, {"rating": 5.0, "review": "I got the Fire TV Stick free when I signed up for Sling TV. It works great, easy installation, easy setup and online in a few minutes. I haven't explored all the options it offers yet but I will soon. The remote control is nice and easy to use as well. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Margaret Goodwin"}, {"rating": 5.0, "review": "My Smart tv is slower than Molasses in winter! This works smarter and faster than smart for dummies! One of my favorite upgrades! Recommend for anyone that has a need for speed.", "verified": true, "helpfulness": "0/0", "author": "Henery Bosch"}, {"rating": 2.0, "review": "I would like to have given 5 stars.  But sometimes it works and sometimes it doesn't.  It stops or pauses OFTEN while I'm watching something and tells me I have no internet connection when actually I do and it shows strong signal.  It will try to reconnect and get stuck on 25%!!!  Very frustrating.", "verified": true, "helpfulness": "1/1", "author": "J. Blanco"}, {"rating": 4.0, "review": "works well with netflix.  no problems", "verified": true, "helpfulness": "0/0", "author": "Pamela C Cusanelli"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "jeff patterson"}, {"rating": 3.0, "review": "Remote should be designed better.  Password numbers were not clear.  Search feature?  - I never found it.", "verified": true, "helpfulness": "1/1", "author": "Clae Maxwell \"schnoodlelover\""}, {"rating": 4.0, "review": "I like it, but it is hard to find movies.  You don't list them all like it does on the computer for prime.  I start with Christian then it shows gay stuff.  I do not want to see this stuff, but it follows the suitable movies.  Need to be able to see all movies, not just what you want to show.", "verified": true, "helpfulness": "0/0", "author": "landberg"}]