[{"rating": 4.0, "review": "The instructions for installing batteries is not clear and once we figured it out, it was very difficult in removing the back plate to the battery compartment,  It is too smooth and needs to be roughed for better griping.  Well, we finally got the batteries in and we have enjoyed the programs that we get from this Fire Stick.  However, you lost one star due to the battery installment.", "verified": true, "helpfulness": "0/0", "author": "Glen R. Bleak"}, {"rating": 1.0, "review": "Never stayed connected to the internet even though the router was 3 feet away.  I returned it to by Roku still which works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "David G."}, {"rating": 5.0, "review": "I LOVE it! We recently signed up with a satellite television provider that we're not at all happy with. The selection of movies leaves a lot to be desired unless we want to pay for almost every one of them. I bought the Fire TV Stick at my local Staples store, took it home, set it up in less than ten minutes and it works GREAT! TV shows, movies, videos; it's all there. What surprised me is how easy it is to move the device from one television to another. Just unplug, take it for a stroll, and plug it into any other TV, just as easily as plugging in any USB device. Once it's on your wireless system, it's there. VERY simple to set up, great selection of shows, works anywhere there's a wifi connection (including my RV), and a huge selection is available with no addition charge other than your Amazon Prime membership. One of the best features is the ability to search for exactly what you want to watch; if you want to see an available list of John Wayne movies, select \"John Wayne\". If you want a specific genre, just select it. You can also select just the free Amazon Prime listings, recent movies, kids shows, and so on. There's just nothing bad about this little device!  If you have an Amazon Prime membership, either buy the Fire TV Stick online at Amazon and it automatically is registered, or buy it at a box store and register it yourself. Easy either way, and the price is the same. I like simple, and I like things that work like they're supposed to. This is both.", "verified": true, "helpfulness": "0/0", "author": "Eva M. Thompson"}, {"rating": 5.0, "review": "I love this device.  I had an older Roku that wasn't picking up my wifi signal very well and would only work sometimes.  The Fire TV Stick has given me no problems at all.  It works great.", "verified": true, "helpfulness": "0/0", "author": "Malvern Lusky"}, {"rating": 5.0, "review": "A lot more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Leonel Arce"}, {"rating": 5.0, "review": "this is a great device for that spare flat panel TV or extra Monitor. Put it in the spare room and connect to wifi and away you go.", "verified": true, "helpfulness": "0/0", "author": "JeffB"}, {"rating": 5.0, "review": "I absolutely love this item! It was SO simple to install and gives me the ability  to watch anything, anytime I want...from original movies to sports to documentaries! ! Truly made my TV smarter!!!...Did I mention...I love it?!!", "verified": true, "helpfulness": "0/0", "author": "Deborah Hester"}, {"rating": 5.0, "review": "great product easy to set up and fun to use", "verified": true, "helpfulness": "0/0", "author": "Pat Lazzaro"}, {"rating": 5.0, "review": "It is amazing and we love the access it gives for viewing!", "verified": true, "helpfulness": "0/0", "author": "jaegerz"}, {"rating": 5.0, "review": "I had cancelled my cable and was complaining about what I couldn't see. I don't watch a lot of television, but did miss some of my shows. This was a gift and I really do like it.It was easy to install and came loaded with my preferences from Amazon Prime. I have the ability to add even more. Has apps that you can add also for additional viewing options. I am having some trouble adding additional apps, but haven't taken a lot of time to figure it out.", "verified": true, "helpfulness": "0/0", "author": "Deborah A. Martin"}]