[{"rating": 1.0, "review": "Very slow. Constantly got drop off the connection. Save yourself some money", "verified": true, "helpfulness": "2/5", "author": "Harold"}, {"rating": 3.0, "review": "It's not as polished yet as I would like. Compared to my Roku player the image quality is much better, but the apps are more finicky, such as hulu freezing randomly. Netflix buffers constantly. I have a 50 mbps connection, so haven't seen that issue in a long time. Back when I had a 1 mb connection sure, but not 50. Maybe the wireless connection is weak, not sure. The remote seems to have connectivity issues too from just a few feet away. You can press a button once and it will register that your pressed it around 8 times. Usually it's the direction pad that has this issue. So over all, my experience with it is just so so.", "verified": true, "helpfulness": "2/3", "author": "Jared"}, {"rating": 5.0, "review": "Wow! I cut the wire and ended my cable TV service almost a year ago. In the interim, I've experimented with several replacements. I have a Roku, and two Google Chrome Casts. Our house also has three laptops, two iPhones, and two iPads. The Roku works great - but it's about $100. The Chrome Casts are a good idea. . . but there is a known issue about using them with iPhones and Netflix (which is one of my two primary viewing picks).So . . .I figured I'd try a Fire TV Stick. The box arrived yesterday! I excitedly ripped it open, and took out the teeny Fire Stick.I figured I would replace one of my Chromecasts and see how it worked.  Now, the packaging materials say you really need to use Amazon's power plug and cable . . but I figured I could use the cable that was already there for the Chromecast, and just substitute Amazon's power plug. NOPE! The Fire Stick popped up a message on my TV screen that it wasn't getting enough power. Actually plugging in Amazon's power cable instantly fixed that problem.The Fire Stick booted up, and - WOW! It detected my home network instantly. Asked if I wanted to sync to my Amazon account. Then showed a helpful video as an \"intro to your Fire Stick.\" It took me two more minutes to find and download the Netflix and Hulu Plus apps, and I was ready to go. Just 15 minutes from opening the box to full functionality.The picture is beautiful! Navigation with the supplied remote is easy - and will become easier once my thumb learns that the large center wheel is used for \"Enter.\" Navigation is extremely intuitive. And the variety of programming is exactly what I need. Some pluses above my ROKU are that the Amazon programming is much easier to find (for obvious reasons), and the user interface is friendlier.Can't wait until they release the iOS app for voice navigation!I liked my Fire TV Stick so much, that ten minutes after I finished setting it up - I ordered a second one!", "verified": true, "helpfulness": "1/1", "author": "Kathleen Hart Abel"}, {"rating": 5.0, "review": "An amazing product, compared to Chromecast, if you are a Prime member, you can access all your watchlist from Fire TV Stick just like what you done at Fire TV.It can satisfy almost every task you have in Fire TV. But the price is far better than Fire TV. If you are new to Smart TV box, you can buy this one in a affordable price and change to expensive product later.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Kept losing its wireless connection. When it did connect, Netflix was displayed in standard definition. Ironically, it would not connect to Amazon at all. If you're looking for something that really works, and you can live without Amazon Prime movies and TV shows, I recommend Apple TV. It costs more, but it works flawlessly.", "verified": true, "helpfulness": "0/2", "author": "WASH"}, {"rating": 5.0, "review": "Works great, my kids love it and I love it.  So easy to set up and I've moved to multiple tv's with ease.", "verified": true, "helpfulness": "0/0", "author": "Tara LeBourveau"}, {"rating": 1.0, "review": "I don't know if I have a defective unit, or if the device is just lousy.I received the device, plugged it into my TV, connected to wifi, then downloaded the software update.  Then I got a message that the Fire Stick was going to reboot.When the stick rebooted, I got a brief flash of a screen that looked like the screen you would get when you turned on an old Atari 2600 without a cartridge in the slot.  From there, I got the 'Not Supported Mode' message on the TV screen.  I have a Samsung.Played with the wires a little bit.  Unplugged and replugged everything.  After five or six tries, I finally got the Fire Stick to come up.  Set up my account, downloaded a couple of apps, then switched back and forth between my cable box and Fire Stick to see if everything was cool, and the message I got when I switched back to HDMI input 1 was 'Not Supported Mode.'What brief experience I had with the Fire Stick looked pretty cool.  But there also didn't seem to be much I could do with the Fire Stick that we can't already do with our Playstation.I'm thinking maybe Amazon rushed these to market before they worked out all the bugs.  I'm returning this one for a refund.", "verified": true, "helpfulness": "0/1", "author": "Matt D."}, {"rating": 5.0, "review": "Great little stick.  The setup was a breeze and it works well with the services I'm subscribed to.", "verified": true, "helpfulness": "0/0", "author": "Miss"}, {"rating": 5.0, "review": "I was able to purchase one of these very early.  It's been in use a few weeks now and everyone in the house loves the new Fire TV Stick.  They actually fight over the remote. Poor cable box is not as popular anymore...I hate commercials while watching a series or movie....now...No more commercials! Set up was easy and using it even easier.  The picture quality is great with Prime, rented movies and Netflix is smooth, clear and perfect (haven't tried anything else).Amazon did a great job on it's design and interface. The only problem I have had is it lost connection with the internet once. I did a \"reboot\" (unplug then plug back into the TV) and the wifi reconnected. Not sure if it was the stick or the internet provider. Who cares, it happened once and the fix was as simple as getting another helping of popcorn.There is nothing I don't like about it.  If something reveals itself, I'll update this review while being fair and logical.Overall, turned my \"dumb\" TV into a real \"smart\" one for a fraction of the cost. So...I feel a bit smarter having purchased it.  The Fire TV Stick is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "OneOfTheAncients \"EA\""}, {"rating": 5.0, "review": "Not much to add to the other 6,000 or so more detailed reviews other than to say that I love it.Easy, intuitive set up makes streaming a breeze for novices and pros alike.", "verified": true, "helpfulness": "0/0", "author": "AmazonFan"}]