[{"rating": 4.0, "review": "Very convenient to use for amazon instant video since my tv and DVD player only offer Hulu and Netflix.I was a bit disappointed that you need to connect the stick to AC power as I thought it operated like a flash drive. I believe it will but it is \"recommended\" you connect it to power and mine wouldn't work until I did. I only bring this up because it is one more wire to deal with with a wall mounted television setup. Also the AC block is a little wider than the average plug so it doesn't easily fit alongside the other plugs plugged into the surge protectorAlso disappointed that the voice remote app is still not available for iPhone. Waiting patiently for that, because I don't like having to arrow through letters to type in movies I'm searching for etc.Great that it already comes registered to me and linked to my prime account so no need to setup that up.I ordered this as a prime member during the $19 special and it was well worth the money.", "verified": true, "helpfulness": "1/1", "author": "Frostsdad"}, {"rating": 3.0, "review": "It works well enough. I'm sure they'll work out the little bugs, like when watching streaming video when you pause the sound at that instant stays playing on a very fast loop -- pause should also mute but it doesn't do that.  Wish it had more configuration options and more things you can tweak in the options/preferences, such as streaming from local content on my streaming server.  Otherwise it's fairly decent.", "verified": true, "helpfulness": "0/0", "author": "J. Payne \"Home Theater Nut\""}, {"rating": 5.0, "review": "The Fire TV Stick is easy to use and very portable.  As long as you know your passwords, it is simple to set up after plugging it into your tv.  I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Catherine Sloat"}, {"rating": 5.0, "review": "So far it was very easy to install , update and start using it. I use Netflix and Amazon prime and so far it is as good as any of the competitors.I think the remote is small and simple but does the job well. Better then expected , I'm happy with this product.I find the interface clean and clear , keyboard on screen is hard to use but it is as any other similar product.So for the price I think it is a great product.", "verified": true, "helpfulness": "0/0", "author": "Eduardohers"}, {"rating": 2.0, "review": "It's great for Netflix and Hulu but won't load Amazon Prime movies or tv shows. Worked for 1 day.", "verified": true, "helpfulness": "0/0", "author": "Pjklev"}, {"rating": 2.0, "review": "I have an issue with the sound. It seems the firestick doesn't support Dynex TVs! :((", "verified": true, "helpfulness": "0/2", "author": "Asha B"}, {"rating": 3.0, "review": "Doesn't have many TV options, and most of the options it has you need to register it via computer, it's kinda annoying other than that I like it", "verified": true, "helpfulness": "0/1", "author": "erin moriarty"}, {"rating": 5.0, "review": "It was quick and easy to install and use. I bugged it in and a couple of minutes later I was starting to watch shows. Its Great!!", "verified": true, "helpfulness": "0/0", "author": "Steve Rynning"}, {"rating": 5.0, "review": "Loving it so far!!!", "verified": true, "helpfulness": "1/1", "author": "JWHenderson"}, {"rating": 1.0, "review": "Hooked it up to my Samsung TV and all I get is \"Not Supported Mode\".I've tried everything I know: turning tv off/on, plugging/unplugging the stick, various button combos on the stick remote.  No luck.  I thought the problem may have been with the Stick itself but when I plugged it into my PC monitor it came up running.  The thing is I bought it so I could use it on my Samsung TV.  VERY DISAPPOINTED.Will probably have to return the unit and get a Chrome Cast.UPDATE: After spending a few hours trying to get this to work on my Samsung TV and reading anything I could find online about how to fix \"Not supported mode\" I had to give up and returned the unit to Amazon.  Looking at other similar devices such as Chrome Cast and Roku they all seem to have one problem or other.  I think I'll wait some.", "verified": true, "helpfulness": "3/5", "author": "JLM"}]