[{"rating": 5.0, "review": "I love it, best thing ever", "verified": true, "helpfulness": "0/0", "author": "Yenis Ruiz"}, {"rating": 5.0, "review": "Does everything I need it to.", "verified": true, "helpfulness": "0/0", "author": "Orissa Viza"}, {"rating": 5.0, "review": "I love my Fire stick!!!  So easy to install.  Great selections!!  Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "DEDRA CRISWELL"}, {"rating": 2.0, "review": "At first this was great.  However, the device has started to malfunction as of April.  It will randomly discount from the internet or freeze while I am in Netflix.  At first I thought it was my internet or Netflix.  This was proven wrong when I was able to access Netflix on my computer and tablet just fine.  I really dont know the return or replacement policy.  Ill look and see what happens.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "Bought this some time ago to use later at our travel trailer as cable can be spotty. It works fantastic. As with most Amazon products it is worth the money and does more than you expect", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "I love my Fire TV Stick, great variety of streaming at a price that is so affordable.  Installs with ease and operation is easy to understand.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 3.0, "review": "We have been using our Playstation 3 for years to watch movies via Blu-ray, Netflix, and more recently, Amazon Instant Video. Unfortunately, the 8 year old machine finally died as it was abused (not usually turned off after use). We borrowed a Chromecast device that worked very well for Netflix but wanted to watch Amazon as well. We read that although Chomecast is not supported by Amazon (or is it the other way around?) it can be made to work. To make things easier on ourselves, we decided to purchase the Amazon Fire TV Stick since it works with Amazon and Netflix right out of the box.We are very disappointed. The only positive about the product is the price. We frequently get errors such as internet connection too slow. We have 75mbs download speed verified by various speed tests. We rarely had these types of errors on the Playstation and our trial run of the Chromecast device never had an error.Additionally, the picture using the Fire TV Stick is usually not in HD due to its inability to utilize our hi-speed internet connection. Perhaps it would be able to utilize our hi-speed internet connection more efficiently if it were closer to our wireless router. Once again, this was not an issue with an 8 year old Playstation 3 or the Chromecast device that we borrowed. When the picture is in HD it usually coincides with slightly jerky motion and voice not matching the video perfectly.If I were using this on the road in a hotel it would be sufficient. However, on my 60inch Samsung in the living room, it is just not acceptable. Hopefully, I will be able to experiment with moving the wireless router to a location in close proximity to the Fire TV Stick. If it doesn't fix the issues, I will return this product. Perhaps the Fire TV Box is better.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Very good inexpensive media device.", "verified": true, "helpfulness": "0/0", "author": "Jacob Cullen"}, {"rating": 5.0, "review": "This compact device uses advanced technology to deliver an easy to use format for accessing streaming video and music.It is the simplest and most powerful electronic interface I have ever used. The screen menus are fast, clear and so intuitive.The remote control is a pleasure to use. I was up and watching movies in 10 minutes. I am very impressed!", "verified": true, "helpfulness": "0/0", "author": "Barry D. Berry"}, {"rating": 5.0, "review": "LOVE!!!! We are so in love with our fire stick!! We use it in our bedroom and take it on vacation with us and everything! Absolute must have if you have Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Rachael"}]