[{"rating": 5.0, "review": "I love this little thing! I have a PS3 in my living room and I watch Hulu/Netflix/Amazon on the weekends and it is perfect. The fire stick runs smooth just like my PS3 AND even when my PS3 is on in the living room the fire stick works fine. I have one step above the standard internet service and my router is for a family of 4. I have my phone/tablet/laptop/PS3/fire stick connected sometimes at the same time when I have company. So if anyone is experiencing buffering maybe it is your internet service. I think you do need to keep it plugged in though. I never unplug it. It has a timer so if you don't use it for a while it cuts off. At night I pause my show and turn my TV off and when I wake up to turn on Pandora the screen is black. I hit a button on the remote and it turns back on. So I don't think its ON all the time like others have said. I don't have any complaints as of now and I have had if for a few weeks. I will never pay for cable again!!!!!!! :)", "verified": true, "helpfulness": "0/0", "author": "Lois"}, {"rating": 5.0, "review": "Easy set up and very user friendly.  No connection issues at all ( but my wireless router is in the same room which probably makes a difference). Love it!", "verified": true, "helpfulness": "0/0", "author": "Annie Simmons"}, {"rating": 5.0, "review": "When I bought my Fire Stick I already had most of the same capabilities built in to my smart TV, my TiVo and my Roku, not to mention my smartphone and iPad as well. This kind of appliance isn’t very exclusive anymore, which is evident that all the technology is condensed down into a tiny chip inside the Fire Stick.I bought it because Amazon had a special promo and for the price I thought it would be cool to plug it in to the TV in my bedroom and get much of the capabilities I get in my Media Room. And that’s true, it does give me that.Installation was brainless. Thank you Amazon for already knowing who I am, my phone number, my shoe size and what I want for dinner tonight. The only really dumb thing about the automated setup is that they use an animated cartoon to lead you through the process which requires that you can hear what he is saying. Because I use a speakerless monitor mounted in the bedroom the audio is only hooked up through Bluetooth headsets at the bed, which weren’t charged up, so I couldn’t hear anything the little character was saying. In 2015 it amazes me that Amazon would be so inconsiderate of the hearing impaired that they wouldn’t caption the setup procedure. Because it is a cartoon character you can’t even read his lips.  So I guess I will never know how to set my Fire Stick up because once the cartoon plays it is gone forever.As far as how it works, if you already have any of the above mentioned devices you can skip this part … it works exactly the same. If you have never had a device like this, well, think of it as having a huge stack of DVD’s that you can choose from to play whenever you want to. Some of the programs are movies, some are TV shows, some are sports, music or other content. You scroll through little pictures of the channel you want, and then narrow it down to the program you want and click “play” on the remote (which doesn’t have to be pointed at the TV). From there you operate it just like any remote control. Some of the content is free, some is by subscription and some is by pay-per-view.Devices like Fire Stick don’t always give the user equal results. For example what is built in to my smart TV is a little older and it stutters, hiccups and loses its place a lot. What is in my TiVo has a limited selection of programming. The Fire Stick and the Roku are extremely competitive with each other, offering almost identical content, and playing it in high resolution in real-time with very little need for buffering or stuttering.Fire Stick is likely all most people need if they want to watch non-broadcast content on their TV. The Fire Stick itself has the advantage that it can easily be transferred to any TV or monitor you own that has a HDMI input (including your computer monitor or laptop computer), which makes it the best choice for the traveling person. It even works in some hotel room TV’s.CONSThere is little not to like, but one element I found puzzling is that you buy this thing because it is as tiny as a USB thumb drive but then you have to plug it in to an AC wall outlet using a transformer. That’s a fail for me. It should just plug in to the TV and get its power from the HDMI port. That makes it not quite ready for Prime Time. And don’t say you weren’t warned … if you misplace the remote you are out of luck, you can’t do anything without it unless you like to use your phone as a remote control.Despite the silly requirement to tote an AC power transformer around with you I still give this 5-stars because of all it does and how well it does it all.", "verified": true, "helpfulness": "1/1", "author": "PhotoGraphics"}, {"rating": 5.0, "review": "Amazon's Fire line of devices hasn't always hit the mark, but the Fire TV and the Fire TV Stick certainly do. I chose the Stick because it's cheaper and I don't plan to use it very much for gaming or other things that might require the processing and memory of the standard Fire TV. It's super easy to set up and get going, and the interface is attractive and functional. I like that recent apps are featured first and foremost, making it quick and easy to get to where you want to go. The remote is standard; nothing fancy, but it's small, compact, and the buttons give a satisfying click.One downside that you might notice upon setup is that the Stick does need to be plugged into the wall for full power rather than the USB port on your TV. It may function while plugged into the USB port, but the device won't be fully powered and you might notice some performance issues. This does detract from its portability a bit.If you are a Prime member, this device will offer even more benefits. Amazon's video, music, and photo storage services are featured heavily on the home screen. Any playlists or watchlists you've created on Amazon are available right from the home screen, along with your photo library if you've uploaded your photos to Amazon's cloud. Your photo albums can also be used as your screensaver. If you use Amazon's services a lot, this is an ideal device for you. If you are more invested in Google services (Google Play video, Google Music, etc.), then you may want to look at the Chromecast or Nexus Player, as Google apps will not work out of the box with the Fire TV devices. On most Android devices, the lack of Google apps would be an instant \"no buy\" for me; however, Amazon has put a lot of effort into their media services, and I have to say that I prefer them to Google overall. Plus, as a Prime member, I'm already paying for these services (particularly since I receive digital credits from their \"no rush\" shipping), so it makes more sense for me to gravitate towards Amazon.Speaking of Android, the OS on Fire TV devices is, of course, a heavily modified version of Android, but it is still Android at its core. This a major benefit over Roku and Chromecast, as it allows users to sideload many Android apps that are not available through the included app store. This is a relatively simple process that doesn't require you to root the device or even connect it to your computer. I'll spare the details as a quick Google search can teach you how to sideload, but this essentially allows you to use any Android app on your Fire TV, though you may need a Bluetooth mouse/keyboard for many of them. This is the one I bought that I'd recommend: http://www.amazon.com/gp/product/B00KWUMU92/ref=oh_aui_detailpage_o03_s00?ie=UTF8&psc;=1 - You'll need to load the default Android settings.apk first in order for the Fire TV to recognize it, but it's compact and sits nicely with the remote control. However, virtually any Bluetooth keyboard/mouse will work--just make sure it's truly Bluetooth and doesn't require a USB receiver, as the Fire TV Stick doesn't accept these.Overall, the Fire TV Stick is an excellent inexpensive, compact, and versatile streaming device that provides plenty for both casual users and advanced users who want to tweak around with it. It has replaced my Chromecast in the living room, though I do miss being able to cast (or \"fling\" as Amazon calls it) many of my apps. I'm glad that Amazon and some app developers are incorporating this in limited form, as I am able to cast from Netflix, YouTube, and a couple of other apps. Aside from some minor downsides, the Fire TV Stick is absolutely the best value currently available among streaming devices.UPDATE 5/16: I'm still loving the Fire TV Stick, and with the latest update I just discovered something new that it can do...connect to hotel wifi. No other portable streaming stick offers this because it usually requires access to a web portal in order to sign in. Amazon has solved this problem by allowing the web portal to pop up upon signing in to the network. Due to its portability, I now would definitely recommend the Stick over any other streaming device, price aside.", "verified": true, "helpfulness": "0/0", "author": "L. Humphrey"}, {"rating": 5.0, "review": "Makes streaming movies so much easier.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Easy to use. Works great!", "verified": true, "helpfulness": "0/0", "author": "Douglas B Dean"}, {"rating": 5.0, "review": "love it, most of the same features of roku with a cleaner interface. I use this for traveling and work and have the roku at home. I kind of wish there were more channels but to be honest I only really use the netflix, prime video, plex, and hulu on my roku. The miracast feature is pretty broken, It seems able to stream youtube from your phone but any videos downloaded and played on the phone don't play or play like crap. I've heard people getting it to work but it gives me loads of trouble on my galaxy s4. Overall though I'm very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Eric M. Rogers"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kelly DaBrescia"}, {"rating": 5.0, "review": "I'm more than satisfied with the Fire Stick. I love it!", "verified": true, "helpfulness": "0/0", "author": "Julie77"}, {"rating": 3.0, "review": "I wish there was a troubleshooting manual that came with it. I have had it two weeks and still can't get it to work. It will not pick up my WiFi and I haven't been able to get it to connect. Needs to have a little more help with it.", "verified": true, "helpfulness": "0/0", "author": "kim"}]