[{"rating": 5.0, "review": "Awesome. Love it.", "verified": true, "helpfulness": "0/0", "author": "Chad Eckert"}, {"rating": 4.0, "review": "still struggling to get this working, says my wifi is \"connected with problems\". What kind of problems? my wifi is working fineUpdate 3/13: working great today, not sure what the problem was yesterday. I think it was on the border between an excellent wifi connection and a very good connection. Plugged it into a closer TV, worked fine. Then plugged it back into to further TV, working great!", "verified": true, "helpfulness": "0/0", "author": "James L Becker"}, {"rating": 5.0, "review": "So much fun to watch the Amazon Prime shows that I can't find anywhere else. I could watch them on my Kindle but watching them on a larger screen if delightful", "verified": true, "helpfulness": "0/0", "author": "Donna Taylor"}, {"rating": 4.0, "review": "Does what it says. Wish the browser was stronger. Wish the fling option worked with a laptop and not just a phone or tablet. Chromecast wins in this respect", "verified": true, "helpfulness": "0/0", "author": "matthew leaphart"}, {"rating": 5.0, "review": "Great product-performs as expected", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is a great deal...perfect for someone like me who is always working and don't want TV much..have a choice of movies to watch anytime without paying a monthly bill for cable...I get all I need in this firestick", "verified": true, "helpfulness": "0/0", "author": "Monique SiouxBob"}, {"rating": 5.0, "review": "Very smooth operation, easy setup, and a great price make this a winner.  If you have Amazon Prime, this is a must have!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE! Couldn't be happier with this purchase!!", "verified": true, "helpfulness": "0/0", "author": "trent"}, {"rating": 1.0, "review": "This stick has major issues staying connected to wifi and through some extensive Googling I found out that the issue was with the internal wifi antenna. The solution to this is to tape a 14 inch piece of wire to it and let 11 inches of it hang vertically.  Since doing this I have had zero issues with this device. I used a thin copper wire and electrical tape.  The fire stick is in dire need of a recall and update and Amazon can recognize this.", "verified": true, "helpfulness": "1/1", "author": "CGcyclist"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Rodney Church"}]