[{"rating": 5.0, "review": "This has been the best thing we purchased on Amazon. I love the ability of watching Netflix in our bedroom and all the options on Amazon Prime. This has been a great alternative to buying a smart TV. Works great. Easy to use and set up. WIFI connectivity has been working fine. Also paired the App on my iPhone to it. Works well. Only had an issue once with it not connecting. I still have Comcast XFINITY box in my room. You can have both on the TV, each on its own HDMI.My mom also bought one after seeing mine. We have two in the house, the next floor up and no problems with connectivity with two in the house.", "verified": true, "helpfulness": "0/0", "author": "lmmercurio"}, {"rating": 5.0, "review": "Works great!  Gotta love this.  Everyone should get one.", "verified": true, "helpfulness": "0/0", "author": "clairebear694"}, {"rating": 5.0, "review": "I love this! It is everything that they say you're getting. I also love the app you can download to use your phone as the remote.", "verified": true, "helpfulness": "0/0", "author": "Laren"}, {"rating": 4.0, "review": "Is there a monthly charge ?", "verified": false, "helpfulness": "0/1", "author": "denny busho"}, {"rating": 5.0, "review": "Wow, this installed in 5 seconds.  Works perfectly with my Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jane A. Gerbig \"Janie\""}, {"rating": 5.0, "review": "If you are paying for Prime, you'd be crazy not to get this as well.Easy to set up, and has most of the programming that Netflix doesn't offer.Even if you aren't an avid streaming TV user, this is a great way to dip your toes in.  All you need is an open HDMI port on your TV, and WIFI.", "verified": true, "helpfulness": "0/0", "author": "Wilco937"}, {"rating": 5.0, "review": "installed KODI and works just fine as i needed.", "verified": true, "helpfulness": "0/0", "author": "Jaguar"}, {"rating": 5.0, "review": "Almost as good as the Full Fire TV, Half the price! Works Great!", "verified": true, "helpfulness": "0/0", "author": "Nick Kastanis"}, {"rating": 5.0, "review": "Was tired of paying high prices for satellite TV programming so I went with a basic package. We had one new smart tv in the living room and did not want to spend more money for one for a second TV. We have a basic hdtv with a USB port so we bought the Fire Stick for this tv so I could watch movies that my wife doesn't want to see while she is in other room watching her programs. Now I am not technically inclined but if you know how to use a remote or a cell phone to move through various pages you can use this. Saving lots of money and have lots of choices. Plus there's nothing sitting on counter, just a USB device that plugs into the TV.", "verified": true, "helpfulness": "0/0", "author": "GARY BOTTS"}, {"rating": 5.0, "review": "Bought two of these. One for a gift and one for myself. Great streaming device for the money. Nice UI. Good size for travel use as well.", "verified": true, "helpfulness": "0/0", "author": "Mike Shake"}]