[{"rating": 5.0, "review": "Faster than Roku, great channel selection, easy to use and I love the apps I can use on my phone like voice search.", "verified": true, "helpfulness": "0/0", "author": "Heidi Hill \"Heidi704\""}, {"rating": 1.0, "review": "This worked great for about a week, then quit working.  Error message saying it can't connect to the wifi, but when I go to network settings, it says it's connected and that the signal strength is excellent.  There's no other help or tips on-screen for getting it to work, other than to go to the website, which I haven't had time to try.  But it's frustrating - my daughter was very disappointed.  I wish I had gone with a different product.", "verified": true, "helpfulness": "1/1", "author": "J. Hunt"}, {"rating": 3.0, "review": "Overall a great product, very easy to use and plug into a TV. Slightly disappointed that some basic apps like Plex aren't free, even though I have a premium account and have already paid for the app on Android. The remote works OK unless you have to type anything in, I haven't had success getting the fire TV app to work from my phone yet. I wouldn't pay more than 30 dollars for it but for that price it is a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was given to me by my son for Christmas.  I love it.  I use it to watch Netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Diane Baggett"}, {"rating": 5.0, "review": "The only thing that I think was a slight oversight on this product is that the micro USB power plug is on the side of the unit so if you don't want to use the included HDMI extension you are out of luck. You pretty much have to unless you have no other wires coming out of the back of your TV. I am not of those people. The HDMI extension fixes the issue and because it's behind my TV I really don't care that it is back there kind of hanging. The remote is awesome and really responsive. The channels come in clear and the load time is virtually non-existent. I also have the chromecast and for most streaming apps I would rate Fire TV above anything the chromecast can do. I haven't tried the screen mirroring function on the Fire TV Stick but I am optimistic that it will be superior as well.", "verified": true, "helpfulness": "0/0", "author": "B. Rockwood \"dasrockness\""}, {"rating": 5.0, "review": "amazing", "verified": true, "helpfulness": "0/0", "author": "Randel T. Sink \"Janie Sink\""}, {"rating": 4.0, "review": "A real bargain. Works great.", "verified": true, "helpfulness": "0/0", "author": "TREN"}, {"rating": 4.0, "review": "EXCELLENT PRODUCT SAVED ME THE COST OF DIRECT TV, AND WITH A BETTER TRUE 1080 HD PICTURE. THE ONLY NEGATIVE IS THE  POWER CORD FROM THE ADAPTER TO THE STICK IS TO SHORT AND THE CORD IS PROPRIETARY, AND AMAZON DOES NOT HAVE A LONGER ONE!", "verified": true, "helpfulness": "0/0", "author": "LITKO"}, {"rating": 4.0, "review": "I purchased this during the $20 promo - why wouldn't you want to try it for such a great price? We got rid of the cable box in the bedroom in anticipation of receiving this and it was such a great decision. It does have limited apps compared to the Roku which we gifted to a family member last Christmas, but maybe Amazon will expand the app selection?? I'll love the music channels to listen to while getting ready without using my phone and wasting the battery. I give 4 stars because the remote is not designed well. I don't get the circular design of the top button, it sometimes clicks the wrong direction if you don't hit it right on the edge of the direction you want. You have to really push hard on the buttons and the feed from the remote to the tv is slow - we've clicked a few times and nothing was received on the tv and then all of the sudden it scrolls uncontrollably to catch up to the amount of times you pressed the button to navigate. The cord to plug into the wall is VERY short so depending on where the tv is located in comparison to the outlet, you may need to use an extension cord. For PRIME folks, it is a must get. For the $20 promo price, it's a nice device to have and it'll save us a few bucks a month without having the extra cable box!", "verified": true, "helpfulness": "0/0", "author": "Vickielacie"}, {"rating": 1.0, "review": "I am very unsatisfied with my Fire TV Stick. I primarily use Netflix and Bloomberg TV, but find myself unable to keep a connection. I have a strong wi-fi connection to the Stick, but it keeps freezing and forcing me back to the network settings. I have other devices in close proximately to this device that are operating with wireless without an issue. When the connectivity problem occurs the device is unable to find any wi-fi in the area (neighbors, etc.). These other wi-fi connections show up when the device is functioning properly, so it leads me to believe the device is faulty and not every router in the neighborhood at the very same instant.To solve the connectivity problem, I find myself \"hard restarting\" the device (hold middle button and Play/Pause) at least once a day to re-connect through the power cycle. It's just a quick to sit through the start-up of an Xbox or Apple TV.A wonderful idea that I thought would be the icing on the cake to convince me to subscribe to Amazon Prime, but I think I am better off without.", "verified": true, "helpfulness": "192/217", "author": "Eric"}]