[{"rating": 5.0, "review": "Terrific!  Love it!  As I'm moving around quite a bit, often not in one place for long, traditional cable t.v. isn't always available.  This gives me access to movies, t.v. and lots of free prime movies, as well.  Very convenient.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'm not going to leave a long detailed review or comparison- plenty other reviews more than cover this. My biggest issue with the \"stick\" is that it also needs to plug into an electrical outlet. Hmmm.... Why don't you show that when marketing this stick? I can tell you that it will be very difficult to plug in the Fire Stick where my tv's are located. Super annoying, and probably would have decided against the stick had I known.", "verified": true, "helpfulness": "2/2", "author": "AngY"}, {"rating": 1.0, "review": "Wow what a let down!  First, it took nearly a half hour to setup because it kept losing the network connection.  It dropped the connection 12 times in 30 minutes.  When I was finally able to login to my amazon account, everything was incredibly slow.  Bottom line, I have up in frustration before ever selecting anything to watch.  I boxed it back up and hooked up my roku 3 and within a minute I was watching a movie.  No disconnects, no slow loading, no hassle.  I only paid $25 for the fire stick and still feel ripped off.  Thank goodness I kept the receipt because it's going back.", "verified": false, "helpfulness": "3/4", "author": "Jeff S"}, {"rating": 1.0, "review": "Hate it.  Excruciatingly slow to load ANYTHING. Very buggy. I have to press select and play simultaneously to restart it 2 or 3 times during the 15 minutes or so I am trying to use it before I give up and go back to regular tv.  Hulu Plus videos won't play. Most of the time it says the app doesn't exist (?).  So OK, I thought the Amazon prime videos and music would be more reliable. Nope. Haven't been able to watch any show or listen to any song without it hanging up and freezing halfway through/ $19 is cheap, if it works, but I feel like I have essentially flushed $19 down the toilet.  Cannot recommend!!!!!", "verified": true, "helpfulness": "2/3", "author": "Almo"}, {"rating": 2.0, "review": "So far the only thing that seems to work well is the games. I haven't been able to really watch a movie or show on it yet without it stopping or buffering. I have a roku also that that works great for the most part so I know it's not my internet.", "verified": true, "helpfulness": "2/2", "author": "C. Mourgos"}, {"rating": 5.0, "review": "Time will tell but right now it works as described, if it can get me off of paying for cable it will be worth the price ten fold", "verified": true, "helpfulness": "1/1", "author": "Twopenny"}, {"rating": 5.0, "review": "I loved it, I am having Xbox one, google cromecast.", "verified": true, "helpfulness": "1/1", "author": "Suresh Bollina"}, {"rating": 4.0, "review": "Great product!  I would give five stars if Amazon didn't restrict apps to the Amazon App store and allowed Google Play as well or if there was a better way to search for Amazon Prime movies.  If you search for Christmas movies, for instance, you have to click through dozens of rental moves to find the very few Prime movies.  WIth what I'm paying for Prime membership, I should be able to see a list of only movies that I've already paid for.  Other than those two complaints, the product is great.  There are a lot of great movies included in Prime and several good apps where you can get additional content, even more by sideloading apps.", "verified": true, "helpfulness": "2/2", "author": "Us Here"}, {"rating": 5.0, "review": "Easy set up. Love it.", "verified": true, "helpfulness": "1/1", "author": "Dixie Giddens \"shvmom\""}, {"rating": 4.0, "review": "Not bad.  The interface is modern and mostly responsive. Games are a nice bonus and additional apps are on the way.  No headphone jack in the remote like the Roku 3.", "verified": true, "helpfulness": "1/1", "author": "J. BROWN \"B\""}]