[{"rating": 5.0, "review": "Works exactly as advertised.The price is right.", "verified": true, "helpfulness": "0/0", "author": "Jaime G"}, {"rating": 5.0, "review": "Love my Fire TV Stick! It was so easy to set up and is so easy to use.  I prefer this over anything else that we have in our home.", "verified": true, "helpfulness": "0/0", "author": "TLo23"}, {"rating": 5.0, "review": "😄", "verified": true, "helpfulness": "0/0", "author": "Vincent bullard"}, {"rating": 5.0, "review": "Truly wonderful", "verified": true, "helpfulness": "0/0", "author": "George Brown"}, {"rating": 1.0, "review": "Unfortunately, my love for Amazon cannot overshadow this product I feel did not live up to what I thought it could be. I purchased two when the pre orders originally went up for sale. One for myself, one as a gift.I received my units yesterday, and I popped mine into the back of my TV. It kept rebooting from the Amazon Screen. The device itself actually recommended I use it in a wall outlet, so even though I could see the ugly wire going to my wall outlet, I obliged. Okay, now it's ready, Woot! Initial update. Okay, should be just a couple of minutes...20 minutes later, it has finished. Sweet, let's go. Oh, now it's installing? 5-6 minutes later, it's ready to be setup. Welcome Joseph P******e. Would you like to continue with your account or another? Well, this one I'm using for myself, so my account. Where do I put in my password? I don't? My Mastercard number is XXXXXX? So, if I gave this as a gift, anyone can just purchase apps, movies and TV shows on my account? Not cool.So, I have to go and put it in Parental Control so that the wife and family does not make purchases by accident, as she is not as up to speed with what is included at no extra cost in the movie and TV section (seeing that our other devices ask to verify a credit or debit card for each transaction) So, lets look for apps to add to this thing. Hmmm... buy this movie for 9.99, rent this for 3.99, where do I go to download apps? Let me use the search feature. WWE Network, lost connection. OK, lets go back home, WiFi is still connected, WWE Network, lost connection. Alright, it's new, lets soft reset it and pull the plug for a minute. It's back up. Search for WWE Network, black screen.I navigate a bit more, here is the apps menu at the bottom. They are organized by category. No option for all, in alphabetical order? Maybe I'm missing something, and can search, but if I did, it's not user friendly enough for me to plug and play like other popular options. Finished downloading my favorites.Lets try these games, should be fun to use between movies and shows. Download Flappy Bird, Kart Racer and a few others. Unplayable. The remote lags every minute or so. Left, Left, Left, nothing... then all of a sudden those three lefts activate. Now i'm off the track and behind. Lets try Flappy Bird. Jump, Jump, Jump (OK, this seems like it was meant for this) Jump (no reaction) darn. Now that action button presses, when it asks to continue.Nevermind, let me just stream something from WWE Network. Menu, Shows, PPV, Royal Rumble, Play, lost connection. Go home, go back in repeat, it plays for 30 seconds... lost connection.I'm sure with some updates this will get better in time, but I am not a patient person. I decided to return both devices.", "verified": false, "helpfulness": "1/1", "author": "N Nguyen"}, {"rating": 4.0, "review": "I love the Amazon Fire Stick.  The variety in programming is a huge plus.  Purchased it early on and have not regretted it. The screen savers while pausing are phenomenal.  The only Con I have is probably my misunderstanding of the \"Watch List\".  We were watching several different movies/mini-series, but did not watch them in their entirety. We came back to continue watching and found them placed on the \"Watch List\".  They have been on the \"Watch List\" forever.  Other movies/TV series we placed on the Watch List ourselves have remained on the Watch List for over 6 months. Any suggestions or explanation of usage?", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I have both a fire stick and a Roku firestick has no buffeting whereas Roku constantly Buffett I will recommend you buy firestick.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Much cheaper alternative to the roku!", "verified": true, "helpfulness": "0/1", "author": "Jillian"}, {"rating": 3.0, "review": "After disconnecting, when it is turned on again then it doesn't pick up readily.", "verified": true, "helpfulness": "0/1", "author": "Binay Sinha"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "mt"}]