[{"rating": 5.0, "review": "Great product! Easy set up. Great price.", "verified": true, "helpfulness": "0/0", "author": "Maryam S."}, {"rating": 5.0, "review": "Had it less than a week but so far love it! Finally able to enjoy Amazon instant with my prime membership!", "verified": true, "helpfulness": "0/0", "author": "Dana S."}, {"rating": 5.0, "review": "It's everything you need! Appreciated the 30 day trial of Prime. Now I need to subscribe", "verified": true, "helpfulness": "0/0", "author": "Chris Foote"}, {"rating": 1.0, "review": "No mlb tv app!  As with most of the Kindle store the apps are very limited and you have to download them.  The Roku stick is much better.", "verified": true, "helpfulness": "0/0", "author": "Lee White"}, {"rating": 5.0, "review": "The Fire TV Stick is a wonderful alternative to satellite TV.  Love the available programs, current as well as older shows.  Would definitely recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Dawn Zalewski"}, {"rating": 4.0, "review": "It's pretty neat but it seems to be spotty when it wants to like my wireless signal.", "verified": true, "helpfulness": "0/0", "author": "Nik"}, {"rating": 5.0, "review": "We absolutely love our fire stick, considering getting a second!", "verified": true, "helpfulness": "0/0", "author": "Dawn Batson"}, {"rating": 2.0, "review": "Not my favorite stick I enjoy chromecast a lot better, the only reason I got this one is because chromecast does not support Sling TV.", "verified": true, "helpfulness": "0/0", "author": "Armando Garcia"}, {"rating": 5.0, "review": "i give it a 5 star for the price and with the android o/s you can download many add on apps compared to the roku which i have from other reviews from the media and such but i much prefer the fire stick now", "verified": true, "helpfulness": "0/0", "author": "50rocks \"50rocks\""}, {"rating": 1.0, "review": "Requires a great deal of data download speed to stream without buffering. Not mentioned at all anywhere in specifics about the fire stick.", "verified": true, "helpfulness": "0/1", "author": "ash"}]