[{"rating": 5.0, "review": "Loving it so far. Easy to set up. More functionality and a better UX than our Apple TV.NOTE: had to restart my router to get wifi working during the first-time setup of the Fire TV Stick.Additionally, note to Panasonic TV users -- you may get a green flicker -- mine went away... hoping it doesn't come back. There are some google results for potential solutions.", "verified": true, "helpfulness": "0/0", "author": "Brkhrdi"}, {"rating": 3.0, "review": "Look, in theory? This thing is great. In practice? Two of the apps I'm most interested in using freeze all the time! HBO Go and the Hulu Plus app are both really glitchy and slow. They're constantly loading, or they freeze on a single frame in an episode. Even if I stop to let an episode buffer, it still has problems.Neftlix works beautifully, but not every app does. Buyer beware.", "verified": true, "helpfulness": "1/1", "author": "dorkmuffin"}, {"rating": 5.0, "review": "Great product, easy to install and use. I am satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Robert Bumpus"}, {"rating": 2.0, "review": "So slow. I like my Ruko better. It seems it buffers on ever single show that I watch on netflix.", "verified": false, "helpfulness": "0/0", "author": "Edward Aguirre"}, {"rating": 5.0, "review": "Love it! Super easy to work with! Got an apple tv for my husband at Christmas and we hate it! Mostly because you can't add Amazon prime but you also can't even add any other apps. You get what they give you!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Works great. Easy set up.Lots of shows if you a Prime Member for free. Fool proof remote control.", "verified": true, "helpfulness": "0/0", "author": "Roxy"}, {"rating": 5.0, "review": "We love. It. Just buy one.Great interface. Love. :)", "verified": true, "helpfulness": "0/0", "author": "Paul E. Anna"}, {"rating": 5.0, "review": "Love it! Loving your shows and movie picks.", "verified": true, "helpfulness": "0/0", "author": "Constance Angel"}, {"rating": 5.0, "review": "I canceled my cable and purchase this Fire TV stick. It has to be my best purchase of the year. Work easy and it was already set upto my Amazon account. It was easy to connect through wifi and begin installing apps. No longer need cable due to this and having Amazon prime make it so worth it.", "verified": true, "helpfulness": "0/0", "author": "Shamika Z."}, {"rating": 5.0, "review": "Works great ! Easy set up.", "verified": true, "helpfulness": "0/0", "author": "jessica scott"}]