[{"rating": 3.0, "review": "So far I am happy with my Amazon Fire Stick.  My TV is located close to the router so I have yet to experience any problems with the connection.  It is easy to set up and easy to use.June 2015.  I have a second Fire Stick - a gift from the people at Sling TV - and it is located in my kitchen which is not next to my router.  This unit does not work as well as the other one.  Not nearly as well.  My Roku functions just fine in that location as does my laptop so it is not a connection problem.  If I had paid for this Fire Stick I would have returned it.  I really think that the Rokus are a better choice.August 2015.  Swapped the Fire Stick in my kitchen for the Roku on the living room tv.  There are just not enough apps available for the Fire Stick.  I am a Tennis Channel fan and the app is not available on the Fire Stick.  A lot of apps are not available on the Fire Stick.If you are going to buy an internet accessing \"toy\" for your tv check out what apps are available before you buy.  Then buy the Roku.", "verified": true, "helpfulness": "0/0", "author": "JJO"}, {"rating": 5.0, "review": "It has only been a few days, but we are loving the Fire TV Stick. I think this will help us eliminate Cable.", "verified": true, "helpfulness": "0/0", "author": "Liz Dwyer"}, {"rating": 4.0, "review": "I like the Fire TV stick.  A little disappointed in what is available to watch.  Also have a lot of trouble with Netflix, but i'm sure that's not the stick's fault.  Easy to install, remote is easy to use, and the app is easy to use with it.", "verified": true, "helpfulness": "0/0", "author": "carried43"}, {"rating": 4.0, "review": "No closed captioning???", "verified": true, "helpfulness": "0/0", "author": "John M. Gottschalk"}, {"rating": 2.0, "review": "I don't like the Fire TV stick since it requires using an AC adapter. This is not mentioned in any marketing ad and had I known, I would not have purchased it. Maybe that's why it isn't mentioned anywhere? Defeats the purpose of not wanting a black box and another wire coming off the back of your TV.", "verified": true, "helpfulness": "0/0", "author": "Computer Geek"}, {"rating": 5.0, "review": "I bought this to bring some life to an old 42\" Sony tv.  I also have a roku 3 and I actually prefer this.  I like the small remote, the unit is fast and responsive.  I also seem to be able to get a more reliable wifi signal on this versus the roku (router is on the main floor and this is on the second floor).  This does everything I need it to do.  I have prime, hulu+, and Netflix and it works great with all 3 of those services.", "verified": true, "helpfulness": "0/0", "author": "J. Raub"}, {"rating": 5.0, "review": "I received a chrome cast stick for a present . But I didn't have a subscription for Netflix or Hulu Plus I really had no use. My son came over and we watched Netflix on his account a couple of times , no problem . Okne day the grandson came over and went to use it , but it didn't work. I bought an Amazon Fire tv stick on blackfriday and plugged it into my tv and it loaded really fast. Logged into my prime account with no problems. I liked that it has a remote Don't need to have a tablet or an app downloaded on my phone. easy to use would recommend to anybody.. I have only used it twice but. it seems okay..", "verified": true, "helpfulness": "0/0", "author": "Anthony S. Manfredini"}, {"rating": 5.0, "review": "I can't speak for people who would have this far from their WiFi source, but we have a slower internet speed offering from our provider and the Fire Stick still always provides top quality HD and fast performance when firing up (pun intended) videos. If you don't want to be ingratiated in the Amazon world I might have to recommend the additional channels and less favoritism to apps that the Roku stick offers (I bought Roku for my parents since Fire Stick was on back order) and the Fire stick does seem faster, but always opening in Amazon videos can be annoying sometimes. I had to give up prime due to my budget and Netflix was the new alternative so the extra steps to access other apps is the only discouraging thing about this product.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 2.0, "review": "When it is not constantly dropping the network connection, it seems like a nice device, but it can't even get through a half hour show without losing the connection several times. We have a new, good quality router, and none of our other devices have this problem, including our roku that is several years old. Returning and getting a new Roku.", "verified": true, "helpfulness": "2/2", "author": "M. Jorgensen"}, {"rating": 5.0, "review": "Perfect !", "verified": true, "helpfulness": "0/0", "author": "Funair"}]