[{"rating": 5.0, "review": "Love this product.  So simple to set up and use.  If you are a prime member, it's a must have.  I can easily show pictures on my tv, listen to my music or watch videos from different sources, Netflix, prime, etc.  Quickly became my favorite gadget!", "verified": true, "helpfulness": "0/1", "author": "Elizabeth Lemaster"}, {"rating": 5.0, "review": "I love the fact that it's geared specifically for Amazon Instant Video. User interface is easy to navigate. Remote doesn't feel cheap. Kids can use it to watch Amazon Prime videos. This is the second one I've bought. Definitely recommend for anyone that has access to Amazon Prime videos.", "verified": true, "helpfulness": "0/1", "author": "C. Que"}, {"rating": 5.0, "review": "This is an excellent replacement for an older product - works great, easy to use and superb quality!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Most of the time it works, NEVER mirrors my Fire Tablet.", "verified": true, "helpfulness": "0/1", "author": "Eglue"}, {"rating": 5.0, "review": "Great product still learning about have been pleased do fat", "verified": true, "helpfulness": "0/1", "author": "Angie K Cooper"}, {"rating": 4.0, "review": "I have really enjoyed having this in my home. The home menu is easy to navigate and very user friendly! Access to endless hours of entertainment and apps for the whole family! Having the fire stick makes paying for prime even more worth it! It's also great for traveling!", "verified": true, "helpfulness": "0/1", "author": "Megan Kucera"}, {"rating": 4.0, "review": "we love it...........still learning though", "verified": true, "helpfulness": "0/1", "author": "J Cochran"}, {"rating": 4.0, "review": "I love streaming devices and having things at my fingertips, and this stick does as good a job as any in my opinion.  I own the original Roku, the AppleTV, a Magnavox streaming box, a Vudu Spark and now this.  I picked it up for $24 on Prime Day.  I found it to be easy to set-up.  I'm a big Amazon Prime fan, so I bought it primarily for streaming their content.  I was pleased to see that the Flixster app on the stick allowed me to stream my Vudu/UV collection.  I have about 100 of those movies so that is cool for me.  The other pleasant surprise was the included free games that can be played on the device.  I installed Flappy Bird and Crossy Road and played it with the kids passing the remote around the room.  I know they are mindless games, but sometimes just having everyone in the room together to do the same thing around the TV and enjoy it is worth it because they would so often rather just be hiding out in their rooms or with their faces in some personal electronic device ignoring everyone else.  We also installed the Game of Life for free on the device and played it.  It was nice to play on the big screen, and not have to do the banking, spinning, piece moving, setup, etc.  My only concerns for the device are... it seems to get hot after using for hours, but I don't know if that would ever be an unsafe thing or affect its longterm performance, and I don't like that it requires external power beyond what a TV USB port can provide.  My Vudu Spark works solely by plugging into the HDMI port, then into the USB port on the TV.  As I understand it, this pretty much needs or works best by actually using the wall plug.  It was included though so that is good.  I give it 4 stars instead of 5 due to those last couple points, but for the price I got it for it was a great deal.", "verified": true, "helpfulness": "0/1", "author": "G-Man"}, {"rating": 5.0, "review": "Very pleased w all the choices", "verified": true, "helpfulness": "0/1", "author": "JAN COLE"}, {"rating": 4.0, "review": "I was really interested in the Firestick but was unsure. On Prime Day it was on sale for $24 - my sign to give it a try. Love it!! Easy to install, easy to use and the pic quality is great. There are so many channel apps to choose from I can cancel my cable service without missing it. Great product!", "verified": true, "helpfulness": "1/2", "author": "Miss April"}]