[{"rating": 5.0, "review": "I have enjoyed using fire stick.  Movies and such are easily accessible with a good variety.  Thanks for a great product.", "verified": true, "helpfulness": "0/0", "author": "Timothy Scott Eanes"}, {"rating": 3.0, "review": "It is really great, but disappointed as the majority of the movies cost money to see.  I was expecting to find a lot more that were free as the marketing for this product indicates.", "verified": true, "helpfulness": "0/0", "author": "Barclay D. Bullock"}, {"rating": 3.0, "review": "Just ok..", "verified": false, "helpfulness": "0/0", "author": "Amy Kloskowski"}, {"rating": 5.0, "review": "I am thinking this is a good investment  still have a little more to learn about it, like do I need one for each TV", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 4.0, "review": "Most of the movies are very old , and not the best. A good selection of childrens intertainment. The Fire Stick works great gaining access but the selection of material could be better.", "verified": true, "helpfulness": "0/0", "author": "Roger Lind"}, {"rating": 5.0, "review": "Good even for a old guy", "verified": true, "helpfulness": "0/0", "author": "dan lynch"}, {"rating": 4.0, "review": "Got here sooner than promised.  Very easy to set up and use.  Still learning how to get better at using it but so far it is awesome!  And my wife was worried about me losing the remote so I downloaded the app on my phone and it's great.", "verified": true, "helpfulness": "0/0", "author": "Bradley P Schwartz"}, {"rating": 3.0, "review": "Connectivity is spotty at best even though our wireless router is right next to the TV where the Fire TV stick is being used. This seems a bit more complicated to use than the Roku I have. The remote barely works - there's a huge delay between when a button is pressed and when the action is executed. I guess that's also related to the connectivity issue. I guess it's just not as intuitive as I'd like it to be. It was a good purchase for what I paid, but price doesn't mean much if the item itself doesn't function wellI've only used it for about 2 weeks now, so I'll revise my review if things get better.", "verified": true, "helpfulness": "1/1", "author": "Sarah"}, {"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "Cynthia Cooper"}, {"rating": 5.0, "review": "Very easy to use. Lighting fast", "verified": true, "helpfulness": "0/0", "author": "Michael B."}]