[{"rating": 5.0, "review": "Was definitely worth the wait. We got 2 of them. Easy to install and have worked very well. Amazon prime is a must with these. Lots of great movies and tv shows on demand.", "verified": true, "helpfulness": "0/0", "author": "gary"}, {"rating": 5.0, "review": "Great device worked great!", "verified": true, "helpfulness": "0/0", "author": "SamuelDuke"}, {"rating": 3.0, "review": "I wanted to love the Fire TV stick but continued to have issues. The price and concept are great but I always had trouble getting a solid internet connection. I intended to use this primarily for Netflix, Prime Instant Video and Pandora/Spotify. Watching Netflix was always the most difficult - audio and video never matched, I can't stand that! It would constantly go out in the middle of a show and I would have to wait for it to load again. It always got stuck at 25% and held there for a minute or so before fully loading. Then it would happen all over again in 5-10 minutes. I switched to watch Netflix on our Blu-Ray player and never had an issue so I know it wasn't an internet problem. Also had trouble with Pandora. It would take forever to load the app and start playing music. Once playing it typically worked fine but at times I would experience a long pause between songs.I decided to purchase this instead of a Roku or AppleTV because of all of the great reviews. So maybe I just got a faulty device but I sadly had to return it.", "verified": false, "helpfulness": "0/0", "author": "wisso47"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "Love  it", "verified": true, "helpfulness": "0/0", "author": "Quentin"}, {"rating": 5.0, "review": "This little stick does all that I hoped it would do which is provided easy access to Amazon Prime videos and Netflix. I know it does more like games and such but I couldn't be happier with how I've be able to use it in this past week since hooking it up to my SONY TV! I highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "nmiller"}, {"rating": 4.0, "review": "Order was on B/O for a while, but it was shipped as soon as it was in.", "verified": true, "helpfulness": "0/0", "author": "Mary Tataryan"}, {"rating": 4.0, "review": "It still has to download maybe 2 times during a 1 hr show, even with the wireless router in the same room, but it's still better then when I was using a blue-ray dvd player.", "verified": true, "helpfulness": "0/0", "author": "ed miller"}, {"rating": 5.0, "review": "Fast n Easy hookup great product", "verified": true, "helpfulness": "0/0", "author": "Randy Lee Amrein \"Red\""}, {"rating": 5.0, "review": "I find it very easy to use, however the remote could be a little larger for larger hands.", "verified": true, "helpfulness": "0/0", "author": "Ruth Habich"}]