[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Exactly what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Donald R. Skinner"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Brent Garland"}, {"rating": 5.0, "review": "Cool new device. Works smoothly but the parental controls need to be fine tuned for user friendliness. They are not very customizable and flexible.", "verified": true, "helpfulness": "0/0", "author": "Sam Babbitt"}, {"rating": 4.0, "review": "While I do like it, I wish you could have more than one user profile stored on the device. It's a bit annoying when a roommate wants to switch to his account, and we have to un-enroll the preexisting account. It also lost my Netflix settings a couple times. :(", "verified": false, "helpfulness": "0/0", "author": "Jimbo"}, {"rating": 5.0, "review": "It does everything I wanted it to do!", "verified": true, "helpfulness": "0/0", "author": "Jennifer M. Hembree \"jenny\""}, {"rating": 5.0, "review": "Awesome. Fast. Used everything and this is top notch. Like apple TV but 1/4th the cost and maybe smoother. Supports xbmc as well. Get one hands down period.", "verified": true, "helpfulness": "0/0", "author": "Grant Rummel"}, {"rating": 5.0, "review": "Love it, so easy to install and setup.  Now I can use my Prime on my main TV.  In the past I was accessing Prime through my Samsung Blu-Ray player in my bedroom which was not as useful as accessing it in my Great Room on our largest TV.  We had tried Google Chromecast in the past but had too many installation problems, Fire Stick seems much easier and a better product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Cruiser\""}, {"rating": 5.0, "review": "Works just as good as the more expensive Fire TV.  The only down side I noticed is it doesn't come with the voice search remote.  Great product and good value.", "verified": false, "helpfulness": "0/0", "author": "Elijah L. Scott \"Eli\""}, {"rating": 5.0, "review": "Awesome! I love this and use it everyday. I no longer have a cable bill and use this to watch Netflix, Hulu, and Amazon Prime video.", "verified": true, "helpfulness": "0/0", "author": "Boardwalksailir"}]