[{"rating": 5.0, "review": "This was a great buy.  I have a chromecast and have been using it for about 6 months, and noticed some issues right from the start that i didnt like. The Fire TV stick Is much easier to use, faster, and comes with a remote.  Some may not like another remote, but its critical in my opinion.  The Chromecast constantly disconnected from my phone(android) and ipad.  I would start watching and set my device down, then i would try to control the chromecast later, to pause video, turn it off, etc, and i would not be able to reconnect.  I would constantly take 2-10 minutes trying to take control of the chomecast again.  Very annoying.  The Fire Tv stick has not had this issue, even when using my devices as remotes.  I love it, and i would highly recommend it over the chromecast.  There is one thing that i find a bit confusing: When navigating the screens, you will swipe( if using your phone/tablet) to move to then next selection, but it moves in the opposite direction as would expect.  Example:  when swiping left on ipad/android, the list of icons/homescreen moves to the left.  But when doing the same swipe on your device when using the Fire TV stick, the icons move to the right.  Certainly not a deal-breaker.  Overall, well done, Amazon, well done.", "verified": true, "helpfulness": "0/0", "author": "Sandouble"}, {"rating": 1.0, "review": "doesn't work, will be returning it", "verified": true, "helpfulness": "0/2", "author": "Peggy"}, {"rating": 5.0, "review": "Simply awesome!", "verified": true, "helpfulness": "0/0", "author": "Michelle Bengen"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "max"}, {"rating": 4.0, "review": "It works pretty well, but it freezes up on me from time to time while I'm watching Netflix. That could also be from my Internet connection, so take it with a grain of salt.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "There's a lot to like about the Fire Stick - from watching old TV from the 50's on a big screen TV, to the CBS news feed, and especially how easy it is to set up. Occasionally however, in spite of the fact that I have an extra high speed DSL connection the Fire Stick can be outrun by the stream coming down and the wait icon ( a rotating circle) shows up. About 50% of those pauses turn into a broken connection and I am treated to a message informing me I have to have an internet connection. Mildly irritating, but my ISP probably is causing those hiccups. The solution is really simple: Just reboot the fire stick.So I press the reconnect button and all is well - wait, there is no reconnect button.So I press the reboot button and all is well - wait, there is no reboot button, either.So I haul my sorry (and crippled) self across the living room and perform a hard boot, by unplugging and replugging the fire stick receiver. Within a few seconds I am facing my home screen and can reselect whatever I was watching.", "verified": true, "helpfulness": "0/0", "author": "JonO"}, {"rating": 1.0, "review": "Keeps dropping the wifi!!", "verified": true, "helpfulness": "0/1", "author": "Peipooch"}, {"rating": 4.0, "review": "I absolutely love it. It is very Amazon prime orientated - so if you are a netflix only kinda person - you just have to click on the app. For Amazon stuff its all laid out on the screen from the get go. Also - the picture is way better than roku lt which is what this replaced. It has a screen saver that comes on that is really nice. Only reason Im giving it 4 instead of 5 stars is there isn't an remote app for iOS yet & the fast forward & rewind can be kind of clunky to figure out. I accidentAlly have hit it & its rewinding down in the corner & there isn't a way to cancel it. I'm guessing this will just be something that comes to me after a few good binge sessions. Oh - and it comes with a power cord - wasn't expecting that. I know the Google stick thing doesn't have a cord. I don't mind - but it caught me by surprise I guess.", "verified": true, "helpfulness": "0/0", "author": "mstaralynn"}, {"rating": 5.0, "review": "I'm in love with this purchase!! I am an amazon addict love low price and their products, with this my son can enjoy watching all his favorite tv shows and I can control it too. Way better than google chrome!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Overall met my expectations so far.", "verified": true, "helpfulness": "0/0", "author": "Esther Aguilar"}]