[{"rating": 5.0, "review": "Lots of fun old stuff to watch on TV with this firestick!  Most of the TV we had to watch before was insulting and gross.  Now we can find old series' and great old movies to watch!", "verified": true, "helpfulness": "0/0", "author": "Gregory J Gempler"}, {"rating": 3.0, "review": "The price is fair for the picture quality", "verified": true, "helpfulness": "0/0", "author": "Chauncey"}, {"rating": 5.0, "review": "Works as stated and very pleased with the service and selections", "verified": true, "helpfulness": "0/0", "author": "Joe Matsuki"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "ricot"}, {"rating": 5.0, "review": "Works great.easy to install", "verified": true, "helpfulness": "0/0", "author": "Tom Boggs"}, {"rating": 4.0, "review": "My only real gripe is that it forces you to watch a roughly 5 minute long introductory video every time the device is registered, and that seems to happen any time they push new firmware to it.  The firmware update erases all settings, so you have to re-connect to your Wifi, re-enter your Amazon account credentials, then watch the same annoying 5 minute long video before you can actually start doing anything with it.  They really should allow you to skip that video, but none of the buttons on the remote let you do anything other than go back and log into a different Amazon account and then start watching the video again.Whenever that video starts I just mute my TV and leave for a few minutes.  But it's kind of annoying to even have to do that...", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "This thing is awesome. I have had it for a couple weeks now and I am still finding new things to do with it. The Fire TV Stick has opened up a whole new area of t.v. viewing, even better than the Google Chromecast, which I also have.I highly recommend this to everyone. it is easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "J. Tanner"}, {"rating": 1.0, "review": "Artificial layer because of their own software to access the internet and a lot of bloatware paid apps. Home menu is loaded with advertising for their prime movies, I am looking to the root the fire stick to just have chrome on it. Returned item.", "verified": true, "helpfulness": "1/1", "author": "Richard L. Russell \"FIDE mastah\""}, {"rating": 5.0, "review": "Excellent.  It was very easy to install and use and start viewing.  We are now hooked on web delivered TV.  The only negative is that the remote is pure black without any backlight, so you have to get to know the buttons in order to use it in the dark.", "verified": true, "helpfulness": "0/0", "author": "Elving Garcia"}, {"rating": 5.0, "review": "Love everything about it!", "verified": true, "helpfulness": "0/0", "author": "Molly Anderson"}]