[{"rating": 3.0, "review": "So far I've watched some Amazon Prime offerings and one on Netflix.  It opens readily, as do the various programs, but it the streaming is a little herky-jerky.  It's not the smooth streaming I've come to enjoy on my Chromecast device.  This is surprising considering Fire Stick's larger capacity and that it's used on a TV located next to the router (the Chromecast is used on a TV located on another floor).  At least I don't have to watch Amazon programming on my laptop anymore.", "verified": true, "helpfulness": "0/0", "author": "J. Arntz"}, {"rating": 5.0, "review": "It's working out great.", "verified": true, "helpfulness": "0/0", "author": "DENNIS  E  MARQUEZ"}, {"rating": 3.0, "review": "The first time I used my Fire Stick it worked beautifully. Unfortunately I have been unable to get it to work on the same TV again. It will not connect to my WiFi again. My Chromecast Stick and other devices work fine. It works on the bedroom TV which is closer to my modem. When it is working it looks great.", "verified": true, "helpfulness": "0/0", "author": "Lynn"}, {"rating": 5.0, "review": "Actually it is better then I expected", "verified": true, "helpfulness": "0/0", "author": "al sellitto"}, {"rating": 5.0, "review": "This thing is awesome", "verified": true, "helpfulness": "0/1", "author": "Keith stocker"}, {"rating": 4.0, "review": "There are still apps we can't get without having a service provider such as Disney XD and Watch ESPN.  The whole reason we got the fire stick is because we did away with a service provider.  I don't think that was explained as well as it should have been.", "verified": true, "helpfulness": "0/0", "author": "JBK"}, {"rating": 3.0, "review": "I think I like it, but unfortunately it would work on my TV.", "verified": true, "helpfulness": "0/1", "author": "GEORGE TEABO"}, {"rating": 4.0, "review": "Works just as advertised.  Now why did I buy an Apple TV?  I forget.", "verified": true, "helpfulness": "0/0", "author": "Ken K"}, {"rating": 5.0, "review": "Exceptional!!! Allows for so much versatility.", "verified": true, "helpfulness": "0/0", "author": "Debra Sheridan"}, {"rating": 5.0, "review": "UPDATE WITH A HELP: After an update of the device, I experienced a problem in that I had to log in with email id and password each time I entered Netflix.  Solution I learned from Netflix.  Go to settings... then to applications.... then find Netflix.  \"CLEAR DATA\"  and \"CLEAR CACHE\".  This will cause you to have to enter id and pswd one more time, but the Fire TV Stick will remember now keep you logged in.We received this as a gift from our son.  It is for use in our RV which is our full-time home for now.  We have satellite service, but frequently trees will interfere with reception.  In these times, we sometimes use our laptop to stream programs, but this can be awkward not having a remote etc.  With the fire stick, there is a quick setup, and very reliable operation. Once you setup the device, it works rapidly upon activation.  We have a Netflix account and also like to watch videos on youTube.  When one scans the icons under apps, you will not find youTube.  However, all one has to do is search for the app and it will come up. Another plus is that the Fire Stick updates its software automatically.  Our fire stick was purchased at the introductory price of $19.95, and at that price it is a 'no-brainer'.  It would be worth the current $39.00 to us as we currently make use of it.", "verified": true, "helpfulness": "0/0", "author": "A. Longo \"SanFelipeTX_apl\""}]