[{"rating": 5.0, "review": "Worth my 20$.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "A great and affordable way to watch Amazon Prime instant video.  Because AppleTV and iOS do not play Prime Video, this was a much cheaper alternative to the original FireTV.", "verified": true, "helpfulness": "0/0", "author": "Spencer Ray"}, {"rating": 5.0, "review": "Wow.  This is a great product.  I have used my Fire TV Stick to watch content from Amazon, and also from Netflix.  I was concerned that there would be buffering issues due to the size of the stick, but there have been no such issues.  For this price, I couldn't be happier with the performance of the Fire TV Stick.  I am excited that there is finally an ios App for the remote, but haven't had a chance to use it yet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"shando98\""}, {"rating": 4.0, "review": "Easy to install.  I already have a Roku 3 on the TV set upstairs, and an Apple 100 on the downstairs TV set.  This Fire Stick will replace the Roku for testing purposes.  Excellent so far but seems not to have as many apps as the Roku.", "verified": true, "helpfulness": "0/0", "author": "Bubba Cash"}, {"rating": 4.0, "review": "It's early days for the Fire TV Stick, so sometimes connectivity isn't all it should be, but Amazon will surely be making improvements to reliability and function as the weeks and months and years pass. There's a world of free entertainment here after you make the initial investment, and it'll bring you a vast array of programs you never dreamed of. You can also choose to pay for the newest and most popular programs, but there's so much to watch for free that I'm almost never tempted to shell out. The set-up is pretty amazing--invasive technology in the best sense of the word. The TV Stick immediately learns from your Amazon account how to charge you for pay-on-demand, and of course as the days pass it learns more and more about your preferences, etc. I won't go into the details of how it creates slide shows of your favorite photos and plays your favorite music, but these functions work remarkably well, giving you the most impressive way to view and listen. Have fun!", "verified": true, "helpfulness": "0/0", "author": "Larry Hedrick \"Larry R Hedrick\""}, {"rating": 5.0, "review": "Just wish it had laptop bluetooth streaming available.", "verified": true, "helpfulness": "0/0", "author": "Lloyd E. Collins \"LECbmw\""}, {"rating": 2.0, "review": "I have a smart TV that streams video in HD quality.  I tried the fire TV stick and could only get low quality standard definition.  Maybe I wasn't operating it correctly but there is little to no instrucitons.", "verified": true, "helpfulness": "1/2", "author": "S. Treseder \"videoman\""}, {"rating": 5.0, "review": "Easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "Sami"}, {"rating": 3.0, "review": "Not working or my network?? Watched 2 movies then won't connect", "verified": true, "helpfulness": "0/0", "author": "Debra Larsen"}, {"rating": 2.0, "review": "Buttons stick on remote they arnt stuck physically im guessing its something wireless also the wifi keeps saying connected with problems not allowing me to load anything", "verified": true, "helpfulness": "0/1", "author": "Jeffrey Payne"}]