[{"rating": 3.0, "review": "I was able to get this for $19 so no real complaints. It works fast and smooth andbhas great picture quality with the tvs it works on. that being said, my main tv is a 50\" samsung dlp and it will not work. Says not supported mode and thats a bummer for me. Also the hdmi plug doesn't seem to be exactly standard because it would not fit into 2 of my tvs. I tried for 15 minutes to plug this thing in and even spun the tv around. i compared it to an hdmi cord that plugs right in and the slot inside the fire stick where the terminals are is slightly smaller.  The extension it came with is similiar but i was able to get it in after almost breaking the hdmi slot on my tv. after all that it works great and on my other tvs it plugs right in. I want to give this 5 stars because the software is nice and easy to use. Ive not had a single slow down or buffer issue and it loads movies so fast. i just cant because of the compatibility issues ive had.  So to sum it up i have a 7yo Samsung dlp it will not work with and had a very hard time plugging in. i have a 3yo insignia plasma with the same plug issue but it does work after forcing it in. And i have three 32\" samsung leds about a year old that plug in fine and work also. So it seems that older tvs have the issues and thats sad because most newer tvs are smart withs apps and you really wouldn't need this for those.", "verified": false, "helpfulness": "0/0", "author": "starlord"}, {"rating": 5.0, "review": "Works great, easy to install.  Love it with my prime music.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really great product, easy to setup easy to use, now if I can just it it away from my kids so I can explore some more!!!", "verified": true, "helpfulness": "1/1", "author": "Keith A. Richmond"}, {"rating": 5.0, "review": "Amazing product from Amazon, love it!", "verified": true, "helpfulness": "1/1", "author": "Kathar"}, {"rating": 5.0, "review": "So far I have really enjoyed the Fire TV Stick.  I have been able to watch several movies and TV shows via Prime on my TV.", "verified": true, "helpfulness": "1/1", "author": "GMR"}, {"rating": 5.0, "review": "This product is terrific.  We love the original programming and also the App lets you do voice searched which is great.The only problem is that I thought I ordered two but only one came.  Something must have gone wrong with my order submission.  I would still like another one for my beach house.", "verified": true, "helpfulness": "1/1", "author": "tom c woodruff"}, {"rating": 4.0, "review": "this was a surprise for me when hdmicec worked fully on my Sony kdl520r model, I had to enable it in TV.... huge convenience.....not at all work like chromecast, dial protocol is not supportedw8 desktop chrome browser can't share screen like chromecastI use chromecast for total streaming using dial protocol, appletv and Xbox for usual streaming, xbmc for local movies and videosnow if windows miracast support started working that would be awesome....", "verified": true, "helpfulness": "0/2", "author": "Prakash Heda \"Prakash\""}, {"rating": 1.0, "review": "Same results with two different fire TV sticks:1) if it is a stick why does it require power? With the TV mounted on the wall there is not extra power available. Poor planning2) I attached it to my HDMI switch and after 6 minutes it over heats and the sound skips and the screen is filled with multi color static.If you have power make it a box. If you don't need power use a stick. For now my Roku is far superior.", "verified": true, "helpfulness": "2/10", "author": "Steve Reasner"}, {"rating": 1.0, "review": "Good interface .. easy to use .. WiFi connection doesnt work even when close to router ..giving it back", "verified": true, "helpfulness": "3/8", "author": "Anu"}, {"rating": 4.0, "review": "The packaging was really nice. Plex works well. I wish I could create a shortcut to browse Anime, and sub genres within Anime, but at least a search will show me stuff to browse through. I think if I could add such a thing, it would be a 5 star product. I also hope crunchyroll adds support soon.I pre-ordered mine at a steal of a price and now that I've tried it, I sort of regret not buying the second one I could have at half price.", "verified": true, "helpfulness": "0/0", "author": "NBMTX"}]