[{"rating": 5.0, "review": "SIMPLE TO USE PLUS YOU CAN CONTROL ON IPHONE OR IPAD", "verified": true, "helpfulness": "0/0", "author": "rl"}, {"rating": 5.0, "review": "Great product.  Easy to use..", "verified": true, "helpfulness": "0/0", "author": "judy irwin"}, {"rating": 5.0, "review": "Great product and price.", "verified": true, "helpfulness": "0/0", "author": "Jorge Cantu"}, {"rating": 2.0, "review": "Lacks a lot of features. Roku still leads the market and is much better at this point", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "A big part of the puzzle is the distance between the Fire Stick and the wireless router. A weak signal due to distance will cause delays and excess spooling. It may stop working altogether if the signal dips below its threshold. Long story short, sometimes it works, sometimes it don't. Its all about location.", "verified": true, "helpfulness": "0/0", "author": "Wiltongrizzly"}, {"rating": 5.0, "review": "we really like how easy everything went setting up the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Shane Martin"}, {"rating": 5.0, "review": "I love it, I going to get another one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Sheryl White"}, {"rating": 4.0, "review": "Works ok.  Main complaint, WAY under-documented initially.  Simple as 1-2-3 the only enclosed instructions say.  NOT. The remote has no words on it, only some obscure buttons and a big dial which doesn't even have any symbols on it.  At least they sent an email along with it, which was not helpful itself, but did point me to a manual I could download.  Even at that it took some digging to figure out how the big dial worked, and that was pretty much the key to it all.", "verified": true, "helpfulness": "0/0", "author": "ralanc"}, {"rating": 2.0, "review": "The idea behind this device is great but, it has a lot of tech issues.", "verified": true, "helpfulness": "0/0", "author": "Theresa A. Voigt"}, {"rating": 4.0, "review": "I Love It!  My only issue is searching for a movie.", "verified": true, "helpfulness": "0/0", "author": "Sonya Finley"}]