[{"rating": 5.0, "review": "I love the ability to never have to pay for cable again.  And it's pretty darn easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Day one: came home at 9:45 and by 9:48 was already watching netflixDay two 845 AM: I returned my GoogleChomecast to Bestbuy.Day three: I ordered Amazon Fire TV and Fire remote", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "This product is the best; all the perks of a smart TV in a small portable stick! I tried Chromecast (Google) first and there is no comparison! The Chromecast has a single bandwidth whereas the Fire TV stick as dual... please not waste your time for a few dollars less... Fire TV stick is the way to go!  I will be ordering another Fire TV stick- everyone in my household LOVES this product! Good job Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer SZ"}, {"rating": 5.0, "review": "This small sea shell sized device is just the coolest thing! I have gone through quite a few little Android streaming devices. This one by far works the best. I have also tried some higher end media streamers as well. I won't say that this works better but but it does hold it's own. You can side load apps such like Kodi as I did that lets you can stream near anything you want along with the built in apps on the stick. I also paired a mini blue tooth keyboard to make searching on the device simpler. I think I am going to get another plus a Fire TV I like it so much.", "verified": true, "helpfulness": "0/0", "author": "S. Skolout"}, {"rating": 4.0, "review": "This is a pretty great little streaming device. As far as performance I'd say it is better than the Chromecast and not quite as good as the Roku 3. The Interface is real sharp and works great and the remote works well as well. I couldn't quite give it five stars since it has frozen and bugged out a few more times than the other streaming devices I own, but it still works well a very large amount of the time.", "verified": true, "helpfulness": "0/0", "author": "Joseph Hawkes-cates"}, {"rating": 1.0, "review": "Set up was confusing. Even though I have a amazon prime sigh in, it didn't work. Had to use a trial sigh-in to start using it. Went on the website, and that was more confusing. I've used Roku, and that was a breeze.  The product didn't come for a month.", "verified": true, "helpfulness": "0/1", "author": "Christine"}, {"rating": 5.0, "review": "The Fire Stick is very easy to use. We are not very tecki and we were able to get it set up right away. We love it! It makes selection of movies and TV very easy. I highly recomend it.", "verified": true, "helpfulness": "0/0", "author": "DjBessett"}, {"rating": 3.0, "review": "Bought it at the promo price and am happy with it for that price.For about a month I went back and forth between this and the Roku LT I already had.  Right now I'm running the Roku.If this was my only device I'd use it no problem.  But the Roku remote is a delight and is not (stock) limited to the Amazon Appstore.", "verified": true, "helpfulness": "0/0", "author": "FraterMus \"FraterMus\""}, {"rating": 3.0, "review": "Very nice for an introduction to streaming, but for the serious cord cutter (person who drops cable ) I would have to go with ROKU for its channel options.  Still, Amazon is catching up and is better in response time than the other \"sticks\" out there.", "verified": true, "helpfulness": "0/0", "author": "J.H.T."}, {"rating": 3.0, "review": "As much as I like to watch amazon video and play games, this is truly inconvenient in terms of connecting my android tablet. It failed multiple times even I followed the instruction to connect. I have NO WAY to use TV mirror my tablet or phone.  The menu design is OK.  I wish it has built-in keyboard so can type to search.The set up is easy, and it is convenient to use. Just wish the connection with tablet can be really delivered as promised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Cherry\""}]