[{"rating": 5.0, "review": "Great Stuff could not be more happier.  The remote is a great asset.", "verified": true, "helpfulness": "0/0", "author": "ProvencherRJ"}, {"rating": 5.0, "review": "I have 2 hdmi slots on the back of my tv.  Will the fire TV stick work this way?", "verified": false, "helpfulness": "0/0", "author": "Jill Torpey"}, {"rating": 5.0, "review": "Love it easy to use.  It may be my down fall a lot things I have missed on the subscription channels that are available.", "verified": true, "helpfulness": "0/0", "author": "grammashouse"}, {"rating": 1.0, "review": "Bought 3 from Staples as gifts under the apparently 'false' pretense that with this device anyone with a Win 8 pc (that has Miracast, an image streaming standard) could mirror their pc monitor. Miracast is a wireless image streaming standard, advertising it in the product marketing gives the mistaken impression that it should work with other Miracast devices in the same manner that a WiFi certified device would be expected to work with other WiFi certified devices. Apparently not. Avoid this device if display mirroring is a useful feature you'd expect to use with a device like this, get a ChromeCast, Roku 3, Roku Stick or Apple TV instead, all have better display mirroring capabilities and cost about the same.", "verified": false, "helpfulness": "0/0", "author": "A. R. Torres \"ARTIV\""}, {"rating": 5.0, "review": "Just as advertised - very easy to set up and use. Very clear and easy to understand. I did have to unplug it and plug it back in to get started, but other than that, it was very simple! I like it a lot!", "verified": true, "helpfulness": "0/0", "author": "Cody L. Kuenzi"}, {"rating": 2.0, "review": "When it works I like it, but it takes several minutes (literally) to decide to connect to my internet to use the Fire Stick.  In contrast, my very old Roku Box has no problems connecting to the internet right away.  As a result, I frequently use the Roku instead.", "verified": true, "helpfulness": "0/1", "author": "rebecca taylor"}, {"rating": 4.0, "review": "Works very well especially if you subscribe to Amazon Prime. Little disappointed in the power cord that came with the stick. I have ordered a cord that is powered by the TV USB so obedient have a cord coming from my wall mount.", "verified": true, "helpfulness": "0/0", "author": "Leonard L. Isaacs"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Andrew Davis"}, {"rating": 5.0, "review": "Had problem connecting on the first try, but a call to customer service was very prompt and very helpful.  I turned out that the HDMI 1 on my TV was not functional.  I got it to another HDMI and it has worked fine.  I do have a little problem when I choose that HDMI port with my TV remote.  When I then pick up the Fire Stick remote and click OK, the input returns to Cable and I have to repeat the process.  It works fine the second time.  I may be doing something wrong or my TV may be the problem.  No big deal.  The Prime programing is free and I am finding new things to watch.", "verified": true, "helpfulness": "0/0", "author": "N. Haynes \"Outdoor Pal\""}, {"rating": 4.0, "review": "My primary interest in the Fire TV Stick was to view YouTube videos. So far, I am pretty disappointed. First of all, searching YouTube from the YouTube Fire Stick App is horrible. In fact, it suggests searching from your mobile device and pairing that device. Did that, but even though the device connects, it won't play the YouTube video (connected to Xoom 2 or Samsung Avant).Secondly, I attempted to mirror the screen on my Samsung Avant and my Samsung 12.2 tablet. Both devices are new and offer screen mirroring. Was only successful one time. Other times, the Fire Stick TV reports it is mirroring to the device, but never shows the device screen and eventually shuts Fire Stick mirroring off.UPDATE 6/13/2015: WIth latest firmware update AND my tablet upgrade to Lollipop, mirroring (for the most part) works. I say for the most part as it drops audio periodically. NEW ISSUE:. Using the YouTube app on the Fire TV Stick, I can only access the most recent 30 of my 180 YouTube uploads. That's pretty aggravating. Where are the other 120? I can find them on my desktop or tablet in YouTube.", "verified": true, "helpfulness": "0/0", "author": "Buzzard #1"}]