[{"rating": 4.0, "review": "I like the fact that I can use Netfilix, Amazon Prime and Hulu Plus.  The only thing I do not like is the price of the videos that must be purchased when not available on the aforementioned providers.  Even old movies are over $3.00.  Don't see why a movie like Home Alone should cost more that a buck.On the plus side, it works very well and the remote is much more responsive than the one on my BluRay player .I can also use my smartphone as a remote complete with voice recognition commands.", "verified": true, "helpfulness": "0/0", "author": "Mark S. Batchelor \"marksman\""}, {"rating": 5.0, "review": "Got mine fromBestBuy for $24.99.Has almost all the apps you need except crunchyroll you will need to use the developer options to install the apk from the Google App Store. It works fine but its not officially supported but controller works fine.", "verified": true, "helpfulness": "0/0", "author": "Knight Cat"}, {"rating": 2.0, "review": "Wow, that was frustrating. Ordered two Amazon Fire Sticks. Figured I'd keep one and give the other as a present.The first.. was really tight in getting into and out of the HDMI jack. Once plugged in, I got the start up screen, and input my Hulu, Netflix, etc info. But there was flicker and static intermittently. Thought the stick might be loose or need a different cable. Nope. Same thing. Watched some shows on Hulu, and dealt with the flicker. Very annoying. From what I saw and played with, the picture quality (when it came in) was good (compared to AppleTV/Roku), and the interface was fine.This morning, I unplugged everything to move cables around, and the problem was now worse, but my Roku, blu-ray player, and DirecTV connections were fine. Alright, lets try the second stick...Same thing. If not worse. Just like the old days in trying to watch a far away station (Mars?) with rabbit ear antennae.Will try playing with the units again, but it's looking like I'm going to send them back. These two units may be a from a bad batch, but they're more headache than pleasure.UPDATE: I should mention that my studio/office TV is a Samsung with only one HDMI jack, and I use a Monoprice HDMI switcher to go from TV to blu/dvd to Roku. Maybe the FireTV Stick doesn't like the HDMI switcher? Or my Samsung TV? Everything else plays fine.This evening I jiggled the stick & cables a bit and was able to watch an episode of Constantine on Hulu, with only some glitches in the first few minutes of the episode. Then, I thought it was time to try the stick on the downstairs TV.The downstairs set is a older Panasonic plasma. I unplug the AppleTV and insert the FireTV stick (with extension. Without the extension, it was a bitch to get in (and I never did!) Even in the back of the set, and in the dark, I can plug the other stuff in, but not that Amazon stick! Anyway, it was in with the extension, and... nothing. No picture, no nothing. And yes, it was plugged into the power cord. OK, lets try a different HDMI jack. Same thing. Tight fit. Needs extension. And... Nothing. No picture.I'm confused. I give up. Let's just plug the Apple TV back in, 'cause, it just works.", "verified": true, "helpfulness": "25/26", "author": "Bolshoi Kniga"}, {"rating": 5.0, "review": "I received this week.  It is easy to install and works great.  I also installed u-tube on it.  The only problem is the search is slow to use if you don't have something else to use.  The only thing to temember is to plug it into a 110 power source instead of the port on the back of your tv.", "verified": true, "helpfulness": "0/0", "author": "Ronnie"}, {"rating": 4.0, "review": "Awesome, I know can watch all my prime video and Netflix anywhere I can get wireless and the TV has HDMI outlet. Just be aware that most of the games you can download won't work on the stick as they have been developed for prime TV but the couple I could play were fun.", "verified": true, "helpfulness": "0/1", "author": "Brandi Bowman"}, {"rating": 5.0, "review": "I have no complaints. It's a great way for me to have access to a lot of the streamimg media that I use (Netflix, Pandora, my Amazon music, my Amazon watchlist)... it's all in one placeAnd? It's easy to use.", "verified": true, "helpfulness": "0/0", "author": "PixieSmash"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "georgia morgan castro"}, {"rating": 5.0, "review": "It was so easy; plug it in, walk through set up, and in 15 minutes I was watching movies in my guest room. I have Apple TV in the living room and wanted my visitors to be able to watch streaming movies. After doing some research decided to try the Fire Stick. I am so glad I did.A fraction of the cost of Apple and unlike Google's Chrome TV this comes with a remote. WINNING !!!", "verified": true, "helpfulness": "0/0", "author": "Lees Canvas \"Babs\""}, {"rating": 1.0, "review": "After more than half an hour. I cannot get it to connect. First I had connected the power USB cable to the power on my TV, the same way I have it with my Google ChromeCast. The device just boot between the white amazon logo and the fire stick tv logo in an infinite loop. Then I plug the USB to the wall with the charger adapter and then it boot up. Then put it the password, once, twice, failed. Same password I used before. Third time it accepted it. Started to download software update. Wait what? software update? I'm getting this on release date. Anyway software update failed. Reboot everything by unplugging the stick. Then somehow my comcast router is messed up. So I had to restart my comcast router. Then after I got my internet back on, and verified network is good from my laptop, I try to put in my password on the fire stick tv again, still failed. That's it, I'm returning it!", "verified": true, "helpfulness": "0/0", "author": "Leo Kwong"}, {"rating": 5.0, "review": "Love the Fire Stick.  Works great.  The Android app is pretty good (voice search works okay).  Overall very happy with the purchase, great way to turn any t.v. into a smart t.v..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]