[{"rating": 4.0, "review": "Love it... Only issue is it pops up commercials right in the middle of shows.  Can't fast forward thru them. Can be annoying.", "verified": true, "helpfulness": "0/1", "author": "Collin L. Rawles"}, {"rating": 4.0, "review": "If you don't have a smart tv you need this! It's great to watch Netflix and other great apps such as pandora to listen to music from your tv. It's easy to install and easy to use. Shipped faster than expected!", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "What an amazing little plug. I just can't figure out how they get all those movies and TV shows into such a little thing.Seriously, we recently cut the cord on Dish. Enough of the high prices for a lot of channels we never watched. We got an antennae for local and national broadcasts. We have Netflix. Signed up for Amazon Prime and got the Fire Stick. Pro-rating the cost of Prime and the Stick for 12 months and Neflix the costs is about $20.00/month. At that price we can splurge and rent a movie or two (although it will take me years to watch the free Prime offerings) and still be saving over $40/month.As for the Fire Stick, it's a no-brainer, especially if you have Prime. A no-brainer to install and a no-brainer to use. We bought one to begin with but ended up buying another. Although simple enough to switch from TV to TV, it was so popular with all the family members that I became tired of the  pouts when I exercised my maternal rights to control over the remote.We love it.", "verified": true, "helpfulness": "1/1", "author": "Granny K"}, {"rating": 3.0, "review": "Easy set up and instructions, works well with my tv.", "verified": true, "helpfulness": "0/0", "author": "Chelsea Sadler"}, {"rating": 5.0, "review": "Small and convenient, easy to use just plug in your tv hdmi. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 4.0, "review": "I enjoy it, the two things I don't like are the fact that the USB plug is in the back of my TV, therefore the remote does not respond to it.  I have to get up and point it around the TV.  I also think the remote itself is awkward and could be easier to use.  The concept of the Fire TV Stick is great.", "verified": false, "helpfulness": "0/0", "author": "vs.cramer"}, {"rating": 5.0, "review": "Works as advertised. Well done", "verified": true, "helpfulness": "0/0", "author": "charles goohs"}, {"rating": 5.0, "review": "Love it.  Very easy to use and easy to set up", "verified": true, "helpfulness": "0/0", "author": "Sean McSwain"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Jcacy"}, {"rating": 5.0, "review": "Great media device!! Works awesome.", "verified": true, "helpfulness": "0/0", "author": "Terry Wilson"}]