[{"rating": 5.0, "review": "Best investment ever!Turned my normal HDTV into a smart tv", "verified": true, "helpfulness": "1/1", "author": "tmhairawy"}, {"rating": 5.0, "review": "This fire stick for TV streamlines movies from your Kindle especially on series.", "verified": true, "helpfulness": "0/0", "author": "Yvonne Allender"}, {"rating": 3.0, "review": "My only complaint is you can search for specific titles in the Netflix and Hulu app. Otherwise we are happy with the firestick.", "verified": true, "helpfulness": "0/0", "author": "Judith McGinty"}, {"rating": 4.0, "review": "Clean interface and works fast.  Performs as well as any of the media streamers. It has most of the popular channels.  The channels not there are worthless anyway.", "verified": true, "helpfulness": "0/0", "author": "Gordon D. Ethridge"}, {"rating": 5.0, "review": "While this is the second streaming device like this that I have used, I bought a Fire TV for another TV first, I must say that I am VERY pleased with it. Easy setup and another device I have not had to teach my wife to use! It was truly easy for her to figure out on her own. Feels a tad bit slower response from the remote than the Fire TV. But still works fine for our kitchen TV.", "verified": true, "helpfulness": "0/0", "author": "onecuwldood"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Miguel Hernandez"}, {"rating": 5.0, "review": "Excellent investment!  Very convenient if you have more than one TV's in different rooms in your house or simply to go...!  The return of investment is guarantee...!", "verified": true, "helpfulness": "0/0", "author": "Reynaldo Torres"}, {"rating": 1.0, "review": "This product doesn't work 90% of the time. I either get the blue screen of death or a message saying there is an error connecting to Netflix. On a good day when I can stream something it buffers every five minutes. It's not a problem with my internet connection as I don't have the issue with my phone or Apple TV. It would be a great product for $40...if it ever worked.", "verified": true, "helpfulness": "1/2", "author": "Jaime Hudeck"}, {"rating": 1.0, "review": "I was really excited to have purchased this item during the Prime member sale for a fraction of the cost. Now I simply wish I had my money back and will go back to my Roku. There were things in the beginning I really liked about this item, but now that we have had this for a couple months any positives have been outweighed. We really liked the Hulu app and that it posted \"New Episodes\" so you don't have to search if a new episode has been posted. The interface itself was relatively easy. The games were a nice addition as well.The cons... We constantly had to sign back into the apps, particularly Disney Junior. Which is a PIA when you have a small child wanting to watch cartoons and you need to log into the computer to sign back into the app. Other apps required a membership, like Spotify or Slacker, when on other interfaces I do not need to have a membership to use the free streaming. Other issue was the Hulu app which is our most used app. It constantly froze the screen and then would continue to play in the background. The only way to get around this was to back out of what we were watching and play it over again. And this would happen throughout the entire episode. We have been Roku users for several years and I never had an issue with streaming on the same televisions I tried this item on. Tried to find some reviews and tech support and came up with very little. Best we got was to reset our device. Have done this several times now. Now the kicker- it no longer works. Will not connect to our internet once we reset it for the last time. Says there is an error and cannot get it to do anything else.Unfortunately, we are past the deadline for returns. I will not recommend this product to anyone. Contacted Amazon and hoping for a resolution.", "verified": true, "helpfulness": "1/3", "author": "Amazon Junkie"}, {"rating": 3.0, "review": "Great to view amazon! Also netflix! It makes you have to use your original tv remote again cause it doesn't have a universal key for it to power it on. so more remotes! .. I had to buy a new modem cause it wasn't compatible with the Netgear one I had .. extra $40 on top of this purchase ! Overall still satisfied!", "verified": true, "helpfulness": "0/0", "author": "Josiah J."}]