[{"rating": 5.0, "review": "Quick, easy set up. Came on time as promised. This will be a lot of fun for the family. Thanks", "verified": true, "helpfulness": "0/0", "author": "Michael Hall"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Douglas Warren"}, {"rating": 1.0, "review": "This highly touted device was extremely disappointing. There are only a few channels that it accesses. It is great if all you want do is watch Netflix, Amazon, and Hulu. But Roku is the same price and offers a greater variety of channels. One of my favorites on Roku is Acorn TV, which is all British shows, but Amazon does not have even this variety. I gave it to my daughter--I have no use for it.", "verified": true, "helpfulness": "0/0", "author": "Jeri Sutton Shores MA"}, {"rating": 4.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "leeann"}, {"rating": 3.0, "review": "Mostly a good gadget. But every time something happens to the internet, I have to reset it, by unplugging it.", "verified": true, "helpfulness": "0/0", "author": "Audrey Allison"}, {"rating": 5.0, "review": "I like everything about the Firestone!", "verified": true, "helpfulness": "0/0", "author": "RENEE"}, {"rating": 5.0, "review": "Life changing. The voice recognition works like a charm", "verified": true, "helpfulness": "0/0", "author": "Deanna Everson"}, {"rating": 5.0, "review": "It is great!!!  The app is perfect for the phone.  Easy search.  We love it!", "verified": true, "helpfulness": "0/0", "author": "E. Lisa Yanike"}, {"rating": 4.0, "review": "The fire stick does hicup once in a while but normally works quite well. Support is great.", "verified": true, "helpfulness": "0/0", "author": "Jerald D. McClain"}, {"rating": 5.0, "review": "For all the people with HULU stuttering issues, the problem is with the stock power adapter. I was able to resolve the issue with both of my fire tv stick's by plugging the power into my XBOX's. It also worked with an standard iphone USB adapter. Not sure if Amazon went cheap on the power blocks or if they are purposely filtering down the 5volts, possibly to extend the life of the device or prevent overheating but it comes at the expense of the sticks performance. I love the firetv stick and would suggest it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Fizzybubbly"}]