[{"rating": 1.0, "review": "Easy setup. Great interface. Easy to navigate. Terrible wifi reception. Bought additional 6' HDMI cord but that slightly helped. Picture was always in standard definition on a HD TV. Terrible picture quality and would disconnect from network with regularity. I returned this garbage.", "verified": true, "helpfulness": "0/0", "author": "W. R. \"Waynier\""}, {"rating": 4.0, "review": "MUCH easier than the Chrome stick.  Very little effort to set up.", "verified": true, "helpfulness": "0/0", "author": "Eva M Kubinski"}, {"rating": 5.0, "review": "First few days with the Fire Tv Stick and I absolutely love it.. I really do. I am so happy I purchased it. I haven't even turned on my cable box since then. Im still trying to figure out the antenna deal..but so far, its great!", "verified": true, "helpfulness": "0/0", "author": "Karmen"}, {"rating": 5.0, "review": "No I am not tech-savvy...and i don't want to log in and out of different providers etc. this is why this is perfect. Everything is in one place. The layout clean. organized. aesthetically pleasing. and super tiny so that it won't be in the way of anything. what's holding you back from purchasing it?I liked it so much that we got one for every tv we have... :)", "verified": false, "helpfulness": "0/0", "author": "msjenny"}, {"rating": 5.0, "review": "Use it over my apple tv all the time. easy and fast to use.", "verified": true, "helpfulness": "0/0", "author": "wes"}, {"rating": 5.0, "review": "Very happy with this purchase .", "verified": true, "helpfulness": "0/0", "author": "Jennifer Wallace"}, {"rating": 5.0, "review": "We're enjoying it! Having no problems streaming Netflix and Amazon Prime. It was easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "mandalyn23"}, {"rating": 3.0, "review": "I like it but there are too many times in which i can't get a stream.", "verified": true, "helpfulness": "0/0", "author": "R. J. Pierre-Louis \"Ree\""}, {"rating": 4.0, "review": "I know that I will enjoy the Amazon Fire TV Stick.  Have not had a chance to use it much, but enough to know I will enjoy using it.  This is one of those things the more you use it, the more you will learn and enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Jean C. Johnson"}, {"rating": 4.0, "review": "The fire stick is working out for me I use it everyday....20", "verified": true, "helpfulness": "0/0", "author": "chris"}]