[{"rating": 1.0, "review": "I cannot even get this to connect to my WIFI. It says cannot connect to amazon.comI have tried everything suggested on help site. Waste of money.", "verified": true, "helpfulness": "1/1", "author": "Kathryn Purcell"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Jessica  Wilson"}, {"rating": 3.0, "review": "I like it well enough; however, it keeps dropping network connection.  I know I'm not the only person experiencing this problem and I wish Amazon would resolve it.  Based on the numerous times I've had to unplug it in the middle of viewing, I'm giving it a rating of three stars.  I think I need to purchase Chromecast.", "verified": true, "helpfulness": "1/1", "author": "mfa"}, {"rating": 2.0, "review": "Fire TV is a great service. My problem is with the hardware. It disconnects from the internet and the only way to reconnect it is to unplug the device and let it reset. I would explore other options that support Prime streaming.", "verified": true, "helpfulness": "1/1", "author": "Charles Bond"}, {"rating": 4.0, "review": "Bought it on the Amazon Prime member deal. Fantastic little piece of hardware. Not full of power, but very well built and easy to use, and gets it done for fifteen bucks. paired it with an ouya controller for gaming and loving it. PLEX runs as well as it does on my Roku. And of course, amazon prime is seamless.", "verified": true, "helpfulness": "0/0", "author": "Chansetheman"}, {"rating": 3.0, "review": "Did not work with my router as it was too far away.", "verified": true, "helpfulness": "0/2", "author": "mlw987 \"mlw987m\""}, {"rating": 4.0, "review": "Cheaper than cable.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really like this! It is very useful! Very worth it", "verified": true, "helpfulness": "0/1", "author": "Brady Witmier"}, {"rating": 5.0, "review": "This is a Great product! I have ordered a second one for my other child. Plays very crisp and can access everything from the Kindle fires we bought two years ago and still use to this day. Amazon customer service is matched by NO other company!", "verified": true, "helpfulness": "0/1", "author": "molly7475869644"}, {"rating": 1.0, "review": "I don't even want to talk about it.", "verified": true, "helpfulness": "2/8", "author": "G. Freeman \"Warrior Supporter\""}]