[{"rating": 1.0, "review": "One thing they forgot to mention...you must have a cable provider account for much of the content.  Don't think you can go cable free with this thing.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is awesome!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "So excited to have this!  What a bargain and now I can watch my amazon prime movies on my tv screen!  Awesome!", "verified": true, "helpfulness": "0/0", "author": "Donna H. Wells"}, {"rating": 4.0, "review": "I really like this portable little stick for Amazon prime.  The only concern I have is the amount of Apps is kind of limited.  Common Apps like VUDU don't seem to be anywhere.  Hoping it's just a matter of time?", "verified": true, "helpfulness": "0/0", "author": "Michael Smith \"Mike\""}, {"rating": 1.0, "review": "I have just started playing with this device and already I have to ask myself \"does this have a purpose\".You can play Amazon Prime but other than that I have found nothing it will do.To use some of the built in stations like Disney or ESPN you have to have a subscription through a provider.  No big deal except Charter Cable is not a valid choice so you can't watch it.I wanted to mirror my Galaxy Note 8 on my TV.  Not possible unless it is the most confusing thing in the world  I bought a cheap cable and that works great but doing it wirelessly to the fire stick not possible.You will find there are no directions with this device on what it can and can't do and Amazon is no help.I guess I can watch my Movies on Flixster but wish they had included VUDU as it is so much better.Luckily I got this as a prime member for 19.00 so I am not out a lot but Amazon really created a device with no use.I have not used other sticks so I cannot compare to them.Update 6/12/2015.  Fire TV Stick still worthless.  Amazon does not support Charter which is one of the top 3 cable providers.  Until they do this stick is worth nothing.  Having paid half price during the initial offering I still feel like amazon bent me over.  Alot of the apps that you can download do not even if they are not Subscription TV related.  Amazon has failed miserably!!!!", "verified": true, "helpfulness": "0/0", "author": "John H. Eickhoff"}, {"rating": 1.0, "review": "I'm so bummed that this didn't work on my TV :( Everything was going well the first week or two I had it (I preordered it when they had the 19 dollar deal), but then my TV began making random a loud buzzing noise intermittently. When the random buzz happened, the picture would also free momentarily. It made watching TV for long periods of time impossible.I confirmed it wasn't my TV (which is what I thought at first) by doing a few tests: I muted my TV and no buzz came from the TV (which it would have, it was the TV) and the picture did not glitch either, I changed the sound settings both on my TV and Fire Stick to see if that might be the problem and that didn't help, and finally I set my old Roku back up and the buzz problem completely stopped.Besides the problem it caused on my TV (a new Insignia LED TV), I really liked the Fire Stick.  I wouldn't be surprised if this is a problem with other TV sets too. Guess I'll go buy the new Roku. Thanks Amazon.", "verified": true, "helpfulness": "2/3", "author": "Lindsey Irish"}, {"rating": 1.0, "review": "Sucks!", "verified": true, "helpfulness": "0/3", "author": "edsal"}, {"rating": 5.0, "review": "This was so easy to set up and a pleasure to use. The price is a huge bonus so i bought 5 more to give away for christmas. The Fire TV app works really also to provide voice control capabilities.", "verified": true, "helpfulness": "0/1", "author": "Zeus"}, {"rating": 3.0, "review": "I like it but I can't get Google, Vodo or Iheart. So we put the fire stick in a bed room and keep our Roku in the family room. But we still love Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jeff Davis"}, {"rating": 2.0, "review": "having some issues trying to connect and stay connected.  for some reason the stick will work on occasion but I have had issues having my PIN verified and I'm not sure why.", "verified": true, "helpfulness": "0/0", "author": "Asif Rahman"}]