[{"rating": 5.0, "review": "I love it. I recently cancelled cable and have been using Amazon Fire TV Stick. I subscribe to Amazon Prime, Hulu and Netflix. I don't miss cable at all. The Fire Stick works well and I rarely have any problems. If  I do run into any problems you easily reset it or contact customer service.", "verified": true, "helpfulness": "0/1", "author": "stephanie murphy"}, {"rating": 1.0, "review": "I hate this. Don't by this, buy yourself a ROKU instead.", "verified": true, "helpfulness": "0/2", "author": "Dan"}, {"rating": 5.0, "review": "The best thing I've spent on Amazon", "verified": true, "helpfulness": "0/1", "author": "Ericka Lewin"}, {"rating": 1.0, "review": "Stick worked out, but unable to use because I am a member on someone else's account. I didn't see anywhere that I had to be a primary account holder to have access to the Fire Stick shows. I had called customer service  (who also did not inform me of this issue) and they were attempting to trouble shoot my account. I ended up with 2 $99 charges on my debit card, had to call back for refunds, and my stick still doesn't work. Overall very unhappy!", "verified": true, "helpfulness": "0/2", "author": "Karley Reeves"}, {"rating": 5.0, "review": "Any idiot can set this up....and I was the idiot to prove it. So THAT'S what 1080 looks like on our HDTV........designed, engineered and packaged as if it was an Apple product!...........high praise indeed!", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "Excellent purchase.  I love it!  This is so much faster than the Roku.", "verified": true, "helpfulness": "0/1", "author": "speedy76"}, {"rating": 5.0, "review": "Very nice item I'm loving it for sure", "verified": true, "helpfulness": "0/1", "author": "Andrea"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "Tami Fields"}, {"rating": 3.0, "review": "great device, awesome apps. able to sideload. I would give it 2 1/2 stars. The constant problem I run into is that it keeps dropping my network. I have bought extenders and repeaters but still no luck. Checked for latest updates and it says that it has it. I also have a Roku stick, never drops the network.", "verified": true, "helpfulness": "0/1", "author": "Kevin"}, {"rating": 5.0, "review": "Super easy to setup - easy access to my Netflix and HBOGo on the tv instead of having to feed it through an Xbox or something.", "verified": true, "helpfulness": "0/1", "author": "M. D. Herback \"HockeyHerb\""}]