[{"rating": 1.0, "review": "Not many free stuff I would watch, renting an episode or show is expensive. Redbox is all you need.", "verified": true, "helpfulness": "0/0", "author": "Trudy Ellis"}, {"rating": 4.0, "review": "Easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Marquita Garmon"}, {"rating": 5.0, "review": "Very fast and reliable", "verified": true, "helpfulness": "0/0", "author": "Manuel Leon"}, {"rating": 5.0, "review": "Works great! I love the added apps and how customizable it is.  Way more functional than the google chromecast. This product is great for your money!", "verified": true, "helpfulness": "0/0", "author": "Sarah Chin"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Giovanna"}, {"rating": 5.0, "review": "Good and not super fast but good enough.", "verified": true, "helpfulness": "0/0", "author": "shane jones"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "Lori Ikemeier"}, {"rating": 5.0, "review": "Excellent, and streams video very well", "verified": true, "helpfulness": "0/0", "author": "James J. Lindsey"}, {"rating": 3.0, "review": "The Amazon Fire Stick is a nice device, and the set-up was painless as it could get. Applications are as fine as the developers made them, and feature wise, it does more than I expected and seems to be more than the comparable Chromecast.However, the interface lag that is prevalent with the device is a bit frustrating; I will sometimes press the remote buttons a few times to get it working, and at which point it will suddenly process all the button presses late and well.. that makes things frustrating. Combined with the occasional loss of signal to the device to my Television (I feel that may be due to the device, as other HDMI devices do not have this issue)Overall though, its a lovely, tiny device that lets me just plug and play, whether I'm at home or traveling, and makes watching Netflix, Prime Video and HBO Go with ease.", "verified": true, "helpfulness": "0/0", "author": "Matthew Chambers"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Tim Moran"}]