[{"rating": 5.0, "review": "Easy to use. Having a remote is a plus. Great variety of movies.", "verified": true, "helpfulness": "0/0", "author": "Florence Kozda \"florangel\""}, {"rating": 1.0, "review": "I'm giving 1 star based on the performance only. The GUI is snappy and the movies load quickly.Could have easily been 5 stars if not for the annoying choices made by the developers.For instance. This streaming stick, and many other similar devices, are powered by a 5W micro USB port. Unfortunately, Amazon forces you to use their proprietary wall plug. You can't just use an available usb port on your TV. Amazon loses 2 stars for that.Next, the location of the USB port on the stick, (side, middle) is awkward and can cause problems when trying to plug it in to your tv that has other HDMI devices plugged in. Also, the wire they provide is inexcusably short. Because it's so short, I can't use it on my living room TV, so the Roku stick wins the living room tv battle.One of the worst offenses yet...No reliable, official app for accessing a DLNA media server. Good luck. Mybe you can get plex to work, but it's gonna chug. I have a router with usb NAS/DLNA support. Works great with every device except the Fire stick.And lastly, you lose another star for forcing me to watch a lengthy beginners video that YOU CAN'T SKIP! Amazon is clearly sending the message that \"Even though you paid for it, we own it.\" Bad Move.", "verified": true, "helpfulness": "0/1", "author": "wiiLOBO"}, {"rating": 5.0, "review": "I don't know how we lived without this!", "verified": true, "helpfulness": "0/0", "author": "Dwhelch"}, {"rating": 1.0, "review": "Great warranty but you have to talk to support. They are script readers. If course rebooting clears the issue. Americans aren't idiots. I'm so sorry I got this piece of junk. My fire TV works flawlessly. This stick works when it wants. All I want is a replacement that Amazon won't send.", "verified": true, "helpfulness": "0/0", "author": "Louis A.K. Cottrell - D'Esposito"}, {"rating": 5.0, "review": "perfect. clear picture ,easy to use", "verified": true, "helpfulness": "0/0", "author": "anne E kielkucki"}, {"rating": 5.0, "review": "Wow.  Such a little piece of equipment reaps tons of rewards.  If you have fast internet connection and Amazon prime, you need to have this.  Good HD in prime with no buffering...at least until the US government messes it up!  Really a great deal.", "verified": true, "helpfulness": "0/0", "author": "Tiberius \"Jazzy Jeff\""}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick is great, however whenever we tried to install an app to our fire stick it kept giving us an error failure.So that's when we decide to call the Amazon technicians and they helped us with our problem and now we are able to install whatever app we want.", "verified": true, "helpfulness": "0/0", "author": "ERICA URIARTE"}, {"rating": 5.0, "review": "Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Earl Burroughs"}, {"rating": 5.0, "review": "Great deal", "verified": true, "helpfulness": "0/0", "author": "Anders"}]