[{"rating": 5.0, "review": "Awesome!!!! So easy to use !!", "verified": true, "helpfulness": "0/0", "author": "Guadalupe Hasbun"}, {"rating": 5.0, "review": "Best little stick you will every buy. No box to look at. Take up no space.", "verified": true, "helpfulness": "0/0", "author": "Steve H Tran"}, {"rating": 5.0, "review": "Fire Stick viewing is distraction free.There are no obnoxious promotions for other programs flashing and blinking at you as they take up as much a a third of the screen.  And there are no network logos permanently taking up space in a corner.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "rangemaster"}, {"rating": 5.0, "review": "Love this device.  Another cool function is that it can also be controlled from your smart phone.", "verified": true, "helpfulness": "0/0", "author": "jcross"}, {"rating": 4.0, "review": "I found the fire stick easy to use. It works great, the only draw back is there is no surround sound.  If anyone knows of a way to make the surround sound work please let me know.", "verified": true, "helpfulness": "0/0", "author": "Dan Cowart"}, {"rating": 5.0, "review": "Great investment. It practically sets itself up. I'm Catching upon the older hbo programs now. I have been recommending it to friends. It's ease of use is awesome. I have nothing negative about Amazon stick.", "verified": true, "helpfulness": "0/0", "author": "will"}, {"rating": 4.0, "review": "I have been very pleased with the performance of this product and I would recommend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Mike Henry"}, {"rating": 4.0, "review": "I like it. It's so easy and convenient. It allows me to do a lot of things. From streaming movies to listening to music. My kids can even download games", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The best think since sliced bread. No more long periods of buffering and getting kicked off the movie we were watching. Amazon kicks it out of the stadium again with innovation.", "verified": true, "helpfulness": "0/0", "author": "Roger Anderson"}]