[{"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Christina Raquedan"}, {"rating": 5.0, "review": "Love love love this thing....highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Thompson"}, {"rating": 5.0, "review": "Love it. Does everything it's advertised to do. Easy set up, simple to use.", "verified": true, "helpfulness": "0/0", "author": "Bobm"}, {"rating": 5.0, "review": "easy to set up. works best if its attached to the small extension dongle that's attached to it in order to have the remote find it and have the Fire Stick recognize the remote. surprisingly does not come preloaded with the Sling TV app. That seems odd to me since I bought this specifically because of the recent combo sale of 3 mo. of Sling TV and get a discount on the Fire TV or Fire Stick. Its pretty easy and painless to connect it to an existing wifi network and to download additional apps to it. The iPhone remote app works very well. No crashes or anything yet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "didn't like it", "verified": true, "helpfulness": "0/0", "author": "Lakisha Duncan"}, {"rating": 5.0, "review": "Great device to stream and integrate Prime content", "verified": true, "helpfulness": "0/0", "author": "Cory Gee"}, {"rating": 5.0, "review": "Absolutely love the Fire TV stick! Easy to use with a great interface, only complaint is I wish you could listen to Prime Music stations.", "verified": true, "helpfulness": "0/0", "author": "Troy A"}, {"rating": 5.0, "review": "Loved this!!! The price is higher than others but its far better! Been using since the day I got it. It was easy to install and is very user friendly. I mainly use to watch Netflix but it has several other great channels you can watch. My only complaint is that it took me about twenty minutes to get the battery cover off the remote, i had to google this and serval others had the same problem. Other than that i would recommend to family and friends. Also its worth mentioning there is an FREE app that also acts as a remote.", "verified": true, "helpfulness": "0/0", "author": "desiq38"}, {"rating": 4.0, "review": "I love it when it works.  I know I live outside of town and the internet here isn't optimal, but this is the only thing that wusses out regularly due to some imagined network issues.  Only item in my house that makes this claim.  Hopefully it drops the attitude at my next house.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great little device.  Easy to install.  Easy to navigate. Works like a charm!", "verified": true, "helpfulness": "0/0", "author": "abdj1gd"}]