[{"rating": 4.0, "review": "Like it, but it stops often to buffer.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "The categories for the content are pretty easy to follow except when it comes to prime music, other than that I would've given it a 5.", "verified": true, "helpfulness": "0/0", "author": "Herman Carreno"}, {"rating": 5.0, "review": "I love the Amazon fire Tv, I put one in my older son's bedroom instead of cable and he loves it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This does the same things as the Roku does. Having just switched over I was excited to try fire tv. BUT I cannot get google play on fire TV and I have a lot of movies on there that I would love to watch without having to hook my computer to the TV to watch.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "An excellent value", "verified": true, "helpfulness": "0/0", "author": "James S."}, {"rating": 3.0, "review": "I'm very torn. The interface is a bit on the confusing side. It took me awhile to really figure it out. It is a pro that it is right in my TV though and I don't have to use my Wii anymore. I do wish it was powered somehow differently, as one more cord is now in the way. Pretty much worth the money though; I'm not upset I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Amee"}, {"rating": 5.0, "review": "⭐️⭐️⭐️⭐️⭐️", "verified": true, "helpfulness": "0/0", "author": "Theresa L Carlson"}, {"rating": 5.0, "review": "VERY easy to use.  We recently ditched cable in favor of an antenna and the Fire stick.  Best purchase we have made in a long time.  The stick lets us watch Amazon Prime, Netlix and Hulu Plus, along with many other channels we haven't even explored.", "verified": true, "helpfulness": "0/0", "author": "Patrick Kaiser"}, {"rating": 5.0, "review": "I love this product.  I owner every little streaming device and once I got my Fire Tv Stick I haven't even messed with the other products. This is better than Roku, Google chromecast and Apple Tv. It's so much more versatile than the rest. I wish the remote had a \"fine me\" function. It's hard to keep track of. The IOS remote app works well. I'm going to order another one in the next few days.", "verified": true, "helpfulness": "0/0", "author": "Asher B."}, {"rating": 1.0, "review": "Very poor compatibility with outside controllers. PS4 controllers and many other modern wireless controllers will not work on here. Hours on support gave me absolutely no help. 360 and PS3 controllers \"MAY\" work on this, depending on the model. My PS3 controller will not work without flashing the system and installing extra software. There was nothing that explained this peripheral difference between the TV Stick and Amazon Fire TV.If you are not looking for something for gaming on, this is okay. Roku runs deals often that put them in line with the TV stick, this really is not a great option for gaming, and the start menu is really clunky for non-amazon viewing. The Hulu port to the stick was awfully done, and the reviews on the Amazon store show it. This was a half-finished, poor clone of something that should not have been given a budget model. Roku has been able to do it better for less.Amazon Fire Support: Completely useless overseas \"yes sir i am complete understand and empathy sir\" kind of support. After four reps asked me \"did you try turning it off and back on?\", I asked for a supervisor who was just as useless at helping me fix the problems that arose. The support for the Amazon Fire products are outsourced, uncaring, and NOT the same, lovable staff that you will get for a usual Amazon customer service experience, and that is very disappointing.Overall: If you absolutely can't upgrade to a Roku for $10 more, this TV Stick is a BARELY okay option for TV lovers. The lack of true modern controller functionality is a kick in the pants. Amazon wants you to buy their first-party controller, or the Fire TV box for optimum compatibility. The Hulu port skips and crashes, the front menu can be confusing to navigate, so confusing that they force you to watch several tutorials before you can start your TV Stick, and even then it doesn't help you figure out where you can properly download apps, forcing you to use the search bar for absolutely everything you do. You're better off buying Roku, or saving up for the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Brandon McDonald"}]