[{"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Sixta Colon"}, {"rating": 1.0, "review": "Got the stick so my terminally ill husband could watch some programs via SlingTV. Got a second stick too, hence the review. The Fire TV Stick has been such a disappointment. Shows freeze, audio continues then the visual catches up by surging forward (like fast forward). I thought it might be SlingTV but no, happens with Netflix too. Went through the troubleshooting steps with SlingTV tech support, which involves Force Stop, Clear Cache, Uninstalling ALL the apps--inconvenient if you have Netflix, Hulu, Amazon and YouTube--Reinstalling all the apps, and check if it works better. Worked ok and then back to freeze, ff. So back to watching Netflix, Hulu and Prime using the tv and suffer through SlingTV using the Fire TV stick.Wish I could send the stick back but I have 2 more months of SlingTV to go--also not one I am keeping.", "verified": true, "helpfulness": "0/0", "author": "erudite \"Loves books\""}, {"rating": 2.0, "review": "I have had the fire stick for about 7 months now. It plays video well and he many cool apps and games. I chose not to pay for prime as the number of movies and TV shows that came with it were lacking. I have stuck with Netflix and hulu instead. My big complaint with it is that it will loose connection with my wireless router many times a day. Each time I have to reboot the stick and then it works fine for a while. I have tried different channels and bands on my work to no avail. I kind of wish we had just gotten the full fire TV box so I could have used a wired connection.", "verified": true, "helpfulness": "0/0", "author": "Nathan Malick"}, {"rating": 1.0, "review": "At first glance this device seems wonderful. Great specs, great price, sleek design - it is all of those things.However, the Fire TV Stick longer works (well) with Netflix, making it worthless as that's 50% of the reason I bought it.  At first I thought this was just me - some setting or something.... but then I had a look at the Amazon community support forums (search for \"Fire TV Stick netflix stuttering\" and see for yourself).It seems, based on both Amazon support forums and others (AVForum, Reddit, Plex Media forum) that after a firmware update the NetFlix app has pretty much been broken. Audio and video stutter frequently, and as time goes on it seems to get worse. Resetting the device sometimes clears it up for an hour or two then the problems return.  Stuttering issues persist despite multiple attempts to resolve conflicts (TV/Stick refresh rate synch, clearing cache, resetting device, changing Wi-Fi channels, switching HDMI ports)Amazon Instant Video service, Amazon Music, Vevo, Pandora, YouTube seem to work fine, so clearly it's not a hardware issue or a network issue... it's an app issue.Until Netflix and/or Amazon can resolve these playback issues, I would NOT recommend the Amazon Fire TV Stick for anyone who wants to use it for Netflix streaming.If Amazon gets the NetFlix app working, this thing would be 5 stars all the way.", "verified": true, "helpfulness": "1/1", "author": "Doug H. \"greysoul\""}, {"rating": 5.0, "review": "This may sound like I work for Amazon (I don't) The Fire Stick is great, especially with Amazon Prime membership!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "David Shelton"}, {"rating": 1.0, "review": "This thing is less then ten feet from my wireless router and it will not stay connected for more than a few minutes. I have similar Roku devices that connect without a problem. I thought I'd give the Amazon a try. Waist of time and money!!!", "verified": true, "helpfulness": "0/0", "author": "rubin guerra"}, {"rating": 1.0, "review": "Sent the first one back and the second, both for the same reason. They didnt work, save your money", "verified": true, "helpfulness": "0/0", "author": "Clarence McLeod"}, {"rating": 5.0, "review": "great fun, I get just what I want!", "verified": true, "helpfulness": "0/0", "author": "marilyn"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Litza Gonzales"}]