[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "samuel ramzy"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Luis Quinones"}, {"rating": 5.0, "review": "Love it but didn't know I had to buy or rent a movie when I'mPaying you 99.00 a year", "verified": true, "helpfulness": "0/0", "author": "Rochelle jON ES"}, {"rating": 5.0, "review": "I never thought I would buy a streaming device, but I'm sure glad I bought this!  It's SUPER fast and incredibly easy to use.  The layout of the different streaming services it supports is really nice looking too.  My parents saw this and now want their own.  I'm so glad my dvd player started quitting on me or else I probably wouldn't have bought this, but I'm glad I did!  I recommend this to everybody!", "verified": true, "helpfulness": "1/1", "author": "Rich Whitcomb"}, {"rating": 5.0, "review": "I threw my Roku in the trash and ordered a firestick. The firestick worked perfectly from the moment I plugged it in.", "verified": true, "helpfulness": "0/0", "author": "Dustin A Nash"}, {"rating": 5.0, "review": "As advertised. Works great", "verified": true, "helpfulness": "0/0", "author": "Chris & Jim Price"}, {"rating": 5.0, "review": "More than I expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Susan Weintraub"}, {"rating": 1.0, "review": "When it works it does fine, however, it seems to get hot and it stops working.  I have to unplug it from the power source, let it sit for a minute or two then reboot it.", "verified": true, "helpfulness": "0/1", "author": "Tracy-Student"}, {"rating": 4.0, "review": "It's really a great tool for the cable cutters out there. I had a 7 year old Netgear router that worked fine but it made the picture pretty unwatchable so once I upgraded to a Netgear N600 I dedicated the 5G band to the FireTV stick and it looks awesome. ESPN and AMC are so much more clear and crisp than I ever had with Comcast.", "verified": true, "helpfulness": "0/0", "author": "Scott Miller"}]