[{"rating": 3.0, "review": "First I have a DVD player with the features that the Fire TV stick has except one and that is an App for the Amazon Music Library. I seem to have amassed a lot of music in the Library which I can  play on my cell or computer, or Download and copy to a USB and plug that into my DVD player to play through my sound system. Now I just switch to the Stick and play away.There are several things about the Fire Stick that I an not crazy about but if you don't have a 'Smart' TV or DVD player this will hook you up. But you will need Wi-Fi installed in your home. But  It certainly is worth the price and it's easy to hook up. One warning It hooks up to your TV with an HDMI cable, my TV only has two inputs so I had to pick up a small gadget that you attach to multiply your inputs.  Also you'll need a place to plug it in. The back of my TV looks like a jumble of snakes. And you have another remote to keep track of.", "verified": true, "helpfulness": "0/0", "author": "D. P. Lance"}, {"rating": 5.0, "review": "Great product and the remote control allows the entire family to use it without a cell phone", "verified": true, "helpfulness": "0/0", "author": "DN"}, {"rating": 5.0, "review": "works great, love that you can take it from TV to TV in the house. We've been streaming lots of great new stuff that I don't think we would've otherwise. Especially love the Crackle channel.", "verified": true, "helpfulness": "0/0", "author": "wheedooo"}, {"rating": 4.0, "review": "Makes the Prime membership worth it's weight in gold.  So many shows & movies available.  Only been using a few days, but so far it's really great.", "verified": true, "helpfulness": "0/0", "author": "Qlueless"}, {"rating": 5.0, "review": "I love it!! Easy to use, tons of movies, and definitely an entertainment asset. It makes me love my prime membership even more.", "verified": true, "helpfulness": "0/0", "author": "Audrey Crouch"}, {"rating": 4.0, "review": "I got to do Amazon's Prime because chrome cast will not. It works.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great.  Easy set up.  Needs an IOS app.", "verified": true, "helpfulness": "0/0", "author": "BSlus"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "james marshall"}, {"rating": 5.0, "review": "for days we had been able to watch any prime videos on the smart tv because we kept getting a message that the signal was too weak from the modum which is 75 feet away...well we plugged in the fires stick and voila we are back in prime land...thank you Amazon for this amazing device...I am in technology love...until my 150 verizon fios is installed this week, we are safe lol per se.", "verified": true, "helpfulness": "0/0", "author": "leighsy10021 \"Dan the man\""}, {"rating": 5.0, "review": "Great device!  Worked well right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Fiore-Walker, Ph.D."}]