[{"rating": 5.0, "review": "The TV Fire stick is great.", "verified": true, "helpfulness": "0/0", "author": "Natalie Miller"}, {"rating": 5.0, "review": "Very pleased with this little stick.  Some non Amazon apps are hard to get to, but once you're used to it you're golden.  Kids love the games you can play with the remote (not paying for an over priced controller).At the $19 intro price this was a great deal and excellent purchase.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "lostfan"}, {"rating": 5.0, "review": "This thing is amazing! A must for all Prime Subcribers!", "verified": true, "helpfulness": "0/0", "author": "Wounded Horse"}, {"rating": 5.0, "review": "This is an awesome product. I love it", "verified": true, "helpfulness": "0/0", "author": "janel wilkerson renner"}, {"rating": 5.0, "review": "For the price this is the best dongle on the market.  I also have the Chromecast and have used Roku.  Chromecast doesn't have a remote or user interface.  Roku is slower and costs more.  Only downside I would say is currently the search only checks Amazon Media and not other streaming Media.  The day it can also search Netflix, Hulu, etc. it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "jeff b"}, {"rating": 5.0, "review": "I got this on sale for half price during a pre-order special and don't know that I'd pay 40 dollars for it but at half price, it's worth it for sure. As a prime member without a device compatible with Amazon Video, this is exactly what I was looking for and we've watched around 20 prime movies with it. It plugged into our Sony tv and worked immediately and is pretty user friendly. I like that you can edit your Watchlist on the stick or on Amazon.com.", "verified": true, "helpfulness": "0/1", "author": "First Time Mom"}, {"rating": 5.0, "review": "Love it very easy set up", "verified": true, "helpfulness": "0/0", "author": "Steve Weber"}, {"rating": 2.0, "review": "The fire tv stick will not connect to internet. The internet signal is strong but the fire stick continually loses connection.", "verified": true, "helpfulness": "0/0", "author": "Carrie M. Hanson"}, {"rating": 5.0, "review": "Great product!  Blows away the competition.  Best part is that it's flexible enough to side load your favorite apps! Better than the other streaming boxes", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love our fire tv stick. Its easy to set up and very responsive. I love that there is a phone app to voice search with which also works effortlessly. The only down side to this is that there is no vudu app and the flixter app is shoddy at best.", "verified": true, "helpfulness": "0/0", "author": "nicki_e"}]