[{"rating": 3.0, "review": "I have both apple tv and the fire stick. I kept having issues with the wifi dropping off where I had no issues with apple tv. Will be using the apple tv instead.", "verified": true, "helpfulness": "0/0", "author": "Bartender \"S\""}, {"rating": 1.0, "review": "I bought this product when it was selling for $19.  Should have sent it back after first use.  Where do I start?  Sound goes in and out when it feels like it.  Internet streaming is horrible. Constantly freezes up while watching something.  I have high internet speeds and have no other problems with other streaming devices we use.  Also, when searching for movies it all of sudden just goes off on its own  racing through the viewing choices like it is possessed.  Yesterday, I just ended my \"hate\" affair with this device and hooked up a ROKU 3 box.  Finally a device that works.  Amazon, you need to go back to the drawing board with this one.", "verified": true, "helpfulness": "0/0", "author": "BobD"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 1.0, "review": "Bought this before it came out on pre order. It worked great for the first month. Now I constantly have to climb behind my tv to unplug and reset it. It never finds the network server when the Router is about 2 feet away. It constantly disconnects from the internet.", "verified": true, "helpfulness": "0/0", "author": "jason gray"}, {"rating": 2.0, "review": "I am returning it.  It was easy to install but when streaming the voice stutters and drags.  You can't listen to streaming movies-Netflix or Amazon. Very disappointing. I tried all the suggestions.  It also gets extremely hot, even with the extender.  I was hoping to be able to watch Netflix and Amazon without turning on another device.", "verified": true, "helpfulness": "0/0", "author": "carol smith"}, {"rating": 5.0, "review": "Works well, use with our projector and no problems, easy to navigate Amazon Prime instant watch.", "verified": true, "helpfulness": "0/0", "author": "Josie"}, {"rating": 4.0, "review": "2 stars - big disappointment, video keeps freezing during playback or the video freezes and the audio continues, my wireless routers is in the same room as the tv, probably 20 feet from each other, i powercycled router/modem/stick and still same outcome.4 stars - UPDATE - seems items near by tv was interference with the signal to the firestick.  Once i removed them, signal now is reliable and im no longer experiencing the freezing", "verified": true, "helpfulness": "1/1", "author": "darryl strickland"}, {"rating": 5.0, "review": "This item was very easy to install and performed flawlessly. Great way to get streaming TV and video.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "NO VOLUME CONTROL!!! - why not?  How is that not clearly advertised?I've got a beautiful old sound system hooked to my TV, so I rely on built in volume control.", "verified": true, "helpfulness": "0/0", "author": "Best Cherry Pie"}, {"rating": 4.0, "review": "This is a competitor to Roku and Chromecast. I have a few Roku boxes and I prefer the Fire Stick. First, the cost is great. It's less than the standard Roku (most of the time.) It's small--it fits right into your HDMI port, and an extender is included if you need it (depending on the configuration of what's already in your HDMI ports. I had to use the cable.)The Fire Stick arrives associated with your Amazon account and the interface is easy to use to set up your WiFi (I didn't have to scroll between numbers and letters, and it was very fast to use the on screen keyboard.)Some extra features: your Amazon Cloud Drive is available on the Fire Stick, so you can play your photos and videos easily. You can play Amazon music as well as Pandora.If you are a gamer, there are 500 games available and an optional Amazon Fire Game Controller although you can use the directional pad of the remote if you wish.Most streaming TV stations are here: HBO Go is not (but slated for later in 2015.)I found this easy to set up. Roku is not difficult at all, but this is even easier. While you don't need to have Amazon Prime to use this, definitely it's an advantage for Prime users, as you get the Prime TV, film and music.The remote is well-designed and seems more responsive than the Roku. The one disadvantage: if you have a TV that lacks HDMI ports, this is not for you. You don't get the ability to interface with a three-plug cable. For that, you need the old style Roku LT or similar device.Bottom line: price worthy, does a lot, excellent choice for Prime users. Requires an HDMI port.", "verified": true, "helpfulness": "1/1", "author": "Joanna Daneman"}]