[{"rating": 5.0, "review": "This is much better than the chromecast. I can mirror from my phone in addition the all of the other features.", "verified": true, "helpfulness": "0/1", "author": "Victoria Vaughn"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mary E. Callahan"}, {"rating": 4.0, "review": "We're loving the movies!  Easy to install and set up.", "verified": true, "helpfulness": "0/0", "author": "Theresa Boyd"}, {"rating": 1.0, "review": "Not what I expected.  Bought the item,  so that I can mirror my s3. Its not compatible.", "verified": true, "helpfulness": "0/1", "author": "James Ngo"}, {"rating": 5.0, "review": "I am really enjoying my fire stick.", "verified": true, "helpfulness": "0/0", "author": "Barbara Evans"}, {"rating": 4.0, "review": "Love MOST everything about it.  Super easy to use.  Lots of movies & shows to watch free with Prime.  My only wish is that I could stream movies from other devices like I can with the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Shelby"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "paula d. montgomery"}, {"rating": 5.0, "review": "Our whole family loves the Fire TV Stick. We have previously used the Wii, the Xbox and our smart sound bar. We bought the Fire TV Stick for our bedroom. It is fast and easy to set up and works so fast. With the other devices we use for streaming movies through Netflix and hulu buffer for what seems like forever. The Fire TV Stick goes right to whatever you what, right away. I think we're going to get one for the living room now. The app to use your phone or tablet works great too. Love it and for $40 it's worth trying. You won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Connie M"}, {"rating": 4.0, "review": "I was really excited for HBO GO and the ability to stream Games of Thrones finally, only to be disappointed to realize I should have done my homework.  My Cable provider doesn't support this device.  I won't return it as I find the interface with my Amazon Prime Awesome and some of the other apps that are available to the Fire TV Stick that I don't have on my Vizio Smart TV.", "verified": true, "helpfulness": "0/1", "author": "Vicki"}, {"rating": 5.0, "review": "Love this. Easy to use remote .", "verified": true, "helpfulness": "0/0", "author": "Betty Richardson"}]