[{"rating": 5.0, "review": "Great product, I use to watch my Netflix and Hulu movies from my computer which can become uncomfortable but now I can watch my movie from anywhere in my room, great to have options.Regina", "verified": true, "helpfulness": "0/0", "author": "R. Medina"}, {"rating": 5.0, "review": "Love it.  This is a great gizmo !", "verified": true, "helpfulness": "0/0", "author": "Darlene Jones"}, {"rating": 5.0, "review": "This was a fantastic purchase. I have been watching movies on my kindle and enjoying them for a while. Now my family can watch them with me. We have binge watched Downton Abby. With do many choices including Netflix we are stumped. A nice problem to have.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great item. Enjoy the Amazon programming. Highly recommend getting one. Get to see hundreds of show for pennies a day.", "verified": true, "helpfulness": "0/0", "author": "BOBS"}, {"rating": 5.0, "review": "Love it! All my Amazon Prime content write on my TV any where there's WiFi!", "verified": true, "helpfulness": "0/0", "author": "Lawrence Grimmett"}, {"rating": 3.0, "review": "Generally pretty good. Having a couple of problems:- text in the apps is pretty small, at least on my fairly small TV. The text is sharp, but in the body of a movie description, for example, I cannot see it from across the room. Maybe I'm just the wrong age :-) Of course, there is a nice big picture of the advertising graphic - which is of zero informational value...- there is a Spotify app, but you have to use a smartphone app to drive it - and, at the moment, that works about 2% of the time. The android app spent see the fire stick app. Mostly, it's useless.", "verified": true, "helpfulness": "0/0", "author": "D. Kronstadt \"kronhead\""}, {"rating": 5.0, "review": "Easy install and works perfectly for a 2nd TV", "verified": true, "helpfulness": "0/0", "author": "Kathleen Santelle"}, {"rating": 5.0, "review": "Wow, easy set up and tremendous hi def!", "verified": true, "helpfulness": "0/0", "author": "Martin Zeidenberg"}, {"rating": 4.0, "review": "Finding content is a bit of work, but that's mostly because there's SO MUCH available. In fact, the only downside we've found after a week or so is that other throughputs on our Panasonic Viera TV sporadically drop to black and white, and even then a simple unplug/re-plug cycle sets things right.Mind you, we have Amazon Prime, and that makes a lot of the content free to view. But we're quite happy with it.", "verified": true, "helpfulness": "1/1", "author": "cel"}, {"rating": 5.0, "review": "Luv it", "verified": true, "helpfulness": "0/0", "author": "leon santos"}]