[{"rating": 5.0, "review": "Very easy to install. Works well. Very sharp picture.", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 1.0, "review": "Keep to chromecast. Device keeps randomly disconnecting from WIFI and WIFI is not the problem. Completely unusable. Amazon doesn't seem to have a SW update planned.", "verified": true, "helpfulness": "0/0", "author": "Carlos M Velez"}, {"rating": 5.0, "review": "I absolutely love this. I can watch all of my Netflix movies on my television now. The only thing I don't like is people can view my private photos from my kindle :( not sure if there is a way to hide them. Other than that this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Besos 83"}, {"rating": 5.0, "review": "The best thing I have ever used. It was so easy to download apps to the stick for what I use", "verified": true, "helpfulness": "0/0", "author": "Drgnz"}, {"rating": 4.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Reader and watcher"}, {"rating": 5.0, "review": "Makes it easy. All Prime members need this", "verified": true, "helpfulness": "0/0", "author": "George Magyar"}, {"rating": 5.0, "review": "Easy to plugin easy to use instructions.", "verified": true, "helpfulness": "0/0", "author": "S. Tiouti \"Stephen King phile\""}, {"rating": 3.0, "review": "First off, I was one of the lucky Prime members who preordered this device for $19. I was super excited to get it and streamed on it the whole first day I had it - Hulu, Netflix, Crackle, I tried it all, and it was great. Then later that day, it suddenly refused to connect to any wifi. Even wifi that had great signal strength. I had to reset the stick, and it all worked again. This whole reset issue happens pretty regularly (I've had it for a month now and use it almost daily). If I had paid a full $39 for it I might be pissed, but for $19 I'm willing to play the reset game I guess.", "verified": true, "helpfulness": "0/0", "author": "sjm"}, {"rating": 5.0, "review": "Easy to use, clear picture, great price", "verified": true, "helpfulness": "0/0", "author": "foreverfan"}, {"rating": 5.0, "review": "Extremely surprised at the ease of setting the Firestick up.Effortless and amazing technology!!!!", "verified": true, "helpfulness": "0/0", "author": "Patrick R Law"}]