[{"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "william taylor"}, {"rating": 5.0, "review": "Fun & easy to use!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Rosa"}, {"rating": 5.0, "review": "I am very impressed  with the firestick. It did everything that I expected  from it.", "verified": true, "helpfulness": "0/0", "author": "Lu Ann Raboin"}, {"rating": 5.0, "review": "Exactly what I expected and more. I would highly recommend this. You can watch netflix, prime instant video, play games, and much more.", "verified": true, "helpfulness": "0/0", "author": "Nathan Warnke"}, {"rating": 5.0, "review": "Very versatile. Plugs into TV USB port. There is a small spot on the side of the stick where you plug in the provide chord and it plugs into your electrical outlet. It must be plugged in to work. It acquires WIFI easily. Once on, my TV had to be put in TV/VIDEO 2 to access Amazon. Once there you can easily view free prime content, purchasing is very easy is you see something not free on Prime. Also there are video games. Both free and pay ones. If you plan on playing games you will have to purchase a hand held game controller that operates on WIFI as well. All in all this is a great product so far. My family is really liking it a lot. After watching 2 seasons of Orphan Black on Prime I have finally caught up with why everyone loves it so. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "E. Chambers \"Hockessinmom\""}, {"rating": 5.0, "review": "Easy to use and setup. I was so happy to have Netflix and Amazon Prime in the bedroom TV for not much money. I'm very happy with this product and will be buying more for the other TVs in the house.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great,easy set up, user friendly. Remote is easy to use as well.", "verified": true, "helpfulness": "0/0", "author": "russellfam2010"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "crusllane"}, {"rating": 4.0, "review": "Like it....it allows for cheaper TV viewing.", "verified": true, "helpfulness": "0/0", "author": "c. hartman"}, {"rating": 5.0, "review": "Great product. Easy set up and install. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]