[{"rating": 5.0, "review": "Yes it was amazing I've been purchasing them for every TV in my home", "verified": true, "helpfulness": "0/0", "author": "Jza"}, {"rating": 5.0, "review": "My internet speed is not great, so I was concerned that the fire stick would not work here.  I did get a warning when I set it up that there could be a problem with my wi-fi speed.  However, movies are playing properly - no skips or hesitation.  I am delighted.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love using our firestick! The options are endless!", "verified": true, "helpfulness": "0/0", "author": "Amber Martinez \"wondering\""}, {"rating": 5.0, "review": "It's so awesome,  it has everything and my kids love it and it makes any TV a smart TV!", "verified": true, "helpfulness": "0/0", "author": "betty lehman"}, {"rating": 5.0, "review": "Easy to use. No issues so far (about 4wks).", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 5.0, "review": "Easy to use and I love that I don't need to use one of my own devices to use it!  I had the Chromecast but needed one of my own devices.  It works on its own and the remote makes it even better!", "verified": true, "helpfulness": "0/0", "author": "NicoleA"}, {"rating": 4.0, "review": "having some trouble with occasional buffering, but am changing my internet service and increasing speeds, so hope this will go away.  Otherwise am VERY happy with equipment.", "verified": true, "helpfulness": "0/0", "author": "Dragon Herring"}, {"rating": 5.0, "review": "Works great, everything that I was looking for in a streaming device plus such a good price", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 1.0, "review": "I bought it but I live in Costa Rica so with my IP address I can't use it.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "GreAt very satifief", "verified": true, "helpfulness": "0/0", "author": "Charles Gannon"}]