[{"rating": 5.0, "review": "I can't believe how great this thing is!!!", "verified": true, "helpfulness": "0/0", "author": "Gary Shea"}, {"rating": 5.0, "review": "Absolutely loved it!  Easy to use and it saved us from the endless reruns and holiday repeats. The original prime series are amazing", "verified": true, "helpfulness": "0/0", "author": "Sandra Chafin"}, {"rating": 1.0, "review": "Having multiple issues connecting this device. Works for a while then quits. Screen will go blank or show up with multiple limes or static. It will run for hours just fine, then won't work at all the next time. Sending it back disappointed. Clearly not ready for Prime time yet, Amazon.", "verified": true, "helpfulness": "1/2", "author": "Jeff"}, {"rating": 4.0, "review": "Great. Product works just fine", "verified": true, "helpfulness": "0/0", "author": "Albert"}, {"rating": 5.0, "review": "best product for the end of 2014", "verified": true, "helpfulness": "0/0", "author": "Fernando De Lara"}, {"rating": 4.0, "review": "Great for rooms with no cable jacks or as a way to reduce cable costs,  not as many stations as roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Didn't realize I'd  be stuck on Amazon account.  Thought I'd have as much flexibility as roku", "verified": true, "helpfulness": "0/2", "author": "KP"}, {"rating": 1.0, "review": "It took three fire sticks before the installation could be completed. Twice, after about two hours, Amazon decided the first two fire sticks evidently were defective. Then there was difficulty trying to get a replacement, all because there was some dispute about which credit card I had used.  I had great difficulty understanding the lady trying to help me, and finally I had to request to speak with a supervisor.  I had ordered a total of four fire sticks, and all of them were about to be returned so great was my frustration level. I'm not sure how to access more than the 71 movies that appear on the home screen or even how to access multiple seasons of TV show.  I'm sure there is a lot more to the fire stick, but I just don't know how to use it to its full advantage.", "verified": true, "helpfulness": "1/2", "author": "Cheryl Mahaffey"}, {"rating": 5.0, "review": "We liked it.", "verified": true, "helpfulness": "0/0", "author": "JeannieD"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Norbert"}]