[{"rating": 5.0, "review": "I absolutely love my Fire Stick. We have had it a few months now. It makes using Netflix so much easier. I also have Amazon Prime and have found plenty to watch using the fire stick. We also play games through it as well. And I can now play Pandora through my t.v and stereo system.  It  renders things quickly and have not had any problems with it. I wish we had gotten this sooner. Having the remote means we do not have to use our phone to cast things like you do Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Witt"}, {"rating": 5.0, "review": "This works so well, I can't believe how affordable it is.", "verified": true, "helpfulness": "0/0", "author": "Doc IA \"KM\""}, {"rating": 5.0, "review": "Great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Crumbob"}, {"rating": 5.0, "review": "The fire stick is so easy to set up, and it works great.", "verified": true, "helpfulness": "0/0", "author": "CJ \"Carol Jackson\""}, {"rating": 5.0, "review": "I love this little thing.Easy set up and easy to use.If I had it to go over the only thing I would to is get the remote that I can talk to.I plan to get one soon", "verified": true, "helpfulness": "0/0", "author": "James D Smith"}, {"rating": 3.0, "review": "I have been disappointed with this to be honest. It is slow loading, always reconnecting to my brand new Samsung TV in the middle of a show several times. Once you have watched a few things it inundates you ONLY that kind of movie or TV shows. I wish I would have gotten a different one. I have had it 3 months and really should return it.", "verified": true, "helpfulness": "0/0", "author": "cheri"}, {"rating": 3.0, "review": "Took me months he to find someone to gET the battery holder open. Now haven't had time to attach it to second TV.", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 3.0, "review": "Not as easy to set up as I had hoped. After a couple of phone calls got it to work. Now works fine.", "verified": true, "helpfulness": "0/0", "author": "Roberta O."}, {"rating": 5.0, "review": "Streams very fast and is easy to set up and transfer from set to set.", "verified": true, "helpfulness": "0/0", "author": "john maine"}, {"rating": 5.0, "review": "Wow! So much from something so small. The stick is small but mighty. I installed it in a few minutes & was perusing movies with ease. Well thought ouut & simple to use. The stick has changed the way I watch television forever!", "verified": true, "helpfulness": "0/0", "author": "XV-Man"}]