[{"rating": 5.0, "review": "This is a great product. Many apps to add and so easy to use- this is highly recommended", "verified": true, "helpfulness": "0/1", "author": "YENVAN"}, {"rating": 1.0, "review": "I love my Amazon Fire so I thought I would try the stick for our second TV. Unfortunately, the sound only worked with non-Dolby programming of which there is not much. Tried it on the other television, same problem no matter which audio setting I tried on the stick and the televisions. Pretty disappointing. Returned it....", "verified": true, "helpfulness": "0/1", "author": "Knox Filmmaker \"Director, War & Truth\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "William L."}, {"rating": 5.0, "review": "I love the convenience of this.", "verified": true, "helpfulness": "0/1", "author": "Elvira"}, {"rating": 5.0, "review": "Works as advertised. Installation is fast and easy. With Prime everything is set for free viewing movies, TV series, Showtime Anytime, etc. I am going to purchase another one for a second TV in the house.", "verified": true, "helpfulness": "0/1", "author": "D. Wile"}, {"rating": 5.0, "review": "I love my fire stick! The apps that are free are awesome. I am very happy with the easy set up too!", "verified": true, "helpfulness": "0/1", "author": "Debbie Cluckey"}, {"rating": 5.0, "review": "So far, so good. It does everything I ask it to do.", "verified": true, "helpfulness": "0/1", "author": "John Lewis"}, {"rating": 5.0, "review": "I love it! we were using our old playstation to watch hulu netflix n amazon instant. Our fan was getting loud in the playstation it was dying on us and didnt really want to spend so much money on an apple tv so $40 very well spent! easy to use and install . We just love it !", "verified": true, "helpfulness": "0/1", "author": "Sylvia Truc Trinh"}, {"rating": 5.0, "review": "We love the fire stick. I'm also a prime member and there is a lot of free things to watch, and music is great.", "verified": true, "helpfulness": "0/1", "author": "Edie"}, {"rating": 4.0, "review": "Enjoing it so far", "verified": true, "helpfulness": "0/1", "author": "Gail R Sykes"}]