[{"rating": 5.0, "review": "Wow. now the Wii console is downstairs and we have all our connectivity.Took 3 mins to install and use due to pre programming be Amazon.", "verified": true, "helpfulness": "0/0", "author": "Lance"}, {"rating": 4.0, "review": "The setup was very easy. The only thing i was hoping to be able to do access more tv shows without cost. Other than that its great", "verified": true, "helpfulness": "0/0", "author": "southernangel"}, {"rating": 5.0, "review": "This has been great!", "verified": true, "helpfulness": "0/0", "author": "Lyndsie"}, {"rating": 1.0, "review": "Save your money.  Even at $19 I realized I made a mistake when I got this thing up and running.  I found it nearly impossible to move around in the movie world offered by Amazon without wasting most of my life moving from index to index.  Why did Blockbuster have to fold anyway?", "verified": true, "helpfulness": "1/1", "author": "Bob \"Bob\""}, {"rating": 5.0, "review": "Worked right out of the box. Extremely simple installation.  Now I can use my Prime membership on my TV, not just my kindle.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Richard C. Lehrman \"Roach353\""}, {"rating": 3.0, "review": "Delivers amazon content well, but I bought it to stream twitchTV and the twitch app is horrible.  No sign in, no search, and no chat.", "verified": true, "helpfulness": "0/0", "author": "Dan Jones"}, {"rating": 5.0, "review": "Super easy to use and makes a non smart TV basically into one! Way better than using my tablet or computer", "verified": true, "helpfulness": "0/0", "author": "steph"}, {"rating": 4.0, "review": "If you have Amazon Prime and or Netflix also, this is a must! Easy set up, straight forward menus, great addition to the bedroom Hdtv...", "verified": true, "helpfulness": "0/0", "author": "CW \"Chris\""}, {"rating": 4.0, "review": "It powers on in an instant and provides quick access to all the services I need (Netflix, Hulu, TuneIn, etc.). Basically, the default interface is the Amazon Instant Video app. It's there by default, so you get quick access to Prime movies or recent releases and what have you. You also get easy access to Prime music and Prime photos. With the photos, in particular, I really like that you can set your screensaver to rotate through a set of photos from your library. Fun to watch while listening to podcasts.The remote works fantastically. I absolutely love that I don't have to point it at anything. I also installed the android app on my phone and it works really well. Love the voice search. The navigation using the touch screen is really clever and works well.The quality of the video and audio is excellent. It's reasonably performant in scrolling and navigating, but the PS3 (my other media streaming device) is definitely a bit smoother. My biggest gripe is that the video will stutter from time to time. You'll be watching and every 10 minutes or so it will just hang for half a second. Hopefully this can be resolved in a future software update.", "verified": true, "helpfulness": "0/0", "author": "Brandon Folkman"}, {"rating": 5.0, "review": "Was sad to have pre-ordered this and received it after everyone in the free world was able to walk into a Staples and buy it for $25 during the black friday sales.  Works really well with XBMC!!!  Use the providing wall wart to keep it running smooth as for some reason it didn't like the 5v usb on my TV and would constantly reboot on it own.", "verified": true, "helpfulness": "0/0", "author": "Keoke916"}]