[{"rating": 5.0, "review": "Very easy to set up and works great. Very happy.", "verified": true, "helpfulness": "0/0", "author": "Jayne Mohr"}, {"rating": 4.0, "review": "Nope", "verified": true, "helpfulness": "0/0", "author": "Antler hunter"}, {"rating": 1.0, "review": "Ate up ALL of my Data down load time and cost me $90.00 to watch A Free movie. Thanks! It's in the trash.", "verified": true, "helpfulness": "0/1", "author": "Stagecoach 26"}, {"rating": 5.0, "review": "Easy setup, great picture quality, and a lot of functionality for such a small device. I love that I can stream YouTube from my iPhone or iPad. The app selection is pretty comprehensive though some are a little useless (snow fall? really?). I'm sure there is more I can do with this; I just haven't had a chance to really put it through the paces.  Best part is that it came in almost a week before the original delivery date! Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "rrogalski78"}, {"rating": 5.0, "review": "We ditched cable and equipped our TV's with Amazon Fire Stick, digital antennas, and Sling tv (all thruAmazon) and are very happy with the decision.  We are saving over $120/month, don't have to deal with constant cable rate hikes, aren't paying for channels we don't want, and have beautiful reception.  I am definitely not a techie, and I installed everything on 3 TV's in about half an hour.  Most of that time was in taking stuff out of packages - it's so easy!  I especially like how few cords there are now behind the tvs without all that cable box hook-up stuff.  Maybe this was a little mean, but we returned our cable boxes in an amazon box!", "verified": true, "helpfulness": "0/0", "author": "amy barnes"}, {"rating": 5.0, "review": "This thing is amazing. Gets pretty hot when in use but otherwise is very fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup, works as promised", "verified": true, "helpfulness": "0/0", "author": "Robert Harper"}, {"rating": 5.0, "review": "The fire stick is so much more than streaming video it turns your tv into an entire entertainment system.  You can access music games and apps as well. It will completely change the way you use your tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great media streamer! Real fast response time", "verified": true, "helpfulness": "0/0", "author": "Ricardo Trujillo"}, {"rating": 5.0, "review": "Only one MINOR beef - no VUDU channel.  That would reduce my dependence on my Blu-Ray player.Otherwise - great buy, and WELL worth it with Prime!!!", "verified": true, "helpfulness": "0/0", "author": "Thomas W. Dodd"}]