[{"rating": 4.0, "review": "Great entertainment", "verified": true, "helpfulness": "0/0", "author": "Ellen P."}, {"rating": 5.0, "review": "Not a \"tech savvy\" person, and even I figured it out.  Voice search app on the phone works great. Hundreds of apps to choose from. With the prime acct you get a LOT of free stuff. Works faster than our blue ray for Netflix, hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "I bought this because my previous box did not have Amazon on it. It sets up in a matter of minutes and is a breeze to use. I do wish the remote was a little bigger.The cord is just long enough as well. Sometimes I have trouble connecting to WiFi, but I believe it's my Internet service provider. Just make sure you have ample speed and you should have no problem.", "verified": true, "helpfulness": "1/1", "author": "Adrena McDuffy"}, {"rating": 3.0, "review": "It sucks that you can't use this while traveling abroad.", "verified": true, "helpfulness": "0/0", "author": "slpepper"}, {"rating": 5.0, "review": "Great way to watch free and other Prime and HD TV and Movies. I love the Mom'sShare part.", "verified": true, "helpfulness": "0/0", "author": "Nana Holland"}, {"rating": 3.0, "review": "I really liked the Amazon Fire TV Stick when it worked. I was not aware that the Fire TV stick had to be in close proximity to my Wi-Fi router, a mention of which should be added in lay terms to the sales description. Since my computer / TV set up does not allow for that close proximity it kept dropping the connection to the point  of being too annoying to constantly reset the Fire TV stick. Since I am not a tech person, I also did not know that there are gadgets that will boost my Wi-Fi signal throughout the home (Amazon customer service also did not mention these gadgets, which is surprising since it would make them extra sales) until after I already returned the Fire TV stick. Now that I know how to improve the Wi-Fi signal, I will definitely give the Fire TV another try.", "verified": true, "helpfulness": "1/1", "author": "c reynolds"}, {"rating": 4.0, "review": "Several times while using it I was warned I didn't have the bandwidth to keep streaming smoothly.  I have never had this problem with my Apple TV and the picture/viseo quality is the same. I even tested it with identical video to be sure.", "verified": true, "helpfulness": "0/0", "author": "Jo Taylor"}, {"rating": 5.0, "review": "I haven't had much time to mess around with it, but I have to say, the times I have, have really impressed me. I also have a roku, and don't get me wrong, I absolutely adore my roku, but this has free games on it and you can get a game controller for some as well. It has some apps that my tiny doesn't , and I just really like this.", "verified": true, "helpfulness": "0/0", "author": "Natalie Lund"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Bebe"}, {"rating": 5.0, "review": "Easy to use and I like it better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Larry Bonneau"}]