[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Robert Francis"}, {"rating": 4.0, "review": "Have had the fire stick for a few weeks now and it works great! Only issue I had was the setting up took awhile only because I didn't have the accounts already. Would definitely recommend instead of cable.", "verified": true, "helpfulness": "0/0", "author": "Katherine Vaughn"}, {"rating": 5.0, "review": "i really love it, thanks.", "verified": true, "helpfulness": "0/0", "author": "EDGAR ARTURO MANRIQUEZ"}, {"rating": 5.0, "review": "I am using this in my basement and it works great!", "verified": true, "helpfulness": "0/0", "author": "Donna Bunting"}, {"rating": 5.0, "review": "Small footprint.  The Remote works without line of sight.  The smartphone app works seamlessly and the cool part about it is you can use your phone's keyboard to type rather than mouse around with the regular remote.  I currently own one of these and an apple tv and i like this by far.", "verified": true, "helpfulness": "0/0", "author": "Larry J Banks"}, {"rating": 1.0, "review": "I guess Amazon should give it away. There arent any good reviews. Thanks not purchasing. 😁", "verified": false, "helpfulness": "0/1", "author": "TeeTee \"TeeTee\""}, {"rating": 5.0, "review": "Does what it says it does, no complaints, got it for free... Even works well in basement, far from router upstairs and quite a few walls in between. Buy a male to female HDMI cable to extend from behind tv to help get better signal... Interface is easy to use.", "verified": true, "helpfulness": "0/0", "author": "bbz"}, {"rating": 4.0, "review": "Everything it said it would do it did as long as your wifi can handle it", "verified": true, "helpfulness": "0/0", "author": "rick robertson"}, {"rating": 5.0, "review": "altamente recomendado", "verified": true, "helpfulness": "0/0", "author": "edwin"}, {"rating": 5.0, "review": "Loved it! Just plugged it in and began using it. Plan on getting another for the other TV. Had to watch a utube video on how to open the remote to insert the batteries, that's my only complaint. Only because it seems delicate and I was afraid I'd break it by apply to much pressure, but other than that it was perfect.", "verified": true, "helpfulness": "0/0", "author": "Mary Kathleen Guerrero"}]