[{"rating": 5.0, "review": "Best stick device on the market and for the money,even better than the roku.Has a lot more memory and is faster than other players.", "verified": true, "helpfulness": "0/0", "author": "mcc"}, {"rating": 5.0, "review": "Works great, easy to set up and I like the parental controls.", "verified": true, "helpfulness": "0/0", "author": "Tracy Reed"}, {"rating": 5.0, "review": "Works great no issues", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "So far so good. Trying to prepare for getting rid of  satellite and this has been a great way to ease into it. Easy to use. Easy to set up. Great unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A great additional to any living-room", "verified": true, "helpfulness": "0/0", "author": "Bret Gordon"}, {"rating": 5.0, "review": "Well worth the money.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 1.0, "review": "I feel like this is the reason that Amazon Prime Video isn't supported on Chromecast. USB cable poorly placed and interferes with rest of cabling behind the TV.", "verified": false, "helpfulness": "0/1", "author": "Julie"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandra Stark"}, {"rating": 3.0, "review": "The Fire TV stick does a nice job when it's working, but is hampered by glitches and freezes. From a glitch standpoint, every other show I watch will have the picture freeze and the sound continue at some point. The only way I've found to fix this problem is to back out of the show and then resume it. Not a huge deal, but annoying nevertheless.As for freezes, occasionally the unit will lock up and not respond to any key presses from the remote. The only fix is to reboot the TV stick by unplugging it and plugging it back in.If Amazon can iron out these problems, it definitely deserves 5 stars.", "verified": true, "helpfulness": "0/0", "author": "JavaBarista"}, {"rating": 5.0, "review": "I can't believe how good this thing is!  Since I have Prime membership already, I figured I'd use it to watch movies and listen to music on my TV instead of just on my computer.  The remote has a very solid feel to it and it's simple design is a breath of fresh air, compared to the cable TV remote.  Well done, Amazon.  I'm a fan.", "verified": true, "helpfulness": "0/0", "author": "Tony W."}]