[{"rating": 5.0, "review": "with phone help I was able to get it hooked up in 10 minutes.  I look forward to watching as much as possible during my free trial.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Matheson"}, {"rating": 4.0, "review": "Really is a great investment! Unfortunately even with a Prime account I still run into movies or shows that you are required to pay for, which can be a real bummer. I was lead to believe you had full access to everything, which is not true. But overall a great value and a handy tool. Just wish the remote was a little bigger, it tends to fall down into the couch quite often.", "verified": true, "helpfulness": "1/1", "author": "tiffmitts"}, {"rating": 5.0, "review": "excellent product for the price", "verified": true, "helpfulness": "0/0", "author": "Gonzalo Villagran"}, {"rating": 5.0, "review": "very nice, would buy again", "verified": true, "helpfulness": "1/1", "author": "gino"}, {"rating": 5.0, "review": "This is really amazing stick. I liked it very much I am planing to get the Amazon TV setup for more speed and space as need to play games.But if you are just looking for the TV and other stuffs this is great. You can also play games provided you have the space to install as it comes with 5 GB space.", "verified": true, "helpfulness": "0/0", "author": "ravindra"}, {"rating": 5.0, "review": "yes it did !", "verified": true, "helpfulness": "0/0", "author": "Carlton M.Cosby"}, {"rating": 4.0, "review": "It works as advertise wifi disconected couple times at first but its been working since,app market could be better but over all its pretty good fast.", "verified": true, "helpfulness": "0/0", "author": "julio"}, {"rating": 5.0, "review": "So far so good! We purchased the Amazon Fire TV stick to use with our Sling TV subscription (mainly as an inexpensive way to get all of the sports channels). Also, our TV is an older model flat screen TV and the Fire stick works perfectly with it. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Charity"}, {"rating": 5.0, "review": "Love this Fire Stick, Very easy set up, quick to learn. Love all the app options!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Duncan \"stephanie duncan\""}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Ashley Baumgart"}]