[{"rating": 4.0, "review": "Amazon Fire stick is a great addition to anyone especially current Prime Members.  It turns any TV into a smart TV and allows you to watch great shows on the go.", "verified": true, "helpfulness": "0/0", "author": "Cornell Menafee"}, {"rating": 3.0, "review": "Great interface.  I wish this worked better for me but it is having issues with my wireless network.  I do not have issues with my PC hooked up to the same TV.  I have always had issues with Prime vs Netflix.  I am not sure but would guess how they buffer data.  I will continue to play with this in my house.  I have a Chromecast with no issues but would prefer the Fire TV Stick because of the interface.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 2.0, "review": "The connectivity is bad!  Every time I turn it on it says there is a network connectivity problem.  The problem is with the stick not my network.  I have multiple devices that work perfectly fine with my wi-fi connection.  The only way to fix this is to unplug the device and plug it back in.  Extremely inconvenient and frustrating.  Returning today and going back to my reliable Roku device.  Don't waste your time or your money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Sorry, Amazon!  The ROKU box or stick reigns KING in this arena of streaming devices.  Even Chromecast beats out the Amazon Fire TV Stick and/or Box. ROKU is more open and has tons more channels and content available.  And, you don't have to be a member of the Prime Society of Amazon.  Only good thing about my purchase of this Fire TV Stick was that I bought it at the introductory price of $19.99 and turned around and sold it back on Amazon for $49.99. I took the profit and bought myself another ROKU 3 box that has all the whistles, including a jack for headsets that transmits wireless through the remote!", "verified": true, "helpfulness": "1/2", "author": "rsgallo"}, {"rating": 5.0, "review": "We love it!  We are watching movies and TV shows that we never had before!  My sisters loved it so much that they got one for themselves!", "verified": true, "helpfulness": "0/0", "author": "Renee Guzy"}, {"rating": 5.0, "review": "better then chrome cast and roku stick but youtube app need to be improvedalso i want to air stream thing", "verified": true, "helpfulness": "0/0", "author": "TechUnboxing"}, {"rating": 2.0, "review": "I feel like I've been cheated. I can't watch ESPN unless I have cable or satellite provider. If I had a satellite provider I would'nt need the fire stick. Looks like I'll have to set my chromecast back up to watch YouTube. Mislead, yes I think so. I didn't expect this from Amazom.", "verified": true, "helpfulness": "0/0", "author": "Mitchells"}, {"rating": 5.0, "review": "really great where you do not want to pay for another cable or dish box, or  in a remote area.", "verified": true, "helpfulness": "0/0", "author": "Macspidie"}, {"rating": 5.0, "review": "Easy to install, easy to use! Love having all out streaming sites in one place.", "verified": true, "helpfulness": "0/0", "author": "Cherie Harrington"}, {"rating": 3.0, "review": "Works out great.", "verified": true, "helpfulness": "0/0", "author": "Judith Fitzsimmons"}]