[{"rating": 1.0, "review": "Inferior to everything else I've tried.  The streaming speed is sub-par for both local media server (Plex) and internet streaming content (Netflix, ESPN).  Both buffered several times in the first minute from the same location I stream football (Sunday Ticket) and Netflix through my PS4 (also wireless connected).  The Roku in the other room never has issues with streaming content either.I had high hopes for this, but it seems like it's a wasted purchase (plus the $5 Plex app that I used once for 5 minutes).  Spend the money on a Roku.", "verified": true, "helpfulness": "0/0", "author": "D. Vargo \"meep_42\""}, {"rating": 5.0, "review": "Love it! It's been great in my son's room!", "verified": true, "helpfulness": "0/0", "author": "Liz Fogg \"Liz Fogg\""}, {"rating": 5.0, "review": "Still waiting for the product to arrive but it looks like a great tool for the TV.", "verified": true, "helpfulness": "0/0", "author": "Randy George"}, {"rating": 1.0, "review": "Audio issues and doesn't work on hdmi switcher - when i try it on a hdmi switcher , the picture just flashes off/on with out or with out the extend cable, and if i try it on the hdmi port without using the hdmi switcher , when i play videos, the audio get all strange , like if someone says time , it will sound like timeeeeeeeeee, or car will be carrrrrrrrr , ive messed with the sound settings , and even called amazon support , still have the issue.", "verified": true, "helpfulness": "0/1", "author": "rob p jennings"}, {"rating": 3.0, "review": "Seeing the other reviews, a lot of us have the same problem with the wifi, that is why I gave it a three stars, if you watch Amazon Prime on the go and you go to a friends house then this device is perfect, but if you use other apps like Hulu Plus then you going to have problems, like hiccups or glitches because the the wifi, because it doesn't grab the Internet that good like Roku does", "verified": true, "helpfulness": "0/0", "author": "Human Factor"}, {"rating": 1.0, "review": " I can't even get started.  I wonder if I have a finicky remote control. I found this quote from a review: \"The remote control is finicky. Sometimes it fails to register button presses; other times, a single button press repeats many times in a row.\"  Which doesn't sound so bad, unless you can't join the wifi network.Here's my experience:I opened the box, plugged it in as directed (had to use the HDMI extender), and saw the splash screen on the TV.So far so good.Clicked PLAY to startClicked SELECT to pick my WifI networkThe remote works!Then the on-screen keyboard showed up so I could type my WiFi password.The wheel-nav on the remote seems broken. Even the lightest press seems to send a continuous stream of \"move move move\" commands and the cursor slams up against the right side of the virtual keyboard. The nav wheel seems to  also be scrambled, I can't seem to get a consistent behavior (sometimes the picker scrolls the direction i click, sometimes down, etc).  I took a video too..Needless to say I can't evaluate the product w/o being able to attach the network.The other setup option \"use the virtual keyboard in the app\" isn't viable until the FireStick can join the network, so im stuck.I'll contact Amazon support and see if they've had problems with the remote and if I can get a new one.still Hopeful...", "verified": true, "helpfulness": "0/0", "author": "mtakacs"}, {"rating": 5.0, "review": "This thing is amazing!", "verified": true, "helpfulness": "0/0", "author": "Christopher Cole"}, {"rating": 4.0, "review": "It works well, to my expectation. Wish there are more TV channels but i suppose as long as you have either netflix/hulu/hbo this is enough for a \"non\" smart TV. I like the control, feels very smooth to touch and operate. There are some lag between pressing the bottom and navigating through the menus. Not enough to cause a huge issue and i'm not sure if that's due to the fire stick itself or my internet connection. However, I have realize that after prolong usage, sometimes the loading screen can get stuck and the stick need to be cool off or restarted (lol...a fire stick that needs to be cooled off). Only happened few times. I also wish there's an actual off button or selection in the menu so I don't have to navigate through 5 different places just to put the stick to sleep. Because technically, even after you turned off the tv, the stick is still \"functioning\" and i suppose this could sap away bandwidth? Just my two cents on a new product that still have potential to grow :)", "verified": true, "helpfulness": "0/0", "author": "antapolar"}, {"rating": 5.0, "review": "Works fine!", "verified": true, "helpfulness": "0/0", "author": "John N. Mitchell \"johnnmitchell\""}, {"rating": 5.0, "review": "Perfect! simply perfect! I am loving it.", "verified": true, "helpfulness": "0/0", "author": "Goku \"tech geek!\""}]