[{"rating": 4.0, "review": "Just have it a short time. But so far happy with it. Would recommend", "verified": true, "helpfulness": "0/0", "author": "LOLETTE GONZALEZ"}, {"rating": 5.0, "review": "Pretty cool little device.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 4.0, "review": "I've used the fire stick just aFew times and I'm impressed with the ease of both the set up and navigation of the device!", "verified": true, "helpfulness": "0/0", "author": "Bethany Westerfeldt"}, {"rating": 5.0, "review": "Very easy to use and lots of titles to choose from. The apps are a great way to see newer stuff, since the titles included with prime are mostly a few years old. Very easy to set up and operate with the included remote. Overall very happy and product met expectations.", "verified": true, "helpfulness": "0/0", "author": "Heather M"}, {"rating": 5.0, "review": "Awesome! Better than I ever imagined! So many great choices,  I down graded my cable package.  Definitely the best choice I've made so far this year.", "verified": true, "helpfulness": "0/0", "author": "Brenda Smiles"}, {"rating": 5.0, "review": "Best integration of Prime Video that I've found so far.", "verified": true, "helpfulness": "0/0", "author": "Brandon W"}, {"rating": 5.0, "review": "Easy to install.  Operates much like my Roku 2. I am very satisfied.  My 8 year old grandson picked up the remote and immediately began playing some Star Wars game that worked flawlessly.  Yet the remote is incredibly simple to use, only six buttons.", "verified": true, "helpfulness": "0/0", "author": "W."}, {"rating": 4.0, "review": "It met all of my expectations Im thinking I can drop my cable now..", "verified": true, "helpfulness": "0/0", "author": "Hal Dalson"}, {"rating": 1.0, "review": "i bought this thing to watch youtube from my couch since i have a bad back..when i finally got it(took a month)and turned it on to explore,i quickly realized that to watch anything you have to  buy,buy,buy......even youtube is not free..who the heck wants to buy amazon coins to watch any show...i feel the advertising was misleading,and so now i am going to return it...", "verified": true, "helpfulness": "0/0", "author": "Derek Davis"}, {"rating": 4.0, "review": "The fire stick is a excellent choice for people who have netflix and amazon prime. The movies start up instantly and the menu's are easy to navigate through.It froze on me one time but all I had to do was take it out of the hdmi port and insert it again and everything was fine.", "verified": true, "helpfulness": "0/0", "author": "BMAN"}]