[{"rating": 5.0, "review": "Awesome!!!!! Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Laura Keeney"}, {"rating": 3.0, "review": "The fire stick hardly ever works unfortunately. The majority of the time it says my wifi has a good or excellent signal but my fire stick is \"connected with problems\" but gives no explanation as to why it says that or how to fix it. I contacted help support but that took several hours and by the time I was able to talk to anyone it was working properly. However it keeps doing it at least a couple times a day so I've had to completely stop using it. I know it is not my wifi because we also have a smart tv and the Internet will stream video on it perfectly fine. I have been very frustrated with the product and am considering returning. My 3 star rating is actually pretty generous because I truly do love amazon products but this needs some work!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am a 68 year old woman and technology challenged.  Gave up cable and the Amazon Fire Stick is amazingly simple to install and operate.  Much easier than installing the antennae !", "verified": true, "helpfulness": "0/0", "author": "Janice Riley"}, {"rating": 4.0, "review": "great product, only complaint is the cable provider I have is not listed on any of the TV apps. xfinity does not allow access so if you have xfinity, xfinity this isn't the product for you. still love everything else Amazon offered.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Simple!  Simple!  Simple!  So far used it for Amazon offered TV, NETFLIX, and games.  Did learn to turn off cable TV box to free up more bandwidth for the Stick.", "verified": true, "helpfulness": "0/0", "author": "Jon L. Sweigart"}, {"rating": 5.0, "review": "It was everything we wanted.", "verified": true, "helpfulness": "1/1", "author": "Berti"}, {"rating": 5.0, "review": "This Is my first review. Just works out of the box. You only have to configure your wifi and you are done. Easy setup.Miracast works nice & easy. So you have a second screen for your smartphone.", "verified": true, "helpfulness": "0/0", "author": "JOSUE CERNA"}, {"rating": 5.0, "review": "This product is easy to set up and extremely user friendly.  Amazon has outdone themselves with this product.  It works great!  So great that I am planning to buy a second stick for another TV in my home.", "verified": true, "helpfulness": "1/1", "author": "Crystal Helder"}, {"rating": 5.0, "review": "Plenty of range. Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "If you have sattelite Internet and on unlimited data . It's not good. I didn't not know that it runs in the background and used 90 dollars of Internet in a day and half. We have 15 gigs a month and it renewed on the 8 th and on the 9 th I had already burned threw 15 gigs. I never used it until 12 midnight until we got our free data that did not go against my 15. So it burned threw it all while I was not using it. I had to unplug it from my tv.", "verified": true, "helpfulness": "0/0", "author": "Linda Russell"}]