[{"rating": 5.0, "review": "It is quite an amazing device  ...works really well and was well worth the 40 bucks", "verified": true, "helpfulness": "0/0", "author": "kimberly fitzgerald"}, {"rating": 2.0, "review": "Requires an internet connection at all times to work which is frustrating. I'm mainly using the Plex app in an RV and it's rare we have a decent internet connection.", "verified": true, "helpfulness": "0/1", "author": "Raj Choudhury"}, {"rating": 1.0, "review": "It hogs all of the internet signal. No one else in the house can use the internet when its on.  It also gets so hot I afraid it is going to catch something afire.  Wished I could return it, but I had it without using it for awhile.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Overall I am very disappointed with the amazon fire tv stick.  We bought this for our bedroom to watch Netflix and hbo on and stream other shows.  The stick was very easy to set up and connect to our wireless network but that was about it. Shows are constantly buffering and stopping all together. The wireless connection status is \"very good\" according to the stick but it does not stream well at all. We have very good internet and have no problem streaming on multiple devices all day long but this will just not work. Even when I shut everything else in the house off it still only streams about 50% of the time. I could understand if our router was on the other side of the house but it is only in the next room about 20ft away. I also tried to cast from my tablet to the stick since I can stream just fine on it but all it does is time out and won't even cast to it. Will probably see if I can get a refund which is a shame because I really enjoy amazon products like my kindle fire but this one just does not work. I am giving it two stars be cause when it does work it works well but those times are few and far between.", "verified": true, "helpfulness": "0/0", "author": "Kevin D Lacey"}, {"rating": 5.0, "review": "Excellent product. I never used it before. After 1 week i purchased  the Fire for my main tv and a Ooma for telephone. I turned in 2 cable boxes and canceled the service as well as telephone. I am 100% all internet now for tv and phone. Amazon prime is awesome and i signed up for Sling tv...my monthly bills are half what they were with cable. Awesome products and hence my reviee", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "I've been using my playstation to watch netflix and prime for a couple of years now.  This thing is much better, should have bought it a long time ago", "verified": true, "helpfulness": "0/0", "author": "jeremy weatherman"}, {"rating": 5.0, "review": "I can't get Spotify on the appleTV, or Amazon Prime, or some other apps I like. Fire stick is better for streaming as well, with fewer \"stutters\". I use both, but for this price, what a great addition to your entertainment portfolio.", "verified": false, "helpfulness": "0/0", "author": "gaylemichel \"oochie\""}, {"rating": 1.0, "review": "Have to pay for moives if they are not Prime and you pay for prime.", "verified": true, "helpfulness": "0/1", "author": "gigi"}, {"rating": 5.0, "review": "Great device! Easy to use & the phone remote app is awesome, works a little better/easier on the iPad than the iPhone for some reason. But all together worth the purchase, especially with Prime. I plan to get more for other tvs in the house.", "verified": true, "helpfulness": "0/0", "author": "Keith Yagel"}, {"rating": 5.0, "review": "This is AMAZING!!", "verified": true, "helpfulness": "0/0", "author": "kodamama"}]