[{"rating": 4.0, "review": "Every one of my tvs (all 5 of them) requires the external power source.", "verified": true, "helpfulness": "0/0", "author": "Jon A."}, {"rating": 1.0, "review": "TOTAL waste of money. First off Amazon is using false advertisement in their image of the product. The stick must be used in conjunction with an HDMI cord that must go from the stick to an electrical wall adapter and the adapter design takes up two outlet spots. They make it look simple like say the Roku but it is far from that. Also in their design flaw where the HDMI cord plugs into the stick is on the side instead of on the end so if you have another device next to it you will have to use the jumper provided between the stick and your HDMI port. design flaws aside, the thing did nothing after installed, yeah nothing. It must not be plug and play because it didn't work at all. I have used Roku for years, that is a great product and perfected, this thing is literally garbage. Don't waste your time or money.", "verified": false, "helpfulness": "0/5", "author": "Tommy W."}, {"rating": 5.0, "review": "Fire TV stick is fabulous .., if you own aTV ... You should have a Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "It works great, was very easy to setup and very little configuration is necessary. Love it.", "verified": true, "helpfulness": "0/0", "author": "Joseph Graziano"}, {"rating": 5.0, "review": "The best out there, great for all media streaming.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 4.0, "review": "No problem.  Works as advertised", "verified": true, "helpfulness": "0/0", "author": "El Flowers"}, {"rating": 4.0, "review": "I am just beginning to sample the streaming, but the set-up was extremely easy. Just make sure you are on the correct HDMI channel (mine is HDMI 2) through your TV input button.", "verified": true, "helpfulness": "0/0", "author": "Skyarch"}, {"rating": 5.0, "review": "This was a great buy. More than I expected. 100 percent better than Chrome Cast. No need for computer or phone to cast, just plug in stick and start watching. Great!!!!!", "verified": true, "helpfulness": "0/0", "author": "Donald Cunningham"}, {"rating": 5.0, "review": "TOTALLY WORTH THE WAIT!!! SUPER FAST SETUP AND OPERATION!!!!!", "verified": true, "helpfulness": "0/0", "author": "Robert Nelson"}, {"rating": 5.0, "review": "A great product with no problems and does more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Wade Duley"}]