[{"rating": 5.0, "review": "Love it. Super easy. We bought a splitter from Amazon so we could use the fire stick and our Apple TV. So many choices!  The only down side to any of these is most channels still require that you have some sort of cable/satellite subscription in order to access the channel. Hopefully that will change in the future. Love that Amazon Prime has such a huge selection of free/Prime inclusive movies and shows.  I actually prefer it over Netflix, Hulu, etc. by far.", "verified": true, "helpfulness": "0/0", "author": "Km cici \"lilly red reader\""}, {"rating": 5.0, "review": "Love this! Perfectly portable and easy to set-up and use. We have one in the bedroom and a Fire TV in the living room.", "verified": true, "helpfulness": "0/0", "author": "Laurel Hess"}, {"rating": 4.0, "review": "I love everything about the Firestick except one thing: the remote and the remote app for my android frequently become disconnected. It can be a pain fixing it.", "verified": true, "helpfulness": "0/0", "author": "David Wayne Knight"}, {"rating": 4.0, "review": "instructions NOT REALLY CLEAR.  I HAVE CALLED 4 TIMES TO FIX AND GET BACK ON LINE.I BELIEVE I HAVE NOW GOT FIGURED OUT AND SO FAR WORKING BETTER AND USE.  something NEEDED  to also discuss the streaming requirements.  Bottom line--a really neat gagate and hope works as well as my D-LINK in basement.Will work great now have some of the bugs worked out..", "verified": true, "helpfulness": "0/0", "author": "Gary R. Lee"}, {"rating": 1.0, "review": "I was very disappointed in this product. Nothing showed on my screen when I plugged it in, didn't matter how it was powered. Frustrated it has no indicator light to tell if it or the remote has power. Only got it to connect a few times, froze a lot when switching between menus. We returned it and have bought the full size FireTV. Very pleased with THAT purchase.", "verified": true, "helpfulness": "0/0", "author": "Ctmoose"}, {"rating": 4.0, "review": "Much better then the chrome stick. It comes with a controller which is a big plus, and it does everything the chrome stick can do plus amazon prime. Only reason why I give is a 4 star is because a lot of shows on amazon prime are half free, half you have to pay. It gets pretty annoying when you get up into a certain season in a show, and then it is no longer free.Other then that, I love it!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "I love this thing! It keeps me from needing to purchase a smart TV.  Great pic!", "verified": true, "helpfulness": "0/0", "author": "Teisha Hall"}, {"rating": 5.0, "review": "Love it...", "verified": true, "helpfulness": "0/0", "author": "Don Williams"}, {"rating": 2.0, "review": "It seems like it would be a great device, but I have a couple of complaints one of which has caused it to get put back in the box.1.) Maybe it is just my TV, but it will not function without the USB power adapter plugged into the wall, which makes it much less convenient.2.) It will not work with my satellite (Hughes Net) internet service.  It pauses every 5 minutes to buffer more of the movie.  Whereas my old Panasonic Blu-Ray player works fine with Amazon streaming movies.I will probably keep it for when I travel, since most hotels that I've stayed in recently have a TV with HDMI inputs, but I don't have high hopes for it working in that situation either.", "verified": true, "helpfulness": "2/2", "author": "RacerGT"}, {"rating": 3.0, "review": "My neice knew I had Amazon Prime and Asked me about this gadget. I told her it was cool for the price, But did not know she was getting it for me as a Christmas Gift. I have several movie subscriptions VUDU, Netflix, Hulu Plus already on my Smart TV's so I wanted to see what is the difference.PROS: Easy Set Up and User Friendly, it was easy to understand the navigations and Headings are Crisp and Easy on my old eyes. it has FREE Games! Love that I can change the pace from TV Viewing to Just lounge around and Play Games on my TV set \"You don't Know Jack\" is my FAV! ; Fire TV Offers FAB, Eye Catching Screens Savers with Sound (Fire Place and Fish Aquarium) ; Download the App -ALL CONNECT and you can stream to your Fire TV from your Phone, Tablet or PC, You can also remove  Heading Columns on the Home/Dashboard Page that You don't use -or don't want to see, There is a Weather App w/ Real Time Weather Info, AND BEST Thing- ALLL!! ALLL Seasons of My RuPaul Drag Race! is on there...(:) SUPER PLUS :) ) And you can add Favorite Shows to your Watch List w/Info on when the next new episode will be available.CONS: My Little Neice visits often. Be sure to have Disney On Demand to avoid that little disappointed frown look, because you will have to pay for these episodes they are not free ; Refresh and Network Connectivity:- SUPER LAGG! Be sure to disconnect any other device you have running on the same network for Less Buffering and Refresh Delays; Lots of Apps says \"APP NOT FOUND\" \"UNABLE TO CONNECT\". ; Games will say FREE, but then-> \"PURCHASE FAILED\".. You will have to wait a moment go back and retry Download again; And Also...Ad says: \"Voice Activated Remote Control\".. Great! But does not work with the remote that comes with the Stick, You have to purchase it separate for $29,SUMMARY- If you have Hulu Plus, Netflix and anyone can get access to Crackle online... You will have the same TV and Movie viewing experience with the Fire TV Stick except for the Games. This Stick is only good for members of Amazon Prime Annual Subscription and Membership is not included with Purchase, but Well worth the AZ PRIME $99 Per year subscription \"if\" you combo it with the Fire TV Stick.In my opinion, having the AZ Prime and Netflix Subscription Combo'd with Fire TV Stick - you really don't need Cable, just a Powerful, Fast Internet Connection. I also have a Chromecast, and as a GOOGLE FANATIC  I will place my bet on AZ Fire TV Stick for now because Chrome does not have control panel interface dashboard. With AZ Fire TV Stick you can Access Movies, TV, Books, Prime Music and Games located all in one spot from the Home Screen.", "verified": true, "helpfulness": "0/0", "author": "rosetta wilson"}]