[{"rating": 1.0, "review": "Terrible. Horrible. Doesn't work worth a crap. Wish I could give it negative 3 stars. Wouldn't connect to WiFi. Wouldn't let me log in to register. Won't download Netflix. Won't open apps screen. \"Loading...\" forever. Won't play shows I have purchased through Amazon. This device does not do a single thing it is supposed to do. Amazon's technical support is nothing but a guy saying \"reboot and try again\". I felt more knowledgeable just by Googling stuff. This was a complete waste of money and time. I thought about having another sent to me, in case it just my item, but I am not even going to bother. Going to get a Chromecast.", "verified": true, "helpfulness": "1/1", "author": "J. Gray"}, {"rating": 5.0, "review": "Very user friendly and just what we needed instead of cable tv or u-verse.  We have u-verse internet but didn't want the added cost and lack of choices that cable programming gives you.", "verified": true, "helpfulness": "0/0", "author": "glen a. carroll"}, {"rating": 5.0, "review": "Great replacement for cable connection with exception of news.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "Started right up and setup was simple. It has worked flawless thus far and the portability is awesome.", "verified": true, "helpfulness": "0/0", "author": "Tommy Sporleder"}, {"rating": 5.0, "review": "I bought these for my kids and they love them! It also helps me save money on my cable bill...one happy momma here!", "verified": true, "helpfulness": "0/0", "author": "Lacosta Carrell"}, {"rating": 5.0, "review": "Super easy to install and set up. It took less than ten minutes to open the package, read the instructions, install and register. I was watching the 4th season of \"The Killing\" on Netflix within minutes of receiving the device. Amazing...", "verified": true, "helpfulness": "0/0", "author": "ronald asher"}, {"rating": 5.0, "review": "Works like a champ.", "verified": true, "helpfulness": "0/0", "author": "Larry D. Weeks"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ellen Samuels"}, {"rating": 5.0, "review": "I love this.  Works great with Prime account.  I can watch almost anything.  I recommend this all the way!!", "verified": true, "helpfulness": "0/0", "author": "Lenny"}, {"rating": 5.0, "review": "It's going be a great device to have", "verified": true, "helpfulness": "0/0", "author": "Kirk dobson"}]