[{"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "MLW"}, {"rating": 3.0, "review": "My shared Amazon Prime status would not allow viewing of free movies!  Paid for stick now must pay for movies.", "verified": true, "helpfulness": "0/0", "author": "Debbie L Tharp"}, {"rating": 3.0, "review": "It would be ok if it worked consistently.  Don't know if it's a wifi problem or the stick.  The USB port is in the rear of TV so lack of exposure may be an issue.  Anyway, no luck so far.", "verified": true, "helpfulness": "0/0", "author": "David S. Nick"}, {"rating": 5.0, "review": "Works well. Compatible with Sling TV", "verified": true, "helpfulness": "0/0", "author": "P. Long"}, {"rating": 4.0, "review": "If you have Amazon Prime, this is a no brainer.  Get this because the Amazon prime content is spectacular.  The clarity and crispness of both sound and audio is impressive.  And, there is very minimal buffering (if any).However, if you do not have Amazon Prime, it can seem to push everything Amazon a bit too heavily.  The UI is designed only for Amazon Prime users.  As I don't currently have Amazon Prime, I find I only use the Recent selections because everything else is Prime related.  Also, I think the filtering/categorizing for content could be better instead of browsing through a long list of TV shows and movies.Some applications are hit and miss.  I've found Netflix to work very well.  Sling performs very poorly, but could be Sling itself.  YouTube seems laggy at times.  Outside of these, most apps work fine with the occasional hiccup that can be resolved by restarting the device.Games work well.  I've only played a few and so far so good.  The remote works well for them.Lastly on the remove, it seems to have the occasional problem with scrolling all the way to one direction when selecting left/right.  More of a nuisance than a major problem.Ok, I've pointed out all the faults, but it is a nice product.  The library of apps are growing and it offers greater functionality of chromecast. The mirror cast works pretty well.  And of all the available options for HDMI stick streaming devices, I believe this is the best choice for those with Prime and a good option even for those without it.Summary:Pros:Spectacular Amazon Prime contentCrisp, responsive video (especially for Amazon and Netflix content)Games work well, no performance problemsCons:Some apps are buggy (Sling)UI design could use revampingController can go haywire from time to time", "verified": true, "helpfulness": "0/0", "author": "Luis Rocky"}, {"rating": 4.0, "review": "Easy to connect and navigate. Love the apps, I can download everything I want to personalize my fire TV. Definitely need to add amazon prime to have access to movies and tv shows. Otherwise Netflix and Hulu memberships are a must. Great alternative to cable", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very user friendly!!!!!!!!  So many apps. and for the most part, they work!  At least the ones I've selected!  I'm lovin this!!!!", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 5.0, "review": "Fast streaming without interruptions and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice item!", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 1.0, "review": "mine is stuck at this screen all the time,it was a waste of money,i probably had a manufacturer defect,wish i can get money back but too late.", "verified": true, "helpfulness": "0/0", "author": "Daniel Schenk"}]