[{"rating": 2.0, "review": "It doesnt work in Mexico and I was not advise of that before purchasing", "verified": true, "helpfulness": "0/1", "author": "B. V. Ch"}, {"rating": 5.0, "review": "Works great and fast. Much better than the smart blue-rays I have been using. Good product, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rod \"Buyer\""}, {"rating": 2.0, "review": "The only way to turn it off is unplug it from your wall outlet.Who the heck design an electronic product and don't include an off button?With that said, it does work as intended, a bit slow (especially the youtube app) but it's not too bad.The fire stick is like all other Amazon tablet or phone, it's mostly design to bring Amazon products to the user. Third party apps like Netflix is more of an after thought, that's my biggest complaint with these amazon electronics. Amazon is very aggressive in their attempt to get you to buy/shop on Amazon and the Fire stick is no exception.I easily recommend the Roku over the fire stick. The Roku is more universal with way more channels while the Fire stick is mostly a Prime Instant Video stick.I bought it for $20 and it's worth it for that price if you have prime, but if you don't have prime it is just a useless paper weight.", "verified": true, "helpfulness": "0/0", "author": "K.hang"}, {"rating": 1.0, "review": "Good for short term play.  I say this because things start to buffer big time after a while.  Netflix,  amazon,  pbs kids... after streaming shows for about 30 minutes it has to load and reload a lot, and it goes from being great too being annoying. The games are also very limited,  you can sideload android apps, but most won't work because it's a nontouch screen device.  Honestly I can only imagine,  but if you get a fire tv, then get the full size one,  as the stick seems weak and buggy.  Also it gets really hot under normal use.Update**The wifi signal was completely lost by all the tv's electrical noise.  I contacted support and they quickly did some trouble shooting.  I added the hdmi extension that came with it, and unplugged then replugged in the power after it cooled down.  And so far it works.  Makes sense that the unit was trying to stay connected through all the noise causing it to heat up,  and buffer a lot while streaming.  So I'm bumping this up to a 2 star... if it solves the problem then I'll bump it up to 3 in a month if everything stays the same (hopefully more apps will work with it in a month then a 4 or 5 star could be possible)Update part 2The controls stopped functioning the unit is acting possessed... back down to one star.  Going to return this unit.  Looks like a lot of people are having problems with these units.  Like i said before don't buy this.", "verified": true, "helpfulness": "0/0", "author": "S. McClung \"Awesomeness\""}, {"rating": 5.0, "review": "I saw the specs on this device and decided to pre-order (2). I got google's chromecast about a year ago and was happy with the device for the price, it streamed netflix on my tv from my iPad, it's that simple. Although after a few months I noticed the chromecast lags and has minor inconveniences like no autoplay for binge tv watching. So, when I saw the pricing and specs on this device I knew this would be perfect for family members. One device was given to my parents and they love it. Easy set up and easy navigating, no external control device needed and they get all their favorite movies and shows on their living room tv. The other was given to my girlfriend, she loves that you can download different apps like Pandora and uses her tv as a multimedia center. The only downside so far I can think of is the fact you need an amazon account, not that big of a deal in my opinion since most people in my family have one anyway but can't find anything I don't like. Will probably order a few more for stocking stuffers and of course for me!", "verified": true, "helpfulness": "0/0", "author": "Subhash Modasra"}, {"rating": 5.0, "review": "Great product.  Since I have a home theater system with an amplifier, the stick plugs into one of the HDMI ports on it, NOT the television. Everything works as advertised and adds a lot of value to my TV watching experience.  Have watched several movies on Amazon Prime and could not be more pleased.", "verified": true, "helpfulness": "0/0", "author": "JLB_TX \"Critical Eye\""}, {"rating": 1.0, "review": "Netflix isn't working on this device for me, and I'm not the only one.  Both Netflix and Amazon are giving me the run around when contacting them for support.  The kicker?  This all started after an update was pushed to the device.  And of course there's no way to go back to the old, working version.", "verified": true, "helpfulness": "1/2", "author": "Andreas Kasprzok"}, {"rating": 5.0, "review": "I bought 2 when they were on sale for $19. We were pleasantly surprised to discover you can play games on it as well.", "verified": true, "helpfulness": "0/0", "author": "Alvin A Borromeo"}, {"rating": 1.0, "review": "VERY disappointing. Wifi issues. It's keep disconnecting. Waste of money. you're better off with a roku. If there is no update in a month, i'm returning both sticks. Luckily I bout it when it was on sale for $19....", "verified": true, "helpfulness": "1/2", "author": "C&B"}, {"rating": 4.0, "review": "Absolutely love it, we have been watching a lot of prime movies. The only problem is that at the last part of the movie it will say that the internet connection is too slow and stop playing the movie. Very frustrating! I reset the Fire Stick and it will then finish the movie so I don’t think my connection is the problem. Other than that issue we are enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Barkfire"}]