[{"rating": 4.0, "review": "We've been using the Fire TV stick for about 3 weeks now, and so far we are loving it. The video feed is really clear and lag is minimal. There are a lot of shows and movies to choose from, which is great, but my wife and I have an issue with the selection that prevents us from giving this a 5 star rating (and maybe this is more a knock against Amazon Prime than the stick itself) - a lot of shows, the newer seasons you have to pay to watch. This is fine for shows that are currently still making new episodes. We don't mind having to pay to watch the current season of Doctor Who, or Walking Dead, for example...but trying to watch an older show (our personal example) like Inuyasha, where the first 3 seasons are free but then you have to pay for the final 3 or so seasons...that's kinda silly to us. We're already paying a hundo a year for Prime, the least they could do would be to get the licensing to make the ENTIRE SERIES of these older shows free for Prime members. Again, more of a knock against Amazon Prime than the stick.One other thing we have noticed is that the stick does not hold wifi connection as well as our Kindles do. There have been a few times when the stick is buffering or just cuts out altogether, but we can watch shows just fine on our Kindles with no buffering at all. It would be nice if there was a remedy for this issue, but it seems even deleting the wifi from the stick's list and resetting it only helps the problem about half the time. This seems to only be an issue during peak internet times though. I personally watch stuff later at night, and it does not seem to be an issue then.Overall, our family is really liking the Fire TV Stick. Lots of options for shows/movies for myself, the wife and the kids. And it's super-easy to set up and to navigate. And if you're a Prime member, this is a no-brainer of a purchase.", "verified": true, "helpfulness": "0/0", "author": "J. M. Bistodeau"}, {"rating": 1.0, "review": "I have not tested the Chrome stick or the Roku, but I am pretty disappointed in its avalability to connecting with the WiFi. Nothing else in my house has this big of problem so I wish they made it so you could hardwire it to the Internet.", "verified": true, "helpfulness": "0/1", "author": "Samuel Hayes"}, {"rating": 1.0, "review": "Doesn't work. Connects to wireless but says it is not. So far can't even use it.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 1.0, "review": "I'm an avid Apple user... That being said this product ROCKS!!!! Way better than Apple TV!!!update:so after a few weeks of using the fire stick... let me say... IT IS BUNK. The connection to my internet NEVER LASTS.... I MEAN NEVER. i have to go in and out of shows all the time, over and over and over... its ridiculous. Most times i end up watching the rest of the show on my damn phone! BUNK.", "verified": true, "helpfulness": "1/1", "author": "NuNu"}, {"rating": 5.0, "review": "great movies", "verified": true, "helpfulness": "0/0", "author": "LARRY DITHOMAS"}, {"rating": 5.0, "review": "Seriously awesome for cheap. I love the Fire Stick and it totally replaced having to pay hundreds for cable. One of my favorite buys ever.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my fire stick, keeps my grandson entertained.", "verified": true, "helpfulness": "0/0", "author": "srbjoyce"}, {"rating": 5.0, "review": "I love my Fire Stick!  It isextremely easy to use and now I can watch all of my Netflix and Amazon stuff on my TV.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Great size. easy to install", "verified": true, "helpfulness": "0/0", "author": "Dennis Scholl"}, {"rating": 3.0, "review": "NOT REAL SURE ABOUT IT YET", "verified": true, "helpfulness": "0/0", "author": "Suzanne"}]