[{"rating": 5.0, "review": "Just got two sticks today! Very easy to set up and get started with. Very intuitive! I love how it is integrated into my Amazon account. Kind of creepy, like it reads my mind (at least tracks my searches). Instant hit, adding layers of entertainment to our cable less household! Looking forward to exploring more!", "verified": true, "helpfulness": "0/0", "author": "Erin Mounsey \"Erin of Christ\""}, {"rating": 1.0, "review": "I really hope I can up my star rating one day. But, today is not the day. I have Roku 2, Roku 3, and now the stick. I thought it would be nice to have something more portable than the Roku for when I travel. I just watched back to back 22 minute sitcoms, one on the Fire TV stick and one on my Roku 3. The Fire TV stick kept pausing. No indication of buffering or anything. I'd say it happened about 10 times through the episode. Then, just to make sure my internet wasn't being flaky, I watched another episode on my Roku 3. Not a single issue. Played right through. Because of this, I have to rate the stick a one. Hopefully the firmware will be updated to be a better performer in the future.", "verified": true, "helpfulness": "1/2", "author": "A Customer"}, {"rating": 2.0, "review": "Sorry I love amazon and I like most amazon products but this is a non starter.  I have the roku and its far faster. The display is ok not great and the same for the interface.  What really bugs me is no vudu. Vudu is the best quality service and if you create a streaming device without vudu its a huge minus.", "verified": true, "helpfulness": "1/3", "author": "The Ben Man"}, {"rating": 4.0, "review": "11/30/2014I've only had it a couple days, so I'll update this review if something changes.Pros:Responsive interfaceQuick setupPlex app works good for stream from my PCSupports cast to TV from YouTube app on smart phoneMany app choicesDecent free content with many appsVoice search from fire TV smart phone appBetter Netflix interface than my blurayCons:No live news appI am super happy with it and recommend it!Update: 12/2/2014today the device seems unstable. Once Netflix would not load, power cycled device. Then it worked well for an hour. then after a 30 minute break, starting a different show resulted in a pause/play endless loop where the show paused for half a second then played for half a second, repeat. :(the netflix loading issue could be device hardware, device OS, flaky internet/router, but I don't think you can blame the netflix pause/play loop on my internet connection. Seems more like a software bug. Maybe an OS update in the future will make it more stable.Update: 12/13/2014device still has great features, but stability is lacking. I hope a firmware update comes out soon to make it more stable. I do not like to have to power cycle it so often.", "verified": true, "helpfulness": "0/0", "author": "Paul \"Computer_Guy\""}, {"rating": 3.0, "review": "i was under the impression when I spoke with customer service that I would be able to cast to the stick from my iPhone just like I would with chromecast. Unfortunately this isn't the case and requires an android based companion app. I really wish they would support casting because it's built right in to many iOS apps like my Synology DS Video app.Maybe time will tell.I do like the built in apps and the performance.", "verified": true, "helpfulness": "1/1", "author": "Brian C."}, {"rating": 5.0, "review": "Easy to set up and streams nicely!", "verified": true, "helpfulness": "0/0", "author": "Denise Magick"}, {"rating": 5.0, "review": "Wow hard to tell that it is actually a dual core and yes i have many other devices to compare it with.Once i installed XBMC 13.2 that was the moment i fell in love. The xbmc was running so well that i was blown away. I love that it was also pre registered to my account saved time with that. The 1080p is okay but not as good as the tronsmart vega s89 that i own but this willl make a great device to put in my little brothers room. I went ahead and ordered two of them because they where only 20 bucks couldnt pass it up. Now i wish they would go back to 20 bucks so i could order a next 2 so i cant send it to my parents house. The device is my first fire device and buy the looks of it it wont be my last one. There is little to no lag whiles navigating. When in XBMC streaming content 720 or 1080p it also handles it very very welll. Rarely it had buff and even then when it buff its only for a second or two and it only happens once. Trust me guys got like 5 android based devices to compare to this.Play jam game stickMinix neo g4Mobie Gala TV quad core (pretty good even though its not that popular)Tronsmart Vega s89 quad core ( honestly its a power house machine)and the fire tv sticks makes me feel like i am using my vega s89 when playing some videos because of the speed", "verified": true, "helpfulness": "25/26", "author": "deangelo bonimy"}, {"rating": 1.0, "review": "It is really slow and also the initial setup took almost 1 hr 15 minutes. First time, when i try to set it up, it was not downloading the update and i got an error. Then i tried many times and it failed again and again. I remove the power for couple of hours and then i started setting it up and it started to download the latest software and the download took almost 45 minutes to complete (My internet connectivity is almost 40 Mbps. Once its downloaded and installed the software, then i tried to watch a Prime movie, but it was really slow and it was buffering. I have the Roku which has the same apps and it has a very good streaming over the wifi. I pre-order this item and was waiting for the arrival and it really disappointed me. Still Amazon needs to improve on its service.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The Fire TV Stick itself is a great product. The problem I had was with the HDMI extender that I needed to use as my tv is mounted to the my wall.  With most manufactures this would not be a problem as they would just send you that part.  Not with this manufacturer (Amazon).  The whole thing has got to go back and by the way its back ordered and won't be available for approximately two months.  I ended up buying a similar HDMI extender of Ebay for a few bucks but it sure is disappointing the original equipment does not work out of the box.", "verified": true, "helpfulness": "0/1", "author": "jvi"}, {"rating": 4.0, "review": "For the price, I like it!I have a Chromecast and I love it because I love being able to \"cast\" content to my TV from my laptop, ipod touch, phone, tablet, basically whatever I have available.  So far the Fire TV Stick is lacking that feature in the sense that I have to have my Android tablet available to do it. I hope they eventually come out with a chrome extension or windows 8 app, etc.However this does trump my PS3 when it comes to watching Amazon content and that is why I justified the purchase of this over another Chromecast to \"upgrade\" another tv with.That pre-order price was too hard to pass up.I do love the remote. Don't love the fact that the Stick complains that I plugged it directly into my TV's usb port (though confusingly, it still works fine but complains that it is not plugged in using Amazon's included plug) I assume the dual core requires a bit more power than what the TV can output so it might limit processing a bit but in a pinch I am glad it still allowed me to use it.I think this thing will improve with time so I am holding out full judgment but for now I am still a bigger fan of the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "M. P. \"UpIrons\""}]