[{"rating": 5.0, "review": "Love it! It makes our Netflix and Amazon Prime experience so much easier and faster! Wish I'd gotten it sooner!!!", "verified": true, "helpfulness": "0/0", "author": "Elena Rivera"}, {"rating": 5.0, "review": "Love it! I cant believe I just now purchased this product. This is better than Chromcast and the Roku boxes.", "verified": false, "helpfulness": "0/0", "author": "Moises Diaz Jr"}, {"rating": 5.0, "review": "The Firestick has met my expectations. I am really happy with all the choices to choose from.", "verified": true, "helpfulness": "0/0", "author": "Mary Almonte"}, {"rating": 5.0, "review": "This thing is amazing and well worth the price of admission.", "verified": true, "helpfulness": "0/0", "author": "Taryn"}, {"rating": 5.0, "review": "Very easy to use! Everything I needed in a compact easy to instal device!", "verified": true, "helpfulness": "0/0", "author": "E. Costa \"Hamm\""}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "James R. WIlkins"}, {"rating": 1.0, "review": "Roku is better, wasn't impressed with the fire stick.", "verified": true, "helpfulness": "0/1", "author": "brealee"}, {"rating": 5.0, "review": "Really exceeded expectations! I'd been using a Google Chromecast and a Roku box, but recently got deeper into the Amazon ecosystem with my Prime membership using Prime Music and Amazon Cloud Drive. The Fire TV Stick interface is amazing. I never thought access to my media library could be this robust. I was watching old home movies right on the TV from the cloud that I probably never watched until today. Shot the video and then forgot about it because there was no easy way to access and view it. Now all of that content is available for viewing with my Fire TV Stick and my Amazon Cloud Drive. I also downloaded the remote app for my phone so I can use voice commands. This device and user interface is unbelievably superior to what I had. Just wonderful. I immediately bought a second one for our other TV.", "verified": true, "helpfulness": "0/0", "author": "john watters"}, {"rating": 5.0, "review": "I love it now that I got it to work. You absolutely MUST use the USB power supply that is included with the unit. I couldn't fit it into the space behind my flat tv so I used another that was on a 90 degree angle. It acted so weird that I finally returned it for a replacement. When the new one acted the same way I tried it on my other TV set which had plenty of space behind and Voila' it worked perfect on the supplied power supply.", "verified": true, "helpfulness": "0/0", "author": "Steveb"}, {"rating": 5.0, "review": "So far so good.  Working as it should. Bought it just to connect to Netflix so it has provided that.", "verified": true, "helpfulness": "0/0", "author": "tony johnson"}]