[{"rating": 5.0, "review": "The first one I got was a dud. Nothing happened when I plugged it in. I called Amazon and was sent another that had been \"tested\" first before being sent. That did the trick. Had it up and running in less than 10 minutes. Granted I only watch a few of the programs offered but my Netflix movies (easy to sign in) and my Amazon Prime movies were all there. I love the ease of using it and the phone apps looked great but I didn't really need them. I had had a Roku which I did have some issues with and then the reset \"button\" fell inside the last time I tried to reset it. A new one was almost $100. The Fire Stick was much less PLUS Amazon will stand behind it. I'm a happy camper!", "verified": true, "helpfulness": "0/0", "author": "Maine Coast \"Beth\""}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "yosvani quinones"}, {"rating": 4.0, "review": "Great device, great price", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "No problems. Amazon netflix or you tube easy to watch", "verified": true, "helpfulness": "0/0", "author": "Daniel Goyzueta"}, {"rating": 5.0, "review": "Very happy with my new streaming device. It works as advertised. I will be purchasing more for my other televisions.", "verified": true, "helpfulness": "0/0", "author": "Ryan Hobart"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Evelyn Toro"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'm still not quite sure how I feel about this product. I joined Netflix and have been able to watch the first season of Grace and Frankie. Sometimes it was difficult to find when I went back after a break. I'm sure I'm not doing something right. I just haven't figured out what it is yet. Also when I wanted to watch a few movies I was given the opportunity to rent. I am a Netflix member. I thought they would be free. I need to play with this more. Kinda wishing I had just purchased a Netflix stick.", "verified": true, "helpfulness": "0/0", "author": "Keemee"}, {"rating": 5.0, "review": "works as stated", "verified": true, "helpfulness": "0/0", "author": "Raymond F. Maceira \"Ray\""}, {"rating": 5.0, "review": "Amazing device... Works great with the mirroring feature...", "verified": true, "helpfulness": "0/0", "author": "Raul"}]