[{"rating": 5.0, "review": "I love it and think I am getting rid of cable.  I bought one for my son's room and one for our room.  I was able to place parental locks on my son's without having the same on the one in our room.  I also enjoy that it is easy enough to move from one room to the other if need be.  We can watch both at the same time and not have any lag time.  I also enjoy the phone app which lets you use your phone as a remote control.  I also enjoy the trivia games which let you have multi-players and is fun if you have guests over.  I have Amazon Prime and Netflix between those two I never run out of things to watch.  Don't think about it just buy it already.  You will not regret it.", "verified": true, "helpfulness": "0/0", "author": "KJ Arvie"}, {"rating": 5.0, "review": "I haven't had time to set it up and start watching movies until today and I got to tell you: \"very impressed and satisfied costumer\", easy set up, nice variety of options to choose from to watch and enjoy!I do have an old version of roku and this is better, simple to use and more practical!!! Plus it only cost me $1 since for my birthday someone gave me a $40 Amazon gift card!!!", "verified": true, "helpfulness": "1/1", "author": "Mr. Z"}, {"rating": 5.0, "review": "Fire TV rocks. Very impressed!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "I bought two of the Amazon Fire Sticks and I have been using them since the day i received the package. They were very easy to set up. My 49 year old dad who is not very familiar with technology was able to easily set one up and I set the other one up.  The instructions walk you right through the setup process and it only takes about 5 minutes. I have Amazon Prime as well as Hulu Plus and Netflix. We use all of these features on the Fire Stick.  Everything is so simple and straightforward my whole family can navigate and use the Fire Stick with no problems, including my 7 year old brother. The only problem we have had is at times it has unexpectedly quit working and a message pops up saying \"Unable to connect to Amazon services. Please check internet services and try again later.\", even thought our Internet services seemed to be working fine. When this has happened we unplug the Stick from the power source and let it cool down because it gets a little warm and then after an hour or so it seems to work fine. This has been the only problem and overall we are very satisfied with the Fire Stick and would recommend it to anyone who needs streaming services on their TV.", "verified": true, "helpfulness": "0/0", "author": "BriB"}, {"rating": 5.0, "review": "Amazon Fire TV Stick is an awesome product!  Its just like Gary Busy says int the commercial just plug it in and enjoy watching your favorite shows.  It allows us to watch Amazon prime, or pay for films and tv shows with the remote.  It allows us to watch Hulu and Netflex and YouTube.  I just love this product and the price was perfect!", "verified": true, "helpfulness": "0/0", "author": "M. Medeiros"}, {"rating": 5.0, "review": "perfect to watch movies", "verified": true, "helpfulness": "0/0", "author": "Olga Lastra"}, {"rating": 4.0, "review": "I would like if the streaming could be more steady, instead of cutting me off if the internet is lagging, I don't mind a lower Quality of streaming for a few minutes if the stream get optimized again.", "verified": true, "helpfulness": "0/0", "author": "Bjarne Jensen"}, {"rating": 4.0, "review": "Similar to apple tv", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "It's great if u have prime lots of movies some good ones but a lot of non mainstream ones that are interesting now they have hbo go as well which makes it even better", "verified": true, "helpfulness": "0/0", "author": "H. Hadfield \"pangia\""}, {"rating": 4.0, "review": "Watched my first two movies this last weekend. Easy to install, easy to use.", "verified": true, "helpfulness": "0/0", "author": "The Girls"}]