[{"rating": 5.0, "review": "has all the great shows, plays right away, no waiting. plays music and games. Its awesome!", "verified": true, "helpfulness": "0/0", "author": "amy"}, {"rating": 5.0, "review": "As advertised and expected.  Can't really ask for more.", "verified": true, "helpfulness": "0/0", "author": "--shopper"}, {"rating": 5.0, "review": "I did have to read how others were able to put the batteries in.  It was difficult to open the device.", "verified": true, "helpfulness": "1/1", "author": "luckybuck"}, {"rating": 1.0, "review": "Not enough apps", "verified": true, "helpfulness": "2/4", "author": "Hina Rashid"}, {"rating": 5.0, "review": "Great picture! We love to use our kindle as a second screen and read all about what we watch! I like it better than my chromecast!", "verified": true, "helpfulness": "0/0", "author": "mama_pd"}, {"rating": 5.0, "review": "Very easy to set up. In no time we were watching movies an series from Amazon as well as Netflix", "verified": true, "helpfulness": "0/0", "author": "R Rio \"Raul Rio\""}, {"rating": 5.0, "review": "I got this because I'm tired is paying $40/year for Xbox Live!  I got this today and it's amazing, way better than Xbox 360 for Netflix and Amazon instant video.I love the remote and you can download an Amazon Fire Stick app to use your phone (I'm using android) as a remote too!  This is pretty awesome.  It also comes with a HDMI extension in case your TV can't take the stick directly plugging into the HDMI slot for space/physical reasons.  I thought I'd have to buy one but I am so glad they included it!So far is super fluid and without lag watching Amazon video.  I love how you have options for closed captioning, you can adjust font size and color.you can set parental controls for purchases and setup options using a 5-digit pin - perfect for our house of kids.I'm still keeping my Xbox 360 for non online gaming plus I can plug the USB cable from the Amazon fire stick into my Xbox for power.  Just ignore the insufficient power notification - for me it works great.", "verified": true, "helpfulness": "1/1", "author": "lh \"-lh-\""}, {"rating": 5.0, "review": "Much nicer than ROKU, more options than netflix.  worth it!", "verified": true, "helpfulness": "0/0", "author": "Douglas F Oppelt"}, {"rating": 4.0, "review": "Bought it primarily for hookup to large screen TV.  HDMI connector on Firestick would not fit into extra HDMI port in back of TV.  I tried it outon a smaller screen TV and it works fine.  I like the Firestick very much.", "verified": true, "helpfulness": "0/0", "author": "Sox Fan"}, {"rating": 4.0, "review": "easy to use and has many movies but would like more free old, old movie classics", "verified": true, "helpfulness": "0/0", "author": "lb"}]