[{"rating": 5.0, "review": "Only had it for a week, but so far I love it.  Easy hook up and works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Prime is my favorite product!", "verified": true, "helpfulness": "0/0", "author": "M. Murdock"}, {"rating": 5.0, "review": "Great device; really useful if you have prime. You can get rid of the cable or at least a couple of cable boxes", "verified": true, "helpfulness": "0/0", "author": "EDWIN HORNA"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Shane Simpson"}, {"rating": 3.0, "review": "Keeps dropping internet connection. My router is only 3 feet away.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "This thing saved me $900! We were looking at buying a smart tv and then I discovered this little gadget!!!! Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Christine Martinez"}, {"rating": 2.0, "review": "Expected to link more apps with the stick", "verified": true, "helpfulness": "0/0", "author": "carol white"}, {"rating": 5.0, "review": "I have only had this Stick for about 3 weeks and I use it about 5 to 6 hours a night. This is a great device. I also have a older Roku and the Stick seems to be a lot better. The only complaint  that I have so far, is the fast forward and rewind. It is not user friendly. It was very easy to set up and all the controls are easy except for fast rewind and forward. I have a Iphone 5c and was able to download app that has same controls and you can speak a movie or whatever and it will find it for you!!!!!!!! Voice operation  really does work!", "verified": true, "helpfulness": "0/0", "author": "RICk LASLO"}, {"rating": 4.0, "review": "I can't  talk about the Fire Stick without talking about Chromecast because I bought it to fill the gap I couldn't fill with it (e.g. Kindle to TV). I wanted to play Kindle apps on my TV and this fills that role. I was pleasantly surprised at how much more it does. Movies, TV, games, etc...everything on my Amazon Prime acvount is accessible. Even Spotify (which really irked me on Chromecast though the Spotify Connect app is not the same...we need Spotify apps for all, but that's  Spotify's fault). I cut the cable cord and the Fire Stick fills the void for entertainment quite nicely. It has become my goto media gateway. I have had a few connectivity issues, hence only four stars. Fix those and make the Fire Stick more stable, and I'll gladly add the fifth star. Overall, well worth the $39.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as represented..... I am having trouble with the Air Streaming App connecting with my IPad but all else is working fine....", "verified": true, "helpfulness": "0/0", "author": "GregariousHermit"}]