[{"rating": 1.0, "review": "BIG MISTAKE.....DO NOT DO THE SAME JUST DO NOT PURCHASE FIRESTICK....we found out that it will not work without a router according to\"tech\" and could not accept wifi with sprint either.....IF all of these properties are in charge, why not let consumers know in advance of purchase...we are truly angry and made repeated efforts to Amaaon for tech help. calls were not returned and advice on phone was ridiculous, they asked us more questions that answers.....did not know what a \"hot spot' device was with wifi...kept stating we needed router....well, another 150$ for another service to do this? Why do they continue to sell and distribute an item that is non functioning to begin with, it buffers constantly and cannot accept1 min of movie on Amazon Prime.....horrible and sadly misrepresented to public and this is shameful considering Amazons past good reputation..this item needs to be removed and accepted as it is......WORTHLESS. DO NOT INVEST IN IT.....if this product is so great, why does it not work....many many have same issues....we have high speed internet which is what Amazon states is ALL that is required...we have  that...now they state it has to be Cox or Century link.....we are so worn out and tired...who runs the quality and tech care????? does anyone have knowledge for us....would so appreciate techs could not find any answer except to return item and they said that over and over....no help just send it back.......thanks for any help.", "verified": true, "helpfulness": "1/4", "author": "Lives with cats"}, {"rating": 5.0, "review": "I've had the Fire Stick since they came and they're awesome. Easy to set up (though you are forced to watch a 5 minute video that I wish you could skip. I bought one for myself and for my parents. It's easy enough for my dad to use.", "verified": true, "helpfulness": "0/0", "author": "Joseph Johnson"}, {"rating": 5.0, "review": "I just got a free PSN code from[...]", "verified": false, "helpfulness": "0/2", "author": "Collin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Richard Dunn"}, {"rating": 5.0, "review": "This Fire Stick is just what we needed.  We mostly watch Netflix and going through the Blu Ray player was slow and didn't always connect.  So far, we've had no connection problems through the Fire Stick.  We also travel to Florida in the winter so this will be so much easier to take along with us than the Blu Ray player was.  Its easy to use and we have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Patrice K. Cherry"}, {"rating": 5.0, "review": "Great access to all kinds of services and providers. Great when traveling and staying in a hotelroom, as long as the tc accepts HDMI plugs", "verified": true, "helpfulness": "0/0", "author": "D.D.M. \"ddm\""}, {"rating": 5.0, "review": "Should have purchased sooner.  It works great, was very easy to hook up,  had it running in under 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Anglea M Woods"}, {"rating": 5.0, "review": "Love it so much👍👍👍💖", "verified": true, "helpfulness": "0/0", "author": "E jackson"}, {"rating": 5.0, "review": "Really enjoying the Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Brad Stafford"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "anton bova"}]