[{"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Diane A Cooley"}, {"rating": 5.0, "review": "love it! easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "I love this!", "verified": true, "helpfulness": "0/0", "author": "Deidre Burke"}, {"rating": 5.0, "review": "Love it.I wish it worked with Plex!", "verified": true, "helpfulness": "0/0", "author": "Brian Dunlap \"Bravo Romeo\""}, {"rating": 1.0, "review": "I will add to the folks that had a terrible out of box experience.  After setup and updates it gives the \"We Are Unable to Contact Our Servers\" message, despite strong wifi signals AND the device is able to send me email (photo links)  It is NOT a network problem and all my account features work from a browser.  There are posts online about this issue but no resolution or response from Amazon.Also it wants to bill me in UK currency?!?!  2 hours of my Sunday morning wasted.", "verified": true, "helpfulness": "1/1", "author": "Squeaky"}, {"rating": 3.0, "review": "To be able to watch anything recent or worthwhile one has to be a member of Amazon Prime which is a $100 committment. If the tech geek had explained that to me I probably would not have bought the device. I bought a couple as presents but will definitely explain to the recipients of this device the complete deal before they begin to try to use it. On a good note it was easy to install and start using.", "verified": false, "helpfulness": "0/0", "author": "Anne"}, {"rating": 5.0, "review": "LOVE THIS THING!!", "verified": true, "helpfulness": "0/0", "author": "RD"}, {"rating": 4.0, "review": "If your a prime member this works good for Amazon content, but a gaming console has a lot of the same apps", "verified": true, "helpfulness": "0/0", "author": "fonzo"}, {"rating": 5.0, "review": "I find this very comparable to Roku. Easy to navigate. Allows you to watch from many different avenues (Youtube, Netflix, Hulu .....) Works quickly, very little lag.", "verified": true, "helpfulness": "0/0", "author": "JRope"}, {"rating": 4.0, "review": "Bought this to access shows from my Prime account. Product works great but free Prime shows are few and far between. Very disappointed in free selection. Most titles are are sale.", "verified": true, "helpfulness": "0/1", "author": "Lynn"}]