[{"rating": 5.0, "review": "Got this free with sling, best free item ever. I'll probably be buying an extra also.", "verified": true, "helpfulness": "0/0", "author": "Blake Peavy"}, {"rating": 5.0, "review": "Love converting my TV to a have features of a smart tv without the larger cost of purchasing one.", "verified": false, "helpfulness": "0/0", "author": "Shirley Kelly"}, {"rating": 1.0, "review": "I've been using this stick for over a month now and am extremely frustrated and ticked off.I used to watch Netflix through an old Wii.  It worked great.  I \"upgraded\" to the Fire Stick at the same time I upgraded to a fiberoptic internet service.Everything that interacts in my home with the fiberoptic network is vastly improved.This stick, though, loses sync with my home wifi network every few minutes, and sometimes a Netflix video will play for two seconds, buffer, play for two more seconds, buffer some more, and so on.Watching other video services, including Amazon's videos, I experience the same problems.  So it isn't Netflix, and it isn't my home wife network.The Android app for the stick loses sync in less than 30 seconds.  If you don't interact with the app, it will disconnect from the wifi network and you have to keep reconnecting.  If you are lucky, it reconnects after twenty or thirty seconds.If you are lucky.The app is also very glitchy between my interactions on the phone and what happens on the TV.Amazon has a lot of bugs to work out on this garbage.Update: I have upgraded to the Fire TV, which has a 2 GB buffer, and all the problems I had with the Stick are solved.", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "RLO"}, {"rating": 5.0, "review": "I love it. No problems at all. Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Aleta M."}, {"rating": 5.0, "review": "Great gifts for my siblings. They use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Star Karmel"}, {"rating": 5.0, "review": "Was given to me as a Christmas gift.  It is absolutely the gift that keeps giving.  I love it!!", "verified": true, "helpfulness": "0/0", "author": "Linda HUlse"}, {"rating": 5.0, "review": "Seamless installation and streams fast.  Does exactly what it is supposed to do, without also trying to walk my dog.  Nice to see a smart product these days.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "Got my Fire Stick as a gift for Christmas and it worked for 10 minutes. I then changed it to a TV that is 5 feet away from my WiFi system. Again it worked for about 2 hours and now it will not connect to my WiFi regardless of tins of trouble shooting including fiddling with my WiFi! What a shame, and shame on Amazon.... I have found way too many reviews claiming the same issue, about 1/3 of people have trouble.... that is way too much!", "verified": true, "helpfulness": "1/2", "author": "Ann"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "lynn english"}]