[{"rating": 5.0, "review": "I like the Fire Stick, but there are still to many movies that have to be paid for (not on Prime) and the cost for those movies is OVERPRICED. It is still cheaper and just as easy to use Redbox!!!", "verified": true, "helpfulness": "0/0", "author": "Valerie Goodrich"}, {"rating": 5.0, "review": "Thanks this good but need more memory", "verified": true, "helpfulness": "0/1", "author": "chritian"}, {"rating": 5.0, "review": "Better than I thought it would be.", "verified": true, "helpfulness": "0/1", "author": "Duane"}, {"rating": 5.0, "review": "Excellent buy!", "verified": true, "helpfulness": "0/1", "author": "Miki"}, {"rating": 4.0, "review": "Best thing I bought. I enjoy every minute of it.", "verified": true, "helpfulness": "0/0", "author": "Ignacio Ramirezlazos"}, {"rating": 5.0, "review": "Excellent, love the 1080p so much better then FIOS.", "verified": true, "helpfulness": "0/1", "author": "E. Brown \"I don't allow anyone to put a limit on my dreaming, and I dream big, ALWAYS.\""}, {"rating": 4.0, "review": "Nice media box.Obviously amazon centric. Missing a few of my favorite apps, foxnow&fxnow.;Player sling TV rock solid. Amazon prime super fast and nice UI. Playing with Android games etc is pretty cool though.Unfortunately the interface is kinda cluttered. And it's a little laggy. However very promising. If I see a regular fire TV on sale, I'm likely to pick it up. Just feels a little underpowered when compared to the possibilities , especially running you don't normally see on a media stick.I'm currently using a roku 1, stick and 3, Chromecast and Intel compute stick. And the fire stick is tied with the roku 3 got my favorite. Full-size TV might be enough to unseat the roku 3. But for the dollar I think the fire stick is the best media player deal on the market", "verified": true, "helpfulness": "0/0", "author": "Pollo"}, {"rating": 5.0, "review": "it's great!  easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Justin S."}, {"rating": 4.0, "review": "It suits the purpose and I am glad to have it. However, I didn't realize there is a voice activated one and this Fire TV Stick is difficult to work with. It takes too long to key everything in or search. I hope I can find an app for my smart phone that will enable me to use a voice command.", "verified": true, "helpfulness": "0/0", "author": "Mission \"missioneusa\""}, {"rating": 3.0, "review": "Works pretty good for the price, but tends to pause and stutter on a regular basis. That gets annoying.", "verified": true, "helpfulness": "0/0", "author": "Computer Services of Tampa Bay, Inc."}]