[{"rating": 4.0, "review": "It has same function as my Fire TV but wireless only.  I have not had the same success with Plex as I have with the hardwired Fire TV but that may be my wireless router.", "verified": true, "helpfulness": "0/0", "author": "beazle"}, {"rating": 4.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Jim's E-Store\""}, {"rating": 5.0, "review": "Pros:-The interface is easy to navigate, it is a bit too easy to buy things but you can set a pin for purchases and allow videos to play without requiring the pin, which negates the issue.-Good quality even streaming on my low speed connection (2mbs), wifi connected well, operated for hours without any issues.-I don't mind having to plug into power and HDMI, I wont be moving it so it's no big deal.-The remote is simple and works. Haven't used the app yet, but it looks promising.-Auto-next video is great for TV shows.Cons:-It doesn't work with \"captive portal Wi-Fi sign-in\" YET... this would be AMAZING for my hotel room", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 1.0, "review": "Have several Kindles and other wireless devices that work just fine from our 12mbps router but the FireStick will only work within 10 ft of the router...so unless your TV is in the same room as your WiFi router you're toast. All this confirmed while trying to trouble shoot with Amazon Tech Support on the phone...reset to factory sets, reboot ...everything and no cure.  Will not stream content...even though our cheap little Samsung WiFi ready BluRay player (and all other devices) does it just fine from over 30 ft away. Way too weak an WiFi antennae in this thing...not like their excellent Kindles. Extremely disappointing.", "verified": true, "helpfulness": "163/186", "author": "Suzanne Appenzeller"}, {"rating": 5.0, "review": "I think this is great.  I haven't watched this muck tv in years.", "verified": true, "helpfulness": "0/0", "author": "goliva46"}, {"rating": 2.0, "review": "I only purchased it because of the Amazon instant video", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "khalid osmani"}, {"rating": 5.0, "review": "Great device for what I use it for !!!", "verified": true, "helpfulness": "0/0", "author": "Melvin"}, {"rating": 5.0, "review": "My only regret is that I should have ordered 2 when I had the chance at the sale price.Fast setup, Prime videos plays quick and smoothly!  Better then my PS3.Too bad no ios support or streaming. But that's what the Apple TV is for!", "verified": true, "helpfulness": "0/0", "author": "J.M. Torres"}, {"rating": 4.0, "review": "Ive had to reboot the device sevaral times because it freezes.", "verified": true, "helpfulness": "0/0", "author": "Wellington Camejo"}]