[{"rating": 5.0, "review": "I bought this on a whim to see how it compared to a chromecast. It does lack the ease of use on a few features, but is overall more convenient. I love the fact that the remote that comes with it doesn't use line of sight. Also, there is an android app to control the fire tv stick. I have a phone that can double as a remote control, so it makes it quite easy to control my entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Erdrick"}, {"rating": 5.0, "review": "Plays almost all my streaming services.  Netflix, Hulu, Amazon Prime streaming are all great.  As soon as it supports my HBO Now, I'll be in heaven!", "verified": true, "helpfulness": "1/1", "author": "R"}, {"rating": 5.0, "review": "This is a great alternative to Smart TV. Buy a standard tv and upgrade it to smart with this for 40 bucks. The software is upgraded regularly unlike smart TV software. Save a bundle and get the most out of your amazon prime account.", "verified": true, "helpfulness": "0/0", "author": "J. Larsson \"Trixsterjl\""}, {"rating": 5.0, "review": "The picture is so sharp and clear. Unlike streaming on my game console. Love it!", "verified": true, "helpfulness": "0/0", "author": "Shuntelle"}, {"rating": 5.0, "review": "Great quality and price.  The best of all similar products.", "verified": true, "helpfulness": "0/0", "author": "PAB \"Luv2Read\""}, {"rating": 4.0, "review": "Bought one of these.  Side loaded Kodi and it works very well.  Good streaming not choppy.  $39 for Kodi is a great deal!  HBO GO performance has been a little choppy.  Buffering issues.  Strange that a native app struggles to buffer while the side loaded app shines.", "verified": true, "helpfulness": "0/0", "author": "Joaquin Soto"}, {"rating": 4.0, "review": "We have this and don't use it as often as we thought we would. We have a hard time navigating through the menu screens are are always searching for a LONG TIME for free movies that we want to watch. We won't pay to rent type of thing so it takes us awhile to weed through the selections to find free movies we want to watch. They really need a new menu screen and make it user friendly to find movies/shows that people are looking for.", "verified": true, "helpfulness": "2/2", "author": "ShellyH"}, {"rating": 4.0, "review": "Great except you must plug it into an outlet in order for it to work. Stop hiding this little nugget from the consumers.", "verified": true, "helpfulness": "1/1", "author": "Tracy K."}, {"rating": 3.0, "review": "I have 2 rokus, and recently bought a Fire TV Stick.  It does the job but the response time isn't as fast as the Roku's.  Sometimes it takes minutes to load and I can't tell if its frozen or loading.  But overall It is ok.", "verified": true, "helpfulness": "1/1", "author": "Erika Clavin"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "L. Nave \"lnave\""}]