[{"rating": 5.0, "review": "My six year old can easily work this which is awesome!!!  We love it!!", "verified": true, "helpfulness": "0/0", "author": "Heather J. Cooper"}, {"rating": 4.0, "review": "The Fire Stick is fantastic and inexpensive.  I paid $20 to pre-order this and would really consider it at $40.  I use Apple TV in my main living room and use the Fire Stick in my bedroom, and I am happy to have both.  The only reason for 4 stars and not 5 is that as a comcast subscriber (basic bundle with Internet) I cannot use HBOGo.  There may be a few other networks I cannot use, but we will see.  My guess is that more agreements will be made and move this to 5 stars", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Rated number one", "verified": true, "helpfulness": "0/0", "author": "Orlando R."}, {"rating": 5.0, "review": "This little gadget works great! Handy little remote as well.", "verified": true, "helpfulness": "0/0", "author": "April A. \"eambard\""}, {"rating": 3.0, "review": "Great to be able to watch Amazon stuff on my TV. The buffering and waiting is horrible on it and gets annoying. My kindle works fine (so I sometimes attach this to the TV instead!), but the stick has horrible buffering issues. I hope that the new fiber optic being installed in town helps.", "verified": true, "helpfulness": "0/0", "author": "R. Wells"}, {"rating": 5.0, "review": "Perfect for what I need", "verified": true, "helpfulness": "0/0", "author": "Wood & Acrylic Supply"}, {"rating": 5.0, "review": "What a simple and easy way to get to Amazon Prime Videos.  We love it and at a fai price.", "verified": true, "helpfulness": "0/0", "author": "Fishrman \"Fast Eddie\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Easy to use.  Installed and ready in seconds.  Able to watch \"Bosch\", a very good representation of Michael Connelly's books.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jimorsue\""}, {"rating": 5.0, "review": "This was probably the easiest connection process I've ever had. Literally plug and play! I could not connect my DirecTv to OnDemand because I either had to move my modem into the same room to manually plug it in or order their $100 device to connect. I didn't want to give them even more money than I already do so I gave the Firestick a try. I love it so far and now have HBOGo and can watch Game of Thrones whenever I want. Suck it DirecTv!", "verified": true, "helpfulness": "0/0", "author": "SprStr13"}]