[{"rating": 5.0, "review": "Intuitive interface.  Good performance.", "verified": true, "helpfulness": "0/0", "author": "Mass Reader"}, {"rating": 5.0, "review": "The Fire TV Stick is a great idea that is well worth the price of the stick and the Amazon Prime subscription.  I did encounter problems at first because it would not stay connected to my wi-fi router.  Amazon tech support pleasantly surprised me when they called me within five minutes of my online request for help.  I spent several minutes on the phone with the first and second line support personnel unable to clear the problem.  The tech believed the cause was interference in my wireless environment and suggested I ask my ISP to set my router to a specific channel versus automatic mode.  After doing that, I continued to have slow connection and disconnect errors.  I finally moved my TV Stick to a different TV and it worked!.  I moved it back to the original TV but plugged it into a different HDMI port and that cured the problem.  Streaming is now strong and uninterrupted.  My TV is a 22\" Seiko (a very off brand, I'm sure).  So...my advice to those who may encounter problems with the Stick is to try a different HDMI port or a different TV before even calling tech support.  Additionally, although the signals environment was not the cause of my problem, I found that there are some free apps out there for your smart phone or PC that will display your wi-fi environment to help you find sources of interference, e.g., \"Acrylic Wi-Fi Free.\"", "verified": true, "helpfulness": "0/0", "author": "John Strathmore \"John\""}, {"rating": 5.0, "review": "Love this!! Makes my subscriptions to Netflix, Hulu and Amazon Prime well worth it!", "verified": true, "helpfulness": "0/0", "author": "Pamala Monroe"}, {"rating": 2.0, "review": "Video playback buffers occasionally.  It blames it on my internet connection, but my chromecast on the same TV works flawlessly.  If it weren't for this fatal flaw I would give it five stars.", "verified": true, "helpfulness": "0/0", "author": "Daniel Wilson"}, {"rating": 5.0, "review": "An excellent buy.  You get more than your money's worth with this portable gizmo.  You definitely need this.  I have this as well as the original Amazon tv.  The only drawback is that this doesn't have a microphone for easy movie searching like the full/original Amazon tv, but what a great buy! Totally impressed !", "verified": true, "helpfulness": "0/0", "author": "Sandra M \"code3sandra\""}, {"rating": 5.0, "review": "I usually do not write reviews but this Fire TV Stick is great.  I am able to access all of my prime videos and cloud pictures with ease.  My Wife and Children are able to get onto NETFLIX and watch all there favorite shows and it is so easy to use.  I gave it a 5 Star because it is well worth the price.  I will recommend this to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far, so good.  Kind of disappointed in the offerings, but I'm a old lady &  like mega-retro!  It was easy to set up even for me.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth D"}, {"rating": 4.0, "review": "Very easy to set up and use. Simple and intuitive interface.", "verified": true, "helpfulness": "0/0", "author": "Erik McCullen"}, {"rating": 5.0, "review": "Best thing ever! My kids love it and easy to use!", "verified": true, "helpfulness": "0/0", "author": "vjhyd th jhh"}, {"rating": 5.0, "review": "Easy set up and great quality pictures, love this", "verified": true, "helpfulness": "0/0", "author": "Margarita \"tanker boy\""}]