[{"rating": 5.0, "review": "Easy setup, quickly loads Hulu Plus and Netflix. Much more reliable than the streaming blu-ray player I was using before.", "verified": true, "helpfulness": "0/0", "author": "Terri"}, {"rating": 5.0, "review": "Enjoying it so far!", "verified": true, "helpfulness": "0/0", "author": "Lici"}, {"rating": 5.0, "review": "I . am in love with this stick. This is all I use now I have not really watched cable TV since I got this and I am considering getting rid of it. I am able to also mirror my phone to my TV now which allows me to watch various movies that I have apps for on my phone. You can also Google how to add apps on to the stuck that are not currently there.I had a little problem with hooking it up that it will not connect with my TV. I also find that that remote control app on your phone is a bit hard to work and does not have features as a regular remote has so I do encourage that you buy second remote just in case you lose the other", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "works very well, even at fifty feet from the wireless router, although furniture must be cleared from signal path.", "verified": true, "helpfulness": "0/0", "author": "A. Gould \"magcarta\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "R C"}, {"rating": 2.0, "review": "Update: I have had this for a few months now so I have tested it well. Overall it sucks. It is slow, HBO is always crashing, movies are constantly buffering. I like the j terrace, but next time I would get the faster more expensive box.", "verified": true, "helpfulness": "0/0", "author": "Fred Warner"}, {"rating": 4.0, "review": "It's a great little gadget. I would have rated it 5 stars but HULU Plus keeps freezing up on me. It doesn't freeze up on me when I use PS4 or even Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Carlos Rasilla"}, {"rating": 5.0, "review": "I have 2 rokus and they work awesome. But then there is the fire stick. The fire stick is in a class of its own. It has better specs than the roku equivalent and it shows in the performance. The ui is better looking and snappier. The fire sick remote is way too easy to get use to and has more of a natural feel with just navigating with your thumb. I know the roku has more channels but honestly most of those channels are trash.My favorite feature is the fire stick remote app for my android g3. It is soo damn cool and fun to use. And I thought the physical remote was a joy to use. With the phone app it has voice recognition and works extremely well.I use my rokus and fire stick for sling player and sling tv since I cut cable. Both work comparable to each other but the fire stick is a better product in my opinion and its the same price. Both have the most popular channels but like I said, the extra channels on roku that you won't see on the fire stick suck anyway.", "verified": true, "helpfulness": "0/0", "author": "cheetoresidue"}, {"rating": 5.0, "review": "By far the greatest device I've purchased. Best investment ever.", "verified": true, "helpfulness": "0/0", "author": "James Carter"}, {"rating": 5.0, "review": "Love my fire stick!!!!", "verified": true, "helpfulness": "0/0", "author": "Raquel Torres"}]