[{"rating": 3.0, "review": "I was very upset with the quality of the sound it is worst than regular TV (programs vs. commercial) volume. The music, shootings and explosions are so loud it almost scares you into cardiac arrest then you have to keep lowering it to preserve your ear drums.OK after that ends the talking or whispering starts and it's so low you have to increase the volume again to hear what is being said. It is a frustrating cycle and it takes all the enjoyment out of the program. Also sound related words are muted for no reason during every program I have watched so far, you see lips move but no sound. What's up with that? I Know other people who have the Amazon Fire TV Stick and they have the same problem that I am having. So to me that is a very serious flaw that should get some immediate attention or risk losing some future sales from the all important word of mouth mill. What has happened to equal volume or moderate increases? I realize that there has to be dramatic fluctuations in sound, but lets be real it does not need to be so extreme that the consumer loses interest playing volume roulette. In my opinion the Stick at its current state of quality is not worth the forty dollars that it cost the customer. By the way I just completed my free month am unsure how long I will stay a customer although I do like the variety of choices compared to regular TV and DirecTV. In addition I don't think that we the consumer should have to turn our volume control to the max levels to hear the people speak there has to be a happy medium somehow. Could it be one of the reasons that so many people in this day and age are in need of hearing aids? Thanks", "verified": true, "helpfulness": "0/0", "author": "James Twardesky"}, {"rating": 5.0, "review": "The device is wonderfull.It's pretty fast and steady", "verified": true, "helpfulness": "0/0", "author": "Citibank"}, {"rating": 4.0, "review": "I was disappointed that Vudo  is not supported. Otherwise I like it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm an apple fan to the fullest but Amazon got this right. Super easy", "verified": true, "helpfulness": "0/0", "author": "Stephanie P"}, {"rating": 5.0, "review": "If you want a faster connection def get the fire tv stick. I'm having a blast with it.", "verified": true, "helpfulness": "0/0", "author": "s McDougall"}, {"rating": 3.0, "review": "It's okay. The only thing is some of the stuff of the stuff you have to have cable for.", "verified": true, "helpfulness": "0/1", "author": "Ronda"}, {"rating": 2.0, "review": "If you have Amazon Prime - it is a great way to watch video content.  However, if you have teenagers and want to restrict purchases - it is very limited.  There are parental controls for ratings (PG, R, MA, etc) - and it works well.  And there is a so-called control to limit \"purchases\".  Unfortunately, the system considers each Prime Video a purchase.  If you activate the purchases control - you have to enter a password (the same password) to watch a \"free\" Prime Video, a $8.00 rental, or a $20 purchase.  Unfortunately, until that is corrected, Netflix  will have to be our primary streaming service. Since dropping Netflix was the intent for obtaining the Fire Stick and for renewing Prime -- this is unfortunate.  Aside from this issue, the product is excellent and it does function well to stream Netflix (without any purchasing controls) - but, then so did the Wii.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Works very well", "verified": true, "helpfulness": "0/2", "author": "Linda L. Wilson"}, {"rating": 5.0, "review": "Extremely easy set up and operation. Love it.", "verified": true, "helpfulness": "0/0", "author": "Kendra"}, {"rating": 5.0, "review": "i really like  it", "verified": true, "helpfulness": "0/0", "author": "vivian thornton"}]