[{"rating": 5.0, "review": "We got rid of my cable and bought the fire stick and it works amazing. My kids have not complained once since getting rid of cable. They are able to still see all of the shows they liked. Plus a lot of other different channels we didn't have before. I would definitely recommend. It was a huge budget saver for our family.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 4.0, "review": "Great little device.  It does lose connection with the WiFi, on occasion, requiring you to unplug the power to reset.  It would be nice if there was a power button on the remote.", "verified": true, "helpfulness": "0/0", "author": "M. Kimball \"Guardrail\""}, {"rating": 5.0, "review": "I have been hovering around this product for several months now. I finally decided purchase for my birthday and I have to say that it's best gift ever. I have no complaints at all. 😊", "verified": true, "helpfulness": "1/1", "author": "MissBonniesMom"}, {"rating": 3.0, "review": "It is frustratingly limiting. It serves to put Amazon products in your face, but falls short when you want to see other services.  Yes, it supports Netflix and Plex and so on, but they all feel like second-citizens. You have to go out of your way to use them. They simply don't have the unified experience that Roku provides. You'll get the same experience with the PS3 or XBox, of course, but there you'll also get a few additional features that balance it out a little.The Youtube app is a thin wrapper about the mobile browser interface, and is terrible to use.This stick is, however, pretty good at receiving Miracast, so you can easily make it a big screen for a Nexus phone or tablet, and it will work remarkably well. It will play your Amazon MP3s and shows lyrics, which is neat, but you're mostly out of luck if you have your own music collection. Finally, the collection of screen saver pictures is truly beautiful.  But is that a reason to buy a stick? Probably not.", "verified": true, "helpfulness": "1/2", "author": "Michael Dwyer"}, {"rating": 5.0, "review": "Works great, FYI when you first plug it in and the screen is blank  just push the select and play button at the same time for about 10 seconds and it will prompt you to find wi-fi", "verified": true, "helpfulness": "1/1", "author": "rayme"}, {"rating": 5.0, "review": "Wasn't disappointed.  Previously ordered them during Black Friday as Christmas gifts, then decided I needed to try one myself.  Now I have two and ready to get another couple as gifts.", "verified": false, "helpfulness": "1/1", "author": "Megan Wooden"}, {"rating": 5.0, "review": "WooHoo! Love this thing!  Easy to set up. Easy to use! Happy camper here!", "verified": true, "helpfulness": "0/0", "author": "LittleBrownBear900"}, {"rating": 3.0, "review": "the remote is very difficult to open to put the batteries in  took over 30 min to open.  Other than that excellent product", "verified": true, "helpfulness": "1/1", "author": "LaBridget"}, {"rating": 5.0, "review": "Super cool gadget! Really easy to set up and use. Great price for all it does.", "verified": true, "helpfulness": "0/0", "author": "Sarah Schaller"}, {"rating": 5.0, "review": "It does everything it claims. It's very easy to use. I downloaded the remote app to my phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]