[{"rating": 2.0, "review": "The product is only somewhat convenient. When I watch or stream a movie the screen lightly flickers. I am afraid to watch it at night as to not trigger a seizure.  This item is a definite work in progress. I am undecided weather or not I want to keep it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Yacono"}, {"rating": 2.0, "review": "Not alot to do with it only use it for netflix, always try to get you to buy everything just to use something you already paid for. 1080i is good looking though.", "verified": true, "helpfulness": "0/0", "author": "Keith Hannah"}, {"rating": 5.0, "review": "Easy to install and instant access to Pandora, Netflix, Music etc,Love it !", "verified": true, "helpfulness": "0/0", "author": "Batson Stevens, Jr."}, {"rating": 5.0, "review": "Exelent....GoodVery good", "verified": true, "helpfulness": "0/0", "author": "domingo vasquez"}, {"rating": 2.0, "review": "I thought the fire stick would replace my roku.  I use roku for streaming my music from the Amazon cloud. ..however, firestick does not give an index of music or a search feature. .this means I've got to scroll through 1000 items to find an album or song", "verified": true, "helpfulness": "0/0", "author": "Wayne Tutzauer \"Old Folkie\""}, {"rating": 4.0, "review": "Meets all my expectations", "verified": true, "helpfulness": "0/0", "author": "Anthony C. Kaczka"}, {"rating": 5.0, "review": "really good and holds lots of apps. Easy to use easy to install what more could you ask for", "verified": true, "helpfulness": "0/0", "author": "tony killion"}, {"rating": 5.0, "review": "Everyone needs one!!!  I am very happy with it. and want to order onen for all my televisions.  I don't know if you can move it around to the other televisions in the house.  My only complaint is that there are no instructions that come with it.  You have to hunt and see online.", "verified": true, "helpfulness": "0/0", "author": "Anne \"boater\""}, {"rating": 5.0, "review": "We love the fire stick", "verified": true, "helpfulness": "0/0", "author": "Kristie Lewis"}, {"rating": 5.0, "review": "I just wanted a small TV in my kitchen to watch while I was working.  I didn't want to bother with adding a cable jack and the necessary digital receiver.  The price was right and now I am set!", "verified": true, "helpfulness": "0/0", "author": "CHARLOTTE M HOERLEIN"}]