[{"rating": 5.0, "review": "We Love it", "verified": true, "helpfulness": "0/0", "author": "Elizabeth P. Martin"}, {"rating": 5.0, "review": "Love the FireStick!  Easy to install and lots of options for use", "verified": true, "helpfulness": "0/0", "author": "Sandra Grepling \"Lilgrep\""}, {"rating": 5.0, "review": "So pleased with our purchase of the Fire TV Stick. I have other products like this and this is the one I like the best. Easy to setup and I love the app.", "verified": true, "helpfulness": "0/0", "author": "K. Ross"}, {"rating": 2.0, "review": "Waste of money. If you already have tv/movie apps. It syncs with your active accounts.", "verified": true, "helpfulness": "1/2", "author": "Emmitt"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "WLK"}, {"rating": 4.0, "review": "So far I'm happy with the Amazon Fire TV Stick. It basically turns your TV into a Smart TV with apps which is what I wanted. It's very easy to set up and has a bunch of neat features. The only issue I had with this is that it sometimes likes to lag/freeze, which sucks because I really want to like this! I mean I do, but that's just really annoying. If you let it \"fall asleep\" where I guess a screen saver comes on, sometimes it doesn't like to wake back up right away (but who does right?) and will take you a few minutes to get it to do anything. One time, I even had to unplug it and replug it back in just so it'd start responding. Randomly it'll just start lagging really bad with a delay while browsing through the main screens. It's not a internet connection issue because it's literally right next to the WiFi router. I don't know if I happened to get a 'bad' one or what, but other than that issue I really enjoy it. Maybe updates will fix this issue, so I'm not too worried about it.", "verified": true, "helpfulness": "1/1", "author": "Carey H"}, {"rating": 5.0, "review": "Easy to use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Toni Pettigrew Teeter"}, {"rating": 5.0, "review": "easy to set up easy to learn -  excited to use all the features.", "verified": true, "helpfulness": "0/0", "author": "Beachbaby"}, {"rating": 5.0, "review": "Definitely pleased with my decision to go cable free. Firestick is user friendly. I'm sure there are ways I can utilize and get the most from it which will take time. I would recommend!!!", "verified": true, "helpfulness": "0/0", "author": "Angie M."}]