[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "1/1", "author": "Dion"}, {"rating": 5.0, "review": "Love this.  We just started to tap into it's potential, but so far it is great.  We also signed up for Amazon Prime which has allowed us to dump our Dish premium channels.  It is so easy to operate right out of the box.  Thanks Amazon for a product that even a low level techie can use", "verified": true, "helpfulness": "2/2", "author": "reggie6"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "1/1", "author": "Cypress Angels"}, {"rating": 4.0, "review": "I love this fire stick but it my HBO go won't work.  I have xfinity and the HBO Go will not activate online.  super sad about it.  :(", "verified": true, "helpfulness": "1/1", "author": "Yvette C Marentes"}, {"rating": 1.0, "review": "Tried to mirror my hdx screen to my hdtv. I see the display mirrored to my TV for a few seconds and it sputters, stops, and the connection is broken. I go to the Display & Sounds tab in Settings and try to re-establish connection and it hangs for a long time before telling me a connection could not be established with the Fire TV stick. Sometimes, I see the video without any issues on my hdx but the video on my TV is a series of pauses.Apart from the display mirroring issues, I use my roku more than the fire tv stick as the roku's user interface is better thought through.", "verified": true, "helpfulness": "1/1", "author": "Srinivasa"}, {"rating": 5.0, "review": "The only problem is trying to open the battery case.... Took skin off my thumb!", "verified": true, "helpfulness": "1/1", "author": "Moe Moe"}, {"rating": 5.0, "review": "Nice portable device.  We watch movies frequently using it.", "verified": true, "helpfulness": "0/0", "author": "Denise A."}, {"rating": 5.0, "review": "After years of only having standard TV channels to watch, the fire stick opened up a great new world for us.  Lots of our favorite shows and movies without the commercials.  The stick installed simply and easily.  The downloads are fast seamless.  I do have to unplug it occasionally to \"reboot\"  because it will get stuck and won't play anything.  Not a problem!  Love, love, love, it!", "verified": true, "helpfulness": "0/0", "author": "Deanne D. Fox"}, {"rating": 5.0, "review": "Finally got rid of the cable box.", "verified": true, "helpfulness": "0/0", "author": "Joyce Derenas"}, {"rating": 5.0, "review": "Cheap, does what you expect. Remote is easy to use.", "verified": true, "helpfulness": "0/0", "author": "David S Tonyan"}]