[{"rating": 4.0, "review": "A little clumsy but works well. I would recommend The See and say though it's well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "NAVPRO \"Gye\""}, {"rating": 5.0, "review": "Easy to assemble & no issues so far👍", "verified": true, "helpfulness": "0/0", "author": "kimberly layman"}, {"rating": 5.0, "review": "I don't have any other streaming device to compare this to so this is only for this device and not a comparison.The installation is very simple and can be done by most people who can operate a TV. I do recommend having an Amazon account already.The unit itself is small but seems reasonable well built. The remote is comfortable and small.", "verified": true, "helpfulness": "0/0", "author": "V. Lebrun \"v.l\""}, {"rating": 5.0, "review": "I'm loving my fire stick.  We have a much older tv and don't want to pay for cable so it's opened up a whole new world of entertainment for us.  It's easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Melissa Jones"}, {"rating": 5.0, "review": "This was way easier than I anticipated it would be.  Even as a electronically-challenged blonde, I was up and running, building my watchlist within 10 minutes of opening the package.My cable/internet bill was $190 a month.  By eliminating cable, and adding Hulu and Netflix accounts, I am now out only $67 per month and I still get local TV stations (thanks to my antenna) and all the TV and movies I want to see thanks to Amazon Prime, Hulu, and Netflix!  And, my Fire Stick makes it all come together beautifully!  I LOVE my Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Catherine St Clair"}, {"rating": 5.0, "review": "Love it. Does exactly as advertised", "verified": true, "helpfulness": "0/0", "author": "moon \"moon\""}, {"rating": 5.0, "review": "It's wonderful, I didn't know this was possible I am enjoying the entertainment", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 5.0, "review": "Very happy.........", "verified": true, "helpfulness": "0/0", "author": "Smoochie"}, {"rating": 2.0, "review": "Very disappointed with this!  It keeps losing internet connection, while none of my other devices have that problem.  It mostly shows the low quality video, because its trying to cache the video.  It sits near my xbox, which has no internet connection or caching issues.  I got the Fire Stick, because the xbox, is slow and old... netflix takes about 3 minutes to load, but taking minutes to load is better than losing connection 2-3 times per movie.When it is working, it is useful to show my Prime movies and other amazon collections, plus its easy to have someone else log in to show their stuff.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "I love this thing. This type of technology is the future of entertainment. No reason to be force fed garbage by network executives, choose for yourself!", "verified": true, "helpfulness": "0/0", "author": "Oz Pariser \"Oz\""}]