[{"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "Bought this as an upgrade from a Chromecast I won in a raffle. I love the remote and the fact that it actually has apps/instant video built in, instead having to stream everything from a phone/computer.", "verified": true, "helpfulness": "0/0", "author": "Timothy Heyer"}, {"rating": 5.0, "review": "My husband and I have loved this! If there's not something we can find on Amazon, we can stream it on Netflix, which is only $7.99 per month. Should have bought this a LONG time ago!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth S. Thomas"}, {"rating": 5.0, "review": "Must get!!!!!", "verified": true, "helpfulness": "0/0", "author": "tacmedic"}, {"rating": 5.0, "review": "Great to have, better than cable!", "verified": true, "helpfulness": "0/0", "author": "Marge Secor"}, {"rating": 5.0, "review": "I love fire stick", "verified": true, "helpfulness": "0/0", "author": "hung nguyen"}, {"rating": 5.0, "review": "Great for when you travel and there is nothing on tv worth watching.", "verified": true, "helpfulness": "0/0", "author": "David Garcia"}, {"rating": 5.0, "review": "You're going to Netflix and chill so hard with the Fire TV stick they're going to call you Val Kilmer. The Fire TV stick is the \"Everybody Loves Raymond\" of wifi-only streamers; the streamer you know you want, but you wouldn't want to tell everyone you enjoy it (though you can hide it literally anywhere on the TV with the HDMI extender). I own a Chromecast as well, and I have to say Fire TV is a serious contender. My only complaint: at the time of writing this review, there is no YouTube app (at least I was shocked by this).", "verified": true, "helpfulness": "0/0", "author": "Mark A Zavala"}, {"rating": 5.0, "review": "easy to set up, under 5 min. Went right to amazon prime and netflick as advertised with no problem", "verified": true, "helpfulness": "0/0", "author": "william mullen"}, {"rating": 1.0, "review": "in the description of the item , it is not specified which does not work OUTSIDE THE USA.en la descripción del artículo, no se especifica que no trabajan fuera de EE.UU.NO FUNCIONA FUERA DE USA basura", "verified": true, "helpfulness": "0/0", "author": "Eshop"}]