[{"rating": 5.0, "review": "So easy compared to Chrome!", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 4.0, "review": "Nifty device. I didn't realize the stick itself plugged into the wall... which makes it less practical to move from TV to TV, as I had planned. But it works great!", "verified": true, "helpfulness": "0/0", "author": "Tiffany \"tifffanyd\""}, {"rating": 5.0, "review": "great product, really easy to operate and access to so many great shows!", "verified": true, "helpfulness": "0/0", "author": "janet padilla"}, {"rating": 5.0, "review": "happy hubby", "verified": true, "helpfulness": "0/0", "author": "sherry craig"}, {"rating": 5.0, "review": "Nice to do business with these people! Excellent quality product. A+", "verified": true, "helpfulness": "0/0", "author": "Shailyn"}, {"rating": 3.0, "review": "This is a good product, however, I get frustrated that it seems to want to cut out quite frequently.  I have a fast internet connection speed, my wireless router is within a few feet of my television, and I still experience a lot of buffering.  When I try to watch Netflix or Amazon Prime movies it buffers pretty frequently, almost to the point that I want to just stop what I am watching.I do enjoy the many applications that are available.  My son uses it to play games but also has the same problem with it cutting out at times.  It depends on what he is playing.  I have also noticed that when other devices are using my wifi, if we get a notification on that device, the Fire stick cuts out. If they could give it a little more power it would be fantastic.  Over all it's like having my Kindle Fire on my TV. If you have a slow internet connection or so-so wifi, this is not for you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Easy to install and operate - use it on my smart tv - without cable", "verified": true, "helpfulness": "0/0", "author": "Brigitte E Seier"}, {"rating": 5.0, "review": "My first Fire TV Stick stopped working the night we installed.  I called customer service and they determined it was the stick and sent me a new one within 3 days.  I installed it and it is working fine.  I sent the first one back.  Good customer service and I do enjoy the multitude of shows I can now watch.  Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 1.0, "review": "The main reason I bought this was to watch Twitch on a TV and you would think since Amazon acquired Twitch in 2014 that the app would be good right? Wrong. Streams crash constantly or won't load until I reset the device which I've done several times. I also used Amazon music briefly and had that crash at least twice in less than two hours. My WiFi is up to snuff and I don't believe that's the issue as I can play PS4 or use tablets, etc. with zero issues. Get it together Amazon. I guess I'll be looking at Chromecast or an AppleTV now.", "verified": true, "helpfulness": "0/0", "author": "J. Prines"}, {"rating": 5.0, "review": "You can't beat the fire stick for value. I have 2 fire sticks and 1 fire tv and they work great. I run kodi on them mostly and it runs smoothly.  You can sidelong pretty much any app you want on them. It's especially handy if you have amazon prime since instant video is integrated into it, but if you don't there are plenty of other options like netflix, hulu, HBO etc. Most of them you can install directly through amazon,  but some, like kodi, you have to sideload. I have not had any WiFi range issues like others have reported even though I have them at different levels of our house. It also works pretty good for games and most work fine with the included remote (the android/is remote is a great alternative, especially with the keyboard capability), but you can easily use amazon's controller or a ps/Xbox controller.If you have a side hdmi port on your TV you can plug this right in there, if you don't there is an hdmi extender cord included so that you can plug it in to the back of your TV. For power you can use the included AC adapter and USB cord, but I plug the USB cord directly into my TV and in spite of the on screen warnings about it not being enough power it has been working fine.So, in summary, I would highly recommend the fire stick. It is a little less powerful than the fire tv, but in my experience runs just as smooth and it is of course highly portable. If I had more TVS I  would get more.", "verified": true, "helpfulness": "0/0", "author": "Jorn"}]