[{"rating": 4.0, "review": "Kinda buggy, but pretty good.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "I love it! It was perfectly packaged. And so easy to install! So far so good! Great price great product! Yup I'm a happy girl", "verified": true, "helpfulness": "0/0", "author": "Yvonne bonilla"}, {"rating": 5.0, "review": "Very easy to install. Great product.", "verified": true, "helpfulness": "0/0", "author": "Judy M. Carlson"}, {"rating": 1.0, "review": "Buffers much more than roku stick.", "verified": true, "helpfulness": "0/0", "author": "Matthew Royalty"}, {"rating": 5.0, "review": "Great for those without cable.  The programming is good!  Very smart!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 3.0, "review": "I have been using the Fire TV in one room and the Roku stick in a bedroom. The Roku was noticeably slower - a lot slower. So much so it was a big disappointment and almost annoying to use. Had I not also had a Fire TV I might have been quite pleased with the Roku.The Roku was damaged during a power surge and because of being \"spoiled\" by the Fire TVs superior responsiveness I opted to replace it with a Fire TV stick.Having now used all three devices I would recommend amazon for those who seek responsive navigation. Those multi-second delays while programs or apps load on the Roku stick are noticeable. I have not tried the Roku set top box which may be better.Pros:The Fire TV stick seems as fast as the set top box at less than half the price. I don't play games so can't speak to that aspect.The Fire TV stick has the same navigation interface as the set top box so using it feels natural if you are already using one of their devices.Cons:I knocked off a few stars because the catalog of apps seems limited. I am an amazon prime member and do enjoy this option, but for more specialized viewing like news or ustream - there are serious limitations to the options. Roku seemed to have many more \"channel\" options.Another big ding for the Fire Stick is that, unlike some original ads indicated, the Fire TV Stick does NOT support Bluetooth headphones. As stated I purchased this for use in a bedroom. I opted for the stick over the set top box because of the price and feeling I did not care about gaming - which at that time seemed like the only major sacrifice along with voice search. I can use my phone with a remote app for the voice search, but connecting Bluetooth headphones is not possible with the stick. If this is something you seek, go with the set top box. In a bedroom it can be very helpful to be able to watch tv with headphones so as not to disturb others at night.Overall it is a satisfying device to use as long as you are happy with what it offers. The library includes apps for netflix, Hulu and YouTube so for many this may be all they need. Note the search option on the home page will only search amazon prime content - unlike Roku which searches across apps for content and let's you know prices via various vendors.So, it gets the job done. 3 stars for doing it with ease and responsiveness. However, there are sacrifices with this choice, some of which were not clear up front (I was led to believe by amazons own ads it would support Bluetooth headphones). If you can live without these functions you will be happy with the device.", "verified": true, "helpfulness": "2/2", "author": "anisonam \"anisonam\""}, {"rating": 5.0, "review": "It's a very nice device it's easy to install and have a lot of features. The movies area little expensive to buy and the ones that are free is old but the device it self is cool", "verified": true, "helpfulness": "0/0", "author": "peter anderson"}, {"rating": 5.0, "review": "0love it so easy to use thank you", "verified": true, "helpfulness": "0/0", "author": "William Graham"}, {"rating": 5.0, "review": "Easy setup and connected to our wi-fi with little effort. We have a Roku device and it couldn't connect from the same location but the Fire TV Stick is receiving a good signal.  Have used it a few weeks now and I am pleased with it.  Have not tried it yet with Netflix.", "verified": true, "helpfulness": "0/0", "author": "M. Lucash"}, {"rating": 2.0, "review": "Used it once and it was great- couldn't get it working ever since", "verified": true, "helpfulness": "0/0", "author": "nameless"}]