[{"rating": 5.0, "review": "I got it $19 with promotion, during pre-order. It's really great product, even the accessories price higher than that. (remove, charger, HDMI extend cable and USB cable)", "verified": true, "helpfulness": "0/0", "author": "Element Hu"}, {"rating": 5.0, "review": "I really love it", "verified": false, "helpfulness": "0/1", "author": "lph322"}, {"rating": 5.0, "review": "Does everything we need it to. Kids can use it just fine to watch their shows.", "verified": true, "helpfulness": "0/0", "author": "Jolaine Mast"}, {"rating": 5.0, "review": "this is awesome", "verified": true, "helpfulness": "0/0", "author": "elissa"}, {"rating": 5.0, "review": "Great product, love that I can watch Netflix and Amazon Prime. Amazon doesn't try to pretend that other streaming services don't exist, which I appreciate.", "verified": true, "helpfulness": "0/0", "author": "Aaron's final word"}, {"rating": 5.0, "review": "Works great....easy to use!", "verified": true, "helpfulness": "0/0", "author": "Steven C."}, {"rating": 4.0, "review": "WiFi can cause pauses while buffering. Videofiles may want the wired model for glitch free viewing. It has more channels than AppleTV but fewer than Roku. Nice integration with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "nms \"smithpac\""}, {"rating": 5.0, "review": "love it can watch my prime on my tv now", "verified": true, "helpfulness": "0/0", "author": "gary ferrell"}, {"rating": 4.0, "review": "I was lucky enough to get one of these for 20 bucks.  It gave me an incentive to buy it and try it.  That being said, so far I have been happy.  It is easy to use and is pretty small.  Reason for the 4 stars is the fact it needs to be plugged into the wall.  I have enough plugs in my wall already that I dont need to add another.  I am going to try to add a portable power supply to the back and see if that works.  Regardless, this is a pretty solid, easy to use item.  I have had no issues other then the first day when I couldnt get hulu or netflix to work.  They work now.I would say even at 40 bucks this is a pretty solid buy, you get a lot of channels and it works great with prime.", "verified": true, "helpfulness": "0/0", "author": "Chris W. \"mikeystoyz\""}, {"rating": 1.0, "review": "Doesn't work with my TV. Turns out it is not compatible. Thanks Amazon for nothing. Make sure your TV is compatible. The list is hard to find.http://www.amazon.com/gp/video/ontv/devices?ref_=pe_584750_33951330", "verified": true, "helpfulness": "3/4", "author": "Brent Elmore"}]