[{"rating": 4.0, "review": "It's an affordable, well-designed, compact streaming device for watching your favorite programs on your wi-fi devices.  You must subscribe to Netflix, HBO, SHO, Amazon Prime or other similar services to watch quality videos or movies.  I am dissappointed with the quality of Amazon Prime offering of videos and movies.", "verified": true, "helpfulness": "0/0", "author": "Gurudev \"savvy buyer\""}, {"rating": 5.0, "review": "I absolutely love this! It's so user friendly and so convent!", "verified": true, "helpfulness": "0/0", "author": "Nicole Briece"}, {"rating": 5.0, "review": "Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "Put in our guest room that has no cable or directv, now I find I go in there to watch the Fire TV stick. Love it.  No wires, looks clean, great options. This is the future of television!", "verified": true, "helpfulness": "0/0", "author": "T. Arbeit"}, {"rating": 1.0, "review": "Wifi stopped working on device after a couple of months.  At first I thought it was my router but it turned out being device...", "verified": true, "helpfulness": "0/0", "author": "cruz marroquin"}, {"rating": 3.0, "review": "Great product when close to the router.  I bought this for my bedroom TV, which is 18 steps from the router(20-25 feet in a straight line).  It was able to download its update, but does not have a good enough signal strength to stream.  I tested my ChromeCast on the same TV, and it worked fine.  If they can improve the wifi strength on this, I would give this 5 stars.  Love the control and the menus.", "verified": true, "helpfulness": "0/1", "author": "Michael Wiley"}, {"rating": 5.0, "review": "Wanted something to put in the bedroom to replace an older failing Smart Blu-Ray player. Has everything I wanted and more. Streams without lag or pixel artifacts. So far no issues. Wife and Daughter are happy. Will update later if needed.", "verified": true, "helpfulness": "0/0", "author": "WyzrdX"}, {"rating": 2.0, "review": "The hardware works fine but the OS stinks. Everything defaults to amazon, instead of a generic launcher like on a roku", "verified": true, "helpfulness": "0/0", "author": "K. Gibbs"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Rick Bigum"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Steve Vasquez"}]