[{"rating": 5.0, "review": "It was very easy to set up once I figured out the code . You use the numbers on the modem if you have comcast cable. Then since I bought it through my smile.amazon account it was already set up in my name. ( this can be changed during set up )  Very easy to use the remote that came with it. and the batteries too. I am very glad to have this new feature to watch movies,tv shows etc. For a measly 39.00 it makes a great gift", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "I ordered one to test it out with the promotion. It was such a hit in my home that I ordered another. I honestly am thinking about ordering another as a gift because my family likes it so much.", "verified": true, "helpfulness": "0/0", "author": "Askyz"}, {"rating": 5.0, "review": "Amazing product in such a small package.  Easily runs plex in my home with no issues.  Also allows me to easily use the prime video service, which was not getting alot of love outside of this product", "verified": true, "helpfulness": "0/0", "author": "Jonathan C. Citty"}, {"rating": 2.0, "review": "Works fairly well, but I didn't like this nearly as much as my Chromecast.  For streaming options it's nice to have a remote, but the experience as a whole wasn't great for me.  The Chromecast needs power too, but can use a USB plug on the TV to get it's power - the Fire TV Stick warned me not to do this and to plug the stick in to the wall with the adapter.  Depending where the HDMI cables plug in, and how many ports are already in use this may be a hassle (as it was for me).  Also, I make heavy use of the Twitch TV app which on the Fire TV Stick is locked to 'medium' resolution which on a HDTV looks like complete crap - and this is with the stick plugged in to the wall as instructed.  Has promise, but right now it's just not in the same league as the Chromecast for my streaming needs.", "verified": true, "helpfulness": "0/0", "author": "Daniel Wiederecht"}, {"rating": 5.0, "review": "I had some difficulty getting the TV stick attached to my TV, because I could not reach behind the wall-mounted TV to plug it into an HDMI plug. I did have an extension HDMI cable already attached and easy to reach. The problem was that the cable and the TV stick both have male plugs and therefore could not be coupled. I bought a female coupler and that worked like a charm. The TV stick itself is pure simplicity to install and getting it up and running was a breeze. I like the interface and the ease with which you can browse and select movies, TV shows and more. I would strongly recommend this to anyone who is interested in buyingnone.", "verified": true, "helpfulness": "0/0", "author": "Expat"}, {"rating": 5.0, "review": "What a device!!  I love this Fire Stick!  I use every day.  Many, many options, too many to list.  The user interface (GUI) is superb.  The load times for content are MUCH faster than Apple TV or my older Sony BD player.  IF your are an Amazon Prime subscriber (highly recommended-how did I do without it?), then you have a wealth of entertainment at your fingertips and ready to view on your Home Entertainment System.", "verified": true, "helpfulness": "0/0", "author": "Walter J. Worth Jr. \"digital sailor\""}, {"rating": 5.0, "review": "It took me a while to finally unplug my trusted Roku III and try the Fire TV Stick. I'm not going back.Pro:Price point is greatApps to watch: main ones are coveredEasy to use via the remote or iOS applicationCon:HBOGo (Coming.)Must power via the wall AND the TV. In other words, two power points to be successful.bonus: MLB.TV. For the baseball fan, I really am glad to see that. CBSN for full time news, very nice.Amazon has done it right. Once the HBOGo application is released, I'm very pleased. The Roku is a great; but the stick, in my opinion is better. Smaller form factor. \"Hidden\". Using Wi-Fi, no picture degradation. Very pleased.Adding new \"channels\" very easy. Price point is amazing. So much for so little.", "verified": true, "helpfulness": "0/0", "author": "C. Carmichael \"Chris92057\""}, {"rating": 4.0, "review": "plex, netflix, and instant video. awesome. still wont connect to my lg g3 with amazon remote app.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 4.0, "review": "Size of a memory stick but with built-in wifi.  I enjoy watching movies on prime but so far have not purchased any movies on prime. Decent selection of programs but not extensive.  Aggravating when wifi signal slows and I realize that is not amazon's problem. Would be nice to have a larger buffer in case of a dip in signal.  Wifi is not perfect and it shows its limitations with the fire stick", "verified": true, "helpfulness": "0/0", "author": "Robert21"}, {"rating": 5.0, "review": "Works like a charm, even on my \"pretty slow\" internet connection.", "verified": true, "helpfulness": "0/0", "author": "Robert Nelson"}]