[{"rating": 5.0, "review": "Love my fire stick", "verified": true, "helpfulness": "0/0", "author": "Charles Martinez"}, {"rating": 1.0, "review": "This seems like it would have been a good product, but j could not use it with my iPhone so I could not evaluate it", "verified": true, "helpfulness": "0/0", "author": "Ferria Decembre"}, {"rating": 2.0, "review": "The wifi range sucks. My other devices work much better.", "verified": true, "helpfulness": "0/0", "author": "Roberto Gomez Jr."}, {"rating": 3.0, "review": "I was disappointed in the number of offerings that had to be paid for.  I am able to watch things on my iPad that would cost money to view using my fire stick.  Why am I am Amazon Prime member if I have to pay for so many things?  And I'm not talking about new items, but some older offerings", "verified": true, "helpfulness": "1/1", "author": "Jeanette N. Ellian"}, {"rating": 4.0, "review": "I like this product a lot, but I was dissapointed to learn that I couldn't cast my screen in the same way you can when you own a chromecast. I ended up buying a chromecast soon after this purchase just to get that feature as it's extremely convenient. It's really the only reason I wanted a stick. This one is great for hotels, however, so Ill be bringing it with me on vacations!", "verified": true, "helpfulness": "0/0", "author": "Trevor \"Trevor\""}, {"rating": 2.0, "review": "The one App (Plex) I really use did not give me the experiance I get on a Roku.", "verified": true, "helpfulness": "0/0", "author": "Demosesneeds Punchard"}, {"rating": 5.0, "review": "Easy to plug in and get it going.  The tutorial was excellent.  I watched a couple of Amazon Prime movies the first night and the streaming picture and sound was great.  It certainly adds a lot more to my Amazon Prime subscription and I know we are only scratching the surface.  The only downside was I now have another remote control to contend with.  It's small and easy to lose.", "verified": true, "helpfulness": "0/0", "author": "Tommy Waldrop"}, {"rating": 1.0, "review": "ROKU is a much better product.", "verified": true, "helpfulness": "0/0", "author": "Michael Anderson"}, {"rating": 1.0, "review": "Doesn't work!! It will not stream anything all it does is say check Internet. We tried everything and still could not get it to work.", "verified": true, "helpfulness": "0/0", "author": "Brittany Whipple"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Mayra Bravo"}]