[{"rating": 5.0, "review": "Plugged this into a computer monitor with a HDMI connection and it worked great.", "verified": true, "helpfulness": "0/0", "author": "Papawgary"}, {"rating": 2.0, "review": "Arrived early and setup was amazingly easy; connected to my wireless straight away and I was up and running. Having a remote is much better than having to use my phone. No way to browse the internet which is very disappointing. Here is hoping someone will develop a browser app for this device. I know it is only $40.00 but it should last longer than a couple months, returning for warranty and being  told it will be at least a month before I get a replacement :-(", "verified": true, "helpfulness": "1/1", "author": "Wizard"}, {"rating": 5.0, "review": "Better than the Roku! This is a must have, especially if you splurge and sign-up for Prime.", "verified": true, "helpfulness": "0/0", "author": "NJGuy \"Timothy J. DeVoe\""}, {"rating": 5.0, "review": "we love it", "verified": true, "helpfulness": "0/0", "author": "J. goings \"jimmyjam\""}, {"rating": 5.0, "review": "Easy to use. Reliable.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 2.0, "review": "I am giving this a 2 simply because it worked on our bedroom tv. When trying to plug this into our living room tv it simply would not plug into the hdmi port. I have had my Playstation plugged into that port for months so i know it works but for some reason i cannot get the fire stick into that port or the other port on my tv for that matter. Now i cant plug antying into that hdmi port. So I know it could be parcially my fault for trying to force the issue but this thing broke 1 of my only 2 hdmi ports on the 60\" tv. That sucks.", "verified": true, "helpfulness": "1/3", "author": "Jennifer Bagby"}, {"rating": 4.0, "review": "In my opinion there's room for improvement on any media device and I've tried or owned most of them. The Fire stick is a better TV device than the Chromecast hands down. I like the Chromecast but the Fire stick's remote makes all the difference for my taste. The Fire stick is also easier to take with you on trips or whatever and jump on a new wireless network than the Chromecast, that might not sound like much but if you travel a lot then it just might be a big deal.Plug the stick into the HDMI port of the hotel room's TV, jump on hotel WiFi or your cell phone hot spot and stream away.I did have the unit hard freeze on me once and when I got it back up and running it dumped my Netflix login info so I had to re set it up. I didn't count off a star for that reason, the star off was for the Amazon Prime video service itself...How can we scroll through what it says are Amazon Prime videos included in the cost of Prime only to find that the movie we want to watch costs extra..?Weird marketing. It's exactly why Amazon won't be replacing Netflix anytime soon in the video streaming market. You need to come up with a way to partition what videos are included in Prime from those that aren't included.", "verified": true, "helpfulness": "1/1", "author": "M. Gentry \"Mike n DFW\""}, {"rating": 5.0, "review": "So for good", "verified": true, "helpfulness": "0/0", "author": "Miguel Marquez Jr."}, {"rating": 1.0, "review": "This is a horrible product.  We spent hours trouble shooting.  No sound.  Lots of people having the same issue!  Works once then never again!  Still waiting for an update.", "verified": true, "helpfulness": "0/1", "author": "Deb"}, {"rating": 5.0, "review": "I'm an Apple guy, but Amazon sure did a great job with this device (especially for the price.) Easy to setup and move from TV to TV. Love the Plex integration and Netflix profile functionality. While it has passwords to protect against kids purchasing things, it wouldn't be hard for a smart (older) kid to watch you enter the password once and remember it, but other than that, the feature is great.", "verified": true, "helpfulness": "0/0", "author": "William"}]