[{"rating": 3.0, "review": "I expected more out of this device. First, it wasn't compatible (???) with the HDMI ports on my receiver. It would not boot up no matter what I did. Just got stuck on the Amazon logo. Once I connected it directly to my TV it booted up fine. No big deal. However, I purchased this primarily for the plex functionality, and after paying for the app on Amazon (which I already own on other platforms as well as plex pass lifetime) I found out it doesn't support 5.1 audio. Hopefully Amazon can fix this in the future and I can improve my review. It would also be great if Amazon could include an option to boot directly to an app. Google TV's aging platform supported this and it was great for plex usage.", "verified": true, "helpfulness": "0/0", "author": "SwinginFriar \"swinginfriar\""}, {"rating": 5.0, "review": "Love the new fire stick and the unlimited movies", "verified": true, "helpfulness": "0/0", "author": "Roschanda"}, {"rating": 5.0, "review": "Have a computer monitor. Works perfect!!", "verified": true, "helpfulness": "0/0", "author": "Radhakrishna Dasari"}, {"rating": 5.0, "review": "Awesome little stick.  It feels a lot more like a standalone device than a chromecast does.  Although it has a companion application for your phone, it's not compulsory to use it.Even better, it allows sideloading after two steps.  Even apps not in Amazon's store can work on it including XBMC.My only complaint is that apps that you can \"cast\" using Chromecast can't also cast here.  Particularly, Pandora and Netflix can't be cast.  You have to use the app on Amazon FireTV stick.  The only one that i've found works for casting is YouTube.", "verified": true, "helpfulness": "0/0", "author": "Mario Limonciello"}, {"rating": 5.0, "review": "So far so good... Get the HBO App and it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "James Williams"}, {"rating": 3.0, "review": "Nice interface, too slow to be used comfortably", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I would highly recommend this. In fact I bought two.", "verified": true, "helpfulness": "0/0", "author": "PompJoggie"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jason Koehler"}, {"rating": 5.0, "review": "Pleasantly surprised by the speed of navigating through TV & movies, apps, pictures and songs.  Set up very easy, it still took about 20 minutes after needing a software download and getting connected to my network.  All in all, it exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "D. Scammell"}, {"rating": 2.0, "review": "Unfortunately, I don't think the Fire TV Stick should have been released yet... It is not quite ready for Prime time.  Here are the reasons in my case:1)  The WI-FI does not seem to stay reliably connected.  At least twice now when I have come to use the Fire Stick and I wake it up from sleep, the unit would not connect to my W-FI router.  The only fix was to pull the power, plug it back in, and let it connect.  No other device in my household has a problem with the router and the Fire Stick works once it connects.2)  The remote control has an uncomfortable feel in my hand (too thin and small) It also a 'key bounce' problem when I press a key.  What I mean by key bounce is that, for example, if I press the left or right movement key, it may register that single key press as multiple (2 or 3) key presses.  VERY annoying indeed.  I don't know if the problem is in the Fire Stick or its remote.  I also had a hard time opening the battery compartment of the remote as others have suggested.3)  I purchased and installed PLEX on my Fire Stick.  PLEX was working and when I was navigating selections in the PLEX app, the app suddenly disappeared.  I had to call Amazon and they quickly refunded my PLEX purchase and I had to purchase it app again.4) YouTube app hangs for a short time while playing video.  It does this fairly consistently.5)  The user interface leaves a little to be desired.  As another review suggested it works but it is certainly not intuitive.  Netflix interface is not great either but that is Netflix issue.On the good side, when it plays (Netflix, Amazon Prime) it does that well and picture quality is very good.  The $19 intro price (the reason I wanted to try it) makes it bearable while I wait for hopeful updates that will fix these issues.For now I will use the ROKU 1 that I also just bought and that does not have these odd issues.  I have to say my ROKU experiences have been almost completely positive with the exception of the ROKU 3 that has a very similar Netflix user interface as the one in the Fire Stick.At this point, not counting the interface issues I have with the Netflix, I am disappointed.  I expected better quality from Amazon.", "verified": true, "helpfulness": "0/0", "author": "A. Cohen"}]