[{"rating": 4.0, "review": "Overall I am very happy with my Amazon Fire TV Stick. I wish I could download Vudu to it. It would also be nice to apply Amazon Free Time to it like we can with the Fire Tablet. I would buy another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love! Love! Love! The kid are enjoying the Stick tremendously. I definitely Recommend this device", "verified": true, "helpfulness": "0/0", "author": "MsVee"}, {"rating": 2.0, "review": "To start, the issues people are having with the low power issue can be resolved with any usb ac charger like what your phone came with and you can use same cable the stick comes with.  Out of curiosity i took the ac charger from the stick and used it to charge my portable battery.  It took 2-3x longer then it should have.  My guess is Amazon was being cheap and figured thats where they could cut costs.When I bought this I figured it would be like Roku.  I was definitly wrong and i should have known better.  Its meant for PRIME.  It does support everything like Roku but the OS is targeted for you to use Prime so its tougher/not as convienent to do anything else.  If you do have it will be excellent on how its set up.  The system lags a lot.  Sometimes the remote takes a couple clicks to work.  You dont need it be be in direct view of the box which is nice. I get the fact they want you to get prime and upgrade to the fire box and it does make you want to but its annoying. Movie and show rentals arnt cheaper then xbox one or roku. Meh", "verified": true, "helpfulness": "0/0", "author": "Nicholas Ogden"}, {"rating": 5.0, "review": "Better than expected. Made my Vizio dumb TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "carlos johnson"}, {"rating": 4.0, "review": "I liked the categories and the system design is very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Megan Wisbrock"}, {"rating": 4.0, "review": "Love the Fire Stick. Easy to install and fairly easy to use. Some of the menus are a bit confusing, but I am starting to get the hang of it.", "verified": true, "helpfulness": "0/0", "author": "J. Gracey \"born again' Catholic\""}, {"rating": 1.0, "review": "I ordered this awhile ago but waited until I bought a new tv. When I tried to set it up it kept telling me to put in wifi password which I did at least 20 times! The it would sometimes come up saying Amazon.com not able to connect or something like that. Finally gave up! Even someone tried it and it didn't work! I even tried my kindle fire in the house and it asked for wifi password and connected first time", "verified": true, "helpfulness": "0/0", "author": "Jane Dear"}, {"rating": 4.0, "review": "Easy set up works great luv it so far", "verified": true, "helpfulness": "0/0", "author": "doug"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "This was such an easy fix!  Plug it in and go.  I'm thinking of adding it to my smart TV because it is so much easier to use than all the jumping around with the already loade apps on the TV that take forever to download before you can find your program..", "verified": true, "helpfulness": "0/0", "author": "vicki laue"}]