[{"rating": 5.0, "review": "The Fire TV Stick is such a cool addition to my TV.  Not expensive and works slick and quick.", "verified": true, "helpfulness": "0/0", "author": "Richard N Stacey ll"}, {"rating": 5.0, "review": "good to use", "verified": true, "helpfulness": "0/0", "author": "Carry Vyron"}, {"rating": 5.0, "review": "Works fine and easy to set up.  Our kids love it.", "verified": true, "helpfulness": "0/0", "author": "Michael McElroy"}, {"rating": 5.0, "review": "love this thing. my wife and I use to watch movies and tv episodes on the laptop, but it was kind of a hassle setting up external speakers and turning the couch to be comfortable. The fire stick was everything people said it was. Super easy to install and setup and found our prime account all by itself. Now we can watch without rearranging the living room and its on a much larger screen.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "Great product, easy to set up and works great!", "verified": true, "helpfulness": "0/0", "author": "Michael A. Long"}, {"rating": 5.0, "review": "Great low cost tool for use with lots of entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Travie Ross"}, {"rating": 1.0, "review": "Received an email stating that the fire stick was now compatible with blue tooth headphones. There must be a misunderstanding somewhere since the help section hyperlink provided specifies that it ISN'T compatible. The menu does not match the description either. Would be zero for the help section alone.", "verified": true, "helpfulness": "0/1", "author": "Markalt"}, {"rating": 3.0, "review": "Sorry but my signal strength was not strong enough for me to use the fire stick! Big disappointment for sure. Movies would try to download but just couldn't do it! My son and daughter-in-law love theirs and they bought this one for me. I live in a bad spot and it just won't work!", "verified": true, "helpfulness": "0/0", "author": "Caryl Bunner"}, {"rating": 5.0, "review": "Excellent, my kids love!!", "verified": true, "helpfulness": "0/0", "author": "Vernor Murillo"}, {"rating": 5.0, "review": "It was a gift for my mom for Mother's Day. She hates electronics and didn't want it. After I showed her how simple it was to use, she loves it!", "verified": true, "helpfulness": "0/0", "author": "angelacovington"}]