[{"rating": 5.0, "review": "My fire tv stick works awesome but my only issue is I'm having problems hooking it up to my t.v. in my living room , and I have all the ports and a updated t.v. so at the moment its know use to me !! But I'm happy I bought this item !!!", "verified": true, "helpfulness": "0/0", "author": "Shannon Proctor"}, {"rating": 5.0, "review": "Definitely a must buy!", "verified": true, "helpfulness": "0/0", "author": "L. Johnson"}, {"rating": 1.0, "review": "If 0 stars were an option, that is what I would give this device. It constantly needs to have a hard reset applied to it. Daily, it forgets my network. It also enjoys not working at all for days on end. This actually began fairly immediately. I didn't get around to looking into the return policy until after the 30 day window had passed, so I can't comment on that. However, I can comment that the device problems have not been a fluke, or the luck of the draw, as I purchased two, and they have the same issues. At the present, one doesn't work now at all, and the other is sporadic at best. Do not waste your money! Amazon truly disappointed with this one.", "verified": true, "helpfulness": "0/1", "author": "Tamera DeMuth"}, {"rating": 5.0, "review": "AMAZING! I'm a prime member and as a result I get to select a overwhelming number of great movies. The quality of the picture is great and there is no problem with the picture breaking up.", "verified": true, "helpfulness": "1/1", "author": "JO"}, {"rating": 3.0, "review": "It's hooks up easily. The remote is okay to navigate, but limited.  The options to control (pause, rewind, fast forward) are jerky and limited.  what I really hate is how the credits get put into a tiny window so you can't read them, or pause them to read them, and the next show begins too quickly.  I really still prefer DVDs.", "verified": true, "helpfulness": "2/2", "author": "kmitchell"}, {"rating": 1.0, "review": "Not worth the money. Unit freezes repeadily and had to return the 2 I bought", "verified": true, "helpfulness": "0/0", "author": "SilverDiver"}, {"rating": 5.0, "review": "For some time - we've used the HDMI cable to the TV to watch shows - and while that wasn't a minor inconvenience - this thing makes watching our online shows a breeze! So wish I had bought this before - love it, highly recommend! If you don't have a smart TV - get this!!!", "verified": true, "helpfulness": "0/0", "author": "Jim A \"Jim A\""}, {"rating": 5.0, "review": "Easy to set up and easy to use. I got this mainly to watch YouTube on my television and it works great. Very impressed with how fast everything loads and plays.", "verified": true, "helpfulness": "0/0", "author": "Joseph McCumber"}, {"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "BetsyB. \"betsybme\""}, {"rating": 5.0, "review": "Very happy we can now watch our Amazon Prime movie stuff on our TV downstairs without going through the Wii.  Could not have been easier!", "verified": true, "helpfulness": "0/0", "author": "Linda Genrich \"Elizabeth's Mom\""}]