[{"rating": 5.0, "review": "The Fire Stick works amazing. Plugged it in attached to TV and it found my internet and off we went!  Perfect!", "verified": true, "helpfulness": "0/0", "author": "Naomi Giroux \"ReadingWriter\""}, {"rating": 5.0, "review": "Great product. Easy to setup and works wonderfully. On screen setup instructions make is so easy to get started.", "verified": true, "helpfulness": "0/0", "author": "John J Ritoli"}, {"rating": 5.0, "review": "Love it! Quick, easy, lots to choose from! We can take it anywhere; vacation or trip to grandmas house. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "thelma elizabeth perez"}, {"rating": 5.0, "review": "Love it. Easier than the fire tv to hook up but that wasn't hard either.", "verified": true, "helpfulness": "0/0", "author": "Chris Dempsey"}, {"rating": 5.0, "review": "I usually stream video through our blue ray players, but I wanted something to stream video without taking up the counter space in my kitchen.  I love this, it streams faster and with less buffering than the blue ray player.  I love all of the apps available for streaming video, and music.  I am buying one of these for my daughter when she goes to college.  This is the best streaming device I have ever used.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "ConnieBella"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Erick"}, {"rating": 4.0, "review": "Very easy to navigate & helped me reduce costs but still have access to shows I enjoy watching.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Gutierrez"}, {"rating": 5.0, "review": "Great addition to home entertainment options. Why would you spent the extra $$$ on a smart tv when.  And as a Prime member, endless options for games, movies, music, and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Greg Crews \"RGCrews\""}, {"rating": 4.0, "review": "so far so good, it took a long time to download and then I had to load NETFLIX separately and it took me a little while to figure out where my watch list was but now I understand how to navigate in the system and it is working well", "verified": true, "helpfulness": "0/0", "author": "Cynthia L. White"}]