[{"rating": 5.0, "review": "I love, love, love the fire stick. For users who have not discovered that you don't have to reinsert the fire stick each time to use it - When you've finished viewing, select the \"sleep\" setting in your menu options. Next time you want to access it, just tap the \"select\" button on the remote and you're good to go.", "verified": true, "helpfulness": "0/0", "author": "Andrea Gates"}, {"rating": 5.0, "review": "This fire stick is sooo awesome. I like the fact that it is small and no assembly required.  Since this was for self use it was already programed for my prime account. All I had to do was plug the device into my tv, put the battery and I was ready to rock.  I like the fact that it is so easy to use. I also like that through this device I can access my Netflix account and stream no just on my computer but now tv as well.  The prime content on the tv is much better then on my laptop.  If you are on the fence, go for it.  This is a cheap purchase with so many benefits.  Go for it", "verified": true, "helpfulness": "0/0", "author": "Margaret Pico"}, {"rating": 5.0, "review": "Damn impressed, that's all I have to say.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Shoop"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "nuno aguiar"}, {"rating": 1.0, "review": "It's not really good", "verified": true, "helpfulness": "0/0", "author": "Vinny"}, {"rating": 5.0, "review": "very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "sandra  wilson"}, {"rating": 5.0, "review": "Am enjoying it", "verified": true, "helpfulness": "0/0", "author": "CARMEN HYLTON"}, {"rating": 3.0, "review": "Decent companion to the chromecast booth have there worth.", "verified": true, "helpfulness": "0/0", "author": "Miket77"}, {"rating": 5.0, "review": "It works Great!! I have the Fire Tv and wanted this so I can take it with me when I go and it fits the bill to a T...", "verified": true, "helpfulness": "1/1", "author": "D. Goosman \"Darlene Goosman\""}, {"rating": 2.0, "review": "My first Fire Stick  worked for a few months and would not reconnect,  so I ordered another one. It did not connect at all.  Tried Two other TV' s. Still did not work.  Then brought  a new Router, top of the line for 2015.  The Fire Sticks still will not work.  Went to Roku2.  Works just great.", "verified": true, "helpfulness": "0/0", "author": "Sandra Chambers-Rohling"}]