[{"rating": 5.0, "review": "This device is much better than Google' chromecast!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was really simple to get our old TV up to date and now we have a smart TV for our guest room.", "verified": true, "helpfulness": "0/0", "author": "kathy1950"}, {"rating": 2.0, "review": "Returning this because it constantly said it was searching for internet. I did do a little searching and found others with the same problem, but didn't see a clear solution. I don't want to have to try this hard to watch TV.", "verified": true, "helpfulness": "0/0", "author": "B. Ireland \"chickencrazy\""}, {"rating": 4.0, "review": "Love the simple install and useage. Little upset about the rental prices, not high just was not expecting them.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Simple, effective", "verified": true, "helpfulness": "0/0", "author": "Morgen Dietrich"}, {"rating": 5.0, "review": "Excellent product.  It was easy to connect and was shipped timely.", "verified": true, "helpfulness": "0/0", "author": "D. Heard"}, {"rating": 5.0, "review": "Awesome! !", "verified": true, "helpfulness": "0/0", "author": "Maddrika Pyron"}, {"rating": 5.0, "review": "I love that I can watch the show and movies from Amazon Prime on the TV instead of my Kindle and I can still use my Kindle to read my e-mails or play my games at the same time.", "verified": true, "helpfulness": "0/0", "author": "Ernestina Carcana"}, {"rating": 5.0, "review": "The Fire stick is easy to use and to set up. I am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "I have never written a review before, but always read them to make a purchase.If you are a amazon prime member, then this is the best money spent to watch movies, catch up on TV shows with ease, also best way to surf YOUTUBE in full screen. Most of movies and TV shows are free with prime, but new releases are charged a small fee. Amazon will double confirm before purchase is made that no accidental billing.. TV shows that have seasons active still on live TV have option to buy episode or whole season.Its great if you missed an episode of your favorite  TV show. NO commercials, Love it. Past seasons of your favorite shows usually are free.Best money spent for entertainment", "verified": true, "helpfulness": "1/1", "author": "edith szabo"}]