[{"rating": 3.0, "review": "The fire stick is great when it works. We have had issues with stalling while loading and unavailable episodes, multiple times", "verified": true, "helpfulness": "1/1", "author": "Nicole Bledsoe"}, {"rating": 1.0, "review": "We expected more movies that would have been MUCH newer under the prime category.....  as far as the other movies go the prices are too high for prime members. There should have been some kind of discount even if it was JUST a $1.00......i feel amazon can afford more than a dollar........ so, change the deals  and get rid of those OLD movies.", "verified": true, "helpfulness": "0/2", "author": "Nancy Marsh"}, {"rating": 5.0, "review": "I love my fire stick. Gives me many options.", "verified": true, "helpfulness": "0/0", "author": "tawnia noel monroe"}, {"rating": 5.0, "review": "Received my fire stick for Christmas and let's just say by far it has been the best gift ever.  I really enjoy catching up on some few older HBO and showtime series, like that I can purchase movies rather than go out and rent, and enjoy all the free movies as well.  Since I did not do netlike or even possess cable this stick is great for me since it connects with my wi-fi making it easy fro me to keep my bills down when I travel a lot.  I recommend  the fire stick to anyone plus its so easy to install trust me anyone can set it up and it takes all of 30 seconds.", "verified": true, "helpfulness": "0/0", "author": "vadim69"}, {"rating": 5.0, "review": "I do love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Huge disappointment. I feel like I paid $40 to watch YouTube on my TV, I expected much more than what it offers. And, it is clearly android ready, but NOT Apple ready.", "verified": true, "helpfulness": "0/1", "author": "Marcia Fischer"}, {"rating": 3.0, "review": "I like it so far. Hopefully I will be able to drop some of my cable items.", "verified": true, "helpfulness": "0/0", "author": "Sandra Conway"}, {"rating": 5.0, "review": "worked right away, I like that. just plug it in and use it.", "verified": true, "helpfulness": "0/0", "author": "ann pragar"}, {"rating": 5.0, "review": "Love this little guy. Cheaper then cable. Amazon Prime is the best.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install plug and paly", "verified": true, "helpfulness": "0/0", "author": "Pam Brickman"}]