[{"rating": 3.0, "review": "When it works it does a great job, but periodically I am getting HDCP Content not authorized error and can't view video anymore. This is frustrating. I have a chromecast too which has worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Prakash Vaidyanathan"}, {"rating": 5.0, "review": "I bought this as a pre-order before it came out.  I didn't really need it, because I'd already bought the Netgear Push2TV, and I only have one HD TV,  but it works great with Amazon Prime, and will mirror the screen of my Kindle too.  I haven't subscribed to anything else yet.", "verified": true, "helpfulness": "0/0", "author": "SandieMI"}, {"rating": 4.0, "review": "I replaced my Roku with this. It works well and I like it.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "Does not work out side USA", "verified": true, "helpfulness": "1/2", "author": "Luis Guiloff"}, {"rating": 5.0, "review": "Very easy to set up and start using. We have a trial Amazon Prime membership and will probably get a full membership once the trial runs out because there is tons of free content available. My husband has been watching an old tv series he loves and we are about to start exploring what else is available.", "verified": true, "helpfulness": "0/0", "author": "rcwriter"}, {"rating": 5.0, "review": "Awesome for its price!!", "verified": true, "helpfulness": "0/0", "author": "San Jose, CA"}, {"rating": 5.0, "review": "Love the stick, wish it did not need a power cord like my Roku MHL - but its awesome otherwise", "verified": true, "helpfulness": "0/0", "author": "Mike & Cyndi \"Mike & Cyndi\""}, {"rating": 5.0, "review": "Easy to set up.  It was exactly what I expected.", "verified": false, "helpfulness": "0/0", "author": "AMY L HYSLIP"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer D. Scates"}, {"rating": 4.0, "review": "Wish we could add more apps! There are lots of apps you can get on Amazon.com but not compatible with Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Persian"}]