[{"rating": 4.0, "review": "I started off using this in my bedroom with a the router being approximately 10 to 12 feet away in the next room. I continually get errors and pixelation problems. Recognizing that the Wifi may be weak, I decided to move it to the main TV which is located directed beside the router. While the problem isn't as constant, it most certainly still exists. I am currently watching a bowl game on ESPN through the fire stick and it has lost connection 5 times and the game still has almost an entire half to play. Honestly, this is just ridiculous. I have no problems with any other device in the house. I went as far as disconnecting everything else, but that made no difference. I am a huge supporter of amazon and they are my go to online retailer, but their products seem to be released before they are ready for prime time. (I'm referring to the fire phone as well).Pro's-Quick searching when compared to my gaming systems-Remote is a plus-Small size-Picture looks great (when working)-Great setup for Prime MembersCon's-Requires additional power to operate stick in most cases-On paper a much better device than what you actually get-Definitely another shot at a proprietary device for amazon-Wifi is very week or there is a major software issueI cannot recommend this product in good faith to anyone until amazon fixes the connectivity issue. As far as it being centered around Prime, I get that it's the point to increase revenue. My personal opinion is that Amazon could \"play well with others and be less like apple\".***UPDATE 1/9/15Amazon reached out to me after reading my review and offered to trouble shoot my fire stick. This is why I love amazon, they actually care about their customers!!! A rare occurrence these days...  After 45 minutes of tinkering we did the one thing I neglected to do... A factory reset and start over. This has solved all the problems I've had till this point. If you are having connection issues like I was, do a factory reset and see if it helps. Good luck, I hope I save some of you some time trouble shooting.", "verified": true, "helpfulness": "0/1", "author": "Fitquest"}, {"rating": 5.0, "review": "I bought this when it was offered to Prime members for $19.99 and I can't remember when I spent $20 for something and was happier with it. Very easy to set up and use, literally took less than 5 minutes. I have been watching Prime movies and shows like crazy, also can go right to Netflix. Even listen to Pandora and IHeart radio while I do things around the house. I feel like the Fire TV stick helps me get more out of my Prime membership than I was before.", "verified": true, "helpfulness": "0/0", "author": "SandyK"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "andy louie"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "David J. Sultzer"}, {"rating": 5.0, "review": "The Fire TV Stick is easy to install and user friendly. A \"must\" for AmazonPrime customers.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cable is not available where I live and satellite TV is too expensive in my opinion so for years, I've been content with OTA tv. Now, with the Fire Stick and a Netflix subscription and my Prime membership, I have access to tons of cable programming and movies for a fraction of what cable or satellite would cost. Love it!", "verified": true, "helpfulness": "0/0", "author": "Greg's Reviews"}, {"rating": 5.0, "review": "Great concept.  Easy to use at home or on the go.", "verified": true, "helpfulness": "0/0", "author": "Mom~of~Five"}, {"rating": 5.0, "review": "I like the fact that an short HDMI extension cable is included with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "CEC732"}, {"rating": 5.0, "review": "Easy to install.  Works well.", "verified": true, "helpfulness": "0/0", "author": "John Mitchell"}, {"rating": 5.0, "review": "Absolutely love the Fire Stick!  It's been a great option and it is so easy to use!  I would highly recommend the Fire TV  Stick.", "verified": true, "helpfulness": "0/0", "author": "Jana Watt"}]