[{"rating": 5.0, "review": "Affordable with a large variety of shows to choose from. Enjoying every minute of it.", "verified": true, "helpfulness": "0/0", "author": "Barry and Brenda Underwood"}, {"rating": 5.0, "review": "Works like to Box. Fast, easy to use-great price.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 3.0, "review": "My Fire Stick was a gift so I am still learning.", "verified": true, "helpfulness": "0/0", "author": "chappologie"}, {"rating": 3.0, "review": "We also have the Chromecast  and I prefer it over the Fire stick. I think the Fire is more restricted.", "verified": true, "helpfulness": "0/0", "author": "CM \"clem\""}, {"rating": 5.0, "review": "It  is great .  Have watched movies from Amazon with it.", "verified": true, "helpfulness": "0/0", "author": "Joyce Laughlin"}, {"rating": 4.0, "review": "A step up from the Chromecast that I had (and have since given to my daughter).  Getting around on the menus could be easier but, otherwise, a pretty solid product.", "verified": true, "helpfulness": "0/0", "author": "John P. Hite Jr."}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works!", "verified": true, "helpfulness": "0/0", "author": "Steven L. Krammer \"kramodog\""}, {"rating": 4.0, "review": "Overall, really love it! Easy to access Netflix, Hulu +, Amazon Prime Video and YouTube all from one place. So convenient! The only issue is that sometimes it buffers or gets frozen. I find that it buffers or freezes a little more often than my Chromecast device.", "verified": true, "helpfulness": "0/0", "author": "C- Town"}, {"rating": 5.0, "review": "UIJust to get it out of the way: The interface sucks. It is terrible. Sorry for not starting that comment with \"I think\", but it's pretty obvious that Amazon was going for marketing > user experience. The controller works very well. It is simple and ergonomic.Streaming!?Youtube and Netflix can stream from their respective apps (ala Chromecast) on my Android phone, which was an unexpected and pleasant surprise! I hope more apps get in on this, because, once again, the actual firetv/stick app interfaces are nauseating.GamingAnyhow, some simple gaming added some gimicky fun. The Frogger knockoff (Crossy Road) is amusing and entertains my kids. I will be purchasing a game controller (a $12 Gamestop one, NOT the $40 brand name... Forty dollars? Really? This isn't an Xbox). I'm gonna play some Sonic the Hedgehog, which I got as a free app of the day back in December! I'm genuinely excited for the nostalgia.Android AppPretty well done! While I'd rather tap directionals than swipe up/down/left/right, the app is very intuitive! Most notable is the microphone, which is activated by pulling down on a top 'handle' and holding down while you talk. Upon release, the search begins instantly, and is fast!I hate waiting for Google or Siri to listen an additional second to make sure that I've finished talking before beginning to search, OR if I pause or stumble, go ahead and search my half-finished thought. Won't happen here.HOWEVER, only being able to search Amazon makes the search tool useless anyway, so that was a wasted paragraph.The HUGE Selling PointIf a person was so inclined (not necessarily me...), it is RIDICULOUSLY easy to load Google Play Store apps to your device straight from your phone! You can put more apps on there than even Google TV has available (If that's your thing...). This includes tons of TV/Movie apps and Games that would (hypothetically) make this device a very complete system. There are also apps that allow you to bypass the crappy Amazon UI with quick links on your phone/tablet.In all, I use it more than the Chromecast, simply because it can do everything and more. I'd pay more if I could directly stream from more apps on my phone...", "verified": true, "helpfulness": "1/1", "author": "John M."}]