[{"rating": 3.0, "review": "everything is OK ! but I have fire TV in one room and fire stick on my TV. now I can get mirroring to work from Kindle fire HDX 7 to work on my TV with fire stick. And I can not disable enable mirroring on other TV with fire TV. amazon support on these things \" SUCK\"otherwise I am ok on stick", "verified": true, "helpfulness": "0/0", "author": "prakash"}, {"rating": 5.0, "review": "Fast!!!", "verified": true, "helpfulness": "0/0", "author": "Cote Nunez Jose Tadeo"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Rafael Rojas"}, {"rating": 4.0, "review": "It's Great! I get Prime movies, music and apps!  I don't like that it has to be constantly plugged into an electrical socket to work.", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Joanna Morrill"}, {"rating": 5.0, "review": "Awesome! So portable and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Alden Earl"}, {"rating": 4.0, "review": "Just received. Like so far, although it does obviously favor Prime stuff as far as convenience goes. Remote doesn't seem as flimsy as others have mentioned. Seems fine to me. The one aspect I have found I prefer over Roku thus far is that I can continue the Pandora play while I back out and browse...now if the forthcoming IOS app would allow me to mute the TV and listen through the iphone that would be the bees knees...", "verified": true, "helpfulness": "0/0", "author": "Garland R."}, {"rating": 3.0, "review": "This works great sometimes, other times it is slow to stream and gives me a message to check my internet speed.  Well, I did check my internet speed, and it is uber-fast, so no p0roblems with my internet speed.  Don't know why it stops movies as they stream (very frustrating), but there is a problem somewhere unrelated to internet speed.", "verified": true, "helpfulness": "0/0", "author": "milmom&proudofit"}, {"rating": 5.0, "review": "Got it for $19.  Best product in this category at that price.  Full 1080p HD, remote, integration with Amazon prime.  At $39 though, I prefer my $25 Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Fluid_Dynamics"}, {"rating": 5.0, "review": "Great device for every house", "verified": true, "helpfulness": "0/0", "author": "alex etesami"}]