[{"rating": 5.0, "review": "Love it.  Did more than I thought it did.  Not expensive, hooks right up.  Perfect.", "verified": true, "helpfulness": "0/0", "author": "Terrie"}, {"rating": 4.0, "review": "Lots of options with the Fire TV Stick as far as loadable apps (a major plus over Apple TV), games and rent-able video straight from Amazon. Being able to plug into the TV and utilize the USB outlet for power eliminates pesky cables showing like with Apple TV. All that being said, this is nowhere close to the smoothness of Apple TV, transitions in and out of apps are not as quick. All in all, I am satisfied, especially for this price, with Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "B. P. Coppock"}, {"rating": 3.0, "review": "Stupid me thought it connected to the internet.  No, only existing programs like netflix, hulu, etc.  And not all movies are free on Prime.  For what it does do, it's pretty good.", "verified": true, "helpfulness": "0/0", "author": "M. Parrino"}, {"rating": 3.0, "review": "Not that user friendly.  I don't understand as a Prime Member, why a person has to pay to watch certain shows? Also, I really don't like having to deal with this remote.  Who needs another remote?  After struggling with typing in the search area for what we wanted and then to discover one has to pay for some of these shows, we went back to Chromecast.The app that installed doesn't work that great either as I had to back to the remote and arrow what I want.I may go back to this in the future, but for now Chromecast Is easier for us.", "verified": true, "helpfulness": "0/0", "author": "C. French"}, {"rating": 5.0, "review": "Awesome device!", "verified": true, "helpfulness": "0/0", "author": "JOSHUA"}, {"rating": 5.0, "review": "Love this!!", "verified": true, "helpfulness": "0/0", "author": "Melissa Zeltner"}, {"rating": 5.0, "review": "After years of getting angry paying our $200 cable bill we finally decided that cable was just too expensive and cut the cord. We purchase only internet for our home and use the Fire Stick, Digital Converter Box (We picked up for cheap at the grocery store to get local stations and news), and our Game systems as our primary television watching. We are so happy with our switch. We use the fire stick to access our netflix account, watch movies with our amazon prime, and purchase movies. Our only problem with this fire stick, is that HBO GO is not supported for our cable provider. We would love to watch our HBO series like GOT on this, but we can only watch it on our gaming console in a different room. We're about 8 months cable free and couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Love my Fire TV Stick. I have Chromecast as well, both are good units. Just a matter of what shows/movies you are looking for.", "verified": true, "helpfulness": "0/0", "author": "Andrew Kelly"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Carol J Trowhill"}, {"rating": 5.0, "review": "Very easy to set up.  Loads of TV series we've not been able to see.  This was a gift for my husband who absolutely hates commercials!  Will continue with Prime after the initial trial is completed.  Would love to see more current fitness videos available on Prime.  Netflix used to have the Crunch series, then got rid of all the good workouts.  I'm not impressed yet with the free workouts yet, but maybe that will change.  Great value for the price!", "verified": true, "helpfulness": "0/0", "author": "Beverly"}]