[{"rating": 5.0, "review": "Love it, we use it for our game room", "verified": true, "helpfulness": "0/0", "author": "Suzi Tanner"}, {"rating": 5.0, "review": "Works wonderful!!", "verified": true, "helpfulness": "0/0", "author": "Paul Viator"}, {"rating": 5.0, "review": "Very easy to follow instructions and set up.  Very pleased with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Karie Carter"}, {"rating": 3.0, "review": "I recently canceled my cable service to get the amazon fire stick because I only watch TV for two reasons the CBS/BBC news and Movies I would however like for there to be a local news option.", "verified": true, "helpfulness": "0/0", "author": "Obrian"}, {"rating": 5.0, "review": "Best thing ever happened to streaming, love it", "verified": true, "helpfulness": "0/0", "author": "Amonia M Stone"}, {"rating": 5.0, "review": "Yes it has its to the point that I might just cancel my cable provider!!!!", "verified": true, "helpfulness": "0/0", "author": "Jerry Villanueva"}, {"rating": 2.0, "review": "I received a replacement and am still having problems viewing movies, many interruptions !!!", "verified": true, "helpfulness": "0/0", "author": "Joyce E. Hill"}, {"rating": 5.0, "review": "The fire stick was easy to install and easy to use,", "verified": true, "helpfulness": "0/0", "author": "Mary B Fukalek"}, {"rating": 1.0, "review": "wouldn't stay connected long enough to even hit the home page, we use a shared wifi but none of the info said it didn't work with a shared wi fi. also got very hot was afraid it would catch my tv on fire. got a hold of customer service and they were going to send me a refirbished one to replace the new one. don't like refurbished product to replace a new one. They emailed me a return label to send it back and then purchase a new one. Why not just send a new one or cross ship.", "verified": true, "helpfulness": "0/0", "author": "S. Dickison"}, {"rating": 5.0, "review": "It's the best thing ever!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]