[{"rating": 5.0, "review": "I have been using the original Roku for a loooong time, since it first came out.  It sort of works OK, but I had to replace the original power supply.  I got the Fire Stick when it was first introduced but had not hooked it up until now several months later.  Setting up was really easy.  I had to look up online how to find the device MAC address, but its right there, just not showing since its the last option at the right -- a suggestion to Amazon: move that option all the way to the left so that it appears when you need to connect wirelessly.  There is no ethernet hookup, but wifi seems to work very well.  It loads movies fast at our house just a few seconds, especially compared to the old first-gen Roku.  Its as easy to navigate the menus once you understand the basic scheme.  I use it for Prime movies and TV as well as Netflix movies.  If I had one complaint, its the alphanumeric text entry.  Its similar to the Roku in that you navigate letter by letter, but the layout seems less efficient.  I guess noone has solved this yet.  I plan to set up my watchlist on a computer.  Or get the fire tv voice input which should have been built-in.  For the price it does what it does (deliver movies and TV) very well.  I have not tried any games.", "verified": true, "helpfulness": "0/0", "author": "R. R. Ando \"compscinerd\""}, {"rating": 4.0, "review": "Great for streaming from a dedicated movie server.", "verified": true, "helpfulness": "0/0", "author": "Dion Blackmon"}, {"rating": 5.0, "review": "great item, you can install xbmc on it", "verified": true, "helpfulness": "0/0", "author": "Miguel Alejandro Sanchez Luna"}, {"rating": 5.0, "review": "The stick itself is great but the instructions are really bad", "verified": true, "helpfulness": "0/0", "author": "glenda foerster"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Does not work with my sound bar so I am unable to hear the great quality of HD. But otherwise easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Waychoff"}, {"rating": 5.0, "review": "I Love it.....Goodbye cable", "verified": true, "helpfulness": "0/0", "author": "lexis"}, {"rating": 1.0, "review": "The lag is unreal, I'm going to give it a few more days but most likely will be returning the stick.  Netflix is almost unbearable to watch, it stutters and lags about every 40 seconds.  I have 105 MBS down, so Its not a speed issue.", "verified": true, "helpfulness": "1/1", "author": "Paul M"}, {"rating": 3.0, "review": "Hi ..I was wondering if anyone has a nexus 6 phone and if its compatible with the fire stick? Thanks", "verified": false, "helpfulness": "0/0", "author": "Debie"}, {"rating": 5.0, "review": "I really like the fire stick. I thought that all movies were included with prime which is not true but, overall I'm very pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Emily Sizemore"}]