[{"rating": 5.0, "review": "Way more capability than I expected.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Brand"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "jdeneckejr"}, {"rating": 5.0, "review": "Absolutely love it. Works great and there are some games on here that I can play with my family", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Jessica Warrick"}, {"rating": 5.0, "review": "Great!  Nice price.", "verified": true, "helpfulness": "0/0", "author": "Ann Dory"}, {"rating": 4.0, "review": "Kind of disappointed that hbogo via charter Internet doesn't work on it, but other than that, it's pretty awesome!", "verified": true, "helpfulness": "0/0", "author": "Stephanie LaVelle"}, {"rating": 5.0, "review": "Awesome!  Way to go Amazon!  You are amazing.  Already had fire TV in one room and got the fire stick on Prime day for a great price.  Now our family can enjoy Amazon Instant Videos and Netflix in two rooms of our house.  Set up took 5 minutes.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "This is by far the very best streaming stick on the market. Side load Kodi on it and install some 3rd party Kodi plugins and you are golden! Read my tutorial on how to turn your Fire TV Stick into the ultimate media center.http://www.androidguys.com/2015/07/21/how-to-turn-a-39-fire-tv-stick-into-the-ultimate-media-center/", "verified": true, "helpfulness": "0/0", "author": "GusTeez"}, {"rating": 5.0, "review": "I give this a 5 star.  I took it right out of the box plug it into my T.V., and I was off to start watching my T.V. shows.  Quick and easy", "verified": true, "helpfulness": "0/0", "author": "Sgarza817"}, {"rating": 5.0, "review": "I bought this looking for an upgrade from an older Roku box that I've been using for some years now. I was immediately impressed. Installation is a breeze and only took about 5 mins from the box to when I was able to start watching. I have limited space so I love that I don't have to have a box connected to my tv anymore. The picture is clear, the menu is easy to understand and everything works just fine. The price was already great, but I managed to grab this on Prime Day so I picked it up for a better price. I cut the cord on cable a whole ago, so it's important to me to have a reliable streaming service. I'm very pleased and impressed with this Fire Stick. It's out of sight, easy to use, and the games are fun as well lol. No regrets here!", "verified": true, "helpfulness": "0/0", "author": "Ashley F"}]