[{"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "shawntrelle pettiford"}, {"rating": 1.0, "review": "OK I gave it a few weeks, and here it is.  Don't like it much.  For $40, it makes it easy to sit and use a remote to use to change hundreds of channels that love locking up and having to be restart....LOVE watching Mission Impossible ads every reset...Thanks for the great product.  Pretty sure I am going to send it back.  It's lacking in reliable performance. well anything close to performing.  Right now it is just a pathway to poor viewing.", "verified": true, "helpfulness": "1/1", "author": "Chris  Zanotti"}, {"rating": 5.0, "review": "Best thing I have bought so far in Amazon", "verified": true, "helpfulness": "0/0", "author": "Mayra Flores"}, {"rating": 5.0, "review": "I got it for Netflix, and have used it for so many things already. It has surpassed my expectations and then some. I have even been using the power adapter that came with it to charge my tablet until I can replace my old charger.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Easy  setup.  Wide selection of content plus all the additional choices for being a \"Prime\" member.  Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Ed W."}, {"rating": 4.0, "review": "Had this for about 3 weeks now and love it. Only problem I have with it is you have to be close to the modem. The range is short compared to if you had a tablet or cell phone", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "I purchased this to make up for the lousy experience with our daughters Smart TV. I was torn between this and the Roku Stick, but after using the Amazon Fire Stick for about a week or two, I feel I made the right decision. Set-up took no longer 5min, switching between menus is crisp and effortless, and Amazon video starts instantaneously. I couldn't be happier with this product and its user experience.", "verified": true, "helpfulness": "0/0", "author": "MKULTRABLIZZARD \"-c\""}, {"rating": 1.0, "review": "Ok I love Amazon and their Prime service.  I order EVERYTHING on Amazon except food.  So we thought we would try these Sticks, 2 of them.After 6 months, we are done.  VERY VERY SLOOOOOOOOW system.  Not enough memory.  With the stick just 15 feet UNOBSTRUCTED to the router, we would STRUGGLE to get 480 streaming.  And my network is fine, all other devices were fast.  30Mbs down, 5Mbs up.  And the neighbors are too far away to interfere with signal.  Heck, my computer on the other side of the house would connect at faster speeds than the stick.After many app uninstall/reinstalls, clearing cache, clearing data, restarts, reconnecting to network, and finally reset factory setttings, we were done.  In fact after the last reset, we couldn't connect to the network anymore.Also I HATE the menu.  I like the idea of keeping Amazon content INSIDE a channel/app but Amazon mixes their content into the Home Screen.  Disorganized, and ugly.  And did I mention SLOW menu moving?We went to the Roku3 (not the stick) and oh my GOD it's fast.  No issues with speed or streaming quality. It just works great.Stick with Amazon, and Prime.  But the Fire Stick is NOT ready for prime time.  Too bad.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Audio sync is out on HBO, Starz, and Netflix. After searching the internet for a solution for hours nothing seemed to work so i will be returning the stick and trying the full FireTV.", "verified": true, "helpfulness": "0/0", "author": "Rob L."}, {"rating": 1.0, "review": "It's ok. I was hoping all the people talking about connection issues just had their networks configured wrong but unfortunately there is a real issue with the way the fire stick connects to the Amazon servers. Maybe the issue is with the servers themselves. Either way a dropped connection is unacceptable since the only point of this device is to connect you to your entertainment. I'm a very happy Amazon customer and have been for years but they dropped the ball with this", "verified": true, "helpfulness": "1/1", "author": "ryan meehan"}]