[{"rating": 5.0, "review": "Love this. But buyer beware - we had to upgrade and move our router closer to tv as this draws a lot of bandwith. Tooled around for 2 weeks until we got it to stream - with much help from Amazon's tech service personnel who were terrific.Love this for kids to watch amazon prime, and we can take with us to another location which is great.", "verified": true, "helpfulness": "0/0", "author": "K. Olson \"kolson26\""}, {"rating": 5.0, "review": "So much better than Chrome stick...", "verified": true, "helpfulness": "0/0", "author": "C. Volpe"}, {"rating": 5.0, "review": "The best streaming stick out there. Great interface and has good Android support.", "verified": true, "helpfulness": "0/0", "author": "Pavel Dimens"}, {"rating": 5.0, "review": "Love this! Love the parental controls...pin number to purchase or download anything, even if it's free! Picture is super crisp. So much better than hooking up my computer to my tv with an hdmi.", "verified": true, "helpfulness": "0/0", "author": "Christine B."}, {"rating": 5.0, "review": "It exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "troy dworning"}, {"rating": 5.0, "review": "this is awesome. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "sandra thorndike"}, {"rating": 3.0, "review": "I expected much more free viewing with my prime account.  95% of what we want to watch there is a charge.  I'm disappointed.", "verified": false, "helpfulness": "0/0", "author": "Cornerstone C."}, {"rating": 5.0, "review": "I love this.  Much easier to use than the apps found on my blue ray player.", "verified": true, "helpfulness": "0/0", "author": "Michael Young"}, {"rating": 5.0, "review": "Love it! It has given us so many opportunities for movies and TV. Thanks AMAZON!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa Bradley"}, {"rating": 4.0, "review": "I like this a lot. I have it hooked up through my Yamaha receiver, not my tv.  Works great. Only downside is I can't get audio from it for a different zone on the receiver. I could if I paid $3000 for a new receiver that has that capability but can't figure it out otherwise. I do wish you could add your own apps to it instead of using the ones that come with it.", "verified": true, "helpfulness": "0/0", "author": "Celeste"}]