[{"rating": 5.0, "review": "Haven’t used it to much yet, but I hope to watch lots of movies on it and use my Amazon Prime more efficiently.", "verified": true, "helpfulness": "0/0", "author": "iltxok2"}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 1.0, "review": "The Firestick seemed like a good product except it apparently does not have sufficient memory to ensure continuous streaming. It became so frustrating that we went back to our old ROKU which worked perfectly with no issues.  The Firesticke control is superb, but lack of memory is a deal killer.  Watching a two hour movie takes four hours because it starts and stops.  Don't buy until this is fixed!", "verified": true, "helpfulness": "1/1", "author": "J. Latimer"}, {"rating": 5.0, "review": "LOVE IT!, glad I waited on this stick!", "verified": true, "helpfulness": "0/0", "author": "Eugene Henley"}, {"rating": 5.0, "review": "It does a good job as advertised.  The price is excellent and very easy to install.  It's important that the USB power comes from the ac adapter supplied and not other sources, otherwise you could experience lockups.", "verified": true, "helpfulness": "0/0", "author": "Gordon"}, {"rating": 5.0, "review": "better than advertised. I highly recommend every one get one.", "verified": true, "helpfulness": "0/0", "author": "Joseph Russo"}, {"rating": 5.0, "review": "Everyone in the family loves it!  Makes streaming simple and fast.", "verified": true, "helpfulness": "0/0", "author": "Stacie Blair"}, {"rating": 5.0, "review": "works great, love how i can search for a movie and if it is on hulu or netflix it will tell me, not just amazon.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Perfect for the TV that's difficult to run cables to.", "verified": true, "helpfulness": "0/0", "author": "Steve Machulis"}, {"rating": 5.0, "review": "Amazon is much better than Apple TV. Their original content plus easy recommendations interface is extremely user friendly. I really enjoy this purchase and look forward to having all my TVs with a stick someday.", "verified": true, "helpfulness": "0/0", "author": "Eric Bouris"}]