[{"rating": 5.0, "review": "Love it!! Definitely would recommend it & repurchase for any other TV in my home", "verified": true, "helpfulness": "0/0", "author": "MissSunshine"}, {"rating": 4.0, "review": "Much better than chromcast. But I feel roku interface little bit better but there is no match to amazons voice search (in amazon content ).", "verified": true, "helpfulness": "0/0", "author": "Amit Singh"}, {"rating": 2.0, "review": "Runs hot and then loses ability to stream videos....", "verified": true, "helpfulness": "0/0", "author": "D. Hanson"}, {"rating": 5.0, "review": "First time writing a review. I've been actively using this for a couple of weeks and it's been amazing. Much faster than my Chromecast and seems more stable as well. There is a larger array of compatible apps, and the interface is pretty snappy. The only grip I have is that i'm tied to the use of the remote. I wish there is a phone remote app for this for IOS.", "verified": true, "helpfulness": "0/0", "author": "JOANNALILY"}, {"rating": 3.0, "review": "I really wanted to love this product.  I mean it is so portable, and the price is amazing.  As far as what it has to offer in terms of channels etc., it is pretty great.  But the layout is not as user friendly in my opinion as the Roku.  As well, the remote has some major issues.  Click right or left or up or down just once and it will skip past 5 or 6.  This makes it extremely frustrating when you are trying to stop on one show and you keep ending up two or three past it on either side.  I will call Amazon and report later with a more complete report.", "verified": true, "helpfulness": "0/0", "author": "Tara Grajal"}, {"rating": 1.0, "review": "I purchased two in hopes of keeping one for myself and gifting the other. Unfortunately, both devices could not properly connect to my network, despite the fact that the router is only 8 ft away. All my other devices use the WiFi just fine, so I know my router is working. The remote on one was malfunctioning. It would often freeze or jump digits when I was trying to put in a word. I tried resetting the device to factory settings but then could not log into my Amazon account. I was told that the information I entered did not match up with any existing accounts. How is that possible? I'm returning both. I've been a long time Amazon customer and am disappointed in their product. I expect more. The fact that this product is so highly rated makes me wonder if they are padding the reviews for their own benefit. I can't see why anyone would be happy with this product.", "verified": true, "helpfulness": "1/3", "author": "Aaron"}, {"rating": 5.0, "review": "The Fire Stick works better than the Fire TV in my opinion. I use an Apple TV for our main living room tv and a Chromecast for the one in the bedroom. I bought this to replace the Chromecast because my wife was sick of having to use her phone to sling shows to the tv. I will say that I am highly biased to Apple products so keep that in mind as your read.DESIGN:The stick is designed well. What I really liked was the location of the power input on the stick. Having it on the side of the device allows you to plug it into a perpendicular HDMI port against a wall without smashing the cord (one of the Chromecast's shortcomings). The stick is amazing small for how much hardware they put inside.  The interface is easy to navigate and looks clean. I really like the ability to set a screen saver from photos that you have saved on Amazon - similar to Apple TV.REMOTE:The remote definitely feels cheaper than the Voice remote, but I don't consider it to be flimsy. They had to save money somewhere, so I totally understand the design. It navigates the menus easily and doesn't require line of sight (a very nice feature that I wish the Apple TV had).PERFORMANCE:  Amazon Instant Video content loaded within .5 - 2 seconds of pushing play. Netflix, Hulu, and Youtube videos load slightly faster than the chrome cast. Navigation through the menus and apps is remarkably smooth, not as smooth as the Apple TV, but this device is 1/5 of the size.ANNOYANCES:  First, the introduction video that you are forced to watch - no clicking through it or fast forwarding - is pathetically stupid and insults the intelligence of anyone who has ever used a smart tv in the past 5 years.This is a very poor decision on behalf of the software design team. I watched something similar to it when I tried the Fire TV six months ago, and am shocked that they doubled down on it. If you feel the need to spend 3 minutes explaining your content streamer, you've done something wrong in designing the interface.  Secondly, I find it annoying that you can't view content outside of the apps of Netflix, Hulu, etc. You have to open the apps in order to view watch lists that aren't Amazon Instant Video. There is no need to shelter the Amazon ecosystem, because that is still the only way to purchase content that isn't available anywhere else.CONCLUSION:  The Fire Stick is THE streaming device to get this holiday season. It is better than the Chromecast in nearly every way and more affordable than Roku devices (the $49 Roku Streaming stick is NOT worth the money). For anyone who isn't invested in the Apple ecosystem this would be my top recommendation for content streaming.", "verified": true, "helpfulness": "0/1", "author": "Blake"}, {"rating": 5.0, "review": "Awesome... Way better than Roku.", "verified": true, "helpfulness": "0/0", "author": "Allison C. Stanley"}, {"rating": 5.0, "review": "4 more GB than Google Chrome and a lot more apps!  Much to enjoy, very clear, watching Netflix or Prime movies from Amazon is great but has so much more to offer.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "...more like a plea for help! I bought this as a Christmas gift for parents, assuming that their TV was young enough to have and HDMI port. Surprise! It doesn't. However, it does have a USB port (not micro). I've searched for HDMI to USB adapters and I know that generally a cable is a cable is a cable, but I just want to know if anyone had recommendations on which one to get? Or am I just gonna have to tell them to buy a new TV?", "verified": true, "helpfulness": "0/0", "author": "Nichole"}]