[{"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "California Shopper"}, {"rating": 1.0, "review": "This device loses it's network connection every day. After sending me to network settings, it either won't rescan for SSIDs or tries to make me retype my security key then won't accept it. Works fine after doing a hard reset.  My original 2008 Roku is more reliable than the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Loring Hummel"}, {"rating": 5.0, "review": "Super easy to set up and use. The back of the remote was a little tricky to place the batteries in..but a quick utube video fixed that!", "verified": true, "helpfulness": "0/0", "author": "margaux milchen"}, {"rating": 5.0, "review": "nice, responsive, beats the pants off of chrome cast, amazon stuff is annoying but I use it for the sideloaded programing", "verified": true, "helpfulness": "0/0", "author": "Todd M."}, {"rating": 1.0, "review": "Holy cow, this thing sucks! The first time I used it, it worked great. It has never worked right since. For some reason, no matter the network, it cannot run for more than a few minutes without buffering... endlessly. I have tried on multiple wireless networks and it is the same no matter what. Do not buy this device.", "verified": true, "helpfulness": "0/1", "author": "G.J."}, {"rating": 5.0, "review": "For the price I got it at which was half-off because of a pre-launch special I would say it was a great deal.  Hopefully they upgrade functionality to make it even better with firmware updates.", "verified": true, "helpfulness": "0/0", "author": "Evergreen Tennis Junkie \"tennisjedi\""}, {"rating": 5.0, "review": "Just the ticket for a great selection of movies and TV series. The menu is superior to the one I was using on my blue ray player. Was able to add Netflix which was a great improvement also. The Fire Stick was easy to set up and is a breeze use. I says this being a senior who is tech challenged. As always great product from Amazon and fast shipping.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 4.0, "review": "Fire Stick appears to work as advertised.  But,  I am trying to use it to connect with Slingbox and it appears that there is some form of ISP block which keeps disconnecting Slingbox from the 'net.  Because of this, I have not been able to give Firestick a fair trial.  We'll keep trying.  Fred S", "verified": true, "helpfulness": "0/0", "author": "Fred S"}, {"rating": 1.0, "review": "Bought for Sling TV which doesn't work well. Sling TV customer service told me tough luck. I still have to pay for 3 months of service which is barely visible. Amazon gave me $10, but do not buy for Sling TV!!!  You've been warned.", "verified": true, "helpfulness": "1/3", "author": "Jason"}, {"rating": 4.0, "review": "Great for the bedroom TV, a few issues with My Wifi (blocked signal) once I got that resolved everything is cool. Good product, for such a small device. L I K E .", "verified": true, "helpfulness": "0/0", "author": "no1amigo \"no1amigo\""}]