[{"rating": 4.0, "review": "Works great...kind of disappointed that even being a prime member there are still programs that you have to purchase to watch.", "verified": true, "helpfulness": "0/0", "author": "C. Myers"}, {"rating": 5.0, "review": "Love it! I have a TV mounted on the wall so this is perfect just plug it in and ready to go. Set was easy. It was a little different from my other box on other TV so took a bit to get used to but that was a very minor thing. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "sandy"}, {"rating": 1.0, "review": "Bought this because I thought I could stream any website from my laptop to the Fire TV Stick and found out otherwise.  You have to pay for many of the movies and TV series in addition to any other fees.  I will be exchanging the Fire TV Stick for the Chromecast tomorrow.  Not at all what I was hoping for, very disappointing.", "verified": false, "helpfulness": "1/1", "author": "M. Emmerich \"M Emmerich\""}, {"rating": 4.0, "review": "Love this little Fire stick. It connects up easily and is not too difficult to find what you want to watch. Sometimes I get bumped off my viewing, but I feel that it's the fault of my internet provider. I would like to be able to access my VuDu account since it has a lot of my ultraviolet copies. The price is very reasonable and I trust Amazon to produce a quality product.", "verified": true, "helpfulness": "0/0", "author": "L. Stephens"}, {"rating": 3.0, "review": "Does the trick but is buggy and still needs a LOT of work. Has to be reset often since it freezes. Why don't we have access to common apps such as YouTube??", "verified": true, "helpfulness": "0/0", "author": "proudnlazy"}, {"rating": 4.0, "review": "Great! More channels coming I hope!?", "verified": true, "helpfulness": "0/0", "author": "C'Uda"}, {"rating": 1.0, "review": "THE CONTROL REMOTE DOESNT WORK VERY WELL", "verified": true, "helpfulness": "0/1", "author": "gustavo leal"}, {"rating": 5.0, "review": "Super!!", "verified": true, "helpfulness": "0/0", "author": "Brandon L. Torres"}, {"rating": 5.0, "review": "Works perfectly. We did not want another box in the house so went for the Fire Stick instead of the Fire TV and it has been the best decision ever. Very simple setup and everything is easily accessible.", "verified": true, "helpfulness": "0/0", "author": "DABSHAB \"DAK\""}, {"rating": 5.0, "review": "We wanted to \"cut the cord\" at our second home. We got a Slingbox M1 for our full time home, added a wireless connection along with the Fire TV Stick at our second home. Our internet speed at the second home is just 3 mbs down and there is no lag or buffering. Running full HD.  We get all our regular programming, plus sports (NY area teams).  Freaking awesome little device.One warning:  Amazon has an app called Sling TV. This is a subscription service (20 bucks a month). Do not confuse this with Slingbox.  Once you have a Slingbox (I paid $150 for the M1) running with the stick, there is no cost to you.", "verified": true, "helpfulness": "0/0", "author": "Front4"}]