[{"rating": 3.0, "review": "I've had this for quite a while, and thought it was great initially, once we got a splitter with a longer cable to allow it to share the TV's HDMI port with our DVD player, but have all but given up trying to stream Netflix movies with it; the last three times we've tried this week - both in the evening AND mid afternoon -  it kept buffering and buffering (the last 10 minutes of the movie the other night took more than a half hour to get through with all the stoppages). Completely unacceptable performance. Oddly enough, Amazon Prime movies seem to play just fine through it though (file THAT one under \"things that make you go 'hmmmm'\", that Amazon things play fine through it, but that their direct streaming competition is all but  unwatchable.) And it's NOT Netflix's issue, we unplugged the Stick and hooked our Roku box back up and streamed a Netflix movie that way tonight. Not a single buffering issue the entire movie.Another issue I have with it, and this is for ALL the apps and movies on the Stick. The menus and movie descriptions are in WAY too small of a font. I'm sure the text probably looks fine on a larger tv, but for those of us with smaller TVs (for reference, ours is a 32 inch), you actually have to get up from the couch and stand about 2 feet away from the TV to read the thing. Something that was made that much clearer tonight when we switched back over to our Roku box and could actually easily READ the movie descriptions on the screen from the couch.Also not pleased with the fact that the Stick makes it hard to read the end credits in movies. Don't care for the way it shrinks them down to pull up the next movie in the queue, then actually cuts off the credits and starts the next movie before the credits are finished. Also something made that much clearer tonight, when watching with the Roku, we got to watch the entire end credits (most on Fast Forward to get to the end quicker) to get to the epilogue that was hidden at the end. Honestly not sure if that's a Netflix app issue or if the Prime movies do that too, but thought I'd mention it.A few GOOD things about it that keep me from giving it less stars than I did: It DOES allow me to watch Prime movies on our HD tv upstairs, which until I bought it, had to either do via my PC or my Kindle. So that's a big plus. And because it's connected to my Amazon account, it makes it easy to view all the photos and movies and listen to the music that get stored on my cloud drive right there on the TV as well, so that's a neat feature. AND the fact that I got in on the introductory pricing of $19.99 when I bought it, even though it's got all the issues I listed above, I didn't pay all that much for it. ALWAYS a plus.So while the Fire Stick is definitely a convenient way to stream media to your TV, it's not without its issues. And for me, not being able to stream Netflix from it when they promote that so highly is a real pain. Fortunately we didn't get rid of the Roku when we bought the Fire Stick, so was able to use that when the Amazon stick failed us in that regard this week.", "verified": true, "helpfulness": "0/0", "author": "sherwood01"}, {"rating": 2.0, "review": "It works good but goes through internet like crazy. We even unplug it when we leave...", "verified": true, "helpfulness": "0/0", "author": "Brittanie"}, {"rating": 1.0, "review": "Worst ever. I have Amazon Prime and cant download a movie and have it play all the way through without the message that my internet requires more bandwidth. Bulls***. I have over 16 mbs!", "verified": true, "helpfulness": "0/0", "author": "Kerry"}, {"rating": 5.0, "review": "I love this thing! Does everything you need it to, and it has a remote! The cool thing is that the remote uses RF instead of IR like your other remotes so you don't have to aim it at the unit!", "verified": true, "helpfulness": "0/0", "author": "Jason Lufrano"}, {"rating": 5.0, "review": "I love it!  Planning to get another. Much better then that other brand.", "verified": true, "helpfulness": "0/0", "author": "Louis Sanchez"}, {"rating": 5.0, "review": "It awesome!!! I especially love the remote with it. Connecting it up was quick and setting it up to our internet was easy too. Best investment ever!!", "verified": true, "helpfulness": "0/0", "author": "Joanne Grant"}, {"rating": 5.0, "review": "Seems to get all the movie channels as the smart TV's do.  I am satisfied with it!", "verified": true, "helpfulness": "0/0", "author": "LETA"}, {"rating": 5.0, "review": "Love it , watch it all the time", "verified": true, "helpfulness": "0/0", "author": "KathyA"}, {"rating": 2.0, "review": "This device CONSTANTLY loses the network connection and once it does there is absolutely no way, short of unplugging it and plugging it back in to reload the home page. Even when the network shows as CONNECTED with a strong signal, it will NOT reload the home page. The fire stick has a lot of good features but this horribly annoying trait has made me very reluctant to move on to the Fire TV. This is just bad design, plain and simple.", "verified": true, "helpfulness": "0/0", "author": "Janice Jarrell \"Jan\""}, {"rating": 5.0, "review": "Between Prime Movies and Netflix, I am in heaven!! LOL  Fire Stick is definitely better then Chrome!!", "verified": true, "helpfulness": "0/0", "author": "J. Swan"}]