[{"rating": 1.0, "review": "It works when it wants to. Have had to call tech support half a dozen times-literally!!! And even tech support is useless. It works for an episode of whatever tv show I'm watching then freezes and I have to restart the whole thing. Such a horrible purchase.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "This is the best stick out there! It's super easy to set up and use. I use it all the time for watching Netflix. I highly recommend buying this stick if you're looking for one!", "verified": true, "helpfulness": "1/1", "author": "melissa grayce trussel"}, {"rating": 4.0, "review": "I'm brand new to this--just got it today!  I decided to do away with cable TV since I was paying big bucks for very little to watch.  I had the least expensive cable offering (from Time-Warner) previously called broadcast but now called starter cable.  When I got a good Winegard antenna from Amazon, I discovered that TWC wasn't even providing me with many stations that I could get over the air--including some in other markets not too far away and several of the extra signals where they carried the main one but not the extras (TWC provided only 14.1 as a part of their starter pkg while the channel also has 14.2-14.5).  I had attempted, after ordering the Fire TV Stick and signing up for Amazon Prime, to watch a short cartoon on my computer under the Prime selections.  My computer apparently didn't like Silverlight, so I gave up on it (yesterday).  When I got the Fire TV Stick today and hooked it up on my TV, it worked like a charm: crystal clear HD.  So far, I've only watched a couple of cartoons just to check it out, but my initial impression is that I have made a very good purchase.", "verified": true, "helpfulness": "1/1", "author": "Wayne"}, {"rating": 5.0, "review": "Love it and the price is great! Haven't had any problems and it was an easy setup.", "verified": true, "helpfulness": "0/0", "author": "Richard Widen"}, {"rating": 5.0, "review": "Best product for the the price and quality on Amazon. I've been an Amazon Prime member for years for the two day shipping. The ability to watch movies and especially tv shows on my schedule without commercials is great. Free with amazon prime. Love this.", "verified": true, "helpfulness": "0/0", "author": "D. Proviano"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Patricia G Anderson"}, {"rating": 2.0, "review": "Plugging the stick directly into my TV worked fine, but when I plugged it into my receiver (Denon 2312CI) no signal came through.  This seems to be a common problem with Denon and other receivers:http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_tv?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=TxBBWXFR2ZMETA", "verified": true, "helpfulness": "0/0", "author": "Jason Merrill"}, {"rating": 5.0, "review": "we thought roku was nice but fire stick blows it away, thanks amazon", "verified": true, "helpfulness": "0/0", "author": "AnnaV"}, {"rating": 2.0, "review": "The Fire TV Stick is a great improvement if you are used to hooking up your laptop for watching Netflix and Amazon instant video.However it is a very flawed product, which is replete with defects and disappointing user experiences. Everything seems half baked and mediocre. Why can it never remember what you watched last and where you were in a show, often suggesting a show you watched 3 weeks ago, rather than the one you watched yesterday or an hour ago? Why does it crash all the time? Why does it intermittently reset and go back to the main menu, when it was supposed to start the next episode of a show? Why are content channels called apps? Why are content channels so badly integrated? Why is the remote so annoying to use?While it sometimes is convenient in use, the end impression is a product that has so many defects both in design and implementation that you can wonder why it was released to the market. As a consumer electronics product it is truly remarkable for its ever present defects and flaws. When did you last buy a TV that crashed at least 2-3 times on a regular evening, or would randomly go back to a start screen every third time you selected a channel?All in all, this is an embarrassing and disappointing product, that over time will get on your nerves. I suggest the Amazon product and engineering team responsible for this mess take a deep breath and rethink this product from first principles of user experience.", "verified": true, "helpfulness": "3/3", "author": "Mitch Jensen"}, {"rating": 4.0, "review": "Got the fire stick as a prime member in the first wave and have loved it. My preschoolers know how to use it. The remote is so simple it might confuse adults because there are only 6 buttons and no words, just symbols. It loses connection once every few days - not sure if that's a wifi issue or the fire stick. We have all of the apps we would normally use (YouTube, Netflix) and get some special deals with amazon prime. I'm thinking of getting another one for a different tv because my kids are the ones that get to use it all of the time. Plus it's so affordable it seems like a no-brainer. A fraction of the cost of a month of cable and it's ours to keep.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Williams"}]