[{"rating": 2.0, "review": "I really like being able to watch what I want. The only thing about this Fire Stick is it gets really hot and then just pauses on its own. I have to unplug it for awhile and it works again.", "verified": false, "helpfulness": "0/0", "author": "Margie Hunter"}, {"rating": 4.0, "review": "Very pleased with this purchase. Super-simple to setup, and works perfectly with my Amazon Prime Video subscription. The only drawback is the external power supply (something they never showed in any of the TV commercials)...", "verified": true, "helpfulness": "0/0", "author": "Rock Roberge"}, {"rating": 3.0, "review": "Was looking for a unit to use in holtel rooms. Not able to connect to wifi in hotel rooms is due to no Google search or internet search.", "verified": true, "helpfulness": "2/2", "author": "Monte Growe"}, {"rating": 5.0, "review": "Worked flawlessly. Love it. Best $35 ever spent.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, I like it.", "verified": true, "helpfulness": "0/0", "author": "Terrence F Bray"}, {"rating": 4.0, "review": "This is great! Very fast to setup and start using. Plus a few free aps to download. The prowler cord could be a little long. Must have toy...", "verified": true, "helpfulness": "0/0", "author": "Molly Gmyrek"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "JennyAnne Oriente"}, {"rating": 5.0, "review": "It's great! I have yet to go unentertained.", "verified": true, "helpfulness": "0/0", "author": "H. Riley"}, {"rating": 5.0, "review": "Likes:• Great for prime members (I’ve been a prime member for years and this just makes it easier for me to stream content to my TV. Prior to this I had to stream through my Wii Nintendo system… Which sucked)• I like the remote, more than the Apple TV one. It just has more “feel“ to it• Lots of fun games included (little app type games that are just free and fun for short time)• Really easy to set up… I plugged in… linked it with my Wi-Fi and I was good to goOverall:It’s funny… Every single company comes out with their own device. At this point, I have the Apple TV, Google Chromecast, Roku, and now The Amazon Fire Stick. I wish there was just one universal device to control everything and sync everything together… Of course that’s the dream of  today…which I doubt will happen anytime soon. As for the device itself, it’s really no better or worse than everything I just listed. It’s better for me in terms of prime movies because it makes it easy to stream these to my television… Very similar to how my Apple TV makes it easy to watch all the movies I have downloaded on iTunes. So all in all, I am happy with the fire stick and I would definitely recommend it to anyone that is a prime member.", "verified": true, "helpfulness": "0/0", "author": "AlmostEverything84"}, {"rating": 5.0, "review": "This thing was a bit of a pain to set up. Had to update it twice before even getting to use it. But since it has been up and running, it is awesome. Time to buy the Fire TV Box for the living room!", "verified": true, "helpfulness": "0/0", "author": "NJ Red Knight \"GO PRIME!\""}]