[{"rating": 5.0, "review": "I love it very good product.", "verified": true, "helpfulness": "0/0", "author": "Holly K"}, {"rating": 5.0, "review": "Fire TV is wonderful.  I was only expecting Netflix and Amazon Prime Videos but didn't realize how many Apps there are for this.  I really enjoy it and the Amazon Screen Saver has beautiful pictures!  I love it and highly recommend it", "verified": true, "helpfulness": "0/0", "author": "D. Roberts \"sr walk\""}, {"rating": 4.0, "review": "Is very easy to setup and use, I like format of recently viewed selections. This is what I have been looking for, to have all my amazon prime movies n shows easily accessible on my  larger screen tv.", "verified": true, "helpfulness": "0/0", "author": "BLSRN"}, {"rating": 4.0, "review": "I actually really enjoy having the fire stick! My only issue is that it freezes a lot. Luckily all you have to do is unplug it and plug it in again and it takes off. So for what we have and the cost it is a great investment. (Definitely a 5 star if they work out this kink!)", "verified": true, "helpfulness": "0/0", "author": "Penny Battershell"}, {"rating": 2.0, "review": "The only use i have found for this so far is the twitch.tv app.  If i did get it for $20 i would be very unhappy.  Hopefully they get some more useful apps on it in the future.  Until then i'll stick to my chromecast for most things.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "Wow!  Head and shoulders above the Roku, I can watch Netflix at full HD now. Amazon Prime is great for providing top-notch movies and TV.", "verified": true, "helpfulness": "0/0", "author": "TooOlduvai"}, {"rating": 5.0, "review": "Lots of choices", "verified": true, "helpfulness": "0/0", "author": "ron hall"}, {"rating": 5.0, "review": "Bought two even though I lose the connections occasionally and have to remove it from power to reset it.", "verified": true, "helpfulness": "0/0", "author": "Herman A. Brown"}, {"rating": 5.0, "review": "This is great, easy set up, remote cute nd simple  but i love the remote app even more! We use it all the time and this was much more affordable nd simple than the other similar products in my opinion.", "verified": true, "helpfulness": "0/0", "author": "H. Sen"}, {"rating": 3.0, "review": "Like the idea, but felt screwed over by Amazon when they started my free trial of Prime when I placed my order, not when I received my Fire stick 1 month later.  I had no opportunity to explore Prime before I have to buy it.  Netflix, and others, are happy to let me \"try before I buy\". Real disappointment in Amazon's treatment of a loyal customer.", "verified": true, "helpfulness": "0/0", "author": "Tim Whitmore"}]