[{"rating": 5.0, "review": "I had a Chromecast but hated using an Ipod to navigate and the Fire TV Stick has a controller. Great for the not down with touchscreens crowd. And a free month of Amazon Prime is neat too, binge watched Bosch and loved it.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 4.0, "review": "Need more time to explore before give review.", "verified": true, "helpfulness": "0/0", "author": "Charles Kao"}, {"rating": 5.0, "review": "have a whole new world of things to view love the amazon shows especially Mozart in the jungle hope to see a season 2", "verified": true, "helpfulness": "0/0", "author": "buster buddy \"bb\""}, {"rating": 5.0, "review": "It isersome.  Reslly eady", "verified": true, "helpfulness": "0/0", "author": "Maryann Havrilla"}, {"rating": 5.0, "review": "Absolutely love this item. It was easy to install easy to move to a different TV and is very fast at loading movies with no buffering at all", "verified": true, "helpfulness": "0/0", "author": "xxx nfjjfj"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "luke hornsby"}, {"rating": 5.0, "review": "Enjoying my new Fire TV Stick immensely. I am a granny and not particularly savvy when it comes to technology but it was so easy and simple to install. Love being totally wireless and my expanded viewing options.", "verified": true, "helpfulness": "0/0", "author": "Molly Kewl"}, {"rating": 5.0, "review": "Easy to install... easier to use.  There is a bit of a learning curve to navigate through the menu, but that's hardly an issue if used regularly.  Since I bought my Fire Stick, my Apple TV has not been turned on... Need I say more?  Until Apple and Amazon resolve the feud that limits access to each other's content, Fire Stick is the clear best choice - at less than half the price - and with full access to everything except iTunes (and how is that a problem?)", "verified": true, "helpfulness": "0/0", "author": "Bill Ama Griffiths"}, {"rating": 5.0, "review": "I highly recommend the Fire TV Stick .  It is affordable, easy to use and actually has more to offer than I expected.  Two thumbs up.", "verified": true, "helpfulness": "0/0", "author": "Rhett Burruss"}, {"rating": 5.0, "review": "I already have the Amazon Fire TV and love it so decided to purchase the Fire TV Stick for my bedroom. It has the same features and functionality as the Fire TV so I knew I wouldn't be disappointed. Great buy for the price and its much better than Roku and Chromcast.", "verified": true, "helpfulness": "0/0", "author": "Jaalah101"}]