[{"rating": 5.0, "review": "we love it!!!  It works so well on our computer", "verified": true, "helpfulness": "0/0", "author": "TJ Campbell"}, {"rating": 5.0, "review": "Fine product; works well; provides good programming", "verified": true, "helpfulness": "0/0", "author": "Nancy A. Varney"}, {"rating": 1.0, "review": "I've had the Fire Stick for a couple of weeks now, overall it seemed like the best option for the money and I have always preferred Amazon products. However, I have had constant trouble with buffering on all the apps (I have high speed internet and still can't make it through a show without multiple breaks) and it often freezes up on the home screen. I don't know what to do! Unfortunately, if I had to do it over again I would not purchase this product.", "verified": true, "helpfulness": "1/2", "author": "Christine"}, {"rating": 5.0, "review": "This is great!  I have never owned any of the other streaming products except for Blu-ray.  I have a blu ray in two rooms, but I spend a lot of time in my kitchen and the fire stick is great for that!  I have access to all my music as well as the prime music, prime videos and Netflix, etc.  I don't know how I ever made do without it!  it was easy to install, basically plugged it in to the tv and to the wall.  Bingo - works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Tammy Airey"}, {"rating": 5.0, "review": "Just got it. Phenomenal product, loads of apps, fast, great image quality. Awesome! Other than that, cannot open the little compartment for the batteries. Badly designed. You have to put too much pressure on the remote. Not good.", "verified": true, "helpfulness": "0/0", "author": "Leticia QB"}, {"rating": 1.0, "review": "Pretty bad design. Bad reception", "verified": true, "helpfulness": "0/1", "author": "RUI WANG"}, {"rating": 5.0, "review": "Easy and fast set up. Great selection. Love it so far.", "verified": true, "helpfulness": "0/0", "author": "Nancy Sexton"}, {"rating": 5.0, "review": "Works really well! Good clear picture and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Thomas Earle Herron"}, {"rating": 4.0, "review": "Very easy to use, quick install, too.", "verified": true, "helpfulness": "0/0", "author": "kris"}, {"rating": 1.0, "review": "Not what you expect. Streaming is not all you think it is. The cost can add up quickly!", "verified": true, "helpfulness": "1/2", "author": "Robert Fassy"}]