[{"rating": 5.0, "review": "This is beyond a doubt the easiest technology device to install and get up and running. WOW!!  It probably took a whole 5 minutes!  We're on our 2nd movie already. LOVE it!!!!", "verified": true, "helpfulness": "0/0", "author": "Pam Shaver"}, {"rating": 2.0, "review": "Wouldn't work, had to go through 2 different tech support to find out Amazon registered it to different person. No Volume control, still have an issue viewing movies I pick through the play store. Netflix works well, Sling tv is a pain to use on this box.", "verified": true, "helpfulness": "0/1", "author": "Thomas"}, {"rating": 4.0, "review": "The Fire stick was easy to set up and  begin using.  The HD picture is excellent and the variety of TV shows  and movies that are included is pretty good.  My only complaint would be the amount of content, including TV shows, that you still need to pay for even with an Amazon Prime membership. But all in all I would say I have enjoyed it so far.", "verified": true, "helpfulness": "0/0", "author": "John M."}, {"rating": 4.0, "review": "Not as good as my ROKU, but the ROKU was $99 and the Fire Stick was $39.", "verified": true, "helpfulness": "0/0", "author": "Rene Tricou"}, {"rating": 5.0, "review": "Outstanding ...  received it earlier than promised and it works very well.  I like the menu that shows up on the TV.  Very easy to use.  :-)", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "So far so good! So easy to use.  Easy to set up.  We were having some issues with using our Blu Ray to view things on Amazon Prime.  I decided to try this and see if it was any better.  Yes, it is better.  I compared it to the Google Chrome stick and the Roku Streaming stick and decided this would be our best bet.  Compared to a friends Google Chrome......we made a good decision.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Owens"}, {"rating": 2.0, "review": "Was (still is?) advertised as being Miracast certified - in the table comparing it with the Roku stick and the Chromecast - when it's not.Despite repeated comments in the forums pointing out that this product is not in the list at Wi-Fi.org and pointing out the text on the Wi-Fi.org website regarding what it means to be \"Wi-Fi Certified\", Amazon has refused to either make the device compatible with Miracast enabled source devices outside of the list they publish, OR retract their assertion that the device is Miracast certified.The unit does NOT work with any of the Windows 8.1 based devices I used to test and there are multiple people in the Q & A and review sections that indicate the same thing.This is at odds with the Wi-Fi Alliance's stated requirements Read for yourself, particularly the paragraph under \"Easy to use, multi-vendor wireless display\"... h t t p : / / w w w . w i - f i . o r g / d i s c o v e r - w i - f i / w i - f i - c e r t i f i e d - m i r a c a s t (take the spaces out)Other than that, it's an ok alternative to other cord cutting devices, even though it seems somewhat buggier than the competition.", "verified": true, "helpfulness": "1/1", "author": "DaddyPutItTogetherPlease \"Greg H\""}, {"rating": 1.0, "review": "Disappointed. I purchased this primarily to watch Prime Videos. At the time I purchased this product the product  description clearly stated that 30-days free trial Amazon Prime Videos were included with purchase. Well, I  found out after purchasing that this is not the case. I contacted customer service and they assured me that they would fix my account so that I could access prime videos on my account as advertised. However, after waiting for more than a week to fully use the Fire TV stick, I contacted customer service again, only to be told that I would not be getting the prime trial after all. So after months of waiting for delivery, I will be unable to really use this product. I have listed a few product pros and cons below.Pros:**Easy set up- especially if you purchase from Amazon (it comes with your account information already  pre-loaded). Has an initial setup video that plays when you first plug in.**Small stick profile saves space**HDMI extender included (you will probably need it if your tv is wall mounted)**Nice picture and video quality.Cons:**No Amazon Prime Videos despite product details claims.**Remote back cover is difficult to remove in order to add batteries.**No setup/installation guide (I had to watch unboxing videos on YouTube  to make sure I was setting up and removing the remote battery cover correctly)**Doesn't really offer anything that you can't get elsewhere for less money.**NOT Portable, and the size is actually larger than chromecast and roku stick (it is visible . Also, since it requires power cord, it  is not portable or as visually pleasing as roku and chromecast).**Miracast/Screen Mirroring feature only works when home network is off. When I attempted to mirror my kindle to my tv using the stick it would not work while the home network/internet was on. Worked fine when I turned off the network/internet. Unfortunately, that meant that I could not mirror the silk browser from my kindle to my tv.**Stick requires home wi-fi network and does not have wired network capabilities.I got this when Amazon was running a promotion, so I only paid ~$20 for it.  But since it doesn't have all the features advertised, I am thinking about returning it. Without Amazon prime videos, I am not sure how useful it is. There are many other products out there that offer everything this stick has and then some (like roku, or even a blu-ray player). I am not sure it is worth $20, but I definitely would not pay $40 for it. At this point, my initial impression of this device is disappointment. I would not purchase again or recommend to a friend.", "verified": true, "helpfulness": "0/1", "author": "gr8tOne"}, {"rating": 5.0, "review": "I got my Fire Stick today three weeks early.  The install was very easy.  Everything is working great including the Closed Captioning.  I have it plugged into my receiver and the video is sent to my projector.", "verified": true, "helpfulness": "0/0", "author": "Raymond D. Gathright"}, {"rating": 3.0, "review": "When I watch Amazon instant video through the fire tv stick, they look like soap operas.When I watch through the built in app on my vizio tv, the videos look good.Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "L. Housley"}]