[{"rating": 5.0, "review": "Performs great, doesn't lag and has all the apps I need.", "verified": true, "helpfulness": "0/0", "author": "John Fitzgerald"}, {"rating": 5.0, "review": "Its excellent. I wish Amazon and google could just be friends so I could use Google apps too. But all in all it works great. Bear in mind the voice search seems to only work when searching Amazon, not Hulu or Netflix. The remote app for your phone is really nice too.", "verified": true, "helpfulness": "0/0", "author": "Justin Powell"}, {"rating": 5.0, "review": "great, no need to use a tablet or phone, simple install.", "verified": true, "helpfulness": "0/0", "author": "wbr"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very convenient.  If you have Amazon Prime its a must have.  Streams are high quality and I have had no buffering problems.  The Stick provides older HBO and Showtime programs, Disney Channel, and Hulu+ (I'm a member), so for me it replaces the overpriced cable bills.", "verified": true, "helpfulness": "0/0", "author": "Blake"}, {"rating": 5.0, "review": "The fire stick is everything it claims to be.  Easy to use and all.  B", "verified": true, "helpfulness": "0/0", "author": "sheila campbell"}, {"rating": 4.0, "review": "I like watching my Prime on the tv. This Fire TV stick is great overall, but I always have to unplug and replug every time I want to use it. That's a drag. Otherwise, a neat gadget.", "verified": true, "helpfulness": "0/0", "author": "Yorkiefun"}, {"rating": 3.0, "review": "For the price I paid ($19.00 introductory price) it's ok.  I do not like the clumsy Amazon interface.  Do like the ease of downloading.  Would not invest in the Fire TV box due to my dislike of the Amazon OS.  Overall I like the Roku line, stick & box, better.  I would not replace this at MSRP of $39.00.  Too many other options at that price point.", "verified": true, "helpfulness": "0/0", "author": "MDavis"}, {"rating": 2.0, "review": "There is no explanation of how to connect to Netflix, etc.  I will have to call either Netflix or Fire TV.  It shouldn't be this difficult.", "verified": true, "helpfulness": "0/0", "author": "Barbara Brochard"}, {"rating": 5.0, "review": "Just as advertised.", "verified": true, "helpfulness": "0/0", "author": "joyandrog"}]