[{"rating": 5.0, "review": "I really like the fire stick", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Works great! Family is enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Sofie Bell"}, {"rating": 5.0, "review": "This works wonderfully. Quick and easy setup. We have tried it on 2 of our TVs. One of them is far away from the Wifi and on a different floor in our home, it still worked. We just ordered a second one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My family and I are truly enjoying our Fire TV Stick, it is easy to use and safe for the children to navigate on their own with very little supervision.", "verified": true, "helpfulness": "0/0", "author": "DMA"}, {"rating": 5.0, "review": "OMG! We love this!!!! When we listen to one of the many radio stations it has beautiful slide shows of pictures from all over.... rain forests, mountains, etc...... truly hypnotizing!!!  You have so many choices with this fire TV stick!!! One of the best things I have ever bought from Amazon! Thank-you, Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Puzzled"}, {"rating": 4.0, "review": "I purchased the Fire TV Stick when it was about half priced for Prime members.  I figured for the price point it was worth checking out.  I've been an Apple TV user since the very first model came out and I've had several Blu-Ray players (including a PS3) that all have has some mix of online services include Amazon Prime.  Honestly I didn't know quite what to expect.When the box arrived it came in typical Amazon minimal packaging.  So it was very easy to open the box, and everything was neatly arranged inside.  There was a small power brick, a good quality USB cable, the Fire Stick, a small HDMI extension cable, a remote control, and some batteries.  Everything you need to get going.At first I didn't think I'd need that HDMI extension cable, but I quickly realized that I did in fact need it.  The power connection for the Fire Stick is on its side, not on the end.  So if you are trying to put it next to existing cables you really can't plug in the USB power cable without the HDMI extension.After plopping in the batteries, connecting up the stick, and turning on the TV I found myself locked into a tutorial I couldn't exit out of.  Ok, they really wanted me to see it.  That's probably ok since this is my first Fire TV device, but if I had to go through that on multiple devices I might get annoyed.Setup of the device was actually very straight forward.  I don't even feel like I need to tell you the steps because they walk you through every part of it that you need to do with on-screen prompts.The remote works pretty well, I think it's bluetooth so it works even when the stick is completely out of sight.  That's actually very handy, but this also means you cannot train a standard universal remote to control the stick like you can with an Apple TV.  Not really a feature I need, but it's good to note the limitation for those who do like to use a universal remote for everything.I use an automatic HDMI switch.  The Blu-Ray player is in position 1, my Apple TV was in position 3, and I had attached the Fire Stick to position 2.  Normally this HDMI switch gives priority to the lowest number position that is currently pushing a signal.  It's worked quite nicely with the Apple TV and the Blu-Ray player like this for a while.  However when I put the Fire Stick into this arrangement I quickly found out that even when you tell the stick to sleep it is still pushing an active signal along the HDMI output.  My switch never defaulted back to the Apple TV.  So I had to switch the Apple TV to position 2 and the Fire Stick to position 3.  I know that when I tell the Apple TV to sleep it actually disconnects from HDMI so the switch can find the Fire Stick.  So that's a minor annoyance to me.  But, one which I got to work out pretty easily.Picture quality has been quite good, and I've streamed a bit of my Amazon music collection through the device with good results.  The Prime movie and TV service comes through quite well and the interface overall is pretty straight forward and intuitive.I haven't really found any compelling apps or games to install/run/play on the device.  And, the few games that held any interest for me all seemed to require the Fire TV game controller which I don't have.  I've hunted a bit looking for any sort of functionality to use the device as a DNLA client, but there again doesn't appear to be any native functionality for this or apps that legitimately fill this roll.  Several come up when you search for DNLA, but after reading comments on them I invariably find out that people bought them only to find the app didn't actually handle DNLA.So without DNLA functionality it largely is comparable to a current generation Apple TV only smaller.  Where Apple TV locks you into the Apple ecosystem for content the Fire Stick simply locks you into the Amazon ecosystem for content.  Since I have some content in both I find both devices about equal for my needs.  The one thing I do like about the Fire Stick is that there is potential for third party apps to be installed.  I don't know yet what, if anything, that will bring to my media experience but the potential is there for some developer to fill.The Fire Stick does have a much better price point than the Apple TV.  So if your primary need is a simple streaming media device and you're willing to have that content all come from the Amazon cloud then this is probably a very compelling device.  The one area it falls behind for me is in the local content streaming capability.  The Apple TV at least can stream content that I've manually managed in iTunes on my local network.  For the moment there does not appear to be a similar capability for the Fire Stick.  I don't do this a ton, but it has been very helpful to me over the years.", "verified": true, "helpfulness": "1/1", "author": "Bobmon"}, {"rating": 4.0, "review": "Love the remote and the stick has worked great.  Would love to see the Play Store be part of the options- as it stands we have to use the Chromecast still.  But it's definitely pushed us to explore more of the Prime offerings- touche, Fire Stick, touche.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Do not think we know how to use properly", "verified": true, "helpfulness": "0/4", "author": "Joan Hollis"}, {"rating": 5.0, "review": "Great, but sometimes the remote does not communicate with the TV Fire Stick very well.", "verified": true, "helpfulness": "0/0", "author": "Joseph Lentz"}, {"rating": 5.0, "review": "Better then i had expected!I have recommended it to many of friends.", "verified": true, "helpfulness": "0/0", "author": "spyros spyropoulos"}]