[{"rating": 1.0, "review": "Piece of Junk, this is the first time I order an AMAZON made product and it will probably be the last.  Mine arrived DOA and amazon won't sent a replacement until December 23rd.  Was really looking forward to trying it out, what a disappointment.", "verified": true, "helpfulness": "2/5", "author": "ID 1 \"archon121\""}, {"rating": 1.0, "review": "Sleek out of the box. Indicated an upgrade was in order. could not upgrade, did not work. functionally DOA out of the box. Very difficult to find any on line support. Plenty of adds though. Big disappointment. will continue to WORK to get this device to function.", "verified": true, "helpfulness": "3/5", "author": "John stehr"}, {"rating": 4.0, "review": "Works as advertised, and is very similar to the Roku stick, but at a fraction of the price.  The only thing missing, for which I drop 1 star, is complete integration of Spotify and YouTube.  Unlike the other apps, like Netflix, Pandora, and Hulu, which are fully integrated and need only your password to connect, the Spotify and YouTube apps on this device require that you run the Spotify or YouTube app on another device e.g. iPad, and \"sling\" the sound/video to the stick from the second device, just like Chromecast does.  Roku manages to do this without a second device, so I look forward to an update to the Fire TV Stick for these two apps.There is just one other idiosyncrasy which is surprisingly common for something with all that processing power and memory, and it is the occasional resync that you hear in the sound from time to time.  It manifests as a quick buzz in the dialog, like it quickly repeats that syllable or something to sync the sound and vision back up if they have fallen slightly out of sync.  It's not constant, but enough to be noticeable.  Again, this is just software, and it's version 1, so that this price, I'm not complaining, since I'm also assuming that these things will be fixed very soon, and my review will be out of date just as soon.", "verified": true, "helpfulness": "1/1", "author": "P. Elliott"}, {"rating": 5.0, "review": "Best streaming device I've used. Video Apps work without glitches on both 2.4 and 5N. Apps download fast and you get a lot of options (Prime, Netflix, Pandora, Hulu Plus, PBS Kids, etc.) I wish you could access all the Disney/ESPN family apps without a paid provider subscription. This is not Amazon's problem, though. I, along with millions of others, would be willing to pay for this content so I could get rid of my Satellite. Phone remote app is awesome. Great device for the price.", "verified": true, "helpfulness": "0/0", "author": "JRW"}, {"rating": 5.0, "review": "Finds my router but doesn't establish a connection even though it's within 20ft of it, been unable to use it, possible DOA!!!! Will update review once new firmware is available but not sure how I will download it to the stick SINCE IT CANT CONNECT TO THE WIFI.  All other devices I have connect with no issues and sitting even further then the stick so I know the problem is in the stick. Only pro I have so far is the initial setup (until wifi connection), seems very simple to use along with the remote. Ordered a new more powerful router to test the stick again, if not going to contact Amazon for a return.UPDATE 12/13/14:Got my new router few weeks ago it's a dual band ac router compared to the n router before.  I was able to connect on the 5ghz band seamlessly and the stick is now up and running with no issues, changed my review from 1 star to 5. Setup was quick and easy, nothing eye popping as features go, pretty much the same as other streaming devices but the stick may run a bit smoother with the extra ram.*New router being used is the TP Link Archer C7 (5 Stars)", "verified": true, "helpfulness": "45/49", "author": "Amazon Customer \"RICKYRACER\""}, {"rating": 1.0, "review": "I bought two of these, based on Amazon's assertion that they supported Miracast.  I've tried repeatedly to mirror an Android phone (Nexus 5) and a Windows PC (ASUS VivoTab Note 8), with absolutely no luck.  The fact that the connection process fails in several different ways, at varying stages of the connection process (as well as the other customer reviews I've read), indicates to me that there was probably little or no testing of this functionality during the design process, other than to assure that it worked with Amazon's own Fire tablet and Fire phone products.Folks from Amazon: Could you please let us know if this can be fixed in software, and if so, when?  If it can't be fixed, please at least change the product page to reflect this, so that future buyers won't be misled?  Thanks very much.", "verified": true, "helpfulness": "33/41", "author": "Me"}, {"rating": 5.0, "review": "I was extremely pleased with the Fire Tv Stick. It met all my expectations", "verified": true, "helpfulness": "0/0", "author": "Charles L. Tisdale"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is awesome!!!  I owned about 4 Roku devices all ranging from different Roku models (Roku 3, Roku 2, Roku LT, Roku streaming stick and the Chromecast) and although I do like all the products Roku offers I was very surprised with the performance the Fire TV Stick offers.  In experience the Roku 2 and 3 are very responsive and that's due to the beefy internal hardware.  When I plugged the Amazon Fire TV Stick into my TV was incredibly surprise to how responsive and fast this little device is.  I subscribe to services like Hulu+, Netflix and Amazon Instant video and video(s) that I played on all three services are responsive and quick.  There is no lag, loading time is fast and stable.  The Remote control works very well and responds quite well with the Fire TV stick.  Amazon definitely did not cheap out on the internal hardware to this device.  I recommend this device to anyone looking for a online media streaming hardware at a affordable price.  Also I like to mention that the build quality to the device and the remote is excellent.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Its a great device and a great price. Got it for $20. Streams everything well, very fast with very little set up. Replacing my Apple tv and roku devices with this little stick.", "verified": true, "helpfulness": "0/0", "author": "D. Botros"}, {"rating": 5.0, "review": "Just as expected", "verified": true, "helpfulness": "0/0", "author": "dale"}]