[{"rating": 5.0, "review": "Loving it.", "verified": true, "helpfulness": "0/0", "author": "A. Robertson"}, {"rating": 2.0, "review": "I was so excited to get this and even more excited about the price. Now, I understand. At a glance, the Fire stick is impressive. For me, I plugged it in, watched the little introduction, and marveled at the interface/ease of use. That was the first day. Now, three days later, it's practically inoperable. It freezes up, lags in between commands, randomly closes out of applications, and makes watching anything so utterly frustrating. I am an admitted Amazon junkie and Prime subscriber, so for an Amazon product to be so bad it warrants a negative review, all I can say is DISAPPOINTED.", "verified": true, "helpfulness": "0/0", "author": "Heather Q"}, {"rating": 5.0, "review": "The best. The roku always had a lag or couldnt connect even if connected directly to internet.", "verified": true, "helpfulness": "0/0", "author": "Heather Quake"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 5.0, "review": "it is great", "verified": true, "helpfulness": "0/0", "author": "sidney whitlock"}, {"rating": 4.0, "review": "Comparable to Chromecast, does not require separate device.", "verified": true, "helpfulness": "0/0", "author": "Don Niemoeller"}, {"rating": 5.0, "review": "I got way more than what I expected. I love this product way more than the Chrome. Great buy", "verified": true, "helpfulness": "0/0", "author": "Brenda Anguiano \"Movie Guru\""}, {"rating": 5.0, "review": "Definately much better than a blue ray player to see Netflix on, thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Alfredo Gutierrez"}, {"rating": 5.0, "review": "I have one of these and also a Chromecast. I prefer this because of the remote control. Sometimes I just want to fire up Netflix without getting out my phone or tablet. It runs a ton of apps, too. I think I'm just scratching the surface because all I use it for is Netflix, YouTube, and occasionally renting a movie from Amazon. The video quality is good, although every once in a while Netflix will get jittery (not buffering) and rebooting the FireTV will fix it. It doesn't happen very often, though.  I have the FireTV app on my phone but I never use it because all you really need is the included remote.", "verified": true, "helpfulness": "0/0", "author": "K. Morrison"}, {"rating": 1.0, "review": "The device is so laggy and the response time is atrocious, you click any button and it takes at least two seconds to move. For example if i click the directional buttons or if i click on an app it takes just under 3 weeks for the app to begin working. The only reason that i have this is because they support Sling TV which is even worse in its ease of use, but I won't go into detail. Sometimes while I'm on the difffernt apps, the fire tv just takes me back to the home screen when I hadn't clicked any buttons. I have the current apple tv that I use for netflix and hbo now and its just so consumer friendly that it makes the whole experience easy and stressless. I want to smash the tv when i use the fire tv stick. Every time I use this I just hope and pray that the new apple tv supports sling tv (or even comes out with its own tv service) so that I could just throw my money at them. Everytime I use this, the amount of money i feel i would pay for the new apple tv thats going to come out goes up. If amazon knows what is good for them, they will heed this advice and make its operating system much smoother and easier to use. And stop making us try to buy amazon prime if we don't have it. Every freaking side tab on the home screen leads to different services offered by Amazon prime. How about making a favorites tab where we can put the apps we like to use, instead of making us scroll all the way down to \"apps downloaded\" to go on the apps we want.", "verified": true, "helpfulness": "0/0", "author": "Alan"}]