[{"rating": 5.0, "review": "I purchased  this a second  fire tv stick for our home. My husband purchased the first for me as a valentine's day gift.We talked about getting rid of the cable and going directly to streaming as it is more cost effective.First it's incredibly easy to install and can be moved from tv to tv but also it enhances your televisions natural quality. I had no idea how bright my televisions actually could be and how clear! Second, fire tv sticks have the perfect amount of memory for us per tv and they carry all the apps we could hope for, that we person ally use. Third they do not run slow at all, which keep in mind also depends on your Internet speed. We don't have to reboot them very often at all and they update themselves.If you fall asleep while watching television  or you turn your telivision off in mid play it saves your place. I have one fore every tv in my house.There is also a fire tv box however we are tired of the bulky box look even if it's small. The sticks are not visible for guests and it's almost like they turn your TV in to a smart tv with out the cost of purchasing a smart tv.I am purchasing another here in a few days but I am adding a new television to our home. I like that they can be easily moved but honestly I am to lazy for that lol.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Reid"}, {"rating": 5.0, "review": "Great Value for what it can do.", "verified": true, "helpfulness": "0/0", "author": "Joseph Willey"}, {"rating": 5.0, "review": "I am so glad I got this. I was reading and trying to deciede between this and the Roku or Google chromecast...I am glad I choose the Amazon fire stick for many reasons. Much free content in all categories. Easy to use format and uncomplicated remote. I cant say enough about it, Worth every penny. I saved money because I downsized my satellite programming because of the fire stick, as I no longer need all those channels since many are on the fire stick for free!", "verified": true, "helpfulness": "0/0", "author": "char307 \"charky307\""}, {"rating": 3.0, "review": "The remote control lacks functional quality. I think after 100 clicks, it will not work any more.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Grissom"}, {"rating": 1.0, "review": "I don't recommend.", "verified": true, "helpfulness": "0/0", "author": "oscar"}, {"rating": 1.0, "review": "Not at all what I expected...a lot of \"hidden charges.\"", "verified": true, "helpfulness": "0/1", "author": "awesome"}, {"rating": 5.0, "review": "Love my firestick", "verified": true, "helpfulness": "0/0", "author": "Ravin"}, {"rating": 4.0, "review": "It disconnects from the internet more than I like.", "verified": true, "helpfulness": "0/0", "author": "Amy Towler"}, {"rating": 1.0, "review": "It doesn't work. Or It rarely works. It worked when we first got it, but frankly the performance of even streaming netfilx was so shoddy, that I was better off using the netflix app built into the TV than using this device. Meanwhile the apple running on the same wireless network, 3 feet away, runs just fine. A waste of my money.", "verified": true, "helpfulness": "0/0", "author": "AirborneLt \"justALittleGuy\""}, {"rating": 5.0, "review": "Just another great way to enjoy our family TV.", "verified": true, "helpfulness": "0/0", "author": "John D. Leach \"Collector and coupon King\""}]