[{"rating": 5.0, "review": "We have had the FIRE TV Box for a while and love it, so we jumped on the $19 offer for the stick. We have the box on our main living room TV and the stick for our bedroom and guest room. The portability of the stick cannot be beat! I have noticed some slower loading and buffering time on the STICK, but never on the box. We aren't exactly thrilled with our current Internet provider, so it could be that our Internet connection is causing the problem, but since this only happens with the stick and not with the box, I think it's a little of both factors in play. Overall very happy with this purchase. We save money by not having multiple cable boxes for TVs that aren't used often but can still play content through Amazon and netflix.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "I've had this for a few days and It is pretty great. It came pre-registered to my account (as Amazon products do) so that made set up easy and the interface is very user friendly.  As mentioned on the product page it also supports streaming services like Netflix and Hulu which is nice. It also supports Flixster so I can enjoy my UltraViolet library but Flixster took 2 days to actually work (continual server error, I blame Flixster).  I do wish it had Vudu, it is a much better UV experience, maybe in an update. It also supports Plex which is convenient, and it plays some basic games (although after testing it I pretty much got it out of my system). It does support music services but I don't like my TV speaker setup that much, I guess it's nice to have though. I haven't tried the display mirroring, no MiraCast devices to try.I do have an Apple TV which is my favorite, it's very easy to use but no native Amazon video app. I can stream my Prime videos from my phone but it's not ideal. I also have a ChromeCast since they are cheap, it's pretty decent and also easy to use but I don't like being tied to my phone/tablet while I watch videos; the Fire TV Stick will be replacing that.  I bought my sister a Roku 3 a few months ago and that is pretty awesome, it supports everything except Apple and costs the same as an Apple TV.I was lucky enough to get the Fire TV Stick for $20 and it is totally worth the price. For the regular $40 I would probably get a Roku Stick ($40 at the time of this review) since it has a native Amazon video app as well as Netflix, Hulu, and Vudu. For me it is definitely a better choice than the ChromeCast since it has a dedicated remote. Bottom line, I like it. I wish you could do half stars, 4.5 is really what I'd go with.**19 December Update**I wanted to mention that since reviewing this product I picked up an HP Stream 8 and tried out the MiraCast function, I could not get it to work. Maybe an update is required for one or the other. This doesn't impact my review for the Fire TV Stick, still really like it and I am very happy with the purchase. If I can get MiraCast sorted out then it will just be that much better.I also mentioned that I would probably go for a Roku Stick due to pricing, but I take it back. The Fire TV Stick is so much faster than the Roku Stick! The only thing I feel I'm missing from the Rokuverse is Vudu, but most of my Vudu library is mirrored in Flixster anyway thanks to UV. I have a few Vudu-only movies but I'll make due, and I still have my Apple TV for the Disney Movies Anywhere compatibility.", "verified": true, "helpfulness": "0/0", "author": "Goban"}, {"rating": 4.0, "review": "The Fire stick gets the job done. Being a prime member does help, and I was able to side load some apps. Good entertainment for the family!", "verified": true, "helpfulness": "0/0", "author": "junior rodriguez"}, {"rating": 5.0, "review": "First media stick purchase. Love it!  Got it to run amazon prime and Netflix apps and it works great.  Full HD and Surround sound support through hdmi.  Easy set up and includes tutorial videos as well.  I like that the device is hidden behind the tv, less clutter.", "verified": true, "helpfulness": "0/0", "author": "Ryan Forgay"}, {"rating": 4.0, "review": "Not impressed so far.  It took MULTIPLE attempts to finally get it to link to my network.  An error message popped up after each attempt that basically said, \"Keep trying, or call us for help.\"  It finally connected, I'd guess, 10 attempts later.Once it was connected, I tried to watch something and it \"warned\" me that my system is not fast enough to work with the Stick without constant buffering.  I initially thought that was nonsense b/c we stream movies all the time on our computers/tablets both inside and outside the house (the Stick was attached to a TV outside our house), etc... and have never had any buffering issues.  With the Stick, however, the movie I tried will only play for a few seconds before stopping to buffer.  Keep in mind I only tried one show, John Adams, but after about 10 minutes of frustration with the constant buffering I gave up.  I have not been back on to see if the problem will persist, but once I do I'll provide an update to this review.UPDATE: Ok, so I finally decided to can the idea of using the Fire TV Stick in my outside entertainment area and moved it to an older non-wifi ready television inside the house.  It immediately worked without any issues whatsoever.  Given the fact that the issue was clearly the placement of the device (outside of a brick home that may have been impeding the signal) and not the device itself, I thought it only fair to update this review now that the Stick is in the house and works perfectly.  I give it a 4 star overall rating not because there is anything intrinsic about the device that I don't like, only because it didn't work where I needed it to (in the outside entertainment area).", "verified": true, "helpfulness": "0/0", "author": "Jason F."}, {"rating": 2.0, "review": "It surely does not live up to expectations.  It is slow and apps that are not part of Amazon won't work with it.", "verified": true, "helpfulness": "0/0", "author": "H. Dotson \"HeathenDot\""}, {"rating": 5.0, "review": "An amazing item.i wanted Amazon instant video and with this I got it .easy to set up.netflix works great.amazon you made my day.excellent picture quality.get one you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Barry W. Hanson"}, {"rating": 5.0, "review": "Great piece of equipment.", "verified": true, "helpfulness": "0/0", "author": "FosterParent"}, {"rating": 5.0, "review": "As more apps are added, this purchase gets better and better.  Can't wait unitl HBO Go and others are added.  Great price, remote is simple and easy to use.  Getting ready to purchase the game controller, so I can get in on some of the games.  Awesome buy!!!", "verified": true, "helpfulness": "0/0", "author": "Eddie Hughes"}, {"rating": 5.0, "review": "AMAZING AMAZON for creating this easy to install and easy to use answer to complicated streaming systems. As easy as Apple TV which is also amazing and the remote is similar. I was so excited to have received this as quickly as I did and would love the opportunity to purchase more at this price. I needs to gift these for Christmas and the New Year. I can not part with mine. Suggestion is that we could have the ability to use out of the country. Then it would be perfect. Thank you for providing the Fire Stick and Prime.", "verified": true, "helpfulness": "0/0", "author": "substitute"}]