[{"rating": 4.0, "review": "The instructions were not as detailed as I thought I needed but I managed to figure out what to do and it works great.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "I primarily got it for Slingtv and was also happy with everything else on the Firestick very good buy!", "verified": true, "helpfulness": "0/0", "author": "Randy Chumich"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jesse Armann"}, {"rating": 5.0, "review": "Easy to use!  It's nice having all my TV/movie favorites in one place!", "verified": true, "helpfulness": "0/0", "author": "Eileen Derengowski"}, {"rating": 5.0, "review": "Great product and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Poor connectionCould not watch a movie, far away to be good as Apple TV :-(", "verified": true, "helpfulness": "0/0", "author": "Cecilia Lancaster"}, {"rating": 5.0, "review": "This is a great item I have wanted for a long time but the cost was to high and I didn't know if they would work. But with this one if it didn't work right or I couldn't get to work I could return it. This one works great except I don't like the remote it's hard to get use to", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 1.0, "review": "My Fire TV Stick will not work with my Verizon router. I'm gonna have to send it back.", "verified": true, "helpfulness": "0/0", "author": "bluemercy"}, {"rating": 5.0, "review": "Love it.  Turned our dumb TVs into smart ones in two shakes of a cats tail.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Russell Foster"}, {"rating": 5.0, "review": "Awesome and inexpensive option to streaming through my Amazon Prime account and for Netflix and other options. Very easy to install and saved me hundreds of dollars on either a new game system or a more expensive streaming device. And it's portable as well!!", "verified": true, "helpfulness": "0/0", "author": "Diana Miller"}]