[{"rating": 5.0, "review": "My amazon firestick has changed the way I look at and watch my television.  I've been a prime subscriber for a few years and thought free 2nd day shipping on my 60+ orders each year was a tremendous bargain. Amazon is my go to department store for every day items and gifts.i admit I ignored the relentless ads for Prime video and music and books. I was already invested in Google play and Google music; I wasn't interested in forging another digital relationship. But after giving an amazon fire tablet As a Christmas gift, I became curious and preordered the firestick. It was simple to connect.  The firestick was Intuitive, as one would expect from amazon,  up and running on phone, tv and computer in a few minutes. Being able to use my phone as a remote made me feel hip and cool, an unexpected free benefit for android users!  Sorry iphone, you'll have to wait. Just 24 hours into burning my firestick,  I've added a dozen movies  to my watch list, watched two indy flicks, + 2 documentaries, one on homeopathic medicine and another on aromatherapy while I was cooking dinner. I streamed several 50-song playlists that amazon prepared for reading, working, meditating and working out. I've streamed several albums and tunes that duplicate my costly google play library. I've been introduced to a couple of new amazon exclusive series to watch with big time stars like John Goodman, Laura Dern and Diane Ladd. I've been able to disconnect my pathetic Phillips WiFi DVD system,  hook up some inexpensive speakers AND finally stream netflix quickly and in hd with surround sound. The Internet is now my enter/infotainment department store. I have little use for broadcast TV except for the morning news. Did I mention the amazon NFL app? Ok Jeff Bezos, find a way to be my ISP, included in prime subscription, throw in some local broadcast tv and I will give you the keys to my debit card into eternity. That is what you want, isn't it?", "verified": true, "helpfulness": "1/1", "author": "bethany7687"}, {"rating": 5.0, "review": "thank you", "verified": true, "helpfulness": "0/0", "author": "Morris N. Dobres"}, {"rating": 5.0, "review": "Amazing, really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Diane L Wilfling"}, {"rating": 5.0, "review": "It took five minutes for the easy set up. I really like how it was already set up for me from my prime account. The remote communicates very quickly with the stick, much faster than what I'm used to. I also downloaded the free app on my phone so I could use the voice search through my phone. And the phone app also comes in handy if I don't want to type things, like logging into my Netflix account.", "verified": true, "helpfulness": "0/0", "author": "Shana Strimpe \"House Wife\""}, {"rating": 5.0, "review": "Coupled with my Prime membership. this is a really great product. We have not tried any other streaming device so we were very pleased withe the ease of operation.Not to mention all the choices available on Prime. Great product.", "verified": true, "helpfulness": "0/0", "author": "oldmodelT \"oldmodelt\""}, {"rating": 5.0, "review": "We love the Fire Stick. We now have 2 at home and 1 I purchased for our Daughter.", "verified": true, "helpfulness": "0/0", "author": "Peggy Wishard"}, {"rating": 5.0, "review": "Love it! At first i thought it wouldn't get here until later but i ended up getting it earlier  than expected!  I recommend  getting the fire tv stick it is definitely  worth the $40.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 1.0, "review": "Garbage! Not worth the time I'm giving to write this. Doesn't pick up my WiFi signal so I bought a WiFi booster. With booster it says I have Very Good signal, but still no connectivity. Absolute garbage!", "verified": true, "helpfulness": "0/0", "author": "JonM"}, {"rating": 3.0, "review": "It would have probably been better if we didn't have the Fire TV first. The stick is slower to load & only works well if it's real close to the wireless router. My wifi pumps out just over 30 mbps. I didn't think I'd have a problem with it. I ended up returning it & getting another Fire TV", "verified": true, "helpfulness": "0/0", "author": "CPatrick"}, {"rating": 5.0, "review": "Awesome! Easy to set up and use and with Prime there are hours and hours of movies to watch.", "verified": true, "helpfulness": "0/0", "author": "Mark and Kathy"}]