[{"rating": 5.0, "review": "It's great.  Netflix would not work half the time on our LG smart TV bur the stick works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fabulous...just love our Fire Stick...once I realized that I needed to change language to English and that I needed OUR wifi # it was amazing...followed directions and within one hour we were watching Netflex.Couldn't be more pleased.", "verified": true, "helpfulness": "0/0", "author": "Anita Feldman"}, {"rating": 5.0, "review": "We do not have a SmartTV so the Amazon FireStick is a perfect fix for that! We love to watch Netflix and Amazon Prime shows and music.  I refuse to pay for cable tv so this is a great way to stay entertained without!! We love it and I want to buy one for every room in the house!", "verified": true, "helpfulness": "0/0", "author": "brittany"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Are you sick of cable? I know I was. So annoyed with the outages, charges... basically everything about it! So... I decided to get the Amazon Fire TV Stick and boy did my life change! This has been a great product to keep my TV and Movie watching to it's fullest! You get access to Prime TV, Netflix, Plex etc etc etc. There are so many options, AND if you're just bored, play a game on it! WHAT?? So amazing. Buy this asap!", "verified": true, "helpfulness": "0/0", "author": "Jake M"}, {"rating": 4.0, "review": "It has a slight problem that I cannot seem to clear up.", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. Picture is clear.", "verified": true, "helpfulness": "0/0", "author": "skierguy"}, {"rating": 5.0, "review": "Good quality product.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love it and watch it every night.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great  works fine good buy until your controller starts to malfunction and I only had it for about a couple months", "verified": true, "helpfulness": "0/0", "author": "marco"}]