[{"rating": 5.0, "review": "Its perfect for my situation, doesn't take a lot of room and very easy to install", "verified": true, "helpfulness": "0/0", "author": "Bertha B. Hernandez"}, {"rating": 5.0, "review": "Easy to use, get all my netflix movies and shows i want, easy to set up", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's real good I like it", "verified": true, "helpfulness": "0/0", "author": "khalid decker"}, {"rating": 5.0, "review": "My wife has an Apple TV and we have been using it for about a year or so. I bought this after seeing movies on Prime movies that Netflix did not have. The remote is a much better design and I was able to plug the Fire stick into one of the back HDMI ports on my bose system hiding it completely from sight instead of having to find a place where it could see the remote and be an eyesore. Even being the stick and not the big fella it seems to be faster than the apple tv and not have as many gliches. The best thing about the fire is the app section actually had VLC player which now allows me to play all the movies on my networked harddrive. The only negative I have found so far is the organization of prime movies. I wish that it had subgenres. Overall if you have Prime and watch a lot of movies but don't play games you would be a fool not to purchase at this price.", "verified": true, "helpfulness": "0/0", "author": "Egg"}, {"rating": 5.0, "review": "Simply amazing. The response time is quick. Great picture quality right away. And I like its portability.", "verified": true, "helpfulness": "0/0", "author": "Ronald R."}, {"rating": 5.0, "review": "Awsome love it.", "verified": true, "helpfulness": "0/0", "author": "jeremy staples"}, {"rating": 5.0, "review": "Enjoying it", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 4.0, "review": "Better than Roku, wish the cord was longer.", "verified": true, "helpfulness": "0/0", "author": "Shelli Brannum \"Missouri Mama\""}, {"rating": 4.0, "review": "It really depends on the strength of your wifi, but it was a great investment! I live in an apartment where there are a lot of tenants and having this device helps  me to save money and keep connected with my favorite tv shows, and the rest of the world; rather than hooking my computer and doing it the old fashion way.  It quick to set up, and very simple to use.", "verified": true, "helpfulness": "0/0", "author": "Edmond"}, {"rating": 4.0, "review": "Good product!", "verified": true, "helpfulness": "0/0", "author": "Mike Guillet"}]