[{"rating": 5.0, "review": "love it.quick and easy setup, better than expected", "verified": true, "helpfulness": "0/0", "author": "ADI PERRY"}, {"rating": 5.0, "review": "Works well - happy to have it as part of my entertainment arsenal.  Well worth the price, especially for prime members.", "verified": true, "helpfulness": "0/0", "author": "Happy Camper \"I Ride Ducs\""}, {"rating": 5.0, "review": "HBO Go please!", "verified": true, "helpfulness": "0/0", "author": "Kristina Pierce"}, {"rating": 5.0, "review": "Mind blowing interface. I have the Google Chromecast too but the Amazon interface and the remote makes all the difference. Just loving it and switched away completely from the chromecast", "verified": true, "helpfulness": "0/0", "author": "Prabal"}, {"rating": 5.0, "review": "Amazing! Easy install.  Everything I want is now on my TV.  Great product.", "verified": true, "helpfulness": "0/0", "author": "sydney zekley"}, {"rating": 4.0, "review": "I've enjoyed using this over Chromecast. There was only one initial lag ever since I'ved used it (4 days now). I also like that it's independent from my other devices so that I don't have to worry about flicking it to the screen. The remote wheel was intuitive and it makes typing passwords or text in wayyy less painful! As for the buttons on the actual remote, it feels just the right amount.", "verified": true, "helpfulness": "0/0", "author": "Vi Pham"}, {"rating": 4.0, "review": "It's exactly what I expected for $25. The setup could have gone a little smoother.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'd rather to have the HOME page shown up with My Apps automatically instead of having looked for them.  Other than that, everything else works OK.", "verified": true, "helpfulness": "1/1", "author": "Brian Hong"}, {"rating": 5.0, "review": "This works fantasic on our not so smart HDTV!! I love being able to watch Amazon prime, Netflix, and Hulu Plus!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen McMichael"}, {"rating": 5.0, "review": "THE FIRE TV STICK WAS SUPER EASY TO INSTALL, A CAVEMAN COULD DO IT.  I HAVE A KINDLE FIRE HD WHICH I USE SOMETIMES TO WATCH A MOVIE ON USING MY TV.  NOW MY FIRE TV STICK DOES THE SAME THING AND IT IS ALWAYS THERE.GET ONE, HELL, GET ONE FOR EVERY TV YOU OWN.", "verified": true, "helpfulness": "0/0", "author": "GARY"}]