[{"rating": 4.0, "review": "I just sat the fire stick up .i\"ll let you know when i go through the setup.  Thank you", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was just as easy as turning on the lights.  I loving every bit of the fire stick, best thing close to sliced bread....lol", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "eileen wunder"}, {"rating": 5.0, "review": "Love. Lots of good freebies. Works well. Starts up promptly. Even has games for the kids. Only thing I miss at times is local channels.", "verified": true, "helpfulness": "0/0", "author": "mcoffey88"}, {"rating": 1.0, "review": "The idea is great but this item doesn't work in our house.  It is constantly loading only playing the movie for very short spurts of time.  Not happy.", "verified": true, "helpfulness": "1/1", "author": "VLM66"}, {"rating": 3.0, "review": "Had a problem hooking up to WiFi on main Tv it was purchased for.All controls are only on the remote,If lost you are Done!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Problems with out internet.  Make sure you have enough bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Judy Lee"}, {"rating": 2.0, "review": "At this point I am not sure...", "verified": true, "helpfulness": "0/0", "author": "Sue Ducato Sarno"}, {"rating": 5.0, "review": "Very easy to install and use even for the technology illiterate like myself!", "verified": true, "helpfulness": "0/0", "author": "Wanda S. Sokolowski"}, {"rating": 5.0, "review": "As much as I like my chromecast, I might like this better. Its fast, the video quality is good, and having built in apps is a big plus. There seems to be less lag time, and a dedicated remote is more responsive that using an iphone/ipad like you do with chromecast. Support for HBO Go would be the only improvement!", "verified": true, "helpfulness": "0/0", "author": "Katie G"}]