[{"rating": 1.0, "review": "Sluggish performance. Some apps, namely Hulu do not function well on it. The streaming pauses frequently. I have Roku devices on wifi in the house that don't have any issues with Hulu. I tried the Fire Stick from multiple locations and had issues from every one. Upon searching, it seems others had issues as well. The voice search worked well on it, but I ended up returning it and purchasing another Roku. Can't deal with the constant streaming issues with the Fire Stick. I'm sure it will get better as they update the device, but it's just not ready for prime time right now.", "verified": true, "helpfulness": "0/1", "author": "M. Shiffer \"Mark\""}, {"rating": 5.0, "review": "Great product with effortless programming. Very Satisfied", "verified": true, "helpfulness": "0/0", "author": "David A. Kenney \"FAA ATC\""}, {"rating": 5.0, "review": "Works just as described.  I have an Apple TV and a Roku and I feel like this little guy basically does the exact same things you'd want out of the Apple/Roku at a fraction of the price.  Very happy customer.", "verified": true, "helpfulness": "0/0", "author": "NikGinKC \"*NikG*\""}, {"rating": 5.0, "review": "very satisfied", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little guy is awesome, brought everything I did on my computer to my living room TV where I can sit on the couch and enjoy.", "verified": true, "helpfulness": "0/0", "author": "fUji™"}, {"rating": 1.0, "review": "does not support all of my apps!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a great product. Works as expected. I only gave it five stars because I couldt get Acorn TV as an option. Except to pay for the programs I already pay for thru a subscription. That was disappointing.", "verified": true, "helpfulness": "0/0", "author": "Janet Allan"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Mike J. Bowlin \"mikeflys\""}, {"rating": 5.0, "review": "Love IT! Great bargain!!!", "verified": true, "helpfulness": "0/0", "author": "Amelia Flowers"}, {"rating": 5.0, "review": "So far this has been a great item.  It would be nice to have a Prime Free movie area rather than having them scattered through the listing.I travel for business and added this to the rooms TV for when there is nothing else on.  I find that there is a good selection of movies and TV series to choose from.", "verified": true, "helpfulness": "0/0", "author": "Superman_jjs"}]