[{"rating": 5.0, "review": "If you have Amazon Prime, buy this. If you don't, buy a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Andy B"}, {"rating": 4.0, "review": "Once I finally got it to log on, it work like a charm. Great picture with the HDMI", "verified": true, "helpfulness": "0/0", "author": "martin blanchet"}, {"rating": 4.0, "review": "We're loving the Fire TV Stick. This is the first media streaming device I've owned so I have nothing to compare it to. Dinged it one star for the remote being insanely hard to open for the disabled. I finally had to resort to using a knife to pry open the battery compartment. Remote is a bit small to use with my big hands (disability doesn't help either) but I've switched to using the Android remote app on my Samsung tablet. The addition of voice searching from the table is awesome. Since receiving we have streamed several movies and numerous TV show episodes. No lag, stuttrring or loading pauses were evident at all. The only slowdown was doing the mandatory firmware update during setup and I think that was just because the server was swamped by new owners updating at the same time. I have no real complaints about my Fire TV Stick, paired with my Amazon Prime membership I have a nearly endless supply of free content to watch.", "verified": true, "helpfulness": "1/2", "author": "Keith Blodgett"}, {"rating": 3.0, "review": "Christmas gift", "verified": true, "helpfulness": "0/2", "author": "david lawrence"}, {"rating": 2.0, "review": "The Fire Stick was awesome....for the first week when it worked. Then it started lagging during playback, and now I can't get it to hold an Internet connection to stream anything. Completely useless.", "verified": true, "helpfulness": "0/0", "author": "Laura M \"standingsolo\""}, {"rating": 5.0, "review": "I own an Apple TV but I love my Fire TV Stick way more than the Apple TV! It's faster and has bigger internal memory and the best thing about it is that I can use my Prime account + the awesome free games that I get! I'm in total love with this product! Really recommend it!", "verified": true, "helpfulness": "0/0", "author": "Al-Raisi"}, {"rating": 5.0, "review": "awesomesauce! just wish it has a ios app right now and bluetooth connectivity for a mouse", "verified": true, "helpfulness": "0/0", "author": "Micah"}, {"rating": 5.0, "review": "The Fire TV stick is an amazing product the functionality delivered as promised.", "verified": true, "helpfulness": "0/1", "author": "Brian J. Bean"}, {"rating": 2.0, "review": "Features were pretty good but the RF only remote meant I could not use my Logitech Harmony remote with it. It didn't matter anyway as the unit died less than 24 hours after I plugged it in. The video just flashes on over and over so you cannot watch it now. Prior to that it still had issues. It crashed so bad after a few hours that I had to cycle power on it. For $20 it is pretty amazing but only if it keeps working for a while.", "verified": true, "helpfulness": "1/1", "author": "T. Knettel"}, {"rating": 1.0, "review": "Let me preface this by saying that I've always been a fan of Amazon and their service.  Unfortunately, I had the same issues that many seem to have encountered.  The WiFi connectivity is spotty, at best.  Here's my experience:1. Went to Best Buy and bought it for $25 because I didn't want to wait the 1+ month Amazon was showing I'd wait for it to arrive.2. Got home, plugged it in, got the prompts for connecting to a network, but for some reason couldn't connect to my network telling me that it couldn't reach Amazon.com. Note that, while having to enter my network password about 20 times due to the systems inability to connect, the remote has some glitch that was causing it to randomly move across the characters as if I was holding down the left/right/up/down portions of the remote.  This was very frustrating, to say the least.3. Went to the support page and it mentioned resetting via the remote and/or unplugging.  Tried both.4. Finally got connected to my network and it prompted to download an update, which I started.5. About 2 minutes into the update download, it tells me that it's lost connectivity, so I try to connect again and no go.  Tried resetting again, Googling for a fix and still no go.6. Called Amazon support and she indicated it may be defective and to go back to Best Buy to get an exchange.7. Went back to Best Buy and did the exchange.8. Came back home and, guess what, same exact thing.  Even the bug with the remote.9. Called Amazon support and she indicated that sometimes registering the serial number resolves the download issue, so she registered my serial number.10. While still on the line with Amazon, tried connecting and was successful.  Was prompted for downloading the update and it started.  Seemed to be downloading without issue, so I let the Amazon support go.11. 6+ hours later, the update was finally finished downloading and applied.  This process started around 6pm and finished around midnight.12. Now I thought I was in business, except the tiles were taking forever to show and it was pretty much unusable.  At this point, I was tired and went to bed.13. Next day I called Amazon back and was transferred to a second level of support that seemed much more knowledgeable.  Explained to him all the things I went through the previous day. He suggested that, instead of plugging the unit directly into the HDMI port on my TV, try using the dongle to connect it.  Sure enough, that seemed to do the trick so we finished the call.14. Over the next day, I still noticed that my router was showing it only connecting between 5 & 11 mbps, sometimes down to 1 or 2 mbps.  Other devices were having no issues connecting at 50 mbps.  Also, things just weren't very consistent.  The device cut out alot, having to buffer and what not.  So, I moved the router so it is directly in the line of sight of the unit and that seemed to help.  Now it seems to be connecting around 26 mbps, but still there's this spotiness to it's ability to stream anything.  Sometimes, I give up and go back to the PS3 for a smooth experience.Earlier this week I got the one I ordered from Amazon. I decided to return it today, unopened, due to a very frustrating attempt to watch the PBS News Hour this evening.  And it wasn't just PBS.  I could go into Netflix or any Amazon prime movie and same thing, cuts out frequently.  So, I've finally given up on this product.  I'll keep the one from Best Buy for novelty and, who knows, someday maybe it'll be worth something like an Atari E.T. video game cartridge.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}]