[{"rating": 1.0, "review": "I was unable to get Netflix, so called them and they suggested that I reboot my router and TV, but ut didn't help.I was told by Netflix that it has to be a problem with my internet.I had AT and T come in this morning. He conducted extensive tests and determined that the problem was neither caused by Netflix nor the internet, but by a defective FireTV stick.I have accordingly disconnected it and await your suggestion about what to do now.", "verified": true, "helpfulness": "0/3", "author": "JEFFREY WEINER"}, {"rating": 5.0, "review": "It's a great item for the $20. plus tax when I purchased this in 2014.  Special early offer.  I already had the Apple TV but couldn't resist this price and the portability.  Can take it with us.  My daughter forgot to purchase this so of course being \"mom\" I gave it to her.  I may buy it again for myself, but waiting for either another special offer, or a newer style.. Definitely worth even the $39. price.  I may buy my daughter in Michigan one also..", "verified": true, "helpfulness": "0/0", "author": "Mytexas1"}, {"rating": 4.0, "review": "Got this to mirrory phone. Downloaded allconnect on both my phone and the stick and it worked well. Also use my Hulu account with this device. Since I have a prime account I get to watch some shows and movies for free.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this. A lot...", "verified": true, "helpfulness": "0/0", "author": "Shadi Baki"}, {"rating": 5.0, "review": "Love it!  The price is great!", "verified": true, "helpfulness": "0/0", "author": "Jmanning"}, {"rating": 5.0, "review": "Best stick out there..", "verified": true, "helpfulness": "0/0", "author": "R. Young"}, {"rating": 5.0, "review": "The Fire Stick is so simple to install and use. I love it! I am not technical at all--It is just a matter of plugging the adapter into to Fire Stick and plugging that in theback of the tv and then plugging the plug into the wall outlet. Easy! Then just follow the short movie tutorial and you are ready to go! The movies are on your screen as soon as you pick them out. Plus you can use Amazon Prime or your Netflix (my list). So far the Fire Stick is the best thing ever!", "verified": true, "helpfulness": "1/1", "author": "Zee Kay"}, {"rating": 1.0, "review": "With a great deal of help from Amazon on the phone, it was installed.  When I went back a few days later it had uninstalled.  I am preparing to spend more time on the phone with Amazon.", "verified": true, "helpfulness": "0/3", "author": "avis klein"}, {"rating": 5.0, "review": "I cut the cord a while ago and this is a great replacement for the cable box on a bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Arbuckle"}, {"rating": 1.0, "review": "I can't even use this product because the plug won't fit on a power strip. The base is too large to allow it to plug in between two other plugs. This seems to me an easily avoided production flaw.", "verified": true, "helpfulness": "0/4", "author": "Trevor Cobbs"}]