[{"rating": 5.0, "review": "Good tool to combine all the apps into one device.", "verified": true, "helpfulness": "0/0", "author": "Anthony Delgadillo"}, {"rating": 5.0, "review": "Fantastic-Hours of entertainment and easy to install!", "verified": true, "helpfulness": "0/0", "author": "Bruce Kennedy"}, {"rating": 3.0, "review": "It works.Prime video has a very limited variety of content.Works fine with Netflix.", "verified": true, "helpfulness": "0/1", "author": "Casiopea"}, {"rating": 1.0, "review": "This is great in theory, but it doesn't work half the time. It stops shows midway through, won't mirror my tablet consistently, and doesn't accurately keep track of where I am in the show. I normally love Amazon products, but this one is too buggy.", "verified": true, "helpfulness": "0/0", "author": "jessica7531"}, {"rating": 5.0, "review": "Amazing for the price!", "verified": true, "helpfulness": "0/0", "author": "JMC"}, {"rating": 3.0, "review": "i bought this to replace a chromestick which i can't find to save my life. i like that this has a remote, negatives are you can't cast anything from the web, it's not that easy to search, and no integration with playon", "verified": true, "helpfulness": "0/0", "author": "K."}, {"rating": 1.0, "review": "I am very disappointed in this item.  It worked well for the first three weeks or so.  Now, it will operate properly for only a few hours at a time.  After a few hours, the \"system\" will go into a loop where it will ask if you would like to place it into \"Sleep Mode.\"  Then, it will continuously scroll through viewing options very quickly for a period of time.  After this, it goes back to the sleep screen.  All of this happens without any real user interaction.  I started this loop by pressing the Home button.  If you unplug it from everything and leave it overnight, it seems to figure itself out.  This has been going on for a couple of months.  Of course, it is past the return/replace cut-off date.  My advice, don't waste your money on this.", "verified": true, "helpfulness": "0/0", "author": "James S."}, {"rating": 4.0, "review": "This is a pretty good streaming device.  I am impressed how quickly videos load.  However, I have some issues streaming Hulu and Netflix videos.  They constantly stutter and freeze.  No other videos have this problem on my Fire TV Stick, and Netflix & Hulu run perfectly on my Wii U and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "cannedpasta"}, {"rating": 4.0, "review": "Can't give a review yet, still learning how to use it.  Looks promising and we're excited to figure it out.", "verified": true, "helpfulness": "0/0", "author": "LIzzie"}, {"rating": 5.0, "review": "My electronically challenged mother was able to easily plug this in and get it working all by herself!! She did struggle a bit with figuring out how to open the remote to put in the batteries but by the third ignored call I got a message saying she was able to figure it out! Now she can finally watch Netflix and Hulu on her previously useless TV!", "verified": true, "helpfulness": "0/0", "author": "jenniferpetra"}]