[{"rating": 5.0, "review": "I love it!.....very easy to use....that a baby can figure it out !", "verified": true, "helpfulness": "0/0", "author": "Juri"}, {"rating": 5.0, "review": "East setup and lots of apps...This is a must buy for those non smart TV owners.", "verified": true, "helpfulness": "0/0", "author": "ZmanJ"}, {"rating": 5.0, "review": "Fantastic.  Now I can watch all my favorite tv shows and movies so easily thanks to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Allara"}, {"rating": 2.0, "review": "Barely met my expectations. I'd use AppleTV any day.", "verified": true, "helpfulness": "0/0", "author": "Heleodoro Uribe"}, {"rating": 5.0, "review": "Absolutely love this gadget. Have one in bedroom and living room. Netflix, amazon instant video, espn....awesome", "verified": true, "helpfulness": "0/0", "author": "Max Eugene"}, {"rating": 5.0, "review": "I purchased this stick to use for travel and liked it so much I bought the Fire box bundle for my home TV.  Works as promised, no lag time, so easy to set up and use.  If you buy the stick instead of the box I would purchase the voice activated remote, it's amazing.", "verified": true, "helpfulness": "0/0", "author": "BJMC"}, {"rating": 3.0, "review": "I don't find this to be as great as others have said in their reviews. You are limited in what content you can get unless you pay for Amazon Prime - in fact the  seems to me that the whole idea of the Fire Stick is to promote Amazon's service.  I actually like my Chromecast better.And by the way - when I clicked on the \"free\" Prime for 30 days button they charged my credit card for the annual Prime subscription without my approval.", "verified": true, "helpfulness": "0/0", "author": "Don \"Don\""}, {"rating": 5.0, "review": "It was easy to install & use. Glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "Patricia P Wells"}, {"rating": 5.0, "review": "Easy setup, plug this sucker in and follow the on screen prompts.  If you have a wifi password you will need that when first setting this up.  Installing the apps was real easy and getting around is quite simple also.  I have Netflix, Prime and HBO and I can move around them with ease.  I wish the Prime Menu had categories for TV's and Movies instead of New this month or best TV shows.  The music streaming service on this is great and the sound coming from my surround had a crisp clear tone.  The fact that they had Twitch TV sold me as I love to watch streams.  I bought this during the July 15th sale at 24.99.", "verified": true, "helpfulness": "0/0", "author": "former hoser"}, {"rating": 5.0, "review": "This works 1000 times better than chromecast!", "verified": true, "helpfulness": "0/0", "author": "richard boorman"}]