[{"rating": 5.0, "review": "So far so good.  Nice and convenient.", "verified": true, "helpfulness": "0/0", "author": "designer"}, {"rating": 5.0, "review": "Awesome piece easy to use", "verified": true, "helpfulness": "0/0", "author": "Adrian Ortiz"}, {"rating": 5.0, "review": "Fantastic addition to my TV. Allows me to stream programs and works well.", "verified": true, "helpfulness": "0/0", "author": "Robert B. Schmaling"}, {"rating": 3.0, "review": "Let's see, wish they would have included one more controller so I could play the games.It did come in early, so that's a plus.Overall, it's nice to be able to see pictures.", "verified": true, "helpfulness": "0/0", "author": "Michael E Trexler"}, {"rating": 1.0, "review": "Let me start off with saying the stick has the potential to be the best streaming stick yet. However, the stick is riddled with annoyances.  The biggest for me is the miracast functionality is terrible, it doesn't work with Windows 8.1 whatsoever and if I get it to work with my galaxy s4,  after long waiting screens, the sound won't play through my TV,  this may be due to user error but I have tried all the settings I can think of to fix the issue to no avail.  The app selection is minimal, but with big names like Netflix, Hulu, Plex, HBO go, Espn, I heart radio, Pandora, Spotify (connect), Vevo, and Amazon Prime-Music/Prime-video you may not notice the lack of other selections. For me, not having a dedicated YouTube app is a gamechanger, all you get is the Internet TV version you can access on any mobile Web browser, the interface is less than ideal but the casting works just like chromecast. Even when the TV is off, assuming your dongle is connected to the power block and not the TV and you have already paired your device with the stick, you can open YouTube on your phone, tablet, or laptop, select videos and cast as you would on a Google brand product. Gaming, so much potential, so little effort given from amazon. With less than 5 enjoyable free to play games the stick is slacking, it would be better and more games would be available if you were to purchase the $40.00 Amazon brand game pad, but at that price with the $40.00 price tag of the stick you might as well buy the recently reduced $80.00 Fire TV which will let you use use an old Xbox controller, a keyboard and other USB connected devices. I read that you may be able to connect a Bluetooth controller, so I went out and purchased a universal android 2.3+ gamepad, after much fumbling around with it, I gave up as I the FTVS wouldn't even recognize the thing. If Amazon would open up the FTVS and maybe even create a keyboard specifically for it, I would enjoy it more, and you probably would too, if you're looking to purchase the FTVS, I would hold off, it just seems like it's in a beta phase right now and Amazon is seeing if they can make it as little like android as possible.", "verified": true, "helpfulness": "0/2", "author": "Eric Pratt"}, {"rating": 5.0, "review": "It is a MUST have for everyone, its really amazing and easy to just plug in to a hdmi port, or port extender. (my tv only had 2 hdmi ports, and 1 was being taken up by the Sat box, and I have a dvd player. so I had to buy a port extender. it does 4 hdmi from 1, ) , You then just put it to the input that the fire tv is on and viola your ready to go, few steps to set up , easy to do, then you have access to everything and then some, it was extra fast, (some devices like the dvd players that go online and what not are slow processing/lag with clicking. but the fire stick is incredible. it works amazing, fast, smooth, so many choices for movies, tv, amazon prime member's (everyone should be able to afford 100$ a year, its way better then hulu that runs $8 a month ($96 a year) you get so many choices and ability's , like playing games, You can buy a voice control remote or a gaming controller. I have to say its one of my fav media devices for the tv. next to my wd live tv (w/wifi). having both = endless entertainment...", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Totally loving it. The remote is so much more handy than using an app on my Kindle, although, that works well too. It has been a completely joyous purchase.", "verified": true, "helpfulness": "0/0", "author": "Rich Renken \"Rev4 Audio\""}, {"rating": 5.0, "review": "Ease of operation is terrific!  Just plugged it in the HDMI port on the side of the TV and presto....the Firestick was recognised and registered and the tutorial led me through the setup.  Streaming is unbelievably fast...the picture is outstanding....great purchase!", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 5.0, "review": "I'M GLAD I WAS ABLE TO CATCH THIS ON THE $15.00 FOR MY FIRST FIRE STICK. PURCHASED DURING THE PROMOTION FOR $19.99 AND I HAD A $5.00 CREDIT FROM AMAZON PRIME. I WAS ABLE TO GET TWO MORE SO I HAVE A TOTAL OF THREE AND LOVE IT. THE BEST.", "verified": true, "helpfulness": "0/0", "author": "teneshia yarn"}, {"rating": 5.0, "review": "awesome!!! totally exceeded my expectations!! I love it easy to set up and really enhances my TV experience", "verified": true, "helpfulness": "0/0", "author": "Heather"}]