[{"rating": 5.0, "review": "Took awhile for this old schooler to get the hang of it.  But without too much strain on the brain, I am up and running and very very happy!", "verified": true, "helpfulness": "0/0", "author": "Gary Race"}, {"rating": 5.0, "review": "just buy one, you won't regret it", "verified": true, "helpfulness": "0/0", "author": "Edgar Cabrera Brea"}, {"rating": 1.0, "review": "Bought this a few weeks ago--I have a prime account, as well as a Netflix account, and thought this would be a great way to condense all my subscription services into one place.WRONG--Netflix is completely useless on this.  Pauses, buffers, declares that I have \"no network connection\".  This happened FIVE times in the first 7 minutes of an hour-long TV episode.  Apparently, there are some workarounds for this (resetting it to factory settings, etc), but I don't have the time for that.  I can buy a Roku stick for the same exact price--maybe it will work, maybe it won't, but this Fire TV stick certainly does not work for me.", "verified": true, "helpfulness": "1/2", "author": "kcb"}, {"rating": 1.0, "review": "Does it works in other country else  usa?", "verified": false, "helpfulness": "1/3", "author": "smith vixamar"}, {"rating": 3.0, "review": "can you use amazon fireTV stick on a windows 8 laptop", "verified": true, "helpfulness": "0/2", "author": "edward lynch"}, {"rating": 5.0, "review": "This is our second.  It's a great product and easy to install.  The price is great too, compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "M. Houdek \"peggylenox\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Marva L Griffin-Jenkins"}, {"rating": 4.0, "review": "I bought it to watch netflix. It works really well for that and for Amazon prime. Things you should know: well plug it into the wall. The tv does not give it enough juice. Also, for my tv (Phillips) if I don't unplug it when I turn the tv off, the very next time I turn it on the tv is mute. I have to unplug it, turn the tv off and then back on. The sound is fine agterwards.", "verified": true, "helpfulness": "0/0", "author": "Shelly Miller"}, {"rating": 4.0, "review": "Well, we haven't had this long enough to \"Love it\" but I give it a solid 4 stars because it does what it says with minimal fuss.  We had to let go of our TiVo service (I LOVE TIVO - no one's DVR features are even close to what they offer) because, sob, we don't get any over-the-air channels here!  So, we rely on Netflix and Amazon Prime for our TV and Movie watching fixes.  Except...we spaced the fact that our Roamio was WIRELESS and we have no way to connect our TV to the internet anymore for streaming.  In rides the utterly inexpensive Fire TV Stick, which we plugged in and POOF, like magic, we were again connected to the internet.We've played a little bit with the app for our iPads and iPhones, and all seems to work fine.  Our only complaint is that we wish it had a volume control, which I understand you can get with the upgraded remote.  Not worth it for us for that, but otherwise, it's perfect so far.  Once we've had it longer, I may come back and upgrade to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Gadget Girl"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "good"}]