[{"rating": 5.0, "review": "My 10 year old son and 10 year old cousin set this up while I was at work!  How cool is that!  This is in contrast to the 1st Roku that I bought.  It was very difficult for me to set up.  However, we still use it and it works well 3 years later.  The Fire TV stick is easy and has so many different uses.  Very glad we purchased this!!", "verified": true, "helpfulness": "0/0", "author": "Linda Snyder"}, {"rating": 5.0, "review": "So awesome easy to install love all the choices watched movies all day love it", "verified": true, "helpfulness": "0/0", "author": "Kary Bagnall"}, {"rating": 5.0, "review": "The Fire TV Stick is a great product for a average consumer because it has Netflix, Hulu Plus, YouTube, etc for your media needs but for a techie like me it's not perfect because side loading apk files/android apps is pain in the ass, it has no micro SD card slot, and has no google play store because this does run android but has a limited version of amazon fire TV market which has limited apps but perfect for the average consumer.", "verified": true, "helpfulness": "0/0", "author": "Kazi Begum"}, {"rating": 5.0, "review": "This device does everything that it says it will do. I set it up in minutes and am thoroughly enjoying the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Vicki F. Pinson"}, {"rating": 3.0, "review": "it was not what I expected; not easy to turn off and on nor to navigate.", "verified": true, "helpfulness": "0/0", "author": "mona inati"}, {"rating": 5.0, "review": "Does exactly what you want it to do.  Streams Netflix, Amazon Prime and more!  So easy to set up.  A lot of people are complaining that it needs to be plugged into a power source to work, and while it's true, I don't think that's a huge issue.  I have power strips near every TV in my house since the TVs, blue-ray players, and cable boxes all have to be plugged in anyways.  Overall, great product for a great price.", "verified": true, "helpfulness": "0/0", "author": "Smc6288"}, {"rating": 1.0, "review": "I returned because i have to pay for everything i want to see", "verified": true, "helpfulness": "0/1", "author": "Surami Pulido"}, {"rating": 5.0, "review": "I love the Fire stick! It's perfect!", "verified": true, "helpfulness": "0/0", "author": "Margarita Sandoval"}, {"rating": 5.0, "review": "Great Product, easy to setup!", "verified": true, "helpfulness": "0/0", "author": "Shalyon"}, {"rating": 3.0, "review": "Drops the signal folio much", "verified": true, "helpfulness": "0/0", "author": "kevin powdrill"}]