[{"rating": 1.0, "review": "This device from hell has a few things wrong with it.I got this on the half-price Prime deal. Once connected to my network it did the following:*Immediately stated that it wouldn't stream because of a 'slow network'--I have enhanced DSL*Destroyed all the other devices on my network, so they would no longer access the router.*Deactivated the modem.*Destroyed my router, so that protocols had to be rewritten and reset.*Cost me about fifty hours in troubleshooting time in fixing the damage it created--Amazon owes me $1000 for my time!I can't think of a single reason why you would want to buy this total piece of crap.  Smaller doesn't always mean better!", "verified": true, "helpfulness": "1/4", "author": "Get Serious"}, {"rating": 1.0, "review": "Piece of junk, all my other devices stream very well, this thing first took 2 hours to finally connect to my WiFi, first and only show I tried to watch would freeze, audio kept going picture froze. Played same show on my iPad mirrored through Apple tv, no problem.", "verified": true, "helpfulness": "0/0", "author": "Jalopy \"66jalopy\""}, {"rating": 1.0, "review": "After buying the Fire TV and having it work great on my TV. I thought that I would buy this during the $19 sale for a second TV. After being told that I wouldn't receive it until next year, then Christmas Eve, I finally got it yesterday. I tried plugging it into my TV and started the setup. However, when I got to the connect to a network screen, that's when I had problems. It didn't find my network, and further more, the menu wouldn't even show up. All I had was a blank screen, and when I tried to use the remote, I heard it clicking as if it was working, but nothing still would not show up on the screen. Tried resetting it as the support page suggested with no luck. Tried it on another TV with the same results. Amazon usually makes good products, but I don't know what happened with this. I'm getting my money back", "verified": true, "helpfulness": "1/2", "author": "JBroty"}, {"rating": 2.0, "review": "Bought this after owning a Chromecast (the best one in my opinion) and an Apple TV.I had a hard time to get it set up since my Kindle account was set for a different country - even if my Amazon account was set for USA.It all started giving me messages saying that my \"1-click payment\" wasn't working. I could use it normally on Amazon.com but for some reason Fire Stick wasn't recognizing it. After a call with customer support, they finally figured out that it was a problem with the Kindle account and voilà! Problem solved!I like having the remote control but I miss being able to use my smartphone or tablet to control. I think once they implement this functionality it will be hard to say which one is best: Chromecast or Fire Stick...Definitely a great purchase for $19.Not sure if I would pay more than $30!", "verified": true, "helpfulness": "0/0", "author": "Kyonne"}, {"rating": 4.0, "review": "It replaced my Roku 2 XS and so far the only thing I'm missing is my 10second back button, but considering I only paid $20 I can live without it.", "verified": true, "helpfulness": "0/0", "author": "Carlos Oropeza"}, {"rating": 4.0, "review": "So far so good.", "verified": false, "helpfulness": "0/0", "author": "misterzhong"}, {"rating": 1.0, "review": "Unit is less than 10 ft from my router with no walls in between and the video still skips and makes a weird noise every minute or so. Only paid $19 so I guess I'll keep it and hope for a software update but as of now the only Amazon branded product I'm disappointed in.", "verified": true, "helpfulness": "0/0", "author": "DBREHM"}, {"rating": 3.0, "review": "I would be much happier with this if Charter Cable supported the Fire Stick. I can't watch my HBOGO or Showtime Anytime until Charter approves the fire stick. Please work on this and help all Charter customers enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "marybobvilla \"marybobvilla\""}, {"rating": 5.0, "review": "This is absolutely fantastic I am enjoying how easy it is to watch and listen to any thing I want.", "verified": true, "helpfulness": "0/0", "author": "Jay C"}, {"rating": 1.0, "review": "i can't get it setup!", "verified": true, "helpfulness": "0/1", "author": "Tc"}]