[{"rating": 3.0, "review": "I have a Chromecast dongle and saw the Fire TV Stick was on sale for $19 so I bought it just to check it out.  The Fire TV stick is easy to install if you have a strong wireless signal (Fire Stick wouldn't work on a Samsung Smart TV already wirelessly connected to the internet which was too far from my router for Fire Stick) and easy to use but does less for me than my Chromecast.  Fire Stick adds a physical remote, as well as phone and computer control apps like Chromecast, which is easier to use as the remote doesn't go into standby or require you to deal with lock screens when you want to make quick fast forward, rewind or pause.  Fire TV also adds Amazon Prime video which is of no value to me as all of the offerings of old movies or TV programs I saw years ago if I was interested and very few offerings are current and free.  I already have Comcast Xfinity On Demand, HBO GO and more for a better selection of free current or purchase offerings.  With Chromecast I can easily cast video or pictures with or without uploading to the cloud from either my android phone app or Chrome browser on my laptop.  Not so with Amazon.  I also have many digital movies so I tried uploading one to Amazon's cloud servers and was unable to do so because Amazon web servers don't allow you to upload files larger than 2GB.  When I found that I could upload larger video files to Amazon from a desktop app I did so but when I went to play a movie for friends and family I was notified that Fire Stick will not play videos longer than 20 minutes!  On Chromecast it is also very easy to use apps for premium channels I subscribe to on Comcast like HBOGO (not available on Fire Stick), Showtime Anytime and others just by signing in once to my Comcast Xfinity account on Chromecast without having to sign in for each channel.  Currently I am not using Netflix, Hulu, or the like which are available on both devices.  Bottom line, if Fire Stick supports the content you desire like old movies and TV or simple games which mostly require the purchase of an additional controller, the Fire Stick remote is an advantage over Chromecast but personally I haven't figured out what I would use Fire Stick for as it does less for me than my Chromecast.  Some reviewers say the Roku 3 may be a more complete offering than either the Chromecast of Fire Stick but I haven't tried it yet.", "verified": true, "helpfulness": "2/2", "author": "Jeff2468"}, {"rating": 5.0, "review": "Working as advertised.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Whitehill \"Bookish Barb\""}, {"rating": 5.0, "review": "Bought is solely to view my free prime videos, so far so good", "verified": true, "helpfulness": "0/0", "author": "Andrew Nagle"}, {"rating": 5.0, "review": "So much better than a Chromecast as far as portability, ease of use and the including remote. Love this thing. Only thing missing is HBO Go which I hear will be added soon.", "verified": true, "helpfulness": "0/0", "author": "Goods"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Michael Leung"}, {"rating": 1.0, "review": "Bought these as gifts for others.  Gave one to my girlfriend but it quit connecting to wifi a week later.  It worked perfectly fine for the first week! Don't even want to give my mom hers because she won't be able to handle the frustration.", "verified": true, "helpfulness": "1/1", "author": "Andrew Newell"}, {"rating": 5.0, "review": "The fire tv stick is awesome! very easy to set up and use. I love the interface and all the apps. I just wish there was a remote app for the IOS.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 4.0, "review": "It does what I expect. It has a few quirks but what doesn't these days. I would give it 5 stars if it didn't try to steer me towards Amazon Prime. BE AWARE of what you are doing or you will end up buying stuff you can get for free elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Hansmon"}, {"rating": 1.0, "review": "Device is not recognized by TV on any HDMI port so I never even got to the set up screen.  Everything is well connected and plugged in and the ports work with every other device so it's not the TV.  I posted a help request on Amazon's user forum and will update this review if a solution is found.  But so far, this particular FireStick is a POS.", "verified": false, "helpfulness": "2/2", "author": "ArtemisShopper"}, {"rating": 5.0, "review": "Great product that works flawlessly. If you have a USB port in your TV you can attach the usb power cable to it, thereby avoiding the need for a power outlet. Especially usefull if your TV is on the wall and you don't want cables hanging. Wasn't able to start it through my Denon amplifier. Seem to only work directly from TV. But I used optical out audio of my tv to attach it to my receiver/amp and got the sound to my speakers that way.", "verified": true, "helpfulness": "0/0", "author": "A mum"}]