[{"rating": 5.0, "review": "I was one of the first Amazon prime members to order this and it is a great value!  Easy to set up and now I can utilize my Prime Membership on my bedroom TV via HDMI port.  I considered the Chromecast and Roku but can't beat this value.  I use this for Netflix also and works just fine!", "verified": true, "helpfulness": "0/0", "author": "Joe Sid \"Joe S.\""}, {"rating": 5.0, "review": "Turned my older TV into a \"smart tv\".Increases number of program alternatives and provides access to additional entertainment options!", "verified": true, "helpfulness": "0/0", "author": "Stuart Stoller"}, {"rating": 5.0, "review": "Awesome alternative to the Roku. Cheap and easy. Full of awesome channels and programming.", "verified": true, "helpfulness": "0/0", "author": "Chris B"}, {"rating": 5.0, "review": "Absolutely awesome! Easy to set up, fantastic user interface! UI is a deal breaker for me and it is so well organized. No skipping, no audio dying, streaming is great quality. Best part is that I don't need the Xbox anymore.Love it!", "verified": true, "helpfulness": "0/0", "author": "va33 \"va33\""}, {"rating": 5.0, "review": "Easy to set up and works great!  Can't see why anyone would want to buy anything else.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dan\""}, {"rating": 1.0, "review": "Too expensive to use. Uses up too much data to make it worth it.", "verified": true, "helpfulness": "1/2", "author": "Robin M. Curtis"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lynette DeBerardinis"}, {"rating": 5.0, "review": "Great, Now I will dump DISH NETWORK", "verified": true, "helpfulness": "0/0", "author": "RICHARD"}, {"rating": 5.0, "review": "So easy to set up!  And great options for viewing movies, TV series, etc.  What I love the most are the shows/movies for Amazon Prime customers. Make the annual Prime fee well worth the money!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Castille"}, {"rating": 5.0, "review": "Really amazing device!  Had to get Comcast to upgrade to a modem/router combo with dual bands. Then the \"stick worked perfectly.Despite the \"optional\" electrically fed booster, I needed it.John K", "verified": true, "helpfulness": "0/0", "author": "John"}]