[{"rating": 5.0, "review": "Works great. Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Maresa Crile"}, {"rating": 5.0, "review": "This arrived fast, beautifully packaged, and very easy to install and use.  I am very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Irene \"desert girl\""}, {"rating": 1.0, "review": "Did not like the format and clicked watch CNN Live and wanted $1.99 to watch this episode!  Pay $20 a month and get nickel and dimed from there.  Never could watch a live CNN broadcast.  Cancelled service the same day. Took back the Stick and cancelled Sling TV. I will say the TV Fire stick did what it was supposed to do however could not get the remote control to work.", "verified": true, "helpfulness": "0/0", "author": "Rory W. Mahoney"}, {"rating": 5.0, "review": "I love it so much. Best product i ever own", "verified": true, "helpfulness": "0/0", "author": "Vu Tran \"Computerism\""}, {"rating": 5.0, "review": "Love it would order again.", "verified": true, "helpfulness": "0/0", "author": "M. A. Bolt"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "austin"}, {"rating": 5.0, "review": "Easy to set up & already enjoying all my Netflix & Prime shows!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "gooselmr"}, {"rating": 4.0, "review": "Very cool device, join Amazon prime for full effects", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 3.0, "review": "Okay I waited a month before making this review so that I have a good idea what I was using. I'm a 2 year roku user and as of this review I went to walmart and bought another roku to replace this.Here is why:Netflix has no issues streaming on roku, desyncs on fire stickPlex runs fine on roku, desyncs on fire stickPlex channels do not work on fire stickFire stick doesn't have access to ALL the channels roku has ( no vudu or crunchy roll )I've had to restart my fire stick at least once a week ( in the two years I owned a roku I needed to restart it when it was dying close to the end )Now you need a HMDI cord for the roku ( unless you but the roku stick which isn't a good buy either, get a box ) and you don't with the fire stick.All in all, if you are on a budget, get a streaming stick just don't expect quaility for the price.", "verified": true, "helpfulness": "1/1", "author": "Chris Lozano"}, {"rating": 5.0, "review": "Best to have if don't have a smart t.v.", "verified": true, "helpfulness": "0/0", "author": "Isaac justiniano"}]