[{"rating": 5.0, "review": "Love this. Don't know why I didn't buy sooner!", "verified": true, "helpfulness": "0/0", "author": "Sarah Lawson"}, {"rating": 5.0, "review": "Movies, documentaries , television series, and beautiful screen savers!", "verified": true, "helpfulness": "0/0", "author": "Linda Miller"}, {"rating": 5.0, "review": "So far so good, no problems at all with setup or functionality.  Took about 5 minutes and I was checking out all the features while listening to music on my new apps.", "verified": true, "helpfulness": "0/0", "author": "Bryan Marsh"}, {"rating": 1.0, "review": "More than aweful!!! My WiFi works fine for my ps3, phone, computer, etc. Even when I log all of those out of my wifi, it STILL doesn't work! Every single move I click on, it says no stream available. ALL OF THEM I have YET to find a movie that will actually play! This product would be returned in a heart beat if it wasn't a gift from someone else! I feel bad for tearing this down as a gift, buy it's aweful and so frusturating! I don't understand how anyone gets there's to work!?!?!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We purchased the Amazon Fire Stick after our Chromecast suddenly quit working after one year (error: Brain Freeze). The picture quality with the Fire TV Stick is impeccable and has upgraded and improved the picture on our 8 year old LCD flat screen, which is way outdated as technology and pixel quality has come a long way in the last decade. I love that it comes with a remote control, yet also allows us the option of using our phones and tablets (with a free Fire Stick app) to control the channels, etc. Fire stick allows us to watch all of our favorite channels (HBOgo, Showtime Anytime, Netflix, Youtube, Amazon Streaming, Hulu, and Vimeo...plus many more. It is extremely affordable and super easy to install. I highly recommend the Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Brooklyn Hudson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Helena"}, {"rating": 2.0, "review": "I like this device but I will not buy another one. I was not aware that you could not add additional applications. I have TV/movie/cable applications that I am not able to use on my Amazon Fire Stick but I can use on my smart phone.", "verified": true, "helpfulness": "0/0", "author": "seanyea rains"}, {"rating": 4.0, "review": "I'm happy with my fire stick", "verified": true, "helpfulness": "0/0", "author": "Kelly Lappen"}, {"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "It's excellent", "verified": true, "helpfulness": "0/0", "author": "hai truong"}]