[{"rating": 2.0, "review": "Too many in-app purchasing for individual episodes etc.", "verified": true, "helpfulness": "0/1", "author": "Scott Fryer"}, {"rating": 5.0, "review": "The best 40 dollars I spent!", "verified": true, "helpfulness": "0/1", "author": "michael scolaro"}, {"rating": 5.0, "review": "Works great,happy with the file sticks performance.", "verified": true, "helpfulness": "0/1", "author": "hireland"}, {"rating": 5.0, "review": "Works fine. Doesn't overheat.", "verified": true, "helpfulness": "0/1", "author": "William F. Brown"}, {"rating": 2.0, "review": "I could not get it to work properly with my iPod Mini so I went to Apple TV which is doing much better.", "verified": true, "helpfulness": "0/1", "author": "W C Reed"}, {"rating": 5.0, "review": "Amazon Prime so far is much better than Netflix for my interests.  Much better selection of new movies.  Device was easy to set up and works well; controller is very handy.", "verified": true, "helpfulness": "0/1", "author": "cf"}, {"rating": 5.0, "review": "I watched most movies on my kindle.  Now I can see the same moving on my TV screen.  Highly recommended and a good price.", "verified": true, "helpfulness": "0/1", "author": "Bonnie Bates"}, {"rating": 5.0, "review": "The Fire TV Stick is Amazing, it works so well. The apps and the games are also amazing. Do yourself a favor and get one. My family loves it and I am going to buy at least one more for the bedroom.", "verified": true, "helpfulness": "0/1", "author": "Benny Baca"}, {"rating": 5.0, "review": "The product work as described", "verified": true, "helpfulness": "0/1", "author": "wigginbt"}, {"rating": 5.0, "review": "I am an Amazon Prime Member, I watch all the great movies and TV shows on my laptop. I decided to to try the fire stick so I could watch everything on my big TV.My bedroom is at the other end of the house and I wasn't sure how great of a signal I would get for the stick since I had a lot of trouble watching movies in there with a lot of buffering. Very annoying.  Sometimes I would just give up and stop watching.Well, the stick is working GREAT!  I am watching my TV shows and Movies with no problems.I can watch my Netflix shows on there too, with no problems and my other shows on the History Channel etc.Set up and downloading the apps I wanted was a breeze.I am not a big game player but I did download Tetris and it plays fine.I can even see all my digital pictures I have in my cloud, on my TV.I have no cons.I am only sorry I did not order this sooner!", "verified": true, "helpfulness": "0/1", "author": "RFitzy"}]