[{"rating": 5.0, "review": "When my last child moved out, so went the gaming consoles leaving me no way to watch Netflix or Prime video on my TV.  I had been looking at the Chrome Stick and Roku as a possible solutions when Amazon had it's offer for the Fire Stick.  I figured it's worth a try for $19.  I absolutely LOVE this item.  Set up was easy for this technologically challenged person and the updates, downloads, and syncing only took about 20 minutes. The streaming is excellent as is the sound quality.  My husband and I love that we were able to sync our YouTube playlists and watch our trail ride videos together on a big screen.  I am still exploring all the features and each day I fall more and more in love with this.  My husband and I are not big \"live\" TV watchers and if we can find a way to watch news I'm pretty certain cable is going to go - saving me $140 / month.  I'm still trying to figure out how to get the channel watching apps that down load and work on my Kindle onto my Fire Stick.  My only complaint is they need some instructions for techno-dummies like me without all the industry lingo in regards to the apps, etc...  Otherwise, this was probably the best $19 I ever spent.", "verified": true, "helpfulness": "11/12", "author": "A. M. Carr \"Ruminant\""}, {"rating": 5.0, "review": "This has to be one of the great bargains of the year.  I bought it because Amazon offered it at such a great pre-order price that I thought even if I did not use it I had not invested much.  It arrived yesterday and I thought about asking my son to come over and install it for me but decided to give it a try.  It was so easy I had it installed and connected to my network in no time.  I love the fact that I can pair my TV so that I can select youtube videos from my computer and then watch on the large screen TV.  Since I am a prime member I have lots of options to explore. Thanks Amazon for providing a simple, powerful and affordable product.  I also like the fact that I was able to download the Amazon Fire app to my phone so I could do voice search without buying anything else.", "verified": true, "helpfulness": "12/12", "author": "Kay Robbins"}, {"rating": 5.0, "review": "I wish I would have preordered 5 more of these when they were on sale. I love it.", "verified": true, "helpfulness": "1/1", "author": "rydog"}, {"rating": 1.0, "review": "I would love to review the Fire stick I ordered back on October 28th, but that's not possible. You see, despite the fact that I can walk into my local Best Buy and buy a truckload, Amazon decided to bump my delivery date to January 5th. JANUARY 5TH! Are you kidding me? Either have the product or don't. This pre-order/request an invitation crap is absurd. You want us to feel valued as Prime customers, yet you jack us around time and time again. I will be canceling the stick order and not renewing my Prime.", "verified": true, "helpfulness": "15/36", "author": "TsarChasm"}, {"rating": 4.0, "review": "Finally able to watch Amazon Prime videos on my Samsung LED TV that doesn't offer the Amazon App.  So far, the Fire TV stick seems to be responsive and providing you have decent Wi-Fi, you should enjoy this upgrade to your TV.  BTW, the Fire TV stick will detect that you are using an \"unsupported USB power source\" (i.e. not using the USB wall adapter that ships with the product), but it seems to work fine by being plugged into the TV itself (Samsung's USB port on the back of the TV)--no visible cables.I'm weary that companies (such as Amazon) can use devices like this to do more sinister things with our Internet connections and power \"behind the scenes\" of what the product \"appears\" to offer, so I'm glad that the TV turns off the USB port to the Fire TV stick when not in use.  This device is basically a computer that could be remotely hacked.  I really don't want to be providing Amazon unfettered access to my internal network 24x7, do you?  ;)", "verified": true, "helpfulness": "0/1", "author": "Matt B."}, {"rating": 5.0, "review": "Great device. Makes watching Amazon prime a breeze.", "verified": true, "helpfulness": "1/1", "author": "Joseph d"}, {"rating": 5.0, "review": "Only had it running for 2 days, but we love it. I'm not sure what all the complaints are for. There's bound to be a few bugs, as with any new device that hits the market, but I haven't encountered any with the Fire TV Stick.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! its blazing fast the interface! much better than any other tv smart interface! The quality in Netflix and Hulu are amazing too! get it! love it!", "verified": true, "helpfulness": "1/2", "author": "Pedro Acevedo"}, {"rating": 5.0, "review": "We have 4 Rokus in our house but I wanted a less expensive viewing option for a small TV with no cable.  The Fire TV stick fits the bill perfectly.  It is inexpensive and gives access to among other channels Amazon Video and Netflix, the 2 services we use.  Set up was minimally cumbersome since I had to enter my password twice after the update, but no big deal.  It works fast, connects well to wifi, and I like the small plug in profile.  Works great!", "verified": true, "helpfulness": "2/3", "author": "Amazon frequent buyer"}, {"rating": 2.0, "review": "The Fire TV stick is actually pretty good. The problem is the remote. It's too small and flimsy. Can't hold it well. It is hard to hit the correct buttons/arrows.If the remote was OK this would be four stars. You need a remote to use it so....I don't have a smart phone so I can't use that.I wonder if the voice remote would be any better?", "verified": true, "helpfulness": "1/6", "author": "Bert K"}]