[{"rating": 5.0, "review": "Best thing ever. Super portable. Nothing bad to say about it except that it took a month to get here from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mykeymic \"Mike\""}, {"rating": 5.0, "review": "Prior to opening, the packaging was really sharp and well done.  Once opened, the product looked and felt high quality.  Set up was a breeze; not quite plug and play though (more like plug in, log on to my PC to finish setting up billing info and put a credit card on file, then play).  Signed up for the free 30-day trial of Prime.  Love synchronizing with my personal device so YouTube searches can be done on my phone then transferred to my TV for example.  Fun to use and took my in-home electronic entertainment to the next level for a great price!", "verified": true, "helpfulness": "0/0", "author": "Kevin Dunbar"}, {"rating": 2.0, "review": "interface lags alotmaybe an update will help later onapps close on their ownremote seems to malfunction a lot too", "verified": true, "helpfulness": "0/0", "author": "luigi"}, {"rating": 4.0, "review": "It's an awesome item to have, especially since my tv isn't a smart tv. I can watch Amazon Prime Instant Video, YouTube, Netflix, and Hulu on it, even listen to Pandora from my tv too.The controls are a bit wonky though. Scrolling through videos on YouTube or typing in movies to search is a little rough.", "verified": true, "helpfulness": "0/0", "author": "Ramon"}, {"rating": 5.0, "review": "Really cool. Got hooked on Alfa House w/John Goodman and HBO's 6 Feet Under. My son plays the games.", "verified": true, "helpfulness": "0/1", "author": "Rockschool"}, {"rating": 5.0, "review": "It is easy to use and great device", "verified": true, "helpfulness": "0/1", "author": "M. Landaas \"Fl kindle reader\""}, {"rating": 4.0, "review": "Nice piece of equipment", "verified": true, "helpfulness": "0/1", "author": "paul dunn"}, {"rating": 5.0, "review": "This thing is very small and seems to works almost as well as the bigger Fire TV. Seems to be faster than apple TV or Roku.The include USB cable (about 6 inches long) was appreciated as my TV needed it to fit in the back. Installation was effortless.The remote is the same as Fire TV. I like that it doesn't have 5000 buttons.It was a real bargain during the introduction pricing. Much cheaper than the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "atrox13"}, {"rating": 1.0, "review": "Fire stick is OK, but I bought it primarily for two services - Netflix and SlingTV.Sling TV works great, but Netflix is unusable.  It skips, freezes, and also drops audio on a regular basis. Watching programs is almost impossible without going nuts - I am constantly rewinding to get the audio that dropped out.  The stick is within a foot of the router, and all my other devices stream Netflix just fine.Edit: After another night of buffering, skips, and frustration, I want to throw this out. I hate this stick - I wish I had gotten the full fledged Amazon Fire box.", "verified": true, "helpfulness": "0/0", "author": "Go Rockies"}, {"rating": 5.0, "review": "This Fire stick works great and was worth the wait.  I like watching youTube on my TV.", "verified": true, "helpfulness": "0/0", "author": "LadyDivaDi"}]