[{"rating": 5.0, "review": "This is by far, the best way to turn your television into a smart one!!", "verified": true, "helpfulness": "0/0", "author": "J. Ray"}, {"rating": 5.0, "review": "Working great so far.  Haven't really had a chance to explore all of its capabilities.", "verified": true, "helpfulness": "0/0", "author": "Diane Schillaci"}, {"rating": 5.0, "review": "I really love it,  it is amazing.  Best idea yet to put all your TV in 1 place and be so small.", "verified": false, "helpfulness": "0/0", "author": "Brianna"}, {"rating": 5.0, "review": "Very impressed. Worth $39. Just waiting for Amazon to drop free shipping back to $25 :-)", "verified": true, "helpfulness": "0/0", "author": "mike LaVoie MLVNYCtm"}, {"rating": 5.0, "review": "Simply awesome!!", "verified": true, "helpfulness": "0/0", "author": "steven w."}, {"rating": 3.0, "review": "Still getting to know my FireStick.  I've had it less than a week.  I love that I can watch my shows, movies, etc...I can watch YouTube video, too.  The one thing that is a disappointment is not being able to watch LIVE shows YouTube airs.  I watch a lot of these and I get an error on each one, would love to see this get rectified and allow for it.  I'd rather watch these LIVE streamed shows on my big screen over my phone or iPad.", "verified": true, "helpfulness": "0/0", "author": "Kendra R."}, {"rating": 5.0, "review": "After some time in learning its working instructions, I have and can finally say Hallelujah.  This apparatus is the most put together device that I have come across in my life.  I'm so happy with mine, I may repurchase another for my son-in-law.  There is one issue on the pin to be accompanied every time a movie, music, or game is chosen.", "verified": true, "helpfulness": "0/0", "author": "GRANNY 946 \"CHERYL K. NEAL\""}, {"rating": 5.0, "review": "I love it its even great for the boat as long as you have wifi", "verified": true, "helpfulness": "0/0", "author": "Brian Walsh"}, {"rating": 5.0, "review": "Works well. My wife is bings watching Downton Anney. Easy to set up. Much stuff costs money, but there's a lot of free stuff too, if you've got Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Philip Juhas \"runner2002\""}, {"rating": 5.0, "review": "I think it is great to watch Amazon prime and Netflix on your TV. Super easy to set up and use within 5 minutes and for the price it is great. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Kathy Geraghty"}]