[{"rating": 2.0, "review": "I expected a lot more of the content to be freely available.  A filter to only show what's available until I want to search for something to buy would be very nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Half-Adder\""}, {"rating": 5.0, "review": "Awesome, works great and best thing I bought myself in a long time!", "verified": true, "helpfulness": "0/0", "author": "Mama D \"non-junk buyer\""}, {"rating": 2.0, "review": "I was really excited to finally have this come and it worked ok the first day. After that it just went downhill from there. I live in an 840 square foot apt. My router is in my front room and the fire tv stick connected to the tv in the very next room - it's not far from the router by any means. However, the fire tv stick will not stay connected. It will go from saying signal strong connection very good to connected with problems to just disconnecting altogether. I even got a message a couple times saying the device bandwidth was too low to stream videos and I would have nothing else streaming at the time. I would then test my other devices and stream on my smart tv that's connected to the same router even further away and have no problem AT ALL. My laptop still streams fine, my phone, etc again all connected to the same router. I've put the extender on, re-installed my router, reset my device and nothing works. I love the easy set up and really wanted this to work - it's unfortunate. I don't understand some people experiencing this and others aren't.", "verified": true, "helpfulness": "1/1", "author": "Cocoa Puff"}, {"rating": 5.0, "review": "Great stuff", "verified": true, "helpfulness": "0/0", "author": "william jarrell"}, {"rating": 2.0, "review": "Have a lot of questions and I'm not finding the answers. I don't know if I'm going to keep the stick. Since I can't find answers on the computer, it might be a good idea to have a book with \"questions often asked\"", "verified": true, "helpfulness": "0/0", "author": "Judith A Bryant"}, {"rating": 5.0, "review": "I love it but there is no power botton do I leave it pluged in to my tv when I'm not using it ?", "verified": true, "helpfulness": "0/0", "author": "michael paad"}, {"rating": 1.0, "review": "It overheats and buffers continuously and freezes especially on Hulu Plus, none of which my Roku does.", "verified": true, "helpfulness": "0/0", "author": "Jan Williams"}, {"rating": 2.0, "review": "I am very disppointed in the small amount of Netflix selections & the fact that I have to pay for episodes of my favorite TV shows.", "verified": true, "helpfulness": "0/0", "author": "Sherill Foster"}, {"rating": 5.0, "review": "had Apple tv..loved it!  Fire tv ,as good,if not better!", "verified": true, "helpfulness": "0/0", "author": "Tobys Dad"}, {"rating": 5.0, "review": "Works great.  The only slight issue is that Netflix loads slower and seems to drop off more easy than Amazon...go figure?", "verified": true, "helpfulness": "0/0", "author": "E8DAWG"}]