[{"rating": 1.0, "review": "Totally worthless", "verified": true, "helpfulness": "0/0", "author": "BillW"}, {"rating": 5.0, "review": "I am really enjoying my fire TV stick.  It is so much nicer to watch movies on the big screen.  I had a little trouble hooking up the stick since I only had  I had to purchase an extra hookup which held more outlets.", "verified": true, "helpfulness": "0/0", "author": "Judy Holmes"}, {"rating": 5.0, "review": "Our TV has become smart with this Stick! We can watch Netflix and play games!", "verified": true, "helpfulness": "1/1", "author": "Jono \"Jono\""}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/0", "author": "Pookie \"here\""}, {"rating": 3.0, "review": "Generally works well but need a better interface to mirror PC/Laptop.  Not at all user friendly trying to stream from laptop.", "verified": true, "helpfulness": "1/1", "author": "David Knack"}, {"rating": 5.0, "review": "I'm very happy with this little device, which has replaced my Wifi-enabled BluRay player as the preferred method for streaming to my television.  It was very easy to set up and I like the fact that it has own remote control so I don't have to install yet another app on my phone.  I have also found it to be more reliable than the Chromecast, which frequently loses its connection despite the fact my router is within 5 feet of my TV.  This may have something to do with the fact that I live in a large apartment building surrounded by wireless networks, but so far it has not been a problem for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 5.0, "review": "simple to set up and great to use. netflix is always a little fuzzy for the first few minutes of use but i'm betting that's more my router than the stick. i'm glad i made this purchase!", "verified": true, "helpfulness": "0/0", "author": "Kara"}, {"rating": 5.0, "review": "Better than cable and satellite. A must for every home. You will save at least $100.00 extra a month with Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"abundance\""}, {"rating": 5.0, "review": "Love love my firestick best value ever", "verified": true, "helpfulness": "0/0", "author": "candy"}, {"rating": 5.0, "review": "It works great and is faster than my smart tv connection.  I also used it at a hotel and it was great for my kids to have their normal cartoons in the morning.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]