[{"rating": 5.0, "review": "Streams music and video as expected.  A nice selection of content providers.  A nice alternative to buying \"smart TVs or BluRay players\".", "verified": true, "helpfulness": "0/0", "author": "N Timmer"}, {"rating": 1.0, "review": "It does not stay connected bought as a gift now I am stuck with it... SMH", "verified": true, "helpfulness": "1/1", "author": "John C."}, {"rating": 3.0, "review": "still trying to get acquainted with product.. wish their was a better guide.", "verified": true, "helpfulness": "1/1", "author": "sheldon stone"}, {"rating": 5.0, "review": "Got this for our son. Works great and easily set up. He loves his minecraft videos and netflix. Ordering another for my room.", "verified": true, "helpfulness": "0/0", "author": "Gina Rodgers"}, {"rating": 3.0, "review": "not enough info cost/free", "verified": true, "helpfulness": "0/0", "author": "J. D. Kniseley \"decaysquid\""}, {"rating": 5.0, "review": "Very easy to set up and get going and the movies and television series on available on Amazon Prime is great.  Everything is very simple to operate.", "verified": true, "helpfulness": "0/0", "author": "Doug L"}, {"rating": 5.0, "review": "Awesome! Love it! So easy to install. So much too watch.", "verified": true, "helpfulness": "0/0", "author": "M. Frazier"}, {"rating": 5.0, "review": "Amazing Product!  its excellent in every aspect. Super Fast! everything open less than a second.", "verified": true, "helpfulness": "0/0", "author": "Babak"}, {"rating": 5.0, "review": "Pros:  1) Low Cost  2) Easy to use with either remote or with more fully-featured smartphone/tablet application.  3) Fast loading video over the Internet with little lag or flutter seen with some \"smart\" TV  4) With 5 GB, the Stick is upgradable and allows Fire apps to be installed for non-Amazon channels.Cons:  Very little.  Would be nice to have voice search via smartphone app, skip ahead on smartphone app (i.e. skip to specific time of video) etc.", "verified": true, "helpfulness": "0/0", "author": "Savvy Scott"}, {"rating": 5.0, "review": "Yes! No buffering.  Had probs. with Apple tv buffering, fire stick fixed that.  Btw it's not just a stick, for peak performance, you need to plug it in with the wire that is included.", "verified": false, "helpfulness": "0/0", "author": "tigress"}]