[{"rating": 1.0, "review": "Didn't work at all with my tv set up and there was absolutely no information or warning about types of set requirements needed. Wasted time on this one.", "verified": true, "helpfulness": "0/1", "author": "Diana S-D \"Mojave Light Images\""}, {"rating": 5.0, "review": "Great product i love itlove it!", "verified": true, "helpfulness": "0/0", "author": "zakira porter"}, {"rating": 5.0, "review": "Excellent!  Excellent!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love this thing!! Amazing", "verified": true, "helpfulness": "0/0", "author": "Sava Gavrilovic"}, {"rating": 5.0, "review": "This is an amazing device!.  The movies and games it dellivers for such a reasonable price is wonderfulEasy to hook up and use.  I had Amazon Prime just to save on shipping, not knowing all the movies, ertc. came with it.", "verified": true, "helpfulness": "0/0", "author": "Robert H. Cording, Jr."}, {"rating": 1.0, "review": "Did not work.  Would not pick up Internet.  Worthless", "verified": true, "helpfulness": "0/0", "author": "Richmond Whillock"}, {"rating": 1.0, "review": "I cannot get it to hook up to the internet without it dropping access every two minutes.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "There are plenty of reviews from people who are much more tech savvy then me. Sorry, no tech talk from me. Just why I like the firestick.1. I love having access to all the prime content that comes with my membership. Also with the allcast app on my phone, I'm able to stream content off my phone.2. It was super easy to set up and I like that I can use my phone as a remote. I'll eventually get some gaming controls,  so I can play games with my family.3. My mom (who's barely tech savvy) can use it with ease and thats definitely worth a good review in my book.4. The firestick is easy to take with you whenever you go, all you need is wifi.", "verified": true, "helpfulness": "0/0", "author": "sonya campos"}, {"rating": 5.0, "review": "I love the Fire TV Stick!  Just wish there were more recent good movies in prime.", "verified": true, "helpfulness": "0/0", "author": "Mima Piar"}, {"rating": 5.0, "review": "Works great as an upgrade from Chromecast.", "verified": true, "helpfulness": "0/0", "author": "B. Crutcher"}]