[{"rating": 5.0, "review": "So far the Amazon Fire TV stick is living up to their name......It's great!!!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 1.0, "review": "Dissappointed , does no work outside the US!!!  Correction,  only Netflix world because  I  have an account.... I can't access the Premium features of Amazon or any other provider. ..", "verified": true, "helpfulness": "0/0", "author": "Patricia Gomez Esquivel"}, {"rating": 5.0, "review": "The Fire stick is above my expectations.  So much better content than Netflix.  I am bragging about it to everyone I meet.", "verified": true, "helpfulness": "0/0", "author": "Brenda Ludwig"}, {"rating": 5.0, "review": "I love it! Very easy to use and totally worth it", "verified": true, "helpfulness": "0/0", "author": "Tiffany damon"}, {"rating": 4.0, "review": "It came with minimal directions on the set up process. The product itself is was good.", "verified": true, "helpfulness": "0/0", "author": "Melanie Land"}, {"rating": 5.0, "review": "Very easy to navigate and auto set up if you have a prime membership! Only had for a short time but love it so far! I downloaded the free App, and use voice search.", "verified": true, "helpfulness": "0/0", "author": "Dudabuda"}, {"rating": 2.0, "review": "Same problem with the fire box, refuses to play HD content in HD", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "Kevin Marcantel"}, {"rating": 5.0, "review": "The firestick is so easy to use and it has a lot of features I didn't know about", "verified": true, "helpfulness": "0/0", "author": "Jennifer N \"Jen N\""}, {"rating": 2.0, "review": "Maybe I didn't do enough fine print reading,  but I understood this to be a way to stream movies and different tv shows for free if I was Prime. Apparently the apps are free, but require a subscription to view the movies. It's the same thing our Xbox and Kindles do. Just disappointed with myself for missing that tidbit of info.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]