[{"rating": 3.0, "review": "Had to buy a lot of tv series that we normally watch with amazon prime...after seeing that we cannot cancel our cable subscription which was the point of purchase I was disappointed ...other than that it was easy I set up and use.", "verified": true, "helpfulness": "0/0", "author": "Cherie Ann Dibler"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "We have had the fire stick for just over a month and love everything about it, except some of the older movies for example Mary Poppins have to be rented rather than streamed for free.", "verified": true, "helpfulness": "0/0", "author": "Ashley Ragsdale"}, {"rating": 4.0, "review": "Only used it twice so far.  Very easy set up.  Easy to use and to find what you are looking for.  So far I love it! If I have any issues I will rereview it.  Only gave it four because I haven't had it long enough to say whether there are any major problems.", "verified": true, "helpfulness": "0/0", "author": "P. Stewart"}, {"rating": 5.0, "review": "as advertised, worked right out of the box, easy setupj.", "verified": true, "helpfulness": "0/0", "author": "Daigh Tufts \"Lance Manly\""}, {"rating": 5.0, "review": "Once I conquered opening the battery compartment for the remote (push REALLY, REALLY HARD as you slide it open), I found the Fire Stick to be very easy to hook up and use.  I have a subscription to Amazon Prime and also Netflix, so there's plenty of things for me to watch.  It would be great if I could get all of the apps I have on my Kindle Fire HD.I've been using the Fire Stick almost every day.", "verified": true, "helpfulness": "0/0", "author": "B. C. Horvath \"Tina\""}, {"rating": 2.0, "review": "Does this device work out of US?I have a Prime membership and it does not work in my country.", "verified": false, "helpfulness": "0/1", "author": "Pedrink"}, {"rating": 5.0, "review": "We love the fire stick. We are Prime members and really enjoy all the movies and shows we watch for free. We should have gotten one sooner!! We are recommending this to all of our friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy! I was worried it wasn't gonna be really easy, but it was! Plugged it into the back of my tv, plugged it into the wall, and presto! Was watching netflix in a matter of minutes!", "verified": true, "helpfulness": "0/0", "author": "traceystands"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Joseph J. Gordon"}]