[{"rating": 5.0, "review": "Upon plugging the Fire Stick in, it was immediately clear that this is a far superior product to Chromecast, with extensive app support from the start.  And once you are able to instantly play videos with ASAP, it's really frustrating to go back to Netflix, which often takes 15 seconds or more to load.", "verified": true, "helpfulness": "0/0", "author": "Mitch \"Soli Deo gloria\""}, {"rating": 5.0, "review": "This is a great little device. It'll be even better once the ios app is released. It does everything we need. We used to access Netflix and Prime TV through our Wii, but the battery life of the wiimotes was terrible and we needed to reboot the wii every time we wanted to watch Netflix. We got this, plugged it in, downloaded the Netflix app and we're off and running. We've had only minor buffering issues, not enough to take a star. Overall, very pleased.", "verified": true, "helpfulness": "0/0", "author": "Deborah Estes"}, {"rating": 5.0, "review": "It just arrived, installation was easy can't wait to have time to explore the movies", "verified": true, "helpfulness": "0/0", "author": "Mary B"}, {"rating": 5.0, "review": "Finally I am able to stream Amazon Prime easily to my TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "A. Brown"}, {"rating": 5.0, "review": "Much better than Google Chrome in my opinion and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Chris N."}, {"rating": 5.0, "review": "It is very comparable to the Roku 3 I have for less money and has more content delivered to the user than the chromecast. The only thing that really sets it a part from the others is the android remote app and being able to find content through voice search.", "verified": true, "helpfulness": "0/0", "author": "PWMac"}, {"rating": 5.0, "review": "So nice not to have to hook up the computer to the tv anymore in order to watch Amazon videos!  Remote works great.  Plus we can view our photos from our phones when using the cloud app.", "verified": true, "helpfulness": "0/0", "author": "Zoë \"Zfish\""}, {"rating": 5.0, "review": "the responsiveness is amazing on this. I have two other Rokus but this is now my favorite. the operating system is great and does not have that lag the others do. amazing product, I would get another one if i had another TV.", "verified": true, "helpfulness": "0/0", "author": "Michael G"}, {"rating": 3.0, "review": "The Fire TV Stick is a great product that finally brings Amazon into the same realm as Google's ChromeCast and the Roku Stick.The screens are easy to navigate and it ties in well with Amazon prime content as well as Netflix.It would be a 5/5 stars but there is one flaw. The system seems to have a problem authenticating into a network after a bit of use. It seems to loose the password and says that you \"authentication problems.\"  The only fixes that I've found to date are restarting the system by unplugging it or holding down the select and play button for five seconds to restart it.  I've tried this with three different routers and they all have had the same problems. All my other devices have been fine during the testing.I hope Amazon determines the problem ans issues a patch soon!!!", "verified": true, "helpfulness": "2/2", "author": "Eric/Mira"}, {"rating": 4.0, "review": "Prime will not play on my HD TV. I have an older HDTV and the technology doesn't allow Prime to play on the TV Stick. I am able to use apps such as PLEX, etc. that work fine.", "verified": true, "helpfulness": "0/0", "author": "Dan S."}]