[{"rating": 1.0, "review": "This is the first comment that I have ever left on Amazon after being an active user for many years. I purchased the Fire TV Stick about a month ago and at first I really enjoyed it. After about two days whenever I would watch Netflix my show would stop completely and buffer for about 5 minutes before starting again. It would go back and forth between being HD and pixelated.The next day I tried to watch Netflix the device said that it could not connect to the wifi. That was two weeks ago. I tried unplugging it and plugging it in again, i even left it unplugged for several days. I tried using the extender cord and not even that worked. Today I finally called Amazon and spoke to someone on the tech team. Let me say again that I have never had any issues with Amazon ever but this had to be the worst experience. The tech associate that I spoke to first asked me if I unplugged the device and if I used the extender cord. I told her that I had tried everything manual and that I was well aware that sometimes people overlook the minor details. She then went on to ask me if I could reset my wifi and I told her that the connection on my cell phone and computer worked this fine.The entire time I could hear her flipping through a manual. I then asked her if I could speak with a Fire TV stick specialist and she told me that there was not one and that she was following protocol by asking me all of the questions in order to find out what was wrong. The final thing she asked me is if it were possible for me to unplug all devices in my household that used the wifi so I could allow the Fire TV stick to use the wifi. Extremely frustrated and let down, I told her that I would no longer be of service and that I wanted to return the Fire Stick. I could not believe that these were the questions used to troubleshoot the Fire Device. I will not be exchanging, but returning for a full refund. Another thing about the Fire Stick that I did not understand is that it advertised that you are able to stream HBO GO which is not true. I don't know if there is some sort of update that they do but I don't think they should advertise something that is not even an option yet. It is also advertised that all you need to do is plug it into your HDTV and go. Even the picture shows a woman putting it in her purse. You actually need to plug it into the wall (or power source) and it actually needs to stay here the entire time. I just feel like I was led on a little bit by this device. I mean $39 is a great deal, but I think I'm going to check out the roku or just pick up a blu ray player. Hope you have better luck than I did!", "verified": true, "helpfulness": "1/1", "author": "Meosha"}, {"rating": 5.0, "review": "Love it! Easy to install. Lots to choose from. Just wish we could get Acorn.", "verified": true, "helpfulness": "0/0", "author": "Sharonlea"}, {"rating": 5.0, "review": "But where is Comcast and HBO Go? Get with the program...pun intended.", "verified": true, "helpfulness": "0/0", "author": "George P."}, {"rating": 5.0, "review": "Great product.  Let me watch my some espn without having a cable plan. Top notch.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 1.0, "review": "I love the results of the Fire TV Stick; however, and this is a big however, I live where there is only satellite internet service. If you only have satellite internet, I would not recommend this product for you. It eats through my monthly allowance like the Cookie Monster goes through a box of cookies. I was streaming from Amazon.com through my computer to my TV before purchasing the Fire TV Stick and was using a fraction of the internet bites. If you do have unlimited access to internet, this is a great piece of equipment, but if you are like me and limited, it's not very useful.", "verified": true, "helpfulness": "0/0", "author": "Eliza Jane"}, {"rating": 1.0, "review": "Having nothing but trouble with either the remote or the program in general. Hubby is about to give up on it - it is extremely frustrating.", "verified": true, "helpfulness": "0/0", "author": "Barbara Manter \"~*Snowy*~\""}, {"rating": 5.0, "review": "Great for the price.  Easy to hookup", "verified": true, "helpfulness": "0/0", "author": "Carol Havdouglas"}, {"rating": 4.0, "review": "Great little device. Amazon needs to allow KODI to be ’officially ’ supported on it. Since kodi tripples the usefulness of it. And stop blocking root.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought this in my last US visit and brought it to Brazil... had some problems to download and then, when i contacted the support from AMAZON I receive the following information <Wellington, due to content licensing restrictions, appstore content is not currently available outside US for Fire TV Stick> ... So why there is no such information in the description, and why does Amazon compares to Chromecast saying that this device is better and do not say me that it wont work outside US... well, i also have a chromecast and it works pretty fine in my house. how can i proceed with this useless item now", "verified": true, "helpfulness": "2/2", "author": "Wellington Pereta Tavares"}, {"rating": 5.0, "review": "Simple to set up. Videos load quickly.", "verified": true, "helpfulness": "0/0", "author": "Barbara Elliott"}]