[{"rating": 5.0, "review": "I bought this as a gift for my daughter.  Easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "musicfan"}, {"rating": 4.0, "review": "This TV stick is great and it has meet my expectation so far .but I only find it a bit slow at time,but I think that can be my Internet.", "verified": true, "helpfulness": "0/0", "author": "m rulers"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "jay"}, {"rating": 5.0, "review": "Awesome!  Way better and more cost effective than cable!", "verified": true, "helpfulness": "0/0", "author": "Theodore M Brown"}, {"rating": 5.0, "review": "We're Prime members so we were already reaping the benefits of the Amazon ecosystem.  So for $39.00 this was kind of a no brainer. plug it in, choose the correct input on your tv, sign in and voila! It's really an amazing little streaming device. Oh, you can play games on it too. The interface is bright and very peppy. The Fire Stick arrived 2 days earlier than promised. Amazon keeps doing that!Even if you're not a Prime subscriber (why aren't you already?!) The Fire Stick still offers an impressive lineup apps and feature and of course, video streaming.", "verified": true, "helpfulness": "0/0", "author": "A. J. H."}, {"rating": 4.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "W#A"}, {"rating": 4.0, "review": "Great addition to Prime membership including improved access to Prime Video and added access to Amazon Music Library and Prime Music.  Add ability through app to use your smartphone as a remote and even mirror your smartphone on your HDTV (and associated sound system) and well worth the moderate price.  Only reason not 5 stars? Have needed to reboot the Fire Stick quite a few times to use all features...I'm guessing those bugs will be addressed in software updates.", "verified": true, "helpfulness": "0/0", "author": "James in Folsom"}, {"rating": 5.0, "review": "Excellent but it should have more selection without having to pay $100.00 a year.", "verified": true, "helpfulness": "0/0", "author": "Leonor"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It's not what I expected....", "verified": true, "helpfulness": "0/0", "author": "Evon W."}]