[{"rating": 5.0, "review": "It works as it should. Have not had any issues with it.  Do use the power supply it comes with.  My wife found out using just any usb power brick will not work.", "verified": true, "helpfulness": "0/0", "author": "1compgeek"}, {"rating": 4.0, "review": "Works beautifully. Just as advertised.", "verified": true, "helpfulness": "0/0", "author": "Clifton L."}, {"rating": 5.0, "review": "So much easier than my other streaming device", "verified": true, "helpfulness": "0/0", "author": "Lynne Drury"}, {"rating": 5.0, "review": "So far, so good. Didn't like the service from Roku.", "verified": true, "helpfulness": "0/0", "author": "Peter Reinhart"}, {"rating": 5.0, "review": "Great device! Since I've been using the Amazon fire stick. I have dropped my Showtime and other pay services I've had with U-verse. It's saving me money, and providing me with more movies choices than I have had with the payee movie services like HBO, Showtime, stars, and all the others. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Stanleybear"}, {"rating": 5.0, "review": "Ordered it for my dad and he loves it!", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 2.0, "review": "To use the phone Fire TV app, you need the remote with you.  You can't use the phone Fire TV app by its self.  You need the Fire Stick Remote too?  Why offer an app when I need the remote too?", "verified": true, "helpfulness": "0/0", "author": "Robert Newman \"RN\""}, {"rating": 2.0, "review": "I have enjoyed the product itself. What I did NOT like was being asked during set up if I wanted to try Amazon Prime for free for one month and then finding a $101 charge on my credit card. I was interested in trying the Prime free to see how I liked it in comparison to similar services. Thankfully I was able to end the membership and have my money returned. But this left a bad taste in my mouth and I most likely will go with one of the comparable services.", "verified": true, "helpfulness": "0/1", "author": "MommyDJ"}, {"rating": 5.0, "review": "Love it,quick setup for Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Frank Padilla"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "tery"}]