[{"rating": 2.0, "review": "It's not as good as I thought", "verified": true, "helpfulness": "1/2", "author": "Jonas Estevez"}, {"rating": 4.0, "review": "Did everything it advertised. I am ready to cut the cord!  Only thing I do not like is that if we are supposed to be getting a free month of Amazon Prime WHY do we have to pay for HD on certain episodes?  I probably will not renew the Prime because of this and the fact the selection does not seem very big.The rest is fantastic. Good job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Keith A. Gerlach"}, {"rating": 5.0, "review": "Had a little trouble with the remote at first but great customer service and help me right away. Really enjoying it!!!", "verified": true, "helpfulness": "0/0", "author": "Kelly Shuman"}, {"rating": 4.0, "review": "No one product going be perfect to any consumer needs...for this product the pros outweighs the cons....The only 2 draw backs I have are:1. The fact the audio goes away when watching my prime videos. I have to restart the stick.2. All the amazon videos don't always load fully. And this is so even when  I have a very good wifi signal..Othewise...all the other features the family loves..kids love the games.", "verified": true, "helpfulness": "0/0", "author": "Nicko"}, {"rating": 4.0, "review": "Still trying to learn of its features but am satisfy with it....thank you!", "verified": true, "helpfulness": "0/0", "author": "mary"}, {"rating": 5.0, "review": "I'm really happy with this little stick. I have mostly used it with Plex, Netflix and ESPN, and it has performed well with all 3. It has a well polished UI that is reasonably quick, and at this price it is a strong value.", "verified": true, "helpfulness": "0/0", "author": "Aeschylus"}, {"rating": 5.0, "review": "I did love it. Tanks", "verified": true, "helpfulness": "0/0", "author": "rafael ortiz"}, {"rating": 1.0, "review": "REALLY wanted to love it. I'm an Apple fan, but always look to new tech and gadgets when I can. Apple TV is getting stagnant, with no hopes of new product on the horizon. I got in on the Fire TV Stick for $19, so what'd I have to lose?I was very pleased with the speed of the interface, the intuitiveness of the UI, all the areas where the ATV was lagging. However, my pleasure was quickly snuffed out. The device POPPED a time or two and went to a staticy gray screen, then just as quickly went back to normal. Frequent buffering. Some apps (WatchESPN comes to mind) would turn the screen green, then slowly pixelate back to normal.Called Amazon Customer Service (one driver for my 1-star review) INSISTS on speaking with you in person. Whatever. Went through her obvious scripts, and shocker, they offered to send me a new one. They overnighted it, but I basically had the same issues. The second device locked up more than the first one, however, so I decided I'd had enough.Plugged the 2nd-gen AppleTV in. While it lacks the speed and modern interface, it kills the FireTV Stick in stability. I'll wait for the AppleTV 4.", "verified": true, "helpfulness": "1/2", "author": "FILTHYC"}, {"rating": 5.0, "review": "This is exactly as advertised.  Easy to set up and use.  Definitely would recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "This product is fantastic!  It is extremely fast and scrolling is smooth.  Streaming if fantastic, especially Amazon content.  Searching only searching Amazon content, not the \"apps\" installed like Netflix and Hulu.  If you use Amazon Music and upload pictures to Amazon Cloud, this seamlessly imports everything in.Except...  A button on the remote controls stopped working.  Amazon support has done a great job of taking care of the issue for me and are replacing the entire unit (although it is out of stock and will take about two-weeks to get here).", "verified": true, "helpfulness": "0/0", "author": "NB \"NB\""}]