[{"rating": 5.0, "review": "I use mine a lot. The interface is easier than the one that came with the TV. I might be buying another for the other set I like it so much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Delivered on time and I was skeptical at first but after an easy set up it works great I love it. Great product!", "verified": true, "helpfulness": "0/0", "author": "Timothy"}, {"rating": 1.0, "review": "this is definitely crap. I ordered both the fire stick and the roku stick and the roku stick definitely wins. the fire stick does not have all the apps that the roku does and it doesn't stay charged while being hooked up to the USB charger attached to the tv. the only way it stays charged is if you plug it into an actual wall, w/o doing that it will continue to shut off and reboot itself. I will definitely be sticking with my roku stick :(", "verified": true, "helpfulness": "1/1", "author": "Adrienne stone"}, {"rating": 2.0, "review": "This unit does not work if your wifi requires a web-based login.  It's useless to me.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "Works just like the more expensive Fire TV device, as far as I can tell. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Would never let me into nelfix", "verified": true, "helpfulness": "0/0", "author": "Juan A Barreto"}, {"rating": 4.0, "review": "Very useful tool for getting your movies, from the little screen, to the big screen.", "verified": true, "helpfulness": "0/0", "author": "Bill B"}, {"rating": 5.0, "review": "Love the ease of use. Was using Game system to access Netflix. Fire stick is far superiOr. Being able to view photos on TV was a nice surprise", "verified": true, "helpfulness": "0/0", "author": "Patricia Edick"}, {"rating": 5.0, "review": "It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Marc"}, {"rating": 3.0, "review": "Works great... Except HBO GO. Everything is crystal clear... Showtime Anytime, Netflix, Amazon Prime Video.. all incredible with incredible HD picture. However, HBO GO is like watching a 20 year old VHS tape. It's dull and grainy and the lip syncing is off.. the audio and video don't match. I called in to tech support and they are aware of the issue but it has been two weeks and no change. If you are interested in watching HBO, you might want to buy Chromecast or wait before buying this.", "verified": true, "helpfulness": "0/0", "author": "Ari R."}]