[{"rating": 4.0, "review": "Great to have in any household (with wifi of course). Oddly, the remote stops working from time to time. Weird but I been googling fixes for that.", "verified": true, "helpfulness": "0/0", "author": "Randall Perry"}, {"rating": 4.0, "review": "Easy to set up and works great for Netflix and Amazon. I will update my review when I try more things. Video seems smooth and fast.Although it warned me about non-optimal power, using a TV USB port seems to work fine and doesn't take up an outlet on my power strip.One thing that didn't work is the A&E; App (I wanted to use it for Breaking Bad). I have DirecTV and it appears the App is not supported by DirecTV. Not sure why since HBO go works fine on my other devices. Why DirecTV allows HBO go and not A&E; is beyond me.Edit: Update after a few weeks of use.I had issue with the Firestick not powering up and changed the power from TV USB to the included cube. Minor issue with the cube is power comes out the bottom rather the sides or the top. This makes putting it into an outlet or power strip more complicated than it should be. All my phone chargers and Ipod/Ipad chargers don't interfere with other power cords.After using Netflix a few times and reading forums it appears the Firestick won't remember the Netflix login. Amazon really needs to fix this since it is pretty annoying using a remote to enter a username and password.I am very pleased with the video quality and value. I have an AppleTV on a different television and the Firestick works just as well minus Itunes support.", "verified": true, "helpfulness": "0/0", "author": "mikey"}, {"rating": 4.0, "review": "I love this gadget, but ALL of the remotes are ANNOYINGLY sensitive!!!!!  The hand held inputs too many letters when searching and the phone app purchases instead of moving left or right.  Otherwise it's great!", "verified": true, "helpfulness": "0/0", "author": "JaimieF"}, {"rating": 3.0, "review": "The Fire TV Stick implements Amazon's streaming service with a fairly slick interface and decent remote.  Setup was easy.On the whole, however, the downloadable \"apps\" available for this are pretty lame, and the video quality is only mediocre - I can easily see chromatic/luminance banding in the visual gradients which I know are not artifacts of low internet bandwidth but are a limitation of the video hardware in the stick.Other disappointments are the lack of a separate audio output from the stick, so it can't be used to emulate a television using a computer monitor that has no built-in audio capability.  Integration into a home theatre setup is also hampered by the non-IR wireless remote control, whose codes can't be \"learned\" into a traditional IR-based universal remote.I pre-ordered this, so at nineteen bucks it's not worth returning - but I wouldn't pay much for the functionality.", "verified": true, "helpfulness": "1/1", "author": "S. Hoge"}, {"rating": 5.0, "review": "Great and easy to use", "verified": true, "helpfulness": "0/0", "author": "Chukwuma"}, {"rating": 5.0, "review": "I use it all the time and I am so happy with this purchase. I got it through Amazon Prime for a very low price and it is even better than I thought it would be. Amazon prime has a wide range of videos and you can access all kinds of things including your pictures on Amazon cloud and your music. The music sometimes even has the words to the songs. My boyfriend and I have had makeshift karaoke nights with this feature. You can also access other apps like Netflix. For the price, you can't beat it and it works perfectly well.", "verified": true, "helpfulness": "0/0", "author": "R. Govan \"Neith08\""}, {"rating": 5.0, "review": "Awesome super fast device. Nothing can beat it considering the price factor and performance.ProsBlazing fastBest suitable for Amazon contentNot rooting required. Install Kodi for media server experienceGreat for light weight gamesConsshould have a power off option", "verified": true, "helpfulness": "0/0", "author": "EmmEmm"}, {"rating": 4.0, "review": "Its easy to use, but search function is very poorly designed. Need more improvements. Look for XBMC interface, it is much more easy .", "verified": true, "helpfulness": "0/0", "author": "Pradeep"}, {"rating": 4.0, "review": "Great to have this as an alternative to regular TV", "verified": true, "helpfulness": "0/0", "author": "Terry Jacobs"}, {"rating": 3.0, "review": "This product is amazing with many capabilities however there is one big thing that I would like it to have and this is more of an amazon prime restriction. Amazon prime streaming is not available in Mexico.", "verified": true, "helpfulness": "1/1", "author": "amdi"}]