[{"rating": 4.0, "review": "This is very cool! Had a few issues but turned out to be crummy WiFi.", "verified": true, "helpfulness": "0/0", "author": "Alan Gefvert"}, {"rating": 5.0, "review": "Best thing I ever bought!", "verified": true, "helpfulness": "0/0", "author": "Vyoncia"}, {"rating": 5.0, "review": "Works very well. Make sure you have fast enough service.", "verified": true, "helpfulness": "0/1", "author": "Bruce E Walker"}, {"rating": 3.0, "review": "Works great for Netflix and Amazon Prime, but apparently my cable provider, Charter, is not a participating provider and I can't use HBO GO or Showtime apps. Was very disappointed because that was one of the things I really wanted this for. Will have to go with a Roku instead.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/1", "author": "Cameron Hensley"}, {"rating": 4.0, "review": "Seems to work well thus far.  The video does tend to freeze from time to time for a few seconds, but that could be my internet connection.  Picture quality is great.  I've used Roku players for several years and I'm used to those menus.  The menus on the Fire Stick are different and took some getting used to, but I had it all figured out after a couple of uses.", "verified": true, "helpfulness": "0/0", "author": "BAP \"BP\""}, {"rating": 5.0, "review": "My sister had talked me into the fire tv stick because it has lots of features of movies and games etc, but when I received my fire tv stick package and set it up I was like OMG! this is nice my little sister was right about the fire stick. I can add apps play games watch movies listen to music and so I just enjoy it very much. I give five stars of this item GREAT BUY FOR MY MONEY!", "verified": true, "helpfulness": "0/0", "author": "Keith Johnson \"Livon\""}, {"rating": 5.0, "review": "Item is as described and delivered promptly", "verified": true, "helpfulness": "0/0", "author": "FlaMes"}, {"rating": 5.0, "review": "Works just as expected", "verified": true, "helpfulness": "0/1", "author": "Penny Sager-Rossi"}, {"rating": 1.0, "review": "No, I would not recommend this to anyone else!", "verified": true, "helpfulness": "0/1", "author": "Pooh32 \"Pooh32\""}]