[{"rating": 3.0, "review": "Quick breakdown:Great functionality! TV, Netfilx, Prime, Etc. are all easy to access. Using your phone as a backup when you loose the small remote in you bed is perfect when you want to be lazy!Wifi, Wifi, Wifi!!! If you have spotty wifi or too many people on your network, be warned. You will have to pause and hope for a better connection often. Sometimes, I give up and switch to my laptop because I get sick of waiting! I hope this can be fixed by updates in the future.", "verified": true, "helpfulness": "0/0", "author": "olpmcg"}, {"rating": 1.0, "review": "Got the device.  Followed instructions.  Seemed easy enough.  Wouldn't connect to any of the apps.  For example accessing my Netflix account.  I tried other apps.  It wouldn't connect.  Checked the connection.  Installed updates (so at least I know for sure it was connected to the internet) Still wouldn't connect.  Shows up in home network. But still won't do its only job which is to connect to the apps.  I must admit I am used to apple products which work out of the box.  My Apple TV took me less then 5 minutes to set up.  But even though Apple products are idiot proof I consider myself fully capable of manipulating electronic devices.  I have been working on this on and off for 2 hours.  So now what are my options?  Call support and waist another hour of my life?  No thanks,  I've wasted enough time.  Just got done ordering the Chrome Cast Which is what I should have done in the first place.", "verified": true, "helpfulness": "0/1", "author": "Chihuahua"}, {"rating": 2.0, "review": "I have a Roku, a Chromecast, and now the Fire Stick. Thankfully I picked it up during the 2 day sale otherwise I'd be upset. So what I like... It comes with everything think need. The stick, remote, batteries for the remote, power cord and adapter, and an HDMI extension cord. I like the remote design too, very nice in an elegant sort of way. What I don't like, the deal killer for me, was the fact that I have to pay $5 for the Plex app. I pay for the monthly service with Plex. The app on my Roku was free. The app on my phone was free, the app on my Smart TV was free. Why do I have to pay for the app here (especially when I already pay for the service)?", "verified": true, "helpfulness": "0/2", "author": "Jayms M"}, {"rating": 5.0, "review": "Better than Google Chromecast. Flawless. If you are a Prime member, this is a must-have.", "verified": true, "helpfulness": "0/0", "author": "#bergerlish \"#bergerlish\""}, {"rating": 5.0, "review": "Put it in the boys room, they are 9 and 12. They are assigned to go in to my watch list only to view anything I put in there (science, funnies, cartoons, history, etc). When I hear other stuff going on the stick gets taken for the day. It's very easy for them use... and YEP! I would recommend to to friends and family!", "verified": true, "helpfulness": "0/0", "author": "JnzWorld"}, {"rating": 5.0, "review": "Better than the Chromecast if you want to stream directly from Netflix, Amazon etc. without having to mirror from a smart device.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "Pretty good so far.  Wish Prime could handle multiple accounts within a household like Netflix does.  Also, the volume level output seems a tad high, but that's not a big deal.  Interface is rather well done.  And having a remote IS REALLY NICE, it's the one big thing over the Chromecast.  But I like that for other reasons.  Each has their strong points.", "verified": true, "helpfulness": "0/0", "author": "Bob Smithers"}, {"rating": 5.0, "review": "Wish I could have bought 2 while it was on 1/2 price. I need another one!!", "verified": false, "helpfulness": "0/0", "author": "Sherri"}, {"rating": 1.0, "review": "Nothing is happening. Checked connection, batteries...nothing.", "verified": true, "helpfulness": "0/4", "author": "Jean Conlon"}, {"rating": 4.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "James"}]