[{"rating": 4.0, "review": "A great little stick. Really love using it. Just wish the connection speeds were quicker with Plex and the UI was more straight forward or customizable.", "verified": true, "helpfulness": "0/0", "author": "Lloyd"}, {"rating": 5.0, "review": "Great products!!", "verified": false, "helpfulness": "0/0", "author": "Jason Oglesbee"}, {"rating": 4.0, "review": "I waited too long to buy something like this.  Setup was a breeze, streaming via wifi is not an issue.  Only thing you may notice once in a while is a small glitch during play time as wifi cant keep up.I would give it five stars if they figured out a way to enter in key inputs.  They try to resolve this using voice command but having a separate room should have some better efficiencies.  To visualize, an on screen keyboard comes up and you have to use left, right, up, down buttons on the remote to do a basic search or entering in your network details.", "verified": true, "helpfulness": "0/0", "author": "Kevin Huen"}, {"rating": 5.0, "review": "I got this during the pre-order phase when it was available to Prime members for $19.99.  I probably wouldn't have gotten it otherwise, but it seems like a great device so far.  We have a Roku running on another TV and it does much the same thing.  I would say that the Fire Stick is not as user friendly a menu experience as Roku but the Fire's big advantage is the huge game library by comparison.  I know that my daughter (age 6) is going to love that and I like that the games aren't $50 a piece or something ridiculous like coming from an X-Box.", "verified": true, "helpfulness": "0/0", "author": "Fred Ramey"}, {"rating": 3.0, "review": "I love the device but i cant connect to my satellite provider because it's not on the list", "verified": true, "helpfulness": "0/0", "author": "m hawkins"}, {"rating": 2.0, "review": "Not being able to play prime movies is very disappointing.", "verified": true, "helpfulness": "0/0", "author": "marc holder"}, {"rating": 1.0, "review": "After waiting 6 months to get this junk I went to hook it up.  According to amazon it was a 5 minute job.  Now after being on the phone with tech support for a hour  I realized it was the old bait and switch  from Amazon again.  I hooked it up and had a picture within 5 minutes ,,,, BUT  no sound.  I tried evenything still no sound. So dummy me got on the phone with tech support at amazon and after hour  still no sound.  Seems that since  I have  7.1 sound  sound  the stick will not work.  I have to buy the 100 dollar box.  I wouldn't mind  the extra cost but how many people own a home theater system that this is made not to work on.  Nothing  on the page it is sold on says anything  about not working on a home theater system.  I remember the good old days and then we would call this the  good old  \"bait  and switch\"  Amazon you are getting way to big and now you are treating your customers like  Walmart.  Shame on you .", "verified": true, "helpfulness": "1/5", "author": "Seth or Sandi"}, {"rating": 5.0, "review": "Great way to watch amazon prime", "verified": true, "helpfulness": "0/0", "author": "Donna Lange"}, {"rating": 4.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "Jim Cheal"}, {"rating": 5.0, "review": "Quick and easy set-up. Little to no buffering. Good price. Convenient remote.", "verified": true, "helpfulness": "0/0", "author": "Devon Johnson Creamer"}]