[{"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "Very easy to use, my 6 year old loves it and has had no problem figuring it out. Very quick setup.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 1.0, "review": "Very Disappointed.  I love Amazon and I am a prime member so I figured this was an obvious buy.  Most of the apps on the stick would not work.  I called Customer Service who told me they reset it and those apps would work when I got home.  They didn't.  Then I called again and they told me the fire stick is not compatible with many of the apps.  I got so frustrated I'm just sending it back.  I have Roku and I love it!  I'm returning the Amazon Fire Stick.  I still love Amazon, but they need to fix some things on this device.", "verified": true, "helpfulness": "0/0", "author": "Meredith Mclamb"}, {"rating": 5.0, "review": "It's a very good item", "verified": true, "helpfulness": "0/0", "author": "shawn"}, {"rating": 5.0, "review": "It's womderful ! I'm able to watch Nerflix & Amazon prime movies . Order movies for movie night. Catch up on television shows. Will learn how to use other applications .", "verified": true, "helpfulness": "0/0", "author": "Tangra"}, {"rating": 4.0, "review": "I like it.My negatives are based on the installation and setup process.  It's not user friendlyThings I suggest:.Warn people about the fact that a USB port and a HDMI port look very similar.  Tell them to consult their TV product manual to determine where the HDMI ports are..Make the *(^)%^$&^ remote easier to open to put batteries in.  I had to get on to the amazon devicesupport web page and request a call before I figured out that the battery cover doesn't slide open, you have to \"pop\" it open.  I have arthritis so I had to get a screwdriver to open it.Also it would be easier if the user could search for titles instead of having to browse which can take forever.  If the search feature is there I haven't been able to find it.", "verified": true, "helpfulness": "0/0", "author": "Emily Skurka"}, {"rating": 3.0, "review": "SO FAR SO GOOD", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "Love it! It's faster than Roku and customizable.", "verified": true, "helpfulness": "0/0", "author": "Jorge O Rodriguez"}, {"rating": 5.0, "review": "Works great! I finally cut the cable and, with Sling TV, can still watch just about everything I every watched.", "verified": true, "helpfulness": "0/0", "author": "Bradley M Powell"}, {"rating": 1.0, "review": "Firestick worked fine for about a week.  Now, it will no longer connect to my network.", "verified": true, "helpfulness": "0/0", "author": "Gregg Klein"}]