[{"rating": 2.0, "review": "Wasn't impressed. Firestick didn't perform how I anticipated it would.", "verified": true, "helpfulness": "0/0", "author": "thebottomdollarbiz"}, {"rating": 4.0, "review": "Only problem I have so far is the Streaming part of it take too long and very slow sometime just hung in process.", "verified": true, "helpfulness": "0/0", "author": "Fatai Asubiaro"}, {"rating": 4.0, "review": "Not enough info on how to install, but once done it's great.", "verified": true, "helpfulness": "0/0", "author": "Ronald Koffman"}, {"rating": 5.0, "review": "FANTASTIC!!  We love it!", "verified": true, "helpfulness": "0/0", "author": "n. wat"}, {"rating": 5.0, "review": "Excellent, we are really enjoying it!  Would recommend it to anyone and have already.", "verified": true, "helpfulness": "1/1", "author": "Connie Smith"}, {"rating": 5.0, "review": "This is a very convenient way to access Prime. I had been using my laptop through a USB-HDMI conversion cable and was fine but this is just so easy. Simple to set up and works great. Nice to be able to access all my home-made videos and pictures too!!", "verified": true, "helpfulness": "1/1", "author": "paul92107 \"paul92107\""}, {"rating": 3.0, "review": "I expected more to be included with subscription.  for instance you only get one game of You Don't Know Jack for free and then you have to buy, etc.", "verified": true, "helpfulness": "0/0", "author": "joycelanyon"}, {"rating": 5.0, "review": "Arrived as indicated. Works very well. Look forward to more selections on Prime.", "verified": true, "helpfulness": "0/0", "author": "Phillip Berg"}, {"rating": 4.0, "review": "I use the Fire TV Stick in my work with senior citizens. The fast access to movies, music, and games makes it a perfect option when we need to fill free time. The music almost always has words with it too, and that is wonderful for some of the residents who are a little forgetful. All in all, more senior friendly programming would be wonderful, but this device meets more than enough of the entertainment needs for our residents and that is what is important!", "verified": true, "helpfulness": "0/0", "author": "Allie W."}, {"rating": 3.0, "review": "Really only oriented towards Amazon Prime.Which actually was the reason I bought it. So it works out good.", "verified": true, "helpfulness": "0/0", "author": "RAS"}]