[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Vanessa Rosa"}, {"rating": 5.0, "review": "We enjoy this immensely. We used it to replace our PS3 which is having some fits. I didn't want to buy a new PS, but I wanted to watch amazon and netflix. We've taken it on vacation and it is super inexpensive! It gets hot and will stop working if you leave it in the tv. I recommend taking it out when not in use.", "verified": true, "helpfulness": "0/1", "author": "M. Link"}, {"rating": 4.0, "review": "Set up was easy and it's really easy to use.  Love it!", "verified": true, "helpfulness": "0/1", "author": "Kathleen Tettam"}, {"rating": 4.0, "review": "Setup worked fine, content is a little too old for me", "verified": true, "helpfulness": "0/2", "author": "Jeffrey A. Bogue"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Floyd Elbin"}, {"rating": 3.0, "review": "It would be better if Dish Network was part of Starz Play and Encore!! Plus the activation site for A&E; doesn't work. C'mon amazon and apps...put all the providers on the lists!!!", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent, especially for the kids.  I received everything that was advertised and more.  Well worth the money that was paid.", "verified": true, "helpfulness": "0/1", "author": "MARCELYN LLOYD"}, {"rating": 1.0, "review": "ANybody giving this product more than 1 star rating must have it installed right nest to their WiFi unit.  Mine is upstairs right above it and keeps kicking off and losing the network.  Have a Chromecast on same TV works fine, actually a smart DVD player same TV and works fine.  What good is this product if it can't get Internet?  Worthless...", "verified": true, "helpfulness": "0/1", "author": "Troy Wall"}, {"rating": 1.0, "review": "It produces excellent images, but it does not allow me to watch most of what I had hoped to see.  Although I have Amazon Prime, that promises lots of \"free\" programming, it does not work.  Both Prime and the Fire Stick are worth very little.", "verified": true, "helpfulness": "0/1", "author": "FrPaul"}, {"rating": 2.0, "review": "My Fire TV Stick is buffering not for a second 15 or 20 minutes a day.  If not that it freezes alot.", "verified": true, "helpfulness": "0/1", "author": "Elizabeth  Garrett"}]