[{"rating": 2.0, "review": "Plugged in, worked great!  I was just fairly disappointed in what it was capable of doing.  It also was not as 'fast' as it was advertised.  I have never had to worry with a scene lagging with my smart tv but with this I did.  Not satisfied.  Sent it back.", "verified": true, "helpfulness": "0/0", "author": "ben sweeton"}, {"rating": 2.0, "review": "I paid $20 for this when it was on sale at Best Buy. It streams Prime video finr but other services like Netflix and Hulu (especially Hulu) have consistent issues with video freezing. If I didn't have a Chromecast I'd be really frustrated but I bought this primarily to get prime video to my television and it does that well enough. So for twenty bucks it's okay.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 1.0, "review": "Froze on Netflix and never watched a full show. Must have USB input on tv, not just hdmi port.", "verified": true, "helpfulness": "0/0", "author": "Emilia N."}, {"rating": 5.0, "review": "Excellent piece of technology. Boom, you're on. Boom, you're where you want go. And boom, you're enjoying your choice.", "verified": true, "helpfulness": "0/0", "author": "Michael M"}, {"rating": 5.0, "review": "Great way to stream music movies photos and and TV shows. It's quick fun and easy to set up. I never answer the request to rate products but this Fire stick is so great I thought I should share 👍🏾", "verified": true, "helpfulness": "0/0", "author": "carly"}, {"rating": 5.0, "review": "I love my fire stick it is amazing!!!!", "verified": true, "helpfulness": "0/0", "author": "Tiara"}, {"rating": 5.0, "review": "I had some trouble connecting to my two televisions, but called Amazon and the gentleman knew what I needed, added the Cooligg 3-in 1-out HDMI HD auto switch splitter cable to my cart and it works just fine now and at a press of a button on the splitter cable, I can switch between cable TV and Fire TV.I absolutely love Fire TV Stick!  I love the old shows, like My Favorite Martian, Green Acres, and Petticoat Junction.  Shows I grew up on and now I can watch them anytime I want to.The picture quality is excellent also and the sound good.  Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Patty\""}, {"rating": 5.0, "review": "Love it. Fast shipping & I truly love it!", "verified": true, "helpfulness": "0/0", "author": "shellfish"}, {"rating": 5.0, "review": "Had Probs in the start But works GREAT!!!", "verified": true, "helpfulness": "0/0", "author": "MWhitetree"}, {"rating": 3.0, "review": "Constantly losing connection or having trouble playing titles on HULU and Netflix. Meanwhile, I can go in my livingroom and these streaming services will work fine on my Xbox.", "verified": true, "helpfulness": "0/0", "author": "Melissa M. Holt"}]