[{"rating": 5.0, "review": "It was a gift", "verified": true, "helpfulness": "0/1", "author": "janis bailey"}, {"rating": 5.0, "review": "I have two of these.  They work great! So much better than trying to stream from a laptop to the tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device; love it", "verified": true, "helpfulness": "0/0", "author": "Deborah Kinslow"}, {"rating": 4.0, "review": "works great, love having the remote. Super anoying to use if you lose the remote.", "verified": true, "helpfulness": "0/0", "author": "Hunter Smith"}, {"rating": 5.0, "review": "Wow This little thing is great. streams great shows. no more running an hdmi cord from my pc to tv. i can move it easily to any tv in the house.", "verified": true, "helpfulness": "0/0", "author": "M. Smith"}, {"rating": 5.0, "review": "Nothing better than the Fire Tv Stick", "verified": true, "helpfulness": "0/0", "author": "Stephanie M. Jones"}, {"rating": 4.0, "review": "Great product! Bought to replace a secondary cable box that was costing me $10 monthly. Very responsive with very little lag on most applications I have installed. Overall quite pleased with the product and would recommend, especially for purchasers who already have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Wayne Miller"}, {"rating": 3.0, "review": "Easy to connect. However when I moved it away from the modem (20 feet), the signal dropped. I have high speed FIOS and this shouldn't happen. The door to the other was open and it had a difficult time buffering. I was disappointed because I was thinking of getting another stick for the other room.  Now, I won't need to do this. I have to keep it near the modem.", "verified": true, "helpfulness": "0/0", "author": "n.e."}, {"rating": 5.0, "review": "Absolutely love my fire stick tv. I don't sub to cable anymore.", "verified": true, "helpfulness": "0/0", "author": "JAINA BORROMEO"}, {"rating": 5.0, "review": "Easy set up and a great way to add Amazon, Netflix and more to any tv with a HDMI port. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Mark H Schickman"}]