[{"rating": 4.0, "review": "control is easy to use - I only wish it worked for Plex, I love this thing though - nice to be able to view all Amazon Prime, Netflix (and other) programming all in one spot", "verified": true, "helpfulness": "0/0", "author": "Wilcox"}, {"rating": 5.0, "review": "Have used it less than a week and performance is flawless. Menus need polishing but great for a start.", "verified": true, "helpfulness": "0/0", "author": "John B \"Lincoln John\""}, {"rating": 5.0, "review": "Very nice for the money and I am sure I will get much use out of it. I think this will be good for me and the wife when she says nothing is on, oh yes their is.", "verified": true, "helpfulness": "0/0", "author": "J. Throop"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "mpageorgia"}, {"rating": 4.0, "review": "Works well! Bought it mainly for screen mirroring. Wish there was a faster/better way to screen mirror.", "verified": true, "helpfulness": "0/0", "author": "RuviRev"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Mario Castro-Adorno"}, {"rating": 4.0, "review": "Very easy to set up and so far it works really well.", "verified": true, "helpfulness": "0/0", "author": "PGB059"}, {"rating": 5.0, "review": "Work great, even a little better than ROKU, I will need to get use to the format. Like the small remote.", "verified": true, "helpfulness": "0/0", "author": "holly dominguez"}, {"rating": 4.0, "review": "Haven't used them yet.  Christmas gifts.  But  i think the access will be perfect for the equipment the recipients have.", "verified": true, "helpfulness": "0/1", "author": "Barefootdog"}, {"rating": 4.0, "review": "Well it's very inexpensive and matches much of what my Roku 3 will do with the added benefit of apps like XBMC which very few options support.The downside is the UI is a mess. Amazon has mixed all their content in a main menu while everything else is nicely packaged into discrete apps. I know it sounds weird but it actually feels harder to use when Amazon content is jumbled like this. I wish Amazon would put their stuff in a Amazon app because right now I feel this is too confusing to gift to Mom or other less technical people. So far Roku is the better interface even if you watch Amazon content.", "verified": true, "helpfulness": "0/0", "author": "John D. Biggs \"tech guru\""}]