[{"rating": 4.0, "review": "Much easier set up than the Chromecast stick.", "verified": true, "helpfulness": "0/0", "author": "mjn"}, {"rating": 5.0, "review": "Very simple setup and to use.  Excellent Wi-Fi reception and simple to utilize.", "verified": true, "helpfulness": "0/0", "author": "Michael H"}, {"rating": 5.0, "review": "Easy to setup and to use.  Still trying to discover all the content.", "verified": true, "helpfulness": "0/0", "author": "Ceasar A"}, {"rating": 5.0, "review": "A bit time consuming to set up other then that works great so far", "verified": true, "helpfulness": "0/0", "author": "janet"}, {"rating": 5.0, "review": "I love it. It works just like they said it would. I've ordered another one.", "verified": true, "helpfulness": "0/0", "author": "delaine"}, {"rating": 3.0, "review": "I wish the home screen were more customizable. I have to navigate to all of my apps each time, when I wish they'd just be right up on my home screen. Also bummed about not having an HBO GO app, but I know that's a Comcast thing, not an Amazon thing.", "verified": true, "helpfulness": "0/0", "author": "Paola M. Moll"}, {"rating": 5.0, "review": "My cable company shut me off and I wanted a better solution.  I tried the Google Chromecast, but didn't like it.  I ordered the Amazon Fire TV Stick and it's been great!!  I get to watch my favorite shows in HD and listen to music for a fraction of what I paid for cable!!!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Brown"}, {"rating": 5.0, "review": "This is a wonderful device.  I love voice detach and it really does work. It streams movies and tv shows very fast I have had problems with other streaming boxes buffering the problem disappeared with the fire tv plus I also bought the game controller and the grandkids love that they can play some of the games from their kindle fire on the big screen.  I highly recommend and I will be buying more for gifts", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love how easy it was to setup and access.  I especially love the android app that allows you to perform a voice search of your favorite shows.", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 5.0, "review": "I Like It So far, Still Figuring It out", "verified": true, "helpfulness": "0/0", "author": "CHERYL CLAYTON"}]