[{"rating": 5.0, "review": "It works great.  Now someone should invent an easy way to add an hdmi outlet to older sets so I could watch it on my older plasma tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loved Amazon Prime video before  -  now love it even more", "verified": true, "helpfulness": "0/0", "author": "Rich Grove"}, {"rating": 5.0, "review": "AWESOME, I love it!", "verified": true, "helpfulness": "0/0", "author": "Anthony D."}, {"rating": 5.0, "review": "Yes yes the best need one more", "verified": true, "helpfulness": "0/0", "author": "timmy \"timmy warren\""}, {"rating": 5.0, "review": "Wonderfully easy to use. The recent apps screen makes navigation a breeze could not be more happy with the Amazon Fire Stick.  I have had a smart tv Blu Ray player that I had been using to get to Netflix Amazon Prime and YouTube but it stopped working after about a year and a half. It was slow and unreliable. Amazon Fire Stick is fast, navigation is easy, and the picture is great", "verified": true, "helpfulness": "0/0", "author": "Patrick Runyan"}, {"rating": 3.0, "review": "Easy to set up, easy to use, but stop to \"load\" ALOT!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Garrett"}, {"rating": 3.0, "review": "needs more entertainment apps and better use of the home screen. It is great that they show all of my amazon prime stuff but what if I wanted to add a different service. Also when scrolling into a menu, there is no need to single out that row of apps. Otherwise, it loads fast and that is great", "verified": true, "helpfulness": "0/0", "author": "NickWizz"}, {"rating": 5.0, "review": "Easy set up, tons of shows and movies", "verified": true, "helpfulness": "0/0", "author": "Becky Saucerman"}, {"rating": 1.0, "review": "The number of apps is dismal. Roku is better if you R already a member of Netflix. If you don't have HBO or Netflix, Amazon Prime will get you partial seasons of HBO original series but if you are already a HBO subscriber, HBO Go app not available to try & get u to subscribe to Amazon Prime. Plus the Stick must be plugged in to a power cord.", "verified": true, "helpfulness": "0/0", "author": "Nokautu"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]