[{"rating": 5.0, "review": "I am loving the Fire stick. No need for high cable bills again! I really like how I was able to download the app on my phone to use as remote! Great invention!", "verified": true, "helpfulness": "0/0", "author": "Bobbie Scowden"}, {"rating": 3.0, "review": "I'm a Amazon Prime member but none of the features (besides free 2 day shipping) works for me.", "verified": false, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 5.0, "review": "Loving it so far.  Actually, I don't get as much opportunity to use it as I would like.  My daughters use it constantly.  Only complaint is the wiring - kind of bush league and spaghetti-like.", "verified": true, "helpfulness": "0/0", "author": "Chris Kaufman"}, {"rating": 5.0, "review": "I am a fan of the Fire stick. No problems at all.", "verified": true, "helpfulness": "0/0", "author": "barbara"}, {"rating": 5.0, "review": "Great little stick for Nextflix, Hulu, Prime Movies.  Wish the Prime Music worked better.", "verified": true, "helpfulness": "0/0", "author": "Anthony B."}, {"rating": 4.0, "review": "We have an older Roku & had been using that box to watch Amazon content previously.  When the Fire TV Stick was announced, I was offered it at a reduced price because of my Prime Membership.  Received it two days later & had it set up in a very short time.  I love it for the ease of navigation, much easier than our older Roku's menu/navigation (and WAY better than our Sony blu-ray dvd player's navigation).  The Fire Stick is a little buggy still and sometimes I have to reset it (ie unplug it from the tv & the wall, then plug it back in again and restart), but for the cost, I can live with that little inconvenience once in awhile.  I imagine that there will be a software update that can fix the errors I've seen, so I'll be patient & look for that soon.  Overall, love it!", "verified": true, "helpfulness": "0/0", "author": "Crue2001 \"Crue2001\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Casey Tanner"}, {"rating": 2.0, "review": "Does not support AirPlay for other than Android products", "verified": true, "helpfulness": "0/2", "author": "Saad"}, {"rating": 5.0, "review": "Work great for streaming Netflix, Hulu.  Remote control makes it way better than Chomecast", "verified": true, "helpfulness": "0/0", "author": "HTran \"HTranMD\""}, {"rating": 5.0, "review": "Best money I have spent this year.  The Fire TV Stick is way better than Chromcast.  Good job \"Amazon\"", "verified": true, "helpfulness": "0/0", "author": "steve mccord"}]