[{"rating": 4.0, "review": "I like it, but some apps do not work right. Maybe an update will fix this, but for now 4 stars.", "verified": true, "helpfulness": "0/0", "author": "B. Franks \"beansfranks\""}, {"rating": 5.0, "review": "Everything I expected", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 3.0, "review": "I really don't like the way it handles but it is nice viewing Netflix and Amazon instant video on tv", "verified": true, "helpfulness": "0/0", "author": "Hanz"}, {"rating": 4.0, "review": "Fire Stick does a great job how I expected it to perform for Plex, Netflix, and Hulu. However, it does not support some audio modes for Plex (AAC 5.1). Also, the main reason for 4 out of 5 stars is that it sticks Amazon Prime videos down your throat. I don't want or have Amazon Prime so give me an option to hide or re-arrange my menu and it would be all good. The way it is, I have to click too many times to get through the Prime clutter to get to my apps that I want to use.", "verified": true, "helpfulness": "2/2", "author": "Mathias"}, {"rating": 5.0, "review": "Install was painless, super happy with it so far.", "verified": true, "helpfulness": "1/1", "author": "Lisa Weisensale"}, {"rating": 4.0, "review": "Nice to have but it wasn't as easy as it says to install it!", "verified": true, "helpfulness": "0/0", "author": "L. Allen \"LMA\""}, {"rating": 5.0, "review": "Brought for a second tv in house and works great.", "verified": true, "helpfulness": "1/1", "author": "Amy J. Castillo \"Doxie Lover\""}, {"rating": 5.0, "review": "I was very pleasantly surprized at the ease of installation and then of watching what I want to.  As a prime member I get so many options to warch.", "verified": true, "helpfulness": "1/1", "author": "Denise"}, {"rating": 1.0, "review": "I bought one for myself and one for my parents, since we both love our Roku's and wanted a second one for the bedroom tv. What a mistake! It constantly loses internet connectivity (I do have it plugged in to power as it recommends) and buffers for five minutes then plays for 1. I'd blame my internet, except said Roku works fine. What a disappointment.", "verified": true, "helpfulness": "2/2", "author": "L.Willson"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "HollySue Phillips"}]