[{"rating": 4.0, "review": "Works great needs a volume control on the remote. This is a great little device for the less savy or someone who wants to have a secondary remote. The interface is nice and smooth. The stick requires the use of an outlet to plug the USB cable into if you use the USB port on the TV it says that there isn't enough power. Has some great apps and it is awesome that you can use the any apps you have on the amazon app store.", "verified": true, "helpfulness": "0/0", "author": "good game fun"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Bobby D Ephram"}, {"rating": 4.0, "review": "It glitches sometimes and doesn't pick up the Wi-Fi. Otherwise it is fine.", "verified": true, "helpfulness": "0/0", "author": "Evadne Slaughter"}, {"rating": 4.0, "review": "It's taken a bit to learn how to use it, but we are enjoying the flexibility of watching what we want, when we want", "verified": true, "helpfulness": "0/0", "author": "Mary Wilkinson"}, {"rating": 5.0, "review": "Easy to set up.  Great HD picture.", "verified": true, "helpfulness": "0/0", "author": "NASVA"}, {"rating": 5.0, "review": "Love the fire tv stick!! Works great, had it for a few weeks, still getting the feel for it and exploring all the apps.", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 5.0, "review": "Better than I expected. Easy to set up. Reception from my wifi is outstanding, no buffering. Sound quality is great. Remote works with no hassels. I have the Fire apt installed on my kindle and cell phone, its a hoot to use the voice commands. Sooo many Prime free movies to watch. Love it!", "verified": true, "helpfulness": "0/0", "author": "William McKenney"}, {"rating": 5.0, "review": "Love it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jodi Bixler"}, {"rating": 5.0, "review": "Excellant!!!  Easy to set up.  Netflix works great.  No problems with buffering.", "verified": true, "helpfulness": "0/0", "author": "Thomas Cubeta"}, {"rating": 5.0, "review": "Just as good as cable to me. Clear movies and shows. Simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cheri"}]