[{"rating": 4.0, "review": "Works good. It has locked up on me couple of times but I'm pretty sure it was because my internet connection was having issues at the time. Does seem to stream rather well. I do get 5.1 out to my Home Theater system. I was told that I probably wouldn't.", "verified": true, "helpfulness": "0/0", "author": "Sundance"}, {"rating": 5.0, "review": "I'm very pleased with my Fire TV Stick.  It has lots of apps available along with the Amazon Prime selections.  It was pre-setup when it arrived so all I had to do was enter my Amazon password and it was ready to go.  You can also download an app for your phone or tablet to use as a controller if you don't want to use the one that it comes with.", "verified": true, "helpfulness": "0/0", "author": "Jason Bachelor"}, {"rating": 2.0, "review": "The Roku is definitely a better product. The menu option is not functional if you use more than just Prime video. the search feature is a joke. Between both my roku and my fire stick, the fire stick lags and has to load constantly and I have never had that issue with my Roku. I definitely plan on sticking to a roku.", "verified": true, "helpfulness": "0/1", "author": "sarah kelly"}, {"rating": 5.0, "review": "Oh my goodness this is the best I love my fire stick this is great I don't even watch my cable in I'm a nexflix customer so I get to watch that in other shows Thank You Amazon great job", "verified": true, "helpfulness": "0/0", "author": "Rose Collins"}, {"rating": 5.0, "review": "i am very happy  with  the  firestick", "verified": true, "helpfulness": "0/0", "author": "joseph rodriguez"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Allyson M Capps"}, {"rating": 1.0, "review": "didn't even connect right out of box when finally got it to it wouldn't hold a connection, and i have the highest internet available.", "verified": true, "helpfulness": "0/1", "author": "k vin"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Gary Thomas"}, {"rating": 5.0, "review": "Easy set up, easy navigation. Great solution to get all the apps you use in one place. I would recommend to a friend!", "verified": true, "helpfulness": "0/0", "author": "shakkira"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Sabrina Hinton"}]