[{"rating": 3.0, "review": "The stick worked well....except I could not get any sound out of it.  Customer service was good as they tried to help me out, replace it and troubleshoot it.  I ended up solving it myself by buying a device to split the sound and video from it directly to my audio receiver instead of the TV.  The cable and extra part set me back $45 but now it works perfectly.  Probably a problem with my TV set up and not the stick itself.  Just be aware it is not always plug and play.", "verified": true, "helpfulness": "0/0", "author": "Ashley A Hall"}, {"rating": 5.0, "review": "Disclaimer: My wife and I have been Prime members for 8 years. She recently signed up for her own separate Prime account because Prime now accounts for 40% plus of her TV viewing, and 80% plus of mine. When coupled with HBO Go and Netflix, I get to watch basically everything I want and have a watchlist that would keep a retired person busy for ages.Saying that, after getting the Fire TV (which we have downstairs) I decided to try the Firestick for my separate viewing. Disclaimer #2 - I bought it when I got the first Prime $19.99 offer.Anyway, Amazon TV has revolutionized my viewing. I have a terribly hectic travel schedule and only know from one week to the next where I'll be or what nights I'll be away. That makes scheduled TV viewing tough. We do have DVR's, but they fill up, especially if, like me, you would have 5 or 6 seasons of 8 or 9 different series still saved up. Having them available on-demand has made a boatload of difference for me.But my favorite thing about the Firestick in particular is its portability. I now take it with me on all my trips, and after working and dinner, can enjoy my on-demand viewing on the hotel TV rather than having to watch on my laptop or tablet. You'd think they'd have their own box tied in, but I've yet to find a hotel, even ones with on-demand services of their own, whose TV's aux ports weren't accessible to me.Even at $39.99, this device is a steal for Prime members. Prime service still gets me things in 2 days, 3 on the outside (and rarely at that) but the media add-ons for us, viewing, music, and other apps, make it one of our very favorite all around things. Thanks, Amazon - I really feel like I'm getting my money's worth.", "verified": true, "helpfulness": "1/1", "author": "AnthonyWrites"}, {"rating": 5.0, "review": "IT GREAT!", "verified": true, "helpfulness": "0/0", "author": "Elinor C. Coover"}, {"rating": 1.0, "review": "It's great for home use, but I bought it because I work out of town and although the hotel WiFi is open it requires a password from the browser that I can't put in anywhere, so it's useless wheni actually need it.", "verified": true, "helpfulness": "0/0", "author": "Christopher Emeott"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "anthony"}, {"rating": 4.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Susan McGaffigan"}, {"rating": 4.0, "review": "I really enjoy this stick. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Khalid"}, {"rating": 5.0, "review": "Best thing close to a full smarttv", "verified": true, "helpfulness": "0/0", "author": "michael kidd"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Buhr"}, {"rating": 1.0, "review": "I didn't buy a fire stick", "verified": true, "helpfulness": "0/2", "author": "David Tatsak"}]