[{"rating": 2.0, "review": "I really liked this device until it randomly stopped working today. No I have no signal and despite resetting, trying a different input/HDMI and various other steps suggested by Amazon's FAQ, I can't get it to work again. I want my money back.", "verified": true, "helpfulness": "0/0", "author": "Alexa Chung"}, {"rating": 5.0, "review": "love you", "verified": true, "helpfulness": "0/1", "author": "goat"}, {"rating": 5.0, "review": "Bought this for my dad.  He loves it.  He can watch hulu, netflix, and amazon.", "verified": true, "helpfulness": "0/0", "author": "N"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Collette Sarro"}, {"rating": 5.0, "review": "This was a great a great buy. For a more in depth review watch this video https://youtu.be/wGKj0xP_AMo", "verified": true, "helpfulness": "0/0", "author": "Nicholas Pettit"}, {"rating": 3.0, "review": "This is a good product for price. My only complaint is contact buffering on Netflix and I gave no 8dea how to turn it off.", "verified": true, "helpfulness": "0/0", "author": "Nicole Wooten"}, {"rating": 3.0, "review": "In short, Chromecast is better. But for Amazon Video this is a must, unfortunately. The main problem is that it doesn't reliably remember the position when paused. If connected via HDMI dongle, low power error comes up. Network connection randomly disappeares. Sound synchronization sometimes is off. Don't go for Sling deal, too.", "verified": true, "helpfulness": "2/2", "author": "E. Damaskine"}, {"rating": 4.0, "review": "Bought to watch the 2015 Women's World Cup on Fox Sports and worth every penny.only 4 stars because none of the product photos show that it requires an ugly external power adapter.", "verified": true, "helpfulness": "2/2", "author": "Robert O'shaughnessy"}, {"rating": 4.0, "review": "Excellent product, easy installation, what I liked most is that it comes a mini cable to connect the TV's USB and comes another big cable power adapter so you have all the accessories, can be the model of my TV I was saying USB adapter that did not have the power needed and recommended me to connect to direct electric current, the purpose was to see netflix and perfect, now the subject of movies, etc., if I recommend having the amazon premium because otherwise noYou will have all the benefits of the device.I give it four stars because I have amazon premium and I can not get the necessary potential, but otherwise everything very well.", "verified": true, "helpfulness": "0/0", "author": "Hry"}, {"rating": 5.0, "review": "Easy set up. Selection of apps OK. However I would like some apps added: Acorn TV, Vutopia,  and TWCTV. Another option s to include link to download some apps.", "verified": true, "helpfulness": "0/0", "author": "Nana Jean 65 years young"}]