[{"rating": 5.0, "review": "I have had no heat issues, easy to use, and has never frozen using over a couple months. Love the parental controls. If I set a pin they can only watch on amazon video what I allowed with pin each individually even if it was free to watch. Would like to see more companies support their apps with this device. I can side load apps from google play or amazon really easy but they only work if the app support remote control use. and I have to go into app settings to launch but it is a work around till more companies move their butts and support. On amazon part I hope they update and allow your phone to be used as a touch screen like a tracking pad and would help get around app incompatibility issues. The phone app is easy to work and do remember that if you use the voice function you have to go in and clear your previous voice history as they store it online. I have not used cloud picture storage yet. But I prefer not to cloud store my pictures any where.", "verified": true, "helpfulness": "0/0", "author": "Jane Doe \"It's ME\""}, {"rating": 5.0, "review": "Really very nice and with Kindle Prime and Tv I have enjoed watching movies.", "verified": true, "helpfulness": "0/0", "author": "Katherine Broussard"}, {"rating": 1.0, "review": "Wasn't picking up our wifi signal", "verified": true, "helpfulness": "0/0", "author": "ShallyPoo"}, {"rating": 4.0, "review": "Set up was easy. Works great.", "verified": true, "helpfulness": "0/0", "author": "James R. Pratt III"}, {"rating": 5.0, "review": "The best device on the market.", "verified": true, "helpfulness": "0/0", "author": "Frantz gilbert"}, {"rating": 5.0, "review": "Great!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "JLA"}, {"rating": 5.0, "review": "Liked the Fire TV so much I ordered this for my 2nd TV, works just as good as the regular Fire TV minus the voice remote", "verified": true, "helpfulness": "0/0", "author": "Bassetbob"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "I wish this device be capable connect to an ad hoc wireless network", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "Very happy!!", "verified": true, "helpfulness": "0/0", "author": "JHANKS"}]