[{"rating": 5.0, "review": "Great product. Hides away in the back of my home audio receiver and gives me quick access to all my favorite apps.  I actually prefer this to my smart tv menu.  It's quick, responsive, intuitive, and sleek.  Amazon is putting a lot of resources into making this a comprehensive media stick and it's paying off.  My only complaint is that the remote feels just slightly cheap, and I really do mean just slightly.  You can feel the seams for the battery port when you pick it up and it's balance is slightly biased toward the bottom.  I'm just really picky about my remotes.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Ryder"}, {"rating": 5.0, "review": "User friendly, fun to use, and endless entertainment! We have downloaded apps, watched movies/tv series, uploaded photos and streamed music. Much better than Apple TV. Plug and play and the best part is we can move it to any of our TV's.", "verified": true, "helpfulness": "0/0", "author": "Jennifer R Parsch"}, {"rating": 5.0, "review": "I love this!  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Andrew Cole"}, {"rating": 4.0, "review": "I find the fire TV stick very useful", "verified": true, "helpfulness": "0/0", "author": "Beverly Bechard"}, {"rating": 5.0, "review": "love it.. love it...love it..", "verified": true, "helpfulness": "0/0", "author": "Lori Bailey"}, {"rating": 2.0, "review": "This thing is awesome when it works, which is about 50% for me. Sometimes it turns on, sometimes it doesn't. Have to unplug from my tv and re plug it back in to get it to work, and that doesn't always help", "verified": true, "helpfulness": "0/0", "author": "Why"}, {"rating": 5.0, "review": "Was easy to set up, great for Netflix,Hulu and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Doris Platt"}, {"rating": 5.0, "review": "Easy to install and use great product", "verified": true, "helpfulness": "0/0", "author": "Jean S Dreyer"}, {"rating": 5.0, "review": "I should have gotten one of these when they first came out.  It is so awesome!  I didn't think the fire tv stick would be as good as the box but seeing as I didn't have $100 to spend on the box, I decided to go ahead and get the stick, knowing I could return it if it didn't work as I expected.Not only did it work as I expected, it exceeded my expectations!  I have watched my Prime movies, listened to my Prime music, played a couple of games on it from my Kindle Fire HDX 7\", and watched Netflix - all without any problems.Installation was easy - Amazon automatically sent me the Fire TV app for my Kindle should I want to use that as well as the remote that comes with it.  I plugged it in to the HDMI port on my TV - turned the tv on, went to the HDMI source and viola!  There it was.  It automatically listed some of the more popular movie apps, Netflix, Hulu, youtube, etc which you just highlighted and clicked to install it.  No problems, no slow-downs, no buffering issues, nothing.  Everything works great.It gives you a search option, it has a home screen, it also has your watchlist along with a number of other options including music and gaming.  There is the ability to do a voice search using your Kindle app as well as an optional remote that has voice search capabilities.  While I think that remote should automatically be sent since the Stick does have that option, I didn't dock a star for it as you can still use voice search with your Kindle.All in all, I'm very glad to have purchased the Stick.  It's well worth the $39.00.", "verified": true, "helpfulness": "0/0", "author": "Jodi Cornelius \"You can never go nowhere cuz when you got there you'd be somewhere\""}, {"rating": 1.0, "review": "Went through three different devices and none of them worked properly. The first one I received would not connect to wifi at all. It detected the signal as \"very good\" but would just not connect. It was very frustrating. I think I typed in my wifi password about 20 times. I had been excited to use this while on my treadmill. After chatting with Amazon customer service they told me it must be a defective device. They sent me a new one and I did get this one to connect and work. After updating itself for about 1 hour (!!!) the thing was good for a couple of minutes! I tested it out by watching a few minutes of Netflix. However when I exited the app, the network connection was lost. Grr. So I tried to reconnect, again to the \"very good\" signal wifi, but it would not authenticate. I tried to connect about 15 times until I finally gave up and turned the thing off. I came back a few days later and what do you know, the Fire Stick actually worked! I watched a few programs on Amazon Instant Video and I was happy with it for about two uses and then it mysteriously lost the connection again and wouldn't authenticate the wifi connection. This is the most frustrating device I've ever encountered. I want to be clear - there is no problem with my wifi signal. My laptop, phone, PS3, XBox, and Wii all connect to it and stream with no problems. I even tried it on different TV's in my house to make sure it wasn't just a weird spot of interference or something.So anyway this replacement device worked for me a total of about 5 times on and off. Sometimes it would connect, most times it would not. I loved the thing when it actually worked! I just wish they would work out the kinks. I got a 2nd replacement device recently after becoming really frustrated about the connection. The next device Amazon sent would not connect to the network at all. So after trying three of these stupid things I decided to just return it and buy a used Wii (about $40) that lets me stream Netflix and Prime Instant Video. The other streaming stick options all seem to have similar problems (from reading reviews of them). The Wii is a lot bulkier but at least I know it works every time and I won't be wondering every time I turn it on if it's going to connect or not. I hope Amazon improves this device's networking capabilities in the future because it really is a great device when it actually works.", "verified": true, "helpfulness": "0/0", "author": "Roonil Wazlib"}]