[{"rating": 5.0, "review": "Works awesome, and easy  to set up and use. I haven't had a problem with it at all. :)", "verified": true, "helpfulness": "1/1", "author": "Joy"}, {"rating": 1.0, "review": "I don't like it at all.  Got my cable back and it sets in my drawer.", "verified": true, "helpfulness": "0/3", "author": "Marsha Harrison"}, {"rating": 1.0, "review": "Plays my Amazon Prime (of course it does so I buy more) and Netflix content like a champ however one of the main reasons I bought this thing is to play Hulu Plus. Either the device itself or the app is completely FUBAR. It continuously buffers and freezes(requiring a hard reboot) thus rendering Hulu Plus unplayable. It is not my router as I have several devices: tablets, phones, Roku 2, PS3 which are all on my wifi that have no issues streaming content whatsoever. All of the device firmware is up to date.I am extremely disappointed with my Amazon FireTV stick and honestly expected more from this product and from Amazon. I may be looking to purchase a Chromecast soon to replace it.", "verified": true, "helpfulness": "0/2", "author": "Christian V."}, {"rating": 5.0, "review": "The fire stick is my 3rd foray into android driven devices.The Apple TV is impractical to travel: long power cord, long hdmi cable ...I tried the chrome stick: good size. Problem, extremely difficult to get online in hotels (always have to call in to register it to the network). Totally unable to work thereafter in hotels that usually practice point of access isolation (normal for privacy).The Roku stick is a step up with its remote. The problem here is that it also doesn't get automatically on the network. Worst: it tries to ping the network (which is totally unnecessary to function properly) and it won't work until you disable that default feature (by calling the Roku customer service team). Having said all this, the remote is literally huge and bloated and won't always connect properly so you have to often unplug the Roku stick and plug it again. Finally, it takes ages for the Roku stick to boot up.The Amazon Fire Stick: perfect in every way. Perfect remote size and weight. Connects automatically to (even) hotel networks. Tells you immediately in case of a rare problem with a trouble shooting info from the get go. Fires up instantly ... I like it so much that it got me wondering about the Fire phone...", "verified": true, "helpfulness": "1/1", "author": "Michael S."}, {"rating": 4.0, "review": "Easy to use and set up (though the battery compartment for the remote could be MUCH easier to open).  Very fast streaming ..... much better than my newer, native Samsung Smart TV.My only issue, which is not the fault of the device, is that Comcast doesn't support HBOGO on amazon Fire. Just another reason to switch to FiOS.Overall, very cool device.", "verified": true, "helpfulness": "0/0", "author": "Lee Reader \"A Resident\""}, {"rating": 5.0, "review": "Love this thing.  It works and gets a lot of little details right:1. There's an app that allows you to enter in your sign in information (e.g. for Netflix) using your phone's keypad - very easy.2. Initially I had a few crashes, but after a recent update, it's been very stable.3. The remote is small and intuitive to use - no complicated buttons to fiddle around for in the dark.4. Navigating around is super fast - for a Prime user, you can easily find all the free content.  Can't imagine a better product for a Prime user.5. I've downloaded a few apps and like the experience - particularly since you can use your phone's touchscreen as a controller.6. No lag - it's quick and seamless.", "verified": true, "helpfulness": "1/1", "author": "Mark"}, {"rating": 5.0, "review": "Works great and its easy to move from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "David Laska"}, {"rating": 4.0, "review": "I love my Fire Stick. Periodically it looses connection to my wifi network, which is the only reason I did not give it a 5 star. To fix, i have to revboot by disconnecting the power. However, when it is connected. It runs like a champ.", "verified": true, "helpfulness": "0/0", "author": "Chris G."}, {"rating": 3.0, "review": "It works fine, but I was extremely disappointed to find out that HBO-Go, which finally became available for the Fire Stick today, cannot be used by customers of Charter Cable (and I believe Comcast as well.) I got my Stick several months ago and have been waiting patiently for the promised HBO-Go app to show up, and lo and behold-- it's useless. I'm sure there's enough blame to go around for both Amazon and Charter, but that still leaves me high and dry. I'm considering buying a Roku stick so I can finally get HBO-Go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I use this in addition to Apple TV.  It's basically the same thing, just Amazon's version.  If you like Apple TV, you'll like Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "floresbp"}]