[{"rating": 4.0, "review": "So far so good. I have a playstation 3 for my livingroom but my bedroom was always lacking. Now with Amazon Fire Stick i'm set. I have only used the Prime features but even that has been awesome because now I am really taking advantage of this yearly membership. Being able to use my kindle fire as well as the provided remote is cool. I will say it was hard to get it to set up on the wireless since the box is in the livingroom. Once I connected it directly to the tv that also had the internet box connected then I retried the tv in the bedroom I haven't had one issue with connectivity. Still very happy I jumped on the deal when I did. Discovering new free to watch tv shows and movies everyday.", "verified": true, "helpfulness": "1/1", "author": "Antlove30"}, {"rating": 5.0, "review": "Finally got my Fire Stick set up. Being a Prime member made the setup easier. I have it set up in the bedroom tv so I can catch some shows before I get to sleep. Have no issues so far with the exception of Hulu still unable to stream over the HDMI cable. Other than that small issue, it works great.Update!: Hulu now works on the Fire Stick. The HDMI extender was the issue. Might want to be something to look into Amazon.", "verified": true, "helpfulness": "0/1", "author": "Domingo Zapata"}, {"rating": 4.0, "review": "Very easy to set up.  Love the simplicity but it packs tons of features.  The reason why I did not gave it a five star rating is due to the fact that you cannot play purchased movies in YouTube.  I purchased The Interview in YouTube but you cannot play it in the Fire TV Stick.  I could play it in my PS3, Smart Blu Ray players that have YouTube app and my PC, but not on the YouTube app in Fire TV stick.  I hope it is just a matter of either a firmware or an app patch/upgrade soon.  Other than that, it works like a charm.", "verified": true, "helpfulness": "0/1", "author": "J. Marfori"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "MARTIN R ALBERS"}, {"rating": 5.0, "review": "I love this product and I enjoy the fact that there are games that my kid can play and I dont have to buy additional equipment.", "verified": true, "helpfulness": "0/0", "author": "Catherine in Largo, FL \"LargoLady\""}, {"rating": 3.0, "review": "Not compatible with the chromebook!  I have to return it!", "verified": true, "helpfulness": "0/0", "author": "barbara e lewis"}, {"rating": 5.0, "review": "Coupled with Amazon Prime is excellent and a must have; greater value and much more convenient than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Brian Englund"}, {"rating": 2.0, "review": "Went to visit my Son and took the stick with me to a Marriott where I was unable to log in on a free wifi service that did not require a log in. My pictures are in the cloud and I pay for prime service what good is a stick if you cant bring it with you on travels?", "verified": true, "helpfulness": "0/1", "author": "Bob"}, {"rating": 3.0, "review": "I got it with the intention of getting amaxon prime too but I thought it would offer more free shows and movies. But the stick it's self isn't bad.", "verified": true, "helpfulness": "0/1", "author": "Chelsea"}, {"rating": 5.0, "review": "I love it! Now I can watch WatchESPN & other shows without the cableTV.", "verified": true, "helpfulness": "0/0", "author": "John Van Ooyen"}]