[{"rating": 5.0, "review": "makes everything so easy,less equipment", "verified": true, "helpfulness": "0/0", "author": "Vina"}, {"rating": 5.0, "review": "I own a few fire TV 's so much better and faster then the competition.", "verified": true, "helpfulness": "0/0", "author": "bobby brown \"bobby\""}, {"rating": 1.0, "review": "I experienced HDMI video issues right out of the box, which requires some fiddling. Software works half the time. Interface freezes way too often. I get booted out of my apps, which I presume means the app has crashed. Very disappointed with this poorly performing Amazon product. I'll have to wait for some sort of software update and hope it gets better. As a point of reference, I also have a 1st Gen Sony Google TV and it is way more responsive... I originally thought this was going to be an upgrade to the GTV, I was WRONG!! Amazon needs to fix this mess.", "verified": true, "helpfulness": "1/2", "author": "Ken"}, {"rating": 3.0, "review": "Glitches  do occur, but works well most of the time.  Acts up when trying to go thru menus and sometimes fast forwards during tv shows and movies. Maybe it needs upgrading, if possible, please try to fix these problems.  Would make the entire experience a great one. Even as it is it is well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Georgia Sinclair"}, {"rating": 5.0, "review": "AWESOME 🙆!!!", "verified": true, "helpfulness": "0/0", "author": "Chris Murray"}, {"rating": 5.0, "review": "Love watching a few different series that were previously on HBO.  This is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "littlefoot"}, {"rating": 1.0, "review": "Awful device that hardly ever works right. The remote either does not change anything or takes on a life of its own. The HDMI connectors fit poorly, and in the end, Amazon Prime offers no movies that are of quality. Returning it today.", "verified": true, "helpfulness": "0/0", "author": "Manfred"}, {"rating": 5.0, "review": "Works great! Very easy", "verified": true, "helpfulness": "0/0", "author": "lisa niemeyer"}, {"rating": 5.0, "review": "Really easy to install. I love the choices!", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 5.0, "review": "Greatest", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]