[{"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "Best thing ever! Cancel cable, Netflix, going to redbox and the movies", "verified": true, "helpfulness": "0/0", "author": "kaitlin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Angela Shotwell"}, {"rating": 5.0, "review": "A little more expensive than the Chromecast, but a lot more usability here. Fully interactive menus, remote with batteries. Is it the fastest thing? No, it can get choppy here and there, but it's a pretty cool device. Totally worth it, especially if you have prime.", "verified": true, "helpfulness": "0/0", "author": "Rusty Shackleford"}, {"rating": 5.0, "review": "I absolutely LOVE my Amazon Fire Stick. It is very convenient and I can watch all my favorite movies without a problem.", "verified": true, "helpfulness": "0/0", "author": "Rita"}, {"rating": 5.0, "review": "For the price, an incredible bargain.", "verified": true, "helpfulness": "0/0", "author": "Eric G."}, {"rating": 4.0, "review": "Sometimes it buffers a little bit, also all of the newer stuff and good TV shows you have to pay for. It does have Netflix capabilities, which is what I use it for mostly.", "verified": true, "helpfulness": "0/0", "author": "Molly"}, {"rating": 3.0, "review": "Not what I expected!", "verified": true, "helpfulness": "0/0", "author": "Victor Trujillo"}, {"rating": 5.0, "review": "Makes watching tv easier", "verified": true, "helpfulness": "0/0", "author": "Cindy Wyatt"}, {"rating": 4.0, "review": "There are a number of feelings I have towards this little stick. I love it ultimately there are only a few small tweeks I would make. The remote is too small and gets lost all the time with a dog and a kid I can never seem to find it. Additionally it won't work if it's not plugged into the wall. I wish it could be charged and then plugged in. But hey, not everything is perfect. I recently had an issue with this where I was in the middle of a show and it shut down. I couldn't get it to work. I contacted customer support. They couldn't make it work either and told me to wait a few hours. That didn't work. I then e-mailed them and they are sending me a replacement no questions asked. That makes me very happy.Pros:Lots of appsYou can chose your apps, they aren't pre-loadedSmallEasy to installPrice cannot be beatCons:Small remote gets lost a lotNeeds to be plugged in all the time, not convenient.", "verified": true, "helpfulness": "0/0", "author": "Devdevie"}]