[{"rating": 5.0, "review": "So far I love it :)", "verified": true, "helpfulness": "0/0", "author": "Amber Grissom"}, {"rating": 5.0, "review": "Easy to install, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Gwen"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "susan murphy"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Sheila Garcia \"garcee\""}, {"rating": 5.0, "review": "This arrived with lightning speed and was packaged beautifully!!! Easy & quick to install. I was watching programs within minutes. I love it! Just enough for me to watch with my Prime, Netflix, and Hulu Plus along with an amplified antenna. No more outrageous cable bills! I wish I had thought of it sooner!", "verified": true, "helpfulness": "0/0", "author": "On my way 2014! \"deal maker\""}, {"rating": 5.0, "review": "This device is absolutely amazing! It's made my cable subscription obsolete. Between the Amazon Prime features, Netflix, and the other apps, it's become my main source for entertainment at home.", "verified": true, "helpfulness": "0/0", "author": "Kristy A."}, {"rating": 5.0, "review": "My wife and ILoved it we use it every day and nightWe connected the showtime anytime HBO encore from my dads direct tv account and boom had access to everythingPretty coolIt works perfectly fine but on my kids tv 25inc smart tv Vizio I be having problems with the signalI think it depends on the TV quality because the VIZIO tv is closer to the wifiOther than that it work good on my Samsung TV never had a problem besides onces or twice on the app issuesNO CABLE NO MONTHLY paymentBut I got it all with the fire stickAs long as you have access to someone cable accountIt's the best diction trust me", "verified": true, "helpfulness": "0/0", "author": "Danny ramos"}, {"rating": 4.0, "review": "So far I like it!", "verified": true, "helpfulness": "0/0", "author": "Amber & Anna"}, {"rating": 5.0, "review": "love it, easy to use, no lag or disruption of wi-fi", "verified": true, "helpfulness": "0/0", "author": "Jose Morales"}, {"rating": 5.0, "review": "Easy set up, almost plug and play.", "verified": true, "helpfulness": "0/0", "author": "book eater"}]