[{"rating": 3.0, "review": "Wish it would communicate with my iphone, but other than that is pretty good.", "verified": true, "helpfulness": "0/0", "author": "R S - Florida"}, {"rating": 5.0, "review": "Very convenient for netflix.", "verified": true, "helpfulness": "1/1", "author": "Layne"}, {"rating": 5.0, "review": "The only gadget I've purchased in a long time that truly impressed me. The full experience is quality. Packaging is super smart and minimal, Installation and set up a breeze, on screen interface clean and intuitive, functionality slick.", "verified": true, "helpfulness": "0/0", "author": "Mark Steele \"Bassey Spice\""}, {"rating": 4.0, "review": "This is a great way to access Prime movies, netflix, etc.  I have 2 problems with it - 1) It isn't as good at picking up my wifi as other devices in the house.  We've actually had to move our router to accommodate this.  2) You need a separate power source - I thought it'd use the power from the tv - I hate having more cords around.", "verified": true, "helpfulness": "0/0", "author": "nabs"}, {"rating": 1.0, "review": "This product is awful!  I bought 2 of them by the CLAIM that it was fast and no buffering.  It CONSTANTLY BUFFERS and FREEZES!!!  My previous Roku worked 10x better than this product.  I am so disappointed.  I like the appearance of the menus and the voice commands.  But the overall useage I would give 1/2 a star to.  I can barely use it cause it ALWAYS BUFFERS OR FREEZES.", "verified": true, "helpfulness": "2/2", "author": "RACHEL L. ANDERSON"}, {"rating": 5.0, "review": "For $19, this is a bargain.  I like the fact that it disappears from view, and am surprised by how much free content there is on Amazon Prime.  If you don't have Prime, this is a worthless product.  Also note that you need FULL Prime, not the gifted free 2-day shipping from a friend or relative.", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 5.0, "review": "Great product with better picture quality than my original Amazon fire tv", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 2.0, "review": "Too many apps that are free on other platforms but cost money here.  Also, the app for airplay connectivity works only intermittently and Plex keeps freezing 60 seconds when watching a movie.  I play the same thing on my Chromecast using Plex and it works flawlessly.  I pre-ordered so got half off, but really disappointed with the fire stick.", "verified": true, "helpfulness": "1/1", "author": "Consuuumer"}, {"rating": 5.0, "review": "I received mine right before Christmas and we're able to use it with kids and family .A must have device for those with Prime membershipPro1. Easy to use and setup(you can read this you can setup by yourself)2.compact can go anywhere anytime.Con1. Wish sub cable was little bit longerGOOD JOB AMAZON.COM!!", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "I love it! Quick and easy!", "verified": true, "helpfulness": "0/0", "author": "lpickett"}]