[{"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "kayla steed"}, {"rating": 5.0, "review": "Easy to setup and easy to use. Brought 2 for multi room use. Just plug and go. So easy my wife can even use it lol (duck)", "verified": true, "helpfulness": "0/0", "author": "fazan ali"}, {"rating": 5.0, "review": "Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "KindleFL"}, {"rating": 5.0, "review": "Why didn't I buy this sooner!  Watching all my Prime movies and TV shows plus a few things on Netflix.", "verified": true, "helpfulness": "0/0", "author": "PDQ"}, {"rating": 5.0, "review": "So glad I finally have the Fire TV Stick working and enjoy everything about it.", "verified": true, "helpfulness": "0/0", "author": "Linda Morrey"}, {"rating": 4.0, "review": "I initially gave this device a really poor review because it was buffering and pixelated when I was using it and interfering with my broadcast TV signal when I tried to watch my local channels. I really liked the idea of it and wanted it to work so I didn't return it right away. After a few days the video quality issues magically improved. I then had to contact customer service three times to try to find a solution to the signal interference. The problem was that when the device was plugged in, if I tried to watch broadcast TV the signal would cut in and out constantly. If I wanted to switch from streaming over the stick to watching broadcasts, I had to get up and unplug the stick. The first person told me to reset to factory settings, which had no effect other than to erase all my login settings. The second person could not comprehend the problem, he was convinced it was a wifi issue. The third person understood right away and sent me a free extension kit - a six foot HDMI cord and adapter. Problem solved. If you run in to the same problem - ask for the kit. Keep trying until someone answers who knows what you're talking about.", "verified": true, "helpfulness": "0/0", "author": "S. Brown"}, {"rating": 5.0, "review": "Great product.. I've bought them for family members because I was so pleased with it..", "verified": true, "helpfulness": "0/0", "author": "kevin h. \"k--h-------y\""}, {"rating": 5.0, "review": "Easy to use, nice sharp picture!", "verified": true, "helpfulness": "0/0", "author": "Homespun"}, {"rating": 5.0, "review": "I like everything about this device but what puts it over the top is the ability to log into those bizarre hotel web portals (where you have to go to a web page and agree to terms of service or enter your room number).  No other similar devices can use this type of wi-fi but Amazon cracked the code.  I tried it at two different motels this weekend and it worked perfectly at both - a web page-type screen pops up on the tv and you can enter the information using the remote.  This device is going with me every time I travel.", "verified": true, "helpfulness": "0/0", "author": "dssonic"}, {"rating": 3.0, "review": "Can't get apps to work like Acorn TV. Seems to take more WiFi capacity on some apps like MLB tv. Tried to get the TV to play from tablet or phone and it doesn't seem to work consistently.", "verified": true, "helpfulness": "0/0", "author": "dan sherwood"}]