[{"rating": 5.0, "review": "Would be worth the $20 I paid for it just streaming Pandora on the TV, my wife loves it.Makes Prime much more worthwhile.  Prime Video, Prime Music & Prime Photo storage are all no longer just extras.", "verified": true, "helpfulness": "0/0", "author": "Cory A Howe"}, {"rating": 3.0, "review": "The HD movies take too long to load. I have the high speed 100ghz from TIme Warner and still it takes far too long to upload.", "verified": true, "helpfulness": "0/0", "author": "Frank Lopez"}, {"rating": 4.0, "review": "Works well usually, have had to unplug it to restart it several times.  It does get pretty warm and the D-pad on the remote was causing it to go haywire one time, another it was just frozen and doing things at random.  Removing the batteries in the remote did not help. But restarting the stick fixed the issues.Works well for what I use it for, which is Plex and amazon prime video.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the Fire TV Stick, the menu is easy to navigate and the voice search feature is great (I use the Fire TV App for android for this).I have movies, TV shows and music on Amazon and the Fire TV Stick is great for the streaming (I also use the Hulu Plus and the Netflix apps).I especially love that most of the music I bought on Amazon displays the lyrics using the Fire TV Stick.I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cannot be happier.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Works like a dream!  Simple plug in and follow the instructions.", "verified": true, "helpfulness": "0/0", "author": "Joey T"}, {"rating": 5.0, "review": "This works great. Takes a few minutes to update and load when you first plug it in then it is off and running. It streams flawlessly in HD. I'll be buying more for other TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "Michael Raudenbush"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Edwin Telles"}, {"rating": 5.0, "review": "This is the best thing since sliced bread!!! So many functionalities packed in one little device. It hasn't let me down yet. I especially love the mirroring function. No Lag!!! 😃AWESOME.", "verified": false, "helpfulness": "0/0", "author": "F. Hawkins"}, {"rating": 5.0, "review": "Way better interface than is on my smart TV.", "verified": true, "helpfulness": "0/0", "author": "robsmind"}]