[{"rating": 5.0, "review": "Love the Fire Stick for TV!! Now I don't need to attach my laptop to the TV to watch through Amazon Prime!!  Having a Star Trek Enterprise marathon.  It was very easy to install and simple to use.  Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Deborah J. Mccool"}, {"rating": 1.0, "review": "Not working as yet.", "verified": true, "helpfulness": "0/1", "author": "Judith Hansen"}, {"rating": 5.0, "review": "Easiest set up for me so far. In a few minutes you are watching prime movies , shows,etc.Also purchased voice remote. I have a heart condition so tv is one of the few entertainmentoptions.Recommend to get amazon prime also, I've been watching amazons original series(Bosch)they are very well produced ,directed,acted.So if you want to be as glad as I am order a FIRE TV STICK!🔥📺=😃", "verified": true, "helpfulness": "5/5", "author": "REYREY"}, {"rating": 5.0, "review": "Love it! I'm finally getting rid of cable and with this I'm wondering why I didn't do it sooner. Very small and easy to install and use - just plug it in. It works very nicely in conjunction with my Amazon prime account so the choices of things to watch are endless. I don't miss cable one bit!", "verified": true, "helpfulness": "0/0", "author": "Catherine KLine"}, {"rating": 4.0, "review": "Don't like that it goes to sleep mode if you don't touch it for awhile. When I go to bed I like to put it on and watch let's say mash. I fall asleep and when I wake up I am in sleep mode. Would much rather see it still playing episodes.", "verified": true, "helpfulness": "0/0", "author": "Matthew T."}, {"rating": 5.0, "review": "This is by far the best purchase I have ever made!", "verified": true, "helpfulness": "0/0", "author": "Mc2"}, {"rating": 5.0, "review": "Amazon has done it again and it's AWESOME! I love my fire tv stick. It's easy to use and all of your cloud music and photos are rite there on your tv screen. Not to mention all of the Prime content and Amazon original programs. Just be aware of which HDMI input you plug it in to; use your remote to put your tv on that particular HDMI (1,2, or3). You might have to put your password to your wifi in. Everything else is automatic; too easy!", "verified": true, "helpfulness": "0/0", "author": "Taunya"}, {"rating": 5.0, "review": "I love my fire tv stick", "verified": true, "helpfulness": "0/1", "author": "Tanya Evans"}, {"rating": 4.0, "review": "This is going to be fun!  I'm very pleased.  Can't comment on much since it is new to me and there's a lot of exploring on it to do.", "verified": true, "helpfulness": "0/0", "author": "LAB \"LAB\""}, {"rating": 2.0, "review": "It would be great if it would work all the time. We have to literally reset it every time we use it. We frequently get audio and no video.", "verified": true, "helpfulness": "1/2", "author": "Melissa Young \"mellebelle\""}]