[{"rating": 3.0, "review": "Just think there should be more options that are free", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love it. Best thing ever. So easy to navigate the remote.", "verified": true, "helpfulness": "0/0", "author": "Katherine Carter"}, {"rating": 4.0, "review": "Easy to install and navigate.", "verified": true, "helpfulness": "0/0", "author": "Keith George"}, {"rating": 3.0, "review": "Love the size compared to apple tv or roku.  However, it seems to freeze up more than either of the other two.  I have all three, plus a smart tv.  The roku has the best function, the apple tv Has the best stability and streams from computer but no amazon, the fire stick is the most portable and the least expensive.  History's app slow and more unreliable on the stick.  Ever so often you must unplug the stick and power back up for it to recognize your wifi network.", "verified": true, "helpfulness": "0/0", "author": "Bill D. \"Billy D.\""}, {"rating": 5.0, "review": "Worked right away for us. Had a little trouble with the surround sound, but we really are happy with it.", "verified": true, "helpfulness": "0/0", "author": "D. S. Pollum \"love history\""}, {"rating": 5.0, "review": "FAST DELIVERY - GREAT ITEM", "verified": true, "helpfulness": "0/0", "author": "A. Peate"}, {"rating": 1.0, "review": "When this product arrived I was unable to open the battery case.  After pulling for a long time, I had to search the internet and saw that this has been an ongoing problem.  It took a knife and over an hour to just open the remote.  Secondly, trying to search using up and down buttons on the remote takes forever.  Otherwise it is working great.", "verified": true, "helpfulness": "0/0", "author": "T. King \"avid traveler\""}, {"rating": 5.0, "review": "Easy simple to use. Clear interface makes locating what app you want to use easy. New update makes it easier when wanting to put the Fire stick to sleep. Love it! Does everything it says it does.", "verified": false, "helpfulness": "0/0", "author": "Jorge Mondragon"}, {"rating": 5.0, "review": "Super easy to install and great access to Netflix.  Haven't tried it on different TVs yet, but I like that you can also download a remote for your smartphone.", "verified": true, "helpfulness": "0/0", "author": "Kira N Waite"}, {"rating": 5.0, "review": "Have only had it for a few weeks, but am happy with the purchase. I like that my account was already established upon purchase. When I got it, it was ready to use. Seems easy enough to navigate through the options with the remote. I'm sure there is more to discover. The only problem I encountered was putting in the batteries. I know it sounds silly, but there were no instructions on how to open the remote. I had to use a knife blade to pry it open, yes it was that tough to open. Hopefully it's a long time before replacing them.", "verified": true, "helpfulness": "0/0", "author": "Ted lewand"}]