[{"rating": 5.0, "review": "Works perfectly right out of the box.  We love it.  We got the Fire TV for the living room and this for our TV in the bedroom, since we didn't need games or a fancy voice activated remote in there.  ;)  Been very happy with both and mostly with Amazon Prime Video.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "Love it!! Can now access Prime and Netflix on tv's.", "verified": true, "helpfulness": "0/0", "author": "Linda R"}, {"rating": 5.0, "review": "Easy hookup.  was watching a free movie not evevn for rent yet on Comcast in 30 min. & I'm no tech wiz.", "verified": true, "helpfulness": "0/0", "author": "edward p schindler"}, {"rating": 4.0, "review": "I am enjoying it very much.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "Absolutely love it. Met all my expectations !Shipping was excellent. Received it sooner than expected !!", "verified": true, "helpfulness": "0/0", "author": "tina adams"}, {"rating": 4.0, "review": "I am very pleased to be able to stream with my new Fire TV stick.  The installation was the hardest part for me.  I couldn't get the remote apart to install the batteries but was able to go online and find out that a knife inserted in the seam got it to open.  Then the password became an issue.  After numerous tries I got connected and have been enjoying my choices of movies and tv shows with Amazon Prime. Since we have never had cable this is a real treat to watch \"biggie size\"  and frees up the computer for personal use.", "verified": true, "helpfulness": "0/0", "author": "Diane B. Carter"}, {"rating": 1.0, "review": "I own an Apple TV and a directv streaming device. The picture quality on those two devices is first rate. But Even when I turn off those devices, the picture quality on the Amazon stick is horrible. Nice try but this is a lousy product. I want my money back.", "verified": true, "helpfulness": "0/0", "author": "Mark angotti"}, {"rating": 5.0, "review": "Much wow", "verified": true, "helpfulness": "0/0", "author": "David Opphile"}, {"rating": 5.0, "review": "This little device is slick. As a Prime member it opens up the desire to watch more movies on my TV.Great for a cold NE winter but it will keep me from my chores when the spring hits.Great entertainment investment", "verified": true, "helpfulness": "0/0", "author": "Steven J Smith"}, {"rating": 5.0, "review": "easy to use. I love it.", "verified": true, "helpfulness": "0/0", "author": "Lilly Smith"}]