[{"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Doris C."}, {"rating": 5.0, "review": "I love it! Just wish there were more classic and current TV shows for prime members.", "verified": true, "helpfulness": "0/0", "author": "Lisa Greig"}, {"rating": 5.0, "review": "Great for any room. Lots of content.", "verified": true, "helpfulness": "0/1", "author": "Jay21"}, {"rating": 5.0, "review": "It's everything I expected at a great value.  One problem to note: my old receiver takes HDMI inputs and routes to a single output, but requires separate inputs for sound.  If that's the case with a receiver you have them you won't be able to get sound output from the Fire stick.  I'm forced to use this with my newer TV which is fine.", "verified": true, "helpfulness": "1/1", "author": "Jason Jordan"}, {"rating": 5.0, "review": "Loved it so much, bought it twice.  Nuff said", "verified": true, "helpfulness": "0/1", "author": "R. Turner"}, {"rating": 3.0, "review": "It was very easy to set up and use. Only thing I didn't like was the fact that the picture wasn't always clear and it got stuck buffering several times", "verified": true, "helpfulness": "1/1", "author": "Madison"}, {"rating": 5.0, "review": "I think it is awesome way better than my expectations. I have an app for my phone that is the remote so I can type stuff in rather than picking out the letters", "verified": true, "helpfulness": "1/1", "author": "Scott Osborn"}, {"rating": 5.0, "review": "My husband loves to watch TV and this helps him watch programs and seasons he missed. He was laid up with a shoulder injury this winter and this helped when he was not able to do anything.", "verified": true, "helpfulness": "0/0", "author": "georgia houpt"}, {"rating": 3.0, "review": "Only issue is the remote controller. Navigating with the keyboard with the remote is difficult because moving the up, down left and  right sticks and types the same letters several times and you have to navigate to the delete key that sometimes deletes everything you entered or goes too far passed the letter you wanted. Consumes too much time just to enter email address and pswd.", "verified": true, "helpfulness": "1/1", "author": "dante de torres"}, {"rating": 5.0, "review": "I bi ught this for my parents thwy love it. I bought mine months ago. I am watching right now!", "verified": true, "helpfulness": "0/1", "author": "amariah hicks"}]