[{"rating": 4.0, "review": "It's not bad, could have a few options added like Hulu or Google but I like it.", "verified": true, "helpfulness": "0/0", "author": "Adrien Wilhite"}, {"rating": 5.0, "review": "The Fire TV Stick is great. The only unpleasant surprise was the fact that nearly anything we want to watch costs money. I guess there really is no such thing as a free lunch!", "verified": true, "helpfulness": "0/0", "author": "Charles Ota Heller \"Charles O. Heller\""}, {"rating": 4.0, "review": "Easy set up smooth operation. Lots of choices but some only in SD.", "verified": true, "helpfulness": "0/0", "author": "rich petersen"}, {"rating": 4.0, "review": "Does a great job streaming with our very slow internet.  Like it so well I bought a second one. Wish it had the CBS app available.", "verified": true, "helpfulness": "0/0", "author": "Vicky Young"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Donald M. Leavitt"}, {"rating": 1.0, "review": "I got it all setup and able to connect it. I have a DSL connection because of work and it's connection speed is too low so it will not stream video", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "Love my fir stick. How did I live with out?", "verified": true, "helpfulness": "0/0", "author": "TimHBTR54"}, {"rating": 5.0, "review": "top product, great content and super easy install", "verified": true, "helpfulness": "0/0", "author": "Ulrik Nackaerts"}, {"rating": 5.0, "review": "Love it. Minimal but powerful. Only need to invest in USB cord to help with power consumption via the TV and not an outlet.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lusk"}, {"rating": 5.0, "review": "Love this thing so much I bought a second one so my lazy butt doesn't have to move it from the bedroom to the livingroom. I've also been able to introduce my girlfriend to \"binge watching\" - prime music playlists put lyrics on the screen turning my living room into the family karaoke much to the dismay of the cat. Also saved thousands of construction and pet fee dollars by downloading the free fish tank and fireplace apps.", "verified": true, "helpfulness": "0/0", "author": "Justplainnico"}]