[{"rating": 4.0, "review": "Fire TV Stick + TVMC is a very capable and impressive piece of kit. It's not perfect, WiFi could be a bit stronger, I would love some way to connect USB and the remote feels kinda cheap. That being said I've bought four of these so far, 2 for my home and 2 for family. I got the first one through Prime for $19 and the others during Black Friday week for $25 and at that price point you'd be silly to pass on it. At $39 it's still a pretty solid deal but I'd like to see a price drop in the future to make it a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "GrandFacilitator"}, {"rating": 5.0, "review": "Really amazing. Better than Chromecast by far. Very fast and easy to use", "verified": true, "helpfulness": "0/0", "author": "Jason Harrold"}, {"rating": 5.0, "review": "Very cool. Works great for access to my prime content. Downloaded the remote app for my phone. Great price since I was a prime customer. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Edly"}, {"rating": 5.0, "review": "I am beyond happy with the fire stick. It is awesome", "verified": true, "helpfulness": "0/0", "author": "Donna Collard"}, {"rating": 5.0, "review": "Plugged it in on the weekend. It took us longer to find the password for the wifi then to get going on the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "G. Muenster"}, {"rating": 5.0, "review": "Came swiftly, super easy to install. Just wish Amazon would offer more than the first season of the HBO shows!", "verified": true, "helpfulness": "0/0", "author": "CL"}, {"rating": 4.0, "review": "Not bad, but no HBOgo, Encore, Starz, ABC, etcDoes have Showtime anytime though.The Fire TV has HBOgo, unfortunately, nothing for Fire TV Stick until at least next year.Other than that, this is pretty good and responsive.", "verified": true, "helpfulness": "0/0", "author": "Tofu King Good \"cchen\""}, {"rating": 4.0, "review": "Great device. But please realise that you will need to pay an additional $30 to get the voice control remote. Typing anything into this remote is a nightmare. You have to scroll manually through each letter, with the letters arranged from A to Z in a line on the TV...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really enjoy this little device.  Works right outo f the box with out without difficulties.  The channel selection is pretty decent but could use a bit more variety.  Same goes with the prime movie selection.  Overall, very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 1.0, "review": "This device just does not cut it.  Its slow and the picture quality is horrible", "verified": true, "helpfulness": "0/3", "author": "RW"}]