[{"rating": 5.0, "review": "Amazing product for the price! Highly reccomend it! Huge content.", "verified": true, "helpfulness": "0/0", "author": "Les S."}, {"rating": 5.0, "review": "I've got the chromecast but I like this better. The remote is simple, small, and easy to use. Searching could be a little easier but I'm sure when the app comes to iOS itll be a little quicker to type things in", "verified": true, "helpfulness": "0/0", "author": "Allen Smentkowski"}, {"rating": 5.0, "review": "Much better than Roku. I got Roku as a Christmas gift and from day one the remote didn't work correctly kept freezing up and load time was ridiculous waiting and waiting.So I returned to Roku and ordered this. Original delivery was set for February 20th I guess they were on back order but I ended up getting it January 12th and I have to say this Amazon stick is much better than Roku, no freezing remote and it's much faster load time to start up. You can download all the same things on it as well. And it's $10 cheaper than Roku too. I'm happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Nicole P \"Nicole\""}, {"rating": 5.0, "review": "I bought it so that I could watch my shows while I'm at the deer lease, but I ended up keeping it in my home office!  I use it for music and for TV shows.  Easy setup, no issues at all.  Might buy another one for the bedroom TV too.", "verified": true, "helpfulness": "0/0", "author": "T. Murray"}, {"rating": 2.0, "review": "good but can not mirror cast a windows desktop. Mirroring a desktop is the main reason to purchase a device like this. This one factor alone...makes chromecast a better choice (but barely). The other features are nice (except amazon prime which demands you pay for videos, then after you pay, it runs commercials) it has very few decent games and apps that are free. Most of  the games are knocking each other off of which, aren't something most people would play...amazon just put them up there so it looks like they have content. Most of the decent games require a game controller (which also must be special ordered) another $40 each. After getting the controller ...you would think games would use the control sticks to move around but often its the L or R triggers (waste of money). This device (and its app shop) needs at least 3-6 months more development before its good enough to be sold to the public. The device crashes a few times a day, which is normal from reading others reviews. Based on all this, my current suggestion is purchase a chromecast, while it has its issues (half the hardware a ASTV is)..at least you get what you see (litterally your whole desktop if needed) with no extra hidden cost.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "Our TV and Blue Ray player did not support Amazon Prime streaming video and we were missing out on a lot of programming. We bought the Fire TV Stick at Staples and are very pleased. It's easy to install, easy to navigate the menu. Good purchase.", "verified": true, "helpfulness": "0/0", "author": "Georgia Ann Mullen"}, {"rating": 5.0, "review": "I really like having a remote to use rather than having to use my tablet to view the applications.  It is very easy to use.  I always use closed captioning when I watch movies or TV.  Even though a movie shows 'cc' on the screen the system does not always allow you to change to change it.  I finally found a movie that did and now I have closed captioning on everything which is what I wanted.  Thought this might help someone.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy installation. Great product!", "verified": true, "helpfulness": "0/0", "author": "Nina Young"}, {"rating": 3.0, "review": "You would think that it could derive it's energy from the TV HDMI.BUT , alas it is not so. You need to jack it into a USB port or wall outlet.Cords I say, CORDS!!", "verified": true, "helpfulness": "0/0", "author": "Drew Walter"}, {"rating": 4.0, "review": "Very excited to receive the Fire TV stick. I have a Chromecast and was interested in the use of the remote as my Nexus 5 battery seems to drain quickly even without use (Thanks for the Lollipop update Google!).Pros:Fire TV Stick provides a rich platform built on Android that allows playing video and music right from your Amazon account. Previously I was using PS3 to access prime videos because of the lack of Amazon Video support for Chomecast.Fire TV Stick also has app integration direct from the Amazon Android Appstore. You can play games or interact with other video platforms such as Netflix, Crackle. TwitTV, Hulu Plus, etc. (This is similar to Roku). Furthermore, the platform is fairly open allowing for \"side-loading\" apps such as XBMC (which provides better video streaming support for other media formats).Cons:There are stability problems with applications and the rest of the platform. For example, Crackle will randomly open while watching Netflix and start playing content. ESPN will crash when network goes out.There is no built in application to stream local media on the network.", "verified": true, "helpfulness": "0/0", "author": "regular user"}]