[{"rating": 4.0, "review": "So much faster than my Chromecast. Wish it had HBO go app", "verified": true, "helpfulness": "0/0", "author": "Michael C Pope \"Michael C Pope\""}, {"rating": 1.0, "review": "Severely disappointed with this transaction!  Fire Stick never worked properly and Amazon insisted I follow a silly protocol to determine whether the device was defective or whether it was user error - the protocol seemed to suggest that despite the product's extreme ease in setup that it was my intelligence rather than a porous quality control system at fault.  The Fire Stick I purchased was not able to hold an internet connect - the setup itself took 1 minute - but the device was never able to successfully stream a movie without buffering delays and repeated error messages to check my network connection.  I have an Amazon Fire Box that works perfectly as well as many other streaming devices (Google Cast, iPad, computer, etc.) and all stream content perfectly.  I asked Amazon to replace the product but gave up after many unsuccessful attempts to replace.  I asked for a refund and that was processed immediately.  I am puzzled why it's easier to get my money back than to get the Fire Stick.I want to emphasize that I am a HUGE fan and regular shopper at  Amazon and have been since they launched, and have always been impressed with their range of products, ease of shipping and innovation (active user and  happy customer of Amazon prime).  BUT, it seems that Amazon would rather launch a faulty product quickly than correctly.", "verified": true, "helpfulness": "2/2", "author": "Brooklyn KR"}, {"rating": 4.0, "review": "Pretty damn good.", "verified": true, "helpfulness": "0/0", "author": "Roger Pink"}, {"rating": 4.0, "review": "I have several TV media systems and this one matches up to all of them in terms of quality and ease of use.  It obviously installs easy as you just plug it into your TV's HDMI port.  I also recommend using the external power connection as Amazon does because it really does make a difference in performance of the stick.  Setup was a breeze and since I ordered it through my prime account, it was already linked to that and I didn't have to fill out everything which was a nice surprise.Overall, the functionality is good, obviously, Amazon focuses on prime videos etc but its easy to use Netflix, Hulu, etc.  The only reason I gave it 4 stars instead of 5 is that HBOGo isn't available yet but several news articles online have started its coming soon.  I am also excited that the new Dish SlingTV option will be available on here since I've cut the cable/satellite cord a long time ago and don't get those stations.For the price of this unit, I would definitely recommend it, if you have a kindle fire or fire phone, its great with that too so don't hesitate to buy.", "verified": true, "helpfulness": "0/0", "author": "Safety Guy"}, {"rating": 4.0, "review": "Great product! Easy to use and works great!", "verified": true, "helpfulness": "0/0", "author": "nu_runr@hotmail.com"}, {"rating": 4.0, "review": "husband really likes remote. Easily guide way through all program. Worth the money", "verified": true, "helpfulness": "0/0", "author": "Georgene Billy"}, {"rating": 5.0, "review": "Bought it on sale when it was $19.99 for Prime members. Thought it would great to have in my dorm at college. Received the package while on Christmas break & I have used it everyday since! Turns any TV into a \"smart\" TV. Worth the every penny!", "verified": true, "helpfulness": "0/0", "author": "Alex King"}, {"rating": 4.0, "review": "Very responsive device. Works smoothly and the construction feels very solid. My one negative is putting it to sleep when you're done using it. The sleep feature is buried way down in the settings that takes a bit of clicking to find. Maybe there's another way to do it?.. I know amazon says it automatically goes to sleep after 30 minutes, but why not make a button combination that tells it to go to sleep manually? That might just be me being overly cautious. Other than that, great device.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Very satisfiedV", "verified": true, "helpfulness": "0/0", "author": "margie sohaney"}, {"rating": 2.0, "review": "After the Fire Stick forgot my Netflix password for the third time, I looked over to my wife and said, \"This thing should be called the 'Crap Stick'.\" It's not just Netflix that I have problems with, numerous apps are buggy to the point of frustration. While this might be a problem with the apps, these same reputable apps work fine on every other streaming device I own (Chromecast, PS3, various tablets, etc). The common denominator is the Fire Stick.I also see stutters and hesitations in the UI, making the device feel sluggish and underpowered, which is strange since Amazon really boasts about the hardware specs of this device. Hopefully this and the other bugs will someday be fixed by a software update, but until then, it's just too frustrating to use. I also have a problem with the remote \"sticking\" and jumping over the show I'm trying to select, sometimes like a runaway train! I can't tell if this is a software issue or a hardware problem in the remote itself.I give this device two stars instead of one because the quality of that video is superb! I find the picture quality much better than my Chromecast and on par with my PS3, and the Fire Stick uses a 10th of the electricity of my PS3. It's just too much of a pain to get the video to play in the first place!This was an impulse buy for me when it was offered for $19, so it doesn't break my heart to throw this stick in the junk drawer and go back to one of my more reliable players. Had I paid full price for it, I would be sending it back to Amazon for a refund.", "verified": true, "helpfulness": "1/2", "author": "Thomas Didymus"}]