[{"rating": 4.0, "review": "The Fire TV Stick compares favorably to the Roku I have used for years, and I like its capabilities. It has a somewhat different set of \"extra\" content providers than Roku does, as other reviewers have notged, but most of us are just here for Amazon Prime videos, Netflix, Hulu Plus, and other major content providers.However, my unit has a quirk: every two minutes -- while I am watching TV with the stick plugged in and powered up -- it interrupts the TV signal just for a second.This signal interruption happens every two minutes (timed by a stopwatch) and is replicable . I powered it off and back on, but that did not help it.  And it happens whether or not the stick is in \"sleep\" mode.I've searched the other reviews, but no one else seems to have reported this issue.I could live with this, but I'll contact Amazon regarding a replacement. I simply wanted to get this issue out there in case others have experienced it.UPDATE: I originally wrote this as a 'power interruption', but that was incorrect.", "verified": true, "helpfulness": "0/0", "author": "Paul Havemann \"umbrage at ambage\""}, {"rating": 5.0, "review": "I just got it today, with my 3Ghz DSL it comes in great. I upgraded to HD, & it's definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "did not like it at all, found a free movie on Netflix picked it next thing I know amazon has charged my prime account $4.99, it is a money making tool for amazon", "verified": false, "helpfulness": "1/4", "author": "ronny windsor"}, {"rating": 5.0, "review": "This works rad well.  Easy to navigate and smart search functions.  Maybe a step above took but need to see how new apps are riled out", "verified": true, "helpfulness": "0/0", "author": "Huskernut"}, {"rating": 3.0, "review": "This was an \"Out of the blue\" gift so I had no expectations...it has been fun though and if the Prime service can be billed monthly I may continue that", "verified": true, "helpfulness": "0/0", "author": "Dobridge Jones \"earthtojohn\""}, {"rating": 5.0, "review": "Love this! Easy to operate!", "verified": true, "helpfulness": "0/0", "author": "Zechiel"}, {"rating": 4.0, "review": "Absolutely love it. It almost knocks out the need for expensive satellite.Pros it streams all kinds of media. From amazon prime- hulu, netflex ect ver wellConnects to apple products easily with adv apps.ConsWish it had more apps adv like showbox for free tv.Limited to app adv. however I have noticed they keep coming out with more all the time.", "verified": true, "helpfulness": "0/0", "author": "lkjghjgkjhg"}, {"rating": 5.0, "review": "We have an old Plat screen tv. This has been such a good investment because my toddler doesn't have to stare at the iPad all the time to watch his favorite Thomas. (Free with prime members).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Gives access to more movies.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "I Love Paris!"}, {"rating": 5.0, "review": "I'm very happy with my purchase of the Fire TV stick.  Was quick and easy to setup.  Streams movies and shows with no connection problems what so ever.", "verified": true, "helpfulness": "0/0", "author": "bclava730"}]