[{"rating": 2.0, "review": "The device worked great for a few days, then we began to have intermittent connectivity issues. After a few days of this, it began to work again.  It worked great again for about a week or two. Recently though the intermittent issues returned and now the device will not connect to our network at all. This is strange because our old Roku box works fine as well as the play-station we use to watch blu-rays and to stream netflix. With those two devices working fine as well our other electronic devices, we have to believe this is an issue with the product. We were really excited when this product hit the market and even pre-ordered it but now we have no choice but to return it and purchase some other type of streaming device.", "verified": true, "helpfulness": "0/0", "author": "M. Elliott \"SF222\""}, {"rating": 4.0, "review": "It's what I was hoping for, very easy set-up probably 10 minutes maybe a few minutes more.  Seems pretty straight forward thus far.  Fairly easy navigation.  I have the Chromecast in one room, and wanted this for the primary TV.  Having Amazon Prime I wanted the ability to have easy access to their movie lineup and this now gets me there without a lot of B.S.  Possibly, the only negative is the remote is small and I can already see this falling into the crack of the chair or couch.  The search displays on the screen in smaller letters at least on the 32\" TV.  It says you can download the application for your Android smart phone, but honestly I don't think I'll be doing that.  I pre ordered and it arrived yesterday which was a nice surprise as early on it stated would not arrive until after Christmas.  Head to Head it's so similar to Chromecast as far as price points etc.  I didn't see Youtube logo on here and that would be disappointing especially for home video that can be watched from your youtube account.  Well, I paid 19.00 so I'm not complaining!  I like this and would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Logic101"}, {"rating": 5.0, "review": "Got my Fire Stick yesterday in the mail. Hooked it up today and in about 5 minutes I was streaming content. Works flawlessly, easy setup and nice clean interface.", "verified": true, "helpfulness": "0/0", "author": "Prashant Goel \"palluji\""}, {"rating": 4.0, "review": "Easy to set up. Has been great in my daughter's room allowing her to watch Netflix at the drop of a dime. The remote is easy to use as well.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "i love this device. i have the various media device similar to the fire stick: WDTv, roku, google chromecast. While it is the same. I find it a little bitter than the last two....if it's able to do what the WDTv can do as far as accessing my network and pulling movies from there and i will be a happy camper. It was worth getting it at the special prize! yay...", "verified": true, "helpfulness": "0/0", "author": "myenne"}, {"rating": 5.0, "review": "Received my Fire Stick.  Set up was a breeze!  It blows my old Ruku away.  A great purchase.", "verified": true, "helpfulness": "0/0", "author": "sfm7361"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is A-MAZ-ON! It was so easy to get started. The box comes with everything you need. Even includes batteries for the remote and a USB wall adapter for people like me who have a HDMI port but don't have a USB port on my TV. If purchased with your Amazon account it is even already pre-registered. Seems like they thought of everything.  I was able to get everything up and running from taking it out of the box to watching videos on Hulu Plus and Netflix in under 10 minutes. Very happy with the purchase!", "verified": true, "helpfulness": "1/1", "author": "Kevin Duby"}, {"rating": 5.0, "review": "Started with the Chromecast and didn't like it. Finally got the Fire Stick and love it. I am a Prime member and the stick works great with my kindle and tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This thing is awesome.  It has so many really cool features.  I am 62 years old and find it very easy to use.  It does take a few minutes to load but who cares?  This is like the best Christmas present I have ever bought myself.", "verified": true, "helpfulness": "0/0", "author": "R. Reed"}, {"rating": 5.0, "review": "Love it! It's so cool and even i can understand how to use it. I'll be enjoying it from now on", "verified": true, "helpfulness": "0/0", "author": "jodie ritcheson"}]