[{"rating": 4.0, "review": "All in all, I find that the Fire TV stick is less intuitive and user-friendly than the Roku stick.  It works, it does everything Roku does (and some Amazon specific things Roku doesn't), but it takes some time to get it set up and learn how to navigate properly.  It is fast and portable and works well with Netflix.  The one thing it has over Roku, however, is portability.  All in all, I would normally give this 3 stars, compared to a Roku stick, but added one star for portability.  To go portable with Roku, you have to bring a router with you and the remote.  I got the Fire TV Stick because my family can take it with us when we travel, connect to any wireless network , and we can use the smartphone app in case we forget to bring the remote.  In the arena of portability, the Fire TV Stick is king.", "verified": true, "helpfulness": "0/1", "author": "Joshua McGough"}, {"rating": 5.0, "review": "Excellent and very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "ZIAD E."}, {"rating": 4.0, "review": "It works as advertised.  It is on a HDMI switch, has to be reset after switching to the Firestick.", "verified": true, "helpfulness": "0/0", "author": "R. O. Davis"}, {"rating": 5.0, "review": "I love my amazon fire stick so much I purchased this one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "S. Stone \"Stone\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 3.0, "review": "WiFi strength not as strong as my laptop!", "verified": true, "helpfulness": "0/0", "author": "Comrie R."}, {"rating": 1.0, "review": "It glitches out constantly while using it and then speeds through the next scene. We have a roku and a roku stick as well and they never cause issues but the fire stick isn't worth the buy.", "verified": false, "helpfulness": "0/1", "author": "Anonymous"}, {"rating": 5.0, "review": "Great little device for a reasonable price. I love the display mirroring.  Integrates well with my kindle fire. I hope they have more native apps for this in the future.", "verified": true, "helpfulness": "0/0", "author": "L. Peckyno"}, {"rating": 5.0, "review": "Easy to set up.  Enjoyed a movie without a problem.", "verified": true, "helpfulness": "0/0", "author": "Marianne"}, {"rating": 4.0, "review": "I have had a Roku for several years and really enjoyed it so I was hesitant to change products. However this was included in the Amazon sale and I figured for the price it was worth trying. I am SO glad I did. I really like all of the different types of apps (games, yoga, music, etc) you can use with it and as well as the remote app for your phone. It is a little slower than my Roku box but nothing that gets in the way of binge watching. It is geared toward Amazon Prime TV/videos/music so if you are not an Amazon prime subscriber this might not be the best product for you.", "verified": true, "helpfulness": "1/1", "author": "Priscilla Page"}]