[{"rating": 3.0, "review": "For the price the Fire Stick is pretty good but it is not on par with its competitors at all. It lags response, loads very slowly, and is not intuitive enough for the everyone in the household to understand as they do the Apple TV. It requires a power cord to it to function on the device itself which oddly is harder to disguise than the hdmi for the Apple Tv since the Fire stick cord is too short for most tvs that are mounted higher than a coffee table.  The App control is good but also not as smooth as the competition. It is works fine for the price which is literally a fourth of its competitors price but does leave something to be desired. Love that I can finally watch prime content but I still choose Apple Tv over this. Last, the name is a bit embarrassing to tell people what \"I got\" in shortened form. I know the \"Fire\" Brand is Amazon, but I would have stewed over the name a bit more.", "verified": true, "helpfulness": "0/0", "author": "Barrett DeLong"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "adrien wade"}, {"rating": 5.0, "review": "The first one did not last 35 days. Hopefully, this one will last years. Amazon was great in getting us a new one. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Lorraine Mitchell"}, {"rating": 5.0, "review": "Love it can't believe i waited this long to own one!!!", "verified": true, "helpfulness": "0/0", "author": "froggythinking \"SH\""}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jessica Buie"}, {"rating": 1.0, "review": "It's not working!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Should help me decide whether to become a cord-cutter!!", "verified": true, "helpfulness": "0/0", "author": "S. Pittaway"}, {"rating": 5.0, "review": "Meets and exceeds expections.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install, lots of features, what's not to like!", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 5.0, "review": "All that and some.", "verified": true, "helpfulness": "0/0", "author": "Damilare Lawal"}]