[{"rating": 3.0, "review": "I love the fire stick but the remote is very touchy if you are sitting next to it and bump anything it stops or kicks you off program.  Overall though the fire tv stick is a great investment. I downloaded the phone app which has voice capabilities when you are searching for a title or person.", "verified": true, "helpfulness": "0/0", "author": "Karin M. Snitz"}, {"rating": 5.0, "review": "Great product and price. Best streamer on the market,", "verified": true, "helpfulness": "0/0", "author": "Blake"}, {"rating": 5.0, "review": "awesome kids can now take to their room to watch movies on TV they don't have cable in rooms.", "verified": true, "helpfulness": "0/0", "author": "d romanofski"}, {"rating": 5.0, "review": "Amazon fire TV stick is great thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Reuben E. Davis"}, {"rating": 5.0, "review": "Just amazing", "verified": true, "helpfulness": "0/0", "author": "Jenn Therrian"}, {"rating": 5.0, "review": "works", "verified": true, "helpfulness": "0/0", "author": "robert w jarrett"}, {"rating": 4.0, "review": "Very easy to use and install.  It isn't clear from the description that you do need power for this item, so be sure you have an open power plug in your entertainment power strip.  Set up was easy and straightforward and pretty intuitive.  Access to Amazon Prime programming was very easy.  Quite happy with this so far.  I wouldn't say the same for the iPhone App for controlling the TV Stick.  It is much less intuitive than just using the remote that comes with it.  That's why this gets four rather than five stars.", "verified": true, "helpfulness": "0/0", "author": "COS \"COS\""}, {"rating": 5.0, "review": "Quick and easy setup. Works great.", "verified": true, "helpfulness": "0/0", "author": "garrett"}, {"rating": 5.0, "review": "Great product! I plugged it in and it knew my name and already was set up. All I had to do was type in my wifi password and I was streaming Netflix and Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Robert S. Stockdale"}, {"rating": 4.0, "review": "This was easy to install.  I wish there were more movies and shows available.", "verified": true, "helpfulness": "0/0", "author": "j"}]