[{"rating": 5.0, "review": "I absolutely love this thing! The menu is incredibly snappy and responsive which is a major issue I have with one of my media boxes. It has a remote which is great too. It has an app for almost everything which is very nice also.I have a couple small issues that I've found annoying, but that don't take away from the device/service.1. Amazon music doesn't always work quite like it should. The repeat function sometimes doesn't work when using the firestick.2. Amazon music again... you don't get a nice browseable selection, you have to do searches. I'm sure this will be changed eventually.3. When it loses power mine lost my account settings for things like pandora and netflix and it all had to be re-entered.Those are relatively minor complaints though. The fire tv stick has taken over from our chromecast as our main media viewer. I still love my chromecast too, but having to have a smartphone/tablet/pc to use it is a little annoying.", "verified": true, "helpfulness": "0/0", "author": "Joleme"}, {"rating": 5.0, "review": "I love my Fire Stick! Easy to stream & download, kids like the games really well. Liked it so much I bought a second one for my other TV :)", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "Easy to use, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "victory"}, {"rating": 5.0, "review": "loving the speed", "verified": true, "helpfulness": "0/0", "author": "ajit"}, {"rating": 5.0, "review": "Great product! I like the Fire Stick a lot more than the Chromecast and Roku.", "verified": true, "helpfulness": "0/0", "author": "Rehan Ali"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I expected a powerful mirroring function, which can be replaced HDMI cable when I watch a movie. Even my internet speed is not slow, the quality is different from what I expected. Is there any method to get a good quality? Other service looks good.", "verified": false, "helpfulness": "0/0", "author": "HAE S."}, {"rating": 2.0, "review": "The stick is a reasonably capable device, it has more memory than most competition and more processing power too. The price of the power is that there is no way to power the stick off of the HDMI port and an external power supply is needed. The USB cable shipped with the stick is annoyingly shorter than most TV power cables. One may need to move stuff about or to buy a longer USB cable to power up the stick. Otherwise, the hardware is quite sound.The software is bad. The UI looks like it's been designed by the engineering team - there's a list of pages on the left and content pages on the right. Navigation is not intuitive at all, clicking up and down controller buttons changes almost the entire screen; each content page shows only a few oversized tiles forcing one to scroll left and right a lot looking for anything interesting to watch. Search is Ok, it finds what I look for, but more often than not I don't know what that will be and I just want to browse what's there. Netflix had figured out browsing a long time ago, Amazon should have copied what Netflix has.Then, the stick runs apps. Some are games, some are video players. Everything that is not Amazon is an app. I haven't yet found a way to pin an app to the top of the home screen. There is a section of \"things you did recently\" at the top of the menu, but it is just too volatile to be useful. I understand that helping out Netflix is not of the highest priority for Amazon, but having to scroll down a lot and then some to the right to launch a very popular app is just wrong. Roku has figured out the layout of the home screen a long time ago. Amazon should have copied Roku.The most annoying feature so far is \"parental controls\". The way it is done has no properties of parental controls whatsoever; instead, it is a PIN that locks everything. Seriously. Purchasing is not separated from viewing, free Prime videos are locked so when a kid wants to watch Spongebob I have to go downstairs and enter the flippin' PIN. I haven't yet figured out whether the PIN unlocks a single video, or it expires after some time, but I've had to run downstairs far too many times.I am fine with a PIN locking purchases and viewing of rated contents, but the blanket locking of everything does not fit any definition of \"parental controls\". I may be insane, but to me parental controls are viewing restrictions based on time and ratings, and reporting; Amazon doesn't have either.Also, kids rarely search, they browse. Browsing's bad. Netflix gives you a screen full of tiles that you may scroll up and down left and right.There is also an issue with the service in general. Netflix splits an account between users and every Netflix app asks \"who's watching\" before it spits out recommendations. Amazon annoyingly doesn't do anything like that. Everybody gets everything, all recommendations get mixed together.Playback is OK. Sometimes there are compression or frame loss artifacts here and there, but most of the time videos play nicely. Pausing, resuming, rewinding, etc. - all work just as they're supposed to.Except for having to supply external power, all my issues with the stick are in the software. Hopefully in time Amazon will figure them out. Most likely, by that time I'll have to buy a new device. For now I'll switch back to Roku, even though mine is prone to overheating.", "verified": true, "helpfulness": "10/10", "author": "P. Karpenko"}, {"rating": 3.0, "review": "not enough free tv programs yet unless I have not found them", "verified": true, "helpfulness": "0/0", "author": "william j bump"}, {"rating": 5.0, "review": "Exactly what I ordered", "verified": true, "helpfulness": "0/0", "author": "Hkonziee"}]