[{"rating": 5.0, "review": "We love this product! As a prime member I was fortunate to be able to order this during the $19 promotion and am very happy with the purchase. This streams effortlessly and we never have issues with this skipping or buffering. Amazing picture quality as well, definitely one of my favorite Amazon branded items.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "I bought this a little skeptically because i bought a chromecast and returned because the streaming and casting via Wifi was horrible (pixelated, stopping). I figured with prime video available i'd give it a shot- and didn't want to spend extra on the full Fire TV. This streams as well as my hardwired Apple TV and older Roku (which i both really like fyi). No complaints whatsoever on Fire Stick. Once HBO Go arrives it's a no brainer!", "verified": true, "helpfulness": "0/0", "author": "W. Chase \"bchase2500\""}, {"rating": 5.0, "review": "I love it everything is at my fingertips..!!", "verified": true, "helpfulness": "0/0", "author": "Ms. Cartér"}, {"rating": 5.0, "review": "Entire family enjoys it. Great purchase, very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Love it ready to install highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick right when it came out.  I could not be more pleased.  The interface is straight forward and easy to navigate.  Since the device is small, it is great to take with you on trips and plug it right in when you get to your hotel.  I couldn't be more pleased.", "verified": true, "helpfulness": "0/0", "author": "Kerfeld"}, {"rating": 2.0, "review": "I am not very happy with the fire stick. It is very slow and my streaming gets interupted! Will be selling it and going to something else!", "verified": true, "helpfulness": "0/1", "author": "Rescuedpup"}, {"rating": 5.0, "review": "We love Amazon Fire Stick! Prime has great programming now, where as a year ago I didn't care for what I found there. I'm excited to finally have access to Netflix and Hulu in my bedroom, and I love that it has pretty screen savers.My favorite part is the iPhone remote app. Voice search has changed my life!", "verified": true, "helpfulness": "0/0", "author": "Denelle Pantleo"}, {"rating": 2.0, "review": "Easy to set up and, when it works, it's great!  Problem is that it won't hold an internet connection longer than 30 minutes!  Tried on my own several times after reading the on-line Amazon fixes, then called Amazon.  Customer service very helpful and, of course, it worked the entire time I was on the phone with them.  Ten minutes after hanging up - no connection!!  My wireless service is fine - something is wrong with the stick (yes, I was using the extender).  Returning it today - have to say again that Amazon customer service is terrific.  I won't hold this against them but do not recommend the Fire TV Stick - way too much frustration!", "verified": true, "helpfulness": "0/1", "author": "Carla Childress"}, {"rating": 4.0, "review": "It's great i like it a lot i was hoping to have more and newer movies but it's all good I enjoy it still and I recommend people to buy it , it's fun to have it ...", "verified": true, "helpfulness": "0/0", "author": "fahtiger76"}]