[{"rating": 4.0, "review": "It's a great item for watching hulu, netflix, and Amazon Prime. Few downsides: you can't Cast tabs like like you can with Google Chromecast and apps like Vudu are not available.", "verified": true, "helpfulness": "0/0", "author": "GameGenie"}, {"rating": 1.0, "review": "the stick worked fine at first .. after a couple of days the Netflix app started freezing..as if that wasent enough it started dropping connection after 15-20 minutes.. everything became unavailable. when i went and checked my network setting, my connection status had full bars but it said connectivity issues.. i went ahead and reboted the device  and it was fixed.. 20 minutes later connection dropped... I got the apple tv and it works perfect! havent had any issues.. It's true you get what you pay for.. Fire TV two thumbs down..", "verified": true, "helpfulness": "1/1", "author": "arash rohani"}, {"rating": 1.0, "review": "Having issues with Netflix and Plex buffering.  I replaced a Roku device with the Fire TV Stick (The Roku was moved to connect to a non HDMI television).  While the Roku worked flawlessly with both Netflix and Plex, the Fire stick is constantly buffering, sometimes after 10 to 15 seconds of playback.  I inserted the extension cable hoping to improve reception, but regardless of the position of the device the buffering remains the same.  I have tried everything I could find to try, clearing app data - power cycling the device, etc... but none of those fixes seem to get me more than 5 or 6 minutes of playback before it begins to buffer again.  Haven't suffered through trying to watch something this much since I was connecting with my 56k modem - extremely frustrating.", "verified": true, "helpfulness": "1/1", "author": "R. Hensel \"Ric\""}, {"rating": 5.0, "review": "Amazon didn't let us down here, quick HDMI stick with many features. Love it", "verified": true, "helpfulness": "0/0", "author": "joshmoulton"}, {"rating": 5.0, "review": "Works great. Did not have to plug it in into outlet.", "verified": true, "helpfulness": "0/0", "author": "JAFO2011"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "This little stick works great for us. We dont have cable or satellite but along with an HD antenna, it fits our needs. If you are subscribed to netfilx or prime you can still watch movies. There are a few apps that are free like PBS, History (with limited viewing), Crackel, A&E;,NFL & others. The only cons I have experienced is the loss of internet connection, which I have to unplug the stick & plug it back in to get back the connection & some apps tend to buffer quite often but it might be my internet connection & not the stick, since it's happened with other devices as well. The picture quality looks great, my family enjoys it, I would recommend it!!", "verified": true, "helpfulness": "0/0", "author": "j1374"}, {"rating": 3.0, "review": "Noticeably slower than the FireTV and with a much weaker wifi antenna. It was worth the promo price, but I gave one of these to a relative and they had to buy a wifi range extender to get enough signal to it (wifi on my phone at the same location was fine), so it ended up being quite a bit more than the cost of the stick itself.", "verified": true, "helpfulness": "0/0", "author": "Travis Prebble \"attention span deficient\""}, {"rating": 4.0, "review": "We had been using a computer hooked up via HDMI to watch Netflix, Hulu, and other streaming services. This worked fine, but we had not way to remotely control it and as much as I am a proponent of being active, it was a little annoying to always need to physically get up and go back and forth from the computer to pause, play, and other manipulations. So when we saw the Fire TV stick, we decided it needed to be tried.We have been mostly pleased so far. It has Netflix, Hulu, ESPN, and other apps which comprise most of our viewing diet. It is relatively easy to set up and get out accounts registered for each, the Amazon Prime being automatically registered upon ordering and making setup a little quicker.Our primary disappointment would be the WiFi receiver on the device. It does not behave the most reliably and has dropped our home network a couple times despite the network working perfectly. This did require a reboot via unplugging the power adapter and removing the stick from the HDMI port for a moment. But that has not recurred recently.All in all, a good value solution to bring streaming services to those who do not have a smart TV.", "verified": true, "helpfulness": "3/3", "author": "SeanDom"}, {"rating": 2.0, "review": "I really WANT to love this device.  It's serving as a replacement for our XBox, which had really become nothing more than a Netflix/Prime video utility. The interface is great.  The integration with the Prime services is fantastic.  I really like the mobile remote interface.  All around just great, BUT....My problem is that it just seem flake-y. nondescript i know.  I have constant buffering problems with the device.  Doesn't matter what service/app i'm using.  It's not consistent, some times i'll get 2/3s of the way through a show or movie.  Sometimes, i can get enough buffering to start a song in pandora or amazon prime.  Physically unplugging the device and then plugging it back in has worked every time.  I've done what i consider to be a ridiculous amount of troubleshooting including: different access points, different physical locations, different power cables, different network configurations, all to no avail.  I have zero problems streaming from other devices, like the xbox located ~2 feet away using the same access methods.Maybe it is just me.  There's some network configuration i've overlooked, or some really finessed interference that i can't find or 'see' with any other device or utility.  But to me and all who've helped me try to diagnose the issue it certainly APPEARS that the Fire TV Stick itself is the source of the issue.Maybe a software update is due, and it'll make the device as awesome as i expected it to be.  It'll be a 4, maybe 5 star-er if that ever happens.", "verified": true, "helpfulness": "2/2", "author": "Shea M Brennan"}]