[{"rating": 4.0, "review": "I am disappointed that I don't seem to be able to use my Acorn subscription on the Fire TV stick. Otherwise it seems great. Better than anything at the price.", "verified": true, "helpfulness": "0/0", "author": "Roman B. Hedges"}, {"rating": 2.0, "review": "Stick meant my requirements, do not appreciate the fact I was charged for Amazon Prime without my consent or knowledge of it", "verified": true, "helpfulness": "0/0", "author": "Javon Small"}, {"rating": 5.0, "review": "These things are great!", "verified": true, "helpfulness": "0/0", "author": "jetpackjones"}, {"rating": 5.0, "review": "Was a gift and we are so happy!!!", "verified": true, "helpfulness": "0/0", "author": "mmrr"}, {"rating": 5.0, "review": "great!", "verified": true, "helpfulness": "0/0", "author": "Theresia Mason"}, {"rating": 1.0, "review": "Day one works great!!!!! HAPPYDay two HDCP unauthorized content disabled blue screen, but hey i can hear my movie.  NOT HAPPY!!!will be returning.do not buy unless you have a brand new tv close to your router and even then good luck.", "verified": true, "helpfulness": "0/0", "author": "andrew sabin"}, {"rating": 5.0, "review": "Great device! Love how easy it is and being able to move it between TV's!!", "verified": true, "helpfulness": "0/0", "author": "Bruce Johnson"}, {"rating": 5.0, "review": "This has far exceeded my expectations. Great user interface.", "verified": true, "helpfulness": "0/0", "author": "Heriberto Soto \"SotoAmerica\""}, {"rating": 5.0, "review": "A little slow to load sometimes but we really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Mary Baxter"}, {"rating": 3.0, "review": "Really limited in the number of available resources...HULU plus, netflix,  amazon prime and videos..heart radio and some children's programming.  I try to control the stick with my fire and it won't recognize the fire much of the time.  I have to exit a program and re-enter.  The remote is simple..too simple....using the keyboard with the remote is a nightmare of mistakes and repitition.  It isn't ROKU for sure and doesn't begin to compete with my smart tv....but the price is right and the stick has some limited use on my bedtime tv.  I'm unsure at this point if I would have ordered it had I known it's deficits.  It definitely isn't up to the standard of  Amazon's other fire devices.", "verified": true, "helpfulness": "0/0", "author": "montanamarge"}]