[{"rating": 5.0, "review": "Easy to install, easy to use.We love it!", "verified": true, "helpfulness": "0/0", "author": "Cara"}, {"rating": 1.0, "review": "Netflix lags constantly, have not found a suitable solution", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 2.0, "review": "I have Chromecast on another TV and thought I'd try the Fire Stick. It was OK at first but now as you watch it the videos will freeze, the audio continues and then the video fast forwards to catch up. This happens about 5 times per 30 minute show. It's very annoying. I wish I had purchased another Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Pat Brown"}, {"rating": 2.0, "review": "I have had trouble with both of my fire sticks. At times it gives a message across the screen saying console disabled, you can hear the movie/show but you can't view it. And for the first time ever Amazon did not make it easy to get a replacement. It's very disappointing.", "verified": true, "helpfulness": "0/0", "author": "V. Debree"}, {"rating": 3.0, "review": "Works great  with Amazon prime, but cannot get it to connect to Netflix", "verified": true, "helpfulness": "0/0", "author": "Jean Krauss"}, {"rating": 3.0, "review": "Gets really hot! I like all the features and stuff but worried its going to break really fast.  I've had it for 30 hours now. I slept for 4 hours with it in sleep mode and touched it and it was really warm. So i unplug it to cool.  The next day i ran screen mirroring, after 40 minutes its out of microwave hot. My phone gets warm when mirroring,  but the streaming stick it up to 6 times hotter than the phone", "verified": true, "helpfulness": "0/0", "author": "kittycat"}, {"rating": 5.0, "review": "I received Fire Stick as a gift and yes, it does meet my expectations,  love it.", "verified": true, "helpfulness": "0/0", "author": "Eileen"}, {"rating": 5.0, "review": "Can watch a variety of things.", "verified": true, "helpfulness": "0/0", "author": "Dawn Caldwell"}, {"rating": 2.0, "review": "If you live in USA, OK, great item. If not so, then it is nothing more than a netflix viewer, which your smart tv can do without problems.", "verified": true, "helpfulness": "0/0", "author": "fernando lopes de barros"}, {"rating": 4.0, "review": "Very easy to set up, every thing is there to use!  The down load is choppy sometimes is the only down fall so far", "verified": true, "helpfulness": "0/0", "author": "Scotty B"}]