[{"rating": 5.0, "review": "Works as its supposed to.  Easy set up, easy to use.  Does lose internet connection quite often, but as I have that problem with my Blu-Ray and Google Play as well, I suspect it's my set up and not the device.", "verified": true, "helpfulness": "0/0", "author": "Suzanne"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Jarrod J."}, {"rating": 5.0, "review": "We don't even need cable anymore!  We love our fire stick!", "verified": true, "helpfulness": "0/0", "author": "Troy"}, {"rating": 5.0, "review": "Product just as described, and fast shipping. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Paul dolen"}, {"rating": 1.0, "review": "When it works, it works well...BUTIf you don't access it on a regular basis, it drops its wireless connection, and WILL NOT re-connect, even if the wireless router is a foot away. It requires a complete power-off restart, which is a PITA in my setup, and even an occasional delete and re-entry of my router credentials.Roku work much better...", "verified": true, "helpfulness": "1/2", "author": "Jim Mayhugh"}, {"rating": 1.0, "review": "Kept buffering and saying that there was no network connection, yet it said it had very good signal. Would get partially through a show then buffer for 20 mins. My smart tv and all other devices in the house have no problems with the same connection. Followed all trouble shooting and still no improvement, I returned it, I was so excited about it but didn't work.", "verified": true, "helpfulness": "1/2", "author": "WomanofGod"}, {"rating": 5.0, "review": "The Fire TV stick is simple and very user friendly. I was hoping it would allow you to stream from a nearby computer as well as provide in-house apps, but even without that feature this item is worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great - I was given one as a gift and now have given my Grandson one for his birthday.  Amazing amount of entertainment and very reasonable cost for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "ST"}, {"rating": 5.0, "review": "I love my Fire Stick.  So easy to use and I can get just about anything I want to watch. I never have to hook my laptop up to the TV ever again to watch movies.  It's fast and easy.", "verified": true, "helpfulness": "0/0", "author": "william whittemore"}]