[{"rating": 5.0, "review": "With prime this is an amazing deal! I have already got lost in many tv shows. Easy to use remote and great to play my Amazon music through as well", "verified": true, "helpfulness": "0/0", "author": "jessd1579"}, {"rating": 5.0, "review": "Works great and a good price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super cheap and works great.  Have loved using it at home to watch Amazon Prime Video.", "verified": true, "helpfulness": "0/0", "author": "Joshua Jacobsen \"drowlord@drowlord.com\""}, {"rating": 5.0, "review": "Love the Firestick - I can catch up with favorite TV series and movies I've missed. And it's easy to use, even for a technology neophyte like me!", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "Very easy to set up and so convenient to stream on any TV!! Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Tanya Daigneault"}, {"rating": 3.0, "review": "First off, I'd like to say I got this device day one and have used it regularly since and I think it's a safe time to review the device now.Pros:Experience is smooth most of the time, but stutters here and there under some circumstances (seemingly random, still investigating causes)Beautiful user interfacePackaging looks great, pulled everything outta the box, just plug and playnice little cartoon on first start up on how to operate the device, can be re-accessed at a later time in the settingsCons:A lot of the apps that are available on the Fire tablets are strangely not available on Fire TV Stick. I'd imagine they share essentially the same pool of apps. With the amazon app marketplace already limited filtered with it's modified android os, mojito, with this additional layer of filter makes the apps available for Fire TV Stick very limited. Probably even less than Windows marketplace! For example, I can watch Crunchyroll on my HDX (yay anime! premium user here btw!) but can't seem to download the app for the TV Stick.Plus there is no search function for apps, so you have to manually select categories and sift through each, and, every, single, app within that category.It's unusually difficult to put the TV stick to sleep, and I mean sleep, not turn off. You have to scroll all the way down to the settings, then pan all the way to the right to reach further settings options to put the device to sleep, otherwise you will have to wait about 15-20 minutes for it time-out in screen saver mode. I suppose this can be a positive since being asleep makes it boot significantly faster, but personally I like to be environmentally mindful and have the option to just completely turn off the device. So I find myself flipping the switch of the surge protector that the TV Stick is connected to occasionally.Sometimes the TV Stick will randomly drop connections. I have to manually reboot the device to rediscover the WIFI signal and successfully connect again. Can be annoying.I don't know if it's just me, but sometimes while using the remote, I find myself having a hard time gripping the remote and it sometimes slips or falls out of my hand!The Verdict:the device has a lot of potential and provides great ease of access to amazon content as well as a limited other streaming services, however it isn't nearly as robust in it's market place versus the competition though that may very much change in the foreseeable future. There still seems to be some bugs and certainly not everything has been optimized, but overall, the experience has mostly been enjoyable for an incredible value.", "verified": true, "helpfulness": "0/0", "author": "2woYoung"}, {"rating": 4.0, "review": "It is so easy to install.  It came on time packaged for safe shipment.  The stick with remote is so easy to navigate", "verified": true, "helpfulness": "0/0", "author": "Judy Davis"}, {"rating": 5.0, "review": "I wasn't expecting it to be this good, even after I ordered it.  I was using Amazon app in my Samsung smart before for browsing and watching my prime videos. Now that apps look so bad before this stick. So easy navigation, super quick response, it can pull video and audio from my amazon cloud drive and I can use voice commands from the fire tv mobile app.  Great buy.  I hight recommend for any prime members.", "verified": true, "helpfulness": "0/0", "author": "San"}, {"rating": 5.0, "review": "Better than Roku, and that takes some doing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lorax niner\""}, {"rating": 5.0, "review": "Oh my goodness!  What an awesome little gadget!  We LOVE the Amazon Fire TV Stick!  It's easy to set up and use- it's very cool!", "verified": true, "helpfulness": "0/0", "author": "Deborah R. Blackmarr"}]