[{"rating": 2.0, "review": "It had problems with disconnecting to our network. I would have to unplug the charger cord to the fire stick for it to reconnect. It got old doing it several times so I sent it back. Would not buy again.", "verified": true, "helpfulness": "0/2", "author": "Sammy"}, {"rating": 5.0, "review": "Terrific and fun....", "verified": true, "helpfulness": "0/0", "author": "Audio-file-Tom"}, {"rating": 3.0, "review": "Received the unit three days ago.So far so good", "verified": true, "helpfulness": "0/0", "author": "trujilo."}, {"rating": 5.0, "review": "Bought this as a Christmas gift for my dad and he loves it. He's an action movie junky and is on Netflix all day. The fire stick is easy for him to navigate and understand. The picture quality is great after you readjust your settings (picture comes out pretty dark at first).", "verified": true, "helpfulness": "0/0", "author": "Ashley Dante Albao"}, {"rating": 3.0, "review": "Took days to figure this out and the fix is to simply to reset your smartphone. No one seems to have reported this problem so here goes.Netflix video and audio stutters right from the get go and was unusable. The mobile app remote did not see the FireTV stick either. Wasn't able to fix it after testing it with different routers, and different internet connections.The main problem seems to be related to the remote app being stuck in some weird state and a simple reset of the phone fixed it. I am on a Samsung S3 android.Other than that, this is a decently valued device other than:1) The initial setup is HORRIBLE... how do they expect people to type in a long password for the WIFI with a keyboard layout like that. Forgot exactly how chromecast worked but their approach was much easier with connecting to the phone first and let users TYPE the password in.2) That ridiculous setup video you are forced to watch.", "verified": true, "helpfulness": "0/0", "author": "vince lau"}, {"rating": 4.0, "review": "The Fire TV stick works as anticipated.  I am disappointed that a number of movies we wanted to see are not covered by Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works just as advertised. Because I'm a Prime member it came setup for me. A true \"plug and play\".", "verified": true, "helpfulness": "0/0", "author": "John G."}, {"rating": 4.0, "review": "The Stick worked great at home, but when I moved to college I could no longer use it since it must be connected to Wifi and most University Wifi passwords require to put an identity and a passcode, and there is no way to put your identity it is useless while I am away from home. If this could be fixed in any way, then this would be perfect.", "verified": true, "helpfulness": "0/0", "author": "melchor"}, {"rating": 5.0, "review": "Got this for my son and he LOVES it! He even gave it a tweet on Twitter!", "verified": true, "helpfulness": "0/0", "author": "G L Childress"}, {"rating": 4.0, "review": "This thing is cool!  I have a couple Roku's, and had been looking for something smaller in stick format when this was released so I jumped on it and am very happy so far!  It is geared toward Amazon of course, but HBO GO is coming, Netflix is nice, and I also like the Pandora app on there and the Prime Music integration too!  Overall, a great little stick with a remote.  My only beef is that it requires external power...nice device tho and I'm very happy with my new Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]