[{"rating": 1.0, "review": "Screen sharing doesn't work. It's documented to have worst latency by people who have gotten it to work. I want root access to install system drivers for a few BT devices as well, but Amazon updates prevent me from getting root access. You might as well get a chromecast or other device.", "verified": true, "helpfulness": "0/0", "author": "Rahul Bhandari"}, {"rating": 5.0, "review": "I am not a tech-savvy person, but I do love convenience. So, when a gadget promises convenience, I weigh the benefit vs. how hard is the gadget going to be learn. My final assessment: oh, how grand the Fire TV Stick is! All of my favorite streaming channels are at my fingertips - Crackle, Netflix, Amazon Prime (obviously), and others I hadn't heard of (but are intriguing) like Drive-In Classics.Set up is basically plug in and go (I bought directly from Amazon so my account was pre-loaded). The remote is very easy to use. I also uploaded the remote app to my android phone to utilize voice search - which was also very easy.The only question I have is why did I wait so long to get it?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Thoeun24"}, {"rating": 4.0, "review": "Best TV streaming stick (not device), 1 thing missing, i wished that you could paired bluetooth audio devices to it, like the Fire TV, then i would have give it a 5 star.  i must mention this  about the quality of the remote control, is kinda cheap, in comparison with roku, which feels better in the hand and the buttons feels much \"clickier\". but in my opinion overall  the fire stick  is a much better device  than the roku stick. and it is cheap.", "verified": true, "helpfulness": "0/0", "author": "Anthony Wong"}, {"rating": 5.0, "review": "This was an amazing addition to our tv watching.", "verified": true, "helpfulness": "0/0", "author": "Marie Pilato"}, {"rating": 5.0, "review": "Easy to set up and use.  We all love it especially my 6 and 9 year old.", "verified": true, "helpfulness": "0/0", "author": "DK"}, {"rating": 1.0, "review": "Horrible. Threw them away the first day of use. They were only 20 dollars so much was not expected of this product.", "verified": true, "helpfulness": "0/0", "author": "Les"}, {"rating": 5.0, "review": "Love my Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "karen kellerman"}, {"rating": 5.0, "review": "The Fire TV Stick is fantastic!! It was so easy to install, it took me 5 minutes! Easy setup and it works great. I easily downloaded Netflix and my Amazon Prime Video library was right there when I installed it! Can't be the price!", "verified": true, "helpfulness": "0/0", "author": "Joanne C. \"Joanne Cerreto\""}, {"rating": 5.0, "review": "The best way to stream media.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]