[{"rating": 5.0, "review": "Best nerd toy ever! At first I couldn't imagine how it was going to improve our TV watching & once we had it installed- an all of 30 seconds to install- plus into the ubs port on the side of the TV & an electrical outlet. It works with our Amazon Prime account & we are watching programs & movies we love instead of the junk on regular TV. Being handicapped I love being able to watch decent fun programs during the day. I loved it so much we now had 2 so we can leave them plugged into our TV's & bought one for my daughter too!", "verified": true, "helpfulness": "0/0", "author": "Francine Warren"}, {"rating": 4.0, "review": "Easy to install and set-up. My Wi-Fi sucks so it does impact the streaming of Netflix, but I like that this is compact and easy to move around or take with you on travels. No more moving around my Blu-ray equipment to stream Netflix. It also makes it convenient to use the Fire TV Stick to stream AmazonPrime movies/shows and SlingTV. The Navigation menu takes some getting used to, but once you do, you are good to go.", "verified": true, "helpfulness": "0/0", "author": "Katherine C. Torres \"KatEyes\""}, {"rating": 3.0, "review": "The cheap option for Fire TV. I use it my bedroom where I occasionally watch a movie.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Fastner \"monkeyboy\""}, {"rating": 3.0, "review": "nice UI and seems very responsive to commands. Very weak wifi connection, constantly dropping connection.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "It's doing everything I could want. Was easy to install. Very easy to learn to use.", "verified": true, "helpfulness": "0/0", "author": "B. Johnson"}, {"rating": 5.0, "review": "totally love it! beats getting up and down to switch movies!", "verified": true, "helpfulness": "0/0", "author": "steve Maxfield"}, {"rating": 1.0, "review": "Kept shouting off", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "Great Value for the Price.My Son love's it", "verified": true, "helpfulness": "0/0", "author": "Victoria Fess"}, {"rating": 5.0, "review": "Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "Works very well.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Larry E. Shelton, Jr."}]