[{"rating": 1.0, "review": "Persistent WiFi connection failed message despite entering the WiFI password with the correct case. I have a smartphone and a tablet connected to this home WiFi network OK which is set up with Channel: 11, Security type: WPA Any. The Fire TV Stick sees the home WiFI network OK. Even tried enabling the Guest WiFI network with NO security, and got the same message. The NG7550 combination Modem\\Router is only about eight feet away from the HDTV Model E320-A0. Even tried the 2nd HDTV jack on the back of the HDTV, but the WiFi connection failed message persists. Do I have a faulty Fire TV Stick?", "verified": true, "helpfulness": "0/0", "author": "KI Time \"Unprivileged\""}, {"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Orson Blair"}, {"rating": 5.0, "review": "I have a Roku 3 for home, but I got this free with a Sling.tv subscription for travel and love it.  One key feature it has over the Roku is the ability to connect to hotel wi-fi that requires logging in or clicking accept in the browser.The user interface is clean and easy to use and the app selection is great.  Couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "J. Jenkins"}, {"rating": 5.0, "review": "Great product especially if you don't have a smart tv", "verified": true, "helpfulness": "0/0", "author": "Kenneth Robinson"}, {"rating": 5.0, "review": "Great little piece of hardware! I can get a lot more TV Shows and movies then before. I signed up for Amazon Prime and now I can watch all the movies available through Prime for free. Very easy to setup. Plug it in and it steps you through the setup process. It took me 45 minutes just to look through what was available. If I'd a know how cool this was I would have bought one long ago. (I won this one!)", "verified": true, "helpfulness": "0/0", "author": "Valkyrie"}, {"rating": 5.0, "review": "It works good", "verified": true, "helpfulness": "0/0", "author": "Patty Kent"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Gerald Newsome"}, {"rating": 5.0, "review": "BEST THING EVER! One payment and it's yours. So much better than Netflix!", "verified": true, "helpfulness": "0/0", "author": "Jess Tripp"}, {"rating": 3.0, "review": "I didnt know what to expect.  Works within my means.  Mahalo", "verified": true, "helpfulness": "0/0", "author": "Dani"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Alicia"}]