[{"rating": 5.0, "review": "Very pleased", "verified": true, "helpfulness": "0/0", "author": "John Zimmerman"}, {"rating": 5.0, "review": "This thing blows Roku out of the water.  It's intelligent and even integrates apps.  I love it!  I have a Roku and Apple TV and the Fire Stick is my favorite.", "verified": true, "helpfulness": "0/0", "author": "David G."}, {"rating": 5.0, "review": "I LOVE our Amazon fire Stick!  We mostly use it in our home, but is a must pack item for vacations!  Small, lightweight, fast processing and low price make this a great buy for anyone’s entertainment needs!  We also own a Roku 3, and honestly this little stick can match the mighty Roku quality and a much lower cost.", "verified": true, "helpfulness": "0/0", "author": "KPOB-TV"}, {"rating": 2.0, "review": "I purchased the Fire TV Stick in March 2015 through my Amazon Prime account.  It does not work properly and there is no way to return it for a credit or get any service as far as I can tell. The content does not sync.  I have tried every troubleshooting tip Amazon recommends.  None of them work.  It is very frustrating when the content does not sync.  The Fire Stick is also very temperamental.  The remote does not effectively navigate the screen and in many cases sticks.  When it finally unsticks, the curser races across the screen.  I would not recommend the device.  The ROKU is a much better product.", "verified": true, "helpfulness": "1/1", "author": "Speaker of the House"}, {"rating": 4.0, "review": "Love this! Best way to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Phillip Nordell"}, {"rating": 1.0, "review": "I was really excited for this product, I installed it per the instructions & kept it close to my wireless router. Close as in 7 inches away, where it is constantly disconnecting & claiming I have no internet when devices like my phone pick up the wireless connection a block away. This is not worth the money I paid for it", "verified": true, "helpfulness": "2/3", "author": "Ember M Seiler"}, {"rating": 5.0, "review": "Love it! A breeze to install.....works great!", "verified": true, "helpfulness": "0/0", "author": "Crystal C. Terry \"tropical fish lover\""}, {"rating": 5.0, "review": "This was perfect for utilizing my prime membership.  We used to attach the computer to the TV with an HDMI cable to watch prime movies, but it seemed to have all kinds of issues with interruption in viewing.With the stick, I can easily view selections and had no issues with viewing.  There were no interruptions or pauses which made the experience much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "MaryAnne"}, {"rating": 5.0, "review": "Worked very well.  Plug it in and follow the instructions!", "verified": true, "helpfulness": "0/0", "author": "SanFran"}, {"rating": 1.0, "review": "Too frustrating to use. Go buy a smart tv and save your sanity.1. Set up was a form of torture2. Every time I try to watch Netflix by the time I figure out how to get to a movie I just give up3. I have to put in the internet password every time4. That remote is too small for mY fat fingersI regret not spending the extra 200 dollars on a smart tv.", "verified": true, "helpfulness": "2/3", "author": "Patricia"}]