[{"rating": 5.0, "review": "After much frustration with my Samsung SMART TV losing its connection with my wireless router, a friend suggested I purchase an Amazon Fire TV Stick. Great decision! I now can watch Netflix and other internet apps without losing connection. Wish I had know about it sooner!", "verified": true, "helpfulness": "0/0", "author": "Ron Maz"}, {"rating": 3.0, "review": "The usage of the stick was fine and easy.  I bought this to watch Amazon VOD Prime videos.  The biggest issue is that the Amazon VOD app mixed paid and free content, so you get stoked on a show, only to find out that it's not a free show.The Netflix interface is better on the Apple TV gen 2, so I use that for Netflix instead of the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "matthew c bennett"}, {"rating": 3.0, "review": "Its OK for what it does, but I prefer the Chromecast.  If the phone\\tablet app had actual features like searching for titles and such it would be MUCH better.  Fumbling around with the remote is irritating.  Compared with the Chromecast where I can find what I want on my tablet and push it to the TV without disrupting what it currently playing.", "verified": true, "helpfulness": "0/0", "author": "AJ Fav"}, {"rating": 5.0, "review": "Works great!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Tracy L. Petersen \"Bobsey\""}, {"rating": 5.0, "review": "Perfect price for accessing Amazon Prime/Amazon content.  Great for access to apps like Netflix too.  Used on Sharp smart TV,  where Amazon app is not loaded nor download able.", "verified": true, "helpfulness": "0/0", "author": "Michael German"}, {"rating": 4.0, "review": "It is a good device and I would recommend it to anyone who wants to get more out of tv without paying an enormous and often unnecessary cable bill.", "verified": true, "helpfulness": "0/0", "author": "CiCi"}, {"rating": 4.0, "review": "It works well, user friendly, My kids use it all the time. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "drexican"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Norman Bobb"}, {"rating": 5.0, "review": "Love it.  Easy to set up. Works well with wifi and has everything u need. I've pretty much abandoned Apple TV at this point.", "verified": true, "helpfulness": "0/0", "author": "College Park"}, {"rating": 5.0, "review": "Super easy to install, and super easy to use! I don't have any kind of game system, so I'm super happy with this being able to actually watch tv on my tv!", "verified": true, "helpfulness": "0/0", "author": "Heather Jones"}]