[{"rating": 5.0, "review": "This is amazing!  I love it and want to get one for our other television", "verified": true, "helpfulness": "0/0", "author": "Pearlann"}, {"rating": 2.0, "review": "Didn't work well with my wireless router, sucky reception, going back to Netflix", "verified": true, "helpfulness": "0/0", "author": "Durman \"Kim\""}, {"rating": 5.0, "review": "Like it....", "verified": true, "helpfulness": "0/0", "author": "Steve Elder"}, {"rating": 5.0, "review": "i think everyone should get it", "verified": true, "helpfulness": "0/0", "author": "Ronnie Marshall"}, {"rating": 1.0, "review": "I cannot get the fire stick to work and play netflix", "verified": true, "helpfulness": "0/1", "author": "Todd DeBrozzo"}, {"rating": 5.0, "review": "I haven't had any issues with this disconnecting from the internet like I do with a different streaming stick that we have. This little gadget is definitely worth the price. Especially for anyone with Amazon Prime! I just realized the other day that all I have to do it push one button on the remote and it turns the TV on for me. This thing is great!", "verified": true, "helpfulness": "0/0", "author": "cwalt03"}, {"rating": 5.0, "review": "I like it...", "verified": true, "helpfulness": "0/0", "author": "CESAR LARRAZA"}, {"rating": 5.0, "review": "This thing is a great product. No issues yet.While it's perfect for things like Netflix and Hulu, it is the perfect place for use of the Plex app. If you have tons of Movie and TV files on your computer or a hard drive and you want to stream it to your TV, use Plex through this thing and it will do all the work for you. It automatically loads metadata from outside sources and gives you Episode Names, Descriptions, and any other info for all your shows and movies.This stick opens you up to several different ways of streaming your favorite media and it works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Joshua Michael Clements"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Sean j. Lee"}, {"rating": 5.0, "review": "WORKS AS PROMISED. This is a good product.", "verified": true, "helpfulness": "0/0", "author": "HT"}]