[{"rating": 5.0, "review": "awesome especially once you ad tvmc to it", "verified": true, "helpfulness": "1/1", "author": "Travis Faul"}, {"rating": 5.0, "review": "I like the fact that we can watch movies when we want to.", "verified": true, "helpfulness": "1/1", "author": "Barbara Scheuren"}, {"rating": 3.0, "review": "I am a little disappointed with the Fire TV Stick because I cannot get it to mirror my smart phone. The problem could be my WiFi router, I am not sure. Eventually I will replace my router and see if that makes a difference other than that it seems to work fairly well", "verified": true, "helpfulness": "1/1", "author": "William Russell"}, {"rating": 4.0, "review": "Easy to use.  Love the simple remote and navigation on the t.v.  Hate the buffering while watching things but that's with my internet.  The four stars is because of the lack of free shows/movies with Prime.  Disappointed that I could only get first three seasons of True Blood.  REALLY disappointed that I cannot watch regular channel shows unless I want to pay $3 for each episode.  That's $12 a month just for one month of one show like Scandal or Grey's Anatomy, ect... If I am going to pay $100 for another year of Prime, I should get at least the basic channels for free so I won't be renewing that and will be adding HuluPlus or Netflix so I can cancel my Dish.", "verified": true, "helpfulness": "0/0", "author": "lulupam"}, {"rating": 5.0, "review": "I was an early adopter of Chromecast, and a completely satisfied owner of three until a few months ago when updates made the old Droid 2 phones I was using as dedicated remotes obsolete for Hulu and Netflix.  The Firestick solved all those problems immediately with its apps and remote.  I do not have to worry about further updates either.  The price difference between the two is more than compensated with ease of use and extended capabilities.  I'm getting so much more from this device.", "verified": true, "helpfulness": "1/1", "author": "elicovington"}, {"rating": 3.0, "review": "None of the images, even on the box show that a power cord is needed. All my other cords are in the wall and not viable. It will be a major inconvenience to remove the TV from the wall and snake an extension cord up to power this devise.  The Fire Stick does work well and I am happy with the Amazon Prime and Netflix subscriptions. I think I would have gotten Cromecast which uses a USB port rather than an HTML port, eliminating the need for a power cord.", "verified": true, "helpfulness": "0/0", "author": "D. Sully"}, {"rating": 5.0, "review": "This stick is AMAZING.  My wife loves porn and she can now watch it everywhere she wants.  Its just plug and play and boom... PORN", "verified": true, "helpfulness": "1/1", "author": "SAMARIE"}, {"rating": 5.0, "review": "Very satisfied.  Syncs great with Kindle.  Well worth the price for the device and Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "peggy bluemer"}, {"rating": 4.0, "review": "This little thing is great! I finally have amazon prime TV and Netflix on the same device! The connection is always good (Internet depending of course) and it's pretty simple to navigate. It does plug in via HDMI and yes it does have a mini USB power cord port off the side of it that you need to use in order for it to work.  Amazon seems to still be leaving that part out of their commercials and advertising.So dumb me, just plugged the thing into the HDMI port and was wondering why it wouldn't work. Then I dug into the box more and found the plug and power cord (complete palm to forehead moment). Other than that snafu (which was mostly my fault) it has worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Loyal Amazonion"}, {"rating": 4.0, "review": "I like this thing but, after owning it for a month and three days, the left directional button is starting to rub on the controller, making me worry that further degradation will lead to a stuck button.", "verified": true, "helpfulness": "0/0", "author": "Burdenofhope"}]