[{"rating": 3.0, "review": "Good product for the price but lacks in certain features such as constantly needing to sign in of certain apps like HBOGO and Netflix. (I assume its because sometimes I use those apps on my PS3 and iPads and it locks you out).  The other downfall is that there is delay in functionality when you want to go to a certain screen, there is a little of a delay.  I have ULTRA fast WIFI in my house so I do not think it's the internet connection.  Once again, it's a good product for the price and it gets the job done.  I just wished it did not timeout and delay so much.", "verified": true, "helpfulness": "0/0", "author": "MTC"}, {"rating": 5.0, "review": "Love these fire sticks, I have 3. Super easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Karen C"}, {"rating": 2.0, "review": "Not what I expected especially the fact that you have to pay for or buy anything really popular that you want to view.", "verified": false, "helpfulness": "0/0", "author": "Edward L."}, {"rating": 2.0, "review": "As a Prime member, I bought this stick for 20$ during the Prime Day Sale. It worked great for about two episodes on Netflix, then it decided to start loading really slow and would not play back anything on Netflix. I even rebooted my internet modum and unplugged the stick from the TV. Same results. I ended up sending this back. Stick with the Roku Stick or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Lorri"}, {"rating": 4.0, "review": "I like it so far", "verified": true, "helpfulness": "0/0", "author": "Peaches"}, {"rating": 5.0, "review": "I had been using s chrome cast and find this to be an upgrade. I especially like the remote vs using myniPad.", "verified": true, "helpfulness": "0/0", "author": "S. Betts \"retired educational technologist who has \"gone to her dogs\"\""}, {"rating": 4.0, "review": "Pretty slick product.  Very easy to install and setup.  Did not give it 5stars because compared to Apple TV it is lacking in some areas.  I find it very frequently lags freezes when streaming video or movies.  I have very fast internet speeds (over 70mps download) and still the videos lag.  Also the way it displays the content can often be less than user friendly.Enough of the negatives...For the price and simplicity, this device is great.  I love that you can add different apps based on your needs.  The iPhone remote controller app also works very well!In summary, I would recommend this product but still prefer Apple TV overall.", "verified": true, "helpfulness": "0/0", "author": "R. Young"}, {"rating": 5.0, "review": "Amazing!  Access to movies, TV and my music. I uploaded photos so I can go through them while listening to my music. I use it every day.", "verified": true, "helpfulness": "0/0", "author": "Richard Hieb"}, {"rating": 5.0, "review": "My smart TV that I bought didn't have the ability to download apps and it only came with Netflix. By buying a firestick I was able to get Amazon Prime and Hulu plus. It is awesome! Easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Scott Kalb"}, {"rating": 4.0, "review": "Great!  Wonder if the bigger model (more $$) is any more reliable or if it's just my wifi service.  Decent selection of Prime videos.", "verified": true, "helpfulness": "0/0", "author": "H F"}]