[{"rating": 5.0, "review": "Love it, so easy, works great, SO much less expensive than cable or buying a blueray player.", "verified": true, "helpfulness": "0/0", "author": "dke64"}, {"rating": 3.0, "review": "Work very good, I have trouble in beginning because my Internet,  after I fixed now is perfect,  I recommend,", "verified": true, "helpfulness": "0/0", "author": "lucia tanis"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Barbara Hisaw"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "David Dobney"}, {"rating": 5.0, "review": "Love LOVE LOVVVVE this thing, great product, easy use...you'll probably want get Netflix acct too. They go hand in hand...", "verified": true, "helpfulness": "0/0", "author": "amarie2009"}, {"rating": 4.0, "review": "This is a good device with a minor issue.  If it is plugged straight into your hdmi port you may get a bad internet connection and the device would be virtually unusable.  This is resolved by using the extension dongle included, it just takes away from the neat and streamlined appearance of plugging it in directly.  Initially some apps worked poorly and would eventually freeze, but this seems to have been resolved, likely just updated to the apps.One great thing about this device is that with the plex app, I am able to stream video files from my computer to the tv.", "verified": true, "helpfulness": "0/0", "author": "Christopher Kulink"}, {"rating": 5.0, "review": "Attention all owners of \"Dumb\" TVs! This is the only box/stick you'll ever need! I own a Roku and Chromecast, have Netflix and am a Prime member. This little thing has it all. Bottom line I think is the navigation is just easier and better than other devices. The ability to use my phone as a keyboard (with the Fire TV app) makes text entry a breeze. Just received the game controller and looking forward to trying it out. So if you don;t have a game console to access the apps, not crazy about Chromecast, or are not happy with the apps that came with your \"Smart\" TV, give this a try.", "verified": true, "helpfulness": "0/0", "author": "John in Missouri"}, {"rating": 5.0, "review": "Love my firestick!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Will be ordering another soon!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Howe"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "M. S. Andre \"stay at home mom\""}]