[{"rating": 5.0, "review": "LOVE IT.so much better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "ELG"}, {"rating": 5.0, "review": "Love the Fire stick and highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "malinda smith"}, {"rating": 5.0, "review": "Everything I could've hoped for.", "verified": true, "helpfulness": "0/0", "author": "Mitchell Jackson"}, {"rating": 5.0, "review": "Very happy with Fire Stick. Lots of options to watch. Some of the movies are way too old though. Would recommend!!!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "This exceeded my expectations. Admittedly I use this for a limited set of features - primarily as a client for a Plex server and also occasionally for the Amazon TV - but I can say that it excels at those two things. It replaced an older Google TV box from Sony (NSZ-GS8) and it is significantly faster when loading media from Plex.There seem to be no problems with the wireless connection. The interface is smooth. App run smoothly.Overall, I'm very impressed!!", "verified": true, "helpfulness": "0/0", "author": "Richard S."}, {"rating": 4.0, "review": "Seems to be great but from time to time it has difficulty connecting but after a few tries it eventually connects", "verified": true, "helpfulness": "0/0", "author": "tonyallen007"}, {"rating": 5.0, "review": "This thing is super cool!! Works great and fun for the whole family.", "verified": true, "helpfulness": "0/0", "author": "James D."}, {"rating": 1.0, "review": "I bought this so I could cast from my tablet to the big screen, only one problem, it doesn't work!!!", "verified": true, "helpfulness": "0/1", "author": "Scott Fischer"}, {"rating": 5.0, "review": "I bought this on a whim when it was offered at a discount.  Loved it so much I moved it upstairs to a different tv and bought the Amazon Fire TV for my family room.  It was easy to setup and it works great.  I have two complaints though.  It always reverts to Amazon Prime items and HBO Go is not available for it.  There is an Iphone app that makes using this extremely easy.", "verified": true, "helpfulness": "0/0", "author": "Lifeski \"Lifeski\""}, {"rating": 5.0, "review": "We were considering buying a Smart TV for one of our other rooms, as we have a Smart TV for our main room. This was the perfect solution, as we have too many TVs now! The Fire Stick was easy to set up, there were not issues with connecting it to our internet. I have always been an Amazon prime member now I enjoy the movies on my TV. Perfect Amazon and thank you for this wonderful alternative!", "verified": true, "helpfulness": "0/0", "author": "Clavon M. Herr \"CMH Accounting Solutions\""}]