[{"rating": 3.0, "review": "This is a great idea, especially if you are a dedicated user of Amazon's streaming video and audio services.  I'm not a big fan of the way the interface works.  So far it keeps losing connectivity with my wifi network which sits on the other side of the bedroom wall and connects very well with computers, cell phones and the Roku box I also have.  Since I didn't have time to play around, I simply left it hooked up hoping to get back to it when I have more time.  For the money, it might be worth a shot.", "verified": true, "helpfulness": "0/0", "author": "Protect Lift"}, {"rating": 5.0, "review": "best tv stick out there", "verified": true, "helpfulness": "0/0", "author": "Timothy Ford"}, {"rating": 5.0, "review": "worked great.  Just watched all the Harry Bosch episodes of Season 1.", "verified": true, "helpfulness": "0/0", "author": "hjhhhhh"}, {"rating": 5.0, "review": "I love my firestick", "verified": true, "helpfulness": "0/0", "author": "Julian Sutton \"Jayo\""}, {"rating": 5.0, "review": "Turn on your life, turn off commercials! You watch what you want, if you have Amazon Prime, you'll have plenty to watch! You control the choices, the time, the whole nine yards! Honestly, it impressed me so much, I bought a second one!", "verified": true, "helpfulness": "0/0", "author": "Calvin"}, {"rating": 1.0, "review": "The fire tv stick that I received did not work- I spent almost three hours trying to get it to receive an internet signal, and found that only two of the buttons on the enclosed remote actually worked. I am sorely, sorely disappointed, as I had purchased this for my mum and I to watch together. I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Mermaid Lady"}, {"rating": 4.0, "review": "Great product, world great! Wanna turn your tv into a smart tv Fire stick is the way to go!", "verified": true, "helpfulness": "0/0", "author": "Marvin Vincent"}, {"rating": 3.0, "review": "Need better selection of movies", "verified": true, "helpfulness": "0/0", "author": "sean bryant"}, {"rating": 3.0, "review": "Amazon had no inventory so I had to buy it locally. Strange that they should be out of their own product and have a 4-week wait time. Connection was quick and straight forward with no problems. Overall I'm happy with it but there are a couple of issues. First, it does not work with my Logitech universal remote -- bummer. Also, I've had it freeze up several times during the past month then did nothing logical that corrected the problem, but it just began working again after several minutes.In addition, I wish I could isolate items that are included with Prime from all others. It'd save a lot of time looking into something then finding out it's not included in Amazon Prime.Finally, too many TV programs are season one only, with Prime. Additional seasons cost more $$.Advantage of some other services are that you pay a subscription then watch everything they have to offer.As you can tell, I have mixed emotions about the stick. But, it's one step toward getting rid of the $100/month satellite service. I expect a digital antenna plus another service (Netflix?) will put me where I want to be.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not exactly sure what I bought when I only bought the stick and not the prime. No clear description.", "verified": true, "helpfulness": "0/0", "author": "Cindi"}]