[{"rating": 1.0, "review": "No podcast app yet. Doesn't seem to be on Amazon list to make it better with software updates. No 1080i support for older televisions. Should of bought 1 of the other sticks. I still use my Roku version 1 (first ones) over the firestick. Netflix is letterboxed 720. Only positive things I can find, the twit app and it was only $20.00 on sale. Not real useful with a iPad, I thought they were going to update it so you could run the iPad screen through it. Oh well, they should call it the prime stick.", "verified": true, "helpfulness": "0/0", "author": "Frank Mardel"}, {"rating": 5.0, "review": "I have a Roku 2(2015 version) and this.  I find them equally easy to use.  Since I use them mostly for movies this is great.  I bought it on sale which made it even better.", "verified": true, "helpfulness": "0/0", "author": "Average guy"}, {"rating": 4.0, "review": "I am more than pleased with my Amazon fire tv stick. For what I wanted it to do, it is a great device. To just provide  Amazon prime video streaming and cloud photo backup at an affordable price , this device is more than adequate. For now that is enough.  If I  want more capacity and features, I might upgrade to the Amazon fire tv box. But that is a bit in the future for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Hooray", "verified": true, "helpfulness": "0/0", "author": "Thomas Lee"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Daniel Garza"}, {"rating": 5.0, "review": "Have used minimally so far, but have been very satisfied with options and wide variety.  I do plan to visit a friend soon and wondered if I could use the Fire Stick there - internet/wi-fi is available.  It would be a great chance for Amazon to \"spread the word\" to potential new customers, if so.", "verified": true, "helpfulness": "0/0", "author": "L Bea"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 1.0, "review": "Did not work for me!", "verified": true, "helpfulness": "0/0", "author": "Robert W. Olson"}, {"rating": 5.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/0", "author": "Cindy Brokenshire \"Shopintildropin\""}, {"rating": 5.0, "review": "Easy to install and works well.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}]