[{"rating": 1.0, "review": "I purchased the Fire TV Stick back in October and it just does not work for me, despite it being located a mere 5--feet from my router. My delayed review is purely due to the fact that I was so disappointed with the stick's performance (or rather lack of it), that I threw up my hands in frustration and didn't bother even looking at it again until a couple of days ago. I was hoping that Amazon might have thrown out a fix but, nope, no go. I am just as frustrated over the Fire TV Stick's not being able to stay connected as I was the first time I tried it. FAIL! I am going to sticking to my Roku boxes which work wonderfully. I am glad I only paid $20 for it during the initial Prime offering. I would not recommend this to anyone.UPDATE: I was sent a Certified Refurbished Fire TV Stick to replace my non-working original and encountered the very same connection problems!  I will hold on, although with much frustration, as I have hopes that Amazon will one day come up with a solution. At this point I still would NOT recommend this streamin' stick.", "verified": true, "helpfulness": "1/1", "author": "Jeanne"}, {"rating": 5.0, "review": "Had a few problems getting our existing Netflix account to work. Had to get ahold of amazon customer service and worked with them for a half hour to get it to finally work. However once we got that issue figured out the fire tv stick has been wonderful for Netflix and Pandora. Haven't used it for anything else, so I'm not sure how other apps work.", "verified": true, "helpfulness": "0/0", "author": "Krista"}, {"rating": 5.0, "review": "Wonderful tool for the upstairs bedroom so I don't have to pay the cable company extra money each month for another cable box.  I have no issues using the remote with the Fire Stick behind the TV.  Controls are easy to manage the different home screen options.  My only recommendation for future Fire Sticks is to figure out a simple way to add a TV power and volume button controls.  Then it would be perfect", "verified": true, "helpfulness": "0/0", "author": "FreeRadical"}, {"rating": 1.0, "review": "We ordered two of these and they do not work! You have to keep cycling the power every few minutes. They lose wifi connection and are only 12 and 20 feet away from router. THE SIMPLY DO NOT WORK. Lost money on movies could never watch. Sold on eBay and put Roko back in. Now works perfectly.", "verified": false, "helpfulness": "0/0", "author": "DWHauck"}, {"rating": 3.0, "review": "I am very disappointed with the product in general.Always connects and disconnects from my wifi network.Yet my Kindle Fire HD has no problems with the connection while in the same room as the Fire TC Stick.Due to this problem I have not been able to watch anything using this device.", "verified": true, "helpfulness": "0/0", "author": "Bill-Devine"}, {"rating": 5.0, "review": "I absolutely love the Amazon Fire TV Stick and remote.  It was easy to install and a breeze to use.  No more Xbox and WE hooked up to my TV.  Awesome, Awesome, Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Debbie Howard"}, {"rating": 4.0, "review": "Find the remote for the Roku much better but all in all... it's good for less money", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The greatest stick ever!!", "verified": true, "helpfulness": "0/0", "author": "Joe Rodriguez"}, {"rating": 5.0, "review": "Great entertainment", "verified": true, "helpfulness": "0/0", "author": "Joseph Hilliard"}]