[{"rating": 5.0, "review": "So easy to use and install.  This is very user friendly and much more reliable than my smart tv function.  I love the fire stick for its compact size and ability to travel to multiple tv's and locations.  I will definitely be using this for a long time!", "verified": true, "helpfulness": "0/0", "author": "Erin Goelitz"}, {"rating": 4.0, "review": "Setup a little difficult. Documentation slight. Sometimes fails to recover from download delays, requiring power cycle to recover.", "verified": true, "helpfulness": "1/1", "author": "Shirley Alley"}, {"rating": 5.0, "review": "Started out to be just ok.  Must have made some improvements, now it's great. Cancelled all my premium cable channels", "verified": true, "helpfulness": "0/0", "author": "The Center"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is worth the small investment. I'm so tired of the movie channels charging me high prices for movies they continue repeating for the month. With the Stick, it was easy to hook up and I now have access to thousands of movies and TV popular series.  James", "verified": true, "helpfulness": "1/1", "author": "james l. tucker"}, {"rating": 4.0, "review": "I have a Roku 3 streaming box for my big living room TV and wanted something for my bedroom when I moved to a new apartment that didn't have cable TV. I have most of the big streaming services: Hulu Plus, Netflix, Amazon Prime, and HBO GO.I was between this and the Roku streaming stick for the bedroom, and I decided to go with this because I had recently bought a kindle fire. While this is a perfectly functional device for streaming I am sort of left wishing I had gone with the Roku. The menus and navigation are awkward. Also with services such as HBO GO and Hulu Plus that post new episodes of shows, I've found myself having to frequently restart the device to get the new episodes to show up.The voice search on the app is nice, but the touch screen part is very difficult to use. simple arrows would be better.On the positive side: I haven't had many issues with buffering and have been able to watch all my shows without a problem. The second screen thing with the Kindle Fire X-ray feature is kind of cool too if you're the kind of person who likes to look up actors and fun facts on IMDB.Bottom line- a very functional device that serves it's purpose, however when it is time to replace I will probably look to another brand.", "verified": true, "helpfulness": "0/0", "author": "Evelyn Curtis"}, {"rating": 1.0, "review": "Just won't work. My computer guru cousin came to set it up and concluded Sprint has put a block on my equipment. Check with your service before you purchase this. It appears that you must have WiFi to use it.  I.e. cable is still King and you cannot get round them.", "verified": true, "helpfulness": "0/0", "author": "Sandy Hinderer"}, {"rating": 5.0, "review": "Product arrived in a beautiful black box and was to install.Navigation is easy, and as a Prime member multiple sections are available.  Exceeded expectations.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Finally decided to pick one up.. Moved my Chromecast upstairs and have fire stick in living room. Let's just say I've been watching a ton of TV lately, and listening to my prime music.. If you're in the amazon Eco system this is a must buy..", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "Would have been nice to know before i ordered it & the voice remote that the  fire TV stick would not work with voice..", "verified": true, "helpfulness": "0/0", "author": "James Hutton"}, {"rating": 4.0, "review": "Filled my expectations.Still using and evaluating.", "verified": true, "helpfulness": "0/0", "author": "Rob"}]