[{"rating": 1.0, "review": "My husband and I found it user-unfriendly, from the necessity at the beginning to have to register with Amazon to the difficulty of getting it to respond to our commands.  We returned it for a Sony, with which we are much happier.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 2.0, "review": "I like the device's design including the user interface.  It worked well for a few months.  All of a sudden, it started buffering every ten minutes or so.  I thought maybe it was the Internet connection but my other streaming devices don't have this issue.  I tried to reset it to factory settings and see if it was updating to the latest firmware and still the same issue.", "verified": true, "helpfulness": "1/1", "author": "Fed"}, {"rating": 5.0, "review": "A very useful tool for watching Kindle Prime and Netflix on your TV.  Easy to operate and inexpensive for its purpose.  I would buy it again without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "amazing product", "verified": true, "helpfulness": "0/0", "author": "Charol Riedel"}, {"rating": 4.0, "review": "Awesome! Highly recommend this streamer.", "verified": true, "helpfulness": "0/0", "author": "andre green"}, {"rating": 4.0, "review": "I love it and i got it for $25 on the one day sale. Very easy to root and install all the extra movie add on . Lots of YouTube videos on how to install out source apps. I give it 4 stars and not five because it does drop the Wi-Fi signal a lot it seems like other reviews say.", "verified": true, "helpfulness": "0/0", "author": "Barrioscriptures"}, {"rating": 4.0, "review": "Good fun. Easy to install. Little buttons.", "verified": true, "helpfulness": "0/0", "author": "Frediwar \"w.a reed\""}, {"rating": 5.0, "review": "Was wondering if this item was really necessary, because of the TIVO, but it eliminates the need to use the log in when you want to change from app to app.  Even my grandchildren (ages almost 8 to 3 can use it) with no problem.  The younger grands need help with the reading from time to time, but nothing is too much for them to handle.  Great reason to get PRIME if you don't have it yet.", "verified": false, "helpfulness": "0/0", "author": "Patricia \"I love Audible for their variety and number of options of books available.  I can enjoy books, take care of my grandchildren and drive too.\""}, {"rating": 1.0, "review": "stick worked fine for a day, I downloaded blue youtube app and it disconnected me from my wifi and didn't let me connect again. I returned my stick after unsuccessfully trying to reconnect.", "verified": true, "helpfulness": "0/0", "author": "Nello West"}, {"rating": 5.0, "review": "I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Gabriel Chehebar"}]