[{"rating": 5.0, "review": "Much faster than Chromecast.  Didn't think I'd like dedicated remote, but turns out it's much easier to navigate with remote esp. given speed of Fire TV.", "verified": true, "helpfulness": "0/1", "author": "Frederick L. Johanns III \"Fred\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Lisa Joles"}, {"rating": 5.0, "review": "Love it.  BUT...my cat chewed through the cord and I cannot see where I can order a new one.", "verified": true, "helpfulness": "0/1", "author": "Nancie C."}, {"rating": 4.0, "review": "I own an Apple TV, a Google Chromecast, and just got the Fire TV stick.The Fire TV stick is a great deal for the money.  I'll start off by saying that I mainly have apple products, so in general the Apple TV fits best into my household.  It also compares more closely to the Fire TV, so I may reference it briefly, but in general I'm not going to use it too much for comparison.Pros:  The Fire TV stick is fast!  Theres negligible UI lag, and everything feels very well put together.  There are not only the apps that come with the stick, but you have all the apps that are available on the Amazon App store.  The picture quality is good, as is the sound.  The build quality seems very good as well.  I've had no issues with netflix or the amazon video store -- my two primary uses.  I have yet to run too many apps on it, but I will.Big Pro:  Because its an Android device, you can sideload other android apps on it pretty easily (read: Kodi)  This is really the killer feature for me, as I can watch all the media that this makes available.Cons:  The device is power hungry.  The chromecast I can plug into my TVs USB port for power, which is very convenient.  The Fire TV needs more power, and actually doesn't work off the USB port.  Same with my sister's TV.  We both had to use the included power supply.  Its not big, or poorly made -- Its just a shame to have to use an extra power outlet when I have so few to spare.  Also the device mirroring doesn't work with iOS right now.  On the apple TV i have AirPlay, which is the best experience.  On the Chromecast, I can mirror many apps.  I can do none of that on the Fire Stick.  If you dont care, great -- but I wouldn't use this as my only device purely for the reason that I use mirroring for so much off my laptop or phone.", "verified": true, "helpfulness": "0/1", "author": "maswell"}, {"rating": 5.0, "review": "Very good device. All in one pkg at a cheap price. It's fast no lag at all and has all features you want in it.", "verified": true, "helpfulness": "0/1", "author": "Tesla \"Tesla\""}, {"rating": 1.0, "review": "Good but lags", "verified": true, "helpfulness": "3/4", "author": "Nicholas A. Kyriakides"}, {"rating": 5.0, "review": "Really love it!", "verified": true, "helpfulness": "0/1", "author": "Kymberly H."}, {"rating": 5.0, "review": "First time to use something like this. Was using xbox -boy do I hate having to use the controller- this is responsive and quick.I don't mind that the wheel is only a 4 way button.I did have to unplug once to regain network. I suspect that others that complained of being dropped should check their router too.My only real complaint is the lack of variety in the Prime catalog or should I say depth of selection in each category.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it. The only con is is that it's so good I haven't paying much attention to my Amazon fire TV (box).", "verified": true, "helpfulness": "0/1", "author": "Jeff Gomez"}, {"rating": 5.0, "review": "I own a Roku 3, Chromecast, & PS3 — and the Fire TV is probably my go-to device. Turning the TV on and switching to the correct input just by pressing the home button (via HDMI-CEC) is worth the price alone (although I wish it would turn the TV off as well). A word of note, you'll need to use an external USB port; the one on your TV will be unpowered before the TV is on.The only issue I've had: the Stick gets stuck in a boot-loop if I use the TV's USB port, but using the wall charger is just as good.I haven't used the Fire TV box, but I don't see why you'd buy that. You can always use the app for voice search.If all you do is stream (and it doesn't even have to be Amazon content), then the Stick is what you're looking for. For the price, The Fire TV Stick is hard to beat.", "verified": true, "helpfulness": "0/1", "author": "Stuart Moore"}]