[{"rating": 5.0, "review": "This was easy to set up, and the menu is intuitive. I have not yet tested this in a hotel, which was one of the reasons I chose this unit as it is supposed to be able to work on hotel systems. meanwhile, does what it says it should.", "verified": true, "helpfulness": "0/0", "author": "Tom Paine"}, {"rating": 5.0, "review": "I love amazon fire stick", "verified": false, "helpfulness": "0/0", "author": "Karla H"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "avid reader"}, {"rating": 1.0, "review": "I wanted to like this thing, but I can't get behind it.First off, it's slow.  I don't know if it's the wireless aspect of it or the architecture inside the stick but there's clearly a lag to the thing.  Menus are slow to react, widgets are slow to load, movies are slow to load, movies occasionally buffer while viewing, etc.  I understand it's lightweight, but this needs to be fixed.  My Roku 3, which debuted 18 months before the Fire TV Stick, can run circles around this stick.Secondly, I have Charter Communications...Amazon and Charter don't have an agreement, so I can't watching ANYTHING with my Charter subscription on the Fire TV Stick.  No HBO GO and no STARZ Play.  I have to BORROW a relative's subscription from another cable provider.  I'm BORROWING something that I ALREADY PAY FOR!  How idiotic is that?  I know Amazon and Charter will point fingers at each other claiming they are both fighting for the consumer, but it's stuff like this that leads people to view illegal (FREE) feeds online rather than legally paying for content.  I'm paying for content which I'm not getting.Thirdly, and I know this is really a by-product, but Amazon Prime \"conveniently\" doesn't support Google Chromecast.  I understand this might not have anything to do directly with the Fire TV Stick, but the device clearly benefits from the restriction that Amazon Prime places on Chromecast owners.  It doesn't take a genius to realize Amazon is doing this because they want consumers to buy their Amazon Fire TV Stick instead of a Google Chromecast.  It's just another sleazy thing the media industry does, further adding to the lunacy.  I'm paying for content which I'm not getting......deja vu!", "verified": true, "helpfulness": "0/0", "author": "DeLo"}, {"rating": 3.0, "review": "Partially functional. Typical Amazon confusion included as attribute.", "verified": true, "helpfulness": "1/1", "author": "Zappenfusen"}, {"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "Edgar Perez"}, {"rating": 5.0, "review": "LOVE! We only have a basic TV with basic channels. I have been watching the Fire Stick since it came out. But I just wasn't convinced it would be anything better than what I was already paying for. But it's a lot better, in particular My son loves the Fire Stick (maybe more than mom?.) They have a lot of appealing content for adults & especially for kids. Apps, music, your photo cloud, games etc. My son enjoys watching Thomas the Train & Curious George, and it hardly ever has to buffer like it does when it watches on my laptop. Great for movie night, nothing is on TV change the settings on the TV & turn on the Fire Stick & pick a movie out of the thousands available. They have new movies available put I have found can be on the \"higher\" of the price spectrum for many of them. The Fire Stick interface & remote are user friendly & efficiently designed. It really only took me an hour or so & it seemed like I had become proficient in navigating. But I wish Amazon would expand the content for Prime members, seems like a lot of really old movies. If you are on the fence & you are a Prime member take the plunge the content alone that they offer for free makes it worth every penny. It sure takes a \"not\" so smart TV to another level.", "verified": true, "helpfulness": "0/0", "author": "Emma Morgan \"Emma L. Morgan\""}, {"rating": 2.0, "review": "Keep looking elsewhere", "verified": true, "helpfulness": "0/1", "author": "nj.firefighter"}, {"rating": 4.0, "review": "Overall, I like the Amazon Fire TV Stick. It freezes more than I like, but the clarity of the picture and the easy set-up is what won me over.  I can now use my game system for games only!", "verified": true, "helpfulness": "0/0", "author": "hanekas"}, {"rating": 5.0, "review": "Great I love it!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Susan Thomas"}]