[{"rating": 5.0, "review": "Like it and it work on any TVs at my home. I will recommend this item to any one that do not have any contract w/ any cable or cable provider.", "verified": true, "helpfulness": "0/0", "author": "Martin Ortiz-PAdilla"}, {"rating": 5.0, "review": "I love it! Easy to use, rewind and switch between items on which to play. Immediate recall.", "verified": true, "helpfulness": "0/0", "author": "Christy"}, {"rating": 1.0, "review": "Not Miracast certified.  Major buying decision based on this claim, but Miracast mirroring does not work with Windows 8 devices, e.g. my Dell Venue 8. Would give five stars otherwise.", "verified": true, "helpfulness": "0/0", "author": "Barbara H."}, {"rating": 5.0, "review": "Best streaming stick out there, very fast and powerful performance, tons of games and apps which makes it better than the other streaming sticks. Definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Nasser"}, {"rating": 1.0, "review": "I am starting to hate Amazon for their blatant lack at common sense. I purchased this as a gift, I was not aware it would mean that the person would have complete access to my account without my knowledge! You do NOT even want to know the headache I've had to endure. Had to cancel my credit cards. Amazon, you should make it CLEAR that the device will be registered YOUR account and the person receiving it will have complete access to everything in your account.", "verified": true, "helpfulness": "2/2", "author": "Naudia"}, {"rating": 4.0, "review": "My only complaint about this device is that the remote for it is very hard to open. But you can use your Fire Tablet as a remote so that is cool. Everything else about it is great, I've had no other troubles other than from opening the remote. The setup is very easy, it only took me a few minutes to setup. When I turned it on there was a short video explaining how to use the Fire Tv Stick. I would recommend this device to a friend. My only hope is that Amazon fixes the remote issue for future buyers.", "verified": true, "helpfulness": "0/0", "author": "Kathryn McGill"}, {"rating": 4.0, "review": "I like it .... but the problem is it needs electricity power to work good", "verified": true, "helpfulness": "0/0", "author": "IMAD AAD"}, {"rating": 5.0, "review": "It is was it is .....a great product", "verified": true, "helpfulness": "0/0", "author": "sontino martinez"}, {"rating": 4.0, "review": "Nice if you need a very easily portable unit or want to control your computer with it, otherwise if this is for your home TV, flip the extra $30 for the full sized box Fire TV (not stick)!  I don't know why Amazon doesn't give a side to side comparison here but let me help.  The quick run down is the higher end unit has twice as much RAM memory which means it runs faster and has no wait time (no buffering time).  It just starts right up like as if you had cable and keeps running without stop and start.  Second, to use the voice activation commands with the stick you have to setup your cell phone to assist where as the bigger unit has the voice mic built into your remote (more convinient and one less device to worry about).  Better gamming on the larger device than the stick.Want to see more, here you go www.aftvnews.com/amazon-fire-tv-vs-fire-tv-stick-comparison/Don't get me wrong, \"I love\" this Amazon device and am selling my Roku, Netgear Push2TV3000 units, and others.  I purchase 8 of the larger units at $79 each from BestBuy and \"Highly Recommend it\".  I may get 1 of these sticks here just to carry with me on business trips for my laptop.  Other than that, just thought I'd help out for those trying to figure out the difference between the two and the bigger unit really isnt that big.  It's only around 5\"x5\"x0.5\" Thin!  It's tiny for as much as it does and a far superior menu system with all the bells and whistles over all the competition and yea, I have them all!  I've been without cable or dish for about 8 years now not ever having any monthly fees at all since!  You'll never need more TV than this offers and if you do, it can always be bought on the side for a fraction of the price (I like the annual MLB channel).Enjoy!", "verified": false, "helpfulness": "0/1", "author": "Mary Spagnolo"}, {"rating": 5.0, "review": "So far so good. Installed two devices on Christmas morning. Very easy setup with the exception of the one I installed in the living room. It wouldn't update at first due to poor internet wifi connection but after a restart and re-connect to my router, PERFECT! Thanks Amazon for such a quality product at such an amazing price!", "verified": true, "helpfulness": "0/0", "author": "Julz D. \"Julzz D.\""}]