[{"rating": 2.0, "review": "This thing is a cheap p.o.s.It cuts on and off of wireless at will (regardless of what network I'm on), the menus are sluggish, and it is lacking in simple features (like a sleep timer).The Netflix App for it hardly ever works. The Amazon Prime videos buffer for days (again, regardless of what network I'm on) and it's just overall a piece of s***.Just buy a Roku or actually any other alternative and move on with your life, free of the burden of this thing.P.S. they call it a fire stick cause it will burn your time up via hopeless troubleshooting", "verified": true, "helpfulness": "0/0", "author": "Dasler04"}, {"rating": 4.0, "review": "I have only had the Stick for about a week. I find that the remote is much too touchy for my liking and takes a lot of patience to maneuver. I also have found that when using the remote, I see a delay in response time. Not certain if this is a result of a slower Wi-fi connection, the TV or the product itself.", "verified": true, "helpfulness": "0/0", "author": "Matthew E. McCue"}, {"rating": 5.0, "review": "This is awesome, I can watch shows now on TV instead of on my Kindle Fire! Love technology!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I bought this in order to stream Prime videos.  With my high speec internet connection, it works very well.  I use my smart phone as a remote, even though the remote that comes with the stick works very well.", "verified": true, "helpfulness": "0/0", "author": "G. Roth \"groth\""}, {"rating": 1.0, "review": "Fire stick did not work with my GS5 phone.  Known issue with recognizing and pairing.  Supposedly a fix was scheduled to be released in a couple of weeks but I could not wait that long just to see if the fix worked.  I returned the item and purchase Chromecast.  It's a shame that Amazon was not on top of things and could not apply the fix immediately.", "verified": false, "helpfulness": "0/0", "author": "Richard Eng"}, {"rating": 5.0, "review": "Pretty cool device!", "verified": true, "helpfulness": "0/0", "author": "Victor A. Carreras Calderon"}, {"rating": 5.0, "review": "Very easy to set up and very easy to use.  I have used it for a few weeks now and absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "Easy install, very economical has already saved me money from premium cable channels", "verified": true, "helpfulness": "0/0", "author": "Debra G Brown"}, {"rating": 4.0, "review": "Shipping was very fast and the fire tv stick was easy to install!", "verified": true, "helpfulness": "0/0", "author": "Lori Zavitz"}, {"rating": 1.0, "review": "I was excited when I first got the Fire TV Stick. I hooked it up. Hook up was easy. I got excited. I had just got a new Boise Speaker and I could notWait to hear the sound from my speakers. But to my surprise the speakers didn't work. I felt I had done something wrong so I went to google. And I was told that speakers didn't work with the Fire TV Stick. Why would you sell something that would block something that important.", "verified": true, "helpfulness": "0/0", "author": "crannys2"}]