[{"rating": 5.0, "review": "Affordable, fast and looks great. Many apps available and loading movies, tv shows, music, and media in general is fast enough. Sometimes there is some lag but its minimum. If you have memberships (aka amazon prime, netflix, hulu, etc ) you'll enjoying more ! Even that manufacturer recommend plug it in to the wall outlet, I've been using it connected to my tv usb as a power source and works very good", "verified": true, "helpfulness": "0/0", "author": "Pablo Mendoza"}, {"rating": 5.0, "review": "Excellent stick, easy set up, works great", "verified": true, "helpfulness": "0/0", "author": "BAY V LE"}, {"rating": 5.0, "review": "I've had Apple TV and Roku, liked them both but they're really pricey compared to the Fire stick. A year ago I bought the Roku stick for about $80 and it didn't work on my TV, I sent it back and planned on buying another full size Roku on Black Friday. Instead, that week best buy had the Fire Stick on sale so I bought it. Even though I can easily move the stick between TVs I bought two because they were such a great price. Remote is small and works just like Roku, but without any \"buffering\" issues. I couldn't be happier with my purchase!", "verified": true, "helpfulness": "0/0", "author": "rachavz \"rachavz\""}, {"rating": 5.0, "review": "Really impressed by this device for the price.  I had a TV in my guest bedroom/painting/crafts room but had been unwilling to fork out the extra money to my cable company for a box and extra service but wanted something for when I had guests, etc.  I love this stick.  I can stream Pandora or iHeart radio, watch/catch up on TV shows through Prime and because of my current cable subscription my father can watch games from ESPN in there while my mother and I watch the parades!  It was easy to set up and quick to load.  Programs and shows stream quickly and the device is clearly up to the task of handling my faster internet speeds.  If you have a good internet connection and a decent modem you should have no buffering issues with the stick.  I did not get the game controller but am now considering it because of how pleased I currently am with the Fire Stick.  I would recommend this highly for anyone with Prime who wants to up-convert a TV in their house!", "verified": true, "helpfulness": "0/0", "author": "Deidre LaClair"}, {"rating": 3.0, "review": "Beware: If you don't set Parental Controls, downloading any content doesn't need any sort of authorization.I literally walked away from the TV for seconds and my 5 year old found the controller, saw a game preview and managed to download the $5 app within a few clicks -- no passwords required. The Stick has a simple walkthrough and they ask you if you want to set up Parental Controls, but don't explain what it covers. You'd think from Apple getting into large lawsuits over the process of (children) downloading content, Amazon would have learned to tighten up the interface in how apps (IAPs) / games / movies are purchased. I recommend you turn it on.As for the device, it's nice and has a slick interface with great response times. Most of the apps I tried didn't fill the TV screen well and most free games would only let you play a preview (and not continue very far without purchasing the full version). It's pretty nice for $20 (Prime member price).", "verified": true, "helpfulness": "0/0", "author": "Bernie T"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "H. johnson"}, {"rating": 5.0, "review": "This is a great product and well made. I bought this for my mom who was always complaining that there was nothing on cable tv (no movies). So I went out on a limb and thought Id give this a try. The price was outstanding as well. I bought it for $25 instead of the original 40$, which still isn't bad at full price. The fire stick works amazing, the remote is very responsive, and you can even play games like sonic! However, you do need a Netflix account or Hulu account to access thousands of more movies and tv shows. Since I am a prime member from Amazon I also get access to thousands of tv shows and movies for free! As long as you have a prime account. So far I've received no complaints from my mom. Only thing I've heard from her is that she is a couch potato now!! Just kidding, she absokutely loves it!", "verified": false, "helpfulness": "0/0", "author": "mike"}, {"rating": 4.0, "review": "Some kinks to work out but overall a great product. Hoping that Amazon works out a deal with HBO and Disney soon!", "verified": true, "helpfulness": "0/0", "author": "Tommy Marshall"}, {"rating": 5.0, "review": "Absolutely love it! Easiest way to access all of my favorite apps.", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 5.0, "review": "Love this product..I have had Roku for past 2 years and I love the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Crystal Hale"}]