[{"rating": 5.0, "review": "We love it! Great deal for the money and works just like it says. A+.", "verified": true, "helpfulness": "0/0", "author": "N. Hicks"}, {"rating": 4.0, "review": "Great product, needs mrs support to optimize upon the full utility. I sense Fire TV Stick can help to utilize more services.", "verified": true, "helpfulness": "0/0", "author": "Clive Knights"}, {"rating": 5.0, "review": "Really great product. I live to stream new shows.", "verified": true, "helpfulness": "0/0", "author": "N. Brooks \"heavy reader\""}, {"rating": 5.0, "review": "Love my Fire TV Stick! I use it almost daily.Question - I have an extra computer monitor (Dell) from work that I was thinking of setting the Fire TV Stick up in my room. The monitor however does not have a HDMI connection. Does anyone know of any converter cord that I can get to do this?Thanks!", "verified": true, "helpfulness": "0/0", "author": "Maggey"}, {"rating": 4.0, "review": "Pretty good, haven't used it enough yet to rate it as great. Simple enough to set up and use right out of the box.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Not really sure where to start...I don't have anything to compare it to except my PS4.  Sony has locked everything up so much that compared to my options on my PS4, this Fire TV Stick is amazing.  I paid $34 for it.  I put it in my kitchen.  I have a Samsung LED tv in there and this made it a smart tv on steroids.  Crazy apps...cooking channels...A&E;, History Channel, ESPN, Netflix, games..pretty sweet.  I bought a saltwater aquarium channel just to play around for $1 and it it looks real.  Loaded up right out of the box, had it online in like 5 minutes.  Only thing, and I'm sure this will come, would be to have my Echo talk to it.  Maybe it does, but I don't think so.  I told Alexa to discover devices and she didn't find it.  If you have any tv that isn't a smart tv, this thing is absolutely worth $34.  It's ridonkulous, as my kids would say.", "verified": true, "helpfulness": "0/0", "author": "Marky Mark"}, {"rating": 3.0, "review": "This buffers all the time with Netflix and I know it is not my modem/router as it never buffers when we connect a chromebook to the TV and watch Netflix that way. We may keep it because my son wants to have SlingTV at his college apartment.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "Love the Fire stick - Just wondering though can I have the fire stick on multiple TV's?Would like to cut cable & stream only but the kids are not going to want to watch what I am watching.Can they all use my account to watch different shows at the same time?", "verified": true, "helpfulness": "0/0", "author": "cg"}, {"rating": 5.0, "review": "Incredibly easy to set up and very reasonably priced.  Has all the same features of Apple TV plus the ability to see Amazon videos.", "verified": true, "helpfulness": "0/0", "author": "Writetothefinish \"writetothefinish\""}, {"rating": 4.0, "review": "Absolutely love it! It's great with so many of the programs/apps that are used all in one! It'd be nice while watching a show that you could pull up info on it. Synopsis, yr, etc. That's the only downside I've discovered as of yet.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]