[{"rating": 5.0, "review": "Well satisfied with it, Thought I'd be able to to pull in more t.v. stations but  along with getting Hulu Plus it works great..  Could come with alittle more directions tho. Would highly recommend it. :)", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "Only works part of the time and disrupts your video in the middle of watching it. When this item arrived I had a very hard time even opening the back of the remote control to put the batteries in it for operation of the remote. I had to call Amazon just to see why I couldn't open the back of the remote.  Very disappointed in this product!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to connect, virtually no lag even on slower internet connection. Very pleased with our purchase.", "verified": true, "helpfulness": "0/0", "author": "Peggy Gaines"}, {"rating": 2.0, "review": "I have a Roku and also have the Fire Stick. The Roku is far superior as far as offerings. Unfortunately Amazon does not offer streaming services in direct competition with their Instant Video service. I use Prime Instant Video, but also have Vudu and M-GO, which both have my UltraViolet (digitally owned) titles. Either Amazon needs to enter into an agreement with Ultraviolet and honor those titles OR allow Vudu / M-GO to place Apps on the Fire platform.", "verified": true, "helpfulness": "0/0", "author": "Hammer"}, {"rating": 5.0, "review": "The Fire TV Stick has been a great addition to our viewing pleasure.  It is easy to install and operate with the remote.  WiFi setup was a snap!Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Manual Laborer"}, {"rating": 4.0, "review": "my children and I love it, I would truly recommended anyone with kids to get this. it has not only movies, tv shows, it has games on there for kids as well. the only reason I didn't get a five star is at the moment they remove woody off of it so I didn't to experience using it, hopefully I we will don't know. I do know this I will be cancelling our cable.", "verified": true, "helpfulness": "0/0", "author": "rm"}, {"rating": 2.0, "review": "I like the design and concept. My main issue is mirroring it with my Kindle HD.  It will only mirror 40% of the time.  I have contacted Amazon and they said that it was probably the third party programs we use, or it is to close to the wifi router.  I disputed both assessments.  They finally said that it is a new product and there will be bugs.  As good as Amazon is, and as pleased as I am with all their products and services, I am disappointed  with the quality of this product.  Maybe there will be an update that will fix it.", "verified": true, "helpfulness": "0/0", "author": "Michah \"Michah\""}, {"rating": 5.0, "review": "I decided to wait a couple of months before reviewing the Amazon Fire TV Stick. So far we love it. It provides access to a huge amount of features. And really is a great value for the price.. With our prime membership, we have access to thousands of movies, tv shows and games for instant streaming. Even the movies that aren't free are rentable for a very reasonable fee (usually around $2.99). It streams beautifully and we haven't had any issues with it connecting to our wifi.", "verified": true, "helpfulness": "0/0", "author": "Monica Frye"}, {"rating": 4.0, "review": "So far, so good.  I think it's a great value at $39, but it could use more news and sports apps, in my opinion. If you are watching Netflix, Hulu, Amazon Prime, etc., on your computer, give it up!  The Fire TV Stick makes it so easy to watch all these things on your TV and is very worth it.", "verified": true, "helpfulness": "0/0", "author": "WCC"}, {"rating": 1.0, "review": "It's completely limited outside the United States", "verified": true, "helpfulness": "0/0", "author": "Carlos Parra"}]