[{"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Kathy \"Kathy\""}, {"rating": 1.0, "review": "I wasted a lot of positive birthday energy on this purchase, don't make my mistake!I purchased and returned this item twice; the first time (a purchase from Best Buy in store), Amazon tech support informed me that I had a faulty unit because it would not play more than 90 seconds before losing the Wi-Fi signal.  For the record, I have extremely excellent in-home Wi-Fi...The second unit, also purchased at a Best Buy location, did a little better on the Wi-Fi signal, lasting about 5 minutes at a time. I then found that I had an even bigger problem:  channels (applications) I was assured by Amazon personnel that would work on my Fire Stick were not available.  Subsequent calls to tech support revealed that Amazon Customer Service agents were not listening to my entire description of the service I wanted, just a few words.  I specifically stated to three different Amazon employees (two customer service agents and the first tech support agent) that the channel or application I was looking to use on the Amazon Fire Stick was 'CBS All Access'.  For anyone not acquainted with it, 'CBS All Access' is a pay app, like HULU or Netflix that lets you watch past and present CBS shows, like Good Wife, Person of Interest and Big Bang Theory.Each time I asked, I was assured 'CBS All Access' would work;  after all, the tech support agent said, it works on my Kindle, so it should work on my Fire Stick... (FYI - This can be easily disproved:  HBO Go is available on my Kindle, and is not YET available for the Fire Stick)However, when the second tech support agent finally had my Fire Stick functioning well, imagine my surprise when the search pane could not locate 'CBS All Access'!  Apparently 'CBS News' is available, so it was assumed by each employee I asked that I was simply using the wrong name for the application.  And no, not once did anyone ask \"Did you mean 'CBS News?', they simply agreed.Three total trips to Best Buy over the course of two days, no satisfaction whatsoever.  I believe this product was rushed to market with very little real-world testing, and Customer Service needs more training to handle the issues.  I would advise anyone looking to purchase now to wait until at least one more version of the Amazon Fire Stick is on the market.A few things to note:1. When the Amazon Fire Stick loses the Wi-Fi signal, you exit out of the episode completely, having to start the episode again.  Thois is very frustrating, especially if you have kids watching.2. Subtitles (for the hearing impaired) did not work well on the Fire Stick, and were difficult to read.3. Both my Kindle Fire and my Samsung Galaxy 5 phone had difficulty connecting to and remaining connected with the Fire Stick.  That means you cannot use them as remote controls as advertised.4. Advertising on television implies that you can search my actor, title, etc. ('Find Gary Busey!')  This might work on Amazon Prime using the Fire Stick, but a search for a specific movie does not yield results across all your installed applications.  I was under the impression that I could use this feature to narrow time spent looking for viewing options, but that is not the case.  A search for the Netflix Exclusive show 'Hemlock Grove', which is currently available to watch on Netflix, returned no results.5. Lastly, if you cannot use your phone or Kindle to do searches, the text selector is very klunky and frustrating, utilizing the up and down arrows on the remote to select letters and numbers for your search.Comparing all the features I thought I was getting on the Amazon Fire Stick verses my current viewing method, my Xbox 360, the Xbox is such a better option.  I'll buy my Dad an Xbox just to watch HULU and Netflix before I would consider another Fire Stick.Good luck and happy viewing, my friends!", "verified": true, "helpfulness": "2/2", "author": "Julie Stem"}, {"rating": 5.0, "review": "Easy to install, easy to navigate - and I am electronically challenged.", "verified": true, "helpfulness": "0/0", "author": "Nancy Schneer"}, {"rating": 5.0, "review": "Very quick and easy set up. Good streaming speed. Great complement to my Amazon Prime membership!", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "It's really good I like it.", "verified": true, "helpfulness": "0/0", "author": "Mohamed"}, {"rating": 3.0, "review": "Because I have a Bose sound system, the set up was quick and easy but no sound.  Have to get my set up guy to fix, more later when he finishes.", "verified": true, "helpfulness": "0/0", "author": "J. Cannon"}, {"rating": 5.0, "review": "We had a few issues opening up the remote control battery compartment, but after looking online, I was able to figure out how to solve it. (Looks like that is a common problem).  We also had an issue getting the Fire TV Stick to hook up with our internet connection (it wouldn't load the intro video.), but I have the \"mayday\" feature on my kindle, so I got some immediate help with that, and I would say that they were fabulous at helping us figure things out in just a matter of minutest! (I'd give them 5 stars!).  The Fire TV Stick is amazing, now that we have all the kinks worked out with the setup.  Picture quality is perfect, menu is simple and works great, and we haven't had any problems at all with the remote.  We are really happy with it. Great to be able to watch a movie with my husband on our big screen t.v. instead of huddling over my kindle fire together!", "verified": true, "helpfulness": "0/0", "author": "S. Mortinson"}, {"rating": 2.0, "review": "It's ok you need to Have a prime acct. to benefit not realy what I thought it would be I ended up with chrome cast much better for my use", "verified": true, "helpfulness": "0/0", "author": "doug"}, {"rating": 1.0, "review": "I have tried on two different TVs, including one right next to my WiFi router, to connect this to my home WiFi. It has failed to connect over multiple attempts on multiple days. Phones, laptops, media players, Kindles, etc -- all can connect to my standard WPA2 WiFi -- but not this device! Useless without an internet connection!", "verified": true, "helpfulness": "0/0", "author": "R"}, {"rating": 5.0, "review": "It's the thing I ever had. Love all the movies, etc.I can watch . So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]