[{"rating": 5.0, "review": "Very impressed thus far.Content boots really fast no lag, perfect.best streamer for your buck!", "verified": true, "helpfulness": "0/0", "author": "Desmond Thompson"}, {"rating": 5.0, "review": "Works great! iPhone iPad and Droid compatible.  I have Apple TV, Google  Chromecast and the Fire TV Stick. The Fire TV Stick is the best value by far and I have experienced no compatibility issues.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Gray"}, {"rating": 4.0, "review": "I can watch Netflix in my bedroom now. Have slow connection at times, but work for me my grandson can watch TV or play games in my room.", "verified": true, "helpfulness": "0/0", "author": "Patrice shelton"}, {"rating": 4.0, "review": "would be nice to have screen share from mobile devices, and vudu for movies,", "verified": true, "helpfulness": "0/0", "author": "sammy"}, {"rating": 5.0, "review": "Love the ability to take Netflix as well as Amazon prime shows with me while on vacation. Easy to pack and easy to connect. I even installed KODI on mine so I am able to watch all the latest movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Renee Jones"}, {"rating": 3.0, "review": "Had issues getting this going, kept saying my network was unavailable. I noticed the prompting to point the stick away from the back of the TV and stuck it in the side port. It finally works!I'm still figuring it out. I switched from Apple TV. I miss my AirPlay. I thought I would be able to mirror any mobile device with this, but it's just Amazon devices. Searching apps is hard, finally found Beachbody OnDemand and am so glad I can use that! Wish I could organize my watch list and separate movies from TV and kids from adult selections. Better filters are also needed. Rather than just entering a password to watch anything I'd like to be able to block certain ratings and content or specific shows from even showing up.", "verified": true, "helpfulness": "1/1", "author": "buzyb"}, {"rating": 5.0, "review": "After having to buy a 3way switch every thing is fine!!", "verified": true, "helpfulness": "0/0", "author": "glennadel"}, {"rating": 3.0, "review": "I am not that impressed with it. It wants to stop and the clarity on screen not that great.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I absolutely love this thing!  It can connect directly to my Wi-Fi in the next room and bam! I'm watching tv with no wires excect electricity.Got lots of things to watch and play too. Well worth the money, needs a small game controller included in the price Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rick Peace"}, {"rating": 5.0, "review": "Love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "joe"}]