[{"rating": 5.0, "review": "I love the Fire Stick and how it works. The set up was easy with the helpful tutorial. I do wish the list of the videos available on amazon prime was more extensive with more of the old classics. I am using the Firestick to explore what is available on Netflix using their 30-day trial account. You will like the device and depending on your taste you may like the available content more than I do. If you you didn't buy a smart TV and you want access to video streaming on that TV this is what you need. Just plug ... play...and watch.", "verified": true, "helpfulness": "0/0", "author": "Andrew C. Dalzell"}, {"rating": 4.0, "review": "The stick is gr8, but is limited to what u can get free outside of the US. Most prime movies r not free as there is a service area restriction.", "verified": true, "helpfulness": "0/0", "author": "Lester V. Ferdinand"}, {"rating": 5.0, "review": "The whole family loves it. There is always something to watch!", "verified": true, "helpfulness": "0/0", "author": "Wanda Randolph"}, {"rating": 2.0, "review": "Apparently my 3 Kindle Fires are not compatible to mirror with the Fire Stick. Basically useless. Thanks.", "verified": true, "helpfulness": "0/1", "author": "brandy quay"}, {"rating": 5.0, "review": "My Smart TV stopped being smart after I upgraded the router. Could no longer get Prime, Netflix, etc. on the TV upstairs. A 123 set up with the Fire Stick and the TV has it all back. For those of us who are not that tech smart there are more detailed instruction on Amazon for set up.", "verified": true, "helpfulness": "0/0", "author": "GeeMee"}, {"rating": 2.0, "review": "I mainly bought it to use Sling. It buffers for a long time and frequently locks up. Not the best choice.", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 5.0, "review": "Like it better than the box and for half the price", "verified": true, "helpfulness": "0/0", "author": "Angel B."}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Bruce P Eisenschenk"}, {"rating": 5.0, "review": "This is by far one of my best Amazon purchases. Ever.", "verified": true, "helpfulness": "1/1", "author": "kam5280"}, {"rating": 5.0, "review": "It was very user friendly to hook it up!", "verified": true, "helpfulness": "1/2", "author": "LaDONNA GILLESPIE"}]