[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "R & M Baker"}, {"rating": 5.0, "review": "I received my Fire TV Stick yesterday 12/13/14. It took around 10 minutes to connect; easy and quick. I wish I would've purchased more at the $19.99 deal for Prime members. Picture quality seems better when I watch Netflix and Prime movies. Thank you Amazon for the Fire TV Stick..", "verified": true, "helpfulness": "0/0", "author": "Demetrius Watson"}, {"rating": 1.0, "review": "Keeps freezing up! Says it's connected with problem. Then I unplug it and plug it back it it works again! I've had to do that twice and Ive had it less than a week! On the plus side, set up was a breeze and works like a charm when it works...lol", "verified": true, "helpfulness": "1/2", "author": "Yvonne"}, {"rating": 5.0, "review": "Highly recommend,excellent device", "verified": true, "helpfulness": "0/0", "author": "RYDELL"}, {"rating": 4.0, "review": "Love the form factor and user interface. The remote is simple and intuitive to use. It has all the typical apps except vudu, which is where my movie collection is located. However, for the price it's the cheapest media player you can find.", "verified": true, "helpfulness": "1/1", "author": "C. Tucker"}, {"rating": 2.0, "review": "keeps telling me 'No Internet Connection\"  I check settings  and the signal strength is \"Very Good\"  but my movies or music still won't load.Not happy with the product.  I have 2 Roku's and they perform very well.  Hope Amazon's upgrades fix the problems.", "verified": true, "helpfulness": "0/0", "author": "LoveToShop"}, {"rating": 1.0, "review": "Does not support Minecraft. No way to lock R rated movie content in parent controls. Very disappointed. Returning the stick.", "verified": true, "helpfulness": "0/1", "author": "Disappointed"}, {"rating": 4.0, "review": "I've had mine for two weeks. If you watch Prime movies or Prime TV then this item is for you. It eliminates the hassle of connecting a tablet or computer to your TV. I would have given it five stars but the remote is a little awkward to use due to it's small size. Amazon made it very easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "John Escobar"}, {"rating": 5.0, "review": "I preordered this so I got a really good price.  I have the Roku on my living room TV.  When I saw this I bought it for my bedroom TV.  I love it and it work fine.  The only issue I have is that the remote is so small and easy to lose.  I put velcro on the remote and behind the TV so now I have a place to keep it when not in use.  I can now watch my movies from Amazon or Netflix while my husband watches whatever he wants.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a smart TV an apple TV a Smart Bluray player and I have to say I have never been so happy with the format and interface of a product for streaming media and this was by far the least expensive.", "verified": true, "helpfulness": "1/1", "author": "David stimmer"}]