[{"rating": 5.0, "review": "I received the Fire Stick several days earlier than anticipated. I was excited as I took it out of the box and set it up. Though the HDMI extension seems a bit too short to be of use, I actually found that it was exactly what I needed to connect properly to my bedroom tv. From the moment I turned it on, it has worked flawlessly. I downloaded an initial update that took a couple of minutes and was ready to roll. It even had my amazon information pulled up right away. No need to sign in. I decided to look up the reviews and see what everyone else was saying and was quite surprised to find several folks referring to it as \"clunky\" and mentioning several apps not working. So... I decided to check into several features I have not yet used. For three days I have used only Netflix and Amazon Prime, which have given me zero issues. Could the same be said, though, for apps like PBS, Pandora, ESPN, and Youtube? We shall see.For the next five minutes (which was all I needed), I downloaded, updated, and signed in to PBS, WatchESPN, Pandora, and Youtube. Each and every one of then worked exactly as I had hoped.ESPN pulled up instantly. I was watching a clip on the Bills and Jets upcoming game move to Detroit within seconds of starting the app.Pandora required a sign in and loaded my stations instantly. No delay in loading for the first time; I didn't have to watch that cute little loading circle while my stations filled in. Quick and easy.PBS was the most involved. It did ask me to verify an account on my laptop, which I happened to have open for a stupid long review I was writing, and I was watching clips within moments. Again, flawless.And finally I tried Youtube (expecting no issues at this point). I was severely disappointed. After watching youtube launch without issue or delay, I was dismayed to find that a Pitch Perfect 2 preview was in the first slot of the \"popular on youtube\" section with nearly 6 million views. Very upsetting. But yeah, the YouTube app on the fire stick was also without flaw.So, all that said, I am extremely satisfied with the Fire TV Stick and am quite happy that I bought two. Prior to the Fire Stick, I was using a Wi-Fi enabled Blu-Ray player in our bedroom to access video streaming sites. I was so amazed with how much faster my fire stick was, that I chose not to mention it to my wife (who notices nothing related to increased internet speeds). The difference was so stark that she, within moments of starting netflix, accused me of increasing our monthly internet bill by upgrading our FIOS package. Well done Amazon, well done.- I do have to mention one little complaint though. As others have mentioned, the power adapter and cable are poorly designed. The adapter itself is very sleek looking, but it is just too bulky. Imagine the little iPhone cube shaped power adapter. Now imagine all sides expanding just far enough to cover the edges of all neaby outlets. Paint it black. You now have the Fire TV Stick power adapter. And as for the cable... It reaches perfectly from my wall mounted tv to the spot 10 inches above the wall outlet immediately below. Enough said.", "verified": true, "helpfulness": "30/35", "author": "Cameron Teaman"}, {"rating": 3.0, "review": "First I'll start off by saying that this product really wasn't made for someone like me. I'm a tech enthusiast, I have an HTPC computer (Windows MCE) and also own a Chromecast.Unboxing the unit it looks like it was well put together. I quickly ran downstairs and threw it into my 55\" TV's HDMI port. I neglected to follow the guide and didn't use their included power supply, but instead used my TVs USB port. This does not let the device update itself as its only on when the TV is on. I'm ok with that.Going through the setup guide was quick, easy and painless. That is until I completed and it started to play a multi-minute long dorky cartoon guiding me how to use the intuitive device. The only option it lets you do is go back to Wifi setup, making you start the video over again. Lovely.I got over the annoyance and got to using my Firestick. The remote is awesome and the interface is great, fast, and looks awesome. When you go into a show, it sets the background to a related image. Nice.Now where I started to get upset. It has more than enough power for HD video, but with Prime video you only get SD and have to pay for HD content, where on my HTPC I get HD if my connection can handle it. Not cool. I dont want to pay for what should be the base level of quality. Video was noticeably interlaced SD quality.Next on to Netflix to compare it to Chrome Cast directly. It was a breeze to add the app and log in. I next streamed Star Trek TNG (good go-to that has an awesome remastered HD version) to see quality comparisons. Looks as good at the chromecast, Windows 8 \"Metro\" Netflix app, etc - all SD quality, interlaced. If thats fine with you, get this.Five total things in my opinion would make this killer, even if it only did one of the five;1. Have a basic web browser so I could travel with this - hotels have web auth. pages that block things like chromecast in their tracks. This doesnt have limitations of needing to be slaved to a phone to stream, so this alone would let be my travel buddy2. Come with the Mic remote by default at this price. Typing is so yesterday.3. Come with a gaming controller, just one would be great. It'd be fun to be able to game on this, and I'd buy games from the Amazon Store for it in a flash.4. Steam Stream support. This needs to happen. It'd be awesome.5. HD Video for at least some content free if you paid for prime.Pros:-Easy to use. Lots of power. Can stream gaming-Easier to install than a chrome cast-Independent - can play video on its own-Has a remote-More power than a Chrome Cast-Tons of appsCons:-Annoying into 'ad' that you cant skip when you first install it-Video is only in SD, Pay for HD video.-Typing is annoying-Games selection was boring without digging", "verified": true, "helpfulness": "5/8", "author": "Brian Thorp \"Moo\""}, {"rating": 5.0, "review": "I needed something inexpensive like this for the man cave/garage and it did not disappoint!", "verified": true, "helpfulness": "79/88", "author": "Jaime Huerta \"xrxjaime\""}, {"rating": 5.0, "review": "I just received this product, took minutes to set up, quick and easy. Love watching Prime movies and more.. worth the investment", "verified": true, "helpfulness": "2/3", "author": "Eric"}, {"rating": 4.0, "review": "Very happy with the Fire TV stick.  Fire TV is better but you can have that in your main theatre then add the stick in other locations.  Really nice when you add Amazon cloud photos so you can see them anywhere in the house.  Great purchase!", "verified": true, "helpfulness": "1/2", "author": "docuwize"}, {"rating": 2.0, "review": "For $19 (as Prime member) figured I would buy, but as a user I'm not sure why I would use this device versus a Chromecast.  First of all, the set up was terrible.  Setting it up behind the TV, they have the micro-USB slot in such an odd place on the device that I had to use the HDMI extender, the connection to the power brick was techy and I couldn't even tell it was powered on.  Then, once powered on, took me nearly 30 minutes to set up the device!  What?!  After putting in my wireless name / password - twice - the device went through a very lengthy reboot, download and installation process.  After all that, all I could do was watch Amazon Prime videos.  Anything else - from games - to Netflix you had to download... and then enter in your user name and password for each service!  Okay, so maybe once you go through the pain of setting up all your games and apps, then the magic will happen.  Not so much.  The remote included is pretty cheap, inexpensive feeling.  There is none of the lauded \"voice search\".  For that, you'll have to download the Amazon remote app.  What's the point?  Amazon spends all this time bashing Chromecast for using mobile phone, and then ironically makes you use your mobile phone in order to get at one of FireTV's primary features.  In short, if you live with your phone, tablet or computer with you on the couch when you watch TV, then you already know the value of Chromecast.  Amazon has swung and missed with the FireTV stick.", "verified": true, "helpfulness": "4/9", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it so far!Setup was quick and easy.  Plugged in, and started it up, and it checked for, and found an update, then downloaded it automatically.Once that was complete, it came up, already knew my info, and played an introduction video.After that, all I had to do was set a PIN, so my kids wouldn't accidentally purchase things they shouldn't, and download a few apps, such as PBS Kids, (a favorite for the little ones) as well as Plex, Pandora, and Youtube.We then sat back and watched a Prime movie.  Picture quality was great on our big screen too.Very impressed so far!", "verified": true, "helpfulness": "4/6", "author": "Stephen \"stephen@satisopto.com\""}, {"rating": 5.0, "review": "What a great device.  Out of the box I was streaming from my media server into Plex in 5 minutes.  If you're looking at Roku vs Chromecast vs Fire Stick this is the best option.", "verified": true, "helpfulness": "1/2", "author": "Kirt A. Thomas"}, {"rating": 1.0, "review": "Out of Box , It is terrible.  I cannot believe Amazon launched this CoCo item.  The device opens and the opening was good, but I was unable to select a movie on Amazon Prime or Netflix.  The remote seems to work, then not.  The device hangs, then all the presses you made take place at once.  Apple TV works flawlessly, I just wanted to be able to watch my Amazon Prime with the Fire Stick withouit hooking up my laptop.  This is junk.", "verified": true, "helpfulness": "3/14", "author": "Recce Puke"}, {"rating": 5.0, "review": "I picked up one of these at the launch day pricing and now regret not getting more than one!  Mine arrived pre-registered to our family's prime account making the initial setup painless.  Within 10 minutes I had Netflix, Plex, Pandora, Youtube, Crackle and my Prime subscription services all working in harmony and streaming content in HD and Super HD.  The price point on this is perfect even at the non-introductory rate -- my only recommendation would be to figure out a way to bundle the voice remote with this at a discount. I think that's the only thing missing from the whole package; however, it is in no way crippling the experience.Speaking of experience, the thing I was worried most about with this and the FireTV  in general, was Amazon shoving it's content down my throat throughout the user experience; and I'm shocked to say they handle their content integration tastefully.  The apps I use most are the most prominent thing on the home screen, and I can find the content I'm looking for in those nearly as easily as the Prime content. Despite clear pricing and delivery options, I never feel like I am being sold to. My opinion on this might change if and when I decide to get the voice remote or when Amazon releases the iOS voice capable remote application.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}]