[{"rating": 5.0, "review": "It meets all my needs. The price is right on budget and the stick does everything my bother ' competitors stick does.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to use. And much cheaper then cable. So far we like it.", "verified": true, "helpfulness": "0/0", "author": "Megan Murphy"}, {"rating": 5.0, "review": "I loved it! I put it in my room and I didn't get out of my room for days after getting it.", "verified": true, "helpfulness": "0/0", "author": "michelle glendenning"}, {"rating": 5.0, "review": "Excellent. I'm very happy to have this Fire tv stick. Awesome👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Elena M."}, {"rating": 1.0, "review": "Nowhere near the Fire TV....slow menus choices...buffers all of the time", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 4.0, "review": "For the price the stick is awesome and the best spec wise, though it has limitations.  The Broadcom SoC isn't awesome and very dated performance wise.  Scored 2244 in 3DMark. The SoC runs at 1GHz instead of the spec sheets 1.2GHz.If you want to do more than just stream media (play games), get the FireTV.  The games I have tried that work with just the remote are a bit laggy.  The UI can also be unresponsive at times if you try and do a lot.This can be fixed with an updated SoC so hopefully Amazon addresses this.Runs Android 4.2.2 with 512MB of RAM doesn't help either, usually only like 70MB free.My only complaint about the UI, it should be easier to find and categorically sort through Prime only content.I got mine free with the SlingTV promo.  Wish I spent the $50 to get the FireTV.  The stick is super awesome and making me cancel my Pandora and Netflix as reaching Prime content is a lot easier and better now.", "verified": true, "helpfulness": "0/0", "author": "red_dog007"}, {"rating": 3.0, "review": "I think you need more local apps for fire tv like you have have for kindle, The performance of the stick is great", "verified": true, "helpfulness": "0/0", "author": "James S."}, {"rating": 5.0, "review": "So far so good!  Easy to install and setup.  Nice tutorial for us newbies.", "verified": true, "helpfulness": "0/0", "author": "P"}, {"rating": 5.0, "review": "Great product.  I love the interface.", "verified": true, "helpfulness": "0/0", "author": "Notey"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Melanie K Sluga"}]