[{"rating": 5.0, "review": "Amazing. Turned my stupid TV smart. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "The ad photos are deceptive. It does not show the power cord that needs to be attached.", "verified": true, "helpfulness": "0/0", "author": "William King"}, {"rating": 4.0, "review": "Easy to use and simple to take from room to room to ten any non smart tv into one. Picture sometimes gets fuzzy mid show for about 5 seconds at a time. Still worth the $$", "verified": true, "helpfulness": "0/0", "author": "Jeanette"}, {"rating": 4.0, "review": "Had some problems at first but it looks like I will be keeping it", "verified": true, "helpfulness": "0/0", "author": "Monica Sergeant"}, {"rating": 3.0, "review": "I appreciate not having to access apps like Netflix and Hulu thru my Wii now that I have the Fire Stick, however, in comparison to Apple TV, which I also have, the Fire Stick is found lacking.Specifically, the layout of apps on the Fire Stick is a bit of a headache. You have to dig for your apps because the primary focus is Amazon Prime content. Which, I get, but it just isn't the most user friendly approach. Also, if you want to push anything via airplay to the Stick, it seems as though you either have to have an android phone (because all the apps that will allow you to do that are for droid), or you have to buy another product that will allow mirroring. So, you're digging for content unless it's specifically Prime/Amazon, and you're limited in what it can physically do. If the mirroring issue could be fixed, that would be a major plus. Since Comcast/Xfinity isn't a recognized provider for practically ALL the tv channels, it would be nice to be able to pull them up on my iPhone and push them to the Fire Stick like I do with my Apple TV.Bottom line, for the money, it's fine. But if you've got 30 more dollars, you can get an Apple TV and push your Amazon content to it thru your phone and avoid the aggravation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worth every dollar! Very satisfied!!!", "verified": true, "helpfulness": "0/0", "author": "Robin H."}, {"rating": 4.0, "review": "Very Convenient. Like the services provided", "verified": true, "helpfulness": "0/0", "author": "Jefferson C. Moye"}, {"rating": 4.0, "review": "I/we like it and we are going to keep. Was a little disappointed in Prime Video. Not near the offerings of Netflix but will do for the value.", "verified": true, "helpfulness": "0/0", "author": "gracedazed"}, {"rating": 5.0, "review": "I love is what i want and i recomended", "verified": true, "helpfulness": "0/0", "author": "Wolfango Olivera"}, {"rating": 5.0, "review": "It was very easy to install, but if you are tech savy about your Television it can drive you crazy!!!!!  I called Geek Squad, AT&T; and watched video's on You Tube...before my husband realized you have fix the Aux button and change your TV to that to see sign on screen.  We have become couch potato's now!!  Loving it!!", "verified": true, "helpfulness": "0/0", "author": "Sherry L. Chavez \"Mamma Lou\""}]