[{"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "sandy o"}, {"rating": 5.0, "review": "This is amazing!!!! I love it.", "verified": true, "helpfulness": "0/0", "author": "james e harris iii"}, {"rating": 5.0, "review": "Way better than chromecast", "verified": true, "helpfulness": "0/0", "author": "Grizzle"}, {"rating": 5.0, "review": "I have Amazon Prime and loves the stick.  Works as advertised and connects to hotel wifi (with acknowledgement login) so you can watch all your favorite prime shows on the big screen while traveling in the US.  Just came back from a trip, stayed at a Hyatt and this worked great.  I would suggest getting a longer microUSB cord as the device needs a power source and there isn't often one close enough to plug in the power plug with the included microUSB cord.Main menu looks just like normal Amazon Prime and you can configure the stick to require a password to lock out kids and prevent unauthorized charges to your account (you can buy movies to watch via the stick) or have them see unapproved content.For less than $40, this is a fabulous device,  When you order the stick, it comes preconfigured for you amazon account.  So if you are going to give this away as a gift, make sure you note that in advance before you the stick away.Buy it, it's a no brainer.", "verified": true, "helpfulness": "1/1", "author": "C. Cheng"}, {"rating": 5.0, "review": "we purchased a smart tv but it took a long time (how impatient we have become) to come up so we purchased the fire stick.  That is our newest TV.  Our older TV (not smart) had a Roku device.  With the second fire stick we were able to by pass the Roku device and quickly access Amazon and Netflix.  The fire stick is an inexpensive addition to our viewing pleasure.", "verified": true, "helpfulness": "1/1", "author": "Sharon A. Neumannlynes"}, {"rating": 2.0, "review": "Having purchased a Fire TV before I feel the Fire TV Stick is not worth it. Spend the extra $60 and get the Fire TV. The stick is sluggish and chokes on some HD content whereas the higher end Fire TV does not.", "verified": true, "helpfulness": "2/2", "author": "Ricebunny"}, {"rating": 5.0, "review": "good tv stick ,  I like it .  very nice", "verified": false, "helpfulness": "0/0", "author": "Cherie"}, {"rating": 4.0, "review": "I really like the device, works great for cable-cutters. I prefer it over the Chromecast because, at the same price-point, this device has a remote and does not need an Android phone or tablet to work.The main issue for me is that the screen mirroring from Android devices (what you would use to look at photos/videos directly from your phone) does not work as reliably as in the Chromecast. It gets disconnected often and cannot really stream HD video.I would like to see native DLNA/AirPlay support to stream audio from my phone (currently this is an option only through a paid app).", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Needs to add more features!", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "I Love", "verified": true, "helpfulness": "0/0", "author": "abel rodriguez"}]