[{"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Myra"}, {"rating": 2.0, "review": "Everything is great. I prefer it to chrome cast except it drops wireless often. I can do a factory reset & it is better for a day. Then back to dropping network. It is not my network. ???", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Great product! We can now watch streaming video on all of our older sets for a fraction of the cost of a new smart tv.", "verified": true, "helpfulness": "0/0", "author": "Terri L. Johanning \"constant reader\""}, {"rating": 5.0, "review": "I purchased the fire stick because Amazon made me an offer I couldn't refuse!  We have found it to be very useful for us to have at our vacation condo in FL.  Long story short, cable providers do not offer an economical means to have cable for people that own a vacation home and are part time residents.  It makes no sense to spend over $100/month for cable services we only use a total of 3 months a year. So, we do have internet in the condo and the Fire Stick coupled with the Kindle HD mirroring gives us a phenomenal choice of TV entertainment using services we already subscribe to such as Amazon Prime movies, Xfinity, and HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "Love my fire stick works wonderfully.  It allows me to use my kindle for something else.  Will probably purchase another one in the future", "verified": true, "helpfulness": "0/0", "author": "Tana"}, {"rating": 5.0, "review": "Easy install ! Works great ! Highly recommend !", "verified": true, "helpfulness": "0/0", "author": "Villagenan"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "James Curry"}, {"rating": 1.0, "review": "QUIT WORKING WITHIN 90 DAYS.", "verified": true, "helpfulness": "0/0", "author": "Aerial Aerins"}, {"rating": 5.0, "review": "Added this to an older television which we don't use a lot so didn't see the need to add a service box. Plugged it into the HDMI port and powered it up, not a glitch. Logged right into my Prime account and synced up in a flash. Added Netflix app and tried it out streaming from both services. No lag, no muss, no fuss. Great value option for entertainment.", "verified": true, "helpfulness": "0/0", "author": "Eric S"}, {"rating": 4.0, "review": "Great for the other products, but unable to get HBO-Go content because of no deal with Comcast & Amazon.", "verified": true, "helpfulness": "0/0", "author": "BRBMOM"}]