[{"rating": 4.0, "review": "Needs more apps", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "way better than my apple TV couldn't be more happy.", "verified": true, "helpfulness": "0/0", "author": "dustin rohde"}, {"rating": 1.0, "review": "Save yourself the frustration of trying to get the stick to work and then returning. The stick does NOT stay connected to a network mine would only work for seconds at a time. I ended up just getting the regular Fire TV which I LOVE and I have had no problems with. After I purchased the Fire stick and it wasn't working well I thought it was just Fire TV still needing to work out the bugs so I purchased the Roku 3 only to discover after hooking it up that it can't be used with a public network in which you sign in through a webpage making it worthless to me because I live in an all inclusive apartment building which has a building WiFi network. So I went back and exchanged for the Fire TV which is great!", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 4.0, "review": "I've only had it for 5 days and I love it. It was easy to install right off the box and worked within minutes.", "verified": true, "helpfulness": "0/0", "author": "alanie"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Prodromos Antonoglou"}, {"rating": 3.0, "review": "I like it I wish I could find out if they have a web browser", "verified": true, "helpfulness": "0/0", "author": "Michelle Trimiew"}, {"rating": 5.0, "review": "I Love it, love tub it TV. less commercials", "verified": true, "helpfulness": "0/0", "author": "CHANDA D COOPER"}, {"rating": 3.0, "review": "Been great so far. Only had one issue where it lost connection and couldn't find the home screen. I had to actually go and unplug the power source to get it to re start. Th at sucked since we haven't even had it a month.  I also wish the remote wasn't so tiny and easy to lose.", "verified": true, "helpfulness": "0/0", "author": "Justine"}, {"rating": 4.0, "review": "Good reception. Easy set up.  And Easy to use.  I purchased it thinking I could take it with me as I travel.  I have not tried that yet.", "verified": true, "helpfulness": "0/0", "author": "Samm"}, {"rating": 4.0, "review": "The item does exactly what I expected it would do. The only thing I would like to see is to be able to add music to the photo slide show, Perhaps it can be done but I haven't seen an app yet that could do it.", "verified": true, "helpfulness": "0/0", "author": "Barry A. Levine"}]