[{"rating": 1.0, "review": "It's rare I have anything to complain about when it comes to Amazon but this product was not ready for release. The remote is incredibly glitchy. It either does not register you be clicked or it registers more than one click and will fly the cursor across the screen. Sometimes it's impossible to make a single click. Say I want to move Right one-time. I click Right and it goes two spaces. Then I try Left and it goes two spaces back. This was incredibly hard to set up my WiFi network when one click would send the cursor to the end of the keypad and it would wrap back around and continue sometimes. The WiFi is hit or miss and during streaming of movies like on Netflix it would skip/freeze and blast an incredibly loud screeching noise. I found this device to be more of a pain than the potential value over a roku and am switching back to Roku stick/chromecast.", "verified": true, "helpfulness": "5/5", "author": "Sam Antonio"}, {"rating": 5.0, "review": "Love the simplicity and the ease of adding apps and navigating thru the apps", "verified": true, "helpfulness": "1/1", "author": "Lisa Jensen"}, {"rating": 3.0, "review": "I was disappointed that I couldn't connect to HBO GO yet. I was told that it would be available by the end of the year.", "verified": true, "helpfulness": "0/1", "author": "Daniel Blocklin"}, {"rating": 5.0, "review": "Great product at great price.", "verified": true, "helpfulness": "0/0", "author": "H S. \"haschultz1\""}, {"rating": 5.0, "review": "Loved how I can used it for all the new apps.", "verified": false, "helpfulness": "0/0", "author": "Marlonde"}, {"rating": 5.0, "review": "This little devices is a joy to use. The remote works good. Netflix and Plex work good. Probably wont be using our chrome cast much anymore. The games work well too.", "verified": true, "helpfulness": "0/0", "author": "RobbAce"}, {"rating": 4.0, "review": "Overall it is a fairly good system.  The only problems that I see are that when you stop a show there is a buzz and the every so often there is a pop and a screen glitch.", "verified": true, "helpfulness": "0/0", "author": "SiFi"}, {"rating": 4.0, "review": "Plugged it directly into the HDMI port and a USB port on my Vizio TV, and it started right up (I got the warning to plug it into an outlet, but I don't currently have one available- the TV USB port seems to be working fine). At first I was worried because it appeared as if the WiFi connection to my router was really slow or unstable because it took about 15 minutes to download and install the updated software (everything else in my entertainment setup is wired via ethernet). Once it was up and running, though, it was snappy. I was on Netflix watching one of my shows within 2 minutes (basically as much time as it took to input my login credentials with the controller).There's way less buffering than on my 2nd Generation Apple TV, and the improvement in resolution is a welcome 'feature' from that device. Previously, I had been using the Vizio's built in apps for Amazon Prime, so that is also a huge improvement in usability. The Fire TV UI is a cluttered mess, but as long as what I need to use is easy to find, I don't care (I'd rather just have icons for the things I use- I don't need all the advertising). The Fire TV remote app for Android is nice too. I'm using it on a Nexus 7 (2013).I only wanted to try out the Fire TV Stick for Netflix and Amazon Prime videos, perhaps some YouTube, Netflix, and XBMC eventually. Nothing else it offers mattered to me (music, games, photo sharing... don't need it on my TV). For the promotional price I paid, I certainly can't complain!Edit: I've since sideloaded Kodi and it works great! Just as well as XBMC was running on my jailbroken Apple TV 2. No troubles streaming 1080p content over AFP from my Synology NAS, even with my touchy household wifi setup.Edit 2: I can't believe that it has only been just over a month since I got this thing- I've been using the heck out of it. I've been using an app on my Nexus 7 that'll let me sideload apps directly to the Fire TV stick (http://forum.xda-developers.com/fire-tv/themes-apps/fire-tv-loader-app-android-t2963536). That's been really handy. Also a app on the Nexus 7 that emulates a mouse and keyboard (http://www.amazon.com/Remote-Mouse-for-Fire-TV/dp/B00S4MU62I/). Both have added to the usefulness of the device. I do occasionally play some \"mobile\" games, Zen Pinball and Crossy Road, and have just been using the included remote as the controller... this has got me interested in researching vintage console emulators, and buying a bluetooth controller. I have a feeling that I might run out of space and processor power and want to upgrade to the full Fire TV...", "verified": true, "helpfulness": "0/0", "author": "Spacecat"}, {"rating": 5.0, "review": "This device is awesome. The remote control works very good and if you download the remote control app to your kindle tablet and your fire phone, it will make your experience even better. I am very pleased. (It will be nice if everything will sync with the Amazon Echo)", "verified": true, "helpfulness": "0/0", "author": "Arlene💗"}, {"rating": 1.0, "review": "I was hoping to use the Fire TV Stick when travelling. I have not been able to connect with any hotel wireless network.I received the e-mail claiming (quoted below) to fix this problem. Exactly the same problem as before. All I get is \"connected with errors\". If it was possible to put negative stars I would. So far this device has been totally useless. Please fix it!!!\"Connect to your hotel or dorm room Wi-Fi with captive portal support—Take your favorite movies, TV shows, games, and more with you when you're away from home. Fire TV Stick enables you to connect to Wi-Fi that requires web authentication—this includes Wi-Fi at most major hotels, as well as some universities.\"", "verified": true, "helpfulness": "1/2", "author": "Donald W. Graham"}]