[{"rating": 1.0, "review": "every 30 mins it through s error please check your internet . I have chrome TV , apple tv and also roku running from years with out issues.I am not sure it that is with only my FireStick. Try to resolve the issue from 4 days , I am manually unplugging and plugin back it for restingits frustrating to use like this.", "verified": true, "helpfulness": "3/5", "author": "JRALL"}, {"rating": 3.0, "review": "I think its a good product. However when streaming Netflix  or prime videos the audio quite often lags behind the video. I have a chromecast that doesn't have this problem.", "verified": true, "helpfulness": "0/0", "author": "Mark Alice"}, {"rating": 2.0, "review": "Maybe I got a lemon.  For me, this was really 0 stars, but I give it 2 for potential.I pre-ordered the Fire TV Stick for cheap.  I've owned 9 dedicated media players (in addition to dvd and blu-ray players that also handle some streaming).  Using the Fire TV Stick, I was never able to stream more than 20 minutes of a movie from Netflix, Amazon, or local media via XBMC.  The Fire TV Stick would get crazy hot and then show a wifi error: \"Connected with Problems\".  I would turn it off, let it cool down for an hour, and then try again.  I tried connecting to two different wifi routers (2.4Ghz and 5Ghz).  Same issue.  In the end, I returned the stick because I just couldn't make it work.I was plugging the Stick into an HDMI switch (via the dongle) and not directly in the TV.  I'm not sure if that could have caused the issue.As a comparison, I give the full Fire TV a 5 star review.  The full Fire TV adds ethernet (no wifi issues), optical out (my receiver doesn't handle HDMI), and supports IR (with a USB IR receiver).", "verified": true, "helpfulness": "1/1", "author": "M. Sorensen"}, {"rating": 5.0, "review": "Good product", "verified": false, "helpfulness": "0/0", "author": "One customer"}, {"rating": 5.0, "review": "Got it in today, and connecting was a breeze.  Already preloaded with my prime, and the interface is intuitive.  Downloaded a couple of free games to play with my 4 year old, and Netflix account was easy to setup.  There's a ton of free stuff on Prime, and between that and Netflix, I'm good for about 15 years worth of stuff to watch.  Now I'm thinking about getting the more expensive Fire TV for the living room, and keeping the stick in the bedroom.  This is the death of cable TV!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works well, plays netflix and prime video just fine. i use kodi(xbmc) to play local media from my nas. if you are looking for an android stick to root and do what you want this is not it. if you are looking for a good device with good navigation and smooth media playback then this is for you. the ui for this and the apps for it are great, you dont need a kb and mouse to navigate apps like you do with other android sticks.", "verified": true, "helpfulness": "0/0", "author": "adam kennedy"}, {"rating": 3.0, "review": "No HBO go", "verified": true, "helpfulness": "0/1", "author": "W. Acevedo \"Will\""}, {"rating": 5.0, "review": "This was the easiest plug and play product I have used. The installation and set up were a breeze. I was able to log into my Netflix account and stream a video within minutes of opening the package. The app on my Kindle Fire was also very easy to set up and use. Love this new product!", "verified": true, "helpfulness": "0/0", "author": "T. Fox"}, {"rating": 5.0, "review": "👌👍", "verified": true, "helpfulness": "0/0", "author": "Kenny rojas"}, {"rating": 5.0, "review": "Great!  Works perfectly well and is terrific.  If your a Prime customer you want one.", "verified": true, "helpfulness": "0/0", "author": "robert silver"}]