[{"rating": 3.0, "review": "Just installed the new Fire TV Stick and it's not much to write home about.Pro's:It is very easy to installI would have liked to been able to turn off the Training Video.It is pretty fast.Cons:I really don't like the GUI. Actually it 's horrible.  (Take a look at how the Roku 3 Series does a GUI and you will realize it is the right way to do it.)The remote has a habit of jumping two \"lines\" at a time.No way to add Private Channels like I can do on a Roku.I got the product for the introductory price of $19.00.  If I had paid full price I would have definitely sent it back and got a Roku Stick. And I still may do that. Not worth 39.00", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"MarcFTL\""}, {"rating": 1.0, "review": "Constantly buffers.  Can't go 5 minutes without it pausing.  Not good and I'm disappointed", "verified": true, "helpfulness": "0/1", "author": "Mark A Jackson"}, {"rating": 5.0, "review": "I bought this when it was on sale and received it last week. Absolutely fantastic. It was so easy to set up it was ready to go in a few minutes. I don't think it could be easier. I do agree that it is a shame that the remote does not support voice control. Though there is an app for this (of course) that can be used on your smart phone. However it does not work with apple smart phones as of yet. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Larry J. Ellison"}, {"rating": 3.0, "review": "The Good: Has a good amount of content, Hulu and Netflix apps available, companion phone app, fairly responsive for a stick, included HDMI extender helps with tight HDMI installs.The Bad: Search feature will not include Netflix results and only pulls in with the Hulu option if the same season/etc is available on Amazon, almost broke the remote trying to open the batter cover, some bothersome lag inside apps, menus could use better scrolling instead of bringing up their own screen.The Ugly: AC power cord hurts the hidden aspect, ring on the remote is just for show as the only directions are Up,Down,Left,and Right.Verdict: Not bad for the money and interface is a little nicer than most smart TV/DVD player apps. Won't replace a dedicated device (Roku, Fire TV, etc.), but it's good for a secondary TV or if you don't have a dedicated streaming device.", "verified": true, "helpfulness": "0/1", "author": "googlefish"}, {"rating": 5.0, "review": "The fire tv is really responsive and the remote is as good as roku and smaller. You can access amazon prime content and load time is much faster than my roku. Video quality is really good too and installation is short and easy. I got this as a gift and been watching prime video with my brothers prime account.", "verified": false, "helpfulness": "0/0", "author": "Mark Levi"}, {"rating": 5.0, "review": "Wasn't sure I was going to like this item, but I do. Works great, easy to hook up. Great flexibility, can do searches by voice commands. Fairly neat little gadget. Worth the price. Amazon appears to be really supporting this product and eagerly wants our feed back and support. Recommend to all.", "verified": true, "helpfulness": "0/0", "author": "Michael Small"}, {"rating": 5.0, "review": "At $19 this was a very good deal. I'm not sure if I would pay the full price for it.Pros:  It is a way to watch Netflix and Amazon prime without having to deal with a computer at all. The remote control is very tiny and light weight.  At $19 it's definitely worth what it gives you.Cons:  The controls are not very convenient.  There are not many buttons on the remote control and just about everything requires that you get out of whatever you're watching in order to reach the main menu on the screen because that is the only location for a lot of stuff.  I also do not like the fact that there is no off button and that the sleep button requires very many steps to reach.", "verified": true, "helpfulness": "2/2", "author": "TV watcher"}, {"rating": 5.0, "review": "Received my firetv stick today and must say it is awesome.. First, let me mention that I am the owner of apple TV, roku 3, logitec revue (Old google TV), and the regular fire TV..  The regular FIRE TV replaced my revue on my main television.. I loved it so much and enjoy it much more than my ROKU that I purchased this fire tv stick as a replacement for my roku in my bed room..First, Fire TV (Both the stick and the regular) don't have nearly the \"Channels\" that roku has BUT i honeslty only used 3 or 4 channels on my roku.. Netflix, Amazon Instant video, Hulu, and crackle..  Fire tv has all those channels and does them ALL including netflix, much better than the roku..  PLUS fire tv can play games..Now, let me mention that the stick doesn't play games nearly as well as the regular fire tv, but this was to be expected.. It has a lot less power than the regular fire TV but the stick plays games like sonic amazingly!!!Compared to the fire TV, I would still rather have a fire TV, regular version, for my main TV bc it is much more powerful when it comes to games and even other things, but for a bedroom or for a TV that you don't expect to play games on, the TV Stick is amazing!!It integrates very very well with Amazon instant video and does apps like netflix very well. Still ASAP is amazing on Amazon videos and I wish netflix would be allowed to use ASAP sometime in the future!! Also, just like my regular fire TV, the streaming quality is much much greater than ROKU.. Why?? I really have no idea but the roku never really gets to \"HD\" quality with my internet connection and the fire tv, both my new stick and my regular fire TV always get to \"HD\" quality.. With ASAP on amazon instant video it STARTS in \"HD\" and stays there...  Netflix also has improved streaming quality and again I have no idea why unless the wifi is just better in these than rokus.. Same internet connection!Keep in mind these devices do need power BUT my TV has a USB port that I never use so I just power mine from the TV's USB port.. Works fine!!", "verified": true, "helpfulness": "2/2", "author": "Devin Stephens (I Review, email in Profile)"}, {"rating": 2.0, "review": "Netflix would not play audio. No Plex Pass app. No WWE Network.I'm only giving it 2 star for Amazon Prime. If this is all I wanted to use it for, it would be worth purchasing.However, it works nowhere near as well as my Roku so I cannot recommend anyone spending money on the Fire TV Stick unless you only want to use it with Amazon Prime.", "verified": true, "helpfulness": "0/2", "author": "Mike Sanders"}, {"rating": 5.0, "review": "Outstanding device. I actually prefer this to the Chromecast, which I also own.", "verified": true, "helpfulness": "0/0", "author": "C. J. Peter \"writer\""}]