[{"rating": 5.0, "review": "I bought this for the TV in my bedroom because I didn't have Netflix on it. It's just a basic HDTV. It was easy enough to plug in. But it took me a while to figure out how to use my remotes to easily navigate between regular TV & the Fire Stick (however, I'm not particularly savvy when it comes to this stuff). Once I figured out how to navigate between the two, and it really is pretty simple, I love it! For $40, this is a bargain!! Now I can watch so much more than before. I definitely recommend this to anyone with a simple TV.", "verified": true, "helpfulness": "3/3", "author": "Julieann Franz"}, {"rating": 2.0, "review": "After using the stick it just fustrates me. if unplugged or loses power you have to setup all over again!!!", "verified": true, "helpfulness": "1/1", "author": "Rockford808"}, {"rating": 2.0, "review": "This thing is awesome! Compact, easy to use, and the interface is very well done. I love it when it works which is about half the time. The WiFi component is either terribly designed or very cheap. I have a 20Mbps connection and the fire stick is about 15 feet from the modem. Every device we have ever connected has worked flawlessly including online gaming and streaming video. The fire stick however cuts out constantly and displays a message saying the Internet connection is too slow and to try again later. Very unfortunate because the rest of it is genius. BTW I have tried performing trouble shooting tips, I am using the oem cables and still having issues.", "verified": true, "helpfulness": "1/1", "author": "Trevor"}, {"rating": 1.0, "review": "Didnt work and support that wasn't helpful", "verified": true, "helpfulness": "1/1", "author": "VanderHoly"}, {"rating": 5.0, "review": "This product meets all expectations.", "verified": true, "helpfulness": "1/1", "author": "Jill clayton"}, {"rating": 1.0, "review": "Video freezes all the time when using the Hulu app.  Granted, Netflix and Amazon Instant Video work perfectly, but the freezing video (very consistently, too) is unacceptable, since my SmartTV, Smart Blu-Ray Player, and Roku Box can all play video without any video freezing/out-of-sync-with-audio issues.I mean - this is supposed to be a device that plays video; couldn't you spend a bit more time testing basic video playback releasing the Hulu app?", "verified": true, "helpfulness": "2/2", "author": "Eric H."}, {"rating": 3.0, "review": "OK, but not as easy to use as advertised.  Did not realize power adapter was required which adds to clutter I was trying to get rid of.  Definitely misled a bit by advertising.  One the other hand works well once configured.", "verified": true, "helpfulness": "0/0", "author": "Cold Stuff"}, {"rating": 5.0, "review": "While I don't have other streaming sticks, the Fire TV Stick easily wins in my eyes because it supports device mirroring and works as soon as it is plugged in.", "verified": true, "helpfulness": "0/0", "author": "Steven P."}, {"rating": 5.0, "review": "Great reception, good interface, I still basically just use it for Netflix, but the option to bring it with me when I travel to a random hotel so I won't have to buy a movie there... GREAT BUY!", "verified": true, "helpfulness": "0/0", "author": "Ryan Harger"}, {"rating": 5.0, "review": "Love my fire stick; love being able to use this instead of a gaming console. I need another asap~~~~~Update: 4/4/2015After having this baby for a few months my impression is still the same. LOVE IT! I cast from my iPhone or the kid's can cast from the Kindles (which starts a war). The picture quality is phenomenal on my HD and the sound quality is the same as regular TV (I have a sound bar on another TV that I'm going to try out). The only glitch I have had is trying to cast from my phone to the stick with the Youtube App. It can freeze and stop playing, which is a pain but not enough to detract from the overall performance", "verified": true, "helpfulness": "0/0", "author": "Stuffing's Mommy"}]