[{"rating": 5.0, "review": "Love this.  Have been watching a lot of movies.  Would recommend it to anyone.  Glad I am a prime member.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LFox\""}, {"rating": 5.0, "review": "Great item...there is no lag like other comparative devices.", "verified": true, "helpfulness": "0/0", "author": "Isaac Sharon"}, {"rating": 4.0, "review": "Doesn't mention that you have to plug it in to the wall to power it.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Cate"}, {"rating": 2.0, "review": "Trouble downloading. Internet said it was not there problem. But Amazon said it was there problem. Mmmm", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 5.0, "review": "Superb", "verified": true, "helpfulness": "0/0", "author": "Ritika"}, {"rating": 4.0, "review": "Has pretty much everything and very easy to use", "verified": true, "helpfulness": "0/0", "author": "Tina Mae"}, {"rating": 5.0, "review": "Works great. Didn't bother with the upgrade to a voice enabled search. Really didn't find it necessary.", "verified": true, "helpfulness": "0/0", "author": "yanquidawg"}, {"rating": 5.0, "review": "We've had the Fire Stick for almost two weeks and no complaints.  Its great having access to our online streaming services from basically anywhere that has a HDMI port (any tv,  computer,  ect).  Extremely portable and small.  The remote is super simple nothing fancy and the best part for me with a Samsung phone (android system) you can download an Amazon Fire remote app!  Basically we're happy so far.", "verified": true, "helpfulness": "0/0", "author": "susan wells"}, {"rating": 5.0, "review": "I got this as a gift for my husband and he loves it. We subscribe to Netflix, we have on demand and some premium channels but he has watched nothing but this. He loves how quickly it starts up, as opposed to Netflix and he likes the ease of the remote. It arrived 6 days earlier than anticipated also :)", "verified": true, "helpfulness": "1/1", "author": "Kate Stocke"}, {"rating": 3.0, "review": "Great if you have Hulu, Nexflix, etc, other wise, pretty useless.Also, I don't like how on the commercial, it showed them just plugging into the TV and it working.  No where did it show it needed to be plugged into a power source.  The way my TV is set up, I had to reconfigure the HDMI ports for everything else to accommodate for the power cord placement.", "verified": true, "helpfulness": "1/1", "author": "Josh"}]