[{"rating": 5.0, "review": "Surprisingly pretty great!  Powerful guts and intuitive user interface, I love the Bluetooth remote, and I'm sure the stick uses significantly less energy than my PlayStation 3 for streaming", "verified": true, "helpfulness": "0/0", "author": "Neil Allan"}, {"rating": 5.0, "review": "Easy set up, quick streaming and super easy to use. It is a snap with Netflix and Amazon which is why we switched from Chromecast.", "verified": true, "helpfulness": "0/0", "author": "L. Lawrence"}, {"rating": 5.0, "review": "So easy to set up and watch. We love it!", "verified": true, "helpfulness": "0/0", "author": "Leslie Southard \"Meow Me\""}, {"rating": 5.0, "review": "ZEn Pinball a game if you like pin ball this is the one.  Several different tables $1.99 each upgrrade but well worth IT", "verified": true, "helpfulness": "0/0", "author": "Scott Ritchie \"The Great Sagw\""}, {"rating": 3.0, "review": "Very fast, but the menu is cluttery and too amazon centric. My biggest complaint is that the netflix app will only get up to 1050 Kbps whereas my roku devices get up to 2250 Kbps. So I lose a ton of video quality with this stick. They need to fix this video issue.", "verified": true, "helpfulness": "1/1", "author": "SP17"}, {"rating": 2.0, "review": "I wanted it for Slingbox. Pathetic! Stick to the iPad and cord. Cuts out, odd messages ... and we have 50 mbps.", "verified": true, "helpfulness": "0/0", "author": "Gordon Bailey"}, {"rating": 5.0, "review": "I love this product so much. It is very easy to install and it is not bulky.Music: lots of free music. Pair it with a good sound system and you'll be having a great party. The pandora app is very good as well to pair with. The YouTube though needs development.Movies: a lot of free movies. There are also movies that can be purchased. It is more expensive than red box but comparable to comcast on demand. It is still cheaper than going to the movies so in the essence it is still cost effective compared to going to movie house.Overall, this is a great addition on the 2 day shipping of prime membership.", "verified": true, "helpfulness": "1/1", "author": "Harold"}, {"rating": 5.0, "review": "Awesome product! Great features and easy UI. It blows Chromecast out of the water IMO. Super glad i was able to get this at the special pre-order price!", "verified": true, "helpfulness": "0/0", "author": "Mike A in LA"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Gayle"}, {"rating": 2.0, "review": "Finally got a chance to plug in the Fire TV Stick and use it. I am not happy. It has a big audio problem that needs to be fixed. In Dolby Digital Plus mode, the audio skips. In regular stereo mode, there is a continual buzzing. I am a bit of an audiophile, so I did the necessary troubleshooting. The problem exists regardless of which media is being used, as I tried NetFlix, Amazon Prime, and digital copies of movies I owned from Amazon and other services. Just to make sure it was not the HDMI slot I was using, I tried other slots and had the same problem. I even tried a different TV. Both of the TVs I use also have Dolby Digital Plus capabilities, not to mention other formats. One TV even has a receiver that decodes all of the formats (DD, DD Pro Logic II, DD Plus, DD TrueHD, DTS, DTS-HD, DTS-MA, DTS Neo:6, etc). So, it was not a format decoding issue on my end or any hardware issue outside of the Fire TV Stick itself. Basically the thing is useless for me to watch anything.", "verified": true, "helpfulness": "0/0", "author": "Ranger12"}]