[{"rating": 4.0, "review": "I was hoping that I could include my exfinity streampix onto the fire TV stick, but no such luck.  I like that I can listen to music.", "verified": true, "helpfulness": "0/0", "author": "Karen A. Clancy \"California Granny\""}, {"rating": 4.0, "review": "great stick but doesn't have the ability to cast your computer screen on a TV. this would be a nice add on as Chrome cast from \"GOOGLE\" has this feature. I recommend this stick, but I would get the Chrome cast as well so you can finally cut the cord....:)", "verified": true, "helpfulness": "0/0", "author": "Dennis Connors"}, {"rating": 4.0, "review": "It's awesome for cord cutters - we got rid of our cable a while ago and had plugged in a kindle to the TV with an HDMI cable, then I heard about the Fire Stick and decided that for the price it was worth a try. The only problem I have had is with the Hulu app, it stutters and sometimes quits, sometimes the picture goes out but you can still hear sound. I think this is probably a hulu app problem and not the fire stick because Netflix and Amazon Prime work perfectly. I love the Fire stick app on my phone too, it controls everything and even has voice search! If they could fix the Hulu app, this would be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "DeeAnn \"D\""}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Brian Jefferson"}, {"rating": 3.0, "review": "Stick it's self is good, I was expecting more free shows with my prime membership", "verified": true, "helpfulness": "0/0", "author": "kimberly leonard"}, {"rating": 5.0, "review": "Easy to use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Gail Lewis"}, {"rating": 5.0, "review": "So Great!", "verified": true, "helpfulness": "0/0", "author": "Molly Brasure"}, {"rating": 5.0, "review": "I love this stick. I don't get to use it as much as I would like but it is wonderful!!", "verified": true, "helpfulness": "0/0", "author": "tglenn1025 \"Terri Glenn\""}, {"rating": 3.0, "review": "Spectrum Charter cable is not available for this device.I was very dissapointed.", "verified": true, "helpfulness": "0/0", "author": "Leon J Hamilton"}, {"rating": 5.0, "review": "This might seem strange,  but when I first got the device I felt like I was cheating on my Chromecast.Voice search from the app work great and the included remote, while small is easy to use.I use Plex to view local media on my tv and the Fire TV Stick handles videos much better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "jevan"}]