[{"rating": 5.0, "review": "Got it for half off but worth the full price.  It compliments my Prime membership and I'm loving it.", "verified": true, "helpfulness": "0/0", "author": "B I."}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Israel gonzalez"}, {"rating": 2.0, "review": "Very portable, but the software is not on par to play movies in HD reasonably. Used with my Panasonic HDTV, plugged into the USB, and the setup was easy with a few clicks. When used with the Internet service of 15Mbps (SuddenLink), the movies in SD were simply unpleasant and viewers got discouraged - forget about HD. So upgraded the internet speed to 30Mbps, movies in SD played okay but still stuttered from time to time - HD was on and off based on the bandwidth, and then the message popped up complaining the Internet speed. My Panasonic HDTV has a built in Amazon Prime Video app, so I plugged the ethernet cable into the HDTV and connected it to the router. Logged in, and tried to play the same movie like Jack Reacher, and etc., very smooth or anything, it plays in HD.Please note, if you have higher Internet speed (like 50Mbps), the experience might be better. I might keep it for travel, hoping amazon will upgrade its software on this Fire TV Stick soon enough to fix those playback issues.", "verified": true, "helpfulness": "0/0", "author": "1.apple.sfo"}, {"rating": 5.0, "review": "Easy set up works wonderfully with my 7 year old flat screen TV. Was worried that the navigation would be awkward and slow, but it's anything but. I have had it for 5 days now and just love it. A easy inexpensive way to make a older TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Started using it this morning. Worked great after the software update. Everything is lightning fast. I plugged it into my hdtv and followed the directions and it worked so well that we unplugged it and tried it in our \"smart\" tv to see if it would stream faster.  It does! I ordered a second one for our smart but not speedy \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "BarbaraS"}, {"rating": 5.0, "review": "Pros: easy setup, great video quality on 42 inch tv. Casting from my android (galaxy s4) is easy.Cons: have to plug it in for performance reasons", "verified": true, "helpfulness": "0/0", "author": "Ian B"}, {"rating": 5.0, "review": "So cool! Hooked it up in a minute, was streaming a flick and listening to tunes right away!Has a super fast search engine and the remote works great.Turned my dumb tv into a smart tv for $39....thanks amazon!!", "verified": true, "helpfulness": "0/0", "author": "chipper"}, {"rating": 5.0, "review": "I have 2 Roku 2's; one at home and one at my cabin....the Fire Stick arrived and I just plugged in and registered..works great!  We will use in our Airstream.  I like the HDMI connection, and of course the channel selection.", "verified": true, "helpfulness": "1/1", "author": "Jerry L Phillippe"}, {"rating": 5.0, "review": "Excellent product.  I have a Roku and have used the Google Chromecast.  This seems to have the most robust offering with ease of use thanks to the App.  Very impressed.", "verified": true, "helpfulness": "1/2", "author": "BDH"}, {"rating": 1.0, "review": "Whenever I click the Home button in the controller, it deregisters the amazon account and sends me to the login page.", "verified": true, "helpfulness": "1/1", "author": "Osvaldo F."}]