[{"rating": 4.0, "review": "Started out pretty good; now everything I try to watch says \"we've encountered an error with this video, select another title\". Code is \"license error\" or something to that effect. Now, as I try to watch anything NOTHING COMES UP so I can't even see what it actually says.Just spoke with customer service, very helpful. Apparently my wifi connection is too slow or too many people in my complex are on line right now. I need to have a stronger signal for optimum performance.So, other than that, I really like it.....", "verified": true, "helpfulness": "0/0", "author": "DorothyTurner"}, {"rating": 5.0, "review": "Best purchase I ever made. I cut my cable bill in half.", "verified": true, "helpfulness": "0/0", "author": "dianne correia"}, {"rating": 5.0, "review": "Great concept", "verified": true, "helpfulness": "0/0", "author": "Lori Campbell"}, {"rating": 5.0, "review": "Love it. Glad I heard about it", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 4.0, "review": "I love the Amazon Fire stick. I use it every day and it has been the best thing for any TV. It has many all the apps you need. The remote is very nice and allows easy access to all the apps. Using it with your phone is useful too. There is no competition to the Fire Stick. Dont even think about getting Chromecast, it doesn't even compare to the Fire Stick.Now that I have said all the things I about the Fire Stick, I will rant on something that bugs me about it.Wireless connectivity must be fixed.I hate when my fire stick wont connect to the internet. It connects to my home router, but sometimes it just wont fully connect.I get the error \"Connected with Problems\"I dont think it is difficult to fix this error as must devices are connected to WIFI now and the bugs from early development have been fix and usually when there is a connectivity issue, it is fixed by an update very quickly. This product has been out for months and it still has this issue.Its not that big of a deal to re enter your password or reset the stick, but it is an inconvenience and a waste of time.I wish I could rate it lower, but I do love it enough to give it Four Stars.Please fix the connectivity issue.This is the best thing since sliced bread", "verified": true, "helpfulness": "0/0", "author": "Xavier \"Xman\""}, {"rating": 5.0, "review": "Great addition to our family entertainment.", "verified": true, "helpfulness": "0/0", "author": "quilter01"}, {"rating": 2.0, "review": "I have a Fire at home, and when this product debuted, I thought, \"Perfect, this way I can take Amazon Prime content on the road with me.\"  Not so fast!  There's no way to log onto the internet through a hotel's network if there is a password required for the network.  So it connects to the wifi without problem, but immediately reports, \"connected with problems.\"  There's no way to enter the hotel's network password... so you're dead in the water.The whole premise of the Fire stick is that you can take it on the road.  Does anybody at Amazon ever travel?  Hotel networks almost always require a password.  This is a great idea, poorly executed.", "verified": true, "helpfulness": "0/0", "author": "S. Montague"}, {"rating": 5.0, "review": "I done had apple,roku and a tivo box this is my favorite simple and easy to use no box or wires taking up space i recommend this too anyone you will love it", "verified": true, "helpfulness": "0/0", "author": "cortez roberts"}, {"rating": 3.0, "review": "I love the fire stick when my internet works on it.. I bought it so my 2 year old can watch Netflix in the room when my living room tv is being occupied. well I couldn't figure out how to get any of the apps to work.. it took forever to except my wifi password. I didn't know that the fire stick had to be plugged in at all times to a charger.  all the apps  that you would like that it comes with have to be downloaded first before using it. the remote is hard to see when its dark as the buttons do not light up. other than all that I love the concept of it and I do like that I can take it anywhere like if I am traveling and what not. I only have Netflix downloaded onto it because it took forever to download it.", "verified": true, "helpfulness": "1/1", "author": "Samantha christian"}, {"rating": 1.0, "review": "I found this very difficult to use and it practically has to be on top of my modem to work even though it tells me there is a strong signal in other rooms.", "verified": true, "helpfulness": "0/0", "author": "Laura M."}]