[{"rating": 5.0, "review": "Just as good as the Fire TV and faster than Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Patrick Fenoughty"}, {"rating": 5.0, "review": "Does what it's supposed to do. Haven't figured out yet how to bring Google pages up from my laptop. Anyone know?", "verified": true, "helpfulness": "0/0", "author": "Reader700"}, {"rating": 4.0, "review": "great for my home office. easy set up. love the home screen. Just wish it had TWC app, then it would be prefect", "verified": true, "helpfulness": "0/0", "author": "Layasgrand"}, {"rating": 5.0, "review": "Better than expected!", "verified": true, "helpfulness": "0/0", "author": "Vincent volz"}, {"rating": 5.0, "review": "Fantastic, much faster than a smart tv.", "verified": true, "helpfulness": "0/0", "author": "T. Jackson"}, {"rating": 5.0, "review": "I love it. It was very simple to set up and it works great!", "verified": true, "helpfulness": "0/0", "author": "Sandra Jordan"}, {"rating": 5.0, "review": "How can you not love this?  If you are a Prime member, you have to get this.  It is extremely easy to set up.  Beyond easy.  So much content available its ridiculous.  I bought a 2nd one for a bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "JW"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Olga C."}, {"rating": 5.0, "review": "It was easy to install and very quickly done. I had more trouble moving the entertainment center to plug in the power cord than getting this set up. I enjoy being able to watch movies from Netflix on my television now instead of huddling around my computer or Kindle. I have considered taking this with me on a trip, but I'm not as sure of the Wifi in the hotel as I am at home. But that is not the problem with the Fire TV stick and is the problem with the hotel. Still, I am enjoying this alot!", "verified": true, "helpfulness": "0/0", "author": "Rocky Oberlin \"rachel_oberlin\""}, {"rating": 5.0, "review": "I love having the Amazon Fire Stick - cancelled HBO, signed up for Netflix and have a whole new world of viewing options.  So simple to set up I was able to do it myself.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]