[{"rating": 4.0, "review": "My only issue is that it often drops my network when I leave for a while, and I have to unplug it and plug it back in to get it to connect again.", "verified": true, "helpfulness": "0/0", "author": "Steve Gifford"}, {"rating": 5.0, "review": "Fire TV Stick lives up to expectations. This device gets me movies, tv series and my Prime account service As well as my cloud stored photos. I haven't explored all it's possibilities and apps but it instantly changed my screen time life.", "verified": true, "helpfulness": "0/0", "author": "Aleph the Seeker \"Aleph the Seeker\""}, {"rating": 4.0, "review": "Took four hours to set up because it wasn't registered and a lady said it was broken and said I would have to wait two months for another, talked to 2 more people and finally got it to work. Works great after installation", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 3.0, "review": "This is a great thing, BUT it does not consistently work.  My husband and I had visions of giving up most of the cable and rely on the fire stick, but we do not have confidence in the product.  When it works we truly enjoy it.  We have wifi that works.  Our calbe tv and computer works.  Time will tell.", "verified": true, "helpfulness": "0/0", "author": "Kristine Martin"}, {"rating": 4.0, "review": "Ordered in October 2015 - Received around Christmas 2015Plus:It comes with your Amazon account already pre-installed. I'm not sure if that happens for everyone or not. I was on the 2 month early bird pre-order list.Faster and smoother transitions than my other 2 Roku's.Con:I will add a photo later, but the chord for the microUSB charger is already fraying.  It started to fray with less than 1.5 months of use.I shouldn't have to purchase a new USB chord for a brand new product.", "verified": true, "helpfulness": "0/0", "author": "Jonathan H."}, {"rating": 3.0, "review": "Didn't expect it to need its own power cord,  just another wire to join the masses and searching for yet another outlet. Can't figure out if there is an app store,  or if you can only use the apps it presents to you. Was unable to access hbo go due to it not being offered by our cable company on fire tv. It works but only needed when we want to watch YouTube or Netflix.", "verified": true, "helpfulness": "0/0", "author": "m.guinn"}, {"rating": 5.0, "review": "I love this addition to my television. No buffering like Roku.All my photos are there to view also.Plus it's small, easy to travel with.", "verified": true, "helpfulness": "0/0", "author": "sherry slossar"}, {"rating": 5.0, "review": "I NEVER write review, but this is an exception---- Fire TV Stick is WONDERFUL!", "verified": true, "helpfulness": "0/0", "author": "Roslynne Novack"}, {"rating": 5.0, "review": "I love it but it takes up a lot of my wi-fi", "verified": true, "helpfulness": "0/0", "author": "David Spencer"}, {"rating": 5.0, "review": "Vary good", "verified": true, "helpfulness": "0/0", "author": "JOHN   ARAHOVAS"}]