[{"rating": 5.0, "review": "Love it. Great selection of movies, TV shows and of course apps", "verified": true, "helpfulness": "0/0", "author": "clouds"}, {"rating": 1.0, "review": "Misleading information: it does not connect to wifi. I thought it could be a weird problem with my wireless network (since all my other devices work fine), but I found out thousand of people have the same problem. It is impossible to use, it does not establish a working connection. Also, it does not screen mirror Apple devices and it does not work with some apps, like popcorn time. I just spent my money with something useless.", "verified": true, "helpfulness": "1/1", "author": "Amanda Sborgi"}, {"rating": 5.0, "review": "👌🏽👍🏽", "verified": true, "helpfulness": "0/0", "author": "Jackie P. Gonzales"}, {"rating": 5.0, "review": "Very easy to set up and use. Works on any TV with a USB port.", "verified": true, "helpfulness": "0/0", "author": "Joseph Andrew Luck"}, {"rating": 5.0, "review": "Very simple set-up!  Have not used yet, but seems straight forward. A nice device for the money!", "verified": true, "helpfulness": "0/0", "author": "David C. Meling"}, {"rating": 4.0, "review": "Great for cutting cable. But make sure you unplug when not using it because it still connects to the Internet and chews up the data", "verified": true, "helpfulness": "0/0", "author": "S. Brigger"}, {"rating": 1.0, "review": "didn't like it", "verified": true, "helpfulness": "0/0", "author": "jasvir kaur"}, {"rating": 5.0, "review": "So easy to use and install I love it", "verified": true, "helpfulness": "0/0", "author": "Vivian O."}, {"rating": 5.0, "review": "Easy set up. Works as advertised. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Mario Molinari"}, {"rating": 1.0, "review": "Have had nothing but issues going to be sending it back soon as I get some free time. Drops shows and music and can't find wifi yet everything else works fine.", "verified": true, "helpfulness": "0/0", "author": "Ken Lair"}]