[{"rating": 1.0, "review": "I have multiple products like this, and very powerful internet.  This is terrible.  The premise is really good...but when a 7-year old Wii can load and play Amazon Prime Video without having to stall every 2-3 minutes and this can't...then it's not worth the money.  I've tried multiple apps...from Pandora to Netflix to Disney Jr and cannot play anything for more than a few minutes without it having to buffer.  Then, after doing this 2 or 3 times in a ten minute period, the stick just re-starts itself!  It's awful!", "verified": true, "helpfulness": "0/0", "author": "Danielle Logan"}, {"rating": 5.0, "review": "I love this toy!!!bye-bye cable", "verified": true, "helpfulness": "0/0", "author": "steve jarrett"}, {"rating": 5.0, "review": "They could be more clear with the instructions....had to go to youtube to figure it out.  But once you're able to hook it up it's awesome!", "verified": true, "helpfulness": "0/1", "author": "Kelly Solano"}, {"rating": 5.0, "review": "Could not be easier in install. I have no tech skills.First 2 nights of viewing kept me up way too late. This could be a problem.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "having difficulty", "verified": true, "helpfulness": "0/2", "author": "ANNA WADE"}, {"rating": 4.0, "review": "This little stick is great. I just wish it didn't need a whole power adapter to power it.", "verified": true, "helpfulness": "0/0", "author": "nycnic"}, {"rating": 5.0, "review": "Love the choices and flexibility in viewing.Paid for itself immediately. $$$$$", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super easy to setup, and works great after a couple days of having it.** UPDATE **I've had this now for quite a few months and have been very happy with it.  I actually have two of them.  Use it for Netflix, AmazonPrime, SlingTV, Hulu most of the time.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Pickhard"}, {"rating": 5.0, "review": "Great item.. Works very well...", "verified": true, "helpfulness": "0/0", "author": "Robert S. Rowe"}, {"rating": 5.0, "review": "great product. Works as advertised and use it when I travel too saving me the hassle of lugging along a big fire tv unit :)", "verified": true, "helpfulness": "0/0", "author": "Sanjay M."}]