[{"rating": 3.0, "review": "I ordered this since I have Amazon Prime, to take advantage of the instant video on my family room television.  This television sits against the wall on top of a mantle and the hdmi port is on the back.  The sick will not keep a wireless connection.  I also have the Apple TV box that has a 4' wire that lets the box sit out in front of the tv.  The stick comes with a very short hdmi extender (maybe 6\") that still doesn't allow the stick to get a proper wifi signal.  I've ordered a 4' extender cable in hopes of being able to use the Fire TV Stick on my family room tv.  If this doesn't work, I'll be returning the stick.On a positive note, it works on the tv right next to the wireless router and it comes with free downloadable game apps.  You choose what apps to install onto the stick (Netflix, Hulu, etc.)  When you order through your Amazon Prime account, the stick comes pre-installed with your name profile on it.", "verified": true, "helpfulness": "0/0", "author": "Becky-NY"}, {"rating": 5.0, "review": "absolutely  love this.  so easy to install and love watching movies and TV shows from Amazon", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 4.0, "review": "easy set up  and easy to use.", "verified": true, "helpfulness": "0/0", "author": "DMC"}, {"rating": 5.0, "review": "No more Redbox for me!  I can watch movies, shows, videos in the comfort of my home.  Thank you Firestick, for saving me lots of money!", "verified": true, "helpfulness": "0/0", "author": "Cathy C. Ostos"}, {"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "The Loki"}, {"rating": 5.0, "review": "Great purchase - use it for our outdoor tv - connects to our Wi-Fi and works great!", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "This is a great product and works very well.  I like it much better then a Roku device and it appears to stream movies better then my old v2 Roku.", "verified": true, "helpfulness": "0/0", "author": "P. Greco \"Film, Photography, Technology & Book Aficionado\""}, {"rating": 5.0, "review": "For those of you who love movies when you have the time this device AMAZING!  Time is precious and being able to unwind when the moment is available is something to be grateful for.  Thank you AMAZON.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Bought this for my daughter as a present and she loves it. It was easy install", "verified": true, "helpfulness": "0/0", "author": "kitty"}, {"rating": 5.0, "review": "With cable TV costs going up and up every 6 months to a year, I have decided to give the Amazon Fire TV Stick a try.  I first bought one from a local electronics store a few months ago to try. Installation was easy and quick.  The online install guide was very helpful.  I was up and watching some Prime movies in no time. I like the fact that I was able to set a password for parental control.  The biggest hit for our family is the Prime music.  It plays all the music on my Prime music playlist but I can also pick a genre to play any time we want to have music in the background (instead of watching TV).  My son watches a lot of movies on Netflix and this Fire Stick did not disappoint.  I also installed the yoga app so I can do yoga whenever I want to.  We love this Fire TV Stick so much that a 2nd one was purchased on Amazon.com so we can put one in the bedroom TV (the first one is in the kitchen TV).  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Luvmyshelties"}]