[{"rating": 5.0, "review": "Easy to install and use. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Elsa Arcila"}, {"rating": 5.0, "review": "Awesome device.I used it as an xbmc client and to play some cool android games. Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Kits \"Cats\""}, {"rating": 1.0, "review": "Constantly loses connection. Big waste of money.", "verified": true, "helpfulness": "0/0", "author": "Erin Lackey"}, {"rating": 5.0, "review": "I've been a diehard Roku fan since the original.  But for the money, the Fire TV Stick is the best media streamer on the market. It doesn't have the channel selection of the Roku, but if you subscribe to the big 4:Netflix, Amazon Prime, Hulu, and HBO...the TV Stick is the way to go.  The U.I. is faster and content loads almost instantly.  The Fire TV Stick has its own remote unlike the similarly priced (but functionally deficient) Chromecast. Plus, if you really need to play Android games on your TV, the TV Stick has a fairly healthy selection to choose from.", "verified": true, "helpfulness": "0/0", "author": "Gary Lobaugh"}, {"rating": 4.0, "review": "Great product for movies.  My 4 year old loves this almost as much as Netflix.  The remote is a little touchy at times, but I'm not sure if that's an issue with the remote or the internet connection.  Overall a good product.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Very good opcion", "verified": true, "helpfulness": "0/0", "author": "yeney hernandez"}, {"rating": 5.0, "review": "I am so glad I took advantage of a lower price offer and ordered this.  Easy to set up and it had features I did not even know about.  I love it and recommend it highly!  Wish there were more stars to rate it", "verified": true, "helpfulness": "0/0", "author": "ladylovesgrits"}, {"rating": 5.0, "review": "It's amazing! So easy to set up.....prime movies and tv shows at my fingertips. Thanks Amazon for creating an awesome product.", "verified": true, "helpfulness": "0/0", "author": "brandy"}, {"rating": 5.0, "review": "best possible way to watch television", "verified": true, "helpfulness": "0/0", "author": "Lorraine Bourque"}, {"rating": 4.0, "review": "Seems to work pretty well for what I need it to do, but the remote is too tiny and easy to slip down the couch cushions and lose. A silicone case would help but I can only find one for the bigger voice remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]