[{"rating": 2.0, "review": "You get what you pay for. This thing doesnt stream nexflix good, and it stalls with amazon prime. I am returning it.", "verified": false, "helpfulness": "0/0", "author": "Christopher Freeman"}, {"rating": 1.0, "review": "Not what I expected did not work", "verified": true, "helpfulness": "1/1", "author": "karen morris"}, {"rating": 5.0, "review": "Small, effective device and fast delivery.  Worked like a charm.  Bring on the entertainment!", "verified": true, "helpfulness": "0/0", "author": "C. Garcia"}, {"rating": 5.0, "review": "Love it, way better than the Roku 3 I bough.  The screen saver is beautiful and FREE! (vs roku).  Fast processor.", "verified": true, "helpfulness": "0/0", "author": "Juggernaut"}, {"rating": 5.0, "review": "Love it! Way better than I anticipated.", "verified": true, "helpfulness": "0/0", "author": "Dawn lowry"}, {"rating": 1.0, "review": "This product is really useless.  I bought and have tried to setup with Amazon for 2 days.  It won't connect to my wireless although all my other devices have no issue.  They first said the stick needed to be within 2.5 ft of router to work.  Are you kidding ?  I moved to a TV closer to router and it still did not work.  The \"fix\"now is to send a replacement which they made clear \"we usually don't do this\" ... I guess so I would not complain more.  We will see If this indeed is the issue but seems unlikely to me with their recent track record of fixes.  We will update if it works", "verified": true, "helpfulness": "1/1", "author": "Rob O'Neill"}, {"rating": 3.0, "review": "Well I have a Roku and now this but I have to admit the interface for the Roku is cleaner and more user friendly. But fir the cost, I love having access to my prime and other apps on my TV without loading the computer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"JSTC\""}, {"rating": 5.0, "review": "Firestick great but at a great price. Has cleaner interface than the Roku but both work the same.", "verified": true, "helpfulness": "0/0", "author": "MB"}, {"rating": 4.0, "review": "I LOVE my Fire TV Stick but what happened to HBO GO?  I have a Chromecast stick, which was a gift and I loved it until I bought the Fire TV Stick.  I also have a Roku that I love, but my daughter loves the Fire  TV Stick most because of all the kids apps and games (silly games like Crossyroad that she loves).  The main benefit to the Fire TV stick aside from all the apps and game is it's small and the control is why I love it over Chromecast not to mention all the prime movies if you are a prime member is an added bonus.  However, we have basic cable and Hulu and Netflix which have amazing content so I barely ever watch anything on prime TV.  I have a subscription to HBO and was able to watch it on my Firestick.  The benefit is that even though I have cable and a subscription. I don't have to pay for an additional cable box in my room because I can watch many channels through my Fire TV Stick.  However, all of a sudden I was asked to reactivate my device (which happens every so often) and when I go to the HBOGO website to active my device the Fire TV Stick doesn't show up only the Fire TV!!! What a major dissapointment?  What happened? I hope this gets fixed soon.  Either way if you are looking for a low cost streaming device this is the winner for certain but they need to fix the HBO issue.", "verified": true, "helpfulness": "0/0", "author": "Dzenchic"}, {"rating": 1.0, "review": "It;s a piece of crap! Do not buy unless you are totally gullible.It does not work.", "verified": true, "helpfulness": "2/2", "author": "Daniel Grimley"}]