[{"rating": 5.0, "review": "Works great with a great variety to offer!!!", "verified": true, "helpfulness": "0/0", "author": "P Callaway"}, {"rating": 4.0, "review": "I bought this mainly for my wife since the Chromecast is a pain to play Amazon Prime videos.  It was super easy to setup and start using and she's been pretty happy with it.", "verified": true, "helpfulness": "0/0", "author": "anelson"}, {"rating": 1.0, "review": "Returned to store never worked correctly more trouble than it was worth. Got another streaming device from another manufacturer which is working flawlessly.o", "verified": false, "helpfulness": "1/1", "author": "FRANK LOWRY"}, {"rating": 5.0, "review": "so easy to use", "verified": true, "helpfulness": "0/0", "author": "Debra Smith"}, {"rating": 3.0, "review": "For some reason the device refuses to let me change the audio defaults meaning that I have to change every source from 5.1 to simple stereo. In addition, some small number of Amazon Prime videos do not allow me to make that change making the film a silent movie. Finally, while my Cromecaster works 80% of the time, this device loses WiFi connectivity at least twice as often...That said, when it works, it works great.", "verified": true, "helpfulness": "0/0", "author": "V. J. Verdolini"}, {"rating": 5.0, "review": "Pros: This is a really nifty device I can take anywhere with me. It can easily convert a regular tv with the usb ports to a smart tv. Even better, it has features that a smart tv doesn't have. I've looked for CBS app on our LG Smart tv, but can't find it. We need to stream from the web to watch, but this little thing comes equipped with the app. The remote control is pretty awesome and makes it easier to navigate between screens. Unlike the google chrome that needs an active computer which requires you to download the chromecast app, the set up with fire stick is so much easier. You def no need a computer to watch anything. The fire tv stick comes with extra memory, but haven't really used that feature.Cons: When I tried watching The Interview from the Youtube app, it didn't work. I don't know if that was just with the interview or that was a fluke for everyone, but when I used chromecast it worked.", "verified": true, "helpfulness": "0/0", "author": "TJ \"TJ\""}, {"rating": 4.0, "review": "I have two of these.  Overall I'm very pleased, although I was disappointed when the first one couldn't power itself from the USB port on my TV.  That TV is cheap, so the USB probably doesn't provide enough power, but the second device powers from the USB on the TV and works fine.The devices work as expected and have great integration with Amazon Prime as you would expect.  They also work well with YouTube and have apps available for Hulu and Netflix.So far though there aren't apps for everything yet.  For example the HBO app in the Kindle store doesn't work with Fire TV yet.But overall I like them and are well worth the money.  Just watch where you place them in relation to your router because they get a lot of interference being behind the TV.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Soave \"MSoave\""}, {"rating": 1.0, "review": "I enjoyed using this for 5 days. Last night I heard two \"pops\" and the tv screen error message said \"this content requires HDCP for playback and this was an unauthorized use\". I lost the tv picture and the cable box wouldn't work. I plugged in my Apple TV and received the same error message. Per instructions from Sony support, I unplugged all devices including the tv..which rebooted  the tv, cable box and Apple TV. The Fire Stick still had the error message and again shut all HDMI ports down. Everything is working fine without the Fire Stick and it is on it way back to Amazon..too bad...very dissapointing.", "verified": true, "helpfulness": "1/1", "author": "Sara Rivka"}, {"rating": 5.0, "review": "excellent no problems", "verified": true, "helpfulness": "0/0", "author": "timothy walsh"}, {"rating": 3.0, "review": "Not sure yet. Works fine. Fast/responsive. Not very many apps.", "verified": true, "helpfulness": "0/0", "author": "Greg"}]