[{"rating": 5.0, "review": "This product is awesome. My tv is already smart. It has WEBOS operating system in it. But It made my TV way smarter than before.", "verified": true, "helpfulness": "0/0", "author": "Recep Erdogan"}, {"rating": 5.0, "review": "Excellent...sent Roku back - the fire Stick has done everything that thead says it will do...very impress", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"greatescape\""}, {"rating": 1.0, "review": "Works sporadically.  Always says check network connection???  Nothing wrong with network connection.", "verified": true, "helpfulness": "1/2", "author": "Valerie J Keogh"}, {"rating": 4.0, "review": "I like it! Still getting use to it! So far so good.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Although I have not fully used the stick to its fullest. I am very satisfied", "verified": true, "helpfulness": "0/0", "author": "Emmanuel St Jean"}, {"rating": 5.0, "review": "Purchased a launch day version and couldn't be happier. It is quick to respond and boot videos.", "verified": true, "helpfulness": "0/0", "author": "Mandy Zaransky"}, {"rating": 1.0, "review": "TOTAL WASTE OF MONEY! I purchased this item to view my small screen on a large screen - laptop PC to TV screen.  This only works if you have an Amazon type electronic devise for your small screen, like a Kindle.  This is a total waste of money as it does not work from a laptop PC.  I will probably never use this item.", "verified": true, "helpfulness": "2/4", "author": "john bryant"}, {"rating": 5.0, "review": "Ordered this item when it was on it's promo price for Prime members.  I had to wait because it was back ordered however...no big deal to me.  Still received my Fire Stick two weeks before expected delivery.Got the stick home and plugged it in.  Yes, you do need to plug the stick into a wall outlet to power.  I knew that and anyone that took any time to read the description should know that it won't power itself.Followed the simple instructions and I was connected to WiFi streaming Netflix in a matter of seconds.  1080p resolution is right on point.  I had no buffering issues even on a slower Comcast connection.  Speed is great.This is a wonderful product if you are looking for a simple quick way to get to online streaming sites such as Netflix or Prime.", "verified": true, "helpfulness": "0/0", "author": "carter"}, {"rating": 5.0, "review": "It combines TV and Internet for some fiery fun!", "verified": true, "helpfulness": "0/0", "author": "T. Barrett Stine"}, {"rating": 5.0, "review": "Works as advwetised.", "verified": true, "helpfulness": "0/0", "author": "H.Steve"}]