[{"rating": 5.0, "review": "This device is the best ive ever seen, experienced, like some new technology sshh...but seriously please purchased this device you will love it because its so easy to set up, it has so many options, its not too expensive,you get great benefits for great prices, there many selections from movies , music, apps, etc more than i could think of to even mention right now but to just put it plainly, think device is the s***. umm and they have other devices to match the fire stick like game controllers, your smartphone! just buy it!", "verified": true, "helpfulness": "0/0", "author": "chanel"}, {"rating": 1.0, "review": "Won't allow my 5.1 surround sound to work, only TV's speakers work. No tech support from Amazon. Sorry I'll purchase a Roku.", "verified": true, "helpfulness": "1/1", "author": "Steve Dozier"}, {"rating": 5.0, "review": "To update Mom's  nice LED flat panel tv, I chose the Fire TV Stick.  This easy to install, efficient, low costing, technologically-based accessory allows my 73 year old mother, an Amazon prime member,  to watch her favorite movies, specials, and  tv series through Amazon's instant video.  Needless to say, she is very happy. Because she is happy, I am happy.", "verified": true, "helpfulness": "0/0", "author": "beth"}, {"rating": 2.0, "review": "It worked for two days and then the screen went black.  Remote won't work.", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Martin"}, {"rating": 5.0, "review": "Great and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Cheryl S."}, {"rating": 4.0, "review": "if it didnt freeze up so much it would have gotten 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jordan B. Longwell"}, {"rating": 5.0, "review": "I love my fire stick. I use it all of the time.", "verified": true, "helpfulness": "0/0", "author": "Natalia M. Vargas \"Nataliaisraddd\""}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "Tony Aguilar"}, {"rating": 3.0, "review": "I've had the Fire Stick for about 6 months, purchased as an upgrade from my Chromecast since I like Prime Instant Video. The stick works fine on our Panasonic plasma for viewing Netflix and Prime -- as long as my wife is not using our Vizio TV in the other room. The Vizio is a smart unit, with it's own Wi-Fi connectivity. However, whenever I turn on the stick, it turns off my wife's TV. She can turn it back on, but this happens repeatedly, mostly (it seems) when I click the stick's \"back\" button, \"home\" button, or circular selection ring button. Personally, I think the problem lies with the Vizio TV, but I am the bad guy each time I want to use the stick. Can anyone help restore domestic tranquility in my home?A few details: both the Chromecast and Fire Stick are plugged into HDMI ports on the Panasonic TV;The use of the Fire Stick remote does not cause the other TV to turn off unless the Fire Stick is turned on, plugged in, and Netflix is brought up;A Netflix movie need not be streaming to cause the problem, but at least the menu of choices must be displayed as a minimum;The other TV does not get turned off every time the remote buttons are pressed, but it happens at least 10% of the time;The Vizio TV need not be streaming in order to get turned off (any mode cam be in use for the TV to get turned off);Both the Vizio TV and the Chromecast/Fire Stick are connected to Wi-Fi via our Xfinity Wi-Fi hub.", "verified": true, "helpfulness": "0/0", "author": "Reading Chemist"}, {"rating": 5.0, "review": "Awesome!  Amazing! Love it.  Best value! !!", "verified": true, "helpfulness": "0/0", "author": "Molly Lazaric"}]