[{"rating": 5.0, "review": "love the firestick. I am watching all new shows that I never got to see on regular cable. worth the &40.00 investment.", "verified": true, "helpfulness": "0/0", "author": "fini"}, {"rating": 3.0, "review": "I was so excited to get this because I only have a Roku upstairs and not for downstairs. This Fire Stick was an easy concept that doesn't take up any space. I was all ready to dive into a movie binge but the quality was shockingly terrible. The movie will stop and try and load frequently, interrupting your movie. It is so frustrating! Also, not all of the movies are in HD and when the movie freezes because it has to continue to load, it comes out of focus. I wish this was as good as my Roku but unless anyone has a suggestion to prevent this issue, I give it a thumbs down.", "verified": true, "helpfulness": "0/0", "author": "Alyssa"}, {"rating": 1.0, "review": "This things stinks! It doesn't come with pre loaded apps, you need to download netflixs and it must be within eye shot of the router or it wouldn't work. Complete disappointment.", "verified": true, "helpfulness": "0/0", "author": "Rodney Hines"}, {"rating": 1.0, "review": "Will not work in other than the room where my WIFI router is installed.  If take to bedroom it loses WIFI signal ofter. My iphone and ipad and android phone all connect to WIFI in all rooms.  I have a Chromecast - it works fine in all rooms.Also youtube has to constant pause waiting to download - runs smoothly on the chromecast.I am american living in Costa Rica - cannot access any movies!  Why not? I have netflix and it works fine here.The AMAZON FIRE TV remote app says not available in my country for Android but is available for my iPad?  Why is this not available?", "verified": true, "helpfulness": "3/3", "author": "cameramike \"cameramike\""}, {"rating": 3.0, "review": "Cheaper than paying to install a new cable box but having easy access to Netflix was the only perk unfortunately.", "verified": true, "helpfulness": "0/0", "author": "AManda"}, {"rating": 5.0, "review": "Just like it says.  Just hook it up and you are good to go.", "verified": true, "helpfulness": "0/0", "author": "Janet Garner"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Betty Strickland"}, {"rating": 4.0, "review": "I like it but Prime Programs (free) not as many as advertised.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Best price,best service.", "verified": true, "helpfulness": "0/0", "author": "John Smith"}, {"rating": 5.0, "review": "My granddaughter loves the Fire Stick for her shows.  Big Time Rush, etc.  A great buy and doesn't take up any space.  It was easy to connect and works like a charm!", "verified": true, "helpfulness": "0/0", "author": "soncerat"}]