[{"rating": 5.0, "review": "Awesome device.  Plays everything flawlessly.  I watch Hulu, Netflix and Prime videos through it.  Just wish it supported HDMI to DVI converters so I can use it on my projector:(", "verified": true, "helpfulness": "0/0", "author": "Peter Griffin"}, {"rating": 5.0, "review": "I bought this as an easy way to watch Amazon Prime movies on my older TV and my wife thought it was unneeded. However, after a week my wife loves it and so do my kids. I like that it's so easy to move from one TV to the other and it's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "dangerboy"}, {"rating": 4.0, "review": "Gift", "verified": true, "helpfulness": "0/0", "author": "Grace Cerillo"}, {"rating": 2.0, "review": "Save your money. Worked a month then won't connect to wifi anymore. Even with the hdmi extension on, it won't work. Owning a roku, apple tv, chromecast, and now this fire tv stick, I can say this is the worse. Only pro is it was only $35.", "verified": true, "helpfulness": "0/0", "author": "Robert Barback"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "1/1", "author": "juan madrigal"}, {"rating": 3.0, "review": "Internet problems if your on the second floor better with close range but buffers alot if ur impatient like me i say dont get it and games on it dont respned well to reaction time.", "verified": true, "helpfulness": "1/1", "author": "josh"}, {"rating": 4.0, "review": "I don't know how I lived before owning this. Overall, I think it's a fantastic product. The only issues I've had are minor ones, that have more to do with the apps themselves. Hulu has a tendency to freeze up and stop playing in the middle of an episode. Every once in a great while the Fire TV Stick will restart while you're in the middle of watching something, but it has happened maybe 3 times in the 6 months I've had it and I use it on a daily basis. Amazon has a great selection on TV and movies, a lot of them are free if you have an Amazon Prime membership. I'd highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "PWallace1227"}, {"rating": 1.0, "review": "I truly regret wasting my money on this. I got it for $19 as a prime member and really wish i had spent the extra money to get another Roku. This was purchased to watch Netflix in bed.  Instead of winding down watching videos on my tv, I end up cussing the fire stick when it refuses to play any Netflix videos or watching them on my phone.  Either way the fire stick is a total waste of money.", "verified": true, "helpfulness": "1/1", "author": "Knit-Wiht"}, {"rating": 1.0, "review": "I hate my firestick. I have tried SO hard to be patient, but I'm over it. I've never been able to get it to work correctly. I've spoken to Amazon support no less than SIX times (each time for over an hour), I've had to buy TWO new HDMI extension cords, and I've had to move my TV into the most ridiculous place to try to get it to get the best \"eye-to-eye\" vision with my internet router. It freezes, it won't play, it won't connect to the network, it freezes some more. I am so, so disappointed. Save your money!!!", "verified": true, "helpfulness": "1/1", "author": "Hope Weston"}, {"rating": 5.0, "review": "Does this really need a review! We love our two Fire Sticks and have found wonderful shows, movies, documentaries and much more. Cannot recommend this more highly", "verified": true, "helpfulness": "0/0", "author": "pslwallace"}]