[{"rating": 5.0, "review": "Fire TV Stick was easy to setup and easy to  use.  Downloading the app to my Kindle was even better.  Only complaint I have is more with Comcast I guess than with the Fire TV Stick and that is you can't watch videos on AE, History, or Lifetime.  Comcast isn't listed as a TV provider.  Hopefully that will be resolved soon.", "verified": true, "helpfulness": "0/0", "author": "Tania Monhollan"}, {"rating": 4.0, "review": "Good product. Not enough free content. Love the Amazon original series Bosch.", "verified": true, "helpfulness": "0/0", "author": "bart pariso"}, {"rating": 5.0, "review": "Extremely fast, easy to use, has everything I want in one place.", "verified": true, "helpfulness": "0/0", "author": "Lisa R Schell"}, {"rating": 5.0, "review": "I love this item, can access PLEX easy!", "verified": true, "helpfulness": "0/0", "author": "Kimberley"}, {"rating": 5.0, "review": "Me likely likey", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very happy", "verified": true, "helpfulness": "0/0", "author": "Orlando Torres"}, {"rating": 5.0, "review": "Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Chris Charlton"}, {"rating": 2.0, "review": "I am having difficulty with this. Every time I turn it on, it has to be reset to original settings. It has my wifi saved, but will not connect. I have to enter my prime account and reconnect to wifi every time I turn it on. then, I have to go through the film on how to use. Very annoying.", "verified": true, "helpfulness": "0/1", "author": "Diane Kronmiller"}, {"rating": 4.0, "review": "It works great! Easy to set up and use. Have enjoyed watching movies and shows on Prime and Netflix. Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "K. Jones"}, {"rating": 3.0, "review": "Pretty glitchy. Playback is often out of sync and I haven't figured out how to fix it so I bought Apple TV. I use the Fire stick primarily for Pandora which so far has been glitch free. Amazon music works well, however Amazon play and Netflix are inconsistent. It's pretty easy to set up, but the product is iffy.", "verified": true, "helpfulness": "0/0", "author": "3G Palm Springs"}]