[{"rating": 5.0, "review": "Love this! Perfect solution to my family's entertainment woes.", "verified": true, "helpfulness": "0/0", "author": "Erin Bell"}, {"rating": 5.0, "review": "Great device. Works like a charm!!!", "verified": true, "helpfulness": "0/0", "author": "ODELL C LEWIS"}, {"rating": 5.0, "review": "We love it. We have access to  so much more great programming. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Shoe Lover"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well enjoy watching shows that I could not get before", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to navigate and great selection of apps.", "verified": true, "helpfulness": "0/0", "author": "Carlos M. Rodriguez"}, {"rating": 5.0, "review": "Bought these for my teenage daughters so their not so smart tvs could be used as a smart\"er\" tv and they could stream their videos/movies etc... the setup was super simple and the device has done wonders to curb the living room tv arguments.", "verified": true, "helpfulness": "1/1", "author": "Dawn Salak"}, {"rating": 1.0, "review": "THIS PRODUCT IS HORRIBLE! DON'T GET IT. RECEIVED MINE ON TIME; WAS VERY HAPPY UNTIL I OPENED AND BEGAN TO SET IT UP. I COULD NOT GET THE SOFTWARE TO DOWNLOAD FOR SEVERAL DAYS. CALLED AMAZON AND THEY WERE NICE TO PROCESS A NEW ONE IT'S ON THE WAY. SO, AFTER GETTING OFF THE PHONE AND CHECKING THE REVIEWS I WAS STUNNED TO SEE SO MANY HORROR STORIES. IF THE ONE ON ITS WAS DOES NOT WORK, I AM REQUESTING MY MONEY BACK AND STICKING WITH THE ROKU BRANDS AS THEY ARE GREAT PRODUCTS!!!!!!!!!!!!!!!!!!!!!!!!!  I WISH THERE WAS A ZERO RATING THAT COULD HAVE BEEN GIVEN TO THE FIRE TV STICK! RUN FROM IT!!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "1/4", "author": "Caesarleo"}, {"rating": 5.0, "review": "Does everything! installed xbmc/kodi and now this is my HTPC", "verified": true, "helpfulness": "1/1", "author": "Steven S."}, {"rating": 4.0, "review": "The remote wheel scuffs really easily. That's about my only complaint. Sometimes connecting to a network can take a few minutes. Overall quality product. Wish there was Ultraviolet support.", "verified": true, "helpfulness": "0/0", "author": "TheRogueMando"}]