[{"rating": 2.0, "review": "The tutorial is annoying and you can not skip it. It is easy to use even if no tutorial. As far as using amazon prime it is great. However it doesn't have capability to use the apps I wanted. I should have went with Google chromcast it had all the apps I would use like HBO go and crunchy roll. Had to spend more money buying an app to make it airplay from my device and it does the job.", "verified": true, "helpfulness": "0/0", "author": "Adrienne Gutierrez"}, {"rating": 2.0, "review": "Would be better if it could detect and connect to networks which require you to open a browser and log in to the network that way as is often found in hotels.  I bought this for using Netflix etc on hotel televisions so I didn't have to carry stuff to stream to the television from my laptop.  It wouldn't connect to the network though so it was pretty well useless for what I wanted to use it for. Maybe future updates will allow it to recognize and properly connect to the internet when that type of security is used on the network.", "verified": true, "helpfulness": "0/0", "author": "jeffrey clapp"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Joff"}, {"rating": 5.0, "review": "I love Fire TV Stick!Good work Amazon!!", "verified": true, "helpfulness": "0/0", "author": "damian"}, {"rating": 3.0, "review": "Disappointed that my parents cant use the voice remote to watch Netflix without paying extra.  I thought my parents would have an option easier than hunt and peck.", "verified": true, "helpfulness": "0/0", "author": "yvette king"}, {"rating": 5.0, "review": "It's so nice to view movies on the larger screen.", "verified": true, "helpfulness": "0/0", "author": "diana burfield"}, {"rating": 5.0, "review": "How did I ever live without this product before? Preordered it because of the deal given by amazon and very pleased with what it has brought for such a small price. I will be buying these for all the other TV's and as gifts. Great buy and must have for anyone without a smartTV.", "verified": true, "helpfulness": "0/0", "author": "R. ONEILL"}, {"rating": 3.0, "review": "Was expecting the best but it does go in and out of signal, sometimes it takes a couple times to connect so not sure if it's the Unit itself or the mobile hot spot but overall it appears to be a good product", "verified": true, "helpfulness": "0/0", "author": "armando estolas"}, {"rating": 4.0, "review": "The Fire TV stick is a great alternative  to cable or \"dish\" TV. A great selection of TV, movies, books.  When you add Prime your package is complete.", "verified": true, "helpfulness": "0/0", "author": "john storer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "E. Colbert"}]