[{"rating": 5.0, "review": "An amazing deal for the Amazon prime price of half off! It beats the Chromecast in that it has gaming. The down side is that now I need to buy the game controller if I want to play the funner games.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well. Hoping to use this as first stepping stone to eliminate way too expensive cable.", "verified": true, "helpfulness": "0/0", "author": "adam ludwig"}, {"rating": 4.0, "review": "Works good except I cannot get the  PBS app to activate by using the procedure and activation code listed by the stick info. Also I wish it had the basic hulu app in addition to hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Walt Breitigam"}, {"rating": 5.0, "review": "So simple to use!  Great picture quality and lots of offerings.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Morris"}, {"rating": 5.0, "review": "This thing is awesome! I sideloaded xbmc/kodi to watch all my backed up Blu-ray and music library from my upstairs media server. Connected via WiFi-N and runs smoothly. This allows me to watch my media along with Netflix and Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "K. Askari \"neo_rambo\""}, {"rating": 4.0, "review": "for the price of 20$ it is decent enough, need better youtube integration and search functions", "verified": true, "helpfulness": "0/0", "author": "spark"}, {"rating": 5.0, "review": "Excellent and much more affordable than competitors.  Highly recommend the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jilly"}, {"rating": 4.0, "review": "The only reason I am giving it four stars is because Amazon will not sell this device to me for some crazy reason. I got Chromecast and Roku stick without problems at all from Amazon, how can Amazon refuse to sell their own product? The firestick is superior to all those,no matter I paid overpriced to a reseller. I have popcorn hour, wd live, chromecast and roku.I will like to have another one from Amazon.", "verified": false, "helpfulness": "0/0", "author": "Velderve"}, {"rating": 4.0, "review": "Versatile and easy to use. But a bit lagy seeming underpowered.", "verified": true, "helpfulness": "0/0", "author": "Vic"}, {"rating": 5.0, "review": "ABSOLUTELY THE BEST STREAMING STICK AVAILble", "verified": false, "helpfulness": "0/0", "author": "Steven Macias"}]