[{"rating": 4.0, "review": "I can only use Netflix and Youtube on this so was extremely disappointed in that respect but it streams better than Chromecast.", "verified": true, "helpfulness": "1/1", "author": "KA Reader"}, {"rating": 1.0, "review": "Another Prime Member giving an F to availability of prime day deals.  Yes, I can understand a bevy of flash deals scrolling by for other products, but for your own???  This is Black Friday, but only from 12:00 AM to 12:05 AM.", "verified": false, "helpfulness": "5/10", "author": "R. E. Miller"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Marilyn S. Morgan"}, {"rating": 1.0, "review": "Very disappointed that as a Prime member I missed out on ordering this.  I was unaware that the deals were limited to a certain number of people, even if you have a current Prime Membership.  I constantly order things from Amazon, and love the products and service that I receive.  However, I was planning on ordering this as soon as I had access to a computer today.  I won't be ordering it now...I am very upset that Amazon mislead me to believe that as long as I was a Prime member I would be able to enjoy the deals all day long.  Well, I guess other deals except for the Fire TV Stick.", "verified": false, "helpfulness": "4/10", "author": "Skippy2013"}, {"rating": 5.0, "review": "Wonderful, just what I needed for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Sylva Erskine"}, {"rating": 5.0, "review": "Best for price", "verified": true, "helpfulness": "0/0", "author": "giovanni fontanez"}, {"rating": 4.0, "review": "I've tried all the hdmi sticks. Amazon is the fastest and the interface is good.5 stars when i can cast/fling from phone or pad to the tv with non amazon products.You can fling YouTube. Also want to fling prime music, videos and netflix from app on my phone/pad.Would be nice if it worked with the echo in the future. \"Alexa play such and such movie on firestick. Alexa go back 2 minutes.\"Wish movie rentals were $1 or $2 then I might do away with netflix blu-ray service.", "verified": true, "helpfulness": "0/0", "author": "Dewey Ball"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick!  Reduced my cable bill tremendously!!!!!", "verified": false, "helpfulness": "0/0", "author": "Tonya Garrison"}, {"rating": 5.0, "review": "Awesome product!!!! So glad i boight. It arrived in a timely manner. So easy to use", "verified": true, "helpfulness": "0/0", "author": "Shelley Robertson"}, {"rating": 1.0, "review": "Explain to me how you will gladly fulfill my order today for this product at full price yet it is unavailable at the Prime Sale price. If you have it it should be available for as long as you are advertising it at the sale price which is another 9+ hrs. I am extremely disappointed to know that I a prime member since the program's inception cannot get the deal yet someone who is a guest and signed up today will get the deal.", "verified": false, "helpfulness": "3/8", "author": "Liz  Kelly"}]