[{"rating": 2.0, "review": "Sucks that Amazon has to lie about Miracast certification.  This thing works on a VERY limited number of devices, and apparently they didn't check to see that Miracast is a standard.  It'd be like saying that a dollar is currency verified for the entire United States, but then you find out it only works in four states.  Pretty stupid overall.  It does do app streaming alright, but that really doesn't cover screen mirroring, which is the whole reason I got one", "verified": true, "helpfulness": "0/0", "author": "steven daycak"}, {"rating": 4.0, "review": "I really enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Keith W. Zollars"}, {"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/1", "author": "Jennifer"}, {"rating": 1.0, "review": "Drops wifi connection all the time or freezes up after a while . Roku stick that I own works perfectly fine all the time. Please look at other options , I am not sure that Amazon has good quality control on their hardware. Buyer beware.", "verified": true, "helpfulness": "11/12", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I replaced a roku with this. It's so much nicer then having that little box although I haven't yet gotten into.how to download anything more then what came o  it suck as Netflix, Amazon prime,Showtime and one other. I no it's supposed to have a lot more if you want them but you have to go into your account to load them.and I'm not even sure how to.load them to the firestick instead of my fire kindle. I'll figure it out. Otherwise the color on it was amazing. It really made my t.v. look even better then it usually does. Quite brilliant.", "verified": true, "helpfulness": "0/0", "author": "L. Hayes"}, {"rating": 3.0, "review": "While not as functional as the Chromecast, it works simply and effectively.  I just wish the menus were cleared and there was an app for it on the iPhone5.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Meklemburg"}, {"rating": 1.0, "review": "There's not much positive I can say about this device. The UI was extremely laggy, it transitioned slowly from active state to screensaver, the list of chocked would reset while browsing through movies causing me to lose where I was, etc. The worst part? This device has minimal potential value unless you plan on spending some serious cash on Amazon video services. This thing is half Amazon service advertising. I was actually surprised that amazon would ship such a terrible product and am absolutely floored that there are so many positive reviews.", "verified": true, "helpfulness": "3/3", "author": "Philip Kohler"}, {"rating": 5.0, "review": "Just got mine today but setup was easy...Doesn't seem to be as much content on prime movies compared to what we get thru our xbox...would also like to see  WWE Network app added", "verified": true, "helpfulness": "0/0", "author": "Scott Campbell"}, {"rating": 5.0, "review": "Aaaaaammmmaaaaazzzziiiinnnngggg", "verified": true, "helpfulness": "1/1", "author": "Hamza"}, {"rating": 5.0, "review": "After having Google TV, I am loving Amazon Fire TV. Gives me few simple applications to use like customized video news (like the idea), apart from Netflix and Amazon video.", "verified": true, "helpfulness": "0/0", "author": "SS11"}]