[{"rating": 1.0, "review": "I purchased the stick as a compliment to my SLINGBOX, and the remote is not good for this at all.  Very frustrating, and I will probably have to return the stick.  Technical assistance person I spoke to was great though!", "verified": true, "helpfulness": "0/0", "author": "Brian Short"}, {"rating": 1.0, "review": "It doesn't Work signal is always dropped. I have a  Chrome also and have no problems with it", "verified": true, "helpfulness": "0/0", "author": "Mike Jostes"}, {"rating": 1.0, "review": "Not pleased, doesn't easily sync with my Mac.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 1.0, "review": "Can't connect to my wifi. Doesn't offer my cable company for any apps I want... Waste of money", "verified": true, "helpfulness": "0/0", "author": "Grant Cook"}, {"rating": 1.0, "review": "I returned it because I got it to watch MLB.TV and it did not keep up. The streaming was just buffering nonstop, I have have super fast wifi speed. Got the Roku stick and no problems.", "verified": true, "helpfulness": "0/0", "author": "Stephen Coleman"}, {"rating": 5.0, "review": "I get all the apps that I want and it's easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "I love it and my kids can control it with no problem:)", "verified": true, "helpfulness": "0/0", "author": "kathy kik-greene"}, {"rating": 4.0, "review": "Its not the most user friendly,  but I am figuring it out as I go.  The coolest feature to me is the screen mirroring.  I feel it is really set up for prime members. But it comes with everything you need to get it going.  Remote,  batteries,  cord.", "verified": true, "helpfulness": "0/0", "author": "Christina Wozniak"}, {"rating": 5.0, "review": "It has exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Mark Davis"}, {"rating": 2.0, "review": "Not as great of an interface on Plex as I had hoped...  You can fast forward much better.. but the interface is better with Roku.", "verified": true, "helpfulness": "0/0", "author": "Jason Bhattacharya"}]