[{"rating": 5.0, "review": "Likes:• Great for prime members (I’ve been a prime member for years and this just makes it easier for me to stream content to my TV. Prior to this I had to stream through my Wii Nintendo system… Which sucked)• I like the remote, more than the Apple TV one. It just has more “feel“ to it• Lots of fun games included (little app type games that are just free and fun for short time)• Really easy to set up… I plugged in… linked it with my Wi-Fi and I was good to goOverall:It’s funny… Every single company comes out with their own device. At this point, I have the Apple TV, Google Chromecast, Roku, and now The Amazon Fire Stick. I wish there was just one universal device to control everything and sync everything together… Of course that’s the dream of  today…which I doubt will happen anytime soon. As for the device itself, it’s really no better or worse than everything I just listed. It’s better for me in terms of prime movies because it makes it easy to stream these to my television… Very similar to how my Apple TV makes it easy to watch all the movies I have downloaded on iTunes. So all in all, I am happy with the fire stick and I would definitely recommend it to anyone that is a prime member.", "verified": true, "helpfulness": "0/0", "author": "AlmostEverything84"}, {"rating": 5.0, "review": "This thing was a bit of a pain to set up. Had to update it twice before even getting to use it. But since it has been up and running, it is awesome. Time to buy the Fire TV Box for the living room!", "verified": true, "helpfulness": "0/0", "author": "NJ Red Knight \"GO PRIME!\""}, {"rating": 5.0, "review": "so far so good.  Still learning what all is available", "verified": true, "helpfulness": "0/0", "author": "Sophie G. \"Jane Smith\""}, {"rating": 2.0, "review": "First remote failed after one use.  Amazon was great and sent a new one in one day (without too much serious \"try this, try that\"  time).  New remote works, but now must disconnect the power and reconnect each time I want to use it.  It does not start up automatically when I switch to the HDMI it is connected to on my Samsung 46\".  When it reconnects it is fast and responsive, but what a pain!  Maybe needs a software upgrade?", "verified": true, "helpfulness": "1/1", "author": "TheNose"}, {"rating": 5.0, "review": "loving this.  very easy to set up.  like the free month of Netflix, which I plan on keeping after 30 day trial is over.  I can use my smartphone as a remote too.  pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Jackson Fought"}, {"rating": 5.0, "review": "It has worked for me, better than I anticipated; I actually went to buy a Roku and ended up buying the Amazon Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Virginia Pascoe"}, {"rating": 3.0, "review": "When it works its great. However frequently loses connection. Plus wont connect with my new Samsung Tab S which was the main reason I bought it.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 5.0, "review": "So much better than the older wifi blue ray system I was using.  Fast loading (instant almost)  and easy to set up. Need to get another.", "verified": true, "helpfulness": "0/0", "author": "85300zxt"}, {"rating": 5.0, "review": "It works! I have a chrome cast, but amazon does not work with Amazon Prime videos.  Find myself using the fire stick more only because of the remote and the ease of use. My 5 year loves it, but still uses the chromecast to watch his youtube", "verified": true, "helpfulness": "0/0", "author": "Danny Chong \"Danny\""}, {"rating": 5.0, "review": "This is a must for anyone with a HDMI Ready TV that is not a SMART TV or is old enough to be limited as my bedroom 40in is. This is so simple, allows downloads such as Aquariums and Fireplaces. Netflix, Amazon Prime movies, Youtube, Pandora and so on. Its well worth it and I already got a second for my dad and it was appreciated too.", "verified": true, "helpfulness": "0/0", "author": "stang65"}]