[{"rating": 1.0, "review": "Before purchasing the Amazon Fire TV stick, I read through the reviews. What I should have done was google \"problems with Amazon fire TV stick\". When I set it up and instantly had problems with it keeping a connection to my wifi, I went to the Internet for assistance with resolving the issue. What I found was an alarming number of people that were having the same problem, dating back to when this was first released and still no fix. It's a concern when they are aware of a problem with their product, but don't seem interested in correcting it. Since that first day, I can also report that when I try to use the fire TV stick, and it manages to keep a connection to the wifi, although it shows I am logged in, when I try to watch anything, it asks if I want a free 30 day trial to Amazon prime. I am an Amazon prime member. This issue can only be resolved by unplugging the stick and plugging it back in. Then, the next time I turn it on, I get to do it all over again. Streaming video is wonderful, easy, and more and more, the way most of us watch video. Unfortunately, you won't be doing a lot of streaming with the fire stick, swearing yes, streaming, no.", "verified": true, "helpfulness": "2/2", "author": "ReeseGilbert \"reesie\""}, {"rating": 5.0, "review": "Love them, work like a charm", "verified": true, "helpfulness": "0/0", "author": "PEGGY"}, {"rating": 4.0, "review": "Very Easy Set Up! The Problem I had was weak signal from my Router! Not a Firestick problem! Searched Internet and purchased a wifi extender from Amazon and installed today! Both extender and Firestick work Great! Extender purchased thru Amazon also! Cost a extra $39 bucks but well worth it!Actual initial problem was ATT Uverse WiFi!Well worth it for Firestick!", "verified": true, "helpfulness": "0/0", "author": "BT"}, {"rating": 5.0, "review": "I love this thing! I travel loads, and it even works in my hotel rooms!", "verified": true, "helpfulness": "0/0", "author": "Mark On Boat"}, {"rating": 5.0, "review": "it's really great I don't have cable and I don't really miss.  Between my hd antenna and the fire st I can see almost everything I like", "verified": true, "helpfulness": "0/0", "author": "chica sew queen"}, {"rating": 1.0, "review": "I ordered this with the intent of using it on a tv in my husband's workout area. He isn't very good with technology but can operate Samsung Smart TV features on our tv's that are wifi equipped.  I assumed this would be super easy to use. I've used apple tv and other similar devices but I couldn't get past registration with this device. It kept telling me my amazon password was incorrect and it wasn't (yes I am 100% sure) and I kept getting a notification that if I had enabled device notifications to check my phone (???) that totally confused me but I checked my phone and nothing was there.  Also checked email.  THEN I looked online and saw that others have had the same problem and there are links to connect with the \"fire tv team\".  Problem is that I needed something that was virtually fool-proof in order for my husband to use it. So unfortunately it's going back. I wanted to love it and was excited to get it but the set-up glitch made me nervous", "verified": true, "helpfulness": "1/1", "author": "Picky Customer"}, {"rating": 5.0, "review": "Excellent streaming device, plug it and play it.", "verified": true, "helpfulness": "0/0", "author": "Inder"}, {"rating": 5.0, "review": "I needed to purchase this since I have an older TV but it  seems to work very well. I really like having the Amazon Prime, it has many options for programs and movies to watch that I might have missed", "verified": true, "helpfulness": "0/0", "author": "Mimi"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "melissa koch"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Angel Rosa"}]