[{"rating": 5.0, "review": "Does everything as expected.  No issues with setup, running apps, logging in to amazon prime or netflix.Easy to add apps.Useable interface.No concerns.", "verified": true, "helpfulness": "0/0", "author": "bg"}, {"rating": 5.0, "review": "This has been the best Christmas giftOur son has ever given us!!  We are able to watch virtually anything we want, anytime we want. When I'm not reading on my Kindle Fire, I'm watching Fire TV!!", "verified": false, "helpfulness": "0/0", "author": "Cynthia S. Rhoades \"sassycindy\""}, {"rating": 5.0, "review": "Love it!!!  I can't believe all the movies TV shows, etc. that I am able to get.  Installation was soooo easy, even I was able to do it.  The hardest part was putting the batteries in the remote.", "verified": true, "helpfulness": "0/0", "author": "Nan Grey"}, {"rating": 5.0, "review": "Fire stick was a gift that seems to work just great...we are seniors with no experience with smart phones or any streaming devices, but this unit installed itself and we use it a lot to stream Netflix and Amazon Prime freebees....it works wherever you have broadband...we brought it to Florida for the winter...we love it...excellent value....Dave Murray", "verified": true, "helpfulness": "0/0", "author": "David S Murray"}, {"rating": 5.0, "review": "Was a gift from our son.  it's great!  we're really enjoying it.  watching netflix, amazon prime, youtube, etc. with ease.", "verified": true, "helpfulness": "0/0", "author": "Sheila K Larkin"}, {"rating": 4.0, "review": "The Fire TV Stick was easy to set up and is easy to use.  I had to move one of my network routers closer to the TV to stop the streaming lag.  Once I did this, the Stick was plenty fast enough to produce seamless streaming.  The only complaint that I have is that their are not enough free apps.  I hope this changes with future updates.", "verified": true, "helpfulness": "0/0", "author": "RLG"}, {"rating": 5.0, "review": "Very simple setup and a great picture quality.", "verified": true, "helpfulness": "0/0", "author": "nri335"}, {"rating": 5.0, "review": "Very easy to use and set-up.", "verified": true, "helpfulness": "0/0", "author": "Do Die"}, {"rating": 5.0, "review": "I love this.  I have a TV that is not hooked to cable.  This stick is perfect to watch Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Judy Bailey"}, {"rating": 5.0, "review": "Best thing ever! I love it!", "verified": true, "helpfulness": "0/0", "author": "BMS"}]