[{"rating": 5.0, "review": "Easy to install. Huge variety of programs. Simple to navigate", "verified": true, "helpfulness": "0/0", "author": "patricia crowley"}, {"rating": 5.0, "review": "Totally happy with it. Good investment. Good deal.", "verified": true, "helpfulness": "0/0", "author": "Rico Suave"}, {"rating": 4.0, "review": "We like it", "verified": true, "helpfulness": "0/0", "author": "mary greene-carlin"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "R. Divis"}, {"rating": 5.0, "review": "Love the Fire Stick!  I travel for work and have been extremely happy watching my favorite shows on hotel tvs.  Only had one problem in a hotel with wifi issues.  My Amazon movie kept reloading.  Two days later, Amazon sent me an email refunding me the rental cost for that movie, as they had noticed the movie had not played well for me.  What a nice surprise!", "verified": true, "helpfulness": "0/0", "author": "TLL"}, {"rating": 5.0, "review": "Great little piece of entertainment so the the price of itI got total five of them around my house and still want to get moreAlready put aside my google chrome cast and may never using it againThanks a lot", "verified": true, "helpfulness": "0/0", "author": "dung kim thai"}, {"rating": 5.0, "review": "Everything about this is both easy and great!", "verified": true, "helpfulness": "0/0", "author": "R. Fried"}, {"rating": 5.0, "review": "Enjoy immensely", "verified": true, "helpfulness": "0/0", "author": "Jeri Moore"}, {"rating": 1.0, "review": "I'm so sad about this; the fire TV stick seemed to have it all in such a cute little package. Minimalism, style, efficiency, and it did everything I needed. Prime, Netflix, spotify, and then I plugged it in. At first, perfection. And then? Buffering. Buffering every 1-2 minutes. Constantly. I did all the trouble shooting, and then I packed it up and returned this little butthead.Then I spent the extra $50 and got the Amazon Fire TV set top. Best decision ever made. That was worth the money.", "verified": true, "helpfulness": "1/1", "author": "Kaitlin M."}, {"rating": 5.0, "review": "GREAT!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Hart Wooten"}]