[{"rating": 3.0, "review": "There was not really any \"free\" programming.  To make best use of the Fire Stick and make it worth the cost of purchase, you need to either join Amazon Prime, Netflix, etc.  Was a bit disappointed by that, as in reading the descriptions and advertising is made it appear that there was a great deal of available programming without having to join at cost.", "verified": true, "helpfulness": "0/0", "author": "Gracie"}, {"rating": 1.0, "review": "It was great until they issued an update yesterday.  Totally screwed up my music. Useless. I got albums so I could play them. Their Playlist approach is ignorant. Deeply detest it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Very disappointed. The first stick we ordered did not connect to Amazon.com. Technical support tried to help, but after about 90 minutes on the phone, they determined there was \"a problem with the software\" and sent a replacement stick. Same problem, no solution. Third stick did not even get past the Amazon startup screen, and the customer service rep bordered on rude his \"support.\" Fourth stick had the same problem as sticks #1 and #2. Returned all four and ordered a Roku stick. Initially, that did not connect either, but a simple text chat with tech support resolved it in less than 20 minutes by taking me to a \"secret screen\" where Roku has built in access to updates. Once the system update kicked in, the streaming booted up and ran perfectly. More useful, intuitive remote with responsive buttons.$10 difference in price, world of difference in results.", "verified": true, "helpfulness": "0/0", "author": "Margaret"}, {"rating": 5.0, "review": "So much to watch not enough time. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Elisabeth Vilme"}, {"rating": 5.0, "review": "Love my firestick.", "verified": true, "helpfulness": "0/0", "author": "jose fernandez"}, {"rating": 5.0, "review": "works as suggested and is easy to install", "verified": true, "helpfulness": "0/0", "author": "James T."}, {"rating": 3.0, "review": "very disappointed in the small amount of free items to view. Everything was very expensive just to watch. Charging for TV shows that had run on tv was poor. quality and speed was excellent. just wish there was more I could enjoy. Sorry, but Charter pay per view is cheaper than you are per movie. This is below my wishes as I wanted a way to get away from charter. My son has a competitive brand and gets many more apps than I can, I hope this is temporary and will get better.", "verified": true, "helpfulness": "0/0", "author": "Robert E. White"}, {"rating": 5.0, "review": "i'm not a big electronics person and i hooked this up to my t.v. no problem.  it's been a life saver over this long N.E. winter.  i bought another one for the bedroom.  so much better than watching my Netflix and Amazon Prime videos on my laptop!", "verified": true, "helpfulness": "0/0", "author": "debbie m"}, {"rating": 1.0, "review": "While watching a movie, it would just stop, and not work for a few days. I thought it was our connection until it wouldn't even turn on. Glad I only spent $20 on it.", "verified": true, "helpfulness": "0/0", "author": "M. Ferras-arguelles \"Book Reader\""}, {"rating": 5.0, "review": "BUY IT ! TODAY! YOU WILL LOVE IT, YOUR KIDS WILL LOVE IT AND YOU WILL BE ABLE TO TELL YOUR CABLE PROVIDER WHERE TO GO! Netflix, Hulu Plus, and Sling $36.00 a month and a one time purchase that will change your life and your cable bill.", "verified": true, "helpfulness": "0/0", "author": "Todd B."}]