[{"rating": 5.0, "review": "For the price, this is amazing. I can essentially turn my not-so-smart TV into a Smart TV with apps and access to Prime Video.Primarily I use this to watch Netflix on my TV so I can lay in bed and watch my shows instead having to watch it on my computer.", "verified": true, "helpfulness": "1/1", "author": "Ibzan Lagos"}, {"rating": 5.0, "review": "its been great so far and really works well, also very easy to view photos and movies from my phone", "verified": true, "helpfulness": "0/0", "author": "Booky"}, {"rating": 4.0, "review": "Pretty awesome, easy to set up, and goes with you anywhere you want!", "verified": true, "helpfulness": "1/1", "author": "cmporges"}, {"rating": 4.0, "review": "Easy to hook up, navigate, and use. Also flashed with Kodi/XBMC with no issues.However, I ended up returning it to get another FireTV (not in stick form). Being able to have access to a USB port ( for accessories like keyboard mouse combos, etc) and being able to hardwire it to internet rather than depending on wi-fi throughout the house was worth the extra money to purchase the original.If you have a good wireless interent connection and are looking for a media played, I would recommend this product. At the price it's an inexpensive option to get into these products.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Does it have YOUTUBE?!", "verified": false, "helpfulness": "0/1", "author": "Anniie Rosado"}, {"rating": 5.0, "review": "I gotta say, it's pretty great. I have an old (not \"smart\") tv, and bought this so I wouldn't have to keep my computer hooked up to the tv. it was fast to set up and does exactly what I need it to do.", "verified": true, "helpfulness": "0/0", "author": "rivergirl"}, {"rating": 3.0, "review": "I am dismayed by the performance e of the Fire TV Stick because it IS NOT so simple to set up and use. Moreover I find it does not always scroll smoothly- there are distracting delays despite my proximity to my wifi the 4mg to 6 mg of my broadband service. I have set the Fire TV Stick aside and gone back to using my Chrome Cast device for programs I can enjoy via Google.", "verified": true, "helpfulness": "0/0", "author": "rm"}, {"rating": 3.0, "review": "somewhat disappointing.  wifi connection lags and fails at times for no obvious explanation when other devices stream easily.  Interface is easy.  I have not used a usb connector, instead opting for direct power.  Library of shows is very good and expanding.  But I don't use it as much because it doesn't stream well despite good wifi signal and fast internet speeds.  Will likely look to upgrade to a different product (apple tv most likely) for improved streaming and better coordination with other devices (ipad and iphone)", "verified": true, "helpfulness": "1/1", "author": "HusbandDad&Geek"}, {"rating": 3.0, "review": "When i go to see my huluplus app shows it keeps freezing up and sjow continues but the screen is frozen after like 3 minutes or so then it continues but i have missed part of the show!. Not happy!!!", "verified": true, "helpfulness": "1/1", "author": "Ana Oliviery"}, {"rating": 5.0, "review": "works great - love having amazon prime on regular tv", "verified": true, "helpfulness": "0/0", "author": "Sam"}]