[{"rating": 4.0, "review": "Great device! Intuitive interface and easy setup. Only complaint...need the ability to change to Standard Definition (SD) like you do when streaming on a PC. Once this option is added, 5 stars.", "verified": true, "helpfulness": "0/0", "author": "mountainhiker17"}, {"rating": 5.0, "review": "Absolutely love Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Molly"}, {"rating": 4.0, "review": "Love that we can can watch at anytime.  Husband enjoying it more than any of us - very unexpected.  Would like to see more comedies, overall satisfied.", "verified": true, "helpfulness": "0/0", "author": "Dawn Brosie"}, {"rating": 5.0, "review": "This is a great product.  You plug it in to your tv and plug it in if you want to and grab the included remote and start searching for what you want to watch.  It is clear, there are many choices and it is simple to use.  I love it.", "verified": true, "helpfulness": "0/0", "author": "B. L. Pryor \"blpreader\""}, {"rating": 4.0, "review": "The remote control is lacking in style and is boring. My TV has only 2 HDMI ports so I had to but an extender to add more HDMI ports so that I could run Firestick and my DVR. Was surprised I had to have electric connection for the Firestick. I didn't like having to subscribe to other services such as You Tube (no charge) but inconvenient and Hulu (a charge so I did not subscribe). Not sure yet how I use (and why I should/could use) the phone app.I was hoping that the Firestick would give me an additional programming choice from cable but there are not many \"free\" options on Amazon. My son's comment was \"what's the point of this?\"", "verified": true, "helpfulness": "0/0", "author": "Karen Guthrie"}, {"rating": 4.0, "review": "More than I expected.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Awesome,  sheer awesome", "verified": true, "helpfulness": "0/0", "author": "dustin jenkins"}, {"rating": 4.0, "review": "It was OK haven't used it much yet but I'm sure it is amazing gadget to watch show movies etc. Arriving time with amazon is great as always", "verified": true, "helpfulness": "0/0", "author": "JOEL"}, {"rating": 3.0, "review": "It works as described, basically turning any non-smart tv into a smart tv.  However, it does not work for the use I intended.  First of all, it only works if you have wifi.  We bought this to use at our campsite where we have no internet. I called prior to purchasing and was told that you did not need wifi and that it would work similar to a blue tooth device.  As such, we ordered a fire stick as well as a new fire tablet that supported the second screen function.  We planned to be able to purchase movies from amazon, download them onto our kindle and then plug the fire stick into the tv and play the downloaded movies on the kindle through the television.  Unfortunately, this does not work.  You have to have wifi in order for the fire stick to do anything. Also, the only thing \"second screen\" even works on is amazon prime, it does not work for netflix or youtube or anything else.  Here is my question, if you have a fire stick and you have wifi, why would you ever even need the \"second screen\" function on your kindle...all of the content you are able to transfer to the tv is already on the fire stick.  If anyone can answer this or has figured out how to use the fire stick without wifi I would love to hear about it!", "verified": true, "helpfulness": "0/0", "author": "Mom of two"}, {"rating": 5.0, "review": "Absolutely meets my expectations. Easy to install and works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "donk1"}]