[{"rating": 1.0, "review": "This is not worth it. I would suggest just going ahead and purchasing Apple TV. In order for this device to work properly you have to be within 2.5 ft of you wireless router, which defeats the purpose of having a wifi enabled device. I just received it today and will be dropping it off to return tomorrow. It is pointless to say this device has increased wifi strength but then tell customers to sit within 2.5 ft of their wireless router to use the device.", "verified": true, "helpfulness": "0/1", "author": "Katrika Scott"}, {"rating": 5.0, "review": "I have had the stick for a couple weeks nows. We use it in the bedroom for Netflix. As far as it goes, it just does what it is supposed to do. All facets work and it's a very simple and inexpensive solution for the lack of a smart tv or other media streaming device.", "verified": true, "helpfulness": "0/0", "author": "wrongsize review."}, {"rating": 3.0, "review": "It is wonderful when it decides to have connection.  I have to reboot it often.  :(", "verified": true, "helpfulness": "0/0", "author": "LW"}, {"rating": 2.0, "review": "I liked the idea of the fire stick, but it only makes you have a smart TV! You have to buy everything on there! Also wasnt compatible with my apple devices, I had to buy a mirroring app. We're returning ours and decided to go with the Apple TV, which we should have done to start with! It's a way better product, especially if you have Apple products! We love ours!", "verified": true, "helpfulness": "0/1", "author": "Agriggs"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Kary Franklin"}, {"rating": 5.0, "review": "this is my second one that I bought and I would have to say it's my best purchase of the year this thing blows all the other media streamers out of the water and I have like 6 other company's media players and this one is hands down the best", "verified": true, "helpfulness": "0/0", "author": "Peter G."}, {"rating": 5.0, "review": "I am an amazon worshiper. I would buy everything I need from them if I could. This has a superb interface and is a great device", "verified": true, "helpfulness": "0/0", "author": "CFS"}, {"rating": 3.0, "review": "As stated in the headline, this plays Prime Instant videos great after stalling at the very beginning for a second or two. After that there's rarely any loading or glitching. Playing Netflix or Hulu Plus, however, is a different story. Very often with both services the video will freeze or go black while the audio continues. With Netflix this fixes itself by speeding through the stalled video to catch up. With Hulu Plus, the video usually stays frozen until you stop the streaming and go back to it. On it's worst days, it will begin the episode from the beginning instead of resuming. This is completely frustrating!We purchased this as a means to take some of the load off of our aging Playstation 3, but there are sometimes when we have to fall back on that if we want to watch something uninterrupted.Save your money for a roku box or buy a chromecast if you use an android phone. That's my advice.", "verified": false, "helpfulness": "1/1", "author": "chris flint"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jorge Beltran"}, {"rating": 3.0, "review": "Great as expected.Your lost many features for not being in USA", "verified": true, "helpfulness": "0/0", "author": "Mario Ortiz"}]