[{"rating": 5.0, "review": "No problems setting up!", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 1.0, "review": "Fire stick would not recognize my network. I change to several locations even next to roster. Unfortunately I did my testing long after I could return the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Donald Allen"}, {"rating": 2.0, "review": "After a week we got a blue screen with the text, HDCP unauthorized. Content disabled.  We noticed on line that it is a common problem. Through an series of unplug this and plug in that, we were able to get it to work again. It's very disappointed that we are having a well known reocurring issues with it after one week.", "verified": true, "helpfulness": "0/0", "author": "Debra"}, {"rating": 5.0, "review": "Absolutely love it.  Easy to navigate.  Love love love.", "verified": true, "helpfulness": "0/0", "author": "elizabeth ferrell"}, {"rating": 5.0, "review": "Great quick streaming device.", "verified": true, "helpfulness": "0/0", "author": "Sherra"}, {"rating": 5.0, "review": "The fire stick was exactly as described. I have thoroughly enjoyed having it for convenience. Before having the fire stick I used hdmiCable to plug into the tablet. Having the fire stick makes things much less complicated.", "verified": true, "helpfulness": "0/0", "author": "Tommie"}, {"rating": 5.0, "review": "Love it. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Michele T. Pluta \"Michele\""}, {"rating": 5.0, "review": "It is simply outstanding.  All you need is a HDMI port.  Do not need a SMartv, it just works!  I love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Deacon Tom\""}, {"rating": 5.0, "review": "Bought this as a gift. They could not use. I had received Smart Tv for X-mas. Found it very slow to respond. Was going to return Fire TV stick, but tried on my new smart TV. What a difference the Fire stick has made. Everything works much faster and easier now. So glad I tried it before returning.", "verified": true, "helpfulness": "0/0", "author": "BA \"BA\""}, {"rating": 4.0, "review": "It's ok", "verified": true, "helpfulness": "0/1", "author": "Ghulam Abbas"}]