[{"rating": 5.0, "review": "It's an amazing product. My son and I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Marielle Carrington"}, {"rating": 5.0, "review": "Nice unit for the price.  The interface is quick and have had no issues.", "verified": true, "helpfulness": "0/0", "author": "bm4deals"}, {"rating": 3.0, "review": "Is it working in Qatar?", "verified": false, "helpfulness": "0/0", "author": "Mahmoud Elemam"}, {"rating": 2.0, "review": "I like this, but the reason for which I bought, it did not meet it!I bought it for watching Youtube videos from my iPhone, but it doesnt work!Chromecast works so good at home, and I bought Fire Stick for office TV.But when I select a video on my iPhone and click on the cast button, it just stays on Playing on XYZ TV and keeps on revolving.Doesnt work 99% of time.What to do ???", "verified": true, "helpfulness": "0/0", "author": "Soumendra Jena"}, {"rating": 5.0, "review": "I love this Amazon Fire RV Stick, I don't know why I did not order one earlier.  It is so easy to install on your TV.  I actually did it my self and did not have to have one of my grown children to do it for me.  I am electronic challenged!  I enjoy the moves and TV shows so much.  I think I make cancel my regular Cable.", "verified": true, "helpfulness": "1/1", "author": "Wilbur"}, {"rating": 1.0, "review": "The first TV we connected this to was a 5-year-old Toshiba which died roughly 60 days after the initial hookup. No big deal, it was an old TV. Then we connected it to our 2-year-old Visio, and it died within 15 days. This product kills TV's in our house. Do not buy it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer W."}, {"rating": 5.0, "review": "BUY THIS. Easily one of my favorite things i've ever purchased. It;s fantastic.", "verified": true, "helpfulness": "0/1", "author": "clurrr"}, {"rating": 5.0, "review": "Love the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Constance Briggs"}, {"rating": 5.0, "review": "Use it constantly. Wonderful device . Streaming with all the apps, screen mirroring from other devices, this thing is great.", "verified": true, "helpfulness": "0/0", "author": "CB"}, {"rating": 5.0, "review": "This thing works just as expected. Way better then Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Mihai Mircea Ionescu"}]