[{"rating": 5.0, "review": "Great product! Just ordered another for my inlaws. Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Michael Nappa"}, {"rating": 5.0, "review": "its a ok product...", "verified": true, "helpfulness": "0/0", "author": "edison"}, {"rating": 5.0, "review": "I bought this when Amazon had the pre-release sale, and received it a few weeks ago. It's a nice way to have access to all of my amazon music, and the library of Amazon Prime shows, etc. I already have an Apple TV for Netflix/Hulu, but find the interface on this is actually pretty nice too, so I end up switching back and forth. I mostly use it now for Prime shows that aren't available on AppleTV but I may use it more in the future as they offer gaming and things that the Apple TV doesn't currently offer. The controller is a little easier to use than the Apple TV one as well. The actual stick itself is a little awkward, even though it is small I had a tough time finding a place to put it. It actually is connected to the back of my receiver (cord is really short), but it works...just a little wonky. Another thing I like is the remote does not have to be in line-of-sight with the FireStick to work, like the Apple TV does, so I can keep my hand under the covers on the couch and it still works fine. If you don't have a streaming media device, I'd recommend this one if it has the features you need as the price is great. The interface is also probably my favorite compared to Apple TV, Roku, Sony/PS3, etc. If you already have an Apple TV, you're not getting a whole lot of new features, but for streaming Prime or adding basic games to your home theater, it may be worth it.", "verified": true, "helpfulness": "0/0", "author": "Jules Fitzegibbons"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Megan Hariz"}, {"rating": 1.0, "review": "Anticipation waiting for almost 2 months to get it. What a pile of garbage. The wireless reach is pathetic. It's about 20ft. from my router on the other side of a wall. The on screen looks fine, but that means NOTHING if you can't watch a streaming movie. So sad. Did anyone ever bother to test it with a minor obstruction?", "verified": true, "helpfulness": "0/1", "author": "Mitch W. Ripke \"mwripke\""}, {"rating": 5.0, "review": "Got this for the low deal price.  I love it.  Not as FLEXIBLE as the full box but it works for my bedroom!", "verified": true, "helpfulness": "0/0", "author": "Rosemarie"}, {"rating": 3.0, "review": "I get my Amazon Prime video just fine. Contrary to the product description that one can stream directly from devices, I was disappointed to learn that apple products are not supported. To view content of my own, we need to download it to an Amazon cloud site from which we can then stream. A bit cumbersome given other available products.", "verified": true, "helpfulness": "0/0", "author": "M. Leonard"}, {"rating": 5.0, "review": "Fantastic.  What a great way to watch movies.  Love Amazon.", "verified": true, "helpfulness": "0/0", "author": "Harry R. Davies"}, {"rating": 5.0, "review": "Love the fire stick had a couple of issues initially with my fairly new tv.1.firestick inserted into hdmi one and for some reason the tv would not recognize anything plugged into port one? I then tried hdmi port two same issue no signal.I then tried unplugging the firestick from the tv and the wall outlet let it sit for a few and then connect firestick back into power outlet only figured it would boot up first and then plug unit back into the tv this still gave no signal from hdmi port.I am not really quite sure how I thought the next step would work but it did.Here is how I got the tv to recognize firestick through hdmi port.I removed the usb cord from the charger and plugged the end that was in the charger into a usb port on the tv then I plugged the other end into the firestick and inserted firestick into hdmi port one.I then selected hdmi port one on the tv input menu and the firestick was recognized as it should.This problem was on a tv that is seven months old strange however if you have a tv with usb this may be a work around for some having  this particular issue.Now the good stuff set up was really easy once recognized ,wireless set up was easy and streaming quality was impressive netfix no stutter or drops.App selection is large and the voice recognition remote purchased seperately works great so much easier to search titles.All in all love this thing beyond initial issue its great.Would reccomend to anyone.", "verified": true, "helpfulness": "1/1", "author": "ALICE"}, {"rating": 5.0, "review": "I purchased one of these for my bedroom - which is not a smart TV and in the meantime I got a new TV in the living room and it is a smart TV and has the Amazon app built in.  When the TV in the living room started having connectivity issues I brought the Fire Stick from my bedroom and well - I just ordered another one.  The difference is amazing  No lags - no hangs - better picture.  Wow...", "verified": true, "helpfulness": "1/1", "author": "The Analog Kid"}]