[{"rating": 5.0, "review": "I really like the Fire Stick so far.  I use it for Netflix, Pandora, HBO Go and Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "KT"}, {"rating": 5.0, "review": "What an incredible piece of equipment!  LOVE IT!  Right out of the box, the instructions are so simple to follow, and the onscreen tutorial is brief, to the point and simple to follow.  So happy to receive this as a birthday gift!", "verified": true, "helpfulness": "0/0", "author": "Lisa Piotrowski"}, {"rating": 5.0, "review": "I really love it thinking about getting the box", "verified": true, "helpfulness": "0/0", "author": "Duane Henderson-Stokes"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick!  Easy to install.  Movies that aren't free are much cheaper than the theater and stream without a hic-up.  Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "M. Wood \"Beagle Lover\""}, {"rating": 5.0, "review": "Great for the money!!!", "verified": true, "helpfulness": "0/0", "author": "donald"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Ben Kerr"}, {"rating": 5.0, "review": "I own quite a few streaming sticks and the Fire Stick is by far our favorite, so much that we don't even use the others anymore. Its fast, responsive, and has all the media we want. Best of all is the remote control feature. My motherinlaw is not the best technologically speaking, but she can work a remote. Its so nice not having to explain to her how to use a phone to control it when I can just give her the remote and I'm done. If your thinking of getting a media stick, GET THIS ONE.", "verified": true, "helpfulness": "0/0", "author": "Russell J Young"}, {"rating": 5.0, "review": "Love the fire stick,really really love it. Was so very easy to setup and use. I use it everyday to watch shows I haven't seen or movies.I can recommend the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Donna hubbell"}, {"rating": 4.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Edward Rodriguez"}, {"rating": 5.0, "review": "Extremely easy to set up and use. Works great! No issues.", "verified": true, "helpfulness": "0/0", "author": "Tom Bette"}]