[{"rating": 2.0, "review": "Where is google music?", "verified": true, "helpfulness": "0/0", "author": "Thadd Larue"}, {"rating": 5.0, "review": "Bought this as a gift for my sister to use with her bedroom tv.  It was easy to hook up and the remote is a great bonus.  I bought a Google Chromecast last year for my bedroom tv and the Firestick far exceeds it in variety of channels and user friendly", "verified": true, "helpfulness": "0/0", "author": "Mary Jane Cook"}, {"rating": 5.0, "review": "I Just installed it and am still learning.  It was easy to install, but, like all things, it's easier if your are computer savvy.  For example, it lists three steps durng installation.  One of which is \"connect to internet.\"  I thought it meant to my internet server, Cox, but, discovered it meant to connect to my WIFI.  Luckily I had installed WIFI for my Kindle.  Like everything today, it's easier if a person is computer savvy.One other thing I noticed is that, if you click on a movie, it comes on immediately.  There is no info about whether or not a cost is involved; i.e., when I go to a movie on my Kindle, it lists an amount if a cost is involved.Anyway, I'm still learning and would appreciate more info as to how the Fire Stick works.", "verified": true, "helpfulness": "1/1", "author": "Nanette Ouellet"}, {"rating": 5.0, "review": "Got it for my mom, she doesn't have a smart TV so I thought this would be perfect for her, she loves her old cowboy movies, she loves John Wayne so this was perfect. And it works great, easy setup. Next I think I'll get the remote with voice control... At least I think it works with it. Definitely recommend it. Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Terry Diorio"}, {"rating": 3.0, "review": "Gets hot and locks up.", "verified": true, "helpfulness": "1/1", "author": "Bobby"}, {"rating": 5.0, "review": "It is awesome. I reccomend highly.", "verified": true, "helpfulness": "0/0", "author": "Shawn P Brgan"}, {"rating": 4.0, "review": "I love the fact that the fire tv stick does so many things and there are so many apps to choose from.", "verified": true, "helpfulness": "1/1", "author": "William Winchester"}, {"rating": 5.0, "review": "I do not know how we lived without it.  Has replaced our Chromecast as the go to streaming device.", "verified": true, "helpfulness": "1/1", "author": "Jeff B"}, {"rating": 3.0, "review": "nice but had to get new router for speed", "verified": true, "helpfulness": "1/1", "author": "David Smythe"}, {"rating": 3.0, "review": "Disappointed that HBO to go can't be played on it.", "verified": true, "helpfulness": "0/0", "author": "William Toth"}]