[{"rating": 5.0, "review": "I like it a lot and works well with you tube, no lagging, smooth stream. excellent product. I wish with a full web browser, among other great features so I can browse", "verified": true, "helpfulness": "0/0", "author": "Robel Roberto \"Robel747\""}, {"rating": 5.0, "review": "This did exactly what I needed it to do.  I was very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "gary e. davis"}, {"rating": 1.0, "review": "First it wouldn't connect to the internet. Then it refused to download software. Then it told me my email address wasn't valid. Now it says I do not have an Amazon account. I've done all the troubleshooting and it's STILL not working. Literally hours wasted. It's worthless.", "verified": true, "helpfulness": "1/2", "author": "mynci"}, {"rating": 4.0, "review": "I am pleased with the Fire stick since I am able to stream my Amazon music as well as to watch tv and movies.  It is nice to be able to download apps too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Il stick to rocu .these sticks are terrible with wifi. They stop movie way to much even next to modem .....ROKU way better ,, I got fire tv stick 1/2price at best buy taking it back today .", "verified": true, "helpfulness": "1/1", "author": "ari lovato"}, {"rating": 5.0, "review": "I have Roku and Chromecast, and I think my Fire TV Stick is probably the best of the 3. Very easy to use, and most reliable. My Roku constantly has performance issues.", "verified": true, "helpfulness": "0/0", "author": "Audy Bautista"}, {"rating": 3.0, "review": "I like it but wouldnt pay full price. 25 dollars is q good point not to make me consider returning it even if it fails. Leaving the price aside i can tell you this is a very nice device that works well with Netflix and YouTube.  I dont have other services but use plex for streaming my own content from my mac, plex works flawlessly and i am keeping this device for its ease of use and price, which was 25 on black friday. Be aware the remote is a cheaper one than the one that comes with the regular fire tv, so no voice search unless you download an app or upgrade the remote.  But not bad at all. One thing i didnt like is that the search will not find orange is the new black evem though its available from netflix for free. Instead i was given the option to buy episodes, not cool because my wife could have paid for something we already have.", "verified": true, "helpfulness": "1/1", "author": "Richard Inga"}, {"rating": 3.0, "review": "One problem is on the Fire Stick TV main screen which has the front DVD covers of movies and other programming that is inappropriate for young eyes. These inappropriate images are mixed in with offerings for the young ones. My 7, 11 and 13 year old do not need to see a half-dressed woman on top of her boyfriend or two women kissing. I do monitor my kids, but I shouldn't have to send them out of the room to avoid them seeing the main screen. Additionally, it could still use sports apps like NBC Sports Live Extra and CBS Sports. I also think that for my Amazon Prime membership it is still lacking a few more free TV programs.", "verified": true, "helpfulness": "0/1", "author": "Tracy Nelson"}, {"rating": 4.0, "review": "Inexpensive, effective and very easy to use. The reason I rated it with 4 stars is because I just used it for one week. Anyway, I love it.", "verified": true, "helpfulness": "0/0", "author": "Lei Shen"}, {"rating": 5.0, "review": "I am very pleased with the Fire Stick.  Besides Netflix I have access to You Tube.  I was considering buying Apple Tv and for the price it is a better value.", "verified": true, "helpfulness": "0/0", "author": "Christina \"Christina\""}]