[{"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/1", "author": "Valued Customer"}, {"rating": 5.0, "review": "When I received the Fire TV stick a little over a month ago and my son connected it to our TV, I couldn't have been happier with it.  Watching Netflix and Amazon Prime is the best.  However, a few days ago the stick programming, I.e.,  while watching shows and/or playing games, it would freeze up.  After a few days of this,  we are unable to access anything.  We have installed and reinstalled our stick, in addition to checking the source, which checked out to be good, strong connection.  I continue to receive messages that there is no time information and a series of different numbers.  Will Amazon replace it or is there something else I should try?Update: Spoke w/Amazon and after trying to find problem with my Fire TV stick, they sent me a new stick (not the whole package) and it's working beautifully and hope it continues to do so.  Thank you so much Amazon.  This little contraption is part of me now and I don't want to be without it!", "verified": true, "helpfulness": "0/1", "author": "Vintagemom \"45\""}, {"rating": 2.0, "review": "It got hot, then stopped at  one spot, I can't get anything on it. was watching \"orange ...black\" it froze up and I cant even watch season 1..we were on season 3!!", "verified": true, "helpfulness": "1/2", "author": "Kenneth Nowicki"}, {"rating": 5.0, "review": "So easy to use and so much variety.  Love it!", "verified": true, "helpfulness": "0/1", "author": "JasmineB \"Lani\""}, {"rating": 5.0, "review": "This item is AWESOME.......especially with an Amazon Prime account!!  Bought 2 of them and absolutely love them.....and they work well......everyone should have this.", "verified": true, "helpfulness": "0/1", "author": "David Alsept"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick. I was a Roku user, but Roku just didn't understand my need to binge watch and not have to find my remote between episodes. The fire stock has two really cool features for me. First is the before mentioned continuous play. It was keep playing episodes for a couple of hours without you having to touch it. It also has this best feature where if you pause it, it will tell you the actors in that scene. It's pretty cool. I love my fire stick and I haven't looked back since I switched. I now have two!", "verified": true, "helpfulness": "0/1", "author": "Kasey"}, {"rating": 5.0, "review": "Can watch movies even when the weather  stops the satelite from working", "verified": true, "helpfulness": "0/1", "author": "clockman53"}, {"rating": 5.0, "review": "Simple installation, lots of selection.  Very easy to work.", "verified": true, "helpfulness": "0/1", "author": "terry schultz"}, {"rating": 5.0, "review": "This stick is AWESOME!!!!!", "verified": true, "helpfulness": "0/1", "author": "Jon Cromwell"}, {"rating": 5.0, "review": "Top of line products", "verified": true, "helpfulness": "0/1", "author": "Jeff Dubois"}]