[{"rating": 2.0, "review": "I got this for about $12 on sale so any negatives are washed away by that insanely low price. But this device is sold in a very misleading way. Any graphics and summaries portray this device as plugin and you're done. The truth is it requires a USB power cable to power it. So if you are planning to stick this into your smart TV's HDMI cable and call it a day, NOPE. If you have your TV on the wall, you'll either have a cable dangling or have to run it through the wall. It's a huge drawback that Amazon has gone out of their way to avoid mentioning.Once the USB cable is plugged in, it's very decent. Staggers on HD home videos with Plex, but TV shows and movies from Prime Instant in HD run fine.", "verified": true, "helpfulness": "1/1", "author": "G.B."}, {"rating": 5.0, "review": "It's nice to have Netflix and Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Kathy L."}, {"rating": 5.0, "review": "Did not know what to expect when I bought this for my 12 year old daughter. I have been amazed at how much she liked it and I do as well. You definitely need to be a prime member to enjoy perks", "verified": true, "helpfulness": "0/0", "author": "Tim Harris"}, {"rating": 5.0, "review": "I've only owned for a few days and I love it.  I plugged it in and the fire stick did the rest easiest set-up I ever had.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "It arrived and installed fine. After about 2 hours I was not able to watch anything on it, everything was a error message trying to watch  just tv. Looked like you had to buy movies. It appears to be a totally defective product. I would guess there will be court cases about whether Amazon should be allowed to sell such a bad product. I returned it the same day.I have a Windows 7 computer connected to my large screen tv and that brings in antennae tv wellthat is also recordable. I also have Google Chrome and that has several apps that let me watch Hulu and all the other services free. I notice you can just type any show and watch it as long as you watch the commercial first. I did not see a purpose for the stick since it is free to watch pretty much all the same content free after having a internet connection.", "verified": true, "helpfulness": "0/0", "author": "Stephen P. Rimnac"}, {"rating": 5.0, "review": "Thanks for the time I'll be sitting in front of the tv.", "verified": true, "helpfulness": "0/0", "author": "brian kramer"}, {"rating": 5.0, "review": "Excellent! !!", "verified": true, "helpfulness": "0/0", "author": "Brittany Wilson"}, {"rating": 4.0, "review": "enjoying it so much", "verified": true, "helpfulness": "0/0", "author": "Carolyne Givens"}, {"rating": 4.0, "review": "Lots better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "just really got it plugged and watched one movie  my words for this item \"outstanding!!!!\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"old boy\""}]