[{"rating": 3.0, "review": "Nice device, never shuts off, slow in its functionality. Not a chrome cast !!!!Pro: As a \"prime member\" i got the unit for half price, so it was cheap to own. I like the IOS interactive app. Amazon prime works wellCon: You have to run an extra cord to a usb powered adapter to power this on. Imagine the fire stick with a dangling cord running to somewhere behind your tv to another power plug. The included power adapter is awkward and does not fit into standard power strip without taking up two plug spaces....(hint, use the same thing you use to include with the kindle charger.  Why can't this have casting capability.Conclusion: Its the device that doesn't meet chromecast's flexibility and tries but not achieve an apple TV unit. I own personally, all of these device and also a Roku too. I end up going back to my apple TV and have unplugged the fire TV stick and given both away to friends and family", "verified": true, "helpfulness": "0/0", "author": "Pharmer D"}, {"rating": 2.0, "review": "To be honest, I may send it back...I haven't been able to use it yet.  It continues to lose the network connetion and freeze.  The idea of it would be great if only it would work.  I thought it was my connection, but all of my other wireless/internet connections are working just fine.  I'm only having trouble with this...I'm very frustrated.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Now don't get me wrong for only giving this item 4 stars. I use it almost daily, but it gets the worst internet reception I have ever seen in any electronic device. My house is not big and all my other electronics work fine in my room which is where I put my fire stick and I had to invest 30.00 in a router extender to plug into my bedroom wall just to get it to work. Also I'm upset that I bought the stick when it was first released I paid 49.00 for it I believe now they are selling for 39.00 that's anoying, see what I get for ordering early. But that's off track. After I put the router extender in my room the stick works great and like I said I use it almost daily, it's much cheaper than going to the movies. I can watch one every night and they have many movies and shows to choose from especially if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Tammy Baker"}, {"rating": 3.0, "review": "We were going to purchase the Fire TV Stick so we could watch the amazon video after we signed up for Prime.  I'm very glad we didn't, as you can stream the amazon video through a Sony Playstation, which we already had.", "verified": false, "helpfulness": "0/0", "author": "Rachel Cobb"}, {"rating": 1.0, "review": "Poor user interface.", "verified": true, "helpfulness": "0/0", "author": "Amanda S. Creasey"}, {"rating": 5.0, "review": "We couldn't be more pleased with this product. I was worried after reading so many poor reviews mostly complaining about the stick dropping signal. Our router is over 50 feet away and we stay locked on without any problems.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Caldwell"}, {"rating": 5.0, "review": "Usually when I want to watch an amazon prime movie or tv show with my family, I have to hook my computer up to the tv. It gets old after a while. I finally bought this (it had been sitting in my wishlist for a while) and I love it. I got it set up in under ten minutes, most of which were spent trying to get the back off of the remote. That is the only negative I have to say about the fire tv stick. The streaming is great; video quality is excellent, as is audio quality. I really like the remote. It's just the right size and I like the design. The buttons are very responsive, and there is no lag when using it. I also downloaded the remote app for my smart phone, and it too is excellent. I wanted it for the voice control capability. I thought it would be pretty silly to buy the $30 remote when I could get the app for free. And it works like a charm.However I will say that this stick will only be as good as your wifi because it does stream. One of my computers was backing up to carbonite the other day, and while that was going on I couldn't really use the stick to watch any movies, and it would just sit there and buffer and buffer and buffer. Once it was done backing up, it worked perfectly. So that is not a problem for me. So if you have really bad internet, this may not work so smoothly for you. But I love it, it works great for me, and for the price you really can't go wrong here.", "verified": false, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Love this product! I can watch tons of movies and play games!", "verified": true, "helpfulness": "0/0", "author": "plbquinn"}, {"rating": 1.0, "review": "My Fire TV Stick will not connect properly. It keeps saying connected with issues. I have no issues with my WiFi and all my other devices do not have problems. I would like to find out who I contact about receiving a new stick or help with troubleshooting. Really upset this is not working. I have tried using it next to my internet modem and it still does not work.", "verified": true, "helpfulness": "0/0", "author": "Brittanni"}, {"rating": 5.0, "review": "Wish I had known about this item before I invested in cable tv and wasted years of hard earned money,  I recommend it to everyone I know", "verified": true, "helpfulness": "1/1", "author": "Beverly Fouts"}]