[{"rating": 5.0, "review": "Just got it this morning! Really easy set up. Less than 5 minutes and we were watching a movie. Love this!", "verified": true, "helpfulness": "0/0", "author": "Erin Booker"}, {"rating": 5.0, "review": "Great product.  No problems whatsoever, Adds a easy way to double your viewing pleasure...", "verified": true, "helpfulness": "0/0", "author": "David Netterville \"Blue Skies !\""}, {"rating": 5.0, "review": "This was very easy to install and I am enjoying a great deal.  The installation directions were clear and accurate and I have access to a great deal of content.", "verified": true, "helpfulness": "0/0", "author": "Patricia M. Gracey"}, {"rating": 5.0, "review": "Great product, now we can finally watch Netflix on our bedroom TV!", "verified": true, "helpfulness": "0/0", "author": "Mitchell Riddle"}, {"rating": 5.0, "review": "This was incredibly easy to install and begin using. Wonder why I didn't  get one sooner", "verified": false, "helpfulness": "0/0", "author": "Alexandria K."}, {"rating": 4.0, "review": "Awesome device and easy to navigate  I only wish it had a longer power cord or was wireless", "verified": true, "helpfulness": "0/0", "author": "Joshua Feldman"}, {"rating": 4.0, "review": "I love the FireTv stick! Exactly what I wanted and expected. The only reason I gave it a 4 starts was because the shipping was strange and it took over 3 weeks for them to take the money out of my account, which really threw me off.", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "It arrived a week earlier than expected, is easy to install, and does more than I expected. I look forward to Mirror working with my iPad in future.", "verified": true, "helpfulness": "0/0", "author": "Laura Hardy Norman"}, {"rating": 5.0, "review": "Love it!  Prime, Espn 3, Netflix. Enough said", "verified": true, "helpfulness": "0/0", "author": "Harry Swartwood"}, {"rating": 4.0, "review": "Great device. Loaded XMBC and now I can take it anywhere.", "verified": false, "helpfulness": "0/0", "author": "Bon N."}]