[{"rating": 5.0, "review": "Works great, easy to set up on my NON-Smart  TV.  Voice activated remote works like a champ.", "verified": true, "helpfulness": "0/0", "author": "patty"}, {"rating": 2.0, "review": "I have ordered the more powerful Fire TV .  Fire Stick has problems (buffering?)", "verified": true, "helpfulness": "0/0", "author": "RPick"}, {"rating": 5.0, "review": "It's wonderful!  Love that I can see movies that I haven't seen in a while when I want.  Also love that I can get Pandora!", "verified": true, "helpfulness": "0/0", "author": "Anabru"}, {"rating": 1.0, "review": "Got the stick for 50% off its regular price. Power cord is not long enough. Works terrible with our wifi. Streamed shows constantly buffer. Have a Roku on a second TV & never have any problems with it. Sorry, love Amazon, cannot stand the stick.", "verified": true, "helpfulness": "0/0", "author": "Jnikischer"}, {"rating": 1.0, "review": "Good idea, but too many frustrating bugs that need to be worked out.  I read other reviews before purchasing, and figured maybe those complaining about \"freezing\" and not working properly might be in a situation with low connectivity issues, but...  Well, they were right.  The design has too many flaws to be considered worthy of purchase.", "verified": true, "helpfulness": "0/0", "author": "Marty Straub"}, {"rating": 5.0, "review": "Shipping was EXTREMELY fast, love the product so far!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Great product, not as snappy as my AppleTV", "verified": true, "helpfulness": "0/0", "author": "LB"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joyce"}, {"rating": 5.0, "review": "This is our first Fire Stick, after using Roku for several years.  I found the Fire Stick to be a great value for the money.  Incredibly easy to set up (it does require an external power source, which is mildly inconvenient, but I don't think any of the other sticks on the market can go without one either) and very easy user interface.  We bought the stick because the interface and app performance on our Samsung smart TV were terrible.  After months of not being able to watch a full episode of anything on Hulu, we threw in the towel.  Particularly if you're already an Amazon Prime fan, this stick makes using every perk of the Prime membership incredibly easy.  It also integrates other apps (like Netflix and Hulu) seamlessly and they run as well as they do on a Roku or on their own websites.  For the price, ease of use and also the easy portability for travel, I'd buy another Fire Stick any day.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 4.0, "review": "I have to reboot it occasionally and if my internet is overloaded I have to shut off other devices or live with the \"buffering circle of hell\".", "verified": true, "helpfulness": "0/0", "author": "CS"}]