[{"rating": 4.0, "review": "Works well but once in a while you have to unplug and replug it from the power source because it doesn't connect to the network after a while.", "verified": true, "helpfulness": "0/1", "author": "Anson Ling"}, {"rating": 5.0, "review": "Our family of 4 LOVE this.  So easy to set up.  With yet another $110 a month cable bill (and our family watches a total of about ten stations), we decided we had had enough.  Bit the proverbial bullet and am on buying another two of these tonight for the bedroom and second living room.  NO commercials is wonderful, and we had been recording everything just to skip the commercials anyhow.  Main thing is we are not paying for cable anymore - I am happy to pay an early cancellation fee that will more than pay for itself in three months.  I for one am tired of paying to watch television, we bought a Netflix subscription and LOVE it!!!", "verified": true, "helpfulness": "1/2", "author": "ColoRN"}, {"rating": 3.0, "review": "Very sluggish when it comes to streaming internet movies. It is ok but I am not rel impressed with its performance", "verified": false, "helpfulness": "0/2", "author": "Frank Huddleston"}, {"rating": 5.0, "review": "Love it! !!!!", "verified": true, "helpfulness": "0/2", "author": "Jennifer"}, {"rating": 5.0, "review": "Fantastic item.  So many options and WAYYYYY easier to navigate with than Roku.  To me Amazon Fire TV Stick wins out.", "verified": true, "helpfulness": "1/2", "author": "Andrew Newcomb"}, {"rating": 5.0, "review": "Love using this very neat", "verified": true, "helpfulness": "0/2", "author": "AK WHIT"}, {"rating": 5.0, "review": "Ive been very pleased with this product so far!", "verified": true, "helpfulness": "0/2", "author": "Kim Koehler"}, {"rating": 2.0, "review": "to hard to navigate needs a key board", "verified": true, "helpfulness": "0/3", "author": "Tim"}, {"rating": 5.0, "review": "This thing ROCKS! We had two Apple TVs that always were breaking or losing wifi, or getting low-quality signal through our wireless AC adapter. The Fire Stick rocks. It boots faster, works better, never drops signal, is smaller, and is 100% reliable so far.", "verified": true, "helpfulness": "2/3", "author": "maddiedog"}, {"rating": 5.0, "review": "We really enjoy the ease of switching between our Fire stick and cable this switch allows. Went on very easily, as well.", "verified": true, "helpfulness": "0/1", "author": "llg"}]