[{"rating": 4.0, "review": "I was surprised that the \"stick\" works as well as it does so cudos to Amazon. I would also mention that a good, strong signal from your router is important. Otherwise you'll have a lot of buffering and you certainly don't want that! There are numerous methods of increasing your Wi-Fi signal to the location of you \"stick\" so if you're signal is weak to that area in your home, you may want to make arrangements for a stronger signal.", "verified": true, "helpfulness": "0/0", "author": "cm"}, {"rating": 5.0, "review": "Happy", "verified": true, "helpfulness": "0/0", "author": "Eduardo"}, {"rating": 3.0, "review": "Have to keep resetting the stick to get it to work, does not always let you fast forward", "verified": true, "helpfulness": "0/0", "author": "Leland O. Karras"}, {"rating": 4.0, "review": "For $20 via Prime pre-order, this is a nice device.  We operate both Apple and Amazon ecosystems, so can compare the two from time to time.  Compared to the $100 Apple TV3 (not really a fair comparison), this Stick, at $20, is a very good high value alternative.  The Stick's interface is not as polished, intuitive or efficient as the ATV, and it does not integrate as well into its Amazon ecosystem as an ATV can with airplay.  And when you consider the outboard dongle and USB power supply, it is no more convenient to physically set up than the puck sized ATV (which hangs on the back of the set).  It also runs much hotter than the ATV.Where the Stick really falls down is in Wi-fi reception quality, which is genuinely hit-or-miss.  We have a high end wireless router with uprated signal power, and were able to eventually focus the Stick to pull a consistent HD quality signal from 35-50 feet.  But the many reception complaints are well founded, even with the most current firmware as of this review date.  The little Stick just does not pull in wireless as well as most pads or phones can.But once locked into a good signal, the Stick seems to operate very quickly and smoothly for the most part.  Picture rendering quality is excellent.  The Fire app works well, even on an iPad, but the voice feature is choppy until it learns your voice.  That Amazon ships the device preconfigured to your account is also a nice plus.  We don't play games, but it comes well equipped with them and has a nice assortment of other apps.  The Netflix app is not anywhere near as polished as that on the ATV, unfortunately.So at $20, this is a really good buy, provided you have a strong and dependable wireless signal.  I absolutely do not recommend this device for marginal or uncertain signal conditions.  At the standard $40 price, the now long in the tooth ATV is still a better value in our opinion, as it does more and more importantly does it better (and it should for 5x the cost).  Had we not received the pre-order price, we would have more strongly considered the full size Fire TV model which might invite a better comparison.  Perhaps the cross-platform comparison is not fair, but having both, we can at least share an honest opinion.Obviously, these Fire streamers are only worth their prices with a Prime membership, and offer no local streaming ability for those with large server or NAS libraries (which the ATV does quite well via iTunes).", "verified": true, "helpfulness": "0/0", "author": "M. Malone"}, {"rating": 5.0, "review": "It's so easy. Perfect for my son's room.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 3.0, "review": "I've been playing with the fire stick for a couple of days. Yes it is smooth and offers lots of content, and the remote is handy.The set up is very easy as it comes configured for your Amazon account. Watching Amazon videos is fast and seemless. Music not so much. There are a few things that keep it from being great.1. There are many places where it is hard to navigate accurately with the remote or the phone/tablet app.2. It does not come installed with a browser or YouTube.3. Amazon Music is not well integrated. You have to add music to your library on your computer, can't do it directly on the TV stick. This would be ok, but it takes ~ 5 minutes to sync, so no adding music or creating play lists on the fly. Nor can you stream from your computer music app.directly to the TV stick (as you can with YouTube, well once you install it).4. The phone/tablet remote is ok, but does not display any information from the TV stick, so you can't, say, navigate a playlist from the kitchen where you can't see the TV directly.Fortunately you can sideload non Amazon apps using ADB: http://forum.xda-developers.com/showthread.php?t=2786505", "verified": true, "helpfulness": "0/0", "author": "Eric A. Cutter \"Eric\""}, {"rating": 5.0, "review": "Works great easy to install great picture recommend highly. Good value with Amazon prime", "verified": true, "helpfulness": "0/0", "author": "John Randall"}, {"rating": 5.0, "review": "I waited till I got to explore this device and customize it to my use.  I have what was the top end (at the time) Roku 2 xs for about three years.  Last year I purchased the Chromecast.  Both devices served me very well for what they were for.  I could run plex on roku but had to have a PC open and another server running to get much use from it.  The Chromecast was fine at flinging hulu, youtube, netflix and the like at the TV but lacked more  options. The Smarthub in the Samsung TV's was slow and feels a little dated.  The Fire TV Stick filled in a lot of gaps and now I am considering adding them to every TV in the house.I have sideloaded some extra apps to the device.  TVMC is my favorite launchpad and can actually replace my hulu subscription completely.  I installed the xfinity app from my tablet and now I have superior picture quality when compared to Dish Network.  It's a little difficult to navigate the xfinity app and requires my tablet to work as a mouse and the Fire remote to select anything.  A new game controller is waiting at a UPS depot here for delivery soon and that problem will be solved (I hope).Now I want to discuss some of what I found of complaints.  The popping and clicking sound some folks have been discussing.  This is caused by the speakers being plugged into the same outlet as the fire stick.  I can't be positive but I think Amazon has used some of the wiring inside the USB cord as antenna.  Don't quote this as fact but I feel strongly this is the case.  So any other device that is throwing off a strong RF might also cause the second complaint about poor connectivity.  I think both of these problems can be resolved by relocating the power supply.  I found this when I placed a USB powered speaker into a hub that the Fire Stick was plugged into.  While doing so did not effect my WiFi, it made terrible noise.  Since the speaker is battery operated I unplugged it and instantly the problem sound was gone.The difficulty with the remote.  I struggled to insert the battery until I happened up on this little trick.  Where the door slides closed.  If you can get your fingernail just barely in that small crack and press down slightly on the door while sliding it back it comes open with the greatest of ease.  This might be easier for us guys.You can add mouses and bluetooth keyboards to this little jewel by sideloading the settings.apk app and launching them from inside the application manager inside the native settings menu.  It really is easier than it sounds. The only thing I have not successfully sideloaded is apps that require play services - like google+ and the play store itself.  That is fine because with the FireADB I can easily send the apps I get through my phone to the Fire Stick in just a minute over the WiFi.I have attached a photo of mine sporting some holiday cheer.", "verified": true, "helpfulness": "46/48", "author": "Ben Walker"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Raymond H Thaxton"}, {"rating": 1.0, "review": "We tried, we all tried to no avail.  Kept dropping internet signal.  When it did keep signal we could not load anything.  I bought for husband so adult children could set up.  One son is an engineer and he said \" what a piece of junk\".Amazon- shame on you.  If it can't work for the average person with a new TV , cable and a few intelligent people (  Ph.D,  NP &)  RN)  how in the heck is it suppose to work for us at 55yrs?d", "verified": true, "helpfulness": "1/2", "author": "anurse"}]