[{"rating": 5.0, "review": "This brings all of my entertainment together in one, easy to use, stick at a great price!  I have Amazon prime so there are 1,000s of movies, shows, music and games available for free.  I also can access Netflix, hbo go, Hulu and much more.  Buy this, you won't regret it!", "verified": true, "helpfulness": "0/0", "author": "D.Winkler"}, {"rating": 5.0, "review": "Love this, have it in my kitechen, plan on taking it on vacation with me.  Works great and easy to set-up.", "verified": true, "helpfulness": "0/0", "author": "salanna"}, {"rating": 1.0, "review": "Couldn't make it work outside of the US and there was nothing that it won't work out of the US.Even the error message doesn't really say what's going on like whether it's restricted location or something else...Gave it to a friend who went back to the US.", "verified": true, "helpfulness": "0/0", "author": "Enkhbilguun Erdenetsogtiin"}, {"rating": 5.0, "review": "We love it!  The best part is that its so portable. We can use it at home or take it up to our cabin.  We don't have any TV signal at the cabin (no cable, antenna or dish) but we have internet and a TV for watching movies.  Until now, we've had to drive 10 miles into town every time we wanted to rent (or return) a movie.  Now we have a choice of hundreds of movies, as well as TV shows, without leaving the house.", "verified": true, "helpfulness": "0/0", "author": "Susan T"}, {"rating": 5.0, "review": "Excellent customer service and quick fix", "verified": true, "helpfulness": "0/0", "author": "J. Norsen \"bookho\""}, {"rating": 2.0, "review": "I was very happy with the Fire TV Stick for about two months, especially when I lost the remote and was still able to use the iPhone app to navigate.  However, suddenly, in between two shows, it stopped showing video.  It displayed a blue screen saying \"HDCP unauthorized.  Content disabled\".  Research shows this happens when there's an incompatibility between the TV and the device, or any other device hooked up. Customer service advised removing all other devices from the TV and unplugging both the TV and the stick for 30 seconds then only putting the stick back in.  Well, that DOES make it work.  However,  as a long-term solution, it is ridiculous.  I would be less annoyed if this problem had started immediately. But the fact that it worked quite well and then started having this issue is unsatisfactory.", "verified": true, "helpfulness": "0/0", "author": "Donna L. Thorne"}, {"rating": 5.0, "review": "Everything I expected.", "verified": true, "helpfulness": "0/0", "author": "J.T. Thomas"}, {"rating": 5.0, "review": "We love the fire stick. It is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Hooge"}, {"rating": 4.0, "review": "Works every time wherever it's used in the house. More stable than a DVD WIFI player.", "verified": true, "helpfulness": "0/0", "author": "Frank T. Oliveri"}, {"rating": 4.0, "review": "works great!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]