[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "elna"}, {"rating": 5.0, "review": "We absolutely LOVE love love our Fire Stick!!!!! So easy to use and operate, we got the cute little package which I should mention was not that crappy hard to open plastic that many things come in these days, rather this was a simple and clean presentation in a nice box- thank you for NOT putting this in plastic.We opened it right up and plugged it in and the rest is history! We started watching movies and playing games within 10 minutes (tops) of plugging it in; you do not have to enter all your Amazon info that was preprogrammed, it just took a few to enter our other logins for Pandora and Netflix but was easy to do and took no time.It's relatively bug free, we have speedy wifi so as long as it's up and running as usual the Fire Stick has no problem playing HD movies streaming over our connection and some times we have other things going at the same time (laptop etc).Way to go Amazon, this thing is killer and really the next cool thing!I loved our Kindle Fire but the stick takes it to a new level.Oh, it's great for traveling too, so portable and space saving that you could toss it in your purse/carry on and plug in at your hotel while vacationing, business etc.We have taken our cable down to bare bones because we use this so much we barely watch regular TV!", "verified": true, "helpfulness": "0/0", "author": "SKC"}, {"rating": 5.0, "review": "Bought this for my dad's birthday. Decided to open it to set it up for him. Updated and put some apps on it I knew he'd use like Netflix and Flixster. Setup is easy. Register with ur Amazon account and boom...any apps or music you have in the cloud are accessible on the fire tv.  Played around with it for a bit and decided to look online and see what else it could do. Found info about sideloading apps with an adb connection. Found later that a much much easier way is to download the Apps to Fire app from Google play store. Any app on your phone you can send to your fire tv with a simple tap. Now not all apps will be compatible. You'll just have to try em out and see. One cool trick is sending your settings apk (app) file to the fire tv. Launch it and you can turn on the Bluetooth setting and pair some Bluetooth headphones to it. Pretty neat. I also installed Kodi (XBMC) on it and I love it. You can find instructions on how to do that online easily. Needless to say I liked the fire tv stick so much I just kept it for myself and ordered another one for my dad. He likes it as well. Great buy and highly recommended", "verified": true, "helpfulness": "0/0", "author": "William E. Sells III"}, {"rating": 1.0, "review": "False advertising! They advertise like it's just the little stick and it's completely wireless but it's not. You have to keep it plugged in. Also, it skips constantly and freezes. I love Amazon but this product is NOT up to par. I upgraded my internet to the highest level thinking that would help and it did not. The device just doesn't work 100%. It's awful. Just splurge and buy the Apple TV. It's worth it. It's what I'm doing.", "verified": true, "helpfulness": "0/1", "author": "Lena Mary Amato"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jay  Swanson"}, {"rating": 5.0, "review": "Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "koa"}, {"rating": 2.0, "review": "Thought that this would be a great product from Amazon but turned out total disappointment. Keeps buffering allll the time when Apple TV have been working with the same TV, same room on the same wireless network for years.", "verified": true, "helpfulness": "0/1", "author": "vidya sinha"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Robyn Jackman"}, {"rating": 5.0, "review": "Absolutely Wonderful!!! Amazon's Originals, such as Bosch are spellbinding. I am absolutely thrilled with the innumerable possibilities of this product. Thank you Amazon, my Prime Membership of $99 is worth every single penny.", "verified": true, "helpfulness": "0/0", "author": "kag"}]