[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Kristen T."}, {"rating": 4.0, "review": "Cancel your tv subscription.", "verified": true, "helpfulness": "0/0", "author": "jesusunit"}, {"rating": 1.0, "review": "Did not work with my equipment.", "verified": true, "helpfulness": "0/0", "author": "M. Wiggins"}, {"rating": 3.0, "review": "Having trouble using it on my Vizio TVs.  Both Vizios turn off automatically when fire stick is connected, one will not connect to the internet.  Works well with my Samsung.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Gallegos"}, {"rating": 5.0, "review": "Amazing Device!", "verified": true, "helpfulness": "0/0", "author": "wissam agsous"}, {"rating": 5.0, "review": "I simply recommend it. Easy to figure it out. Love it.!", "verified": true, "helpfulness": "0/0", "author": "Francisca S."}, {"rating": 1.0, "review": "I ordered this because my in-laws purchased one and they highly recommended it. However, when I received mine, I have been having trouble all day trying to connect to my WiFi. I have multiple devices and consoles that require WiFi connection and everything connects but this Fire TV Stick. I have even restored the stick to factory settings, tried different HDMI slots and another TV just to make sure it wasn't just mine. I kept receiving error messages such as \"check your password\" \"the signal is too low\" \"contact amazon or your internet provider\" \"signal is not in range\". I know it is not my WiFi because, like I stated before, every other device I have connects with ease (xbox one, ps4, laptops, iPad, iPhones, Windows Surface, smart TVs, etc.) I returned my item and do not plan on purchasing another one.", "verified": true, "helpfulness": "0/0", "author": "Miss_Dre"}, {"rating": 5.0, "review": "great for cord cutters", "verified": true, "helpfulness": "0/0", "author": "Daisy Lynn Bolling"}, {"rating": 5.0, "review": "Love this fire stick, super easy to use, way easier to watch prime tv and netflix with this remote and stick than using them thru the Xbox 360.", "verified": true, "helpfulness": "0/0", "author": "Stampinprn"}, {"rating": 4.0, "review": "I keep getting a red static across the screen with a crackle sound about every 6-8 minutes.  Not a big deal but can get annoying.  Anyone else have this issue?", "verified": true, "helpfulness": "0/0", "author": "tdub88"}]