[{"rating": 2.0, "review": "It would be amazing, except the lag is horrible. Doesn't matter which app is used, there is lag multiple times during digital content playback.  I have many other electronics that play digital content and I have no problem with playback using any of them, the fire stick however is junk until they fix this.", "verified": true, "helpfulness": "1/1", "author": "carly"}, {"rating": 5.0, "review": "I use this almost everyday love it!", "verified": true, "helpfulness": "0/0", "author": "A. Matos"}, {"rating": 2.0, "review": "Have a lot of issues connecting with the wifi, sometimes unable to watch television/programs for days.", "verified": true, "helpfulness": "0/0", "author": "Keshla Langellier"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Zachary Winn"}, {"rating": 3.0, "review": "This is an excellent product for customers who use Amazon Prime. If you do not use Amazon Prime, a different product would be better for you. The response time is pristine and Amazon content is easily accessible. But don't expect your iOS devices to interact well with the numerous apps which boast the ability to mirror your devices using AirPlay.Gaming:There is talk that Gamefly may start streaming game rentals to its customers and that they will use Amazon Fire exclusively. Obviously, you'll want to purchase the additional gaming controller, but even then, the games may only work with the \"puck\" and many games may not be compatible with the Fire TV Stick.TV Apps:If you subscribe to a cable television service, you need to make sure that your provider has a license to provide you with access to apps such as ESPN, Disney, HBO, Showtime, etc. Make a phone call for verification, because their websites may not reflect availability for the Amazon Fire. My provider, Charter, does not allow access to any of these services on the Amazon Fire even though I can access ESPN and Disney on my Apple TV. I think that Cox and SuddenLink offer access to all of them.Apple Users:Check out MacRumors to find out when the new Apple TV device is expected to be released and wait to buy that instead.", "verified": true, "helpfulness": "0/0", "author": "Scott Shirley"}, {"rating": 5.0, "review": "Does not freeze and restart like my Roku did. Easy to set up. I use Netflix and Hulu as well as Prime. All work very well. Easy to search, too.", "verified": true, "helpfulness": "0/0", "author": "Katherine Wilson"}, {"rating": 4.0, "review": "There is a lot of variety with the Amazon Fire TV stick. It just doesn't seem to have the same quality connection as Amazon Fire TV.  I still think it is well worth the cost. You have access to so many movies and shows.", "verified": true, "helpfulness": "0/0", "author": "egnat"}, {"rating": 3.0, "review": "works ok streaming sometimes glitchy", "verified": true, "helpfulness": "0/0", "author": "Paul S. Leigh"}, {"rating": 4.0, "review": "We r happy & satisfied. Really easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Herrera"}, {"rating": 5.0, "review": "Great item for turning any TV into a smart one. Very fast and intuitive.", "verified": true, "helpfulness": "0/0", "author": "Ron  Vanderpool"}]