[{"rating": 3.0, "review": "Easy to use... but the wi-fi connection fails or is iffy (lagging, freezing, having to reconnect) WAY too often.  And it's not MY wi-fi because none of my other devices have any issues.  From the reviews I'm seeing this is a common issue.  Why has this not been addressed by the manufacturer?", "verified": true, "helpfulness": "0/0", "author": "Belladona \"wysperwyngs\""}, {"rating": 5.0, "review": "Love it especially especially if you have Amazon prime you get to see many series and enjoy apps", "verified": true, "helpfulness": "0/0", "author": "Cristian Saldana"}, {"rating": 5.0, "review": "I love the amazon fire stick.i had tried over and over again to purchase cables to connect my Kindle Fire6 to my tv with no luck.Nothing worked until I was told to try the fire stick and it worked, so easy to connect even I could do it.", "verified": true, "helpfulness": "0/0", "author": "Ms Peg"}, {"rating": 5.0, "review": "Great item at a good price.....easiest set up ever.  Turn your HDTV into a smart TV.  Buy it, you won't regret it", "verified": true, "helpfulness": "1/1", "author": "c3/c5"}, {"rating": 1.0, "review": "Worked fine, but now it has failed and will not connect to the tv.  Device has less than 10 hours of use.", "verified": true, "helpfulness": "0/1", "author": "molly rose"}, {"rating": 5.0, "review": "I literally use it everyday for Netflix and Hulu, fell in love with it when I ordered it definitely recommend!", "verified": true, "helpfulness": "1/1", "author": "Tayah"}, {"rating": 5.0, "review": "Love the Amazon fire stick, we wouldn't have it any other way.  The stick doesn't buffer quite as quickly as the fire TV does but that was expected due to memory and size.  We have both and this is on the secondary TV.  Love it, can't say enough about its capabilities, this and it's big brother are worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Lyle LaBonte"}, {"rating": 1.0, "review": "Pretty unsatisfied with the fire stick. I just got the product today and it wont even go 10 minutes without loosing connectivity to my wi-fi.", "verified": true, "helpfulness": "0/1", "author": "Trinity Schmidt"}, {"rating": 1.0, "review": "Yes, its easy to install and a little easier to search. But beyond that, no value add to my Sony Bravia TV.I wanted to listen to music-limited choices and doesn't even play whole song.I wanted to use screen mirroring to look at photos with friends but its not compatible with either my iPhone or my Surface Pro. So thought I would sign into Shutterfly-oops-not supported.So try signing into Google-oops, not supported.Really Amazon? who uses an Amazon Fire phone?", "verified": true, "helpfulness": "1/2", "author": "Quen Zorrah"}, {"rating": 4.0, "review": "Very entertaining well worth the money", "verified": true, "helpfulness": "0/0", "author": "Steve"}]