[{"rating": 5.0, "review": "If you enjoy Amazon Prime or are a Netflix subscriber, you need the Fire TV Stick! We use this on a daily basis. I am hooked on House of Cards, and my kids love all of the tv programs you can view from Netflix. This streams it right to your tv with just the touch of a button. It has made my subscription to Amazon Prime and Netflix so much better.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline M. Walby \"holy roller\""}, {"rating": 4.0, "review": "Old tv show to jumpy", "verified": true, "helpfulness": "0/1", "author": "Stephen Borawski"}, {"rating": 3.0, "review": "Works well, and the price is nice. Too bad you can't control volume on the TV set.", "verified": true, "helpfulness": "0/0", "author": "Chuck Maye"}, {"rating": 5.0, "review": "Love it and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Christina Collins"}, {"rating": 5.0, "review": "I have only used it a couple of days, but so far I am thrilled with it. Unlike the Chromecast it replaced, the Fire TV Stick has it's own user interface and is not dependent on a smart phone or PC to cast content. The fact that it is dual band is what sold me on the device. With a dual band router, only a couple of the dozen or so WiFi connected devices would work on the 5ghz channel. So the Fire TV Stick has 30mbps practically to itself and delivers beautiful HD quality content. Also, my Vizio TV remote works most of the features thanks to the HDMI CEC compatibility. I mistakenly hit a button on my TV remote and discovered that it worked the Fire TV Stick also.The search feature is a little cumbersome because of the limited controls on the Fire remote, but that is overshadowed by the other positives. Setup was a breeze, actually much easier than the Chromecast it replaced. The bigger memory and flash memory cache means that I don't get the streaming spooling delays that were frequent with the Chromecast. We still have one other Chromecast we are actively using and I will probably replace it with another Fire TV Stick.We are able to access all the same content we normally access on the Chromecast, plus Amazon Prime Video.", "verified": true, "helpfulness": "1/1", "author": "J Tyler"}, {"rating": 5.0, "review": "Its everything I expected it would be", "verified": true, "helpfulness": "0/1", "author": "Steven Raper"}, {"rating": 5.0, "review": "Love this gadget", "verified": true, "helpfulness": "0/1", "author": "Jeannine Carvalho"}, {"rating": 5.0, "review": "Was very easy to set up right out of the box.  Also much faster than Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Love AZ"}, {"rating": 4.0, "review": "Does what it says it does.", "verified": true, "helpfulness": "0/1", "author": "BK"}, {"rating": 2.0, "review": "The fire stick is great when it works. unfortunately mine seems to overheat and shut itself off every half hour or so. I then half to get up, unplug it from the back of the tv for a few seconds and then plug it back in. that doesn't seem like a big deal until about the fourth time it shuts itself off while your streaming a movie on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]