[{"rating": 5.0, "review": "This product worked exactly as it is described and as I needed it to. I bought it because I was not able to watch shows or movies on my Netflix account without a viewing source.(HD, but not a smart TV) I am very happy with the ability to also view other mediums such as HULU and Amazon Video services with this device. The price is reasonable and it attaches easily to my TV set. A winner in my book. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "PJ"}, {"rating": 5.0, "review": "I couldn't be happier with this purchase.  When I placed the order, it was backlogged for almost a month.  Fortunately, it came before the original estimated delivery date.  It was very easy to install and get on-line.  The price is more affordable than other streaming options.  I plan on purchasing a second one and then kissing satellite/cable TV good-bye forever!", "verified": true, "helpfulness": "0/0", "author": "Lizzianne"}, {"rating": 5.0, "review": "Everything I expected and a little bit more. Easy connectivity.Movable from room to room with ease. I suggest using the HDMI extension.", "verified": true, "helpfulness": "0/0", "author": "Jasper A. Miller"}, {"rating": 5.0, "review": "I am able to watch Netflix movies on my dumb television while exercising.  Love the Fire Stick.  Easy to install.  Met all my expectations.  Bought one for my husband too.", "verified": true, "helpfulness": "0/0", "author": "Millie \"Millie\""}, {"rating": 5.0, "review": "Fire Stick has so many components to it that it is hard to rate it at this time when I am just getting to know all the things that it can do. There is no doubt it is very clever and play ten of thousands of songs and many other thngs.  So far, so good.", "verified": true, "helpfulness": "1/1", "author": "Ernest Pasquale"}, {"rating": 3.0, "review": "It works fine, I use it almost every day, but I hate that you have to run a power cord to it. The advertising makes it look like you just plug it in, AND MY PLAN WAS TO MOVE IT BETWEEN TV'S. You cant easily do that.", "verified": true, "helpfulness": "0/0", "author": "Tommy C"}, {"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "john l porter"}, {"rating": 1.0, "review": "Not enough instructions included.  Having issues signing on to our Netflix account with this device.  Netflix works well on the computer and with the Playstation 3 which is hooked up to a smaller TV in another room, however kept getting kicked off of Netflix when using the Amazon Firestick on the big TV.  At this point in time I am reading to return the firestick.", "verified": true, "helpfulness": "0/0", "author": "Cynthia L. Mann"}, {"rating": 4.0, "review": "I love it!  So thrilled that I can get Amazon Prime on my TV!  Easy to set up. Wish the plug in cord was longer, but other than that, love it!", "verified": true, "helpfulness": "0/0", "author": "Debra L"}, {"rating": 4.0, "review": "Very easy to install... I love amazon products and this item is no different.  The picture is so clear and the options for use are amazing.  My only issue is not being able to search the Web for outside video sites.", "verified": true, "helpfulness": "0/0", "author": "Jessica M Belair"}]