[{"rating": 5.0, "review": "Only had the Fire Stick for a week but I'm thrilled with it. A lot to watch. Free of the cable to watch what I want when I want.", "verified": true, "helpfulness": "0/0", "author": "Frank Kolnos"}, {"rating": 4.0, "review": "Easy setup and simple to use. I like that you don't need a computer or smartphone to enable the device. Works great with the remote that is included.", "verified": true, "helpfulness": "0/0", "author": "Griffith Crammond"}, {"rating": 5.0, "review": "I give this product high marks because it meets all my requirements. So far it has operated as advertised. The test will be when I travel. I like how small a package it is and is very responsive.", "verified": true, "helpfulness": "0/0", "author": "BobCAD"}, {"rating": 5.0, "review": "Had Google Chrome for 1 year, loved it till i realized it was not convenient. Disliked the ideal of playing my most watched apps, Hulu and Netflix using my phone. Then no remote control to specific control my films. Amazon TV Stick just works best for me. Lots of Apps and games...with a remote control.", "verified": true, "helpfulness": "0/0", "author": "Daniel Iyageh"}, {"rating": 5.0, "review": "Better than expected, fast and great video quality.", "verified": true, "helpfulness": "0/0", "author": "Jeff & Laura"}, {"rating": 5.0, "review": "OMG! I absolutely love FireTV and fire TV stick. I love watching TV and movies on it. I love listening to music on it I can even get my local radio stations and all the music I bought from Amazon is already in my music section on my fire TV I love it. there's games there's yoga there everything is on here it's GREAT. bye bye cable company", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have the chromecast as well, and I have to say the added advantage of the remote is very nice. I use this mainly for slingtv (currently not chromecast compatible). I would highly recommend this to someone who is looking for a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Alake Kashyap"}, {"rating": 5.0, "review": "Setup was extremely intuitive and quick.  I successfully connected it to my surround sound video system and started streaming videos in less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 3.0, "review": "It's ok. I wish the remote was a little bigger. It serves it's purpose.", "verified": true, "helpfulness": "0/0", "author": "pixxxee"}, {"rating": 5.0, "review": "Very easy to set up and use. Love it!", "verified": true, "helpfulness": "0/0", "author": "Theresa"}]