[{"rating": 5.0, "review": "This little thing is great.  I use it to watch Netflix and Amazon prime movies instead of my PlayStation now.  I always hated having to wait for my PlayStation to start up.  The Fire TV stick is already on if my TV is on, I just switch HDMI inputs and I'm ready to watch movies.It would be nice if the built in search feature would search the Netflix movies instead of just Amazon and Hulu movies but maybe they'll eventually figure that out.", "verified": true, "helpfulness": "0/0", "author": "Chris Mitchell"}, {"rating": 5.0, "review": "Cooooool!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "hyunmin"}, {"rating": 5.0, "review": "Surprisingly responsive for such a little computer.", "verified": true, "helpfulness": "0/0", "author": "Lutz M."}, {"rating": 1.0, "review": "There is a power cord that attaches to the stick.  It is not shown in the advertisements.", "verified": true, "helpfulness": "1/1", "author": "Gk"}, {"rating": 5.0, "review": "I like it better than my Roku 3.  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Sterling Holden \"Sterling\""}, {"rating": 4.0, "review": "Makes viewing of Prime movies much easier on TV than connecting my Kindle Fire HD via a HDMI cable. It is easy to set up and use, especially with the remote control.", "verified": true, "helpfulness": "0/0", "author": "Michael Ooi"}, {"rating": 5.0, "review": "best $40 ever spent. This thing streams flawlessly! I was concerned about streaming via wifi over a stock uverse wap but it has no issues. Pictures quality is great!", "verified": true, "helpfulness": "0/0", "author": "Robert Bindel"}, {"rating": 5.0, "review": "Love it! Works great. Works great with amazon prime. I get to watch my tv shows when I want to", "verified": true, "helpfulness": "0/0", "author": "Courtney B."}, {"rating": 5.0, "review": "Awesome for most parts. I've noticed issues with streaming Hulu. A friend of mine has identical problems. I'd imagine a patch is in the works.", "verified": true, "helpfulness": "0/0", "author": "GREGLIKEWHOA \"Slapahoe Tribe\""}, {"rating": 5.0, "review": "I shoulda ditched cable years ago!  Still can get most of what I what I want with this baby and basic cable.  Saving thousands.I had no idea what wide offerings I could access - all these Amazon shows, of course, and as a prime member, a zillion films and series, but many series that I thought were only on cable.  Plus any music you've ever purchased through Amazon, and all kinds of games, some that you can get on your phone (though playing them with the Fire remote instead of a controller can suck).  You can also access your Netflix, Hulu, etc., accounts.  I have a huge backlog of programs on my \"wishlist\" already!", "verified": true, "helpfulness": "1/1", "author": "Tiaza \"Tiaza\""}]