[{"rating": 1.0, "review": "This device is as useful as a stone if you have apple smartphone.Why release a connectivity product with zero IOS connectivity.", "verified": true, "helpfulness": "3/4", "author": "nick"}, {"rating": 3.0, "review": "Preliminary review -First, my setup. We have a 55\" LCD TV in our living room to which this device is now attached. That TV also plays host to our Apple TV (3rd gen) box and a DVD player. We have a surround sound system as well (which the AppleTV is connected to), but that is irrelevant for this device (as the FireTV Stick will not connect to a home theater system, just to the TV's own audio). That's a little bit of a knock against it - we won't be buying or renting major soundscape movies on this device - but not enough for us to have spent the extra $80 (at the time I ordered it) to get the full Fire TV box. Our planned use is really just for Amazon content; we are happy with our local iTunes content and Hulu Plus coming through the AppleTV (although the latter might shift over if we decide it is worth it).I didn't have any of the problems setting this up many reviewers have had. Our TV is downstairs and through a wall from the WiFi access point (an old Apple Airport Extreme), and other devices get about 3 of 4 \"bars\" rating connecting to it from this location. I thought this might be a problem especially given the complaints from others who have been unable to connect to their strong wireless access points. However, there was no problem connecting, and the throughput seems fast.After unpacking the device, I plugged it into the HDMI port two up from the one the AppleTV is plugged into (so there would be room for the USB power cord sticking out the bottom side of the stick). It was not able to even start up off the (admittedly nearly insignificant) power from that port, so I next connected the USB cord to the USB port on our TV (a TCL 55\" LED/LCD from this year; unknown power supply so likely just standard 500mA). The FireTV started up, and complained that it needs to be plugged into the wall, but clicking \"continue\" everything seemed to operate just fine. Some information on just when the wall plug's extra power will be needed (ex, while streaming 1080p HDTV? while playing some games?) would be hugely beneficial. But, once I verified that I could at least start HD content playing with the device just powered by the TV's USB port, I unplugged it from there (which of course shut the FireTV down) and routed the way-too-short USB to an extension cord which is then plugged into the wall. I don't like this configuration from a purely electricians' standpoint; extension cords are never meant to be used as a permanent fixture! But, until I can get a longer USB cord to replace this one, it will just have to do.Another area some folks had trouble with is the Bluetooth remote. As you may have read, the remote is not a \"normal\" IR remote, nor is it a \"normal\" RF remote. Instead, it uses Bluetooth to connect to the stick. Some have claimed that with the stick behind their TVs the remote's signal was unreliable. In my case, the remote worked flawlessly. Perhaps it has to do with the thickness of the TV or the lack of \"smart\" circuitry inside the TV (the latter I doubt, though; there is a lot more to the LCD panel than the SOC and flash memory involved in a \"smart\" TV). In any case, absolutely no problems at all operating the remote from clear across the room.As I'm a Prime member, my Prime account was already set up; we just confirmed that we wanted to use that account and continued on. The only tedious parts of the setup were:1. Entering my WiFi password. There are never \"good\" onscreen keyboards, but this one seems unduly horrific. Maybe I've been spoiled by the phone-based keyboard we use with our AppleTV. But, this was frustrating.2. Listening to the unskippable idiot's-guide-to-watching-TV that comes up the first time. I just turned the sound down and only half listened to it. I found it completely useless. Really, this should be skippable! You can always play it again later on if you feel the need to!These were annoying, but are one-time setup hurdles.Another thing that is annoying is that many months after it was promised to be \"coming soon\" there is STILL no iOS remote app for the FireTV. Given that the remote is not easily replaceable (you can always order another one from Amazon, but it's not a run-to-Walgreens-and-pick-up-a-$5-replacement type of remote. If you lose this remote, you can not use the TV until Amazon has shipped a not-cheap replacement out to you. Given the track record of our family with losing or breaking remotes, the critical nature of the remote has me not wanting to use it much until we can just put the packaged remote in a safe place and use the phones we all have.Looking through our Prime content, I expected to see content summaries attached to each episode somehow, like they are on the AppleTV and even on the Amazon website. However, if they are available, I can't find them. This is a major usability issue as with a large family we often have to use the capsule summaries to determine which episode each of us individually is on (the \"unwatched\" indicators are next to useless unless you happen to be the furthest ahead in the series).But, compared to the AppleTV we are used to, this is an incredibly fast box. I've heard that it is slightly less responsive than the full FireTV box, but even so it is a very pleasantly zippy interface.Playing content the quality seemed to be exactly what I'd expect from Amazon streaming. With the web interfaces, the quality has increased dramatically over the past year, although it is still a far cry from the quality we get from the larger-download files on our AppleTV. I'd gladly trade thirty seconds of buffering at the start of a show to get crystal-clear content in that show all the way through! The quality on this device seems to be on par with the computer playback, and definitely better than the Amazon Instant Video app playing on a phone/iPad and AirPlay'ed to the TV. Also, I haven't seen any of the \"muddiness\" artifacts some others have complained about. I have only been using it for a little bit, so I'll update again when I can say more definitively.Overall, my initial impression is very positive. It looks like it will be a good companion to our more fully-featured primary set-top box (the AppleTV), with a chance of usurping it for some (but not all) functions.Minor Update - After having it for about a week we've hit our first glitch. For some reason the Fire TV Stick was connected to our home network but decided that it could no longer contact Amazon over the Internet. This completely hobbled the device. Tried checking the network connection, verified the internet was accessible from all other devices in the house, then finally unplugged from power and plugged back in (\"rebooted\") the Fire TV Stick. Once it came back up again, it was able to talk with Amazon without issue. This was about three days ago, and hasn't happened since. [SEE UPDATE]On video quality - the video quality here is very good, much much better than streaming from the Amazon Video app on an iPhone through Airplay. It is still not on par with the streaming quality we get streaming shows on the AppleTV directly (noticeable in the dark areas of scenes - the Amazon Fire picture devolves to macro blocking far lighter than the AppleTV does, although neither of them compares to Bluray or even DVD local content). But, if you get any reasonable portion of your video via Amazon's Instant Video service, this is a huge improvement over iPhone->Airplay->AppleTV.UPDATE (2014-02-09) - the \"network connection\" issue appears to be about a weekly occurrence now. There are a LOT of users with this problem. For us it is relatively minor, but for others it seems to completely bork the device. The only solution which appears to really make it go away is to use a long (6-10 foot) HDMI extender and put the Amazon Fire Stick down in the entertainment center cabinet instead of hanging behind the TV. That is, pretend it is the full-size FireTV box, except a little slower and a little cheaper. Kind of defeats the whole \"stick\" form factor, but I guess that's the best Amazon can do. Hopefully they can figure out how Roku and Chromecast work just find right behind the TV (and for that matter I can put my AppleTV there and it works fine too, but I won't count that because the ATV has a larger form factor to work in) and will fix this before the next rev. Taking off a star for an ongoing minor annoyance.", "verified": true, "helpfulness": "0/0", "author": "Thomas Dibble"}, {"rating": 3.0, "review": "Movies started quick but picture jumps around the edges.Beside that it's pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Carlton Jones"}, {"rating": 5.0, "review": "Excellent interface and pretty speedy too!", "verified": true, "helpfulness": "0/0", "author": "dswalden@comcast.net"}, {"rating": 3.0, "review": "Easy set up but picture quality was only ok", "verified": true, "helpfulness": "0/0", "author": "cmonticalvo"}, {"rating": 5.0, "review": "Awesome, it work great on all apps and fast, the new unlimited photo storage for Prime member from Amazon is a big plus, you can share all photos on the big screen with your family easily now.", "verified": true, "helpfulness": "0/0", "author": "JTCANADA 2123 \"Jack\""}, {"rating": 1.0, "review": "Terrible, just a weak chromecast. Doesnt meet my needs.. SLLLOOOOOOOOWWWWWW", "verified": true, "helpfulness": "1/1", "author": "shiptip"}, {"rating": 4.0, "review": "Nice product at a nice price", "verified": true, "helpfulness": "0/0", "author": "craig pyros"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Tuc"}, {"rating": 5.0, "review": "Love it! Got it at $19 what a steal!!! It's worth it at $39--I bought a Samsung Dongle and Chromecast and both keep freezing--This is way better and more reliable. 5 STARS!!!", "verified": true, "helpfulness": "0/0", "author": "Nicolas V. Tchikovani"}]