[{"rating": 2.0, "review": "While there are many things it does well (plex, neflix, amazon instant video) it's really frustrating that some apps are still getting listed as incompatible with the stick. Yes you can side load but it's not a good user experience.Why does Tune In radio (standard) show up as compatible while pros does not?Why are plex app updates delayed to what is available from plex themselves or the google play store.Why can I only purchase or send an app to a device from a desktop browser (ipad/iphone won't work). That said the app is likely also flagged as incompatible.I do like the device I worry that the some of it's limitations will limit the product's life. A great deal for the 19 bucks I paid but at 39 or 79-99 for the fire tv I would probably say hold off for something with better support/a more friendly \"garden\".", "verified": true, "helpfulness": "0/0", "author": "Goodies"}, {"rating": 5.0, "review": "Seems to work well for me and I am techie so setup was no issue", "verified": true, "helpfulness": "0/0", "author": "Timothy Kekeis"}, {"rating": 5.0, "review": "Easy set up. Works great.", "verified": true, "helpfulness": "0/0", "author": "IRENE DEMICCOSMITH"}, {"rating": 3.0, "review": "The only problem I have is that Comcast/xfinity does not support HBOGo.", "verified": true, "helpfulness": "0/0", "author": "katfrecol"}, {"rating": 5.0, "review": "We love the Fire stick. It is way better than the google chromecast", "verified": true, "helpfulness": "0/0", "author": "Robert Rampton"}, {"rating": 4.0, "review": "I got 2 of these Amazonian fire sticks because, let's face it, it's winter and it's cold. But they don't start a fire no matter how much I rub them together. So I'm sending them back.", "verified": false, "helpfulness": "1/2", "author": "SILHOUETTE"}, {"rating": 4.0, "review": "Very easy to setup, basically plug and play. Added bonus was the video as soon as its connected that walks you through everything , easy to navigate , loads of channels to choose from! I have a roku box in my livingroom and my son has the roku stick but I chose the fire stick for my tv and I love it .", "verified": true, "helpfulness": "1/1", "author": "Mary C. Magistro"}, {"rating": 5.0, "review": "Love my Fire TV stick.  Works great...so far.  Only issue is that it was made in China!!  So disheartening and sad that they put profit in front of having it made in the USA.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I  GOT MY AMAZON FIRE STICK YESTERDAY, VERY EASY SET UP LESS THAN 5 MINUTES. GREAT PRODUCT. I AM A GAMER SO I WISH IT HAD MORE OF THE GAMES ON THE FIRE STICK THAT ARE IN THE AMAZON APP STORE, LIKE ANGRY BIRDS ETC. OH WELL MAYBE WHEN IT UPDATES IT ADD SOME BETTER  GAMES", "verified": true, "helpfulness": "0/0", "author": "JOYCE M."}, {"rating": 3.0, "review": "I like it but it could have more apps.", "verified": true, "helpfulness": "0/0", "author": "Virginia Andreozzi"}]