[{"rating": 3.0, "review": "The Fire Stick will only come on when I unplug and replug it. Had I realized this was a design issue, I probably would  not have purchased it. It is a PAIN to use right now. My Sony Smart DVD is way more reliable than this Fire TV Stick. Instead of investing in another Stick, I will just get another Smart DVD player.....", "verified": true, "helpfulness": "1/1", "author": "Connie Williams"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Secret Ink"}, {"rating": 5.0, "review": "Everything it said it was. Very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Linda Quinlan"}, {"rating": 3.0, "review": "The good - low low cost. Gets you netflix, AIV. Hulu, youtube, slingtv. The bad - not as many content choices as roku. And store is limited compared to apple or google ecosystem.Updating review - note that I purchased this device for travel. I also have a fire tv that I have been playing with as well so this review applies equally unless stated.For both, the content available is just not as wide as for roku, apple, google. With that said, the most important content is available for streaming. Voice search not as good as google's. Cast support is partial (no mirroring). I have not been able to get hdhomerun to work with the big firetv (or the stick). And I have not been able to find any tablo support. Both device also feel sluggish in the UI compared to roku/apple (getting my new shield today so will be testing that next). And have seen some video frame drops on both devices when watching 1080p netflix.Between the firetv stick and firetv, I would definitely recommend the stick. Neither device can really play games very well which relagates them both to streamers. And when looking at streaming, the stick pretty much does everything the normal fire tv does.Firetv does not have a wide enough/flexible enough content ecosystem to make it into a cord-cutting solution for me but it is a solid streamer (roku is closer to working as a cord-cutting solution and I'll be installing/testing nvidia shield shortly). And the cost is extremely low.And if you do purchase this for travel, a word of warning. Most hotel TVs block off access to hdmi ports :(", "verified": true, "helpfulness": "0/0", "author": "RichC"}, {"rating": 1.0, "review": "This gadgedt is practically unusable for me - it keeps pausing all the time.It keeps telling me my network connection is bad. Then how come my Tivo and my iPad are streaming the same Amazon content just fine?", "verified": true, "helpfulness": "0/0", "author": "Andrei"}, {"rating": 4.0, "review": "$39 is cheap , this is worth your money , you can play games, download apps, watch shows, and install XBMC on it, what else would you need?", "verified": false, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 1.0, "review": "This product is a nightmare. It constantly freezes. All. The. Time. I never have this problem with my Apple, only this. Ive done every troubleshooting option and it still is horrible. Worse is the remote! Jeeeezzzz the remote is a NIGHTMARE. It is nearly impossible getting the back off. Im not exaggerating. So not worth it. Significantly cheaper than the Apple but man do you get what you pay for. And thats nothing. Wish I bought a second Apple, dont know what you have good till you get something horrible like this.", "verified": true, "helpfulness": "1/2", "author": "HappyAuntie"}, {"rating": 5.0, "review": "Great Investment!  I would never leave home and watch movies ALL day if I did not have to work :-/The Amazon fire stick is the new hot thing since slice bread :-) !!!", "verified": true, "helpfulness": "0/0", "author": "Caesar Boone"}, {"rating": 5.0, "review": "Love it ! So glad I bought this !!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Castillo"}, {"rating": 5.0, "review": "I use it on the tv in my kids' room.  It has everything I want and even includes games.  The kids know ho to use it too even for being pretty young.  It is pretty fast for such a small device.", "verified": true, "helpfulness": "0/0", "author": "Beata Fik"}]