[{"rating": 4.0, "review": "The Fire TV Stick is advertised as supporting miracast device mirroring, which lets you display photos and video from a phone or tablet to your TV. Unfortunately, it doesn't work with my Blackberry Q10 phone. This problem is discussed at length on Blackberry user forums, and everyone who has tried to make it work reports that both Amazon and RIM point the finger and say it's the other company's fault. Compare this with playing content from my iPhone to my Apple TV. It just works. There's something to be said for proprietary standards (though, really, not much).I don't really know or care whose fault it is; I just want it to work. And nobody is doing anything about it (at least nothing visible, yet). Fortunately, the Fire TV Stick does enough other things well that the miracast problem is a minor inconvenience, not a show stopper.", "verified": true, "helpfulness": "1/1", "author": "xgrep \"xgrep\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing since homemade fried chicken!!!", "verified": true, "helpfulness": "0/0", "author": "brelen kanaly"}, {"rating": 5.0, "review": "I read a number of reviews that mentioned this device having a weak wifi connection. I did not share the same experience. My wireless connection is located two floors below the room in which I installed the stick and I have a great connection. This device was the perfect solution to stream movies on my bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "Scott A. Thimons"}, {"rating": 4.0, "review": "It was good at first but then you started tripping", "verified": true, "helpfulness": "0/0", "author": "daniel lebron"}, {"rating": 2.0, "review": "Since there is not native browser, you cannot authenticate internet access at places like hotel rooms where you normally use a browser to log into the internet.  That was the whole reason I bought this device, to have our Amazon TV service and video library available anywhere we go.Even if you sideload a Firefox browser, the keyboard interface that works for searching movies is not available to use for Firefox.  So you may be about to open the browser, but not log in to the hotel's splash page.", "verified": true, "helpfulness": "2/2", "author": "Josh Howell"}, {"rating": 3.0, "review": "I am glad to know I am not the only one with problems. The positives are that it is very easy to setup and has everything I expected in terms of apps. It's laid out well. Mich better than the Rokus we have on other TVs. The problems are all network related. I bypassed my main TVs built in streaming services because they were painfully slow to load. The Stick has all the same services but it CONSTANTLY disconnects from the internet. It is right next to my wifi. Less than a foot away and still I can't get through a single show without having to reset it. I gave up and went back to the TVs interface. I hope they can fix it. I was one of the prepaid customers and I really looked forward to it but I'm very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "OMG! This stick is amazing. Bye bye cable!", "verified": true, "helpfulness": "1/1", "author": "Debra Paige"}, {"rating": 4.0, "review": "Fire stick works great, my only issue with it is the length of the HDMI cable extender. If it were about 2 inches longer, would make it even easier to install on my wall-mounted TV. As it is now, it's a bit pinched, and it was difficult to get it plugged in in a tight spot, but hopefully it will be okay long term.The OS, menus, remote are all easy to use, very intuitive interface. Good streaming experience so far, except for Netflix. Seem to get more screen pixelation/distortion on the Fire version of Netflix than when I go through my DVD player, but that could be issues with the Netflix app that are beyond Amazon's control. We'll see if it improves over time as the apps evolve and are updated.Good product overall, good entertainment value.", "verified": true, "helpfulness": "1/1", "author": "Matthew M Scotten \"matt@zunar.com\""}, {"rating": 3.0, "review": "Other than having to be in super close range of the WiFi,  this gadget is awesome.", "verified": true, "helpfulness": "0/0", "author": "Dana Smith"}]