[{"rating": 5.0, "review": "For the price (got it for 19 dollars) it's perfect. I have an apple tv, and the fire stick may be slower, but it does the job well. No complaints here.", "verified": true, "helpfulness": "0/0", "author": "Tony Pham"}, {"rating": 2.0, "review": "Technology is great.  Movies are too expensive.  Why spend $10 on a movie when a full month of NETFLIX is less?", "verified": true, "helpfulness": "2/4", "author": "Bill Coffrin"}, {"rating": 4.0, "review": "It will be 5 stars when HBOgo is available.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I absolutely love the Amazon Fire TV Stick.1) Not only does it connect to my video streaming apps, I can play video games through it. The first games I played were Sonic the Hedgehog and The Game of Life. I purchased the Bluetooth game controller to play Sonic and it works like a charm.2) Setup was easy. I connected it to my WiFi and it was already linked to my account. All of my music and video purchases were there and I could play them instantly. No downloading.3) I can listen to any music, or play any video I have purchased or uploaded to my Amazon Account.4) Unlike the ChromeCast, I don't need to use a separate device to cast to this device. Everything plays directly from the stick and I can use the included remote, or use my phone as the remote control.5) Lastly, it plays games and apps from the Amazon App Store. There aren't a lot available currently, but I'm sure more will be made available.", "verified": true, "helpfulness": "0/0", "author": "Big Brew"}, {"rating": 5.0, "review": "I was able to get this at half price on pre-order. I am very happy with the purchase. There is no lag when scrolling through menus. Paul streamed media so far streams nicely with no buffering. It can be directly plugged into a HDMI port or comes with a 3 inch HDMI extension cord which I had to use to plug into the back of my Onkyo receiver.  My receiver takes all video inputs and then sends to the TV. This hookup worked for me and allows switching between cable box, fire TV stick, and DVD player. There is a separate USB cord that they say is optional to supply additional power.  I plugged that into the side of my TV.  Don't know if you have to use it or not, but thought it would be a good idea.  This stick essentially turns your TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "StangCBR"}, {"rating": 5.0, "review": "Love it.  A great addition to my television viewing experience and capabilities.", "verified": true, "helpfulness": "0/0", "author": "cloudminder \"cloudminder\""}, {"rating": 1.0, "review": "A few Issues.Wanted to change the account it was registered to.  Followed the instructions, said the account did not exist.  You always think it is you so reentered everything a few times than gave up.  Turned it on later to try again and it was registered to the correct account.Like other reviewers, have connection issues.  Sometimes it does, sometimes is doesn't, sometimes it connects with \"problems\" but doesn't tell you what they are - signal strength is always very good, sometimes it is connected than says no WiFi available even though it was connected and my other devices work fine.  It hasn't stayed connected long enough to actually use it.Have 6 more days to return it.  Not looking good for keeping it.", "verified": true, "helpfulness": "0/0", "author": "B. H."}, {"rating": 5.0, "review": "Slick little device, with great video quality. Picks up our wireless network easily and works well. The device moves through its menus quickly and starts playing titles fairly quickly on both Netflix and Hulu. Haven't tried \"flinging\" video from our Fire HD, but hopeful it will work.", "verified": true, "helpfulness": "0/0", "author": "Rhody Shopper"}, {"rating": 5.0, "review": "Great item. Quick set up and access. I use it presently, exclusively with Prime and I imagine if it works the same way with Hulu etc. It would be about as good as it gets right now.", "verified": true, "helpfulness": "0/0", "author": "Kenny B"}, {"rating": 3.0, "review": "so far I have not used it because the cord is not nearly long enough to plug into the tv and then the wall socket. I hope the 6ft I bought will accomplish that task. I have a tv that is mounted on the wall and the plug is on the left side. Please take this into consideration and possibly make linger cords.", "verified": true, "helpfulness": "0/0", "author": "Mind Ninja"}]