[{"rating": 5.0, "review": "I love the fire stick. Worth every penny paid. It lets me access my prime content as well as other streaming services (netflix) and has apps and games to boot. But my favorite feature of this device is its portability. I can throw it in my luggage and take it with me on my travels. As long as I have internet access I can keep binge-watching my favorite shows from the hotel. Plus, it is much faster to boot up than the netflix app on my tivo and also a little easier to navigate.", "verified": true, "helpfulness": "0/1", "author": "T Rob"}, {"rating": 5.0, "review": "I bought this for my husband along with the Sling TV deal. He loves it!! Now he can watch some off his favorite cable shows without having to pay for the dreaded cable!! Our internet is not the greatest but this forms a good connection. It was super easy to set up and learn to navigate!!", "verified": true, "helpfulness": "0/1", "author": "Anita967"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "laarni"}, {"rating": 5.0, "review": "Great product. Easy to install and use. Instantly makes my TV smart", "verified": true, "helpfulness": "0/1", "author": "John L Keisling"}, {"rating": 2.0, "review": "Can't watch anything. Keeps saying lost internet connection. Then says connected with problems.", "verified": true, "helpfulness": "0/1", "author": "Tracy L Sowell"}, {"rating": 5.0, "review": "I love this thing!  I am about to ditch my cable box so I can save some money.", "verified": true, "helpfulness": "0/1", "author": "brannycakes"}, {"rating": 2.0, "review": "Not sure, it connects to the network fine, then drops with a message of no network connection, all this while saying there is a very strong signal...jury's out......", "verified": true, "helpfulness": "0/1", "author": "taidog"}, {"rating": 4.0, "review": "Like it", "verified": true, "helpfulness": "0/1", "author": "Jessi3298"}, {"rating": 5.0, "review": "Great product, easy to install and use.", "verified": true, "helpfulness": "0/1", "author": "Kenneth Rein"}, {"rating": 5.0, "review": "I love the Amazon fire TV stick it's so easy to use & portable. Thanks.", "verified": true, "helpfulness": "0/1", "author": "Tamara"}]