[{"rating": 5.0, "review": "I have been using Chromecast and just bought this to better enjoy my Amazon Prime movies. So far, I love it! It was so easy to set up and there are so many great features. I like that I can use my photos for a screensaver. The streaming for the Prime music is cool too, it even shows the lyrics on the screen for some of the songs. The remote is easy to use and things are easy to find. The only slight problem I had was that the cord is not long enough to reach my outlet. So, I just plugged it into the USB on my TV and it seems to be working just fine.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 4.0, "review": "Hooked up to the TV easily... however had a problem recognizing my internet password a few times (I was putting it in right... the characters show on the screen). I've only used it a few times, and have only streamed some Prime and Netflix content so far, so cannot comment on the other capabilities. Remote is snappy, streaming so far so good (a little faster than my directv genie box) so it downloads quick. Packaging was put together well. All and all, very well worth it to make your TV a smart TV... especially if your a prime member.The only thing that takes away a star is what others have mentioned... Amazon Prime members content not being put into its own category. This is done obviously to encourage the purchase of content... but it would be nice. 5 stars all day if Amazon ever makes that change.", "verified": true, "helpfulness": "0/0", "author": "MikeyH"}, {"rating": 5.0, "review": "Tons of entertainment value for your dollar especially if you have Amazon Prime and Netflix accounts.  Turns your TV into an internet TV and it was really easy to setup and use.  I would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Willard Reed"}, {"rating": 5.0, "review": "This thing is great! I received this as a gift and I'm SO thankful because it's awesome!So far I've watched Netflix, rented movies, listened to Pandora and played around a bunch on the thing. Everything has worked great! I don't have a Smart TV, so for internet streaming this far exceeds my expectations and is WAY better than how we were streaming (through a Nintendo Wii). The interface is user-friendly and straight forward and the whole thing is really easy to use.I would add, as a father to little ones, the Fire TV Stick is tied to your Amazon account and renting a movie is as easy as 'click & play' and boom there goes $4. So after my 2 year old daughter rented a movie we've since decided to hide the remote throughout the day :)", "verified": true, "helpfulness": "0/0", "author": "Anthony Crombie"}, {"rating": 4.0, "review": "had to help a bit on finding the remote by holding the home button down for a few seconds, find entering search criteria easier than I expected, responsiveness good in scrolling around the icons, result is pleasing to watch.", "verified": true, "helpfulness": "0/0", "author": "Bryan Leipper"}, {"rating": 5.0, "review": "Got the Fire Stick for $19.99, I love the price. We did have a bit of a problem plugging it into the HDMI port on the TV, but after that the fun began. The tutorial is great, the features are wonderful, it downloaded the photos I had on my HDX8.9 and the music I had stored as well, without request....wonderful. I used all the features, everything works fine. I do have to use three remotes (sounds crazy, but it's OK), one to turn the TV on, then the Sony remote to get to the correct setting, then the Fire Stick is good to go. Of course you do have to reverse the process, no big deal. Now I can have watch movies on my TV, watch shows I may have missed and listen to my music w/o ear buds. Thanks Amazon!!!  CC", "verified": true, "helpfulness": "0/0", "author": "C.C."}, {"rating": 5.0, "review": "Had the chromecast and the experience was inconsistent. Chromecast did not interact well with th iPhone so I was looking to change. Had the fire stick for about a week and I am very happy with it. Consistent streaming. Fast response to commands and the remote works way better than using your phone", "verified": true, "helpfulness": "0/0", "author": "Charles Janson"}, {"rating": 5.0, "review": "pretty cool. we got this basically for Netflix. has a ton of options if you have existing services (showtime, PBS etc..)Netflix ap is a little weak but all in all it's pretty cool", "verified": true, "helpfulness": "0/0", "author": "kyle coleman"}, {"rating": 1.0, "review": "It was broken and freezes on the start screen.  The amazon logo shows and nothing happens.  I have the regular fire tv on another tv in my house and it works fine...this stick is a joke though.", "verified": true, "helpfulness": "1/1", "author": "hanoman"}, {"rating": 5.0, "review": "Ease of use was a great plus because I got this for my grandmother for an early christmas present she can use it no problem.", "verified": true, "helpfulness": "0/0", "author": "ThePokelifter"}]