[{"rating": 5.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "jeffery barrett"}, {"rating": 3.0, "review": "Cheap. Easy to set up.  Hard to navigate the menus due to their non-intuitive structure.  Device stutters and stalls much of the time. (I have an older Roku which performs flawlessly using the same connection and tv.  The Roku never stalls.)  This device might be ok for a second tv that is used only occasionally to stream content.  Don't count on it to perform satisfactorily for your main internet streaming.", "verified": true, "helpfulness": "1/1", "author": "Mikal \"Mikal\""}, {"rating": 5.0, "review": "Overall, I am very pleased with content and performance.  One thing to watch:  NETFLIX seems to run smoother through the SMART TV then through FIRE STICK Sling NETFLIX application.", "verified": true, "helpfulness": "0/0", "author": "PrinceOfCups"}, {"rating": 1.0, "review": "Have to pay for TV shows that have already played such as , Boardwalk Empire, True Detective, etc.....to many shows with price tags....Others I know who  don't have Amazon to get Netflix pay nothing for the same shows....I feel ripped off!!!!  Amazon is a rip off!!!!  I am highly dissatisfied....", "verified": true, "helpfulness": "0/0", "author": "Phyllis Smith"}, {"rating": 1.0, "review": "Not very useful. Really only good to view amazon prime or Netflix.  Will only mirror with fire phone or fire HDX.  If you have a smart TV this is a waste.  Was hoping to use to send videos from the web (youtube and other) to the TV from my iphone or kindle tablet.  The only app available is just a remote that needs major improvements.  This does nothig that my xbox won't.", "verified": true, "helpfulness": "0/0", "author": "nice"}, {"rating": 5.0, "review": "I love it, lots of movies to watch, everyone should get one", "verified": true, "helpfulness": "0/0", "author": "kay bizelli"}, {"rating": 5.0, "review": "Works perfectly :)", "verified": true, "helpfulness": "0/0", "author": "charlee"}, {"rating": 5.0, "review": "Absolutely love the ease of use, the cool price, and it made my still awesome, yet outdated sharp tv, magically turn into a smart HD tv with all the latest perks with apps and an awesome remote to boot! Love it!!", "verified": true, "helpfulness": "0/0", "author": "lisa K Rutledge"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "nicoli klimuk"}]