[{"rating": 5.0, "review": "excellent product!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Stanek"}, {"rating": 4.0, "review": "The Pros:The device itself works great.-Amazing interface-Fantastic picture quality-By far the best way to watch SlingTV and Amazon Instant Video.-Haven't encountered any glitch issues-Hard to beat in this price range (especially with the SlingTV deal, hard to complain when it's free)The Cons:-The remote is junk, it doesn't even work from 2 feet away. I can't believe they are even shipping these remotes with the device. They need to fix this issue, because a remote that won't work from even a foot away is worthless. On the positive side, my TV remote works fine with the Fire Stick and there is also an app for your phone that works pretty good as well.-With the HDMI extension, the device sticks out from the side of my TV and looks a little disorganized.", "verified": true, "helpfulness": "0/0", "author": "Analogue Junkie"}, {"rating": 5.0, "review": "Works wonderfully so far. Very easy to get started and set everything up, userflow is superb. Only critique is that I didn't see anywhere that says it needs to be plugged in while using, so there was a bit of a scramble to find an empty outlet near the TV. Other than that though, truly enjoying the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "LadyKube"}, {"rating": 1.0, "review": "If your cable company is COMCAST/INFINITY, it does not support the Amazon Fire Stick- can't watch Showtime/HBO GO even if you pay for the subscription......buying a ROKU stick", "verified": true, "helpfulness": "1/1", "author": "Frank Rod"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Cory L. Grayson"}, {"rating": 5.0, "review": "Wonderful device. Easy to setup picture quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "doug engelke"}, {"rating": 5.0, "review": "Everything I thought it would be...love it", "verified": true, "helpfulness": "0/0", "author": "DonnaB"}, {"rating": 5.0, "review": "Not sure how I got along without the Firestick previously!", "verified": true, "helpfulness": "0/0", "author": "Bill Kirkpatrick"}, {"rating": 1.0, "review": "We could not get it to connect with our wifi without being kicked off. We checked the wifi signal strength and determined that was not the problem. Spent an hour on the phone with customer service to have them tell us they couldn't figure it out and would get back to us in a couple of days. Not good enough for us as a solution so we returned the fire tv sticks and bought Roku instead. It has been working fine.", "verified": true, "helpfulness": "1/2", "author": "Theresa M. Minor"}, {"rating": 2.0, "review": "I have 60 mbps internet speed, and this stick take long time to load TV shows with Sling TV. I owned an Apple TV, and this in no compare. I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Fort Worth Man"}]