[{"rating": 4.0, "review": "It's good, even has an iOS app, but I didn't realize half of my devices have Amazon video compatibly built-in so I've decided to return it.", "verified": true, "helpfulness": "0/0", "author": "ItsDaTwix"}, {"rating": 5.0, "review": "Wonderful device..love it's mobility...only downside is having to have it constantly plugged into an outlet for it to function....whatever location it's moved to there must an outlet....other than that ..Great!!", "verified": true, "helpfulness": "0/0", "author": "dane matthews"}, {"rating": 5.0, "review": "Absolutely LOVE my Fire Stick. Its everything all in one and if Im looking for a show it will search Netflix, Hulu, Amazon, etc. Not just one outlet.", "verified": true, "helpfulness": "0/0", "author": "Jess"}, {"rating": 4.0, "review": "works as advertised", "verified": true, "helpfulness": "0/0", "author": "Prof OMS"}, {"rating": 5.0, "review": "I've got a Chromecast too, and since I got my Fire Stick I haven't even used the Chromecast. It's nice and easy to use, and videos load much faster than on Chromecast. I might even upgrade to the box if I ever get a better TV. I'd highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Awesome little device!  Took hardly any time to install on my HD-ready TV and I can now watch Amazon Prime or Netflix any time I want. Not sure I understand the whole \"credits\" thing for installing apps like Netflix and Hulu, but haven't had to deal with that yet (have had this a month). I want to mention that I found a great little perk by accident:  when you go a certain amount of time with no activity (pausing something or just on home screen), a \"screensaver\" program starts up of absolutely gorgeous scenic pictures. BEAUTIFUL! I know that's not why I bought this but I totally love it - sometimes I just want to see the pictures rather than watch TV!  Thank you Amazon - what a lovely side benefit!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"A user, not an expert\""}, {"rating": 4.0, "review": "Works great for the price!!Wireless HD can stutter occasionally, but that's the natureof any wireless. My phone gets 35 Down/5 up standing next tothis so it may be the stick. But I paid $24. I didn't expect it tobe perfect.", "verified": true, "helpfulness": "0/0", "author": "Bo Martin"}, {"rating": 5.0, "review": "Already had NetFlix and Time Warner Cable but after buying the Fire TV Stick we cancelled TWC saved ourselves over $100 and thoroughly enjoy this device!", "verified": true, "helpfulness": "0/0", "author": "Yvonne"}, {"rating": 5.0, "review": "We love this Fire TV Stick, I have to say we as a family are liking this much better than the chrome cast. Amazon hit it out of the park with this product! It is a must buy!", "verified": true, "helpfulness": "0/0", "author": "Sean McC"}, {"rating": 5.0, "review": "This think is so cool!  My TV just got 'smart'!  I downloaded the i-phone app for it, which works great.It is one of those rare items that fits in the category of 'how did I live without this'? (another thing that fits nicely in that category is Amazon Prime)Thanks!", "verified": true, "helpfulness": "0/0", "author": "FM \"FM\""}]