[{"rating": 1.0, "review": "It does not work correctly. Sometimes it will not recognize and will not even come on and other times it will not stay connected. Also the Netflix app will not load and if there are very few shows you can watch that are free from Amazon. The remote is an awesome idea just too bad the fire stick is junk. We have the google chrome as well and had no issues with it. I will not purchase this again and thinking about canceling Amazon prime due to the lack of quality with this device.", "verified": true, "helpfulness": "1/1", "author": "James A Knight"}, {"rating": 5.0, "review": "For the money, this is useful  for any Amazon Prime member who wants to watch video on a TV instead of a computer.  While not shown in the picture, the Fire TV Stick requires a small 5-volt power supply (included) as well as an open HDMI connector on the TV.Living in rural OR, we have rather dismal DSL service.  At first, I found that Fire TV Stick would not deliver continuous viewing without stopping frequently for buffering.  After I changed the setting on it from 1080 to 720 scan, it began working fine.  However, other providers, such as Hulu, don't work nearly as well for us as does Amazon content.  It usually stops twice during the opening to buffer, then runs for the rest of the program without interruption.I spent my first weekend with the Fire TV Stick binge-watching all the seasons of \"Downton Abbey,\" which are all available on Amazon Prime.  Yes, as my spouse claims, it's just a soap opera with fancy accents, but I still love it!While I haven't tried it, my guess is that it would operate fine in 1080 mode with faster internet service -- which you probably already have.Recommended.", "verified": true, "helpfulness": "0/0", "author": "Andrew Ellis \"radioalbany\""}, {"rating": 1.0, "review": "Terrible.  Don't get it.  Failed after a month and I spent 2 hrs trying to get it fixed over the phone.  Now they sent me a new one.  Yayyyyyyy.", "verified": true, "helpfulness": "0/0", "author": "Izzi Moonshine \"book fiend\""}, {"rating": 2.0, "review": "The reason I am giving this 2 stars is at first this was great. Ran off of wifi was able to watch amazon prime and Netflix in my room. But then it gets very choppy and lags all the time now. i don't know if it is a memory issue or what. It is kinda disappointing especially since  I have the fire box and have no issues with it.", "verified": true, "helpfulness": "0/0", "author": "david racioppa"}, {"rating": 1.0, "review": "Totally worthless piece of electronics. No bandwidth, terrible picture, constantly buffering., no apps other than Amazon and Netflix, but Netflix will not load.Thought it was a problem with my wireless. But now have moved and have entirely new wireless network and it still will not stream anything without constantly buffering. Even directly next to my wireless router.Only app that works even halfway decent is Amazon Prime Video. Nothing else will load.Replacing this with a Roku device.", "verified": true, "helpfulness": "0/0", "author": "nbaker75"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "\"lucrecker\""}, {"rating": 2.0, "review": "the ad makes it easy to use, however i found it somewhat difficult. it seems to be an ad for amazon prime because for a lot of the options  you have to sign up for prime. also, i tried to set up history and hbo and i needed to have a tv provider, that is why i got the fire stick because i cut the cord. my girlfriend wanted the fire stick so we got it and will use it when we can but it is not going to be the go to item i thought it was going to be. i wold not recommend.", "verified": true, "helpfulness": "0/0", "author": "john weate"}, {"rating": 5.0, "review": "everything you need in a small package", "verified": true, "helpfulness": "0/0", "author": "Roy Steven Owens"}, {"rating": 5.0, "review": "The Fire TV Stick is just what I need.  I can finally get rid of cable.  I love the Fire TV Stick I can watch what I want to watch anytime of the day.", "verified": true, "helpfulness": "0/0", "author": "Wanda"}, {"rating": 4.0, "review": "yes, its great but there is not many free movies to watch. i dont have 100.00 to buy prime so i just watch what ever they have to offer to watch.they should have plans that customer can choose from then i will have more movies to watch.", "verified": true, "helpfulness": "0/0", "author": "steven sanders"}]