[{"rating": 5.0, "review": "Awesome product! My daughter uses it to watch Netflix!", "verified": true, "helpfulness": "0/0", "author": "LAWRENCE CALVIN MCDOWELL"}, {"rating": 5.0, "review": "Great buy. Had trouble getting the battery cover off. Mayday to the rescue, issue solved.", "verified": true, "helpfulness": "0/0", "author": "Wanda P."}, {"rating": 5.0, "review": "I love this gadget! I am a bit tech challenged but even I was able to install and use it within minutes. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Hilary \"Hilary\""}, {"rating": 5.0, "review": "I absolutely love my firestick!! I have the capability to view the apps downstairs but didn't have a way to view in my bedroom w/out using my tablet. There were times I wanted to stay upstairs esp during the cold weather bc it's warmer upstairs. The \"stick\" allows me to do just that. I can download so many apps w room to spare. Sooo worth the $39 and then some!!", "verified": true, "helpfulness": "0/0", "author": "Queen Ro"}, {"rating": 5.0, "review": "Awesome enjoying it very much!", "verified": true, "helpfulness": "0/0", "author": "Teresa Hodge"}, {"rating": 5.0, "review": "Screen mirroring faulty. Otherwise beyond my expectations.", "verified": true, "helpfulness": "0/0", "author": "Carl Woermann"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Frederick B. Triplett"}, {"rating": 3.0, "review": "The product is easy to use and convenient. However many of the movies on here are the same as on Netflix and to watch some of the other movies is almost unreasonable. I have found little use for it as of now other than to access Netflix from different TVs in my house since it is small and easy to move.", "verified": true, "helpfulness": "0/0", "author": "Jordan Whiddon"}, {"rating": 5.0, "review": "This is so passing my expectations.  Super easy to install, the choices that are already pre installed are great.I can play Pandora though my stereo system and such a plus.It also had a preinstalled app for photos through Amazon.  This was so easy to get going and within moments I uploaded 144 pictures.This will go down as best buy for 2015!", "verified": true, "helpfulness": "0/0", "author": "Teri Brown"}, {"rating": 4.0, "review": "Easy to set up and we use it every night!", "verified": true, "helpfulness": "0/0", "author": "fredrick j callander"}]