[{"rating": 4.0, "review": "This is our second Fire TV Stick, our first one came with the box that gives you a remote with voice activation.  This one is a fraction of the price as the voice activated one so for our second TV, we thought we'd save some money and get the cheaper one.  The set up is easy, it works the same, same quality etc., but I do miss the voice activation.  Unfortunately, if you install a second device on another tv in your home, you have to reinstall all the apps, relog into all of them (ie. Hulu, Netflix etc.).  It does recognize movies you've already watched or have on your watch list from your other device which is great.  You have to have the \"one click setting\" enabled on your Amazon account if you want to watch anything that is paid for on demand.  We've noticed the free programming content has increased considerably on Amazon Prime since we bought our first one about a year ago which made us want to get this second one for our other TV.  Its a great little device, very reliable, easy to use, the Amazon interface is very intuitive (cant say the same for the other Apps in it that you can download).  It looks like Hulu just changed its interface and programming so that was a huge bummer.  I really wanted to buy the Chrome TV because I don't really like Amazon as a company but I succumbed to buying this one because of the \"unknown\" in terms of what programming content we would get with the Chrome version or how we would set up a payment method, whether there would be the same amount of free programming etc.", "verified": true, "helpfulness": "1/1", "author": "BOOK REVIEW"}, {"rating": 5.0, "review": "Awesome product love it", "verified": true, "helpfulness": "0/0", "author": "Vannessa S."}, {"rating": 1.0, "review": "i spent 4 hours trying to get Sling to work.  It was horrid.  The Sling representatives put me on hold way too long and then made a mess of everything I told them like my email address and my NAME.  They denied giving me 14 days free, as was advertised on the food channel and insisted I needed to pay  about $20.  After I took a picture of the Property Brothers ad for the 14 days free, I called them back and told them I didn't want to pay anything and would have to settle for the 7 day the said was all they were allowing.  Talk about BAIT AND SWITCH.  Next they said they would NOT charge my card.  The very next day the $20 showed up in my online banking and I didn't get ANYTHING to watch.  A message kept popping up said i had to update to the latest version.  Odd that it needed updated withn 24 hours of the agreement.  Another hour on the phone updating a brand new program.  What I really don't like is the time it takes to change a channel.  That little orange circle is way overused.  No, I am not happy,", "verified": true, "helpfulness": "3/5", "author": "Ann Major"}, {"rating": 5.0, "review": "I'm so impressed with Amazon's efforts. We use this more than our Apple TV. Nice!", "verified": true, "helpfulness": "0/0", "author": "D. McNally \"Dave\""}, {"rating": 5.0, "review": "Simple to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Thang P."}, {"rating": 5.0, "review": "Works great & it's easy to install.  The movies & tv shows that prime offers are wonderful.", "verified": true, "helpfulness": "0/0", "author": "William Flynn"}, {"rating": 1.0, "review": "Yeah, this thing is a total waste of money. Could have just hooked an HDMI into my laptop or any of the hundred other other options available. It works... for five minutes at a time. Then it buffers and tells you there was an error and makes you restart whatever you were watching. I know it's not just Netflix because the other streaming companies do it too. I know it's not an internet issue because my laptop works great. This is just a junk piece of hardware and isn't worth $5 much less the money they are asking for it. I am not impressed and feel like I was taken.", "verified": true, "helpfulness": "1/2", "author": "Brett Robertson"}, {"rating": 5.0, "review": "We absolutely love it!  So great when a product actually does what it promises - and for a reasonable price.  Good job!", "verified": true, "helpfulness": "0/0", "author": "Anne Jennison"}, {"rating": 5.0, "review": "Amazing I love it!", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 5.0, "review": "GREAT should have done it sooner. A VALUE.", "verified": true, "helpfulness": "0/0", "author": "John B. Munson"}]