[{"rating": 5.0, "review": "It does what it was intended to do and I'm happy to have the additional options available", "verified": true, "helpfulness": "0/0", "author": "Ellise poulsen"}, {"rating": 4.0, "review": "I like FireStick, but it only gets 4 stars because I had originally bought ChromeCast and Amazon won't allow some of its product to be delivered on Chromecast.  I feel the two products are very similar and ChromeCast is less expensive.  What I found out is that Amazon blocks free Prime Video from playing with ChromeCast.  That angers me that big companies like Amazon manipulate the market like this.", "verified": true, "helpfulness": "0/0", "author": "P. Maki"}, {"rating": 5.0, "review": "I love the Amazon Fire Stick.  I have Google Chromecast and Apple TV but the Fire Stick is by far the superior device in terms of ease of set up, use, and the most content.", "verified": true, "helpfulness": "0/0", "author": "Blaski"}, {"rating": 5.0, "review": "Great product and great service!  I love it", "verified": true, "helpfulness": "0/0", "author": "FARI IMREH"}, {"rating": 5.0, "review": "Outstanding product! Easy to use, just plug in and enjoy!", "verified": true, "helpfulness": "0/0", "author": "steve steelman"}, {"rating": 5.0, "review": "Seems better than chromecast", "verified": true, "helpfulness": "0/0", "author": "Roger Charmak"}, {"rating": 5.0, "review": "I Love it", "verified": true, "helpfulness": "0/0", "author": "mu meng"}, {"rating": 4.0, "review": "I really like my new Firestick and am finding lots of things to watch.  My only negative is my own fault...I did not realize that many things need to be paid for.  I did not do my research thoroughly enough.  I have, however, found lots of free viewing and have even purchased some things that I really wanted.", "verified": true, "helpfulness": "0/0", "author": "Phyllis A. DiMiero"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kristine"}, {"rating": 5.0, "review": "Love my Fire TV", "verified": true, "helpfulness": "0/0", "author": "Starkvegas \"J.R. Baker\""}]