[{"rating": 4.0, "review": "I cant't use in dominican republic", "verified": true, "helpfulness": "0/1", "author": "Miguel Morales Guzman"}, {"rating": 3.0, "review": "Unable to maintain reliable wifi connection to be able to stream. Used the HDMI extender as suggested in the manual but still not strong enough signal. Will update the review/rating if I get it resolved. Other wifi devices work fine in the same location", "verified": true, "helpfulness": "0/0", "author": "John Larson"}, {"rating": 4.0, "review": "What a bargain this little late-comer is AND I can now watch all the Amazon Prime!", "verified": true, "helpfulness": "0/1", "author": "D L Martin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Frank rocha"}, {"rating": 5.0, "review": "Amazon did a great job on this,quick easy set up and streams movies really fast with a great picture! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Duane Lockard"}, {"rating": 2.0, "review": "ok so I can watch my amazon prime on this fire tv stick but otherwise I really like my apple tv. I leant my fire stick to my niece. She came to the same conclusion.", "verified": true, "helpfulness": "0/1", "author": "Jonathan Young"}, {"rating": 5.0, "review": "Easy to use and love the vast selection choices available!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am impressed with the amount of entertainment functions on this Fire TV Stick....have some problems in downloading some old episodes and also at times the sound is off with the movements.....I'm getting a different carrier for my internet with faster speeds and hope that will take care of some problems...also much to learn, but well worth investing in this TV Stick...I understand there is already an up-grade and I'm wondering what that will do that my present stick wont do?", "verified": true, "helpfulness": "0/0", "author": "Darrel B Whiting"}, {"rating": 4.0, "review": "Controls much too sensitive.  My TV automatically switches if anything gets near remote.  Otherwise love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jane\""}, {"rating": 5.0, "review": "Great deal. Very good with Amazon Prime. Have enjoyed using it since Christmas. Already got my money's worth out of it. :-)", "verified": true, "helpfulness": "0/0", "author": "Patty Tressler"}]