[{"rating": 4.0, "review": "Im very happy with the fire stick", "verified": true, "helpfulness": "0/0", "author": "Jean Pierre Pujol"}, {"rating": 5.0, "review": "It is the best", "verified": true, "helpfulness": "0/0", "author": "Thomas W Vallin"}, {"rating": 5.0, "review": "We are still learning the ins & outs of the Fire TV stick and Amazon Prime but it's a fun 'learning curve'!", "verified": true, "helpfulness": "0/0", "author": "NH booklady \"booklady\""}, {"rating": 4.0, "review": "Easy to install. Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "mommabird"}, {"rating": 4.0, "review": "Satisfied. Works as expected. Nice price. Love that it has a remote. Was originally going to get the chromecast, but it doesn't come with one. Never heard of the fire stick until I went into Best Buy.", "verified": true, "helpfulness": "0/0", "author": "Pamela Mattern"}, {"rating": 5.0, "review": "OMG! I love this thing! I had a Smart TV until it died about a week after the warranty ran out, so as you can imagine, I was pretty annoyed. I loved the functionality of a Smart TV, and in my opinion, this little device makes virtually any TV with a free HDMI port as good as a Smart TV! It is SO much faster than streaming TV with my Blue Ray player too! Works great! Exactly as advertised! I highly recommend. I'm definitely getting one of these for every TV in the house. The only downside is that my 3 year old uses my Kindle to change the \"channel\" all the time! I let him play games on the Kindle, and he uses the User-friendly picture icons to select different videos and the Kindle can sync with the Fire Stick and change what is playing! It's kind of neat and kind of annoying all at the same time. But for future reference, this thing is so easy even a 3 year old can use it! Actually, my 2 year old daughter uses it too! Also, I plugged it in using the USB port on the TV even though it is not supposed to be powerful enough to do so. It gave me a warning the first time I turned it on, but has functioned just fine since :)", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "Very easy to use, works great!!", "verified": true, "helpfulness": "0/0", "author": "pamelazelenka"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jesse Carroll"}, {"rating": 5.0, "review": "Fire stick is the solution that finally works for mirroring onto TV. GREAT PRODUCT!", "verified": true, "helpfulness": "0/0", "author": "terry phalen"}, {"rating": 5.0, "review": "Awesome for the family!", "verified": true, "helpfulness": "0/0", "author": "janco809"}]