[{"rating": 5.0, "review": "Super product, especially if you have Prime - which is really a no-brainer, especially if you've been sucked into their world.  Seriously, Amazon for many people is really a very good go to place.  I especially find the reviews useful (with cautions, of course), plus the prices are generally very good, the shipping is the best, and returns are dead simple.  (I wish I could say they're paying me to say this, but it's really all true).", "verified": true, "helpfulness": "0/0", "author": "evitisop weiver rekcats \"someone blessed\""}, {"rating": 5.0, "review": "I really like this Fire TV Stick - I don't use it very often, but it was easily set up and very user friendly.  A few of my new favorite shows are not available on Amazon, but overall I have enjoyed this product.", "verified": true, "helpfulness": "0/0", "author": "Cathy Haynes"}, {"rating": 5.0, "review": "love it!!!", "verified": true, "helpfulness": "0/0", "author": "shirley vanscoyk"}, {"rating": 2.0, "review": "Bought this mainly because it was the newest of these kind of devices on the market and looked forward to mirroring my other devices.  Well cant mirror!  Also lots of lag and loading issues even though I have no issues with my other devices.", "verified": true, "helpfulness": "0/0", "author": "Steve Goethe"}, {"rating": 5.0, "review": "I love the Fire TV Stick. The only problem I had getting it to work, was my own fault. I forgot to enter the mac address into my router. When that was done it worked fine. Also... It would ONLY work using the Amazon wall wart. I tried 3 other power units with no success. I am an electronics tech and this made no sense to me, unless Amazon made it that way on purpose. Go figure.", "verified": true, "helpfulness": "0/0", "author": "R.Rossiter"}, {"rating": 4.0, "review": "Worked great, now not at all. Only had them a couple of months. Same story with both of them :(update: amazon fixed the problem. The kids really love them. Thank you", "verified": true, "helpfulness": "1/1", "author": "Richard"}, {"rating": 4.0, "review": "Having a remote is nice, but the buttons are a little too sensitive. Quality and performance is great and all the major media apps seem to be there. Ples, Hulu, Netflix, prime video all work great. Amazon content is front and center which is a pro and a con. As a Prime member it's way easier to get to Prime video than on my blu-ray player. But it's also got all the other Amazon content front and center, and I am not into that ecosystem outside of Prime. I have not tried any non media related apps.", "verified": true, "helpfulness": "0/0", "author": "Ron Diaz"}, {"rating": 5.0, "review": "fire is great excellent device", "verified": true, "helpfulness": "0/0", "author": "brianna carson"}, {"rating": 3.0, "review": "Needs additional feature. I could not use in hotel because I could not agree to the Hotel Internets terms. This could be easily solved by the stick checking for this and allowing the user to review and agree to the terms in the silk browser during set up.", "verified": true, "helpfulness": "0/0", "author": "R. LOFTON"}, {"rating": 5.0, "review": "Amazing product. I use it mostly for Netflix and it works flawless. Wifi signal is pretty good!", "verified": true, "helpfulness": "0/0", "author": "Salvador"}]