[{"rating": 3.0, "review": "I love the fire stick BUT my TV screen will just blackout when watching it ALOT. It has potential to be awesome, but this is very annoying, and has become more annoying in time. That is why I'm writing a review! Anyone else have this problem that could offer me any tips or resolutions?", "verified": true, "helpfulness": "1/1", "author": "shanda hoffman"}, {"rating": 4.0, "review": "Came very fast .Have to download apps to use.Has mostly Prime movies ..have to join to get.Like the  photo and music capability..Has some nice screensavers", "verified": true, "helpfulness": "0/0", "author": "Arthur Renna"}, {"rating": 3.0, "review": "I would love this except for one thing. It seems it needs an excellent wireless connection to work properly. My wireless service is mediocre (I have a great router, just crappy comcast) It does not have a lot of buffering, so it stops and pauses a lot. I mean, a lot-a lot. Unless you have a fast and steady wireless service, I recommend getting a more powerful box with memory room for buffering.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick was so easy to install  We love it!  So easy to use with Amazon Prime as well!", "verified": true, "helpfulness": "0/0", "author": "Stephen Ward"}, {"rating": 5.0, "review": "I was very satisfied with my Fire TV Stick. It was very easy to hook up now enjoying Netflix..", "verified": true, "helpfulness": "0/0", "author": "Jean Spearman"}, {"rating": 5.0, "review": "Fire TV Stick allows us the control to get rid of cable and satellite TV.  We like it so much, we have 3 of them.  One is on our main TV, one in our bedroom, and one in the RV.  Life is good.", "verified": true, "helpfulness": "1/1", "author": "Ed Lead \"Jrue\""}, {"rating": 5.0, "review": "This is amazing!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "The firestick was very easy to set-up, and I am very happy with the performance. Sometimes it does cut out, or run slowly, but I think that is more an issue with my internet than it is the Firestick itself. Also, as some other reviews have mentioned, it is very hard to open the remote for installing the batteries. But, not impossible.  Overall, I am very pleased!", "verified": true, "helpfulness": "0/0", "author": "Katie M"}, {"rating": 5.0, "review": "love this, very easy to hook and use", "verified": true, "helpfulness": "0/0", "author": "Roberta Corwin"}, {"rating": 5.0, "review": "Love it I could not connect dvd via wireless to Netflix with fire stick I can do it", "verified": true, "helpfulness": "0/0", "author": "M. Bazan"}]