[{"rating": 4.0, "review": "The only thing I dont like is that you have to turn the TV completely off to get it to work.  Besides that it is great!", "verified": true, "helpfulness": "0/0", "author": "Marcy Wilson"}, {"rating": 4.0, "review": "Doesn't work on my DLP Television but works great on the LCD. I bought this for use on the DLP so that was a disappointment. Overall pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 1.0, "review": "I want to love it, wanted to throw it in the backpack for work or road trips and pop it into the TV at the hotel. Problem is that it won't open the webpage that most hotels use to add your credentials. Standard access point no problem but web based login is a no go for now.", "verified": true, "helpfulness": "1/2", "author": "KRH"}, {"rating": 5.0, "review": "As long as amazon don't stop the side loading this will continue to be the BEST on the market.it's an amazing product in every way. I own 3 of them and I'm constantly referring the amazon fire tv and stick to other people.", "verified": true, "helpfulness": "0/0", "author": "jason sharp"}, {"rating": 5.0, "review": "This is one of the best purchases I have ever made. We have a summer vacation house that we use less frequently off season, so we cut down to basic cable. This device provides numerous entertainment options that more than makes up for only having basic cable.", "verified": true, "helpfulness": "0/0", "author": "Steven T Brusstar"}, {"rating": 5.0, "review": "Love this item!!  It allows us to watch lots more than just Netflix!!", "verified": true, "helpfulness": "0/0", "author": "jamataylor"}, {"rating": 5.0, "review": "Excellent! I'm enjoying it's interface and look forward to picking up a few extra ones.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "I have a Roku Stick. I have a number of smart Blu-ray players. And, I have used a SmartTV. This beats them all.I bought this because the Sony smart Blu-ray player in my bedroom was having trouble keeping a connection to the internet over WiFi at times (due to distance from the router), and because the GUI was kinda lame and slow to respond. I had previously bought my son a Roku Stick (it is powered by USB only currently), and it was very slow to respond to the remote control and to load Apps (though it works well when the apps finally load). I decided to follow Amazon's recommendations with the Fire Stick and plug this directly into an AC receptacle/outlet. This definitely makes performance very snappy. The GUI on this is much better than the blu-ray player, and I prefer it over the Roku Stick's GUI as well (though the Fire Stick is certainly Amazon-centric). The FIre Stick is very quick to respond to the remote control, which is a pleasure to use. I have had absolutely no problem staying connected to WiFi, and this thing loads apps and movies so much faster than my BluRay player I would be surprised if I ever use the BuRay player for anything other than BluRay disks again.Another great feature is that the Fire Stick is connected to Amazon Prime Music, and will also display cloud-stored personal photos as a screen saver if you desire.If there is any con to the Fire Stick, it is that it is Amazon-centric. Netflix and other apps work outstandingly well, but they are not the focus. The Twich app is great, except that I do not believe the Fire Stick is capable of using chat.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "E."}]