[{"rating": 4.0, "review": "It was easy to install and it's easy to navigate through. I'm not real crazy about the movie selections though. I'm not into all the TV series, I just want to watch good movies. It would be nice if there were classic movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "jph"}, {"rating": 5.0, "review": "I love it. It makes my prime instant video super.", "verified": true, "helpfulness": "0/0", "author": "laura coleman"}, {"rating": 3.0, "review": "I'm not sure yet. I thought there would be more selection. I have not found hulu plus yet. So far I don't think it's worth $99 a year.", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Washington"}, {"rating": 5.0, "review": "Love my fire stick!!  I don't have a cable box in my bedroom but who needs one if you have a fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So much better than the Google Chrome stick, roku, apple tv, any other smart tv like add on device I have used, this is the first time since ever I haven't been running my PC from my tv so I can use it for Media, this stick plays any file type I have tried on it. it has an app to any major music, game, movie or tv show site or app availability (youtube for example) I have bought several since my first purchase and appreciated it so much after my first one I buy them in stores now to get them faster, gave most of them as gifts to people who say they \"LOVE IT\"", "verified": true, "helpfulness": "0/0", "author": "David Joseph Baumann"}, {"rating": 5.0, "review": "Good device, does what it's supposed to do, loads fast and simple to work. Remote is good and the app with voice control makes searching for movies easier", "verified": true, "helpfulness": "0/0", "author": "Joseph A Cardenas"}, {"rating": 1.0, "review": "I had the stick replaced once as defective then the next one failed too. Both became extremely hot to the touch and number 2 began to smoke. Work needs to be done on this item before a fire occurs. I returned the second and Amazon refunded the entire amount after being unable to resolve the issue.", "verified": true, "helpfulness": "2/2", "author": "DC-Jim"}, {"rating": 4.0, "review": "Great picture quality. Has recently added more channels including AMC.  Worth the value for what it offers.", "verified": true, "helpfulness": "0/0", "author": "M. Settle"}, {"rating": 5.0, "review": "Where have you been all my life!", "verified": true, "helpfulness": "0/0", "author": "Wonder T"}]