[{"rating": 5.0, "review": "Easy to install, easy to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "Annie"}, {"rating": 5.0, "review": "It was good for my Netflix acct. Since my tv isn't a smart tv", "verified": true, "helpfulness": "0/0", "author": "carla Applewhite"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "D. Murdoch"}, {"rating": 5.0, "review": "Easy interface. Works great!", "verified": true, "helpfulness": "0/0", "author": "Katherine Ward"}, {"rating": 3.0, "review": "Loved it for a couple of months. Now it restarts on its own, freezes then fast forwards while watching tv. The remote is not comfortable to hold because it's so small. Very easy to lose. Buttons are already getting stuck. Not alot of free apps and the apps don't always work. I mostly use Netflix, but lately haven't been able to watch a anything without the movie freezing and skipping.  Cannot return it But I guess it good while it's lasted. I will try another brand if the fire stick decides to break on me.", "verified": true, "helpfulness": "0/0", "author": "Chela"}, {"rating": 3.0, "review": "I read the reviews and should have taken heed to those who said that not much on this stick is free.  Only the first episodes of shows are free if you want to go back in time to watch.....or even new shows to catch up.  I am disappointed.  I had the impression that it was movies and apps that one had to pay and not TV shows.  I  primarily purchased for use in our RV.  Too late to return.  Sorry Amazon, because of this, not a good purchase.", "verified": true, "helpfulness": "0/0", "author": "shopstoomuch"}, {"rating": 5.0, "review": "Easy to attach to the TV and use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Diana Baldry"}, {"rating": 3.0, "review": "Cant not get vudu on fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This Fire TV Stick Gives Me All of the Programs that I watch", "verified": true, "helpfulness": "0/0", "author": "Glenn"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Jillian Gray"}]