[{"rating": 1.0, "review": "Worked great for 6 weeks...", "verified": true, "helpfulness": "0/0", "author": "Mark A. Vay"}, {"rating": 1.0, "review": "The Fire TV Stick does not work with the latest model of the Sharp Aquas 80\" television, even with updating both products software programs, uless disconnected or unplugged before each use.  Very inconvenient.", "verified": true, "helpfulness": "0/0", "author": "The WellPet Center"}, {"rating": 5.0, "review": "Easy to install love it so far", "verified": true, "helpfulness": "0/0", "author": "JESSICA KELLEY"}, {"rating": 5.0, "review": "Really very happy with the unit.  WIFI reception is stronger than other devices I have in our home, and the interface is pretty clear and reliable.  My only disappointment is the lack of a browser, which I plan to correct shortly.", "verified": true, "helpfulness": "0/0", "author": "Don Elwell"}, {"rating": 5.0, "review": "The thing is tiny and it works great!  Very easy set up and on screen navigation.", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 5.0, "review": "I have Apple TV too and love the Fire TV stick better!!!", "verified": true, "helpfulness": "0/0", "author": "Michele Piraino"}, {"rating": 5.0, "review": "easy to work and works great", "verified": true, "helpfulness": "0/0", "author": "Gunnut"}, {"rating": 4.0, "review": "I really like this device.  I bought it to replace my outdated Roku since it was cheaper than the Roku Stick.  For some reason, the video lags much more than any other streaming device I have, including the outdated one.  Strangely enough, the audio doesn't lag but it takes a minute for the video to catch up to it.", "verified": true, "helpfulness": "0/0", "author": "Krash \"Krash\""}, {"rating": 5.0, "review": "I purchased this item over Google Chromecast for one simple reason.  It supports Amazon Prime and Google's stick doesn't.  It works well for what it is.  I do like the cell phone remote application.  It did take some research to realize that my TV's USB didn't provide enough power; had to use the enclosed power adapter.  That wasn't a big deal for me, but wanted others to be aware.The included remote is not infrared, which is nice because it doesn't have to have line of sight for it to work.  Big thumbs up for Amazon on that design.", "verified": true, "helpfulness": "0/0", "author": "David H."}, {"rating": 5.0, "review": "had problems with it at first but updates seemed to have cured them", "verified": true, "helpfulness": "0/0", "author": "Eric Quick"}]