[{"rating": 5.0, "review": "Does everything I was looking for", "verified": true, "helpfulness": "0/0", "author": "michael engstrom"}, {"rating": 5.0, "review": "Very easy to set up. I love this and it was well worth the price", "verified": true, "helpfulness": "0/0", "author": "CHRISTINA VINCENT"}, {"rating": 5.0, "review": "Best electronic device ever!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best spent $19 ever! It made my life better actaully! I can watch all kinds of movies and tv shows on my big-screen TV now while enjoying the free shipping as prime member. My daughter loves watching her Dora show and other kids show there. I also found some yoga and workout video there and try to follow it every day, which helps in this cold weather.Btw, very easy to set up, even a gadet idiot like me did it within 5 minutes.The only downside: sometimes the signal is not strong, it takes forever to stream, but i am very happy with what it has done for me, and try to ignore this little inconvenience.", "verified": true, "helpfulness": "0/0", "author": "Tracie Jenison"}, {"rating": 5.0, "review": "This is actually really cool! I also have a ChromeCast, and while I love it, the FireStick is convenient and pretty! No hassle with connecting to a phone, but that's an option if you're feeling like it! Love it, and great cost!", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 5.0, "review": "I got rid of Directv and now save over a thousand dollars a year. You get to pick out what you want to watch and press play. That simple.Love it!! Ordered a second one.", "verified": true, "helpfulness": "0/0", "author": "Titus James"}, {"rating": 5.0, "review": "Awesome. Turns my TV into an Internet TV!", "verified": true, "helpfulness": "0/0", "author": "julie"}, {"rating": 5.0, "review": "So much better than Roku. It has a way more modern look on the home page and all throughout the device than the Roku youvcan stream a lot more through it as well", "verified": true, "helpfulness": "0/0", "author": "Joseph Lawton"}, {"rating": 5.0, "review": "Love it, I can sideload other apps like Kodi (XBMC)If you had Amazon Prime, this is for you! I use it without Amazon Prime and use it as a Google ChromeCast! Pretty cool", "verified": true, "helpfulness": "0/0", "author": "Qmazon \"Qmazon\""}, {"rating": 4.0, "review": "The one I received works great.  It was really easy to instal. I thought I would be able to access my existing Netflix account but have not figured out how. I also received one of the two I ordered in a box that was open and had no packing slip. Having difficulty getting help with that.", "verified": true, "helpfulness": "0/0", "author": "Beverly Collins"}]