[{"rating": 5.0, "review": "Thank goodness I have a \"with it\" 18 year old son who told me I really needed this Amazon Fire Stick!  It's GREAT.  Now I can watch all the great things that I've been using my Kindle Fire for, except now it's on my TV!  AND I can show people my pictures that I have stored in the Cloud on the TV as well.  It is well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Deborah Weaver"}, {"rating": 4.0, "review": "Best thing I've purchased in a long time. Instructions should make it a bit clearer the firestick needs to be plugged in to function, rather than using the electrical cord to charge the device.", "verified": true, "helpfulness": "0/0", "author": "Marcia Sullivan"}, {"rating": 5.0, "review": "Great little device and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy setup", "verified": true, "helpfulness": "0/0", "author": "Timothy Haley"}, {"rating": 5.0, "review": "Love these to travel with, I have bought 3 to leave at my sister's house and mom's house when I visit.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "merlin villanueva"}, {"rating": 5.0, "review": "Very pleased with the Amazon Fire Tv Stick. So many movies and programs available, including those for rental. Enjoying it very much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We LOVE ours! We just ordered another 1!!!! Of course, I wish the we're a little less expensive, but they are worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Jeannietp229"}, {"rating": 3.0, "review": "I bought this device to stream video to a second TV after using a ROKU for over a year. Nice menus and presentation, however, I believe it still needs work. Constant pauses and stoppages to buffer data stream are a problem although I have only used it for Showtime Play so far. I do not see the pauses and streaming stutter on the ROKU on the same WIFI connection and teh same channel. I think I'd wait a while to let them get the bugs fixed.", "verified": true, "helpfulness": "0/0", "author": "Kansas Red Eye"}, {"rating": 5.0, "review": "So great that I bought another one!", "verified": true, "helpfulness": "0/0", "author": "Victoria"}]