[{"rating": 5.0, "review": "So far so good.  Since becoming a prime member, our family has enjoyed the streaming movies and video.  Problem was that we were using our Nintendo Wii for the kids and a Logitech Revue for our two TV's.  The speed of streaming is blazing fast, and I love all the additional features including the games and apps.The only negative is that the parental controls only apply to TV shows, movies, and rental capabilities; and whether you restrict access to those features.  There is no program rating restriction (G, PG, PG-13, R) that you con choose.  When this becomes possible on Prime Instant Video, this will be the best device period.", "verified": true, "helpfulness": "1/1", "author": "Benaiawannabe"}, {"rating": 5.0, "review": "Works great !  Very pleased with the way it  streams.", "verified": true, "helpfulness": "1/1", "author": "LBJ"}, {"rating": 1.0, "review": "I had high expectations for this device. I orig ordered beginning of November and after waiting patiently found myself like other pushed off till later in Jan 2015. I was able to obtain 2 today and was excited to set it up... After attempting the first device found after it forced the updates I was getting a blank screen after reboot. (it actually flashes a white amazon logo then goes blank) I then called tech support who advised me after little methods to try to attempt setting up the second device... After setting up the wireless and again running the update to this device I now had \"BRICK number 2\". Both brand new devices out of the box unusable and after several calls and speaking with a supervisor was informed there was no next level of support (with out waiting 48hrs etc) REALLY??? Obviously the updates are killing these devices. I was going to try and exchange them for two more if I can get them but I highly doubt there are 2 lemons that I rec. I can believe there is like no real support and the only solution is to have potential refurbished units sent. I am returning these two directly to the store. I really want to try and get another but sure I will just get burned again. I even tried to get a straight answer if the firmware would be updated on the replacement devices they would send but was told they didn't think so.... I would advise to wait until they have a more stable product as I am sure once the unit is out of warranty you will be stuck holding the bag!", "verified": true, "helpfulness": "8/13", "author": "Ama Zoon"}, {"rating": 3.0, "review": "setup was simple and video instruction very helpful. Too bad you cannot use usb connection for power source. Need more video apps, Vudu and HBOGO would be great, more cable apps needed. Picture quality is very good..", "verified": true, "helpfulness": "1/4", "author": "dredog"}, {"rating": 5.0, "review": "Purchased this on sale elsewhere. Easy setup...10-15 mins to install/update/register.  WiFi in our bedroom can be spotty, but this has been working flawlessly so far.  We've noticed only the slightest lag time with the stick vs our Fire TV in living room...and this is really only on start up.  Considered buying the voice remote, but decided to try the Fire TV Stick app first...it has voice search and works great!!  Another reviewer mentioned issues with remote needing to be in line of sight with stick & within 5 feet, but ours is plugged in behind the tv & we can aim the remote in the opposite direction of TV from the hallway outside bdrm (TV is on far side of room) & it works perfectly.  We've never used Roku or Chromecast boxes/sticks, so we can't make comparisons to those.  So far we've been very happy with our Fire TV, and the stick is a great new addition and bargain.  Will be purchasing more of these for guest room & studio.", "verified": true, "helpfulness": "10/12", "author": "M. Torres \"mtorres\""}, {"rating": 5.0, "review": "Works great, fast and easy to use.", "verified": true, "helpfulness": "1/1", "author": "MDiaz"}, {"rating": 4.0, "review": "SO FAR SO GOOD! I bought this so I could use my computer for work, and have Netflix playing on the TV in the background and did not want to spend $100 for Apple TV.  It was very easy to set up, and the picture is perfectly clear, sound streams through TV.One thing I was surprised about was that the USB device that goes into the TV isn't wireless. You plug the device into your TV, and then have to plug the USB device into a power outlet. This was difficult because my TV is mounted on the wall and pretty far from an outlet.  However, I was able to plug it into the back of my cable box using that power outlet. Just warning you this isn't some wireless device like it appears to be.Overall, this is a great product, it allows me to use my computer and stream Netflix at the same time, so I couldn't be happier.", "verified": true, "helpfulness": "1/2", "author": "Kate"}, {"rating": 5.0, "review": "First off, I purchased a chromecast out of necessity and how it would work for what I need it to do.  Luckily, amazon had an email waiting for me detailing the new amazon fire tv stick, for half off if I preorder... Awesome-sauce!  Placed my pre-order and returned the chromecast.  It is everything I expected. It works like a chromecast but with a remote and dedicated software/apps. It has the feel of an android phone with the apps.It is very nice, easy to use, and well worth the price.I bought 2!", "verified": true, "helpfulness": "2/3", "author": "Brandon"}, {"rating": 5.0, "review": "Works as anticipated.  Just another option ..very quick and responsive.", "verified": true, "helpfulness": "1/1", "author": "Ray D. Devolld"}, {"rating": 3.0, "review": "3 stars because even though it has some issues and annoyances, you can't really expect a ton for $25.  With that said, if any one of the 'cons' are deal-breakers for you, the price won't matter and you will be better off w/ a Roku or Android TV.Pros:super cheap.Seems snappy enough.  There was some sluggishness early on, but it's been smooth ever since.Better Amazon Prime interface than on the Roku.  The AP Roku app hasn't been updated in what seems like years, and it's slow, cumbersome, and dated as a result.  The Fire TV Stick is much better.A decent number of games.The remote is nice and small and easy to use.Cons:The wi-fi seems to be tempermental.  It wouldn't detect my router (even though over a dozen other devices of all types never have issues).  I had to go into my router config screen and change the channel.The remote doesn't appear to be IR, so you'd think it doesn't need line-of-sight, but I just covered it with my hand and it wouldn't work.  Oddly enough, the second I removed my hand, all the button pressed were sent to the stick at once.  Seems like the remote is listening for a confirmation that the stick received the signals, and if it doesn't get it, it keeps sending 'em.  Either way...Roku 3 has a better remote that doesn't require line of sight.Buying the same apps again for the Amazon ecosystem is kinda lame.  This is more of an issue w/ Plex, but it could still help determine if you want to purchase this device.Many of the TV show tiles show up as seasons.  You can  jump through seasons after clicking the tile, but why display as seasons?  In some areas, Workaholics season 3 and season 4 were a few tiles apart.  That's clutter.  Show me one icon for each show and lemme pick the season on the info screen.The REW and FFW buttons do not skip through pages of tiles like they would in virtually every app on the Roku 3.No Youtube or HBO Go app.  Roku has both.Amazon, for some unknown reason, accepted then didn't accept, then once again accepted my new credit card, but the Plex app still says there was a problem with the purchasing method every time I attempt to go download it again.  This kind of stuff needs to be ironed out if they want to be taken seriously.As a Prime member, I thought I was getting a sweet deal with a pre-ordered a stick for $19 back in early November.  To my surprise, the device isn't scheduled to ship until December 12th even though Best Buy had an entire display full of sticks for only $25 in stores today.  Making Prime members who are early adopters wait because Amazon wants to fill a retailers orders is a horrible way to treat your most loyal customers.  They may have gotten my dollars this time, but I will surely remember this experience in the future, and will be less likely to jump so early.All in all, with some time to tweak the interface and systems and get more apps, this could be a very solid streaming option.  When it comes to streaming hardware, the lack of one key app or feature will be a deal breaker.  Get Youtube, HBO Go, and various sports streaming apps (BTN2Go, Fox Sports Go, CBS Sports, etc.) and they will have a winner.", "verified": true, "helpfulness": "5/6", "author": "Speerdo"}]