[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Cindy Schoemaker"}, {"rating": 3.0, "review": "Even with the stick a foot away from the router, I get intermittent connectivity issues regardless of internet traffic. Apps seem to freeze constantly. Combine that with a laggy and unintuitive interface and this little stick is very difficult to use.", "verified": true, "helpfulness": "0/0", "author": "Daniel Ting"}, {"rating": 5.0, "review": "We love our new Amazon fire stick so easy to use and large variety of entertainment choices!", "verified": true, "helpfulness": "0/0", "author": "Joann C. Swinkey"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "K \"KR\""}, {"rating": 3.0, "review": "The good thing about it is that you can watch the programs that were limited to my computer or tablet screen to my TV. As a whole, AP doesn't have enough of the old TV shows or if it does they must be purchased.", "verified": true, "helpfulness": "0/0", "author": "Adam B"}, {"rating": 5.0, "review": "I have Apple TV (which I dislike), Google Chrome and Roku.  However, Fire TV Stick is used more than the others combined.", "verified": true, "helpfulness": "0/0", "author": "personal_reviewer"}, {"rating": 5.0, "review": "Dad loved it! Great father's day gift! Totally going to get one for my Grandmother next :-)", "verified": true, "helpfulness": "0/0", "author": "SP"}, {"rating": 5.0, "review": "good price", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 4.0, "review": "It worked great- for about a week. Then, on HBOgo, I would get a loud buzzing noise and no selected video. It did it every time I openedHBOgo and then it started buzzing on other selections. I had to go on an online forum and found an answer that worked for me. I had to goto system, then click on about, then check for updates. After that, it now seems to be working. That is the only ding I can give it and thatshould be addressed by Amazon tech support as there were many others having the same or similar problems. Otherwise it is a reallynice unit, small and discrete on the side of my tv.I would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "John B."}, {"rating": 2.0, "review": "Setup is very, very easy. Basically just plug and connect to the ole wifi network. Navigating is pretty simple and it's learned on the spot. Access to the configuration is also very easy, but not many options to tinker with, which can be a plus for most users.Personally, i don't like that there's a lot of apps that you cannot install and which would allow you to do things like access the google play store or just surf the web. Although this is an android device, you can't install just any android app, it has to be through their store. This is kinda the microsoft app store for the Surface RT Tablet. Not a good idea.While i realize that this device is not for surfing the web, i don't feel its fair to the customer to force him to buy the amazon content and completely lock him out of any other store. Where I buy my music / movies is my decision. I actually returned this item as i felt it did not deliver on that front and that was not mentioned anywhere on the site.I'll probably just hold on buying a streaming device out until there is more content-freedom for the user.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Oliva"}]