[{"rating": 5.0, "review": "Opens up a new viewing world.  A lot of stuff you still have to pay for, but there are a lot of shows and movies that are just great!!!", "verified": true, "helpfulness": "0/0", "author": "A. R. EDWARDS \"movie man\""}, {"rating": 3.0, "review": "Shipping times were outrageous. I ordered this product on a Monday with Prime 2 day shipping it said the order would be in on Wednesday.  I should have paid more attention, it said it would be in on a Wednesday almost 4 weeks after I ordered.  I ship with Prime because I like my online orders to be fast and efficient, this was not so.  I was very surprised considering this was an Amazon product. This is the only reason this product only got 3 stars.As far as the product itself goes, for $39 you can not go wrong, it has fast streaming capabilities and works on both of my televisions.  I bought this to replace a streaming blu-ray that was unable to keep connection long enough to stream without faults.  I also really enjoy the extras like Prime music and games on TV that you can play with others.", "verified": true, "helpfulness": "0/0", "author": "Ellen Moore"}, {"rating": 1.0, "review": "Not a fan of this product.  I always have loading/uploading wait time, errors and apps such as Netflix and Hulu Plus that have a hard time loading or working when they were working just fine on a different console. I know its not my internet cause I have very high internet. testing connection is always fine and have all bars showing for connections.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Rutherford"}, {"rating": 1.0, "review": "Received this for free after paying in advance for 3 months of Sling TV. It's worth exactly what I paid for it. It runs VERY hot in use. It stutters every few seconds. It frequently flashes a notice that my service isn't fast enough to support HD streaming--Motorola modem, Netgear dual band router AND my ROKU 3 works flawlessly on my network. The whole system is cheap and flimsy. It's a flash drive with software loaded onto it. The only way I've found to open the remote to change the batteries is by bouncing it off the floor. My advice is spend a few extra bucks and buy a ROKU. Even a ROKU 1, as slow as it is, works better than this device.", "verified": true, "helpfulness": "0/0", "author": "M. Bingham"}, {"rating": 5.0, "review": ".A handything to own when there is nothng on cable. Better pitcure then HD cable", "verified": true, "helpfulness": "0/0", "author": "Craig C. Leslie"}, {"rating": 5.0, "review": "Love it, better than the Google ChromeCast", "verified": true, "helpfulness": "0/0", "author": "Taymonk"}, {"rating": 3.0, "review": "Is there an app I can download as a browser???", "verified": true, "helpfulness": "0/0", "author": "jawjuhred"}, {"rating": 5.0, "review": "Same for the app", "verified": true, "helpfulness": "0/0", "author": "Carol Hamilton"}, {"rating": 5.0, "review": "Love ya", "verified": true, "helpfulness": "0/0", "author": "Kandie bowen"}, {"rating": 5.0, "review": "I love it.  Small unit, everything included.", "verified": true, "helpfulness": "0/0", "author": "Nance"}]