[{"rating": 4.0, "review": "This was a really good purchase! Has everything you'd need without having to buy a Smart TV.I just wish you could get VUDU on it as well. That would make this Perfect. Also the free movies you get with prime are not that great, some I've never heard of. But over all its great, and great price! :) :)", "verified": true, "helpfulness": "0/0", "author": "Maria Echevarria"}, {"rating": 5.0, "review": "Very easy to use, and works flawlessly so far. I have it connected to an aging Harman/Kardon AVR and the 5.1 Dolby sound the Fire Stick transfers to the AVR is surprisingly clear for being a streaming signal. YouTube comes through nicely as well. I haven't played around with every feature yet, as there really are so many of them, but from what I see of it so far it is a $40 very well spent.", "verified": true, "helpfulness": "0/0", "author": "Andrew Marvich"}, {"rating": 1.0, "review": "Beware!!! This devise only works well if you are within 10 ft of your router. The packaging does not say this nor does it say this anywhere else but when I called support for repeat connection problems they told me. I have a Roku that gets signal everywhere without any problems including my tv outside by my pool with is far from my upstairs router. Would not recommend this product as it's pretty much useless unless you are that rare person who has a router set up by your living room tv.", "verified": true, "helpfulness": "0/0", "author": "Mindy"}, {"rating": 4.0, "review": "I bit the bullet and bought this during one of the \"summer black Friday\" promotions.  I could not get it to work in the TV I bought it for.  The wifi signal was not strong enough in that part of the house.  We did move it to another TV and it has been flawless since.  My wife and child used to watch Amazon Prime movies on the iPad but now watch it on the TV.  I think it is a good product as long as it is in a part of the house with a strong wifi signal.  I do find I use the Apple TV more frequently but that isn't a knock on the Fire Stick, just personal preference.", "verified": true, "helpfulness": "0/0", "author": "Paul Houdashell"}, {"rating": 5.0, "review": "Good stufs", "verified": true, "helpfulness": "0/0", "author": "Ernest"}, {"rating": 5.0, "review": "Everything I needed! Easy to use, completely worth it.", "verified": true, "helpfulness": "0/0", "author": "kelley snyder"}, {"rating": 5.0, "review": "I used to have chromecast but I truly enjoy this product much much better!", "verified": true, "helpfulness": "0/0", "author": "Danielle Liesch"}, {"rating": 5.0, "review": "Love this thing!!!! My daughter reads books on the tv we watch Netflix and play games. It's perfect for what we wanted it for.", "verified": true, "helpfulness": "0/0", "author": "Jason Reising"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Michelle Guzman"}, {"rating": 5.0, "review": "Great apps and quick access to Prime content.  One of the best features is the ability for my phone to broadcast to it.  Anything I can't get through an app I can get on my phone.  Awesome device.", "verified": true, "helpfulness": "0/0", "author": "Jason Ziegler"}]