[{"rating": 2.0, "review": "I like the Chromecast better.", "verified": true, "helpfulness": "0/1", "author": "P. Faraday \"Decent guy\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is easy to use and offers endless entertainment for all ages.  We are thankful for a great alternative to cable television!", "verified": true, "helpfulness": "0/0", "author": "Rhonda Thorson"}, {"rating": 5.0, "review": "my family is so happy to have it", "verified": true, "helpfulness": "0/0", "author": "Abelina"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Andres Oppenheimer"}, {"rating": 5.0, "review": "It's amazing.", "verified": true, "helpfulness": "0/0", "author": "LMar"}, {"rating": 5.0, "review": "Really small and easy to set up. Seems well built. Remote is very intuitive. Really like I can voice search from my Fire iPhone app.", "verified": true, "helpfulness": "0/0", "author": "Shaun"}, {"rating": 5.0, "review": "Watch Netflix and Amazon Prime on a small TV in my basement. Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It was terrible,  didn't work 90% off the time. Always buffering or saying no internet connection. The ROKU 3 never has a problem. Took the fire stick back,  wasn't worth the $$. You get what you pay for,  upgrade to a box. They work much better 👍", "verified": false, "helpfulness": "0/0", "author": "Denise Vik"}, {"rating": 5.0, "review": "Fun and addictive", "verified": true, "helpfulness": "0/0", "author": "Brittany Giles"}, {"rating": 5.0, "review": "I have to say I was skeptical of buying one of these sticks. I bought one during Prime Day and it arrived yesterday in the mail. I have used it to replace a first version Roku + that they quit updating after the Roku 2 came out and didn't want to pay the going rate for another box. This was hooked to a small 24 inch tv in the kitchen that has one HDMI plug. Set up was easy. I liked the remote a lot as it feels very solidly built (my Roku remote always felt like it was a squeeze away from breaking and had mushy feeling buttons) and it is very responsive. I liked the dual frequency so I had a choice on my home wireless setup. So far all I did was add some channel apps and streamed a movie which ran really well and ran some music from the Amazon Music which is one of the features my wife likes. I have seen some comments before about it heating up and found it does warm up a bit while streaming and is also warm to the touch when not in use, but both times it was less than the heat put out by the original Roku in standby. This came configured for my Amazon account login and I only had to put in login information for the apps that required it such as Netflix and Flixter. I am very pleased with this and will definitely buy another one should the need arise as it would be a decent deal even at the $39 price.", "verified": true, "helpfulness": "0/0", "author": "John E. Oliver"}]