[{"rating": 4.0, "review": "Good but works very slow with the iPhone", "verified": true, "helpfulness": "0/0", "author": "Trevor"}, {"rating": 5.0, "review": "Love it. Excellent addition to my living room.", "verified": true, "helpfulness": "0/0", "author": "Brandi"}, {"rating": 5.0, "review": "Love my fire stick so much!", "verified": true, "helpfulness": "0/0", "author": "J. Berry \"DMBgirl87\""}, {"rating": 4.0, "review": "For the  cost of the stick I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "Ilvamazon"}, {"rating": 5.0, "review": "I used to love my Apple TV - and I am sure if I purchased a new one that I'd love it to.  But they are nowhere near as fast as this.  Granted it does more (i.e. iTunes, photos, movies on my computer, etc.) but if you are streaming movies...this thing is WAYYYYY faster.  I have now removed my Apple TV in favor of using this and don't miss it a bit.", "verified": true, "helpfulness": "0/0", "author": "Rodney Leadingham"}, {"rating": 4.0, "review": "Kodi works great on it.", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 5.0, "review": "This thing is really fast and works great!", "verified": true, "helpfulness": "0/0", "author": "Hoang Nguyen"}, {"rating": 5.0, "review": "A little disappointed that it could not connect to my AV unit though as that controls all my devices. However, with my Harmony One it really did not matter. I thought at first it was defective as it showed video and heavy snow when attempting to connect it directly to the AV unit. However, after I contact amazon support, they were wonderful. It got set quickly and easily. It seems to work flawlessly. I had been using the Amazon app on my PS4 and my TV, but this is well worth the price and better than those apps! The PS4 app, I have a fundamental issue with using the remote. Sony prevented the Harmony One from using it and I refused to use the game controller (personal choice). The TV app did not buffer so I was, at best getting an SD feed with lots of pauses. This stick does the trick! I love it. An even with the initial setup, there is probably technical issues with direct connect to an AV unit instead of the TV. I still get the full featured sound through the optical cable from my TV to my AV unit.", "verified": true, "helpfulness": "0/0", "author": "Matthew Jenkins"}, {"rating": 5.0, "review": "Love it! use it much more than my apple TV.", "verified": true, "helpfulness": "0/0", "author": "K. Koron \"Coolkiki\""}, {"rating": 5.0, "review": "this is great, wish I had known sooner....works great with Netflix (I'm a member all ready) and gives me more options for moviesand other TV shows, past and present.", "verified": true, "helpfulness": "0/0", "author": "Tom Mathews"}]