[{"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Dan"}, {"rating": 3.0, "review": "Wonderful item. Easy to set up and navigate.", "verified": true, "helpfulness": "1/1", "author": "Betty Van Cleave"}, {"rating": 4.0, "review": "I just want to write about something I discovered about Prime and the Fire Stick that probably would affect many purchasers.  I have Amazon Prime (in my name) but I got it shared from my live-in girlfriend.  So technically, she is the \"primary\" Prime owner.  Nevertheless, I purchased the Fire Stick from my account and received it free of shipping and expected all of the free Prime video content.  Not so. The free video content only goes to the primary Prime owner.  I even inadvertently got myself signed up to another Prime account when I was trying to view video through the Fire Stick. So I was billed for about $100.  However, Amazon is really good and one phone call cleared up the confusion and the charge was reversed and we re-registered the Fire Stick to my girlfriend's account.So, be aware; if you have Prime though a loved one, you cannot get free Prime video content.  Be sure to register the Fire Stick to the primary Prime member.", "verified": true, "helpfulness": "1/1", "author": "Bill from Philly"}, {"rating": 4.0, "review": "So I wanna tell you guys how awesome of a product Amazon has created for the TV streamer of the future.  This is the best device I've had since the tablets were introduced.  All of your favorite tv shows and movies in this little stick is great.  Now because of the holiday rush for this stick I received it 3 weeks after i ordered it no big deal.  My one and only hiccup I had was not knowing the power cord needs to be plugged into the stick at all times.  Cause from the pictures it look as if nothing needs to be plugged into the stick.  So as soon as it came I unwrapped and plugged it into an available hdmi port and nothing.  So I called customer service and rep explained very short and simple it always needs to have a power source just like a dvd player.  Duh I thought!! So now I'm streaming with no problems.  Bottom line this is a great investment!  For those who are having sooooo many issues I really hate you are cause this Stick will make u reconsider even paying for TV again.", "verified": true, "helpfulness": "3/3", "author": "LaToya Kimbrough"}, {"rating": 2.0, "review": "I was not expecting to pay for every tv show or movie. i can get more out of just using Hulu Plus and netflix than i can from adding this to my tv.", "verified": true, "helpfulness": "1/1", "author": "H13135"}, {"rating": 5.0, "review": "The perfect dongle as far as I am concerned! I had bought Google's Chromecast a couple months ago, and never really cared for having to use my phone to control it. I want to watch television, not look at my phone! I look at my phone enough during the day! The inclusion of a remote is the perfect solution.", "verified": true, "helpfulness": "1/1", "author": "Mr.Dougals"}, {"rating": 5.0, "review": "I love how it was preloaded with my information since I am already a Prime customer. Made set up even easier! Great, diverse programming for the whole family. Even discovered more benefits with my Prime membership (hello--MUSIC!).  This is changing the way experience entertainment. Well worth it!", "verified": true, "helpfulness": "1/1", "author": "Michele Brown"}, {"rating": 5.0, "review": "Easy to install and worked perfectly from the start.  Lots of media choices, apps and games.", "verified": true, "helpfulness": "1/1", "author": "John L. Gerrond"}, {"rating": 3.0, "review": "It's not an Apple TV, but I expect it will expand with additional Apps.", "verified": true, "helpfulness": "0/1", "author": "Camper1"}, {"rating": 3.0, "review": "The Fire stick is easy to install and use, however if you have limits on  data usage it can present a problem. If the Fire Stick is on and the TV is on, then it is  using internet, even if you are watching a DVD. It needs an off switch, instead of unplugging it.", "verified": true, "helpfulness": "1/1", "author": "Donnie W Jolley"}]