[{"rating": 2.0, "review": "was hard to hook up as my television is a little older and until I could find the slot on the screen. where I inserted it, I spent too much time.  Also, it took me an hour to open the remote to put in the batteries because it was stuck and upon research, found that they all are difficult to open so they have printed directions on line to get it to open.", "verified": true, "helpfulness": "0/1", "author": "Barbara Puglia"}, {"rating": 5.0, "review": "I bought this under a promotional sale, but I would pay full-price for it.Postive:  Easy to set up... easy to run... fast... lots of apps and content.Negative:  No HBO GO (coming soon, supposedly)... Can't stream from DishAnywhere or Starz (Dish Network not supported on many apps-- Come on DISH!)... Requires that you plug it into a power outlet (Works for me b/c of setup, but I can see this being a negative if you don't have a power outlet hidden behind TV)", "verified": true, "helpfulness": "0/0", "author": "Austin Allen"}, {"rating": 2.0, "review": "We bought two one of the remotes doesn't work.", "verified": true, "helpfulness": "0/0", "author": "Andrew Corral"}, {"rating": 5.0, "review": "I am loving the fire stick. I am new at it but I am figuring it out. Nice little toy!", "verified": true, "helpfulness": "0/0", "author": "DON"}, {"rating": 5.0, "review": "Really like it.  I can view television shows and movies with Prime, Netflix, and Hulu.  Plus get to watch You Tube and listen to music.  It fits my tv needs and is a fraction of the cost of cable.", "verified": true, "helpfulness": "0/0", "author": "Shineyberry"}, {"rating": 5.0, "review": "Easy to set up and has a much quicker response than my Blu Ray player when using netflix or amazon video. It will be better when HBO Go app is availible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'll keep this short since I agree with all the positive stuff other people have said.  I gave it only three stars because I am comparing to chrome and Roku, and in my opinion firestick comes in a close third.  Two reasons, the main one being that the power plug in is on the side, what were the designers thinking? When you plug this in to an HDMI jack that has an adjacent jack next to it, it effectively takes up two jacks because the cord covers the adjacent jack and renders it useless.  Chrome has the plug on the end of the stick and this make way more sense.Second reason is the stick goes to sleep and its hard to wake it up.  Sometimes you have to unplug it and plug it back in to get it to wake up, that is a pain.Also the remote is really really small and easy to loose, with chrome there is no remote and you usually know where your phone is to activate it.My recommendation if price is not an issue, go with the Roku-Chrome combo and leave Amazon to delivering packages.", "verified": true, "helpfulness": "1/1", "author": "Davidt100"}, {"rating": 4.0, "review": "I liked the product, but returned it b/c I was told by the sales person that Vudu worked on the device, but it didn't.  Product was great other than the fact that it didn't operate the channel I needed.", "verified": true, "helpfulness": "1/1", "author": "Truen Jaimes"}, {"rating": 5.0, "review": "Great product. Worth the $.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "haven't used it yet, but i'm sure I'll like it", "verified": true, "helpfulness": "0/0", "author": "Terry"}]