[{"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Dean L Davis"}, {"rating": 4.0, "review": "It's too early to give an informed evaluation. The only option I have explored so far is the movie section - pleased with that part. Still much to explore.", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Williams"}, {"rating": 5.0, "review": "Worth every penny. I have been watching it for a month now and no glitches.", "verified": true, "helpfulness": "0/0", "author": "E. Seltzer \"tech junkie\""}, {"rating": 5.0, "review": "Super stick, perfect for me", "verified": true, "helpfulness": "0/0", "author": "Captian"}, {"rating": 4.0, "review": "I bought this to mirror my Kindle Fire to my TV set.  Turns out that with this you don't need the kindle Fire to watch Prime movies and TV series.  The picture is a little fuzzy some times, but that may be due to the fact that our internet is sometimes slow and we have to plug this into our receiver rather than directly into the TV. Bought this to replace a Belkin Miracast adapter.  The Fire Stick does more and is perfect for watching Amazon Prime Content.  My only beef is that when I was looking for something to mirror my Fire, nothing I read about the Fire Stick clearly indicated that it would do what I wanted to do.  So I wound up spending more money on the Belkin, which doesn't work very well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very happy with this product. So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "grace mcdermott"}, {"rating": 5.0, "review": "First one worked for a couple of weeks then quit working, then after 3 weeks worked again. Sent first one back, received a replacement. Been working ever since. Great product for the price, love having Netflix in my bedroom, without requiring an extra piece of equipment.", "verified": true, "helpfulness": "0/0", "author": "Lillian Diaz"}, {"rating": 1.0, "review": "This thing is truly terrible. I have had it for 6 months now and I reget not upgrading to a new Roku box. It has a piss poor wifi radio and I constantly have to reboot. Buffering constantly! Concept was good and hardware looks nice, but definitely under performs. I have always been a big Fan of Amazon, but they missed the mark on this one.", "verified": true, "helpfulness": "0/0", "author": "Katie Mailloux"}, {"rating": 5.0, "review": "This thing rocks!!!", "verified": true, "helpfulness": "0/0", "author": "Ryan Salazar"}, {"rating": 1.0, "review": "Complete garbage that I can't watch movies that I bought from the Google play store on this.  Had I known that I would have bought a roku instead.  Or at least something not so locked down.  It's all Android so amazon will use Google open source os but not allow paid services on it.  God forbid there is a little competition. This is the last time I buy any fire products. It's too locked down monopoly like", "verified": true, "helpfulness": "0/0", "author": "ed"}]