[{"rating": 5.0, "review": "We needed a media device for our older non-smart flat panel tv in the bedroom. This is perfect!! It hooked up instantly and didn't require any troubleshooting. It loads quickly and has brought new entertainment options into our bedroom (we cut cable over a year ago and rely on digital antenna, Netflix, amazon prime, hbo go, etc). We love it!", "verified": true, "helpfulness": "0/0", "author": "I. Frias"}, {"rating": 5.0, "review": "I just received my Fire TV Stick. It took less than five minutes to set everything up. It works perfectly. It does everything as advertised. I am very happy with it so far.", "verified": true, "helpfulness": "0/0", "author": "Arloff"}, {"rating": 5.0, "review": "Excellent, better than originally thought.", "verified": true, "helpfulness": "0/0", "author": "Jackie Whitener"}, {"rating": 4.0, "review": "Great device! However, I returned and exchanged it for a Roku. Simply because the latter had more content. Maybe when the Fire Stick has more content I will purchase it again. It is very easy to use and unlike the Roku stick there is little or no delay.", "verified": true, "helpfulness": "0/0", "author": "Antonio Obando Jr"}, {"rating": 5.0, "review": "I love the fire stick.  It is perfect for how I use it.  I became a prime member again after I got it and I watch Netflix and Hulu all the time. I got it mostly for my TV in my bedroom cause it is too difficult to run wires upstairs and this is wireless.  But it is simple to just unplug it from upstairs and take it downstairs if I decide to use it downstairs.  I have not had any problems with it freezing or anything.", "verified": true, "helpfulness": "0/0", "author": "indy"}, {"rating": 1.0, "review": "The audio would not sync to the tv after the 1st day of use. However the 1st day of using the fire stick did meet expectations until the audio issue occurred.I called the amazon help line and they were unable to fix it so I just returned the fire stick. I use my PS3 for streaming purposes with no audio issues.", "verified": true, "helpfulness": "0/0", "author": "Ryan Ross"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Love my fire stick. Works great!!!", "verified": true, "helpfulness": "0/0", "author": "ERIK ASHER"}, {"rating": 4.0, "review": "It most likely performs great when there is no interference of any sort going on.  Not sure of why I get delays in the video's yet.  Very discouraging at this point.  I have a newer modem for my wireless... Seems more slow at night time.  Maybe something else is running.  I haven't had a chance to figure it out yet.", "verified": true, "helpfulness": "0/0", "author": "pamela lynn"}, {"rating": 5.0, "review": "Love it!!!! It's everything I wanted and more. Easy to use. Mobile. Great. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Stacy A. McKinney"}]