[{"rating": 5.0, "review": "So easy to install and as an Amazon Prime member I have access to tons of content like movies, tv shows, music for free. This has been a nice feature for my children as well!", "verified": true, "helpfulness": "0/0", "author": "Green28"}, {"rating": 4.0, "review": "Had this product for a few days now, I also own the fire tv, but wanted movies and music on another screen in the house and couldn't pass up the 20 stick. I will say it is much better than chrome cast for me personally, my only gripe so far has been that tv shows sometimes buffer right in the middle of a show. Otherwise if you just want a cheap stick that can do a little more than just movies this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Justin Reto \"Justin R\""}, {"rating": 1.0, "review": "Would not load updates after 5 hrs trying and froze up, waste of money does not work as advertised. Amazon is going to replace, if that doesn't work, I well toss in garbage.", "verified": true, "helpfulness": "1/1", "author": "ldp"}, {"rating": 5.0, "review": "Fast and easy.  Works exactly as described with clear picture great sound and no buffering.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great for the price. I appreciate the fact that amazon does not try to limit my access to competing services, which the other comparable products do. The interface is smooth and easy to use, well set up. Quick loading, faster response time than the two competitors products we have owned. I look forward to faster speeds as it learns to anticipate our taste. Games are a nice bonus, plenty of free apps to play around with.", "verified": true, "helpfulness": "0/0", "author": "Southwesterners"}, {"rating": 4.0, "review": "Like it so far. Preordered and came on time. Still needs to catch up to roku and Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Michael K. McKown \"mkmsol\""}, {"rating": 4.0, "review": "I got this for the special $19 pre-sale and now I want another one and it is $39 and won't be available until Jan. 15th. I wish I'd bought 2 or 3, but I did want to try it out first. Already, I am very impressed with the speed of operation. We've watched movies on Netflix on the same TV before, using the LG TV interface, and it would always have to buffer and buffer throughout the film. We've already watched numerous shows and movies with the Fire with no buffering after the initial loading of the video.The Amazon Prime interface is much better than what comes through with the LP TV app. On that, I do not have my Watch List available (though it is available on another set box we have in the bedroom.) I also tried Netflix via Fire, trying to watch the same movie I had in Prime, to see if it buffered more. It was OK, but we went back to watching it on Prime because it seemed faster.I did have difficulty initially, updating the software before it could start working.  Twice it ran update for about 40 minutes and then crashed, \"unable to update.\"  I called Amazon and spoke with a girl who didn't seem to be much of a techie, but she must have read from her \"list of tips\" that I might be getting interference from other plug-ins to the TV and that I should use the short HDMI extender cable that came with it. I plugged that in and it immediately did the trick. This TV is farthest away from my modem, so the internet probably wasn't getting the strongest signal.I'm still getting used to using the very light little remote and trying to smoothly get around everything. But it is quite fast gliding through the rental choices. There is plenty of free stuff to choose from with a Prime membership, and better quality than a lot of Netflix offerings (which I might drop if I can live without House of Cards!)The only other issue I've had is in pause/rewind/fast forward. It is really fast and a bit difficult to get to the spot I want. Twice I have tried pausing or rewinding, and I end up with an on screen message that I have lost my Internet Connection. This could be a problem with a drop in my service, but since it has only happened when I'm rewinding or trying to pause, I'm not sure that is really the connection. It has taken a bit of clicking around, going out, coming back in, checking the internet connection (which it says in strong) before I can get back to the video.All in all though, this little gadget is great and I won't be using my LG TV interface anymore!", "verified": true, "helpfulness": "0/0", "author": "Beckalina"}, {"rating": 4.0, "review": "Good product to help maximize amazon prime membership.", "verified": true, "helpfulness": "0/0", "author": "Michael Pytel"}, {"rating": 4.0, "review": "Great little device. Quick and easy setup, great picture quality and a good variety of apps. The interface is cluttered and could use some work.", "verified": true, "helpfulness": "0/0", "author": "Vilna Peralta"}, {"rating": 5.0, "review": "I am extremely impressed with this.  It compliments and extends the abilities of my Kindle Fire beautifully.  The screen sharing was perfect and could only be improved by having a quick toggle on the home screen which I still may figure out with more experimentation.Setup was simple and quick.  The one missing necessary channel is HBO Go and they say it's coming soon.I recommend this for everyone but especially for those technophobe relatives who have trouble with new things.  It's really simple.  The Netflix app is the best layout design out of any I've used so far too.  I've got a Roku, Logitech Revue and  a Chromecast and the Amazon Firestick has been the best yet!Another fantastic job from the Amazon Team!  Great job guys!", "verified": true, "helpfulness": "0/0", "author": "John \"IT Administrator for a small Cable Television equipment provider in Oklahoma.\""}]