[{"rating": 5.0, "review": "Functions perfectly", "verified": true, "helpfulness": "0/0", "author": "Todd Bielic"}, {"rating": 5.0, "review": "These are super great quality.  Much better than other media boxes I've tried.  And you can even load Kodi  \\ (*o*) /", "verified": true, "helpfulness": "0/0", "author": "David \"David\""}, {"rating": 5.0, "review": "Better than expected! I still have to play with it to see what all it will do, ,but music and apps are great!", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 4.0, "review": "This is great. We do not need cable anymore!", "verified": true, "helpfulness": "0/0", "author": "steelfan \"steelfan\""}, {"rating": 5.0, "review": "I got this for my father and he loves it. It is pretty easy to use and offers a ton of apps/channels. My father has proclaimed it the best thing I ever gave him...I gave him an iPad last year.", "verified": true, "helpfulness": "0/0", "author": "G. County"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Alex Desimone"}, {"rating": 4.0, "review": "I have had this for one day. I hate to compare it to my roku 2 but what else can I do. The Fire Stick has a much faster response time, more space. The screen is a little confusing to navigate and it doesn't seem to have as many apps, but has all the major apps needed. The game apps are nice. There are tons of games which the roku has very little of. The fire stick has really nice free screensavers too. The remote is much cleaner and simpler to use compared to the roku. Overall I give this 4 stars and can't really say if it is better or worse than the roku.", "verified": true, "helpfulness": "0/0", "author": "Bubbie \"Bubbie\""}, {"rating": 3.0, "review": "would like local channels", "verified": true, "helpfulness": "0/0", "author": "safe feelings"}, {"rating": 5.0, "review": "Very good. We have had a few roku devices over the years and decided  to give this a try.  Works great. Does have limited range being a stick.  I originally had it upstairs and across the house from the router. It worked but with some lag.  Moved it to a tv on the main floor now runs great.", "verified": true, "helpfulness": "0/0", "author": "Michigan Man"}, {"rating": 5.0, "review": "works as well as Roku for half the price!  Takes a while to find the Pandora app, but works great!", "verified": true, "helpfulness": "0/0", "author": "Lyn Clements"}]