[{"rating": 5.0, "review": "\"Did the Amazon Fire Stick, meet my expectations?\"  Boy, did it ever!  It's the best thing since sliced bread!  Talk about options, they are endless.  I may never leave the house again. Straightforward, easy setup and usable in minutes.  A superb value. Hands down, it's a winner! Five stars for sure.  Thank you Amazon.", "verified": true, "helpfulness": "1/1", "author": "WFJ"}, {"rating": 5.0, "review": "I love this fire stick.  It came in handy on our vacation.  The only thing that was disappointing is that it did not have the Showtime.", "verified": true, "helpfulness": "0/0", "author": "Sandra B."}, {"rating": 5.0, "review": "I used to have chromecast and all I can say is it's no where near this fire tv stick. I bought it few days ago when they had that $15 off and all I can say is it's worth every penny.", "verified": true, "helpfulness": "0/0", "author": "gail"}, {"rating": 5.0, "review": "WORKS GREAT. DON'T HAVE ANY BUFFERING ISSUES .MOVIES COME UP BEAUTIFULLY.MY MUSIC PLAYS CLEAR. I WOULD RECOMMEND THIS TO ANYONE.", "verified": true, "helpfulness": "0/0", "author": "tony dibari"}, {"rating": 4.0, "review": "good product I haven't​ had any problems with it so far.", "verified": true, "helpfulness": "0/0", "author": "roger smith"}, {"rating": 4.0, "review": "I liked it for the most part. But I've changed to the Roku 3.It was a bit slow even tho I am fairly close to our wireless modem.I assume it's because of the processor.Since I purchased, I've since given to an acquaintance still in college so they can enjoy their streaming on their TV instead of their laptop.", "verified": true, "helpfulness": "1/1", "author": "crystal"}, {"rating": 2.0, "review": "I'm having trouble keeping an connection. The stick gets very hot and I worry about it shorting my television out.", "verified": true, "helpfulness": "1/1", "author": "Kimberly Miller"}, {"rating": 4.0, "review": "Works much better than my Google Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Jay J Posner"}, {"rating": 5.0, "review": "The best purchase I ever made for the money. Very easy installation and very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Joe Javeri"}, {"rating": 3.0, "review": "We are disappointed. It is probably a good product but, we bought it for use in hotel rooms. Just received it yesterday and checked into our hotel today. Found out that hotels are now blocking use of the Fire Stick by disabling the input button on the TV. We would not have bought it if we had known you could not use it in hotels. We are staying at a Marriott. We travel a lot and were looking forward to using our Fire Stick. May return it if we can. It is useless to us.", "verified": true, "helpfulness": "0/0", "author": "B. Davis \"Page Fan\""}]