[{"rating": 5.0, "review": "I love it!!! So easy to install and watch on my tv.", "verified": true, "helpfulness": "0/0", "author": "fwraynor"}, {"rating": 5.0, "review": "I pucchased the Fire tv stick after doing several months of reserch best i can say is i enjoyed it so much i bought 1 for my daughter as a birthday present", "verified": true, "helpfulness": "0/0", "author": "TOT GEBER"}, {"rating": 5.0, "review": "Enjoying it very much. So much to view or catch up on. Very easy installation.", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 5.0, "review": "love this thing. and with the free app you can run it from your smart phone as well. so you know amazon isn't trying to screw you with having to replace a remote if you ever lose one. Its this kind of attitude from Amazon that will probably keep me a customer for life.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very cool gadget. Can do so much more than chromecast. Router is two walls aways and the signal is solid. Battery compartment on the remote is haaard to open - an odd oversight on amazon's part.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Love it. We use it in our bedroom on TV so we can access Prime instant video and Netflix upstairs(we don't have a smart TV). Works great and as advertised.", "verified": true, "helpfulness": "0/0", "author": "Daniel P. Earle \"DPEarle\""}, {"rating": 3.0, "review": "Works well. I don't have access to most of the apps because I have Comcast and they block it. The fire stick works well with sling TV and it's the fastest Netflix app I've ever used.One complaint: the remote malfunctions and send to get stuck in one direction. Not sure if it's a hardware or software issue.One more: I thought it would incorporate titles from other apps like Netflix into its home screen.", "verified": true, "helpfulness": "0/0", "author": "Nick Brisson"}, {"rating": 5.0, "review": "Very easy to install", "verified": true, "helpfulness": "0/0", "author": "maxine mortenson"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "R. Clason \"common sense\""}, {"rating": 4.0, "review": "After waiting 3 weeks, I received my Fire Stick.  I plugged it into my sound system and it immediately was recognized.  Using the supplied remote was simple.  It is somewhat limited on applications, but it has the ones I'm most interested in.  I am satisfied with my purchase and look forward to taking it with me when I travel on business.", "verified": true, "helpfulness": "0/0", "author": "PTTM Munneys"}]