[{"rating": 5.0, "review": "fun, easy to use", "verified": true, "helpfulness": "0/0", "author": "David Reed"}, {"rating": 4.0, "review": "So far so good.  I love the little graphic man that teaches you how to operate the fire stick.  Simple and effective.  I was so proud to have figured this out without having to call a teenager to explain it all!  Am enjoying the benefits of Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Leah Schafer"}, {"rating": 5.0, "review": "Works well fast clean streaming. Get the voice remote to save you time searching. Easy set up", "verified": true, "helpfulness": "0/0", "author": "neperson"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"dcnhan2\""}, {"rating": 5.0, "review": "Love this system as it allows me to use my prime membership to its fullest", "verified": true, "helpfulness": "0/0", "author": "Roxanna"}, {"rating": 5.0, "review": "I love my fire stick. I watch more movies with my prime membership than I watch on regular TV and cable. Love it!", "verified": true, "helpfulness": "0/0", "author": "Peeky"}, {"rating": 5.0, "review": "Just like magic....really amazed", "verified": true, "helpfulness": "0/0", "author": "Sandy Silver"}, {"rating": 3.0, "review": "I own the Fire TV Stick and the Fire TV. Here is a list you may find useful. My conclusion? Had I known what I know now, I would have simply bought a second Fire TV instead of the Stick; however, if budget was a concern, I would get the Stick instead of the Fire TV.- The first thing I noticed about the Stick was that the commercials kind of lie to you through omission about how it connects to your TV. The stick requires power! The package comes with two power options: a USB cable and a wall adapter. The USB cable can be used if the USB port on your TV is powered sufficiently (older USB interfaces won't be sufficient). If the USB doesn't work for you, you can use the wall adapter. The power cable is ugly and plugs into the long side of the Stick and was therefore impossible to hide the cable entirely behind my TV.- The stick doesn't plug into the USB port! It plugs into an HDMI port instead. I wasn't expecting this.- The Fire TV Stick interface isn't as smooth as the Fire TV; the menu animations are a little jittery.- The remote, surprisingly, has a different shape and texture, and the buttons are harder to press than the Fire TV remote.- There is no voice searching on the Stick! I was REALLY sad about this as this feature was a huge selling point for me for the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "John Durden"}, {"rating": 5.0, "review": "5 Stars nuff said", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "I'm in love with my Fire TV stick ,  the installation is easy you don't have to be a techie to be able to install this device it takes but 10 minutes and then TV viewing delight Like I said I like it very much.", "verified": true, "helpfulness": "0/0", "author": "gisela ortega"}]