[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "momof2girls"}, {"rating": 5.0, "review": "Delivers exactly what we want to see, when we want to see it!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Whittenbury"}, {"rating": 5.0, "review": "Great fun I love it", "verified": true, "helpfulness": "0/0", "author": "Carla Harris"}, {"rating": 5.0, "review": "Well worth the $40. Access to Hulu and Netfix so I only have to have one device. All the things you do video on the Kindle can been done here as well.", "verified": true, "helpfulness": "0/0", "author": "jdajod"}, {"rating": 5.0, "review": "I like the fact u can put third party apps on it", "verified": true, "helpfulness": "0/0", "author": "odelmo paltooram"}, {"rating": 5.0, "review": "The amazon fire stick...I dont even know where to start. This thing is so awesome. As i dont own a regular fireTV i cannot say if this is faster or slower, but i can't imagine something that is faster than this! It get my movies from all my places and plays them with ease.I wish there was a casting function that worked super easily to play movies from my computer, but until then ill watch all my netflix and Prime movies.", "verified": true, "helpfulness": "1/1", "author": "IsaacFank"}, {"rating": 5.0, "review": "Fantastic! Customer Service is awesome!", "verified": false, "helpfulness": "0/0", "author": "Blondie"}, {"rating": 4.0, "review": "I love my Fire TV Stick! I did away with cable a while ago, and was looking for just a bit more options than over the air TV offered. I was tossing around the idea of Netflix, but decided to give Fire TV a try first seeing as how I already had a prime account, and could do Netflix with the Fire TV later if I felt I needed more options. I've had Fire TV for almost 2 wks now, and am very happy with it. Set up was simple and took less than 5 mins., the variety is plenty for me, and my daughter is loving having Dora back on TV again! I was also super excited to find soo much variety in the apps. There must be 2 dozen excersize options alone. I've even recommended the Fire TV Stick to friends!", "verified": true, "helpfulness": "0/0", "author": "Rene"}, {"rating": 4.0, "review": "No comments.", "verified": true, "helpfulness": "0/0", "author": "DLMILES"}, {"rating": 3.0, "review": "Is a very good system, but you need to put it next to the router. Very bad wifi signal.", "verified": true, "helpfulness": "1/1", "author": "Jorge Bogaert"}]