[{"rating": 5.0, "review": "This little stick is awesome. I have been able to cut my Satellite bill by 70% by dropping all but local channels, and maintaining my \"International\" package. That is including the few subscriptions that I need to match what I was getting previously. So I might be a week behind on some shows, it really doesn't matter to me as I always DVR'd most of them anyway and would watch when I had a chance. Lots of Apps to choose from, unlike with \"Cable or Satellite forcing their choices on you. So many networks now have their own free apps it makes it even a better buy. No glitches with it after a few months, bottom line...I am one happy camper with this purchase.Only con I have found so far is the remote's awkward way to search on some apps. But that is of little importance compared to the money being saved!", "verified": true, "helpfulness": "0/0", "author": "Kevin \"kthinsa\""}, {"rating": 4.0, "review": "Nice Stick Not Enough App Support Though", "verified": true, "helpfulness": "0/0", "author": "Dan Hanson"}, {"rating": 1.0, "review": "What's the point????? It's small. Big Deal. You still have to plug it into an outlet via a USB cable. It's not like you  just plug in the stick into your tv and you're set like most people think. No way. YOU STILL NEED TO PLUG IT INTO AN OUTLET. So basically all you have is a small box with no option to plug in an ethernet cable when wi-fi signal is bad.", "verified": true, "helpfulness": "0/0", "author": "Achille Iolascon"}, {"rating": 5.0, "review": "Must have", "verified": true, "helpfulness": "0/0", "author": "jeff tucker"}, {"rating": 4.0, "review": "still working  with  it", "verified": true, "helpfulness": "0/0", "author": "rod"}, {"rating": 2.0, "review": "Totally interferes with HDTV Indoor antenna.  And it was buffering a lot on our network.  Returning for the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Sarah B"}, {"rating": 5.0, "review": "This is the best electronic purchase", "verified": true, "helpfulness": "0/0", "author": "christine reedy"}, {"rating": 5.0, "review": "I love it, amazing... I was scared to buy this product because I just new it would not work some how because it works off of wifi but it does really good. Sometimes it does cut out and I have to wait not even a min. for it to come back but hey that's not the fire stick's fault it's my wifi. so I have to say I just love it.", "verified": true, "helpfulness": "2/2", "author": "April Woody"}, {"rating": 5.0, "review": "So far we love this product", "verified": true, "helpfulness": "0/0", "author": "abbie rose"}, {"rating": 5.0, "review": "It took me a few minutes to hook up but I love how clear and instant the movies are on our TV. I have already told others how much I like it.", "verified": true, "helpfulness": "0/0", "author": "kay"}]