[{"rating": 5.0, "review": "So much easier to use than other streaming boxes ... Less wires . Remote could be a bit bigger though , I lose it all the time.", "verified": true, "helpfulness": "0/0", "author": "James Washington"}, {"rating": 5.0, "review": "Love the fire TV stick. Easy to use no problems what so ever!!!Would buy again.", "verified": true, "helpfulness": "0/0", "author": "margie bryan"}, {"rating": 5.0, "review": "I am very happy with this item. It was very easy to set up, took only a few minutes. The remote is very easy to get used to. I have watched some shows on hulu and Netflix without any problems. The shows load quickly. I mainly purchased it so I can watch The Mindy Project on hulu on my TV rather than my computer, but I have found it is great to watch a lot of things. My TV is about six years old, and this works perfect with it.", "verified": true, "helpfulness": "0/0", "author": "tb"}, {"rating": 4.0, "review": "The Fire TV Stick is OK.  However in comparison to ROKU, the remote included is inferior.", "verified": true, "helpfulness": "0/0", "author": "Charlie D"}, {"rating": 5.0, "review": "love it!  after experimenting with the device,it has been a very interesting new toy for me.after syncing the device with my subscriptions i have found a brave new world of entertainment to dive into.  thank you amazon for creating such a neat little device!", "verified": true, "helpfulness": "0/0", "author": "mitchell jenkins"}, {"rating": 4.0, "review": "Love this, however the remote could be new tech instead of old school. My movies also stop for no reason. Must do something about it.When you update the remotes, we should not have to pay for the revised ones.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "sroge"}, {"rating": 5.0, "review": "Own TWO of them one in the living room and one in the bedroom had no problems setting anything up on either one haven't seen a single add on here other than ads for movies or shows rent and buy movies all the time and can use Netflix its awesome", "verified": true, "helpfulness": "0/0", "author": "Brianna Gabbard"}, {"rating": 4.0, "review": "I find that the fire stick was a good purchase. Many options to watch tv, listen to music. I like the remote. It makes the expierance better. And since I'm a primer member that makes  the Fire stick the best  choice.", "verified": true, "helpfulness": "0/0", "author": "JONATHAN P BISHOP"}, {"rating": 5.0, "review": "This is the greatest invention since TV's!! goodbye cable!", "verified": true, "helpfulness": "0/0", "author": "luvbronze"}]