[{"rating": 5.0, "review": "Nice little device.  Very similar to the Roku stick but I think this one has a stronger Wifi receiver in it.", "verified": true, "helpfulness": "0/0", "author": "CG"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "L.breezy"}, {"rating": 4.0, "review": "I like how this is super easy to setup and use. It is a good value for the price and having the availability for use with Plex and other streaming services there is a lot of bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "E Mo \"Definitively E\""}, {"rating": 1.0, "review": "Finally a way to access amazon free video prime account. Unfortunately videos available for \"free\" viewing are old stuff.  Other available services I can already access from my PC or existing media devices, so this really doesn't add anything. This is simply another tool for amazon to try to get you to spend more money on stuff you don't need.", "verified": true, "helpfulness": "2/3", "author": "Rophe"}, {"rating": 5.0, "review": "I really like this little guy. I've been using a Roku player and the only advantage it has over the Fire Stick is its native music/video player. I am using Plex on the Fire Stick to help with this. If a native player is ever added this product will be even better.Navigating the menus, settings, apps and options all are easy and quick. Setup was easy. The most difficult part was getting in into the HDMI port of my TV. That is only difficult due to me being in a wheelchair and my wife had to do it. I was up and configuring my WIFI and exploring new stuff in moments after that task was finished.", "verified": true, "helpfulness": "0/0", "author": "Kelley B. Underwood \"Blunderdog\""}, {"rating": 4.0, "review": "Works great, delivers a quick and slick streaming experience.", "verified": true, "helpfulness": "0/0", "author": "RWS"}, {"rating": 5.0, "review": "Bought this for my sons room. Works very well. He has been very happy.", "verified": true, "helpfulness": "0/0", "author": "Joe Kampman"}, {"rating": 5.0, "review": "Love, Love, Love it!", "verified": true, "helpfulness": "0/0", "author": "jennifer manno"}, {"rating": 4.0, "review": "Didn't have quiet as much as I thought it would.", "verified": true, "helpfulness": "0/0", "author": "Jamie Cross"}, {"rating": 5.0, "review": "Amazon nearly hit a home run with the Fire Stick. I love that I can link it to my phone or tablet and have a full keyboard to input searches. I love that it has a remote, too. It's blends the ease of use of a Roku with the portability of a Chromecast. I think Amazon looked at the best features of the other streaming sticks, combined them, and threw in a few neat tricks of their own.My only complaint is that I wish I could browse and select Prime Music from the device, rather than having to add playlists from the PM page.Overall, it's definitely a winner, and I'm glad I bought two. One for home, and one for travel.", "verified": true, "helpfulness": "0/0", "author": "Captain Ducttape"}]