[{"rating": 5.0, "review": "Absolutely as advertised AND MORE! For the price - an incredible value. The HD extender for hard-to-reach places for connection can cost nearly as much as the entire package. So what does Amazon do? Include it with the kit! Easy set up even for this 74 year old \"not a geek.\"", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Arangio"}, {"rating": 5.0, "review": "Easy to set up, plenty of Apps, good buy.", "verified": true, "helpfulness": "0/0", "author": "Dan Lageman"}, {"rating": 4.0, "review": "I like this product very much.  The only reason I didn't give it a 5 is it's only good for one TV.  So If I want it on multiple TV's it get's expensive", "verified": true, "helpfulness": "0/0", "author": "William Kieper"}, {"rating": 5.0, "review": "Works great for me!.no issues that I have found.", "verified": true, "helpfulness": "0/0", "author": "Kevin G Menzel"}, {"rating": 4.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Govinda Srinivas"}, {"rating": 5.0, "review": "It's my 3rd fire stick . Works great . We needed more for all our TV", "verified": true, "helpfulness": "0/0", "author": "Esther F."}, {"rating": 2.0, "review": "If your looking for something to play Netflix or prime video, it works.However half the other features I needed out of it are extremely sad, there is no official YouTube app, and the ones on there consider the stick to be \"mobile\" so you will lose videos, and if your lucky the \"full screen\" support with the few apps will give you black side bars. The other is absolutely sad TwitchTV app, can't login, can't fine your favorite streamers and Amazon owns Twitch. That's beyond sad get with the program guys.The stick is fine, but it's power connector is of extremely poor design, if you have a power strip, hope you have a end slot open because the USB port is in line with the power prongs, why isn't it on the side?After only a half hour of using it I requested a refund, if your wanting more than Prime video get something else.", "verified": true, "helpfulness": "0/0", "author": "TAO"}, {"rating": 5.0, "review": "this is the real deal very happy", "verified": true, "helpfulness": "0/0", "author": "sammy"}, {"rating": 4.0, "review": "Thank You!!!", "verified": true, "helpfulness": "0/0", "author": "elsobrantedave \"dy\""}, {"rating": 5.0, "review": "Ordered 2 of this item and both arrived on time with no issues so far. I was able to hook up both Fire TV sticks to two Smart televisions and if you are a Prime member the setup is a breeze once you link your Amazon account. I can't speak for those who are not Prime members regarding the accuracy of how this device would be with their units at home. I bought Chromecast awhile back and don't get me wrong I had no issues with that device either, however what I appreciated most about the Fire TV Stick is you do not need to cast the viewing from your computer, tablet or phone any choice through mirroring is your option. This stick works  solely on an internet connection, and if you are a traveler this would help a great deal as I am. Another added bonus is the remote control which makes scrolling to your selected choices a lot easier. I love this device so much I am ordering another one after submitting this review.", "verified": true, "helpfulness": "0/0", "author": "Tirelyz"}]