[{"rating": 1.0, "review": "Not easy to set up.  Still can not get this device to function", "verified": true, "helpfulness": "0/0", "author": "David Gornewicz"}, {"rating": 1.0, "review": "I am so happy", "verified": false, "helpfulness": "0/0", "author": "ketly Dentiste"}, {"rating": 5.0, "review": "I use it on 2 different tv's and it is really easy to swap out.", "verified": true, "helpfulness": "0/0", "author": "Bev in NC"}, {"rating": 2.0, "review": "I was exited to get this and extremely disappointed when I used it. We had just returned from a family vacation and the product description said \"Fire TV Stick lets you mirror your phone or tablet to your TV\". However, after getting it and trying to mirror my iPad the fire stick directed me to their website where is says you can only mirror with Kindle HDX (we have five kindle devices, but none of them are the HDX), or android devices running a certain version of the operating system. I em returning the fire stick and ordering the google device, which says it's compatible with iPhone and iPad.", "verified": true, "helpfulness": "0/0", "author": "M. Glynn"}, {"rating": 5.0, "review": "Great. Love it", "verified": true, "helpfulness": "0/0", "author": "vince caputo"}, {"rating": 1.0, "review": "DO NOT BUY THIS!  It works when it wants to work...Loose Money!  FIRESTICK SUCKS!!!", "verified": true, "helpfulness": "0/0", "author": "S. Joseph"}, {"rating": 5.0, "review": "We love our Fire TV stick.  We got it on sale.  It works perfectly.", "verified": true, "helpfulness": "0/0", "author": "David (Author)"}, {"rating": 5.0, "review": "I cannot say enough good things about this (or most Amazon products...) I am somewhat \"techie\" but plugged it in per instructions, submitted password for wifi and it was ready to go! It could not have been simpler and the cute video included to walk you thru its use was helpful. I am a happy owner of 6 Kindle devices (uh, grandkids...) and pleased to say Amazon has made another outstanding product! The device mirroring worked flawlessly and it does everything I wanted it for.", "verified": true, "helpfulness": "1/1", "author": "Grannyred"}, {"rating": 5.0, "review": "Set up was a breeze since I'm not a \"tech-ie\" person, this alone warrants a 5 star.", "verified": true, "helpfulness": "0/0", "author": "Biker chick"}, {"rating": 4.0, "review": "I have a smart TV and several Roku devices. The fire stick is a great device! It is not perfect, but love the functionality and has all the apps I commonly use.Used this device in several hotels for work and vacation. It is a tremendous luxury to have the usual streaming services I watch available at my fingertips. Children were ecstatic when they discovered this in the hotel room.", "verified": true, "helpfulness": "1/1", "author": "ThatGuyLA \"Cajun Guy\""}]