[{"rating": 4.0, "review": "voice control on the app, but no echo support?note: I do not own this device 4 stars cuz it's the highest amount of stars I'd give it with no echo support.", "verified": false, "helpfulness": "0/0", "author": "Kyle brown"}, {"rating": 5.0, "review": "its a wonderful device when you can't find anything to watch on regular or cable tv, this is so handy, or if you want to watch an old movie or series  or missed one episote of any one series you can go back and pick it up.  Its a great thing!", "verified": false, "helpfulness": "0/0", "author": "Sally Simmons"}, {"rating": 5.0, "review": "Plugged it in located my network, entered my WIFI password an Voila it worked, being a Prime member get lots of stuff for free on the Fire TV. Love it.", "verified": true, "helpfulness": "1/1", "author": "Triode Mike"}, {"rating": 5.0, "review": "Love this, I don't ever watch regular tv anymore! plan on getting a second one for the bedroom! Highly recommend!", "verified": true, "helpfulness": "1/1", "author": "Patti"}, {"rating": 2.0, "review": "Doesn't respond fast to remote, crashes a lot and resets its self, loads content slow.", "verified": true, "helpfulness": "0/0", "author": "Tevin Blum"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Enrique"}, {"rating": 2.0, "review": "always getting connection issues", "verified": true, "helpfulness": "0/0", "author": "Maijed Babukr \"Max b\""}, {"rating": 2.0, "review": "I love the idea of the Fire Stick and thought it would be perfect for my daughter's room given the Disney, Netflix, and Prime Video options.Installation is simple and it's tiny.However... I could not get this thing to stay connected to the Internet. I tried reconfiguring our wifi, following every troubleshooting tip I could find via Google, and nothing worked. I am not ignorant with technology, and we have a myriad of other devices that work perfectly- this just didn't.", "verified": true, "helpfulness": "0/0", "author": "E. Johnson"}, {"rating": 2.0, "review": "I am a dedicated Amazon Prime member and I really want this device to work; for all of the reasons Amazon touts in it's adverts.  Unfortunately, it does not work very well and the static pops-glitches, flashing red lines and video drop-outs make it pretty useless.  I'm in the lengthy process of getting the issue recorded by Amazon who claim they've never hear of it before (they must not read these reviews) and a replacement sent to me.  This will take a great deal of my valuable time as it has many others who bought the Amazon Fire TV Stick.  If you are having this same hardware problem of say so in the comment section of this review.  It will be interesting to see how many people who's individual voices have not been heard....or ignored by Amazon.Update:  Amazon sent me a replacement and it has the same issues at the first.  I am going to try it on other Televisions to see if there is some issue with the model (Vizio) that I'm using, but so far, I'm not happy with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Andrew M. Spear"}, {"rating": 5.0, "review": "It was already loaded with my Amazon info. I've read reviews that say that the tv port has problems with the stick-well the tv in our bedroom is like 6 or 7 years old and it fit right in the hdmi even though I had something else plugged in right next to it. I'm still learning but so far so good. It is fast(very!) ,clear picture and easy to use or install apps u want.the remote it comes with works just fine no need to buy another remote in my opinion.I am really starting to wonder why there are so many negative reviews for this little lightning bolt in a stick...", "verified": true, "helpfulness": "1/1", "author": "DarciJoy84"}]