[{"rating": 4.0, "review": "Has great games for grand children to enjoy, thanks.", "verified": true, "helpfulness": "0/0", "author": "David Obaya"}, {"rating": 5.0, "review": "Great Product!!", "verified": true, "helpfulness": "0/0", "author": "ERNESTO HERNANDEZ MUÿOZ"}, {"rating": 4.0, "review": "Easy to install!! Love being able to watch Netflix on TV instead of my laptop!! Great assortment of movies", "verified": true, "helpfulness": "0/0", "author": "Kelly Williams"}, {"rating": 5.0, "review": "Love it for my \"dumb\" tvs.  Remote gets stuck sometimes. Not much to complain about. Love it !", "verified": true, "helpfulness": "0/0", "author": "bdubzz94"}, {"rating": 5.0, "review": "Amazing control of my Slingbox,  app only needs wifi for slingbox veiwing.", "verified": true, "helpfulness": "0/0", "author": "THEODORE JAMISON"}, {"rating": 5.0, "review": "I'm officially an old guy as I didn't know exactly what this did, along with Apple TV and other devices.We were using our Wii in this capacity where I think its a similar idea as the Fire TV Stick.Anyway, very easy to set-up and the simple remote is pure genius.  It feels great in the hand, and being so small we were afraid we would be losing it all the time.  We lose our \"big\" remotes but I think we are more conscious about the smaller remote and haven't \"lost\" it in the couch to date.The only thing I dislike is that its very sleek - but then you have to plug-in a mini USB to power it - not very clean in terms of looks.  So I think its a bit misleading to show the firestick plugged into the TV and you're thinking cool, but then then you have an unsightly wiring hanging out at a 90 degree angle from the stick.That aside, its very intuitive and easy to use.  I feel the picture we get is a much higher quality than the Wii we've been connecting to the internet/netflix/tv.  Love that its connected with our Amazon account so we can watch TV on our big flat screen in the family room easier than before (we had an adapter to our laptops to the TV).Its much easier to navigate with the small easy to remote than trying to point with the stupid Wii remote that 'wanders' unless you have a rock steady surgeon hands.Two Thumbs Up.", "verified": true, "helpfulness": "1/1", "author": "Shusaku Endo"}, {"rating": 1.0, "review": "My Smart TV has had trouble pulling up the Amazon Prime app ever since I got it, so I was really excited to get the Fire TV Stick as an inexpensive way to stream Prime. I was disappointed however, for not only did Amazon Prime stream slowly, but my TV couldn't recognize it was plugged in about 9 out of 10 times and the one time it did connect, it didn't recognize the charger being plugged in as it said there was no power source.", "verified": true, "helpfulness": "0/0", "author": "KingV"}, {"rating": 4.0, "review": "So far I'm loving the Fire Stick,  the set up was easy.  I'm using it mostly for my kids and it's great how many children's programs there are.I'd love to be able to watch my xfinity app but maybe that will come.  For now it's been a great purchase.", "verified": true, "helpfulness": "0/0", "author": "husni76"}, {"rating": 5.0, "review": "Totally plug and play.  Came preloaded.  love it", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 5.0, "review": "One of the best a/v purchases I've made. Simple to set up and use; works like a charm if you have a fast enough internet connection...", "verified": true, "helpfulness": "0/0", "author": "Michael Mcmillan"}]