[{"rating": 4.0, "review": "I bought this mostly to watch mlb. It performs well for everything but.. Constantly re buffering, and slow and spotty. Claims my internet speed is to slow. I have blazing fast speed and never have the problem on my Apple TV or roku. It could be mlb app problem or Amazon. I have read lots of people having the problem. Works great on everything else. If you have Comcast you won't get HBO to go. I am a prime member and enjoy all other features. I do however have the Fire T V on my big screen and there is no problem with it on MLB. So if you want to stream baseball get the Fire T V foe 99.00. Or apple t v for 69.00.", "verified": true, "helpfulness": "1/1", "author": "R.S.CASTORANI"}, {"rating": 5.0, "review": "Awesome device. This has really been a great thing for us from movies to music. Would buy again in a heart beat!", "verified": true, "helpfulness": "0/0", "author": "Donald Moody \"Cruisingram\""}, {"rating": 5.0, "review": "There were 3 things that made me try this item. 1) I was tired of paying for Microsoft Gold just to watch Netflix, 2) I was tired of my Roku 2 constantly losing connection and 3) It was half price for Prime members for a limited time. I fell in love with it. It's so easy to use and I never have problems with my connections as I did with the Roku 2. Amazon has upgraded it at least once since I've owned it. It is our go to for streaming. Really quick response time, nice menu for browsing with lots of option for streaming. I also purchase a lot of Instant Video content with Amazon so much easier to watch as I don't have to download 3rd party apps. For the price and content available on the Fire Stick, I highly recommend this to any first time streamers or those looking to replace Roku, AppleTV, Chromecast etc...We will purchase another Fire Stick or maybe a Fire Box for our second TV.", "verified": true, "helpfulness": "0/0", "author": "1CheekyLass"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Roderick Shivers"}, {"rating": 5.0, "review": "I truly love the Amazon fire stick", "verified": true, "helpfulness": "0/0", "author": "lakeisha Brown"}, {"rating": 5.0, "review": "Six moths and still working as it should. I installed XBMC on it and it also works great!This devise is also compatible with Toshiba's REGZA link. That is, I actually use the Toshiba Remote control to control it and works better than the stick control.On my Panasonic TV, the Viera link does not recognize the fire stick! Still a 5 star though.", "verified": true, "helpfulness": "0/0", "author": "Harry"}, {"rating": 1.0, "review": "I didn't realize movies would cost more to rent than Suddenlink or I would never have bought this.  I will be cancelling my Amazon Prime account in April.", "verified": true, "helpfulness": "0/0", "author": "Brenda Brummal"}, {"rating": 4.0, "review": "Is really nice to use it without having to send the signal from a device (like you do with Chromecast). The remote is easy to use and intuitive.", "verified": true, "helpfulness": "0/0", "author": "Olman Vargas B."}, {"rating": 3.0, "review": "Audio won't work with my sound bar. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Matthew Christians"}, {"rating": 5.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "Marsha A. McFayden"}]