[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Barbara A. Hoffman"}, {"rating": 5.0, "review": "bought this because the pre-order price was great, and I was not disappointed.  It's nicer than my roku, and I like that I can use my kindle as a remote if I can't find the remote, which is more often than I'd like with two kids in the house.  It loads faster, and the remote is more responsive than the roku player I have.", "verified": true, "helpfulness": "0/1", "author": "sarahy207 \"sarahy207\""}, {"rating": 5.0, "review": "We are realt enjoying it.Works very well.", "verified": true, "helpfulness": "0/1", "author": "Dale Markel"}, {"rating": 5.0, "review": "Good product and on time delivery!", "verified": true, "helpfulness": "0/1", "author": "elaine"}, {"rating": 1.0, "review": "I started out giving it a 5 star review due to the cost of when I bought it. After using it for almost two months I have subtracted stars as follows:-2 star: Randomly drops wifi signal. The device is less than 10 feet from my router and in about the same general area as my Wii so clearly not a router issue when I can access my router a block away with my phone and in my backyard with any of my tablets or laptops. (I have three antennae on my router). Secondly the reason I know it's not my routers is due to the fact that I have to keep re-entering the WiFi info like router name and password.-2 stars: Incredibly poor video quality on Netflix and Amazon Prime. By this I mean that when trying to watch a standard TV series it pauses, stutters, jerks and comes up with discoloration and random decompression artifacts. I'm on a 50+mb/s internet connection so it's not my wireless. No other wireless device in my home has this issue. Let me repeat, NO OTHER DEVICE HAS THIS ISSUE! Not my 4 android tablets, one of which will stream 1080P all day long and one being a Kindle Fire HD, not my iPad mini, not my 3 phones, not my two laptops, not my Wii, and definitely not my two desktops which one is connected by LAN.-1 star: Requires an unplug and wait 2 minutes for it to cool down after about an hour and half to two hours of watching, or more than 5-10 minutes paused video. This is really annoying, my Wii will play all night long on Netflix without complaining. The Fire Stick will start stuttering jerking, pausing and then totally and completely freeze solid not more than one or two episodes in to a series, or about the end of a movie. I've gotten in the habit of just keeping it unplugged and then plugging it in just before I turn on the TV. This will allow me to get through most movies and maybe two or three short episodes of a TV series (read 2 or 3 episodes of that 70 show).+1 Star for the large selection of movie apps. If only half of them worked for more than an hour or two.Other thoughts:I'm a geek, seriously a geek. I have a Kindle Fire HD, Samsung Galaxy Player 4.0, Samsung Galaxy player 3.0, 2 x LG L9's, Nexus 5, Samsung Galaxy Tab Pro, Toshiba Thrive tablet, Acer Iconia, Ipad Mini, and probably another few tablets and WiFi devices that I can't remember off the top of my head. I have never had such poor performance from a modern day device as I've had with the Fire TV Stick. If I could buy it again for under $20 bucks I might consider it. I \"might\" consider it. I've given it several months to prove itself and I've come to the conclusion that my next streaming device will either be a Roku or Chromcast. This thing is just so much headache to get a good evening worth of video watching it's not worth the money. I figure my time at work is worth about $50/hr give or take. Spending a half hour on this piece of junk every weekend to get it to stream smoothly blows whatever saving I might have had out of the water.Save your money and move on.Notes to comments that are sure to come:1. Yes I'm using the official power supply that came with the Stick.2. No, I'm not using any unofficial side loaded apps.3. No, I have not hacked it to sideload apps yet. (I usually wait 3 - 6 months to get a solid bench mark of the \"vanilla\" device before tinkering).4. Yes, I have spent hours troubleshooting the WiFi to definitively rule out the router as being the source of the problem.5. No, I'm not using any HDMI extender cables that might be causing an impedance issue.6. Yes, I let it sit for several minutes when restarting it.7. Yes, I've tried unplugging it before usage to rule out power drain overheating.In summary, if it worked the interface and selection of movie apps would win it a 5 star review for me. Unfortunately the amount of tinkering and finicking I have to do with it on a weekend basis ruins it and demotes it as nothing more than a novelty media device for me and hence gets a 1 star review.", "verified": true, "helpfulness": "3/3", "author": "The Wise Fool \"Sambion\""}, {"rating": 3.0, "review": "This unit buffers a lot. I haven't watched a show where it didn't pause to buffer. I have cable Internet, fast, my PS3 works fine, the computer has no issues, the fire stick can't keep up with my shows", "verified": true, "helpfulness": "0/0", "author": "joecrow"}, {"rating": 5.0, "review": "Fantastic UI, both in layout and snappiness. Given the size of this thing, I expected it to be a little sluggish. One UI item in particular: rewind/fast-forward. The speeds are perfect, and again no sluggishness or delay between scrubbing through content and returning to playback.Having the unit pre-registered to my account was very much appreciated. Nothing worse than having to type out username/password info using an onscreen keyboard.", "verified": true, "helpfulness": "0/0", "author": "William Pallies"}, {"rating": 5.0, "review": "First day within an hour all set up and running perfectly.  I only wish there was a picture of the buttons before the introduction video.  I highly recommend it mechanically easy to set up.Marcel", "verified": true, "helpfulness": "0/0", "author": "Kathy A. Szal"}, {"rating": 5.0, "review": "Easy to connect and works great.", "verified": true, "helpfulness": "0/0", "author": "John Bennett"}, {"rating": 5.0, "review": "Great gift and almost a nessecity to your tv. By simply buying this device you can make any tv into a smart tv. The video quality is excellent as expected with an amazon product.", "verified": true, "helpfulness": "0/0", "author": "Unhappy customer"}]