[{"rating": 2.0, "review": "I bought first one during prime promotion.  Frustrated to find out that shipping date is Jan 5, 2015 after purchased. BUT, it was available at Staples and BB last week. I can't wait and purchased another one. I was hoping since it is Miracast certified device, I could 2nd screen my Windows notebooks or Tablets. But I could not add as a 2nd screen from 4 different Intel based mirror cast capable Windows notebooks, tablets.", "verified": true, "helpfulness": "2/4", "author": "Ninjago_4445"}, {"rating": 5.0, "review": "Wonderful system", "verified": true, "helpfulness": "0/0", "author": "O's Ma \"Lisa\""}, {"rating": 4.0, "review": "What a pleasant surprise!  This stick actually made viewing movies on TV much more enjoyable - almost no buffering.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "MARC R TURGEON"}, {"rating": 5.0, "review": "*update 9-7-2015The stick now has a problem where if you pause a show and let it go to the screensaver or black screen it loses the resume position and usually resumes way earlier in the show- at least a half hour. I've tried clearing data and rebooting the device but it keeps doing it. We need a software update.*previous review*Preordering the stick was kind of an impulse buy (especially at the $20 it was going for at the time). I'm really glad I did though. I can finally watch prime videos in HD which has always pissed me off about having to watch on my laptop in the past. The remote, which I didn't care about when ordering has become a great feature of the stick. Overall I'm incredibly happy. Would I feel the same way if I had paid full price? Possibly. I definitely like just as much as, if not more than Chromecast- it certainly has unique features that set it apart from that.To anyone on the fence I say definitely pick it up if it goes on sale again. It makes paying for Prime all the more attractive.", "verified": true, "helpfulness": "0/0", "author": "kinetikx"}, {"rating": 4.0, "review": "i had the chance to pre-order this as part of my prime membership as it was significantly discounted.  I wanted something for our bedroom tv that we did not have a cable line, but have wifi.  We are an apple tv house otherwise, but for the price figured i would try this out before buying another appletv.  Prior to this I used the excellent amazon video app on my iphone to airplay any prime content that we couldn't find on netflix via our appletv's.  It's nice that this can do it all natively.  it's very quick and UI is similar to all amazon things, which is quick and easy to get around.  It's about the size of an old school USB memory stick and does come with a dongle if you need a different angle to plug it all in.  Overall the device is outstanding, the 4 stars are really more nit picks than anything else.  E.g. No airplay from our phones (but I think on android it should be fine) I don't like the forced watch the intro video, the initial update process wiped the wifi connectivity so had to do it all again, the remote is too thick and not as ergonomic (cost driven I'm sure).  Overall would highly recommend it, i prefer it more than the roku 2 I also have but don't use anymore.  This is a keeper.the", "verified": true, "helpfulness": "0/0", "author": "MB \"MB\""}, {"rating": 5.0, "review": "I just got my new Fire Stick on Saturday. I already have Fire TV but this is a lovely compliment to that device. I have the Fire TV on one TV and the Fire Stick on the second TV set. This is so convenient because I don't have to move the device around. I love the remote but I believe I will have to buy another one for the stick because I like the voice remote so much.( I got spoiled) The stick is very easy to install and use. If I can do it anyone can. Amazon technology to me is just awesome for the price. Now to be fair it is very close to the Fire TV but it is a great inexpensive way to turn all your TVs into Fire at a very nice price. I am very pleased with this purchased and I would buy it again.", "verified": true, "helpfulness": "1/1", "author": "redsilk46"}, {"rating": 1.0, "review": "So I buy this thing thinking I will be able to watch a few programs that I don't get on my cable lineup. I click on ESPN, I am told to go to my computer enter http://es.pn/firetv, I then type in a code that was shown on the FireTV screen and I am told to watch the show that I wanted to check out. I click on the show, a screen pops up telling me that I am not subscribed to that channel and to contact Commiecast to pay an extra $100.00 a month so I can have ESPN. So why do I need this Fire Stick if I already have ESPN in my channel line up?  I can get all of the Prime channels on my WiFi Blue Ray player.This thing is going back!", "verified": true, "helpfulness": "0/8", "author": "D. RISNER \"donphi\""}, {"rating": 5.0, "review": "I had a roku several years ago and liked it, but now that I have given up cable, and am a prime member, I thought this would be nice to use in my studio that doesn't already have a streaming device like a PS3. I haven't had any problems with buffering and the quality of interface is quite nice and easy to use. If you had someone who wasn't tech savvy, I think this would be very nice and easily learned. I picked this up on an amazon special for about half of the current price, and at that rate this was a nice impulse buy.If you are going to take the plunge and go cable free and can't stream via a gaming system and don't want the hassle of hooking up to a computer, this is a quality product. I can't speak to the gaming capabilities of this, but I do think this could also be a nice feature for the non-gamer who wants a little bit more out of their TV than movies and internet radio.If you can find this under the thirty nine price, snap one up, but even at full rate, still a happy buy.", "verified": true, "helpfulness": "1/1", "author": "The Beetz \"Chris\""}, {"rating": 2.0, "review": "The ui is not good and very slow.", "verified": true, "helpfulness": "1/2", "author": "J. Vin"}, {"rating": 1.0, "review": "Bought this thing on the first day it was available. Love the remote, love the interface, CAN'T STAND the constant buffering. I have 50Mbps Internet and the modem is less than 12ft from the stick.Taking it back to Best Buy tomorrow!", "verified": true, "helpfulness": "1/6", "author": "Brad Gramlin"}]