[{"rating": 5.0, "review": "Great option to make a dumb tv smart", "verified": true, "helpfulness": "0/0", "author": "Tim Hackbart"}, {"rating": 3.0, "review": "So far we like the Fire stick. Update: We had to send our first Fire stick back.  It just quit working.  Not sure why.  We are trying a second one because we really like what it has to offer,but will update this post as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Leila \"B\""}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am a techie and like to tinker around with my devices while my family just needs simple interface. Fire tv stick  fits both bills. I was disappointed when hbo go (I have xfinity) didn't work. But with fire tv's android interface, some apps can be sideloaded. I have bluetooth and a hp z6000 mouse connected to use sideloaded apps. Completely satisfied. Good job amazon.", "verified": true, "helpfulness": "0/0", "author": "RoBhat \"RoBhat\""}, {"rating": 4.0, "review": "didn't expect it to be so good", "verified": true, "helpfulness": "0/0", "author": "Zoe Escobar"}, {"rating": 4.0, "review": "Overall the Firestick is great as it allows you to make any TV with USB a smart TV. The apps work well and pretty much seamlessly. The one issue I have is that the remote is a little flimsy. It's really easy to press too hard while maneuvering which causes the selection to jump more than one space, or in my case 5 or 6 spaces.  Just press gently on the remote and it should remedy this issue or so it seems.", "verified": true, "helpfulness": "0/0", "author": "JWH"}, {"rating": 5.0, "review": "Luv it!", "verified": true, "helpfulness": "0/0", "author": "Gerald H."}, {"rating": 5.0, "review": "Great price works verry good cant beat that", "verified": true, "helpfulness": "0/0", "author": "john quinones"}, {"rating": 5.0, "review": "I absolutely love it! Easy to use  and fast set up!!!!", "verified": true, "helpfulness": "0/0", "author": "sharayha moore"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "John F."}]