[{"rating": 5.0, "review": "I really enjoy the extra media", "verified": true, "helpfulness": "0/0", "author": "Margaret Pryor"}, {"rating": 4.0, "review": "Easy to use and clear pictures", "verified": true, "helpfulness": "0/0", "author": "kathy mcmahon"}, {"rating": 1.0, "review": "keeps downloading over and over again , then says error try again. I would not recommend this fire stick.", "verified": true, "helpfulness": "0/0", "author": "Sue H."}, {"rating": 5.0, "review": "It's awesome makes my dumb flat screen a smart TV :)", "verified": true, "helpfulness": "0/0", "author": "Delora"}, {"rating": 1.0, "review": "Well, I bought this following the ad that Fire Stick can travel with you overseas.  Following Amazon's instructions, I switched the device to Germany during our vacation and guess what, - it only shows content in Germany in German!  Perhaps Amazon should throw in Rosetta Stone with their Stick and warn customers that when they claim \"take your TV anywhere with you\", they are overselling it just a little bit.  Also, customer support on Fire Stick is abysmal, no one within that department knows what to do.  I had to call 3 times to even get my Fire Stick to work in Germany, only to find out that none of the content is actually in English.  Disappointment.", "verified": true, "helpfulness": "0/1", "author": "S. Mammadov"}, {"rating": 5.0, "review": "I have had this device for one week and I thoroughly enjoying. Easy to install and so many choices. Thanks Amazon for another great device", "verified": true, "helpfulness": "0/0", "author": "Zoe Bush"}, {"rating": 5.0, "review": "Does what it says it will do. I have access to Sling TV in another room now, as well as Amazon Prime Video of course. It's small, out of the way and does what we need.", "verified": true, "helpfulness": "0/0", "author": "N. Santilli"}, {"rating": 2.0, "review": "Still haven't used it.  Didn't work right for me.", "verified": true, "helpfulness": "0/0", "author": "Aunt"}, {"rating": 5.0, "review": "I got this device for travel. I hooked it up in our motel room for the first time and it worked GREAT!! All of our own movies, shows and games right there!!  If you have to log in to the wifi, just start the process and be patient for the login page to pop up.", "verified": true, "helpfulness": "0/0", "author": "Michelle Holden"}, {"rating": 4.0, "review": "I wish I could use Fire TV to dump my cable.  While there's a lot on content, often times what I really want to see is an extra cost, even with my Prime Membership.  I find it easier to search online and add items to my watchlist than doing it through the Fire TV stick.  That way it pops up when I open Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Induetime"}]