[{"rating": 5.0, "review": "I can't say enough about this.  Small form factor that packs a punch.  I have had other types of \"smart\" devices that hook up to the tv, but this by far is the most intuitive.", "verified": true, "helpfulness": "0/0", "author": "bidaw"}, {"rating": 4.0, "review": "None", "verified": true, "helpfulness": "0/0", "author": "Sheila Griggs"}, {"rating": 5.0, "review": "Love this !!!!  easy to set up, works great ...cannot be happier", "verified": true, "helpfulness": "0/0", "author": "carolyn      chiaro"}, {"rating": 4.0, "review": "I have a problem because I do not seem to have a Network password.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Simplicity in a stick. Plug it in and pair it with your Wi-Fi. Excellent picture and sound quality. There is so so much content to chose from and if you're a prime member most of the content is free. I and I bet you really like free. Don't hesitate, just spend the $39.99 and enjoy.", "verified": true, "helpfulness": "0/0", "author": "William F. Weidman"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Emily R Casey"}, {"rating": 5.0, "review": "lots of fun", "verified": true, "helpfulness": "0/0", "author": "Patricia Groves"}, {"rating": 5.0, "review": "Love it!  I am a Kindle lover and have had a Prime membership for two years.  Now my family is raving about all the shows and movies they can watch for nothing.  You can get rid of your HBO and Showtime cable costs if you don't mind waiting for a season to be available with the prime membership.  You can play games too but I haven't purchased the controller - maybe at some point I will.  Another Amazon plus!", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 3.0, "review": "I wish it could work on a laptop. I wish it could draw power form the device that it plugs into. Pretty difficult to draw power when using it in a hotel room. I wish it had HBO2GO", "verified": true, "helpfulness": "0/0", "author": "Cyrus"}, {"rating": 1.0, "review": "My internet service is too slow for the Fire TV Stick to work. Big disappointment.", "verified": false, "helpfulness": "1/2", "author": "Judy Johnson"}]