[{"rating": 4.0, "review": "So far the stick has been working great, easy set up, wish it had more old school Kung fu flixs..bt a great buy for the price...", "verified": true, "helpfulness": "0/0", "author": "DAVID REED"}, {"rating": 5.0, "review": "and was super easy to get up & running, you can use an app for voice commands if preferred over the remote... Either way, this device is great.", "verified": true, "helpfulness": "0/0", "author": "pegs"}, {"rating": 4.0, "review": "Very easy to operate and the picture quality is great.  Works great for watching Amazon instant Video on a Sony TV.", "verified": true, "helpfulness": "0/0", "author": "dave finkelstein"}, {"rating": 1.0, "review": "This seems to be a piece of crap. I cant' seem to get through a show without having it freezing up and requiring a reboot. Phone tech help was useless.", "verified": true, "helpfulness": "1/2", "author": "Craig Friesinger"}, {"rating": 5.0, "review": "This makes my regular tv work just as a smart tv, it saves me money from buying a whole new smart tv.", "verified": true, "helpfulness": "0/0", "author": "Toni81"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Kevin Stough"}, {"rating": 3.0, "review": "Has all the apps I need.  Navigation performance could be better.  The device locking up and having to power cycle, is it's major draw back.  You can reset from the remote, but having to reset at all frustrating.  I used a PS4 for streaming before trying the fire stick.  My experience with the PS4 has been much better.", "verified": true, "helpfulness": "0/0", "author": "Mike Bostrom"}, {"rating": 5.0, "review": "I have this and the Roku - I like the Fire Stick better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Easy to hook up.  Movie selection is great.  PERFECT!!", "verified": true, "helpfulness": "0/0", "author": "Lynn Goins"}]