[{"rating": 5.0, "review": "Love, love, love it!!", "verified": true, "helpfulness": "0/0", "author": "Mary Parrish"}, {"rating": 1.0, "review": "Had to return it. It was defective. Even online tech couldn't make it work.", "verified": true, "helpfulness": "0/0", "author": "margie"}, {"rating": 5.0, "review": "Awesome love it so much  that. I'm buying one for my daughter  Mother's Day gift.", "verified": true, "helpfulness": "0/0", "author": "Yvette Thomas"}, {"rating": 5.0, "review": "Fast performance. I mostly use these type of devices to access Youtube. I also use Google TV and Roku. The Fire Stick has superior performance above the Google TV and Roku when it comes to Youtube. It loads YT videos quickly and performance is very stable...virturally no buffering and clear automatic full screen. Very satisfied with performance of this device. Although...I experienced very poor performance with loading Amazon movies and with buffering of Amazon movies. Also had bad experience with Amazon movies on GTV but not Roku.", "verified": true, "helpfulness": "0/0", "author": "Mark Betancourt"}, {"rating": 4.0, "review": "It's not as reliable as the AppleTV but I love having access to the AmazonPrime content.  Super easy to install.  Love having access to Netflix. It is on a secondary TV that is not used as frequently as our main television.", "verified": true, "helpfulness": "1/1", "author": "S. Benefiel"}, {"rating": 5.0, "review": "This product is amazing!", "verified": true, "helpfulness": "0/0", "author": "Judy Smith"}, {"rating": 5.0, "review": "really keeps my granddaughter's favorite shows at a touch and I get mine when she not here, love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "fatpatdoyle"}, {"rating": 5.0, "review": "Love my Fire TV!  Have both the stick and the box.  Bought the box and wanted to see how the stick worked too, so bought it, it worked great - and now it's with my sister.  I've tried Netflix and others, but I just like how Amazon organizes things.  I can always find things to watch for free...and this is seriously making me think about cutting out cable.  I think this with something like Sling, maybe HBO to Go and a solid internet connection, and that could easily cut my cable bill 3/4s. (and you can access those others from the fire TV).The only negative -- and it's a nit really -- is that I wish there was a way to watch something like a series without having to access each episode as the prior one ends.  I wished it just loaded each episode after the prior one finishes until you tell it to stop.  Maybe it can be done and I just haven't figured out how to do it?", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 5.0, "review": "this was so easy to use - and it came preloaded with my amazon prime information installed ready to go. highly recommend", "verified": true, "helpfulness": "0/0", "author": "ctorino"}, {"rating": 5.0, "review": "This is awesome! I'm able to stream netflix and my home plex server", "verified": true, "helpfulness": "0/0", "author": "Stuart A Hertzig"}]