[{"rating": 1.0, "review": "It has not meet any of my expectation. Damn slow take infinite time for buffering though I am using high-speed internet (Comcast Xfinity blast). I tried doing trouble-shooting with Amazon but the only suggestion I received is restart the fire tv stick or reset it to factory settings. I have tried the same plenty of time but the result is the same. I am planning to return it.", "verified": true, "helpfulness": "0/0", "author": "Tapas K Saha"}, {"rating": 4.0, "review": "I LOVE my Fire Stick, and would encourage anybody else to get one. It actually does everything the Fire Box does (my extended family has one.) It is snappy in response, downloads apps quickly and efficiently, and can run more than one app at a time quickly. Don't expect any sluggish behavior. Also, the Fire Stick literally took about ten minutes to set up, which is almost a miracle for technological purchases. But, the only reason I give it for instead of five stars would be the shortage of apps. Obviously the Fire Stick has the basics: Hulu Plus, Netflix, Pandora, iHeart radio, and Fire Weather, but it is lacking in the app library. I wish that they had the ABC WATCH app, and a few others. Also, I was frustrated to find that the mirroring option didn't work with my Kindle Fire HD6, claiming you need an HDX our higher--so if you're planning on mirroring with your device, don't count on it working. But overall, the Fire Stick is an awesome purchase, and I would recommend it to anybody--storing your movies and shows on the Cloud is extremely efficient, and the apps work great! And just add I side note, or don't even have Prime, and it still works great for me!", "verified": true, "helpfulness": "1/1", "author": "William Clark"}, {"rating": 1.0, "review": "Just buffers and buffers..have really not been able to load a movie...Apple much better", "verified": true, "helpfulness": "0/0", "author": "Mary Jamison \"barrymary\""}, {"rating": 5.0, "review": "I absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Kendrall Davis"}, {"rating": 5.0, "review": "More than met my expectations. It is ludicrous to have  Prime membership without having the access Fire TV Stick provides.", "verified": true, "helpfulness": "0/0", "author": "Pete \"Pete\""}, {"rating": 5.0, "review": "We love the firestick!  It is so easy to use, and has tons of apps, access to TV shows, movies, new releases, games, etc.  The ability to download the app to your phone and control it from there is also a great feature!  Easy to set up - even if you are not tech saavy!", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 4.0, "review": "easy to connect still getting use to the remote.", "verified": true, "helpfulness": "0/0", "author": "Charles Sunley"}, {"rating": 4.0, "review": "I'm really impressed with this streaming tool.  The setup was easy, and the menu navigation is very intuitive. I easily linked my Amazon prime, pandora, YouTube, and Netflix accounts.  However, the preloaded HBO Go app is not the same as the HBO Now app, so I was unable to use my HBO Now streaming service, which is a major disappointment.  I would recommend this gadget for anyone looking to link their TV with streaming app services.", "verified": true, "helpfulness": "0/0", "author": "Stephen Sapienza"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Matthew S. Fisher"}, {"rating": 5.0, "review": "Works easily. Comcast/Xfinity doesn't allow some features because they are EVIL!", "verified": true, "helpfulness": "0/0", "author": "Yvonne Leach"}]