[{"rating": 5.0, "review": "Love my Fire Stick, I own a ROKU and enjoy that but the Fire Stick is great as well.. My kids love the games and it works great with Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Lender99"}, {"rating": 5.0, "review": "Very easy to use. Like it better than roku stick. Will recommend if you have a non smart tv.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Robles"}, {"rating": 4.0, "review": "Bought this to replace my \"smart\" bluray player that was sitting on my fireplace mantle where my tv is mounted over the fireplace.  I love how small this thing is.  About the size of a thumb drive and it plugs right into the back of the tv.  No wires and no more bluray player sitting on my mantle.  So far the streaming performance has been better than that of the bluray player.", "verified": true, "helpfulness": "0/0", "author": "J. Hallen"}, {"rating": 2.0, "review": "They only offer a few of the movies I like to watch. Lots of stuff I don't care about.", "verified": true, "helpfulness": "0/0", "author": "Michael R. Todd"}, {"rating": 5.0, "review": "Streams great. Only wish you could add more apps.", "verified": true, "helpfulness": "0/0", "author": "Rebecca B."}, {"rating": 4.0, "review": "So far, after a week or two of use, pretty happy with the Fire Stick. I like the small size and low power usage. Had no problem hooking up to home network and accessing web content. I was also able to sideload the kodi media player to access media files on the home network. Menu responses are snappy and the included remote is functional. I see a recent firmware update made playing the next episode automatic in Netflix, etc. I haven't seen a way to make that optional. Apart from that, very satisfied.", "verified": true, "helpfulness": "0/0", "author": "TexBrit \"Martin\""}, {"rating": 5.0, "review": "Great product! Bought for wife at Christmas and she loves it", "verified": true, "helpfulness": "0/0", "author": "rwebster"}, {"rating": 5.0, "review": "Had no issues other than having to buy a splitter and HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "George Dryden"}, {"rating": 5.0, "review": "Before using the Fire TV Stick, I couldn't imagine a technical device that worked so easily--but this one did. In literally minutes, my family was able to access previously unknown series, movies and shows on an expansive network.", "verified": true, "helpfulness": "0/0", "author": "Grady Mogle Davis"}, {"rating": 5.0, "review": "very nice and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Mark W. LaVassaur"}]