[{"rating": 1.0, "review": "For some reason not able to connect toy TV. For some reason notAble to recognize my wiifii", "verified": true, "helpfulness": "0/1", "author": "Christina Hladek"}, {"rating": 2.0, "review": "When it works, it is an amazing unit for the price tag. But it shows random tv static for like 5 seconds every 30-60 min. Plus randomly shows a blue screen showing \"unauthorized HDCP content\".I would expect such performance from a chinese un-branded unit. Not an Amazon Product.", "verified": true, "helpfulness": "1/1", "author": "Matias Ortiz"}, {"rating": 5.0, "review": "It needs a built in option for streaming from my network storage.", "verified": true, "helpfulness": "0/0", "author": "adam sleeger"}, {"rating": 5.0, "review": "Great item, great price", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "I absolutely love fire tv. I also have hulu plus along with Amazon prime. I did a 6 month review before canceling verizon fios and going with fire tv. My only gripe is I dont think I have enough bandwith. I currently have 2 fire tv boxes, and 3 fire tv sticks, with 1 other smart tv. Thats a total of 6 streaming tv's, 1 laptop,  1 computer, 3 tablets, and 2 cell phones. I currently have fios 75/75 internet speed. Once I connected my 6 tv's, ive notice things now take forever to download. I never have more than 5-6 devices working at the same time, but I may have to up my internet speeds to handle everything. I do get some pauses every now and then but no real buffering issues. Im kind of surprised its held up this well so far. But that has nothing to do with Fire Tv! Just an idea how much bandwirh youll need.", "verified": true, "helpfulness": "0/0", "author": "Julian Wilson"}, {"rating": 5.0, "review": "Love this !  Makes streaming things all around my house so much easier!  I recommend it to everyone!", "verified": true, "helpfulness": "0/0", "author": "Lisa Inman"}, {"rating": 5.0, "review": "Easy to install, easy to maneuver around the home screen, just what I expected.", "verified": true, "helpfulness": "0/0", "author": "Andrea K Jones"}, {"rating": 3.0, "review": "This is not a review.  I do not own and have not used one of these devices.  There is no option to ask questions about this device, so I had to ask mine in the review section.  I am considering getting this device and need to know how people set up a headphone and what kind of headphone with an HDTV & Amazon Fire TV Stick.  I haven't bought techno gadgets in quite a while and don't know if the headphone transmission would interfere with the streaming.  I don't want to use headphones which connect with a wire.  I don't need a full entertainment center or loud sound, but the headphones are important to me.  I couldn't get this posted without posting a star rating, so please ignore that part of this post.  Don't know how to get word out to Amazon that headphones are important adaptations for some with disabilities.  Thank you.", "verified": false, "helpfulness": "0/1", "author": "S. R. Israel"}, {"rating": 5.0, "review": "Coolest thing ever!!! My daughter loves this.  We are canceling cable TV soon and will be purchasing more of these.", "verified": true, "helpfulness": "0/0", "author": "K Jones"}, {"rating": 4.0, "review": "It was very easy to hook up and figure out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]