[{"rating": 4.0, "review": "For a cheap streaming device I really like the fire stick.  I have the Roku2 and Roku3, and I feel like The Fire stick is just as good as my Roku 3.  There are some features that I prefer on the Roku like the slingplayer channel for my sling box, and I really love the audio out jack on the Roku remote.  However For $40 the fire stick is pretty darn good.Here are some of the pro's of the fire stick:-Very small footprint.-easy to use and setup-access to a bunch of prime content as well as other channels such as plex and netflix-side load of some android apps is possible-seems impressively fast given the small size-Voice feature still can be used with fire remote app via your smart phone.Some of the Cons I've found from using a couple of days:-The Remote control for the stick seems to not work well.  Nav buttons are starting to stick and cause unwanted scrolling-It can sideload apps however I don't think it has the power to run most of the ones I attempted, or the app doesn't work properly-Although the front end is very visually pleasing, you can't modify the layout or customize what you see on your home screen-Sideloaded apps are not accessible via your apps on the home screen. Have to go through settings->applications-> manage all apps to access them.-Home screen overloaded with amazon prime content (I guess no way around that given it's made by amazon.)Overall I'm extremely happy with it.  If the remote worked extremely well I would have given it 5 stars.  I got the 19.99 pre-launch deal so It was a no-brainer purchase.  Now I'm considering making the switch to Move my Roku 3 down stairs and get a full blown fire TV unit for my main viewing area.  I currently have 3 TV's in the house.  I would most likely keep my roku3, keep the firestick, and potentially replace my Roku2 with the Fire TV unit.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Morton"}, {"rating": 5.0, "review": "Got it early than expected. Easy to operate and set up.", "verified": true, "helpfulness": "0/0", "author": "Sam72 \"Sam\""}, {"rating": 5.0, "review": "Easy to setup and even easier to use. We have enjoyed the Fire TV Stick quite a bit since we received it, and it was delivered earlier than we were expecting as well!", "verified": true, "helpfulness": "0/0", "author": "TheLaw"}, {"rating": 5.0, "review": "This product is awesome! I bought it on a whim on Black Friday. It was discounted to $25, and I thought why not? It has basically turned my TV into a smart TV. I mainly use this for Netflix, which is great and easy to browse, and Spotify. I love Spotify, and the fact I can sync it up to my TV using my phone is AWESOME! I highly recommend this product, in fact after I bought it, I loved it so much I went back to buy some as christmas presents for the tech-savvy people in my life. :)", "verified": true, "helpfulness": "0/0", "author": "Bailey"}, {"rating": 5.0, "review": "Plugged in.  Switched AV input to it.  Bingo.  Setup was easy and in my limited experience so far, it has been reasonably fast and video has streamed without a hitch", "verified": true, "helpfulness": "0/0", "author": "ROY WINTERS"}, {"rating": 4.0, "review": "Still working on it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this is a great little device will turn your dumb TV into a smart TV. Has more apps than any other device of its kind, it's small and easy to use. The setup took less than 3 minutes. I would recommend this to friends and family", "verified": true, "helpfulness": "0/0", "author": "Charleneperez"}, {"rating": 4.0, "review": "This thing is pretty cool.  I have it plugged into an Onkyo receiver, which is connected to a projector. I'm happy that worked well. It was so easy to get it going. I think it took almost 5 minutes to set up & I'm sure that was because my internet is slow. At any rate, I can finally play my music in the living room. I do wish it would play ALL of my music, as opposed to the same 15 albums.The Amazon mobile app to use as a remote is...unimpressive. But I'm finding that using my phone with other apps is pretty cool. Not sure they should tout the games. Most of them cost money and none of those are actually worth playing with the remote.This thing has made my Blu-Ray player obsolete. I only use that for the apps and this has all the same apps that I use. My Xbox is only going to be play games again.", "verified": true, "helpfulness": "0/0", "author": "Anika Malone \"Anika Malone\""}, {"rating": 4.0, "review": "Fast. There is possibility to sideload apps. It will be nice to have ability to connect BT devices: keyboard, mouse.", "verified": false, "helpfulness": "0/1", "author": "Andy Lyakhovetskiy"}]