[{"rating": 5.0, "review": "Gave as a gift.  They loved it.  I had one already, and love it.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline E. DeSarro"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Karen Crowell"}, {"rating": 5.0, "review": "We love this Fire Stick! It works amazing and is very compact! I would reccimend this to everyone. I was also able to download the firestick app to my phone and use my phone as a controller to it. That works great as well and very convenient!", "verified": true, "helpfulness": "0/0", "author": "C. Bochette"}, {"rating": 5.0, "review": "This is the second one we have purchased since we were moving the first one from one TV to the other. They both work great. I use the FireTv app and they are both listed And accessible.  Great product", "verified": true, "helpfulness": "0/0", "author": "Heidi Darby"}, {"rating": 5.0, "review": "I love it! The digital quality is so nice, its fast and works way better than my smart tv and I prefer it to the dvd player with apps. We initially bought it for the upstairs tv in the guest room where there is no cable connected or anything, but we use it on our main TV all the time because we like it so much", "verified": true, "helpfulness": "0/0", "author": "SRO"}, {"rating": 4.0, "review": "I really LOVE my Amazon Fire TV Stick... when it works. I don't think it's an issue with the Fire Stick, but with my wifi network, at times. In any case, the pro's outweigh that con. I love getting the content available with my Amazon Prime membership. Using it on my kitchen TV.", "verified": true, "helpfulness": "0/0", "author": "VA Mom"}, {"rating": 5.0, "review": "As always Amazon comes through!Shipping, packaging, function and quality are excellent!Thanks Jeff and team!", "verified": true, "helpfulness": "0/0", "author": "Richard White"}, {"rating": 2.0, "review": "We absolutely loved our FireTV stick when we got it. The menus are easy, there are a ton of apps, and it allows you to play music from your Amazon library. However, we had two serious issues:1. After a week or two, there were constant connectivity problems. Movies were super blurry and sometimes the connection dropped out completely.2. The stick itself was incredibly hot to the touch. We tried using it plugged directly into the TV, and using the extension, but it didn't make a difference. It was very unnerving.After the first discussion with customer service, they sent us a replacement. When the second one did the same thing, we just asked for a refund. Such a bummer because we loved it. We just wish it worked for us. The customer service agent suggested it was a problem with our set up, but other reviewers seem to have the same issue. Maybe they'll work it out and release a second generation.", "verified": true, "helpfulness": "0/0", "author": "avidreader89"}, {"rating": 5.0, "review": "Love it! There are new things added everyday. The battery cover on the remote is a little hard to take off, but I just love that I can access all my favorite video sites", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Love this! Now I finally have a Smart TV!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth B. Regan"}]