[{"rating": 1.0, "review": "not at all what it says it is.. Worst thing I have ever purchased on amazon.", "verified": true, "helpfulness": "0/0", "author": "Thomas Heil"}, {"rating": 5.0, "review": "This is an excellent product for the price. It's low powered easy to install and has all the common apps. No latency issues with WiFi. I'm using 5GH  which is short range and the connection is solid, Again, great buy.", "verified": true, "helpfulness": "0/0", "author": "E. Green"}, {"rating": 3.0, "review": "Overall the Fire TV Stick is a much better product compared to the Chromecast (I own both), but this product page has a bit of false advertising going on.To start with, Youtube on the Fire stick is nothing more than fantasy. You'll notice there's a small Youtube.com icon under \"Watch, Listen...\" near the top of the product page and you'll see them list \"Youtube\" as one of the popular products you can use with the Fire TV stick, unfortunately this is nothing but blatantly false advertising. The truth is that apart from trusting your data to a handful of sketchy third-party apps, there is no option for watching Youtube on your Fire TV stick. The app that looks somewhat official, with the developer name of \"Youtube.com?\" Nothing more than a bookmark that points you to a TV-friendly website, and I'm very doubtful that Google/Youtube would make an app like that. And the kicker is... Amazon borrowed the icon from that app and put it on their wall o' enticement in this page. What a joke. All Amazon needs to do is add a browser or the ability to mirror my browser from a computer or mobile device and they're golden, but I guess that's beyond their ability at this point.Second: Twitch.tv functionality. Twitch.tv is a streaming service focused around allowing users to livestream everything video games, and was recently bought out by Amazon. That last part and the purple Twitch logo plastered all over this page and product packaging kinda makes you think it should function flawlessly, right? Wrooooooong. Similar to Youtube, Twitch users create an account and follow their favorite channels so they can come back and watch that person stream again later. Unfortunately whoever designed Twitch for the FireTV had neither an idea what the product was about nor what a user interface is. When you start up the app you get three rows - the top is for Twitch's featured streamers, the second is a list of every game streaming at the moment, and the third every channel streaming at the moment. Users have no way of accessing their account to see which if any of the channels they've followed are live, nor do we have any way of searching for anything specific. The only option is to scroll through the featured streams (assuming the stream you want would be there in the first place), scroll through all the games til you find the right game then scroll through everyone playing said game til you find the right channel, or to scroll through literally every single active streamer til you find that needle in a haystack. If you happen to find the stream you wanted to watch or you've given up and chosen a random stream, you won't be able to interact with it in any way shape or form as there's no chat function! Of course you couldn't sign in anyway, so what's the point?If you don't care about these apps and you just want to watch Prime video or Netflix on your TV, this product will work just fine for you. Despite all the negativity I have toward the way they've advertised a few features, I really do appreciate how well Prime instant play works. If you're like me and you frequently find yourself trying to remember where you've seen actor Joe before, the X-Ray feature is great, makes me wish I had it on everything else too! I've not played any games on my Fire stick yet, but I imagine you'd probably want the other Fire TV product (fire box? I don't remember) for something like that just because it has more processing power as far as I know.In the end all I can say is do your homework before you buy this product. The Fire TV Stick itself is good enough, but this store page is filled with so much advertising BS that it's not even worth reading.Edit: I was just reminded of a very loud and obnoxious ad that Amazon has chosen to run before playing Prime content. It only plays once every now and then, but it cannot be skipped easily (you'll have to exit back to the home screen and try starting the video again, though there's still a chance the stupid ad will play) and it is OBSCENELY loud. The ad itself is relatively pointless and serves only to let the user know that they can also watch Prime content from their mobile devices... Okay, thanks for the tip, Amazon, but I really don't need you to shout this information at me from the beginning of every third episode. It's pretty concerning that they even had the nerve to play an ad before playing Prime content regardless of the message, makes me worry that Prime is going to become like Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "Lexington Lexicon \"Sporkley\""}, {"rating": 4.0, "review": "I was looking forward to using this to watch my favorite movies and tv shows and set up was very simple, however, every time I try to watch something, it keeps buffering and when it isn't buffering the picture is blurry off and on (same with the Google Chromecast that I have - I thought the Fire TV Stick would be better based on the other awesome reviews).  My tv is semi-enclosed in an entertainment center but is close to the wifi signal/router.  Could the enclosure be interfering with the signal?  I would love to be able to get my money's worth and use this thing, but am starting to regret this purchase.", "verified": true, "helpfulness": "0/0", "author": "Megan Miltimore"}, {"rating": 5.0, "review": "Its Awesome!", "verified": true, "helpfulness": "0/0", "author": "Lee and random family members"}, {"rating": 5.0, "review": "Awesome sums it up.  The only complaint would be the lack of ability to increase storage.  In my case I should have went with the firetv rather than the stick but I didn't consider this issue until it was too late.  Works wonderfully with xbmc and sling.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Works perfectly fine. Very use to install. Excellent price compared to Apple TV", "verified": true, "helpfulness": "0/0", "author": "mpf9876"}, {"rating": 5.0, "review": "Excellent product.  Very satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "SekodaNme"}, {"rating": 5.0, "review": "Enjoying it very much.  A great addition to my TV choices.  My Son was so impressed he bought one too. I also was happy with what an easy installation it is. Especially for older people like me. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 2.0, "review": "I had a Roku (box) & Chromecast prior to getting this, & so far the Roku is my favorite. The interface of Fire is just not as easy to navigate, & the remote app for your phone is TERRIBLE, you can't even see what you're doing - & it has to reconnect to your TV every time you open the app. Horrible. Also the Fire disconnects all the time, there is almost always a message on the TV when I turn it on & sometimes while I am watching, too. Half the time just hitting home & going back into the channel will work, but far too many times I've had to unplug everything to get it to reconnect.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]