[{"rating": 5.0, "review": "Best $40 I've spent in awhile! Love having everything streamlined on one product and its portable! SUPER easy to set up (especially being a prime member) and extremely user friendly. Purchased one for a friend for her birthday present immediately!", "verified": true, "helpfulness": "0/0", "author": "michael huber"}, {"rating": 5.0, "review": "This is everything it promised to be and more.  So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Hinman"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Eric thacker"}, {"rating": 5.0, "review": "I love it. Works great.", "verified": true, "helpfulness": "0/0", "author": "cpjr"}, {"rating": 3.0, "review": "Seems slow to respond-crashes every now and then requiring to unplug it so it restarts. I like my Roku much more.", "verified": true, "helpfulness": "0/0", "author": "FLRoadman \"Chris\""}, {"rating": 2.0, "review": "I didn't like it because I couldn't log into my Netflix account already established. I had to go thru Amazon.", "verified": true, "helpfulness": "0/1", "author": "Sandra Key"}, {"rating": 1.0, "review": "Horrible...horrible - has serious issues. Loses track of the wifi, doesn't load well. It says it's connected but can't play videos from Netflix...I have appletv as well, FAR, FAR BETTER.", "verified": true, "helpfulness": "1/1", "author": "steve schwaid"}, {"rating": 5.0, "review": "Very easy to use!  We like the portability, too.", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 5.0, "review": "Works great it is fast and has a lot of cool apps. I really like.", "verified": true, "helpfulness": "0/0", "author": "Windell Withers"}, {"rating": 5.0, "review": "Bought it on the early program for about half of normal price.  For that price its great.  At normal price, I'd be weighing each of the features with other media players.  If you have Amazon Instant Video from Prime, good addition to easily play movies/shows over most other android devices I have.", "verified": true, "helpfulness": "0/0", "author": "JK"}]