[{"rating": 5.0, "review": "Extremely easy to install and to use.", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 5.0, "review": "Have had this product for about 2 weeks now...super easy to set up...love love love having a remote instead of having to use my tablet...so much easier to grab the remote to pause, change shows, change apps, etc.  It does seem to get slow, freeze, or quick pause occassionally but nothing close to the Chromecast. I also believe it has to do with my WiFi/ISP not the product itself. I also have the Chromecast, but I love this so much better because of the remote and having access to all the apps in one place. We were going to put the Chomecast in the bedroom, but after using this Fire TV Stick we will be ordering another for the bedroom!", "verified": true, "helpfulness": "0/0", "author": "Dwomyn"}, {"rating": 5.0, "review": "Works great. I don't have super fast wifi, still loads in seconds. Simple to use.", "verified": true, "helpfulness": "0/0", "author": "Sam DeMarco"}, {"rating": 5.0, "review": "We are really enjoying our Fire stick.  We were using our Wireless DVD player to stream programs before, but this works so much better and the picture is clearer.  So glad we have it!!", "verified": true, "helpfulness": "0/0", "author": "Beth Cornwell"}, {"rating": 5.0, "review": "Good!!", "verified": true, "helpfulness": "0/0", "author": "Hyunjeong Liew"}, {"rating": 3.0, "review": "While the Fire TV Stick has a lot of potential, I feel it is limited by the lack of apps. I hope this is something that Amazon addresses in the near future.", "verified": true, "helpfulness": "0/0", "author": "Ronald Kelly"}, {"rating": 4.0, "review": "Nice and easy to use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Lynn Matherly"}, {"rating": 2.0, "review": "I hate to give anything a bad review, but the Fire TV Stick from Amazon just didn't work with my TV and Internet provider.  The Amazon technicians were very helpful, and replaced my unit two different times, but it still made no difference.  They tried everything but couldn't understand why it didn't work.  Amazon suggested that I contact my ISP, Comcast, to see if they had any suggestions.  Since I really was not having any problem with my Comcast Xfinity service, Comcast had no idea how they could help me.  All in all, it just didn't work for me, and I finally I had to send it back for credit.  The one thing that did bother me, is that they charged me a re-stocking charge.  I am a Prime member, and didn't take too kindly to the re-stocking charge.", "verified": true, "helpfulness": "0/0", "author": "John Wedge"}, {"rating": 5.0, "review": "Easy to set up and run.", "verified": true, "helpfulness": "0/0", "author": "Susan H. Everson"}, {"rating": 1.0, "review": "Did not connect correctly to my internet. Very disappointed. After trying to get it to work for several hours I returned it. May buy a Roku.", "verified": true, "helpfulness": "0/0", "author": "Ohiopicker"}]