[{"rating": 5.0, "review": "Absolutely GREAT! I also have Chromecast but the Fire Stick puts it to shame! There are so many more shows and movies to watch PLUS other apps that are available. I'm also impressed with how many \"free\" shows and movies Amazon offers. If something I want to watch isn't available for free, the price to own it is very reasonable.", "verified": true, "helpfulness": "0/0", "author": "Mary Ellen Carr \"Alexis and Mariah's Grandma!\""}, {"rating": 5.0, "review": "Awesome I can't get enough of it. I'm in bed all weekend enjoying Netflix and Hulu, also I use the fitness app each morning before work.", "verified": true, "helpfulness": "0/0", "author": "Sophia reed"}, {"rating": 5.0, "review": "Terrific", "verified": true, "helpfulness": "0/0", "author": "christine earl"}, {"rating": 5.0, "review": "Great product. Works well..", "verified": true, "helpfulness": "0/0", "author": "russell meyer"}, {"rating": 4.0, "review": "I love everything about this except that the USB ports on my TV's aren't powerful enough to run this device. I have a Roku and it runs fine off the USB ports on my TV, but with the Fire TV Stick I have to use the wall adapter and find an outlet to plug it in. Other than that it's great.", "verified": true, "helpfulness": "0/0", "author": "Blue McCorsky \"ReadinRebel\""}, {"rating": 4.0, "review": "very efficient and easy to use.  i do prefer my laptop in doing a \"search\" and reading the basic themes of future episodes of a tv series.  worth the money.", "verified": true, "helpfulness": "0/0", "author": "Kirk Lett"}, {"rating": 5.0, "review": "Easy navigation, great video quality for Amazon and Netflix, pandora is great, hope they continue to develop this.", "verified": true, "helpfulness": "0/0", "author": "Donald J. Rudawsky \"Experiment33\""}, {"rating": 5.0, "review": "So easy to install.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Debbie Rhodes"}, {"rating": 5.0, "review": "More than met my expectations!  Easy to navigate and thoroughly enjoy the Prime videos and series!!!  Would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 2.0, "review": "I bought a fire TV stick for my husband at Christmas. Figured it would be nice for him to use on the upstairs TV as he always wants to watch something and it gave him a few more options. It sounded easy enough to install so when he said that it didn't work I thought maybe it was due to our internet being so great upstairs.Last week I finally got around to setting it up myself on our downstairs TV. It was easy enough to do I had a very good signal strength but it also showed 'Connected with problems'. No idea what that meant but I opted to carry on regardless. Anyhow sadly it was not to be. I would start to load a video and the next thing it would read 'Player Error - An internet connection is required...' or \"Network Connection Lost' and the most annoying one 'Slow Internet Connection'. I finally gave up but have since tried a few more times. Today being the latest. Not sure at this point if it's the Fire TV stick or if my internet is not what it might be. Maybe a combination of both. If I ever get it up and running I will add an update to my experiences. I'm still hoping for great things.", "verified": true, "helpfulness": "1/2", "author": "M. Kerr"}]