[{"rating": 5.0, "review": "Not only do I love the Amazon Fire TV Stick, I have convinced two more people this week that they needed one, too.  IMHO, if you have paid for an Amazon Prime membership and don't use a Fire TV or Fire Stick to view Amazon video content on your TV, you are leaving money on the table.  So easy to install, my 80 year old mother set up hers and installed apps with just a little phone support from her favorite personal technician (me, her daughter!).Sure, this model doesn't include the fabulous voice search on the remote, but just download the Fire TV app to your phone and then you do. Don't hesitate; it's the cost of a movie and popcorn for two in a theater.", "verified": true, "helpfulness": "0/0", "author": "damble"}, {"rating": 1.0, "review": "Its not what i expected. I was looking for something to help me save money on my cable bill, instead i find my self spending more.", "verified": true, "helpfulness": "0/0", "author": "juan antonio padilla"}, {"rating": 5.0, "review": "It is the perfect product to meet all your entertainment needs! Very fast, very efficient, and so useful! I recommend it to anyone and everyone!", "verified": true, "helpfulness": "0/0", "author": "Richard DeMark"}, {"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Cool little tool!!", "verified": true, "helpfulness": "0/0", "author": "ally"}, {"rating": 5.0, "review": "The Fire TV Stick is an amazing device.  I especially enjoy using it to access movies and TV shows that are part of Amazon Prime and thus free.  The stick is fairly easy to use, especially for the basics.  I had to google, then download the full user guide to verify a few things.  I suggest Amazon with include a full User Guide with the package - or, at least, make reference the where one can find it online.", "verified": true, "helpfulness": "0/0", "author": "Mac Guy"}, {"rating": 4.0, "review": "Works great!! Love watching my shows and listening to my amazon prime music stations! Overall I am happy with my purchase of the Fire Stick. Only thing I wish is that it didn't over heat so quickly, that's the only downfall...", "verified": true, "helpfulness": "0/0", "author": "Ana Antillon"}, {"rating": 3.0, "review": "I was  invited to Prime but I cant use it for moves  on fire stick  why???? I still have it to buy ... so it just ok you need prime  to watch what you really  for moves", "verified": true, "helpfulness": "0/0", "author": "rose king"}, {"rating": 4.0, "review": "It works good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "ROBYN CUNDIFF"}]