[{"rating": 5.0, "review": "Very pleased with the Fire TV Stick.  Has the apps I wanted (thank you for Sling TV!), stable platform, and an intuitive remote.  Feels like the finished product it is.  Would like to see some support for a web-browser to reach the streaming sites that currently don't have apps (Crunchyroll), and support on the Home screen for non-Amazon 3rd party apps, but I'll be patient and let the developers do their thing.", "verified": true, "helpfulness": "0/0", "author": "Craig Zank"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Kenneth J Derck"}, {"rating": 1.0, "review": "I've had the Fire TV Stick for a couple of weeks now.  While setup was easy and it seems to work with Prime.  It does NOT WORK WITH NETFLIX.  It is supposed to.  There is no fix despite many people reporting the same problem.  The only recommendations involve \"reboots\" and those don't even work.  This needs to be fixed for me to be even a little satisfied with my purchase.", "verified": true, "helpfulness": "2/3", "author": "R. Pugh"}, {"rating": 5.0, "review": "I love everything about except Hulu plus the screen freezes while watching", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I already had the Chromecast.  I purchased the Fire TV Stick to compare, and because I am a Prime member I thought it would be to my advantage.  My issues/opinions:- It doesn't stream as well as the Chromecast.  It is constantly pausing and loading where the Chromecast does not.  Using Netflix it paused so often that I took out the Fire Stick and put the Chromecast in - no more issues and I was able to watch the movie all the way through (I say that to say, it is NOT my WiFi)- I also find that having to plug it into the wall instead of the tvs usb a cord now has to be dealt with: where with the Chromecast I can simply plug it into the tv and no concerns about the wiring.", "verified": true, "helpfulness": "1/1", "author": "Video Corporation of America"}, {"rating": 5.0, "review": "I ordered the Fire TV Stick in October of 2014 when they were first released for $20. When I received it I wasn't expecting much, but what a surprise when I set it up and started loading apps and watching television and movies. WOW! very impressed. I love the portability of it. I only wish I had purchased more at the time and had given them as gifts.", "verified": true, "helpfulness": "0/0", "author": "James C. Ohaver"}, {"rating": 5.0, "review": "Exceeded my expectations. Very simply to set up and use", "verified": true, "helpfulness": "0/0", "author": "Laymond Rose"}, {"rating": 5.0, "review": "I LOVE THE STICK!!! Awesome product. Was super easy and quick to set up and install. I highly recommend it! I dont have cable in my room so with my prime subscription I can enjoy a huge library of shows and movies now. And my lil girl loves playing the games, having her fave cartoons readily available and learning from the educational apps .I also love all the free apps. Thanks for such an awesome and affordable product!", "verified": true, "helpfulness": "0/0", "author": "S. Philpott \"sabz\""}, {"rating": 5.0, "review": "GREAT product.  I am unable to afford cable, so this is amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Shawn R Cradit"}, {"rating": 5.0, "review": "Love it.  HD is crisp.  Little to no buffering depending on WiFi strength", "verified": true, "helpfulness": "0/0", "author": "Rob Anderson"}]