[{"rating": 5.0, "review": "I LOVE THE FIRE STICK!!!This loads up FAST!  It also is so completely user friendly- even my mother in law that can't use her Roku was able to use this without any trouble!Simple easy to use remote!I took it to my hotel last weekend, hooked up to their wifi and watched what I wanted!  Hooray for easy TV!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Vanderkleed"}, {"rating": 5.0, "review": "It's wonderful, absolutely delivers everything it promises.  Great price and I love it.", "verified": true, "helpfulness": "0/0", "author": "Colleen5991"}, {"rating": 4.0, "review": "The product works great! I do know that I will be needing a longer HDMI cable to help get the at ck away from the tv. This will help with a connection issue I have. Also am needing to change my router to channel 8, as recommended . other then that, the stick has been everything that I hoped for. Except one day issue! It has a History App. Which requires you to already have a second subscription to the channel. Why can't Prime workout a deal with Time Warner for access?", "verified": true, "helpfulness": "0/0", "author": "Morris Hardy"}, {"rating": 5.0, "review": "Love this thing, it is easy to use and very versatile.  I don't want to give the money grubbing cable company an almost criminal fee for 'activating' the already installed second wall outlet in my bedroom so I bought this.  I plugged it into the HDMI port and had almost instant access to all my streaming apps (Netflix, music, photos...).  I also side loaded a few apps and now have free cable and movies.  The Is simple and works great, the stick is easy to navigate and the quality is good; I would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Scott T. Johnson"}, {"rating": 5.0, "review": "Got this for my dad for Fathers Day and he loves it! Worked right out of the box with very little setup. This tiny device runs way faster than the $100+ Sony box that we got a year or two ago. The companion App also works great with this for navigation as well as typing or even voice searching.", "verified": true, "helpfulness": "0/0", "author": "Hung Sewell"}, {"rating": 5.0, "review": "LOVE IT! I get everything but my unlimited kindle on my big screen tv. It took less than three mins to set up.", "verified": true, "helpfulness": "0/0", "author": "Jennifer McMullin"}, {"rating": 3.0, "review": "I bought this device because there is a Slingbox app, which enables you to stream Cable TV from another location directly to the TV rather than streaming it to an iPhone or iPad and then projecting that picture on the TV with AirPlay and Apple TV.  However, the picture quality using the Slingbox app and Fire TV Stick is inferior to that obtained when using iPhone/iPad and Apple TV.  So the cumbersome method produces a superior picture, which is as close to HD as gonna get.  I'm not sure if it's the app or the TV stick but I will only use the Firestick in a pinch.  It's unfortunate that Amazon or the app developer could not take advantage of this opportunity.  I would not recommend Fire TV stick for Slingbox users unless convenience trumps picture quality.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "Great for the RV! We usually only stay at RV parks that have WiFi, so this has been wonderful! No expensive satellite for us!", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 3.0, "review": "My router is so far away I can’t get a connection. I don’t know what to do.", "verified": true, "helpfulness": "1/1", "author": "Bob Dunlap"}, {"rating": 5.0, "review": "Works great! Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Blair Smith"}]