[{"rating": 2.0, "review": "It works well with Netflix and youtube on its own or iOS device.  However, there is no app for iOS yet to mirror the iOS device.  If you owns iphone, iPad, the only thing you can do with fire stick at this point is Netflix and youtube.  I am a bit disappointed and I won't recommend it for iOS user for now.", "verified": true, "helpfulness": "1/1", "author": "SG"}, {"rating": 1.0, "review": "Wow - really hyped up and very very very poor reception.  Have a small home and the only tv this will work on is the one that's in the same room as the router.  And instant video?  What a joke!  Sign up for hulu plus and watch all the current shows you want for $7.99 a month.  Amazon wants $1.99 an episode AFTER you pay the $99 a year fee.  Total ripoff as far as I'm concerned and would not recommend this product to anyone.  Save the $15 and buy the Chromecast - simple setup - no issues - get Hulu Plus!", "verified": true, "helpfulness": "0/0", "author": "L. Holmes"}, {"rating": 5.0, "review": "Easy set up with no problems.", "verified": true, "helpfulness": "0/0", "author": "Neil or Sharon Ullman \"Bake904\""}, {"rating": 2.0, "review": "Have trouble with the controller double clicking and it freezes quite a bit", "verified": true, "helpfulness": "0/0", "author": "Nicholas D Wilson"}, {"rating": 5.0, "review": "Great for movies, old and new TV shows. I have just begun to discover thegreat things I can do with my Amazon Fire Stick !! Love it !!", "verified": true, "helpfulness": "0/0", "author": "bing"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Lee mclain"}, {"rating": 5.0, "review": "Work's great", "verified": true, "helpfulness": "0/0", "author": "wesleystallings"}, {"rating": 5.0, "review": "Excellent streaming device, very responsive, fast browsing. For what I've used it for Amazon streaming and Netflix no issues at all!", "verified": true, "helpfulness": "0/0", "author": "Big Dawg \"Big Dawg\""}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "T. Clement"}, {"rating": 5.0, "review": "I love this. I bought this for my bedroom because my tv does not have the built apps like the other rooms in the house. I like this better than the apps that come programmed in my other TV's.", "verified": true, "helpfulness": "0/0", "author": "John D Forte"}]