[{"rating": 5.0, "review": "It works great!  Can access my Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Dla"}, {"rating": 3.0, "review": "Works for what I need it for, but wish the voice search worked with stuff other than just Amazon, like Netflix.", "verified": true, "helpfulness": "0/0", "author": "J. Nieski \"Josh\""}, {"rating": 5.0, "review": "LOOOOVE this thing. All the apps (hulu, netflix, prime, etc.) are now all in one place and the kids can jump from one to the other all on their own.  Buying one for every tv this year.  Plus, the app on your phone makes it super handy to use when you inevitably lose the remote.", "verified": true, "helpfulness": "0/0", "author": "Becky Benedict"}, {"rating": 5.0, "review": "I bought the Fire Stick for my daughter to use on a TV in her bedroom.  It was easy to set up and works great.  I have a Roku box in a different room and prefer the Fire Stick.  Cool product...nicely done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Michael Hardin"}, {"rating": 3.0, "review": "I bought this product through BB prior to Christmas and have had repeated issues with the wifi dropping in and out.  The interface and content is great, but I cannot recommend due to it only working 50% of the time.", "verified": true, "helpfulness": "0/0", "author": "Byron"}, {"rating": 3.0, "review": "I like the remote, easy set up, seems like all the shows I like to watch I have to pay extra for.", "verified": true, "helpfulness": "0/0", "author": "Tonya T."}, {"rating": 5.0, "review": "Love it. Work as well as Apple TV and it's cheaper and better than Google stick.", "verified": true, "helpfulness": "0/0", "author": "Cindy Pennycuff"}, {"rating": 5.0, "review": "I am in love with this!  I use it almost everyday.  For now I am just watching Netflix shows but it works great and is easy to get the hang of.", "verified": true, "helpfulness": "0/0", "author": "Erika Humphrey"}, {"rating": 3.0, "review": "Love the content but it keeps telling me it lost the internet connection. When I go to settings it shows it is connected with good signal strength. I have to forget the network, add it back (with all the WEP info) and the it runs fine for awhile. Amazon customer support's only response is to reset the whole unit. It is connected to a Wi-Fi AP that the whole house uses without any problems.", "verified": true, "helpfulness": "1/1", "author": "Big Bob Mac"}, {"rating": 5.0, "review": "I cannot believe how much a remote matters and makes a difference. The addition of said remote allows the FireTV Stick to function as a separate device, all on its own, independent and unchained from having to rely on any other device to supply the content. Grabbing the different apps was a bit confusing at first and doesn't really make sense in my mind as to why these apps didn't come preloaded (not a deal-breaker by any means) but once I had them up and running, the experience was fantastic. Full HD picture and sound and really quick uptake for grabbing the stream (at least from Netflix/Plex). The update process at first run was simple and worked great so I'm thankful for that. I love being able to grab my PLEX library without having to rely on my phone/tablet (and thus wasting those devices' batteries in the process). Netflix worked great. PRIME is the biggest draw to this device (as opposed to a Chromecast) and if you have it, you certainly could not pick a better device. BUT even if you don't have prime (or mooch off someone else's Free Shipping and thus don't get the Kindle and Video parts) this device still has a lot of selling points. I don't play any of the games so I can't speak to that but it's there. I did grab it for the initial $19 so that was fantastic but even at $39, this device is a great buy! I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Skinner"}]