[{"rating": 3.0, "review": "I had many problems with bandwidth to play the stick. Tech support was not helpful at all. Problems finally solved with a family member fixing service.", "verified": true, "helpfulness": "0/0", "author": "Chris Detter"}, {"rating": 3.0, "review": "Thought it had a lot more for prime members than it does.", "verified": true, "helpfulness": "1/1", "author": "anjana mihelic"}, {"rating": 5.0, "review": "revolutionized my household. my 2 year old knows how to use it.", "verified": true, "helpfulness": "1/1", "author": "Summer Brown"}, {"rating": 5.0, "review": "I like the easy setup and the access to internet radio.  CB", "verified": true, "helpfulness": "1/1", "author": "Charles Butler \"Doctor Funk\""}, {"rating": 3.0, "review": "To much to ask to buy episodes after watching free even with member ship", "verified": true, "helpfulness": "0/0", "author": "Charles Reynolds"}, {"rating": 5.0, "review": "Bought this for my mother. Out of the box was extremely easy setup with a very informative mini movie in the beginning to get even the novice of tech users going! Fantastic user interface with a well designed selection of additional apps. Very pleased with the purchase and for any other tvs I purchase in the future this will be a must have for them. Also, the hdmi extender was very nice because these days some of the backing down of the tvs are not well designed so having that extra play room was nice! Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jiyn"}, {"rating": 5.0, "review": "Fantastic and so easy to use", "verified": true, "helpfulness": "0/0", "author": "Mary E. Norovich \"MEN5151\""}, {"rating": 5.0, "review": "Works wonderfully!", "verified": true, "helpfulness": "0/0", "author": "Marianne \"Marianne\""}, {"rating": 5.0, "review": "I LOVE MY FIRE STICK! How on earth did i live without it? Through all the different apps and games i couldnt ask for anything more,", "verified": true, "helpfulness": "0/0", "author": "Krysten Wilson"}, {"rating": 5.0, "review": "Easy to use and a definite upgrade from the Chromecast.  This does it all without the need of another device (tablet/phone) the only issue is the remote is tiny and black so it's really easy to lose around the couch then again that can happen with any remote.  :)", "verified": true, "helpfulness": "0/0", "author": "The Tone"}]