[{"rating": 3.0, "review": "Good but slow and sometimes loses the network", "verified": true, "helpfulness": "0/0", "author": "Anna Luzania"}, {"rating": 5.0, "review": "Awsum", "verified": true, "helpfulness": "0/0", "author": "G. Bringas \"stormshadow\""}, {"rating": 3.0, "review": "I absolutely love the number of apps you can use with the Fire Stick. Amazon Instant Video, Netflix, YouTube, HBO, no problem! I bought this to use in tandem with an Apple TV, so I would have access to Amazon Instant Video. It certainly allows me to do that, but as much as it pains me to say (I'm not an Apple fan), the usability and interface are abysmal when compared to the ATV. The menus are poorly organized, it constantly hangs, and will frequently lose Wifi connection when coming out of hibernation, and seems to have a difficult time maintaining an HD stream without buffering.The slow response time and frequently needing to be restarted (through the System menu) means this is probably best used as a portable solution in hotels or when visiting a friend. It's incredibly frustrating to use this on a daily basis.", "verified": true, "helpfulness": "0/0", "author": "Phil R."}, {"rating": 5.0, "review": "Works great.. I am having a problem mirowing to my Kindle or my iPhone.", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 4.0, "review": "love the idea of not having to have and pay for cable tv or satellite but Prime is not organized very well and choices for news are slim. movies are not too great either. Unless you want to pay additional charges. In the long run then your better off just paying for cable tv. maybe Amizon will get better at it as time goes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great device for our tv with no cable hookup. Very easy to install and easy to use. I highly recommend this, especially for people who have Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "discolemonade"}, {"rating": 5.0, "review": "Great - easy to set up and perfect gift!", "verified": true, "helpfulness": "0/0", "author": "MH"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Timothy W. Coughlin"}, {"rating": 5.0, "review": "Great product but wish it came with the voice remote.", "verified": true, "helpfulness": "0/0", "author": "Siam T"}, {"rating": 3.0, "review": "I use Roku in the past but after my device dies over a year ago, I decided to give this a try since at pre-introduction rate (very cheap). However I notice even through the performance speed is okay, it doesn't have all the apps that roku seems to have. I love my kdrama and fire stick doesn't support Drama Fever and a few more apps I've came to love.  :(  I've had this almost a year now and have decided to go back to Roku. Fire Stick isn't that bad though, you can side load android aps (only a few will work right), the miracast isn't bad but it does get sluggish a lot. And I guess the best part would be fire stick is centralized around your amazon prime account so you can pull your videos and music up fairly quickly. The overall interface of fire stick leaves something to be desired though.", "verified": true, "helpfulness": "1/1", "author": "N. R. Williams \"Bashful Bibliophile\""}]