[{"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  It is awesome.", "verified": true, "helpfulness": "0/0", "author": "Elena"}, {"rating": 5.0, "review": "Got it as a gift for my parents and they love it", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "it is new and it has it's issues...already failed us once but love the liberties it allows!", "verified": true, "helpfulness": "0/0", "author": "Lauren Dale"}, {"rating": 5.0, "review": "Its like turning your tv into a tablet.  So cool and with Amazon Prime you have such great selection of movies and tv shows to watch.  My family loves it.", "verified": true, "helpfulness": "0/0", "author": "steven b. dym"}, {"rating": 5.0, "review": "Love it! So user friendly and without the cost of switching to a smart tv! Best gift I received this Christmas!", "verified": true, "helpfulness": "0/0", "author": "Amber Lynne Eakin \"amberpie\""}, {"rating": 5.0, "review": "Love the stick.  I had Chromecast but this far exceeds that.  Took me a bit to get it to \"talk\" to my router, but once that happened everything went vert smoothly.  Love having the remote (Chromecast does not have that).  For the price it is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "I enjoy it very much.. the remote however could use a little more functions added other than that it's great.", "verified": true, "helpfulness": "0/0", "author": "tonia smith"}, {"rating": 4.0, "review": "It works just fine and is a great addition for the second bedroom. I took one star away because the adds on TV are misleading. It doesn't just plug into the HDMI port, it also requires a power supply - extra cable and extra power socket. If your TV in on the wall and you only have one power outlet, you are out of luck.", "verified": true, "helpfulness": "0/0", "author": "Bubba Kastorsky"}, {"rating": 4.0, "review": "Its Great!! Love the ease of the remote.  One thing to note is to let everyone know you have to plug it in.  From the looks of it and from the Amazon page it looks like it just goes in HDMI slot and poof ready to go.  I did not know it had to be plugged in which was a hassle but needless to say I got it arranged and it works great!!", "verified": true, "helpfulness": "0/0", "author": "Brian St.Onge"}]