[{"rating": 5.0, "review": "So far I'm in love with this! I have all my favorite apps right in one place. But the best part is the Fire stick remote app. Never have to search for the remote again.", "verified": true, "helpfulness": "0/0", "author": "danielle"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was exceedingly easy to setup, and user-friendly. The packaging was along the lines of a technology product of a much higher price point, however the remote itself is made of light plastic and feels cheaper than it looks. The buttons and menus are intuitive and easy to learn and use effectively. The use of bluetooth for the remote is a great addition and makes the responsiveness of the system seem almost instantaneous.", "verified": true, "helpfulness": "0/0", "author": "MJ Kupchik"}, {"rating": 5.0, "review": "If you have Amazon Prime, then this is a must have!", "verified": true, "helpfulness": "0/0", "author": "Donovan W."}, {"rating": 4.0, "review": "The app needs further development as it doesn't work properly with the YouTube. But overall it is a very good device with an excellent price", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "My wife and I love the Fire TV stick. Perfect for Netflix and HBO Go. Love it!", "verified": true, "helpfulness": "0/0", "author": "S. Cusumano"}, {"rating": 5.0, "review": "Revolutionary, I've been missing out on so much for so long. I now use this so much, I really don't know what I'll be able to do without it.Best part of the Fire Stick is the unlocked rom enabling customizations. Also, having a dual core in such a little package isn't bad either ;-)A must have !!", "verified": true, "helpfulness": "0/0", "author": "Andrew Prah"}, {"rating": 5.0, "review": "Performs easy-breezy and as expected.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Hogan"}, {"rating": 5.0, "review": "Very good product, no problem with this item. Thinking of getting another one.", "verified": true, "helpfulness": "0/0", "author": "PHILIP T LARSON"}, {"rating": 4.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "DJ gray"}, {"rating": 1.0, "review": "Doesn't work with Plex as advertised.", "verified": true, "helpfulness": "0/0", "author": "Ralph Williams"}]