[{"rating": 5.0, "review": "My wife and I love our fire stick.", "verified": true, "helpfulness": "0/0", "author": "Douglas Hopkins"}, {"rating": 5.0, "review": "I really love the Fire TV stick. I was skeptical to begin with (I have Roku attached to one of my TV) but quickly changed my understanding. It is very easy and simple to install it, to download and \"connect\" by Wi-Fi, and to stream after which the site you may chose. The remote control is very simple to operate but it is too  dark to use it during evening hours. The speed of operation depends on Modem capability. It is a great device depending what would you like to stream. It came very much on time, as described in the add (actually a day before the deadline), well packed and insulated. If you are not capricious and not willing to pay almost $100 for Roku 3, this device is for you. I strongly recommend it to wide spectrum of people's desire. Go and purchase it with great confidence.", "verified": true, "helpfulness": "0/1", "author": "Ilko G. Iliev \"I. Iliev\""}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Shannon H."}, {"rating": 3.0, "review": "I just got this a week ago. I really love how much content is available. It's replacing our Apple TV. But I have two problems with it. 1) the sound randomly drops out. This is really bothering me. If it turns out to not be something I can fix on my tv, or connection, I'll be returning the device. 2) there appears to be no order to choices of shows you have to pay for and those you don't.  A prime member and I do get a lot of shows for free. But it would be nice if, like the website, shows that were available to prime members were labeled with \"prime\".", "verified": true, "helpfulness": "0/0", "author": "S. Sabo"}, {"rating": 4.0, "review": "No gamecenter support, and no included method to get on hotel wifi.Works great, if you dont need those.", "verified": true, "helpfulness": "0/0", "author": "Smurfzilla"}, {"rating": 2.0, "review": "Pros: I have amazon prime and I really like the firestick...cons: if it would only stop freezing and dropping connection on me.  It is soooo frustrating.  I would rather hook my mac mini back up to my computer.", "verified": true, "helpfulness": "0/0", "author": "MrsM"}, {"rating": 5.0, "review": "I'm not a tech geek... so I  was worried about hookup and understanding how to use it., But It was super easy to do.", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 5.0, "review": "So easy to set up and start to use. Makes my normal tv a smart tv.", "verified": true, "helpfulness": "0/0", "author": "sherry7340"}, {"rating": 5.0, "review": "Easy to install and boom you're there!", "verified": true, "helpfulness": "0/0", "author": "Dianne Fox"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "David Hutchens"}]