[{"rating": 4.0, "review": "Liked the fire stick it took a while to figure out how to use Netflix but we are getting it.", "verified": true, "helpfulness": "0/0", "author": "MK Burk"}, {"rating": 5.0, "review": "Once I got it set up it works great on Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bill Smith"}, {"rating": 4.0, "review": "I like the portability of this and that I can plug it in to any tv I'm at in the house, but there are some glitching issues.  Example: It will pause in the middle of a movie or show even if I didn't push the pause button. It may randomly turn off or flash off and on for a bit before deciding if it is just going to pause the show and stay on or just turn itself off.  Those 2 things occur frequently.", "verified": true, "helpfulness": "2/2", "author": "Dannielle Gehrke \"Dannielle\""}, {"rating": 4.0, "review": "I've had the Fire Stick for about a month and have been pleased with it. I travelled with it last week and had little trouble installing it, see comments below, and it was nice to be able to view shows I enjoy on Netflicks and Hulu as well as Amazon.Pros - Small and easy to travel with it  Easy to use, see Cons for exceptions  Good picture quality on my TV  Works as one would expectCons - Changing WiFi networks, and original setup, is a pain with the remote's wheel. The good news is it seems one only has to setup each network once as the device seems to remember previous networks. This \"Con\" is not unique to the Fire Stick, but it would be an improvement if one could pair it with a BlueTooth Keyboard. That would also make Searching Easier.  Setting up Amazon Prime didn't work the way I expected. My wife had the Prime Membership and had invited me to join her as a Household Member. Amazon recognizes this when I order something, however the Fire Stick (which was ordered on my login) wouldn't allow me to view Prime videos for free. As my wife's membership expires this month we just cancelled her Prime, subscribed me as the Prime Member and gave her an invitation to be a Household member under my account. This is not a work around for everyone. if one orders the Fire Stick under the Prime Member's login I wouldn't expect this to be a problem, but  it would be nice if Amazon recognized the additional Household Members for Prime Video viewing.In summary, I'd recommended this, and have, to a friend or family member.", "verified": true, "helpfulness": "2/2", "author": "James Eldridge"}, {"rating": 5.0, "review": "Bought 2 of these as Christmas gifts this year, for non-technical family members, and they were a hit! Easy to set up, easy to use and access to all of the great Amazon content. Even convinced my father to try this over his Chromecast and he's loving it. If you're an Amazon fan this is a no-brainer. If you're not, I urge you to check it out (along with Prime) and I guarantee you will love it!", "verified": true, "helpfulness": "0/0", "author": "Heather A"}, {"rating": 1.0, "review": "Not even worth the $20 I paid, it's is slow, cumbersome and the remote is the worst I've ever seen for any device.", "verified": true, "helpfulness": "1/1", "author": "framitz"}, {"rating": 1.0, "review": "I purchased this specifically to use during business trips while staying at hotels. They say on their packaging that it will connect to hotel wifi (sign-on pages). However when I got to the hotel it didn't work. However after looking online for the solution, turns out this promoted feature doesn't work yet and is listed as \"coming soon\". I seriously want to like this device but it's completely useless to me until this is fixed.", "verified": true, "helpfulness": "2/2", "author": "Brandon"}, {"rating": 1.0, "review": "This was delivered a couple of months ago, but with holidays and travel, I just got around to trying to connect it. It won't even connect. I've gone through the startup about a dozen times, with multiple failure points. Sometimes it won't connect to the network; sometimes it connects to the network, but won't contact Amazon, so it makes me unplug and retry. Then I have to put my network info in again using that stupid keyboard interface and the remote. Now, it is giving me an error that I should use the power adapter - which I am using! I've checked the connections multiple times, restarted my router, tried using a different network, verified that the power is on, no luck. Very frustrating.", "verified": true, "helpfulness": "2/2", "author": "Christel \"Chris\""}, {"rating": 5.0, "review": "The Fire TV Stick is friendly to use.", "verified": true, "helpfulness": "0/0", "author": "wordy"}, {"rating": 2.0, "review": "Will not stay connected to WiFi", "verified": true, "helpfulness": "1/1", "author": "Skylar Thomas"}]