[{"rating": 5.0, "review": "Excellent option for our tv.", "verified": true, "helpfulness": "1/1", "author": "Resort Lady \"resort lady\""}, {"rating": 5.0, "review": "I love how easy the Fire TV Stick is to use. No HDMI cords or laptops hooked up to the TV anymore.", "verified": true, "helpfulness": "1/1", "author": "Toni"}, {"rating": 3.0, "review": "Although the price is very ideal it does not compare at all to the Fire TV. It has a very slow reaction to any inputs from the remote, memory management is poor and insufficient. I find myself constantly having to restart it, which is not a problem with the Fire TV. Spend the extra money. Both of them are an improvement over ChromeCast.", "verified": true, "helpfulness": "1/1", "author": "Uther"}, {"rating": 1.0, "review": "If you whant it to stream from prim it good if you want it for picture perfict if you want it for tv mirror  so bad not worth a peny totally through me out i got it for mirror  my tab wireless  and my laptop screen did the laptop with small screen and very very slow response slow motion  so i try  may galaxy tab 10.5 not even connecting stucking on connecting  i did all kind rest wifi restart tab firetv tv no chance", "verified": true, "helpfulness": "0/0", "author": "searcher"}, {"rating": 5.0, "review": "Connected perfectly.  noConnected quickly and works perfectly.C", "verified": true, "helpfulness": "1/1", "author": "karen harris"}, {"rating": 5.0, "review": "Love it best streaming device", "verified": true, "helpfulness": "1/1", "author": "joey"}, {"rating": 5.0, "review": "The Amazon Fire TV stick (along with our Prime Membership) solved two big issues for us:1. My husband and I are tired of the constant interruption of TV commercials.  The programming with the Fire stick is commercial free!2.  Our local cable provider has been a real disappointment for show access.  We tend to watch shows On Demand, but usually only the current season is shown or just the most recent episodes.  Who wants to get into a show on episode 10 of Season 3?  The programming with the Amazon Fire Stick has been great because we're able access amazing shows from Season 1, Episode 1.Another thing we really like about the Amazon Fire Stick is the included remote.  So many remotes require a 10 page instructional guide to operate.  Not this one.  It's simple, intuitive, and not loaded with mystery buttons.We like the Fire Stick in conjunction our Prime Membership so much, that we've decided to leave cable behind!", "verified": true, "helpfulness": "1/1", "author": "Lorrie L. Birchall"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Samantha Hurst"}, {"rating": 5.0, "review": "Love streaming what we enjoy watching, but I wish there were more offers for Christian apps and they were easier to find. It's all mixed in together. Would like to have apps for: I.E. James MacDonald \"Walk in The Word\"; Greg Laurie \"Harvest\"; awesome preachers.", "verified": true, "helpfulness": "1/1", "author": "Celeste P"}, {"rating": 3.0, "review": "Fire stick works good, we have band width issues that limit our enjoyment of the device...", "verified": true, "helpfulness": "0/0", "author": "Gerald Tomczak"}]