[{"rating": 5.0, "review": "so far so good. connection works seamlessly.  Enjoying the new Bosch series which is excellent as well.  Highly recommend the Fire TV stick.  PBS", "verified": true, "helpfulness": "0/0", "author": "PBS"}, {"rating": 5.0, "review": "Good device, it is not as fast as the fire TV but it works as good as it. I installed many applications and all of them where compatible. I would definitely recommend it. The only unexpected thing was that the device used an alternate power source, so you need to have an additional power outlet for that.", "verified": true, "helpfulness": "0/0", "author": "Pablo Lopez"}, {"rating": 3.0, "review": "I like the ease of use and that I can get to both my Prime and Netflix accounts. My complaint is that it doesn't hold a charge so unless you buy ANOTHER accessory, you have a cord visible down your wall. Most of us these days have tvs mounted on the wall and plan so that no cords show so we certainly don't want a cord to show for this either.", "verified": true, "helpfulness": "0/0", "author": "J. Donahue"}, {"rating": 5.0, "review": "Love the firestick. Very responsive.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Awesome for getting Netflix, prime or tons of other apps on your TV", "verified": true, "helpfulness": "0/0", "author": "Patrick Daugherty"}, {"rating": 3.0, "review": "Doesn't have Facebook app store salesman said it did. Thinking about taking it back.", "verified": true, "helpfulness": "0/0", "author": "ruby duncan"}, {"rating": 5.0, "review": "Works great, many options highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Ivan vidauri"}, {"rating": 5.0, "review": "Works great,.was easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really love it. Easy to install. Very convient", "verified": true, "helpfulness": "0/0", "author": "jessica clark"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "D. Gibson"}]