[{"rating": 5.0, "review": "No Apple apps yet, but does stream with Netflix app.", "verified": true, "helpfulness": "0/0", "author": "David Aldrich"}, {"rating": 5.0, "review": "I bought this because I travel for work often; it's nice to have my Netflix and Amazon Instant Video with me away from home and able to watch it on TV instead of on the laptop or tablet.  It is very easy to setup and have had no issues streaming movies.  I used it on a couple trips already and have had no issues with speed on a standard wifi connection at the hotel.  I have a portable USB power charger for my phones, works great because I was having a hard time locating a power outlet that is close enough for the fire stick to reach.I bought this when it was offered to Prime customers for $19, best money spent!", "verified": true, "helpfulness": "0/1", "author": "Catheriya"}, {"rating": 5.0, "review": "Love it very simple to operate", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "We bought a Fire TV Stick to upgrade the smart TV we have in our bedroom.  The main issue we had with the TV is the wireless card installed in the TV.  Most of the apps would have issues staying connected to the internet, and would constantly cut out from a poor wireless connection. In comes the Fire TV stick.  Not only did the dual antennas fix out connection problem, but the picture is much more crisp compared to the TV apps.  We also like the layout of the home screen much better instead of opening the individual apps through the TV.  The experience is also better since we have a Kindle Fire HDX.  It acts as an additional controller for the Fire TV Stick, and everything on the Kindle can be shared through the TV now.", "verified": true, "helpfulness": "0/0", "author": "Chris Korbelic"}, {"rating": 4.0, "review": "I would really like it if I didn't live out in the country and would have internet service that didn't buffer.  The product was a hit with my family until the internet didn't work effectively.", "verified": true, "helpfulness": "0/0", "author": "C. Peterson \"lifetime of funny\""}, {"rating": 5.0, "review": "So easy!  I love this for watching prime videos and Netflix.", "verified": true, "helpfulness": "0/0", "author": "L. Casale"}, {"rating": 5.0, "review": "Fire Stick is a top notch, easy to use, must have device. It is truly plug and use. I have used it daily and find it easy to use with multiple streaming services. The free downloadable app remote makes it even more functional with voice search. I rarely review products but the Fire Stick deserves a shout out for being what it's advertised to be.", "verified": true, "helpfulness": "0/0", "author": "smabcs"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick when there was a prime special and it was half off, thinking \"I could probably use this for something.\"  I have a computer hooked up to my TV, so don't need any of the roku-like devices.  However, I figured it might be good for traveling.  When I received the Fire TV Stick in the mail I immediately plugged it into my TV and starting setting it up.  Set up was EXTREMELY easy because it already was connected to my personal prime account.  I was shocked at the ease.  And there was a nice cheesy start-up video to show you the capabilities.  I've had the stick for about a month now and I have to say - I use it more often than I thought I would, and primarily for listening to music and watching YouTube.  Because the stick doesn't have any excess programs clogging it up like my computer does, it seems to stream music and video cleaner than my computer.  One really neat feature is the YouTube app.  You can actually control it from your phone.  If you open up YouTube on your phone while near the Fire TV Stick, there will be a small icon in the app on your phone allowing you to choose and queue videos, play/pause, etc. directly from your phone.  This is actually a really cool feature that I have used several times.  A YouTube video takes about 3-4 seconds to start, but once it starts, it never stops again to buffer - a greatly appreciated feature.  Netflix and Amazon Prime video have streamed flawlessly for me as well.  For reference, my internet speed is \"up to 20 Mbps\" and I have between 4 and 6 devices connected at any given time.  I cannot compare this to other streaming devices given that I don't own any others, but for the price, I am impressed so far and have no regrets in my purchase.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Stelley"}, {"rating": 3.0, "review": "Bad picture quality on a large screen compared the the Fire TV Box or the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mark Twwain"}, {"rating": 3.0, "review": "it's okay  but as shown here you can't tell stick has to be pluged in at all times", "verified": true, "helpfulness": "0/0", "author": "Tammie"}]