[{"rating": 5.0, "review": "Love it!!! We also have Apple TV but we prefer this because of our existing amazon prime membership benefits. The menus are so simple to navigate and the set up was a snap. Love the auto tutorial that launches automatically.  This is such an amazing value...", "verified": true, "helpfulness": "1/1", "author": "Ecb"}, {"rating": 5.0, "review": "Streams videos quickly and reliably, and the interface is very user-friendly. Would absolutely recommend this device over the chromecast, which is often times very glitchy.", "verified": true, "helpfulness": "1/1", "author": "Daniel Santos"}, {"rating": 5.0, "review": "Its the best 40 bucks I never spend. Very happy for my purchase", "verified": true, "helpfulness": "1/1", "author": "Jeff Torres Stockton Ca"}, {"rating": 4.0, "review": "Works great so far.  The only thing I can think of to improve the stick right now would be to add in some sort of control it can have to shut my tv off and control the volume.  That would be dandy.", "verified": true, "helpfulness": "0/0", "author": "Badger2011"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jennifer H. Plank"}, {"rating": 5.0, "review": "Very convenient way to watch movies.  Easy to install and good price.", "verified": true, "helpfulness": "0/0", "author": "Linda In SJ"}, {"rating": 4.0, "review": "So far so Good.  It has crashed a few times while watching but don't know where the blame lies.  the remote is small (easy to lose) and unlit.  However, I love the the FIrestick responded to my cox cable remote without having to do any setup.", "verified": true, "helpfulness": "1/1", "author": "Gregory E. Greene"}, {"rating": 5.0, "review": "Love it! My daughter sent it as a Mother's Day present & she knows me well!!", "verified": true, "helpfulness": "0/0", "author": "jennifer m boroughs"}, {"rating": 5.0, "review": "Perfect for my 4yr old. it has all the games and movies his heart could desire. it's one of the only things that can occupy him on a rainy day. We love it. I might take it out of his room for a night and put it in mine so I can watch some of the movies myself", "verified": true, "helpfulness": "1/1", "author": "jessica"}, {"rating": 5.0, "review": "wish we had bought two, instead of just one", "verified": true, "helpfulness": "0/0", "author": "pat \"motleyone\""}]