[{"rating": 3.0, "review": "I can't get it to work.  Waiting for my grandsons to comehelp me.", "verified": true, "helpfulness": "0/0", "author": "Woody"}, {"rating": 5.0, "review": "I'm a devoted Apple customer but until AppleTV gets the Amazon app or fix the AirPlay issues with the 2nd generation model this is the way to go to enjoy your Amazon content.  Plex is also free in the app store so you can stay connected to your owned digital media without purchasing a season pass from Plex.  Especially fun are the games like Ski Safari, bowling and most of all Fibbage!  Me and my Thanksgiving guest had lots of fun playing Fibbage which allows everyone to play via their phone... the one time I don't mind my guest having their head in their apps.  I plan to take the Fire TV Stick on the road with me for Christmas travel.", "verified": true, "helpfulness": "0/0", "author": "Rusty \"Amazon Faithfull\""}, {"rating": 4.0, "review": "good seller. recommended", "verified": true, "helpfulness": "0/0", "author": "park hun young"}, {"rating": 2.0, "review": "I am very disappointed this fire stick has no vudu and no nhl game center which is why I bought it.", "verified": true, "helpfulness": "0/1", "author": "Aaron Cecemski"}, {"rating": 5.0, "review": "Perfect just perfect!", "verified": true, "helpfulness": "0/0", "author": "DON T."}, {"rating": 4.0, "review": "I would of given 5 stars but feel that it needs more apps.  Besides that it works well.  Very responsive.", "verified": true, "helpfulness": "0/0", "author": "M. Kramer"}, {"rating": 3.0, "review": "When it actually works, it's great. I've found after dozing off watching a tv series that when it's on for an extended time or after it downloads and installs a big update, it gets too warm and becomes useless. When I press the right button it will move once, completely freeze for ten to thirty seconds and then scroll through uncontrollably for thirty seconds. Then it won't recognize the select or back buttons. The only solution is to unplug it and wait for it to cool down. I only paid $20 for it when it was on sale, but I still expected more from a final release from a major company.", "verified": true, "helpfulness": "1/1", "author": "Justin Thell"}, {"rating": 5.0, "review": "Easy setup.Larger display on my Smart TV.Remote is easier to use than TV remote.", "verified": true, "helpfulness": "0/0", "author": "Farmer Griffin"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to set up and works very well.  The Amazon Movies and You Tube are my favorite apps.", "verified": true, "helpfulness": "0/0", "author": "Tom Whissel"}, {"rating": 5.0, "review": "Just got mine today. 10 days eailer than original delivery date. I was just planning on sticking this in the TV in the bedroom but as of now it has replaced my Apple TV in the living room. I found an app that lets me use AirPlay from my iPhone. It even mirrors my display on the TV. Very cool.The games you can play with the remote are surprising fun and with some pretty good graphics, especially coming from such a small device. This thing ownes the Apple TV. (2nd gen) and that's coming from a diehard apple fanboy.Installation was a breez. Plugged it in, connected to my wifi, installed the latest firmware and downloaded the apps of my choosing. I bought this when it was only 20 dollars but even 40 bucks is a great deal.  Can't wait for the iOS app.", "verified": true, "helpfulness": "0/0", "author": "Ryan T."}]