[{"rating": 3.0, "review": "It's a little primative. It would be nice if it had a keyboard", "verified": true, "helpfulness": "0/0", "author": "julie"}, {"rating": 5.0, "review": "Decided to cut cable TV (as many here have) and am never looking back. I've been an avid SyFy follower since it's start but kept losing track of my favorite series. Now, without ANY commercial interruption, I have caught up on three years of missed episodes from variuos shows. This has been one of my best investments...all I have to say is, happy happy joy joy!", "verified": true, "helpfulness": "0/0", "author": "John P. Doran"}, {"rating": 4.0, "review": "The only thing I didn't like was it mirrors instead of streaming . Other than that  greT. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "kathleen smith"}, {"rating": 5.0, "review": "Great product. Very easy set-up, nice user interface, fast operation.I originally bought it because Chromecast does not get Amazon Prime videos. After using it, I have to say I prefer it over the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Stargazr"}, {"rating": 5.0, "review": "These are great!  I have one for every TV in my house and office.", "verified": true, "helpfulness": "0/0", "author": "Doc714"}, {"rating": 1.0, "review": "you get what you pay for", "verified": true, "helpfulness": "0/2", "author": "Delphine"}, {"rating": 5.0, "review": "Awesome -- If You're a Prime Member, there's nothing to beat it.  Movies, TV, your music.  Everything.  It's literally plug in a go.  As long as you have wifi, all you have to do is plug the stick in to your tv and into a plug on the wall, log in to your wifi, and then you are good to go.  I bought this because my \"classic\" Roku was becoming obsolete -- Roku offered some good deals on an updated Roku device, but because I can play all my Amazon music (I'm a Prime Member and have all  my music via Amazon), I went for the Fire Stick without a second thought.  My tv is connected to Bose speakers, so now I can stream my music and everything else.  Just get it.  It's the best.", "verified": true, "helpfulness": "0/0", "author": "Kcpeyton"}, {"rating": 5.0, "review": "I like it, no complicated instructions,", "verified": true, "helpfulness": "0/0", "author": "CLK"}, {"rating": 5.0, "review": "Amazing piece of technology.  Worth it even if you have a \"smart\" tv.  Totally stable system that is lightning fast and intuitive.  I have since bought 3 additional tv sticks.", "verified": true, "helpfulness": "0/0", "author": "Bobby Jobsite"}, {"rating": 5.0, "review": "worked good", "verified": true, "helpfulness": "0/0", "author": "Jim"}]