[{"rating": 5.0, "review": "I will qualify this review by saying I only bought it for one purpose: Streaming Hulu Plus.  It says it can do other things and use other applications, but I don't know about any of that.  I wanted something where I could stream Hulu Plus in a way besides my PS3.  I have the slowest DSL connection available (1.5 whatevers per second).  It's so slow that my Sony Blu-Ray player won't stream it.  But this little dandy does a great job.  You plug it into a USB port on your tv, plug it into an electrical outlet, let it update itself, and whammo!  It has a very simple remote and is very easy to use.  There are rare occasions where it won't stream a show but the PS3 will, but that's the exception and not the rule.  All in all, it was a great investment,,,, and I bought a second one so I can have Hulu Plus in my bedroom as well!If you want to use it for other things, I don't think I can speak to that.  But for Hulu Plus, it's been a fine purchase and I'm very satisfied.", "verified": true, "helpfulness": "0/1", "author": "dancinhomer"}, {"rating": 3.0, "review": "The product is fine, except was wanting more free things to watch.", "verified": true, "helpfulness": "0/0", "author": "A. Armbruster"}, {"rating": 5.0, "review": "Very easy to use. The android app is also very easy and fun to use.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Riley"}, {"rating": 4.0, "review": "This has made my non-smart tv... smart.Like it a ton, would give 5 starts but there are some quirks about navigating it that I don't like.", "verified": true, "helpfulness": "0/0", "author": "Steven A. Bloomberg"}, {"rating": 4.0, "review": "I'm already using Chromecast but for the promo price I couldn't resist... especially since Fire TV stick supports 5ghz and not just 2.4ghz network. When setting up, I tried to connect it to my 5Ghz network but it wouldn't connect. So I tried connecting it to my 2.4ghz network and it connected fine. Upon connection it did an update, after which I was able to connect to my 5ghz network. However, the connection to my 5ghz network seem spotty and sometimes lags during streaming. I went back to 2.4ghz and connection seem to be more stable. I did some research and it seems like this is a common problem and I'm hoping that future updates will resolve 5ghz connection issues. The only other issue I had after that was with Hulu. When streaming, sometimes the video will slowdown for a couple second followed by skipping a few frames to catch up again, rather annoying. Not sure if anyone else is experiencing this...Other than issues mentioned above I'm really enjoying using this. The remote is a nice touch since I can navigate without pulling out my iPad (oppose to streaming from Chromecast). The remote uses Bluetooth technology so line of sight to the device isn't necessary, even though I'm not sure how good the range is (I sit about 7 feet away). I used to never watch Amazon prime anything since I only watch shows/movies on my big screen. Now I'm starting to explore what's available on Amazon Prime.Between this and Chromecast I still Chromecast to be a little more stable, but I'm thinking the Fire TV Stick should be more future proof. With a dual core processor and 5Ghz network support, I'm hoping that some future update would make it support 4k video.", "verified": true, "helpfulness": "1/1", "author": "ponch910"}, {"rating": 4.0, "review": "This Item has worked on several different TV's. So far it has run without any issues.", "verified": true, "helpfulness": "0/0", "author": "Henry"}, {"rating": 5.0, "review": "Want another one.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 4.0, "review": "I would recommend this to a friend", "verified": true, "helpfulness": "0/0", "author": "Jean M. \"Jean Miller\""}, {"rating": 2.0, "review": "I wanted to love the Fire Stick, but I am disappointed.  Out of the box, the remote was hard to open.  Once I plugged it into the TV the quality of video playback was not good. I checked the settings to ensure they were set to the highest quality, but it still looked like SD not HD. I tried it on two different TVs with the same result.  I did not use the fire stick for 3 days and then when I finally went to try to use it again, the remote lagged behind my button presses almost an entire minute. I was unable to play any videos because the remote was almost useless.  I may have just received a bad unit, but it is going back to Amazon.", "verified": true, "helpfulness": "1/2", "author": "Madame La"}, {"rating": 5.0, "review": "On par with my Apple TV, at a cheaper cost point. Wish it had the MLS Live app.  Hopefully more apps will be added.", "verified": true, "helpfulness": "0/1", "author": "Howard Daffin"}]