[{"rating": 5.0, "review": "Best of the TV sticks....", "verified": true, "helpfulness": "0/0", "author": "David A. Frye"}, {"rating": 5.0, "review": "Love it! Easy to use and it's very responsive - much better than the Chormcast I have. I had to buy an HDMI hub to handle the extra devices since each device needs an external 5v power supply. I highly recommend this if you have Amazon Prime, take advantage of the services offered by amazon with this device.", "verified": true, "helpfulness": "0/0", "author": "JSTARZ"}, {"rating": 1.0, "review": "It's slow Hulu is almost unwatchable.", "verified": true, "helpfulness": "0/2", "author": "Stephen Lim"}, {"rating": 4.0, "review": "I have the Fire TV box in my living room and the Fire TV Sticks in our bedrooms. Sometimes it freezes up for a second but it's not too bothersome. However, sometimes in the middle of a show it would just go back to the home screen. If that happens go to settings and just restart the system. If you do that once every couple of days it keeps that from happening.", "verified": true, "helpfulness": "2/2", "author": "Coppermom"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Alex C."}, {"rating": 5.0, "review": "Works great had no trouble with it. Apps work fine. Downloaded my iphone pictures automatically.", "verified": true, "helpfulness": "0/0", "author": "bernie y"}, {"rating": 5.0, "review": "Awesome. I just wish it had The voice search option like the box remote did", "verified": true, "helpfulness": "0/0", "author": "nyle"}, {"rating": 5.0, "review": "Does the job it's supposed to do for a great price. Recommend!", "verified": true, "helpfulness": "0/0", "author": "Sabrina Booth"}, {"rating": 1.0, "review": "TERRIBLE!!!  We had this for a month (and unfortunately missed the return window by 2 days) or I would return it today.  The FireTV Stick EATS through data at an INCREDIBLE rate.  Normal usage for our family before the fire stick is under 100 GB for 2 laptops, 3 ipads, 2 iphones and occasional use of a ROKU, and I even work from home, so I am always on the internet.  Once we added in the Fire TV Stick, our usage maxed out our 300 GB home internet plan.  Completely ridiculous and now not even an option.  Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Toddler Mom"}, {"rating": 4.0, "review": "Got it at the introductory / launch price of $20. At that price, it's worth trying. We're not huge TV or movie watchers, but I like the device. We're using is on a 9 year old Sony LCD TV that only has one HDMI port and pre-dates Smart TVs. So, the Fire Stick makes a relatively dumb TV...\"Smart!\" Used it to watch a couple things on Netflix and a couple Youtube videos now and then. Initially, I had some installation issues. There was a glitch when pressing buttons to type the name of a program in the search field. Letters would repeat rapidly or backspace would erase the whole word. I didn't know how to resolve. Spent ~30 min getting in touch with a warm body at Amazon. Eventually, they suggested I discount and restart it. (I know, I should have tried this on my own. I certainly hear it enough from the corporate IT department at work.) No issues since then. Using it for 10 months now.", "verified": true, "helpfulness": "0/0", "author": "LiveSimply"}]