[{"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "JOSE G. ROMAN O. \"JOSEG\""}, {"rating": 5.0, "review": "I have a 50\" TV that is not a smart TV.  Awesome price, so simple and unbelievable!!! I would have paid $139 for it.", "verified": true, "helpfulness": "0/0", "author": "Straightshooterron"}, {"rating": 5.0, "review": "What a value!  Easy to use and it really helps you figure out what you get from Prime Video.  I didn't take advantage of Prime Video previously because it was just too difficult via my Smart TV apps.  I'm looking forward to the addition of HBOGo.  Product recommendation - add a Web Browser.", "verified": true, "helpfulness": "0/0", "author": "HDMaven"}, {"rating": 5.0, "review": "TV <3", "verified": true, "helpfulness": "0/0", "author": "katie ifert-miller"}, {"rating": 5.0, "review": "I first bought a ROKU and I promise you...setup for the Fire TV was WAY easier.  ROKU renamed my Netgear WIFI router unbeknownst to me and as a result none of my devices could connect to the internet.  After wasting a whole of time figuring out what was broken and then spending more time getting things back to the correct configuration, I boxed up the ROKU and sent it back.  But back to the Fire TV Stick...basically all you do is plug it in your TV, connect the power, enter your WIFI password and you're ready to go.  Easy!  I do recommend it, and if you're a prime member, it's a bonus.", "verified": true, "helpfulness": "0/0", "author": "JETinKansas \"JET Reader\""}, {"rating": 2.0, "review": "Make sure you look in to all TV options before you order the Fire stick.  I ordered it to save money.  It is actually a money pit.  You still have to pay for Netflix.  The advertisements for the Fire stick are misleading.  It seems that it is included.  You still have to pay the monthly fee for Netflix even if you have Amazon Prime..  I would have been better off just ordering a product like Netflix through another outlet.  I have spent a day trying to set up the firestick and some of the APPs.  I found out about the other charges by speaking to 4 different customer representatives.  What a waste of a day.  Just wanted to get something nice for my family to enjoy during this cold winter.  Now I regret the decision to go with the Firestick.  Be careful!!!", "verified": true, "helpfulness": "0/1", "author": "Duped by Amazon Prime/firestick"}, {"rating": 5.0, "review": "Maybe the cheapest and most compact ways to get netflix and other streaming to your TV. We really love this. It was easy to set up and easy to use.", "verified": true, "helpfulness": "1/1", "author": "dfm24"}, {"rating": 4.0, "review": "Functions well on both TV and iPad. Movie selection could use improvement. \"Recently added\" section always seems to show the same movies indicating not very many new movies are added. The Fire Stick will give me the opportunity to view some movies which I would not have spent the money to rent. I am not totaly familiar with the Fire Stick yet - Amazon is as always looking for a review before I get a chance to use the Stick enough to develope an informed opinion about it.", "verified": true, "helpfulness": "0/0", "author": "William Marshall"}, {"rating": 2.0, "review": "Enjoy the music part. But the mivies and tv as advertised is cost..This was not apparent in viewing the product..Would not do again.", "verified": true, "helpfulness": "0/0", "author": "brenda case"}, {"rating": 5.0, "review": "This is so much better than the Chrome Cast.  I love being able to add apps to it for specific channels.  Easy access to Prime media, and all the other online media services like Netflix.  I am going to buy another one of these to replace my Chrome Cast in the bedroom.Update.  I have since purchased the Fire TV which is about the same, but with a few more bells and whistles.  One thing I have noticed about the Fire TV Stick, is that it quite often loses my Netflix account information, requiring me to log in quite often.  This is very annoying trying to type in a full email address and password without a keyboard.  I still love the Fire TV products, but I'm considering purchasing another Fire TV to replace my Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Cebob"}]