[{"rating": 5.0, "review": "Easy setup. Works great. Lots of movies &TV; shows. Price is good.  Can cut back on cable &pay; for fire stick.  Buy one.", "verified": true, "helpfulness": "0/0", "author": "Rodger Beaty"}, {"rating": 5.0, "review": "I really like the Fire stick, it's easy to use and set up. Unfortunately I discovered there are a great deal of movies I have to pay for, even older movies. I thought I would have a lot more free movies being a prime member. :(", "verified": true, "helpfulness": "0/0", "author": "Jessie"}, {"rating": 5.0, "review": "Great services and a great price. Very easy setup!", "verified": true, "helpfulness": "0/0", "author": "Mark Grin"}, {"rating": 5.0, "review": "Was everything i was hoping it would be! Very easy to hook up and very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "ashley m"}, {"rating": 3.0, "review": "I'm not too happy with it because i keep having connection issues with my wifi, but my xbox360 connects fine so do my other wireless devices which leads me to believe that it is not my router the issue its the fire stick. I do give it three stars though because when it is connected works good runs smoothly nd plays consistently", "verified": true, "helpfulness": "0/0", "author": "luis echeverria"}, {"rating": 5.0, "review": "Easy setup. Lots to choose from but don't expect a lot of first run access without paying. It is a nice little gadget and expands the capabilities of your television especially if it's a Philips that isn't software upgraded. Some interesting add-on free apps. Lots more that ask for payment.", "verified": true, "helpfulness": "0/0", "author": "Sean Logan War"}, {"rating": 5.0, "review": "I don't write many reviews but this purchase compelled me to share my experience.This is simply the finest streaming stick we have encountered. We required one for a bedroom that received a weak wi fi signal. After trying all of the competition plus a wi fi range extender, I decided to give the Fire Stick a shot. It was a fabulous decision. This little gem effortlessly streams Netflix and other services in a matter of seconds. The device is very easy to set up and the remote is slender and comfortable to the touch. The Amazon Fire Stick is a small but powerful tool for anyone seeking streaming options that are top of the line as well as affordable. Keep up the great work Amazon!", "verified": true, "helpfulness": "1/1", "author": "Richard Buckland"}, {"rating": 5.0, "review": "Is as advertised and more.", "verified": true, "helpfulness": "0/0", "author": "Billy-Bob Bubba"}, {"rating": 5.0, "review": "Awesome, totally worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It makes late night watching more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "John Scott"}]