[{"rating": 4.0, "review": "Still trying to figure out everything I can do but I'm having a blast doing it. Got to figure out how this cloud thing works but I'm having a blast doing it. The games- Good  The Movies-good  The TV shows-goodI find it much more enjoyable than Chromecast more content, and I'm getting ready to order the game controller next week.", "verified": true, "helpfulness": "0/0", "author": "Charles Jones"}, {"rating": 5.0, "review": "The Fire TV Stick does everything that it said it would do.Very easy to install and set up. Very fast shipping too. Happy with the whole experience!", "verified": true, "helpfulness": "0/0", "author": "Janice9487"}, {"rating": 5.0, "review": "I like it. I use it in my spare bedroom where I don't have a hook up for direct TV. It works great. Ya just gotta make sure you have a fast internet connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install, started using it immediately", "verified": true, "helpfulness": "0/0", "author": "Thomas J Shambo"}, {"rating": 5.0, "review": "Love my fire stick", "verified": true, "helpfulness": "0/0", "author": "Laura Nutter"}, {"rating": 5.0, "review": "It has been great and streams movies and shows great!", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "marshall scott"}, {"rating": 5.0, "review": "Travel friendly. Works great!", "verified": true, "helpfulness": "0/0", "author": "C. I. Martinez \"CIM\""}, {"rating": 5.0, "review": "One of the best and easiest to use streaming sticks out there. It's the one to get if you're an Amazon Prime subscriber, and if you're not.. The easy to use native menu, an the ability to allow you to add/sideload android apps directly from your phone makes it the most flexible stick out there.", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 5.0, "review": "So much easier to use than chrome cast. Offers alot for a smll bundle and price.", "verified": true, "helpfulness": "0/0", "author": "Dale Phipps"}]