[{"rating": 5.0, "review": "Just what I was looking for! I love this product!", "verified": true, "helpfulness": "0/0", "author": "Reva"}, {"rating": 5.0, "review": "Awesome product, love it", "verified": true, "helpfulness": "0/0", "author": "Samuel"}, {"rating": 3.0, "review": "Just ok for me. For some reason Amazon devices have the most difficult time connecting to my wireless. All other devices work fine, very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Trippster"}, {"rating": 4.0, "review": "Great options buy 13.99 to purchase movies may be a little much", "verified": true, "helpfulness": "0/0", "author": "Derwin Isaiah"}, {"rating": 2.0, "review": "I expected much more free movies than what is offered. I am disapppointed.", "verified": true, "helpfulness": "0/0", "author": "Kevin O'Rourke"}, {"rating": 5.0, "review": "The amazon fire stick is great product. But may have some slow responses to certain thingsthat you are trying to do, But other wise it a good product.", "verified": true, "helpfulness": "0/0", "author": "breylencarter"}, {"rating": 4.0, "review": "overall it works fine.  The phone app is also very handy.  However I am disappointed that about every three days I have to unpugged and reset it because it has frozen", "verified": true, "helpfulness": "0/0", "author": "Eddie"}, {"rating": 5.0, "review": "I've been a loyal Roku user since the 2050x model, but with all the changes in streaming, I started to look around. I tried Chromecast, but ended up not liking it for various reasons.  As a Prime member, the Amazon Fire TV Stick looked like a good option. I read various reviews on the earlier models of Fire TV and that it had been improved recently.  I am very glad I switched!! The usability, speed, access to Prime content (video and music), and overall quality are amazing!!  If I were not a Prime member, I would still recommend the Fire TV Stick, but the integration with Amazon Prime is a big plus.", "verified": true, "helpfulness": "0/0", "author": "ri music guy"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "Very good product!", "verified": true, "helpfulness": "0/0", "author": "John Eschenburg"}]