[{"rating": 2.0, "review": "First off when I first opened the package I felt like Christmas was happening all over again, the remote fits in your had nicely and it was really easy to set up and navigate(unlike the Apple TV which has the smallest remote in the world with horrible range, seriously if you do not point the remote directly at the box it won't work. Also navigating the menu is like finding your way through the labyrinth.) I've had this product for about a month now. It worked great for the first three weeks but then Netflix started to skip. At first it wasn't anything annoying, maybe 5 seconds of a frozen picture while the audio played. This happened maybe once an hour. Yes I have the Firestick plugged into its optional power source and it's only 25ft from the router with full signal strength. I ordered a second one before this issue started but if it continues I will end up sending both back. I might try the fire box with hope that it will have better range but I was hoping to keep the clutter down.On another note it's still better than the Apple TV. I would give that p.o.s a negative rating.", "verified": true, "helpfulness": "0/1", "author": "xxSilverFoxx"}, {"rating": 5.0, "review": "Love my new Fire TV stick!!!", "verified": true, "helpfulness": "0/0", "author": "Gina gastineau"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is great. It is the simplest way to bring streaming programs to your television. Simply plug it in, connect it to your wifi network and you can kiss commercial television good bye. For me there are only about 4 commercial programs I still watch, the rest is total junk. I can how watch T.V. exactly they way I  want.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey J. Greene"}, {"rating": 5.0, "review": "Eazy peezy...Anyone can set this up and a dream to navigate and use", "verified": true, "helpfulness": "0/0", "author": "Ursula Prinsloo"}, {"rating": 5.0, "review": "LOVE!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 1.0, "review": "I've had this thing for a few months and have been waiting for a firmware upgrade or something to fix some of the obvious problems.  I got one of the early one and this product was not ready for release.  It locks up for no go  od reason constantly needing a reboot.  When watching Hulu for example tonight it would load an episode, play the commercial, then just sit there with the Discovery channel bug in the corner for 2 or 3 minutes then say it was having trouble with the video.  Normally I would blame this on Hulu but it pulls these stunts all the time.  Netflix stalls constantly and some nights will just stutter and lose a second or two of programming every few minutes.  From then on the audio will be out of sync and the only way to fix it is to stop it then resume.  Doing that 3 or 4 times in a 1/2 hour tv program can be really irriatating.  Then just when I'm ready to smash the thing with a hammer it will work OK for a day or two.  It seems like Amazon has been doing this a lot lately.........releasing products that aren't quite ready yet.  Looking at some of the reviews tells me I'm not the only one having these problems.  They are ROOKIE MISTAKES.  I used to thing Bezos was a smart guy but either he is a moron or has allowed morons to take over his hardware business.", "verified": true, "helpfulness": "0/0", "author": "Mark in Reno"}, {"rating": 5.0, "review": "We're slowly removing DirecTV from our lives. Happy with the reception & available programming.", "verified": true, "helpfulness": "0/0", "author": "TAC"}, {"rating": 5.0, "review": "Thank you Amazon for entering the streaming video device market with another winner. I bought the first iteration of Amazon's streaming device, the Fire TV, shortly after it came out. I have had great success with that device so when Amazon released this second version I ordered it immediately. It works just as well as the first. The Fire TV Stick has 1 gb (the original device has 2gb) but I have never had a buffering problem with either device. If cost is a concern and you want a great streaming device at a good price, this is for you.", "verified": true, "helpfulness": "0/0", "author": "Techno geek"}, {"rating": 2.0, "review": "Wifi reception is weak, the Plex and Slingplayer apps are poorly done compared to the Roku versions, and the thing has frozen up on me a few times after streaming a movie or two.  Glad I got the $20 deal.  Going to try and return it but I foolishly didn't even use this thing until 2 months after I got it.", "verified": true, "helpfulness": "0/0", "author": "Bert\tSchneider"}, {"rating": 1.0, "review": "I thought I would be getting more  free stuff. For example I have been watching Desparate Housewifes on my lap top and streaming it to my TV with HDMI and the first two episode were free.  These same episodes using the Fire Stick requires a fee.", "verified": true, "helpfulness": "0/1", "author": "zola"}]