[{"rating": 5.0, "review": "I love this. Easy to hook up and get started", "verified": true, "helpfulness": "0/0", "author": "Ashley Moore"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 4.0, "review": "Very simple to attach to the television and it basically just works immediately. Presto.Four stars instead of five because I'm a little disappointed with the way that their menus are laid out on the screen.The search function is outstanding. But I don't find browsing to be all that user-friendly.So if you know what you want to watch, it's easy to find. If you don't, browsing can be fruitless. For browsing, I actually tend to switch over to Apple TV and/or Netflix, which I also have.Some people have expressed disappointment with the remote. I think it's great. It does everything I need it to do and very simply and quickly. I have not tried the app yet.For me, I was deciding between the stick and the box. The stick meets all of my needs. I use Fire TV just to watch tv shows and movies, though. Maybe there are advanced functions for which this would be insufficient.I like the fact that it is fast. For Netflix on Apple, there is always a slight delay -- less than a minute, but it's a little annoying when you click from menu to menu and have to wait. In contrast, Fire delivers instant response. I like that.Glad I got it. Amazon Prime seems like a pretty good deal.", "verified": true, "helpfulness": "0/0", "author": "KeithPort \"Keith\""}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "J Trevor Harrison"}, {"rating": 2.0, "review": "Has trouble receiving wireless signal and keeping connected... I think they have some work to do on this and the regular Amazon TV Box hard wired is a much better product.", "verified": true, "helpfulness": "0/0", "author": "Jason W"}, {"rating": 5.0, "review": "I have been very satisfied eith the Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Clifton R Laine, Jr."}, {"rating": 4.0, "review": "Really a great item", "verified": true, "helpfulness": "0/0", "author": "joe demarco"}, {"rating": 3.0, "review": "Easy access to channels. But connectivity is really slow. The movies freeze alot.", "verified": true, "helpfulness": "0/0", "author": "lola"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "mark"}]