[{"rating": 5.0, "review": "I love it.  It has been great to have access to all of my Amazon stuff on our tv.  We used to use a gaming system to watch Netflix and Hulu, but with this tv stick I was able to clean a lot of the clutter off my tv cabinet.  This stays plugged in to the tv neatly, and takes up no space.  It was easy to set up and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dory Gale"}, {"rating": 5.0, "review": "I've at one point or another had every streaming device from Apple TV to google chromecast to fire TV and the best thus far is the fire stick! I say this because the games alone blow the Roku out of the water and the selection of games are amazing. I'm a prime member and have been for years! Amazon is my go to, one stop shop for anything and nearly everything I could ever need... Great job! Only complaint is that the Apple iOS app is currently unavailable but I know it's in the works so not really a mark against the device!", "verified": false, "helpfulness": "1/1", "author": "J. Stromgren"}, {"rating": 2.0, "review": "As Prime Member, read about and saw availability and sale price at Best Buy so returned unopened Roku3 and purchased and  installed Stick. on Bedroom non-smart TV. Very pleased.with initial installation, even recommended purchase to friends but in 2-3 days stick performance became unstable as it  would not recognize my network. Maybe just a fluke but Returned Stick to Best Buy and repurchased highly rated Roku 3 with extended warranty at Target Three times the price but feel more confident about product. Works great with network. Because I have I-pad and I-phone, would have purchased Apple TV if it had Amazon Prime accessibility.", "verified": false, "helpfulness": "0/1", "author": "Captain Nemo"}, {"rating": 5.0, "review": "Impressed with streaming. Streams better than iPad or computer over same network. I have not seen any buffering as of yet. Makes for an enjoyable movie experience.", "verified": true, "helpfulness": "0/0", "author": "m2surveyor"}, {"rating": 1.0, "review": "Useless for iOS", "verified": true, "helpfulness": "1/2", "author": "RealTime_Review \"Electronics Geek\""}, {"rating": 1.0, "review": "I wanted to like Amazon Fire Tv Stick, but it doesn't live up to Amazon's usual quality.The Android app is clunky. The screen is cluttered. There are no volume or power controls. And in under a day,  I've already run into a bug trying to watch Amazon's own Prime video. (Sound plays, menu and controls are visible,  however there is no picture.)I'm not impressed.", "verified": true, "helpfulness": "1/3", "author": "Ashley Parker"}, {"rating": 4.0, "review": "I would have loved it if it would mirror my Nexus 7. It only mirrors some Kindle tablets.  Everything else works great.", "verified": true, "helpfulness": "0/0", "author": "Bill Baehr \"whipperin1\""}, {"rating": 5.0, "review": "This is a great casting device.  I really like the on screen menus/choices.  It makes it very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Thomas L. Dooley"}, {"rating": 5.0, "review": "Very nice.  It's easy to install (plug one end into an HDMI slot and the other into a power source, then connect to the internet).  The cartoon intro video is quick.  The remote with the clickable (outside) directional wheel is easy to use and the android app (ff, rewind or pause anywhere in the app's grey box) is great too.  Prime videos stream easily and quickly.", "verified": true, "helpfulness": "0/1", "author": "PPosey"}, {"rating": 5.0, "review": "I love this little thing. I have Amazon prime so this is like a great add-on. I can easily play spotify on my TV for a little in-house party or play some shows I didn't know existed. It would be great if there is a mac app so I can control the TV from my laptop too.", "verified": true, "helpfulness": "0/0", "author": "Bernard Wong"}]