[{"rating": 5.0, "review": "Works as advertised on my Sony TV", "verified": true, "helpfulness": "0/0", "author": "Robert W Callaghan"}, {"rating": 3.0, "review": "I already had the Fire TV Box and have it hooked to my projector and amp/tuner. I love it, especially the speak into remote control feature. I am always looking for way to cut the cable for TV so when I saw the offer for Sling TV with a free Fire TV Stick I jumped at it. The hook up was easy and only took about 1 min. if that. I dialed in the Wi Fi and was off and running. 1st thing I miss is that the remote for the Stick does not have the speak in remote feature which I have become accustomed to. But I mainly wanted the stick to take with me on trips or to a friends house, so I can live without it, I just thought that Amazon could have included it with the remote. The thing that I am having the most problem with is that in the middle of some shows and movies (especially Mortimer Gibbons series which my grandkids love), it stops to buffer and sometimes will not come back to the program, but freezes up. The Fire Box has not done this so far. Otherwise I have been happy with the Stick and would like it even more if I did not already have the Fire TV Box to compare it to. I still think that it was cheap of Amazon not to include the speak feature. Oh well, I just found out I can load an app to make my cell phone a speaking TV tuner. And it's FREE!!!", "verified": true, "helpfulness": "1/1", "author": "Terry F"}, {"rating": 5.0, "review": "Great way to watch TV. If your a prime member it's a waste not to have. No shortage of things to watch.", "verified": true, "helpfulness": "0/0", "author": "Danny Lee"}, {"rating": 1.0, "review": "Didn't like it. Very few options to watch free movies for Amazon prime members.", "verified": true, "helpfulness": "0/0", "author": "Sanjeet Rakwal"}, {"rating": 5.0, "review": "Great gadget.", "verified": true, "helpfulness": "0/0", "author": "Joe E Martinez, Jr."}, {"rating": 4.0, "review": "So far it works great. I watch HBO Go and Netflix no problem.", "verified": true, "helpfulness": "0/0", "author": "Timothy J McCarthy"}, {"rating": 5.0, "review": "We love it, provides alot of movies etc...", "verified": true, "helpfulness": "0/0", "author": "Tina Pfisterer"}, {"rating": 5.0, "review": "Works great. Has everything I need.", "verified": true, "helpfulness": "0/0", "author": "Lourdes Salazar"}, {"rating": 5.0, "review": "compact, portable and effective. great for travelling, unbeatable once coupled to amazon prime.", "verified": true, "helpfulness": "0/0", "author": "dadinmontreal"}, {"rating": 5.0, "review": "Great invention....we even took it to the hotel! Can't believe we waited so long to purchase.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ariana"}]