[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "cksly"}, {"rating": 5.0, "review": "Very convenient, and outstanding utility.", "verified": true, "helpfulness": "0/0", "author": "J.B. White"}, {"rating": 5.0, "review": "Very powerful and functional.  Excellent Value", "verified": true, "helpfulness": "0/0", "author": "MPS \"Waterboy\""}, {"rating": 4.0, "review": "I love that I can watch Netflix and Hulu on my TV! However, even when I'm connected to my network, and my other devices are using my internet connection just fine, I usually have to restart my fire account or sign out then back in to Netflix or Hulu every other time I use my fire stick. Even with the inconvenience of the small starting hiccup, overall I love the product.", "verified": true, "helpfulness": "0/0", "author": "Meghan Curtis"}, {"rating": 5.0, "review": "Price, quality, and selection is all on point.  I hope this brings society one step closer to full internet TV.", "verified": true, "helpfulness": "0/0", "author": "Dan Graham"}, {"rating": 4.0, "review": "The whole package is precise and perfect, and the remote controller work amazing. The only drawback is you need to restart the power of the stick sometimes as it would go idle when not in use for a while.", "verified": true, "helpfulness": "0/0", "author": "Margaret Zhao"}, {"rating": 5.0, "review": "Love it, very cool device. setup is super simple, makes amazon prime video very easy to use and quick.", "verified": true, "helpfulness": "0/0", "author": "L McLaren"}, {"rating": 4.0, "review": "It's a nice little streaming stick. Had a few times where it froze up and had to reset it. Nice list of channels but still prefer my Roku 3 over this.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "Great product! Very fast to play movies on Netflix. Spotify connect is awesome!", "verified": true, "helpfulness": "0/0", "author": "Andrea Hernandez"}, {"rating": 5.0, "review": "Still learning and getting familiar with it, but like it so far. The only problem I have had so far is when using YouTube. It will keep freezing and loading. I don't know if that is an internet issue, or if it's because we have three other devices that use WiFi in our home (Though we have a very strong wireless router) or if it's a YouTube problem, or what. Our Netflix has no loading issues though. But we like the Fire Stick so far.....", "verified": true, "helpfulness": "0/0", "author": "Susan M. Davies"}]