[{"rating": 5.0, "review": "Superb!", "verified": true, "helpfulness": "0/0", "author": "GracefulGhost \"Quilting Bee\""}, {"rating": 3.0, "review": "I bought it for 20 bucks as a Prime customer. Very choppy and lag interface which I hope is solved very soon. I have an Apple TV and this doesn't even come close in ease of use and slickness.", "verified": true, "helpfulness": "1/1", "author": "sibeee"}, {"rating": 2.0, "review": "Doesn't work as well as Roku. HDMI cable problems resulting in loss of video. Video and audio arw often out of sync.", "verified": true, "helpfulness": "0/2", "author": "J. Dijk"}, {"rating": 3.0, "review": "I've had it for about a week and it is really promising.  It's fast and easy to install and use.  The fire stick is great for media, but as most know it still lacks the needed HBO go and Xfinity apps.  The thing I don't like about it is that you can't sort through all the Prime options- for example, I can't find a way to look for just a PG or G movie for the family.  It presents options in pre-programmed buckets (like what's new or popular), but I can't take those and refine the list instead I have to sort through lots of options to find suitable programming.  I'll see if parental controls helps here.If the product folks are reading this, the killer app for me would be able to search for movies across any service.", "verified": true, "helpfulness": "0/0", "author": "robk"}, {"rating": 5.0, "review": "Love it. Prime has great movies for free and I like the menu layouts.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "work similar to firetv", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Great item and a great price", "verified": true, "helpfulness": "0/0", "author": "D. Tyler"}, {"rating": 4.0, "review": "For $20 the functionality couldn't be beat, if only it could go into sleep mode while running Plex...", "verified": true, "helpfulness": "0/0", "author": "alfred"}, {"rating": 5.0, "review": "I've been considering buying a Google ChromeCast for a while now, but when Amazon released their own Fire TV Stick, I knew I had to have it.I haven't been disappointed.Quick and easy install. It took a little longer than I was hoping, mostly because there were so many updates to do. But that's to be expected and really, I can't complain too much.It works great with all the apps I use on a regular basis. I primarily watch Hulu, but I occasionally use Amazon Prime Instant Streaming, Netflix, and Pandora. They all work flawlessly. Any issues that I've had have likely been because of my Internet service.The only blip I've had was some strange sound issues that occurred for a few days. We thought it was due to the Internet service, but once we restarted the Amazon Fire TV Stick, all issues cleared right up. We haven't had the same issues since.I'll definitely continue to use this for quite some time to come. Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Jessica McKelden Cave"}, {"rating": 5.0, "review": "A lot easier to use with Netficks than the shakey hand of the Wii", "verified": true, "helpfulness": "0/0", "author": "Harriet A. Dame"}]