[{"rating": 5.0, "review": "Much more useful than my Chromecast has been, flawless streaming of Prime video has been great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Beautiful and user.friendly interface. I live it, would definitely recommend to my friends.", "verified": true, "helpfulness": "0/0", "author": "Julio Lopez"}, {"rating": 4.0, "review": "Nice easy controls, and was a bargain as we pre-ordered.", "verified": true, "helpfulness": "0/0", "author": "Meggles57"}, {"rating": 4.0, "review": "works great so far.  Except miracast.  Can't get anything to mirror.", "verified": true, "helpfulness": "0/0", "author": "Duy T. Le"}, {"rating": 5.0, "review": "Surprise, surprise. I ended up in the Fire revolution. I bought this device to test its suitability in higher education for providing a mirroring platform for Android devices. iOS is covered with Apple TV and AirServer and their protocols, Android - not so much. Chromecast was of course option #1 but I chose to wait, the Roku stick followed then the Fire TV stick. Android has failed to mirror correctly on most of the devices I tested but I'll dedicate this review to my pleasant surprise... as a media device this rocks.I'll still use my PS3 and Playstation Media Server to stream local content from my desktop to my TV but this has pretty much replaced my need for cable. I mostly watch ESPN and CNN with a dash of some other stuff... It doesn't have a CNN live streaming app... but I sure hope it gets one. The HD is clear, buffering is minimal so their codecs are fine (20MB down, 2MB up) and its an all round decent device ESPECIALLY IF YOU'RE A PRIME CUSTOMER.", "verified": true, "helpfulness": "0/0", "author": "DJ Carbon \"\"Whenever you hear something said with a lot of confidence the first thing you should ask is, 'Is that true?\" - Noam Chomsky\""}, {"rating": 3.0, "review": "Great little ice device!", "verified": true, "helpfulness": "0/0", "author": "Jim Reavill"}, {"rating": 5.0, "review": "Gosh, I love this thing.  Plug it in, 2 minutes to set it up, and TV is my new best friend.  Netflix, Amazon movies, photos...", "verified": true, "helpfulness": "0/0", "author": "Mamalolly"}, {"rating": 3.0, "review": "This is the first device of this type that I own, but I've wanted one, so I'd been researching them for for quite a while. Set up was quick and easy and it seems to work well for me.The only problem that I have is that after a while, things just won't play. At first, I thought my internet had slowed down, but when I checked the stick, it was very warm. This happens even when it's in sleep and not being used -- simply from being plugged into the power source. If I unplug it from the power source, it'll cool off and then work great again.  Some people have complained about streaming freezing up even though it worked fine previously, so perhaps unplugging it could solve this problem for some others. I plugged it into my TV's USB port, but that didn't solve the overheating problem.Overall, I really like this type of device and would have considered purchasing Fire TV for another room. However, now I'm hesitant because I don't know if it has the same problem, so I'm going to look into getting a Roku; lower specs but I haven't heard any complaints about performance because of it.If it weren't for the overheating problem freezing it up, I'd rate it 5 stars. It's not worth the $39.00 price tag until they address the issues.1/7/2015 editShortly after writing this review, my fire stick updated, which seems to have fixed the overheating issue. It's been a couple of weeks now, and still no more problems with that. Programs will still freeze up sometimes, but not as often, so it's not entirely related to overheating. It does seem to eat up more bandwidth than streaming from a computer. I've upgraded to 4 stars based on them fixing the issue so quickly and the device functioning so much better now that it isn't overheating.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 3.0, "review": "Set up is easy. I like that it has a remote. However, it buffers all the time. My wifi with my wii and chrome cast do not have this same issue. I've tried to look at the troubleshoot guide, which says check internet connection. However, my internet connection is fine for everything else that uses wifi in my house.", "verified": true, "helpfulness": "0/0", "author": "Twinkie"}, {"rating": 5.0, "review": "LOVE the remote control. I found pausing, rewinding, etc. very frustrating with Chromecast, but this eliminates that frustration.", "verified": true, "helpfulness": "0/0", "author": "Track Eye"}]