[{"rating": 1.0, "review": "Wi-fi issues left and right, set up took hours of trying to sign into wi-fi and download the update, then several reboots later.  Cannot watch a full movie or show without buffering or losing connection to network and I have ample internet speed.  disconnected all items on my wi-fi in my home and logged everything back on one at a time leaving some items off and still getting buffering on all channels including Amazon (which appears to the worst).  Also the response to any function is very slow, everything takes forever to load.  I'm disappointed, the interface and design are very nice and if it worked properly I would be using it.  For now I'm still using my Roku because I'm tired of not being able to watch a full program or movie without having to re-boot the device or getting a notice that I have no wi-fi.  Switch immediately over to Roku and immediately everything pulls up and works within seconds.  Also the picture quality for streaming on both Amazon and Netflix is terrible!  Very grainy and poor quality.  Again, switch directly over to Roku and it looks and works perfectly.  Guess this is just going back in the box, not worth my time to return for $20 and I'm glad that is all I paid for it.  Don't get me wrong love Amazon, own 4 Kindle Fires from second generation to HD to HDX and they are wonderful, I'm very bummed that this product functions so poorly.  It's right now a waste of money, save yourself the frustration!", "verified": true, "helpfulness": "1/2", "author": "Rebecca M"}, {"rating": 5.0, "review": "This is so much better than a chrome cast. Netflix plays better, and I can finally watch prime video on a TV without dragging my computer over and plugging it into hdmi.", "verified": true, "helpfulness": "1/1", "author": "anthony"}, {"rating": 5.0, "review": "How'd I manage without this! I preordered this in October and have been anxiously waiting for it's arrival, when it finally arrived we immediately set it up.  Set up was quick, though a little frustrating that it had to download and update software for 15 minutes or so when it is brand new.  Itruly think anyone who could order this could do the set up, it was very easy and straight forward. Once set up we added netflix and hulu and started streaming shows and movies.  The remote is great, much better than my roku remote, very responsive.We were thrilled with how quickly it loaded movies, much faster than our roku box, also we didn't experience any buffering like we do with roku.This is a great little device and put us one step closer to cutting the cord on cable.", "verified": true, "helpfulness": "0/0", "author": "S. Raffo"}, {"rating": 5.0, "review": "It Works Fine", "verified": true, "helpfulness": "0/0", "author": "John Nutter"}, {"rating": 4.0, "review": "Despite decent software specs, especially for the price, the Fire TV Stick tends to lag every now and then when doing basic tasks like browsing menus, entering and leaving apps, etc. Even then, it's not bad enough that you can't use the device, and software updates will likely fix these issues. Also, when I wasn't experiencing lag, the software was actually blazing fast. That's something that can't be said about Roku's counterpart which was saddled with inferior specs, so give Amazon credit there. This is certainly a good value for the price, and as the company will quickly point out, it's an even better value if you have Amazon Prime.On an additional note, I bought the Fire TV Stick mainly to watch Plex, so it was also disappointing to find out that the app is basically a blown up version of Plex for Android, which means it's much less stable on the Stick. In less than a week I've experienced a few crashes and tons of playback issues. This is to be expected, considering the Plex team didn't build the app specifically for this device, and again these problems will be fixed with a software update.", "verified": true, "helpfulness": "0/0", "author": "Bert Lingo"}, {"rating": 5.0, "review": "Amazing little device. It was easy to set up and I like the android AP. At first I was a little disappointed it didn't have the voice recognition function,  as the Firebox did. but you can do it with the Android app and more. I had some minor buffering issues at first, but not sure it that was a problem with the stick or my WIFI. Considering how inexpensive this is, it's  worth the money if you want to stream on your HD TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer FR"}, {"rating": 5.0, "review": "Enjoying this very much. Very convenient and easy.", "verified": true, "helpfulness": "0/0", "author": "denise shrum"}, {"rating": 5.0, "review": "Hi all. I picked up the Fire TV Stick at Best Buy yesterday; on sale for $24.99.So far, I'm very pleased.When I first connected it, I got the software download with no issues. However, when I tried to get into the settings menues, I thought I had a bad unit. Very unresponsive to the remote. Took forever, but I finally got back to the home screen. Since then, it's been working like a charm.I have Amazon Prime, and that's why I bought this gadget. I've been using a Logitech Revue for Prime. I like the Revue a lot because of the keyboard, and I can use a wireless mouse with it. It works, but it's slow.The stick, on the other hand, is quite fast. Picture quality is excellent. I don't use the other services like Hulu, Netflix, etc. at the moment, so I can't comment on how well they work. But Prime works great for me.My home network is hard wired. My wifi access is from an Apple Airport Express, located about 9 -10 feet or so from the stick. No dropped connections at all so far. Next up is to connect it to my a/v receiver to see if it works that way. Seems some users have problems with it connected to a receiver. I have a 7.2 channel surround system so I'm hoping the stick will work with it.For me, it's been $25 well spent. **Update12/7** Connected the stick to my Yamaha A/V receiver, and it's working fine.", "verified": true, "helpfulness": "0/0", "author": "Jacksmyname \"Jacksmyname\""}, {"rating": 1.0, "review": "I have a Roku 2 and I can say for sure the image quality is much better at the Roku than in the Fire Stick.  I am not sure why, but the video from the fire stick seems kind of 'washed out', not so sharp.The fire stick will also frozen in the middle of a video for no absolute reason. I thought using the fire stick for Amazon video, but I will stay with my Roku 2 for now....", "verified": true, "helpfulness": "1/2", "author": "AA \"AAA\""}, {"rating": 3.0, "review": "I like this because it provides an easy way for me to access Prime Video and Prime Music. Other than that, I don't really see much benefit of this over the Chromecast or Roku. I do like that it doesn't tie up my tablet or phone in some situations like Chromecast does. But, sometimes I do want to sling something from my phone. The remote feels good, but I think Roku does the same thing and is probably more mature. Of course, Jeff B. locks down Amazon services enough, that you probably need this too if you are a Prime subscriber.My biggest negative is that this quadruples the boot time of my television. For some reason the Fire stick crashes my Visio television when I turn it on, reboots it, and then lets it start.... slowly. I haven't tried it on another television yet because I really only want the fire stick in one room of my house, but the interaction kind of sucks.Oh, and setting this thing up is horrible. Well, at least it was for me. It was a half hour of software install failures and incremental updates before I could even interact with the system.I got this for the $20 intro price, which it is worth. If I'd paid the $40 they are asking this would be a one or two star review.", "verified": true, "helpfulness": "0/0", "author": "J. MCADAMS"}]