[{"rating": 5.0, "review": "I purchased my Samsung Plasma 64 inch flat screen a couple of years ago, before smart TV's were readily available. I wasn't concerned because the Blu-ray player came with a Wi-Fi  connection which gave me Netflix but not Amazon.com. With this TV Stick, I get it all. It works great, but I'm worried about loosing the remote. It's so small. So I'm ordering another remote to back this one up. I don't think I need the voice control feature that comes with the more expensive remote. Easy to hook up and activate. Almost too easy. I love it when this happens.", "verified": true, "helpfulness": "0/0", "author": "Combustorbob"}, {"rating": 5.0, "review": "Replaced my Roku 2 XS. Dual band was a huge plus.", "verified": true, "helpfulness": "0/0", "author": "Scott S."}, {"rating": 5.0, "review": "Easy way to stream movies. Set up is super easy.", "verified": true, "helpfulness": "0/0", "author": "gamajeen"}, {"rating": 2.0, "review": "Initial Fire TV Stick buffered to beat the band and dropping link. Replacement resolved the issues.", "verified": true, "helpfulness": "0/0", "author": "R Daniel"}, {"rating": 5.0, "review": "Device works extremely well.  I use with netflix and Amazon Prime and no issues.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "miket3d"}, {"rating": 1.0, "review": "Extremely displeased with this.  When I purchased it as an early adopter, one of the main reasons for the purchase was the Miracast functionality, which should have let me fling my viewing screen from another device to the tv via the Fire stick....which, as it turns out, doesn't work at all with Windows.  So, the stick is \"Miracast\" enabled, but not for everything, which is a really sleazy tactic that they weren't terribly up front about.  I've searched the net, and it's littered with complaints and repeated issues with Amazon support techs about it.  That being said....as a media streaming product, it works fine, but isn't setting my world on fire (no pun intended).  I already had a streaming media player, and even though I'm a Prime member, the stick is now a completely redundant purchase for me at this point.  I love Amazon - but this thing is a huge letdown for me.", "verified": true, "helpfulness": "2/3", "author": "Doug"}, {"rating": 5.0, "review": "Flawless so far. Very quick and reponsive using my high speed internet at 15mbps. Dont usually give 5 stars, or RARELY leave a review but in this case i just had to!", "verified": true, "helpfulness": "0/0", "author": "Ed Norton"}, {"rating": 5.0, "review": "Intuitive menu. Love how easy it is to take advantage of other Prime freebies with this device.  Ended up buying a second one for my sister.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy installation. I loved the fact that it was allready tied to my account.", "verified": true, "helpfulness": "0/0", "author": "Veljko T."}, {"rating": 3.0, "review": "description was not thorough enough for me to know for sure what the product could and could not do, bought it only to realize it offers the exact same things I already have", "verified": true, "helpfulness": "0/1", "author": "Sharon \"Book Addict\""}]