[{"rating": 5.0, "review": "Received it very quick!! Thank you!!", "verified": true, "helpfulness": "0/0", "author": "Eric Amaya"}, {"rating": 4.0, "review": "Why you keep advertising you support Crackle when obviously, you do not?  My primary reason to buy this, and it is not supported, but hey, you get Prime.... never the less.  Fix this!!", "verified": true, "helpfulness": "0/0", "author": "Marcos E Capo Colon"}, {"rating": 5.0, "review": "I love this product, not just because it's so easy and compact, but because of the variety of programs I can watch. If not for Amazon Fire tv Stick, I would have been oblivious to the many hours of entertainment that I have already experienced.Thank You,Sue A., Ma", "verified": true, "helpfulness": "0/0", "author": "Suzanne Andrade"}, {"rating": 5.0, "review": "Great picture works very good buy", "verified": true, "helpfulness": "0/0", "author": "dennis ford"}, {"rating": 5.0, "review": "Love them.  This is my second one, that way I have covered the living room and bed room.", "verified": true, "helpfulness": "0/0", "author": "Honda Rider \"motorcycle wanderer\""}, {"rating": 5.0, "review": "It is a very good buy. Very good product and fast Shipping.", "verified": true, "helpfulness": "0/0", "author": "Frantz Destin"}, {"rating": 3.0, "review": "Has very good options. However, run same show with same service against ChromeCast and the Amazon Fire stick had to constantly stop and rebuffed. Annoying. They need to improve the network connection functions.", "verified": true, "helpfulness": "0/0", "author": "James Hughes"}, {"rating": 5.0, "review": "Came on time, just love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Purchased this so that I could watch Amazon Prime TV, HBO Go, and Netflix in my bedroom.  Setup was a snap (it already had my Amazon account info loaded).  Picture quality is fantastic.  My wife has even used it to play solitaire and other small games.  It's faster and easier to use than my Xbox or Wii for simple media viewing, and has quickly become my preferred option.", "verified": true, "helpfulness": "0/0", "author": "MCM"}, {"rating": 1.0, "review": "The product is very nice and functional, but I tried to use the Prime Video and it didn't work, in anywhere in the description it says that this services only work in the USA, I live in Guatemala and I am a Prime Member but I cannot use this funtion.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Echeverria Monzon"}]