[{"rating": 4.0, "review": "Received the fire stick last sunday. (quite surprised by postal delivery on a Sunday).  plug in was very simple and it was already registered since I am a prime member.Very very simple to use. even downloaded the Fire TV app on my phone to test out the voice commands.  Google chromecast has been banished to one of the bedroom tv's", "verified": true, "helpfulness": "1/1", "author": "Larry Wiggins"}, {"rating": 2.0, "review": "I bought this on the prime sale for $20 the stick will not stay connected to the wireless network and has to be power cycled and the wireless reset daily to continue working.", "verified": true, "helpfulness": "4/4", "author": "Roger Herling"}, {"rating": 5.0, "review": "More than I expected", "verified": true, "helpfulness": "0/0", "author": "Mahmoud Nassan Al makhzoom"}, {"rating": 3.0, "review": "Having problems with non amazon apps like pandora", "verified": true, "helpfulness": "0/0", "author": "Ingrid"}, {"rating": 5.0, "review": "Wow LOVE IT easy to install and it's fast!!! love the phone app!!", "verified": true, "helpfulness": "0/0", "author": "Isaac.F"}, {"rating": 5.0, "review": "Great value for prime members, easy set up. Love this for the second TV in the house. All of our content in a compact stick, easy to access.", "verified": true, "helpfulness": "0/0", "author": "Rebekah Bailey"}, {"rating": 5.0, "review": "So many reviews, so little time. I hope you find this one helpful.I own every Roku made. Have been a loyal customer for years. Their latest and greatest is plugged into my bedroom TV. I had a spare HDMI port on that TV so in went the Fire TV Stick. @ $19, why not give it a try, right?Same TV. Same router. Same distance to the router. Same ISP. Same distance from the controllers to the device. Same electrical outlet. Identical in every way.With everything else covered in the other reviews, I offer these two observations.1. This thing is fast and seamless. Instantaneous, in fact. My Roku's aren't necessarily slow but the Fire Stick is amazingly faster. Not just the download but the entire experience of deciding what you want to watch or play.2. This thing handles YouTube. Roku was late adopting YouTube and they still don't have it right. It's painstakingly slow and invariably hangs on both the Roku box and the Roku stick.  Not on the Fire Stick. 60 minute workout and it was flawless as to both search results and playback. The interface isn't quite perfect yet but certainly workable. My grandson is so, so, happy as he likes to stay over and, on Friday nights only, stay up late cruising YouTube. Now he can do it on the big screen in his room.Bottom line: If YouTube is on your list of streaming needs, get this, even if you currently have a YouTube compatible Roku. If the 'channels' you stream are available on both the Fire Stick and the Roku and you need an additional or a replacement device, get the Fire Stick because it is faster and a bit broader as to functionality. In fact, from what I'm witnessing after a day of testing, the only reason not to choose Fire over Roku is if you're hooked on a \"\"Roku only\" channel.I'll post back if anything changes with more use, otherwise, the above still stands.", "verified": true, "helpfulness": "0/0", "author": "myatuck"}, {"rating": 4.0, "review": "stream netflix and stuff is alot faster than directly stream from smart tv.", "verified": true, "helpfulness": "0/0", "author": "Sierra"}, {"rating": 5.0, "review": "I own the Amazon Fire Stick along with the Chromecast and Roku streaming sticks. The Amazon Fire Stick is just as smooth and easy to set up and performs equally as well. Would recommend the Amazon Fire Stick with two thumbs up !", "verified": true, "helpfulness": "0/0", "author": "D. Lawson"}, {"rating": 2.0, "review": "The Fire Stick from Amazon really doesn't do anything special. I already owned a bluray play that did everything this does and more. Also - When I used this there seemed to be an annoying glitch while streaming Netflix. Every 5 minutes or so it would freeze, glitch (like it were loading), and make an annoying beep sound. I would recommend investing in a bluray player if you were thinking of purchasing this for $40.", "verified": true, "helpfulness": "1/1", "author": "Jeff Parshall"}]