[{"rating": 5.0, "review": "Having family fun using the Fire TV Stick to catch up on our movies and shows. Easy to use. Can't wait to take it along on vacation with us!", "verified": true, "helpfulness": "0/0", "author": "Sonshine"}, {"rating": 2.0, "review": "WORST PURCHASE EVER! Freezes...spits and sputters constantly...will not play Netflix uninterrupted...don't even think about playing Hulu on it...totally piece of junk. After trying to get it to work properly for a couple of months..I give up. Going to replace it with a Roku stick.", "verified": true, "helpfulness": "2/2", "author": "Greenporker \"SB\""}, {"rating": 3.0, "review": "It works fine for some uses, but there are problems. Hulu, in particular, works very poorly, with the video freezing but the audio continuing. I researched the issue after experiencing it and found that this has been a known problem.", "verified": true, "helpfulness": "1/1", "author": "Chris in AL"}, {"rating": 5.0, "review": "This is great for Amazon prime members. I just plugged it in to the back of my television and very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 1.0, "review": "This product worked fine at the start. I have a strong WIFI connection (> 50 Mbps), and the stick was plugged in and powered. However, numerous times, the audio would stop working. Doing a reboot, unplugging the device, many times didn't fix the problem. Other times, the screen would flicker a lot. Unplugging and plugging the stick back in solved that, but it meant every time I wanted to sit down and watch something, I had to do this. I thought this would be a good replacement for cable TV, but it is not. It is not a refined product, but what do you expect for $35 ? Amazon did not spend much time fixing the SW & HW bugs here and you can tell. It is not worth the aggravation. It's better to just watch Netflix or Hulu on a laptop. The idea of putting a fast processor in a stick is nice, but you need to do the quality SW development and HW integration to back it up. This is not something which Amazon did.", "verified": true, "helpfulness": "2/2", "author": "MB"}, {"rating": 5.0, "review": "In Love with this!!! Wow! I can't believe how much it does! When i linked it to my Kindle Fire it's even better! Having Amazon Prime helps, There are literally thousands of movies and tv shows!! I'm impressed!", "verified": true, "helpfulness": "0/0", "author": "reflexology_blaque"}, {"rating": 5.0, "review": "Love it!!!!!  Good job Amazon!!!!", "verified": true, "helpfulness": "0/1", "author": "Mary M."}, {"rating": 5.0, "review": "Love using my fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "libertythreads"}, {"rating": 5.0, "review": "Coming from a die hard Roku fan. This is my second Fire Stick. Easy to set up and use. And if you travel, it's great to take along. Connects easily, even to hotel wifi systems.Comes preconfigured to your Amazon account, or you can start fresh. Remote is RF, so you don't have to be pointing it at the device. Of course, it works great with Prime, and with Kindle devices to connect to a 'Second Screen'. Also works better with a Slingbox than Roku, no smartphone or tablet needed.", "verified": true, "helpfulness": "0/0", "author": "©oope®'s ghost \"Conspicuous Consumer\""}, {"rating": 4.0, "review": "There's a learning curve.  But it works very nicely.  It has most of the channels I wanted.  I think it needs to be pretty close to the router.  I had trouble keeping it connected back in the back bedroom, even with a wifi extender.  30 feet from the router, works perfectly.", "verified": true, "helpfulness": "0/0", "author": "William A. Newman"}]