[{"rating": 5.0, "review": "We love the Fire Stuck! Perfect for upstairs in our bedroom.", "verified": true, "helpfulness": "0/0", "author": "Megan Miles"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Tales"}, {"rating": 5.0, "review": "Wasn't sure that someone a little older and technically challenged would be able to figure this out, but I did!  I use the Fire TV Stick on my tv in the basement when I am on my exercise bike and treadmill.  I now look forward to exercising as I am able to watch a HBO series that I have always wanted to access, but didn't want to spend the money for HBO on cable.  Great invention.", "verified": true, "helpfulness": "1/1", "author": "Claire Sullivan"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Steve Hathaway"}, {"rating": 5.0, "review": "This works awesome.  I love being able to watch MLBTV and Sling TV with no issues. plus i can watch my prime tv and movies.  I am very impressed", "verified": true, "helpfulness": "0/0", "author": "JustBrianMeyer"}, {"rating": 2.0, "review": "Device has poor apps.Cable company I use not offered on hbogo or showtime.The only redeeming point is it comes with a remote.Kindle does not cast well with this device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!! Much easier to use than my chromecast since it has a remote and I don't have to use a separate device to control it.", "verified": true, "helpfulness": "0/0", "author": "SuperKawaii"}, {"rating": 2.0, "review": "Finding apps for this thing is very difficult.  We have two Roku sticks in the house besides this, and those are simple to configure and use.  About all I can do with the Fire TV Stick is watch Prime movies and Sling TV.  The Fire Stick doesn't compare to the other options.", "verified": true, "helpfulness": "0/1", "author": "Mddaddy"}, {"rating": 4.0, "review": "Great product.  The fire stick exceeds expectations.  The easy to use GUI gave me access to things I never knew my Prime account could do. This is especially great for my child.  Cons: Poor third party app support. You can not \"cast\" to it.  The fire stick does not support YouTube and that's enough for me to take off an entire star, honestly.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Amazing and easy to set up", "verified": true, "helpfulness": "0/0", "author": "Steven webb"}]