[{"rating": 3.0, "review": "I am constantly searching for the best media playback device for my digital multimedia collection. The Fire TV stick plays media (Netflix and Plex Media Client) butter-smooth with an occasional hiccup that might be due to my wireless connection. I noticed that without an active Internet connection the Fire TV Stick is practically useless.", "verified": true, "helpfulness": "0/0", "author": "Christopher McIntosh"}, {"rating": 4.0, "review": "Remote is convenient. Nice interface, but streaming seems perhaps a tad slower than through my DVD player, which also allows streaming. PBS streaming is unacceptably slow. Not sure why it doesn't draw power from the USB plug-in instead of requiring a separate outline connection to power.", "verified": true, "helpfulness": "0/0", "author": "Robert Gray \"Bob\""}, {"rating": 5.0, "review": "I love that it is small and stays behind the TV.  I did have to use the included extender on my set but we love it", "verified": true, "helpfulness": "0/0", "author": "realtormoma"}, {"rating": 5.0, "review": "Great device! Super fast!", "verified": true, "helpfulness": "0/0", "author": "Moussassa"}, {"rating": 1.0, "review": "I have a 600 mbs router next to the fire stick and it still doesn't offer a consistent picture, my blue ray player has more processing power and is fine... Not sure what is up with the stick...", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 5.0, "review": "pretty happy with this item I found few movies that I was looking for for free with my prime membershipThanks", "verified": true, "helpfulness": "0/0", "author": "Hadi Namdar \"Hadi\""}, {"rating": 5.0, "review": "It's a very nice item", "verified": true, "helpfulness": "0/0", "author": "nestor hernandez"}, {"rating": 1.0, "review": "sending back won't load my wi first customer service has np idea what to do.", "verified": true, "helpfulness": "0/0", "author": "Michael donofrio"}, {"rating": 5.0, "review": "As a prime member you have access to alot of free music & movies.  I back-up my pictures & videos from my phone to the Amazon cloud (free also) & my family enjoys seeing these on the large tv screen.  This is definitely worth buying if you have Amazon prime membership & internet to support it.", "verified": true, "helpfulness": "0/0", "author": "Acmom97"}, {"rating": 5.0, "review": "I love it, although I'm still trying to figure out how to use it. Too busy binge watching my favorite shows :)", "verified": true, "helpfulness": "0/0", "author": "Brenda Eckhart"}]