[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Diana Trejo"}, {"rating": 5.0, "review": "great !quality gooddelivery also good!", "verified": true, "helpfulness": "0/0", "author": "Byeongjin"}, {"rating": 3.0, "review": "Takes forever for it to be ready then it buffers for ever bought a roku andi is very fast and never buffers!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! No complaints.Plugged in no ac adapter needed. Worked like a charm.my 3 year old figured it out quick too.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Q \"thrifty yet skeptical spender\""}, {"rating": 5.0, "review": "Yes, the Fire Stick delivered all it was advertised to do, right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Bert"}, {"rating": 5.0, "review": "Love love love this ite . I bought it for my husband who was having surgery.  He enjoys movies so this made a good way to while away the recovery time. The picture is clearer than through the WII or PlayStation 4. The loading is smooth with no glitche .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mary M Bybee\""}, {"rating": 1.0, "review": "I was wanting this for a while, finally got it. When it works, it's terrific and gets daily use, but it is often very buggy. Apps will crash, Netflix and Prime TV will freeze at a 25% buffer, some apps won't load at all. I have to often unplug the thing and plug it back in for it to work. I kind-of get tired of having to do that 2-3 times to get through one movie.UPDATE: Lowered the star rating, as issues and bugs are getting worse. Netflix streams terribly on this, stopping to buffer every 15-20 seconds. This thing spends more time buffering than streaming anything. Not reccomended.", "verified": true, "helpfulness": "0/0", "author": "CodyD"}, {"rating": 3.0, "review": "Boots up faster than roku stick ,i like that, and it has free games .But they need more Apps ,  i like Vudu they dont have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Absolutely does not compete with Chromecast.  Takes more effort trying to make it work than its worth. A serious fail.", "verified": true, "helpfulness": "0/1", "author": "Joshua A. Goettsch"}, {"rating": 2.0, "review": "I loved the Fire Stick when I first received it because it was so easy to use. Now, after 5 months, it disconnects itself from WiFi almost continually. I can no longer watch any shows. Occasionally, it will stay connected for a few minutes, but then it disconnects again. I really expect a product like this to last longer.", "verified": true, "helpfulness": "0/0", "author": "Lana"}]