[{"rating": 5.0, "review": "Very cool little gadget.  I had a Google Chromcast which i was impressed with at first but the Fire Stick is even better.", "verified": true, "helpfulness": "0/0", "author": "R \"M\""}, {"rating": 5.0, "review": "It's Absolutely Wonderful!!!!! Super easy to navigate. Even my four year old can use it!", "verified": true, "helpfulness": "0/0", "author": "channyt30"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "It's not dependable, it keeps reloading during each show.  I'm going to return it.  My Chromecast works much better.", "verified": true, "helpfulness": "1/1", "author": "Marilyn Rose"}, {"rating": 5.0, "review": "The only things the kids liked better was the new TV's purchased to use with their new fire sticks!  Amazon does it again!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Doesn't do any good if you don't have a amazon account ... more so, its a marketing strategy to sell you even more stuff . Would have sold it back if didn't have a preinstalled account on this ... DON'T BUY...", "verified": true, "helpfulness": "1/1", "author": "altamash"}, {"rating": 3.0, "review": "When it is working properly it is great . I own both the Fire TV and Fire Stick . The Fire Stick needs to be rebooted (unplugged for a few seconds then plugged back into HDMI port)  too often !", "verified": true, "helpfulness": "0/0", "author": "Jerry C."}, {"rating": 4.0, "review": "Works as intended. Plugs into hdmi then plug in the included power adapter.Took a while to get set up with updates and downloads, but I attribute that to being the first day it was released.", "verified": true, "helpfulness": "0/0", "author": "ChaosAD"}, {"rating": 4.0, "review": "This is a good/affordable product to satisfy your amazon prime streaming needs. I pre-ordered this when it was on sale, and it was delivered earlier than expected. Everything was very nicely packaged, as with most Amazon products, and hooked it up. It was a pretty quick set up (about 10-15 min). The interface is pretty basic, and easy to figure out. The only problem I had was the range of wifi. I tried using the fire stick in my TV room which was about 40-50 feet away from my router, and the connection strength was pretty weak. Other than that I enjoy this product, and I hope they continue to make improvements to the interface!", "verified": true, "helpfulness": "0/0", "author": "William Penn"}, {"rating": 5.0, "review": "Very good alternative to the chrome which is more expensive. I recommend this cheap piece of technology to anyone who needs their streaming shows anywhere in the house. I watch and listen to series while relaxing in my shop between buildd kit cars", "verified": true, "helpfulness": "0/0", "author": "Josiah Moering"}]