[{"rating": 5.0, "review": "Not quite sure how I lived without it!", "verified": true, "helpfulness": "0/0", "author": "Janine Reeder"}, {"rating": 5.0, "review": "Easy installation. Along with my Prime, great choices available.", "verified": true, "helpfulness": "0/0", "author": "Kathy Leviant"}, {"rating": 5.0, "review": "Awesome ! No ugly cords or bulky box. It's just a sleek small remote that delivers tons of entertainment !", "verified": true, "helpfulness": "0/0", "author": "cirilo cabezas"}, {"rating": 4.0, "review": "Better than I thought it would be. Works well!", "verified": true, "helpfulness": "0/0", "author": "Kaiwa W."}, {"rating": 5.0, "review": "I bought this for a xmas gift for my boyfriend.  He hadn't even heard about it yet... thankfully not paying attention to the commercials! lol  After I bought it I talked with a few of my techie friends and was not happy with what I heard... but I have to say I'm pleasantly surprised!  This thing has made my life so much easier... I was gonna have to call the cable company to come out and run a line to the kitchen and this solved that problem.  The glitchieness that I thought I would experience I'm not... it runs flawlessly!  I love this thing so much I'm planning on dumping the expensive cable provider and going with this and Plex.tv as my whole house solution!  I'm so excited I really can't stand it!!!", "verified": true, "helpfulness": "0/0", "author": "Brenda Stephens \"Brenda Stephens\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Craig heatter"}, {"rating": 5.0, "review": "Why did I wait so long to try this? I can download free apps and now I can watch the NASA channel,Diabetic Living and others that I don't get with cable.  I can also watch the Alpha House on TV instead of my Kindle....awesome! awesome AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "Karen J McLaughlin"}, {"rating": 5.0, "review": "Cut the cord to DirecTV. Bought Fire TV Sticks for 2 of our teens bedrooms. Love them. Bought the regular Fire TV for the living room first. All 3 came pre-set to our account and were a simple plug in and begin using. We find that both types work equally as well for the way we use them (tv watching). We've had no issues with streaming multiple devices at once. Thoroughly worth the money, especially as Prime members with the oodles of movies & tv shows included.", "verified": true, "helpfulness": "0/0", "author": "Simply Chasity"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is great!  First, it essentially turns your non smart tv into a smart tv.  Secondly, the remote and stick are slick and so easy to set up and working.  Lastly, the remote is completely awesome and works like a charm.  The signal on it is great and you don't even need to point it at the TV.  It's all around awesome!", "verified": true, "helpfulness": "0/0", "author": "Joseph Giangreco"}, {"rating": 3.0, "review": "Encountering streaming problems when watching tv shows on Netflix.  Not so much with movies.  Also, not worth the extra hassle.  Easier to watch Netflix online.  Is okay but not worth $40 price tag.", "verified": true, "helpfulness": "0/0", "author": "Valerie Hedgepath"}]