[{"rating": 5.0, "review": "great, easy to set up and makes it easy to search for programs", "verified": true, "helpfulness": "0/0", "author": "Michael Cotellessa"}, {"rating": 5.0, "review": "Love it!! Love it!! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Ida Anderson"}, {"rating": 5.0, "review": "What a great gadget. Hooked it right up to my TV and presto, lots of great TV. I especially like the ability to easily back it up 10 seconds to review what a character just said. It also makes good suggestions based on what you have already viewed. Cuts out the commercials and allows one episode to play right after the previous one.", "verified": true, "helpfulness": "0/0", "author": "M. Wright \"Sophe\""}, {"rating": 5.0, "review": "Worth every penny.  I use it more than my roku.", "verified": true, "helpfulness": "0/0", "author": "Alexis I Castro-Torres"}, {"rating": 5.0, "review": "Few things in life work great right out of the box but this did!", "verified": true, "helpfulness": "0/0", "author": "Art"}, {"rating": 4.0, "review": "I love my Firestick, however, the remote quit working within a month.  I already had the Fire TV remote app downloaded on my smart phone & just use that, as it works great.  I had purchased a longer HDMI adapter cable because of my tv at the time. I recently purchased a new tv & didn't need the long adapter. I plugged in the shorter adapter that came with the Stick & kept getting a connectivity error after that. I didn't put 2 and 2 together  (thinking my new tv had a problem) until I started reading reviews about the same problem.  I dug out the longer adapter again, replaced the short adapter & it connected perfectly!  So appears the OEM equipment has some problems & the aftermarket items (phone app remote & separate adapter cord) work best...which  is too bad.", "verified": true, "helpfulness": "0/0", "author": "kali"}, {"rating": 5.0, "review": "Love, love, LOVE our Amazon Fire Stick!!Only had one issue so far with the Sling TV app, but other than that, the whole family loves it!! And we're buying another one next month! (:Oh, if I could change something about it, it would be the size and layout of the remote. I think it could be a little bigger!", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 3.0, "review": "This is a good product.", "verified": true, "helpfulness": "0/0", "author": "Michael Scott"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick.  The only thing i have had a problem with is at some points while watching shows, the TV freezes for about 5 seconds, but the vocals still continue while the TV is frozen.  Then, after about 5 seconds, the video speeds up and catches up the to audio.  I hope Amazon can fix this, but it's not at the point where I would want to return the item.  Overall, great item!", "verified": true, "helpfulness": "0/0", "author": "Justin Pearson"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Ashley Johnson"}]