[{"rating": 5.0, "review": "I ordered two of these on pre release and couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "vw65bus"}, {"rating": 2.0, "review": "This could be a great device, if it didn't have so much trouble with the network connection.  I'm constantly getting error messages that the network is slow, or lost.  When it does play, it likes to freeze up momentarily.  A lot.  I have a strong network and no other device in the house has any trouble with it.  I can be much farther away (outside, on the street, way in the backyard) and my tablet picks up the network just fine.  But the Fire TV stick seems to have trouble in the room directly upstairs from the router.Wish I could return it, but I think it's been too long.", "verified": true, "helpfulness": "1/1", "author": "odesigns"}, {"rating": 1.0, "review": "I really had high hopes for this product. But, they were quickly dashed in one night of fruitlessly trying to use the Stick with two different TVs.The first thing that got my attention, though, was the packaging that this Fire TV Stick came in. It must have cost a fortune just to create the packaging. I'm a graphic designer and I know a pricey piece when I see it. Laminations, foil lettering, embossing -- the money for product development must have all been shot in packaging. What a waste.I've worked on the product for two hours now, and no connection with my computer network.  No useable instructions in the box, only a few meager lines telling me how easy it is. I work on a Mac Pro daily in powerful programs like Photoshop, Illustrator, InDesign, Quark and more. I always load my own computer programs and install my own equipment -- but I couldn't get this gadget to work.I'm a good customer at Amazon, but I felt like I've been sold a useless gizmo. Why couldn't you have spent more time and budget on offering customer directions and customer support than on creating packaging to win some art design contest? I can't even find anyone to contact for help. I don't need this kind of hassle. I lead a busy life.You can expect this Fire TV Stick returned -- more time wasted for me.", "verified": true, "helpfulness": "1/1", "author": "J. P. \"opin book\""}, {"rating": 2.0, "review": "Not as versatile as I had hoped.  Easiest install.  I wanted to mirror my Galaxy 5s with PowerPoint shows. This is just a video stick", "verified": true, "helpfulness": "0/0", "author": "Larry Russell"}, {"rating": 2.0, "review": "So, I got the Fire Stick during the special $20 sale.  Was really excited to set it up as I have pretty much shed regular TV in the past few years.  I had been using my Apple TV and streaming from my iPad or iPhone.  This looked perfect; small size, great apps, Amazon behind it, and a great price.I've been using it for 4 months now to try to figure it out and only have about 6 apps installed.  I have to say I am so disappointed in this product.1.  If I watch something on an app for more than a couple of hours, it starts buffering, freezing, and just not performing well.  I then have to go and clear the app cache.  I counted the other day, I had to clear the YouTube app cache 6 times in a full day of watching.2.  The internet capability is pretty bad right now.  The stick is literally one foot away from the wifi router and it is constantly telling me that it is having trouble connecting.  Every other wifi thing in the place connects with absolutely no problems.  I troubleshot one day and turned every other wifi device off but it did not improve the quality on the Fire Stick.3.  Some of the apps have the worst UI.  The biggest one was the Twitch TV app.  This is the main reason I purchased the Fire Stick.  I watch a lot of Twitch TV during the day for background and filler noise.  The app is horrible.  No account sign in, no search, no anything.  I expected better on this one app seeing as Amazon owns Twitch.4.  The remote is crap.  Fresh out of the box the remote is either uber sensitive or uber non-responsive.  If I hit up on the pad, sometimes it doesn't move and other times it goes up 12 pages.  It also fails when hitting play or pause and suddenly the thing I'm watching is gone.  I started using the app on my phone to control things, but this should not be the solution for a new product.Short story short, I gave the Fire Stick it's due.  I searched the internet for fixes, I cleared caches, I reloaded apps, and I kept checking for firmware updates.  No go.  I have since moved my XBOX360 into the living room and my Apple TV into the bedroom and have had absolutely no problems with the apps I enjoy.  I plan on putting the Fire Stick in the guest room where it won't be used much, if at all.  I am so disappointed because I had such high hopes as I have been an Amazon fan since they first came into being.  Maybe in a few months I'll pull the Fire Stick into the light and see if things have been fixed or updated.  I'll keep giving it the college try, but for now, I need something with more reliability.", "verified": true, "helpfulness": "0/0", "author": "Kristen A. Criado"}, {"rating": 5.0, "review": "I love my Fire TV stick. I've had it for a few months, it came earlier than expected. I love being able to go from my Kindle Fire tablet to the TV in mater of seconds. I can take this with me to my Mom's or sister's an easily connect to their WiFi and watch whatever I left off on. I'm a Prime member so I often watch the movies & TV shows included in membership plenty to get your binge watching on. When I first got the device my streaming was a bit choppy but the updates have all but cured that ill. I don't have a problem watching youtube or netflix videos. All in great buy. I'll get another soon!", "verified": true, "helpfulness": "0/0", "author": "Gray \"Ready for fitness!\""}, {"rating": 1.0, "review": "Returned due to excessive skipping and audio visual synch issues.", "verified": true, "helpfulness": "1/1", "author": "Sarah Horton"}, {"rating": 5.0, "review": "I am very happy with my Fire TV Stick!  It is quick and easy to install with very easy operation.  I have always hated having large boxes and cords going everywhere, not a problem with the Fire Stick being small and light and  wireless.  I can take it with me when I travel too.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "It's faster than my Roku 3, and it does most of the same things just as well or better than the Roku did. I still use my Chromecast more often (more flexible choices of media, dozens of Android apps have native Chromecast support), but I am glad I made the investment in the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "ATP \"ATP\""}, {"rating": 1.0, "review": "This product seems great in concept but in execution it sucks. The Fire Stick constantly locks up, it won't play common apps like Hulu with any level of consistency. It appears Amazon rushed to put this in the market and in the process forgot to test and learn about their product.", "verified": true, "helpfulness": "0/0", "author": "Anna Harper-Hess"}]