[{"rating": 2.0, "review": "Stuttering playback worse than 2 years old roku 2xs", "verified": true, "helpfulness": "0/0", "author": "Douglas T. Hubert \"hellur1\""}, {"rating": 4.0, "review": "So nice to have something good to watch all of the time!", "verified": true, "helpfulness": "0/0", "author": "Loretta J. Ozanich"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "MBFL"}, {"rating": 5.0, "review": "I love this product it is so easy to use and set up. The size and the portability is also great, it so much easy to switch to another tv than a regular media streamer play.  The streaming quality is a way better on this product than on my smart tv.  I have also tried the fire tv but I would chose the fire stick over it.", "verified": true, "helpfulness": "0/0", "author": "Cate"}, {"rating": 5.0, "review": "This little thing totally transformed my HD non-smart TV. Fantastinc experience, so easy no nonsense plugging and using. Programming and linking it to my Amazon and internet accounts were so easy and quick. And the Amazon interface is really attractive and easy to use (although for now I am not paying and using my Netflix account only). Available apps could be more, asume Amazon will add more over time. Important omissions for example YouTube and Google.", "verified": true, "helpfulness": "0/0", "author": "Jose F. Silva"}, {"rating": 4.0, "review": "Does what I want, just a bit difficult to get to what I need at times since need to scroll down constantly to get app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was a gift and I love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Debra clark"}, {"rating": 4.0, "review": "Had to call for help to get Hulu on the site for I am a member of Hulu. Hard to figure out what is free on your site vs what you pay for? Not very user friendly, unless your signed up for your program. Thanks, Richard.", "verified": true, "helpfulness": "0/0", "author": "Richard Robichaud"}, {"rating": 5.0, "review": "very easy to set up and use, very fast", "verified": true, "helpfulness": "0/0", "author": "Terry Walstrom"}, {"rating": 1.0, "review": "Worked fine a first, but on the second and third try it could not connect to my isp, would not load home or let movies or music play. Seems like I got ripped off....", "verified": true, "helpfulness": "0/0", "author": "Angie"}]