[{"rating": 5.0, "review": "I've been a huge Apple fan forever and love my Apple TV. But after using the Fire Stick I'd have to say it's easy to use and as good, maybe even faster than the latest generation Apple TV.I still use my Apple TV but the Fire Stick is a great addition to the streaming arsenal.", "verified": true, "helpfulness": "0/0", "author": "philip ferdinand"}, {"rating": 5.0, "review": "Love the fire stick.  Works great.", "verified": true, "helpfulness": "0/0", "author": "S. C. Pearsall"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "My family loves it.  Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Martha Helms"}, {"rating": 4.0, "review": "Works well but a little more detail in startup guide would be welcome.Wished TNT and AMC had fire TV apps.", "verified": true, "helpfulness": "0/0", "author": "Richard Bond"}, {"rating": 5.0, "review": "Thank you for the quick turn around. One of them does have issues connecting to the Internet.", "verified": true, "helpfulness": "0/0", "author": "Ruben Diaz"}, {"rating": 3.0, "review": "I really like the firestick but I've had some issues with it. The need for an external power supply instead of just using a powered hdmi cable doesn't make alot of sense. also, there should be access to amazon shopping. My 18month old also got ahold of the remote and purchased a couple movies and it was way to easy for him to just press one button sequence and order things.", "verified": true, "helpfulness": "1/1", "author": "Rob Reilly"}, {"rating": 4.0, "review": "It's a great thing, easy to use, came all set up, plug and play. Only disadvantage is a lot of the shows or movies I want to see you have to pay extra to see, even the old ones.", "verified": true, "helpfulness": "0/0", "author": "Deborah Mintz"}, {"rating": 4.0, "review": "Very easy to setup right out of the box. Arrived timely.", "verified": true, "helpfulness": "0/0", "author": "Wendellyn Bennett"}, {"rating": 5.0, "review": "Does everything I wants it to do I love it", "verified": true, "helpfulness": "0/0", "author": "Jessie deshazer"}]