[{"rating": 2.0, "review": "very disappointing. This is not any better than Roku...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "its very easy to use and much easier to connect than the chrome stick.", "verified": true, "helpfulness": "0/0", "author": "denise robinson"}, {"rating": 5.0, "review": "works very well and I am enjoying the convenience.", "verified": true, "helpfulness": "0/0", "author": "student1"}, {"rating": 5.0, "review": "Plugged it in and started watching Prime Videos right away!", "verified": true, "helpfulness": "0/0", "author": "Deborah Cusson \"D. Cusson\""}, {"rating": 5.0, "review": "I'm very happy with it.it's really fast and is always ready for you. To play your favorite movie or tv show.I just love it. You don't will be disappointed. 😎", "verified": true, "helpfulness": "0/0", "author": "Mariano Martinez"}, {"rating": 2.0, "review": "I was not impressed when I unpacked it - the remote control feels like it was made with plastic the consistency of freezer bags. But it does work.The network connectivity is flaky enough from this item to interfere with watching and in generating lots of warnings. In contrast to running the same things on the PC I use to drive the content for our TV where the wireless signal is consistently excellent.The search function is clumsy - but it is clumsy on a PC, it is a native fault with Amazon - it is just enormously more clumsy on a device that has to use a point and click interface to generate text.The selection of apps is all but worthlessNot absolutely useless but it did not any value at all.", "verified": true, "helpfulness": "0/0", "author": "Michael Wenlock"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Cornwell"}, {"rating": 5.0, "review": "Easy to set up!! it works great!!", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 5.0, "review": "I Gave it away, and from the comments I have heard it is doing what then need it to do.", "verified": true, "helpfulness": "0/0", "author": "Brenda Jackson"}, {"rating": 5.0, "review": "Shipping was fast. Plugged it in and took only a few minutes to setup. It loads movies very fast. I'm still figuring out the mirroring feature. All in all its s great product.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]