[{"rating": 5.0, "review": "Love it has everything I wanted I have a Netflix account as well as Amazon prime I am contemplating Hulu because the fire stick has all those apps there are also games but I have not tried any of them", "verified": true, "helpfulness": "0/0", "author": "B5doc2300"}, {"rating": 5.0, "review": "Better than messing with my laptop everytime.", "verified": true, "helpfulness": "0/0", "author": "Richard T. Ciottone"}, {"rating": 4.0, "review": "like it -will use it more this summer- real easy to use", "verified": true, "helpfulness": "0/0", "author": "Tall CJ"}, {"rating": 5.0, "review": "This is a great buy!", "verified": true, "helpfulness": "0/0", "author": "Mrs. D"}, {"rating": 1.0, "review": "I loved this streamer so much - until I started to notice that the streaming video has a motion stutter on all the applications and it drives me nuts.  I have tried restarting, I have tried different HDMI ports, and I have tried different televisions to rule out user error.  I also have fast internet and my apple tv and chrome cast do not have this problem.  So I love the interface and I love how it works - but if the processor can't stream fluid motion video without occasionally looking jerky and stuttering - the whole device is pointless.  I will happily update this review if some resolution becomes apparent.", "verified": true, "helpfulness": "0/0", "author": "P. Pattison"}, {"rating": 5.0, "review": "Great I got all the apps I need. Screw cable or satallite tv.", "verified": true, "helpfulness": "0/0", "author": "Luis Ocampo"}, {"rating": 5.0, "review": "Can I run Showtime and HBO with the Fire Stick?", "verified": false, "helpfulness": "0/0", "author": "Ossie Bentworth \"Ossie Bentworth\""}, {"rating": 5.0, "review": "Works great with my 4K TV!", "verified": true, "helpfulness": "0/0", "author": "James Roberson"}, {"rating": 1.0, "review": "I plan on trying it again but didn't have time to mess with it the first time. Wouldn't connect to router. Tried over 5 times and on the 6th it connected. Then tried to connect to Amazon and it seemed to for a short while, then said couldn't connect anymore. Spent almost 30 minutes with it and finally gave up and connected to Amazon.com on my computer and watched a movie that way. I plan on trying it again before returning it to Amazon. It might be I just have a bad one..it happens. So we shall see what happens next time", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Rizky\""}, {"rating": 5.0, "review": "Easy to install - blonde girl approved!", "verified": true, "helpfulness": "0/0", "author": "danette ward"}]