[{"rating": 5.0, "review": "Stunning Device - Pure HD Video", "verified": true, "helpfulness": "0/0", "author": "Morris in NC"}, {"rating": 5.0, "review": "Love It.", "verified": true, "helpfulness": "0/0", "author": "Anthony Johnson"}, {"rating": 4.0, "review": "Since the moment I got it and set t up on my tv I have been in love with this thing.  Set up was relatively quick and easy. And once I got it up and going I was watching movies and listening to music on my pre-smart tv enabled tv.  I'm addicted to this thing.  It's probably all the better that I got prime (by aacident). But now that I have prime I'm really able to get my value from prime.I just wish they sold a secondary power adapter so I don't have to plug /unplug from the tv and outlet each time!", "verified": true, "helpfulness": "0/0", "author": "kingston's mom"}, {"rating": 5.0, "review": "Yes this is  EXACTLY what you were looking for....Palm size box hanging there,and you have to plug it in.The slinging from kindle to screen is cool,the pictures,music,all my kindle goodies on Any tv I plug in to..there must bee WiFi in the house.I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Tabytha"}, {"rating": 5.0, "review": "It was amazingly easy to set up and has been a lot of fun to use.", "verified": true, "helpfulness": "0/0", "author": "BERTA \"MRS PEEL\""}, {"rating": 4.0, "review": "Great little device that makes consuming media easy. Would recommend this over the Google Chromecast as having the remote and built in apps/interface make it mush easier to use for my kids and my parents.", "verified": true, "helpfulness": "0/0", "author": "Adam N"}, {"rating": 5.0, "review": "Great product, great service from Amazon.", "verified": true, "helpfulness": "0/0", "author": "theoxleo"}, {"rating": 1.0, "review": "Started off great and now after 3 weeks it had stopped working. Does not pick up wifi even though every other device does. Need to send this back.", "verified": true, "helpfulness": "0/0", "author": "Daniel Martinez"}, {"rating": 2.0, "review": "When it works, I've been pleased with it...however the \"when it works\" part is infrequent.  The apps crash a lot and lately I've been getting a fair amount of reboots lately.  Based on a suggestion I found, I've replaced the power adapter with a higher powered one and that seems to have helped. The whole thing is pretty buggy but that's what happens with first generation stuff.  I own the Roku 3, Chromecast, and this.  The Roku is by far the best in terms of performance, quality, and ease of use.  Unfortunately, it's also the most expensive.  That being said, I'll keep the first stick around but I'm getting another Roku 3 for my traveling.  I've had enough of my trial by Fire.", "verified": true, "helpfulness": "1/1", "author": "Joseph D. Pisani"}, {"rating": 5.0, "review": "Awesome product at a great price. Exactly what I needed.", "verified": true, "helpfulness": "0/0", "author": "BDawg11"}]