[{"rating": 4.0, "review": "When watching prime movies, the movie stops streaming half way through. I had. To call amazon for help. The problem was solved but it is very annoying.", "verified": true, "helpfulness": "0/0", "author": "Gerald Laukus"}, {"rating": 4.0, "review": "Works great...  easy to navigate... works really well with the FireTV app.", "verified": true, "helpfulness": "0/0", "author": "Timothy Moore"}, {"rating": 5.0, "review": "Use it more than I thought I would! LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Monet Salamon"}, {"rating": 5.0, "review": "I've had the WD box, the Roku Box and stick, and smart TVs.  So far - this little Fire Stick seems to be the most intuitive and user friendly.  I bought it for a bedroom TV that has no cable or antenna service and it has exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "jan simnacher"}, {"rating": 1.0, "review": "No. Still broken had to return it. Now I found out with this email that you sold me a refurbished item when I paid full price. Last time I buy it through Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dennis G."}, {"rating": 5.0, "review": "Love it! Works well, great selection of TV shows, movies, and apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rese29\""}, {"rating": 4.0, "review": "Can't get any NHL games on here they have everything but that other then that it's a great product just wished they had NHL or cbs sports", "verified": true, "helpfulness": "0/0", "author": "Mike mccormick"}, {"rating": 5.0, "review": "We gave up our cable and ordered a couple of the Amazon Fire Sticks!  We have everything we could ever want for television entertainment and are saving a bundle by not paying a cable bill!", "verified": true, "helpfulness": "0/0", "author": "Brenda Van Deilen"}, {"rating": 4.0, "review": "It is working well as per my expectations. I specially purchased this device for YUPP TV app. Occasionally while watching channels it gets struck and shows the error message, but as I said It happens occasionally. Over all this device is worth of it's cost", "verified": true, "helpfulness": "0/0", "author": "Venkatesh"}, {"rating": 3.0, "review": "Good concept, love being able to access Amazon, Netflix, other stuff via this.Only problem is I have to disconnect it and do a \"reset\" nearly daily.", "verified": true, "helpfulness": "0/0", "author": "Andrew Lenzen"}]