[{"rating": 4.0, "review": "All the features of a chromecast, plus Amazon app support plus the remote which is nice", "verified": true, "helpfulness": "0/0", "author": "Humor4Fun"}, {"rating": 4.0, "review": "I wish you could navigate through the main Amazon website with the Fire Stick. Other than that, it exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Rudi Anna"}, {"rating": 5.0, "review": "Seen the $19 Fire Stick promo in October and wanted to give it a try.  Was very pleased when I initially set it up and I still adore it.  Liked it so much, that I gave them out as Christmas presents too!  I know the Fire Stick comes with games, but I am not much of a \"gamer\" so my review/rating is strictly in regards to the \"TV watching\" aspect.I have both the Amazon fire stick and the Roku stick (one hooked up to the living room and the other to the bedroom TVs).  Both are easy to set up and come with remotes.  You can also download the apps for both devices and make your iPad and iPhone a remote which comes in pretty handy.  As far as the user interface layout goes I favor the Roku.  The Fire Stick is Amazon brand so the home screen is mainly geared towards Amazon/Prime.  With the Roku, your are able to strategically place your apps anywhere you want on the home screen.  With that being said, both are pretty easy to use and navigate through. The other feature I favor on the Roku is the search feature that pulls up movies/tv series and instantly shows you if its included in one of your subscriptions (i.e. Netflix, Hulu or Amazon Prime) or how much it costs to rent/buy.  With the Fire stick it brings you first to Amazon then you would have to click on the bottom \"more options\" button to take you to the screen that shows you if its included in any other of your subscriptions.In regards to App options, Roku has more than the Fire.  With that being said, in my opinion, the Fire has more than enought apps than you need.  Both have major apps like Netflix, Hulu, Amazon, ESPN, NFL etc.  The biggest downfall for the Roku is that it doesn't offer the PLUTO app and the Fire does.  The PLUTO is great having multiple channels in the app itself.  The biggest downfall for the Fire is that it doesn't have the TIME WARNER app, so I am unable to use my cable Time Warner subscription that comes on the Roku.With the Fire stick or Roku you could save money by paying for the Netflix, Hulu, and Amazon Prime subscriptions and cancel your cable.  I honestly wanted to cancel my cable subscription since I barely use it, but my boyfriend insisted on keeping it so he could watch football (understandable).Price wise, I believe the Roku Stick is around $50 while the Fire Stick is about $40.  You can definitely get them cheaper, just got to keep your eyes peeled for the sales.  I believe I paid $25 for the Fire Stick and $35 for the Roku Stick around Christmas.Both are great products! Just some user preferences that sets them apart...but if I had to pick one based on the overall product and price, it would be the Amazon Fire Stick.  Can't beat the $19 price for the product you get.", "verified": true, "helpfulness": "0/1", "author": "Jana A"}, {"rating": 5.0, "review": "This is such a great item. We use this for our outdoor movie theater.  I also plugged it into our television and it works great too.", "verified": true, "helpfulness": "0/0", "author": "monica"}, {"rating": 5.0, "review": "I love it...  I got rid of my chromecast...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So happy with the fire stick!easy to use and i love that it has everything i need!", "verified": true, "helpfulness": "0/0", "author": "Cass H."}, {"rating": 1.0, "review": "When comparing the Fire Stick to a Lightening Cable, Chromecast or Apple TV, the Fire Stick definitely comes in 4th place.  I don't think they know what they are doing.  I constantly get errors, that Netflix movies that will easily play on the Netlfix App,Chromecast or on Apple TV, which is very frustrating.  Out of any of the 4, this one is the worst.  I imagine Amazon could make improvements, and I hope they do soon, otherwise I will ditch the device completely.  Also, they said HBO Go would be available for the stick in Spring of '05, and haven't seen it on there yet.While I love Amazon, this product is very subpar", "verified": true, "helpfulness": "1/1", "author": "Jason M Tuel"}, {"rating": 5.0, "review": "We use it all the time. Love that it takes up virtually no space.", "verified": true, "helpfulness": "0/0", "author": "SpaceCadet"}, {"rating": 3.0, "review": "I would've given this 5 stars a couple days ago.  I've only had it 9 days and it worked GREAT the first 7 days.  Then I got a message on the screen that there was an update, which I did. HUGE MISTAKE!  Now it buffers ALL.THE.TIME.  I've been binge watching \"Sons of Anarchy\" on Netflix since I got this....had NO problems before the 'update'.  Now I keep getting a message that says \"The series you are trying to watch is not available at this time.  Try back later.\"  I'm PISSED!  It worked so great for the first few days!!!  I can still watch \"SOA\" on my laptop on netflix so it's definately the firestick.  I'm pretty disappointed.  But I'll keep trying to use it!  I was going to buy my dad one for Father's Day but now I'm a little doubtful.  Or will buy it and tell him not to do the update!", "verified": true, "helpfulness": "0/0", "author": "DG"}, {"rating": 1.0, "review": "I tried to stream Amazon Prime from my VisioBD Player with no luck so I stayed with Netflix.  BUT since I’m paying for Prime and should reap all of its benefits…  I bought an Amazon Fire TV Stick hoping that this would allow me to watch Amazon Prime on my TV… again no luck.  My WIFI signal strength is very good to strong per the Fire TV Stick and still the Fire Stick won’t stay connected.  I have to do an unplug reboot to get it going again.  3 times in one movie is too much!!!  And when it is working it runs slow.  If I hadn’t thrown out the packaging I’d return it. Don’t buy the Amazon Fire TV Stick… It’s a total waste of money.", "verified": true, "helpfulness": "0/0", "author": "Sue Ellen Miller \"Dragonfly Stained Glass\""}]