[{"rating": 4.0, "review": "While I think the Fire TV Stick is great, I do think it's a little ridiculous it doesn't come with the same voice command remote the full Fire TV does. I appreciate the pricing of the Fire Stick, but I'd happily pay $15 more for one that came with the voice command capabilities.", "verified": true, "helpfulness": "0/0", "author": "phil braun"}, {"rating": 5.0, "review": "Impressive and welcomed", "verified": true, "helpfulness": "0/0", "author": "Paul Bird"}, {"rating": 4.0, "review": "This is a really cool device, though I wish there were more apps for it I can't complain too much. Assembly and setup were very easy.", "verified": true, "helpfulness": "0/0", "author": "Justin Swearingen"}, {"rating": 5.0, "review": "My children and I love it", "verified": true, "helpfulness": "0/0", "author": "Angela Patterson"}, {"rating": 1.0, "review": "Piece of s***", "verified": true, "helpfulness": "0/0", "author": "Neil Johnson"}, {"rating": 5.0, "review": "It was really easy to set up. I can use it for Netflix and prime live streaming, and I don't need to go on to the website to add programs.", "verified": true, "helpfulness": "0/0", "author": "jessica schultheis"}, {"rating": 1.0, "review": "It was easy to install and the voice remote works pretty well. I am disappointed that Amazon forces you to buy the non voice remote ( value 14.99 on Amazon's website ).If you really only want to get the voice remote, you must spend an extra $ 29.99. I consider this unethical and unfair on Amazon's part. This issue has been brought to Amazon's attention by other buyers of this product, but Amazon has yet to stop this abusive sales practice. The Fire Stick does work as advertised although sometimes you have to repeat voice commands.", "verified": true, "helpfulness": "0/0", "author": "dennis j hopkins"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Edward Starostiak"}, {"rating": 4.0, "review": "Simple setup, and as expected.", "verified": true, "helpfulness": "0/0", "author": "Bob Mc"}, {"rating": 5.0, "review": "Add me to the list of thousands of people who worship this thing. BEST $40 I'VE EVER SPENT.", "verified": true, "helpfulness": "0/0", "author": "itsmeagainmargaret"}]