[{"rating": 5.0, "review": "If you are a prime member and want to access online content quickly, this is the best option I have tried so far. When I think about why I like this over other options, I think it's how it reminds me of old TV that change channels instantly. No lag....", "verified": true, "helpfulness": "0/0", "author": "David M."}, {"rating": 1.0, "review": "I have trouble connecting to the internet and the app I wanted does not work.", "verified": true, "helpfulness": "0/0", "author": "Judith K. Lacer \"jkl\""}, {"rating": 3.0, "review": "Very poor instructions. I can't find my Netflix watch list. It does work, just not as easy as advertised.", "verified": true, "helpfulness": "0/0", "author": "suzanne"}, {"rating": 5.0, "review": "works great, nice interface.  Much better than streaming through a DVD player.", "verified": true, "helpfulness": "0/0", "author": "shoppermom \"techshopper\""}, {"rating": 4.0, "review": "It has it's issues. But overall it is good.", "verified": true, "helpfulness": "0/0", "author": "Franko"}, {"rating": 2.0, "review": "It's ok...doesn't play Hulu well....constant freezing.", "verified": true, "helpfulness": "0/0", "author": "Saquienthia"}, {"rating": 5.0, "review": "We purchased chromecast 1st, not happy with it. Regifted at Christmas, those people say the are happy. But we then bought the Amazon Fire Stick, LOVE LOVE LOVE IT!!!!! Only question I have is can I buy a 2nd one to put in Bedroom, or will it confused it reading both at once?? Please let me know want to use for relaxing sounds in Bedroom.", "verified": true, "helpfulness": "0/0", "author": "Tammy L. Harris \"dippindoodle\""}, {"rating": 5.0, "review": "Works flawlessly. Absolutely love it!! Easy setup, convenient and the app available for android users is amazing.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "So easy to use and so much to watch!", "verified": true, "helpfulness": "0/0", "author": "Maggee \"Maggz\""}, {"rating": 5.0, "review": "After owning a chromecast and fiddling around with my friends Roku streaming stick, I can honestly say that the Firestick is so much better.One thing I love about the Firestick is the included remote. The chromecast required you to use an app on the phone, and I just never really liked the fact that you were forced to use the app. The remote is very responsive, and fits well in my hand. It's very easy to use as well.The Firestick offers an app available for Android and iOS that essentially acts like a remote (even has voice control, which is pretty neat).There is also a ton of apps on the Firestick that can be downloaded. Personally, I use Pandora, Netflix, and CrunchyRoll on a regular basisI would definitely recommend this product. It packs quite a punch, and performs well above other steaming sticks within this price range.", "verified": true, "helpfulness": "0/0", "author": "Adrian Licea"}]