[{"rating": 5.0, "review": "Have the cheapest internet service my cable service offers.They told me it wouldnt stream movies.Guess what? YES IT DOES.Lowered my cable to the basic service and I watch Prime movies all the time.Love that I have the fire stick on my TV,phone and chromebook.Set up took minutes.", "verified": true, "helpfulness": "0/0", "author": "Nan"}, {"rating": 5.0, "review": "Xmbc/Kodi. Only media stick that you can put it on and makes all the difference in the world", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 1.0, "review": "nothing to show how to connect to the actual movies ect", "verified": true, "helpfulness": "0/0", "author": "harleyhayward"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Carlos Brito"}, {"rating": 5.0, "review": "love it! had to reset it two times by unplugging it but that is the only thing bad we encountered. My husband does not like to use phone access to anything and the remote control makes it excellent!!", "verified": true, "helpfulness": "0/0", "author": "Bonnie S Stencler"}, {"rating": 5.0, "review": "We love all of our Fire products.  Took a little bit to figure out how to stream some off of some things but it works with just about everything we want it to work with.  Would suggest this over Roku or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "J. Hess"}, {"rating": 5.0, "review": "Love it!! Our 'smart tv' in the bedroom did not give us ability to use amazon and we purchase movies on amazon. So we got the fire stick and it has been great! It was super easy to set up and we were on it very quickly. Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Teachrz Rock \"T - Teacher\""}, {"rating": 3.0, "review": "Thought it awesome out of the box.  A week later I found some glitches. Main one being Netflix stopped working. Googled fixes, one finally worked... for a week. Then it glitches again not sure if its a Netflix issue or Amazon. Annoying regardless.", "verified": true, "helpfulness": "0/0", "author": "Brett M."}, {"rating": 5.0, "review": "great little gaget", "verified": true, "helpfulness": "0/0", "author": "James H. Wallace"}, {"rating": 4.0, "review": "Not a bad device, however the options for prime streaming are complete garbage. Free, yeah ok, maybe the first season. After that it's $2.99 per episode... Device is great for money paid vs competitors, however I bought an Amazon device to solely run Netflix, a non Amazon company.", "verified": true, "helpfulness": "0/0", "author": "Anthony Iannucci"}]