[{"rating": 5.0, "review": "Absolutely love the display!!", "verified": true, "helpfulness": "0/0", "author": "Kacie"}, {"rating": 5.0, "review": "Love it, easy to set, easy to use and the show options are wonderful. I got the Fire stick to go along with Prime, both are very good investments!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Garcia"}, {"rating": 2.0, "review": "I'm used to a roku 3. Bought this for my other TV because I got it on sale prime day. A mistake. Ux is clumsy and hard to find popular apps like mlb.tv. the stick frequently buffers or freezes where I never experienced it on the equivalent roku apps.  All in all, I'll try and return this and go back to roku.", "verified": true, "helpfulness": "0/0", "author": "joey@aws"}, {"rating": 5.0, "review": "It worked as described", "verified": true, "helpfulness": "0/0", "author": "RCR"}, {"rating": 5.0, "review": "We are very much satisfied with the Amazon fire stick. I will most likely buy another for our grandson.", "verified": true, "helpfulness": "0/0", "author": "Glenn G. Wood"}, {"rating": 5.0, "review": "I love this little gadget! I received it in Two days via Amazon Prime (I love Amazon Prime!). I plugged it into my HDMI #1 slot and it started right up. First it did a quick update, I logged into my Amazon Prime account  and the menu appeared. I was watching a show within a very few minutes on the big TV screen. I have a Netfilx subscription as well as Amazon Prime- both are very easy to navigate through.I'm super happy with my little Firestick.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 5.0, "review": "Easy to setup, easy to use, and no problems when streaming, altogether very pleased", "verified": true, "helpfulness": "0/0", "author": "E. Taylor"}, {"rating": 4.0, "review": "I have a smart tv, and it has the amazon app.  The fire stick tho makes my amazon prime movies so much easier to get to. It also is WAY more organized,  which again makes it easier to find what I want.  Very pleased with this purchase,  and I'll admit, I am pretty picky.  Forgot to mention,  the fire stick makes the movies stream almost instantly, and the picture is much clearer for some reason.", "verified": true, "helpfulness": "0/0", "author": "eric14"}, {"rating": 5.0, "review": "It's great!!", "verified": true, "helpfulness": "0/0", "author": "cj14"}, {"rating": 5.0, "review": "Just as describe", "verified": true, "helpfulness": "0/0", "author": "billy london"}]