[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Paul G. Lasko"}, {"rating": 5.0, "review": "It's Fast and works great. So satisfied I got a second one for another room.", "verified": true, "helpfulness": "0/0", "author": "2DogFamily"}, {"rating": 5.0, "review": "works great! I thought my blue ray internet capable would work but it didn't even get the signal. I plugged in the fire stick and shabam I am on!'", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 3.0, "review": "I've only been using it for a few days and so far, so good.  It basically meets my expectations.  I would have given it more stars, but disappointed that I cannot view most of the programs on the History channel even with the History app because Direct TV is not an option as far as a provider goes when you select the fire stick as the device (if you have apple tv, Direct TV is an option for that device).  It would be nice if Amazon would get Direct TV as an option for the fire stick on the History app.", "verified": true, "helpfulness": "0/0", "author": "Darlene Silva"}, {"rating": 5.0, "review": "Love the Fire TV Stick. Seamless operation with the included remote. Makes my older TV a simple conversion to a smart TV.", "verified": true, "helpfulness": "0/0", "author": "scarlett724"}, {"rating": 4.0, "review": "Works great. This is my second one. Better than Roku. I'd give it 5 stars, but opening the back of the remote to install batteries is really tough. I cracked the back of the remote trying to open it. Other than that it's perfect.", "verified": true, "helpfulness": "0/0", "author": "Rayman"}, {"rating": 5.0, "review": "Well worth the money", "verified": true, "helpfulness": "0/0", "author": "Kyle Cooper"}, {"rating": 4.0, "review": "I've tried a Google Chromecast, & now a Fire TV Stick.The Fire TV Stick's main feature is accessing the Amazon Instant Video, which is pretty good, *IF* you've got the Amazon Prime option.With the Prime option, a lot of Amazon's content is instantly available, AND for *FREE*, too.  Not all of but it seems like a lot, ALTM.I bought it for the wife, & it seems that she's not nearly as interested in it as I had thought, so the biggest drawback isn't the device, it is its intended function.Not that there's anything wrong w/ it, as it seems like a good choice, *IF* you've got Prime, & *IF* you want to watch the Prime choices.I was a little disappointed in that there doesn't seem to be any way to access the internet w/ the Fire TV Stick.I was hoping that it would do both, access Amazon's Prime Video, AND let us use the 'net on the flat screen.In that regard, & that regard *only*, Google's Chromecast is superior—you can use it to go online, its just not a great choice if you need to interact w/ a website.To summarize, the Chromecast does the web, a little, & the Fire TV Stick does Amazon's Instant video, a lot.So my question is; what do I need to do BOTH?", "verified": true, "helpfulness": "0/0", "author": "Jonathan Steedley \"sl0j0n\""}, {"rating": 5.0, "review": "This is a great little device. It has turned a non-smart TV into one that I can easily enjoy any Amazon Content on (I am not currently using it for any other source). I am still learning what all it can do, but have watched movies, listened to music and downloaded games thus far, and am very pleased with the results. It is easy to use and was already set up with my Amazon account when I received it; just needed to connect it to our Wi-Fi. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Steve C."}, {"rating": 4.0, "review": "I love the Amazon Fire Stick. It was easy to set up. In a matter of minutes I had tons of movies and TV shows to choose from. The only problem is that it cuts out sometimes due to a bad connection to the internet. That may be because of my Wi-Fi, I'll have to get a stronger connection. But I'm always able to get it working and finish watching my programs. I already started watching The Walking Dead and I have tons of other shows on my Watch list as soon as I'm done watching this. I highly recommend this product to people who enjoy television. There are so many TV shows coming out  that are exclusive to Netflix or Amazon so it's important to have this so we don't miss out on great television.", "verified": true, "helpfulness": "0/0", "author": "Craig"}]