[{"rating": 5.0, "review": "Easy to install and use meets expectations", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "Quick and easy install.  Slim, well designed remote.  Nice user interface.  The one thing I would like to see improved would be the ability to 'pin' select apps to the home page.", "verified": true, "helpfulness": "0/0", "author": "Todd & Jodi Prideaux"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Russ Stuttle"}, {"rating": 5.0, "review": "Everything I heard it was", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I can stream video OK after a couple phone calls, but I'm disappointed that I can't get the sound to go through my stereo system. Everything else does: DVD movies, CD music, cable, network TV, recorded TV programming, FM and AM radio. I used up the two HDMI input plugs in the back of my Panasonic TV to make everything else send sound through the stereo speakers. So I got an expanded HDMI device. But streaming content goes through the TV speakers. I have a video sound cable plugging into the square plugs to get the sound to the receiver.", "verified": true, "helpfulness": "0/0", "author": "janet"}, {"rating": 2.0, "review": "I've had a chance to use this as well as Google's chrome cast. While the fire tv stick has a remote attachment which is neat, I didn't find that setting it up was quite as easy and had more interruptions of service.", "verified": true, "helpfulness": "0/0", "author": "Ralph Linsangan"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Brenda S Walters"}, {"rating": 5.0, "review": "So awesome! Easy to set & use! Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "J. Hidritch \"MamaH\""}, {"rating": 5.0, "review": "Great little streamer. Much preferred to the Chromecast because it has its own remote an don screen interface. App library is plentiful and streaming quality is great. Not quite as intuitive to use as Apple TV, but pretty great in its own right.", "verified": true, "helpfulness": "0/0", "author": "Reid Sorenson"}, {"rating": 3.0, "review": "I wish the fire stick had voice control.", "verified": true, "helpfulness": "0/0", "author": "B. Boop"}]