[{"rating": 5.0, "review": "Lived up to my expectations!", "verified": true, "helpfulness": "0/0", "author": "John Hughes"}, {"rating": 5.0, "review": "Love it...have barely watched cable since receiving the fire stick", "verified": true, "helpfulness": "0/0", "author": "wayne l kelly"}, {"rating": 2.0, "review": "We expected the device to allow internet access.  If it does, it did not come with instructions as to how to connect. ;(", "verified": true, "helpfulness": "1/1", "author": "dkchick"}, {"rating": 5.0, "review": "Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Steve Walser"}, {"rating": 5.0, "review": "This has been better than expected. Initially wanted it to mirror my Kindle Fire HDX and had issues. Found out the blue tooth function has to be off then it worked like a charm. Also use it with my hotspot on our tv at our r.v..  No need for cable anymore, we have plenty to access through Amazon to settle in later in the day and it's HD quality viewing.  We surprisingly started to use it at home more because of the HD quality shows. For the money, this is worth it.", "verified": true, "helpfulness": "0/0", "author": "Faith S."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Marta Silva Romero"}, {"rating": 4.0, "review": "Works as advertised, got it on sale", "verified": true, "helpfulness": "0/0", "author": "Edward"}, {"rating": 3.0, "review": "Would be nice if you were able to select HD or SD for streaming. Most of us have data caps on our internet and this quickly shot us over ours.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Goff"}, {"rating": 3.0, "review": "Not up to my expectations.  I own a Roku3 latest generation AppleTV, ChromeCast and now an Amazon Fire Stick.  The Roku and AppleTV so far are the best.  As for the Fire Stick, I’ve only used it for about a week but it has frequent pauses, basically stating my data connection is not strong enough.  I’ve a steady 13 mbps connection and yes that’s not ideal for streaming but my Roku and AppleTV do not have this issue.", "verified": true, "helpfulness": "0/0", "author": "DW"}, {"rating": 5.0, "review": "It works as advertised. I have only had it for a week but so far its great.", "verified": true, "helpfulness": "0/0", "author": "Collins M Clark"}]