[{"rating": 3.0, "review": "I really wanted to like this device, but alas, I think the Fire TV stick is not for us, at least not at this time.Full disclosure- I did buy this, like others, as a Prime Member for $19 when it was first released.  We are also consumers of two Roku boxes and one Roku stick.  Unfortunately, in my excitement at its faster processing speed and my desire to have a cool gift for my husband to unwrap, I saved it for Christmas, even though it came a few weeks earlier.We mainly watch Netflix and Amazon prime channels on our Roku devices so I figured this would be an easy transition.  I really love having the Amazon Prime Library available on the TV.  I utilize this premium of our Prime account on my Kindle Fire device all the time and having it stream in the living room saves me power on my tablet and is convenient.  My son and I have also tried out some of the games available through the device.  One was the Toy Story Smash which I had on my tablet and it was fun to play it on the TV without having the kids try to take my Fire away from me.*We didn't notice a faster speed than the Roku.*I was really disappointed to see that the voice control feature was NOT compatible with my older generation (2012) Kindle Fire HD (that does have a microphone built in).  My husband was showing me how he had the voice control on his phone app but I didn't have the voice option on my Fire.*Hubby watches NHL game center channel on Roku, NOT AVAILABLE on Fire TV stick.  Boo.  This is a big one.*Another channel we watch is Right Now Media, which offers a lot of wholesome kids programming and Christian based Bible studies and entertainment.  This too is not available on the Fire TV.*The kids were confused by the remote control.  Having only a matte black circle in the center and a shiny black circle surrounding it, with no labels, I understand why.  Granted, if this were our device of choice they would probably take to it well and figure it out, but it is something to take note of if you are shopping for a device that is kid friendly or for the elderly.Over all, for our family, this is not the right fit.  The price was right, I wanted to love it, but it just didn't work for us.", "verified": true, "helpfulness": "0/2", "author": "K. McNett \"speedkc\""}, {"rating": 5.0, "review": "Double wow!", "verified": true, "helpfulness": "0/0", "author": "J. Flynn \"yes\""}, {"rating": 4.0, "review": "I have to say I'm seriously impressed by this little device.  It is about 85% as good as it's larger cousin the Amazon FireTV.  The menus are fast and responsive,  video playback is smooth,  wifi reception is good.  It plays a smaller number of games than the bigger version, but what is available plays smoothly and nicely.The only drawback I've found is that the included remote is far lower in quality than the one included with the larger FireTV.  While it feels okay in your hand, it doesn't have the nice grippy finish of the better remote.  Also, the buttons are kind of mushy and don't have a nice positive feel to them.  Also, a small downside is the need for an external power brick with this.  With it's small form factor we could hope that it would be able to draw enough power directly from the HDMI input,  this appears to not be the case.  I'm sure this is something that an advancement or two in HDMI tech will fix eventually, and I can't really blame Amazon for that.Also, like it's bigger cousin, there is not yet any included support for HBO Go.  Which is a shame because if it was included this or the FireTV could replace my Roku 3.  I'm sure it will come eventually.  The support for Amazon Prime Video, Youtube, Netflix, and a large variety of others is great on this device, and I'm sure will grow as Amazon increases it's developer pool.To put it succinctly:  This is one serious little media streamer that is very worthy of your attention if you're on a budget.  If you can swing the few dollars more,  get the regular FireTV.  The better remote will make a huge difference in the experience.", "verified": true, "helpfulness": "0/0", "author": "justinflood"}, {"rating": 5.0, "review": "So far this has been a great device. I simple pulled the AppleTV connector out from my TV. While I'm still becoming acquianted with the navigation, it seem about as easy as the AppleTV.", "verified": true, "helpfulness": "0/0", "author": "George \"I read to understand and have the best advisors in the world\""}, {"rating": 1.0, "review": "This was one of the WORST experiences of my LIFE!!! This device is NOT compatible with ALL televisions! I spent 3 hours on the phone with (outsourced) tech support with not one but two devices. I told the first rep on the first device my TV type. Rather than checking for compatibility issues she sent a second firestick. Same issues. Audio no visual. Two hours later still no resolution. Finally provided an URL to check device compatibility. NO GO!!!  this should have been disclosed on the sales page. CHECK YOUR TV COMPATIBILITY ***prior*** to ordering this device as no disclosures on the buy page. That's 3 hours of unpleasantness of my life I'll never get back! *****BEFORE***** ordering this device do yourself a favor & find device compatibility. GRRRRRRRRR. They couldn't have cared less. Sad for a site I've had so much respect for previously. I had to give 1 star ONLY because it won't accept a ZERO star rating.", "verified": true, "helpfulness": "1/2", "author": "Avid Reader"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Hernan Cabrera"}, {"rating": 5.0, "review": "Pretty incredible product.  Very easy to install, unlike most other tv interface devices.  And it's really easy to operate.", "verified": true, "helpfulness": "0/0", "author": "James L. \"JIm\""}, {"rating": 5.0, "review": "Great I watched 3 movies got money back", "verified": true, "helpfulness": "0/0", "author": "Louis Iovino"}, {"rating": 5.0, "review": "Easy to set up, low profile, works exactly as described. I use prime a lot, and this is a great way to access my favorite programs quickly.", "verified": true, "helpfulness": "0/0", "author": "Kathi R"}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "OM"}]