[{"rating": 5.0, "review": "I like the simplicity and functionality of the Fire TV stick.  It was very simple to install and I had it fully function with the latest updates with in minutes of installing the device.  I have not played any games with it yet and probably wont but think it's a nice feature.  I like the dongle extender to make attaching the device to the HDMI port easier on some models.  I think the power cord needs to be longer. Four feet is not long enough and I am exploring some options to get a cable of 9 to 12 feet long.", "verified": true, "helpfulness": "0/0", "author": "Shannon Michaels"}, {"rating": 5.0, "review": "Works as advertised... Have had a small feed back issue. Not sure if it's the stick or something else in my system", "verified": true, "helpfulness": "0/0", "author": "Andrew Ferguson"}, {"rating": 3.0, "review": "I've been using Chromecast for awhile now and love the fact that I don't need a remote to navigate my apps and content. With the Fire TV Stick, you'll be in Amazon's ecosystem and can not browse content off your non Fire OS device and and \"Cast\" it to your tv. That's what really slick about Chromecast. I've had this for 2 days now and the only thing I use it for is to watch my Prime videos (which I also have for Google TV for, but this is much easier). I tried playing a couple games, but most of them are just cheaply developed games that you can get for you smart device anyways.Yes, there's a remote control app available for non Fire OS devices, but I found the swiping for up and down kind of annoying. Paired with a Fire OS device, this will probably work better. Amazon will probably never release a stand alone app for their ecosystem for other platform, so if you want the best experience, you'll have to buy into their ecosystem.....which means re-purchasing all your apps, movies, music, etc....I bought the PLEX app for Android devices, I'm not going to buy it again.I'm just so used to casting my phone apps and content to Chromecast that I don't think I can get used to the Fire TV stick because it feels like Google TV, which I didn't like at all. Is it a Chromecast Killer? No. If you're ingrained into Amazon, you'll probably like more than me.Short and simple.....If you have Fire OS devices, it's worth a try. If not, stick to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Toua Yang"}, {"rating": 4.0, "review": "Easy to set up, works great. I would give it 5 stars if the apps twc tv and hbo go were available for the fire stick", "verified": true, "helpfulness": "1/1", "author": "Maureen Fink"}, {"rating": 2.0, "review": "This is the only wifi device that says my internet internet connection is too slow. I can't watch anything yet except pictures.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"booki\""}, {"rating": 4.0, "review": "Works great as expected.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "This is a great little device! It does however seem to have a bit of jerkiness when navigating around - this may be due to the lower speed internet in our area. I like that you don't actually need to plug it into the wall if your TV has a USB port.", "verified": true, "helpfulness": "0/0", "author": "Michael Mucklow"}, {"rating": 4.0, "review": "The set up was successful once I inserted the plugs all the way in to the sockets.(power and HDMI). I watched a Prime series I have been watching with my Roku devise all a larger TV than the one in my bedroom. The only difference I have noticed so far is the sound; it was not as clear. I have yet to figure out whether or not I can get subtitles. Otherwise, the FireTV Stick met my expectations. Thank you.", "verified": true, "helpfulness": "1/1", "author": "joan dittmer"}, {"rating": 5.0, "review": "Great device. Hides conveniently behind your television while offering a quick connection, easy to navigate interface, and a ton of apps.One thing of note is the comfort of the remote. It's quite possibly one of the best feeling remotes I've ever held. The fact it doesn't have to have line-of-sight to the device just helps add to the experience of using it.", "verified": true, "helpfulness": "0/0", "author": "Ben Estes"}, {"rating": 3.0, "review": "I'll start by saying I like the Fire stick overall.  However, I don't it's quite as good as the Chromecast.  I like having the remote as an option, and I like that I can still \"cast\" media to the Fire Stick like I could with the Chromecast. But other than the remote, I don't see any advantage to the Fire Stick.The negatives I do see with the Fire Stick:1. UI is cluttered with unwanted Amazon content.---Instead of a simple app list, the home menu is full of terrible suggestions and tons of pay content that I have no interest in buying. If you want to know what it's like, try opening Netflix by going to the Play Store or App Store instead of just clicking the icon on your homescreen.  If you  only use a few apps, then this won't be a big issue due to the \"recent\" app list, but you'll still have to see all the clutter on the home page regardless.2. I have to re-purchase Plex for Amazon.---I would MUCH rather have Plex (and HBOGO for that matter) than Amazon Prime Video.3. 5G wireless connection has a ton of bugs.---Android Fire TV app can't find the Stick over 5GHz and several Stick apps have trouble with the 5GHz network.4. No volume control---Different apps have different audio settings requiring me to constantly switch remotes to re-adjust the volume.I'm going to use the Fire Stick for a few more days to make sure it's not just a need to adapt, but right now I think I prefer the Chromecast's device-based interface to the slight advantage of a physical remote.", "verified": true, "helpfulness": "1/2", "author": "malachi"}]