[{"rating": 5.0, "review": "Love it.  Simple, quick and thorough. We have a Roku3 on the primary TV, but this little thing is quite the competitor. The slide show feature turns our TV into a picture frame while not in use.Only drawback is that Amazon and Google don't play well together; no Google Play movies.", "verified": true, "helpfulness": "0/0", "author": "AmazonJoe"}, {"rating": 5.0, "review": "have the chrome cast and I can asure you fire stick is much better...", "verified": true, "helpfulness": "0/0", "author": "v bngmfnzxxhsgxyjxybnxgfncvgvjnxnxv kfmkdkgxhhn nchdhnvbxhgubuvbhhvhtbdgbvy hfgbmdjbmjfjbj"}, {"rating": 5.0, "review": "The Fire TV Stick has us watching TV again.  Skip the commercials watch a couple episodes on your time--no Viagra or Attorney ads--slick.  Was a snap to install and intuitive to operate. Love it.", "verified": true, "helpfulness": "0/0", "author": "Irish in Carmichael"}, {"rating": 5.0, "review": "This is truly one of the best investments I've ever made.  We have enjoyed this Fire TV Stick so much in the fairly short time I've had it.  I have raved about it to everybody!", "verified": true, "helpfulness": "0/0", "author": "cherylny"}, {"rating": 4.0, "review": "love it!", "verified": true, "helpfulness": "0/1", "author": "Michelle Clair \"michelle clair\""}, {"rating": 4.0, "review": "I bought this for my parents, who only have Amazon Prime (didn't want to use any other features). They had tried to watch free streaming movies by plugging a laptop into the tv with an HDMI cord, and the buffering ruined all movies! Slowest loading ever, no matter how we changed the loading settings on the computer. The Fire stick totally solved this issue. The sound quality is a little different on the tv, but it is great to get through a movie without a 20 second pause every 5-10 minutes. This is the only feature I can speak to, but it is great and we know it's good quality because it's Amazon. Also, I ordered during the holiday backup, and it arrived a week or so early!One thing we didn't know is that the stick has to be plugged in to a wall outlet with an awkward cord. It makes the tv layout a little odd, but it works so we're happy.", "verified": true, "helpfulness": "0/0", "author": "Reviewer 1"}, {"rating": 3.0, "review": "Out of the box it was junk. trouble finding and keeping connected to router. I decided to order an HDMI extension and place it anywhere but behind the tv and it worked, no more streaming problems. What I ordered was \"Aurum Ultra Series - High Speed HDMI Extension Cable Male - Female (6 feet) With Ethernet - Supports 3D and Audio Return Channel\". I removed the stick from the 4\" extension provided with the stick, connected the extension to that and the stick to the end of the extension. KAZAM!!!!!!!! Works like a champ.  Hope this helps.", "verified": true, "helpfulness": "0/0", "author": "Myra"}, {"rating": 3.0, "review": "I had very high expectations even though the price was relatively cheap. I'm finding its having to buffer quite a bit and I wish \"newer\" movies were available with prime. Internet connection is steady with all my other electronics but have some issues with this one", "verified": true, "helpfulness": "0/0", "author": "RM79"}, {"rating": 5.0, "review": "I was worried this would be a really crappy and slow interface.  It actually works really well even over our wifi at home.  I thought for sure there would be image quality issues trying to stream wirelessly on a 50 inch TV, but they did something right and it's not an issue.  I don't even have any issues gaming while my wife is streaming.  This works exactly as promised with no issues at all.  My wife loves that she doesn't have to give up her shows while we use the Playstation downstairs anymore.", "verified": true, "helpfulness": "0/0", "author": "MikeB \"Torres\""}, {"rating": 1.0, "review": "Out of excitement, I ordered this only to get disappointed with its performance. Not sure why it was keep dropping wifi reception since it was only 10 feet away from router. None of my devices drops Internet signal but this thing keep doing it to the point that it became a piece trash sitting in my house.", "verified": true, "helpfulness": "2/3", "author": "aj"}]