[{"rating": 5.0, "review": "Extremely easy to use, simply love it...", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Its better than I though it would be. So far very little problem with it. I hope it continues this way.", "verified": true, "helpfulness": "0/0", "author": "D H"}, {"rating": 5.0, "review": "I love it! I can watch a movie whenever I want and if nothing on TV then I watch a series! All the episodes! It's really awesome!", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 4.0, "review": "Love it.  So Simple to use.", "verified": true, "helpfulness": "0/0", "author": "T. Hughes"}, {"rating": 4.0, "review": "Not as easy as Roku 3 yet as plenty powerful with some free remote perks that roku doesn't have .", "verified": true, "helpfulness": "0/0", "author": "Stephen P Adduci"}, {"rating": 1.0, "review": "I bought this to watch Netflix on my bedroom TV and I watched for a couple of hours, constantly interrupted by buffering, and now I can't get it to work at all...it keeps saying the home page is unavailable and to check my network settings, which then tells me that it's connected with problems.  I'm thinking about returning it.  Not worth the money!!", "verified": true, "helpfulness": "0/1", "author": "Christine Christine"}, {"rating": 5.0, "review": "This thing is AWESOME. You can rent movies, get on Netflix and Hulu (you still have to have the accounts for these) , it's got games and music and movies and tv shows, even apps for cooking and crafts. Just about anything you can think of.  Super easy to install and simple to use. Even my kids can use it. I haven't even explored it completely. Great price for all that you get out of it.", "verified": true, "helpfulness": "0/0", "author": "Holly Hoeksema"}, {"rating": 5.0, "review": "I ordered this for my son's bedroom so that I could get Netflix on his TV.  I particularly liked the fact that it comes with a remote.  That said, Mom is having a hard time figuring out which button does what...maybe in time I will \"get\" it.  We've been using it for about 4 months now, and have had no issues with it.", "verified": true, "helpfulness": "0/0", "author": "S. Woods \"spar97\""}, {"rating": 1.0, "review": "I really wanted to like this and I tried my hardest, but there is no way. This is garbage, pure and simple. Unfortunately, I have two and neither works with any reliability. The unit can go through periods where it will not respond at all to the remote, then suddenly the Fire Stick will go nuts and you've accomplished nothing. Trying to program the Fire Sticks initially should have told me to send them back, they took almost an hour apiece.One you get everything set up and finally working, you still have to deal with the terrible remote to Fire Stick communication. Want to rewind? Good for you. We'll let you stop when we feel like it. You may wind up at the beginning of the show.Do not bother with this if you have a crappy ISP like Tine Warner. I have no choice, so I'm stuck. Whenever the internet goes out, you may have to wait for the Fire Stick to reconnect. This could be seconds, it could be minutes. Have a book handy. Again, you may be stuck with the non-responsive Fire Stick in the middle of this.Hopefully Amazon will develop a version with less suck and more responsiveness.", "verified": false, "helpfulness": "0/2", "author": "David"}, {"rating": 2.0, "review": "It was average experience nothing so good about it.  Comcast would have been a better choice and more user friendly", "verified": true, "helpfulness": "0/2", "author": "Tejas Shah"}]