[{"rating": 5.0, "review": "Fire Stick has a learning curve at first, but it gets easier.  The user interface is easy to navigate,  and I hope more apps and movies are on the way.", "verified": true, "helpfulness": "0/0", "author": "Glenn E Oller"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Tom Swank"}, {"rating": 4.0, "review": "Great and easy to install on Sony TV - good thing I had Amazon account already that made it easier.", "verified": true, "helpfulness": "0/0", "author": "dafl"}, {"rating": 5.0, "review": "Absolutely LOVE IT! Everything I was looking for for my daughter and I.", "verified": true, "helpfulness": "0/0", "author": "hairmama39"}, {"rating": 5.0, "review": "This thing is awesome! Who needs a smart TV when you have this for the fraction of the cost.", "verified": true, "helpfulness": "0/0", "author": "L and G's mom"}, {"rating": 3.0, "review": "Wonderful for accessing Amazon items.  OK for other services IF they are available for Fire.  The two that I am most interested in, it turns out, are not.Bigger problem was the ongoing dropping of the connection.  I replaced the Fire Stick with a Roku and have had zero issues with the connection dropping.", "verified": true, "helpfulness": "0/0", "author": "Helen Crow"}, {"rating": 3.0, "review": "Waited to review the stick until a few software updates were added.  Decent stick for the money, but Netflix has an annoying stutter much of the time during streaming.  It has gotten a little better with the updates, but still there way too often.  Amazon streaming rarely has the same stutter.", "verified": true, "helpfulness": "0/0", "author": "codgr"}, {"rating": 4.0, "review": "It works fine, I was disappointed that the remote wasn't activated like my original fire TV.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Fire stick Ok with my TV, but cannot watch PAID videos on my Samsung Tablet.  Can only watch PAID videos on Kindle Fire and ipad's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great Buy!!!", "verified": true, "helpfulness": "0/0", "author": "Keith Langford \"purpose driven\""}]