[{"rating": 5.0, "review": "Installed in a minute and set-up was so simple!  I love this thing..... I see popcorn, hot chocolate and a Netflix marathon in m future! :-)", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 3.0, "review": "It really is a nice device and easy to use.  Great if you are a Prime member and have no other way to use Prime music, videos, games, etc...  Problem is that the apps don't work with Charter Cable's authentication.  I have another device that streams Prime videos so I primarily bought this to use the Watch ESPN app and I can't.  If I had known this I would not have bought it.", "verified": true, "helpfulness": "0/0", "author": "Revengeance"}, {"rating": 2.0, "review": "A few problems with this device that I'm sure Amazon will change in later iterations. It plugs into the HDMI port on your TV but then you have to plug in a USB power cable via an included wall A/C adapter. Even if your TV has a USB port (mine does) you can't use that port -- you'll get a screen message saying the USB port does not supply enough power. So when Amazon figures out how to power this without the mess of wires you have to connect to it I'll try it again.", "verified": true, "helpfulness": "6/8", "author": "T. Gardner"}, {"rating": 5.0, "review": "Bought as a gift for our son.  He loves it.", "verified": true, "helpfulness": "0/0", "author": "Tiki"}, {"rating": 3.0, "review": "Disappointed! It would be cool if the playback was not so choppy. I know that the lag is not my internet because I am able to watch things on my kindle and phone with no issue. I will keep for the device mirroring but I think that will be my primary use for it.Eta to add a star. After using the hdmi extender I have seen some major improvement. So use the hdmi extender!", "verified": true, "helpfulness": "0/0", "author": "Ebone"}, {"rating": 3.0, "review": "The main reason I purchased this was to use Miracast. It's supposed to mirror my windows 8.1 computer to my tv. It doesn't work as claimed. I've searched the forums and it seems everyone has the same issue. If you don't need Miracast then yes this is a 5 star product. I was able to mirror my Android phone after many attempts but unfortunately not my computer.", "verified": true, "helpfulness": "0/0", "author": "John L. Pongrac \"mtnwest\""}, {"rating": 5.0, "review": "This product is very responsive and easy to use.  Love the mini remote control which makes it much easier to use than the chrome stick.", "verified": true, "helpfulness": "0/0", "author": "BE"}, {"rating": 3.0, "review": "UPDATE: I got the stick to work with my NETGEAR N600 (WNDR3700), however to get this working I had to re-work my entire WLAN because the FireTV stick does NOT support special characters in the SSID!The reason I am giving the device 3 stars and not more is because setup is a PITA, a device like this must support WPS to make WLAN config trivial and not depend on a display keyboard to enter the password.ORIG REVIEW: Beware this stick does not work with every wireless router, in my case I have a NETGEAR N600 (WNDR3700) and the stick is unable to connect on b/g/n and a/n networks, with or without a password.The distance between my router and the stick was less than 4 ft.", "verified": true, "helpfulness": "1/2", "author": "Sauraus"}, {"rating": 5.0, "review": "Very simple to set up and use.  Works great, I was surprised with it's speed.  Great value for what is on the market in this product type.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "This is cool. It's so much faster to get where I want to be than through the TiVO, or the game box. I like how it automatically adjusted the screen size. I wish the Amazon music player had a shuffle all setting or channel creator like Pandora though. If it did I would probably just use this all the time.", "verified": true, "helpfulness": "0/0", "author": "Bhob"}]