[{"rating": 5.0, "review": "Best money I have spent this year.  The Fire TV Stick is way better than Chromcast.  Good job \"Amazon\"", "verified": true, "helpfulness": "0/0", "author": "steve mccord"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "JamminSpacey"}, {"rating": 5.0, "review": "Love this!  I dropped cable and never going back! I'm able to watch all the shows I was watching on cable at a minimal price.  Quality is great, options for TV shows or movies are great, especially for kids.  Easy set up, remote is user friendly.", "verified": true, "helpfulness": "0/0", "author": "Angela E"}, {"rating": 4.0, "review": "Love it.Waiting until football season though to see how well the games will stream..Then might hate it.", "verified": true, "helpfulness": "0/0", "author": "Krista Ruth"}, {"rating": 1.0, "review": "I purchased the device to use in hotel rooms. The meager instructions say simply to plug in the device and begin using it. I tested it on my home system and it worked nicely. However, when I tried it on a hotel system it did not work at all. I was able to insert it into the appropriate tv port but nothing happened. The tv operated the same as before with no new access to Internet . I suspect the hotel tv system was designed to prevent guests from by-passing their pay per view system.", "verified": true, "helpfulness": "0/1", "author": "Curt"}, {"rating": 5.0, "review": "How did we live without this??? Ready to get rid of our satellite!", "verified": true, "helpfulness": "0/1", "author": "Andrea Sergent"}, {"rating": 2.0, "review": "I would like to trade in the fire Stick for my old Roku. With the Fire Stick I can access  programs only that Amazon allows. Otherwise I have to pay to watch programs that the Roku allowed for free. I would never recommend it to anybody.", "verified": true, "helpfulness": "1/2", "author": "Ricegirl"}, {"rating": 4.0, "review": "I really enjoy the amazon fire stick, however, my hulu always lag. I know it isn't amazon's fault but does anyone has that issue?", "verified": false, "helpfulness": "0/0", "author": "Raynelda Salters"}, {"rating": 4.0, "review": "Worked really good for first four months and but now it freezes every few minutes and needs to be re-booted over and over. I paid only 20$ so no regrets.", "verified": true, "helpfulness": "1/1", "author": "Moiz Bohra"}, {"rating": 1.0, "review": "I purchased this because I liked the low profile look of it (but it still uses a chord) and the fact that the remote doesn't need to be pointed at the unit. Also, like a Roku or Apple tv I can have all of the apps I need to watch everything I need. It's so simple yet somehow it has figured out a way to fail, and fail all of the time.When it arrived I also had a new AT&T; service started with the premium internet option. No streaming issues, quick downloads, etc. This wireless router is within 1 foot of my firestick but that doesn't stop it from lagging, buffering, and fluctuating picture quality. You might say, well it's probably your internet connection or data rate. But it's not, my computer even my Wii which I've had as long as I can remember works without issue. Right now as I am typing this it is unable to hold a wireless connection for more than 10 seconds it seems. It connects, I try to watch something on hulu or netflix and I get an empty screen. I try to check for system updates and I can't because it drops the signal, but every time I go to check the signal its fine. Very frustrating. It is at the point where the home menu will not even display because it says it has no signal, yet everything else in the house does. I have rebooted, trouble shooted, and damn near thrown it out the window.Spend the extra couple bucks and get something reliable like a Roku or Apple Tv.", "verified": true, "helpfulness": "0/0", "author": "Brian LaBarbera"}]