[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Scott Daly"}, {"rating": 5.0, "review": "Just what I was looking for!", "verified": true, "helpfulness": "0/0", "author": "LaKeydro Tubbs"}, {"rating": 1.0, "review": "Sucked!!! Buffered the whole time. Took it back and bought a Roku instead. Do not buy!!!!", "verified": true, "helpfulness": "1/1", "author": "caroine hill"}, {"rating": 3.0, "review": "Well it worked really well at first but after maybe a week of use for whatever reason you go to watch a show and it just won't play it until you back up to the home screen and navigate back to the show.  You might have to do this 3 or 4 times.  Its strange and I don't totally understand why it does this.  I do like that it change my \"less than smart\" tv into a smart tv though.", "verified": true, "helpfulness": "0/0", "author": "JenRuss"}, {"rating": 1.0, "review": "I purchased the Amazon Fire TV Stick to replace my Roku Player to stream MLB.TV, thinking that the newer technology would be better. So far, I have been very disappointed. Between the Fire TV Stick and the MLB.TV Premium App, I am experiencing constant buffering and screen freezing. From reading other reviews, this seems to be a frequent problem among users. I have no problems with my internet speed, so that isn't the problem. You really need to fix this problem. I haven't used the Fire TV Stick for any other features.", "verified": true, "helpfulness": "2/2", "author": "Marilyn Shaffer"}, {"rating": 3.0, "review": "It works fine for all Amazon content but struggles with 3rd party content. Cannot pair tablets or phones with YouTube. It also has connection issues. My Blue Ray player does all of that flawlessly and I can watch my Amazon videos on it without the connection issues.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little stick packs a big punch.", "verified": true, "helpfulness": "0/0", "author": "HappyWifeHappyLife27"}, {"rating": 5.0, "review": "Love it!!  Easy, easy, easy to install and operate, even for an old lady!  Selections are fabulous!", "verified": true, "helpfulness": "1/1", "author": "Yogi C"}, {"rating": 4.0, "review": "So good, so far. I can't get the spotify app to work but everything else is good  (:", "verified": true, "helpfulness": "1/1", "author": "Samantha Maye"}, {"rating": 2.0, "review": "My wii does better with wifi connection than this product when we are watching shows.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}]