[{"rating": 5.0, "review": "Bought this when it was on sale for prime members. Did not think I would love it as much as I do. We play movies and got hooked on some of the Amazon only tv shows. Listen to music and really like that lots of the songs have the lyrics showing on screen.", "verified": true, "helpfulness": "0/0", "author": "OK"}, {"rating": 5.0, "review": "Excellent Transaction; Super-Quick Ship; Would Highly Recommend!", "verified": true, "helpfulness": "0/0", "author": "Island Girl"}, {"rating": 1.0, "review": "Never worked! Kept losing wifi connection even though settings showed it was connected. Returned it.", "verified": false, "helpfulness": "0/0", "author": "Cilla"}, {"rating": 4.0, "review": "Love it...Easy to install & easy to use & the price is so right.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Would not connect to router.  Returned.  Amazon return support was excellent.", "verified": true, "helpfulness": "0/0", "author": "DLW"}, {"rating": 5.0, "review": "Its so great to get my programs on the TV without the hassle of trying to connect through my other devices.", "verified": true, "helpfulness": "0/0", "author": "Catherine Leys"}, {"rating": 5.0, "review": "Kids got them for Christmas and love it!", "verified": true, "helpfulness": "0/0", "author": "Allison L"}, {"rating": 5.0, "review": "Love this Fire Stick!!  WAY better than Chromecast with ton more content.", "verified": true, "helpfulness": "0/0", "author": "D. Landry \"liberal squasher\""}, {"rating": 3.0, "review": "The Amazon Fire TV Stick is really nice, and it will probably work well for most people. I currently have 5 Google Chromecasts in my home and I wanted to get the Fire TV Stick to test out and compare. I use the Chromecast and this device almost solely for Plex, and for some reason the Plex performance with the Amazon Fire TV Stick is very poor. Video will freeze and buffer constantly, the Chromecast (also connected wireless) works without issue, Roku works great, smartphones are great, web browser use with Plex is excellent, but the Fire TV Stick is unusable. This could be the fault of Plex (although the app seems well polished, compared to the Roku app which is terrible)Anyway, if you want this for Amazon Prime Video, Netflix or Hulu it's a great choice.", "verified": true, "helpfulness": "0/0", "author": "MarkoDaGeek"}, {"rating": 5.0, "review": "Awsome! So easy to use!", "verified": true, "helpfulness": "0/1", "author": "Lee Harward"}]