[{"rating": 4.0, "review": "The fire stick itself is awesome ..works perfectly just as it says ..only gave it 4 stars since it arrived a day late :( Also, this was purchased to be used in my 4 and 6 year old' s room and it's so easy to use, that (after initial set up) they use it with no problems and actually fight over who gets to use the \"cool\" remote :)", "verified": true, "helpfulness": "0/0", "author": "Kelly Dobrowolski"}, {"rating": 5.0, "review": "works really well.  easy to set up.", "verified": true, "helpfulness": "0/0", "author": "steven dewildt"}, {"rating": 5.0, "review": "I now have 2 fire TV sticks and I totally love them! So easy to use. I can't wait to see the new apps as you add them. Not wild about the intro video, but if I were new to streaming technology I can see where the video would be good.", "verified": true, "helpfulness": "0/0", "author": "WaLadyBluez"}, {"rating": 5.0, "review": "Love it and saved money on my satellite bill as well!", "verified": true, "helpfulness": "0/0", "author": "Michele Laberge"}, {"rating": 5.0, "review": "OK we tried the Roku and ended up sending this back to the store, this would not connect to the local networks. So I decided to send for the Amazon Fire stick and I am so glad I did. Absolutely no problem hooking this to the TV. Within minutes this hooked up and was showing all videos and tv shows and everything needed on the apps to watch live tv. Even movies I had never seen...yeh. Got so sick and tired of all the stupid, worthless reality shows, we had to do something more than watching re runs of 48 hours, criminal minds, NYPD blue. So,  Amazon Fire stick has given us something new to watch. You, have all your favorites plus more. I joined Prime and deleted Netflix Prime have a better selection. Now I can delete most of the direct tv that we pay over $100 a month for and just keep the basic. Apart from saving on the direct tv we now have better tv thankx to Amazon Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Johanna"}, {"rating": 4.0, "review": "I do like the Amazon Fire TV Stick but was hoping more movies than what I found would be a bit less costly. This is why my family and I have decided to buy the Amazon Prime for the year. There is absolutely no way you can go wrong with the Fire Stick and combining Prime.", "verified": true, "helpfulness": "0/0", "author": "Mick Paul \"Eric D. Paul\""}, {"rating": 5.0, "review": "five stars says it all.", "verified": true, "helpfulness": "0/0", "author": "Kenneth R. Rainey"}, {"rating": 5.0, "review": "Very happy with the performance and interface. I had apple tv as well and I find myself using the fire tv all the time.", "verified": true, "helpfulness": "0/0", "author": "Rajat Kumar Jaggi"}, {"rating": 5.0, "review": "If I didn't need the extra channels to watch my favorite sports teams I would just buy this for each tv in my house. This has taken my Netflix addiction to the next level.", "verified": true, "helpfulness": "0/0", "author": "Kegan Woodling"}, {"rating": 5.0, "review": "Amazing product me and my son use it everyday, great games and movies would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Peter S Garcia"}]