[{"rating": 5.0, "review": "Amazingly easy set up. I am very pleased with this purchase. Does everything I hoped.", "verified": true, "helpfulness": "0/0", "author": "William A. Schulz \"Bill Schulz\""}, {"rating": 5.0, "review": "Awesome!! And saving a ton of money. Really thought I was going to miss cable but we all love this so much better!", "verified": true, "helpfulness": "0/0", "author": "Lisa Kennedy"}, {"rating": 4.0, "review": "Very easy to learn how to use. Makes streaming Amazon video very user-friendly.", "verified": true, "helpfulness": "0/0", "author": "C. Crabbe"}, {"rating": 5.0, "review": "Just started using it but I'm sure it will be a new favorite tool", "verified": true, "helpfulness": "0/0", "author": "Kayleigh Rogers"}, {"rating": 1.0, "review": "This review is on my experience only.I thought I would be able to \"mirror\" my new Kindle Fire HD 7 with this device. I already have a Chrome Cast as well as a Ruku box.This is none other than redundancy for me.I know there are exclusive features associated with this unit, but none that I am interested in.I gave it a low rating based on there not being a clear description of the capabilities of the Fire as it relates ro the Fire Stick. I was lead to believe I was able to wirelessly mirror my screen from the Fire HD 7 and found that was not true.Nonetheless, I am keeping the Kindle as is and will move up to the HDX when the bugs are cleared.", "verified": true, "helpfulness": "0/0", "author": "Frank Coleman"}, {"rating": 5.0, "review": "Great price. Got here fast. Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amber Rodriguez"}, {"rating": 5.0, "review": "Great tool", "verified": true, "helpfulness": "0/0", "author": "Jerry Hampton"}, {"rating": 5.0, "review": "although I was super bummed to have missed this item when it was on sale, I would say it is worth it's price. I didn't even know this product existed until I stumbled upon it! We have a guest room tv that does not have cable or built in Internet so it has been basically useless to us. Now my husband can watch Netflix and Amazon shows when he works the night shift and doesn't want to wake me up. Much better than buying another cable box or TV.", "verified": true, "helpfulness": "1/1", "author": "Carolyn"}, {"rating": 1.0, "review": "Was very excited to get this today to replace the chromecast (wanted something with a remote). Right out the box it had issues maintaining a connection to my network. Each time I would try to open an app, it would disconnect. Once I finally got it going for a little bit, it wouldnt load netflix without giving odd errors (check the date and time? not available (-12)?). I checked other apps, and they had problems as well. Amazons own prime movies wouldnt load (I have a prime account) and hbogo showed with a delay. I didnt experience any connectivity issues with my chromecast and none with my appletv. Total time I had this thing was 2 hours before I decided to send it back with no hope of getting my issues resolved (online searches show similar frustrated people).", "verified": true, "helpfulness": "0/0", "author": "Snia"}, {"rating": 4.0, "review": "Lots of great features and channels.  Missing a few, but constantly updating so I'm sure they will turn up later/soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]