[{"rating": 5.0, "review": "I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Diane F Pechacek"}, {"rating": 5.0, "review": "I have a smart tv in my living room but have 2 other tv's that are not smart tv's. The fire tv stick is the next best thing. I purchased 2 fire tv sticks. We can watch Amazon movies, NETFLIX, play games, listen to music and more. I have a Google Chromecast HDMI Streaming Media Player which works fine but being a prime member the Chromecast doesn't support Amazon and I had really hoped Amazon would design a product like Chromecast and here is the fire tv stick. Another thing that is great about the fire tv stick is it has a remote control so you don't have to use your phone or tablet to watch movies, music, etc. I highly recommend the fire tv stick but you need to be sure your tv has at least one HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Excellent product. Beyond expectations", "verified": true, "helpfulness": "0/0", "author": "Victor Doebereiner"}, {"rating": 1.0, "review": "If it would stream Netflix without buffering every 5 minutes, I would rate a lot higher, if it streamed Netflix better. I put it next to router same problems. I have had no problems with Apple TV in same locations.", "verified": true, "helpfulness": "1/1", "author": "justin \"justin\""}, {"rating": 4.0, "review": "It's prettying awesome have this FireTV stick plus it has some great stuff, I'm enjoy it so far!", "verified": true, "helpfulness": "0/0", "author": "Mike Tifiano"}, {"rating": 4.0, "review": "Great to use. Easy set up. Could use a little better way to get through the many screens.", "verified": true, "helpfulness": "0/0", "author": "Steven Mooney"}, {"rating": 5.0, "review": "Only had it a week and I'm loving it...can play music while I'm cleaning and catching up on all the shows I've wanted to watch on a big screen instead of just my kindle fire...and the hubby can watch too!", "verified": true, "helpfulness": "0/0", "author": "stask"}, {"rating": 5.0, "review": "my son loves it!!!", "verified": false, "helpfulness": "0/0", "author": "vballvicki"}, {"rating": 4.0, "review": "Easy to set up, issues with wifi staying connected, changed router channel to 10, seemed to work.  Some slowness with DSL but tolerable for the 39$", "verified": true, "helpfulness": "0/0", "author": "Alison Page"}, {"rating": 4.0, "review": "I was already an Amazon Prime member, and the Fire TV Stick came already configured with my account information. All I had to do was give it the pass phrase for my local WiFi network.My only complaint was it took me a while to figure out how to navigate the online menus with the remote - but perhaps most folks would have known that the ring at the top of the remote were the \"nav\" buttons, while the center of the ring was the \"select\" button.One feature I really like is that once you pause a movie, after a little while the Fire TV Stick begins to display pictures sort of like a screen saver. I've got my Fire TV Stick connected to an input on my home theater receiver, and the changing display keeps that input active on my receiver even when I leave a movie paused for 30 minutes.I've only used the Fire TV Stick to access Amazon Prime TV/Movies so far - but that was why I bought it.", "verified": true, "helpfulness": "0/0", "author": "Hardy"}]