[{"rating": 3.0, "review": "Originally, the Fire TV Stick was not quite ready for primetime. However, it has gone through a number of updates which fixed most of its earlier problems.Was CONSTANTLY getting \"HDCP unauthorised content disabled\" every time I would open Netflix after having left the Fire TV Stick on and plugged in for more than a couple hours. I had to reset the stick AND the TV every time to watch Netflix. Plenty of other people have had the same thing happen.Also, clicking on \"Netflix\" used to bring up information on the Netflix app... kinda stupid. This has been fixed in one of the updates. Now clicking on Netflix... opens Netflix.Pros:- Starts up decently quick- Easy way to start up- Interface has gotten faster- Good amount of apps and games- Annoying HDCP error went away (is this really a pro?)- Clicking on Netflix opens Netflix (is this really a pro?)Cons:- The 20 minute startup instructional video (which you cannot cancel out of) is obnoxious and patronizing to customers.- Rewinding/fast forwarding experience is ok, but not great.- No clock anywhere on the home screen like Chromecast, it'd be nice to have a clock and/or weather since Cord Cutters don't have a cable box with a clock anymore.- There is no way to search Prime for free movies. Somehow watching TV on Prime is more expensive than cable was in the first place. There's nothing more frustrating than browsing all this \"free\" Prime content Amazon's always on about, just to find out you have to pay $50 to watch a season of the show you want to watch in HD.- There is no way to just start into Netflix or any other app you might want.- Cursor defaults to whatever movie they're plugging at the time, which will occasionally cause you to accidentally start that movie.", "verified": true, "helpfulness": "13/13", "author": "Stuff"}, {"rating": 5.0, "review": "Awesome..worth every penny!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Pippin"}, {"rating": 2.0, "review": "Works as intended but you must unplug and restart it every couple of days or your shows starts to skip", "verified": true, "helpfulness": "2/2", "author": "Kyle Virchow"}, {"rating": 5.0, "review": "Better than Plair (before they went belly up) Rasy set up and works great", "verified": true, "helpfulness": "0/0", "author": "Roscoe H Moody jr."}, {"rating": 5.0, "review": "Easy to setup and use.  I love how simple the remote is.", "verified": true, "helpfulness": "0/0", "author": "Vicky Holcomb"}, {"rating": 5.0, "review": "Easy to set up and use.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Di"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Larry Gaines"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "theresa chan"}, {"rating": 4.0, "review": "Enjoy the Fire TV Stick but sometimes it freezes up.", "verified": true, "helpfulness": "0/0", "author": "Milagros Rosado"}, {"rating": 5.0, "review": "great device- great price!  replaced my apple tv with this- no power lines visible.  Great selection of shows as well!", "verified": true, "helpfulness": "0/0", "author": "David Jones"}]