[{"rating": 5.0, "review": "Awesome. Easy to connect and use right away!", "verified": true, "helpfulness": "0/0", "author": "Laura Garcia"}, {"rating": 4.0, "review": "Worked as expected and compliments the bigger Fire TV. I have this set up in the bedroom and with the iOS remote I can control both units and have all my content synced.  Not as fast as its bigger brother but good for what it does. My only wish was that it was powered through the unit itself instead of having a wall outlet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use and easy to set up. liked it so much I ordered anothe one.", "verified": true, "helpfulness": "0/0", "author": "Robert E Stoner"}, {"rating": 5.0, "review": "I love it I can watch all my tv shows", "verified": true, "helpfulness": "0/0", "author": "Michaelclouser"}, {"rating": 4.0, "review": "Item as described.  Voice recognition on the device is OK, but not great", "verified": true, "helpfulness": "0/0", "author": "Michael B."}, {"rating": 5.0, "review": "Great product! Works exactly as expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sherry\""}, {"rating": 5.0, "review": "Love, Love, Love. So easy to setup and use. So many movie apps to download.", "verified": true, "helpfulness": "0/0", "author": "Deaun Sanner"}, {"rating": 5.0, "review": "Quick, easy set up. Came on time as promised. This will be a lot of fun for the family. Thanks", "verified": true, "helpfulness": "0/0", "author": "Michael Hall"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Douglas Warren"}, {"rating": 1.0, "review": "This highly touted device was extremely disappointing. There are only a few channels that it accesses. It is great if all you want do is watch Netflix, Amazon, and Hulu. But Roku is the same price and offers a greater variety of channels. One of my favorites on Roku is Acorn TV, which is all British shows, but Amazon does not have even this variety. I gave it to my daughter--I have no use for it.", "verified": true, "helpfulness": "0/0", "author": "Jeri Sutton Shores MA"}]