[{"rating": 4.0, "review": "Setting up is easy and intuitive. UI is very smooth and the title presentation is much better than many competing products or built-in versions found on some Smart TVs. Rented/Purchased YouTube video contents are unable to be played back using the youtube.com app. Streaming video quality is very good.", "verified": true, "helpfulness": "0/0", "author": "Gadgeteer"}, {"rating": 3.0, "review": "Doesn't add features not already available on smart TV's or other set top devices.It ddi come pre-configured with my account details, that made setup easier. The Smart phone app to control it works well.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Just love it. Easy to use and works well with my tv.  Like it better than the Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"abeewar\""}, {"rating": 1.0, "review": "This will be a 5 when it supports captive portal for hotel logins.  The ONLY reason that I bought this was to take on the road.  For the time being, it is useless.  Do we have a timeline on that?", "verified": true, "helpfulness": "1/3", "author": "Stump \"Stump\""}, {"rating": 1.0, "review": "I eagerly awaited the arrival of my Fire Stick!  Unfortunately, after I completed the set up, it stopped working. After talking to 3 helpful techs on-line, it was determined to be a malfunctioning devise. Stick 2 arrived after 4 days. Also defective. I'm done with this and will probably buy Roku.", "verified": true, "helpfulness": "1/3", "author": "Nancy M. Sweet"}, {"rating": 5.0, "review": "Great device. I was fed up with my $150+ DirecTV bill, so I took the plunge and canceled cable TV. I use this device with the HULU app and pretty much watch all of the same television shows I watched on Cable with my HULU subscription. I am by no means an avid television viewer, so for me, this was a great change and I felt pretty much no difference going from DirecTV with a Genie DVR, to the Amazon Fire TV. Prime movies are great for movies and the HULU app on this device is EXCELLENT for the Cable TV Experience.", "verified": true, "helpfulness": "0/0", "author": "Top Amazon Buyer"}, {"rating": 4.0, "review": "The Fire TV Stick is cool but it feels kinda cheap and I dont like the cord and the remote. It serves its purpose and was a lot less expensive than AppleTV.", "verified": true, "helpfulness": "0/2", "author": "Travis"}, {"rating": 5.0, "review": "Perfect LOVE it will buy one for every TV I own.\"6\" Nice to buy something that does what it what it's advertised to do. AAA+++", "verified": true, "helpfulness": "0/0", "author": "john curtis"}, {"rating": 5.0, "review": "Just got it but was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Live4Art"}, {"rating": 5.0, "review": "This little thing is quick and easy, my 4 year old loves using it to watch her nick jr shows", "verified": true, "helpfulness": "0/0", "author": "Nick S \"Nick S\""}]