[{"rating": 3.0, "review": "Love the ui  but the stick will not keep a connection to wifi. It is not my wifi it's the stick. It drops connection constantly. Keep going back to my old neotv cause the fire stick won't stay connected to network. Such a disappointment love Amazon hate the hire tv stick.UPDATE:  After posting the above review with one star, AMZ contacted me.  Or at least sent me an email saying they had tried to but could not get me on the phone number listed (that seems to be the normal \"response\" from some AMZ customer service).  I applaud AMZ for at least contacting me via email. So I contacted them got to \"tech support\" who said they would call back the next day between 1-5 and also they would send the data from my stick to \"tech for data analysis\".  Got the same email a few days later that they could not contact me on the phone number I gave them which is BS cause it is always with me.  Anyway I contacted AMZ again a few days later. They sent me a new stick.  Same problems dropping network.  So I looked up solutions and tried a tin foil shroud around the stick and so far it appears to work.  I love AMZ and think their customer service and the overall company is GREAT but the customer service saying they will call and then never calling needs to be fixed.  Either dont tell me you will call or do what you say you will do.", "verified": true, "helpfulness": "0/0", "author": "dawson \"dawsonsc\""}, {"rating": 3.0, "review": "It's works but not smoothly as I would like. I have a Mitsubishi TV and 100 Mb Internet speed. Oh well...", "verified": true, "helpfulness": "0/0", "author": "Edward E. Phillips III"}, {"rating": 5.0, "review": "I'm so happy with the fire stick. So easy to install and use. Binge watching...yes!", "verified": true, "helpfulness": "0/0", "author": "sm"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Joan Hausman"}, {"rating": 5.0, "review": "Didn't know that it was so excited am able to watch movies and play games", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Lambert"}, {"rating": 3.0, "review": "Pretty good.  Better interface than Roku, not as much selection.  Interface and remote put it head and shoulders above Chrome, but casting is more difficult.", "verified": true, "helpfulness": "0/0", "author": "Mark Meyer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Gil"}, {"rating": 5.0, "review": "Easy to install and easy to setup.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Charles G. Clemons"}, {"rating": 5.0, "review": "im a happy customer", "verified": true, "helpfulness": "0/0", "author": "Keiyatta Smith"}, {"rating": 5.0, "review": "LOVE IT!! Can't begin to say what a great item the Fire stick ia. Iam paying an arm and a leg for cable and there really is not anything worth watching, with Fire stick I  can binge watch my favorite shows and choose great prime movies. I have no buffering issues, just smooth play. Best money I ever spent!!!", "verified": true, "helpfulness": "0/0", "author": "Karen De Falco"}]