[{"rating": 5.0, "review": "Love this works awesome!", "verified": true, "helpfulness": "0/0", "author": "angel hume"}, {"rating": 4.0, "review": "We have the Fire TV downstairs, and wanted the same functionality in the master.  However, that is a wall mount with a very clean install.Enter Fire TV Stick.  I believe I received this at discount as we are prime members.It is obviously not as fast as the Fire TV, and it does NOT have Voice Search, but it is a great unit.very easy setup, you are already to go!  an essential for Prime folks", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 1.0, "review": "I wish I could say how this product works but it is near impossible to get the back off the remote to put the batteries in. We have been trying for 2 days. About to trow it out the window but I doubt that even works!", "verified": true, "helpfulness": "0/3", "author": "Meghan"}, {"rating": 5.0, "review": "Love it.  Works GREAT!  Movies start quickly and run smoothly. The setup was easy and it is simple to use. Audio is awesome!", "verified": true, "helpfulness": "0/0", "author": "Janelle Bowman"}, {"rating": 5.0, "review": "Works fantastic, does everything the fire TV does, installed xbmc and other apps on it and it is awesome", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Works great and a terrific price!!! Very clear and sharp pictures!!!! Would suggest everyone to get one!!!", "verified": true, "helpfulness": "0/0", "author": "penny metzgar"}, {"rating": 4.0, "review": "Great product I like the amazon line (not the phone lmao sry amazon) the only one thing that I don't likeis that you can't stream from your phone hate that.  You can mirror you phone but then you have to sit their and hold it on landscape mode not fun... amazon please fix it", "verified": true, "helpfulness": "0/0", "author": "The god"}, {"rating": 1.0, "review": "I'm so glad I only paid $20 for this. It's a piece of crap. I have a strong Wi-Fi signal and my other devices have no trouble, but this thing freezes and buffers and takes forever to do anything. It's especially bad when watching Netflix or using the Amazon music app. It just took 7 minutes to play a 4 minute song because it plays maybe 6 notes before it freezes and says it's loading. I am really disappointed with it and can't recommend it to anyone.", "verified": true, "helpfulness": "1/1", "author": "Kristen Mcquinn"}, {"rating": 4.0, "review": "The audio has issues (cuts out regularly) and from what I've read, unplugging it and resetting it is the only means of \"fixing\" it. I would be a great service had it not had that issue.", "verified": true, "helpfulness": "0/0", "author": "JISacramento"}, {"rating": 5.0, "review": "A+++++=", "verified": true, "helpfulness": "0/0", "author": "Cheryl Dearien"}]