[{"rating": 5.0, "review": "Met my expectations. Simple to install and operate.", "verified": true, "helpfulness": "0/0", "author": "Jan Monti"}, {"rating": 5.0, "review": "This has been a great addition to our television viewing!  We love to watch Prime Instant Access movies for free and purchase others for about the same price as competitors.  My children enjoy playing the games and watching classic movies at no cost to me!The device came preloaded and was a breeze to install.  Movies are easy to access as well. We love this device and glad we purchased it!", "verified": true, "helpfulness": "0/0", "author": "Michele"}, {"rating": 5.0, "review": "At first it didn't work for me so I called and returned it but it turns out it's because my university has restrictions on the settings. Thus I was not able to connect it but I did connect it to my tv at home and it works like a charm. It gets hot fast though... :)", "verified": true, "helpfulness": "0/0", "author": "Alfred Agustin"}, {"rating": 5.0, "review": "If you enjoy movies and TV Shows nothing would fit your lifestyle better.", "verified": true, "helpfulness": "0/0", "author": "Mailmanager \"Plummer Porter\""}, {"rating": 2.0, "review": "Major buffering issues. It takes several minutes for a movie to even start, and then when it does it buffers for ever.", "verified": false, "helpfulness": "1/1", "author": "Scott Bently"}, {"rating": 5.0, "review": "I have a Chromecast, apple tv, xbox one that I use for streaming purposes. I would rank the Fire TV Stick right up toward the 1st or 2nd. I prefer streaming from the Xbox One but this stick is great. Its nice and fast. Menus are nice.  Remote is nice and responsive. I have no complaints. I would be interested in trying the Fire TV if I happen to catch a deal on one. If the stick is this good the none stick would be amazing with the bump in specs!", "verified": true, "helpfulness": "0/0", "author": "Irod87"}, {"rating": 4.0, "review": "Very convient! But the disney jr app does not work", "verified": true, "helpfulness": "0/0", "author": "Laken Vargas"}, {"rating": 5.0, "review": "Love the ease of watching Prime!", "verified": true, "helpfulness": "0/0", "author": "harriet sadler"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "K S"}, {"rating": 5.0, "review": "I am completely satisfied with this creative invention, having the ability to serf the many different options from TV, sports, music and movies, etc.  I found it very easy to use as a plug and play also love the remote control which allows me to pause, search and switch easily from one program to another.  With Amazon Prime the list is unending!", "verified": true, "helpfulness": "0/0", "author": "jax"}]