[{"rating": 2.0, "review": "I've been using a Panasonic DMP BDT210 blu-ray player as my steaming source for about 3 years.  It's ok, but it's really slow.  This device, by contrast, is very fast.  There is hardly any delay navigating the menus with the supplied remote or through the Android app, at least when the Stick works...The problem is I've had it hooked up for 4 days and watched about 6 hours of programming and I've had to reset it by disconnecting and reconnecting the power twice.  The first time it was completely non-responsive.  The second time the program I was watching on Netflix kept pausing to buffer.  After the power cycle the Stick lost my Netflix credentials, so I threw up my hands and switched back to the blu-ray, which worked fine.I'll keep the device with the hope that all it needs is a firmware upgrade.", "verified": true, "helpfulness": "1/1", "author": "Henry May \"Henry\""}, {"rating": 4.0, "review": "I would give it 5 stars but compared to the full fire TV or an Apple TV, it occasionally hesitates or reloads where the others do not.  also, you will have to plug it in to an AC outlet, the USB on TV's doesnt power it.", "verified": true, "helpfulness": "0/0", "author": "Allen Larson \"THX1138\""}, {"rating": 3.0, "review": "So far the FireTV Stick seems to work okay. I love the layout of the menus and the remote it comes with is perfect. I also love the app that lets me control the device with my android phone. My only complaint is that at times the device will lose wifi connection to my network. I thought it was a problem with my wireless router, but all my other devices that are connected to the same wireless network in the same location work perfectly. Eventually after a going to the network setup menu option and making it reconnect the connection will take and be reliable. I am hoping a firmware update will eventually alleviate this issue. Other than the connection issue once you are connected the device works as described. Like I said earlier the menu options are very nice and easy to navigate. It is nice not having to use my xbox or bluray player to connect to Amazon Prime shows. If Amazon fixes the wireless connection issue I wil change the rating.", "verified": true, "helpfulness": "0/0", "author": "MRagland"}, {"rating": 5.0, "review": "I have only one hdmi port on my TV. Is there a device I could get to be able to use Fire Stick?", "verified": false, "helpfulness": "0/0", "author": "Larry"}, {"rating": 4.0, "review": "Took forever to set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Kinda slow and clunky. GUI is too amazon centric. Too many steps to open Netflix or Plex.All the android games I have bought in the past from the Amazon App Store did not carry over", "verified": true, "helpfulness": "0/0", "author": "DaveH"}, {"rating": 5.0, "review": "Easy to use and very fast.", "verified": true, "helpfulness": "0/0", "author": "Sharon Kintner"}, {"rating": 1.0, "review": "it's making a buzzing sound", "verified": true, "helpfulness": "0/1", "author": "ralph desir"}, {"rating": 5.0, "review": "Great for travel!", "verified": true, "helpfulness": "0/0", "author": "bkwest918"}, {"rating": 1.0, "review": "Cant get it to work.. It will not conect to the internet. The remote dont half work. Have not heard from anyone from Amazon.", "verified": true, "helpfulness": "0/1", "author": "Steven Hall"}]