[{"rating": 4.0, "review": "Remote control is extremely difficult to get open. Hoping the batteries last a long time because I had to wait for my husband to get home to open it .", "verified": true, "helpfulness": "0/0", "author": "Nancy Berg"}, {"rating": 5.0, "review": "Good stuff!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is so cool, I love it.  Very easy to use as well.", "verified": true, "helpfulness": "0/0", "author": "Karen Nickell"}, {"rating": 3.0, "review": "Good interface - better than Chromecast.Seems to have more buffer than Chromecast.Good content - although I want more (because of where I live - way out in the boonies, this is the only TV content I can get).However, I am getting the intermittent (and all too common for Firestick users) \"HDCP unauthorised. Content disabled.\" error when I try to play content.It happens with Amazon Prime, Hulu and Netflix.I removed the HDMI extension, I plug it into a different HDMI port on the TV, I unplug the power and let it sit for a while. I turn the TV off and then back on again.Sometimes it works for weeks without this problem, sometimes it works for a few movies and then it stops working again, sometimes it works for a few days or a week before it happens again.This is VERY annoying.When are you guys going to fix this??", "verified": true, "helpfulness": "1/1", "author": "Lauren C. Bish \"LCB\""}, {"rating": 5.0, "review": "So far it is working great, simple to hook up and operate.", "verified": true, "helpfulness": "0/0", "author": "Carl J."}, {"rating": 5.0, "review": "We ordered Fire Stick not really knowing what we needed. Directions were perfect, set-up was easy and we started watching shows right away. Could not have asked for a better experience!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Although we have only had the Fire TV Stick a short while, we have truly enjoyed it. It was extremely easy to set up. Previously, we were streaming Amazon Prime Video from my MacBook or iPad through our Apple TV, it is much better to have a direct connection. The price is right for all it offers.", "verified": true, "helpfulness": "0/0", "author": "Joan T."}, {"rating": 5.0, "review": "The hardest part of installation was opening the darned remote to put the batteries in!", "verified": true, "helpfulness": "0/0", "author": "TxRN"}, {"rating": 5.0, "review": "As a Prime member got this for $19.  What a bargain!  Easy to install on TV.  Easy on-screen set up.  Remote has good controls.  Zillions of amazon Prime free TV shows and films.  With amazon app, a nice way to store and view photos.  Use it much more now than the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Crownbach"}, {"rating": 4.0, "review": "Overall good experience just that some apps that I use quite a bit like Spotify and Showtime App cannot use them one because I dont pay for premium Spotify and the other app because Comcast does not have an agreement with Amazon. Still a work in process.", "verified": true, "helpfulness": "0/0", "author": "erick"}]