[{"rating": 5.0, "review": "Has so far met all expectations after roughly a month. Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Samuel G Wells"}, {"rating": 5.0, "review": "This has helped tremendously. We have a 'smart' tv but it always froze up on us when using netflix, hulu or amazon prime. Now that we have the fire stick we do not have these issues. We didn't have to move our router or get a new one, this did it.", "verified": true, "helpfulness": "0/0", "author": "Amanda E."}, {"rating": 5.0, "review": "I LOVE THIS STICK ITS AWESOME I HAVE PLANS TO BUY 6 MORE", "verified": true, "helpfulness": "0/0", "author": "MELODY COUCH"}, {"rating": 4.0, "review": "Very easy to set up & use, just wish there was more shows  that I like to watch, lots of them are junk.", "verified": true, "helpfulness": "0/0", "author": "mamahen"}, {"rating": 1.0, "review": "reason for buying this was not to spend any more money but you have to purchase every show you watch I do not like it I do not recommend it and if the box is any thing like the stick I don't recommend it either", "verified": true, "helpfulness": "1/1", "author": "Donna Lynn Benton"}, {"rating": 5.0, "review": "Exceeded my expectations, I love it, a great partner for my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Paul J. Bayer"}, {"rating": 5.0, "review": "Great item easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "rich carlisle"}, {"rating": 5.0, "review": "the  firestick tv  was just what i was looking for better than the roku i  got smaller  faster  more  memory  a LOT of shows and movies i am  thinking  about getting prime  for  it if they would just lower the price a little got great audio  and video  it  does require a fast  internet not the lower levels they  offer", "verified": true, "helpfulness": "0/0", "author": "anthony demma"}, {"rating": 5.0, "review": "Best product ever!!!!", "verified": true, "helpfulness": "0/0", "author": "Chad Henderson"}, {"rating": 5.0, "review": "Nice unit", "verified": true, "helpfulness": "0/0", "author": "Kurt Flonta"}]