[{"rating": 2.0, "review": "Can't get it to connect to thee network, says network not available, but all other network wi-fi devices work fine.I really wanted this to work. Can't change my router signal, it's through the cable company", "verified": true, "helpfulness": "0/0", "author": "D. J. Blann"}, {"rating": 1.0, "review": "Don't believe the hype, while this device has some good points, its full of misleading information. It took several attempts to get someone that spoke understandable English.  Once that major feat was done, they still couldn't tell me how what I wanted, was suppose to work.  They opened a ticket, so we shall see if I ever hear back.  The problem is if you are looking for a device to use mira cast or mirror cast, this isn't working for me so good luck!", "verified": true, "helpfulness": "0/0", "author": "Kelvin L Lewis"}, {"rating": 5.0, "review": "LOVE thus-  easy to use, so much available, price is right.", "verified": true, "helpfulness": "0/0", "author": "BJG \"BJG\""}, {"rating": 5.0, "review": "The Fire TV Stick works really well for the most part. It freezes from time to time but only for a few seconds then fast forwards to catch up to where it should be in the program. I am pleasantly surprised by how well it works! I would recommend to anyone!!", "verified": true, "helpfulness": "1/1", "author": "Alyssa M."}, {"rating": 5.0, "review": "Fire TV Stick is an excellent device in all respects. Very nice!", "verified": true, "helpfulness": "1/1", "author": "wheels"}, {"rating": 4.0, "review": "Appreciate the ability to select from the archive collection.", "verified": true, "helpfulness": "1/1", "author": "Michael Collins"}, {"rating": 5.0, "review": "This is a great product. Amazon Prime Video, Netflix and YouTube all in one tool.", "verified": true, "helpfulness": "0/0", "author": "Scott Krolak \"Scott\""}, {"rating": 5.0, "review": "Having a Fire TV Stick is awesome.", "verified": false, "helpfulness": "1/1", "author": "Foxx529"}, {"rating": 4.0, "review": "This little device works well. We have  Netflix, Prime and Sling subscriptions and all seem to work well so far. The menu is a little confusing for the remote challenged (my husband )but I think he's getting better.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love my Fire TV stick!  It was very easy to put together and directions were straightforward.  Now I'm able to watch all of my shows on my big screen TV instead of my tiny computer screen. I would definitely recommend purchasing one :-)", "verified": true, "helpfulness": "0/0", "author": "Kay"}]