[{"rating": 4.0, "review": "I currently own a Roku stick, but when the Fire Stick showed up for the promotional price of just $19, I couldn't resist giving it a try.The first thing I noticed was how much faster (responsive) the Fire Stick was.  The Roku seems to have to \"think\" before it responds and preview pictures in Netflix take longer to load.  The fact that Fire has a dual-core processor vs Roku's single-core makes a big difference.Voice search also works very well and is quick.  Keep in mind, that although the Fire Stick does not come with a voice remote, you can use the phone app to control the screen with touch and voice.  I do wish that voice also worked for searching Netflix, however it only searches on Amazon (that I can tell).  That's one of the reasons I did not give it 5 stars.  But Roku has no voice option, so something is better than nothing in this regard.For the price, this was a great investment, and even at the full $39 price, it still beats Roku Stick at $49 (and is faster!).  I went ahead and ordered another one so all of our TV's have something to gain access to Netflix, Hulu Plus and Amazon movies.The main reason somebody might not want a \"stick\" is because it really limits your audio options.  There is no output for hooking up to a surround sound system.  This was not an issue for me because my home theater receiver has HDMI inputs for Bluray, DVD, etc, then it goes out to my TV.  So my receiver can decode the audio and I can enjoy movies in surround sound.However, if you are plugging this straight into your TV, you will be limited to your TV speakers, unless your TV has outputs to your home theater receiver.  If not, a \"stick\" may not be the best option and you may want to go with the \"box\" that has audio outputs for your receiver.  Just something to keep in mind ;)", "verified": true, "helpfulness": "1/1", "author": "Chad C."}, {"rating": 2.0, "review": "It keeps buffering and I have to play with it to get it to work. A window pops up and says I need more band width. My Wii never gave me that trouble. In theory it is a good little device.", "verified": true, "helpfulness": "0/1", "author": "Lynn M.Burns"}, {"rating": 5.0, "review": "Surprised at what a deal this streaming stick was compared to the competing streaming sticks. Amazon offered it for 19 dollars but even at 39 it's an amazing deal. It's good right out of the box and registered to your prime account already it just needs an update and you're good to go! Hopefully HBO Go gets patched in later. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "These are great. Love them", "verified": true, "helpfulness": "0/0", "author": "A. Shaw \"aggies1rc\""}, {"rating": 1.0, "review": "I wish zero stars was an option. Hugely disappointing. The unit can not sustain a network connection and the video is intermittent. Totally unusable.How ever decided that this product was ready for release to the public should be canned. It's called testing.", "verified": true, "helpfulness": "48/59", "author": "Tim Chapman"}, {"rating": 5.0, "review": "It is amazing and does even more than I thought.  I was able to get in on the 2 day pre-sale offer too!  Wish I could have gotten 2 more.", "verified": true, "helpfulness": "0/0", "author": "Leona Williams"}, {"rating": 4.0, "review": "I like it so far  (only had for 2 days) and  ordering more for Christmas !", "verified": true, "helpfulness": "0/0", "author": "Becky Schook"}, {"rating": 4.0, "review": "I only give it 4 stars because there is no HBO GO. Other than that everything works great.", "verified": true, "helpfulness": "1/1", "author": "patrickquinn"}, {"rating": 4.0, "review": "This thing works like a dream. It is fast, great interface, good quality video even without the fastest router. We love it.There are only 2 things that I think would make it better. First, it desperately needs parental controls that allow content filtering. I think this is coming, but for now if you enable parental controls it will require a pin for every video no matter the rating. I really hope they hurry and finish implementing a real solution for content filtering.Second, although it will do WiFi direct or mitacast screen mirroring it is no Chromecast replacement. I am sure the hardware on this thing will handle Chromecast screen casting even better than an actual chromecast. Why doesn't amazon implement it? Maybe that is coming in the future. A simple app in the amazon appstore could solve this problem. They would sell tons of these things if could really replace a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "Simple to use and fast. Was able to set it up in a few minutes. Allows me to watch Netflix, Hulu, Amazon Videos--also Pandora on my TV easily. For the price--a great deal. And, for whatever reason--I really like the remote control. It's really easy and basic (only a couple buttons) but it has a has decent heft that feels kinda nice in the head (uses 2 AAA batteries). My only suggestion is that I wish the buttons were glow in the dark--no need for fancy LED whatever--but a glow in the dark decal would be nice.", "verified": true, "helpfulness": "0/0", "author": "VJL"}]