[{"rating": 4.0, "review": "Better navigation than AppleTV although is a little slow and jolly when going through the menus", "verified": true, "helpfulness": "0/0", "author": "Rupert Simonian"}, {"rating": 1.0, "review": "I don't normally write reviews but I will on this one. This product is very disappointing. Number 1 you must use a wall plug to plug it in, therefore if your TV is hanging on the wall and all of your wiring is hidden you still have a lovely black cord coming down to your power receptacle to run that stick. It makes absolutely no sense. Moving on to picture quality. It's absolutely terrible. As you're streaming Netflix you have the most beautiful crystal clear picture you could imagine, then slowly but surely the picture will start to turn to fuzz to the point where you think there is something wrong with your eyesight. The picture comes back clear, and turns back to fuzz again. It's a continuous loop of clarity and fuzz.. I used it 3 times and moved into our master bedroom, I can't take watching TV on this device. I thought I'd keep it and maybe on a sick day when I'm laid up in bed it would work for me because my eyesight at that point wouldn't matter.", "verified": true, "helpfulness": "0/0", "author": "Christopher A."}, {"rating": 5.0, "review": "Great low cost option for streaming", "verified": true, "helpfulness": "0/0", "author": "Amber E Heller"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "LaDonna Norfleet"}, {"rating": 5.0, "review": "Easiest thing ever.  I love the menu layout.  Great value.", "verified": true, "helpfulness": "0/0", "author": "Cindy B"}, {"rating": 4.0, "review": "I got this because my Play Station couldn't pick up Amazon TV but Netflix worked great.  Now that I have this, Amazon works great, but Netflix keeps dropping.  Could it be Amazon is doing this to their competition via their hardware?", "verified": true, "helpfulness": "0/0", "author": "tlo"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Hoffman"}, {"rating": 5.0, "review": "Love it! Works like they say it does. Good price.", "verified": true, "helpfulness": "0/0", "author": "Shirlene Zipp"}, {"rating": 3.0, "review": "The fire tv stick is definitely easy to use and setup. However, watching Netflix can be a pain at times since the screen gets blurry every few minutes and lasts for a few seconds each time. Along with the blurriness, there's also lagging and buffering during shows. Overall, it's great when working right but annoying when it lags and gets blurry.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it now I can watch my showd", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]