[{"rating": 5.0, "review": "Best thing I've bought in a long time! It's easy to install and works exactly as described. I'm very happy with this product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Glad I didn't pay $39 for it. Half the time on boot up there is a network error. Plex app pauses 2-5 seconds several times throughout streaming of a movie. But for $19 it's worth keeping around to hope they fix these early issues.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "Great product. Fast working with no issues. Got it as a gift for a friend and they love it over their Roku!", "verified": true, "helpfulness": "0/0", "author": "DatGuy Junior"}, {"rating": 5.0, "review": "I use this every single day to watch TV Netflix Amazon prime video streaming and listen to music would highly recommend to anybody who is looking for something versatile and has many options.", "verified": true, "helpfulness": "0/0", "author": "H.S.Wike"}, {"rating": 5.0, "review": "The fire tv stick is perfect, compact, and portable. I plug it in while I'm working to listen to my music. I also love using it to watch You Tube videos from the tv. It is all I needed.", "verified": true, "helpfulness": "0/0", "author": "Sheila J Miller"}, {"rating": 2.0, "review": "What a piece of crap this device is. While is states it has a great wireless connection to my network, it can't stop buffering long enough to watch anything straight through. Settings show it is current on its updates. Love the apps and such but the constant buffering gives it two stars. I think I'm being generous.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Puts the Google Chrome Cast to shame!!!!", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 1.0, "review": "no HBO go, no Stars, these are important apps to have....", "verified": true, "helpfulness": "0/0", "author": "Michael Cota"}, {"rating": 5.0, "review": "Cheaper than buying a smart tv and works great. I've compared to Apple TV and it is just as good.", "verified": true, "helpfulness": "0/0", "author": "trophy wife"}, {"rating": 5.0, "review": "Works very well! The remote is great!! Very user friendly!!!", "verified": true, "helpfulness": "0/0", "author": "GrtDlz2"}]