[{"rating": 5.0, "review": "Works very good with Kodi.", "verified": true, "helpfulness": "0/0", "author": "juan rodriguez"}, {"rating": 5.0, "review": "Excellent for watching netflix, hulu, movies and any other good stuff that's out there.", "verified": true, "helpfulness": "0/0", "author": "JosÃƒÂ©"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Gary J."}, {"rating": 5.0, "review": "Easy to connect. Works immediately. I can get Pandora, Netflix and many other programs on my T.V and watch anything I want.", "verified": true, "helpfulness": "0/0", "author": "Di"}, {"rating": 3.0, "review": "I have not been able to use this yet.", "verified": true, "helpfulness": "0/0", "author": "sb reader"}, {"rating": 4.0, "review": "I had little to no trouble hooking up the Fire TV Stick to my television.  Finding programing on the Fire TV Stick is difficult unless you have an app on another devise such as an iPad or tablet.  Overall, I would purchase this devise again.", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "Fantastic device!!  We took the Fire TV Stick with us on a short trip just after receiving it.  Plugged it into the TV at a Fairfield Inn; it booted up knowing my name, etc.  Next thing you know we are watching our favorite Prime TV and Netflix!  We are currently in Jamacia and using the device.  Internet is not as reliable, but that is not an issue with the Fire TV Stick.  Love it, love it - especially for the small price!!", "verified": true, "helpfulness": "0/0", "author": "BMc"}, {"rating": 3.0, "review": "Barely used. Seemed like a great product but does not support HBOGo if you are subscribed through Comcast. Returned for a Roku stream stick instead.", "verified": true, "helpfulness": "0/0", "author": "joxen13"}, {"rating": 1.0, "review": "What a total waste of money!!  There are so few movies and TV shows included in Prime...I feel totally Ripped off and Mislead by Amazon!!  Everything I want to watch is either for sale, $12.99 and up, or for rent, $3.99 and up....I am a Prime member and feel like I've been treated badly by Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works like a champ.  Took a while to get it, but it was worth the wait.", "verified": true, "helpfulness": "0/0", "author": "C Dub"}]