[{"rating": 5.0, "review": "Easy the install and easy to learn the remote.", "verified": true, "helpfulness": "0/0", "author": "Joanna Brackin"}, {"rating": 5.0, "review": "My niece told me about this. I love love love it! Can play all my music from android as well as watch TV shoes & movies & documentaries. Have only scratched the surface of the options.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Eileen\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ivey Hatfield"}, {"rating": 5.0, "review": "This is a must have for all Amazon Prime Members! I honestly don't know why I waited so long to purchase the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "I love the concept, and most of the times works perfectly. I think that Amazon has more demand that they expected, for this reason, lately, movies or programs cannot be watched, takes hours buffering. They said that is low internet connection. But the same stick, at the same time has great performance on Netflix, Hulu, and other apps. If you are a patience person, this is not a problem. You can always watch movies or programing on your computer, or tablet.", "verified": true, "helpfulness": "0/0", "author": "Marilu Claridge"}, {"rating": 5.0, "review": "Great experience! !!! Glad I made the purchase", "verified": true, "helpfulness": "0/0", "author": "angela garibaldi"}, {"rating": 4.0, "review": "Don't know if anyone else has mentioned it, but I found a workaround for the Netflix problem. I originally could not enter my Netflix account info using the included remote. I later downloaded the  Fire Stick Remote App using my Android phone to submit my info. Now both remote and phone can access Netflix programming.", "verified": true, "helpfulness": "0/0", "author": "Zepplyn \"music fanatic\""}, {"rating": 5.0, "review": "The firestick (eventually) worked as advertized.  I wouldn't normally give a product five stars for doing what it's supposed to do, but in this case there was a problem.  When I got it hooked up, it was slow and worked only intermittently, and I eventually discovered, worked only when the remote control was within a couple of feet of the installed stick.  I called the 800 support number, worked with the tech until she was convinced of the problem and agreed to ship me a new stick.  It arrived in less than 24 hours, installed without a problem and I promptly watched the whole first season of 'Sons of Anarchy'.  Like the bumper sticker says, 's*** happens' so as far as I'm concerned, service is just as important as any product.  I give this product four stars for working and an extra star for great support/service!", "verified": true, "helpfulness": "0/0", "author": "Connie Warren"}, {"rating": 5.0, "review": "Great idea! great price!\"love it!", "verified": true, "helpfulness": "0/0", "author": "mikezoc"}, {"rating": 1.0, "review": "Eh, at best.", "verified": true, "helpfulness": "0/1", "author": "Inkedmom"}]