[{"rating": 5.0, "review": "Great interface, easy to use, voice control is excellent!", "verified": true, "helpfulness": "0/0", "author": "John P. Feit"}, {"rating": 4.0, "review": "I am happy with the fire stick because it works with my tablet but I have had some issues with it streaming even-though the router is in the next room. I like that it synced up with my tablet and it's apps.", "verified": true, "helpfulness": "0/0", "author": "Edwin J. Stevenson"}, {"rating": 5.0, "review": "Most negative reviews appear to be either due to their own bad Internet connection, or because they didn't know what they were buying. Of course this doesn't stream from Chrome browser. This isn't a Google device. The mirroring of a tablet is exactly why i bought it. Please, don't blame your lack of consumer knowledge on the product.It works faster than my Chromecast, and it's very nice to be able to mirror my screen. The interface is easy to navigate. Games are a nice touch. I love finally having Amazon Prime Instant Movies as an option.", "verified": true, "helpfulness": "0/0", "author": "Nick Chill \"Nick Chill\""}, {"rating": 2.0, "review": "I was told I had a 30 day free trial but that is not the case.  Netflix was not included in the free trial, so I was told by a less than friendly Amazon representative.  Of course he talked in circles until I was so frustrated I hung up.  In any case I will be very cautious when doing any business with Amazon in the future. Even though I pointed out exactly what the web page said to no avail I was told I was stupid and reading it wrong. Amazon Prime ..be careful!", "verified": true, "helpfulness": "0/1", "author": "Robert Watson"}, {"rating": 5.0, "review": "fast and reliable", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The biggest piece of crap. I expected much more from Amazon. Does not connect easily, and if it does connect it soon disconnects and you have to start all over. Then more error messages that the signal is weak... more excuses... apple TV no problem, Sony no problem... Amazon...CONSTANT PROBLEMS! And I'm a prime member. Amazon works much better on their competitions devices. VERY VERY FRUSTRATED WITH THIS PRODUCT!  DO NOT BUY IT TILL THEY FIX IT.", "verified": true, "helpfulness": "0/1", "author": "timnew1111"}, {"rating": 5.0, "review": "Great product, easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Price"}, {"rating": 1.0, "review": "Product is terrible!  In the first delivery, the Fire Stick was recognized by my TV (Sony Bravia), and video was visible, but no audio.  I called Customer Support, got an agent with a foreign accent (OK by me usually because I work with them everyday in the software business).  This agent however, was difficult to understand, and had to be reminded repeatedly to slow down.He worked on various options for about a hour - trying and re-trying the same things 4 or 5 times.  No luck. He finally said maybe my TV isn't supported for the Fire Stick they sent - correct - my TV wasn't listed as being supported.  OK, so he sent another Fire Stick out to arrive 2 days later.Same exact deal - I had video and the ability to control the settings using the Fire Stick remote - but no sound.This is truly a terrible product, and I would advise you NOT to buy it, unless you a re looking to find some REAL frustration and disappointment, and have a lot of time to waste...", "verified": true, "helpfulness": "0/0", "author": "William Faulkner"}, {"rating": 3.0, "review": "Very happy with this product", "verified": true, "helpfulness": "0/0", "author": "scottbh65"}, {"rating": 5.0, "review": "Fantastic. Easy. Great!", "verified": true, "helpfulness": "0/0", "author": "Nancy Williams"}]