[{"rating": 5.0, "review": "Love it (when my crappy wifi is working)", "verified": true, "helpfulness": "0/0", "author": "Tawnya Sheeder"}, {"rating": 5.0, "review": "Great streaming device especially for the cost. I have an Apple TV and Roku as well and the Fire stick beats them both.", "verified": true, "helpfulness": "0/0", "author": "Ryan Briggs"}, {"rating": 2.0, "review": "I got it out of the box, plugged it in and got it connected to the internet. Had some issues with the connection until I added the extension onto it. But it only worked for a few hours before the network connection weakened. It says the network strength is very good but nothing will load, not even the home page. All of my other WiFi devices are working fine. I have only had this device for a day and I've already had to search the internet for troubleshooting. I'm not very impressed with it at all. Is there anything that can be done about it not loading anything. If there isn't anything that can be done, I will be returning it. I did like it for the few hours it was working.", "verified": true, "helpfulness": "0/0", "author": "Michael Horning"}, {"rating": 5.0, "review": "Recently subscribed to Amazon Prime and wanted to be able to watch the videos on the TV. It was pretty easy to set up although the directions could have been a little better. The confusing part was how to work it with a cable box. Googled and found helpful info. Works fine and was reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "PEC"}, {"rating": 2.0, "review": "it quit working", "verified": true, "helpfulness": "0/0", "author": "Michigan"}, {"rating": 5.0, "review": "Really glad I bought the Amazon fire stick. It is easy to use. And easy to install.", "verified": true, "helpfulness": "0/0", "author": "Jana Tyree"}, {"rating": 5.0, "review": "Loving this! As many channels as their are on cable and satallite, there is still nothing to watch. I have movies and television series at my finger tips. My parents love the bowling.", "verified": true, "helpfulness": "0/0", "author": "Dana D. Lindsey"}, {"rating": 4.0, "review": "With Netflix there is a delay. I've had to restart it twice. But other than than the picture quality is wonderful and the sound quality is wonderful too! Beats Roku hands down.", "verified": true, "helpfulness": "0/0", "author": "carol cheshire"}, {"rating": 4.0, "review": "The only things it is missing is a universal search function, it is also missing some popular free channels there are no Sky, Channel 4 and ITV catchup services. if these were included in an update it would be a perfect smart TV solution.", "verified": true, "helpfulness": "0/0", "author": "L H Thomas"}, {"rating": 3.0, "review": "Not streaming well enough to keep. I have no problem streaming movies through Apple but his device being wireless doesn't have the capacity for me to view anything and mu router is only 15' away.", "verified": true, "helpfulness": "1/1", "author": "James Vincent \"Avid Reader\""}]