[{"rating": 5.0, "review": "It's an amazing device that replaces my LG TV's Smart TV capability and probably my Chromecast. My only gripe would actually be with the Twitch app since the quality is mediocre, and that sucks considering that's actually the main reason I bought it. Otherwise, it's a pretty fun device, and even though I didn't need the tutorial that plays during installation, I think it's really well done for the non-techie consumer. I hope the Twitch app will include the option to choose the stream quality like the Plex app, which is excellent! Can't wait to integrate it with my phone so that I can use the voice search. When the Amazon Echo comes out, I'm sure they'll be able to integrate that too. Amazon has a real winner here!", "verified": true, "helpfulness": "3/4", "author": "Dissonance"}, {"rating": 5.0, "review": "Fantastic product.installed first try with no issues.great that it is already registered to my amazon prime acct... saves some setup steps.I love it.", "verified": true, "helpfulness": "1/2", "author": "N. Miller \"Tiffany's mom\""}, {"rating": 4.0, "review": "Very happy with the product. I own a fire tv and the only difference I've notice is the remote is not voice activated. The only thing I have to complaint about is the lack of better applications, and there is no remote application for the iPhone. Overall... well done Amazon, well done.", "verified": true, "helpfulness": "0/1", "author": "Mario Pagan"}, {"rating": 4.0, "review": "Wouldn't work at all on my Samsung TV/computer monitor.  All I got the Amazon logo with static.  I was hoping to set it up inside so as not to have to run in and out of my garage workout space because it is sub freezing right now.Anyway - plugged it into the garage TV, got signed in to my WiFi network and it HAS TO DOWNLOAD NEW SOFTWARE.THEN THE UPDATE FAILS.So, right now, it's trying again.  Not a good out of the box experience, to say the least.  The USB micro cord was a nice length, the plastic of the cord has a nice suppleness to it - and the batteries worked in the remote.-----------------------------Update - 30 minutes later.Have moved the FireTV into the house to take over media streaming for the PS3.  PS3 was running hot in the new TV stand, and the FireTV stick seems more than capable.  Love the phone app integration, and as others have mentioned the picture is first rate.------------------------------UPDATE - 4 days + of useWow.  Maybe I'm behind the times but this is AMAZING.  WAY better than the PS3 streaming.  Quick, responsive - I'm sure the 1080HD stuff looks better.  I wish I'd ordered two.  Sticking with the 4 stars because it was finicky with the monitor - maybe the monitor doesn't have the right type of HDMI?  But without the bit of trouble right out of the box - 5 stars.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far so good, but kind of strange it took roughly 30 mins to update the firmware right out of the box. Also kind of silly a micro USB power adapter has to be plugged in to it at all times. I assumed it would draw power from the HDMI connection, but that's not the case. Not sure if same applies to Chromecast or not. For $19 though, very pleased. After firmware update, set up was a breeze. Connected to home network flawlessly, and already had my prime account info loaded which was a nice feature. No need to enter passwords or anything. I've never owned an android product, and was pleased that app purchases were already linked to my Amazon account, and didn't require me to create a new android account. Only reason I bought this was to stream PLEX to the other TVs in my house. Works great, and the PLEX interface is almost as good as the home theater version. Way better alternative then Apple TV AirPlay which I was using prior. No brainier for the die hard PLEX fans out there.", "verified": true, "helpfulness": "1/2", "author": "E. Walker \"ewalk\""}, {"rating": 1.0, "review": "I don't broadcast the SSID of my wireless network.  A scan will not show my wireless network SSID.  My Stick did not give me a simple menu option of entering the SSID when I first set it up.So here we are on Friday night, wanting to watch a movie and FAIL,  it can't connect to Amazon Services, which in turn won't let me use Netflix either.  My wireless works fine, the Stick says it has a very good signal, but no joy.  No Amazon Home, No Netflix, No PBS, Nada.Plugged my 3 year old Roku box back in, it got the (same) wireless signal and fired right up.The Fire TV Stick is on it's way back to Amazon for a refund.", "verified": true, "helpfulness": "4/16", "author": "Wine Country \"Tim\""}, {"rating": 5.0, "review": "No complaints. Easy set-up.", "verified": true, "helpfulness": "1/2", "author": "Sarah N."}, {"rating": 1.0, "review": "The remote does not open, can't even install the batteries!", "verified": true, "helpfulness": "0/18", "author": "KSH"}, {"rating": 5.0, "review": "Best Performance Video, Wireless and Usability", "verified": true, "helpfulness": "1/2", "author": "Joseph E"}, {"rating": 4.0, "review": "I really can't complain too much about something that was $19, but for someone that might have paid full price I can see where there would be some annoyance. It has most of the apps everyone wants. YouTube, Netflix, Hulu, iHeartRadio, etc. The only one that seems to be missing is hbogo. A negative I've noticed is there's an update to install when you first recievr the device, and it takes FOREVER.  Another issue is the software seems to be a little buggy. YouTube videos would freeze and the remote would become unresponsive for quite some time. I'm sure a software update will fix the bugs. Overall I'm pretty impressed, for $19 (a prime member promo they had) it was a no brainer.", "verified": true, "helpfulness": "0/1", "author": "mguimond1990"}]