[{"rating": 5.0, "review": "We love the fire stick! Easy set up and have had no issues with it. We had a blue ray player that every time we hooked up to Netflix it would just continue to search for WIFI. We haven't had that issue with the fire stick!", "verified": true, "helpfulness": "0/0", "author": "AP"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Linda Ramirez"}, {"rating": 5.0, "review": "I've only used the Fire Stick for a couple of days with a free trial of Amazon Prime.  Set up is really easy, just plug it in, watch a short tutorial and you're ready to go. I do have a USB port on my TV but it didn't provide enough power to power the Fire Stick so I did have to plug it in the wall (which is recommended anyway).  I've not used all the functions,  but there are a ton of options for any TV lover.  I purchased this for the TV in my bedroom, a small 19\", because I didn't want to pay the monthly fee for a cable set top box for a TV I use occasionally.  I already have a membership with Netflix but there are options for free movies and TV shows.  I did a fair amount of research before I committed to buying it, I'm a big fan of Amazon and have a Kindle Fire so I was a little biased with my selection.  Since my wireless router is on the same floor as my bedroom I get a good signal without any lag, so I can't comment on how well it receives a signal from a greater distance.  I have an iPhone 6 and the app for voice and text search is available in the app store, which makes searching for shows easier.  The remote is small and unobtrusive, which I like.  I would definitely recommend this product for anyone looking to replace their satellite or cable or to expand their current TV experience.", "verified": true, "helpfulness": "0/0", "author": "Kevin D"}, {"rating": 5.0, "review": "My daughter just loves this thing. Can't get her to put the kindle down while she is on it playing games. Don't know for sure whether she is supposed to have it or not. Lol. She really does enjoy it though.", "verified": true, "helpfulness": "0/0", "author": "Mzkey07"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Dominic"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Shirrell Robinson"}, {"rating": 1.0, "review": "When it works, it's great! You can use Netflix or watch Amazon Prime anywhere you have an HDMI connection! The problem is I've had to reset this thing 15 times in a row before to get it working again. It works one second, then just keeps saying Netflix has encountered an error, forcing me to switch to another device to continue watching a show. The \"HD\" video is really 480p, from my experience, despite me changing the settings to 720. I bought this to replace a Roku I had and it's no better. Almost exactly the same video quality, except the menus on the Fire TV Stick are in HD.  Video buffering is an issue too, as almost every video starts fuzzy like a drunken night out.  Another thing I didn't like was that you have to plug the unit into a wall power outlet. I feel like that is glossed over in all the marketing.Amazon, I expected SO MUCH MORE. Disappointed doesn't describe well enough how I feel after using this for a few weeks.  I never write reviews and felt it was my obligation to do so, after using this. I will update this review, if they release an update that fixes the video and network connection problems. It's not my network as my Xbox One, PS4, iPhone, Roku, computes, etc. all connect to my network and work just fine. Amazon, going forward let's only put your name on quality products please!  I wanted you to be the cool high-spec device you appeared to be instead of this faulty piece of stick.", "verified": true, "helpfulness": "1/1", "author": "Karl Daniel Adrian"}, {"rating": 4.0, "review": "Easy set-up.", "verified": true, "helpfulness": "0/0", "author": "SS IN OK"}, {"rating": 2.0, "review": "Love it - but getting sick of Amazon's proprietary nature - it lets you think you can watch Netflix - but 8 times out of 10 it says there is a problem with the network. Then you switch to prime and you can watch anything. Clearly trying to block anything that is not sold thru Amazon.", "verified": true, "helpfulness": "0/0", "author": "Susan S."}, {"rating": 4.0, "review": "Love it., and the remote is a huge plus in my case. The only reason I gave four stars is because doesn't mirror with apple products (my Iphone and Ipad). Come on amazon you can do it..", "verified": true, "helpfulness": "1/1", "author": "R. Casado \"Rooiso\""}]