[{"rating": 5.0, "review": "I absolutely love the amazon fire stick. I would definitely recommend it to anyone. I bought two. Way to go amazon. It is amazing.", "verified": true, "helpfulness": "0/0", "author": "Imala Hunter"}, {"rating": 5.0, "review": "Love it!! Fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Demaresth"}, {"rating": 5.0, "review": "Absolutely  the best.", "verified": true, "helpfulness": "0/0", "author": "Bigal"}, {"rating": 4.0, "review": "I would give the Fire Stick a solid 4 stars. I have had issues with both sound and wifi connection. Both easily resolved with restarting the stick. That can be easily done by using the remote. Really wish I didn't have to run power to the stick, especially since the cord is so short and my tv is wall mounted. I did appreciate the hdmi cable extender. My tv has the hdmi ports tucked into a small corner that is curved. Without that extra cord I would have damaged the stick just trying to insert it. I also love that the remote can be used without having to face a certain direction.", "verified": true, "helpfulness": "0/0", "author": "AlaskanMommy \"Alaskan Mommy\""}, {"rating": 4.0, "review": "This is truly a great device that's an inexpensive way to get premium entertainment without paying your (most likely creepy) television provider for sub-par content. One thing that seems like an oversight is that it was not released with Audible support.I'm usually a pretty forgiving person, and I'm not sure whether it's a letdown due to Audible or the Fire TV team, but it seems that if you release a product it should be able to support all of your brands, particularly when the two are media-focused.I have dozens of audio books and am frequently purchasing new ones through Audible. I have to plug in my phone with an 1/8\" jack in order to listen to audio books on my home theater receiver. First world problem, for sure, but the Fire TV Stick (made by Amazon, obviously) and Audible (Amazon company): you would think everything would \"just work\", right?If you're trying to provide media products and services, make sure your media-providing subsidiaries are in line with your overall vision. It just doesn't seem like that's the case with Audible. Far be it from lil' ol' me to preach to Amazon about their business practices, however: doesn't this seem like common sense?And the rest of the Fire TV Stick? Brilliant!", "verified": true, "helpfulness": "1/1", "author": "Anthony A. \"Software developer (Java, Ruby on Rails, Android) and all-around computer nerd, as well as an avid reader and listener of intercommunication- and psychology-related books. Not much for fiction, but I love cool non-fiction!\""}, {"rating": 1.0, "review": "Junk. Had high hopes but my 6 year old ROKU is 10 times more reliable than this product. Very disappointed.  Loses connection routinely while my old roku sitting 2 feet away has no problems. Not ready for prime time.", "verified": true, "helpfulness": "0/1", "author": "Grrrrr"}, {"rating": 5.0, "review": "Great product at the reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was disappointed to discover my comcast internet is not fast enough to continuously stream a movie or TV episode.", "verified": true, "helpfulness": "1/6", "author": "Layne A Shumaker"}, {"rating": 2.0, "review": "2 stars for how small and convenient it is, plus Prime integration. For the price it's the best option, however, the connectivity issues make it disappoint. I've been using a PS3 for my streaming needs and never have a network problem. The Fire stick almost always gives me an error about no internet connection and whenever I check my settings, it says strong signal but \"connected with problems\". It's plugged into the HDMI extender and the power outlet. Unless there's an update sometime soon, I'm not getting any use out of it :( I've gone back to the PS3.", "verified": true, "helpfulness": "0/1", "author": "Virginia Shammas"}, {"rating": 4.0, "review": "So far, so good.", "verified": true, "helpfulness": "0/1", "author": "Eric Finkle"}]