[{"rating": 5.0, "review": "wrks as adv", "verified": true, "helpfulness": "0/1", "author": "lawrence brenner"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Nicole S"}, {"rating": 5.0, "review": "Great product. compact and powerful media tool.", "verified": true, "helpfulness": "0/1", "author": "steve"}, {"rating": 3.0, "review": "The Good:-Easy setup and and clear directions-Reasonably Pretty User InterfaceThe Bad:-Very touchy with marginal wifi connections and some routers. With one brand, I was getting random 'failed searches' and similar behavior. Changing the router to one with better signal appeared to fix the issue however.The Ugly:-UI Navigation is awkward. Scrolling backwards through a list of searches, and hitting left past the first result brings you right to the main menu, discarding the results of your search. An 'are you sure?' prompt would be helpful here.-I know Amazon is in the business of selling additional videos in addition to what I get with prime, but the lack of filtering to 'prime only' results or 'prime first' is an annoyance-Amazon Promises Miracast support for Windows 8.1 is 'coming soon.' Given that this has been a complaint by many people for a while it's a shame this isn't a higher priority for Amazon; The next best option I'm aware of (Microsoft's Wireless Display Receiver) is 20$ more. Amazon could easily get a LOT of people using this item if they made Miracast support in Windows a Priority.", "verified": true, "helpfulness": "0/1", "author": "Pherik Macraith"}, {"rating": 3.0, "review": "The fire stick does what it is supposed to do, however, it might be nice to advise prospective purchasers that they would receive more apps with the addition of an android.", "verified": true, "helpfulness": "0/0", "author": "William Fleming"}, {"rating": 5.0, "review": "Have a chromecast. The firestick is better for streaming video, access to Amazon music and MOST importantly, SlingTV.Chromecast allows me to cast my desktop, where the FireStick does not.", "verified": true, "helpfulness": "0/0", "author": "Just Another Geek"}, {"rating": 5.0, "review": "This product is a must have. I love it.", "verified": true, "helpfulness": "0/0", "author": "Rosie"}, {"rating": 2.0, "review": "I sometimes loose the sound whenever tv program episode changes or I if changes the program. Every time I need to restart the stick in order to get the sound back.", "verified": true, "helpfulness": "0/0", "author": "Wadea Alkhamees"}, {"rating": 5.0, "review": "Works very well - installation straight forward.", "verified": true, "helpfulness": "0/0", "author": "rjv001x"}, {"rating": 5.0, "review": "This little device is likely to replace my home cable service for good! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "JL Velazquez \"There are no coincidences in life.\""}]