[{"rating": 4.0, "review": "This works very well, surprised at good wifi connection for such a small device. I power it from a USB port on my TV which means no need for the power adapter = less clutter. Wish the navigation screens were more clear, hard to tell which item you're selecting.", "verified": true, "helpfulness": "0/0", "author": "et"}, {"rating": 3.0, "review": "Just like anything else that requires wifi, it sucks if your wifi signal is not good. The cord was too short even with the extension. I feel like the cord should be longer or it should have a rechargeable battery.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I am powering this from my TV's USB port against the manual's recommendation.  So, I'm curious if this is why there is frequently a lag in the audio.  Navigation is okay, but adding channels and searching for content could be easier.  I can't explore Prime Music, only play what I have lined up while on a computer, then it shows up on the Stick.  This unit is going to the second TV, and my Roku 3 will remain with the main TV.", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 5.0, "review": "At first glance I was a bit skeptical about this item. However, after easily setting it up and starting my free  30 day trial, I was hooked on the tremendous selection of movies and TV series. This was only a small part of want I could do with this system. I love having access to games, Apps, music, and even storing my pictures. Kudos to the inventors and designers of this incredible product. I look forward to any additional items to the Fire TV Stick from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Anthony Guiliano"}, {"rating": 1.0, "review": "This item constantly drops network connection.  Unless you have this item in the same room as your wifi modem it is useless.  I have not been able to watch anything because the the HDTV I want it for is in another room of the house not close to the wifi modem. It says the network strength is very good but it keeps loosing connection.  This is a worthless product if you can only use it when it is only a few feet away from the wifi modem.  You should make sure that in the product specification and description it states in bold print the device must be in the same room as the wifi modem or only a few feet away from the wifi modem for it to work properly.  I can not use this item.  I guess I will just have it connected to the TV and never be able to use it.  This is the first time I have had a negative experience with any amazon product.  It makes me think I should think twice if not three times before I make any future purchases from amazon.", "verified": true, "helpfulness": "0/1", "author": "Jerry D Baumgardner"}, {"rating": 3.0, "review": "Wish I could do more with it.", "verified": false, "helpfulness": "0/0", "author": "Miguel Anaya"}, {"rating": 3.0, "review": "Purchased when within first day of discounted offer for $19.  Can not figure out what is wrong.  Sometimes will have audio and video for an hour or more, but too often audio will cut out for a second or more every two to three minutes or so, ...not enjoyable at all.  Will contact Amazon for possible answers.", "verified": true, "helpfulness": "0/0", "author": "Potbelinick"}, {"rating": 4.0, "review": "There are a lot of movies on Amazon Prime that I wanted to watch and I added them to my watchlist, but they actually aren't available. NSG.", "verified": true, "helpfulness": "0/0", "author": "LaLa"}, {"rating": 5.0, "review": "Works great  I can get rid of the expensive premium channels from my cable provider  Very easy to set up  I love it", "verified": true, "helpfulness": "0/0", "author": "P Chess"}, {"rating": 5.0, "review": "I love this!Once you get through the initial set up everything about using the Fire Stick is fast and easy.We started with a Chromecast.....did not meet expectations. This is by far a better product for the money. My family has spent hours watching movies, tv shows and playing games.Thanks Amazon for a great product!", "verified": true, "helpfulness": "0/0", "author": "Heather Key"}]