[{"rating": 4.0, "review": "So far (we have only had it for 4 days) it has been acceptable. It was very easy to install and provided what we were looking for when we ordered the fire stick. We have a long, long way to go in order to fully explore all the possibilities that this little device offers.", "verified": true, "helpfulness": "0/0", "author": "Twainmark"}, {"rating": 4.0, "review": "the fire stick is great!  super easy to install.  I only gave it 4 stars b/c I wish that it had You Tube loaded on it.  Hope more apps are added soon to stay in competition with AppleTV and all the other streaming technology that is available!", "verified": true, "helpfulness": "0/0", "author": "kate"}, {"rating": 5.0, "review": "Hands down an amazing piece of technology. Friendly even for the tech illiterate. Great menu screens. And lets you know that your internet speed is erratic.", "verified": true, "helpfulness": "0/0", "author": "Zapgal"}, {"rating": 1.0, "review": "? Do you have to be connected to the internet to use the fire stick?", "verified": false, "helpfulness": "1/1", "author": "Larry Turner"}, {"rating": 5.0, "review": "This was given as a given and we love it. It's super convenient to not watch shows on the computer but on the big screen!", "verified": true, "helpfulness": "0/0", "author": "Geanna"}, {"rating": 5.0, "review": "Awesome product...Love it.", "verified": true, "helpfulness": "0/0", "author": "Susan Huber"}, {"rating": 5.0, "review": "Amazing device.  Quickly installed and configured.  I really enjoy it.  I recommend it if you have Netflix streaming and Amazon Prime.  It is so very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Glen W. Bridge, Jr."}, {"rating": 4.0, "review": "Good device sometime stalls when streaming plex movies, a exit and restart always fixes it.", "verified": true, "helpfulness": "0/0", "author": "zach Schneider"}, {"rating": 5.0, "review": "This is an excellent unit for accessing different sorts of media.  Easy to set up and use.  Offers very high quality video.", "verified": true, "helpfulness": "0/0", "author": "Bob Langford"}, {"rating": 4.0, "review": "The APP collection is great and most of them are free !!The kids app's is a big help - my kids love them.The only reason it did not get 5 ** is because I was not able to mirror my Iphone to the TV with this stick.", "verified": true, "helpfulness": "0/0", "author": "Dev"}]