[{"rating": 5.0, "review": "Works perfectly 2 minute setup and I was watching Netflix then listened to my music", "verified": true, "helpfulness": "0/0", "author": "Alex O."}, {"rating": 3.0, "review": "This requires a power source, it does not show on any of the advertisements that it has a plug from the stick to a power outlet. The cord is short and looks unattractive coming from the tvto the plug. it also looses internet connects offten", "verified": true, "helpfulness": "0/1", "author": "Amanda Bullard \"Antique Lover\""}, {"rating": 5.0, "review": "Love it. Love it. This is the best thing in the world, I can watch all the things I want to and not have to buy a hugely expensive TV!", "verified": true, "helpfulness": "0/0", "author": "Kim Knutson"}, {"rating": 5.0, "review": "Easy set up, nice UI, quick interface. Can't wait for the iOS app to be released, but the included remote is a nice touch. Like it MUCH better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jason Staudt \"Mosttoyswins\""}, {"rating": 3.0, "review": "It is relatively easy to use, however I have a significant complaint in that it seems to log me out of Netflix almost every week.I don't know if this is a problem with all streaming devices but it does not happen on the PS3 that I used to stream Netflix from.", "verified": false, "helpfulness": "0/0", "author": "Cha"}, {"rating": 5.0, "review": "Bought this for $19 -- a no brainer. I already own a Fire TV and got this to use for other TVs or when we travel. Plug it in and instant access to our account, Amazon Prime Video, Plex, Netflix, etc. Great addition to Amazon devices.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "Best gift I have ever received!!!", "verified": true, "helpfulness": "0/0", "author": "Tim Johnson"}, {"rating": 3.0, "review": "Actually a 3 1/2 would be more accurate.  I love Amazon and their products - big Kindle Fan.  Big Fire TV fan.  I was given a Fire Stick for Christmas because I travel a lot.  I've noticed that I can access the HDMI ports in many hotel rooms so with a Fire Stick, I can travel with movies and TV shows and not be stuck with the crappy programing in most hotels.  It looks so portable in the commercials.  Even the Thumbnail for the product makes it look like it doesn't need any wires.  I thought maybe it was powered by the HDMI port - what do I know?  No.  It has a cord with a convert box that plugs into the wall.  I also had to use the HDMI extender cable on every TV in my home because it would not connect to the WIFI when behind the TV - bummer.  Other than that, it seems as functional as my FIRE TV box - just not as portable and quick one-step as the ads lead you to believe.  The commercial would have you believe Gary Busey could just plug it in and off he goes - sadly, he'd have no better luck just plugging his Fire TV Stick into an HDMI port than a sea shell.", "verified": true, "helpfulness": "0/0", "author": "Mark Harden \"The Animal Wiseguy\""}, {"rating": 4.0, "review": "It's an affordable, well-designed, compact streaming device for watching your favorite programs on your wi-fi devices.  You must subscribe to Netflix, HBO, SHO, Amazon Prime or other similar services to watch quality videos or movies.  I am dissappointed with the quality of Amazon Prime offering of videos and movies.", "verified": true, "helpfulness": "0/0", "author": "Gurudev \"savvy buyer\""}, {"rating": 5.0, "review": "I absolutely love this! It's so user friendly and so convent!", "verified": true, "helpfulness": "0/0", "author": "Nicole Briece"}]