[{"rating": 5.0, "review": "Awesome and now my child wants one for her room.", "verified": true, "helpfulness": "0/0", "author": "Howard B. Becker"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "kenny james eagle"}, {"rating": 4.0, "review": "I like this product, would get another if needed", "verified": true, "helpfulness": "0/0", "author": "Jeremy & Amanda"}, {"rating": 1.0, "review": "Overall, it's ok for the price (I paid $20 for one).  Amazon did not make it clear though that it is NOT just a USB stick that you plug in however, it requires a power cord and is slightly bulkier than it looks (it's power cord blocks a HDMI port on my TV).  Other than that, however, it does work quite well.UPDATE after using the device for two months.  It constantly stops working and I have to either unplug it/plug it back in, and three times it \"forgot\" my Netflix information while keeping everything else.  I messaged Amazon and they offered me a refund, which is nice, but I'd rather them fix their product.  I no longer think it was worth bothering with.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"xlance\""}, {"rating": 5.0, "review": "It gave me a little trouble at first - for the first few days it wouldn't connect to wifi, but now that it's working I love it. Better than my apple TV by a longshot.", "verified": true, "helpfulness": "0/0", "author": "TIM CERATO"}, {"rating": 4.0, "review": "Bought 2 of these. The first one installed very easily, all I really had to do was sign in and download my apps. The second one however, was a real pain. After it couldn't update for a few days I had to exchange it for a new one at Best Buy (don't get me started on how long it to them to locate another one). I am please with my purchase though. This stick gives more viewing options in rooms where there are no cable outlets plus I have the lowest cable package so it's nice to have a wider selection of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Lauren Johnson"}, {"rating": 5.0, "review": "I needed a new device to stream to my TV after my Wii died. I was actually planning to get an Apple TV but the Fire stick Promo came up and I thought I could risk $20. It works very well.  The remote works really well for navigating. The picture is crystal clear. Appears to bring in my Wifi signal in great from across the house, no buffering. I have only started playing with it but the interface is a little clunky, I mean it definitely works but its a slight pain to browse. I also need to look into deleting some of the pre-installed apps. I have no interest in any of them except netflix and I like things to be clean. Incredible value. I will probably be getting another one for my downstairs TV when I need one.", "verified": true, "helpfulness": "0/0", "author": "D$"}, {"rating": 2.0, "review": "Is it just me or is this product really noisy.  At first I thought it was the hard drive from my computer, but even that isn't that loud.I also own a FireTV.  This is definitely sluggish compared to the FireTV.  It is sluggish compared to an AppleTV even though it has better specs.  I am okay with the product, but over all disappointed.  I thought it would be a lot smoother.  At times my video will freeze and navigation is really laggy.  I've had one crash that resulted the reboot of the entire system.But for $19, why should I even complain.", "verified": true, "helpfulness": "0/0", "author": "phuoc tran"}, {"rating": 5.0, "review": "Our family loves the Amazon fire stick!  Everything you need is so easily accessible.  The remote is super user friendly, even my 4 year old can use it!", "verified": true, "helpfulness": "0/0", "author": "Kim VanBebber"}, {"rating": 3.0, "review": "Firestick is ok, but right now i prefer Roku.", "verified": true, "helpfulness": "0/0", "author": "Dave"}]