[{"rating": 5.0, "review": "like taking it on trips can watch good stuff for free", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not as organized as Netflix, but its okay", "verified": true, "helpfulness": "0/0", "author": "Paul W."}, {"rating": 3.0, "review": "Really intuitive and the Prime content is nice. Problem is that it drops the wifi network all the time while our laptops, phones, and Chromecast have no problems. It seems like there are a lot of people complaining about this online. A power cycle usually helps but sometimes I even have to cycle the router to get it to work,", "verified": true, "helpfulness": "1/1", "author": "V. Neumann"}, {"rating": 4.0, "review": "It's ok!", "verified": true, "helpfulness": "0/0", "author": "Yvette Nicholson"}, {"rating": 2.0, "review": "It constantly drops internet, won't open applications, and needs reset (which is clearly difficult being plugged into the back of the television). Quite disappointed in this product.", "verified": true, "helpfulness": "0/0", "author": "Danny Kilburn"}, {"rating": 5.0, "review": "Love it. It serves its purpose, now I can watch shows and movies from anywhere.", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Hilliard \"TJ\""}, {"rating": 3.0, "review": "works good but not enough contents to watch.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Amazing product. Easy to install and operate - remote works much like any TV remote.  Really enjoying the content available with Amazon Fire Stick - helps me get more value from my Prime and Netflix subscriptions.  Highly recommend if you have Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "phil52849"}, {"rating": 1.0, "review": "It doesn't work very well. It don't stay connected to the Wi-Fi very long without saying it lost connection. Sorry to say I will be returning it and I wouldn't recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A must have, is easy to use and very affordable compare to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "johanna"}]