[{"rating": 5.0, "review": "The fire TV stick has far exceeded my expectations. I was hoping that I could find an inexpensive Apple TV replacement and I think I did.  The remote works great. The pictures is crisp and everything about the set-up as intuitive and quick.  I like the quick and easy connectivity to both Netflix and amazon prime movies.  My biggest issues with Apple TV is that it is such a pain to switch content providers.  The fire Stick's methods are vastly superior.  I am curious as to how the whole fire TV would perform and if there are noticeable differences.  I just can't think of any useful features that are not included in the stick.  Love it.", "verified": true, "helpfulness": "0/0", "author": "M. Hertz from Manassas"}, {"rating": 2.0, "review": "\"Fire TV Stick also supports standards like DIAL so you can also fling services like YouTube, Spotify, and coming soon, Netflix, from your Android phone or iPhone.\" This made it seem that it would work just like the Chromecast does but i hav not found any way to do that. I gave the stick one extra star because i do like the interface i just wish i had the added functionality that the Chromecast offers.", "verified": true, "helpfulness": "1/1", "author": "Dosgeek"}, {"rating": 5.0, "review": "Love. This. Device!  No more gooking my laptop up to tv by hdmi. Just use remote to havd access to all shows where you pay for subscriptions! Love this. Best item of 2014.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 4.0, "review": "Very cool but a little difficult to navigate.  I'm sure I'll get used to it soon enough.", "verified": true, "helpfulness": "0/0", "author": "Andrea Masciari"}, {"rating": 5.0, "review": "Fast, easy to use, great interface.  Great product!  Plug it in, walk through the setup, hook it to wifi, watch TV.  Full disclosure, I'm a tech freak, so it comes easy to me...but I see no big flaws to this thing.  Side-loaded XBMC and it's a near perfect device for what it is.", "verified": true, "helpfulness": "0/0", "author": "Tim T."}, {"rating": 4.0, "review": "PROs: Fluid interface, low profile.CONs: Limited access to content apps (Crunchyroll for example).Overall: I'm giving it to my parents for Christmas. I loved the updated hardware and interface compared to my Roku 3 but I use Crunchyroll a fair amount and wish it had access to a wider band of content apps. I'm not sure who the blame falls on there (Amazon, Android, Crunchyroll, etc) but it would be nice.", "verified": true, "helpfulness": "0/0", "author": "Sean Collins"}, {"rating": 4.0, "review": "Could work better with plex, but streaming video apps are flawless", "verified": true, "helpfulness": "0/0", "author": "Jonathan Varriale"}, {"rating": 5.0, "review": "Fantastic!  Should have bought one a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Christen"}, {"rating": 5.0, "review": "I'll tell you how I like it in January when I get it.  Not complaining, I got the Prive discount but Can't wait to check it out.  They should have used the Voice remote as a default feature rather than make you buy it separately.  Who is not going to want it.?", "verified": true, "helpfulness": "0/0", "author": "Mclout99"}, {"rating": 5.0, "review": "Was well worth the money I paid. I love amazon and thier products I am beyond satisfied.", "verified": true, "helpfulness": "0/0", "author": "Demetria"}]