[{"rating": 5.0, "review": "Amazon Prime and the Fire Stick are so awesome. We are loving the ease of use. Also makes access to our Sling TV so much easier.Amazon just rocks!", "verified": true, "helpfulness": "0/0", "author": "margaret foster"}, {"rating": 1.0, "review": "Having constant trouble with the device running slowly, stalling, or having to be restarted because it becomes unresponsive or sluggish.  When streaming content like Netflix or Amazon Prime videos, the video tends to be jerky and sometimes stalls while the audio keeps going, then the video seems to fast forward to catch up to the audio.  When I restart the device it stops doing this for a couple days then it starts back again.I have used a Google Chromecast since it came out and never had an issue with Netflix streaming.  The reason why I purchased the fire stick was because it had Amazon Prime capability and Miracast.  Which leads me to my next point...They made the miracast feature compatible with only Amazon devices and a few other devices. This means that you will find miracast devices that do not work with the fire stick, like Windows 8.1 tablets and laptops that are miracast certified and work with other miracast devices.  Now, they are saying that Windows 8.1 support is coming, but I cannot find a release date for this update.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this as a replacement, for my kids CABLE BOX.  This is cutting  the cable box rental costs 150 bucks a year. So 40 dollars, is a no brainer. NO it does help to have one main box, for your premiums, with your cable provider.  But for bedrooms, especially kids rooms,this is an easy solution. PERFECT FOR AMAZON PRIME AND NETFLIX USERS. Now the shortcomings, is does NOT, have  TIME WARNER CABLE APP, so you cant watch TV like you did your box, and it does not accept DISNEY JUNIOR. via TIME WARNER CABLE. But HBO, SHOWTIME, STARZ, all work fine.  It has a nifty tiny remote, that needs to be stashed  away, since kids easily can lose this ( grown ups too). IT does have a hard DC plug, that makes a world of difference, Since it will slow down if you try to just plug it into the TV or  dvd player directly.  It is great for 1 level homes, but I can't see this working so well in a tri -level, since the receptor has a small signal area, behind a tv. FOR A RANCH OR APARTMENT, this is perfect, and you will have zero SIGNAL issues. Just set up your wi fi, and keep cutting your cable bill.Here is the email I sent my family, after trying the FIRE STICK for 2 days:Hey Family,I wanted to share this with you all,Now that I have finally went down to ONLY 1 cable box,and the bedrooms are media streamers, I think the AMAZON FIRE, has a more cable-like interface. But ROKU has more apps,and better delivery. Unless you are a AMAZON PRIME customer. Amazon, has too much music streaming, and useless video apps preloaded.Roku ( 4th Gen coming out soon) has the top sellers,I think sling, Huluplus,  netflix, and amazon prime, is ALL you need to finally cut the cord, on your cable bill, and just pay for internet.  and HBO AND SHOWTIME, are selling web-based a la carte services.  So you could be getting all of your cable for around 50 bucks a month, plus internet. Which is cheaper. But if you want everything, the triple plays, with media players, is keeping my bill steady @ $140 a month. Which is TV/INTERNET/PHONE.  ( INCLUDING HBO, SHOWTIME, EPIC, STARZ)Call your cable companies, and \"hint\", that you want to leave, and they will find a package at least 20 bucks, less than your current package.But seriously, Media streaming is they way to go.", "verified": true, "helpfulness": "0/0", "author": "MOMMY IS A GENIUS \"LOLITA PHOENIX LEE\""}, {"rating": 5.0, "review": "It's exactly what I needed", "verified": true, "helpfulness": "0/0", "author": "Lisa Rexrode"}, {"rating": 4.0, "review": "I am very happy, the ONLY thing I would say is have a good router.", "verified": true, "helpfulness": "0/0", "author": "Lee O."}, {"rating": 5.0, "review": "also using sling tv, I don't seem to have the issues others have with it.", "verified": true, "helpfulness": "0/0", "author": "leah nelson"}, {"rating": 5.0, "review": "Love this thing", "verified": true, "helpfulness": "0/0", "author": "Robert D."}, {"rating": 2.0, "review": "I have had this for several months.  At first, I didn't understand the amount of negative reviews as I have 2 of the \"full size\" Fire TV units and I love them.  At first, the Stick was OK, but recently it has begun telling me to check my network settings.  When I check them, it tells me that it's connected yet still won't let me go to what I want to watch until I completely restart the unit.  One of my most watched apps freezes or loses sound.  Backing out and restarting the app won't work.  Again, I have to restart the entire unit.  I'm getting real pissed and wouldn't recommend this to anyone.........except maybe an enemy.", "verified": true, "helpfulness": "0/0", "author": "Bubba"}, {"rating": 4.0, "review": "A nice way to watch movies.", "verified": true, "helpfulness": "0/0", "author": "solyda"}, {"rating": 5.0, "review": "Excelente producto", "verified": true, "helpfulness": "0/0", "author": "Jose Cabezas"}]