[{"rating": 5.0, "review": "I love this, super easy to use. I'm thinking of getting a second one for my TV so I don't have to run my PS3 to watch Netflix etc", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 4.0, "review": "I absolutely love it!!  My grandchildren love it too.  I don't watch a lot of TV and the fire stick seemed to be the perfect solution for me.  The price is great.", "verified": true, "helpfulness": "0/0", "author": "teresa"}, {"rating": 5.0, "review": "Excellent product in this price range", "verified": true, "helpfulness": "0/0", "author": "Wasif Hassan"}, {"rating": 2.0, "review": "Had to call a technician to figure out how to get it to work with the DISH network.  Would have been NICE had that been made clear before we made the purchase.  So, future buyer, BEWARE if you have the DISH network.", "verified": true, "helpfulness": "0/0", "author": "lshaw"}, {"rating": 5.0, "review": "Love this stick! Turns your tv (kinda) into a smart tv, and the apps are streaming without any issue so far. Has sling tv, and a remote which chromecast didn't which is was made me buy it to begin with. Great product!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Installing was easy, but I still have some slow buffering, which may be due to the constantly changing download speed offeredby the cable company.  The remote is a nice feature, as opposed to the need to control selection with another device.", "verified": true, "helpfulness": "0/0", "author": "3 pack"}, {"rating": 5.0, "review": "We LOVE the Firestick!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tamara Kuykendall"}, {"rating": 4.0, "review": "Simple set up, easy to use. It blows ChromeCast away and is on par with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "ad it up"}, {"rating": 5.0, "review": "Have only made use of the movie capabilities of this gadget, but can say I am definitely impressed with the Fire stick.  I'm on Amazon daily, so can't say the media exposure has been adequate.  And I still wouldn't own one, had I not been given this one, but for a person who hates holding a laptop to watch a movie, this is truly meeting a need.  My hands are in constant arthritis pain and even a cell phone is difficult for me to hold for very long. With minimal difficulty, I was able to hook it up correctly, and was watching a movie within a half hour.  My only unanswered question is, \"Can all Prime movies be accessed with these gadgets, or just the ones posted on the home screen?\"  I wouldappreciate anyone's response.  The best part is the price.  So very, very affordable.  Great going, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Coni G."}, {"rating": 5.0, "review": "It works perfect and was very easy to install. I  am not computer savy and I was able to install it on my TV by myself.", "verified": true, "helpfulness": "0/0", "author": "Joanne R."}]