[{"rating": 5.0, "review": "love the music channels", "verified": true, "helpfulness": "0/0", "author": "sharlene dufford"}, {"rating": 5.0, "review": "Luv it !!!", "verified": true, "helpfulness": "0/0", "author": "L. Legler"}, {"rating": 4.0, "review": "It's great, I use it daily, I'd buy another one before I got one of the other media streamers.  Amazon GUI is ok, speed is just fine for the price, I like the remote (though maybe I missed some instructions somewhere, e.g., I figured this out by playing around: hold down the home button to bring up a menu to put the stick to sleep), like the app too.  Two complaints though.  First is because I have an older cable modem (DOCSIS 2.0) so my internet may cause the streaming to freeze up occasionally.  I unplug and and replug fire stick and back in business.  Second, my 4 year old boy took the remote apart, twice.  Somehow it still works.  So maybe it's not a complaint.", "verified": true, "helpfulness": "0/0", "author": "Chris Kunde"}, {"rating": 2.0, "review": "My son got one and loved it, but mine doesn't work correctly.  I am a Prime member.  I start a Prime video and a few minutes into it I get a screen telling me I don't have rights and it will start over...again and again.  I can't use it...so it was a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Donna S Hawkins"}, {"rating": 3.0, "review": "I thought I would try out the Amazon Fire TV Stick and compare to my chromecast.  I am a prime member and usually use the app on my tv since Amazon doesn't allow you to cast via chromecast.  As of today, if I had to choose I would go with chromecast.  Amazon Fire Stick, lags in the beginning of my shows, lose picture and sound for about 3 secs, through the first 2 minutes (it drops 3-4 times).  I tried HBO go app and I had to restart it 4 times before able to play with the fire tv.  I like the fire tv for my amazon prime shows, but truly prefer my ipad for the layout.  I will continue to use the fire tv, but really do not for see purchasing another one.", "verified": true, "helpfulness": "0/0", "author": "sugar & spice"}, {"rating": 3.0, "review": "I've only been using the Amazon Fire TV Stick for about 3 weeks.  While I primarily use it to watch Youtube learning videos with my two year old and have watched only a couple of movies so far, I must say that the Youtube streaming is slow for some reason, causing it to hang up a lot, which makes my two year old son impatient. We have a Smart TV in another room and the Youtube streaming is perfectly fine when using that TV to watch Youtube videos.  I was hoping that buying this stick would allow me to save money by not spending more on Smart TVs, but I may need to rethink this.  Bummer.  I should say, though, that the two Prime movies that I watched did not have any streaming problems.  Only Youtube for some reason.  I haven't tried everything else.", "verified": true, "helpfulness": "0/0", "author": "JGPtArthur"}, {"rating": 5.0, "review": "It was easy to install and a wide variety of movies and tv shows to watch. Love it!", "verified": true, "helpfulness": "0/0", "author": "Cate"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Judy Steagall"}, {"rating": 5.0, "review": "Works amazing! Easy setup! Much better than my chrome cast by Google worked!", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 1.0, "review": "Set up ok and never worked again. Exchanged for new device at store we purchased it and haven't yet tried the second. May change review after we set up the new one.", "verified": true, "helpfulness": "0/0", "author": "LisaB"}]