[{"rating": 5.0, "review": "I love it.This works extremely well with a good internet connection. Connect this device as instructed and keep the power supply plugged into the wall, not the TV USB connection. The remote is small and can easily get lost, but works very well and simple to use. Add Amazon Prime and catch a large amount of movies and TV series.", "verified": true, "helpfulness": "0/0", "author": "Trey Dorian \"nyckid\""}, {"rating": 5.0, "review": "Easy to use and good picture through my TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sojer\""}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Cathy Shearer"}, {"rating": 5.0, "review": "if you can believe I have a small TV in my bathroom,I bowl three games every day before I go to work how cool is that", "verified": true, "helpfulness": "0/0", "author": "Kalalaman \"kalalaman\""}, {"rating": 4.0, "review": "Great picture, fabulous sound. Netflix runs much better on this than on my tv. Very fast. The only negative is the incompatible remote. I have a marvelous home theater. Logitech pulls everything together except the Fire. And the remote is small so when it slips into the side of your chair you are stuck.I like fire so much I will probably order a backup remote. Hopefully someone is teaching Echo to act as the remote.One other minor issue. I run Fire off my video processor. If I hit the remote when the system is off it turns on the tv and resets the ports. I then need to reboot the Fire to get it back to the right port. Video processor compatibility would be nice.", "verified": true, "helpfulness": "0/0", "author": "Robert Geller"}, {"rating": 5.0, "review": "Bought this for a Christmas gift - great to access Amazon Prime movies!", "verified": true, "helpfulness": "0/0", "author": "MKT"}, {"rating": 5.0, "review": "Great so far", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First of all, I'd like to compare this product to Google's Chromecast streaming dongle.I used Chromecast for about a month, then I switched over to the Fire TV stick and I'm enjoying how much easier it is to use. I use both for mainly streaming TV shows (Netflix, Amazon Prime), and the Fire TV stick outranks Chromecast by multitudes. The Fire TV stick is designed for streaming, and as such comes with a remote. With an Amazon Prime account, you receive access to Prime Music as well as Prime TV, which are built into the software. The stick is extremely intuitive to use, and set up is minimal. It even comes with two AAA batteries for the remote! That's Amazon for you. On the other hand, Chromecast comes with just a dongle, and although not too difficult to set up, the procedure is much longer given the fact that you have to wirelessly pair your device (iPhone, computer, tablet), and the sync sometimes takes a while. The good thing about Chromecast is that you can cast an entire tab to your monitor, but the downside is that the quality is much lower than expected. The UI isn't as friendly, and overall the experience isn't as smooth.TL;DR1. Get the Fire TV Stick if your main purpose is to stream TV, and you have an Amazon Prime account. I never realized how much content you had access to until I got the TV stick, as well as how easy it is to use the Fire TV stick.2. Chromecast is cool and more geared towards if you want to share your computer screen onto the monitor.", "verified": true, "helpfulness": "0/0", "author": "jacwkang"}, {"rating": 5.0, "review": "Very fast and stable", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Hard to understand what is free with prime,must load and then see the cost.", "verified": true, "helpfulness": "0/0", "author": "customer"}]