[{"rating": 5.0, "review": "We have a lake home that we go to 6-8 times a summer. To get cable would be expensive for the short time were there. Using the fire stick with slingbox gives us all the options we have at home without the monthly expense.", "verified": true, "helpfulness": "0/0", "author": "captain rick"}, {"rating": 3.0, "review": "Very disappointed that I can't get vudu on it.", "verified": true, "helpfulness": "0/1", "author": "Julie Migues"}, {"rating": 4.0, "review": "It's ok much LESS choices of what u can watch than advertised", "verified": true, "helpfulness": "0/1", "author": "timm"}, {"rating": 5.0, "review": "So glad to finally get Netflix.", "verified": true, "helpfulness": "0/1", "author": "Ann M. Streit \"nancy\""}, {"rating": 5.0, "review": "Love it!! Nothing more to say!!", "verified": true, "helpfulness": "0/0", "author": "Janet Bracken"}, {"rating": 1.0, "review": "I bought this for secondary TV streaming.  It was easy to install but continues to have connectivity issues that my ROKU stick does not.  I do not recommend this and would not purchase it again.  I am replacing it with a second ROKU.  Roku stick (also purchased thru AMAZON) works great 100% of the time.", "verified": true, "helpfulness": "0/1", "author": "fay fay"}, {"rating": 5.0, "review": "I just bought 3 of these.  One for my upstairs TV, one for my brother & one for his roommate.  It's great!  Netflix & Amazon Prime are not to be missed.  I am even considering getting Hulu & getting rid of my cable.", "verified": true, "helpfulness": "0/0", "author": "Momof1"}, {"rating": 5.0, "review": "The Amazon stick is working great for our needs. We are using it in a vacation home and have been able to dump cable company (that no one likes).  We were prime members already.  We use acess a variety of channels using the sign on we have for Dish TV. So far, so good.", "verified": true, "helpfulness": "0/0", "author": "Puddentane"}, {"rating": 5.0, "review": "Awesome product Amazon!  I would recommend this product over the Chrome Cast, ATV and Roku.", "verified": true, "helpfulness": "0/0", "author": "Ed.Wood"}, {"rating": 5.0, "review": "Great addition to my house.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}]