[{"rating": 4.0, "review": "The Fire TV Stick is a teaser if you are not a Amazon Prime member.  They allow you to view the first episode for free and then $.  Once you decide to become a AP member you will be a member for life.  Well worth it!!!!", "verified": true, "helpfulness": "0/0", "author": "kaden munsey"}, {"rating": 5.0, "review": "works great!!!! love it -- better than the chromcast -- only thing would change is the length of the cord -- since you can;t plug it into USB port for energy like the chromcast -- so needs a longer cord -- other than that great device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  It's great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Thought it was a good deal until I plugged it in. The netflix app would not launch and that was the reason I bought it. Almost like they were trying to force you to buy Amazon prime. Enough of corporate crap. Just give me what I pay for. I insist.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Sherrie R."}, {"rating": 5.0, "review": "this is marvelous.  It workes even better than expected.  We love it and can't wait until it gets HBO too.  But this ismthe best ever.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 5.0, "review": "For the pricing point it delivered beyond my expectation. It would be nice to get old  seasons of Nashville and Suits free, also if you can add ABC/NBC to the line up", "verified": true, "helpfulness": "0/0", "author": "Mo"}, {"rating": 1.0, "review": "Need to return. corder gets hot before movie is over. Not able to use.", "verified": true, "helpfulness": "0/0", "author": "Mary Hammonds"}, {"rating": 4.0, "review": "Very good. I gave it as a gift and was well received.", "verified": true, "helpfulness": "0/0", "author": "Ralph \"Photonracer\""}, {"rating": 2.0, "review": "So disappointed in the Fire TV Stick. I have  Roku Stick that works great with no connectivity issues. I've had the Fire Stick for a couple of days and I've had issues since I installed it.", "verified": true, "helpfulness": "0/0", "author": "AJohnson"}]