[{"rating": 5.0, "review": "Love it. Its the wave of future T.V. watching.", "verified": true, "helpfulness": "0/0", "author": "Luby"}, {"rating": 5.0, "review": "So impressed with this that we ordered 4 more for all the kids tvs. Very easy to set up and use, crystal clear quality and you can't even see it hooked up to your TV. We would highly recommend this anytime.", "verified": true, "helpfulness": "0/0", "author": "Rachael Turner"}, {"rating": 5.0, "review": "This Fire TV Stick is amazing!! Best $40.00 I've spent in awhile. :) It's super fast, easy to use, and the App you can get on your phone to speak the movie/show you are looking for - that rocks! I love everything Fire!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "For $40 this is a great value to get content onto an TV.  I side loaded Kodi and NextPVR to this and added plex to be able to get local content as well.  I do get occasional buffering issues which is hard to blame on the Fire Stick but I do have a nice ASUS AC router.I am docking it a star for having to side load Kodi which is a pain.", "verified": true, "helpfulness": "0/0", "author": "SWKerr"}, {"rating": 1.0, "review": "What was I thinking - how could this little stick stand up to a Roku or Apple TV. The interface will sometimes work properly without any lag, but most of the time it is EXTREMELY laggy, slow to respond.What their \"comparison chart\" doesn't tell you is how horribly designed the OS and APPS are. I experience ZERO interface lag with my apple TV.. but this \"Fire Stick\" has more UI lag and sluggishness than my first gen android.", "verified": true, "helpfulness": "1/1", "author": "Clippy \"zebulon61\""}, {"rating": 3.0, "review": "If you don't want to purchase prime instant video, the Fire TV Stick isn't a product for you.", "verified": true, "helpfulness": "0/0", "author": "myearsareitchy"}, {"rating": 4.0, "review": "Initially had connectivity issues however they seem to have disappeared. In it's current state it works fine. I am giving it 4 instead of 5 simply because of its interface being less than preferable and it doesn't come preloaded with basic apps like YouTube... but you can dig through the 3rd party YouTube apps and get what you need.", "verified": true, "helpfulness": "0/0", "author": "Joel Richey"}, {"rating": 5.0, "review": "Holy snap! You GOTTA get one of these. We recently moved out 3 y/o son into his own room so he can start sleeping in his own bed. Finally ready! We were going to add another Uverse wireless tv set in there, but we're limited to only 2 wireless devices, so that was out of the question. Then we started using the extra Wii console to play movies from Amazon Instant Video. The quality was TERRIBLE, so I thought that's just how it's going to be. A day later I saw an ad about the Fire TV Stick and decided to give that a shot that way I didn't have to keep coming back into the room and turning off the console an hour later.We received the item like 2 days earlier than expected. It took just a few minutes to setup (I skipped the intro video it came with). Man, the quality of the videos are AMAZING!!!! I'm ready to buy some more just to give to my parents since they don't really like cable anyway. I'll be sure to bring this TV Stick with me where ever we travel. This is probably one of the best things I purchased this year and I've probably already spent close to $10,000 this year. Oops.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lam"}, {"rating": 5.0, "review": "Use it more than cable", "verified": true, "helpfulness": "1/1", "author": "Redsim"}, {"rating": 5.0, "review": "Love the clarity of the picture.  Very easy to use.", "verified": true, "helpfulness": "1/1", "author": "Sue Lichtenberg"}]