[{"rating": 3.0, "review": "tends to freeze screen when watching HULU, but seems to be good product for the price", "verified": true, "helpfulness": "0/0", "author": "stacie cowden"}, {"rating": 5.0, "review": "Affordable and makes TV's lacking intelligence, smart. Great for Prime members. Netflix, YouTube and Amazon Prime movies, music and shows could replace cable/satellite for the thrifty folks.", "verified": true, "helpfulness": "0/0", "author": "D Bob"}, {"rating": 5.0, "review": "Worked perfectly with easy setup. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "MKFLA"}, {"rating": 5.0, "review": "East to set-up. A very cool piece of technology!", "verified": true, "helpfulness": "0/0", "author": "K. Miller"}, {"rating": 4.0, "review": "The Fire Stick was inexpensive and easy to set up.  I was able to set up ESPN and watch sports free of charge.  The receiver goes behind the TV and pickups up a strong signal from the remote.Watch out...though.  If you click on the \"30 day trial for Amazon Prime Membership\", they will charge your account for a membership with no email message or anything.  If a Prime member has added you as a sub-member, you are unable to watch Prime content.", "verified": true, "helpfulness": "0/0", "author": "Joan Mims"}, {"rating": 5.0, "review": "Great to watch movies when there's nothing on tv", "verified": true, "helpfulness": "0/0", "author": "Ruben Nazario"}, {"rating": 4.0, "review": "Love it. I bought it for my bedroom. I bought the fire tv for my main tv last spring.", "verified": true, "helpfulness": "0/0", "author": "michael m"}, {"rating": 5.0, "review": "This device facilitates super fast speed using a basement TV and makes my Prime membership more valuable.", "verified": true, "helpfulness": "0/0", "author": "Bradford Bowen"}, {"rating": 2.0, "review": "Love the access to Hulu & Netflix, as well as the Prime content, but the remote is sporadic at best (significant lag between when a button is pushed and when the device responds - from no more than 10 feet away from the TV).  Disappointed.", "verified": true, "helpfulness": "0/0", "author": "Peter B Anderson"}, {"rating": 5.0, "review": "I have not used the stick all that much but I had no problem setting it up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]