[{"rating": 3.0, "review": "Not very impressive.  Actually i feel it has gotten slow in 2 weeks.  Remote is very useful compared to chromecast.", "verified": true, "helpfulness": "0/0", "author": "Madhukannan S Bollu"}, {"rating": 5.0, "review": "What an improvement over my old streaming device! I connected it in 5 minutes and was watching movies in 10! Very fast connection and no buffering interruptions while in the middle of an exciting flick! I still need to explore the other features available on the Fire TV Stick. For the price and the speed and simplicity, it's a great product from Amazon!", "verified": true, "helpfulness": "0/0", "author": "Mark Schneider"}, {"rating": 3.0, "review": "I would like this device a whole lot more if it didn't continuously get hung up when streaming even when utilizing the extender that Amazon provides. I just ordered a wifi extender and am hoping that might cure the problem but I can tell you that I don't have a similar issue when using Apple TV.  A disappointment, for sure.", "verified": true, "helpfulness": "0/0", "author": "KD"}, {"rating": 5.0, "review": "I like it for the tv's that are not connected to a device that gets Netflix or many devices that do get Netflix, do not support Amazon Prime.  It's also always on, so you don't have to wait for your device to \"warm up\" and connect, ....just change the input to your tv, and bam,...it's on and ready to go.", "verified": true, "helpfulness": "0/0", "author": "SarcasticShopper"}, {"rating": 4.0, "review": "Great item love it", "verified": true, "helpfulness": "0/0", "author": "Antonio Gibson \"Tonyace\""}, {"rating": 5.0, "review": "Works great for what I use it for, mostly Netflix and Amazon Prime. I bought it instead of getting another blu ray player for my second TV. I don't regret it. Doesn't have all the same TV apps as the Kindle Fire, though.", "verified": true, "helpfulness": "0/0", "author": "ShoeLover"}, {"rating": 5.0, "review": "I am 76 and had no problem installing, I had no trouble accessing my wish list, very pleased", "verified": true, "helpfulness": "0/0", "author": "B. Radcliff \"avid reader\""}, {"rating": 5.0, "review": "Great device! Smooth interface!", "verified": true, "helpfulness": "0/0", "author": "Robert W Burdette"}, {"rating": 5.0, "review": "very happy. easy to set up, works very well", "verified": true, "helpfulness": "0/0", "author": "Martha D. Laska"}, {"rating": 5.0, "review": "We love this. It works through the A/V receiver and actually switches the input when I hit the home key. 5.1 and streams fast.", "verified": true, "helpfulness": "0/0", "author": "CKP"}]