[{"rating": 5.0, "review": "Love it...", "verified": true, "helpfulness": "0/0", "author": "Clara Tiscareno"}, {"rating": 5.0, "review": "Just as good as the Apple TV for way less $$", "verified": true, "helpfulness": "0/0", "author": "Stacey Hartz"}, {"rating": 5.0, "review": "Great product with minimal lag time on the live streaming.  The amazon only programming is excellent and the prime movie selection is a must have.", "verified": true, "helpfulness": "0/0", "author": "pmccord"}, {"rating": 5.0, "review": "The Fire Stick takes a second to set up and works flawlessly with my TV. Less than half the price of Apple TV, and I love streaming video on this. The remote it easy to navigate. Loving it", "verified": false, "helpfulness": "0/0", "author": "ceejay"}, {"rating": 5.0, "review": "I love it! better than what I was using before! I would highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Toni Gamarro \"Toni Gamarro\""}, {"rating": 5.0, "review": "We LOVE the Fire TV Stick.  I will admit, we are an Apple family.  We have 3 (yes, 3!) Apple TVs.  Initially, we bought the Fire TV Stick because CBS shows (The Good Wife, etc) were included through Prime, something that Apple TV does not have (unless purchasing through iTunes).  But, we have discovered the functionality is much greater than Apple TV.  The remote signal is much better, the graphics and navigation are better; all around, might I say, better!", "verified": true, "helpfulness": "0/0", "author": "Liz Chandler"}, {"rating": 5.0, "review": "Love the Fire TV stick!  I have other devices for gaming so I really don't need that portion or the full FireTV, but the stick is great, much easier than AppleTV and blows away ChromeCast.  This thing is great!", "verified": true, "helpfulness": "0/0", "author": "JJones"}, {"rating": 5.0, "review": "Thumbs up", "verified": true, "helpfulness": "0/0", "author": "Shakia Robertson"}, {"rating": 4.0, "review": "very easy to use", "verified": true, "helpfulness": "0/0", "author": "Maria Escareno"}, {"rating": 5.0, "review": "works great..tks", "verified": true, "helpfulness": "0/0", "author": "Showdog"}]