[{"rating": 5.0, "review": "I love this thing!  It comes with it's own little remote, and it is extremely easy hook up!", "verified": true, "helpfulness": "0/0", "author": "laurie miller"}, {"rating": 5.0, "review": "I am glad I purchased this item, I love it!", "verified": true, "helpfulness": "0/0", "author": "Sal \"Salienier Y. Alexander\""}, {"rating": 5.0, "review": "world's as expected requires that a 1.0 amp connection which comes included but most tv's don't have which shouldn't be a problem with a proper drop cord I would highly suggest this to Amazon prime users that are on the road or traveling", "verified": true, "helpfulness": "0/0", "author": "william peterson"}, {"rating": 3.0, "review": "The sound \"skips\", every few mins, the sound just quits for about a second, very irritating.  We search shows a lot of people w/ this problem.  Finding movies is difficult, no good search options.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as advertised!  Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Overall it met expectations except for the fact I needed to purchase the fire tv box to have a wired lan connection.  The wireless works but bummed not able to utilize my tv lan line already wired for the new home.", "verified": true, "helpfulness": "0/0", "author": "Douglas A Bjornson"}, {"rating": 1.0, "review": "It is always losing connection. My other connected devices work fine, so I can definitely say that it is not my wifi. The first day i received it, it didn't even download the app i bought it for. I gave it another chance and it finally downloaded, and it only worked for a couple of hours.", "verified": true, "helpfulness": "0/0", "author": "Jason  Mayorga"}, {"rating": 5.0, "review": "I love the fore stick. It is so easy to use and hook up. If you are a prime member it comes pre loaded with your info. There are many apps you can load also such as the WWE network and yourube. It make for great entertainment for yourself or for a gift. I highly recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Mark Conner, II"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Christianne G."}, {"rating": 4.0, "review": "its a cool item but it did not make my tv into a smart tv as I expected. it did perform as advertised but not compatible to all wifi hardware such as hd homerun for instance. thinking of returning the stick.", "verified": true, "helpfulness": "0/0", "author": "John P. Neely \"pool player\""}]