[{"rating": 5.0, "review": "The picture is as good as that which we receive from our cable provider. We only use the content that comes as part of our Amazon Prime membership, but even that provides far more content than we could ever watch.", "verified": true, "helpfulness": "0/0", "author": "Jorge Santiago"}, {"rating": 2.0, "review": "It has a difficult time staying connected to my wifi, so it is constantly freezing, skipping, and restarting. No other device has this issue, not even my apple tv, so I know it's not a wifi/connectivity problem. It only works properly about 50% of the time....", "verified": true, "helpfulness": "0/0", "author": "Emily Ripka"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "joshua j. stender"}, {"rating": 3.0, "review": "I didn't! Receive my fire tv stick yet", "verified": true, "helpfulness": "0/0", "author": "monica fleming"}, {"rating": 5.0, "review": "This is a great product.  I bought it as a gift and they have been using it daily to watch movies and tv show off the Amazon Prime. They also been watching shows/movies some from various other platforms included.  It has a lot of pay-for movies and other movie,tv, gaming app's features.One feature they like is the \"recommendation list\" on the bottom of a movie/tv selection, it is really helpful into finding movies they would of never thought of watching.The fire stick was extremely easy to setup, less than 10 minute to finalized all setup and get started.  The Fire stick platform and selection lay out is unbelievably user friendly and i wish my smart tv platform (which has far less options than the Fire TV stick) was as easy to use and navigate around to all the selections.  A definite game changer in the online video and gaming on non-smart Tv's", "verified": true, "helpfulness": "0/0", "author": "JL"}, {"rating": 5.0, "review": "Very nice item. Love that it is so easy and small that it can be hidden.", "verified": true, "helpfulness": "0/0", "author": "ariel raymond"}, {"rating": 3.0, "review": "I bought this item so I could use it in hotels. Unfortunately most hotels redirect you to a website to accept the terms of use. The Fire TV Stick will not take you to that website so it is impossible to use on a hotels network.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "Great for the price", "verified": true, "helpfulness": "0/0", "author": "Mike wagner"}, {"rating": 3.0, "review": "It's an OK Product.  It works pretty well.  Stream video clearly.However I'm not a big fan of how the menu navigates, and also I was surprised that it had to be plugged into an electrical outlet.  The specs probably mentioned that, but the advertisements never show it with a cord running from it.  It's always just plugged into the TV by itself.  Unfortunately, it wouldn't turn on without the external power.", "verified": true, "helpfulness": "0/0", "author": "Pez Collector"}, {"rating": 5.0, "review": "Got it and then could not figure why i bought it, just to see what it was. There are only two of us in the house. Then I put a small TV in my bedroom and hooked in the stick and POW I had amazon streaming to the set through my wireless router.", "verified": true, "helpfulness": "0/0", "author": "Bruce H. Bailey \"bhb56\""}]