[{"rating": 5.0, "review": "Worked excellent out of the box.", "verified": true, "helpfulness": "0/0", "author": "MPete428"}, {"rating": 5.0, "review": "Birthday gift for my daughter. She was thrilled! Great transaction.", "verified": true, "helpfulness": "0/0", "author": "Tito"}, {"rating": 5.0, "review": "A great product for the price. The netflix app is flawless.", "verified": true, "helpfulness": "0/0", "author": "cliff mixon"}, {"rating": 3.0, "review": "Wireless connectivity is strong to my network, yest MLB TV unwatchable due to buffering. I am suspecting it is the Amazon unit as on a different TV (smart TV) we can watch MLB TV without much of a problem. For Amazon video's, it works fine.", "verified": true, "helpfulness": "0/0", "author": "TR Dunne"}, {"rating": 5.0, "review": "Love the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Christopher Erickson \"xxtoon\""}, {"rating": 1.0, "review": "I have not received the product.", "verified": true, "helpfulness": "0/1", "author": "elizabeth"}, {"rating": 5.0, "review": "Gave this to my mom for Mother's Day for her room and she loves it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For prime members this is a must have!  As long as you have a WIFI connections you can say GOODBYE to BORING CABLE and say HELLO to AMAZON PRIME PROGRAMMING.  I’ve been a prime member for a long time – between holidays and birthdays the shipping savings pay for the membership – so as Amazon has added services I’ve  been looking for ways to use them.  Originally I used Amazon Prime on Roku.  This worked reasonably well.  But when I wanted to add Amazon Prime’s music service on Roku it wouldn’t let me use any of the free services, just purchased music.  The Fire TV stick not only is simple to install, it lets me use ALL of the services.  So I can put on one of the streaming channels when I want music or I can put on shows or movies.  Another feature of the Fire TV stick I wasn’t aware of was how the apps are differently configured.  For Netflix fan who want to do a marathon of their favorite show they need only leave it on and it will roll from episode to episode.  Which is perfect if you like to have programs running while you are on a cooking tear.", "verified": true, "helpfulness": "0/0", "author": "Val"}, {"rating": 5.0, "review": "We absolutely love our fire TV stick. It has all the streaming account apps that we use and a lot of child show apps for my kids.", "verified": true, "helpfulness": "0/0", "author": "Lauren Dewalt"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "carmen Berrios"}]