[{"rating": 5.0, "review": "Love. It. Now I am watching all kinds of movies and caught up on all back issues of Dowton Abbey. Also now listen to my favorite Christian singers on Pandora.", "verified": true, "helpfulness": "0/0", "author": "cleta phillips"}, {"rating": 5.0, "review": "AWESOME!  We love ours!", "verified": true, "helpfulness": "0/0", "author": "Eric H."}, {"rating": 5.0, "review": "I did extensive research while I was trying to find a cheaper way to watch our favorite shows. We were ready to cut our cable.I finally decided on the Amazon Fire TV stick. It is affordable and I figured if it didn't work the way we wanted it to, we wouldn't be out a lot of money.Our expectations were met and exceeded. The Fire TV stick is easy to navigate and offers a lot of content. My 5 year old daughter enjoys playing games on it (Crossy Road especially) and she can navigate Netflix easily too.This was the best money I have spent in awhile!", "verified": true, "helpfulness": "0/0", "author": "EandLmommy09"}, {"rating": 3.0, "review": "My take on the Fire TV Stick is that it is an OK media streamer. We also have the (2) Apple TV's and (2) Roku 3's to compare against.Pros:Really integrated into the Amazon Video On Demand service. We love the Amazon VOD so it works well.Offers more apps and an app store compared to the apple tv.Cons:The interface to access other apps is a little odd (the navigation) isn't as easy as the other devices.No seamless way to connect mobile devices (ios or android), but possible.Takes time to find and select the content you want.Xfinity at the time didn't have an agreement with HBO GO to work on the Fire TV StickAll content is also available on Roku", "verified": true, "helpfulness": "0/0", "author": "Ashley Aouate"}, {"rating": 2.0, "review": "Thought it would be some free chanels on it", "verified": true, "helpfulness": "0/2", "author": "Joe Robusky"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Carole Armel"}, {"rating": 5.0, "review": "Love it! Love that I can travel with it", "verified": true, "helpfulness": "0/0", "author": "Debbie Asbury"}, {"rating": 5.0, "review": "I love this!! Especially during the summer when there is nothing on TV, I can always find something on Amazon prime, Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "jenperers \"Jennifer Perers\""}, {"rating": 5.0, "review": "It is wonderful, works great and enjoying very much. thanks Paul.", "verified": true, "helpfulness": "0/0", "author": "paul lohmann"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was easy to install, extremely portable, and  has performed wonderfully.  I not only recommend it, I will be buying another to place upstairs.", "verified": true, "helpfulness": "0/0", "author": "B. Ulbricht"}]