[{"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Caio"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Larry Baldwin"}, {"rating": 5.0, "review": "This is the best!", "verified": true, "helpfulness": "0/0", "author": "erica pincus bouldin"}, {"rating": 5.0, "review": "Love this.", "verified": true, "helpfulness": "0/0", "author": "Mary Perez Shannon"}, {"rating": 5.0, "review": "I purchased this when there was a deal for $19 for Prime Members as a pre-order. We are highly considering getting rid of our satellite when our contract comes due in the next month so I figured this would be an easy option to watch shows, for our kids to have their cartoons and for us to be able to listen to music (which is what we use our DirecTV for currently). This was super easy to set up. Took awhile for it to all go through but after setting it up it's been working perfectly.Before we bought this we were having to use a HDMI cable to hook up our Kindle whenever we wanted to watch something. This is SO easy to use. It just stays hooked into our TV. We switch the input and there is all of our Amazon Prime shows we love plus the apps we've downloaded.I couldn't be happier with this purchase and think it's a good investment if you are constantly having to figure out how to watch your Prime shows or movies on your TV.", "verified": true, "helpfulness": "0/0", "author": "MOMMATOTHREE"}, {"rating": 4.0, "review": "very nice great product!", "verified": true, "helpfulness": "0/0", "author": "Lowell"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "ayriel"}, {"rating": 4.0, "review": "Amazing… I love it", "verified": false, "helpfulness": "0/0", "author": "Oscar Alfaro F."}, {"rating": 1.0, "review": "Install went fine ,but didn't function at all when I tried to play any apps .", "verified": true, "helpfulness": "0/0", "author": "Peter B."}, {"rating": 4.0, "review": "The dual-band wifi really helps with congested neighborhoods, and the remote is very responsive. My only complaints are really limited to the content available for streaming that is included with Prime, and that the media control buttons are transposed with the OS control buttons (regarding where my fingers expect them).", "verified": true, "helpfulness": "0/0", "author": "Hari"}]