[{"rating": 5.0, "review": "Surprise by all means as to how great this works. I am so glad I brought this", "verified": true, "helpfulness": "0/0", "author": "josie"}, {"rating": 2.0, "review": "The picture is bad, especially for Netflix.  I was hoping for HD quality.  It is better to hook up my computer and stream from there.", "verified": true, "helpfulness": "0/0", "author": "karen monte"}, {"rating": 3.0, "review": "It works but not as well as the google tv I have that you informed me you were stop supporting software for so I had to have the fire stick to keep watching your services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Nice tool that I have used to start down the path of \"cutting the cord\". The only significant shortcoming I have observed is almost the complete lack of live TV. Therr are a few OTA stations that can be picked up via Sling and some of the other sunscription services, however not finding a good way to get NFL games or CNBC or live national or local news is a definite constraint.", "verified": true, "helpfulness": "0/0", "author": "S. Margolis \"Vidiot\""}, {"rating": 1.0, "review": "If I have purchased this in US and travel around the world it should be my Pal everywhere I go , but recently I travelled and could not use it in a region which kept on telling me I cant use in this region and stuff ....... its really bad", "verified": true, "helpfulness": "0/0", "author": "Syed Tehren Shah"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Great and easy set up", "verified": true, "helpfulness": "0/0", "author": "Juan C. Garay"}, {"rating": 4.0, "review": "I love it! I have been trying for a very long time to get rid of any cable service period because I just cannot afford to waste my money when all I seem to do is watch commercials. The Fire Stick allows me to get all my shows from Netflix and Hulu, plus I love the fact you can search on YouTube + all the prime shows and prime movies. It did take me a little bit to get a hang of it because one feature I don't care for is it only shows \"recommended\" prime shows and movies and not the Full selections. However, I am about to buy a second one and I am just amazed that I wasted so much money when I could have just purchased this and paid a couple small monthly subscriptions.", "verified": true, "helpfulness": "0/0", "author": "Vince C."}, {"rating": 4.0, "review": "I like it alot! Very convenient, good shows, and great visual. The only thing I would add, is a channel or station list, so we can search shows by Channel. A list would help me find shows when I don't know the names to search for...Oh, and maybe the option to change payment method on screen, and not have too run to a PC mid-show hunting.", "verified": true, "helpfulness": "0/0", "author": "Monique Boykin"}, {"rating": 1.0, "review": "I didn't realize we needed prime or some kind of cable tv to use it for the most part.", "verified": true, "helpfulness": "0/2", "author": "Rebecca Dean"}]