[{"rating": 5.0, "review": "So much fun to be able to access my Netflix account, along with my Amazon Prime account, right on my tv, great product!!", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 2.0, "review": "I had a 29 inch Smart TV in my bedroom and wanted to upgrade to a larger TV.  I found a great deal on a larger TV but it was not a smart TV.  I ordered the Firestick and it has been nothing but a pain in the butt.  At least 4 times a week I get connected with problems.  I have to delete the connection and reconnect.  So annoying.  I also have a Roku in another room and works so much better.  Wish I would have bought a Roku instead.", "verified": true, "helpfulness": "0/1", "author": "Robert Miller"}, {"rating": 5.0, "review": "Very easy to connect and I like it better than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "S Fl homeowner"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Elianne Tejada"}, {"rating": 2.0, "review": "Can't get an internet signal from my router when every other device gets the wireless signal in the same exact location! It's is a headache. Get a Dragon Box instead! You get all free content with Dragon Box, no need for NetflixKept this for 3 weeks or so, am returning. I even got a 10 feet HDMI extender and drilled a hole through the floor so the signal will be right up on the stick but, no luck. HBO, Netflix, and all the other apps buffer during the movies and shows.", "verified": true, "helpfulness": "0/1", "author": "Charotte Beale"}, {"rating": 5.0, "review": "awesome..great for entire family. Easy set up, easy to use", "verified": true, "helpfulness": "0/0", "author": "deebrom"}, {"rating": 4.0, "review": "Sadly the Fire TV stick has a bad habit of overheating on us. I'm not sure why either! When that happens everything slows down and it just is a pain in the arse. I have to unplug it from power, and the tv to let it cool down before we can use it again. Ah well, in the end it's nice to have something that's faster than the Wii at playing Netflix and Youtube... though I'm starting to wonder if there is something better suited for us out there.", "verified": true, "helpfulness": "0/0", "author": "KJohnson"}, {"rating": 4.0, "review": "Unfortunately the sound on two of the movies I was watching cut out.  Other than that it is fine.", "verified": true, "helpfulness": "0/0", "author": "LH Bushnell"}, {"rating": 5.0, "review": "If you install tvmc this thing is great", "verified": true, "helpfulness": "0/0", "author": "Dustin Z"}, {"rating": 5.0, "review": "This is my 2nd fire stick. I travel for a living and it's been a TV life saver when I'm in hotels.  I also have a chromcast it handy too but the fire stick is leaps and bounds better", "verified": true, "helpfulness": "0/0", "author": "Shelly"}]