[{"rating": 4.0, "review": "Our family has two of these, our kids love that the format is the same on both TVs. it is easy to navigate and find what you want. As a Prime Member I do wish it was easier to search only content that was included in the Prime membership as well as having more content that is included in Prime!", "verified": true, "helpfulness": "0/0", "author": "Forrest K Sheets"}, {"rating": 3.0, "review": "Good for the price. For whatever reason, the audio becomes unsynced with the video every time I use Netflix. Hopefully firmware will eventually fix that.", "verified": true, "helpfulness": "0/0", "author": "Brian Mendicino"}, {"rating": 5.0, "review": "Best thing I bought for the house. Say goodbye to Direct TV!  I love the different options I have and more entertainment than I could possibly want and don't have with Direct TV.  Less cost and options. Thank u Amazon.", "verified": true, "helpfulness": "0/0", "author": "yankee700"}, {"rating": 5.0, "review": "Only downside is every time I turn my TV back on I need to remove the Fire TV Stick in order to have the volume on my TV. Other than that it was easy to install, picture is great and navigating is simple. Going to order another one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Laurie Lottimer"}, {"rating": 4.0, "review": "I just received te Firre TV Stick and have tried it on all of my HDMI TV's and it was great. I was able to stream movies in and enjoyed the ease of operation. Set up was a breeze. It was easier to use than the settings on my smart TV. The only problem is getting to the HDMI outlets on the TV's and finding an electrical outlet nearby. I may consider buying additional extension cords to leaeve on the TV's. Great addition to our entertainment tools.", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 4.0, "review": "So far I am loving this!!  Very easy to install and set up. I have this one set up on my small kitchen TV screen.  It is a Dynext 19\" tv and have only hit a glitch once so far.  In the middle of a movie it said I was no longer had an internet connection.  I checked and the connection was still strong so I hope this was just a glitch.  I have been watching TV series like crazy on Prime, and Netflix.  Yesterday I download a bunch of other movie apps but have not had a chance to look at them.  Loving the Music and even the scenary apps; Fireworks, aquarium, beach views, etcI just ordered a 2nd fire stick for my bedroom TV.  This is a newer, larger TV so hoping it will be even better on a bigger screen.,  I love the app for voice commands on my kindle.  So much easier to find things then typing out the letters on the stick's search screen.", "verified": true, "helpfulness": "0/0", "author": "Sharon Mcdonald \"Travel mom\""}, {"rating": 3.0, "review": "I bought this thinking I could use it in hotel rooms when I travel. However, most hotels require you to bring up a web browser and enter an account/code to allow the device access to the internet. Since the Fire TV Stick has no browser I could not get it to connect to the internet and was useless for the purpose I had intended.", "verified": true, "helpfulness": "1/1", "author": "dnlnnhs"}, {"rating": 5.0, "review": "Works great , just wish it had closed caption for my motherwho's also most deaf.", "verified": true, "helpfulness": "0/1", "author": "george DeLorme"}, {"rating": 5.0, "review": "Great selection of Movies and Series.", "verified": true, "helpfulness": "0/0", "author": "tom snyder"}, {"rating": 4.0, "review": "Based on the amount of use it has gotten so far I would say yes, not sure if novelty of it will wear off over time. I have not personally used it but the rest of the family seems to really like it.", "verified": true, "helpfulness": "0/0", "author": "Hoopsters Dad"}]