[{"rating": 5.0, "review": "I love this thing.  I've had it over a month and am just  scratching the surface of things to watch.  My only regret is that I didn't get this earlier and save myself all that money I spent on cable.  Also, at  99.00 a year for prime, I feel like I'm getting away with something!", "verified": true, "helpfulness": "0/0", "author": "Agapito Hernandez"}, {"rating": 1.0, "review": "I was not happy with fire stick there should be free movies for the price you pay.", "verified": true, "helpfulness": "0/2", "author": "diane lecours"}, {"rating": 5.0, "review": "I love my Amazon fire stick.  It's so easy to use.  I own a 2 chromecasts, a roku stick, a roku 3 and a roku 2 and I find that I use the fire stick more than the others.  My chromecasts are collecting dust because they tend to crash a lot and I'm tired of rebooting the device. I used to love using my rokus because I was able to watch Amazon Prime videos and easily control the channels with the remote. I've noticed that the fire stick is a lot faster than the chromecast too. Can't wait for the fire sticks to go on sale so I can pick up a few more.", "verified": true, "helpfulness": "0/0", "author": "Soy Gurl"}, {"rating": 4.0, "review": "My netflix will freeze often while i'm watching via my fire tv stick however over all i enjoy it!", "verified": true, "helpfulness": "1/1", "author": "Kathleen"}, {"rating": 5.0, "review": "Went into an electronics store thinking I would buy a smart tv...but then I stumbled across this.  Only $40 and it saved me the cost of a tv as well as fiddling with wires.  Am definitely well pleased!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 4.0, "review": "I still have not use it too the max of it ability but its working great for Netflix for me.", "verified": true, "helpfulness": "1/1", "author": "Tomyke Reid"}, {"rating": 1.0, "review": "Several apps (Hulu+, PlutoTV, WatchESPN, etc.) don't buffer properly", "verified": true, "helpfulness": "0/1", "author": "Brent Spencer"}, {"rating": 5.0, "review": "The Firestick was exactly what I expected, it allows me view Movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "John M. Salva"}, {"rating": 5.0, "review": "We've been using this for about a month and so far so good. We especially like how well Netflix performs when I compare to my built in app on my TV and DVR.  There seems to be a lot of content (some free; some require a subscription which is not always clear when you read the app description however when you read the reviews it becomes obvious. Looking fo better speed from my ISP so I can continue exploring (I have microwave service that is hurt by the summer foillage.", "verified": true, "helpfulness": "0/0", "author": "Richard Pado"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Craig Colleton"}]