[{"rating": 5.0, "review": "It is all I expected, so glad I purchased this item, had no doubt I be extremely satisfied, anyone who has prime needs to get the fire stick, and all those review about how hard it is to set up believe me they have know idea what their talking about, set up is a snap But Remember you need to be a prime member, and if you are not you need to be, enjoy your fire stick, I am. John", "verified": true, "helpfulness": "0/0", "author": "John Rao,jr"}, {"rating": 5.0, "review": "Quick installation. Works well so far", "verified": true, "helpfulness": "0/0", "author": "cjteach"}, {"rating": 3.0, "review": "How do you turn it off, that's my only problem with this device, it's great streams very well but I don't enjoy leaving it on.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Great product and would love more for the bedrooms as well.", "verified": true, "helpfulness": "1/1", "author": "maggie"}, {"rating": 2.0, "review": "Having a really hard time with it staying connected to my Wi-Fi network and it's right next to my wifi box.", "verified": true, "helpfulness": "0/0", "author": "Adam Quella"}, {"rating": 5.0, "review": "This was given to me as a gift!  I had not had a lot of knowledge about a stick. I  advocate anyone who wants a smart TV to invest in the fire tv stick. The movie choices are great.", "verified": true, "helpfulness": "0/0", "author": "J. Norman \"jnorman10455\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "flor"}, {"rating": 5.0, "review": "Very easy to install and works just fine", "verified": true, "helpfulness": "0/0", "author": "scorpio \"Linda J Malone\""}, {"rating": 5.0, "review": "I am very happy with my purchase of the fire stick, very convenient", "verified": true, "helpfulness": "0/0", "author": "alline tines"}, {"rating": 5.0, "review": "This great,  I get my Amazon Prime and can now use the tv in the basement when doing laundry or working out.  It wouldn't before because we didn't have a cable box on it.  This voice", "verified": true, "helpfulness": "0/0", "author": "Debbie Luhrs \"Debbieloo\""}]