[{"rating": 5.0, "review": "I'm going to get a couple more - these little devices are allowing me to cut the cord just a little more; I'm removing extra cable connections and replacing the old cable boxes with these.I would love it if Discovery channels were available on ANY internet TV device, but I won't hold my breath.  I still need to use cable for those (Discovery, Science, Velocity, etc.).", "verified": true, "helpfulness": "0/0", "author": "Joubert"}, {"rating": 5.0, "review": "Awesome.  Liked it much better than my Google Chromecast, though they are different application.  I installed it on my internet-enabled TV (Sony Bravia), but the Amazon video interface is so much better than the Sony-supplied Amazon app that I never looked back.  The wifi transfer also feels perceptibly faster, and the menu navigation is much snappier.  And the RF remote is genius, I took the habit of just holding us under my blanket and use it by touch alone.  Before, I used to watch 1-2 hours/day of DVR'd DirectTV, now, it's like Amazon prime every other day including most of week-end watching.", "verified": true, "helpfulness": "0/0", "author": "Minh D. Nguyen \"Minh\""}, {"rating": 4.0, "review": "Great product! My roommate and I use it all the time for Youtube, Netflix, and Pandora! The remote gets a little iffy sometimes but works great most of the time.", "verified": false, "helpfulness": "0/0", "author": "Emily Milligan"}, {"rating": 5.0, "review": "Love it thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up.  The supplied remote works great.  Recommend!", "verified": true, "helpfulness": "0/0", "author": "Ryan R."}, {"rating": 5.0, "review": "It was cheaper than I thought it would be and I love being able to watch Netflix on my second TV.  Very easy to set up and to use.", "verified": true, "helpfulness": "0/0", "author": "Ardell"}, {"rating": 4.0, "review": "Would rate as a 5 star IF it had an automatic \"switch over\" from apps to TV.  Very good product!", "verified": true, "helpfulness": "0/0", "author": "Patrick D. McBride"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Marina T. Giunta"}, {"rating": 5.0, "review": "I'm so grateful to be able to stream video to my television (instead of my Fire or IPad) and get \"closed captions\".  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Richard Parker \"Tiger Woman\""}, {"rating": 5.0, "review": "Best money ever spent. Only complaint whatever we're watching will stop if Internet is slow,  but that's Time Warner's fault.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]