[{"rating": 5.0, "review": "This little device has made me so happy. This just plugs into the usb port of your TV. No wires, no space needed. This was so easy to install and it has taken over my tv. Seriously Dish Network called to ask it we were having technical issues due to lack of use. Add a few apps and watch you TV bill drop. I am very happy with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Miranda N"}, {"rating": 5.0, "review": "I cannot give enough accolades to this Fire Stick.  SUPER easy to install.  Crystal clear picture.  The only \"thing\" that confused me was the APPS.  For example:  I watch a lot of YOUTUBE. Simply toggle down to the APPS,  search for YOUTUBE,  download it,  and you're on.  Most other streaming services are pre-loaded on the device.  GREAT, SUPER, FANTASTIC product.  I see NO downside:  other than if you're not an AMAZON PRIME member.  Still,  NOT having so much \"stuff\", physical discs and cases of DVDs,  in my home is another plus.  So, even if you're not an AMAZON PRIME member (although it is a GREAT DEAL),  you can still amass a great MOVIE LIBRARY store on Amazon,  not all over your house.", "verified": true, "helpfulness": "0/1", "author": "Stefan Hayes \"Stefan Hayes\""}, {"rating": 4.0, "review": "it works verry good slow but its ok", "verified": true, "helpfulness": "0/0", "author": "noel"}, {"rating": 5.0, "review": "I am lovin my Fire TV Stick!!  Easy to install without any assistance from my husband!  :)", "verified": true, "helpfulness": "0/0", "author": "LYNDA WAGNER"}, {"rating": 1.0, "review": "Didn't work. Kept losing connection. Bought a new faster router to insure speed was adequate.", "verified": true, "helpfulness": "0/0", "author": "JoysInSD"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Brentster"}, {"rating": 4.0, "review": "Very happy with this product.  So simple to set up and use.  Works exactly as advertised.  Voice command app on phone/tablet works equally as well.", "verified": true, "helpfulness": "0/0", "author": "Kman"}, {"rating": 4.0, "review": "I love this thing.  Small, fast, and easy set up.  ONLY reason it didn't get 5 stars is because of no youtube.com.  Youtube would make this thing the best on the market today, IMO.  Nice smooth UI and visually pleasing.", "verified": true, "helpfulness": "0/0", "author": "Matt Olsen"}, {"rating": 3.0, "review": "Please add volume to the software", "verified": true, "helpfulness": "0/0", "author": "David C"}, {"rating": 5.0, "review": "Have the cheapest internet service my cable service offers.They told me it wouldnt stream movies.Guess what? YES IT DOES.Lowered my cable to the basic service and I watch Prime movies all the time.Love that I have the fire stick on my TV,phone and chromebook.Set up took minutes.", "verified": true, "helpfulness": "0/0", "author": "Nan"}]