[{"rating": 5.0, "review": "simple to set up when someone else does it, because I'm clearly to lazy to plug something in, but my son really loves it", "verified": true, "helpfulness": "0/0", "author": "candy a. smith"}, {"rating": 5.0, "review": "Reasonably priced, easy to install and configure, works good.", "verified": true, "helpfulness": "0/0", "author": "Thomas J. May"}, {"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "Linda Williams"}, {"rating": 5.0, "review": "fast and rather cheap compared to other devices. a must have for prime members!", "verified": true, "helpfulness": "0/0", "author": "Muhammad"}, {"rating": 5.0, "review": "I think I will enjoy it.  Just have to practice!!!  since I am not a tech personWill recommend to other friends!!", "verified": true, "helpfulness": "0/0", "author": "Barbara Selland"}, {"rating": 1.0, "review": "The only reason I ordered the firestick was to streasm MLBTV.com games through my big screen TV........so far, it's brutal! Very very choppy, meaning it pauses every 4-5 seconds it feels like. And if the issue is bandwidth from my internet provider, that's not it, because before I used my laptop and it worked great, but I wished to watch the games on my TV, yet it doesn't work well? Has to be the firestick and nothing to do with my internet. Plus, when I check to see if I have enough bandwidth, the minimum it states for HD mlbtv.com viewing is 3000, well I measured it through their siute and I have 5500, which if I'm correct is almost double of what the minimum should be, so again, if I can view it completely fine on my laptop and when I get the firestick I cannot....guess what the issue is. I think I'm going to send back and get a Chromecast unless issues are solved.", "verified": true, "helpfulness": "1/1", "author": "Benjamin P Harvey"}, {"rating": 5.0, "review": "We love it! We don't have cable and it's great for streaming music, kids TV shows, etc...", "verified": true, "helpfulness": "0/0", "author": "Jessica Wyrick"}, {"rating": 5.0, "review": "Works superbly, equal to or better than higher price alternatives.", "verified": true, "helpfulness": "0/0", "author": "Debald1 \"reveiwer\""}, {"rating": 5.0, "review": "Love it on top of my GoogleCast.......", "verified": true, "helpfulness": "0/0", "author": "lalocamarena"}, {"rating": 1.0, "review": "I can access but once I click on a movie, I get a funky message.  Nothing is accessible after the sign up.", "verified": true, "helpfulness": "0/0", "author": "NZM"}]