[{"rating": 3.0, "review": "Love my Fire TV stick so far, although its biggest flaw is lack of volume buttons/adjustmentsthis is one of the most irritating parts of this thing.. You still have to have a tv remote around.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Good affordable price, working great,has more than meet my expectations. I am glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Fred Lang"}, {"rating": 4.0, "review": "works as advertised. Using the remote to type words is cumbersome.", "verified": true, "helpfulness": "0/0", "author": "Elfi Collins"}, {"rating": 5.0, "review": "Bought a chrome cast for my mother, this thing blows it away. I basically use it in a secondary room so I can stream netflix but it's faster, has a fancier interface and you can adjust display settings too... buy one.", "verified": true, "helpfulness": "0/0", "author": "N. stemple"}, {"rating": 5.0, "review": "Love it. Just what I was looking for. Easy installation.", "verified": true, "helpfulness": "0/0", "author": "Happy Shopper \"Happy Shopper\""}, {"rating": 5.0, "review": "Better than chrome cast! Cheaper too since I pre-ordered.  Watch Netflix, YouTube etc on any TV or projector!  Also you can use all cast to send things from android devices!", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Theriot"}, {"rating": 5.0, "review": "Perfect  gift", "verified": true, "helpfulness": "0/0", "author": "Ayodele Bryant"}, {"rating": 5.0, "review": "I love everything Amazon and Fire TV is no exception.  It offers me great movies and tv. I stream my favorite music.  It ties in with my kindle and because of my prime membership I hardly pay extra for anything. I have the Fire TV with voice search and recently purchased the Fire TV Stick for my husband for his tv.  Now he streams classical music while he plays those games he loves so much.  Our grandchildren are loving it too!!", "verified": true, "helpfulness": "0/0", "author": "Grandma K"}, {"rating": 5.0, "review": "love it, I'd write more, but I'm too busy watching the fire stick!!!!!!!!!!! Get it, you will NOT be disappointed!!! I had a tough time getting info about the wwe network on it, but it is on the stick!!!", "verified": true, "helpfulness": "0/0", "author": "prime-diva-01930"}, {"rating": 5.0, "review": "This Fire TV Stick works so fast, and reliably, that I replaced my Chrome on one TV. I wish I could cast from my smart phone, but most everything I want to see is available. The HD beats Chrome's SD, too. This is the simplest streaming tool I have used.", "verified": true, "helpfulness": "0/0", "author": "S. Epstein"}]