[{"rating": 4.0, "review": "Filled my expectations.Still using and evaluating.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Just as offered  Good product", "verified": true, "helpfulness": "0/0", "author": "Wilbur D Hollifield"}, {"rating": 4.0, "review": "The reason I gave it 4 stars is because of a situation I encountered that prevented me from using my Fire Stick for a few weeks. About a week after setting it up (which was fairly straight forward) I had to reboot my modem. Now everything else that uses my Wi-Fi usually reacquires the connection but my Fire Stick did not. I had to go through the entire connecting and resetting my account. I found this out after trial and error. Otherwise I like it. Sometimes there is some streaming latency but I only have a moderate speed internet connection.", "verified": true, "helpfulness": "1/1", "author": "Roger A. Hackney \"ArizonaRog\""}, {"rating": 1.0, "review": "DO NOT BUY THIS IF YOU WANT TO USE IT FOR TRAVEL!!I bought this specifically because it states it is set up for log on to a captive portal such as you find at most hotels. This when your browser is redirected to a internet window where you accept terms and conditions of the provider and possibly provide a password. The advertising specifically states it does this. I received mine and it did not work. I called their support and the person I spoke to say it does not work and has never worked. It seems odd a company like Amazon would intentionally advertise a specific feature they know full well does not work. Since I cannot log on it does not work at all and I will have to rate it as a piece of junk. Change your advertising AMAZON. You should be ashamed of yourself.", "verified": true, "helpfulness": "0/2", "author": "Todd M."}, {"rating": 5.0, "review": "I'm going to buy another one because the excellent quality this is true high definition. The only thing is that you have to buy a hdmi extension to conect one or two feet away from the tv.", "verified": true, "helpfulness": "0/0", "author": "Rafael t."}, {"rating": 5.0, "review": "Love it! Use it every day. Easy to use and great programs to watch.", "verified": true, "helpfulness": "0/0", "author": "Diane S."}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "learningisfun \"alohaililo\""}, {"rating": 5.0, "review": "Worked exactly as described. Very easy to hook up!", "verified": true, "helpfulness": "0/0", "author": "Deborah M Hernandez"}, {"rating": 5.0, "review": "Love it! Super easy to set up!  Love the content.  Got rid of my Apple TV.  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "EMDGator \"GatorGal\""}, {"rating": 5.0, "review": "We live out in the country and it works well enough that we dropped DISH finally!", "verified": true, "helpfulness": "0/0", "author": "Slafty"}]