[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "kai seminuk"}, {"rating": 5.0, "review": "exceeeelente, the only thing i would changa is that In Netfllix you can change the resolution, because in some places the intertnet not is the best.", "verified": true, "helpfulness": "0/0", "author": "Jose Guillen"}, {"rating": 5.0, "review": "Awesome product, wish it didn't require the power cable though", "verified": true, "helpfulness": "0/0", "author": "S. Price \"parent, PC and gadget nerd.\""}, {"rating": 1.0, "review": "I'm not sure if it tells you this somewhere in the fine print but Comcast Xfinity is not supported as a cable provider.  Therefore, if you buy this to use the HBO Go and Showtime apps, it will not work if you have the subscription through Comcast.", "verified": true, "helpfulness": "0/0", "author": "J V"}, {"rating": 2.0, "review": "To much jitter instead of a smooth frame rate playing HD titles from Amazon. Very irritating. I have fast internet and Wi Fi so it's not that. Netflix titles play fine.", "verified": true, "helpfulness": "0/0", "author": "Scott D. Brennan"}, {"rating": 5.0, "review": "Great great product love it totally change the way I watch TVWith Netflix subscription it's even better", "verified": true, "helpfulness": "0/0", "author": "Eric Preston"}, {"rating": 4.0, "review": "great easy to use", "verified": true, "helpfulness": "0/0", "author": "Willy"}, {"rating": 5.0, "review": "I love it i watch shows i never saw", "verified": true, "helpfulness": "0/0", "author": "Lamont Battle"}, {"rating": 2.0, "review": "I actually love my firestick and it works great.  What I don't love is how somehow Amazon subscribed me to Amazon Prime and charged my credit card $99 for a full year subscription.  Evidently I had a 30 day trial and then was automatically billed.  Had I known I had a 30 day trial I would have tried it out and possibly bought the subscription.  It's very upsetting when you look at your credit card statement and see a $99 charge that you didn't authorize.  When I called the foreign lady was very nice, hard to understand, but friendly.  She explained the above information and also said when I clicked for the free two day shipping, which by the way took 4-5 days, I automatically subscribed.  I'm irritated with Amazon over this.  I'll probably get over it and shop on here again but I will be more hesitant now.  Ugh!  Be careful when purchasing this and don't click on the free two days shipping unless you are prepared for a trial.  Altogether, the Firestick itself works great.  I wish I could give a 5 star but they need to have a better disclaimer so people understand things better.", "verified": true, "helpfulness": "0/0", "author": "CD"}, {"rating": 5.0, "review": "This is a great addition to our television viewing.", "verified": true, "helpfulness": "0/0", "author": "hoss \"hoss\""}]