[{"rating": 5.0, "review": "Amazing device at a great price. Amazon hits a home run with the Fire TV Stick. Simple plug and play.", "verified": true, "helpfulness": "0/0", "author": "kmc67"}, {"rating": 5.0, "review": "This is the perfect device is you don't have a Playstation/XBOX/Wii. The remote that comes with it is very simplistic and easy to learn as well. The clarity is amazing, and there is almost zero buffer time for all video applications. Would recommend to anyone!", "verified": true, "helpfulness": "0/0", "author": "Kaleigh Arnett"}, {"rating": 5.0, "review": "This is a great device. It allows me to watch HULU, Nextflix and Amazon Prime shows and movies. I would highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Gadget girl"}, {"rating": 3.0, "review": "I got this preorder for half price. I am not impressed. Clunky annoying interface. I find it difficult to find what I want on it. After having a Roku for years this just disappoints. The Roku player blows this away. Far superior easier more intuitive interface, many many more channels, more video services and video quality seems better. The Fire drops my wireless on a regular basis. When doing a search it pushes rental after rental. Honestly if I had paid a little more for it I would send it back. Do yourself a favor and buy a Roku. It has over a thousand additional channels to chose from and many are free.", "verified": true, "helpfulness": "0/0", "author": "techhead2k"}, {"rating": 2.0, "review": "There are some major hang-ups on this FireTV stick that have forced me to remove it from my TV completely. The idea is nice, and the interface is pretty, but if it can't play Netflix and stutters on HD content from my Plex server, I can't use it. I tried it for several weeks, but it simply isn't as powerful and is much more crash-prone than my AppleTV or Roku 2 & Roku 3.I compared this to a Chromecast as well, and while I really like having a remote instead of using a smartphone or tablet, it needs some work to keep from skipping, crashing and freezing while trying to play content.", "verified": true, "helpfulness": "0/0", "author": "D. Villella \"gadget geek\""}, {"rating": 5.0, "review": "Love it.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Anita Ryan"}, {"rating": 4.0, "review": "The fire stick is generally great.  The remote is handy, and the interface is fairly easy to use.  My only criticism:  This is in some places advertised as a competitor to the Chromecast.  In many ways it is, and the remote is probably more convenient than using my phone or tablet.  However, the Fire TV Stick is somewhat more limited than the Chromecast.  The TV Stick, however, only plays the videos that can be found through the apps that you can install on the stick.  As far as I can tell, that's a pretty wide range of videos.  But I became a little frustrated when I was trying to figure out how to use this and couldn't find the app I wanted.  Once I figured it out, we were good to go.  The point is, I think it's more like the Roku than the Chromecast.  It seems to be an improvement for stuff like Netflix that have easy to use apps, but more difficult for finding more obscure videos.  There may also be apps that allow you to stream from another device, but I haven't yet figured any of them out.  Happy with my purchase, but just wanted to provide the disclaimer.", "verified": true, "helpfulness": "0/0", "author": "Greg Mokodean"}, {"rating": 2.0, "review": "Expecting more. Slow iOS, confusing interface, and a remote that looks more like an apple knock off is a few reasons to avoid. Stick with roku", "verified": true, "helpfulness": "0/0", "author": "Evildounut"}, {"rating": 5.0, "review": "Great product. Just wish my internet connection was faster so I could stream directly from the TV.  Have to use my kindle to mirror movie to tv.  Works great, love it.", "verified": true, "helpfulness": "0/0", "author": "Turnkey1"}, {"rating": 5.0, "review": "I am very pleased with the Fire TV stick; great programming and all the benefits from Amazon Prime.  The stick was easy to install and I am learning how to use my remote (Harmony 700) with this new attachment.", "verified": true, "helpfulness": "0/0", "author": "jogger \"beto r\""}]