[{"rating": 5.0, "review": "Sticks work, but we still do not have a good netflix connection", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It was ok, still haven't had time to use it.", "verified": true, "helpfulness": "0/0", "author": "Robert Valadez"}, {"rating": 5.0, "review": "This was great. I did have to call my buddy in San Francisco and put him on speaker to install it. The instructions only seem good. And I never could figure out how to use it with my Amazon Prime. BUT, unfortunately, I had to return it. Comcast made it impossibly expensive for me to cut the cable cord. And I checked first, really I did. In addition, certain applications -- CBS access, for example -- don't work with the Fire TV Stick. That's important to know. I don't remember seeing that information anywhere. I look forward to being able to end my current relationship with Comcast. I will then see what the Fire TV Stick offers. I hope CBS and Amazon are able to play well together by then.", "verified": true, "helpfulness": "0/0", "author": "Nancy D. Solomon"}, {"rating": 4.0, "review": "The First TV Stick is lite and easy to use. It took no time to set up. The only issues I have with the product are sound and internet connectivity. I the first stick is on and I switch to a different HDMI Port the first stick sometimes loses connectivity and sound gets distorted. It took the stick 3 minutes to connect to my wireless modem which is located 4 feet underneath the stick.", "verified": true, "helpfulness": "0/0", "author": "Joshua Kovach"}, {"rating": 5.0, "review": "Definitely", "verified": true, "helpfulness": "0/1", "author": "dn"}, {"rating": 5.0, "review": "This was an easy set up. I now can get everything on a bedroom TV that did not have a Sony Google box. I wish I had this a long time ago. It is cheaper than the Google box and quicker to set up. Netflix and the Amazon Prime is running smooth. I am not a geek, so if I can set it up, anyone can. I love all the Amazon Prime TV shows! We would never have watched them otherwise.", "verified": true, "helpfulness": "0/0", "author": "savinggrace \"savinggrace\""}, {"rating": 5.0, "review": "Loved the set up process.  So much easier than setting up Chromecast.  Much more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Lucinda Howell"}, {"rating": 5.0, "review": "Extremely easy to set up and use.  Everything worked great.", "verified": true, "helpfulness": "0/0", "author": "M. S. Meyers"}, {"rating": 5.0, "review": "So far, so good.  I bought it strictly for Netflix,  but I'm beginning to branch out to the other apps.  Its simple to use, and if you're a Prime member, then it would be extremely beneficial, as all movies and shows are free.", "verified": true, "helpfulness": "0/0", "author": "JUSTIN C DOZIER"}, {"rating": 3.0, "review": "I don't see where it does any more than suddenlink on demand", "verified": true, "helpfulness": "0/0", "author": "Gloria Phelps"}]