[{"rating": 5.0, "review": "I really like this.  I like being able to watch my Amazon Prime stuff without having to connect using my Kindle.  It is a great deal and great if you do not have a Web ready tv.", "verified": true, "helpfulness": "0/0", "author": "Sandnole \"sandnole\""}, {"rating": 5.0, "review": "Got this at a very great price from Amazon and now my \"dumb\" tv is a smart one and can now access all of the various media downloads", "verified": true, "helpfulness": "0/0", "author": "Bluffheights90814"}, {"rating": 2.0, "review": "The device is easy to set up and install. The price is reasonable.  However, I have had to unplug and replug it multiple times in its first week of use. Even when I know for sure my internet is running fast, shows stop in the middle. I bought the fire stick because I wanted to access my Prime Videos easily, but I regret the purchase.  It's just not consistent with streaming.  With this kind of issue the fact that it was easy to install and a good price doesn't matter one bit.  So far, I consider it a piece of junk.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Hoff"}, {"rating": 4.0, "review": "Met my expectation just need to check my Internet service.", "verified": true, "helpfulness": "0/0", "author": "YD"}, {"rating": 3.0, "review": "I don't yet know whether or not I actually like it because it has a major design flaw in that the power cord isn't long enough to reach a \"nearby receptacle\". Since I don't do things by half measure (ie extension cord), I'll have to have a receptacle installed. The length of cord is fine if there is a receptacle at standard height (15\" off of the floor) and directly to the right of the TV. Thank goodness I'm married to an electrician but others won't be so lucky and are looking at $150, easily, to have a receptacle installed. Serious design flaw!", "verified": true, "helpfulness": "0/3", "author": "Bobbi Whitlock"}, {"rating": 5.0, "review": "Love the flexibility and options.", "verified": true, "helpfulness": "0/0", "author": "Terri Diamond"}, {"rating": 5.0, "review": "Love the portability of it", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "RdRodriguez"}, {"rating": 5.0, "review": "Might just be the greatest thing ever invented.  If I can figure it out...anybody can.  Connected right away to home WiFi and I downloaded the Fire TV stick app to my phone and was using voice commands to search what I wanted to watch.  I think they made it very user friendly and highly recommend this as an alternative to additional cable TV add-on channels that are usually costly.  Very pleased with Amazon Prime overall, but this was the icing on the cake.", "verified": true, "helpfulness": "1/1", "author": "Jeff McCullough"}, {"rating": 5.0, "review": "I love it ! It took a little figuring out and a new router but once I got it working it is pretty cool.", "verified": true, "helpfulness": "1/1", "author": "Terri L. Basso"}]