[{"rating": 5.0, "review": "Works great but don't see the need to have a prime membership to enjoy it if you already have  Netflix", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "It has been working great! No problems yet. Definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Cisneros"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "ugarciat"}, {"rating": 5.0, "review": "I have this upstairs and my Roku downstairs.  Both work great.BTW, I hardly watch Netflix anymore (which I can do directly through DISH now), because Amazon Prime offers so many more shows.", "verified": true, "helpfulness": "0/0", "author": "Lisa Ellen"}, {"rating": 4.0, "review": "Overall I like this, it's  more convenient than the box. The only thing I don't really like about it is that you still have to plug it in. I wish it was just a cordless usb stick. It works well, sometimes it pauses but customer service is fantastic and all you have to do is unplug it for a few minutes for it to go back to normal.", "verified": true, "helpfulness": "0/0", "author": "Sheena B"}, {"rating": 3.0, "review": "It runs kind of hot. Even the plastic case is melted and discolored. It works great, I am just concern about fire hazard.", "verified": true, "helpfulness": "0/0", "author": "M. Ch"}, {"rating": 5.0, "review": "Easy to install and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Jetskier"}, {"rating": 5.0, "review": "Nice product", "verified": true, "helpfulness": "0/0", "author": "K. Lai \"Lai1800\""}, {"rating": 5.0, "review": "I purchased this Fire TV Stick because i wanted to cut cost within my household and i am sure glad I did!!! Love Love Love this Fire TV stick!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Didn't work with my Home Theater System.", "verified": true, "helpfulness": "0/0", "author": "Eddy Rosell"}]