[{"rating": 5.0, "review": "Very Easy Set up. Streaming is fast. I love all of the options and the remote is a plus. Becoming Prime Member is a must if you want to take full advantage of all of its features", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Pretty cool device and works great", "verified": true, "helpfulness": "0/0", "author": "Sherri P."}, {"rating": 3.0, "review": "When it works it's great. But it doesn't work half the time, and when it's playing a show or movie it stops or cuts out.", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 5.0, "review": "We've had our Fire TV stick for about 3 hours so far, and love it :) Plugged it in, hooked it up to our wifi (WPA2-PSK) without any problems, and have been watching shows ever since. We haven't had any of the problems reported in the one-star reviews, but will update the review if we run into problems along the way.", "verified": true, "helpfulness": "0/0", "author": "Christopher M."}, {"rating": 5.0, "review": "For the price and size, this is a great product.  It's laggier than its big brother but that doesn't detract from the experience.  It handles Miracast very well and even some games.I also own the Chromecast, the most popular competitor, and I have to say I prefer the Fire TV - if nothing else, because it has a remote.  Chromecast hardly has an interface of it's own, you're basically using apps on your phone to control the same app on the chromecast. The FireTV has an interface and lets you navigate it and enjoy it - even if your phone is dead.", "verified": true, "helpfulness": "0/0", "author": "Nikodem Leszek Blach \"Nik\""}, {"rating": 1.0, "review": "Product does not update and therefore does not function correctly. I may have to send it back but still deserves 1 star for being broken.", "verified": true, "helpfulness": "0/0", "author": "Chase Akin"}, {"rating": 5.0, "review": "I purchased this device the second day after it was announced, which means I got the device for twenty dollars. However, I would have gladly paid the full price for this device. At $20, it was a no-brainer. At $39, it's just as much of a value for what you're getting. I originally planned on using this device as my secondary device for my bedroom, but decided to move it to the living room once I saw what it offered over my Apple TV. The Apple TV is happy in my bedroom while the Fire TV Stick has center stage in the living room.Content:The Amazon Fire TV Stick gives you the ability to stream from everyone else that the other big guys like the Ruku and Apple TV allow you to, minus HBO Go. Amazon has stated that they are working on getting a version of HBO Go for their Fire TV and Fire TV Stick, but until then, you're essentially limited to mirroring from your Kindle Fire HD or HDX. That is, if you even own a Kindle Fire. This is not really a problem for me since I do own a Kindle Fire HDX, but a native app is certainly a better alternative and one that I greatly look forward to. Hurry up Amazon! We're waiting! The fact that I can get Plex for my Fire TV Stick is what made me decide to keep this in the living room and relocate the Apple TV instead. I LOVE me some Plex.Speed:There's no two ways about it; the Fire TV Stick isn't quite as powerful as the Fire TV set top box. But considering the price gap, I'm totally fine with a little bit more latency when navigating menus. There isn't any massive delay, but there is a minor stutter here and there as you navigate the home screen, especially if you have applications or content running in the background. But again, considering the price and what it offers, I'm fine with the slight hiccup every now and then. When compared to the Apple TV (second gen), it is considerably faster both loading content and navigating menus. I have never used the third gen Apple TV, so I cannot make any comparison there.Applications:Although you have the ability to run games on the Fire TV Stick, I would not recommend buying it if you plan to use it mainly for games. For the odd game here or there, it's fine, but don't expect insane performance from this thing. If you're looking for something more gaming-centric, I recommend the Fire TV set top box rather than the Stick. However, if you plan to use this for the general Netflix, Amazon Prime, Amazon Music, Hulu, Crackle, etc. etc., then you're better off with this instead of the Fire TV. The price difference is great enough to tolerate the minor software hiccup here and there, and the app selection is the very same (except for the games that it can run).Navigation:Short and sweet, you can use the remote, which is fine, but I recommend getting the Fire TV App if you have Android, a Fire phone, or a Kindle Fire. This will allow you to search for content via voice (though you will be limited to searching for apps that you have and apps in the store, and content from Amazon only, not, say, searching for content from Netflix via voice). It will also allow you to use a full keyboard, rather than the slow, tedious method of clicking around to each letter via the remote. There is currently no iOS app, but Amazon promises that there is one on the way.All in all I'm extremely satisfied with my purchase, especially since I got it for just $19 during the promotional introductory price. But, even at the full price, it's totally worth it. I will say that many retailers are having sales on the Fire TV Stick. You may be able to get it cheaper than you can via Amazon, so make sure you do your research first.", "verified": true, "helpfulness": "2/2", "author": "Andrew King"}, {"rating": 4.0, "review": "Got this because it had flixster", "verified": true, "helpfulness": "0/0", "author": "David B. Sanders \"SandMAN\""}, {"rating": 4.0, "review": "Pretty good well worth the money. I have a roku stick and I like this much better. Hopefully they add more channels. I don't have prime so i'm kinda limited but still good.", "verified": true, "helpfulness": "0/0", "author": "C. Trombly \"C.T.\""}, {"rating": 5.0, "review": "Works great.  Amazon streaming video works much better than on my blu ray player.", "verified": true, "helpfulness": "0/0", "author": "RH"}]