[{"rating": 1.0, "review": "Horrible, this worked for two months and then it wouldn't recognize the network.  Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "chibi bibi"}, {"rating": 5.0, "review": "Love this product.  User friendly!  You can also download a control for your phone.", "verified": true, "helpfulness": "0/0", "author": "Charlieboy"}, {"rating": 4.0, "review": "No need for high cable bills anymore.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Owens-Murphy"}, {"rating": 3.0, "review": "I purchased the Fire Stick as part of my \"Cutting the Cord on Cable\".  I finally got fed up with paying over $115 per/month for cable and getting nothing out of it.I am disappointed in the Fire Stick after connecting it to my TV only because it is useless without paying for the services (apps) that it connects with.I was hoping the Fire Stick connected us with some free TV channels on the internet as well as many paid sites but,  it does not.The ease of using the Fire Stick is great but the other required cost to use it are not.Baytown, Texas", "verified": true, "helpfulness": "1/1", "author": "LDA 3604"}, {"rating": 5.0, "review": "better than expected", "verified": true, "helpfulness": "0/0", "author": "Linda L. Patterson"}, {"rating": 4.0, "review": "Set up easy.  Need more information on how to use remote and how to find a particular movie, show, etc.  Just noticed they lowered price.  Why did they not sell it at that price to begin with?", "verified": true, "helpfulness": "0/0", "author": "Ann R. Wood"}, {"rating": 4.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Renee Mandel"}, {"rating": 3.0, "review": "loose internet all the time when it says that have good service  will not work streaming", "verified": true, "helpfulness": "0/0", "author": "Jim Cassidy"}, {"rating": 4.0, "review": "It's nice.  We had something else prior that didn't need a remote.  I do like all the other features.  We can save shows to watch later, save our favorites and love having Prime.", "verified": true, "helpfulness": "0/0", "author": "Helaine R. Yash"}, {"rating": 5.0, "review": "So far no problems, love it!", "verified": true, "helpfulness": "0/0", "author": "paul h. duffield"}]