[{"rating": 5.0, "review": "First, I want to say I love everything about Amazon. I'm a Prime member and I recommend all my friends to Amazon. However, I'm not happy with my purchase of The Fire Stick one month ago. After plugging it in, it worked fine. The trouble started 2 days ago. The service crashed. I've unplugged and restarted several times, but to no avail. I've unplugged the Roku from the TV and the Fire just won't connect to the Internet. I'm very frustrated with the Fire TV. I do not want to return to using Roku.I'm going to continue to research and troubleshoot and I hope I can resolve the issue very soon. At least I was able to finish Marco Polo which was Franklin fantastic. If anyone has any advice and resolution for the technical,problem I'm having Please Please paleezzzz share with me what you did to get back to the land of happy. I want to be able to enthusiastically recommend the Fire TV stick to my friends.", "verified": true, "helpfulness": "0/0", "author": "Shad in DC \"SAS\""}, {"rating": 5.0, "review": "Love my Fire TV but when I saw the stick for a fraction of the price of the Fire TV, I had to give it a shot for my other TV. The result is: I see no difference. I'm not a gamer and that's where the difference justifies the upgrade.The Fire Stick is cheap enough that I was actually able to get a few for my team as a gift!", "verified": true, "helpfulness": "0/0", "author": "fdelacou"}, {"rating": 5.0, "review": "perpect..", "verified": true, "helpfulness": "1/2", "author": "YUN YOUNG SIK"}, {"rating": 5.0, "review": "Awesome device. All new technology takes time to understand and explore. My adventure to discover all the Fire Stick possibilities and advantages has just begun. ;-)", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 3.0, "review": "locks up alot the remote works when it wants too", "verified": true, "helpfulness": "0/0", "author": "Ashley Richardson"}, {"rating": 1.0, "review": "I too am having issues with the freezing watching Hulu or Netflix. I am an Amazon junkie but this is a lackluster device.", "verified": true, "helpfulness": "0/1", "author": "Gregory J."}, {"rating": 3.0, "review": "This little guy was pretty much set up right out of the box. You just have to connect to wifi and download a few apps. Most of the content I want is there - Netflix, YouTube, etc. The interface is pretty clean. Your recent apps are the first thing you see, so the things you use most will be readily accessible. Being only a click below that, accessing your Amazon video content is breeze. It also supports streaming of your Amazon MP3 library, which I really didn't expect.The issue I'm having with this device is with performance. Input from the remote often takes up about second to register and sometimes the cursor skips several spaces. It didn't seem like a big deal at first, but the longer I use the device the more annoying it is. I definitely don't feel the extra power that this stick has over its competitors. Another issue is the video quality. It isn't terrible, but other devices in the same location seem to do a little better, and a couple friends are having this problem as well. Hopefully these are resolved with a software update.The Amazon Fire TV Stick basically turns any TV into a smart TV, but it's performance is about as clunky as the few that I have encountered. Overall, it was worth the $20 prepurchase, but I wouldn't recommend it at full price. The remote is a nice touch, but I wish that there were a mobile app with the same functionality since it is so laggy in my case.Pros:Easy setupNetflix, YouTube, Plex, etc all work fineEasy to hide if the USB port on your tv is supportedSleek interfaceComes with a remoteCons:Somewhat lacking in apps (no Crunchyroll if you're into that)Pretty major input lag from the remoteUse of the remote is requiredVideo quality somewhat inconsistent", "verified": true, "helpfulness": "1/1", "author": "ibuythings21"}, {"rating": 2.0, "review": "It works, but there are several problems.- Freezes after standby- Sometimes movies play the audio like everything is in \"slow motion.\"Restarting the stick fixes these issues temporarily, but that is annoying.For comparison, I've had the Roku stick for several months and even though it is slower, the Roku is powered without a wall wart and has been more reliable. Even though Amazon branded stuff is cheaper (the Roku stick was $50 and the Fire stick was $20), the quality isn't the same. Some people may think that Amazon should have time to work out the bugs or that maybe the Netflix app itself was at fault, but if something doesn't work out of the box, it should not be sold.The only reason I didn't give it one star was because it still functions.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "UPDATE [9/7/15] (4 STARS)Okay, I've been using my Fire TV Stick for about a year now and it has been better with the software updates including cast and production info available right on the screen. The interface has also been working more seamlessly for the major (Netflix, Hulu) providers. Still, Crackle does not work well and A&E; & Lifetime may encounter problems. Overall, a much better updated device to use.Another plus is I can use my TV's remote to operate most functions although my Fire Stick may state, \"It appears [app] requires Fire Stick remote\". I can just click past this prompt and use my (LG} TV remote. This may be possible because my TV (sync) will automatically change to active device (e.g. Bluray) when turned on. Another plus (and minus) is I am able to plug my Fire Stick directly in my TV's HDMI port and use the USB port from my TV to power my Fire Stick. This is a plus for reducing wire clutter and ease of use but this also makes my TV [most of the time] change to Fire Stick when I turn on my TV. Not a big deal since I can easily press the \"TV\" button on my remote to tune to my TV's broadcast channels.ORIGINAL REVIEW (3 STARS)I got my Fire Stick for $20.00...That's about all it's worth. It has a rather slow and cumbersome menu. The available apps are pretty limited. It really doesn't have all the apps from Google Play, only a (Amazon) selected choice. This may increase, I dunno.The only reason it's worth $20.00 is because it comes with a remote. Too bad the remote is kinda sketchy. It may not respond or it will advance 2-5 spaces with a single press of a button. I did learn from (very poor) customer support that you can reset the remote using the remote pairing section in the settings and holding the \"Home\" button for 5-10 seconds. Also, the Fire stick is limited to its own dedicated remote and/or its smart phone remote control app or (optional) game remote. I have another (Tianle) TV stick, which is just an Android tablet for your TV, that works much better and has better video quality. It doesn't come with a remote but, for under $20.00, you can use just about any USB connected pointing or track-pad/keyboard device. Plus, running with the Android OS, there is a full (pretty quick) browser to use.For some reason the Fire Stick defaults to 720p resolution even on a 1080p display. I chose (manually) 1080p resolution but did not see any difference in picture quality. I will say the picture quality is very smooth but appears to be slightly filtered. This may be a feature to insure non-jittery picture motion at the expense of picture crispness.The pluses are it has pretty good wifi connectivity, although limited to the 2.4GHz band and all the major (Netflix, Hulu...) video services work well. I did have a couple of lags with Crackle and Lifetime; I've noticed lags with these on other devices too. My main plus is it can stream Amazon Prime and is easily portable. Plus, I can stream any of my personal media files from Amazon Cloud. Unfortunately, you cannot stream from your home network.Overall, the Fire Stick is okay but nothing special and there are much better choices out there. So, unless you really need Amazon Prime features, I would not recommend the Fire Stick. At least not for $40.00.", "verified": true, "helpfulness": "1/1", "author": "Richard La Barca"}, {"rating": 5.0, "review": "Haven't had any deal breaking problems with it, installation & menue use are easy", "verified": true, "helpfulness": "0/0", "author": "Mark"}]