[{"rating": 5.0, "review": "Works great! Easy to install in less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "John Markley"}, {"rating": 5.0, "review": "Great product easy to install and set up. I was concerned that our Internet speed would not be enough at 2 mbs, but it seems to work just fine with no buffering.", "verified": true, "helpfulness": "0/0", "author": "Benjamin d"}, {"rating": 3.0, "review": "I bought this for my brother as a Christmas present and when we got it setup I was shocked that Watch ESPN is not a pre-loaded app, you have to download it, and before you can do that you have to register an account at Amazon.  Guess I got snookered on this one.  The device seems to work well enough otherwise and my brother will reluctantly sign up with Amazon, JUST AS THEY DESIGNED IT ALL ALONG!!!Note to Amazon:  Just go ahead and give these things away free, you'll make it up on the required new accounts!", "verified": true, "helpfulness": "0/0", "author": "D. Smith \"Music Lover\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "raymond"}, {"rating": 5.0, "review": "A great addition to my TV.", "verified": true, "helpfulness": "0/0", "author": "Pat Jenkins"}, {"rating": 5.0, "review": "Love it!  Perfect for an older tv that we keep in the garage.", "verified": true, "helpfulness": "0/0", "author": "LamFam"}, {"rating": 5.0, "review": "I really love the fire stick!!!! Still learning everything it does. We only have TV threw this . I have never felt the need to pay the high cost for cable. We only had a dvd player until now . Never liked commercials. Still wondering the differences between the fire stick and fire TV? It was very easy to set up. I would recommend this to every one. I also ordered this when it was out-of-stock but amazon still made sure we got for Xmas. It came 12/24. It wasn't suppose to come until Jan. Thank you amazon.", "verified": true, "helpfulness": "0/0", "author": "Carrie Moore"}, {"rating": 5.0, "review": "I ordered the Fire TV stick since I have the Amazon Prime membership.  Thought, what the heck, give it a try.  Just kept putting off installation because I dreaded it so much.  Decided today to give it a shot.  It took me every bit of 3 minutes to get it up and running.  Tutorial was awesome.  I don't have any negatives.  If I can set it up, anyone can.  I have a friend who offered to assist me with set up, but boy was I proud when I called her to tell her I had done it myself.  You have nothing to lose when you deal with Amazon.  Don't like it, send it back, but I promise if you try it, you will like it.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Ritchie"}, {"rating": 3.0, "review": "First I have a DVD player with the features that the Fire TV stick has except one and that is an App for the Amazon Music Library. I seem to have amassed a lot of music in the Library which I can  play on my cell or computer, or Download and copy to a USB and plug that into my DVD player to play through my sound system. Now I just switch to the Stick and play away.There are several things about the Fire Stick that I an not crazy about but if you don't have a 'Smart' TV or DVD player this will hook you up. But you will need Wi-Fi installed in your home. But  It certainly is worth the price and it's easy to hook up. One warning It hooks up to your TV with an HDMI cable, my TV only has two inputs so I had to pick up a small gadget that you attach to multiply your inputs.  Also you'll need a place to plug it in. The back of my TV looks like a jumble of snakes. And you have another remote to keep track of.", "verified": true, "helpfulness": "0/0", "author": "D. P. Lance"}, {"rating": 5.0, "review": "Great product and the remote control allows the entire family to use it without a cell phone", "verified": true, "helpfulness": "0/0", "author": "DN"}]