[{"rating": 5.0, "review": "love the performance.  granddaughter set up as soon as it arrived.  Works beautiful", "verified": true, "helpfulness": "0/0", "author": "Carolyn ford"}, {"rating": 4.0, "review": "I was pleased with how quickly it installed and everything was setup within minutes. It streams well and we use it for Prime and Netflix streaming. I was a little nervous as our internet is not very fast, but it has not had any issues streaming content. My 4 stars is due to the fact that every once in a while there is no sound so we have to unplug it and replug back in to get the sound to start up again and the availability of free TV shows with Prime is crap. You have to pay for nearly every TV episode, but there are many free movies.", "verified": true, "helpfulness": "0/0", "author": "JSOM"}, {"rating": 5.0, "review": "Works great easy setup", "verified": true, "helpfulness": "0/0", "author": "jana l miller"}, {"rating": 1.0, "review": "Returned it, couldn't figure it out. It didn't seem to connect to my TV at all. Maybe it was me...too bad cause the price was excellent.", "verified": true, "helpfulness": "0/0", "author": "Peggy Johnson"}, {"rating": 1.0, "review": "terrible product.", "verified": true, "helpfulness": "0/0", "author": "charles moore"}, {"rating": 5.0, "review": "Easy to set up and it works great.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Molitor \"pkr bkr\""}, {"rating": 5.0, "review": "Enjoy it .", "verified": true, "helpfulness": "0/0", "author": "lawrence"}, {"rating": 5.0, "review": "Love it! Perfect substitution for having a smart tv in our bedroom. I had Google's but replaced it with Amazon's to get remote and access to Prime Instant Video, Netflix and Hulu without having to use my phone.", "verified": true, "helpfulness": "0/0", "author": "Mryan"}, {"rating": 5.0, "review": "I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Paula Studyvin"}, {"rating": 5.0, "review": "Better than I thought and supprisinly better than apple TV!", "verified": false, "helpfulness": "0/0", "author": "William Voorhies"}]