[{"rating": 4.0, "review": "Contents are awesome, the main shortage is the hardware, which will not decode anything in good manner if hardware decode is not available.", "verified": true, "helpfulness": "0/0", "author": "Vash theStampede"}, {"rating": 5.0, "review": "It was easy to install and the choices you have great", "verified": true, "helpfulness": "0/0", "author": "Holly Massia"}, {"rating": 5.0, "review": "How cool is this! Just plug it in and go. Immediate access to tons of movies and TV shows. Just wish I could find the TV mini-series Centennial.", "verified": true, "helpfulness": "0/0", "author": "Lola Anderson"}, {"rating": 5.0, "review": "If I could give more stars I would! ! Very easy to use. No buffering issues and tons to choose from. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "excellent product great transaction", "verified": true, "helpfulness": "0/0", "author": "Jeffrey"}, {"rating": 4.0, "review": "Works faster than our previous instant view technology, but has some trouble with play and pause.  Sometimes if I pause a show, it won't start playing again when I press the play/pause button.  This also happens in reverse.  I have to rewind a bit and then hit play to get started again.  However, easy set-up, quick play, gets the services that I want at a great purchase price.", "verified": true, "helpfulness": "0/0", "author": "Willis"}, {"rating": 4.0, "review": "Im loving it, just wished amazon would've explained that it requires an account for Netflix, hulu and all the others to see the features, other that it great!!!!", "verified": true, "helpfulness": "0/0", "author": "kwame ballard"}, {"rating": 5.0, "review": "very easy to use. bought a second one.", "verified": true, "helpfulness": "0/0", "author": "Agnes Cohea \"jeri\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "rosemary white"}, {"rating": 5.0, "review": "I really appreciate the versatility of this tool and enjoy all the \"little extras\" that you can get with Amazon coins.  The fireplace and aquarium are favorites.  I have a prime membership; I don't even watch live TV anymore.  I rely completely on the Fire stick and am never disappointed.  I also subscribe to several series shows and get the commercial free versions the morning after they are aired on TV.  We could get rid of cable entirely if my husband could get sports games live on the stick.", "verified": true, "helpfulness": "0/0", "author": "schnoop \"eBook Fan\""}]