[{"rating": 4.0, "review": "Works great, watched several movies over the holidays. Only con I have is that since device is controlled through the bluetooth remote only, I am unable to use my universal remote to control.", "verified": true, "helpfulness": "0/0", "author": "Anthony R Aldridge"}, {"rating": 5.0, "review": "it's brilliant. I'm so glad I ordered it & not the Google chromecast, this works way better.", "verified": true, "helpfulness": "0/0", "author": "Kiana"}, {"rating": 5.0, "review": "Came sooner that predicted when I ordered it. Set up was very easy and it works great. Lots of Prime content at no cost.  Other more recent movie selection is pretty comparable to Fios, but have not carefully compared costs yet.", "verified": true, "helpfulness": "0/0", "author": "Harry D. Bear"}, {"rating": 5.0, "review": "AWESOME!! VERY EASY TO LOAD!! LIKED IT SO MUCH, I ORDERED A SECOND ONE FOR MY BEACH HOUSE!!!", "verified": true, "helpfulness": "0/0", "author": "MAS"}, {"rating": 5.0, "review": "Fire TV is the best!", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 5.0, "review": "The fire stick works great and was easy to get started. I have Prime and have a lot of movies and t v shows lined up to watch.", "verified": false, "helpfulness": "0/0", "author": "Matt Rudderow"}, {"rating": 4.0, "review": "Only think that would make it better would be HBO Go.  Awesome little device.", "verified": true, "helpfulness": "0/0", "author": "James Webb"}, {"rating": 5.0, "review": "It's nice. It just overheats when plugged in too long", "verified": true, "helpfulness": "0/0", "author": "James J."}, {"rating": 5.0, "review": "The fire TV stick works great! Easy to set up.  I bought one for myself and two as a gift.  No issues yet, its been the best thing that I have bought. Before I had to set up laptop to TV to watch Amazon prime or Netflix.  Now all I have to do is use the Fire stick remote and I can watch on TV instantly! Love it !", "verified": true, "helpfulness": "0/0", "author": "Melissa R Johnson"}, {"rating": 4.0, "review": "the first is the good: extremely easy to set-up and operational in literally 5-10minutes. the streaming is very fast and rarely will you notice any lag time during a show perhaps 1 sec. there is also a lot of content available and it links to things like your netflix and hulu accounts, it is making cable tv past basic local stations an obsolete waste of moneythe not as good: it is a little hard to access all the content and when you do for example movies, its hard to know which movies will cost you extra and how much they seem mixed together. perhaps that is because i am not used to using the system yet. another issue is movie loads quickly but if you want to skip the introductions you have to wait for it to load anyway so to jump a head 10 sec might take 3 second wait. not big deal and could have more to do with my internet speed than the product but it gets annoying none the lessanother downside there is so much available you can waist time just watching movies and series that you never needed to see before. too much time on our hands and now something to do with it I suppose.overall take: a really great product that will change peoples approach to watching TV and movies", "verified": true, "helpfulness": "0/0", "author": "b boy \"doc b\""}]