[{"rating": 2.0, "review": "One problem after another.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this from Best Buy for 23.98. Well worth the price, I was very impressed with how seamlessly it hooked up to the TV. Can even play games with the remote that comes with it. I highly recommend this to anyone that is thinking of upgrading to a smart TV and wants to save $100 in the process. Simple, easy, and very affordable. 5 Stars+", "verified": true, "helpfulness": "0/0", "author": "Steve G"}, {"rating": 3.0, "review": "The Fire TV Stick holds a ridiculous amount of potential for what came out to a very inexpensive price (promo period). However, it feels incomplete and recommending the item weighs heavily on your intended use for it.Pros:1. Hugely inexpensive for the included specs, well built hardware and excellent packaging.2. As a consumption device for all things Amazon it's fantastic, it works well and is organized nicely for the use of the Amazon Prime features we all know and like. Best interface for Amazon Prime yet.3. Netflix and YouTube work well as expected.4. The mobile phone controller app works well5. Supports \"casting\" from certain applications6. Supports Miracast7. ADB support, you can sideload (though it'll be tucked away in the Application Manager)8. Games runCons:1. Make no mistake, this is an Amazon Prime device. The interface will remind you of this constantly, as it is very unintuitive for the use of other applications.2. Hulu is tremendously sluggish, and Plex seems to have a 50/50 functional/not functional success rate on it.3. The applications crash on a semi-regular basis.4. I have purchased a few of these for friends and family, and unfortunately my initial one seems to run into regular Wifi connectivity issues (Wifi tends to just disappear completely on it for long periods of time), I'm hoping this won't be the case for other ones I've distributed.5. The device constantly stops responding after entering my PIN to unlock it from Family/Kid mode for Settings modifications.6. It's simply a little too buggy/glitch-ridden for primetime at this point.7. Games don't run well.At the discounted rate it was introduced, you can't really go wrong with this device. However, I feel at full price, you're entirely too close to much better options.Bottomline: If you want a device to consume Amazon Prime content, this is a good one to get. If you want a device for a slew of viewing apps, then at full price, this is too close in range for other, better devices. Good at a discount, only passable at MSRP.", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 5.0, "review": "Best for the price", "verified": true, "helpfulness": "0/0", "author": "Ismael Lopez"}, {"rating": 5.0, "review": "Got more than I expected before when Amazon said I should expect it.  I must thank Staples for a lower price than Amazon's introductory price of $19.99.  Paying less that 17 dollars made my day.  The unit is so good that I will not cancel my order for the one that Amazon says that will be delivered to me after January 5th, 2015.  The Fire Stick blows Chromecast out of the water.  However, Amazon should have played fair and created an Amazon Instant Video App for the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "greymoment"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Andrew J. Keane \"Drew\""}, {"rating": 2.0, "review": "I was pretty excited to try this on our non-smart tv in our basement.  We just had TWC install a whole home wifi in our house a couple weeks ago. Our wifi router sits at the top of the basement stairs...direct line to the basement....Fire Stick is about 10 feet from the bottom of the stairs.  The setup process is very simple....scan for the wifi and type in the password.  It kept failing...signal not found even though it showed 2 bars.  I found that I had to unplug the xBox, which sits next to the tv, as well as turn off all wi-fi on all devices....iPhones, iPads, Macbook.  Once I did that it found the signal and it worked.  Since then I've tried unsuccessfully to go directly to the movies/shows without having to rescan or turn off all wi-fi on our devices.  Understanding that this device is mobil from tv to tv I took it to the second floor tv.  Once I plugged it in and turn it on it showed me the home menu right away....saw the movies listed, tv shows....looked ready to go.  However, when I clicked on a show/movie, it was never successful in \"loading...\" what I selected.  I went to the settings, found my wifi signal with 2 bars, did a rescan and it said \"Connected with problems\".  What's that?  I could not load anything.  No option to determine the problem, no troubleshooting.  I unplugged it and put it back downstairs because I knew it worked down there....if I turn off all the devices in the house.", "verified": true, "helpfulness": "0/0", "author": "BKBroiler \"Brian Kusserow\""}, {"rating": 3.0, "review": "Works good on Netflex and Prime but not so good on PLEX.  When running PLEX it will freeze and you have to re-start the movie.  Not good!", "verified": true, "helpfulness": "0/0", "author": "Robert W Comstock"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"book reader\""}, {"rating": 4.0, "review": "It's super convenient to have access to Netflix without having to go through the Game systems! I also like that I can access Pandora and several other web-based apps using my TV. The reason for 4 instead of 5 stars is because the little remote is a pain. There is no Text-like capabilities, so in searching you have to scroll though every letter. It's very basic. Otherwise, it works great and is well-worth the money!", "verified": true, "helpfulness": "0/0", "author": "J. Barber \"JBarber\""}]