[{"rating": 5.0, "review": "Thing is amazing. Small. Low power. Fast. I can stream all the crap I have downloaded to my PC through Plex (app). Smooth. Intuitive. Multitask capable.The hate I see on these reviews is like the hate for protein powders because of the taste...", "verified": true, "helpfulness": "0/0", "author": "R. Even"}, {"rating": 5.0, "review": "The Fire TV Stick was easy to install and use. The only difficulty was opening the remote to insert batteries.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I hate my Fire TV Stick at first. Nothing worked. But I know Amazon and its products have a wonderful reputation, and I'd heard great things about the Fire TV and the Stick. So I called a techie friend. He informed me that since the router is downstairs and my Stick upstairs, the smaller antenna that comes in the Fire Stick (same with any streaming hardware that size) wasn't picking up my Wi-Fi signal strongly enough. He came over and installed a repeater upstairs that helped it do what I absolutely needed (Netflix and I love my fireplace app), but nothing more. Tested my 'net and said I was only get 1.3mbps anyway. Was just informed that all BellSouth DSL customers have to switch to AT&T; UVerse, so I gave it a shot instead of switching to Roadrunner. I don't even need the repeater! I get around 18mbps now. MAJOR change! I can do everything on my Fire TV Stick now! I LOVE IT! If you have any problems, customer service is not only on top of it (my USB power cable went bad), but they go above and beyond to help, and they replace any parts as well as give you free shipping for returning defective parts. Honestly, I'm surprised the power cable went bad because I'm very impressed with the craftsmanship of the Fire Stick. I've heard you can upgrade to a speaking remote like the regular Fire TV has, but the remote that comes with the Stick is really easy to use, and I prefer it to Roku and Chromecast. Do yourself a favor and snag this while it's at such a great price, and especially if you have Amazon Prime! Prime Video is the best.My one complaint actually has nothing to do with Amazon or the Stick itself. I, uh, use a friend's HBO Go login info and she has Comcast. Comcast is the last cable station in the country who won't allow HBO Go to stream unless it's on a phone, tablet, or laptop. So you can get the app for HBO Go on the Stick, but totally forget about it if you have Comcast. And write those suckers an angry letter! If you don't have HBO Go at all but do have Amazon Prime, many of the HBO stuff is on Prime Video. So, see? TOTALLY worth it!", "verified": true, "helpfulness": "0/0", "author": "SnowWhiteSC"}, {"rating": 4.0, "review": "Easy to set up and navigate. Nice that you can download several channels and play games right on your TV. Not so great if your not a Prime member.", "verified": true, "helpfulness": "0/1", "author": "Sunny12"}, {"rating": 4.0, "review": "It's picky about it's power supply, but does work well once installed. The power supply is a standard USB to mini-USB cable. I tried to plug it directly into a USB port on the back of my TV, but the software didn't like that at all and told me to use the included transformer. I was just attempting to reduce the wire clutter behind my TV by one wire, but wasn't successful. Seems to be a better interface than Chromecast, but at least Chromecast doesn't need the special transformer.", "verified": true, "helpfulness": "0/1", "author": "Dwight M."}, {"rating": 1.0, "review": "Wow, I had high hopes for this product since it was an Amazon product. Why would they sell something bad, right? Well it is a good concept but failed in execution. If you don't mind stopping midway through a show to see \"buffering\" and having to wait as the Fire Stick feezes, well then I suppose you would be OK with this. I expected more. If you will pardon the pun, this Fire Stick is nothing but smoke.", "verified": true, "helpfulness": "0/1", "author": "Dog Lover"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Does a great job,I had no trouble with the setup!", "verified": true, "helpfulness": "0/0", "author": "Lori lotz"}, {"rating": 5.0, "review": "This is a great product....if you have the right setup.I first set it up with my newer digital tv in a room close to the router. Everything was perfect.What I really bought it for was my older large-screen analog tv in the living room and that presented some challenges. The first hurdle was to convert the HDMI of the Fire Stick to an input compatible with the TV. I went through three different devices that I purchased and then returned to Amazon because they did not transmit the audio. The fourth one finally worked, streaming both video and audio.The second challenge had to do with my wifi signal in the living room. The signal had been adequate for my laptop and Kindle internet access, but the Fire Stick picture was of poor quality, jumping and unclear. To solve that, I ordered a Netgear wifi extender and set it up in the living room. Both Kindle and laptop now show four bars, and the Fire Stick picture is clear and perfect.", "verified": true, "helpfulness": "1/1", "author": "Jude1938"}, {"rating": 5.0, "review": "The family is enjoying the fire stick very much!  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Annie M. H."}]