[{"rating": 2.0, "review": "Worked briefly", "verified": true, "helpfulness": "0/0", "author": "Always October"}, {"rating": 4.0, "review": "Love the stick. Problems with peripherals.Had problems waking from sleep. Replaced included power supply brick with an Apple supply power brick and have had no more problems.Had problems navigating while Pandora was playing - remote lagged. Turned off Pandora in the background and have had no more problems.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "Overall really good interface, very intuitive, super easy set up.  Very fast start up time.  Makes getting to my Amazon videos easy.One downside - I really wish they would have included Vudu.  Just want to put it out there - the two competing devices have it.One concern - it seems to put off a lot of heat, or at least more than I would have thought.  So, I tend to unplug it when not in use.", "verified": true, "helpfulness": "0/0", "author": "wjpalmer"}, {"rating": 3.0, "review": "I have this and two Roku Sticks and for me personally, I prefer the Roku setup and main screens.  The Fire TV seems really tuned into Amazon (Yup, I know) and being a prime member that is great, but I don't really use Prime for streaming all that often.  It was a steal at 20 bucks, so why not try it out.  The install of apps was clunky and navigating around was the same.  All in all it is good for what it does, just my taste in navigation.", "verified": true, "helpfulness": "0/0", "author": "mnpilot"}, {"rating": 5.0, "review": "works great, quick load. boyfriend loves it. router is right next to device. only downside is it has to stay plugged in to power in order to use, wish it could draw its power from the HDMI port but... such is life can't expect too much from a $39 device which I got for 1/2 for that prime members offer! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Steph Q."}, {"rating": 5.0, "review": "We have multiple rokus & are now changing all of them over to fire products. They are much faster than our rokus are.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 1.0, "review": "This is a complete waste of your time and money.  I will break down the pros and the cons however since it has some good qualities.  In the past I have used my xbox 360, my xbox one, a google chromecast and a smart tv, so I am very familiar with what this device should do.Pros:The device is fast.  This is one of the main reasons I purchased the device and as far as speed goes I am happy.  The remote makes navigation a breeze, so that is a big plus over other devices.  I love the remote and I would say the remote itself is the biggest advantage of this device.Cons:I have a real hatred of Android phones and this device basically turns your tv into a big android phone.  The biggest con here is lack of useful applications.  There is no lack of applications, just a lack of useful applications.  You will be able to find all kinds of crappy screen saver applications and lack luster games.  If you look on the reviews of the countless worthless applications you will find that they are covered with negative reviews.  For some reason the youtube app is labeled youtube.com and doesn't really look like youtube.  The main application I use to watch movies is nowhere to be found.  I have 100's of movies on the vudu application that I can access with my smart tv, my xbox consoles, and the chromecast, but for some reason not on this new Fire TV stick.Overall, I feel like this device is a waste.  I have other similar devices that do more.  I bought this because I wanted to replace the chromecast device, but I cannot do that since the device lacks useful applications and replaces them with bloat ware.", "verified": true, "helpfulness": "0/1", "author": "lee"}, {"rating": 5.0, "review": "This is a really good player with no issues at all so far.", "verified": true, "helpfulness": "0/0", "author": "L. Porro"}, {"rating": 5.0, "review": "The best ever!!!  I'm an \"older\" consumer who doesn't do well with highly technical innovations.  Fire TV Stick works perfectly for me, & the best part of all is that Amazon \"speaks\" (gives instructions) in a language I understand, & am not confused by!!  I love, love, love this product.", "verified": true, "helpfulness": "0/0", "author": "Georgie Mcnulty \"bosmama\""}, {"rating": 2.0, "review": "It had no DLNA capabilities.  I returned them and bought a WDTV.", "verified": true, "helpfulness": "0/0", "author": "warren brown"}]