[{"rating": 3.0, "review": "The intermittent issues regarding the bluetooth wireless connection to the controller, as they often do not communicate unless they \"feel like it\", as well as the odd-ball controls on the app which enables the user to control with the phone, makes this almost unusable sometimes. If you are willing to put up with latency issues with the remote, as well as the odd interface which makes zero sense via the app, by all means buy this. My guess is you will be craving the Roku the moment you start using this. It has a lot of potential, but the firmware needs a serious upgrade to reach reliable performance which is not even a problem on Roku.", "verified": true, "helpfulness": "0/0", "author": "Larry M. Chaney"}, {"rating": 1.0, "review": "I just had received my fire stick a couple of days ago. I got very excited, but then disappointed, No matter what I try: Following instructions I could NOT get Netflix to work at all, I have seen many issues similar to this with other people. I am sending it back, don't waste your money on this.", "verified": true, "helpfulness": "1/1", "author": "Rigo hrnandez"}, {"rating": 1.0, "review": "I got my fire stick I would say 2-3 months ago and haven't had any problems. I have been trying the last week to watch a show on Netflix and it won't work. I then tried to watch something I Hulu and it won't work on there either. I reset my internet thinking that was the problem and still nothing. Will someone please give me more ideas on how to fix this?!", "verified": true, "helpfulness": "0/0", "author": "Raime Harvey"}, {"rating": 1.0, "review": "sucks too much buffering drops connection freezes. no problem with chrome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!!! It is easier to search for movies and if you download the app that goes with it you can search for movies by talking!!! 5 star!!!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "Happy with my purchase. Love the picture quality. I have a chromecast and three Roku boxes. Didn't think I would want a Fire TV stick. I got it free for signing up for 3 months of Sling TV. since I am a prime member and have been for years this was an awesome addition to my Gaget library. I have an iPhone 6. Not to many windows based apps play well with it. I was able to download an app that allows me to cast from my phone to the Fire Stick without an Apple TV, which I am not a fan of. Although I love my Roku boxes and don't plan to get rid of them I really think this Fire stick could go give Roku a run for the money. Overall I guess it's your preference. I happened to like this new channel line up I get with Fire in addition to all the content I have as a prime member", "verified": true, "helpfulness": "0/0", "author": "CocoBees_Teaches"}, {"rating": 4.0, "review": "As long as you have a decent router  this will be great.  Our old router was making the picture really choppy, once we got a new one the shows/movies are smooth.  My kids like to watch some of the shows from Disney and Nickelodeon on this.  Although it would be nice if Amazon prime would have a few newer movies available.  Also one of the things I didn't know when I bought it was that I have to plug it in to an outlet as well as the TV, not a big deal if you have enough outlets close to the TV...I do not so I need an extension cord.", "verified": true, "helpfulness": "0/0", "author": "itsnics"}, {"rating": 5.0, "review": "Arrived quickly. Works without issue.  Simple to set up and use. Good value.", "verified": true, "helpfulness": "0/0", "author": "Darrren S."}, {"rating": 3.0, "review": "It's OK.", "verified": true, "helpfulness": "0/0", "author": "Linda Acord"}, {"rating": 4.0, "review": "I use this thing purely for my daughters Prime videos and occasional youtubing while folding clothes. UI is fast and responsive, setup was quick and easy, and streaming is smooth. In fact, it really beats out the Roku UI. But, content is king, and Roku still has more channels that I use regularly including Google Play.", "verified": true, "helpfulness": "0/0", "author": "Akshun J \"Akshun J\""}]