[{"rating": 4.0, "review": "Performed as expected", "verified": true, "helpfulness": "0/0", "author": "James G Johnson"}, {"rating": 5.0, "review": "Loved it. Its easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 1.0, "review": "The movies under the prime are old and outdated and of no intrest to what I like watching. I see why they are free to watch. Waste of money in my opinion.", "verified": true, "helpfulness": "0/0", "author": "J.R."}, {"rating": 5.0, "review": "Amazing.", "verified": true, "helpfulness": "0/0", "author": "jones"}, {"rating": 5.0, "review": "I found it pretty simple to set up, simple to use, and my video quality is the same as with my cable service. Occasionally, my NBC app will hesitate for a few seconds, but movies and TV shows are good to go. It makes unbundling from my expensive, ridiculous, 2,000 channel Verizon subscription a real option.", "verified": true, "helpfulness": "0/0", "author": "Robert A. Carey"}, {"rating": 5.0, "review": "Haven't had it installed too long, but so far it has been great.  Both my husband and granddaughter are enjoying it very much.  And I anticipate many happy hours watching it too.", "verified": true, "helpfulness": "0/0", "author": "Cheryl R. Lawson"}, {"rating": 5.0, "review": "Ditched my Apple TV after getting this. It is awesome. Offers soMuch more, works with my streaming qnap server so I don't have to run media through iTunes anymore too (using plex now) I love it!", "verified": true, "helpfulness": "0/0", "author": "Thomas Seal"}, {"rating": 5.0, "review": "We are enjoying the movies and TV stations", "verified": true, "helpfulness": "0/0", "author": "Marion O."}, {"rating": 4.0, "review": "I bought this for the bedroom TV so it does not get used that often.  It works fine.  I do not have any problems with programs not starting or freezing as I had seen in some other reviews.  I do prefer the Roku user interface better than the Fire stick.  But that's a matter of personal preference.", "verified": true, "helpfulness": "0/0", "author": "BillDare"}, {"rating": 5.0, "review": "Love it, apps run smooth, easy setup.... good price.", "verified": true, "helpfulness": "0/0", "author": "Austin Safko"}]