[{"rating": 2.0, "review": "I thought i would be able to stream what is on my phone to my tv with the fire tv stick. It just turns a regular tv into a smart tv which most tvs are now. It allows me to go on netflix which i could already do on my xbox and amazon prime doesnt have as many shows and movies as i thought it might. Maybe im doing something wrong here?", "verified": true, "helpfulness": "0/1", "author": "brian long"}, {"rating": 5.0, "review": "works perfect for me no complaints just what i wanted unbelieveable product for the size.", "verified": true, "helpfulness": "0/0", "author": "the boss"}, {"rating": 4.0, "review": "The device has supplanted my Chromcast and my PS3 for day-to-day video on demand viewing. Some of the apps have odd implementations and menus, but I'm not sure if the onus is on the developer or Amazon.", "verified": true, "helpfulness": "0/1", "author": "Link"}, {"rating": 4.0, "review": "Device works great but the quality of the remote is so-so. For the price I can't complain.", "verified": true, "helpfulness": "0/0", "author": "Adam M"}, {"rating": 2.0, "review": "All in all, not bad, especially at the price point of $20 (not sure I would be quite as satisfied at the $40 level). I bought this for a separate TV in my office/guest bedroom. The menus are pretty easy to figure out and are intuitive. The remote is fantastic in my opinion. The general layout could be better, as it can be a pain to navigate around sometimes.I primarily use it for netflix/hulu plus/amazon prime videos. I've also used it to play a few games, though I do not own the game controller which has limited what games I want to play. The games ran fine. My problem, and the primary reason why I've deducted two stars, is in the streaming content. The fire tv stick has a tendency to \"freeze up\" while streaming for me. These freezes only last a second or two; just enough to cause things to appear jerky. It happens once or twice an episode of whatever tv show I'm watching at the time. Normally, I would blame this on my internet, but unlike the vast majority of America, I actually live in a place I can get reasonably fast internet for cheap. In addition, I have another TV in a different room hooked up to a PS3 on wifi that I've never experienced this issue with. So, I believe its the fire tv stick itself. I believe the stick may be having overheating problems which is leading to the problem. When in use, my stick can be extremely warm to the touch, almost to the point of burning. So far, it hasn't been a problem outside of the occasional jerky problem, but I am concerned that it will eventually become a larger problem (and if it does, I'll be sure to come back and update to one star).Edit: Problem has in fact worsened over the past few months. Freezing is very common, sometimes within minutes of beginning to use the product. As stated before, I know it isn't my internet, as my PS3 located farther from the router than the fire stick (which is in the same room as the router). Likely won't buy one again.", "verified": true, "helpfulness": "0/0", "author": "dljuly3"}, {"rating": 4.0, "review": "Like it but sometimes it goes black the screen we try all the costumer service recommend. let see how we do.", "verified": true, "helpfulness": "0/0", "author": "dino"}, {"rating": 3.0, "review": "I just got mine plugged in and set up, I've also downloaded the remote app (haven't had a chance to utilize it yet so I may add more commentary later).My initial out of the box impression was good. It was very straightforward and I hooked everything up properly without needing to review the enclosed install information.However one gripe, WHAT'S WITH THE BATTERY DOOR!? maybe it's just mine, and I haven't searched the reviews to see if this is an issue others have had, but getting the door to slide open on the remote battery is quite a challenge. I finally got the batteries in but was concerned I was going to break the remote just forcing the door open. Great if you've got a kid who messes with battery doors like I do (unfortunately this isn't a remote he'll use!), but not great if you want to change the batteries with minimal effort (there's no trick, it's just really \"stuck\" and hard to slide, nothing to pinch or push in involved).**Another little issue for me was that I didn't notice or Amazon didn't say (I'm not sure, so I can't complain with confidence ;) it wasn't in stock when I ordered so I was unpleasantly surprised to wait nearly a month to receive it... but that's not reflective of the product itself.It worked beautifully on my first spin and I found it to be exactly what I was hoping for. I have mine connected to a HDMI port on a computer monitor.Update: Seems more responsive and faster than our Roku 3, I really like the nature screen saver that's built in. Very happy with this purchase. The only negative with its use for me is the \"AmazonCentric\" main screen. I wish it was more like Roku in that respect, I enjoy Prime but would prefer the device was pushing outside downloads a little more and allowing you to organize a home screen that isn't built around Amazon Prime.Second update: I was very excited about this item overall and it was sitting plugged into the monitor it has worked on all along, for about four months, used only a handful of times (never moved/dropped/taken on the go/exposed to elements, etc) ..when last night I discovered all it does now is show the Amazon logo and refuses to boot. Flashbacks to all the android cell phones I've loved and lost!I tried all the resetting options and took it to my other television that works with a Roku, nothing..just up and died in its sleep I guess.  Amazon is luckily replacing it, but it was very frustrating to waste an hour or so dealing with the problem (and customer service)...plus I never did get to watch my show last night. Jeez, ok, first world problem.. I'll cross my fingers I get years and not months out of the next one.", "verified": true, "helpfulness": "0/0", "author": "meowkittymeow"}, {"rating": 5.0, "review": "Love that I have instant access to almost any show or movie I could think of", "verified": true, "helpfulness": "0/0", "author": "Sarah Kasper"}, {"rating": 4.0, "review": "Very easy set up - except for the remote control battery door.  I had to go online to figure it out and eventually use a knife to get it open.  Seems to be a design flaw as there are 100's of other reviewers/commenters stating a similar experience.", "verified": true, "helpfulness": "0/0", "author": "Preppymeetsredneck"}, {"rating": 5.0, "review": "I ordered this even tho we have Two Kindle fire HDX's in our home just to have a remote. Originally my wife gave me a hard time about getting another Amazon streaming device since we had the Kindles. The fire stick is soooo much easier to use. My kindle requires a cable to hook up & my wife's kindle has the wireless method. The fire stick with the remote is a much better way to stream and search.  We have been using it regularly with Amazon Prime & Netflix. I highly recommend getting one. I had the foresight to get the early offer to Prime members for $20 bucks but it is well worth the $40 reg price. Sometimes I wish the remote was a little larger since it is easy to lose in your furniture.  The wI-fi connection seems much better than the Kindle wireless as their are seldom any glitches .", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]