[{"rating": 5.0, "review": "This blows away Google Chromecast!  You get Amazon instant and Netflix and other apps too.  The only thing I wish Fire TV stick would have is a mirror cast other than that it's easy to use.  I would highly recommend this!", "verified": true, "helpfulness": "0/0", "author": "sting"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "A. Gift For You"}, {"rating": 4.0, "review": "While I have a Chromecast, using this devise it's certain that it's nice not to have to use my phone as the \"end all be all remote\" for a smart HDMI device.  I would give it 5 stars but I notice some buffering when using some apps that run super smooth on a PS3 on the same network.  Another downside is HBO GO isn't coming to the stick until Q2 2015 when the app already exists for the Fire TV = politics as usual but great value nonetheless.", "verified": true, "helpfulness": "0/0", "author": "JDB"}, {"rating": 5.0, "review": "Works very well with my Visio TV. Easy and simple installation. Provides loads of alternate entertainment not available on non-smart TV's. Your TV should have HDMI input available. If not, you should be able to use an HDMI to RGB adapter if HDMI input is not available and RGB input is available. Requires connection to a local moderately high speed wireless internet network. The Fire TV stick works perfectly with my 5 mbps internet link.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "I'm much more impressed by the Fire TV, but for the price this is a decent contender in the streaming stick market. Setup is a breeze, UI is straightforward, and performance is quite impressive. I do miss voice search, but understand that had to be omitted to meet this price point. If you want an easy way to access your Prime content, this is the cheaper way to go....but I'd say splurge for the Fire TV for a more fluid experience due to voice search.", "verified": true, "helpfulness": "0/0", "author": "Moozicmon"}, {"rating": 3.0, "review": "Amazon Fire TV is Much much more versatile than Apple TV (atv is pathetically limited in its usability) and I love the fact that it hides behind the set without having a visible box.  I watched the exact same movie scene via Netflix on the Apple TV and Amazon Fire TV. The picture quality is noticeably better on the Apple, the colors are sharper and less hazy. Fire also tends to pixelate the picture much more readily on fast motion scenes.  Thus if I want verity of channels and options I'll definitely choose the Fire. But if I want better quality image I'd have to stick with the Apple.", "verified": true, "helpfulness": "0/0", "author": "Talstoy"}, {"rating": 5.0, "review": "Does exactly what it says and no need to purchase a smart tv. Great product. We purchased 3. That says it all!", "verified": true, "helpfulness": "0/0", "author": "Gwen M"}, {"rating": 2.0, "review": "Roku beats it handily with much better searches and searches with CONTEXT.  I like some of the features like the media, but you can't search worth crap.  Search for \"The Americans\" an FX Series.  I dare you!  You won't find it in 86 returns.  you can find it under prime TV, drama.  BUT not with a search.  This is standard Amazon first try, can't get it right crap.  Not in 10 years can they give us a decent search of their site with sorting.  Figures they can't search their media.The way they set up their prime music is atrocious and DON'T go to their help.  It is inaccurate until you get about 4 levels in and then they actually describe what you do.  No real testing of the documentation.Otherwise the video quality is better then using a browser where they constantly downgrade video quality and stop.  Though not so much anymore.And the apps, WTF?  stupid and miserly.  They all suck.  And where the hell is HBOGO?  The list hbo stuff in their video sections, but I want HBO GO like the SHOWTIME!!!!  I have both under Roku and they work great.  I started out with a ton more channels than on FireTV.  Half-assed execution again.", "verified": true, "helpfulness": "0/1", "author": "Charles E. Richardson \"bink\""}, {"rating": 5.0, "review": "Easy to use and exceptional speed.", "verified": true, "helpfulness": "0/0", "author": "Insurance Goddess"}, {"rating": 4.0, "review": "We're learning how to use it - thankful for the on-line help - don't think it's really difficult but we are a bit challenged.", "verified": true, "helpfulness": "0/0", "author": "Arock \"A grandmother\""}]