[{"rating": 4.0, "review": "Bought this about a month ago. mostly love it. Although, daily, I have a streaming issue. Im not sure if its the Fire Stick, or my internet. My wireless connection says that I have full bars, and excellent signal. Yet every evening, when we are trying to watch something, it will start to play, then freeze up. Audio and Video. Within a moment of two it will reload and continue playing. Only to do it again within a few minutes. OR it will freeze the video and audio, and when the video starts back, the video stays frozen and we can hear the audio. Im really not what to think about this issue. I have an Xbox and a Wii in the house, that we use for video streaming as well, and Hulu has loading issues on those devices, but its much worse on the Fire Stick. The again, Amazon Instant Video and Netflix mostly streams pretty flawlessly. So, Maybe its just Hulu that sucks. Overall, I love the Fire Stick. I really enjoy the layout, and easy of use to move around. Installation was pretty simple. I do plan to buy another one or two, for other rooms in the house.", "verified": true, "helpfulness": "0/0", "author": "Virginia S Leigh"}, {"rating": 1.0, "review": "PRIME DAY IS CRAP.  I was awake at midnight which is hard with 2 little babies to try and get this Prime Deal.  It wasn't even up on the page.  I stayed up for half an hour and still nothing.  I went to bed and woke up at 7am and all there was was a waiting list for it that makes up stay on their page all day.  Who has time for that with 2 babies?!!?  Prime day is suppose to be for Prime members but its really to get people to sign up for prime.  After being a prime member for 5 years, I feel like this day isn't for us.  Canceling my membership.", "verified": false, "helpfulness": "4/7", "author": "Angry Mom"}, {"rating": 2.0, "review": "I  bought this for someone .we read the set..it only showed the children station.. Everything else has to pay..My friends are disappointed.. Because the demonstration said free", "verified": true, "helpfulness": "0/1", "author": "ann marie ramdial"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Jorge Ninci"}, {"rating": 3.0, "review": "Stopped working after 1 month", "verified": true, "helpfulness": "1/1", "author": "wagdog75"}, {"rating": 5.0, "review": "The Fire Stick connects your HDMI enabled TV to your Amazon digital library. For the Prime Member this means ease of access to all of the freely available Prime Movies, Music, and TV shows. I have every TV in my home connected to an Apple TV and using the Amazon app on my iPhone I can play the Amazon stuff to the TV, but it is very nice to bypass the Apple TV and play directly in the Amazon ecosystem.For the Prime Member, the Fire Stick is sort of a no-brainer.Setup is easy. The stick plugs directly into the HDMI port. There is an AC power cord that is necessary to power the stick. The remote works well even without line of sight to the Fire Stick. After pluggin in, the Stick sets itself up. It comes already paired with your Amazon Account which is a nice touch. And the interface is intuitive enough to get start right away.So as I said, even with Apple TVs already connected, I thought it was beneficial enough to have seamless access to Amazon to hook up the Fire Stick in the other HDMI port on the TV.", "verified": true, "helpfulness": "0/0", "author": "Jacob & Kiki Hantla"}, {"rating": 5.0, "review": "Awesome! Only wish I had bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Donald P Ross III"}, {"rating": 5.0, "review": "I love my Amazon Fire TV Stick to access all the wonderful shows from Amazon.  It was so easy to install, setup and use.", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 1.0, "review": "Apparently #PrimeDAY only applies to http://Amazon.co.uk  Their DEALS are ALL DAY! They don't have to put up with this \"Lightning Deal\" BS", "verified": true, "helpfulness": "4/7", "author": "Jeff Acord"}, {"rating": 4.0, "review": "Pros: easy access to Amazon prime. You can install Kodi/XBMC.Cons: terrible, TERRIBLE, user interface. Most apps are just ports of tablet apps.", "verified": true, "helpfulness": "0/0", "author": "Carlos C. \"cuellarfr\""}]