[{"rating": 5.0, "review": "Plugged in to our TV and was up and running streaming prime videos in about 15 min.. ( we had to do a software download) There was a tutorial at the beginning that easily explained all the features.  I don't see us ever using it for gaming. It is great not to have something big and bulky sitting on a tv stand. We like it so much i just ordered another one.", "verified": true, "helpfulness": "0/1", "author": "BerlyGirl10"}, {"rating": 5.0, "review": "Exactly what I was looking for plus more. I wanted a quick and easy way to give my parents a way to make their TV a smart TV. The UI is easy to follow and the remote is awesome and easy to use. This is an awesome product.Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Yep"}, {"rating": 5.0, "review": "I have to say that I am a huge fan of the Fire TV stick. It's great for streaming online content - including prime, netflix, and spotify. For the price this can't be beat!", "verified": true, "helpfulness": "0/1", "author": "Mark"}, {"rating": 1.0, "review": "When it's working it's great, but I'm having tons of intermittent tech issues (frozen screens, malfunctioning remote even with fresh batteries installed, etc). Rebooting usually fixes whatever is going wrong, but I want to watch TV, not reboot continuously. Very frustrating compared to the Roku I had previously (and will probably hook up again when I bail on the Fire Stick). Support non-existent, remote feels cheaply made. It's Amazon, so I'm sure several versions from now it'll work fine.", "verified": true, "helpfulness": "2/4", "author": "Denis Cleary"}, {"rating": 3.0, "review": "This isn't a bad device, but the initial setup is maddening.After unwrapping it, plugging it in and connecting it to my network, it has to download some new software. OK, not a big deal, many devices do that the first time. This isn't that old, so I assume it shouldn't be that out of date and therefore shouldn't have much to download. After 10 minutes (yes I was timing it), it still wasn't done ... and we have a fast connection. I decide to go get something to eat and come back. Now I'm back at the wifi screen where for some reason I have to connect to my network again. It's a good thing passwords are so easy to type while arrowing back and forth to each letter on a tiny remote. It connects again, and after a few minutes I'm ready to go.Or so I thought - then you have to sit through a 3+ minute sales pitch video where they tell you all of the reasons the FireTV stick is great. Reasons you most likely already know BECAUSE YOU BOUGHT IT. And of course there is no way to skip, as the buttons have no effect during this. \"You can press the Home Button to go Home at any time\" - except, of course, during this annoying sales pitch.Other than the initial setup which wasn't the best experience I've ever had, it's not bad. It appears to have connectivity issues at times, which makes it seem sluggish (you click on a show and it takes 10 seconds for the play button to appear on the next screen), but it's not awful.It has a games section, which I assume is for games in your library that are stick compatible? It only showed me 8 when I have way more games than that - although after downloading a game it said something about an unsupported controller, so who knows.All in all, it's not horrible, but I expected better - still, for $19 (I got the $20 off deal) I can't complain.", "verified": true, "helpfulness": "2/3", "author": "Dave B"}, {"rating": 5.0, "review": "Took a bit to update out of the box, and did drop a couple of times on the first day.But otherwise perfect.I like it better than the chromecast cause all you need is the remote.  No loading chromecast on the phone than bringing up the app and casting it.I found the sound on movies and music to be a little better than chromecast.Wish it had HBOgo and maxgo. Also wish it didn't need power connection and used the USB port for power.But pretty cool!", "verified": true, "helpfulness": "0/1", "author": "Kathie Burman"}, {"rating": 4.0, "review": "As we live in the country, our only provider is small-time and has our wifi transmitter on the water tower nearby in our little town.  In the past, we have had slow speeds and frequent stalling on our Netflix and amazon settings, sometimes too the point of discourage-ment and giving up on the shows we were watching.  With the fire tv stick in use for a week now, I can see improvement in both the speed and picture quality of both Netflix and Hulu plus.  We have momentary stalls(Usually at the beginning of a show)but not nearly as bad as before.  I'd have too say my tv experience has improved dramatically since hooking up the stick.  Also, installation is very easy. I certainly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Stone"}, {"rating": 1.0, "review": "Won't work.  Drops the internet connection all the time; took 2 days to get the update downloaded.  My internet is working fine, my Fire TV works great.  Both sticks work like crap as of now.", "verified": true, "helpfulness": "1/3", "author": "Dougie S"}, {"rating": 5.0, "review": "This is the best buy you can get As An Amazon Customer.", "verified": true, "helpfulness": "0/0", "author": "Don W. Torok \"golfboggieman\""}, {"rating": 2.0, "review": "Update: I was eventually able to download AllCast to my wife's Kindle Fire HD for streaming, but if you have an older first gen Fire, it won't even find the app in the appstore.Bought the device today. Took a few minutes to get it up and running. If you are looking to cast from a laptop its not going to happen. If you have an original Kindle Fire, or the Kindle Fire HD which is about 2 years old you will not be able to throw what you're watching onto your t.v. I'm a little upset that its a Fire Stick and I have two Kindle fires and I can't cast my screen to my tv. The actual interface and remote via your tv is outstanding but it doesn't meet my needs.", "verified": false, "helpfulness": "0/1", "author": "t street"}]