[{"rating": 4.0, "review": "I like the fire stick but it is too slow. I also have a roku and it is much faster. I wish I would have just bought the fire tv instead. It does have more storage then the roku and it has a bunch of games. The roku had hardly any games and the games are not very good. I would have given the fire stick 5 stars if it would work faster and cut out less. Nothing more annoying than a movie having to reload every five minutes. And no it is not my internet because I have several other devices that I watch movies on and it is not an issue. It also takes forever to download apps.", "verified": true, "helpfulness": "0/0", "author": "shopper mom"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Scott Cameron"}, {"rating": 5.0, "review": "Wasn't sure if this was exactly what I was looking for. However, once I received and installed it, I couldn't be happier.  Seeing I am already a Prime Member, being able to watch movies and tv shows is wonderful. Super easy to install.  Automatically connected to my Wi-Fi.I would definitely recommend the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Debora \"Mandy\""}, {"rating": 5.0, "review": "Easy to use,gives you so many more viewing options, and reasonable price!", "verified": true, "helpfulness": "0/0", "author": "rivertree"}, {"rating": 5.0, "review": "It is an amazing product from Amazon. Total value for money. I really liked the product and would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Himanshu"}, {"rating": 3.0, "review": "Can I not search Netflix for a movie? Pretty crappy if I can't", "verified": true, "helpfulness": "0/0", "author": "Kieron Lutchman"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "David Abramovitch"}, {"rating": 2.0, "review": "Hardly has any available channels.  Get a Roku!  Much better option.", "verified": true, "helpfulness": "0/0", "author": "Els Brooks"}, {"rating": 4.0, "review": "Easy to set up and seems to work well.", "verified": true, "helpfulness": "0/0", "author": "Ms G."}, {"rating": 4.0, "review": "WORKS GREAT FOR ME", "verified": true, "helpfulness": "0/0", "author": "Jack Davis"}]