[{"rating": 2.0, "review": "It works for amazon movie watching better than my smart tv but I feel they did false advertising as I also wanted to display stuff from my laptop on the screen through the stick as stated, well they don't tell you that only a small number of devices work with their mirroring.", "verified": true, "helpfulness": "0/0", "author": "aaron schram"}, {"rating": 5.0, "review": "An excellent device and and excellent invention.  Amazon will give the cable companies a run for their money.", "verified": true, "helpfulness": "0/0", "author": "Gregory M. Washington"}, {"rating": 5.0, "review": "My favorite birthday gift to myself. Don't say I didn't tell you. I've used it just about every day.", "verified": true, "helpfulness": "0/0", "author": "Dixie Diva \"Dixie Diva\""}, {"rating": 5.0, "review": "I am a die hard Apple fan, but I must admit that AppleTV is very limited to what a person can do.I tried Roku and I do not agree with giving them a credit card number before I could try out the device.The Fire TV Stick has replaced my Raspberry Pi and AppleTV.  This is the first streaming device that can do everything I want to do on the device,I love that I was able to side load all the apps I needed to make this a perfect device my use.I am able to watch all video formats (streaming from my Sinology) with XBMC, VLC, and DS Video.  Really only XBMC is needed for that purpose.  We are a house hold of everything Apple.  Using AirPlay/DLNA Receiver (PRO), we can use airplay mirroring.  No real reason to do that except for showing pics on the TV because Netflix, Amazon Live Streaming, Hulu, and YouTube work perfectly.I will be purchasing more FireTVs for the rest of the TVs.", "verified": true, "helpfulness": "0/0", "author": "Will Beard"}, {"rating": 3.0, "review": "It was very easy to install, however, the remote control cover could not be opened.  I tried for THREE DAYS to open the cover toput in batteries.  I finally took it to a very nice gentleman at an ACE hardware store and asked him to help me.  It took him 20 minutesto open the damn thing.  I actually ordered the voice control remote also and that only took 10 min to open.  When the batteries dieI don't know what I am going to do.  The device works well but after entering my preferences it doesn't seem to let me explore othergenres.  I would give this a 5 star rating if the remotes were not so extremely difficult to open.It just makes me wonder who exactly is in the research and development department that designs such devices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "i like the UI of it, but Plex Media Server which they charge for is no good. it skips. that is my most used app and i cant even use it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought the original fire tv for the main room, but couldn't justify the price for our other tys that aren't used often.  Bought these to go in my other rooms and very happy! I use this for most of my tv watching.  I recommend it to anyone looking for an alternative to cable. Also, amazon music is amazing!", "verified": true, "helpfulness": "0/0", "author": "Kate Eaton"}, {"rating": 1.0, "review": "Poor performance. Definitely not a substitute for the fire TV box. Both have their issues, but the stick is like praying it will connect each time. Should have come with Ethernet connection to increase the chance of actually using it as intended.", "verified": true, "helpfulness": "0/0", "author": "T. Sullivan \"Amazon Addict\""}, {"rating": 1.0, "review": "Fire TV Stick was delivered Friday evening & plugged it into my main TV in the living room. It powered up just fine but would not connect to my wireless. No problem, maybe it's just too far away from the router. Installed it on the TV in the room next to where the router lives - it sees my wireless but chokes on the password. Installed it on a TV in the Den/office 2 feet away from where the router lives... power it up & it sees the network, sees the internet but won't connect to Amazon.com. Error message says: \"Could not contact Amazon.com. Please check your router or select another wireless network.\"Spent almost all day Saturday troubleshooting & trying everything I know - changed wireless encryptions, passwords, wireless channels & even tried it with a completely wide open wireless connection (no security at all).Nothing. Same error again, still.Used the Amazon \"Call Me Back\" feature which is a really good thing & was handed off to Tech Support. After about an hr of wasted time, he had me hold down the 'Home' button down for 5 seconds while the Stick powered up & nothing happened. I guess it's supposed to go to a setup page of some sort which didn't happen. The Tech puts me on hold for a while & comes back talking about escalating this to the Development Team who may (or may not) have an update that will fix the problem (or not) & he would call me back as soon has he had something. Maybe next week...I said that was unacceptable & that I had already paid for a working unit. This one is clearly defective - send me a new one & I'll send this one back.After a little back & forth he finally agreed & sent me the return shipping label to send it back & a tracking number for the new TV Stick which should be here in 2 days.All the people I spoke to were very polite & courteous.I will post an update when the new one comes in.ChuckUPDATE:Apparently the problem was with my wireless router. Bought a new Linksys WRT 1900 AC yesterday & everything is working as advertised.Hope this helps.Chuck", "verified": true, "helpfulness": "0/0", "author": "Chuck Lightly"}, {"rating": 5.0, "review": "This thing is amazing!  Love it!!!! Easy to set-up,  even easier to use. I also love the phone app. Kudos amazon!", "verified": true, "helpfulness": "0/0", "author": "Amy Miller"}]