[{"rating": 1.0, "review": "I returned this item as didn't think I would use it very much at all.", "verified": true, "helpfulness": "0/0", "author": "hkw"}, {"rating": 1.0, "review": "It was buffering the entire time, very poor quality", "verified": true, "helpfulness": "0/0", "author": "Doug Fleck Jr."}, {"rating": 5.0, "review": "Had a Chromecast and couldn't get Amazon Instant on it.  Loved the Chomecast, but since I use Amazon instant streaming with my Prime membership this works better.  Going to buy a few more for my other TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "The Amazon fire tv stick is awesome.", "verified": true, "helpfulness": "0/0", "author": "NIGEL A BALKISSOON"}, {"rating": 3.0, "review": "We were excited to have just paid $99 for Amazon Prime and only $35 for the Fire Stick but little did I know 85% of the shows I want to watch are not available unless I pay anywhere from $1.99-$3.99 per episode. Or $20-$30 for the full season... Also one of the main reasons we chose this brand over the others was because it offered Disney Jr. But so far it keeps giving us an error message even though I've retried to link it up numerous times.", "verified": true, "helpfulness": "0/0", "author": "Meghan"}, {"rating": 4.0, "review": "It works real good", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "Very pleased with the fire tv stick the family is enjoying them!", "verified": true, "helpfulness": "0/0", "author": "James Vining"}, {"rating": 5.0, "review": "This was a gift from my daughter! I love it very easy to use! So many shows too choose from!", "verified": true, "helpfulness": "0/0", "author": "julia82"}, {"rating": 1.0, "review": "Worked well 3/4 the Netflix movie. Then it started rebuffing.", "verified": true, "helpfulness": "0/0", "author": "Iris"}, {"rating": 4.0, "review": "The Firestick overall is pretty awesome. Easy to navigate and easy to install. The only bad thing is that I've had it freeze up a few times where I had to disconnect the power to get it to work again.", "verified": true, "helpfulness": "1/1", "author": "Bloodlust6sic6 \"Bloodlust6sic6\""}]