[{"rating": 1.0, "review": "Horrible.  Kept rendering and shut off in middle of a movie. Returned back to Best Buy .", "verified": true, "helpfulness": "0/2", "author": "Betty Henderson"}, {"rating": 4.0, "review": "More content and easier to navigate than Chromecast. Would be nice to broadcast Internet content to TV.", "verified": true, "helpfulness": "0/0", "author": "David Winton"}, {"rating": 2.0, "review": "very difficult for me to set up. after it was up and going I received a perfect picture for amazon instant movie and tv.  I also found the interface  screen a tad difficult to navigate. Netflix displays  a terrible picture. All the other free tv offers are terrible programing that you will not want to watch. Over all it serves it purpose for amazon tv and movies.", "verified": true, "helpfulness": "0/2", "author": "jack roche"}, {"rating": 1.0, "review": "live in uk, bought 4 fire sticks for myself and family on recent visit to usa as fire stick not available in uk, already have fire tv so saw this as a cheaper version of a similar product. does not work in uk for anything except a few games so pretty useless. bought at bestbuy over the counter. had phone help from tech support who just advised nothing could be done and no refund or compensatory amazon vouchers could be issued as i didnt buy it direct from them, why should it matter, it is clearly an amazon product. why shouldnt it work in uk when fire tv works wherever you are so long as you tell the fire tv box where you are geographically........ $160 down the drain with no help from amazon. disappointing service given that i have been happy with the 2 kindles and the fire tv i already own and countless amazon purchases and general service in the past.", "verified": true, "helpfulness": "1/4", "author": "paul"}, {"rating": 5.0, "review": "Compared to the smart hub on my Samsung this thing is lightning fast for browsing.  I can scroll though menu pretty darn fast.  If I had one complaint I wish I could see movies in my watch list in a multi tile view instead of scrolling across.  I also wish I could go to Hulu and not Hulu plus.  That would be nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lisa Williams"}, {"rating": 1.0, "review": "couldn't get it to work??", "verified": true, "helpfulness": "0/2", "author": "The Greek"}, {"rating": 5.0, "review": "Plug and play...So simple to use that you can't go wrong.  I absolutely feel it to be a great buy!", "verified": true, "helpfulness": "0/0", "author": "Bradley Harden"}, {"rating": 5.0, "review": "This was one of the best purchases I made all year!!!", "verified": true, "helpfulness": "0/0", "author": "Steven Smith"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "WES C."}]