[{"rating": 2.0, "review": "When running apps I have trouble with lag. I have a very good, stable internet connection so that isn't the issue. Other than that I like it", "verified": true, "helpfulness": "0/0", "author": "Cameron harding"}, {"rating": 1.0, "review": "For people that live out of USA not is fully used because a lot app required contracts with TV providers and in my country I don't have this opportunity.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "The fire sick is amazing. it's super fast and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Erin M Horlander"}, {"rating": 4.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Pamela A. Mitchell-Wagner"}, {"rating": 5.0, "review": "It is performing exactly as described and so far I'm very satisfied with it.", "verified": true, "helpfulness": "0/0", "author": "Gregory King"}, {"rating": 5.0, "review": "Received this as a birthday gift from my girlfriend excellent product would recommend to everyone if you watch a lot of movies or shows.", "verified": true, "helpfulness": "0/0", "author": "Nick Benty"}, {"rating": 2.0, "review": "I was so excited to try this product because the price was excellent. It worked fine the first 4 hours then it became a nightmare. The sound went out and I spent forever trying to find a number to call for help and an additional hour on the phone with tech service trying to regain the sound. Out of frustration I returned the item. Very disappointed. Ended up buying ROKU, so far so good.", "verified": true, "helpfulness": "0/0", "author": "Rosalie Kruse"}, {"rating": 5.0, "review": "Great addition for our Amazon Prime membership.  Easy to use and easy to navigate through the menus.", "verified": true, "helpfulness": "0/0", "author": "Vaughn Family"}, {"rating": 2.0, "review": "I love the idea of it but my internet and the fire stick need to figure out their connection. It's ridiculous watching a show and having it cut in and out for the entire length of it.", "verified": true, "helpfulness": "0/0", "author": "Natalie Mayan"}, {"rating": 5.0, "review": "This is a great product.", "verified": true, "helpfulness": "0/0", "author": "Marcus McDaniel"}]