[{"rating": 5.0, "review": "Increadible", "verified": true, "helpfulness": "0/0", "author": "Diego Soto"}, {"rating": 4.0, "review": "I'm really happy I bought the Fire TV Stick. There are a few negatives, though, so I deducted one star. The type is too tiny on the screen to read from my couch. I'm a Prime member and I'm disappointed in the selection of free movies/TV offered by Amazon, so I use the stick mostly with Netflix. And the remote is too small. I keep losing it! (I don't have this problem with regular size remotes.) Other than these things, I have to say that this was a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Sofie"}, {"rating": 5.0, "review": "Wonderful! It was very easy to set up, a nice tutorial that was good to watch, and it even came loaded with my prime/ Amazon information already to go. I cant wait to start using it more.", "verified": true, "helpfulness": "1/1", "author": "Ariel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "John Romero"}, {"rating": 2.0, "review": "Dont understand why they are showing prices if i have prime", "verified": true, "helpfulness": "0/0", "author": "Noemi Guerra"}, {"rating": 2.0, "review": "When I first received my Fire TV Stick, it worked great.  It worked as well as a Roku that I also have on another TV.  I have been using the Fire Stick for about 6 months now on a TV that is not frequently used.  Despite the limited use, the Fire Stick is nearly useless at this point as the WiFi seems to be failing.  It constantly loses connection and often fails to reconnect to my home network.  My Roku has been running for almost 2 years on a TV used frequently and still works great.  My suggestion would be to skip the Fire Stick and get a Roku.", "verified": true, "helpfulness": "0/0", "author": "JSimmons"}, {"rating": 5.0, "review": "Super easy to set up. Great interface. Much better then a chrome cast", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Very good better as Roku", "verified": true, "helpfulness": "0/0", "author": "Donaldo Guevara"}, {"rating": 5.0, "review": "Better than Roku", "verified": true, "helpfulness": "0/0", "author": "GBNP"}, {"rating": 5.0, "review": "Awesome....", "verified": true, "helpfulness": "0/0", "author": "Kevin M Carey"}]