[{"rating": 5.0, "review": "No problems setting it up. The picture on the TV is sharper than it normally is.  I like it a lot better than another brand I own.", "verified": true, "helpfulness": "0/0", "author": "Craig H."}, {"rating": 5.0, "review": "Works great! My only issue is I don't have enough HDMI ports and will need to pick up a splitter.  Otherwise it is highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Michael Demski"}, {"rating": 5.0, "review": "Works just as well as the fire tv and I would have bought this instead if available at the time.  In any case it is nice for a second or third tv.", "verified": true, "helpfulness": "0/0", "author": "SkoryJ"}, {"rating": 3.0, "review": "Very nice and easy set-up out of the box. I was able to watch three episodes of Key and Peele without any issues. However, once I switched over to Penn and Teller's BS, the video would freeze at 0:00 and wouldn't resume no matter what. Very disappointed with it's performance. Hopefully it's just an Amazon prime issue but that still doesn't give me any confidence about this device. Back to Chromecast for me.Edit: I ended up rebooting the device a few times and that ended up fixing it. Not sure why it refused to play any videos because the internet was still working and navigating the video catalog properly.", "verified": true, "helpfulness": "1/1", "author": "Jason Stade"}, {"rating": 5.0, "review": "If you have a Prime subscription, this is a no-brainer.  I did get it at the special $19 price, but it's worth retail.  We love tv, but couldn't justify the satellite bill anymore, so we cut the cord a few months ago.  We have an HD antenna, already had Prime, added a Hulu subscription, and bought a Roku stick.  With three tv's in the house, and one of them being a smart tv, we hadn't planned on buying anything else.  In the meantime, we realized our \"smart\" tv freezes up enough to be annoying so we usually wind up plugging the roku into it and just move it around to whatever TV is most convenient.  When this deal came up, we jumped at it - now I wish I'd bought the limit of two so I could keep it on the smart tv and not bother with the built in tv apps.  I love the home screen on this better than the roku as it already immerses you in Prime instead of a generic home.  I haven't really tried many other features/apps/games as Prime and Hulu meet our needs.  There is also little delay in pausing/unpausing and play continues while you rewind or fast forward.  While we have no complains with the Roku, we now would choose the fire stick over it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Plugged it in and it worked!  We now have Amazon Prime on all of our televisions plus I love having the Plex app as well so I can stream all of the video from my PC to my living room.  The coolest feature had to be though that it was already setup with my user account info when I plugged it in.  Love that extra bit of service from Amazon!", "verified": true, "helpfulness": "0/0", "author": "Robert Guyer"}, {"rating": 5.0, "review": "Great price and work like a charm.  The only draw back is the fires tick required a constant power supply", "verified": true, "helpfulness": "0/0", "author": "Tinh T. Phan \"TinhMan\""}, {"rating": 4.0, "review": "Pretty good device. I would recommend it for a small easy to use streaming player. While there are many, many different types of streaming players out there this one gives you full access to your prime membership.", "verified": true, "helpfulness": "0/0", "author": "Andres M."}, {"rating": 3.0, "review": "It has a lot potential, but also does quite a few simple things wrong to annoy the consumers.1. Why can't you have the power cable plug at the end, instead of on the side, in the way of other power cord or plugins2. Relying onscreen menu to do configuration and search is soooo yesterday.  Very user unfriendly.  In this aspect, Google got it right.3. Documention is spotty.  You claim YouTube is supported, in the demo video is there, but not on my stick.  I had search online and manually install itThe good things include all the Prime videos, support of Netflix, ESPN, Showtime app, etc.  And games.", "verified": true, "helpfulness": "1/1", "author": "EZ rider \"gadget guy\""}, {"rating": 5.0, "review": "Works very well.  The picture quality is excellent.  It's the first steaming gadget that I have owned which actually produces a high definition picture.", "verified": true, "helpfulness": "0/0", "author": "William A. Ruzin"}]