[{"rating": 5.0, "review": "Purchased this when it was special pre-deliver priced. And I had been using Google TV for Netflix and Amazon - thru the Sony BD player that originally introduced Google TV. I was one of those early adopters. Well, I absolutely love this Firestick. So so so much easier to navigate than the remote that came with the original Sony Blue Ray box. That remote was so \"uncomfortable\" to use - actually it was more a chore. The Firestick is so much easier to use and the navigation between the various apps is easy and smooth. I do not use the Sony Google TV box now - only for watching Blu Ray DVD's - but otherwise, PBS, Netflix, Amazon Prime - it's the Firestick!", "verified": true, "helpfulness": "0/0", "author": "J. Hovey \"joho\""}, {"rating": 4.0, "review": "Love the device and pretty much everything about it.  I am ONLY disappointed that it must be plugged into an AC outlet with a cord that attaches to it.  I knew this when I ordered it but for some reason I thought that would only apply to low end TVs for some reason.  The AC cord looks a little funny but all in all it isn't that bad a solution and it CERTAINLY is better than a huge box under your TV.  The product works well and I like having access to all of my amazon content.If they could find some way to make the power cord go away or at least become slightly more elegant it would be an EASY 5.  I am very tempted to give it one now.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Englebrecht"}, {"rating": 3.0, "review": "I got as a gift. It is okay but wish there was more in it. I have a smart tv so I have some of the features that come on the fire. My biggest grip is I wish there were better free movies or shows on prime to make the stick beneficial.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'm only giving a three for now. I got it for Christmas and positively love it. However, the past few days, it's been freezing up. I will post again once the issue is addressed and resolved with Amazon.", "verified": false, "helpfulness": "0/0", "author": "Dundnaugh"}, {"rating": 5.0, "review": "It is easy to work and the choices are plentiful.", "verified": true, "helpfulness": "0/0", "author": "barbara a. wilford"}, {"rating": 4.0, "review": "I too bought this on the first day it was availed for pre order. I got this nice little device for $19 but would have bought it for the listed price. We still use our kindle fires to watch movies most of the time but being able to put it on the big screen sometimes is ju", "verified": true, "helpfulness": "0/0", "author": "Laurel McFarland"}, {"rating": 3.0, "review": "I felt like there was some false advertisement. You actually have to hook it to a power source, which NONE of the ads show. If I had known that, I wouldn't have bothered ordering it. It is mostly exactly the same as my ROKU, except it is smaller.I'm not blown away by any means.", "verified": true, "helpfulness": "0/0", "author": "E. A. Lee \"\"I cannot live without books.\"\""}, {"rating": 5.0, "review": "Very fast compared to the roku stick. Very satisfied. Interface could use a little bit of work but overall very good especially if you got at $20 price.", "verified": true, "helpfulness": "0/0", "author": "Tedla"}, {"rating": 5.0, "review": "Great product, easy to set up and convenient to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Disapointed with Kodak\""}, {"rating": 4.0, "review": "My only complaint is the remote control cover was hard to remove to install the batteries. Otherwise love it. No issues. Took less than 5m to hookup.", "verified": true, "helpfulness": "0/0", "author": "Happy"}]