[{"rating": 5.0, "review": "Works as advertised. No difficulties. Highly recommended if you have Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Hutton"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Darin Hahn"}, {"rating": 1.0, "review": "This product is joke. It will only buffer about 25% of a program or movie, play for about 2 minutes, then have to buffer again (another 25%), play for a couple of minutes, then start all over. This is the same for Netflix, Amazon Prime, HBOgo, etc. (All of which I subscribe to.)  It keeps telling me that it can't connect to my wireless system, although when I check the connections everything is fine--and my signal is strong. It won't hold my settings, either. I can't find anywhere on Amazon's site to talk to tech people for help, which is even more frustrating. I even bought a second fire stick, but may send it back since the first one is worthless. I have a Roku 2 which works fine, so I know it has nothing to of with my wireless connection. My recommendation: don't waste your money on this cheap piece of junk. I don't think I'd even pay for the more expensive Amazon Fire products. My bet is they are just higher priced junk. Stick with Roku.", "verified": true, "helpfulness": "0/0", "author": "Susan Ray"}, {"rating": 5.0, "review": "Great product..", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Olszewski"}, {"rating": 5.0, "review": "Even with all the channels I have access to with Direct TV, sometimes there is just nothing worth watching.  Flip over to the Fire TV Stick and can always find something.", "verified": true, "helpfulness": "0/0", "author": "Jesse J. Benson \"Ford guy\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa Best \"LizaJane\""}, {"rating": 1.0, "review": "Bought this product less than 6 weeks ago and it has already stopped working. I think will will stick with the ROKU and not waste my money again. Apparently one of the prongs has broken and this is common problem. Poor manufacturing.", "verified": true, "helpfulness": "0/0", "author": "David Hamilton"}, {"rating": 5.0, "review": "I bought this for my mom. It was very easy for her to set up and use and she is not very technically inclined", "verified": true, "helpfulness": "0/0", "author": "Steve Monchak"}, {"rating": 5.0, "review": "it's all good", "verified": true, "helpfulness": "0/0", "author": "Michael Kern"}, {"rating": 5.0, "review": "Great device, increased my TV capabilities tremendously.", "verified": true, "helpfulness": "0/0", "author": "CF"}]