[{"rating": 5.0, "review": "Great unit, better than expected", "verified": true, "helpfulness": "0/0", "author": "Viper"}, {"rating": 2.0, "review": "Very slow I have a chromcast and its it faster.! And your phone is your remote.! It is very simple.! It was so hard to navigate around fire stick TV.! Chrome cast is simple fast and easy", "verified": false, "helpfulness": "0/0", "author": "Aaron Andrews"}, {"rating": 3.0, "review": "I love the layout and the fact that it seems to find more and better suggestions I Netflix and Amazon. My only and biggest issue with it, is that it buffers a lot. No matter your WiFi speed. There is a software issue that Amazon has not fixed yet. Because of it, I went back to my Roku set up and am much happier.", "verified": true, "helpfulness": "0/1", "author": "Enrique C."}, {"rating": 3.0, "review": "very slow, not a lot of free stuff.", "verified": true, "helpfulness": "0/0", "author": "Gerrywalton"}, {"rating": 5.0, "review": "I like", "verified": true, "helpfulness": "0/0", "author": "shawn williams"}, {"rating": 5.0, "review": "Provides quick convenient access to a multitude of apps. Very easy to install & navigate", "verified": true, "helpfulness": "0/0", "author": "LN B"}, {"rating": 5.0, "review": "Nice streaming addition. Use Xbox, TV apps, and a chromecast and the Fire seems to work the best. Better reception and less buffering than all except the xbox. Nice game apps for the kids.Also, allows us to use an existing tv remote with almost no problems.", "verified": true, "helpfulness": "0/0", "author": "Anonymous \"ADF\""}, {"rating": 5.0, "review": "My family and I love it.", "verified": true, "helpfulness": "0/0", "author": "Shawnna"}, {"rating": 5.0, "review": "Perfect for putting on my toddler's favorite shows through Netflix for our TVs that are not smart tvs", "verified": true, "helpfulness": "0/0", "author": "Laura F."}, {"rating": 1.0, "review": "Pathetic performance. All my other devices connected to wifi works perfectly. This one drags like a snail. I tried disconnecting all other devices and tried to run only Fire stick. Still the same issue. I tried for weeks, but all day it is same. Will not buy again or recommend to any of my friends.Is there a way I can put 0 star? :)", "verified": true, "helpfulness": "0/0", "author": "Joey T Man"}]