[{"rating": 1.0, "review": "I use an antenna for TV reception and the installation of the Fire TV Stick causes problems with reception.  I am returning.", "verified": true, "helpfulness": "1/3", "author": "Henry Jeske"}, {"rating": 5.0, "review": "Love it! didn't really get to play with it that much, but yes, easy set up. I already of course have Prime and Netflix. Cool to know that you're able to play games(w/add'l equipment), and pix and music as well. I got one for my sister who hasn't rec'd hers yet. sure she'll like it as well.", "verified": true, "helpfulness": "0/0", "author": "monica"}, {"rating": 3.0, "review": "I have not spent much time with the device yet, so I might come back and modify my review once I get some more time with it.First experience:  I had to enter my network password 3 times!  The first time makes sense.  It's the first time I used it.  After firmware updates, I had to input each time.  This was not fun to type everything in.I watched some TV shows and part of a movie using Amazon's streaming service.  This worked well.  Good picture quality.Next, I set up Netflix.  This was not a good experience.  I don't know if it was the stick or Netflix.  When I was using the remote control to change selections in Netflix, I was not getting any response.  After a few minutes, it would suddenly go crazy as if it had queued up all of my movements with the remote.  This made it impossible to watch a movie.  I couldn't even hit the Home button to abort it.  I hope this is something a software update can fix.I did not try Hulu Plus yet.  Will see if I can get that working later.I don't think the iPhone app for this is out yet.  The intro video said it's coming soon.  We lose remotes at our house, so I am looking forward to the app.", "verified": true, "helpfulness": "0/0", "author": "Steakman"}, {"rating": 4.0, "review": "I have a weak connection to the wifi in my apartment and this works better than my Xbox or PS3 to watch Hulu or Netflix. Came loaded with my account info so there was very little set up.", "verified": true, "helpfulness": "0/0", "author": "Rian Guy"}, {"rating": 5.0, "review": "Glad I don't have to use my PS3 anymore.. works great, super fast.", "verified": true, "helpfulness": "0/0", "author": "Justin Meyer"}, {"rating": 5.0, "review": "So far this thing is great!!! Easy to set up, and very easy to use. The picture is crystal clear, and the speeds are fast. Very happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "Melisa McCoy"}, {"rating": 5.0, "review": "This Fire TV Stick works great and simple to use. Bought this as an Amazon Prime member so device is already registered and linked to my account.  Once set up, it is fast and easy and intuitive to use. It is a great gateway device to get access to the Amazon ecosystem. We now have access to all the free Amazon Prime movies and TV shows in HD; all the musics and movies we bought from Amazon; and may be all the Kindle books we bought. We move it from one TV to another TV to use it. This is what AppleTV should be.I have some initial problem setting up the device. I hooked it up to the TV and keyed the WIFI password in around 6 pm on November 24.  It connected to the Amazon server and tried and failed several times to update its software.  I rebooted the device several times by unplug the power adapter and still failed to update. I unplugged the device for an hour.  Around 8 pm, I connected and powered up the device and it successfully update its software in one try. Perhaps the server is busy early on with so many users try to update. Once set up, easy to use or move around.  Beautiful device.", "verified": true, "helpfulness": "0/0", "author": "Truc Hoang"}, {"rating": 4.0, "review": "I also own a Kindle Fire HDX-32 7\" and the original Fire TV.The good: the TV Stick installed quickly and seamlessly (after I unplugged it from the power once after initial installation).The bad/unknown:- I looked at the games on the Fire TV stick, and thought that Mystery Case Files: Return to Ravenhearst (Full) would be interesting to try. I have played a number of the \"Big Fish\" games on the 7-inch Fire HDS-32 tablet, and enjoy them. But, on the Fire TV Stick, the included hand controller seemed almost impossible to use. I was used on the tablet of being able to pinch to enlarge most of the hidden object games, but there seems to be no way to do that on the Fire TV, and worse, the use of the circular movement button for up/down/left/right in the same hidden object sections was very coarse. Rather than being able, mouse like or using your finger on a touch screen, to go to any spot on the screen, when you pushed the right button, the cursor took very large leaps. The first puzzle I was never able to complete, even after \"gridding\" the entire screen (start upper left - select - move right - select - repeat to right edge - move down - select - move left to left edge of screen - repeat to bottom of screen. I think there were objects there, but I wasn't able to touch them.", "verified": true, "helpfulness": "0/0", "author": "Carol and Al baker"}, {"rating": 4.0, "review": "Overall, this is a very good product.  I have been using a chromecast for several months now and when this was announced, I jumped at the chance to purchase it.  While it is very similar to a chromecast, this has several major advantages over the chromecast.  First, it can obviously play Amazon Instant Video.  Yes, there are workarounds to get AIV to play using a chromecast, but having something that easily plays TV shows and movies from AIV is a clear plus.  Also, to me, having a physical remote is a huge advantage.  Having spent countless hours watching Netflix on the chromecast, I can say that the Netflix app can be very frustrating to use when you need to quickly pause, rewind, etc. whatever you are watching.  On multiple occasions, the app would not show the chromecast icon to be able to pause the show that I was watching.  While this is not directly a fault of the chromecast, not having a dedicated remote can make it more difficult to use.  The remote that comes with the Fire TV stick is very easy to use and makes pausing or rewinding of shows much easier to do.With all that being said, the Fire TV stick is not perfect.  On multiple occasions, the shows that I am watching with the Fire TV stick have had to pause to buffer or the picture quality has dropped.  While this could easily be chalked up to the wifi speeds, I have never had this same issue with a chromecast.  Also, there is not an easy way, at least that I have found so far, to turn off/put the fire TV stick to sleep when it is not in use.  Because it needs to plug into an outlet instead of being able to plug into the TV like a chromecast, it does not turn on and off with the TV like a chromecast does.  Finally, it seems like you are not able to search for new music using the Fire TV stick while using Amazon Prime music.  You can easily play songs that you have already added to your favorites, but you cannot search on the stick for new music to listen to.  Some of these issues can easily be fixed with software updates, and hopefully they do.  But even with these issues, I would still recommend this to anyone.", "verified": true, "helpfulness": "1/1", "author": "Chris Floegel"}, {"rating": 5.0, "review": "Love it! ... Can't wait for the iOS app to come out", "verified": true, "helpfulness": "0/0", "author": "Michael Langner"}]