[{"rating": 3.0, "review": "AppleTV is still the mac daddy of all web TV hands Down!", "verified": true, "helpfulness": "0/0", "author": "Asim Badar"}, {"rating": 5.0, "review": "A++++", "verified": true, "helpfulness": "0/0", "author": "Rick aqui"}, {"rating": 5.0, "review": "It works great! It was easy to set up and start use! My family is really enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Christy Curtis"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not wasting my time on this product any longer.  Stick overheats and loses network connection.  Replacement stick has same problem.", "verified": true, "helpfulness": "1/1", "author": "Tim Wiegand"}, {"rating": 5.0, "review": "This was a great tool to get the APPS my TV did not support. I recently got notification that my Vizio DVD which is becoming outdated will no longer support Amazon Prime Movies. So this Fire TV Stick was the perfect solution. I can keep my DVD player which works great and still get all the APPs it supports and tons more!  Great investment! Take it on the road with you and watch whatever you want.", "verified": true, "helpfulness": "0/0", "author": "HairyBerries"}, {"rating": 4.0, "review": "I bought this to stream Netflix but after I installed it I read the reviews rating the Fire Stick and Netflix, which were horrible. Instead I use it to watch Amazon Prime, which I love.  One other problem with the Fire Stick was it arriving with German as it's default language.  Customer service at Amazon walked me through re-setting it and then I was able to change to English.", "verified": true, "helpfulness": "0/0", "author": "JoanneB"}, {"rating": 5.0, "review": "I bought this on a whim mostly because I wanted to be able to stream videos through Amazon without using my xbox live.  Boy am I glad that I did.  This fire tv stick has exceeded every expectation that I had.  I now have 3 of them for each TV in my house and I bought my mom one as well.- Easy and quick set-up- Plugs easily into any HDMI input.- Comes with HDMI extender just in case you need this- Can easily stream from many different sources such as Hulu, Netflix, and Amazon prime, of course- Menu just for Prime content so you can easily see free movies etc", "verified": true, "helpfulness": "0/0", "author": "Evan Jo"}, {"rating": 5.0, "review": "I can sum it up quickly.  I love it.", "verified": true, "helpfulness": "0/0", "author": "prewby"}, {"rating": 5.0, "review": "Super!!", "verified": true, "helpfulness": "0/0", "author": "Phaniraja"}]