[{"rating": 4.0, "review": "Very happy with it. The menu is large and takes a little while to get used to navigating it, but not a game changer. Lots to do and explore. After I purchased and received its now $5 off, kinda ticks me off!", "verified": true, "helpfulness": "0/0", "author": "Big RWD"}, {"rating": 5.0, "review": "it's ok for now", "verified": true, "helpfulness": "0/0", "author": "Elena"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is great!  It is easy to installand adds a great dimension to our TV watching.  Weuse it with a 64 inch Sony TV.", "verified": true, "helpfulness": "0/0", "author": "Lawrence D. Ziegler \"Zig\""}, {"rating": 3.0, "review": "I loved it at first, but now, since using it for a month, it heats up and then boots me out of whatever program I'm watching! Maybe I got a defective one, I'm sending it back for an exchange...we'll see.", "verified": true, "helpfulness": "0/0", "author": "Pearl Mayer"}, {"rating": 3.0, "review": "okay not as good a Roku or apple TV", "verified": true, "helpfulness": "0/0", "author": "Edward J. Monahan \"EJM\""}, {"rating": 5.0, "review": "Works great, love the remote app for Iphone! Should get a $5 credit though, bought it for $39 and two days later amazon is selling for $34...", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 1.0, "review": "I would give this negative stars if I could all it does is freeze up, so I got a different one and changed my wifi to a better version. Both of them would freeze up. DO NOT BUY!!", "verified": false, "helpfulness": "0/1", "author": "Brody Stroup"}, {"rating": 4.0, "review": "As others have pointed out, the font size is quite small. I have it plugged into an 18-inch TV in my bedroom, so sitting back in bed, I can barely read what's on the screen. However, the system is pretty easy to navigate, so once you get used to where the \"play\" buttons are on the menus, it's not that big of a pain to navigate. The only other downside of the Fire Stick, as a hockey fan, is NHL Gamecenter is not one of the apps provided. Other than that, I absolutely love the Fire TV Stick. It works great with my internet connection and rarely ever does a movie need to pause to buffer (at least no more often than the Sony Blu-Ray DVD player with wifi hooked up in my living room does).I'm docking a star for the small font and lack of Gamecenter (an app at least my Sony Blu-Ray player offers). If you already pay for Prime, I'd definitely recommend this. I've had mine for about two months and still love it.", "verified": true, "helpfulness": "0/0", "author": "Alena"}, {"rating": 2.0, "review": "Let me start off by saying how excited I was to buy this. I don't really like watching tv on my phone or laptop because I get distracted. I much prefer watching it on a big screen. The Firestick is something I've had my eye on for months and finally bought. I've only had it for 2 days, but both days I've encountered problems. It started off working fine but after a short while on both nights I went to use it, it stopped connecting to my wifi. My phone was still connected, so I knew that the Internet wasn't the problem. Tonight I restarted it a half dozen times and it did nothing. After an hour of wasting my time, I'm giving up.  I unplugged the stick from the back of my tv and noticed it was quite warm, so I don't know if it's an overheating problem or what. But overall, I'm extremely disappointed. I'm giving it two stars for now because I have seen it work for short periods of time and I haven't had it that long. However, if it continues with these problems, I'm going to have no choice but to return it.", "verified": true, "helpfulness": "2/2", "author": "Paula"}, {"rating": 3.0, "review": "I was fired up about using this, but the USB unit doesn't utilize an ethernet connection for s streaming, which results in streaming interruptions. I returned the unit and used a blu-ray player instead, and there aren't any interruptions.", "verified": true, "helpfulness": "0/0", "author": "Bob Justman"}]