[{"rating": 5.0, "review": "This was a gift. we started watching movies we hadn't seen. There is many to select from. So much better than some of those old tv reruns.", "verified": true, "helpfulness": "0/0", "author": "C A."}, {"rating": 5.0, "review": "Being an avid Apple TV fan, we were a little hesitant to invest in the Fire Stick...especially because all of our Samsung Smart TVs already offered the same access to Amazon Prime Movies/Shows via their app (and without having an extra remote).  Don't get me wrong...we love Amazon Prime (especially their programming shows...can't wait to see which pilots are selected...And we LOVE Tumbleleaf for the kids).  But we have been investing in our Apple network & Apple movie / TV collection for years and years.However, after solidly watching all of our programming via the Fire Stick (setup was a snap & Amazon sends it already loaded with your account information!!), getting a Harmony 650 remote (which unofficially works with the Fire Stick when paired with a Samsung TV), utilizing Amazon's Fire Stick remote app from our iPhones and with the recent amazing addition of Sling TV, WE ARE TOTALLY SOLD!  The stick does an amazing job of staying connected to our wifi at the highest HD level (the volume alone is much higher quality than streaming Amazon Prime off the Samsung Smart TV) and is just simply put, easy to use!  The price point doesn't hurt either!  :DSo, when we expanded our TV collection in our home (by purchasing another TV for the basement), we skipped purchasing the Apple TV and opted for another Fire Stick instead!  Happy with our choice!", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 4.0, "review": "Like this item but the amazon prime movies could be better", "verified": true, "helpfulness": "0/0", "author": "Jonathan Avey"}, {"rating": 5.0, "review": "I love it! It's such a unique device! I don't even need cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Trina Crowder"}, {"rating": 5.0, "review": "Good staff", "verified": true, "helpfulness": "0/0", "author": "manuel paul"}, {"rating": 1.0, "review": "I will be able to review it better after I have had a chance to use it more.  So far so good.", "verified": true, "helpfulness": "0/1", "author": "Edward A. Teats"}, {"rating": 5.0, "review": "i was unsure of the fire stick but after doing some reasearch, I ordered this thrust another store.  Amazon was out of stock and I did not want to wait.  Got the fire stick, plugged it in, had trouble with getting the batteries in and then.....I was really really impressed.  My sister saw it and ordered it.  I do really like this product.", "verified": true, "helpfulness": "0/0", "author": "TyBee"}, {"rating": 3.0, "review": "I am using it for Netflix and Hulu. No where on the packaging nor on the display was it notes that Amazon Prime which almost all of the viewing choices are is required, nor was the cost.", "verified": true, "helpfulness": "0/0", "author": "Sharon R. Gailey"}, {"rating": 1.0, "review": "the navigation isnt easy. Slow. not the apps I was hoping for.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 1.0, "review": "It freezes up and losses connection frequently. And the remote quits working days after I purchase it", "verified": true, "helpfulness": "0/0", "author": "Jessica Kraus"}]