[{"rating": 5.0, "review": "Great item, more than I expected!", "verified": true, "helpfulness": "0/0", "author": "Victoria Sanchez"}, {"rating": 3.0, "review": "I was expecting more current free movies.Can it be used with my iPhone?", "verified": true, "helpfulness": "0/0", "author": "Daniel Marranzino"}, {"rating": 4.0, "review": "I am not a techie but the most difficult part of installing the stick was getting the cover off the remote to put in the batteries.  It isn't perfect but it is pretty close and at a reasonable price.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Toni W."}, {"rating": 5.0, "review": "Yes!This is great! i really like it. And with the Prime Membership, it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Edith"}, {"rating": 1.0, "review": "Fire TV Stick - A Not Ready For Prime Time PlayerThis is a great concept if it would only work! I am a big Amazon supporter and Customer, so not Amazon Bashing here, but this Fire TV Stick has serious problems and needs lots of refinement. I purchased two (2) of these thinking that the issues with GEN 1 Release were fixed NOT! Amazon should be ashamed of themselves for putting this prematurely into the marketplace.I cannot advise or recommend this product purchase to anyone. I have given this a 2 week review trial period and will probably return this product for a refund.My Network CAT and Wireless Network is sound and all connected devices work properly.  As others have reported this product has the following issues.1. Numerous Dropouts and disconnects. On-screen error messages are cryptic and often in conflict with other messages2. A Not so great User Interface that is simple, but yet clunky and without some needed features.3. The Remote is Cheap4. Amazon Support for this product - NONE! If you experience problems you basically are on your own. A Forum is not proper help/support for this type of product. Amazon has a nice On-Line \"Mayday\" help outlet for their HDX Fire Tablets (I have One) but none here that I have found.I have no way of telling if I received a defective product, or if this is the current standard and level of quality and performance for this latest revision of this product.", "verified": true, "helpfulness": "0/0", "author": "Scooter"}, {"rating": 3.0, "review": "I have the Roku Stick and thought I would give the Fire stick a chance, especially since it costs less.I like the Fires Stick and it is very functional, however, compared to the Roku Stick it lags channels like Nowhere TV which allows you to get your local TV channels. Generally said the Fire Stick has quite a few less channels than the Roku. I love Amazon but not the Stick.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 5.0, "review": "So far, works great....easy set-up as a Prime member. No negative issues.", "verified": true, "helpfulness": "1/1", "author": "Laura Rusk"}, {"rating": 5.0, "review": "Works great, about 3 times faster than Apple TV 2 when using Kodi, no hiccups.", "verified": true, "helpfulness": "0/0", "author": "G. Gabrillo \"Neogerald\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Bill Meyer"}, {"rating": 5.0, "review": "Bought as a gift, and my parents loved it!", "verified": true, "helpfulness": "0/0", "author": "VaKnight 98 \"Over-researcher\""}]