[{"rating": 5.0, "review": "Really nice and easy to use.j", "verified": true, "helpfulness": "0/0", "author": "Betty J. Freeman"}, {"rating": 5.0, "review": "Love it!  Music is great, movies and TV have a lot to choose from.", "verified": true, "helpfulness": "0/0", "author": "Robert White"}, {"rating": 4.0, "review": "Still trying to get use to all the options.", "verified": true, "helpfulness": "0/0", "author": "James C."}, {"rating": 1.0, "review": "Unless it is right up against the router it won't pick up the Internet connection? I keep getting a network connection loss message, it wavers in and out. I was actually very excited to try this out to be able to watch Amazon Prime, and Netflix, in my bedroom. However,  the wireless router is two rooms down, and while all other internet connections appear to be working, this will not. (I can even watch on my iPad in my room, while the fire stick can't make internet connection.)", "verified": true, "helpfulness": "0/0", "author": "B. J. Hocke \"Book Maven\""}, {"rating": 5.0, "review": "Replaced a Roku stick with the Fire stick.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Linda L"}, {"rating": 5.0, "review": "a really great experience", "verified": true, "helpfulness": "0/0", "author": "David Tortorich"}, {"rating": 5.0, "review": "PERFECT TO ANY TV HAVE THE FIRE BOX PUT THE STICK IN MY BEDROOM LOVE THESE ITEMS", "verified": true, "helpfulness": "0/0", "author": "Valerie Steele"}, {"rating": 2.0, "review": "Great idea and when it works it's a 5, but have had trouble from the start", "verified": true, "helpfulness": "0/1", "author": "Patty Reed"}, {"rating": 5.0, "review": "Bought this for my daughter's tv and it gets used daily. Her world would be crushed if anything happened to it. She's used daily since February and haven't had a problem at all with it. Would recommend this to anyone that doesn't have a smart tv and wants to be able to watch Netflix, Amazon Prime, etc.", "verified": true, "helpfulness": "0/0", "author": "Jeremy S."}, {"rating": 4.0, "review": "Very good device for the money. Probably the best streaming device around, especially in the price range. I do not see the appeal of chrome cast for my purposes (the Fire Stick does support casting too though!), I wanted a stand alone device with a designated remote. It basically turns your TV into a smart TV, but with MUCH better user interface. Our TV does have some smart TV capabilities, but it's tedious to use and cannot utilize all features.Why I only gave it four stars, might be the same reason people give it a full five stars. The UI is very Amazon content centered, many of the menus would be useless without having Amazon Prime, or had purchased some Amazon media. I did end up getting prime, the Fire TV was definitely a factor, and the original prime content, along with some of the HBO shows offered.As for side loading, it is pretty easy, but accessing the content takes a few menu selections (or alternative UI).Sideloading Kodi works well,and an older version of slacker radio works too. I have not experimented with games, I have a different device for gaming.Ultimately this is the best TV media device for the money, it's not complicated, but it can be modified.Sidenote: I have it plugged directly into the TV for charging and it has been completely fine", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]