[{"rating": 5.0, "review": "It's amazing.  I bought a Roku at the same time (deciding which one to give my mom for Christmas) - Running Netflix on the Roku was very sluggish like the processor couldn't handle it - on Amazon Fire Stick it's like buttah.  Not to mention Amazon has their own wonderful collection of movies and TV shows.  I was spoiled and pre-ordered it for $20 but for anyone out there looking for something that's fast and reliable go for the Amazon Fire Stick (or the Amazon Fire if you can budget it, I'm sure it works just as nice if not better).I was hesitant on trying an Amazon product for streaming content but I am more than satisfied and recommend it to everyone.", "verified": true, "helpfulness": "1/1", "author": "Brett"}, {"rating": 1.0, "review": "Was not very impressed with.", "verified": true, "helpfulness": "1/4", "author": "oertwich"}, {"rating": 4.0, "review": "I like my FireTV Stick very much. I have only had to reboot the thing a couple times in a couple months and really have not experienced issues like some of the other users. My reason for giving it 4 stars instead of 5 is the search function, it needs to search all my content not just the Amazon content. Other that that I have no real problems, it is night and day Faster the my Roku 3. Thinking about getting the full box and stick this on the spare TV.  Best $19 I ever spent...", "verified": true, "helpfulness": "1/1", "author": "Tim Crafton"}, {"rating": 5.0, "review": "We currently own multiple streaming devices (Rokus; Internet connected TV; Blue Ray player). Once we went to the Rokus a few years ago, I figured I would NEVER need any other device that does the same job. I really couldn't imagine how anything could be better than a Roku. I bought a TV for our second home that came with a Roku Stick and I thought WOW that is great (small package that works just like the black Roku box and is integrated into the TV remove).Then - Along came Fire TV Stick! To be honest I am glad I waited to rate the stick because at first I would like have rated it only 4 stars based on the fact it needs an external power supply and the Roku stick does not.Side by side, the Roku stick and the Fire TV stick are both awesome products. As I said, the Roku seems to get all the power it needs off your HDMI port and the Fire TV stick uses a USB power injector that needs an outlet nearby and thus a wire running to the stick. Ahhh.... after some reading, I found some users were able to get power from the existing USB port on their TV and thus they didn't need the power block in an electrical outlet, you just plug the big USB end into your TV's USB port and the little end into the Fire Stick. I understand this only works on newer televisions that have enough power coming to the USB port.Performance - Fire Stick runs circles around the Roku players I have and even (to a lesser degree) around the Roku Stick. The WiFi picks up stronger; it is dual band; and IT NEVER BUFFERS (once the program has started) even though my ISP seldom delivers anything close to the speed I am paying for. Even with other devices running in the house the programs playing on the Fire Stick just keep streaming with ease.It offers some features that aren't available on my Roku players (or I haven't found them) like if you are watching a series it will preview the upcoming episode in the bottom right corner as the episode you are watching is playing credits and then automatically start that episode with no user intervention. I use Netfix; Hulu Plus and Amazon Prime for the most part and they all run great on it.", "verified": true, "helpfulness": "2/2", "author": "Lester E. Snyder"}, {"rating": 5.0, "review": "I love that I can hit the home button when everything is off and it turns my tv and its self on. So easy to use and the HD is fantastic. Very, very happy with the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Adriane"}, {"rating": 1.0, "review": "Great idea however, no one seems to tell you that everything on the FIRE TV Stick comes with a price.Even old crap that runs on every cable channel in the known world! We could find absolutely nothing without a price on it.", "verified": true, "helpfulness": "1/2", "author": "Paul Dickinson"}, {"rating": 4.0, "review": "Very similar to ROKU for a lot less money. Fire TV has some extra features if you use it with a smart phone, that ROKU does not have.  However, as of this writing,  ROKU has more channels.", "verified": true, "helpfulness": "0/0", "author": "Mr. Fix It \"Mr. Fix-it\""}, {"rating": 2.0, "review": "The interface and app selection are great. Unfortunately, it just doesn't work. I have constant connectivity issues and have confirmed it's not my network. I have also followed the troubleshooting guidelines and that didnt work either. I have no problems with my google chrome and my apple tv. My mom has the Amazon fire tv box version and that works well so I think the issues are specific to the stick.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I do enjoy the Fire Stick, I also have a Chromecast, but decided to try Fire Stick because of the remote option. I got tired of having to get my phone or tablet to rewind or do anything with the chromecast. I still love the chromecast though.  This does what it is suppose too and is very speedy as well.  I'm just waiting for some streaming apps it's lacking at the moment, such as HBO Go, but I hear it will be present in the future.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "LOVE LOVE LOVE my firestick. Dont know what I have done without it all this time !!!", "verified": true, "helpfulness": "0/0", "author": "fla girl"}]