[{"rating": 3.0, "review": "I love the concept, but it does not show a good picture.  I am use to HD", "verified": true, "helpfulness": "0/0", "author": "Yvonne Swanson"}, {"rating": 1.0, "review": "Nothing but problems with this product since day one. Connection is shotty at best - programs freeze, constantly buffer for long periods of time, and Spotify has pretty much stopped working all together. I'm sending this back and getting Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Malyce"}, {"rating": 4.0, "review": "I wish iphone mirroring was easier", "verified": true, "helpfulness": "0/0", "author": "Phineas Kirsch"}, {"rating": 5.0, "review": "We canceled our cable services bought TV antenna to get local channels and haven't looked back we are enjoying our fire sticks", "verified": true, "helpfulness": "0/0", "author": "cassandra conyers"}, {"rating": 3.0, "review": "Would be nice if it had more streaming live channels", "verified": true, "helpfulness": "0/0", "author": "C. Volch"}, {"rating": 5.0, "review": "Very  easy to ienstall", "verified": true, "helpfulness": "0/0", "author": "C. Watkins"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Paul Riedell"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Nikkia Burton"}, {"rating": 5.0, "review": "It works so well I brought a second one for backroom", "verified": true, "helpfulness": "0/0", "author": "Shay"}, {"rating": 4.0, "review": "I love Amazon's Fire TV Stick and actually bought two. Initially I would have given the Fire TV Stick a full 5 stars, except now Amazon is inserting commercials into some Prime TV and Movie options. Commercials for other Prime choices isn't necessary, as there are plenty of ways to pick viewing options: The Prime Fire Stick menu, Amazon's Instant Video Page and My Prime drop-down box. Shoving Amazon original series' down my throat via commercials isn't going to encourage my viewing: it's actually a turnoff. But as of now the commercials are minimal, thus are not frequent enough to stop my enjoyment of the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Kristen Howard \"Literary Shark\""}]