[{"rating": 5.0, "review": "Great addition to cable TV, especially if you have an older flat screen that doesn't already have Amazon, Hulu and Netflicks already on the menu.", "verified": true, "helpfulness": "0/0", "author": "umberto314 \"Umberto Umbertino\""}, {"rating": 5.0, "review": "This is something a person with prime should have if they want to watch great movies without paying so much.", "verified": true, "helpfulness": "1/1", "author": "sonny reyes"}, {"rating": 5.0, "review": "This is wonderful works great since we moved to an area where we don't get cable, now we can watch netflix anytime we want to watch a movie!", "verified": false, "helpfulness": "0/0", "author": "Anitra Dubreuil"}, {"rating": 5.0, "review": "Love this thing. I like the interface much more than that of my Sony Blu-ray, and it leaves the Samsung Smart Blu-ray interface way behind. Fire Stick set-up is really easy, and the device tutorial is nice. There's so much stuff to explore on this thing... and I CAN LISTEN TO ALL MY AMAZON-BOUGHT MUSIC THROUGH IT! With captioned lyrics! I can finally stop mumbling through \"that part\" of the song, if you know what I mean. Only drawback: as far as I've seen, there's no Youtube app. Why, Amazon, why?!Eh, I still love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great little streaming device.", "verified": true, "helpfulness": "0/0", "author": "Rory Swan"}, {"rating": 4.0, "review": "We had issues with it at first because it would pause and \"spin\" often, but since we increased our internet speed, it seems to be doing better. I'm considering getting another one for another room in our house because it's such a great way to access apps to stream TV and movies.", "verified": true, "helpfulness": "0/0", "author": "E. Fearn"}, {"rating": 5.0, "review": "This little stick is better than sliced bread.  Don't know how we lived without it😀", "verified": true, "helpfulness": "0/0", "author": "Ruth Hewitt"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Daniel Adamiak"}, {"rating": 5.0, "review": "Excellent device with great performance. Nice remote.", "verified": true, "helpfulness": "0/0", "author": "Aakash"}, {"rating": 5.0, "review": "Needed teenage grandson help to finish setting it up.  Once he got it synced with TV it worked great.", "verified": true, "helpfulness": "0/0", "author": "small town girl"}]