[{"rating": 5.0, "review": "Have been enjoying it. Thinking of getting another one for my other tv.", "verified": true, "helpfulness": "0/0", "author": "carol patton"}, {"rating": 5.0, "review": "I'm glad I purchased the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"tip\""}, {"rating": 5.0, "review": "Easy to use. Works well", "verified": true, "helpfulness": "0/0", "author": "Steve  Wright"}, {"rating": 5.0, "review": "Honestly, if I would have known how identical the Fire Stick is to the Fire TV, I wouldn't have gotten both. 5 stars!", "verified": true, "helpfulness": "0/0", "author": "J. D. Nelson \"JD Nelson\""}, {"rating": 3.0, "review": "its okay", "verified": true, "helpfulness": "0/0", "author": "roijk"}, {"rating": 5.0, "review": "Very Fast!! With A Real Remote!! I'mvery impressed with the FireStick!!", "verified": true, "helpfulness": "0/0", "author": "bwise"}, {"rating": 5.0, "review": "I bought this for my parents who are in their 50's and they live it. It was very easy to set up, easy to connect, and the remote is easy to use. I have a chrome cast and I am now going to get an Amazon fire tv stick instead. The chrome cast works well but can get disconnected which makes it harder to pause or stop the show you are watching. With the Amazon fire tv stick the remote control allows for quick access to change or pause your show without waiting for your phone to connect back to it like chrome cast. My parents love it and I want one.", "verified": true, "helpfulness": "0/0", "author": "Meleah Hilton"}, {"rating": 4.0, "review": "Great! Wish there were more. Free movies", "verified": true, "helpfulness": "0/0", "author": "Aneliz"}, {"rating": 1.0, "review": "Doesn't have nearly the amount of newer movies that I expected. This is really for someone who wants to watch tv episodes or movies that are already available on tv", "verified": true, "helpfulness": "0/0", "author": "VINCENT MARELLA"}, {"rating": 1.0, "review": "It's a good idea, but it keeps losing the wifi signal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]