[{"rating": 5.0, "review": "Works great and much cheaper than Apple tv", "verified": true, "helpfulness": "0/0", "author": "EricaAndr"}, {"rating": 1.0, "review": "It sucks, when I stream movies it keeps freezing.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I really give it two and half maybe 3 stars since i bought two but so frustrating and disappointing just couldn't bring myself to do that.The fire stick needs a lot more work.  Avoid using extender It won't work it should come with connectors not extenders. ...won't work on some tvs unless device plugs straight into tvS HDMI PORT which may be difficult on some tvs where the port is IF ITS cramped you need the extender if you use it MORE THAN LIKELY IT probably won't work if it does you'll get a blue screen when you go to play a video giving you an error message. If you order connectors watch out for the inputs you may buy an angle that faces in the wrong direction depending on your TV the connector port may be with rounded portion up or down or on the side lol my husband and I almost died laughing getting this hooked up when we weren't all pissed off. My brother  broke a coffee table don't ask lolIn the end we just jammed the stick in back of the TV to never remove again or ports will fall out. Now a permanent fixture on my parents tv. Works great now unfortunately the software side or actual interface is not user friendly like Amazon has always been bad when it comes to organization on their devices.  Everything  looks cluttered on the display. If your parents aren't tech savvy they'll have a difficult time finding their favorite apps like Netflix and Hulu. They prefer their Roku 3 for streaming It's so easy to use;  my dad is 70 grew up in a time and place where he only heard of tvs and saw his first tv when he was twenty But he is able to use that roku like crazy he goes on you tube, Netflix,  Hulu, and on other apps with ease. It's really unfortunate the Fire TV Stick is a bit more complicated. They hardly use it.  :(In the process of getting this installed there was a time when we were going to return the thing so my husband and  I took it and tried it on our tv which is newer but still not that new and ran into the same problem with the extender. I got frustrated and said what the hell maybe it'll fit just got to get past the curve here and angle it into the hdmi port crossed my fingers and it plugged in with a little  pressure to get it past the tvs casing and into the hdmi port Do Not Do This  I need to buy a newer tv anyway so no biggie And it worked my husband and I used it we loved it we could mirror from our kindle 7 hdx without wifi or Internet and watch previously downloaded movies from amazon prime off our device on the bigger screen yay! We decided then to order one for us only for that reason since we decided to save $50 bucks a month and cancel our Internet. You just have to make sure your mirroring devices aren't picking up any other WiFi signals and you may need to POWER Off and on your tablet. Super delicate but being cheap is hard work.Mom's works, ours Works If you have older tvs where the ports are a little bit tight you are in for a headache...The extender is not an option it will not work well at least not on older cheaper flat-screen tvs. I have a Vizio I bought in 2011. Let me know if the extender works on newer tvs that's if you even need them but I'm curious if that extender will work with anything.Good luck!", "verified": true, "helpfulness": "1/1", "author": "Lu"}, {"rating": 1.0, "review": "I ordered this in the middle of June and we set it up with our TV.  I worked OK at first but there was quite a bit of buffering.  After a couple of weeks, it would play for a couple of minutes then start buffering and then totally shut us down telling us we had no internet connection.  This is not true since my other devices were working fine.  My husband called and tried to speak to someone to help him and he could not understand what the person was saying since the accent was so thick. He just gave up and we tried to go online to troubleshoot, to no avail.  We have given up using it and now it's past the return window so I've wasted my money.  I'm always very happy with all of my many purchases and my prime membership with Amazon, but this is has left a very bad taste in my mouth.", "verified": true, "helpfulness": "0/0", "author": "Lisa C. \"LisaC\""}, {"rating": 5.0, "review": "Great value!", "verified": true, "helpfulness": "0/0", "author": "Jayne Stommel"}, {"rating": 4.0, "review": "We had to upgrade our DSL service, but after that it works great!  Love it!  Trying to figure out how to show only Prime options when doing a voice search on my cell phone's Fire TV app.", "verified": true, "helpfulness": "0/0", "author": "Leslie Whetzel"}, {"rating": 5.0, "review": "I pretty much only use it for HBO GO, since my Nexus Player doesn't have it for some strange reason.  Works great though.", "verified": true, "helpfulness": "0/0", "author": "mikeytusa"}, {"rating": 5.0, "review": "Easy to install, works as advertised, easy to navigate controls.", "verified": true, "helpfulness": "0/0", "author": "Jesus Borboa"}, {"rating": 5.0, "review": "I really find the Amazon fire stick very useful and easy to use. Integration with Amazon prime makes the content selection a pleasure to use. Streaming is smooth and ver fast. Love it.", "verified": true, "helpfulness": "0/0", "author": "Vishnu Lakdawala"}, {"rating": 5.0, "review": "Could not be better!!", "verified": true, "helpfulness": "0/0", "author": "Adamg555"}]