[{"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Easy to use & a bargain (got it on 2 day half price offer).Works well (no issues) and no delay starting the free prime movies etc.", "verified": true, "helpfulness": "0/0", "author": "RL"}, {"rating": 2.0, "review": "The dongle seems to work just fine but the remote only has a range of about a foot and a half. So for practical use its pretty much useless.", "verified": true, "helpfulness": "0/0", "author": "Daniel R Leclerc"}, {"rating": 4.0, "review": "The Fire TV Stick is a fairly amazing piece of technology both for its cost and size. Out of the box it will be paired with your Amazon account so you literally need to do nothing more than plug it into a HDMI port and power. I've been impressed by the range of apps available out of the gate. I wasn't sure of the remote and feared it would be too small to be useful but it's actually quite good.I also have a Chromecast which I think fills a different purpose. Since this is standalone I actually find it easier to use than fiddling with my phone.", "verified": true, "helpfulness": "0/0", "author": "Windy City"}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "Debra Weeks"}, {"rating": 2.0, "review": "I have Comcast and all the other tv adapters allow me to get showtime etc but not with the stick. Comcast is not an option with many of the apps", "verified": true, "helpfulness": "0/1", "author": "Gilbert Ginsburg \"iphoner\""}, {"rating": 5.0, "review": "Love love love the Fire Stick. Wasn't sure what it was when ordered, but as Prime member, too good a price to pass up. Researched after ordered, received, and was intended for second tv hardly used, but set up on main large flat screen first. Works so wonderfully, keeping in living room and considering second one for bedroom. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "abtb11"}, {"rating": 4.0, "review": "Love it, only wish I could get VUDU on it.", "verified": true, "helpfulness": "1/1", "author": "Melinda Miles"}, {"rating": 5.0, "review": "I love that it's exactly what I expected it to be. It's very convenient and easy to use. I am completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "Noille Stewart"}, {"rating": 5.0, "review": "This stick works right out of the box! It's also PREPROGRAMMED to your account! So don't be a wise guy and resell it! Thus u will loose it all. Not to mention they charge all to your prime account etc.", "verified": true, "helpfulness": "0/0", "author": "sTaLwArT 420 \"sTaLwArT\""}]