[{"rating": 5.0, "review": "The stick was easy to install and run.  It works very well with Netflix and Amazon Prime.  We love it.", "verified": true, "helpfulness": "0/0", "author": "Clifton Curry"}, {"rating": 3.0, "review": "This is an inexpensive streaming device that works well with the Amazon content, but it can be a little slow and I have had it lock up if it is not powered down after about a week. And this is in a house with a heat pump, so the temperature only changes by about 3 degrees F or 1 degree C.I actually like the remote on the stick better than the one that comes with the full Fire TV, as I leave my remotes on a chair or nightstand when I use them. This remote has a flat back, while the one with voice control has a curved back (can be better if you normally hold your remote).The Netflix app is good, and the Music app is nice.Unfortunately, if you ever run the Amazon Music stuff, it will tend to start playing music when you pause an Amazon Video stream (until you reboot the Amazon Fire). I have had this happen with both the Fire TV Stick and the Fire TV.All of my complaints are fixable in software, so I have no problem recommending the hardware to people who are Amazon Prime members and use Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "garkin"}, {"rating": 1.0, "review": "JUNK! I have wasted so much time trying to get it to work and it has been so frustrating.  I returned the first one and amazon sent another, same issues.  I have tried it with all different router settings.  I am a computer/network technician and this product is junk!!", "verified": true, "helpfulness": "0/0", "author": "G.A."}, {"rating": 5.0, "review": "Buenisimo", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos Cabral"}, {"rating": 5.0, "review": "This was a great decision, especially  for those who have an LCD/LED that is not a smart tv. Purchasing  a second unit soon for bedroom", "verified": true, "helpfulness": "0/0", "author": "Jack Dittman"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "marilyn e. basilio"}, {"rating": 5.0, "review": "Good product. Recommend", "verified": true, "helpfulness": "0/0", "author": "Michael Gutierrez"}, {"rating": 5.0, "review": "An excellent product.", "verified": true, "helpfulness": "0/0", "author": "Guy Fadollone"}, {"rating": 5.0, "review": "Love it simple", "verified": true, "helpfulness": "0/0", "author": "jorge vasquez"}, {"rating": 5.0, "review": "none", "verified": true, "helpfulness": "0/0", "author": "William Piper \"Variety of genre fan\""}]