[{"rating": 4.0, "review": "Works great so far! Wish some of the apps were compatible with DirecTV though. When you go to sign up for some of the free channels, DirecTV is not an option. Otherwise, great and compact device.", "verified": true, "helpfulness": "0/0", "author": "Randy Wear"}, {"rating": 5.0, "review": "i love it, works great, and is very fast", "verified": true, "helpfulness": "0/0", "author": "Heath"}, {"rating": 4.0, "review": "Fire Stick arrived in excellent packaging. When I tried to put together, I found the unit did not work. The batteries sent with it were dead. After replacing with new batteries the unit is working great.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "Useless. Couldn't update it at first, and when I did update it. I couldn't get access to my prime benefits because I live outside of the US.", "verified": true, "helpfulness": "0/1", "author": "Updula"}, {"rating": 5.0, "review": "Okay, let me preface this with the fact that my expectations were that this would be similar to the ChromeCast.  It is not.  This is an entirely different animal completely.Let me secondly say that if I was not already a Prime user, I might not be so thrilled with it.  But I am, so I am!  :-)Anyway WITH PRIME, this thing is amazing.  You've got instant access to all your Prime movies and music and pictures, including your libraries and cloud.Additionally, this is basically an Android device (or it appears to me to be) using the Fire framework.  So in addition to the aforementioned, you also get access to many apps, free and paid.  I haven't looked into how much it can hold, but I've downloaded several games, weather, and other apps - about 20 in total so far, all free.Finally, it didn't occur to me when I purchased, but it just makes sense that this is a RADIO CONTROLLED remote.  That means you don't have to aim it to use it, which is quite handy when gaming, or just lazy like me.  But it also means that you won't be able to integrate it with your universal remote.  So there's no volume control of your media center or TV.  You'll have to use your other remote for that.  So good and bad.I have not yet decided whether or not to get the Game Controller.  I did get the voice-activated remote, and found it very handy to have.  The voice search works well.  However if price is a concern, you should know that the Android app (and probably the iPhone app) will also give you voice control, so you might want to save a few bucks there.  I personally like having a dedicated remote control instead of having to reach for my phone and start an app.  That being said, using the keyboard on the phone is far handier than using the on-screen remote control keyboard.I did watch a couple of movies and I have to say the video quality is remarkable.  It appears to be HD, and of course, part of that will always be dependent on your internet.  However, I've been using Netflix for years, and I think the video in the Fire Stick is better.  There seem to be less artifacts and screen tearing.  Likewise, the audio is very good.  Unless you're one of those audiophiles to claims to hear better than a dog, of course.  :-)  Also, there's extremely little lag between clicking Play and the movie starting.  Netflix usually has several seconds of \"spin-up\" before it starts.  The Forward and Rewind keys jump 10 seconds forward and back, or if you hold them down, do the usual FF/RW in several speeds.", "verified": true, "helpfulness": "0/0", "author": "AzDayton \"- Dayton\""}, {"rating": 5.0, "review": "I have terrible Internet speed (thanks Comcast). Though I'm supposed to get 100Mbps I will often see less than 1 Mbps during peak usage hours. While I can't stream Netflix on my computer during those times without insane buffering delays, somehow the fire stick never needs to buffer. Whatever sorcery is in this stick is great! Definitely worth the $39", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 3.0, "review": "occasionally disconnected.", "verified": true, "helpfulness": "0/0", "author": "Yong Ku Kim"}, {"rating": 5.0, "review": "I love my Chromecast, but having a non-phone remote, makes this thing work better for most applications.  I don't have to teach others how to load an app, etc.  Apps provide DLNA file system display, Netflix, etc.  Great little product.  Gonna have to get some for my other TVs.", "verified": true, "helpfulness": "0/0", "author": "Byron L. Ferguson"}, {"rating": 5.0, "review": "Best TV stick out there.The only CON is: Lacks of Xfinity TV App.", "verified": true, "helpfulness": "0/0", "author": "Neo"}, {"rating": 5.0, "review": "I received it, plugged it in, logged it onto my network, watched the intro video, signed into multiple video/music accounts, watched a few minutes of a couple of movies to make sure it worked, listened to a couple of songs, and downloaded and tested the controller app for my smartphone - all in about 45 minutes.Someone mentioned it would have been nice if this could have been powered by the TV's USB port.  True, but I don't know if that would have been enough power.  In any event, it does have to be plugged into a wall outlet.  That is my only disappointment, although not a major one.The value for me is in travel with an extremely portable device.  At home, I have a smart TV and a smart Blu-ray player.  But now, I can take all my online content with me to watch in hotels, motels, rental homes, etc.  That is a real plus.", "verified": true, "helpfulness": "1/1", "author": "Dog Lover"}]