[{"rating": 2.0, "review": "This thing is constantly buffering.  I got it for a song on the Black Friday deals, it really does not work well. Despite the updates, resets, unpluggings, etc.  can't figure it out, not just the Amazon content, Netflix too.  My roku and xboxone, much better.  You'd think with the millions sold they'd have mastered how to stream with a supposed 100mb Comcast xfinity internet pipe.  Guess not.", "verified": true, "helpfulness": "1/2", "author": "fastrailer \"notagenre\""}, {"rating": 5.0, "review": "Great device, easy set up!! It has very clear HD image.  Great Purchase", "verified": true, "helpfulness": "0/1", "author": "Margarita Colunga"}, {"rating": 5.0, "review": "It's good", "verified": true, "helpfulness": "0/1", "author": "flylady"}, {"rating": 4.0, "review": "It's great when it works.  However, it has a lot of trouble connecting.  It's not my Internet.  I have a smart tv and it connects fine when the fire stick has lost connection.  I would rather use this for Amazon prime because the menu is more user friendly than my smart tv.", "verified": true, "helpfulness": "0/1", "author": "Melissa Dean"}, {"rating": 5.0, "review": "The Fire Stick has weaned my family from cable television. It has saved us money and  increased our family time because we watch television together", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Roku is much better. The Fire Stick has fewer apps and home menu not as clean as Roku stick. Casting from your smartphone is hit or miss.", "verified": true, "helpfulness": "0/1", "author": "the doctor"}, {"rating": 4.0, "review": "cool device. beats the other brands heads up.", "verified": true, "helpfulness": "0/1", "author": "tuck"}, {"rating": 5.0, "review": "Great purchase! I got this for my bedroom TV which isn't a smart TV. I wanted to be able to watch Netflix shows while hubby played his PS3 on the living room TV. Works perfectly! Also took this on vacation and plugged into hotel TV. That was best decision. I could watch the movies and TV shows I wanted to  on my timetable.", "verified": true, "helpfulness": "0/1", "author": "Library Lady \"Librarian\""}, {"rating": 5.0, "review": "Love my Fire Stick. I have a rather sketchy \"high speed\" internet connection yet fire stick is better able to keep a connection and play than my more expensive Roku device. And clever Amazon, they made Prime slightly easier to access than Netflix so now I am watching more on Prime ;)", "verified": true, "helpfulness": "0/1", "author": "M. Galloway"}, {"rating": 4.0, "review": "Real good", "verified": true, "helpfulness": "0/1", "author": "Praveen Pavithran"}]