[{"rating": 5.0, "review": "Does what it says. Makes entertainment  accessible and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "SilverSurfer74"}, {"rating": 3.0, "review": "This is a well crafted device.  Comes together nicely.  The dongle on my LG went bad and it was cheaper to buy the fire stick.  It fires-up Prime quickly.  However, it is very reluctant (as in rediculously slow) to link with Netflix.  Don't know if that is by intent--just seems odd that the one function that works best is its' own.", "verified": true, "helpfulness": "0/0", "author": "S. Crawford \"S. Crawford\""}, {"rating": 4.0, "review": "have not had time to really check it out. looks good and just got better system", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I use this fire stick daily, a must have!  It's so easy!", "verified": true, "helpfulness": "0/0", "author": "Dorothy J. Seville"}, {"rating": 5.0, "review": "Great device! Easy to use and easy set up!", "verified": true, "helpfulness": "0/0", "author": "Abby"}, {"rating": 5.0, "review": "Very easy to use.  I really like it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We own the Fire TV also.. This works great for our bedroom tv.. well worth the price FIRE TV in the living roon, this in the bedroom, Streaming video everywhere !!", "verified": true, "helpfulness": "0/0", "author": "Jason Davie"}, {"rating": 5.0, "review": "we have two fire sticks on separate TVs we have  profiles for my wife, my self,and my daughter on her Netflix can my wife and I watch different Netflix content at the same time", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First of all let me clarify that I am not a techy person AT ALL. I am way behind the curve with all this online streaming and decided for the Fire Stick because all the other reviews ranked it best and because I got an amazing deal and only paid $4 for it. Also, I am a stay-at-home mom of a 7 year old and a 1 year old so I rarely watch TV. With that said, I have been catching up with all the trending TV shows and movies since I got it a week ago. The set up was easier that easy and so was learning how to work it. I downloaded the remote app on my phone so I can do voice search now too. My only problem has been figuring out a way to watch live TV (without a cable service).", "verified": true, "helpfulness": "0/0", "author": "daniela justiniano"}, {"rating": 1.0, "review": "As Uncle Si would say, \"This is a piece of junk.\"  It takes a LONG time to go through all the steps to get to a show, and then it continually loses it's signal.  I have yet to complete a movie or TV show without it cutting out.", "verified": true, "helpfulness": "1/2", "author": "Billy W."}]