[{"rating": 1.0, "review": "I'm so disappointed! Let me start by saying I own an original google TV device, the somewhat new ROKU Stick and now the Fire TV Stick.My comment is very similar to J. Scherrer. I received my device before the holidays to my great delight but I did not open it until after because I already own a ROKU Stick \"WHICH I ABSOLUTELY LOVE!\" I wanted to try the fire TV stick to compare it and use on a secondary TV within my home.I initially plugged it in powered by the USB and I got an \"unsupported device\" screen marred in BLUE and GREEN vertical bars! I instantly thought that the USB power was not enough so I unplugged the USB power and used the power adapter, but alas I got the same result. The image was under a blanket of blue and green. This time however I let the stick go through its paces.Under the blanket of blue and green I could see the Fire TV logo so I logged onto my WiFi, the stick did an automatic update and went through its welcome screen. Clearly this was an output issue or so I thought. After about 30 mins of frustration and going through update and resetting cycles I was about to give up until I decided to try it with another television, and BOMB! Picture perfect! You would think this would make me happy but I was actually more annoyed! This is was not just an older and smaller TV but the same manufacturer! Why would the device work with an older model and not the newer one? I have no clue. Both of my TVs are PHILIPS.In any case I decided to call customer service to seek a replacement device in hopes that the device was truly defective. Short version it wasn't. The replacement device came and I've had the same result. I obviously don't know the tech details behind why the stick won't work with the newer TV but that's for amazon to figure out! I'm going to send back the replacement device and hold on to the original one. I got it at the intro $19 and it works on one of the TV's so I guess that's ok considering I paid half the price.My advice to shoppers:If you want a tried and true device, buy a ROKU. They are GREAT!My advice to AMAZON:Please work out the bugs before bringing the product to market.", "verified": true, "helpfulness": "12/13", "author": "Errol A Browne"}, {"rating": 5.0, "review": "Fast at start up. Very good picture quality. Easy to install and good remote... A little different than the ROKU but so far better and faster for a fraction of the cost. Wireless excellent with Amazon prime, but for other search options you have to open eg Netflix too find the show you are looking for... So far happy with the purchase", "verified": true, "helpfulness": "0/1", "author": "R. Wimmer \"kingrollo\""}, {"rating": 5.0, "review": "Absolutely amazing", "verified": true, "helpfulness": "0/0", "author": "Daniel Peragine"}, {"rating": 5.0, "review": "Great! I am ready to drop cable.", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 5.0, "review": "Blows roku away. Amazons fire stick the best I have one on order now", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 5.0, "review": "It's GREAT, easy to install", "verified": true, "helpfulness": "0/0", "author": "John M Trevino"}, {"rating": 4.0, "review": "operator error wrong digit my bad running OK now", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Massaro \"amastrol m\""}, {"rating": 5.0, "review": "We love this!  Setup was a breeze, and it works like a charm, exactly as described.  It's far, FAR better than Chromecast in every way.  About to buy another right now!", "verified": true, "helpfulness": "0/0", "author": "William T. Prince \"William T. Prince\""}, {"rating": 3.0, "review": "Pros:Easy to setup...check. Took longer to enter my wifi security then setting it up. Walks you through the setup once connected very simply.Nice interface..check. Especially with the free Android apps for remote with Voice search. also a much better Netflix interface than I have on my TV and BluRay player.Selection on Prime...good. Makes nice balance between Netflix and Prime. Being able to rent streamable movies is definitely  nice plus over NetflixCaveat,:Takes a lot of your bandwidth. When I called support, they recommended I bump up my speed with my ISP, which is 12 Mbps already.You will need a power outlet to use. I knew this, but for folk with a wall mounted TV, good to know.Cons:After watching for a few hours, I consistently get  message that there's no internet. Having been a net admin, I know what to check, and the stick is the only thing in my network that an't connect to wifi. I'm currently running a 2.5Ghz 11N network. Support recommended a 5ghz network, which I'm going to try out with some spare  equipment, segregating the stick to the 5ghz spectrum, but that'll be later this week. Support aid they'd call back after they walked me through resetting the stick (it was pre-configured when I got it) to see of it helped with the dropouts, but it and they didn't. To get the internet  back, I have to unplug the power to the stick, wait a few seconds and plug back in. Doing nothing too the network, it connects right back up. i'm wondering if it's a memory issue or hardware. The TV is a three year old Samsung, and haven't had problem with it on any other plugins, Internet's stable, and have had zero issues with connections or speed at all. and Prime video works flawless;y on all our pcs.If the network drops can get resolved, I'll bump the rating up to a 5 star as that's the only real problem I have with it. Everything else about the product is incredible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"O'Boise\""}, {"rating": 1.0, "review": "Didn't work for me, everything I want to watch I can get over the internet.Haven't  got the refund yet even though my account detail says I have.", "verified": true, "helpfulness": "0/1", "author": "Bruce Pettersen"}]