[{"rating": 4.0, "review": "Working as advertised there is no delay turning it on, the searching and the movie or tv shows come up right away unlike my DVR that I was using to get Netflixs it took a couple of minutes to get it going and was slow refreshing in moving between screens I won't be using the dvr again", "verified": true, "helpfulness": "0/0", "author": "Steve Nelles \"JSteven\""}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "love it makes my regular flat screen into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Vincent Bos"}, {"rating": 4.0, "review": "I bought the Stick because I could not get cc on Netflix with the app built into my TV. Fire Stick enabled this, which was great. Moreover reception is hi-res, good bandwidth. (I'm lucky my router is right next to TV.) Interface is decent, the small remote adequate though improvable. I'm very happy the Stick solved my Netflix cc problem. Now wife and I can get all the dialog. Another point: only $39. That's good.", "verified": true, "helpfulness": "0/0", "author": "Sherab K"}, {"rating": 5.0, "review": "This thing is GREAT with Amazon prime. If times get tough, I could cut all my HBO, Showtime & cable bill entirely and just use this (although you'd be playing catch up with some seasons and prime doesn't offer ALL shows and networks). Streams clean and was easy to install. You DO have access to other services (HULU, ect), however, the more services you use, the more you'll pay (monthly). Kinda like a la carte viewing. Nice alternative to Cable and/or satellite TV, and an inexpensive way to experiment with \"cutting the cord\".  I'm not there YET....but certainly headed in that direction. p.s. you DO need a wireless broadband network in place to use this product. I assumed everyone has a wireless network, and you know what they say about assuming!", "verified": true, "helpfulness": "0/0", "author": "Amazon Guy"}, {"rating": 5.0, "review": "Worked as it should and provides great service.", "verified": true, "helpfulness": "0/0", "author": "GLENDA"}, {"rating": 5.0, "review": "I'm very happy with my device  !!!", "verified": true, "helpfulness": "0/0", "author": "CHARLES SCOTT"}, {"rating": 1.0, "review": "The Fire TV Stick is great in theory. The interface is fairly eye pleasing and I enjoy the option of being able to control it via the provided remote or via the smartphone app. However, that's about the extent of the positives from my experience with it. Despite self-reporting that it's receiving Very Good signal strength from the wireless router it tends to have a slow connection that leads to pixelated streaming and/or pauses to buffer. Keep in mind that I have many other devices I use for streaming (PS3, Xbox 360, Chromecast stick, laptop, smartphone) and it is the only one having an issue. I looked online for a solution but found that mostly it's just a lot of people who ran into the same issues I've had. I'm very disappointed by this product since I love most things Amazon. I am hopeful that it's a software bug that will be fixed in the future by an update but in the meantime I am left with a poor quality device. Another drawback to this point has been the lag in response-time for the interface. Sometimes it won't respond to button presses on the remote and other times it seems to be overly sensitive and it will jump around multiple times for every button press. I would recommend sticking to one of the other streaming device options out there.", "verified": true, "helpfulness": "0/0", "author": "Jenna"}, {"rating": 5.0, "review": "Awesome product. Functions exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "George E. Crosby"}, {"rating": 5.0, "review": "I bought the Chromecast first because the fire stick was on back order, but it wasn't really what I was looking for because it relies heavily on your mobile device, the fire stick fire stick odds exactly what I was looking for. You can watch shows independent from your mobile device, and it also allows for casting similar to the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]