[{"rating": 1.0, "review": "Can't get it to work", "verified": true, "helpfulness": "1/2", "author": "Robert Rudd"}, {"rating": 5.0, "review": "Nice", "verified": false, "helpfulness": "0/0", "author": "Terry_aki"}, {"rating": 5.0, "review": "Wow!  Amazon has done it again.  I cannot believe I waited so long to get this puppy!  I'm retired and cannot afford  a $150 month cable/TV/Internet bill PLUS, I don't watch TV that much.  After the Super Bowl ended, I dropped cable and only go with an antenna and my local channels.  But we're now in September and football/basketball season starts soon.  I need ESPN and TNT.  I purchased the Fire Stick for Sling TV.  I like TNT and TBS and for $20 a month, Sling TV seems like the ticket.  I plugged in my Fire Stick and lo and behold I get ESPN!  I don't need Sling.  I'm watching ESPN as I type this.  Plus, it has other stuff I can watch if I'm in the mood.  Yes, I am a Prime member so I've got movies and TV but with the stick, I've got Crackle and Pandora and so much more.  I don't need cable and will never go back unless the price drops considerably.  Once basketball season starts, I'll pay the $20 per month Sling TV subscription and I'm in business.  This stick would be worth the price at triple the cost.  I LOVE AMAZON! I've purchased several Kindles for myself and family.  I've been a Prime member for about five years, I purchase books and many other things off Amazon a couple times each month.  Amazon, keep up the good work.  The Prime Day was screwed up a few months ago, but everything else has been super!", "verified": true, "helpfulness": "0/0", "author": "Old School"}, {"rating": 4.0, "review": "Bought this for my grandson.  The TV we hooked it to isn't far away from the wireless router, but it would not stay connected or would not connect at all. A kindle or iPad in the same room picks up the Wi-Fi just fine.  I read another review where the reviewer stated that he hooked it up to an HDMI extension and it worked fine, so I tried that.  That definitely fixed the issue.  It works perfectly fine now and my grandson really enjoys using it.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "many programs included! loved kindle fire TV!", "verified": true, "helpfulness": "0/0", "author": "Jessica Lopez"}, {"rating": 5.0, "review": "Super easy to use! I will be upgrading to the Fire TV unless the new Apple TV brings it next week!", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 1.0, "review": "With this device netflix would quite often freeze the video while audio continues, after about 5 or more seconds of paused video it would rapidly catch up the video in fast forward, all the wile the audio played uninterrupted. This happens at least every 10 minutes.I cannot recommend this for movies.Loading other streams takes considerabke longer than our roku on the other display and the main interface itself woulkd freeze for a few seconds when you move around the main menus.", "verified": true, "helpfulness": "0/0", "author": "Mr. Duan Diederik Joubert"}, {"rating": 2.0, "review": "Performed well when we rarely used it. Now that we use it for youtube, netflix and prime videos, and it gets used for 5 hours a day or more, it goes really slow. Sometimes the netflix app will completely close itself, or start skipping. The youtube app has the same problem. Sometimes pushing a button on the remote can take 2-3 seconds to register on screen. I've replaced the battery, and checked its wifi connection. We dont have any issue with netflix, youtube or prime videos on any other device, just this one. Unplugging it, because it gets burning hot seems to help, but I end up doing this every night I want to use this thing. very frustrated. Going to go buy a different device now which is what I should have done before.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a Great tv viewing addition, exactly what I wanted. When Amazon says 2 day delivery, that's exactly what you get. Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Cisneros"}, {"rating": 5.0, "review": "Great product, very convenient to plug in and watch shows.....EASY", "verified": true, "helpfulness": "0/0", "author": "MinecraftOrDie"}]