[{"rating": 1.0, "review": "Wish I never got this paper weight. It constantly disconnects from my network. Works ok when it connects, still slow. Menu setup is not great and can be confusing. I have done everything to resolve the issue but it still not good, the hardware on paper looks good but the software needs a lot of works. It now sits in the box and I now have three chromecast connected to each TV.  I thought it would be a for the kids with the remote but they kept asking for another chromecast.", "verified": true, "helpfulness": "0/0", "author": "Brian Shah"}, {"rating": 1.0, "review": "Hard to watch a video straight through, a lot of buffering happening. I rented the movie \"Love Happens\" and it would stop and start, very frustrating:(", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Yes indeed the best purchase I've made in a long time", "verified": true, "helpfulness": "0/0", "author": "julius smith"}, {"rating": 5.0, "review": "Great value for the price. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "For what it is, it's works well. The Fire TV app for Android works great for typing and voice since the remote that comes with the TV stick doesn't have a mic.", "verified": true, "helpfulness": "0/0", "author": "SwordSaint"}, {"rating": 5.0, "review": "a good investment", "verified": true, "helpfulness": "0/0", "author": "becky vanhoose"}, {"rating": 5.0, "review": "Works awesome! So easy to setup, and made our previously unused computer monitor into a working Smart TV. Added some peripheral speakers, and boom!", "verified": true, "helpfulness": "1/1", "author": "Asa Kelly"}, {"rating": 5.0, "review": "Exceeded expectations. So easy to install and set up. Love this product!", "verified": true, "helpfulness": "0/0", "author": "Karen Pomerleau"}, {"rating": 5.0, "review": "Really enjoying being able to stream TV shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Janet Haddad"}, {"rating": 5.0, "review": "I love it ! I ordered it around xmas time and it was being shipped for February. It was worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Dawn A Ringer"}]