[{"rating": 5.0, "review": "I happened to go into Best Buy on Black Friday and the Fire TV Stick was such a great price, the techie in my had to give it a try.  Oh boy am I glad I did!  I currently have two Apple TVs, but if I hadn't already bought a bunch of movies on iTunes (or there was a way to stream them through my Fire Stick), there is a good chance I'd switch to Amazon.  The interface took a little getting used to, but ultimately, it offers more everything Apple TV does and more (games) at half the price.  Truly love it!", "verified": true, "helpfulness": "0/0", "author": "Brendan Krasinski"}, {"rating": 5.0, "review": "I've used Chromecast, Roku, Apple TV, smart tv, smart bluray, and now Fire Stick. Works as expected. Remote is almost as nice as ATV's. If u r a Trekkie, the Amazon Instant video source for Star Trek TNG is much better quality than ATV. Appears like higher rez. I also see less \"combing\" in the moving video with Fire stick vs ATV.", "verified": true, "helpfulness": "0/0", "author": "J. Banville"}, {"rating": 5.0, "review": "I am in LOVE with this!  It works much better than any other streaming devices we have in our home! I would recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Nichelle Clubb"}, {"rating": 5.0, "review": "Wonderful way to organze everything you want to view.  Its like a Google Chromcast on steroids !!", "verified": true, "helpfulness": "0/0", "author": "eddie01"}, {"rating": 5.0, "review": "just starting to use and enjoy this. Easy to set up!", "verified": true, "helpfulness": "0/0", "author": "MJD"}, {"rating": 5.0, "review": "I really had no expectations for this when I ordered it, but it was on a special sale for $20 and I'd wanted a streaming device for a while. The response time is probably the best feature, and if you have Prime (which you should because it's worth every penny) it's really convenient accessing Amazon Video and Netflix. The device streams extremely quickly off minimal connection speeds. The only downside I can think of is the absence of a reboot feature should the device freeze (which it's only done once during my experience) in case you lose your internet connection. It has completely replaced the need for cable tv with very minimal adjustment needed. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Michael Waldo"}, {"rating": 5.0, "review": "Wow, buying the Fire Stick should be a no-brainer choice for anyone who has Amazon Prime.  I bought a bunch of digital movies over the last few years from Amazon because they were such great deals that I couldn't pass up; now I actually watch them.", "verified": true, "helpfulness": "0/0", "author": "Kiljoytopknot"}, {"rating": 5.0, "review": "AWESOME, I LOVE how simple the remote is to use, only the controls needed with out all the extra buttons to memorize. Streaming is great and picture is Awesome.", "verified": true, "helpfulness": "0/0", "author": "Thor777"}, {"rating": 5.0, "review": "I absolute love this thing. The interface is clean and responsive. The remote is super responsive but a little clicky. I would buy these as gifts if there was any in stock. Im also in love with the youtube app.", "verified": false, "helpfulness": "0/0", "author": "John Antonio"}, {"rating": 5.0, "review": "Great product for a great price.", "verified": true, "helpfulness": "0/0", "author": "Ronald Ramirez"}]