[{"rating": 5.0, "review": "As a Amazon Primer member I was able to buy the Fire TV Stick for $19 during a two day sale and I Love it! Super easy to set up. I like the fact that I can see my favorite programs through Netflix or Hulu and Amazon Instant video is Awesome too! This is one of my best purchase in Amazon and I highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Angelica Martinez"}, {"rating": 5.0, "review": "This is better than cable no longer any interface with commercial. This is the best for music download. Thanks.", "verified": true, "helpfulness": "0/0", "author": "shirley jones"}, {"rating": 3.0, "review": "Of course I hunt down all the free stuff.A few of the games are fun and there are quite a few choices for programming. I wish it just had an internet browser so I could see what I want on it. There are apps to link with other devices on your wifi network so they do have options. cloud storage looks like a good feature for it.Many channels/networks have too many ads though, 5 minutes of show, five minutes of advertising..... Steaming could be better, I know we have the speed here for it.", "verified": true, "helpfulness": "1/2", "author": "Tim Scarrow"}, {"rating": 5.0, "review": "I really like the layout. It works very well so far", "verified": true, "helpfulness": "0/0", "author": "Matt Johns"}, {"rating": 5.0, "review": "LOVE IT & the cost savings of eliminating cable!  Love the choices the Fire Stick offers &, after ordering the game controller, we are enjoying the variety & quality of many of the games as well!", "verified": true, "helpfulness": "0/0", "author": "Cindy Henning"}, {"rating": 5.0, "review": "Love, Love, Love the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Jeanette Parham-Carroll"}, {"rating": 1.0, "review": "Absolutely incoherent instructions for setting up program.", "verified": true, "helpfulness": "0/0", "author": "tomb"}, {"rating": 5.0, "review": "I say if you don't have much money to but an apple tv or a roku  you should purchase this. Its very worth the money.", "verified": true, "helpfulness": "0/0", "author": "Maya Williams"}, {"rating": 5.0, "review": "I am a TV and Movie nut and this is the best product ever. Order this and Amazon Prime !", "verified": true, "helpfulness": "0/0", "author": "Porter Mckee"}, {"rating": 4.0, "review": "I have enjoyed this device. I mainly use it as a backup to my Xbox One for streaming services such as Netflix and Amazon Prime. It is small, fast, easy to use, and my only complaint is the power cord that comes with it. I am using a powered USB port built in to my TV and it works fine even though the Fire TV Stick warns me about using it isn't recommended. I read online that the reason for this is because the powered USB port will turn off with the TV and Fire TV Stick wants power all the time so that it can perform updates. However, the USB cable provided is much to short for anyone that might have cables run through their wall due to their TV being mounted. For example, my TV is mounted on an extension mount so that it can be pulled away from the wall. I'd have to run the USB cable from the TV along the extensions arms, down the inside of my wall, then down to a power outlet. The provided cable is not even close to long enough and it wasn't worth it to me to buy a long enough USB cable when the powered USB port works just fine.Overall, I am pleasantly surprised with how well it works. I didn't have high expectations since it is wireless only, but picture quality has been excellent. I can't use my Harmony remote since the device obviously isn't IR, but the provided remote and the smart phone apps are more than adequate. All in all, a magnificent device, especially when looking at its price.", "verified": true, "helpfulness": "0/0", "author": "Pauls7"}]