[{"rating": 5.0, "review": "Pretty slick little device.", "verified": true, "helpfulness": "1/1", "author": "Nick"}, {"rating": 5.0, "review": "It was a snap to hook up and I love it .", "verified": true, "helpfulness": "1/1", "author": "Tim White"}, {"rating": 5.0, "review": "Very easy to use and tons of content with your prime membership!  My kids love it. An excellent alternative to cable!", "verified": true, "helpfulness": "0/0", "author": "Harris Sharritt"}, {"rating": 2.0, "review": "the fire stick tv and amazon fire tv are good but they are missing two key things one they are missing ultra vilote and disney movies anywhere want to store our movies in the cloud on amazon and watch our movies on all of our devices no matter what an iPad iPod touch iPhone or fire tv or fire tv stick also you guys are missing some more key features where the heck is the vudu player application we have ultra vilote movies that we can't store on amazon because of copy right crap we want to store our movies in amazon or have a vudu player application to get our movies on please hurry and get these features and apps for the fire tv and tv stick this needs to change and become better", "verified": true, "helpfulness": "0/1", "author": "Jack"}, {"rating": 5.0, "review": "This is the most amazing invention ever. Thank you Amazon for allowing us to get rid of Directv and stream what we really want to stream.", "verified": true, "helpfulness": "0/0", "author": "Courtland Martin"}, {"rating": 5.0, "review": "Exactly what I wanted", "verified": true, "helpfulness": "0/0", "author": "Ashley Kuczkuda"}, {"rating": 5.0, "review": "Very easy to install and a great tool for my tv. I will tell all of my friends and family about it.", "verified": true, "helpfulness": "0/0", "author": "judy bartley"}, {"rating": 1.0, "review": "The mirroring function is only compatible with Amazon tablets and phones.", "verified": false, "helpfulness": "2/2", "author": "christopher milligan"}, {"rating": 1.0, "review": "Can't get it to work. Drops the network all the time. I've tried everything listed on support site and no luck.", "verified": true, "helpfulness": "2/2", "author": "Jim"}, {"rating": 3.0, "review": "I can't connect to my modem ,and have been using wifi in my bldg. can't get into netflix,so I have to view Netflix movies on my laptop.If I can't use it I won't be buying any  of it's other products.", "verified": true, "helpfulness": "0/0", "author": "stanley hondo"}]