[{"rating": 5.0, "review": "Extremely easy install, beautiful menu screen, looks great. Great value.", "verified": true, "helpfulness": "0/0", "author": "Miguel Arias"}, {"rating": 5.0, "review": "Love it! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "R. Palma"}, {"rating": 5.0, "review": "Received as a gift and love it", "verified": true, "helpfulness": "0/0", "author": "Paulette Joyce"}, {"rating": 5.0, "review": "Works great, easy to install, although the Fire Stick will not plug directly into the HDMI port, its a good thing it comes with the extender cable.", "verified": true, "helpfulness": "0/0", "author": "J. Flynn"}, {"rating": 4.0, "review": "I really love this, as opposed to trying to use my Wii or blue-ray.  I've only had buffering issues once, but it might be internet.  I do wish there were a few more apps like HBO, Starz or CW for channels, but I did get my Showtime, which is nice.  I hope they just keep adding to this.  The remote is really really awesome.", "verified": true, "helpfulness": "0/0", "author": "G Herman"}, {"rating": 5.0, "review": "Given as gift for Christmas and receiver was overwhelmed.  Loved it.", "verified": true, "helpfulness": "0/0", "author": "Janet Dunn \"coffee freak\""}, {"rating": 5.0, "review": "Love the fire stick!!!!  So much at our fingertips, thank you", "verified": true, "helpfulness": "0/0", "author": "DeezerD"}, {"rating": 5.0, "review": "It lives up to the hype and positive reviews. No regrets on the purchase and worth the very reasonable cost.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I like the abilities of the Fire Stick, my problem is the constant buffering.  It's quite annoying.  Unless someone can tell me in the next day how this can be resolved I will have to return this item.  I was attempting to watch Grey's Anatomy on Netflix and it buffered so much I finally turned off the TV and went to sleep.", "verified": true, "helpfulness": "0/0", "author": "Scott Haskins Sr"}, {"rating": 5.0, "review": "This Fire Stick TV is a wonderful investment. Me and my wife are very much pleased and satisfied with Amazon Fire Stick TV.", "verified": true, "helpfulness": "0/0", "author": "Olskool"}]