[{"rating": 4.0, "review": "With Fire TV Stick, Amazon seems to have a winner on its hands.Setup is easy, I was able to power it with my TV's USB port. Though, fire tv stick recommends connecting to a power source, I've had no issues using my TV's USB port. Fire tv stick came configured with my amazon account. Though its new, it still needed a software update which was a surprise.When it comes to hardware, its definitely a step up from competitors like Roku Stick and Chromecast. Dual Core CPU and dual band Wifi is a great plus.Dedicated remote is a great plus as you don't have to look at the remote and use the physical buttons with little practice unlike chromecast where you have to pick up your phone, unlock and open the app to control it. Remote is simple and fast; however the click wheel is not as well designed an apple tv remote which has a depression where your finger naturally rests and feels good, but its definitely not a deal breaker.I felt that UI is definitely better compared to Roku and the voice search feature in the android app is definitely very helpful.Mirroring and flinging videos from phone/tablets is not intuitive and easy as compared to Chromecast. I had to pair the youtube app on the fire tv stick to my phone's youtube for it to get listed in the cast-able devices list on youtube. However, once paired, casting was flawless and worked quite well.Plex works well; allcast can be side loaded as do some of the other apps. Future potential, considering its hardware, really looks good.For anyone invested in amazon's ecosystem, there's really no reason not to consider Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Abhi"}, {"rating": 5.0, "review": "Easy to set up and use. Wish it was easier to search for all available movies.", "verified": true, "helpfulness": "0/0", "author": "Hoop Mom"}, {"rating": 5.0, "review": "I honestly only purchased this to put Pandora and Netflix on a second (non-smart) TV in my house.  I probably would not have purchased it at list price, but Best Buy had a great deal going a few weeks ago so I grabbed one.  It works great, is fairly easy to set up, and provides more than enough free content to waste most of your waking hours with.  It is a little tedious entering search terms with the on-screen keyboard and the remote, but not impossible.", "verified": true, "helpfulness": "0/0", "author": "Ed B."}, {"rating": 5.0, "review": "Does exactly what I wanted!", "verified": true, "helpfulness": "0/0", "author": "Harold Schneider"}, {"rating": 5.0, "review": "I love it.  Firstly,  super easy setup and works within 5 minutes.  Secondly,  if you're a Prime member you can watch movies,  tv and listen to music for free.  Also, the fact that it not limited to one tv. You can move it around,  even take it on the go. Lastly, it even has games. I got mine for $20. Awesome!  Only wish I ordered 3.", "verified": true, "helpfulness": "1/1", "author": "G-lexis"}, {"rating": 5.0, "review": "Really cool device! Way to Amazon!!", "verified": true, "helpfulness": "1/1", "author": "Penny J. Kirby \"Penny\""}, {"rating": 5.0, "review": "This thing works like a charm.  No issue connecting, no issue logging into existing Netflix and other accounts, no issues buffering.  Not sure what the negative reviews are on about.  Eight minutes from plug in to watching tv.  Buy it.  It's great.  Only potential issue?  The sideways scrolling made me a leeetle seasick.  That could be my inner ear though...", "verified": true, "helpfulness": "1/1", "author": "Heidi Amavisca"}, {"rating": 5.0, "review": "Really cool. Meets expectation.", "verified": true, "helpfulness": "0/0", "author": "Naga"}, {"rating": 5.0, "review": "This is a great unit and works as advertised.", "verified": true, "helpfulness": "0/0", "author": "John C. T. Meyer"}, {"rating": 1.0, "review": "I'm a big Amazon user, since back when they only sold books.  I average 3-6 orders of random stuff per month, toilet paper, TVs and everything in between.  I've got 3 Kindles, and though I generally prefer using my iPad, they do see regular use.  As a general rule, I hate to return items and rarely leave negative reviews.  My point here is that a product has to be pretty lousy for me to go through the effort of sending it back and leaving a negative review.Fire TV Stick is that bad.Even at the early Prime offer of half-off, it (or they, I bought 2) weren't worth keeping.  I was hoping for something as fast and intuitive as the Chromecasts they were intended to replace, but with the added benefit access to the Amazon eco-system: Prime, Instant Video, Cloud Drive photos/videos.  After 2 days of use, here's what I discovered:Pros:1) East to hookup.2) Access to everything in the Amazon is dead simple (when it works).3) Affordable (especially the early Prime offer).Cons:1) No iOS app, so non-Android users are stuck using the remote (with no voice compatibility)2) Flaky Wi-Fi connection, constantly lost my home network and would need to be reset.3) YouTube app was unstable and even after pairing with my account, casting from other devices wouldn't work.  And it was noticeably laggy.4) Painful tutorial that can't be skipped and is pretty pointless since it tells you what Fire TV Stick does and how to hook it up AFTER YOU'VE ALREADY BOUGHT IT AND HOOKED IT UP.  And since I had to keep doing factory resets to find my wifi, I had to watch it over and over.I was sorry I even took the time to crawl behind my entertainment center to hook it up.  Other than missing Amazon content (and thanks for that, Jeff), Chromecast is a better product in every way.  Fast, stable, intuitive, with a slick app for your smartphone, regardless of OS.  I think Amazon probably knows that, which is why they won't directly compete and offer a Chromecast app for their content.  And that's too bad.", "verified": true, "helpfulness": "9/10", "author": "krikiter"}]