[{"rating": 5.0, "review": "Great device!!", "verified": true, "helpfulness": "0/0", "author": "Nelson F Brown"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "javier"}, {"rating": 4.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "Dan Liane"}, {"rating": 5.0, "review": "Like the Fire box better!", "verified": true, "helpfulness": "0/0", "author": "Nancy Duncan"}, {"rating": 5.0, "review": "I am totally amazed!  Very simple to use, and extremely nice to have.  I was surprised to find out that I can still watch movies using the Fire Stick - even when the cable/dish is down.  Although I missed the \"super great sale\" when they first became available, I have since purchased two of them at regular price. Amazon Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Linda R. Walleman"}, {"rating": 5.0, "review": "This replaced a Roku 2 with a Fire TV Stick. The fire stick is much faster going through the menu. I also purchased the voice remote so I can just tell it what movie I'm wanting to watch and it gets the movie very quickly. It works on Amazon Prime and not sure it works with Netflix's or U Tube. I really like the upgrade plus it sets up quickly.", "verified": true, "helpfulness": "0/0", "author": "magoo"}, {"rating": 5.0, "review": "One word awsome", "verified": false, "helpfulness": "0/0", "author": "salvador bermudez"}, {"rating": 5.0, "review": "Amazing! Easy to use! Thought about buying this for months. Wish I had done it sooner!!!", "verified": true, "helpfulness": "0/0", "author": "Nichole"}, {"rating": 5.0, "review": "I bought the Fire TV Stick because I was sick of waiting on my extremely slow Blue-ray player streaming Netflix and Amazon Prime videos.  I completely recommend this to anyone who has a discount Blue-ray player and doesn't have much patience.  I have the iPhone app for it as well and it works SO much better than any remote.  I highly recommend the Fire TV Stick and the app.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "GREAT!", "verified": true, "helpfulness": "0/0", "author": "Tony D. Grant"}]