[{"rating": 3.0, "review": "Would be a lot cooler if it had an Internet browser and could download hbogo", "verified": true, "helpfulness": "0/0", "author": "Scott Buzzard"}, {"rating": 5.0, "review": "It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Janice Hargroder"}, {"rating": 5.0, "review": "Excellent have a couple of questions but like it.", "verified": true, "helpfulness": "0/0", "author": "Linda Inglis"}, {"rating": 5.0, "review": "Yes, it did meet and maybe exceed my expectations.  It was easy to install and I was even able to load the App on my iPhone to use as a remote.  That was an unexpected plus.  The movies and TV shows stream perfectly, just as the regular TV broadcasts.  There are a few TV shows that I never watched from the beginning and I'm able to get them and catch up to the new season.  While  I am enjoying the movies and TV shows on Prime still I wish that they were more updated to newer versions.  When I select newer shows and movies, I'm frustrated by the charges.  I don't like to be \"nickeled and dimed\" in this way.  It is a disappointment.", "verified": true, "helpfulness": "0/0", "author": "Roseanne"}, {"rating": 3.0, "review": "Some videos play with the audio running in slow motion.  The info that came with the unit doesn't have any troubleshooting, it only references a web site.  The web site doesn't have any audio troubleshooting at all that I could find.", "verified": true, "helpfulness": "0/0", "author": "Jamie D"}, {"rating": 4.0, "review": "Works great but hard time opening up remote to insert battery", "verified": true, "helpfulness": "0/0", "author": "Meredith"}, {"rating": 1.0, "review": "I couldn't understand the instruction and returned it.", "verified": true, "helpfulness": "1/1", "author": "Sharon joy \"sharonjoy\""}, {"rating": 3.0, "review": "Not much better than any others. Netflix has more free movies and the power cable is annoying cause u gotta use wall outlet. With chromecast I could share my device screen, fire stick will not let me that I can tell.", "verified": true, "helpfulness": "0/0", "author": "Wife Pleaser"}, {"rating": 2.0, "review": "Won't link with my tablet..", "verified": true, "helpfulness": "0/0", "author": "Michael Perry"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Kevin B"}]