[{"rating": 3.0, "review": "It's okay. I actually signed on for Amazon Prime as well and not too thrilled with that either, as the choices of programming are not terrific. Plus, Amazon Prime doesn't cover shipping from all vendors, which is a bummer.", "verified": true, "helpfulness": "0/0", "author": "Raymonde Gentile"}, {"rating": 3.0, "review": "The ergonomic remote format is easy to use and the set up with the HDMI stick is painless. The multi media menu is fantastic and gives a lot of choice. Here's a few negatives that detract from this otherwise fantastic gizmo.- - The battery compartment is annoyingly difficult to open, remote wheel buttons are wearing out after a month of use.-  The Tv stick occasionally overheats, causing the menus to freeze and glitch.-  No shopping amazon with the stick (if you can buy media with it, why not stuff through amazon?)- - No internet browsing.- - The smartphone app allowing for key entry does not function for all apps running on the stick ( youtube )", "verified": true, "helpfulness": "0/0", "author": "Frank Horrigan"}, {"rating": 3.0, "review": "It's a bit choppy for streaming, but I do love all of the apps it offers.", "verified": true, "helpfulness": "0/0", "author": "Christina B."}, {"rating": 5.0, "review": "Now I can watch all my Prime videos on the big screen!! I love my Kindle  but watching movies is so much better now! We can take all over the house to watch on everyone's  big screen and we can access each of our Prime accounts to take advantage of our individual video purchases....and I can watch Netflix or Hulu...Super tool---super cool!!", "verified": true, "helpfulness": "0/0", "author": "grand-mere d'entreprise"}, {"rating": 5.0, "review": "Good product for the money", "verified": true, "helpfulness": "0/0", "author": "wilson g"}, {"rating": 5.0, "review": "I love my Fire TV Stick ! Awesome", "verified": true, "helpfulness": "0/0", "author": "Angeles"}, {"rating": 5.0, "review": "I love the fire stick, it's great! I just wish prime would have more free shows and movies.  I don't like the fact that they have a few seasons of a show that's included in prime then you have to pay to watch the last few!", "verified": true, "helpfulness": "0/0", "author": "Amber Williford"}, {"rating": 5.0, "review": "Easy to set up. Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Juan C. Moscoso"}, {"rating": 5.0, "review": "Excellent product. Easy to set up and install.", "verified": true, "helpfulness": "0/0", "author": "carolyn orr"}, {"rating": 5.0, "review": "Easy to use and very affordable.", "verified": true, "helpfulness": "0/0", "author": "gammiesquiltes"}]