[{"rating": 3.0, "review": "I've been playing with the new Fire TV Stick for several days now, comparing it mostly to the Roku Player, Roku Stick, and Chromecast.  The interface is nice, it seems well built, but overall I'm less than impressed.  My biggest complaints:The good:-Nice UI, easy to navigate-Cool little remote, which is easy to use-Featured Amazon Prime content is really nice-Good selection of apps available from the startThe bad:-Wifi tends to drop on occasion (using the TV for power or directly plugged in as recommended)-Someone decided it would be a good idea to put the USB port that powers the device on the side of the stick instead of at the end like every other device I've used.  This takes up alot of space when you have several things plugged into the TV-Netflix and Hulu Plus app tend to stutter on occasion - I thought initially it was a networking problem but no other devices (Smart TV app, Wireless Computers, Roku Stick, and two Chromecasts) have this problem-Plex app is not free as it is on Roku, I believe it costs about $3 to purchaseThe ugly:-Plex playback is horrible.  It stutters, for me at anything over 1mbps, and at 4mbps it's unwatchable.  Every other device streams Plex at at least 4mbps (most are usually set higher than that) and work flawlessly.  Tonight I actually unplugged the thing and went back to using a Chromecast in it's place (with no problems what so ever).  Looking online at the Plex forums, it looks like several others are having the same problem.In the end, for the $19 I gave for it I'll bring it to work to use for Netflix, Hulu Plus, and Amazon Prime.  Before paying full price for it, I'd strongly recommend looking at the Roku Stick or Chromecast.", "verified": true, "helpfulness": "5/5", "author": "nuggib"}, {"rating": 5.0, "review": "Very easy to set up and I am really liking it!", "verified": true, "helpfulness": "0/0", "author": "jonald"}, {"rating": 2.0, "review": "I was very disappointed that it doesn't work with the iPhone yet. That was the main reason I bought it. It was faster than the chromecast and cheaper. Plus, it was supposed to mirror the iPhone. So I am not happy with it at this point.", "verified": true, "helpfulness": "0/2", "author": "Frank"}, {"rating": 5.0, "review": "I bought the Chromecast not too long ago as an inexpensive means to get some streaming options on an older TV in our bedroom.  This fire TV stick was announced just before time was up for me to return the Chromecast.  I'm glad I switched.  This thing is much more powerful than the Chromecast.  The interface is very fast and responsive, but you can't even really compare that because the Chromecast doesn't even have an interface.  If your phone or tablet isn't handy, the Chromecast is absolutely useless and it's only marginally cheaper.", "verified": true, "helpfulness": "0/0", "author": "Jason M. Williams"}, {"rating": 4.0, "review": "Really loving the product. But missing HBOGO??? Hoping this will be added to the services soon!", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 1.0, "review": "Difficult to understand interface. Kids purchase movies with out consent. No request to enter password before purchase.", "verified": true, "helpfulness": "0/2", "author": "Shashi"}, {"rating": 4.0, "review": "Very disappointed. This thing was easy to install, update, and run. Then I tried to get Netflix and it's totally locked up, as in non functional. Obviously, this product was rushed to market and not very well thought out. I'm a big Amazon fan, but this is a terrible way to bring a new product to market.EDIT TO ADD:I finally wanted to spend 5 minutes with this STICK to see what the issue was. I did it just now. EXCUSE THE CAPS, BUT YOU WILL WANT TO KNOW THIS STUFF. VERY IMPORTANT!!!!!!!!OKAY, SO WITH YOUR STICK POWERED ON, REMOVE THE BATTERIES FROM THE REMOTE, AND REPLACE THEM. THAT LITTLE TRICK RESETS THE ENTIRE SYSTEM. ALSO WELL WORTH NOTING, AND I NOTICED THIS WHEN PUTTING IN PASSWORDS. THE REMOTE TENDS TO DOUBLE CERTAIN CHARACTERS AS YOU INPUT YOUR INFORMATION. SO, PAY VERY CLOSE ATTENTION TO WHAT'S GOING IN AS YOU INPUT THE USER NAME AND PASSWORD. MINE WORKS PERFECTLY NOW.i AM DEDUCTING ONE STAR FOR LACK OF CLEAR INSTRUCTIONS. THAT SAID, JEFF BEZOS IS ONCE AGAIN MY IDOL. I KNEW HE WOULDN'T LET ME DOWN. SO TRY THIS, AND GOOD LUCK.TO THE REVIEWERS THAT ARE COMPLAINING BECAUSE YOU DIDN'T KNOW YOU'D NEED A CABLE PROVIDER, REALLY????? COME ON. NOTHING IN LIFE IS FREE.ALL HAIL AMAZON AND JEFF BEZOS", "verified": true, "helpfulness": "0/1", "author": "Haywood \"Haywood\""}, {"rating": 5.0, "review": "I've been using a Panasonic blu-ray with apps for quite some time. While it does work, it's definitely not the fastest thing out there- it usually takes a good 2-3 minutes to load up Netflix and sometimes cuts out due to connection slow-down.There are a lot of streaming boxes and sticks out there, but to date nothing has really gotten me to fork it over and pay for it. I finally sprang for Fire TV Stick for two reasons: the very low introductory price of $19 made it a 'shoot, why the heck not' impulse purchase, and the promise of integration with the Fire TV Remote app. I have a Logitech harmony remote that has worked out fine so far, but it's starting to get a bit on the clumsy side due to too many managed devices. Plus, the darn thing is always missing since the baby started walking around. I like the idea of being able to use an app to control things.Having used the real thing now, I can say that this is a really decent device even for the standard going price of $40.The Fire TV Stick comes with five components: a HDMI fob, a remote (batteries included), a power adapter, micro USB power cable, and HDMI flex cable. You need the secondary power hookup for it to work- HDMI does not draw enough power to keep the stick running on its own. The power cable is a good length, however, and the adapter is a nice collapsible low-profile unit. I've seen some complaints about this setup and yes- it would be nicer if you didn't need external power- but I for one don't plan on carrying this thing around with me everywhere I go so it's not a huge issue.Setup with the included remote is very straightforward. The stick requires WiFi to work of course, and if you have WiFi you really should be able to set this up with no hassle- it's not harder than connecting any other device. Once you have it running, you can download the Fire TV app (so far only Android) and connect it as long as your phone is using the same WiFi network. I do recommend users do this, as it's a lot easier to use the app than the remote- including voice search functionality, swipe navigation, and virtual keyboard. This also makes it largely unnecessary to buy the full Fire TV remote as it does the same thing. The app works very well in general- Amazon gets top marks for implementation, though iOS users are currently out of luck.Straight up, the speed and responsiveness of Fire TV stick is impressive. It's especially fast at loading and streaming Amazon content, so if you're already invested in Amazon TV and music it's basically an ideal device. Of course, if you are you probably already own a Fire TV box- unless you were a cheapo like myself. The voice searching works great, but only for Amazon content. You can access other stuff through apps, e.g. Netflix, Pandora, Hulu Plus- but have to resort to virtual keyboard to search those. The device clearly has a decent CPU and RAM, as it loads apps and app content very rapidly- as quickly as a high end tablet.One thing to bear in mind is that this system makes it VERY easy to buy Amazon content. I've already accidentally bought at least one title thinking it was free to stream- you can very quickly click through things and if you don't read carefully you end up hitting 'buy and watch' instead of 'watch' without even realizing it. Set a PIN if you're worried about accidental purchases.Overall, this is a very good streaming solution. Seeing how it performs, I'd not hesitate to buy it for $40. At the introductory promo price, it was an absolute steal. There probably will be future promotions as Amazon cannot help but profit from the use of these things (it does showcase their content) but it's a great device for the price any way you look at it.Pro:Very fast and responsiveVery easy setupInexpensiveApp works well and performs all functionsCon:App is Android only for nowHeavily focused on Amazon content (including voice search)Very easy to accidentally purchase Amazon content", "verified": true, "helpfulness": "0/0", "author": "Yu-Jin Chia \"Yu-Jin Chia\""}, {"rating": 2.0, "review": "You have to pay for alot more then what i thought you did, most movies are not free , even with prime!", "verified": true, "helpfulness": "1/3", "author": "aaron"}, {"rating": 5.0, "review": "Love this product! easy to setup and use. I own 2 Roku`s and Amazon Fire TV Stick blows them out of the water!!", "verified": true, "helpfulness": "0/0", "author": "Alicia Miller"}]