[{"rating": 5.0, "review": "Easy to set up and use - We live in a Rural area and in order to receive T.V. reception, cable or satellite is necessary (if you want a decent package with normal stations cost approx. $50-100 monthly)  -  However, since purchasing this simple gadget, we will be making major cost-cut adjustments. The only reason we are keeping our T.V. servvices is for daily news, sports, weather, current season shows, etc", "verified": true, "helpfulness": "0/0", "author": "Kim Murphy"}, {"rating": 5.0, "review": "Very user friendly. We are very happy with the simplicity. Works amazing.", "verified": true, "helpfulness": "0/0", "author": "Kristi Mlodzik"}, {"rating": 1.0, "review": "All I get while trying to watch any movie is streaming, streaming and more streaming...I read all the threads on line of others with streaming concerns....this just isn't working.  I am going to try it on my best of the best TV and see if that works, if not.....sadness.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Hicks"}, {"rating": 3.0, "review": "Well it does relatively well if you are really close to the router/Access Point.  The range for these sticks isn't good and sure would benefit from an Ethernet port.  Literally right next to each other I ran tests playing Amazon Prime video through the stick, two different Tivos, and a WiiU.  I placed the stick so that it was at least as close or closer to the router with no physical interference.  The Tivos and WiiU played back Amazon Prime video without fault.  The Fire Stick which is presumable designed for this from the ground up had some difficulties.  Video would freeze about every 10 seconds for a second or two with HD content.  On non HD content it did pretty well but that is all old stuff...like SD content from the 1970's.  The Fire Stick also needs to be unplugged when not in use because in my case when it wakes back up I find it slow and the menus highly unresponsive to the remote. I thought the remote's batteries were bad so I replaced those but it didn't help.  Working the Fire app via a Samsung Galaxy Note 3 phone was far more responsive than the included remote control.  I have no desire to turn my mobile phone in to a remote control for the Fire TV Stick.  I also found out that if you loose all internet connectivity then the Fire TV Stick became useless during that time.  Understandably things it needs to stream wouldn't work but things you've downloaded like games or whatever should still work as should screen mirroring when both the Fire Stick an device being mirrored are on the same network.  But nope, Fire Stick figures if there is no internet then its just not going to do anything.  The mirroring of my phone to my TV via Firestick is pretty slick though.  Nothing like reading a kindle book via a huge screen TV being controlled from your phone's Kindle app via the Firestick which as cool as it is leads me to another question. Why is there no Kindle reader for the Firestick?Speaking of Mirroring as I said it is not too bad.  The only downside is if you want to do action gaming with it.  I though I had a perfect setup to get some mobile phone gaming on the big screen using the Firestick.  I have a good phone, tons of games, and a nice Moga controller plus the ability to get my Wii controllers to work with the phone.  So ideally all I'd have to do is Mirror my phone to the Firestick and game away.Well, that is fine for passive game like Solitaire but there is too much lag for much else.  Racing games are definitely out of the question but some others that don't require precision controls might be OK.  I already have an adequate solution for all that anyhow...gaming laptop > HDMI >DONE.TL;DR The Fire TV Stick does most of what it claims but no as well as most consumers would like. It's best left unplugged in a guest room so visitors will have something to watch or you will have something to take with you on trips for those same reason. But will you really need it? We have our phones, tables, laptops and with all of these features already being integrated in to TV sets, Tivo, gaming consoles, and more I don't think there will be a need for them much longer.  For what it is right now I like but give it a C-", "verified": true, "helpfulness": "1/1", "author": "JCR"}, {"rating": 2.0, "review": "The Fire TV Stick has been for very little use in my case because it's fabricated to only work in the US andI live in the Dominican Republic. The only use I have for it right now is for youtube.Even your prime membership si very limited, I tried itfor a month and did not have much use for it either, only for free shipping.Please reconsider.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The best device ever! This is awesome for a TV that a gaming console is not hooked up to; or you can not hard wire internet to the TV! I do not know how I lived without it! So many choices there is no need to even go to Redbox anymore! This is the Best!", "verified": true, "helpfulness": "0/0", "author": "Pamela R Rickard"}, {"rating": 5.0, "review": "Can't believe we lived without this.", "verified": true, "helpfulness": "0/0", "author": "wellness massage"}, {"rating": 2.0, "review": "quirky and strange to find what you are looking for....GUI needs work", "verified": true, "helpfulness": "0/0", "author": "the general"}, {"rating": 5.0, "review": "Love this little gizmo.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Worked as advertised", "verified": true, "helpfulness": "0/0", "author": "Doug Stone"}]