[{"rating": 3.0, "review": "Product does what it is supposed to do, however it is causing some kind of radio interference with my over the air antena which means that I have to unplug my FireStick if I want to watch OTA TV.", "verified": true, "helpfulness": "0/0", "author": "Dan Houston"}, {"rating": 1.0, "review": "It works really slow and I can't install the Amazon Fire TV Remote App on any of my android devices (it's a country issue I guess).Netflix doesn't work.The only useful free app is youtube.Something good? I can pair it with my youtube app on my android cellphone.Edited: netflix works properly.", "verified": true, "helpfulness": "0/0", "author": "Nicolas"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "R. Franklin"}, {"rating": 5.0, "review": "It performed precisely as advertised.  Set up was easy.  If you need to turn a dumb tv with an HDMI port into a smart TV, look no further.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Kaydyn"}, {"rating": 5.0, "review": "Works just like I thought it would. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Tracie Carney"}, {"rating": 5.0, "review": "It was very easy to connect and get started I really enjoyed it.", "verified": true, "helpfulness": "0/0", "author": "miffed"}, {"rating": 3.0, "review": "Works great but it needs closed caption capabilities.", "verified": true, "helpfulness": "0/0", "author": "Purfecteaz"}, {"rating": 1.0, "review": "Nothing about this  product works correctly .  not the remote or the antenna.  it came up on the screen in German and would not connect.Crap crap crap crap", "verified": true, "helpfulness": "0/1", "author": "Ruth E. Dayhoff"}, {"rating": 5.0, "review": "This is a great product if you have a non smart TV with HDMI imput, fast home wireless WIFI, and especially if you are a Prime member, and why wouldn't you be if you are reading this. Easy set up using included cables, batteries, and power adapter. So nice to be able to watch online content away from my laptop. Loaded the Crackle app and watched Comedians in Cars getting coffee without issue but it stopped during a movie and displayed error message and when I tried to resume where it left off it went right back to the error message. This happened before the Fire Stick software update was installed and I have not tried again since that. But this is a super great product especially for the price and the small remote works very well and has a nice design. Also paired with my Android smartphone and voice command does work. Very happy with this purchase and now will be even harder to get any work done around here. This is certainly a CPCD - Couch potato certified device.", "verified": true, "helpfulness": "0/0", "author": "Larry Miller \"Larry\""}]