[{"rating": 4.0, "review": "Great movies! Wish that the membership would include free disney movies!", "verified": true, "helpfulness": "0/0", "author": "kimberly"}, {"rating": 5.0, "review": "I use my my Fire Stick daily but I still prefer the Fire Tv because it is so much faster and there is lag time with this streaming device. I would not have these gripes if I wasn't so spoiled by my Fire Tv. The Stick is still faster in loading lists of movies or tv shows than my Rokus.I like, many others bought this at a discount on a pre-order before Christmas and it was a deal I could not turn down. But the regular price is a deal in itself.I really like Hulu Plus on here because it is an easier version to back up  and re-watch something you missed since normally it is difficult to move around in an episode or movie unlike Amazon where it is very simple.The Fire is a much more open environment where you feel everything feels readily accessible to you unlike Roku where you have the feeling of being shut out because you have to open everything separately.And until I got the Fire Stick and the Fire Tv, I really wasn't watching Amazon Prime that much compared to now. And it is so much easier to find something to watch since it helps you with suggestions plus most movies have a trailer to watch beforehand to help you decide.I did have some connectivity issues at first with this Stick. It would not work right in my side HDMI slot and wasn't working in one on the back that was beneath another HDMI plug. Luckily, this HDTV has a lot of inputs and I was able to put it at the top above the other plugs. Now, I am not having any more issues and the Fire Stick is running smoothly.", "verified": true, "helpfulness": "0/0", "author": "chinagirl \"ncchinagirl\""}, {"rating": 5.0, "review": "Love it and the simplicity of use.", "verified": true, "helpfulness": "0/0", "author": "Barbara L. Snow \"Girlwithasmile\""}, {"rating": 4.0, "review": "A little tough to open the remote to put in batteries, but it works beautifully.  Still figuring out what it can do. With Prime the TV shows are easier to catch up on, which was my main purpose for purchasing the Fire Stick. I love it!", "verified": true, "helpfulness": "0/0", "author": "dlynndboston"}, {"rating": 5.0, "review": "love it- under a minute to set up- just plug it in and go - no need for any technical wizadry- almost instant connection to anything you want to watch- bye bye all that buffering:) highly recommend and have even purchased a second one for bedroom tv:)", "verified": true, "helpfulness": "0/0", "author": "SUZY"}, {"rating": 5.0, "review": "I love this!!! Nothing bad to say!", "verified": true, "helpfulness": "0/0", "author": "Amber beach"}, {"rating": 4.0, "review": "Easy to set up. Easy to use.  Only dislike is the navigational circle on the remote as it doesn't have obvious push points and I often push it in the wrong place thus have to push multiple times.  Still works just not as easy as it could be with an improved design.", "verified": true, "helpfulness": "1/1", "author": "Wendy A Friedt"}, {"rating": 1.0, "review": "Picture keeps freezing, apps dont load, couldn't be closer to the wifi source so I know it's not out of range. Will try to give it back and switch to Roku. I have a couple of these around the house and they work great.", "verified": true, "helpfulness": "0/0", "author": "addrison"}, {"rating": 3.0, "review": "The Fire TV Stick is a cheap alternative to the Fire TV box, and it is obvious. I have had streaming issues since the day it arrived (kudos to Amazon for shipping it earlier than expected). My sister has a Fire TV box that is hardwired to a router and has none of the issues I have had.The Good: There are lots of apps and content to view. It has almost all of the popular services: Netflix, Hulu, Amazon Prime TV (of course). The controller is easy to use and HD supported programs work well.The Bad: Does not have VUDU, so the only way I can watch my digitally owned movies is through Flixster (which does not stream HD). You can tell when it is heavy traffic time because you cannot watch anything due to buffering every 10 seconds. During the heavy traffic times I can switch to my Playstation 3 and stream just fine.Again this is a cheap alternative to Fire TV, Apple TV, and Roku. I wish I would have spent a few more dollars and purchased a Roku so I could stream VUDU. It does work good as long as you have fast internet that does not slow down during the busy hours of the day (5-7pm, 9:30-10:30pm) when everyone is checking Facebook.I would recommend this to anyone who has fast internet and does not have a digital movie library, or needs a cheap streaming device for a kids TV. If Amazon would fix the streaming issues and get a HD VUDU app, this would be a 5-star home run.", "verified": true, "helpfulness": "0/0", "author": "Spencer W Ray"}, {"rating": 2.0, "review": "Couldn't get a connection on my Samsung DLP TV or Denon AVR Receiver even though WiFi signal is strong (Wii at same location connects to WiFi with no problem). Worked fine on Samsung Smart TV that is next to my router but that's not where it was needed.", "verified": true, "helpfulness": "0/0", "author": "mariasepa"}]