[{"rating": 5.0, "review": "Love it, have Netflix now that works", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Golferlady22\""}, {"rating": 5.0, "review": "This is an amazing streaming device! The reasonable price is a big bonus. ;)", "verified": true, "helpfulness": "0/0", "author": "Witchy"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "James hunt"}, {"rating": 4.0, "review": "I only wish it was like TiVo where I could record the live shows.", "verified": true, "helpfulness": "0/0", "author": "Christine Duprea"}, {"rating": 5.0, "review": "OUTSTANDING!", "verified": true, "helpfulness": "0/0", "author": "Vince Barnes"}, {"rating": 5.0, "review": "The fire stick is awesome. Works great and the cord to plug it in to the outlet is very convenient so I dont have to worry anout charge. Super easy to use and Amazon already had it registered to my Prime account so we could start watching movies! Highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "This is a great addition to our TV line up. Love it.", "verified": true, "helpfulness": "0/0", "author": "AUbTgrs1"}, {"rating": 5.0, "review": "Loving this so far! So easy to use, and so many apps! Easy to install, and easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Hattie Wheatfield \"HattieWheatfield\""}, {"rating": 5.0, "review": "The Stick does everything and more as advertised.", "verified": true, "helpfulness": "0/0", "author": "Carl Roberts"}, {"rating": 2.0, "review": "Bought two on introductory Prime special. At $20 each I am still disappointed.PROS: Remote works without line of sight. Small size, hooks up easily to TV and network.CONS: Wow, need a numbered list here...1. Poor picture quality on Amazon videos. On 120MB FIOS line, pretty sure it's not my bandwidth. Have worked through this with Amazon support, and while they were helpful, and actually sent a replacement, here's the typical scenario: Start show or movie, suffer through 45 seconds of 240p quality. After 45 seconds upgrades to 480p quality. Never improves beyond that. Amazon support said their end showed my bandwidth at less than 1 mb, but I ran speedtests immediately upon them telling me this, and was running 121 mb. This is a known issue when watching Prime in a browser, didn't realize Amazon's inability to accurately determine your bandwidth was going to be an issue on the Fire TV too. No issues with Netflix, beautiful HD picture within 3-4 seconds of playback beginning. After a factory reset, same issue persists when watching Prime on both devices. Took it to a friend's house, had same problem on high-speed cable.2. Lousy remote control. Remote is very glitchy and jumpy. Try scrolling sideways through a list of movies, will randomly jump 3-4 when giving a light tap to move over 1 show. Push the other side of control to back up and will jump 3-4 shows the other direction. Reboot the stick, works for a day or two, then starts glitching out again.3. Setup video is agonizing to watch. Even more agonizing when you have to set up more than one device. Makes you nearly suicidal when you then have to reset them both repeatedly in an effort to get them working. Why no option to skip the video???4. Friendly customer support, but in a serious state of denial. There is no known issue with streaming quality. Period. Please don't look on any forum discussing it, or God forbid you read an unbiased review noting the issue. It must be your internet connection. Or the fact you live in the USA.5. No content. Okay, maybe I need help with this one. Amazon brags about the millions of songs, TV shows, and movies available to stream with your Prime subscription. I cannot find them. Maybe 40-50 shows and a handful of worthless old movies. If I have to pay for content, I would rather do it on Apple TV because at least the picture quality is flawless.", "verified": true, "helpfulness": "0/0", "author": "Joel P"}]