[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Mary J. Young"}, {"rating": 3.0, "review": "I love the fire stick in that I can customize it due to the android platform. I installed kodi with some creative measures requiring a bit of cmd know how.The problem I have with the stick is its wireless connectivity. The stick loses connection frequently and buffers often through kodi, Amazon, and HBO go. I have other devices including my roku in the same location that handle the wireless connection much better.I wish I would have went with fire tv instead of the stick invade it had better wireless. Hopefully improved firmware will come soon or perhaps Amazon will offer a new model replacement when it launches the next generation.", "verified": true, "helpfulness": "0/0", "author": "jeremy"}, {"rating": 5.0, "review": "mainly used by my teenage daughter.  She is very happy with it and can \"binge watch\" entire seasons of whatever she wants", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "Awesome, I don't know why I waited so long to try it. Absolutely nothing to dislike about this device.", "verified": true, "helpfulness": "0/0", "author": "Warren"}, {"rating": 5.0, "review": "Loved  super easy to use. Response suoer fast", "verified": true, "helpfulness": "0/0", "author": "cubita \"cuban\""}, {"rating": 3.0, "review": "The Fire TV Stick worked, as advertised. I was hoping, though, that it could be part of a cable-free solution in our home. Technology, broadcasting, and regulations seem to have a long way to go before cable-free becomes real and convenient.", "verified": true, "helpfulness": "0/0", "author": "Lou Soileau \"Lou - avid reader/student\""}, {"rating": 5.0, "review": "This was everything it was promised to be. It was very easy to hook up. I love it !!", "verified": true, "helpfulness": "0/0", "author": "acccpa"}, {"rating": 5.0, "review": "Why doesn't the Fire stick remote have a Chinese take-out/pizza delivery button?I mean, we are striving for perfection here, yes?", "verified": true, "helpfulness": "0/0", "author": "DeeZon"}, {"rating": 5.0, "review": "Love this product!  Bought it for my mom and installed it in less than 5 minutes.  Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Jeff Martini"}, {"rating": 4.0, "review": "Works great and we're enjoying free content and Netflix and others without a hitch.", "verified": true, "helpfulness": "0/0", "author": "Big Foot \"Big Foot\""}]