[{"rating": 4.0, "review": "The only reason I am not giving it a 5 stars is because of no HBOGO.", "verified": true, "helpfulness": "0/0", "author": "Travis Steele"}, {"rating": 4.0, "review": "I got this for $19 when they had a pre-order sale. I'd say that this works well and for the price, it couldn't be beat. Lately, I've been having some issues loading Prime TV when I'm not having any issues on my XBox One. This wasn't the issue when I first bought it, so maybe it's a bug.Anyways, ease of use is terrific and performance rivals the Chromecast. It's very light and portable. The included remote is a bonus and works well. Now, I can watch Prime TV shows/movies almost anywhere with this device.", "verified": true, "helpfulness": "0/0", "author": "MkVsTheWorld"}, {"rating": 5.0, "review": "This meets all my expectations. I need several more!", "verified": true, "helpfulness": "0/0", "author": "Woody"}, {"rating": 5.0, "review": "Great little device.  Impressive sources for live streaming media and highly customizable options for user.  Far more useful and flexible for my purposes than roku or chromecast.", "verified": true, "helpfulness": "0/0", "author": "James K. Ballard \"jkenn\""}, {"rating": 5.0, "review": "Great alternative to having to plug in my laptop all the time! Great quality and super easy to use! Great for anyone not wanting to pay for cable! Awesome product for the money. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Badgernboilermakeratheart"}, {"rating": 5.0, "review": "This is a great device. We're upgrading from our 3 year old roku HD, which we loved but it's slow and the interface was dated. The Fire TV Stick is significantly faster, the UI is easy to use, and the video quality is excellent. The manual does not recommend connecting the USB cord into the TV for power, but we are not having any issues doing this with our Vizio TV. I would recommend this to anybody with a Prime account.", "verified": true, "helpfulness": "0/0", "author": "wargski25"}, {"rating": 4.0, "review": "I replaced my Chromecast with the Fire TV Stick. I like that it had Miracast. My only two issues are that I occasionally have lag with the input; one example is where I was browsing clicked right just once and it went to the right 5 or so times as if I was holding the button down but I wasn't. The other issue is requiring one click payment to be set up. It isn't a problem for me exactly though I would prefer it if the system was similar to the Google Play Store where you can skip filling out billing info if the app is free. You lost a customer(not me; They bought one and returned it) because the one click setting being required to download free apps upset them. There remark to seeing that requirement was, \"Then it must not be free, if it was it wouldn't need my information.\" They don't trust putting their information online or through a phone... Apart from those two things it is great and better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "xryz"}, {"rating": 3.0, "review": "Disappointed.  It took a while to set up and download the updated software.  Seems to work well, watched a movie with no problems or delays.  Unfortunately  the mirror function only works on their large tablet, which I  don't recall being mentioned in the ads.  I can use my Samsung tab as a remote, but haven't been able to get it working on my Fire hd 6.  It definitely does less than my Chromecast.  The biggest advantage is that it shows Amazon movies smoothly.  Haven't tried the game feature yet, which is a nice plus.  Would rate much higher if I could mirror from my Fire 6 or non-Amazon tablet.  Like having the remote, but a better tablet control app would be nice.", "verified": true, "helpfulness": "0/0", "author": "Sereneor \"Sereneor\""}, {"rating": 5.0, "review": "Sure beats the Google TV stick. The real remote makes the difference.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Grandpa\""}, {"rating": 5.0, "review": "This is well worth buying.  I have subscriptions to Netflix and Amazon and I can watch either using the Fire TV stick.  It's easy to set up and move from room to room.  You won't regret this purchase.", "verified": true, "helpfulness": "0/0", "author": "CMac88"}]