[{"rating": 5.0, "review": "LOVE my Fire Stick!  Opens up a whole awesome world of entertainment right in my own home.", "verified": true, "helpfulness": "0/0", "author": "Lisa Andrews"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "peter"}, {"rating": 5.0, "review": "My wife loves this thing. We put it in my kids play room and turned their TV into a smart tv in seconds. Great product", "verified": true, "helpfulness": "0/0", "author": "Mr&MrsDeuse"}, {"rating": 3.0, "review": "Like the ease of setup. Was disappointed that they don't have the cable TV apps for fire stick which was one of the reasons I wanted another stick. I also have a roku which does have the twc app so I don't need another cable box and monthly charge. The Netflix app works great as do crackle and such.", "verified": true, "helpfulness": "0/0", "author": "Hot Cocoa"}, {"rating": 5.0, "review": "We love it! We bought it to take with us in the RV AND I THINK ITS AMAZING AND WILL BE PERFECT.", "verified": true, "helpfulness": "0/0", "author": "Jane Ford"}, {"rating": 5.0, "review": "I love the fire stick.  I have no complaints at all about this device.  I have been using it for a couple of weeks now and it is doing everything is says it does.  I really do love the fact that I can set a pass code so the kids are not just watching anything they want or making purchases without my permission.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "perfect for what I needed. Can watch my netflix or amazon prime streaming easily. I am not very technologically gifted and was able to set this up myself with is a definite plus", "verified": true, "helpfulness": "0/0", "author": "Cal"}, {"rating": 5.0, "review": "So far so good. This is to replace roku. My question is why am I paying for movies on Netflix ?", "verified": true, "helpfulness": "0/0", "author": "Janis Lorenzen"}, {"rating": 4.0, "review": "Ohhhhh this is way cool.!!... The FireStick is only about a foot away from the router, so the signal is strong. I control it with either my Galaxy S5 phone or my Nexus 10 tablet.... Turns the TV on, and everything, even have voice Command!!!", "verified": true, "helpfulness": "0/0", "author": "Michael T. Koralewski"}, {"rating": 2.0, "review": "Just got the stick today and I'll tell you one thing, I have a greater appreciation for my 4 year old Roku2 HD that came free as a promotion from my old ISP. I originally connected the stick to my Samsung 32\" tv to see if I needed the extension, it couldn't even find my wifi network (the router is about 30 feet away). I moved the router slightly closer and higher and it found it and connected but kept dropping the signal. Decided to try the dinky HDMI extender... what a useless piece this is. I don't know about your TV but all this little extender did was make the stick dangle awkwardly behind the TV. It might have been useful if it had some length to it.I honestly don't know where companies are getting their WiFi cards anymore. I returned a smart TV because it couldn't connect to a WiFi router 15 feet away and was told by support that this was \"normal.\" When the technology is marketed as a WiFi device, maybe make sure the WiFi is not complete garbage. I have an $85 dollar ZTE smart phone on Virgin Mobile that stays connected to the WiFi anywhere in the house and even to the end of the driveway which is is on the opposite side of the house from the router. I don't expect that since it has a mobile data connection, it should not outperform a device that is only useful if the WiFi works.I moved the stick to a small TV in the spare bedroom where the router is and it seems to be working okay though it is very slow as other reviewers have mentioned. The search function is horrible and navigation is pretty bad too though a lot of that is because the NetFlix App is pretty terrible. Once I get something up though, the picture is pretty good except on old shows like the first few seasons of Scrubs. I really don't expect the quality to be great there. The stick did stream Sons of Anarchy in a pretty good quality but this is on a 24\" 1080p Hannspree TV so not a real stretch.The only reason I gave this 2 stars and not one is that now that I pretty much have it duct taped to the WiFi hotspot, it seems to be functioning pretty well for a $40 piece of equipment. I'm disappointed because my Roku 2 (an upgraded version of which is available for $66 on amazon) is running circles around this thing. I took the Roku, which was in the bedroom where the stick is now, and connected it to the Samsung TV and without missing a beat it connected to the WiFi and is streaming HD (only 720p sure) where the stick failed. The most frustrating part is that the stick showed \"good\" signal strength while dropping out every 30 seconds on the Samsung.Overall I'm very disappointed in Amazon's product. Maybe the $99 quad core full Fire TV box is better equipped but I'd be hesitant to even try it given the experience with the stick. Honestly you're better off buying an off lease desktop (you can find them for <$100) with a core 2 duo and using that for your media hub than bothering with these little stand alones. No limit on the content either. Hulu limits what I can stream on a Roku or fire stick but a computer is fully unrestricted and if you know what you're doing (optimizing old tech), a much better option than something you can't optimize.", "verified": true, "helpfulness": "0/0", "author": "AdamPA"}]