[{"rating": 5.0, "review": "Much faster than going through the bluray player or Xbox. I highly recommend downloading the app and putting it on your tablet or phone. The Voice Search is the best. This gives access to all of your paid services and of course all of your Amazon prime content. The best part is you don't have to wait for your Blu ray or Xbox to connect to your network. This device is always connected.", "verified": true, "helpfulness": "0/0", "author": "Michael Graber"}, {"rating": 5.0, "review": "This thing is amazing.  It is faster and easier to use than Roku and Apple Tv and gives you access to hundreds of thousands of  hours  of  streaming entertainment.  Enough said. Buy it!", "verified": true, "helpfulness": "0/0", "author": "B boy"}, {"rating": 3.0, "review": "Easy to install, nice on-screen instructions.  You MUST use the included USB power pod, and it's HDMI only.  Also there's no Ethernet jack.  My biggest issue is that I don't think the picture quality on Netflix is as good as my Roku, there are more digital artifacts.  Otherwise seems fine.BTW I got this when it was first introduced, paid a LOT less than what they're charging now, so I'm especially happy about that.", "verified": true, "helpfulness": "0/0", "author": "Neil in NC \"The real Neil\""}, {"rating": 4.0, "review": "Love the product. Have owned Apple TVs, Ruku box and stick, and Chromecast – this is clearly better. Installation was a breeze. Expect an update (which took about 5 minutes) before you can fully use the product. Was able to get Netflix and Hulu up and running without a problem. Amazon Prime was automatically connected. Should have purchased the upgraded voice control remote. The current remote is not bad – but when you are searching for titles, clicking the letters might take a while. Wish there was remote with a keyboard. Only gave it four..because I feel it could use a better remote.  A backlit version would be great.", "verified": true, "helpfulness": "0/0", "author": "Sebastian"}, {"rating": 5.0, "review": "hey, I got it for $20 so there's no way I'm complain but I am impressed at its speed and \"power\"! Everything I own is \"smart\" now so the only reason I bought this was the curiosity factor but who knows where this will lead...take it to a friend's house? maybe! For me and most people who have gaming devices or smart tv's this is not really a need to own device BUT for travel and for family members who DON'T have a ten smart advices, this is a great gift idea...its really only \"worth it\" if you have Amazon PRIME, which I do so its all good but PRIME isn't free and neither is a lot of the content...I'm still amazed at the elevated cost to own a digital download!", "verified": true, "helpfulness": "0/0", "author": "Duane Hatton \"Big Belter\""}, {"rating": 5.0, "review": "What Can I say? The Fire TV Stick has completely replaced my Chromecast devices in may house. The Fire TV Stick does pretty much everything Chromecast can do and tons more. I like the operation with a remote and/or your phone/tablet device. Also cool is the ability to play games and control them with the included remote or an optional joystick. Setup was way easier than Chromecast, and did NOT require a computer or anything.I recommend plugging the Fire TV Stick into a power outlet with the included adapter as this thing definitely needs the 5W of power to operate (Your TV MAY have a powered USB slot but it will likely Underpower the Fire TV Stick should you go that route)", "verified": true, "helpfulness": "0/0", "author": "Richard Bishop"}, {"rating": 1.0, "review": "Have been excited to try the Fire stick since it was announced; have an Apple TV and a Roku, but wanted something portable to use on the road, at work and at my cottage.So when it finally launched -- at the tidy price of $19 -- I just couldn't say no. Now, I wish I had, or at least paid full price as I am gathering the promotional rate was only for decorative, non-functioning models. I say this because, since it arrived at 11 a.m., it has not powered on, no matter what slot on what TV and what power source I use -- including three sets of batteries. I've also used two Vizios, a Samsung, a Sony, an Element and an RCA TV ... nothing; have plugged it into various power outlets and the USB ports on all TVs.... nothing.", "verified": true, "helpfulness": "0/2", "author": "ajw1978"}, {"rating": 5.0, "review": "Love every bit of it.  So reasonably priced!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"hellcatzach\""}, {"rating": 1.0, "review": "I've been a roku user for years, and recently got a chromecast.  Both work well, although I prefer the roku.First on the hardware, there's a couple of annoying features.  The ring at the top of the remote.... can't be used as a dial.  It's just hiding 4 buttons... which you'll be pushing often.... very often.  I'll explain later.  Actually it's 5 buttons, 4 under the ring, and 1 in the center.  Seems like they could put some indication that there's a button there.The stick itself is ok, but strangely it plugs the power in from the side.  So it actually blocks two slots because the power cable sticks out to the side.  Not only that but it's fairly power hungry, so it doesn't work with standard USB power, at least the one my samsung TV provides.  So you need a wall wart... which of course blocks more than one power outlet.  Sure there is a dongle included for HDMI, but still seems silly.  My chromecast fits in a single HDMI socket, doesn't need a dongle, and doesn't need a wall wart.The UI seems glitchy.  Sometimes it just goes back to home.  Scrolling through long lists to browser new movies for example is rather annoying.  You either have to hold the button down and often undershoot/overshoot, or hit the button 100 times to get through 100 movies.  Quite strange when they display 6-8 movies at a time.  Why not allow one of the bottoms to slide 6-8 movies over?The UI often seems to get hung in a loop.  Often the pause/play button gets stuck.  So I hit it pause/play and it displays the series, episode title, and position.  If hit it again it goes away... but doesn't start playback.  Similar for the hidden button in the center of the ring.  Even if I hit back to the episode selection and click on \"resume playback\", it starts a frame or two... then pauses.  Then I'm stuck in a loop again.Generally seems almost workable, I suspect there will be a software update soon.  But generally I'd say it's more general purpose than a chromecast which is best used with a tablet/phone/desktop.  But not NEARLY as nice to use as a roku.", "verified": true, "helpfulness": "0/3", "author": "Bill B \"bike\""}, {"rating": 5.0, "review": "Works flawlessly, easy price, easy setup. Streams all my Prime movies, music flawlessly. Instant access to all my photos (stored for free in Amazon cloud storage) and my friends are amazed seeing the pics in glorious high def. on my 60\" HDTV. While doing chores around the house I just cue up my music (get to try out new artists and albums with FREE streaming of so many different selections).", "verified": true, "helpfulness": "0/0", "author": "Lologuy \"cracked PDA\""}]