[{"rating": 1.0, "review": "After 2 weeks, it start to freezing or says no internet connection. I have to unplug and plug back. What's going on?!!!", "verified": true, "helpfulness": "1/1", "author": "Willy Chen"}, {"rating": 4.0, "review": "Had one incident where i had to reset the network and all other devices were working.  I like it thought.  I like when we go on vacation I can easily unplug it and take it with us.  Has all the major streaming services.  Can even get prime music.  Thinking about getting a second one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "ßcott"}, {"rating": 5.0, "review": "I bought this at the special price of $19.99. I've been playing around with the features and the best thing with this device is that you can sideload apps! (although slightly inconvenient to execute side loaded apps, but not too bad). I've installed xbmc which basically converts it into a media center (e.g. good for everything from videos from your upnp servers or stuff on the internet or even your own custom screen scraped items!)Since this runs android, you can run most anything (almost) out there. I've had success with emulators (although it only supports a few controllers), media programs, and games...Again, since this runs android (and can side load apps), it makes my Chromecast obsolete (and I thought Chromecast was the best thing since sliced bread when it came out!).Some minor downsides though are* Lack of bluetooth joystick support other then the one from Amazon/Nyko (e.g. I can't use my wii controller!)* No usb in (e.g. to plug in the Xbox360 controller receiver)* It takes a few menu selections to get to the side loaded apps* It seems that a normal usb port doesn't provide enough power (You have to use the adapter)But, you can't go wrong with this device!", "verified": true, "helpfulness": "1/1", "author": "Uhyon Chung"}, {"rating": 4.0, "review": "For the value price pretty good. needs more apps .AAAA+", "verified": true, "helpfulness": "0/0", "author": "randy"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "SuzyQ"}, {"rating": 1.0, "review": "By far the worst experience I ever had with any product from Amazon. I wanted to love this device, but all of the positives are completely outweighed by the negative experiences i have thus far. I am a long time Amazon Prime member and when noticed the Fire Stick was on sale for $20 USD i thought it was a no brainer to get the device. This unfortunately is where the good news ends...First and foremost the first device that arrived did not function properly however was quickly replaced by Amazon after some specific troubleshooting did not work. The second unit arrived and was functioning better, but not up the the level I expected.1. The wireless connectivity is not stable- works great wit the 2.4GHz band, with the 5.0 GHz not even showing up until after the initial firmware update- the firmware update takes a long time with the download and install, being that it just arrived I would have expected it to be up to date- after the upgrade the 5.0 GHz band shows up on the list of networks, but drops too often to even start a TV show2. The menu is not intuitive or complete- there is no way to restart the device without hard unplugging it from the wall, how can there not be a reset button and/or option?!?- the parental controls are limited, not allowing you to restrict certain content (by ratings, age, etc)- the option to install additional applications is not readily available through the stick3. Interoperability & Usability- does not seem to work with the highly rated HDMI splitter, although i am still working with support to confirm- no iOS application yet for the remote- overall, if the option to airplay the amazon prime app on my phone was an option I would pay for it rather than use the stickDon't get me wrong, I am not an Apple TV only user, but when it comes to a device that my kids can use it just doesn't fit. I am sure with the next hardware revision this will all be fixed and will be a much better device. The hard part comes where I would need to decide if it was worth the original retail price. At $20 bucks, I am looking for ways to make it worth the investment, if it was $40 bucks - this thing would have been in the first box back to Amazon as defective and not functioning as designed.", "verified": true, "helpfulness": "1/2", "author": "royhova"}, {"rating": 3.0, "review": "Great idea but needs improvement.  The response can be very slow when pushing the buttons.Not sure if the control device is working as designed or maybe I have a bad one.", "verified": true, "helpfulness": "0/1", "author": "SomeGuyInPhoenix"}, {"rating": 4.0, "review": "like it", "verified": true, "helpfulness": "0/0", "author": "Ref"}, {"rating": 3.0, "review": "Not a lot of games to play. Works with any simple streaming app. Netflix. Amazon prime. Pandora", "verified": true, "helpfulness": "0/1", "author": "jiovani gonzalez"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Skip Adams \"ezrdr\""}]