[{"rating": 5.0, "review": "Excellent Product, we love it!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Richards"}, {"rating": 5.0, "review": "Very pleased", "verified": true, "helpfulness": "0/0", "author": "Barbara Joseph"}, {"rating": 5.0, "review": "Pretty good so far.", "verified": true, "helpfulness": "0/0", "author": "Luther Bowens @lutherbowens"}, {"rating": 5.0, "review": "Works very well.  Good service when shipping to me.", "verified": true, "helpfulness": "0/0", "author": "Diana L. Barsness \"Jewelry Fan\""}, {"rating": 5.0, "review": "I am loving it..", "verified": true, "helpfulness": "0/0", "author": "Richa"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick is really easy to set up, especially on a new network, which is great because I got it for travel. If you have an Amazon account it enriches your experience, but other apps are good on it too such as HBO Go. I like the interface and how well it works with my photos & music. It is a much different media displaythan my Roku 3 and I like that, maybe not better, just different.Tip: My 1st Fire TV Stick had problems connecting to my home network and the remote skipped all over, but after troubleshooting failed exchanging it from Amazon it works well & they were very nice. Mine seems to work better using the HDMI extender all the time. Take the updates when they come to prevent slowdown and you'll be fine. Also you should be able to power it from your TV's USB, which I think is necessary as the cable is usually too short to reach an outlet. Loses 1 star for short power cable and small app selection (though this may change).", "verified": true, "helpfulness": "0/0", "author": "A. Soffel"}, {"rating": 5.0, "review": "lovin this new toy!", "verified": true, "helpfulness": "0/0", "author": "karena"}, {"rating": 5.0, "review": "Works great with Kodi.", "verified": true, "helpfulness": "0/0", "author": "jaime taff"}, {"rating": 1.0, "review": "It is constantly searching for the internet and buffering. I have a great internet connection and it the router and modem are in the same room as the device. It is clearly faulty.", "verified": true, "helpfulness": "0/0", "author": "Nathan F."}, {"rating": 5.0, "review": "This is a great product, highly recommend it. Easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "2 tropical dogs"}]