[{"rating": 3.0, "review": "Pros: Really easy to use, access to tons of online content/apps.Cons: The content delivery is slow and the internet connection drops off every once in a while. Many times, something I am watching through the Fire Stick will start freezing up, so I'll finish watching it on my computer. Given that my computer is in the same room and on the same WiFi network as the stick, it means that the stick itself is causing the connectivity/buffering problem. If this was fixed, it would be a 5 start product. However, as is, it's at best a 3 star if not worse.", "verified": true, "helpfulness": "0/0", "author": "Kate Dalton"}, {"rating": 1.0, "review": "Did not like it.  Took it back.", "verified": true, "helpfulness": "0/0", "author": "Barbara  Reed"}, {"rating": 5.0, "review": "So much better than Google Chromecast.  I love the fire stick.  I have 4 of them.", "verified": true, "helpfulness": "0/0", "author": "Matthew G. Watford"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Henrique Pardini"}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Jennifer Martinez"}, {"rating": 5.0, "review": "I think is lot better then cable", "verified": true, "helpfulness": "0/0", "author": "Bertha"}, {"rating": 5.0, "review": "I love this thing! This replaced a chromecast I had, I hated that the only way to do anything on my chromecast was always through my phone or tablet, sometimes I just want a remote and an interface so I don't have to get out my tablets and little things like fast forwarding or pausing required more work that just hitting a button on a remote.The interface is great, I don't notice it being slow, I had a couple issues with netflix that I think is a widely known problem but I am sure it will get fixed.Like the chromecast it cannot connect to 5.8Ghz N connections which is kind of a downer as that is my main wireless connection.", "verified": true, "helpfulness": "0/0", "author": "Sam Stephenson"}, {"rating": 3.0, "review": "I only gave the Fire TV stick three stars because I bought it to replace a problem I was having with my Roku device streaming Hulu. The Fire TV sticks steams Hulu but with alot of buffering and a black screen after ads.", "verified": true, "helpfulness": "0/0", "author": "Brenda Meira"}, {"rating": 5.0, "review": "Works greae . We get more channels then expected", "verified": true, "helpfulness": "0/0", "author": "RODNEY GLASSFORD"}, {"rating": 5.0, "review": "I love the Fire stick; however,and I am not sure where the blame lies, seems like when the movie or tv show starts, it freezes for a bit and then sometimes will do that intermittently through the show.", "verified": true, "helpfulness": "0/0", "author": "jll8119"}]