[{"rating": 3.0, "review": "lags a little and cant hook up sound sytem for audio.", "verified": true, "helpfulness": "0/0", "author": "Abel Moreno"}, {"rating": 5.0, "review": "Love my fire stick every amazon prime person should have this product. It is easy to use one of my better purchases", "verified": true, "helpfulness": "0/0", "author": "Dennis Miller"}, {"rating": 5.0, "review": "I would order this Fire TV Stick again in a heartbeat!!!  I love the fact that all I have to do is push any button on my the remote and not only will it turn on my TV but will also turn the TV to the correct input.  I was able to set it up in about 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "DivaMama"}, {"rating": 5.0, "review": "I like the way this product works. Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Awesome!  Amazon Firestick, where have you been all my life?", "verified": true, "helpfulness": "0/0", "author": "Tracie"}, {"rating": 4.0, "review": "This item is great.  Only reason I give it 4 stars is because Amazon Fire TV box is better.  Goes well with Amazon Prime if you have it.", "verified": true, "helpfulness": "0/0", "author": "A Dad \"Chris\""}, {"rating": 5.0, "review": "Still in the learing stage, so far ok. Lot to learn about web sight", "verified": true, "helpfulness": "0/0", "author": "Paul M. Huffines"}, {"rating": 5.0, "review": "I was hesitant to buy a wireless video device for my master bedroom but the fire tv stick was a piece of cake to setup and it found my wireless network the first time. Now I can stream netflix to my master bedroom or just about anything for that matter. If you have an extra tv setup in a bedroom don't add a cable box and pay the cable company more money just add a fire stick and give guests something different to watch.", "verified": true, "helpfulness": "0/0", "author": "Michael Asher"}, {"rating": 2.0, "review": "Sadly, VERY sadly disappointed.  We live in a rural area with very low download speed (about 1.5 Mb per second.)  Movies or TV episodes constantly buffering, and it does no good to pause and try to build up time that way (a trick that works on our Apple TV.)  I called Amazon, a pleasant enough experience, but was told that Amazon prime requires a minimum of 2 Mb per second.  Most people would have no trouble with that but we live in a remote area and are lucky to have even this slow DSL connection.  I was told if we turn off the WiFi to our tablet and to our computer that may help.  Will be trying that, but relying on Apple TV for now.", "verified": true, "helpfulness": "1/1", "author": "T. Janke"}, {"rating": 2.0, "review": "As of right now, I am disappointed but hopeful.  I was so excited to start using the Fire Stick but I hooked it up (super easy), tuned to the correct input on my TV (a little harder but easy enough to figure out), and then.... Nothing.  Just an Amazon logo that flashed and went away.  Tech support was super helpful and efficient and they are sending a new Fire Stick.  My experience dealing with Amazon has been awesome but the bottom line is that the product didn't work when I received it.  But I am hopeful that once it does work it will be great.  We'll see....", "verified": true, "helpfulness": "0/0", "author": "Stephanie Franek"}]