[{"rating": 4.0, "review": "No complaints outside of the fact that I wish the voice-activated remote option didn't cost so much. I might as well have spent money buying the Fire HD if that's the case. Overall very impressed with this as I am with the Chrome", "verified": true, "helpfulness": "0/0", "author": "M. Berrios \"callmemig\""}, {"rating": 3.0, "review": "I like it but it's pretty much like having a blue ray player or Xbox for netflix access ect", "verified": true, "helpfulness": "0/0", "author": "clotheswhore \"GM\""}, {"rating": 1.0, "review": "Yay a little stick that you can plug into any HDMI port and get amazon video on......no wait you have to plug it into a power source, even on my Smart LG TV the usb port is apparently not good enough....oh and then it only actualy works on Hitachi, JVC, LG, Mitsubishi, NEC, Panasonic, Philips, Pioneer, Samsung, Sharp, Sony, Toshiba, Vizio, and Westinghouse..... Does not work on all TVs that support 1080P/720P 50/60hz on HDMI such as my 2nd TV I bought this for which is an Apex.", "verified": true, "helpfulness": "1/2", "author": "Tony"}, {"rating": 1.0, "review": "Unit is not working, Connected it to wifi, it has access to internet, however it will not let me sign in keeps telling me my username/password is wrong. I am a IT guy and this is nothing new to me, made sure pw is correct, same error, changed password, same error, tried to make a new account, technical problem has occured, overall ive spent apx 2 hours troubleshooting this fire stick and am still unable to see what it can do if anything.", "verified": true, "helpfulness": "0/0", "author": "Chris Ivins"}, {"rating": 5.0, "review": "Awesome!!! Easy setup and virtually invisible.", "verified": true, "helpfulness": "0/1", "author": "S. Chavana"}, {"rating": 4.0, "review": "for some reason I keep losing connection in my TV! But when connection is good I have a really good time!", "verified": true, "helpfulness": "1/1", "author": "satto66"}, {"rating": 3.0, "review": "Not the easiest way to browse for available films, as you have to enter titles. It's OK, but not great!", "verified": true, "helpfulness": "0/0", "author": "Cynthia L. Hoye"}, {"rating": 5.0, "review": "Awesome idea.  works great if you do not have a Smart TV.  If you don't have a Smart TV, like our living room TV, then you may have only 1 HDMI connection.  Our Sony is from 2007 and had only 1 HDMI port, and we use that for our cable.  I had to get a splitter and another HDMI cable wire to make it work, but its great!", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Todd"}, {"rating": 5.0, "review": "I received the Fire TV Stick as a gift and love it. Easy to use and navigate.Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Donna Mulhall"}]