[{"rating": 5.0, "review": "Fast and easy to set up and use.  Only issue is getting the batteries installed.  A real pain to get that back cover off. Amazon probably knows this and hopefully will improve this in the next generation.", "verified": true, "helpfulness": "0/0", "author": "Gerry Santora"}, {"rating": 5.0, "review": "Excellent product.  Easy setup.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "David Grawe"}, {"rating": 5.0, "review": "Love the fire stick. Simple and easy to use. Runs quick and has tons of apps. I mainly use it to watch sling tv, Netflix, plex and Amazon prime. A new favorite function is using this and my free Amazon cloud photo storage to run a screen saver of all our family pictures on the tv.", "verified": true, "helpfulness": "0/0", "author": "BNak"}, {"rating": 5.0, "review": "Works just like I expected it too and so much better than the two roku streaming sticks I had.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to attach and user friendly once its on.", "verified": true, "helpfulness": "0/0", "author": "CranberryLady"}, {"rating": 1.0, "review": "Apparently since our wifi is 15 whole feet away from this stupid stick, it needed to buffer every 2-3 minutes. Piece of junk. You lie Gary Busey! Not sure why this is sooooo much worse than the Fire TV, cause that works fine, but this was just awful. I would not recommend.", "verified": true, "helpfulness": "1/2", "author": "Kelly Whalen"}, {"rating": 4.0, "review": "Awesome device but PLEASE! Remove the annoying tutorial!!!! Or give us an option to skip it!", "verified": true, "helpfulness": "0/0", "author": "OC"}, {"rating": 4.0, "review": "This is very simple to use and it works wonderfully but my problem is with the variety of free selections--for example, some seasons of Good Wife are free, others have a fee; the PBS show Doc Martin also has a fee, etc. We'd use it more if more was available--for free.I ordered this and it took several weeks to arrive. Apparently they were out of stock but no mention of that was made at the time of purchase.", "verified": true, "helpfulness": "0/0", "author": "havanese mom"}, {"rating": 4.0, "review": "Bought this to replace our Roku which had died after a couple years of use. We were using our Wii in between waiting for the Fire stick to arrive.  First of all they don't give you any instructions other than plug it in and it is supposed to automatically connect to the remote if not change the batteries. Duh! It did not say how to put the batteries in the remote so I had to Google it. I suppose if you buy electronic items more often that I do you would have figured it out without Googling it. When I added the Netflix app it come up with all the original selections without my preferences without my My List nor my Recently Watched, it stayed like this for a couple hours which was annoying but eventually it corrected itself.I get the concept of adding Apps to my selection and I use the Apps to access different things just like your phone or Ipad so that was easy. I would have liked more  clarification/separation among the apps I would have to pay for content and those which I could access content for free. It keeps buffering several times during movies which is annoying(My Roku never had that problem) I like the way the menu displays it seems easier to see the selections and the preview window. It works for me and my kids love watching their Youtube videos on the TV now.", "verified": true, "helpfulness": "0/0", "author": "Talliana"}, {"rating": 5.0, "review": "Excellent! User friendly for a non technical person. Love the remote!", "verified": true, "helpfulness": "0/0", "author": "sumowrestler"}]