[{"rating": 3.0, "review": "It works fine,  i just thought it was a streaming stick from phone to tv. It would be nice if it did that also.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Gross"}, {"rating": 3.0, "review": "Slow but meets my needs.", "verified": true, "helpfulness": "0/0", "author": "SATISH K MILAPURAM"}, {"rating": 5.0, "review": "Totally love it, it was so easy 2 install and it just took me like 10 min between the plug-in of the stick, turn on and watch the introduction video, and I was ready 2 watch my favorites tv shows and find some movies from Netflix and other app ...", "verified": true, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "I bought this for a gift, so I can't comment on specifics. Was told it was easy to set up and simple to use. Tons of movies and content if you are a Prime member. Has worked perfectly so far!", "verified": true, "helpfulness": "0/0", "author": "D.M. \"online shopper\""}, {"rating": 4.0, "review": "Just what I was looking for thank you", "verified": true, "helpfulness": "0/1", "author": "Dennis Howard"}, {"rating": 5.0, "review": "easy to work worth", "verified": true, "helpfulness": "0/1", "author": "Patricia B."}, {"rating": 5.0, "review": "I love it so much thank you very much", "verified": true, "helpfulness": "0/1", "author": "jan henry"}, {"rating": 5.0, "review": "I haven't had much time to play with it but so far I love it.  The picture seems better than when I would stream from my PC.  Watching movies it is fast and clear.  If you don't have a smart TV this is the next best thing.Setup took me about a minute, couldn't be easier", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "William Brugger"}, {"rating": 5.0, "review": "If you like movies and remember old ones that you want to see get this ASAP!  For a long time I had remembered seeing \"Paper Moon\" starring Ryon O'Neil and his daughter Tatum, but could never find it to watch.  That changed when I bought the \"Firestick.\"  Now I have access to almost any movie I want to see again. Easy to install and operate - Get it!", "verified": true, "helpfulness": "0/0", "author": "EDMOND P. LULL \"Edmond P. Lull\""}]