[{"rating": 5.0, "review": "suck it Roku box.  this little thing is fast and fine.", "verified": true, "helpfulness": "0/0", "author": "DH"}, {"rating": 5.0, "review": "Didn't know whether to get this or the Fire TV.  Picked this up at half price, and what a deal.  No lag or buffering as with the Roku.  Being heavily invested in Amazon Prime, this is a real treat.", "verified": true, "helpfulness": "0/0", "author": "Silverlake \"silverlake\""}, {"rating": 5.0, "review": "Wow. Just read the onestar reviews. I ordered mine for $19 and it came a week ago. Just now hooking it up and enjoying a Suits marathon. No problems at all, I love this thing more than apps on my TiVo, my PCH A100, Boxee Box (hacked), Chromecast, or Android stick(XBMC). Haven't tried Netflix or any other apps yet,will update when appropriate. It just works and has a remote. Love this thing so far.", "verified": true, "helpfulness": "0/0", "author": "Disturbedfred"}, {"rating": 3.0, "review": "Please let me know if I need a \"smart\" TV.  We do have a four year old HDTV, will the Fire TV stick work with just our wireless service?", "verified": false, "helpfulness": "0/0", "author": "Lisafaye"}, {"rating": 4.0, "review": "Good value. Ergonomically the USB power connector caused some difficulty as it interfered with other nearby connectors. Chromecast (which is not a functional equivalent) has an HDMI extender to help with this. Otherwise setup was easy and performance (Netflix, Prime Video) was great.", "verified": true, "helpfulness": "0/0", "author": "Steve Wetherill"}, {"rating": 5.0, "review": "Fire TV for $19? Heck yeah.", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Molion \"JoeyDVDZ\""}, {"rating": 4.0, "review": "I am very excited about using Fire Stick.  However, after installing it, we still can't use it.  I FINALLY found the HDMI setting on my TV remote, but still there is no response from the stick or the stick remote.  I put in the batteries that came with the stick.  Any advice?I was hoping it was wireless, as we went to great lengths to have all of our TV wires unexposed.  The commercials imply that it is wireless.I had to put the star rating so this would go through.  If I can get it to work, it will be five stars, I'm sure.", "verified": false, "helpfulness": "0/0", "author": "Kathy G. Gillikin"}, {"rating": 5.0, "review": "OK, I'll be honest - I picked up this stick because as an Amazon Primer, I got it for $19 with free shipping.  I didn't really need it, as I am OK with my Apple TV (which admittedly is getting a little long in the tooth, app-wide). I find it to be a great diversion on my iMac second screen, which is a 24inch Samsung Syncmaster. It DOES need the included power adapter, so figure that into your power management layout if you order it.It's fast, small and installs easily and works right out of the box.  Good starter group of apps and games.  I use it for Huluplus and Netflix mostly after the work day, but as a Primer, the occasional free movie is a nice touch, also.  I'm looking forward to HBO GO coming to the Stick in the Spring which will make it worthwhile, if priced right.  I'm not a big gamer (OK, not a gamer at all, truth be told) although I do appreciate the nice growth in the game graphics arena over the years.  I have found myself jumping into some of the games with the Stick also much to my surprise (I hope their record sales increases game availability), which begs the question, why not games on Apple TV?  No internal Xbox or PS4 product to protect from cannibalization and it's not like Apple to be asleep at the wheel!  I guess they are making so much money now on phones, their 'leading edge' is becoming dulled, which gives other firms running room to grab marketshare AND mindshare...but I digress.The Stick doesn't have a ton of memory on it, but way more than its competitors, from the view of future growth of games and operating system upgrades.  At this point, I would rank the Stick over the Chromecast dongle and the Roku stick on quality, speed and price.  Pick one up and invest in your future entertainment, especially if you are part of the Amazon 'sphere of influence'.", "verified": true, "helpfulness": "0/0", "author": "Charles M. Hoard"}, {"rating": 3.0, "review": "I am not sure if I am liking this. Seems to have less apps or channels than the Roku - unless I am just totally missing something. I used to have several options for renting movies; like Vudu or MGo. Now it seems I can only rent on Amazon. I also used to like to watch QVC on the Roku and don't see that app on my fire stick.", "verified": true, "helpfulness": "0/0", "author": "Rebeca Walker"}, {"rating": 4.0, "review": "Easy to set up. Works great. A little disappointed in the programming available on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Mickey Simmons"}]