[{"rating": 5.0, "review": "Easy setup, quick response. We have a Roku as well, this is so much faster and we love the interface and menu's so easy to use our 4 year old can quickly find the show he wants to watch and can make it repeat. We haven't gotten to try out the games, we need to purchase the optional game controller.", "verified": true, "helpfulness": "0/0", "author": "Thomas Smith"}, {"rating": 5.0, "review": "Awesome!  Best Christmas Gift!  Also, Getting A Lot Of Mileage Out Of That Crazy Gary B. Commercial For FIRE STICK (As He Yells Out).", "verified": true, "helpfulness": "0/0", "author": "Kelli Shandera"}, {"rating": 4.0, "review": "The device is very easy to set up.  Just plug it into the first available HDMI port on your TV and plug the power supply cord into either the TV's USB port or a wall outlet if the USB does not provide enough power.If you are a Prime Member, it will come pre-registered and in 30 seconds or so (after the firmware updates) you will be able to access Amazon Instant Video, Music, and the photos you have uploaded on the Amazon Cloud.Fire TV does not offer anywhere the number of channels that the Roku does; hopefully, that will change in time.UPDATE:  This just would not smoothly stream MLB games (buffering and juddering picture) even after rebooting the router, clearing the Stick's application data and cache.  Amazon tech support tried to figure it out, but once they told me to perform a factory reset on it, I knew it had to go.  It has been replaced with a Roku unit which works without perfectly", "verified": true, "helpfulness": "0/0", "author": "orion1113"}, {"rating": 2.0, "review": "Cool device but it suffers from constant Wi-Fi signal drops and required password resets quite a few times. Would give it a higher ranking if not for the connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 4.0, "review": "This allows you to use Amazon Prime to watch movies on a TV that does not have internet. You do need a HDMI input on the TV to plug in the stick. I was surprised to see that it requires POWER. It comes with everything but you have to plug the power block in and then the cable to the stick, then plug the stick into the HDMI port on your TV. I thought it would have used power from the TV, not an external cord.Once installed its easy to select your WIFI and password, then account and its ready.It seems to work great.", "verified": true, "helpfulness": "0/0", "author": "Terry Schoenberger"}, {"rating": 2.0, "review": "I watch streaming video one floor below my Wi-Fi access point, and my Kindle had occasional connectivity problems, more than other devices I use. So I figured that the Fire TV Stick might be an improvement. Wrong. It was much much worse. It took an hour or so to get it to connect, and when it finally was connected, the connection was very slow. To make sure that I wasn't having an intermittent network problem, I tried connecting my Kindle and my cell phone -- both connected quickly and effectively. I tried the Fire Stick a few more times, but the problem persisted and I sent it back. I'll maybe try again after an upgrade is released, the Fire TV Stick II or Fire TV HDX Stick or whatever. The device comes very nicely packaged, and people who watch streaming video within a few feet of their Wi-Fi access point may not have the problems I experienced.", "verified": true, "helpfulness": "0/0", "author": "F. Langer"}, {"rating": 5.0, "review": "Worked perfectly and was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Very disappointing.  They say it takes minutes to set up, I'm on 60 minutes and my frustration level is growing.  I gave up on the parental controls part.  It simply gets stuckIt is struggling to maintain connection to Internet, but none of my other device including kindle have issuesPiece of junk that I will be returningGo with Roku. They are they only device out there that works without issues", "verified": true, "helpfulness": "1/1", "author": "Field \"booksforalex\""}, {"rating": 1.0, "review": "This is a piece of junk. I cannot recommend buying it. Once connected, it takes over my Sony Bravia TV and does not allow me to switch HDMI inputs to the BluRay or cable TV. I have to literallly unplug this stick in order to get back control of my TV. While plugged in and running, the Fire TV Stick has no way to control volume and it will not allow my TV/cable remotes to work, so I'm stuck withj one volume, and no way to change or mute it nor make any other TV setting modification. And the final flaw is that the screen resolution is terrible. It looks like old VHS quality. Not even close to 1080p I get with cable and OTA broadcast.", "verified": true, "helpfulness": "0/0", "author": "C. Jack Swinden \"W5JCK\""}, {"rating": 2.0, "review": "You have to clear the cache EVERY time you watch a 30 minute TV show, or it with start buffering. Annoying.", "verified": true, "helpfulness": "0/0", "author": "KH \"lukesmom\""}]