[{"rating": 3.0, "review": "The wifi receiver is very poor if more than 12'away.  Need to now get a signal booster.  My other wifi devices never have a problem receiving the wifi signal", "verified": true, "helpfulness": "1/1", "author": "Dennis L. Kitch"}, {"rating": 5.0, "review": "I purchased this for half price as a prime member. I'd figure for $20 something bucks it's hard to pass a deal like that up. I received the order quicker than I expected and was able to plug it in to an available HDMI port. In a matter of seconds I connected to my wifi network and was able to use the stick. It came preconfigured with my info so I didn't have to enter my login. That was a nice feature. I was able to install Netflix and my other streaming apps with no problems. The interface works great. I like it a little more than the Roku stick I have setup in the bedroom.", "verified": true, "helpfulness": "0/1", "author": "init2winit"}, {"rating": 4.0, "review": "Just got it yesterday and it seems to work just like the Fire TV.  However I didn't know you had to plug it into a power source to work..would be 5 if not for that.", "verified": true, "helpfulness": "0/0", "author": "KJSDAD619"}, {"rating": 1.0, "review": "Sparked and hung up", "verified": true, "helpfulness": "2/4", "author": "Jonathan Sears"}, {"rating": 1.0, "review": "It doesn't work Verizon.", "verified": true, "helpfulness": "1/4", "author": "Vemula"}, {"rating": 5.0, "review": "excellent piece of equipment all the way around", "verified": true, "helpfulness": "0/0", "author": "Mike Steinman"}, {"rating": 5.0, "review": "This works and it operates very snappily.  Quick and easy to set up!  Anybody could make this thing work!  Why no voice recognition on this one but on the full size TV?  You can do it from the app for your phone or tablet so I guess that makes up for the lack of this feature.  Overall I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "KIRK A."}, {"rating": 3.0, "review": "Glad I only paid 20 bux for it. I have a one year old Asus memo HD 7 android 4.2.2 with miracast. The android recognizes the stick but fails to connect. YouTube plays fine over the android, so what's up with no miracast?Although this stick is geared toward having apps that require further memberships,I found some very fun things for free. The best being a large selection of local and national PBS shows with their app. There are other free movie and documentary apps too. But have many commercials.Another great thing is having pay per view movies available in both HD and SD. I found that one can stream those pay per view movies with only a 1.5 wi wi connection, but not the rest. So at least a 3.0 is a must. I just upgraded and wow, works really well!  For miracasting, I had to get a separate Asus dongle. Picked up a used one for around 50 dollars. It's nice to use to stream video from sources that the fire stick doesn't have apps for.So out of respect, felt the need to update.I would recommend this product solely for the availabilities stated above.Really? I have to buy an Amazon Fire Tablet? Or get prime?They then should hand these out for free!That's one big reason I got this thing. Downloaded the Allcast app and all thatdid was mirror locally stored content, then damaged some photos and totally screwed up my photo gallery. Took hours to get it back but had to delete 13damaged images.So far, after 12 hours, have a screen full of Amazon pay apps, no mirroring although my tablet is 4.2.2", "verified": true, "helpfulness": "2/3", "author": "darmuck"}, {"rating": 1.0, "review": "As a Prime member I got this for half off, and I've been using it every day for the past 10 days. It works well, but I'm not all that impressed. Some reviews seemed to imply it would be better than a Roku; in my opinion it's not.Physically, it's power cable connects to one side which, with the way my Panasonic is built, means the power cord is vertical, putting stress on it.The remote is nice but sometimes when I push the navigation button, instead of moving one spot to the next icon/image, it sometimes moves 2, 3, or 4 spots. In keeping with that, the Roku 3 remote has the ability to click the navigation button fast forward button and the cursor moves one screen, thus making it faster to scroll through programming.I do like the Amazon Prime Video user interface better using the Fire TV Stick than the Roku because when I pause a program the image is clear, with no \"phantom page,\" that is, a darkened screen with programming info that interferes with whatever is on the screen that caused me to pause it.Amazon changed the Roku UI from a clear screen to the darkened screen, and it's a nuisance. It's now difficult to distinguish those tidbits of programming info that could once be seen.Also, since I watch mostly stuff on my watch list, it's annoying to have to scroll down to it when on the home screen. My watch list should be at the top of the home screen.Edit: This addition will also be placed under my review of the Amazon Prime Video, and in an email to Amazon.The device freezes, requiring me to reset it too often. Further, now that there are ads through this device, it'll be put back in the box and put away.The TV Stick user interface seems to be getting worse. Recently I went to watch an Amazon show pilot, and was greeted with a screen that said the show was brought to me by Geico. I backtracked out of the show and didn't watch it. I don't do ads, and my Prime subscription is not supposed to include ads.Then last night I was going to watch an old Doctor Who episode, and when I clicked on the episode's icon I was urged to install Vudu and watch it on Vudu. Initially I thought Amazon must have changed the season to pay-per-view, but I was wrong. The Vudu ad was simply an icon placed before the regular Prime icon, so I had to just scroll over to the next icon.I noticed that every other icon was for Vudu. Again an ad.Fortunately, this has not (yet) been the case using the Roku 3, but Amazon has already messed up the Roku interface as well, just not with ads (yet).", "verified": true, "helpfulness": "0/0", "author": "rudyy"}, {"rating": 1.0, "review": "Amazon Prime TV is wonderful. I've owned it for several months and I see it is on sale on for $20 off. If you have room for the smallish box, you may want to think about it. It's features are as advertised. As for the Stick, I really cannot give as much feedback as I'd like. I bought it on December9th as a Christmas present to add to one of the extra TVs. Amazon, despite advertising the product heavily over the holiday season (I thought for Christmas), informed me they were unable to deliver the Stick until January 9. So, I hope it is as good as Prime TV, which, as I say, I love (and I hope better than Chrome - which I took back), Unfortunately, Amazon was unable to follow through and thus the low star. I will update you as I get a chance to use it.", "verified": true, "helpfulness": "0/3", "author": "Robert F. Spaulding \"rfslaw\""}]