[{"rating": 5.0, "review": "Got my Fire TV Stick before 2 day a head of time and I is works great. This works better then I expected, I would tell everyone that it is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Johnny Gerald"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Charlotte"}, {"rating": 5.0, "review": "Outstanding, so good I bought 3 of them and would buy another. Excellent customer service. A++++++", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Great product now just need the NFL ticket on there !!!!", "verified": true, "helpfulness": "0/0", "author": "vince lombrana"}, {"rating": 2.0, "review": "Need a wifi extension in order for it to work", "verified": true, "helpfulness": "0/0", "author": "quin"}, {"rating": 3.0, "review": "I own a Roku 1 and the Fire Stick is much less intuitive to set up, at least to me.  I also have to unplug it to reset it anytime my WiFi blinks out on me.  Not true with the Roku.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Williams \"Doodle Out\""}, {"rating": 5.0, "review": "Works just as advertised.", "verified": true, "helpfulness": "0/0", "author": "Tony W Cates"}, {"rating": 2.0, "review": "I purchased a Amazon Fire TV Stick and when I first got it and set it up it worked on the first day.  I did not watch TV for a couple of days and when I attempted to watch my shows on the Fire Stick it would not work.  I did talk to a Tech Rep named Mia and she helped be to the best of her ability.  I finally got the device to work again but every time I turned off my TV and did not use the Fire Stick device for a few days when I turned on my set and tried to use it, it would not work.  I keep getting the display that there is no internet connection yet my iPhone and Desktop Computer which are all connected to the internet work just fine.I am so disappointed with this product because I usually have great service experiences with all of my other Amazon products.  I am returning this device and I guess I have no choice but to use Roku who has better experience with streaming devices.  Finally be cautious ordering this device, I got tired of trying to re-boot it all the time.  I would not recommend this product and I will not order another one.  Back to the drawing board Amazon!!", "verified": true, "helpfulness": "0/0", "author": "S. DAY \"S M DAY\""}, {"rating": 5.0, "review": "Kicks ass!", "verified": true, "helpfulness": "0/0", "author": "mme_egr"}, {"rating": 5.0, "review": "Works great!  Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Thomas H. Luck"}]