[{"rating": 2.0, "review": "It is nice, because you can watch programs in Hulu, Netflixs and Amazon prime. I do not like that it has to be plugged into an electrical outlet....", "verified": true, "helpfulness": "1/1", "author": "Danielle"}, {"rating": 5.0, "review": "LOVE LOVE LOVE this!!!  We use it every day", "verified": true, "helpfulness": "0/0", "author": "B. D. Iverson"}, {"rating": 5.0, "review": "LOVE the Fire TV Stick! It's like having a blu-ray player (minus the blu-ray part) or a smart tv, but for a fraction of the cost. It runs well and is very fast. The remote works great, and I love that it learns what you like to watch, so the shows/movies start up faster. It's like a chrome cast, but so much better since everything runs directly from the stick, there's no need to play it on a separate device and  \"cast\" it. Can't say enough good things!", "verified": true, "helpfulness": "0/0", "author": "A. Tango \"book and movie junkie\""}, {"rating": 5.0, "review": "The Fire TV Stick was better than i expected.  We just purchase a large LG TV and connected the Fire Stick to it.  We have watched more stuff on the Fire than the regular TV.  It was very easy to install and we have had no problems at all.  We have the voice activated remote and works great!  So don't hesitate to purchase this great piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Carl A. Dixon"}, {"rating": 5.0, "review": "I was really excited when I ordered this, thinking of all the times I'd get to play catch with the dog, using an actual stick on fire! Little did I know about my terrible reading comprehension skills. This finally convinced me to go back and get a GED. And with GED in hand, I can finally write a review! 10/10!", "verified": true, "helpfulness": "1/2", "author": "Igor Pe"}, {"rating": 5.0, "review": "EASY TO INSTALL AND SIMPLE TO OPERATE.  I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "c.j."}, {"rating": 1.0, "review": "Ok...I bought this for 19.00 as a special to Prime members.  I have used it for several months now and sadly must give it a 1 star rating.  I have experienced the same terrible connection issues when streaming a tv show or movie. There are 15, 523 total reviews, and a total of 2300 1 and two star ratings, with the majority citing bad connectivity.  That's about 14.5 %. or the sake of this discussion, take out the comments that don't address connectivity issues, and you still have over 10% with connectivity problems.Common Amazon, 1 out of every 10 units sold is broken?  Is that what you built your reputation on; supplying faulty merchandise?  Amazon, you need to man up and fix a fix and download to all units, or if it's hardware, resend everyone who wants an upgraded unit for free.", "verified": true, "helpfulness": "2/2", "author": "barharborboy"}, {"rating": 5.0, "review": "Great watching movies on \"demand\" !", "verified": true, "helpfulness": "0/0", "author": "Monica L. Blancas \"Lunademiel\""}, {"rating": 5.0, "review": "A really great way to get more out of your TV.  It's particularly useful viewing Amazon Prime Video (which is worth the price even without the other benefits).", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Got this at intro price of $19+ and was delivered a month earlier than expected!Pretty easy setup, just have you Internet Password handy, once connected it should start playing a short intro video. I do have Highspeed Cable, and this little Fire TV Stick works very well, no lag, no errors so far.  I've actually got this early December but just now got around to installing it. I've got 2 Roku's as well.I've watched several shows, movies on Prime plus listened to Prime Music, which was the big surprise!  Also, you can view your online photos you've uploaded to your Prime Cloud account, another bonus! As far as available APP's, I'm not too worried about the Stick's current limitations, in all honesty, I only watch Amazon Prime, Netflix, VUDU and once in a while Crackle, the disappointment would be the lack of VUDU, I can't understand why this is so, but I can get it on 2 other TV's, so not a deal breaker. My favorite thing, the interface is so much better than either of my Roku's, makes everything look even better and crisper.  I've successfully watched shows and movies on Crackle and Netflix.At the price I got this and performance so far, I could not be any happier!", "verified": true, "helpfulness": "0/0", "author": "theunartist"}]