[{"rating": 4.0, "review": "I've had the Google Chromecast stick for over a year, mostly just used for YouTube stuff, very convenient.  Now I got this stick with remote control, I think it's more useful than Google Chromecast stick, and a lot fun!  I think it's a must-have stuff for Amazon Prime members!  The only thing I'd like to complain is the little remote control, pretty sticky, especially when you play games, not so responsive...I guess I need the game controller for the games.", "verified": true, "helpfulness": "1/1", "author": "ULong \"bill\""}, {"rating": 3.0, "review": "I bought this for my office tv. I figured having amazon prime I would utilize my membership. Ive only played one game on it , Tetris. was fun and addictive. I mainly wanted to watch shows where I could watch a few episodes then continue watching them on my normal tv via PS3 connection to amazon prime. The fire stick constantly restarts itself in the middle of watching a show. It will also random lose connection with my wifi. No other device I use via wifi ever has this issue. The beginning annoyance of my tv's usb port not having enough power to work the unit was my first issue. the more I use it , the more Im regretting not just going with the fire tv. now I fear if I get the fire tv box that I will have the same issues.", "verified": true, "helpfulness": "1/1", "author": "Dalen F. Snow II \"Krsdad\""}, {"rating": 3.0, "review": "I liked the Fire Stick a lot until I started getting the frequent error message, \"We're having trouble playing this title right now.\"  I've checked the connection (quickly ran through the steps and passed perfectly), tried rebooting netflix, tried choosing another item to stream... No luck... I can go on my phone or my set downstairs and stream anything just fine. Error message only occurs for the Fire Stick. What gives?", "verified": true, "helpfulness": "1/1", "author": "S. Young"}, {"rating": 1.0, "review": "Don't bother is you already have a smart tv", "verified": true, "helpfulness": "0/1", "author": "KC2014"}, {"rating": 1.0, "review": "It came broke", "verified": true, "helpfulness": "0/0", "author": "brookly"}, {"rating": 5.0, "review": "Awesome!!! Love it more than what I expected. Better than the chromecast. The remote control is great.", "verified": true, "helpfulness": "0/0", "author": "James Hoover"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Leanne Williams"}, {"rating": 5.0, "review": "I love my firestick, however, I am not impressed with Amazon Prime because of the viewing limitations placed on the most movies I wanted to see, so I cancelled my Prime membership,", "verified": true, "helpfulness": "0/0", "author": "deborah l turner"}, {"rating": 5.0, "review": "Worked great, I had tried Roku, it was horrible. I returned it and am very happy I tried fires tick!!", "verified": true, "helpfulness": "2/2", "author": "Charles Ahlbrecht"}, {"rating": 5.0, "review": "Yes its awesome Love it", "verified": true, "helpfulness": "1/1", "author": "chris daley"}]