[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "yolanda"}, {"rating": 5.0, "review": "Excellent way to stream Netflix, Amazon Prime video, and Sling TV. Rarely do I have to a streaming issue, the controls are intuitive and work fast.", "verified": true, "helpfulness": "0/0", "author": "Levi Allen"}, {"rating": 5.0, "review": "This thing is awesome!  Exceeded all my expectations.  It set up itself.  Just plug it in. As a prime member, it really is a great deal. it seems like an endless amount of movies and shows of all genres.", "verified": true, "helpfulness": "0/0", "author": "JLM73"}, {"rating": 5.0, "review": "Great shows easy to use. Easy to install", "verified": true, "helpfulness": "0/0", "author": "Walt Dunn"}, {"rating": 5.0, "review": "My husband and I have an 8 year old TV that does not have Smart TV capabilities. We bought this so that we no longer needed to use our XBOX for streaming Netflix. Can't beat the price and the quality is great. We're happy with our purchase.", "verified": true, "helpfulness": "0/0", "author": "Maeve"}, {"rating": 5.0, "review": "LOVE LOVE it", "verified": true, "helpfulness": "0/0", "author": "J. Ferguson \"~J~\""}, {"rating": 4.0, "review": "Like the remote compaired to Crome cast", "verified": true, "helpfulness": "0/0", "author": "bryon cordova"}, {"rating": 5.0, "review": "Easy to install, love the flexibility and choices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love it. Best bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "Christopher Young"}, {"rating": 5.0, "review": "I have one cable box in my house and four TVs.  Needed something cheap and easy for my basement TV and the Amazon Fire TV Stick exceeded my expectations.  I don't plan on gaming with it like you can with the full size Fire TV but for media consumption you can't go wrong with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Christopher Hansen"}]