[{"rating": 4.0, "review": "Havn't quite figured out how to use it yet.", "verified": true, "helpfulness": "0/0", "author": "Ron F Herring"}, {"rating": 5.0, "review": "works great, exactly as advertised and have gotten hours of enjoyment from it.", "verified": true, "helpfulness": "0/0", "author": "Tom Dillon"}, {"rating": 1.0, "review": "Return it, didn't meet expectations.", "verified": false, "helpfulness": "1/1", "author": "Jim Mikelson"}, {"rating": 5.0, "review": "The Firestick is better than I thought possible. It  gets used more than my cable television by far. I would definitely recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We've love the box and the stick. Easy to set up and easy to use. We're prime members and enjoy more than just the movies.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to install and to operate. Provides a variety of options.", "verified": true, "helpfulness": "0/0", "author": "Ives"}, {"rating": 5.0, "review": "Love it! I purchased the Chromecast several months prior and was unimpressed. I used it a few times and there it sat, plugged into the TV but never used. The fire stick comes with a remote, which is way more convenient. The shows included with my prime membership are better than what is offered on a Netflix subscription. I also have the option to watch prime movies, or rent one (3.99 - 5.99). I can also play free games or watch the free kids channel with my daughter. My fire stick is used every day in the bedroom. Sure beats having to pay for an additional cable box. A++++.", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "The stick works great.  Gives me all the info needed for great viewing.", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Best Bang for the buck. Way better that the chrome cast that you have to mirror off your device with. Easy set up-easy to use. I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Wendy MzTopFlyte"}, {"rating": 4.0, "review": "We bought the Fire stick for a secondary TV set up.  We already have the Amazon Fire and it works great!The Fire Stick often works as well but every now and then it quits and starts searching for a WIFI signal again. This requires us to wait or back up and start the movie over again.I am not sure why? We don't have the same issue with The Amazon Fire. We have a strong WIFI signal throughout the house. Other than that issue which has occurred a few times it works as well as the Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Donna Darling"}]