[{"rating": 5.0, "review": "I gave this to my husband for Christmas and he really loves it! It has been working great. We recently took it on vacation too. Love it!", "verified": true, "helpfulness": "0/0", "author": "Tamara Coty-Stickevers"}, {"rating": 5.0, "review": "I bought this for my 7 year old and he loves it. It was simple to use, just plug it in and go.", "verified": true, "helpfulness": "0/0", "author": "Bbowl164"}, {"rating": 1.0, "review": "Worked for three weeks. Now won't connect. All other devices in the house are working fine", "verified": true, "helpfulness": "0/0", "author": "Edsel Buglar \"Man of mystery.\""}, {"rating": 3.0, "review": "Why buy a stick-sized product? So you can take it with you when you travel. But the Fire Stick is useless in most hotels. Hotel WiFi generally requires you to log in via a web portal, and this device just can't do that. If there's no way to connect to the hotel's WiFi network then the Fire Stick is useless. This functionality should have been included out-of-the-box. Amazon released an incomplete product with the promise that portal login would be included in a software update...an update we're still waiting for.Otherwise this is a decent product. The video apps are faster than those on BluRay players, and the video quality is good with a strong wireless signal.Games are generally simplistic and I've seen some stuttering at times, but you probably aren't buying this device for serious gaming.It's a shame that Amazon put time and energy into a gaming platform on a low-power and low-memory device such as this rather than making it a good portable video platform. If the software update that allows portal login ever shows up, this will be a much more useful device.", "verified": true, "helpfulness": "0/0", "author": "Dave760 \"Dave\""}, {"rating": 5.0, "review": "Hooked it up and it works fantastic, streaming is almost seamless once it buffers (minimal time). Move it between TVs and laptops without issue. So far, very pleased.", "verified": true, "helpfulness": "0/0", "author": "Nitroxron"}, {"rating": 5.0, "review": "It is perfect!  Easy to install and works great.", "verified": true, "helpfulness": "0/0", "author": "Patricia Coleman"}, {"rating": 5.0, "review": "Wonderful.  I love it!", "verified": true, "helpfulness": "0/0", "author": "MDCollins1"}, {"rating": 5.0, "review": "I love my new Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Dawn H."}, {"rating": 5.0, "review": "Love the variety and selection of movies and TV shows!", "verified": true, "helpfulness": "0/0", "author": "kathleen wilks"}, {"rating": 5.0, "review": "Works perfectly.  I like the portability of moving it from tv to tv.  I dropped my cable and I'm saving a lot of money.  No regrets!", "verified": true, "helpfulness": "0/0", "author": "S. Flint"}]