[{"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Tammy P."}, {"rating": 4.0, "review": "We just bought this and used it twice so far, really enjoyed the ease of use. Just ordered a game controller to try that out as well! We are not very technical,  if we can do it anyone can! The movie selection is not as good as I thought it would be, but we are working with what is on the program.", "verified": true, "helpfulness": "0/0", "author": "GQPC"}, {"rating": 5.0, "review": "I love it😄", "verified": true, "helpfulness": "0/0", "author": "Richard   Young"}, {"rating": 3.0, "review": "The quality of the streaming is not what I expected.  Specially on Netflix.In other hand,  games are great for kids.", "verified": true, "helpfulness": "0/0", "author": "Rafael Martinez"}, {"rating": 5.0, "review": "Fantastic all my friends want one!!!", "verified": true, "helpfulness": "0/0", "author": "nedh2001"}, {"rating": 4.0, "review": "The Fire Stick is very user friendly but does take some getting used to when navigating the menu.  If you're used to streaming devices it's slightly easier.  My sister still needs a lesson from me on occasion but one you've got it, you've got it.  I have some wishes regarding some of the apps, I wish it had the Fox News app that I can get on my roku, but otherwise I love it.  The remote is much easier than streaming with your latptop or  phone.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Church"}, {"rating": 1.0, "review": "Horrible product with glitches.  Moreover, no adequate technical support services.  It doesn't work on all TVs as. It reads some TVs as a recording device, which Mazon doesn't want to using!  Had calls with Technical support and they didn't even understand the problem as well as reviewers who posted their similar experiences. Do NOT buy until Amazon works out the glitches.", "verified": true, "helpfulness": "0/0", "author": "Charles Travis Canfield"}, {"rating": 5.0, "review": "Love this. Great to watch my prime movies on my tv", "verified": true, "helpfulness": "0/0", "author": "Laurie Cabaret"}, {"rating": 3.0, "review": "Not as good as I had hoped", "verified": true, "helpfulness": "0/0", "author": "Tonya T."}, {"rating": 5.0, "review": "works great!!!!!!", "verified": true, "helpfulness": "0/0", "author": "matthew wenke"}]