[{"rating": 2.0, "review": "I am disappointed in the fire stick .  If you are a Amazon prime member a stick is not needed.", "verified": true, "helpfulness": "0/1", "author": "Ray Eniquez"}, {"rating": 5.0, "review": "I am quite pleased . It was easy to set up . Some people were upset because the remote with the stick was not voice activated . No big deal , Amazon has remote app that works perfectly on your phone .", "verified": true, "helpfulness": "0/1", "author": "Carlos A Mendoza"}, {"rating": 5.0, "review": "This technology is freakin great.  I don't have satellite or cable, so this gets me all the amazon prime movies plus more services if I want, like Netflix or Hulu, on my TV.  All I need is a wireless internet at home and plug it in and it works.  It's really great.  The free shows are plentiful, but many require purchase at a rate of one to five dollars.  That was kinda disappointing.", "verified": true, "helpfulness": "1/1", "author": "Mara \"Mara\""}, {"rating": 4.0, "review": "Very nice, I really like the speed", "verified": true, "helpfulness": "0/0", "author": "dlow"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Dorothee Ward"}, {"rating": 5.0, "review": "Love!  Immediately ordered another one for our second tv!  Why would anyone pay the ridiculous satellite prices?", "verified": true, "helpfulness": "0/0", "author": "Lisa Womack"}, {"rating": 5.0, "review": "Way better than google!", "verified": true, "helpfulness": "0/0", "author": "Steven Lamb"}, {"rating": 5.0, "review": "Love, Love Love....I wish I would have purchased like 10 of them when they 1st came out.  The remote is small and easy to use, the product is easy to install and is very user friendly.  I find that I use my firestick more often than I use my ChromeCast.Now I just wish major networks would get on board with their apps being offered through Amazon Prime.  I would love to get rid of cable completely and only use the firestick to watch my favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Pixieleaf"}, {"rating": 1.0, "review": "I had lots of problems with getting the firestick to connect to my Buckeye Cable System router!!I spent over 4 hour over 3 day period, and 4 phone calls to Buckeye's technical support, before I could get the firestick to work!!Buckeye's Technical Support said they have many problems with firesticks, they said that Roku works much better.  If I had it to do over again I would buy a Roku!!", "verified": true, "helpfulness": "0/0", "author": "goodtimes4you"}, {"rating": 5.0, "review": "Awesome new device especially with Sling.  I cut my cable and didn't look back.  My Godson wants you all to allow the Minecraft download for the Fire TV Stick since it is available for Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Douglas R. Bailey"}]