[{"rating": 5.0, "review": "we love the ability to get the shows we want to watch now and the versatility to move it from one TV to another.  good price and great value.", "verified": true, "helpfulness": "0/0", "author": "Herschel Davis"}, {"rating": 5.0, "review": "Works great, tons of content, easy to use", "verified": true, "helpfulness": "0/0", "author": "Matt C Northcutt"}, {"rating": 4.0, "review": "Works well.  The way the chose to inject power is rather clunky.  If you like the clean lines of no cables showing it might be a challenge.", "verified": true, "helpfulness": "0/0", "author": "Joel Duimstra"}, {"rating": 4.0, "review": "The best investment I've made by far...", "verified": true, "helpfulness": "0/0", "author": "sharod johnson"}, {"rating": 5.0, "review": "I'm enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "My wife loves that her phone is now a remote.  Yes, it comes with a remote too.  We like this little Fire Stick", "verified": true, "helpfulness": "0/0", "author": "clarissa"}, {"rating": 5.0, "review": "This is my second Fire Stick for another location. The low price and ease of use made it my only choice. The small but simple remote works great and the app for Android is really handy. I am a Prime member so the movies and shows are great there as well as Netflix. The unit seems to run well even on rather slow internet and gives me a lot of options for viewing.", "verified": true, "helpfulness": "0/0", "author": "Fegarex"}, {"rating": 3.0, "review": "It works fine.  half  the time.  It seems to choke so much on Hulu and Sling TV.  Both these services are the most problematic of the four that I have in general BUT, my xbox one nor PC never seems to have the same issues with the same services.  I understand theres a huge difference in processing power but, it's irritating.  I have slingTV playing and it kicks it out to the screensaver all the time for no reason.  With Hulu, it chokes on commercials.  Sometimes with Netflix, the resolution gets really bad.  Then I have to go to main menu, launch Netflix again and then it goes back to normal.  During this, I know that I can run netspeed tests and see that there's no dip in my 90 Mbps down/ 5 Mbps up speed.  As I've said, I've tried the same things on my desktop PC and Xbox one and it never does these things (although with xbox one, xbox 360, and ps3 Netflix almost always looks blurry when you first start watching but it does get better real quick).  I think the fire tv box or roku has to be a better choice.  This one is cheaper but you will get what you pay for.  Oddly enough it seems to play the amazon video perfectly from what I've seen....", "verified": true, "helpfulness": "0/0", "author": "Bill Lumberg"}, {"rating": 3.0, "review": "The audio \"skips\" like a poor connection on a cell phone. Video quality is very good to excellent. I thought the audio problem may be tied to my wi-fi signal but my Son's Fire TV stick works great. Tried restarting it several times but no luck.", "verified": true, "helpfulness": "0/0", "author": "Mike Ballentine"}, {"rating": 5.0, "review": "I wish it was easier to display my iphone screen on it. Casting never works on my chromebook but it does work on my blueray player.Other than that the remote is real nice and all the features and things are easy to find and operate.", "verified": true, "helpfulness": "0/0", "author": "pohlcat01 \"pohlcat01\""}]