[{"rating": 4.0, "review": "It's really a great addition to any TV that is not a smart TV. I picked it up for my stupid TV when it was on sale to Prime Members for $19.99 and do not have a single regret. I can watch all the Amazon Prime and Netflix I want with my older television. I haven't really explored the other apps and games, but they also look pretty cool. The only thing I wasn't expecting was that it needed to be plugged into an outlet all the time, but that's really no big deal. I'd recommend the Fire TV Stick to anyone that wants to upgrade their stupid TV to a smart one!", "verified": true, "helpfulness": "0/0", "author": "SG124"}, {"rating": 1.0, "review": "It did not meet my expectations .", "verified": true, "helpfulness": "0/0", "author": "kkpendurthi"}, {"rating": 4.0, "review": "Works very fast. Easy to set up and use. I wish the Android remote app was better.", "verified": true, "helpfulness": "0/0", "author": "joeyc"}, {"rating": 5.0, "review": "Very pleased with the Fire TV stick.  We have other similar products and this by far is superior in the operating and layout.  I would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Adam Terrell"}, {"rating": 5.0, "review": "Great. Very easy set up as well as easy to use. Well be buying some for Christmas presents", "verified": true, "helpfulness": "0/0", "author": "James Cox III"}, {"rating": 3.0, "review": "This would be a great device if you need a remote or someone who doesn't have a smartphone. I prefer using my Chromecast over the fire tv stick. I love being able to to cast what I have on my phone. You are able to cast Netflix to the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Christopher Cromwell"}, {"rating": 3.0, "review": "I like almost everything about it. ALMOST. The interface is really simple and looks nice. It does what it's supposed to so I'm happy about that. However, it doesn't have HBO GO which would have been nice. Also, I don't know if it's just the one I received or if it's that way for everyone, but the remote is very finicky and doesn't work properly. It gets stuck or it moves at lightning speed even though I only pressed it once. If they fix the remote and add HBO GO, this would be a very competitive product!", "verified": true, "helpfulness": "0/0", "author": "Shruti"}, {"rating": 5.0, "review": "Great product. Very fast and responsive, yet small enough to hide behind the TV. Remote is handy too, doesn't require a smartphone like Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!  It was also fun to see Hill Climb Racing on our 55\" TV!!", "verified": true, "helpfulness": "0/0", "author": "D.Johnson"}, {"rating": 5.0, "review": "So far it works great especially with the smartphone app.", "verified": true, "helpfulness": "0/0", "author": "Doug from Tampa"}]