[{"rating": 5.0, "review": "We bought two of these, one for each of the bedrooms in the house. I put one in my son's room because he loves Thomas, and Prime has tons of Thomas movies. My husband and I use ours for Hulu and Netflix, mostly. We have a Fire TV box in the living room, too. We love them. It's much nicer than having to go through a gaming console like we used to. We'd definitely recommend them, and we use them mostly just for the basics. There's also games and music and things like that, so these things are pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Stef&Shane"}, {"rating": 5.0, "review": "This has been awesome! Well worth the money!!", "verified": true, "helpfulness": "0/0", "author": "Gram"}, {"rating": 1.0, "review": "Hell no! None of the movies play neither due most of the apps work in the Bahamas.", "verified": true, "helpfulness": "0/0", "author": "Calvaughn"}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "joseph s wing"}, {"rating": 4.0, "review": "the only thing I do not like is the waste of 5 watts when not in use. wish there was an easy way to power down.", "verified": true, "helpfulness": "0/0", "author": "Max Gottschalk"}, {"rating": 1.0, "review": "I'm sorry to say,  I had to return it. Such a great idea but the video froze all the time and I couldn't fix it. Hulu doesn't work at all.  When Amazon works out the bugs I'll buy another until then it has to go back.", "verified": true, "helpfulness": "0/0", "author": "swarley \"jay\""}, {"rating": 5.0, "review": "Better than watching cable tv", "verified": true, "helpfulness": "0/0", "author": "ray"}, {"rating": 5.0, "review": "Love this!  Especially for using my Prime membership for marathoning my favorite TV shows!", "verified": true, "helpfulness": "0/0", "author": "adene balzer"}, {"rating": 1.0, "review": "This pauses for 10 seconds every 5 seconds of play time. It's unusable. I have 120mb Internet and I've tried restarting it.", "verified": true, "helpfulness": "0/0", "author": "MamaOfThree"}, {"rating": 3.0, "review": "AWSOME I should of ordered it sooner if I had known it was so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jlaine"}]