[{"rating": 4.0, "review": "It's a great device. I love that I can disconnect and reconnect to any of the TVs in my home. However, I found that when I connect my Firestick to my Samsung 40\" SmartTV it keeps shutting on and Off and resetting Itself. Amazon should be a bit more clear on what TVs are compatible without this issue. I can still watch it, but it's frustration when the movie gets Juicy and then It's a Black screen.", "verified": true, "helpfulness": "0/0", "author": "All4Selene \"Shirley E. Martinez\""}, {"rating": 2.0, "review": "It doesn't do youtube well, and jitters a lot in the UI", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Great addition to our television entertainment.  I like being able to watch Amazon Instant Videos on my main television whenever I want.  The setup was simple and the app for my android phone works flawlessly.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "LIM \"sirchomed\""}, {"rating": 4.0, "review": "This works well with netflix and amazon, though I was disappointed that it did not work with my surface pro 3 using miracast. For $19 it was worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Ashok"}, {"rating": 4.0, "review": "I bought it for a gift and they live it!!!", "verified": true, "helpfulness": "0/0", "author": "Scott Kidd"}, {"rating": 5.0, "review": "Very user friendly. I also love that there are apps within so you can log onto Netflix, Hulu and others.", "verified": true, "helpfulness": "0/0", "author": "Sherri E Muelhoefer"}, {"rating": 4.0, "review": "It's a great device. I love that I can disconnect and reconnect to any of the TVs in my home. However, I found that when I connect my Firestick to my Samsung 40\" SmartTV it keeps shutting on and Off and resetting Itself. Amazon should be a bit more clear on what TVs are compatible without this issue. I can still watch it, but it's frustration when the movie gets Juicy and then It's a Black screen.", "verified": true, "helpfulness": "0/0", "author": "All4Selene \"Shirley E. Martinez\""}, {"rating": 3.0, "review": "Not happy, loses connection to the plex server during every playback.  Chromecast did not, when it loses connection, have to wait for it to time out, and then it reboots on it's own, pressing any button on the remote does nothing.  Can't change over to netflix, amazon prime or anything else once it does this.", "verified": true, "helpfulness": "0/0", "author": "Mathew Wyckoff \"Fyrebaugh\""}, {"rating": 5.0, "review": "The only downside is that it has to be plugged into power. The pictures don't show this. So not exactly as shown. Shame on Amazon. But if you can get passed that problem and have a really good High Speed Internet it works great. You can search for Prime content, something you couldn't do with the Fire Box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Queen"}, {"rating": 5.0, "review": "Brilliant device.  A digital TV antenna and the Fire TV Stick meets all my TV needs.  Bye bye cable.One very minor criticism would be the bizarre difficulty in opening the back of the remote to install the batteries.  Hardly a new concept but the designers somehow managed to botch this up.", "verified": true, "helpfulness": "0/0", "author": "Sliderulepass"}]