[{"rating": 5.0, "review": "It was relatively simple to install (once we synced to our wireless) and everything after that was easy.  We have quickly started to use despite being sceptical at first.  I'd recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Jeffery S. Petrich \"J Petrich\""}, {"rating": 5.0, "review": "best thing i ever bought !!!!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Excellent!  I switched out my Ruku because the Fire Stick works so much easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty view and much more apps. And can watch oldest movies for my mom. I am thinking about buy another one for mom when it is on sale again like only 20 bucks! Loved it!", "verified": true, "helpfulness": "0/0", "author": "Libby L. Singleton"}, {"rating": 2.0, "review": "Why do we get HBO Go in the spring when the Fire TV box gets it now?", "verified": true, "helpfulness": "0/1", "author": "thezky"}, {"rating": 5.0, "review": "Love it, If you are a Prime member, this is even better!  Great for streaming music and fast too. Highly recommend. I got google chromecast when it first cam out and waited thru all the updates, but this stick comes with it all ready to go, except ability to manipulate your music from here. Have to log in on computer or Ipad", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 3.0, "review": "Fire stick is great but remote control is not sufficient and must be replacedby a more user friendly one.", "verified": true, "helpfulness": "0/0", "author": "KR @ Home"}, {"rating": 5.0, "review": "Awesome fast and easy to use", "verified": true, "helpfulness": "0/0", "author": "big joe"}, {"rating": 5.0, "review": "This Fire Stick is awesome. Thank you Amazon :-)", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 3.0, "review": "Really opens up access to my Prime library, making viewing on my TV easy and with great quality.  Although running wireless, streamed films load/start very quickly and I don't get distracting \"buffering\" interruptions.  I only use this for Amazon Prime as I do Not have Hulu, nor NetFlix,Pandora, etc...On the negative side: - I don't like how the HDMI dongle has to be be plugged into the wall for power all the time -it's already crowded back there - The remote isn't always responsive -requiring several presses and sometimes it buffers the clicks so it goes way past the desired place. - Only supports Miracast for device mirroring/broadcasting -which for an Apple household is a non-starter", "verified": true, "helpfulness": "1/1", "author": "W. Wong \"slack key fan\""}]