[{"rating": 5.0, "review": "Works like a dream super fast and the streaming is  amazing", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 1.0, "review": "Waiting for something to load is not what I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "EMT"}, {"rating": 5.0, "review": "I love my fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Sherre6"}, {"rating": 5.0, "review": "Incredible options with the Amazon Fire Stick. Movie and TV Fans should really.  like this", "verified": true, "helpfulness": "0/0", "author": "MICHAEL MCCRIMMON"}, {"rating": 5.0, "review": "Amazing Product!", "verified": true, "helpfulness": "0/0", "author": "Chyna"}, {"rating": 4.0, "review": "Continued until two months, I'm glad to do for yourself to this end, it looks good, I also have no too many ideas, useful, spending choices, good. Apple has always been a leader in electronics industry and I'm glad I have a chance to see.", "verified": false, "helpfulness": "0/0", "author": "Whittinghill\tWriston"}, {"rating": 4.0, "review": "Streaming takes high speed internet. Servers have been down once where internet wasn't an issue but the media couldn't be connected to. Will update later at another time if that continues, for now has only happened once. Would like video that costs to be separated more from other videos.", "verified": true, "helpfulness": "0/0", "author": "Buyer2345"}, {"rating": 5.0, "review": "Best thing I ever bought. I take it everywhere. I know i could just use my phone to watch tv. But this make my life easier. Plug it into any tv that I can get it into , hop on the first avalible Wi-Fi signal. And watch what I want or  my kids favorite shows. It works well at grandma's house.", "verified": true, "helpfulness": "0/0", "author": "angus35"}, {"rating": 1.0, "review": "I have 150 Mbps internet speed and this thing still buffers its ass off. I've done everything I  can do and still buffers. Junk go with something else and don't waste your money. Amazon missed the boat on this thing.", "verified": true, "helpfulness": "0/1", "author": "oke10710`"}]