[{"rating": 5.0, "review": "Can't believe I am ditching Chromecast for this!don't get me wrong, I love Chromecast But I have to say this FieTV stick is much more practicle in everyday life.Dead simple to use and no tech skill require. Tone of channels especially, great if you are a prime member.Prime Member + Fire TV stick = a whole new world of awesomeness!Sadly, I have to sell my Chromecast. :(", "verified": true, "helpfulness": "0/0", "author": "Mr. T"}, {"rating": 5.0, "review": "I already had the Chromecast but the special price for the Fire TV stick was not to be ignored. I am so glad I purchased it! The fact that it comes with a remote is so cool and makes this device so easy to use I doubt the Google device will get much use now. The menu is easy to maneuver and when I need to pause the movie I just click on the remote. I would highly recommend this device!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen \"stantoka\""}, {"rating": 2.0, "review": "UPDATE:This is an update following my initial review below, which was shortly after receipt.The Stick regularly shows that it is seeing and connecting to a very good WiFi signal from my network.  However, its ability to connect to actual streaming content is missing at least 75% of the time.  I haven't determined the optimal weekly times for best odds of viewing anything, because all of my Prime (pun intended) hours are during poor Stick operation.  I have gone through all the measures of rebooting the stick, testing connection, etc.  It simply refuses to deliver content.  I can see all the options, but it won't connect.  Primary targets are Netflix, Amazon Prime, YouTube and Pandora.  I can easily connect to those sources via other devices, such as my WiFi enabled Blu Ray player, various tablets, and a PS3.  So it appears to be exclusive to the Stick.  Ungood.  Fortunately, I only spent $20 on this device during the pre-release sale.  At this point, I cannot recommend it.  At all.  But per my review below, wow, such potential!Initial Review:I purchased the Stick during the brief promo period when it was only $20.  I previously only had Netflix streaming via the Wii, which isn't HD.  For that reason alone, I purchased the Stick.  The Pandora app is a slightly better interface than the one embedded in my Onkyo receiver.  The provided remote lagged terribly in the first hour of use.  The commands would be retained, and after a seconds/minutes of waiting, would suddenly execute all commands.  It was entirely unclear why this would happen, but it later cleared up.  There was been one more brief instance of remote lagging since then,  but when it works, it is capable.  I also tried the remote control app on my phone.  It is also fun to use, including voice command.  However, it has a swiping space that is very sensitive.  At one point I had to finesse between a slight scrolling swipe and a single press to select.  Annoying.I was prepared for only a few offerings, but there are actually quite a few.  There was an initial lengthy update to endure, and then I saw quite a few more selections than what the box showed.  I would guess that the offering will increase or change over time.  I would guess that the Stick only directs commands.  Everything else is stored in The Cloud somewhere.  This Cloud arrangement is cumbersome.  I have access to an Amazon Cloud, another from my smart phone service provider, another from Google Gmail, and even my ISP.  How does one decide which one to use for, say, photos and music?  Too many choices, so in the case of the Stick, I will use it only for my Fire TV choices.The offerings are all over the place, not a bad thing.  TV shows, movies, games, and live channels, I think.  It is confusing though, because I'm not sure how to return and find something I saw while previously surfing.  Where was it now?  There are so many categories.  Also, you have to dive into each one to find out whether it is pay-per-view, subscription based, trial/pay to upgrade, free to Prime members, or widely free.  I haven't bought anything yet, but I have \"coins\" -- dunno where I got them, or how to accumulate more?  Already, I am yearning for a Fire TV Field Guide.But back on point -- $20 for a dizzying array of options.  I initially got Prime for shipping savings last year, and over the past year I have come to realize how Amazon is adding benefits over time.  I would've neglected many of those, but now that I have the Stick, I'm likely to consume more viewing content.  It's great to have options.  Many of us are hooked on current content, such as Walking Dead, Mad Men, or Sons of Anarchy.  These great shows and others like them keep us paying for cable/satellite TV.  If we can just let go of that demand, we will find that there are still so many other options for those few hours we give ourselves for media consumption.  I am overwhelmed with options vs the conscious hours of the day, let alone ones I allot for media.  We need to take time to be quiet, be outside, play with family/friends, exercise, whatever.  Movies and music should be balanced with other life needs.  The Stick was a good purchase though.Verdict: Many viewing and listening options for a small entry fee.  Needs reference guide.  Occasional unexplainable remote control lagging.", "verified": true, "helpfulness": "0/0", "author": "D. Rebennack"}, {"rating": 4.0, "review": "Acquired at a great introductory price.  does everything it claimed.  Great for secondary non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Jack Sides"}, {"rating": 1.0, "review": "I expected much more content for my Prime subscription.  Be prepared to pay for most TV series and movies.  I don't think this product is worth full retail.  I would return it, but I paid the reduced initial offering.  There are better options to deliver your Netflix content.", "verified": true, "helpfulness": "0/0", "author": "C S."}, {"rating": 5.0, "review": "Nice product for the price.The controller is awesome. It makes it feel more like a TV box than a stick.", "verified": true, "helpfulness": "0/0", "author": "qx100solar"}, {"rating": 5.0, "review": "Was very easy to install. Very easy to watch movies now.", "verified": true, "helpfulness": "0/0", "author": "kemay3"}, {"rating": 4.0, "review": "So far it's promising, but I'll update the score as we go along.Read elsewhere what it is, I don't understand reviews that need to rehash the specs.Setup was fairly easy. I have a good (meaning long and many weird characters) wifi password, and after entering it, it downloaded an update and asked me to log in again. While I was typing the password again, which is aggravating at best with that remote, it decided it remembered my wifi setup, so it went on. If I have to enter that password again, I'll start taking points off.Pros:- It works- Network is stable enough here- Operates smoothlyCons:- Netflix app seems to lose sound. So I had to switch another device on, unfortunately. If this does not get fixed I'm taking more points off.- That stupid home button works immediately. It needs a confirmation when you're in an app. Honestly, this needs a fix too.- I want to organize the home screen. I understand Amazon streaming is #1 for this thing, but I want to give the other services I use some priority on the home screen.We'll see how it develops. If I won't like it, it's only twenty bucks lost.", "verified": true, "helpfulness": "0/0", "author": "Hilmar"}, {"rating": 5.0, "review": "So easy to install and we got it up and running right away.  Want one for every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Holly Petrie"}, {"rating": 4.0, "review": "I picked one up at best buy and I love it!  Much better than the Chromecast. I love the remote. The only negative is that I travel for a living and would love a browser so that I could log onto hotel WiFi. PLEASE ADD A BROWSER. T", "verified": true, "helpfulness": "0/0", "author": "Tori Dapas \"TD\""}]