[{"rating": 5.0, "review": "taking tv to the next level!", "verified": true, "helpfulness": "0/0", "author": "Vik"}, {"rating": 2.0, "review": "Hey I really like the concept of this, but..... It does not work reliably enough to switch away from a Roku or other device.  I am not a Amazon Prime customer and maybe that is exactly who needs this device.  We watch Netflix and Hulu and both of those applications had issues and buffering problems.  It fun to watch videos on your tablets, but sometimes you want to watch a movie on something larger than a 27\" screen.", "verified": true, "helpfulness": "1/1", "author": "daBiggie"}, {"rating": 1.0, "review": "Super disappointed in this product!  We bought this to use with our TV's without the smart capability, this won't even stay connected to the Internet.  We've tried it at multiple locations, it just constantly disconnects.  Save your money for a smart tv.", "verified": true, "helpfulness": "2/3", "author": "Anonymous"}, {"rating": 1.0, "review": "Waste of money and waste of time!!  It did not work at all!! I spent 30 min on the phone with a person telling me to reboot 10 times which it did not work and the 2 time on hold for 25 min with no solution.", "verified": true, "helpfulness": "1/1", "author": "Frank"}, {"rating": 5.0, "review": "Delivery was prompt.  Easy to set up and user friendly.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it!  best investment so far", "verified": true, "helpfulness": "1/1", "author": "Angelique Abel"}, {"rating": 3.0, "review": "My family really like this. Finding programs is easy. Quick loading. BUT this stick constantly shuts off itself. It overheats so fast that I need to unplug it, let it cool down which takes a minute, ten replug it and continue where I left off on my show. Major downfall.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Much better than expected.  You can Netflix through this, you can play games, you can HBO GO... I don't have Hulu so I haven't tried to see if it has it.", "verified": true, "helpfulness": "0/0", "author": "A. Higgins"}, {"rating": 5.0, "review": "Love it!! I love having my Amazon movies, TV shows, and my library on my television with a touch of a button.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 1.0, "review": "Plugged it all in, went through the automatic tutorial, it quit working immediately thereafter and then my tv/cable ( Comcast ) ceased to work.  Call it a coincidence, but fact is my tv and all channels were working just fine immediately prior to installing the Firestick and then blew up immediately after installing the Dipstick.  Returning it and going to buy a new smart tv like I should have done in the first place.", "verified": true, "helpfulness": "1/2", "author": "Scott"}]