[{"rating": 5.0, "review": "Works well!", "verified": true, "helpfulness": "0/0", "author": "Kelly D."}, {"rating": 5.0, "review": "Amazon fire stick is amazing! ! I purchased a chrome cast first but I should have purchased Amazon fire stick first, I wasted money on the chrome cast!! Now, the chrome cast is collecting dust on the shelf! ! Get a fire stick, you will be satisfied! !! Great product!!", "verified": true, "helpfulness": "0/0", "author": "Kathy R. \"Kathy Robinson\""}, {"rating": 3.0, "review": "I can't figure out how to search for shows if I don't have the app. Can someone help me?", "verified": true, "helpfulness": "0/0", "author": "Ellen Fagan"}, {"rating": 5.0, "review": "My son gave it to me as a Mother's Day gift. I live it and it isn't super expensive!! It's wonderful having movies, TV shows, news and more available in an instant.", "verified": true, "helpfulness": "0/0", "author": "Laura A. McRoberts"}, {"rating": 5.0, "review": "Neri good", "verified": true, "helpfulness": "0/0", "author": "Maria R. Perez"}, {"rating": 5.0, "review": "I love it!Very easy to install", "verified": true, "helpfulness": "0/0", "author": "David Ramos"}, {"rating": 3.0, "review": "Be careful with the screen saver.  It eats up bandwidth even when you aren't using it.  No way to reduce the resolution to save bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"RT\""}, {"rating": 3.0, "review": "I am an Amazon fan and am loyal to Amazon even with it's warts.  In this case I am a bit disappointed with content and features.  For example I can't cast or mirror my Kindle Fire because it's an older version, that stinks, Amazon should make that available.  I also cannot get a simple internet browser app to work/load on Fire TV nor can I side-load an app even when following all the instructions for developers.  So my main goal was to mirror or cast my cable provider live TV broadcast wirelessly  from my Kindle Fire to the Fire TV and it's a no go so far.  Maybe there is a solution out there, I'll keep looking.  I will probably get a Chromecast stick which has a Browser and see it that works.", "verified": true, "helpfulness": "0/0", "author": "Edju"}, {"rating": 4.0, "review": "Excelent but many services are restricted in my country", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Awesome invention!", "verified": true, "helpfulness": "0/0", "author": "Nadia Sherif"}]