[{"rating": 5.0, "review": "This was a Christmas gift and I love it. A great product.", "verified": true, "helpfulness": "0/0", "author": "Annie S. Diggs"}, {"rating": 5.0, "review": "Purchased this on a whim when Amazon was having the prime member preorder pricing. Works well, with some minor complaints.I tried to use the USB port on my tv, but the fire tv stick said the port wasn't sufficient to power it. I have to use the included power adapter. Minor gripe.Also, for the first few days the fire stick glitches often loosing connection and dropping programs. Seems to be an issue more so with the non Amazon aps.Overall, great buy at the special price and at current price, especially if you already have Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Really a breeze to set up, connected to my WiFi fast and simple. I was impressed! Works great, lots of really cool programing!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device. Really made access to the shows much easier.", "verified": true, "helpfulness": "0/0", "author": "Michael Shelton"}, {"rating": 5.0, "review": "Just to much", "verified": true, "helpfulness": "0/0", "author": "theresa m powell"}, {"rating": 5.0, "review": "Does exactly what it says it does. Very satisfied", "verified": true, "helpfulness": "0/0", "author": "abby"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Pamela Mathis"}, {"rating": 5.0, "review": "I received this for Christmas and it has been fantastic!  Our daughter can watch all of her movies on the big screen now and she is thrilled!  We took it on vacation and were able to her up with Sesame Street and Daniel Tiger when she needed some down time.  If you have a prime account, I am not sure why you wouldn't own a Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "BLL1015"}, {"rating": 4.0, "review": "Easy install and setup. I haven't explored many of the apps yet but this is a pretty cool device. I like how it easy links to my Prime account. It doesn't have a lot of the same apps as Apple TV which is good as I was originally just trying to supplement Apple TV and view the Amazon instant video and Amazon original series as well. Now I have lots of other stuff to check out as well. And I can play Tetris. Bonus!", "verified": true, "helpfulness": "0/0", "author": "MereLovesHiking!"}, {"rating": 1.0, "review": "Didn't work with my Samsung and sharp tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]