[{"rating": 4.0, "review": "love it. however because it is a newer product the app choices are limited and i feel that's the only thing that need's a considerable amount of improvement.4 stars because there is always room for improvement.love it and great product overall still fairly new so i have some understanding for they need time to update app's selection", "verified": true, "helpfulness": "0/0", "author": "EVAN WILSON"}, {"rating": 5.0, "review": "BEST INVERSION EVER....", "verified": true, "helpfulness": "0/0", "author": "Wendolane Figueroa"}, {"rating": 4.0, "review": "I am using this almost daily and it has been the best...!! Have connected it to my Projector at home and it works just Awesome...!", "verified": true, "helpfulness": "0/0", "author": "Vkeys"}, {"rating": 4.0, "review": "The prompts are all in Germen. I would like a brief pamphlet which reviews the features mentioned in the introductory video. In English. Free films should be on the menu in a separate category.", "verified": true, "helpfulness": "0/0", "author": "goompa"}, {"rating": 5.0, "review": "Enjoying the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Emily Anderson"}, {"rating": 5.0, "review": ":) happy", "verified": true, "helpfulness": "0/0", "author": "Mr1940chevy"}, {"rating": 5.0, "review": "This is worth the money, especially if you have Amazon Prime.  There are so many cartoons and movies that my two year old can watch.  If I had more time to watch t.v. I would also be taking full advantage of all of the movies and t.v. shows that are included at no additional price.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Drucker"}, {"rating": 5.0, "review": "We love the Amazon Fire stick. It was very easy to install and use and there are so many options of free movies and TV shows on amazon. You can also download apps. We were concerned that the quality might not look great on our 110\" projector screen, but it surprising is very clear. Great buy for us!", "verified": true, "helpfulness": "0/0", "author": "Lisa P."}, {"rating": 3.0, "review": "If the standard Amazon Fire TV is a 5-star product, which I believe it is, this is a 3. Speed isn't consistent and I run into video problems with Hulu Plus. Still a great product and better than the Roku Stick but I would invest in the regular Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Chris L."}, {"rating": 4.0, "review": "I'm giving this device 4 stars for 3 reasons:1- There are very \"few apps\" available2- It is not meant for usage outside of the USA/UK (thanks to all the licensing issues of the streaming content)3- Amazon needs to update it's support page and add Windows Phone. I have been able to completely mirror my screen of my Lumia Icon without lags, seriously Android devices lag more than Windows Phone for these matters.Overall, picture quality and interface is great.Well thought and designed.It supports Plex and is available to install from Amazon AppsStore, you can use it to stream your local media.I really wish installing apps from outside sources was a bit easier.Yes, I recommend it for both, using in the states with Prime or without it whether there or abroad.", "verified": true, "helpfulness": "0/0", "author": "G. Gutierrez"}]