[{"rating": 4.0, "review": "firestick is very good. I like the interface very user friendly. The one thing that seems to be difficult is trying to cast things from your phone or tablet or laptop to the Amazon fire stick. It seems that there are barriers to let's say cast HBO GO to Amazon fire stick. I don't believe amazon has an HBO Go app so it seems they're trying to eliminate you being able to view HBO Go via another device by casting which chromecast does very well. Other than that there are many apps to download and use and it rivals Netflix if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Matt L."}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Gazi Mahmud"}, {"rating": 4.0, "review": "Only thing it is missing is support for directv so that you can log in and watch their online content", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "Simple setup. Easy to navigate through screens.", "verified": true, "helpfulness": "0/0", "author": "Bill Forsythe"}, {"rating": 4.0, "review": "It is lighting fast.  Had a little trouble getting it started but the Amazon help was great.  We got it started and I was surprised how fast it is.  The more I use it the better it seems to be working.  Occasionally it will loose contact with the wifi, but that problem has pretty much disappeared.  A great product and I may be getting another one soon.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Cicairos"}, {"rating": 5.0, "review": "my mom loves it - she watches justified!", "verified": true, "helpfulness": "0/0", "author": "Toby Chalk"}, {"rating": 5.0, "review": "Picture quality is great and it is very user friendly!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Super deal", "verified": true, "helpfulness": "0/0", "author": "richard m demko"}, {"rating": 5.0, "review": "Good stuff does what it's supposed too!", "verified": true, "helpfulness": "0/0", "author": "demetrius harris"}, {"rating": 4.0, "review": "This device is such a sweet little media streamer! Everyone in my house was in love with it and it's ease of use. Personally, I do not think it is missing anything at all for average consumers. It is Miracast enabled, so you can stream to it, but it did not work with my surface pro 3. I originally bought to stream my SP3's screen, but it did not do so, so I returned it. It would have had 5 stars and it would not have been returned if it would have streamed my SP3 screen. Other than that, AWESOME device Amazon!", "verified": true, "helpfulness": "0/0", "author": "Andres Cavada"}]