[{"rating": 5.0, "review": "The fire sticks was ever thing I needed", "verified": true, "helpfulness": "0/0", "author": "brandonpierce"}, {"rating": 5.0, "review": "Love. Love. Love this! The only disappointment I have is that Gary Busey wasn't the cartoon character on the guide through video.When looking into this before buying I was a little skeptic about how easy it would be to set up. Or if I would need to buy more just to hook it up a use it. But it came with everything needed right in the tiny box! Having a blast seeing and trying out every option and free app it has. Synced it with my phone and kindle. It is so user friendly. Can't wait to call the cable company and cancel all those useless cable channels. Going to save so much money in the upcoming years.", "verified": true, "helpfulness": "1/1", "author": "Kathy"}, {"rating": 5.0, "review": "I love my Amazon Fire, it's become my entertainment center. My friends love it too. It was easy to install", "verified": true, "helpfulness": "0/0", "author": "Miss Darva \"Darva\""}, {"rating": 2.0, "review": "I'm a big Amazon fan...it's probably  my favorite company to do business with, but this product is grief to me.  Pluses?  Yes. Great interface.  Beautiful picture at times.  But, like others reporting here, I'm getting a frustrating number of connection drops (it's not my wireless connection) and other hiccups.  Moreover it seems to suck up a lot more broadband than my other device (which I've had to go back to using).  I couldn't recommend this to a friend or neighbor...or you.  I hope Amazon does better with a later version.", "verified": true, "helpfulness": "0/1", "author": "Joe Oliver"}, {"rating": 3.0, "review": "I bought this when it was first available, and soon gave it away. It's alright, but to be quite honest, given the fact that virtually anything you connect to your TV these days, if not the TV itself, does everything this device does and more, I'm not sure there's much of a point for most people. Do you have a Smart TV? Then you don't need this. Do you have an Xbox 360, PS3, PS4, Xbox One or Wii U? Then you don't need this. Do you have an Apple TV or a Roku? Then you don't need this. Do you have a Chromecast? Then you don't need this.The list goes on. There's nothing wrong with it per se--it does what it's advertised to do--it's just that, so does everything else these days.", "verified": true, "helpfulness": "0/1", "author": "J. Ward \"Thinking Critically\""}, {"rating": 3.0, "review": "It took a while for me to get it working. Once I had it working it was wonderful. But now it has started having lots of connection issues. Really annoying.", "verified": true, "helpfulness": "0/1", "author": "Maddy"}, {"rating": 3.0, "review": "I cannt figure out how to work it. So Iftar dyslexic like me call", "verified": true, "helpfulness": "0/1", "author": "Michael K."}, {"rating": 5.0, "review": "loved it some much we ordered another one for a different tv", "verified": true, "helpfulness": "0/0", "author": "stephvs"}, {"rating": 3.0, "review": "Works good.  Problem is you can never get it off the network without unplugging it.  Not a good way to do things.", "verified": true, "helpfulness": "0/0", "author": "J. Paul"}, {"rating": 1.0, "review": "It is good for an hour's watch and then it claims it is no longer connected to internet.  No immediate recovery with most reboots. A terrible disappointment as I think your content is excellent.", "verified": true, "helpfulness": "0/0", "author": "Robert Horan"}]