[{"rating": 3.0, "review": "When it works, it is great. Exactly what we wanted. Unfortunately, we have intermittent connectivity issues with it. Also, sometimes it chokes and quits completely if someone is watching our other TV that is connected by HDMI to a Kindle Fire. We've found that the TV stick works best when using the provided extender and when you put it as close as possible to the router.", "verified": true, "helpfulness": "0/0", "author": "gente boa"}, {"rating": 3.0, "review": "It was great while it worked... which was a period of five days. Tried to use it on day six, and my TV displayed \"no signal\". Moved it to another tv and got the same thing. Went to exchange it for another, but the brick and mortar store was out of stock.", "verified": true, "helpfulness": "0/0", "author": "Aaron Binford"}, {"rating": 5.0, "review": "Great device with options that are limitless if you put your time in the research", "verified": true, "helpfulness": "0/0", "author": "derek dennis"}, {"rating": 4.0, "review": "I like it ! Easy to use", "verified": true, "helpfulness": "0/0", "author": "Martha Ingier"}, {"rating": 3.0, "review": "Great picture, good response loading movies, audio clarity lacking at normal levels", "verified": true, "helpfulness": "0/0", "author": "william martin"}, {"rating": 5.0, "review": "So far we love it. It's easy to use. We even canceled our comcast and will strictly be using our tv options with the fire stick. I will be ordering another one so that we have one for our room and the livingroom. Even though it's very easy to unplug and plug into the other tv having 2 sticks will allow it to be used at the,same time in 2 different rooms. My kids love the games.", "verified": true, "helpfulness": "0/0", "author": "Christy"}, {"rating": 5.0, "review": "Great after a friend downloaded something on it and now I get my movies and shows for free.", "verified": true, "helpfulness": "0/0", "author": "dstrick"}, {"rating": 5.0, "review": "This is so easy to install it took this 65 year old w/ arthritis less than 1 minute to hook it up. I truly do love this thing. As soon as my current satellite provider contract is over I'm canceling with them. Who needs them. If you want local channels they have those new indoor antennas that have a range of about 60 miles. Works for me.", "verified": true, "helpfulness": "0/0", "author": "4th Generation Orangeite \"K.R. Schlueter\""}, {"rating": 4.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Delberta Storz"}, {"rating": 5.0, "review": "If you're tired of waiting, waiting, waiting for Amazon Prime to come up on your PS3 (And all the other problems of using a PS3 for Amazon Prime), then just spend a few bucks on this device and all those problems will go away.  Setup is easy, and once that's done, every time you use it, its ready in about 20-30 seconds after you plug it in.  Shows and movies load and begin to play in just seconds....EVERY TIME!  Great device.", "verified": true, "helpfulness": "0/0", "author": "T.C."}]