[{"rating": 4.0, "review": "I know that Amazon's purpose in life is to get us to buy more content, but with products like this and their ability to add more value to Prime make me a loyal customer.  Very easy set up and use.  The only complaint I have is that I wish it had HDMI pass-thru and that they integrated it more into the TV experience to control my cable box and search the tv guide as well.  With Google abandoning Google TV in favor of Android TV, I'd like to build around the Fire TV ecosystem if I knew more about where they're going with it.", "verified": true, "helpfulness": "0/0", "author": "rick_in_dc"}, {"rating": 5.0, "review": "There are a lot of streaming devices out there and trying to choose one can be difficult. I really recommend the Fire TV Stick . Its simple to use and requires very little set up. Truly a great product !", "verified": true, "helpfulness": "0/0", "author": "Mo \"Mo\""}, {"rating": 5.0, "review": "The remote is really what makes this stand out from chrome cast, which can be problematic occasionally when controlled by your smart phone", "verified": true, "helpfulness": "0/0", "author": "Trippio \"Trippio\""}, {"rating": 2.0, "review": "Buggy software...keep having to log into netflix.", "verified": true, "helpfulness": "0/0", "author": "iFlash"}, {"rating": 3.0, "review": "I really wanted to like it, but after having it a little over a month it's going into storage. Unfortunately I can't compare it to any other streaming sticks as the only other device I use to stream is a playstation, however the stick compared to the playstation is incredibly slow (obviously). If you have nothing else to stream on I would recommend picking one up as they are cheap, but mine freezes up at least once every other night so there are definitely better (more expensive) options out there.", "verified": true, "helpfulness": "0/0", "author": "BillyJack"}, {"rating": 2.0, "review": "Just purchased the amazon tv stick but I live in the Caribbean is the movies free or do I have to pay for them.", "verified": true, "helpfulness": "0/0", "author": "Richard   Chase"}, {"rating": 5.0, "review": "Fabulous!", "verified": true, "helpfulness": "0/0", "author": "Jill Keyes"}, {"rating": 4.0, "review": "I am absolutely pleased with the Amazon Fire TV Stick! Was simple to install and so much entertainment to choose from. Luv it!", "verified": true, "helpfulness": "0/0", "author": "renita Lopez"}, {"rating": 5.0, "review": "I love this Device, it does everything that I need and more!", "verified": true, "helpfulness": "0/0", "author": "Benjamin G. Dyson"}, {"rating": 2.0, "review": "I am disappointed. I have had roku for 4 years and the ease of operation does not compare. My roku had to be replaced a week after I received the  fire stir so I ordered a refurbished room stir and there is no comparison to how much better. I thought the refurbished roku stir was a little more expensive but is worth it. I have not checked it out,but have told I could have  gotten new roku stir for same price as the fire stir. One of the very few times I have been disappointed in Amazon.", "verified": true, "helpfulness": "0/1", "author": "reader person \"nana\""}]