[{"rating": 5.0, "review": "Absolutely love my new fire stick! I love the fact that it was already programmed for me too! I definitely would recommend this product to somebody.", "verified": true, "helpfulness": "0/1", "author": "Kayla Wiley"}, {"rating": 5.0, "review": "I have only used it for a day and i LOVE itmy only wish i that i had purchased it years agoset up was easy", "verified": true, "helpfulness": "0/1", "author": "Jelayne Underwood \": )\""}, {"rating": 5.0, "review": "The perfect tool for immersion watching. I've discovered so many shows --- Power, Vikings, Key & Peele –– just from using this little stick. It's a lot of fun to scan through. Very intuitive. Best of all, most shows are included with Prime. What I love most: for some reason, shows delivered through the Fire Stick have better sound than those played on my Comcast HD box. I don't know why that is, but I enjoy watching shows using the stick more so than On Demand. I also like that it's commercial free viewing. I started watching Vikings on Fire Stick. I noticed that I could watch the current season On Demand but HATE having to sit through 5 minute blocks of commercials that I can't fast forward through. With Fire Stick, I also like that the next show it cued and waiting whereas with On Demand, it's kind of a process. This is the future of TV. Once my Comcast contract is up, it's over. Fire Stick means cutting the cord and being Comcast free (except for internet).", "verified": true, "helpfulness": "0/0", "author": "Lucille Bills"}, {"rating": 5.0, "review": "Very easy to install. An easy and inexpensive way to view internet programs.", "verified": true, "helpfulness": "0/0", "author": "FRED DONATUCCI"}, {"rating": 4.0, "review": "Love it. Can't give it 5stars because it is an additional expense to watch programming. Since it is a choice I made I'm ok with it, but it is a luxury item.", "verified": true, "helpfulness": "0/0", "author": "Miles \"Aunt Books\""}, {"rating": 5.0, "review": "amazing value for a device that will cause you to get hooked on countless programs!!", "verified": true, "helpfulness": "0/0", "author": "4483wahoo"}, {"rating": 5.0, "review": "Second of these I've purchased. They're ok. They perform as advertised. Kids are happy", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 4.0, "review": "Good system for the money.  It will be Great for small screens, but for 55\" and above, but the Fire TV Box.Great system and good results for TV's under 42\" in size.I own both.", "verified": true, "helpfulness": "0/0", "author": "Robert T. Hentz"}, {"rating": 4.0, "review": "I have to write so many words for this review to be accepted.", "verified": true, "helpfulness": "0/0", "author": "P. Collins"}, {"rating": 5.0, "review": "We have just gotten set up, gone through the tutorials and are enjoying our first taste of streaming video. So far, it is everything that we were hoping for.", "verified": true, "helpfulness": "0/0", "author": "M. Fuller"}]