[{"rating": 5.0, "review": "Did not get 30 days free.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this device!! Can access all my Amazon music and Netflix, and Fire Stick makes it all so easy.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 5.0, "review": "Works like a champ.  The USB port on the TV provides all the power needed.  Nice remote and interface.  Nice selection of apps.", "verified": true, "helpfulness": "0/0", "author": "G. Brown \"GB\""}, {"rating": 5.0, "review": "This thing is amazing! My only complaint/warning is the fact that the wifi card has a incredibly short range of distance, basically 15 to 25 feet. If your router is close by then this thing is golden.", "verified": true, "helpfulness": "2/2", "author": "Anson Kurtinaitis"}, {"rating": 3.0, "review": "Won't turn back on after it sleeps. I have to ip unplug it and plug back in. Never have this issue with my Apple TV which is on the same TV differ HDMI input. I have switched the out but the fire does the same on either port.", "verified": true, "helpfulness": "1/1", "author": "biggscpa"}, {"rating": 1.0, "review": "If I could get it to work, I might give it a higher rating.", "verified": true, "helpfulness": "1/1", "author": "melissa martin"}, {"rating": 5.0, "review": "i am beyond happy I got this!  We purchased before it was released at a nice discount and would gladly pay full price for because it's worth every penny. We have this in our bedroom & also have a Roku on our tv downstairs and like the Fire TV better.", "verified": true, "helpfulness": "1/1", "author": "Pamela S. Pearce"}, {"rating": 5.0, "review": "All I can say is, I love this product better than my apple TV and roku. With Amazon prime, I makes perfect sense to own this rather than any other product of its kind.", "verified": true, "helpfulness": "0/0", "author": "Dktom"}, {"rating": 5.0, "review": "great product! great price!", "verified": true, "helpfulness": "0/0", "author": "Mark Zajkowski"}, {"rating": 3.0, "review": "Lots of options to connect you to Amazon, but no web browser?  Seems like an odd omission.  I just ASSUMED there would be one.  If I had done proper research in advance, I wouldn't have bought this product.", "verified": true, "helpfulness": "1/1", "author": "P. Tuesley"}]