[{"rating": 5.0, "review": "I've bought like 4 so far, and have recommended it to my friends. Despite having smart tv in every room, nothing tops the quality of the firestick, you will notice it while using Netflix or YouTube app.Also, if you are geeky enough you can install Kodi or any android apps that you want.", "verified": true, "helpfulness": "0/0", "author": "Muhammad"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "DB1981"}, {"rating": 1.0, "review": "I bought this and its point less unless u have prime a credit card and are willing to pay per tv show and per movie add all that up better off buy tv survice", "verified": true, "helpfulness": "0/2", "author": "sammy"}, {"rating": 1.0, "review": "Fire stick keeps losing Internet connection. While all of my other devices work just fine. I have to restart it almost daily.", "verified": true, "helpfulness": "1/1", "author": "Tom Rapp"}, {"rating": 2.0, "review": "Having unfortunately frequent issues connecting to my home network. None of my other devices have issue. Will try longer hdmi extension cord hoping getting firestick further away from tv will eliminate interference with wifi signal. Too bad longer cable wasn't included by amazon with the firestick.", "verified": true, "helpfulness": "0/0", "author": "duane"}, {"rating": 5.0, "review": "Only got to use it once so far but it worked great. Very easy to get started and use.", "verified": true, "helpfulness": "0/0", "author": "D. J. Squire"}, {"rating": 1.0, "review": "I can't get my T V to work with the cable", "verified": true, "helpfulness": "0/0", "author": "Kathy Hoglund"}, {"rating": 5.0, "review": "So far it's working very well and the delivery was very fast.", "verified": true, "helpfulness": "0/0", "author": "kathy l.davis"}, {"rating": 5.0, "review": "The fire stick is very easy to use. The back on the remote is a little hard to open but not a big deal. I was very pleased with the inclusions, everything to get you going. Use it every night.", "verified": true, "helpfulness": "0/0", "author": "Jude"}, {"rating": 5.0, "review": "Definitely an awesome product. I had to sell my Xbox one (recently had a child so no time to game and I needed the money) and all my girlfriend and I used it for really was for Netflix and Hulu, so this was a perfect substitution.", "verified": true, "helpfulness": "0/0", "author": "Jacob Benyo"}]