[{"rating": 1.0, "review": "No worth the money. I have had other streaming devices in the past and this one is by far the worse. I hardly get to watch a movie straight through.", "verified": false, "helpfulness": "0/1", "author": "Paul Merritt"}, {"rating": 5.0, "review": "I love Amazon Fire Stick", "verified": true, "helpfulness": "0/0", "author": "michael owens"}, {"rating": 5.0, "review": "The fire stick bought on Prime Day was a GREAT PURCHASE.  I have PS3 so a lot of the same features can be had on there but for 25 bucks I really couldn't go wrong.  If I didn't have a PS this little gadget would be invaluable...I can watch my HBOgo, Netflix, ESPN, and all the free services available are cool as well.  Different sports channels, games, apps, all in this little device.  WOW.  I was going to buy a ChromeCast a while back, I'm really REALLY glad I held out.  The stick seems to be well made, I like the sleek remote, I like everything about it...If you don't have something like it...look into it.", "verified": true, "helpfulness": "0/0", "author": "MikaelDjur \"collapseonimpact\""}, {"rating": 5.0, "review": "Very pleased with this device", "verified": false, "helpfulness": "0/0", "author": "Linda Barnes"}, {"rating": 4.0, "review": "Great product! Beats having a monthly cable bill! Wish there were more options for live TV though.", "verified": true, "helpfulness": "0/0", "author": "Edmund Wilson III"}, {"rating": 4.0, "review": "Awesome. Wish it had buttons to control the volume too.", "verified": true, "helpfulness": "0/0", "author": "N. Ej"}, {"rating": 1.0, "review": "This stick is great except that it randomly shuts off my vizio TV in the middle of shows!!! What the hell?!?? Heard other ppl have same issue. No solution???", "verified": true, "helpfulness": "1/1", "author": "Godess4lfe"}, {"rating": 5.0, "review": "Works great I really like it!  Setting it up was real fast and a snap!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "MJP"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "shermina"}]