[{"rating": 5.0, "review": "kodi works on it very well", "verified": true, "helpfulness": "0/0", "author": "amin"}, {"rating": 1.0, "review": "I bought 2 of these and high expectations. Like others, this device is plagued with connectivity issues. Even when it says my connection is very good, the stream is terrible. It stops every 5-15 seconds and hangs there. I have 2 Roku's and an Apple TV in my house and they all streamed flawlessly when I tested them against the struggling Fire TV. I suggest a Roku until they can fix this product.", "verified": true, "helpfulness": "2/7", "author": "Jason"}, {"rating": 4.0, "review": "I got mine today and have it installed on my TV. It works great.  But I can't find the YouTube app anywhere at all.  The FireTV was updated when I set up this system.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I guess I was one of the lucky ones who got this for $19 when it was first released.  A solid performing device in a small, unobtrusive package.  It loads video quickly.  Menus are quick, and very easy to navigate.  The interface is beautiful, and loads the thumbnail images that you select with almost blazing speed. All the basic streaming services are available, including Netflix which also sports a very polished interface for Fire TV.Form factor for the remote and stick are basic but sturdy.  Some of the reviews mention that there is no voice search included on the remote and this is correct.  It doesn't matter, however, because you still can get full functionality with voice search and use of a keyboard for free if you have an android smartphone or device.  The voice search function works great with the Fire TV app that I installed on my android phone.  Voice recognition is top-notch and results load almost instantly.  That said, as far as I know the Apple app for Fire TV stick is coming soon but not yet available.As a Prime subscriber, I also love the pre-loaded, built in access to Prime Music and my amazon cloud photos (which I have set up for auto back up from my phone ever since Amazon announced that there is now unlimited storage for pics).  Finally, the video games work well- the remote control is very responsive when playing Flappy Bird and some of the other basic games I have tried out.In sum, an excellent streaming device for your TV at an affordable price.  Good work Amazon!", "verified": true, "helpfulness": "0/0", "author": "S1"}, {"rating": 5.0, "review": "I'm new to streaming television.  But this little stick is well worth the price of admission.I've read some folks saying it's a little slower than there firebox.  If that's the case the firebox must read your mind, because the interface seems lighting fast to me. I also really like voice search.  It's not perfect, but a heck of lot faster then scroll typing.  I'd recommend either downloading the voice app for your phone, or buying the voice operated remote. I'm hoping Amazon's new Echo device will interface with it when it comes out (fingers are crossed, I'm on the list for the $99 deal)The video selection is awesome, and the the streaming is instant, no lag.  Well no lag at my home with 6 Mps download speed.  I have oodles of bandwidth to spare.It blows my mind how much Amazon has packed into this one stick.  There are an amazing array of options and apps.  I've had DirectTV for last 5 years, with box rentals and DVR, my bill runs around a $138 per month.  The Fire TV Stick is going to save me a nice wad of cash, by allowing me to pay for what I want without having to pay for what I don't want.Streaming video is the next evolution of home entertainment.  I have to imagine these devices will absolutely crush the pre-packaged programing providers.  No more having to buy 30 channels that you don't want to get the one you do want.  No more funny numbers when it comes to billing.  No more haggling with phone reps over package costs.This device meets the needs of my entire home.  My wife likes to watch all the \"Housewives of XY and Z\" shows on Bravo, they're there.  I like the Walking Dead, which recently DirectTV has been threatening to drop, it's there, I also watch several Discovery shows... all there.  My teenagers love the movies, and YouTube.  I must say, watching YouTube on your television really enhances the experience.  Oh, and you can sync it with your tablets, ipads, and laptops which really enhances the search experience.  You can cue up an entire channel, or select a custom selection of your own, and just sit back and enjoy.  My youngest daughter likes to watch several Teen Nick shows, and several Disney shows, and they're all available.This does what you've always wanted.  Instead of watching your shows when and IF your set-program provider allows you to watch them, you can see them anytime you want.  I also noticed that even though I currently get every premium channel available on DirectTV, the newer movies are available on Prime before they hit the premium channel rotation.You can get a free month trial of Netflix and one week trial of Hulu.  So be sure to give them a test drive.  I might be adding one or both.  ...it's still a heck of lot cheaper then cable or satellite TV.It's a winner, go ahead and make the leap, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Edward Hamilton"}, {"rating": 5.0, "review": "I'm glad to have it, but haven't figured out how to use it.", "verified": true, "helpfulness": "0/0", "author": "Roberta B. Zehr \"rozehr\""}, {"rating": 3.0, "review": "I have a Fire TV upstairs and it works great even though it's a floor up and a couple rooms over from the wireless router.  This one however, despite being ~10 feet from the router, occasionally stutters during YouTube or Netflix playback.  Also occasionally a button will stick and it will constantly scroll for a few seconds.Overall still a better deal than the Chromecast and hopefully there'll be a software update to fix the issues but until then, not recommended at full price.", "verified": true, "helpfulness": "0/0", "author": "J. Johnson"}, {"rating": 2.0, "review": "Returning! Always been a roku user and decided I would try this stick. Right out of box was disappointed because you can't use the USB port on tv to power it you have to plug into wall. Hence more cables! Then took forever to setup and do its update. About an hour and half. I have fastest wifi possible so this was not the issue. Then finally it booted and ready to go. Trying to keep open mind. Realizing not as user friendly as roku. What sealed the deal of return is it doesn't have vudu !!! Why would Amazon even bother. Movies you buy have digital copies for vudu so you don't have to look and mess with your DVDs. So it's a big no for me. Very disappointed!", "verified": false, "helpfulness": "13/27", "author": "Holli"}, {"rating": 4.0, "review": "Let me be clear, I am a very avid Roku customer (I have 3 versions), and I found it lacking various apps (The Blaze TV, VUDU, etc) to be able to give this little device top marks,  (tech specs are pointless without features).I have been very impressed with how well it streams, and stays connected.  It's easy to navigate and setup was a breeze.It connects to an android app so you have a keyboard and voice control.  At this point, I'm going to throw it on a TV I don't use a lot, and won't buy another at this time.", "verified": true, "helpfulness": "0/0", "author": "GTWar"}, {"rating": 4.0, "review": "love the interface, very responsive to menu changes, move start and stop.  Love it to watch Amazon videos.", "verified": true, "helpfulness": "0/0", "author": "Chris OFlaherty"}]