[{"rating": 1.0, "review": "Cool device with several services in one place.But, it can't be powered from a TV USB port, It has to be plugged into a wall outlet.  Completely negates the point of the stick form factor.I have been using a Chromecast for many months now and hoped this would have been an upgrade with the higher spec internals and more available apps, but it's a big step backwards.I wanted to like it, but missing the simple task of just powering up as conveniently (and aesthetically for those with their TV's mounted on the wall with no visible cables) as the Chomecast or Roku stick is a instant deal breaker.This might end up in someone else's Christmas Stocking, or maybe just the bottom of my sock drawer, haven't decided yet.", "verified": true, "helpfulness": "0/2", "author": "Jason Kent"}, {"rating": 4.0, "review": "Fast, easy to set up, great user interface. So far pretty impressed. Using it side by side with a Mac mini and an Apple TV", "verified": true, "helpfulness": "0/0", "author": "Evan R. Bartlett \"Evan Bartlett\""}, {"rating": 5.0, "review": "It is perfectly excellent.  I like it much better than Google Chromecast.  Image displays better than Chromecast.  If your TV has USB port, you can use it to power Fire TV Stick, it works well.", "verified": true, "helpfulness": "0/0", "author": "Loc Q. Tran \"HiDef\""}, {"rating": 1.0, "review": "I was hopeful but Fire TV is not performing and the messages all indicate network connection problems and it is dropping the network connection often or it starts streaming and then stops and displays a message that my connection is slow.  I am having no problem streaming to the Kindle Fire HD.  I am thinking the stick is a bust, fortunately I only paid $19.", "verified": true, "helpfulness": "0/1", "author": "Eda-Marie Bicho"}, {"rating": 1.0, "review": "Right now 1 star since I cannot work it. Amazon should specify its not compatible with all TVs, I have an old Sony flat screen but not compatible, once I get an upgrade will follow up. Kind of disappointed", "verified": true, "helpfulness": "4/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love this thing! I've been using a four year old blu Ray with the Amazon and Netflix app and it was pretty tough to use. This is so much easier and faster! I like the simplicity and so far the extras are fun.", "verified": true, "helpfulness": "0/0", "author": "Christen in AZ"}, {"rating": 5.0, "review": "Love this thing.  Very easy to set up and the kids love being able to play their music.", "verified": true, "helpfulness": "0/0", "author": "Jack Bang"}, {"rating": 5.0, "review": "So far, so good! We have been using Chromecast for a couple years now. I like the layout and ease of use of the Fire TV Stick better.", "verified": true, "helpfulness": "0/0", "author": "WaterSki2011"}, {"rating": 3.0, "review": "The menu is great but streaming can be glitch even with great WIFI signal.", "verified": true, "helpfulness": "0/0", "author": "jeremy nelson"}, {"rating": 2.0, "review": "The fire TV stick seemed generally good in the begining but within a week the remote has started malfunctioning. The response time for remote is very bad now. I am managing with the mobile remote app. Lets see how reliable the fire stick is overall. If anymore malfunction I will return it.", "verified": true, "helpfulness": "0/0", "author": "Abinash Das"}]