[{"rating": 5.0, "review": "love it! i wasn't happy about how long it took to receive it but so far so good. actually, there's one negative, now i watch a lot more tv (via amazon prime) than i used to.", "verified": true, "helpfulness": "0/0", "author": "savvyshopper"}, {"rating": 5.0, "review": "Absolutely fabulous.  Too easy to set up. It is THE internet cable box without the cable company.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "The Fire TV stick is GREAT! I have a chromecast, and in my opinion the fire stick beats it hands down. I use this device for prime tv shows and movies. It is snappy and responsive for what I need it to do. It is SO close to be a replacement for my HTPC, but it does not do \"live\" tv well. I have to side load xbmc to get it to pickup my hdhomerun streams. That means I don't get a guide.This was not made to do live tv, so... for what it does. It is perfect for me.", "verified": true, "helpfulness": "0/0", "author": "&#34;Jon&#34; \"Jon\""}, {"rating": 3.0, "review": "I wish the feature to lock out purchases worked better. my kids have figured out the password just by watching me unlock it. even my 4 yr old figured it out.", "verified": true, "helpfulness": "0/0", "author": "tiffany"}, {"rating": 5.0, "review": "Fastest menu Ive ever experienced in its class.  Loved it came already setup for my amazon prime account.", "verified": true, "helpfulness": "0/0", "author": "Shannon Dillon"}, {"rating": 4.0, "review": "I will preface this review by saying I am not a techy person. I am also not usually an early adopter, but when I was able to preorder it for less than $20, I jumped on it.  I love my Fire TV stick. It does what I was expecting -- it allows me to watch my Prime movies and TV shows. As an added bonus, I'm able to listen to my Prime music as well via my TV.Installation was quick and easy. 10 minutes and we were good to go. The hardest part was typing in the wifi password. The only thing I don't like is that I have to scroll through my Watchlist to find shows. I have a lot of shows in my Watchlist, so it can take awhile. There's probably a search function I just haven't found yet.", "verified": true, "helpfulness": "0/0", "author": "Sarah H \"dabbler\""}, {"rating": 5.0, "review": "LOVE IT! I recommend getting an amazon prime account so you can have access to more movies!", "verified": true, "helpfulness": "0/0", "author": "Cheyenne Williams"}, {"rating": 2.0, "review": "While the stick may work, it's not working for me. First it wouldn't connect to the wifi we have. We made changes, now it dropped the connection all the time.", "verified": true, "helpfulness": "0/0", "author": "David \"little dave\""}, {"rating": 5.0, "review": "Big hit over the Christmas holiday.  My son(12 yrs) has found stuff to watch or play daily.  Great reception and no problem to hook up.  We have used games, watched you tube, television programs and streamed movies.", "verified": true, "helpfulness": "0/0", "author": "S. K. Lovett \"Just Lookin'\""}, {"rating": 4.0, "review": "Didn't realize you have to power it via USB.There is no mechanism to log into ~hotel WiFi (but I sideloaded Firefox via ADB, so should be able to do it next time).Overall, it's a nice device, works as expected (other than the above).", "verified": true, "helpfulness": "0/2", "author": "Josh Gunderson"}]