[{"rating": 4.0, "review": "very good!!!", "verified": true, "helpfulness": "0/0", "author": "Juan Pablo Acotto"}, {"rating": 5.0, "review": "Got this for Christmas. Haven't had a chance to use it yet. But set up was easy and comes with a remote unlike the Chromecast I have which is really nice.", "verified": true, "helpfulness": "0/0", "author": "Cruise Diva"}, {"rating": 1.0, "review": "Doesn't work with Slingbox SOLO :(", "verified": true, "helpfulness": "0/1", "author": "Fredrick Edelkamp"}, {"rating": 5.0, "review": "Love it.  No complaints at all!!", "verified": true, "helpfulness": "0/0", "author": "Janet Dunaway"}, {"rating": 1.0, "review": "It worked great for the first month I had it but now whenever I try and watch something it constantly freezes like there is not enough bandwidth to stream the movie.  I have no problems with any other devices streaming.  I use an Apple TV, a playstation, computer, iPad, and all those things stream content beautifully and at the same time if I want.  The wireless router is in the same room as my fire tv stick.  I have tried to reset multiple times to no avail.  Glad I only paid $19 for it, went back to streaming from my playstation.", "verified": true, "helpfulness": "1/2", "author": "Adam Ready"}, {"rating": 5.0, "review": "I bought this after already owning a Chromecast. Amazon suckered me in with the prime member discount and early purchase and I am glad they did. This is very similar to Chromecast with slightly different features. I like having a normal remote with this but also use the free app on the phone for voice control. If I had a Fire Tablet, I'm sure I could have the full effect. Streaming is pretty fast with this as well. If you have been on the fence, give this a shot!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Love it.  Added the Plex app for $5 and can now view my local copies of movies, pictures, and music from my home NAS anywhere using my Firestick.  Also can view movies just using Plex with anything with a web browser.  We do Netflix, Amazon Prime videos, Amazon Music, all my local media too with the FireStick.  Very cool.", "verified": true, "helpfulness": "0/0", "author": "PEM"}, {"rating": 5.0, "review": "great deal", "verified": true, "helpfulness": "0/0", "author": "Michael M."}, {"rating": 5.0, "review": "I love it & hopefully more once I actually receive it - waiting 3 weeks now not happy about that !!!", "verified": true, "helpfulness": "0/1", "author": "Martin M. Rodriguez"}, {"rating": 1.0, "review": "It is inconsistent.  Sometimes it works and sometimes, more often, it does not work.", "verified": true, "helpfulness": "3/4", "author": "Christopher CastilloBr"}]