[{"rating": 5.0, "review": "Easy to install and operate.  Fantastic to be able to access Netflix and Amazon Prime Instant Video without having to purchase a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Dr. Barbee Myers-Oakes"}, {"rating": 5.0, "review": "so easy to install.", "verified": true, "helpfulness": "0/0", "author": "diane landry"}, {"rating": 1.0, "review": "It nickle3s and dimes you to death. I think net flex is a better deal at $8.00 a month", "verified": true, "helpfulness": "0/0", "author": "James Hudson"}, {"rating": 4.0, "review": "This was VERY easy to install  and the set up was easy as well.  My only confusion initially was that once I signed up for Netflix I assumed that Netflix would be the default but Amazon is always the default.  Each time I want to watch Netflix, I have to sign into that.  It's not a big deal, I just initially found it confusing.", "verified": true, "helpfulness": "0/0", "author": "M. Harrison"}, {"rating": 5.0, "review": "The Fire TV Stick was easy to install and fulfilled my expectations. I especially like the number of shows and movies included for Amapzon Prime members at no additional charge.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "LOVE IT! It's loaded with all kinds of apps, movies, TV shows and sooo much more!", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "Does have to be plugged in to A/C outlet with included cord. Works great, fun to play games on, and is a good alternative to a more expensive unit for a TV that gets less use.", "verified": true, "helpfulness": "0/0", "author": "Peter B"}, {"rating": 4.0, "review": "dont use this much but good product", "verified": true, "helpfulness": "0/0", "author": "Jaime E Garza Jr."}, {"rating": 5.0, "review": "Last November, I pre-ordered two of these for my daughters' rooms.  My order was pretty much the same day I had heard about them.  Although I did not know whether they'd live up to the apps on my smart TVs/Roku, I could not passed up the introductory price.  Now...  My girls have had theirs for a few months and I'm so jealous.  These things make me really annoyed at my other steaming devices.  I guess it's time to order a couple more.", "verified": true, "helpfulness": "0/0", "author": "Jim D."}, {"rating": 5.0, "review": "Nice interface and is out of the way.", "verified": true, "helpfulness": "0/0", "author": "Karen D"}]