[{"rating": 5.0, "review": "Much better than apple TV", "verified": true, "helpfulness": "0/0", "author": "Giovanna NYC"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Ashanti Sebastien"}, {"rating": 3.0, "review": "Slow to respond.Setting up took too many steps to enable basic programming.Streaming is choppyDLNA apps I downloaded are marginal in performance, as is the spotify app.The stick does not retain app configuration in the cloud (so on a second stick, I have to set up all over again)", "verified": true, "helpfulness": "0/0", "author": "AM \"photo bhoot\""}, {"rating": 4.0, "review": "Noy liking that I cant have Spotify unless it is premium.", "verified": true, "helpfulness": "0/0", "author": "elise filanowff"}, {"rating": 4.0, "review": "So far an alright device. It has issues picking up my wireless where my Roku didn't. I also wish there was a way to serf the internet (but maybe I haven't figured it out yet).", "verified": true, "helpfulness": "0/0", "author": "JcE \"Jefe\""}, {"rating": 5.0, "review": "Totally AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "Coretta Ward"}, {"rating": 1.0, "review": "I was under the impression that I'd receive TV viewing with this device ONLY.  Didn't realize it was a PORTAL to other paid services.", "verified": true, "helpfulness": "0/0", "author": "Harry O. Crittenden"}, {"rating": 5.0, "review": "Amazing it's movies are the least expensive and it makes Apple look like a joke. I would rather spend $3.99 for a new release instead of 12.+ on Apple. It has the exact same things and it's easier to use. Love love love", "verified": true, "helpfulness": "0/0", "author": "Brutally Honest"}, {"rating": 5.0, "review": "Excellent product best dongle it there", "verified": true, "helpfulness": "0/0", "author": "mary"}, {"rating": 4.0, "review": "We were trying to cut the cable/satellite cord and purchased the Amazon Fire TV Stick since we are prime members and wanted to leverage our membership as much as possible.The Fire Stick works very well, very easy to navigate around in it.  Lot's of choices for streaming apps.  We had previously purchased a Chromecast stick but it was glitchy and did not have near as many apps.  If you are prime member, the Fire TV works seamlessly with the membership for watch all of the prime content.The only complaint, not just about the Fire TV, but about all of these streaming devices (Chromecast, Roku, etc...) is that in order to access the full content on a lot of the channels, one must have a subscription to a cable/satellite provider.  The Disney channels, Lifetime, Encore and more all have you go to a web site to register and as a part of the registration process, you have to log in with your TV service provider credentials.  The whole point was to get away from cable/sat. providers.  If I had subscription to cable TV, why would I need a steaming device?  Seems silly to me but that's the way the system works, for now anyway.Overall, I am happy with the Amazon Fire TV Stick.  We use is almost every day and even without the full content on some stations, there still is quite a selection to watch.", "verified": true, "helpfulness": "0/0", "author": "Ricky R"}]