[{"rating": 5.0, "review": "This is a really good player with no issues at all so far.", "verified": true, "helpfulness": "0/0", "author": "L. Porro"}, {"rating": 5.0, "review": "The best ever!!!  I'm an \"older\" consumer who doesn't do well with highly technical innovations.  Fire TV Stick works perfectly for me, & the best part of all is that Amazon \"speaks\" (gives instructions) in a language I understand, & am not confused by!!  I love, love, love this product.", "verified": true, "helpfulness": "0/0", "author": "Georgie Mcnulty \"bosmama\""}, {"rating": 2.0, "review": "It had no DLNA capabilities.  I returned them and bought a WDTV.", "verified": true, "helpfulness": "0/0", "author": "warren brown"}, {"rating": 5.0, "review": "Looking to get another since Samsung Smart TV does not have App for this version of TV hoping for a markdown on the product to buy again", "verified": true, "helpfulness": "0/0", "author": "Jason James"}, {"rating": 1.0, "review": "I am disappointed in the Fire Stick. I can get the same movies and TV shows on my Verizon Cable Account.You have to pay for TV shows with the Fire Stick...I can see them On-Demand on Verizon for free.Not very happy with this product.", "verified": true, "helpfulness": "0/1", "author": "NICKy V"}, {"rating": 4.0, "review": "Compact and easy to install.  Work well most of the time.  Had a few glitches but overall works well.", "verified": true, "helpfulness": "0/0", "author": "Stickbuilt"}, {"rating": 5.0, "review": "Very user friendly, love it", "verified": true, "helpfulness": "0/0", "author": "linda kahm"}, {"rating": 5.0, "review": "Love it! Simple to install. Great search feature. I can input an actor or director's name and it will populate the related works that are available.", "verified": true, "helpfulness": "0/0", "author": "wickedpple42"}, {"rating": 4.0, "review": "Liked it but had trouble with remote when I first installed it -- when I went to enter my logon information for Netflix, I found the remote would move the cursor over the keyboard on the screen on its own, as if the remote directional mover was stuck at times -- very frustrating, so I let it sit a few days and then tried again and it worked fine.I like the ease of using the fire stick over the roku, and picture is crystal clear.", "verified": true, "helpfulness": "0/0", "author": "Frank A. Edgar Jr."}, {"rating": 5.0, "review": "I have them all - Roku 2 and 3, WD Live, Boxee, Smart TVs, etc., but right now I am really liking the format and presentation of the Fire TV Stick and have put those others aside.", "verified": true, "helpfulness": "0/0", "author": "J. Christy \"Sarisin\""}]