[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "melody sclippa"}, {"rating": 5.0, "review": "Love it , I'm not technology smart so i couldn't believe how easy to use and the verity it offers in entertainment, so glad my son encouraged me to get it", "verified": true, "helpfulness": "0/0", "author": "Corinne fedornak"}, {"rating": 4.0, "review": "The hdmi extender did not work but everything else works great I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and easy to use.  Within 15 minutes of opening the box I was watching Amazon Prime and Hulu Plus movies on my TB.", "verified": true, "helpfulness": "0/0", "author": "cynthia behne"}, {"rating": 5.0, "review": "This works really well. I can't be more pleased. I currently have a really slow internet connection (1.2mb) and there is almost no buffering. The remote works great as well.", "verified": true, "helpfulness": "1/1", "author": "Amazonian Trekker"}, {"rating": 5.0, "review": "had to get another fire stick since I needed one down stairs", "verified": true, "helpfulness": "0/0", "author": "Jon Martienz"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Jonann M. Hall \"sikkugirl\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "This is an amazing product.  I wish i bought it sooner, at launch.  I bought it for my bed room as for some reason my game systems dont get great wireless signal, but my cell, laptop, etc get it great.  And i wanted to be able to lay down and watch hulu, or Amazon prime, or hbo while lying in bed at night.  I got this on the Prime Day deals day.  It gets great wireless signal, set up was a breeze, was able to connect to hulu, amazon prime, hbo go, and flixter.  Didnt have any issues navigating, or streaming.  This is a great product, I am an amazon fan, owning echo, fire stick, having prime.  This just makes everything better.Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey J. Smith"}, {"rating": 3.0, "review": "have to reboot often, but works okay.", "verified": true, "helpfulness": "0/0", "author": "mom at home \"mom at home\""}]