[{"rating": 5.0, "review": "so easy to use", "verified": true, "helpfulness": "0/0", "author": "Bassman"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "joe c morings"}, {"rating": 2.0, "review": "Now that we have it working ---- we love it.  we have been using the WII to access Netflix and it is extremely cumbersome. So I thought this would help my disabled daughter to access Prime and Netflix easier.  Well, It is wonderful.  But I would have given it 5 starts if it hooked up easier.. Since it says to connect it to you USB port for power and HDMI for access, I did just that.  then spent the next 3 hours going over my gateway, ip  dns etc ...connections trying to get it online.  Finally I gave up and called the \"call me back\" number and withing 10 minutes I was up and running.My advice to anyone having an issue connecting to their gateway to plug it into the WALL not the USB port and make sure your HDMIconnection is good. Switch to a different one  around if it wont work.All that being said it is amazing how easy it is to navigate around the options.  We love it ... I think I get a couple more for the other TV.s although you can just move it with you if you want.maybe i\"ll give it 4 1/2 stars LOLSorry I have to update this.  We can no longer use the Fire Stick.After I got it working it was wonderful......  for a time.  Then we started getting streaming issues.  2 or 3 times a movie.  Then it became impossible to watch for more than 3 minutes at a time. We would have to wait until it buffed more and then another 2 or three minutes of movie.  We have our WII hooked up to the same TV and netflix works perfect if we use that but we didnt like the control remote.  I was going to buy one for my bedroom because it seemed so good.  Im glad i didn't -  Anyone know if the $99.00 works any better????I have called Amazon's teck support and they tried to help.  He gave me at least 3 options to try to correct the problem but none of the resolved the issue.  I want to return the unit and either get a new one -- since it could be the units problem or get my money back.I'm so dissappointed.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am very happy with it an it is saving me money which is always nice these days.", "verified": true, "helpfulness": "0/0", "author": "Leslie Cheryl Herzog"}, {"rating": 1.0, "review": "hmmm proves to be useless. I saw the stick and thought usb - its not - its hdmi useless for my laptop", "verified": true, "helpfulness": "0/1", "author": "Terry L. Johnson"}, {"rating": 5.0, "review": "I can't believe that I was paying for cable for so long.  Now I can choose the shows I want to watch without having to pay for channels I never watch. And super easy to install.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Loran Breazeal"}, {"rating": 5.0, "review": "I really like it. I have watched a lot of Prime movies.But there are other things to.", "verified": true, "helpfulness": "0/0", "author": "Colleen Clark"}, {"rating": 5.0, "review": "I absolutely love this ! It's easy to install and use. I primarily use it for Netflix and haven't really explored the rest of the available functions yet. Inexpensive way to access many internet related functions.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 4.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "Kyle Friar"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "James Brooks"}]