[{"rating": 5.0, "review": "Easy installation and works perfect!! Worth every penny! Love Love Love!", "verified": true, "helpfulness": "0/0", "author": "Crystal Mansell"}, {"rating": 5.0, "review": "Absolutely love my fire stick... Got tired of paying a big satellite bill when we only watched a few shows on TV. The fire stick allows to watch what we want, when we want... Definitely worth the buy.", "verified": true, "helpfulness": "0/0", "author": "mz121581"}, {"rating": 2.0, "review": "Many options but cost.", "verified": true, "helpfulness": "0/0", "author": "Jorge Marta"}, {"rating": 4.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "william cook"}, {"rating": 5.0, "review": "I simply love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "GLMCKSR-NEW JERSEY"}, {"rating": 4.0, "review": "I prefer the Fire Stick over Chromecast (I have both). I find the remote control makes it much easier to use for both Netflix, Amazon Prime Video, and music. It would be perfect if it also had a the ability to stream from a browser the way Chromecast does. One annoying flaw is that when I use a USB port on my Samsung TV to power it, the TV wants to switch from the cable HDMI port to the Fire Stick HDMI port every time I turn on the TV.  This doesn't happen when I power it using the AC adapter. It may be a quirk of the TV, but I never had the same problem using USB power with the Chromecast stick. BTW, the first one Amazon shipped me had a malfunctioning remote. But they quickly replaced it for me. Great service.", "verified": true, "helpfulness": "0/0", "author": "John Lai"}, {"rating": 5.0, "review": "great price connects to my tv easy go thru all setup promps works great", "verified": true, "helpfulness": "0/0", "author": "gerald lozano"}, {"rating": 5.0, "review": "Very easy to install. I have Prime. My account came installed with the Fire stick. I wish I had bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Rumsey"}, {"rating": 4.0, "review": "I've used the fire stick this for several months and I must say I prefer it over Google Chromecast (which I also have) for the most part because I'm a Prime member. But I also prefer having a dedicated remote vs. using my phone of iPAd to control it. The one flaw is that when it's powered through a USB port on my Samsung TV, the TV sees it as primary and switches from TV to the Fire Stick HDMI port automatically. I then have to switch it back to TV. This isn't the case when I use the separate power adapter. I suspect that it's a quirk in my TV rather than the fire stick. I wish it would handle You Tube like the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "John Lai"}, {"rating": 2.0, "review": "Since I have received this product it always freeze up when streaming a video. I have unplugged it and restarted several times, but periodically it always happen.", "verified": true, "helpfulness": "0/0", "author": "junior griffiths"}]