[{"rating": 5.0, "review": "works perfectly", "verified": true, "helpfulness": "0/0", "author": "mary anne"}, {"rating": 5.0, "review": "No Problems. works fine", "verified": true, "helpfulness": "0/0", "author": "Tom Swalls"}, {"rating": 5.0, "review": "Can't beat it for the money. I sold my Roku's because I liked the interface better.", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 5.0, "review": "Awesome streaming stick, I like the clean UI. I love that it allows you to connect using a hotel wifi by Giving you a Web page to accept terms and conditions. One big benefit over a roku. So far has all the streaming apps moat people need. Roku has a wider assortment of apps.", "verified": true, "helpfulness": "0/0", "author": "Sydonia B. Blake"}, {"rating": 5.0, "review": "Love it. Turn my HD TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Pam Dendy \"p-flirt\""}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Jo"}, {"rating": 5.0, "review": "Easy to configure, worked very simply. Only issue I thought was the how-to video that shows you how to connect, plays AFTER you get it all set up. the rest of the video was very informative", "verified": true, "helpfulness": "0/0", "author": "Ironmike68 \"Ironmike68\""}, {"rating": 5.0, "review": "I found this to work very well on an older TV that is not a Smart TV.  I am able to get many things including Netflix, Hulu, and Amazon Prime.  Plus many other programs and games.", "verified": true, "helpfulness": "0/0", "author": "Jerry D. Hapner"}, {"rating": 4.0, "review": "The fire stick is nice, especially for the price.  There is a lot you can view with the prime membership but I have found so much of what I want to view comes at an additional cost.  Was hoping to get rid of direct tv and just use this to save $$ each month, but I don't think that will be an option without subscribing to a few things on here and not sure that will end up saving me any money in the end.  It is really convenient for the kids though!  They love it!  Still come across a lot of things they want to watch that aren't free, but we just move them along until they find something that comes with Prime.", "verified": true, "helpfulness": "0/0", "author": "Katherine Brown"}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "deb55"}]