[{"rating": 4.0, "review": "One of my favorite purchases from AMazon!", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 5.0, "review": "Awesome, it's everything Amazon said it would be", "verified": true, "helpfulness": "0/0", "author": "Victory77"}, {"rating": 5.0, "review": "got it strictly for installing an app and i love it!", "verified": false, "helpfulness": "0/0", "author": "Michael Davidson"}, {"rating": 3.0, "review": "I give the FireStick 3 stars because it will NOT get VUDU and I have a lot of movies on that App, Very disappointed in the stick, would not tell and one else to buy one to buy one  them.", "verified": true, "helpfulness": "0/1", "author": "S. Marble \"Charlie\""}, {"rating": 5.0, "review": "Love it.  I received a free tv, but do not have cable in the bedroom or have room for a dvd player, plugged it in and now, I can enjoy movies from my bed.  Easy setup, and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Mimi B Han"}, {"rating": 5.0, "review": "The fire stick is great! Very easy to set up and use. Only problem now is that Amazon and Netflix do not stream some of the series we had started to watch on dvd, so we have to keep our dvd service till we finish some of those series.", "verified": true, "helpfulness": "0/0", "author": "Itzdanna"}, {"rating": 4.0, "review": "Gift to my brother. He loves it! No reason to power on his ps3 unnecessarily anymore just for shows and movies.", "verified": true, "helpfulness": "0/0", "author": "DMA"}, {"rating": 4.0, "review": "A little hard to navigate at first, needs better instructions to get to movies. Didn't realize I needed to download thru netflix once I had paid for the service, should have been clearly stated or just shown on the Netflix app.", "verified": true, "helpfulness": "0/0", "author": "Anna May Barrera"}, {"rating": 5.0, "review": "Works as advertised - I love it (especially love side-loading apps into it).", "verified": true, "helpfulness": "0/0", "author": "Shiv.-"}, {"rating": 5.0, "review": "Why do I love my Amazon Fire TV Stick? Because I got it for $20 and I was able to install Kodi (XBMC). I don't even use the device for any Amazon Prime related movies or channels. I have streamed and paid for some movies on Prime, but that's about it. Majority of my usage is on Kodi. ;-)", "verified": true, "helpfulness": "0/0", "author": "MarkUS"}]