[{"rating": 5.0, "review": "I can stream all my downloaded movies from my phone regardless of the format to my TVway better than a Roku", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was unsure how much I would use because I can use my BluRay player for streaming Prime and Netflix, but the Fire Stick is SOOO much faster and easier!  I loved that you could get some games.  We had a fun family game night playing Game of Life.", "verified": true, "helpfulness": "0/0", "author": "Dscrbn"}, {"rating": 5.0, "review": "Wow.  This is so worth the price. It was ridiculously easy to set up and add in my account information for Hulu and Netflix.  My Amazon information was preloaded.  Rather than having to use those programs on my tablet, I can now very easily watch on my main TV.  I highly recommend this product.  I have had no issues with streaming either (I have Verizon Fios).", "verified": true, "helpfulness": "1/1", "author": "AmazonFan"}, {"rating": 5.0, "review": "HAVING OWNED AND USED THE ROKU STICK I FIND THIS TO BE A MUCH BETTER UNIT. IT IS FASTER, THE QUALITY OF THE PICTURE IS UNBELIEVABLY SHARPER, AND THE REMOTE WORKS EVERY TIME (NONE OF WHICH WAS TRUE OF MY ROKU WHICH COST ME TWICE AS MUCH FROM ANOTHER ONLINE PROVIDER).", "verified": true, "helpfulness": "0/1", "author": "SILVERTURTLE"}, {"rating": 3.0, "review": "Mixed bag here.  Easy to install- simply plug-in, enter WiFi access code and play. Has intuitive remote and simple menu - make sure to use the supplemental power transformer.  Device works AWESOME for some applications (Prime Video, etc) with no streaming issues and easy access to video content.  HOWEVER, major downside in that you CANNOT access single channels that might otherwise require a subscription through a cable or internet TV service.  In my case I wanted to only access ESPN but as I do not subscribe to a TV provider (I access free over-the-air TV) I cannot watch ESPN, not even with the Firestick device. Amazon has no way to purchase access nor do they have ready arrangements with many ISP providers.  The representative for Frontier FIOS ISP knew nothing at all about how one might gain access and that there was no agreement in place with Amazon.  FURTHERMORE, when I went to a friend's house (who also has a firestick) that does subscribe to a TV provider and has ESPN access, the feed is constantly lost and requires re-initializing the connection.  Extremely frustrating as it invariable happens at critical moments.  Other reviewers have mentioned this and often give 1-star.  The device does have some merit but I am disappointed and feel misled about what it does and how it works and the lack of support from Amazon.  I will continue to use with Prime Video but would not repurchase given it's failures.", "verified": true, "helpfulness": "2/2", "author": "alljazz'dup"}, {"rating": 5.0, "review": "Already having Chromecast, I was assuming this would be the same.  After hooking it up I really like it, even more than Chrome.  The remote is very good and the movies load faster than my PS4 or Home Theatre App.", "verified": true, "helpfulness": "0/1", "author": "keith"}, {"rating": 5.0, "review": "Works great nice selection of shows and movies", "verified": true, "helpfulness": "0/1", "author": "Albert E Bressler"}, {"rating": 5.0, "review": "Amazing!  I still have a lot to learn, but so easy to get started!  I've ordered a second one!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got this up up-an-running in just a few minutes and love it! It's a great product for anyone with Amazon Prime! Highly recommended!", "verified": true, "helpfulness": "0/1", "author": "Anubie"}, {"rating": 4.0, "review": "very good.", "verified": true, "helpfulness": "1/1", "author": "James J Autry"}]