[{"rating": 5.0, "review": "Everything we want the fire stick has it, love it. Thanks", "verified": true, "helpfulness": "0/0", "author": "Cellphone challenged"}, {"rating": 5.0, "review": "Bueno.", "verified": true, "helpfulness": "0/0", "author": "Andrew H."}, {"rating": 1.0, "review": "Stopped working a few days before warranty ended. Sent in a replacement request before warranty ended. Nobody got back to so I went back to see the status of my request and was informed warranty expired. Have three if these in my house. Won't be buying another Amazon product again.", "verified": true, "helpfulness": "0/0", "author": "Ron LaFountain"}, {"rating": 5.0, "review": "Yep it works", "verified": true, "helpfulness": "0/0", "author": "Phil W."}, {"rating": 5.0, "review": "Question about Fire TV Stick.  I am  very interested in purchasing one of these.  I just purchased a Sony smart Blu-ray player.  YouTube is limited and I can only see to play my first 12 playlists.  The remainder of my playlists are history.  Sony told me that the player is not limited but YouTube was not very helpful with my question.  Can anyone who has purchased this Fire TV Stick - is there any problem seeing your playlists in YouTube? Like more than 12 playlists?  I spent a lot of time putting these playlists in YouTube for my disabled husband who watches it almost 24/7 along with Amazon.  I hope I can happily purchase the Fire TV Stick to solve this problem.  Thank you in advance for any answer ...........", "verified": false, "helpfulness": "0/0", "author": "Nancy Gonzales"}, {"rating": 4.0, "review": "Better than I expected", "verified": true, "helpfulness": "0/0", "author": "ricka perez"}, {"rating": 5.0, "review": "as advertised!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"dcm\""}, {"rating": 2.0, "review": "I'm a huge Amazon.com fan. HUGE. The Fire TV Stick, however, is a disappointment. I do like the layout and ease of use, but I'm not happy with the overall function. The main apps I use are Amazon Instant Video and Netflix and occasionally You Tube and some of the games. The Amazon app works just fine, but the Netflix app has major issues. It constantly buffers, gives playback errors, and just doesn't stream smoothly. When I first got it, it didn't support HBO Go, but it does now. But, it does not support StarzPlay, which for me is a big deal, being a huge Outlander fan (plus the fact Starz has great movies). I've looked online and it appears that I am not the only one that has these issues with this device, so it irritates me that Amazon hasn't addressed it and created a fix for it. I think I'm going to put the Amazon stick away and bring my Roku back downstairs. I have zero streaming problems with that device (except that it also doesn't have StarzPlay).Updated: StarzPlay and EncorePlay are now available on this! Hooray! The streaming quality still sucks, though. I even moved it to my bedroom, which is much closer to our wireless router, and it still buffers and hiccups and annoys the crap out of me. The Roku is still the better streaming device, in my opinion, and my Roku is a previously-owned, older model. It's earned its way back into my living room and will stay there until it dies.", "verified": true, "helpfulness": "1/1", "author": "J. Weston \"(Mom)\""}, {"rating": 5.0, "review": "Easy to install. Excellent speed and memory makes HD movie viewing from Netflix or Amazon a delight.Has almost all apps I would want.If unplugged for extended periods, retains passwords and starts seamlessly!Can't see why I would buy a pricier device from Apple etc. Bought a 2nd stick.", "verified": true, "helpfulness": "0/0", "author": "urmila R"}, {"rating": 5.0, "review": "So far, so good.", "verified": true, "helpfulness": "0/0", "author": "mathmack"}]