[{"rating": 5.0, "review": "I have had the firestick for about 1 week now.  I purchased more of curiousity due its low price, but I found that is a highly functional gadget.  I have Google TV, Apple TV, Chromecast, and multiple Rokus. In my opinion this is better than the comparably priced Chromecast as it comes with a full function remote and doesn't rely on my phone.Pros:- Supports HBO, Showtime, Plex, Netflix, Pandora, Amazon among others.- There is an app for real time streaming of CBS News -- nice for TV where I don't have cable- User interface is clean - tends to favor Amazon (but that would be expected)- Very Small - can't even be seen sticking out of side HDMI port on TV- Support for Amazon Music LibraryCons:-  A bit to Amazon heavy -- doesn't bother me, but many of the options (Movies, TV, Prime Video) are all Amazon-  Would be nice if I could stream from an iTunes server without having to upload to Amazon Music Library", "verified": true, "helpfulness": "0/0", "author": "PrimeAddict"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Louis Baarlaer \"No3Putts\""}, {"rating": 5.0, "review": "Easy to install and perfect to use.", "verified": true, "helpfulness": "0/0", "author": "Martha J. Tigges \"MARTHA\""}, {"rating": 3.0, "review": "An amazing device BUT device mirroring not working for Galaxy S5 and it would be far better with XBMC/Kodi installed.After some effort I was able to get Kodi installed and working.  It works amazingly well.I was even able to get it to show up on the menu.  The amount of effort to get that working was more than normal folks could deal with I am afraid.  That said once working it's fantastic.The sad part was I could not get my S5 mirror to work.  There are others just like me so I am not alone.  Wonder if amazon will fix that?So 2 stars short of 5.  1 for lack of Kodi one for display mirror not working.", "verified": true, "helpfulness": "0/0", "author": "Robert from Chicago"}, {"rating": 3.0, "review": "I bought the Fire Stick TV on pre-order when it was $20 for Amazon Prime members and all I can really say is it's okay. This is coming from a guy who already owns a Chromecast and Apple TV streaming device so take from this what you will.Pros:- Easy to setup. You order it and it's already registered to you so it's basically plug and play.- Very nice interface.- Has most the apps you would expect except HBOgo which I guess is coming Spring 2015.Cons:- Even if you're an Amazon Prime member there are so few Prime ready movies out there that this isn't worth it on that note alone so you're really looking at it for other apps which then puts it in the same market as the other streaming devices.- Almost all the games require the sold separately game controller so you won't be able to play them.- The included remote is alright but it's very similar to the Apple TV remote where you have to use the click wheel to navigate an on screen keyboard to type letters when you want to enter a password, email address or search term. Alternatively, you can buy a remote with voice search or download an app that allows you to voice search.- It feels like another separate device you have to turn to in order to watch your movies.I don't use my Apple TV anymore and that's really the closest thing I can compare this to. I don't use this anymore either. I have an Android phone and use Chrome on my computer so with my Chromecast device I just select the movie I want to watch on either device and can \"cast\" it to my TV and back again. It's much simpler and faster.With the Fire TV and the Apple Tv I feel like they are separate devices that I have to turn to in order to watch what I want to watch. It's always on but It feels less intuitive and like a slower process.As a whole, the device works great and is quick, but in my situation it just feels a bit outdated next to my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "John K"}, {"rating": 4.0, "review": "I bought the Fire TV Stick primarily as a PLEX client. Its decent but its not without issues. If the quality is set to higher than 720p then I get stuttering during video playback. My wifi environment is very dense, but there is no competition on the 5ghz band.", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 2.0, "review": "jury is still out but it is not looking good", "verified": true, "helpfulness": "0/2", "author": "Cruz Santellan"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Walter E. Stone Jr. \"Butcher\""}, {"rating": 4.0, "review": "Very happy with this purchase. I bought it during the two-day $19 sale for Prime members and it was a great impulse purchase. I purchased this to use in the bedroom where I do not have cable or internet hooked up and a non-Smart TV. It does exactly as it claims by quickly and easily bringing any pay service you have onto your TV. If you already have a Smart TV this product would be useless, but for those of us that don't, this is the perfect, un-intrusive alternative, where you don't have to add (and house) another box to get the same features. Which actually brings me to a question for whoever would like to answer it - what is the difference between this and Fire TV?? As far as I can tell, you get the same features while not having to have another box sitting on a shelf. Anyway...The only \"minus\" I would give this, and why I gave it four stars instead of five, is that regular Hulu isn't included; only Hulu Plus; which means 100% of the visual content you can get on this device is pay-service: Prime, Netflix, etc. I have subscriptions to both of those, I don't want to have to buy yet another one to Hulu when there is free Hulu available to compliment what I'm already paying for elsewhere. Hulu can make money off me via their commercials.", "verified": true, "helpfulness": "0/0", "author": "Chauna Black \"daffy25us\""}, {"rating": 5.0, "review": "Everything is great.", "verified": true, "helpfulness": "0/0", "author": "Kiho Kim"}]