[{"rating": 4.0, "review": "There are some really comprehensive reviews of this device. I'm not going there.I've had this about 3 weeks and am relatively happy with it. I paid $19.00 for the Fire Stick and it works great. Good content, easy setup...it's all good.Just one minor caveat; It has the slingbox app but it doesn't work with the Slingbox Solo. Roku does. I work in one city and mostly live in another so I want to catch the home team games while out of town. Other than that I can't complain. I wanted to rate it a 4.75.", "verified": true, "helpfulness": "0/0", "author": "Rex RFN"}, {"rating": 5.0, "review": "Came in with my account information already install, so it was just plug and play, the only thing I had to do was log into the router.  With the Prime membership it is commercial free tv from now on.", "verified": true, "helpfulness": "1/1", "author": "Walter W Wehr III"}, {"rating": 5.0, "review": "simply amazing", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "I had some issues with my network. It would drop it some times if my network got slow or I had several things downloading at the same time.  A few times I had to unplug it to reset it for it to work again.But when it works it's great, for the price, it is well worth it I think.", "verified": true, "helpfulness": "1/1", "author": "Diosmaya"}, {"rating": 5.0, "review": "This was bought on a presale for 1/2 price- only $19- works perfectly.", "verified": true, "helpfulness": "0/0", "author": "David \"davidwerble\""}, {"rating": 2.0, "review": "Purchased the Fire Stick to replace a Roku unit. Was impressed with the ease of setup and the typical Amazon packaging. The problem is it will not stay connected to my wifi. The wireless router is within 5 feet of the Fire Stick, the fire Stick is plugged into a wall outlet as directed. All of my computer, tablets, smartphones have no problem staying connected and the latest test shows that my wireless network in running at 30mps with no issue. Very Very disappointed that this unit does not appear to be functioning properly, the constants cut out and slow or no internet connection message are troublesome to say the least. a patch or work young would be appreciated.", "verified": true, "helpfulness": "2/2", "author": "SEAFARIN"}, {"rating": 3.0, "review": "Love the speed and quality of this product but wished they would have advertised it truthfully. On commercials and ads, it shows that nothing else is connected to it for power, just plug it in and it works. That is not the case though, you have to attach the usb wire to an adapter to a outlet.", "verified": true, "helpfulness": "0/0", "author": "AlienMusic"}, {"rating": 5.0, "review": "Great steaming device. Everything works fine. The only complain i haveis that the power cord can be a little short depending where your using it. overall satisfy with it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great gadget!!", "verified": true, "helpfulness": "0/0", "author": "marie"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Mr. Allen Zucker"}]