[{"rating": 2.0, "review": "Terrible connection capabilities. Can stream Netflix fine from my computer, but when I try and stream from the Fire TV Stick, it constantly has to load though out the show. Pretty disappointing. Also there is some quality loss due to the bad connectivity of the wireless device inside the stick.", "verified": true, "helpfulness": "0/0", "author": "Cameron M Gibson"}, {"rating": 4.0, "review": "Great product other than the remote goes crazy sometimes", "verified": true, "helpfulness": "0/0", "author": "Cody Latimer"}, {"rating": 5.0, "review": "Love it. Simple to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "R. T. Godin"}, {"rating": 5.0, "review": "Fantastic, easy setup. Watching TV shows, commercial free. The music and picture storage plus Prime free shipping, great package.", "verified": true, "helpfulness": "0/0", "author": "Paul White"}, {"rating": 5.0, "review": "It's great to be able to watch my prime movies, TV episodes, etc. on my TV screen. One of the best purchases I have made.", "verified": true, "helpfulness": "0/0", "author": "Janice  Zambrano"}, {"rating": 5.0, "review": "I loved the fire stick from the moment I took it out of the box. It could not possibly have been any easier to install or use. I absolutely love the program selection as well as the searchability. I purchased a Roku for my father in law and set it up for him and this was far easier. Don't get me wrong, I liked the Roku, but I'm more impressed with the Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "Kasie DeLap"}, {"rating": 5.0, "review": "Great piece of tech, and one of the first plug and play items that actually worked as advertised.  Very much looking forward to binge-watching Bosch, and Longmire and whatever the next big thing that comes along might be.", "verified": true, "helpfulness": "0/0", "author": "Vintage Valley Girl"}, {"rating": 5.0, "review": "love it..easy to set up and very easy to use with remote!", "verified": true, "helpfulness": "0/0", "author": "kathy"}, {"rating": 5.0, "review": "yes, it works great.", "verified": true, "helpfulness": "0/0", "author": "Kmore"}, {"rating": 5.0, "review": "Works great for our family! Kids love using this to access you tube to play all of there favorite TV shows.", "verified": true, "helpfulness": "0/0", "author": "Earnest Epps"}]