[{"rating": 3.0, "review": "Needs facebook app!", "verified": true, "helpfulness": "0/0", "author": "salvador Garcia"}, {"rating": 5.0, "review": "awesome device for making a smart TV even smarter.", "verified": true, "helpfulness": "0/0", "author": "lsu tiger"}, {"rating": 5.0, "review": "This is very cool. It works better than I thought. We cut DISH and I wished we would have earlier.", "verified": true, "helpfulness": "0/0", "author": "James McGown \"James McGown\""}, {"rating": 5.0, "review": "LOVE IT!!!! It's a million times better than Chromecast!!!", "verified": true, "helpfulness": "0/0", "author": "Cathy S. \"CathyS\""}, {"rating": 3.0, "review": "Haven't given it much time yet.", "verified": true, "helpfulness": "0/0", "author": "Thomas Mandeville"}, {"rating": 1.0, "review": "Only wants to find Amazon, stores nothing else, difficult to navigate, takes a LONG time to move from screen to screen and search and research for anything off Amazon, wow we are surprised but here is our experience with the Fire Stick, hold this page and stare at this for 125 seconds before you move on to the next sentence :::::buffering:::::::", "verified": true, "helpfulness": "0/0", "author": "michelle r thomas"}, {"rating": 5.0, "review": "Meets and exceeds. I have the two Fire TV Sticks, before I tried it out I had a bought a Roku. Hands-down I will always prefer the Fire TV Stick.I'm a gadget junkie and this is right at the top of my list.", "verified": true, "helpfulness": "0/0", "author": "W. Jones \"TheWizard\""}, {"rating": 1.0, "review": "I was very disappointed with the Fire Stick. I purchased a chromecast the se week as the Fire stick. I believed the Fire stick was better quality but I was most certainly wrong about that! The Fire stick would barely work! It would rarely connect to the wifi and if by some miracle it connected it would not stay connected. All of my other tablets and devices were connected to the wifi including the chromecast that worked each and every time I used it! the Fire Stick is just not a good product. It just simply does not work.", "verified": true, "helpfulness": "0/0", "author": "Georgja Carter"}, {"rating": 4.0, "review": "It does everything it's says its supposed to do. Wish it had the voice activation like the firebox.", "verified": true, "helpfulness": "0/0", "author": "Who summit lover"}, {"rating": 2.0, "review": "spotty wifi connection. Have not tested it on a tv closer to my router to see if that improves connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]