[{"rating": 4.0, "review": "Works good.  Sucks that you have to register a credit card just to use free stuff.", "verified": true, "helpfulness": "0/0", "author": "Matthew Summers"}, {"rating": 3.0, "review": "I was so excited when I ordered this 6 months ago. I bought this for my bedroom, as I have Apple TV in the living room. Pro: I'm able to use the Amazon Prime app.Cons: The layout of the main menu is not as organized as Apple, and it's hard to browse movies/shows in all the apps. It lags a bit too but ultimately it was good enough and it did it's job, but then I somehow misplaced the remote!!! So I downloaded the remote app and it takes 10 minutes for the app to locate my Fire Stick. I was going to buy another remote for it but that costs $15, so I decided to buy another Apple TV for the bedroom, and the Fire Stick will go in the guest room.Now that Apple TV is priced at $69 it's worth the extra $30 over the Fire Stick at $40. I think the stick needs to be priced lower, no more than $25.", "verified": true, "helpfulness": "1/1", "author": "C. Moore"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "William M Stanley"}, {"rating": 5.0, "review": "This is the Best Purchase that I have ever made I wish that I had gotten it sooner...", "verified": true, "helpfulness": "0/0", "author": "Eugene Johnson"}, {"rating": 5.0, "review": "The Fire Stick is a great way to get the show that you love.", "verified": true, "helpfulness": "0/0", "author": "Adrienne Moon"}, {"rating": 1.0, "review": "Could not use and had to send it back.  We have a 7 yr. old TV with a 2.0 USB receptacle. The Fire Stick comes with a 3.0 USB plug. They are nor compatible. There is no work around", "verified": true, "helpfulness": "1/2", "author": "Marilyn M."}, {"rating": 1.0, "review": "Not impressed at all slow streaming have a roku and my opinion. Is it is much better. My fire stick freezes up all the time and restarts in the middle of a show. Have never had this problem with any other media streaming. Device. Over all poor investment. Would have sent it back if i had not bashed it into very small fragments. Due to being frustrated", "verified": true, "helpfulness": "0/0", "author": "nigel jackson"}, {"rating": 5.0, "review": "loving it so far", "verified": true, "helpfulness": "0/0", "author": "Jessica Golding"}, {"rating": 2.0, "review": "Does not state I will have to rent or buy movies ....", "verified": true, "helpfulness": "0/0", "author": "rmuse"}, {"rating": 1.0, "review": "The Set up part was easy! Although it does not let me watch anything!! Says I have no Internet Connection, when I go back to check it says I have very good signal. Dislike! !", "verified": true, "helpfulness": "0/0", "author": "Jannet C."}]