[{"rating": 5.0, "review": "This thing is awesome! I bought it for my daughter's room so she could watch cartoons, but it never made it past my room. I was setting it up and it was super easy. The instructions were very simple and I also had an on screen guide. It is very easy to use and I have all the video and tv apps I use right at my fingertips. I watch this all the time instead of satellite tv. if it weren't for my husband (and football), I would cancel my satellite subscription. I am extremely happy with this purchase and plan on buying another one.", "verified": true, "helpfulness": "0/0", "author": "Amanda A"}, {"rating": 5.0, "review": "Love my Amazon Fire TV Stick! Great way to find something decent to watch when nothing is on!", "verified": true, "helpfulness": "0/0", "author": "Desie Custer"}, {"rating": 5.0, "review": "I have to change/update my review because in a very gentle way, I was guided via chat on how to make the device work in every tv set in my household.  It would work properly in two different TVs, but fail in an LG, then the guy from TS showed me how to make the Fire TV Stick search for a correct configuration and all problems ceased.  I love Fire TV Stick, I love the resolution vs my smart tv`s own capabilities, now I have a new addiction!!!Incredibly, my fireTv stick arrived, I have been waiting sometime since I live outside the USA.  And when I plug it to any TV, any HDMI port I get a grainy screen that when not flashing white shown the fireTV stock logo and some instructions.  I have tried it in several TVs and same problem.  I hate to wait for days for an electronic and then have this kind of problems.  Now, sending it back will be a pain since I am not in the states and shipping it will cost more that actually buying a new one.  I hope I could load images so everyone could see what I am seeing right now.", "verified": true, "helpfulness": "0/0", "author": "Jaime R. Ortiz Ch"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is PHENOMENAL!!!! This little gadget turns boring night into adventures :D It pretty much makes your T.V and smartTV!! Even if you do not have Prime (why?) you can watch Netflix, HBO Now, Hulu and etc or play the games(omg they have Tetris freeee), or listen to music. Set up is so simple and fast and you will be watching movies in no time!!  The remote is easy to use and not confusing at all and small and easy to store (but you won't because you will be using it all the time ;)I have so much stuff to do!!! Oh well lol.", "verified": true, "helpfulness": "0/0", "author": "Tammie"}, {"rating": 2.0, "review": "The stick meets my streaming needs, but it requires several reboots during the day (I just watch Netflix/YouTube). The directional \"disc\" is also warped to the right a bit, meaning it gets stuck easily and scrolls rapidly to the right while making a selection which is very annoying.", "verified": true, "helpfulness": "0/0", "author": "S. Hope"}, {"rating": 3.0, "review": "I was using the Chromecast Streaming Stick before I decided to try this one. I have Amazon Prime and wanted to take advantage of Prime Instant Video. I prefer the Chromecast Streaming Stick over the Amazon Fire Stick though. I seem to have a slower connection with the Fire Stick and get logged off more often. Also, I am able to use more apps with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Love it. So easy to set up.", "verified": true, "helpfulness": "0/0", "author": "tawni donovan"}, {"rating": 5.0, "review": "Our whole family love the Amazon Fire stick. should I say its on Fire with our famile. Welove it. has shows, Apps,and games for all ages. THank you for making an awesome product.", "verified": true, "helpfulness": "0/0", "author": "June  Giuliano"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV Stick for my mother. It along with its user interface is very simple and straight forward to use.", "verified": true, "helpfulness": "0/0", "author": "CupCakeMartian"}, {"rating": 5.0, "review": "Perfect solution for our non smart TV!  Even with the dongle hidden behind the TV set it still is able to receive the signal from the transmitter!  I'm impressed.  We are Prime customers so this was a no-branier for our family.", "verified": true, "helpfulness": "0/0", "author": "Craig A"}]