[{"rating": 5.0, "review": "It's been a joy.  I've streamed certain apps through a blu-ray player and another gaming console but never experienced the performance I got with the Amazon Fire TV stick.  It's been amazing.  Can't wait to learn more of the things it's capable of!", "verified": true, "helpfulness": "0/0", "author": "J. Adkinson"}, {"rating": 1.0, "review": "My family uses 2 Kindle Fires, 1 Kindle Reader, and 1 Amazon Fire TV. Also 2 Roku devices. All 6 devices use the WiFi signal from my Comcast Modem/ Router with no problems. Neither of the 2 Sticks that I received could  access \"Amazon.com\" which was required during the installation. My problem was turned over to the Tech division who worked 2 weeks promising that they would call me on 12/13 with an update. No call so I returned the Sticks for a full refund.", "verified": true, "helpfulness": "2/3", "author": "Bill Meckel"}, {"rating": 5.0, "review": "nice idea", "verified": true, "helpfulness": "0/0", "author": "John W. Smith"}, {"rating": 3.0, "review": "Its ok, navigating through all the artists can be quite challenging.", "verified": true, "helpfulness": "0/0", "author": "Samuel Petit-homme"}, {"rating": 5.0, "review": "Love it. Has so many apps and is so convenient", "verified": true, "helpfulness": "0/0", "author": "jessica gomez"}, {"rating": 4.0, "review": "It's good to watch Netflix and to play some games, however I don't feel like paying to watch movies or tv episodes.", "verified": true, "helpfulness": "0/0", "author": "bear"}, {"rating": 5.0, "review": "Easy to use and great, quick reception", "verified": true, "helpfulness": "0/0", "author": "J Myers"}, {"rating": 5.0, "review": "My wife and I have really enjoyed our Fire Stick.  We use it with our Sony 47\" in the bedroom, which is a Smart TV, but this is simply more convenient and brings the Google TV integration into our bedroom.  Love being able to swipe from our phone just about any media we want, and then access additional Apps that aren't on the TV.  It does come with a power USB cord that can be used to power the stick from the TV, rather than the wall.  That said, it does take time to boot up as it's only powered when the TV is on.  We have the Asus Cube in the living room which is also fantastic, and I've used the Chromecsast.  The thing that I like about the cube is that it has a mouse pointer option and a Qwerty keyboard on the back of the controller.  The thing I like about the Fire Stick is that it is very Amazon friendly and the user interface is similar to that of Netflix.  Other than that, they are all quite similar and you can't go wrong with any of them.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Yokus"}, {"rating": 5.0, "review": "Great job on this Amazon really efficient but only problem is the remote control is to small. A little bigger will be nice.but overall AMAZING job", "verified": true, "helpfulness": "0/0", "author": "Delvin"}, {"rating": 3.0, "review": "This product is ok but the picture skips a lot", "verified": true, "helpfulness": "0/0", "author": "Suzanne B."}]