[{"rating": 2.0, "review": "really not as useful as a smart TV we don't use this at all.", "verified": true, "helpfulness": "0/0", "author": "Tiffany D."}, {"rating": 5.0, "review": "Easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Stevon E. Rainey"}, {"rating": 5.0, "review": "This product was a gift, and we have enjoyed it very much.  It was very easy to set up and begin using, and we have enjoyed a number of good movies, and we enjoy the music channels.", "verified": true, "helpfulness": "0/0", "author": "Dr. Ron M. Garwood"}, {"rating": 4.0, "review": "Works quite well and all the features are nice, though it desperately needs a cooling system. As someone who likes to have tv on in the background it overheats quite quickly which diminishes the performance drastically. I rigged a cpu heat sink and fan to it and has worked perfectly ever since.", "verified": true, "helpfulness": "0/0", "author": "Cole Morgan"}, {"rating": 5.0, "review": "Easy to set up, easy to use, user friendly screens, reasonable price, what else can I say? It connects my TV with multiple media so I got to watch sports (ESPN3), News (Fox News), and movies (Netflix) as I want.", "verified": true, "helpfulness": "0/0", "author": "Dino Y. Lau"}, {"rating": 5.0, "review": "Best thing I have ever bought... period. This thing can do so much for a low price. I have talked about this so much that I got 4 other people to buy this. Don't waste your money on a Chromecast this destroys a Chromecast.  You will love this thing.", "verified": true, "helpfulness": "0/0", "author": "L3g3ndary"}, {"rating": 4.0, "review": "Love being able to watch amazon prime from on my tv thanks to the fire stick but overall i'm just more used to chromecast. Firestick is a good product I just prefer being able to use my ipad as my remote. I think it's because I am used to it after one year of having chromecast.", "verified": true, "helpfulness": "0/0", "author": "R. Kling \"beens\""}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Jessica Hewitt"}, {"rating": 5.0, "review": "I love love love my fire stick! I was streaming video from my older kindle to the TV but I am so glad I bought this. I have had zero problems with streaming and the setup was very easy. I have handy and easy access to all of my purchased movies and music plus the great on demand selection! I also downloaded the remote app in my phone to go with it and that works awesome as well ! I would give this 6 stars if I could! Also when you are watching a series it conveniently ques up the next episode and starts playing when the current one ends!!! LOVE", "verified": true, "helpfulness": "1/1", "author": "Nicole"}, {"rating": 2.0, "review": "Too busy. It needs to be simple.", "verified": true, "helpfulness": "0/0", "author": "Steve Zissou"}]