[{"rating": 3.0, "review": "I've had a Roku box on my living room TV for years, and I have seldom had a problem with it.  Our modem/router is upstairs, and it's a brand new one that Comcast recently upgraded us to.  It works a lot better than the old one, and we can get a strong WiFi signal anywhere in the house, without having to use the WiFi range extender any longer.When Amazon was offering these for just $19 to Prime members, I bought one for the bedroom TV upstairs, then I thought that I might like it better than the Roku and want one for the living room, too, so I bought a second one at that price.At first, they both worked fine.  I like the interface better than that of Roku, it was streaming my shows nicely.  A friend of mine mentioned that she was planning to cut the cable cord to save money, and was thinking about getting a Roku or a Chromecast.  So I gave her my old one, as I was no longer using it.A few weeks later, I started having major problems with the stick on the downstairs TV.  I set up the WiFi extender again (thank goodness I didn't give THAT away!), and that solved the problem for a while.  But the problems started again, videos are either slow to load or do not load at all.  And when they did load, they buffered and froze and basically made everything unwatchable.  I tried all of the troubleshooting tips on this site, and once again, it worked for a while, and then went back to having problems.  It would tell me that I had no internet connection, but when I'd go into the settings to check, it was connected and showed a strong signal from both the router upstairs and the extender.  Heck, it even shows a halfway decent signal from the next door neighbor's WiFi.  I tried using the HDMI extender thingy that came with the stick, but that didn't help.  At first I thought the problem was just with the Hulu Plus app, because I was able to watch Amazon and Netflix, but now I can't watch anything.  Yet I can stream Hulu and Netflix and stuff on my iPad from anywhere in the house, and even out on the front porch or in the back yard.  Meanwhile, the Fire stick on the bedroom TV upstairs is still working fine.  This room is across the hall from the one that contains the router.  So I have come to the conclusion that the WiFi antenna in this stick is not as strong as advertised.I was getting really tired of having to unplug the thing, clear the app data, set up every app again every time I want to watch something.  I give up.  I'm not about to ask my friend to give back the Roku, because a gift is a gift.  So I ordered an Apple TV yesterday from Amazon, which is due to arrive tomorrow.  I chose that over another Roku because I now own a couple of Apple products that I've been very happy with, and I like that they all work together.  And I'm sure the Apple TV has a stronger WiFi antenna than this cheap little stick.The reason I'm giving this three stars and not less is because it is a nice little stick.  I really like the user interface, as well as the remote, and I found the thing to be very easy to set up and use.  But I would only recommend getting this if you live in a small single level house or apartment, or a college dorm room, any place where the TV you are using this on is either in the same room as, or one room over from your router.  But if you are in a multi-level house as I am, go for a Roku box or an Apple TV for any TV that is not on the same floor as the router.", "verified": true, "helpfulness": "2/2", "author": "Christine Murphy \"cmurf1960\""}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Noe Banda"}, {"rating": 5.0, "review": "I cut my cable TV off", "verified": true, "helpfulness": "0/0", "author": "Dahl Alston"}, {"rating": 5.0, "review": "absolutely amazing!", "verified": true, "helpfulness": "0/0", "author": "Marjorie"}, {"rating": 5.0, "review": "Love it Better than Direct TV Primere Movie. Better price.", "verified": true, "helpfulness": "0/0", "author": "Linda Bruce"}, {"rating": 5.0, "review": "Very nice, lots to choose in watching what you like..", "verified": true, "helpfulness": "0/0", "author": "charles lutts"}, {"rating": 4.0, "review": "Decent addition to my Apple TV's, but unless you're only android or Amazon, it's not a replacement.  Good UI, and my son likes the games.", "verified": true, "helpfulness": "0/0", "author": "RB"}, {"rating": 5.0, "review": "The Amazon Fire Stick is easy to use and has access to more choices for TV apps than it's competition. I tried a Chromecast and traded it on the Fire Stick. It is worth the extra $5.00 to get the remote control, and the Fire Stick is much easier to set up and use.", "verified": true, "helpfulness": "0/1", "author": "Robert W. Meredith"}, {"rating": 5.0, "review": "Love it! Connects so fast and works great!!!", "verified": true, "helpfulness": "0/0", "author": "T. Snider"}, {"rating": 4.0, "review": "Gets really hot and sometimes drops the wifi connection and you have to unplug the device and plug back in and it reconnnects .", "verified": true, "helpfulness": "0/0", "author": "John Beck"}]