[{"rating": 5.0, "review": "Works Great! I previously had a Chrome. I couldn't get it to work.  With the Fire TV Stick, I hooked it up and was able to watch movies immediately.", "verified": true, "helpfulness": "0/0", "author": "Dianne Rodriguez"}, {"rating": 4.0, "review": "Pre-configuration offered for being existing customer great and make for easy installation and start-up", "verified": true, "helpfulness": "0/0", "author": "Andre Willemse"}, {"rating": 5.0, "review": "Fun and easy to use, the Fire TV Stick is a great way to enjoy Amazon Prime services even more!", "verified": true, "helpfulness": "0/0", "author": "Ishycat"}, {"rating": 2.0, "review": "I bought the Fire stick believing it would be the solution to obtaining all of the streaming providers in one fail swoop. I already owned a Chrome Cast so, I was able to stream Hulu, Youtube, Netflix but was missing Amazon Instant streaming. The fire stick allowed me to access all subscriptions.  I was excited and then... I was let down, every show I watched would loose quality and freeze but the sound would continue. My bandwidth is fine, everyone in the house wasn't using the internet at the time, and my husband is a software engineer for a cable company so we have the top of the line of internet service.  I never had this problem with my Chrome cast and have since went back to using it along with my x box for amazon prime instant streaming.  I'm disappointed and makes me a very sad panda.", "verified": true, "helpfulness": "0/0", "author": "sarah"}, {"rating": 5.0, "review": "Great device for utilizing a slingbox from any TV without having to use any intermediate device.", "verified": true, "helpfulness": "0/0", "author": "Robert Girot"}, {"rating": 5.0, "review": "Great Unit...  Loved it !", "verified": true, "helpfulness": "0/0", "author": "Ken S."}, {"rating": 2.0, "review": "The Fire Stick was great for a couple of months, but recently it has begun freezing and shutting down while in use. Extremely frustrating...about to throw it out the window and get a Roku instead. Don't waste your money.", "verified": true, "helpfulness": "0/0", "author": "M. Hayward \"Light Expert\""}, {"rating": 4.0, "review": "Pretty good. Seems to be a little buggy if you run it 24/7 like my wife does, video begins to freeze, luckily this happens only after 7 days straight of heavy heavy use.", "verified": true, "helpfulness": "0/0", "author": "herbert"}, {"rating": 5.0, "review": "Very pleased.", "verified": true, "helpfulness": "0/0", "author": "richard l. taylor"}, {"rating": 5.0, "review": "It's pretty sweet! Definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "nathan"}]