[{"rating": 3.0, "review": "I mentioned before that navigating YouTube with Fire TV Stick is very difficult.I am afraid this applies to all of these TV devices.  Without a keyboard getting fromplace to place is tiresome and often just too much trouble.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Patrick Lowenthal"}, {"rating": 1.0, "review": "Get's hot and doesn't work more than it works. Cuts out or freezes while watching non stop. Buy something else this product does not work.", "verified": true, "helpfulness": "0/0", "author": "T. Sargent"}, {"rating": 5.0, "review": "I love amazon fire stick!!! Enough said!", "verified": true, "helpfulness": "0/0", "author": "Jillian Turek"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Fiesty Rican \"Boricua Morena\""}, {"rating": 5.0, "review": "Fast and easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Kelly M"}, {"rating": 5.0, "review": "Works great. No problems whatsoever!!!", "verified": false, "helpfulness": "0/0", "author": "Ravi Kanth Mulam"}, {"rating": 4.0, "review": "I am a complete newbie to streaming so I did not really know what to expect. I had normally played Prime movies through my browser. I am really digging the device. Super simple and straightforward. I am using my computer monitor for the HDMI input and the audio goes out to speakers. It all works well. The only thing I miss is being able to read reviews of movies, rather than just the ratings.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Lyerly"}, {"rating": 3.0, "review": "The Fire TV stick works great but I wish there was a way to to have multiple Amazon user accounts names stored so that we could log in and out with just the password rather than having to \"de-register\" the account.  I don't want to charge my roommate's account and vice-versa when downloading content.  It would also be better to have a longer power cord for those who hang their Tvs.  Other than that it seems to work fine! ~ Renee", "verified": false, "helpfulness": "0/0", "author": "Renee M. Speltz"}, {"rating": 4.0, "review": "The fire TV stick definitely delivered more then I anticipated. It's fast, convenient works well, and the interface is simple enough to navigate quickly. Having the remote is great, and I love that it does not need direct line of sight.What most surprised me is that I actually found myself playing games on it using the included remote and actually having fun and wanting to play again.I love how they tell you before you download if an app or game is compatible with the fire stick remote or a gamepad. I wish it also said if it had local coop/local multiplayer and the same for online.The only issue with it for now, is the small amount of apps for it. But I'm sure this will improve as time goes by.Don't be on the fence with this thing, it's the best bang for your buck, and it will really surprise you.", "verified": true, "helpfulness": "0/0", "author": "DeenDon"}]