[{"rating": 5.0, "review": "I look at it almost every day", "verified": true, "helpfulness": "0/0", "author": "Michael Clark"}, {"rating": 5.0, "review": "Great device.  Bought two, wish I had ordered 4 for the price.", "verified": true, "helpfulness": "0/0", "author": "dcl3500 \"dcl3500\""}, {"rating": 4.0, "review": "Great device, I have 2, one for each kids rooms.  I like how it continues to play the next video in the series automatically.", "verified": true, "helpfulness": "0/0", "author": "SSKing \"SS Dub\""}, {"rating": 4.0, "review": "The fire stick was bought to receive Netflix . I can work it but my wife is not a tech person and has difficulty changing inputs, finding Netflix, and working it..", "verified": true, "helpfulness": "0/0", "author": "The critic"}, {"rating": 5.0, "review": "We have reaped the benefits of the Fire TV Stick almost everynight since we got it.  We have chosen not to add Netflix or HULU so I can not comment on the way it works for those users but for straight Prime it is great.  I read in reviews that some had experienced streaming delays but we have had no issues.  I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "PC Queen"}, {"rating": 4.0, "review": "Love this thing!  Totally changes how we watch tv.  Only 4 stars because it came with default language of German and took a while (and some google translate help) to figure out how to switch language to English.", "verified": true, "helpfulness": "0/0", "author": "Jennifer N Walters"}, {"rating": 4.0, "review": "Love it so far but wish it did not need to be plugged in. (I understand most do not)  My TV hangs high on the wall and is very large.  I cannot access the outlet so need to use extension cord to a wall outlet nearby.  Needless to say, I unplug it and tuck the cord behind the TV when not using firestick.", "verified": true, "helpfulness": "0/0", "author": "Cleo \"3kidslater\""}, {"rating": 5.0, "review": "Great Product Great Seller", "verified": true, "helpfulness": "0/0", "author": "Gary F. Howard"}, {"rating": 5.0, "review": "Fantastic!  Sharp picture and sound.  Absolutely wonderful!", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 3.0, "review": "Takes a really strong wifi connection to view and cannot use many locations in my home. Frequent buffering and picture, especially faces, is distorted.", "verified": true, "helpfulness": "0/0", "author": "bonnie dooley"}]