[{"rating": 2.0, "review": "The firestick does not function well.  This is my second one.  The problem is its connection to your WiFi.  It loses connection and then gives you all sorts of messages, some just that you have to ceck your network connection to Amazon services are not functioning.  This is really funny because I am sitting next to the TV and working on my computer through its WiFi connection.  I think it is a scam to tell you the truth.", "verified": true, "helpfulness": "0/1", "author": "Lilac Fox \"Lilly\""}, {"rating": 2.0, "review": "a lot of buffering", "verified": true, "helpfulness": "0/0", "author": "Patrica J. Stinson"}, {"rating": 1.0, "review": "Not highly impressed with the new fire TV Stick. The streaming is slow and very patchy. I like my Rucko. I will be switching back to it.", "verified": false, "helpfulness": "0/0", "author": "Robert Hernandez"}, {"rating": 3.0, "review": "I enjoy using it for the most part. Remote works great and easy to control from my android phone, which is pretty awesome. The only problem I have is that it lags a lot. Supposed to have more memory and processing power than all the other streaming video setups, but even with a wifi network that can handle 3 streaming systems, MMORPG gaming, and still get over 100 mb/s speed test all at the same time, the fire stick lags a ton. I am assuming that its a software problem that they need to fix. I have a chromecast and a roku and they stream just fine with no lags, but even with a \"very good\" connection and nothing else running on my network it still lags.", "verified": true, "helpfulness": "1/1", "author": "John N"}, {"rating": 5.0, "review": "So very happy with my Fire TV Stick!  We have a perfectly fine older flatscreen in our office.  Since it is not equipped with WiFi internet access the next best thing was to purchase the Fire TV Stick.  Very easy to connect to the one HDMI space I have on this TV.  All I had to do was free up the HDMI slot by using component cables rather than HDMI cable and that was a no brainer; my cable company provided the cables to me no cost involved.  But back to the Fire TV stick, it is great and so easy to setup and use.  Prior to this purchase I was accessing Netflix or Amazon video by connecting my iPad to my TV.  That worked fine but the iPad power runs down with long term usage and is not as convenient as the fire TV stick remote.  The fire TV stick is wonderful and I highly recommend this item if your TV does not have direct wifi access.", "verified": true, "helpfulness": "0/0", "author": "Riley"}, {"rating": 5.0, "review": "Very nice!", "verified": true, "helpfulness": "0/0", "author": "josephine mapue"}, {"rating": 5.0, "review": "Not a bad product at all. The only thing I wish it had was voice recognition. I would recommend to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "Toad"}, {"rating": 5.0, "review": "Best invention ever, it has so much to offer. Plus, it's so simple to use. I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Mitchell"}, {"rating": 5.0, "review": "Easy set up and user friendly.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Do u have to have wireless for this.", "verified": false, "helpfulness": "0/0", "author": "loretta clark"}]