[{"rating": 5.0, "review": "I love love love my firestick. It has every movie and every show i could ever want. Totally replaces cable", "verified": true, "helpfulness": "0/0", "author": "tabitha benedetto"}, {"rating": 5.0, "review": "It's a ton of fun. We use it daily to watch free movies and play music through Pandora. We also watch TV shows.", "verified": true, "helpfulness": "0/0", "author": "Shalaia Walters"}, {"rating": 4.0, "review": "good device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Switching from satellite to Internet,  hope this does the job", "verified": true, "helpfulness": "0/0", "author": "Michael A Via"}, {"rating": 5.0, "review": "Awesome product! This could very well replace my cable tv!", "verified": true, "helpfulness": "0/0", "author": "Joey Lewter"}, {"rating": 4.0, "review": "So far  so good...its better than streaming  on my computer", "verified": true, "helpfulness": "0/0", "author": "Lucille M. Lilly"}, {"rating": 1.0, "review": "My problem is when watching a movie or tv series it sometimes began buffering which is annoying.  Sometimes it says there's no Internet connection. If that doesn't happen it would be what I expect and then some.", "verified": true, "helpfulness": "1/2", "author": "Mark Collins"}, {"rating": 2.0, "review": "The device and installation are great.The service was not what I expected, and that may be my fault for not better investigating accessible content before purchasing.  I purchased on an impulse to see what it's like.  Not being a Prime member, I'm very disappointed in the amount of free or low cost content that's available.  I hate the cable company and the idea of paying for TV content--especially the same content that is typically broadcast for free and I'd not watch at all if it was not \"on\" at the moment and free on TV.  In short, based on my quick scan of available options and content, Fire TV is not a real alternative to paying for TV content or a way to \"cut the cord\" for cable in a meaningful sense. At most, it allows you to pay Amazon instead of the cable company, and possibly save money if you watch little TV and therefore pay for only what you really want (but $2-3 per episode would add up fast and eliminate any possible savings for many users).Why is it taking so long for content providers to treat (live and recorded) streaming as just another public broadcast medium (like the airwaves) from which they can profit in the traditional way--paid advertising--without charging users for access?", "verified": true, "helpfulness": "0/1", "author": "Scott E Davis"}, {"rating": 4.0, "review": "Awesome features!", "verified": true, "helpfulness": "0/0", "author": "yani frias"}, {"rating": 5.0, "review": "I like the speed and user-friendliness, and the ablilty to still get my NetFlix, Hulu and Amazon stuff....Great device...I have them throughout my home", "verified": true, "helpfulness": "0/0", "author": "Penny Landry"}]