[{"rating": 5.0, "review": "Use the Apple tv, tried the Google chrome cast. This however is the best smart tv option available. Affordable and Mini in nature. Apart from all the apps including YouTube it also has games. Games that are actually fun to play.Remote is the best part, it's not infra red so one can be anywhere you change the channel. The only negative I have is that it is thicker than shown in pictures. A little misleading in that sense. However all the functionality over comes everything.", "verified": true, "helpfulness": "0/0", "author": "Khan538"}, {"rating": 2.0, "review": "Like built-in apps,  Miracast not so good. Picture on TV is not good enough to watch.  Since I bought it for the Miracast from my Fire phone not much use for it.  Maybe it's just that my TV is too big, Is that possible?", "verified": true, "helpfulness": "0/0", "author": "Phil 57"}, {"rating": 5.0, "review": "This works great and we are very pleased with it.", "verified": true, "helpfulness": "0/1", "author": "Jolene Dornack"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/1", "author": "Chicklets mama"}, {"rating": 4.0, "review": "Still no Windows miracast support!", "verified": true, "helpfulness": "0/0", "author": "Aymen"}, {"rating": 4.0, "review": "Great for movies but it needs work on mlb", "verified": true, "helpfulness": "0/0", "author": "richard j sirois"}, {"rating": 5.0, "review": "This has been a great tool too have. Wish it came with more instructions. Found someone to help with it. It makes watching movies even nicer, not to leave the house. I recommend this to my friends.", "verified": true, "helpfulness": "0/0", "author": "Eric Caffrey"}, {"rating": 5.0, "review": "So easy to use and so much to see.", "verified": true, "helpfulness": "0/0", "author": "C. Trueson"}, {"rating": 1.0, "review": "Constantly drops the WIFI network, despite registering a \"very strong\" signal at all times.  This is apparently a known problem, which Amazon is electing not to fix.", "verified": true, "helpfulness": "0/0", "author": "ZACHARY FINN"}, {"rating": 5.0, "review": "Loved it. Works great!", "verified": true, "helpfulness": "0/0", "author": "Barcode Printers, Inc \"Boomerang Sherpa\""}]