[{"rating": 5.0, "review": "Love it! Canceling our cable as soon as our contract is up!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple to use, sets up in no time and streams flawless.", "verified": true, "helpfulness": "0/0", "author": "Glocklimited9"}, {"rating": 5.0, "review": "It was very simple to install and to use, and my wife and I really enjoy the movies and the TV shows. We have only had the TV stick less than two weeks, so far we really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Raymond S."}, {"rating": 5.0, "review": "Its great. Super functional!! My wife loves it!!", "verified": true, "helpfulness": "0/0", "author": "robert lewis"}, {"rating": 1.0, "review": "Wouldn't connect to my WiFi", "verified": true, "helpfulness": "0/0", "author": "brittanie"}, {"rating": 5.0, "review": "I absolutely love it. I bought 2.", "verified": true, "helpfulness": "0/0", "author": "linique dare"}, {"rating": 5.0, "review": "better than apple tv, and im have both", "verified": true, "helpfulness": "0/0", "author": "Matheus Machado"}, {"rating": 5.0, "review": "This thing is awesome. I've had a bunch of other streaming devices but this one is the most intuitive for my guests and hides right behind the tv. My only appreciation would be if it was capable of running off my tv's USB outlet. I hate cables so tucking that one away would have been nice.", "verified": true, "helpfulness": "0/0", "author": "'12 Rubi"}, {"rating": 4.0, "review": "I will try to keep this review quick, and to the point. I REALLY, REALLY wanted to give this thing 5 stars. I did. It works. It does what it is supposed to do. 98% of the time. It has some neat tricks and plenty of apps to use with it. I will try to speak on what I like about it and what could maybe use some improvement. In my opinion. What matters to me, may not matter to some.Good:Easy set up. Plug in. (Powered USB port on TV will work, it has to be a real USB port not just the service USB port.) Play.Comes preregistered to your account. Which is nice.Most of the great apps, Netflix, Prime, WatchESPN, Pandora, Hulu, Plutotv, HBOGO, youtube, etc..You can play some games, even with the remote. The kids enjoy that part.Out of site, out of mind.Slim easy to use remote, which doesn't require line of sight.Snappy and quick. (Mostly)Price.Picture quality gets to 1080p fast.Not so good:No VUDU/Ultraviolet app. I know this must be some Ego clash between Wal-Mart and Amazon, but really? The Blu-rays and DVD's Amazon sells have digital copy... to Vudu or UV... Silly, flixster works ok and fills in a good part of the gaps, but its interface is lacking and it doesn't carry all the movies in your UV account.Prime is pushed way to hard.. Prime is the main interface of the system. Yes its an Amazon device, I understand their need to push their products, but... ughhhh. On most other streaming devices you click on the Amazon app then you select prime from the options and away you go. In this Amazon is \"HOME\" with prime and paid co-mingled together. Yes you can get to prime, but its not user intuitive. Plus, if my kids watch 5 mins of 10 different children's shows, my \"HOME\" is loaded with their covers pushing the other Apps into the background. Not to mention the disappointment with oh wait that is a paid movie. It isn't a nightmare, but it's annoying.Not snappy. Yes I mentioned above about it being snappy and it is 98% of the time. Until it decides to pause 5 seconds in between actions. Like switching apps or the voice and sound continue on your show but the picture stops, then everything runs at hyper-speed until it catches up. I know nothing is perfect, this happens just often enough to cause some aggravation.Overall:Great product, I wanted it to be perfect. It isn't. I still would recommend to anyone wanting an easy, out of the way streaming option. Plenty of more options than what I get on my smartTV. Nice price and seems to be of good quality. Software probably needs a little tweaking. But overall its good stuff.", "verified": true, "helpfulness": "1/1", "author": "Philthyvt"}, {"rating": 5.0, "review": "can't say enough about how much I like this .... use it ALL the time!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]