[{"rating": 5.0, "review": "I have had my fire stick for a couple weeks and I absolutely love it.  Very easy to set up and I was streaming in just a few minutes.  I am so happy I purchased the firestick.", "verified": true, "helpfulness": "0/0", "author": "karen prendergast"}, {"rating": 5.0, "review": "Nice product.", "verified": true, "helpfulness": "0/0", "author": "Keros S Johnson"}, {"rating": 4.0, "review": "Like the ease of use. It took awhile to set up because one of my hdmi ports didn't work. Once I figured that out it set right up. I don't like having to pay for movies if they aren't on prime. I wanted to watch Indiana Jones, but it was 3.99. I thought that was ridiculous for such an old movie. Amazon needs to address that issue and fix that.  It is way easier than my dvd to use. I can pause and forward without any problem. I still have lots of movies to watch, but would like to be able to watch ones not on prime. If there are 40,000 movies to watch on prime, where are they  located???", "verified": true, "helpfulness": "0/0", "author": "debbie"}, {"rating": 5.0, "review": "All I can say is -amazing.  This thing is essentially a computer on a stick with remote control.  Works as advertised.  I replaced a laptop I had providing media services to my Tv.  Much cleaner and ... the laptop didn't have remote control.  The Fire Stick is great!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 5.0, "review": "Love it!!!! Works beautifully and I can move it from the kitchen tv to the bedroom tv until I get another one. Easy as pie to install and there really is no setup other than entering passwords.Highly recommend!!!", "verified": true, "helpfulness": "0/0", "author": "Baubles"}, {"rating": 1.0, "review": "I have not been able to use it. Every attempt is met with frustration because settings will not save/", "verified": true, "helpfulness": "1/2", "author": "Cindy Wiedenbeck"}, {"rating": 5.0, "review": "Easy to use. Plug and play. I have a roku2 and this functions better, smoother scrolling, seamlessly integrates with all of my media(Netflix, prime, plex) solid product Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "I love the concept of the Fire Stick. I had a Google Chromecast and never opened it because I wanted a \"real\" remote and I was waiting to buy a new LED tv (I was robbed months before and pulled out the old tube tv's). At Christmas I got a couple of new tv's and bought several Fire Stick's. I loved the stick the 1st 2 weeks. Then I came home to: \"Internet Connection Lost\". Then Home page not available... go to Network Settings. Now, 4 weeks later, it does one or the other EVERY SINGLE NIGHT when I turn it on! Sometimes both alternatively. It is so frustrating. I gave these out as Christmas presents. Kept 3 for myself and am currently using 2 of them in rooms side by side. They're never dysfunctionin at the same time, so it's NOT the internet. But, once it's up and going it is great. Giving It a 4 on the small chance my room is too far from the router. My son has only had problems twice since Christmas.Side note...for some reason, the remote is a *bleep* to open!P.S. An hour after this review...a new glitch. Don't know for sure if it was a Netflix issue or Fire Stick. But when I went to a 2nd episode of Bones, it was a tiny square up in the corner like PIP and the rest of the tv black. Tried American Dad and Family Guy...same deal. I've had Netflix for years and this has never happened on the wii, wii u, Blu ray, phone, laptop or Kindle so I'm leading toward it being a \"STICK GLITCH\".", "verified": true, "helpfulness": "0/0", "author": "D. Porter"}, {"rating": 1.0, "review": "Not any better than chrome cast", "verified": true, "helpfulness": "1/3", "author": "the gorethox \"Helpful as I can\""}]