[{"rating": 5.0, "review": "This thing rocks.  I will not miss cable or satellite.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Adam Schneider"}, {"rating": 5.0, "review": "THIS IS A LIFE CHANGER HERE PEOPLE!  NO MORE SQUINTING INTO YOUR IPAD, STRRAINING TO CATCH THE WORDS. TELL COMCAST TO KISS YOUR GRITS AND STREAM TO YOUR TV. WHAT A VALUE. THANKS AMAZON. SEND MORE CHEETOS, IM RUNNING LOW.....", "verified": true, "helpfulness": "0/0", "author": "Daniel S."}, {"rating": 5.0, "review": "WORKS EASIER THAN NETFLIX", "verified": true, "helpfulness": "0/0", "author": "LINDA ROSE-HOAGLAND"}, {"rating": 1.0, "review": "Started to drop the wifi connection after about 1 day.  All my other wifi devices work fine so I am curious why only the fire stick is so affected but did wok initially.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "This thing is fantastic.  At first it was a four star item because of the ads/tutorials, but you can just turn them off.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "The Hoser \"hoser515\""}, {"rating": 3.0, "review": "Sometimes the Stick has issues with buffering.  I don't have the same issues with a ROKU.", "verified": true, "helpfulness": "0/1", "author": "Jackie"}, {"rating": 1.0, "review": "Add new sevices to use this device was out of this world. Returned it", "verified": true, "helpfulness": "0/1", "author": "Shanequa Banks"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Ralph Hagen"}, {"rating": 2.0, "review": "Slow... really slow. Buggy... crashes at least once a day. Mirror screen works once in a while.It is just not good. Roku 3 has been flawless.... it doesnt even compare.", "verified": true, "helpfulness": "0/1", "author": "M.J.1978"}, {"rating": 1.0, "review": "I only gave it 1 star simply since it isn't possible to rate it lower. I've always been a fan of the quality put into most Amazon products but this streaming device can be best described with one word, GARBAGE. This thing conveniently stopped working shortly after the return period was up. By stopped working I mean dropping the wireless connection constantly or the video will freeze every minute for a solid 10 seconds. I don't reccomend this to anyone serious about switching to streaming as a viewing option. Spend the money on a roku or Apple tv.", "verified": true, "helpfulness": "0/1", "author": "Sean Cope"}]