[{"rating": 1.0, "review": "Internet connection too slow to stream movies", "verified": true, "helpfulness": "0/1", "author": "Douglas Gum"}, {"rating": 5.0, "review": "Love it, I can access my Prime Music and all of my pictures on the Amazon Cloud Drive.", "verified": true, "helpfulness": "0/0", "author": "Nate Szabo"}, {"rating": 1.0, "review": "Total CRAP!!! I have internet connection, it just does not WORK!!! Thank you Amazon. You used to have decent help!! Greed destroys companies!", "verified": true, "helpfulness": "0/1", "author": "Gil of the Amazon \"I am an avid reader, I love a good book more than almost anything.\""}, {"rating": 5.0, "review": "like it", "verified": true, "helpfulness": "0/0", "author": "Chris Opperman"}, {"rating": 5.0, "review": "Love the Fire TV Stick!!", "verified": true, "helpfulness": "0/0", "author": "April Galbreath"}, {"rating": 5.0, "review": "I Fire TV Stick performs very well!!", "verified": true, "helpfulness": "0/0", "author": "Timothy Hobson"}, {"rating": 4.0, "review": "Works perfectly, just like the Fire TV box. I wish it had a voice remote.", "verified": true, "helpfulness": "0/0", "author": "Renn"}, {"rating": 4.0, "review": "Received as Sling tv promotional deal for signing up 3 months. It's not bad once it finally works, as I had to deal with 2 defective units, wasting my time and frustration. It is a great gadget to have, however I prefer my HTPC over Fire stick.", "verified": false, "helpfulness": "0/0", "author": "Karrie Kampf"}, {"rating": 5.0, "review": "Pretty awesome. Love my fire tv stick. It worked as expected. I just wish there was an app for a search engine like Google.", "verified": true, "helpfulness": "0/1", "author": "BREY W"}, {"rating": 5.0, "review": "I love my new amazon fire tv stick! i can't wait to get an amazon prime subscription so I can watch some of the free episodes and movies that they offer. I love to stream and  I love this little usb drive because it doesn't have to have so many wires and cords plugged all the time. I also like it because I can take it with me. Especially if I am waiting at the hospital is nice...", "verified": true, "helpfulness": "0/1", "author": "jennifer bales"}]