[{"rating": 5.0, "review": "Super easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Cherylusaf2"}, {"rating": 5.0, "review": "Good quality", "verified": true, "helpfulness": "0/0", "author": "vw7420"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ron Valentin"}, {"rating": 5.0, "review": "Excellent, well worth the price!", "verified": true, "helpfulness": "0/0", "author": "Janis L. Hahn"}, {"rating": 5.0, "review": "Most bang for your buck as far as HDMI port streaming services go. Easy to use, got it for my mom, and she likes it.", "verified": true, "helpfulness": "0/0", "author": "Bryn"}, {"rating": 5.0, "review": "Very easy to set up and to take with you whenever you go, all you need is wifi connection. The movies and games it delivers for such a reasonable price is just great deal. It turned my simple living room Panasonic into a smart TV. I stream Amazon Prime video all the time and will get a gaming controller soon.", "verified": false, "helpfulness": "0/0", "author": "Garry Sm"}, {"rating": 4.0, "review": "a great product", "verified": true, "helpfulness": "0/0", "author": "Carol Short"}, {"rating": 4.0, "review": "I thought it would be cordless. I need another cord from my TV like I need a hole in my head. Other than that, a nice addition to the home entertainment center.  I also have an Apple TV, a sound bar system and a DVD player attached to my wall mounted flat screen TV. I love that I can watch my Prime purchases without having to throw it on the screen from my MacBook.  Apple TV and Amazon products do not play well together.  While the two of them duke it out we consumers are forced to buy multiple streaming devices.  Ideal situation?  A fully integrated smart TV that allows me to access my Apple TV purchases, my Amazon Prime purchases and all the other apps that us cord cutters use.  Sounds like a good business opportunity, right? Hmmmm.....", "verified": true, "helpfulness": "0/0", "author": "Tanika.McKelvy"}, {"rating": 4.0, "review": "Awesome little tool.", "verified": true, "helpfulness": "0/0", "author": "Jesus Gonzalez"}, {"rating": 5.0, "review": "I love it! Very fast and great user friendly interface. Had to buy a hdmi sound extractor to connect surround system though. No big deal, you will love it!", "verified": true, "helpfulness": "0/0", "author": "Mike and Val"}]