[{"rating": 5.0, "review": "it works really good streaming HD videos fast I have no problem syncing my phone to it so I can use the keypad on that to type in and search what I look for small and compack so I can bring it other places too if I want to. Love it!", "verified": true, "helpfulness": "0/0", "author": "Berg"}, {"rating": 3.0, "review": "Disconnects from wireless router to often.", "verified": true, "helpfulness": "1/1", "author": "Nathan a Tirey"}, {"rating": 5.0, "review": "I like it there aren't as many free movies as I was told but I just got it so I just really need to see how a month goes.  thank you", "verified": true, "helpfulness": "0/0", "author": "karen s edwards"}, {"rating": 5.0, "review": "Had no idea I could watch so many free movies and shows and the picture quality is fabulous. HIGHLY RECOMMENDED!!!", "verified": true, "helpfulness": "0/0", "author": "Howard J. Zarring \"JZ\""}, {"rating": 4.0, "review": "IT CONTINUES TO LOOSE RECEPTION AND HAVE TO REINSTALL WI- FI CONNECTION", "verified": true, "helpfulness": "0/0", "author": "Thomas Wilhelm"}, {"rating": 5.0, "review": "WE LOVE IT AND ENJOYING NETFLIX", "verified": true, "helpfulness": "0/0", "author": "Gail LaVacca"}, {"rating": 5.0, "review": "We'd been accessing our prime account through a 3rd party system, it was really annoying.  This was reasonably priced, and lets us access all the videos and programming that have replaced our need for any cable or satellite tv.  There are plenty of things for the whole family, we love it.", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 4.0, "review": "Does as advertised. Print, of names of movies, could be larger.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 4.0, "review": "This was a Xmas gift which has worked well, though we did have to contact tech support to reload Netflix.  It's working well now and tech support knew exactly what to do to fix the problem.", "verified": true, "helpfulness": "0/0", "author": "jadk \"siam lotus\""}, {"rating": 3.0, "review": "When this thing works, it's rather amazing. I've been using it to watch Netflix, YouTube videos, and Twitch streams on my living room television.The problem is... it doesn't always work.In the past few days, there's been quite a few issues tied to this piece of technology. It's rather frequently forgetting the network it's connected to or rebooting at around 11PM CST for no real discernible reason I can see. Just now, it's stopped detecting the remote control itself that CAME with the unit. These are pretty annoying aspects of the Fire TV Stick which make me say to any future buyers to wait a little bit until some of these bugs fall out.That being said, installation was a breeze and it is very handy when these issues don't come up to interrupt your viewing experience.", "verified": true, "helpfulness": "1/1", "author": "Mike Schumacher"}]