[{"rating": 4.0, "review": "Only been using this for an entire day now, but here's my first impressions.It's pretty good.  I don't love it.  It's funny how much Amazon vaunted the specs, yet this doesn't perform any better than any other device I've used.  (I currently have two Rokus and one Apple TV.)  The UI actually seems a tad choppier than the Apple TV.  I'll admit that it's better than my Rokus, but they're a couple generations old.  Regardless, I'd have thought that with the specs they published it would be smooth as silk, and it's just not.Also, I *really* wish there were a way to skip the annoyingly long introduction.Still, at the cost, it's a fine unit.  Hope they get more channels.", "verified": true, "helpfulness": "0/0", "author": "A. Falco"}, {"rating": 5.0, "review": "More useful than a Chromecast because it does not require a separate device to play content.  The Chromecast is basically a receiver dongle that lets your TV receive content from a connected device; i.e. Android, IOS tablets, PC or Mac.  The FireTV stick has the brains inside of it and after it connects to your wi-fi then connects to your Internet provider.  The content options appear to be nearly endless.  There are a variety of both free and paid options and if you are a Prime member then all of the standard Prime content is free.  FireTV stick also has apps for your phone to let you connect and stream directly or just use your phone for a keyboard and search tool and then start the video playing on your TV.", "verified": true, "helpfulness": "0/0", "author": "Ron R."}, {"rating": 1.0, "review": "I have a question about the product. When I try to connect the stick to a Hotel TV and try to use the Hotel's web protected WIFI, it does not allow me to enter the credentials to access the WIFI - I heard from Amazon support team that this feature is not supported at this time. Without which, I do not see any use of this product if it cannot allow to use a paid high-speed protected WIFI. I also feel stick is extremely slow - I tried to use my LTE MIFI network - It cannot play anything. Bandwidth was extremely high when I measured it in the device. I have a fire TV connected at home, I feel it works better - not carried with me to a protected WIFI to compare the performance.", "verified": true, "helpfulness": "6/7", "author": "SENTHILD"}, {"rating": 4.0, "review": "Unless I set the quality to 720p, there is constant flickering when watching anything. I can notice the difference between 720p and 1080p, so this is a bothersome bug.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Blume"}, {"rating": 5.0, "review": "Loving this. Works good. Satisfied with product.", "verified": true, "helpfulness": "0/0", "author": "Misha"}, {"rating": 5.0, "review": "bought for my 17yr daughter to put on her TV in her room so she can access netflix and Prime movies without having to use her computer. She is loving it, it was easy to set up! It makes having Prime even better:)", "verified": true, "helpfulness": "0/0", "author": "Stephanie O"}, {"rating": 1.0, "review": "Customer service representative didn't call me back to fix all the issue that I have with the device.", "verified": true, "helpfulness": "1/2", "author": "christopher"}, {"rating": 5.0, "review": "Works fantastic!", "verified": true, "helpfulness": "0/0", "author": "Dennis Black"}, {"rating": 5.0, "review": "I give this product a 5 star rating for one reason.  I cannot give it a 6 star rating.  This is one cool item.  I like it so much I bought a second one for my other HD TV.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Simply awesome!", "verified": true, "helpfulness": "0/0", "author": "Michael"}]