[{"rating": 3.0, "review": "While the interface is pretty good and the technical specs are awesome, I had ongoing trouble with buffering on my WIFI - with 50MBs download speed! Switched to wired Fire TV and now enjoy the best image quality on Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Matt \"Matt\""}, {"rating": 3.0, "review": "There's plenty of room for improvement IMHO with the device ... requirement of extra charging cable is just awful. I wish this whole service would be completely integrated with google store, so I don't have to manage two different app downloads. It's OK overall, but I still am on the fence on going back to chromecast.", "verified": true, "helpfulness": "0/0", "author": "ParalelCosmos"}, {"rating": 1.0, "review": "The Software gets stuck sometimes and picture becomes blurred.", "verified": true, "helpfulness": "0/0", "author": "Akshay"}, {"rating": 5.0, "review": "As a college student, this is the greatest..", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "So far this has been an awesome experience- we will never be able to watch 1/10 of the content. Most Excellent interface, and the streaming video is of the highest qualityBuh BYE cable and satellite!", "verified": true, "helpfulness": "0/0", "author": "Alan Fausel"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Luke Noriega"}, {"rating": 5.0, "review": "Excellent and being a prime member give you more choices. It better than my brother Apple TV and more affordable. Now I just need to get a game paddle for the kids and it will be complete. A lot of bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "charles w. henckler"}, {"rating": 5.0, "review": "I love it. It works like a charm. It was worth it. I had put it in the kids room to watch cartoons on netflix to leave the living room tv for me.i only have 1 smart tv in the house and i don't have cable, so it was worth buying the fire tv stick to make the the other tv in the kids room a smart tv. It was cheaper than buying a smart tv.", "verified": true, "helpfulness": "0/0", "author": "yasmin"}, {"rating": 5.0, "review": "I only use it for Netflix, but its got a lot of cool stuff on it.", "verified": true, "helpfulness": "0/0", "author": "wendy malchow"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "frankie roldan"}]