[{"rating": 4.0, "review": "It's OK. Interface is face. Very easy to use, but where are all these movies they speak of? Could be I don't know how to use it yet, but I see a few hundred movies not these thousands they claim", "verified": true, "helpfulness": "0/0", "author": "descom hoagland"}, {"rating": 5.0, "review": "I actually prefer this over my C*Cast.It is lacking as far as screen casting but the remote is such a huge bonus.It really comes down to having a remote over having to use phone and computer apps.Smart move Amazon.", "verified": true, "helpfulness": "0/0", "author": "Portland79"}, {"rating": 5.0, "review": "So much to see. I love Amazon prime.  Lots of free movies games and books!", "verified": true, "helpfulness": "0/0", "author": "elliott"}, {"rating": 5.0, "review": "Firestick is awesome! I had Chromecast before this and there is no comparison. The voice remote app works amazingly too on my tablet.", "verified": true, "helpfulness": "0/0", "author": "Victoria Ianni"}, {"rating": 3.0, "review": "While this works great and doesn't need a computer, I would recommend Chromecast over this anyday.", "verified": true, "helpfulness": "0/0", "author": "Musicman132"}, {"rating": 4.0, "review": "Very easy to order and watch movies.  Although sometimes the picture would freeze and I would have to start over.", "verified": true, "helpfulness": "0/0", "author": "Romeo M."}, {"rating": 5.0, "review": "Love it. Works great.", "verified": true, "helpfulness": "0/0", "author": "Michael ray bevins"}, {"rating": 5.0, "review": "The instant video app on my xbox 360 used to freeze a lot. Since I started using the Fire TV Stick I had no more problems. Streams very fast and has a nice set-up.", "verified": true, "helpfulness": "0/0", "author": "Jose Jimenez"}, {"rating": 1.0, "review": "Don't waste your money. Get an Apple TV. I'm a huge Amazon supporter, but this thing stinks. Whenever I attempt to watch shows on it, I loose my patients and end up going to the other room where my Apple TV is. Amazon has along way to go before they have a product that is comparable to the Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Sam S."}, {"rating": 3.0, "review": "To get to the nitty gritty....Pros:- lots of features, such as Netflix, Twitch, YouTube, game apps, and of course Amazon- Small and hides well. Powered from the USB port on my Samsung HDTV.Cons:- runs a tad slow at times; the menu can get choppy when browsing- can get very warm/hot, probably causing some of the choppiness when browsing- the remote is cheap - I truly hate to say that, as I absolutely adore Amazon however, the remote is not well made. It's cheap plastic, and many, many times when clicking the side buttons to browse different apps, it's as if the button gets stuck and rapidly moves through all the menus. Also, every time I click a button on the remote, it's like the whole thing gets \"squished\", and the plastic feels like it's grinding together.- the netflix app has closed out several times with an error code (I don't have it up at the moment, so I can't recall exactly what it is.Would I recommend this? Possibly....I don't know. The remote needs improvement, and the stick needs some more speed behind it.mOn a side note, I am an IT professional, and the Internet strength in my house is excellent. As a comparison, my PS3 never (I literately mean that - never) has issues streaming Amazon Videos or Netflix. Obviously they're two completely different systems, but the Fire TV Stick needs some software enhancements and/or hardware improvements.", "verified": true, "helpfulness": "0/0", "author": "N. Schlip"}]