[{"rating": 5.0, "review": "I love this! Its so convenient and small and easy to use I would honestly rather have this than cable in my house because with amazon prime and Netflix you really need no other television programming.", "verified": true, "helpfulness": "0/0", "author": "Jessica O"}, {"rating": 5.0, "review": "Love all the features. Simply put, it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Alf"}, {"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/1", "author": "Kenny Van Sky"}, {"rating": 1.0, "review": "We liked this item while it worked, but after 5 months it stopped fuctionIng - it couldn't detect any of the wifi networks.  I called technical support - a waste of my time. They wouldn't refund or replace the item. I was very disappointed with the experience.", "verified": true, "helpfulness": "1/1", "author": "Monica McCarthy \"Momof 2\""}, {"rating": 1.0, "review": "Doesn't reach my wifi", "verified": true, "helpfulness": "0/1", "author": "Vincent Gutilla"}, {"rating": 5.0, "review": "The Fire TV Stick is easier to use and works a lot better than any of the smart TV's we have in our Florida house.  Plus it is protable to any TV with a Usb and wifi in the area.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey D. Mogg"}, {"rating": 2.0, "review": "It's pretty laggy and everytime I play HBO Go it skips and stalls.  I'm going ot try Fire TV in hopes it works better.", "verified": true, "helpfulness": "1/1", "author": "Tyler"}, {"rating": 5.0, "review": "Excellent streaming device! Remote works fine but wish it had volume button.", "verified": true, "helpfulness": "1/1", "author": "Ryan"}, {"rating": 2.0, "review": "If you want to watch Amazon Video, it performs great.  It is lousy as a device to mirror your tablet or computer screen, which is half of the reason I bought it.  Also other third party video services like \"Crackle\" do not work well.", "verified": true, "helpfulness": "1/1", "author": "alaskaboy"}, {"rating": 5.0, "review": "Very easy set up,works great", "verified": true, "helpfulness": "0/0", "author": "Brenda B."}]