[{"rating": 5.0, "review": "Far better quality than having had the Chromecast....WELL WORTH IT and customizable too!!", "verified": true, "helpfulness": "0/0", "author": "Cj"}, {"rating": 3.0, "review": "When it can stay connected to the wifi network, the Fire TV stick works great.", "verified": true, "helpfulness": "0/0", "author": "Lindsey deMont"}, {"rating": 1.0, "review": "as advertised. Beware of Amazon prime \"free trial\".", "verified": true, "helpfulness": "1/1", "author": "ramon de santiago"}, {"rating": 4.0, "review": "Perfect now I can see my dodger games....👍👍👍", "verified": true, "helpfulness": "0/1", "author": "jaime"}, {"rating": 5.0, "review": "Works great and performs very quickly. Met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Dt"}, {"rating": 5.0, "review": "So far so good, still learning but I like it. I watch a lot of Vevo videos and Youtube show.", "verified": true, "helpfulness": "0/0", "author": "pixmakerdave"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "will rhodes"}, {"rating": 5.0, "review": "I installed the Amazon fire TV stick, and it was up and running in two minutes. Its a easy product to install and use. I have Fire TV on my main television and decided to try the stick for my second. I am a Prime member and am pleased with the streaming options at these affordable prices. Other than no voice search, no real noticeable difference. Great Job!!", "verified": true, "helpfulness": "0/0", "author": "Shari"}, {"rating": 3.0, "review": "Is the content on this device available in my region (Trinidad). I bought a Roku in a store in Miami and the sales representative never informed me that it would not function outside of America.", "verified": false, "helpfulness": "0/1", "author": "Finemiche"}, {"rating": 4.0, "review": "Love it but the only problem is most of the apps don't support xfinity so I have limited access. The device is easy to use and set up love it", "verified": true, "helpfulness": "0/0", "author": "Latonia mayweather"}]