[{"rating": 4.0, "review": "The remote had difficulty connecting to the device. I had to call Amazon customer service for them to reconfigure it before I could get it to work. That was an annoying time waster.", "verified": true, "helpfulness": "0/0", "author": "Mitzi"}, {"rating": 5.0, "review": "we enjoy the portability and the ease of use of amazon prime.  with summer being so busy haven't used much but are looking forward to it.", "verified": true, "helpfulness": "0/0", "author": "Margaret Streb"}, {"rating": 4.0, "review": "It's fast loading and easy to use. I would give it 5 stars if it had a remote you could type with like our smart tv.", "verified": true, "helpfulness": "0/0", "author": "Shann"}, {"rating": 5.0, "review": "The fire-stick works great. I just wish there was a way to hide any content that you have to pay for.", "verified": true, "helpfulness": "0/0", "author": "Thomas Small"}, {"rating": 5.0, "review": "We LOVE it!!!!  This replaced a Vizio box and has a lot more choices and is so much easier to use.  I had to have someone set up the Vizio (we aren't techies) but I was able to set up and figure out how to use the Stick in less than 30 minutes.  With my Amazon Prime we will probably get rid of cable.  Yay!!!", "verified": true, "helpfulness": "0/0", "author": "Terri Haldeman"}, {"rating": 5.0, "review": "This was so easy!  I was watching shows  in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Theresa C. O'Brien"}, {"rating": 4.0, "review": "i am not a very technical person however this stick was amazing.", "verified": true, "helpfulness": "0/0", "author": "donna"}, {"rating": 5.0, "review": "Outstanding option to being slaves to cable. Coupled with an HD antenna, you can serve most viewing needs in my opinion, especially for those stuck working away from home and in an apartment for an extended period. No termination fee!Program choices are good, 1080p is sufficient; Firestick is a great value buy.", "verified": true, "helpfulness": "0/0", "author": "SalvageDiver"}, {"rating": 5.0, "review": "I LOVE THE FIRE STICK!!!This loads up FAST!  It also is so completely user friendly- even my mother in law that can't use her Roku was able to use this without any trouble!Simple easy to use remote!I took it to my hotel last weekend, hooked up to their wifi and watched what I wanted!  Hooray for easy TV!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Vanderkleed"}, {"rating": 5.0, "review": "It's wonderful, absolutely delivers everything it promises.  Great price and I love it.", "verified": true, "helpfulness": "0/0", "author": "Colleen5991"}]