[{"rating": 4.0, "review": "cord cutting is fun. amazon prime slingtv and Netflix all you can watch buffet", "verified": true, "helpfulness": "0/0", "author": "john a mcphail jr"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is amazing... I'm feeling more and more confident to cut the cord. It has easily integrated apps and streaming video content into my non smart tvs and is actually faster than my xbox 360 at loading netflix. I am impressed with the easy start up and only problem I could possibly see is how long it takes to input email addresses/passwords into the many apps.I've bought 2 already and will probably buy one more!", "verified": true, "helpfulness": "0/0", "author": "Charles B."}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "t.manganello"}, {"rating": 4.0, "review": "Although I purchased the Amazon fire stick at a local best buy store, I absolutely love it! I thought about purchasing it through Amazon, but I wanted to avoid the shipping cost. The reviews definitely helped in making my decision. I couldn't decide between the google chrome, fire stick, or Zoku. I think I made the right choice! I'm loving it so far.", "verified": true, "helpfulness": "0/0", "author": "Nicole Glasper"}, {"rating": 3.0, "review": "just okay", "verified": true, "helpfulness": "0/0", "author": "BILL"}, {"rating": 5.0, "review": "Amazing to have prime movies on my tv!", "verified": true, "helpfulness": "0/0", "author": "Kell"}, {"rating": 5.0, "review": "Love it! Not sure why more people don't drop cable & pick up apps like Sling TV, MLB, NFL, and the streaming TV & movies through Amazon. Couldn't be more happy.", "verified": true, "helpfulness": "0/0", "author": "brandon naasz"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Julio Rojas"}, {"rating": 5.0, "review": "With the exception that the center button sometimes pushes to easily, causing a double-click, my Fire Stick is working exactly as it should. Plugged it in and was on Netflix in no time. I love that it came logged into my account so my (Prime) watchlist is already there as well.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth A. Bradshaw"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Javier Barreto"}]