[{"rating": 5.0, "review": "Gravest device!  It does have an ability to mirror from your device, but I've not tried that yet. I'm not sure why I didn't buy it sooner!  If you're a Prime member this is a must have device!  The performance is really fast most of the time!  Also, this is super entertaining for the kids!!!", "verified": true, "helpfulness": "0/0", "author": "Yachky"}, {"rating": 5.0, "review": "Works like a charm,  we are very pleased with it!", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 2.0, "review": "Streaming was very glitchy, even with a good connection to a N300 router. The interface was a bit unintuitive as well. I prefer our Roku Stick quite a bit more, as well as our old Sony SMP-N200.", "verified": true, "helpfulness": "0/2", "author": "DJ Schmidi"}, {"rating": 5.0, "review": "Fire Stick worked great as a mobile streaming device when I used it during a recent vacation hotel stay. I know before when I tried the stick at a hotel it didn't work due to the need for a hotel wifi log in step. However now when you turn it on and access a wifi signal, up comes the hotel's wifi log on screen. Worked great, highly portable and gives you much more flexible and economical choice for the kids to watch something without forking over huge pay per view fees. Hotel TV does of course need to have an HDMI input but that is fairly standard in most of the major chain hotels.", "verified": true, "helpfulness": "2/2", "author": "mt 29"}, {"rating": 5.0, "review": "Made life easier !", "verified": true, "helpfulness": "0/0", "author": "Molly"}, {"rating": 4.0, "review": "So far I really like it,but the lack of an official youtube and others apps  is the reason I don't give the 5 stars", "verified": true, "helpfulness": "1/2", "author": "Juan F. Moran \"frankcyzko\""}, {"rating": 5.0, "review": "Love the Fire TV Stick so much I canceled my Direct TV. No more TV bills for lots of channels with nothing on.Now I can watch anything I want anytime I want . I bought one for each TV. I've had it for months and \"no complaints\"", "verified": true, "helpfulness": "1/1", "author": "Bradford   Jones"}, {"rating": 5.0, "review": "Can I give this thing more than 5 stars !?", "verified": true, "helpfulness": "0/0", "author": "Kimberly M."}, {"rating": 1.0, "review": "Please don't be fooled by Amazon saying watch over 200.000 episodes on netflex HBO go, showtime, hulu plus and a like, you have to pay extra for watching episodes on their servicesservices, there is no free movies, no blockbusters, no new releases,  nothing, even to watch Amazon videos the one has to be Amazon prime member, you can downloaded some preinstalled movie apps but even they don't have newest movies, just some old movies, you probobly seen already and you can't download much, first of all it's just 8gb stick so the space  is very limited  and the stick has no amazon app store so you really cant chose what you want to download, yes the stick is fast and probobly the fastest of all other similar products but you cant take it to your advantage since there is nothing to watch unless you are prime member or paying for netflix or hbo go, i wouldnt advice you to spend $39 plus tax unless you just want to watch youtube videos and old movies, otherwise go with google chromcast witch is sold just under $20 on some online stores, sorry amazon", "verified": true, "helpfulness": "0/2", "author": "Viktor Vorobyev \"viktorsparrow\""}, {"rating": 5.0, "review": "I love how it works similar to the netflix format. Super user friendly", "verified": true, "helpfulness": "0/0", "author": "April Yates \"April\""}]