[{"rating": 5.0, "review": "Great product - loving it so far!!! Interface is easy and great extras!!!", "verified": true, "helpfulness": "0/0", "author": "tszuch"}, {"rating": 4.0, "review": "Getting it set up was a bit of a pain.  We bought this to use in our bedroom, but when we tried to set it up it started with an automatic update but had trouble connecting to the wi-fi to accomplish said update.  We checked our roku to see if it wasn't a problem with the wi-fi but that worked fine.  We ended up taking it downstairs to our family TV which is right next to our router and it was able to accomplish the update, though it took quite a while.  Once that was all done we took it back to our room and it has been working great ever since.  We have no trouble streaming from it...we primarily use it for Amazon prime, Netflix, and Pandora.  I would recommend the Fire TV Stick, just watch out for that first update (and we'll have to see how it goes with any subsequent updates).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great - I am a Prime Member so this is ideal for our household.", "verified": true, "helpfulness": "0/0", "author": "Aunt Barbara"}, {"rating": 3.0, "review": "Despite being advertised as the most powerful \"stick\" out there, it stills feels sluggish and unresponsive at times. I could see this product being more worthwhile in the future, seeing as at the moment, there are very few supported apps. Pushing content to the stick itself is easy enough, although it usually just bugs out or sits there. Thankfully, the main reason why I purchased this was to stream Netflix on a non-smart TV. It accomplishes that well enough. Perhaps the next iteration will be a bit snappier and have more supported applications and features. As it stands, it's just okay.", "verified": true, "helpfulness": "0/0", "author": "Jacob Reed"}, {"rating": 1.0, "review": "tl;dr: Very pretty menus, crippled by Hollywood DRM, rushed to market for Christmas and before all the bugs have been fixed.  Wait 6 months, it will probably be great.HDCP unauthorised. Content disabled. That on a blue screen is the only thing displayed now.  It worked great the first day.  On the second day I got the Amazon Blue Screen of Death.  After resetting the device several times it started working again.  Day 3, no amount of resets will fix the error. The stick is plugged directly into the HDMI port of the my fairly new (2012 Vizio E70a3) and powered by the included wall wart.Performance of the remote i painful and annoying. button presses often stall or get missed, only to have the remote start randomly jumping around.Network performance is scattered.  It often has to be running for 5 minutes before it will connect to my 5Ghz (ac, low interference). The WiFi router is only 5 feet away from the stick.Overall the device is immature beyond being crippled by Hollywood DRM. It was obviously rushed to market ahead of Christmas. It looks pretty and hopefully the software will get fixed and it will be useful sometime next year.", "verified": true, "helpfulness": "3/3", "author": "Chris Pugrud"}, {"rating": 5.0, "review": "This does everything its supposed to do and more. Its amazing how much functionality could be packed into one little stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So this is really interesting. I've never written a review as long as the one I'm about to write but I was nervous about ordering this and was pleasantly surprised! dA little back story: We recently cancelled our cable because it was getting to be stupid expensive, plus we have Hulu Plus and Netflix. Then I got an email saying the Fire TV Stick was on sale for $19 if you preordered it. Umm, done. We ordered two, didn't know where were going to put the second one or if we were going to give it as a gift, but for that price we knew we needed 2.So we actually forgot about it because we ordered it about a month before it's release, so when it came we were really excited. It took all of 5 minutes to hook up to our tv and 4 of those minutes were reading the directions. It could not be easier, you literally just plug it in your HDMI outlet and into the wall for power. So easy. Took a minute to hook up to the internet but most of our devices have trouble finding our wifi, not sure why. Once we got it hooked up we just started messing around with it to see what it could do.There are all kinds of apps you can download, plus a ton of shows that come with Prime Instant Video that you can watch for free. There are also games, music apps, you can load pictures onto it (there is a screensaver type feature when you aren't using it). It's really neat. I haven't looked into the game apps as much because I'm just not a gamer, but it does not look like there were that many free game apps. Almost all the video and music apps are free. So basically, this gives you the features of a smart tv for a whole lot less money. I do wish the remote was a tad bit bigger because I'm constantly losing it in my bed, it's about 4 inches tall and 2 inches wide, but that wasn't worth losing a star. I love this thing.", "verified": true, "helpfulness": "0/0", "author": "Marlo"}, {"rating": 4.0, "review": "Great product. Processing speed can be slightly choppy sometimes but not enough to ruin your experience.  Needs more native app support.", "verified": true, "helpfulness": "0/0", "author": "Jeramy Nunn"}, {"rating": 2.0, "review": "When it works, it is great! It loads quickly and has fantastic video quality, even with a slow. However, I have to do a hard reset every day, sometimes two or three times a day. For some reason, it loses connection to the internet. I have tried reconnecting through the system settings but that does not work. The only way to reconnect is a hard reset.", "verified": false, "helpfulness": "0/0", "author": "Ricky"}, {"rating": 2.0, "review": "I bought this as an alternative to Roku. I manage my in-home media with Plex Media Server, and the FireTV Stick and Roku both support the Plex app. HOWEVER - the app version on the FireTV Stock is so many generations behind that it is unusable, and unless I can get that fixed I'll be returning the FireTV Stick", "verified": true, "helpfulness": "0/0", "author": "Scopeman"}]