[{"rating": 4.0, "review": "The fire stick work well. unfortunatelyit didn't use all apps", "verified": true, "helpfulness": "0/0", "author": "MELVIN PARKES"}, {"rating": 5.0, "review": "Love the fire stick, much better than cromecast", "verified": true, "helpfulness": "0/0", "author": "Ty Houseman"}, {"rating": 4.0, "review": "The only reason I cannot give it 5 stars is that it is not quite as amazing as the FireTV that I also own. It does not have the lightning fast quick-play capabilities that the FireTV has for prime instant-video, and the default remote does not support voice search. Since I got this at initial offering for $20, I decided to add in a voice search remote like the one that comes with the FireTV. In the end that makes the remote almost twice as expensive as the FireTV Stick. Overall, just as many features as the FireTV, just in a smaller and way less expensive form factor. The only other thing to note is that most TVs (especially older ones) do not put out the ~1amp via their USB console port that the FireTV Stick requires, so even though some people claim they can run the FireTV Stick via the USB console port, don't count on it. You will most likely need to plug the stick into the provided USB AC adapter.", "verified": true, "helpfulness": "0/0", "author": "J Crosier \"JC\""}, {"rating": 4.0, "review": "Works pretty well. Easier to navigate than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Pete VG"}, {"rating": 5.0, "review": "My wife loves it!It is now her go to device. We have a Chrome Stick, Roku and Samsung dongle and she will only use the Fire Stick now.Great product, simple to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Working hard in California\""}, {"rating": 5.0, "review": "Works, plays amazon prime movies and tv shows. Haven't used it for games or anything else.", "verified": true, "helpfulness": "0/0", "author": "Damian S."}, {"rating": 2.0, "review": "Love how none of the pictures show it with a power cord. I specifically bought this to replace my Roku which is a hassle because of the cords. I guess this one is at least only one cord... And I will say that the interface is much faster than the Roku.", "verified": true, "helpfulness": "0/0", "author": "mlcnl"}, {"rating": 4.0, "review": "So far excellent....except for one thing:So i recieved my Fire TV stick 2 days early and set it up right away. The interface is fast and seamless. My TV is already a smart tv but I prefer the stick over the smart because it is way faster; loading, responding; etc.The only gripes would be that it forgot my Netflix information and I had to enter it all over again. thankfully the android app has a keyboard making this a lot easier. The second gripe would be that the Apple apps arent out yet.Other than that the Prime streaming content and the performance are better than expected from a device that I can put in my pocket.:)", "verified": true, "helpfulness": "0/0", "author": "Angus \"dj_fubarius\""}, {"rating": 5.0, "review": "Connectivity is great. Easy to set up and navigate through... 6 stars", "verified": true, "helpfulness": "0/0", "author": "Ballistic"}, {"rating": 5.0, "review": "Love it so easy to use and the stick is fast.", "verified": true, "helpfulness": "0/0", "author": "Daniel Paniagua"}]