[{"rating": 5.0, "review": "Love it. Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "JoAnn F"}, {"rating": 1.0, "review": "This is the worst media player I have ever used it is always freezing up and never staying connected  to the Internet when all other devices work fine.", "verified": true, "helpfulness": "0/0", "author": "Zachery and Kayla Westfall"}, {"rating": 5.0, "review": "I like having so many movies and TV shows available.  I also like that I can play my songs that I downloaded onto my phone through the free Amazon music", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 1.0, "review": "doesnt connect well to Wi-Fi.  keeps buffering during show.  had cable company come out...so not their problem.  had better connection with a Blu-ray device.  not very happy.", "verified": true, "helpfulness": "0/0", "author": "maridal"}, {"rating": 3.0, "review": "It is ok... Yet another mediocre android device.", "verified": true, "helpfulness": "0/0", "author": "venkata narasimha venugopal"}, {"rating": 4.0, "review": "Worse thing is you have to unplug device to turn off.  This why batteries for the remote dont last over a few days.  #Goingbrokeon batteries! How can you guys not make this a option?", "verified": true, "helpfulness": "0/0", "author": "brandon"}, {"rating": 5.0, "review": "I have several fire TV boxes and the stick works great also. Great quality so far and fast streaming.", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Price Jr."}, {"rating": 5.0, "review": "Love, love love.....Pros - all your extra stuff is together if you do not have a smart tv (hulu, amazon, Netflix, etc) Cons - I have to have it on a separate hdmi channel then cable and I lost the actuall TV's remote, lol", "verified": true, "helpfulness": "0/0", "author": "Tonia Dwyer"}, {"rating": 5.0, "review": "Love it. Setup was very easy. I was able to use it in a room where we have trouble getting wifi reception, but we had no connectivity problems with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Stacy Williams"}, {"rating": 4.0, "review": "great choices and MY schedule", "verified": true, "helpfulness": "0/0", "author": "Michael"}]