[{"rating": 4.0, "review": "This is the third FireTV option in my house. Instead of a full FireTV, we decided to have something more portable for when we travel. The only downside is when you leave the remote at home and cannot connect to a wifi network to allow for the use of the mobile-app. Sure wish there was some localized Bluetooth (connect using this code) or other method (setup ahead of time to allow it to connect to local wifi from your device that can be done via amazon.com setting). I've forgotten the remote twice, and only once was I able to drive and retrieve it. Hate having a device that I can't use because the remove isn't there.", "verified": true, "helpfulness": "0/1", "author": "John E. Simpson"}, {"rating": 1.0, "review": "Slower than streaming via the TV wifi.", "verified": true, "helpfulness": "0/2", "author": "Rakshashi \"Rakshashi\""}, {"rating": 5.0, "review": "Completely awesome", "verified": true, "helpfulness": "0/1", "author": "justin little"}, {"rating": 5.0, "review": "Love love love this I use it everyday so easy to navigate", "verified": true, "helpfulness": "0/1", "author": "tymika"}, {"rating": 5.0, "review": "This is a great device for a great price! Love being able to use my Amazon prime instant video on my big screen TV. LOVE this! LOVE Amazon!", "verified": true, "helpfulness": "0/1", "author": "Vanessa"}, {"rating": 4.0, "review": "Everything I need or like to watch, great picture and sound without the high cost of cable.  Well worth the investment.", "verified": true, "helpfulness": "0/1", "author": "Debbie Steiner"}, {"rating": 2.0, "review": "Uh...not really what I thought it was going to be.  I don't get any more features than I already get with my TV package.  I was hoping this would unlock some content such as Showtime or specific shows, but it didn't.  And some of the content you still have to pay for even though I'm a Prime member.  My smart TV came with an Amazon \"App\" and it does just as much, without paying money for the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Lee Nicol"}, {"rating": 5.0, "review": "It's a great device!!!!", "verified": true, "helpfulness": "0/1", "author": "leobaldo"}, {"rating": 3.0, "review": "Overall, I'm a big fan of the speed and capability. Only thing I hate and that really detracts from the experience is that you cannot cast from non-Amazon computer devices. Really puts it behind ChromeCast from my experience.", "verified": true, "helpfulness": "0/1", "author": "Daniella Corcuera"}, {"rating": 5.0, "review": "I used chromecast and apple tv and by far the best out the three. Easy navigation. and a lot of apps can be added.HEADS UP IF YOU TIE YOU PRIME/AMAZON ACCOUNT TO DEVICE BE CAREFUL NOT ALL TV SHOWS ARE FREE!!!! I LIVE WITH MORONS... Love them thou", "verified": true, "helpfulness": "0/1", "author": "Gerald"}]