[{"rating": 2.0, "review": "I thought it would be better than what it is. I got it thinking I could watch HBO and other shows because I'm a prime member but it says I have to pay so I'm not very happy with that", "verified": true, "helpfulness": "0/1", "author": "Crystal Michelle Santoyo Cardona"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "danny kline"}, {"rating": 4.0, "review": "Quality an quantity of watchable programming is great!! So easy to use an install.  As expected a rental cost is involved for some programs/movies. One thing I found to be an excellent pro is the volume.  It's not like on DVD rentals. The sound quality is perfect if not better, what your TV puts out is what you get. You can rent a movie an actually hear it without having to adjust the volume.", "verified": true, "helpfulness": "0/0", "author": "CHICANDACE"}, {"rating": 5.0, "review": "Love me fire tv stick. It was super easy to get set up but it all also doesn't have to wait for your phone or tablet to get started. It's really nice", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Jerome T Jardiniano"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Elayne Hassen"}, {"rating": 5.0, "review": "Works great", "verified": false, "helpfulness": "0/0", "author": "Christoper Piehler"}, {"rating": 2.0, "review": "I could not access the feature because of my current geographical location...", "verified": true, "helpfulness": "0/1", "author": "ADESH LUTCHMAN"}, {"rating": 5.0, "review": "YES. I had a Google Chromecast. Why didn't I look at this first.My family love it. So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ray Hall Jr."}, {"rating": 5.0, "review": "Very, very nearly perfect little device. I elected to pick one of these up to use when traveling. Pretty much every hotel in the U.S. Now has TVs with HDMI ports and being able to plug this in is a boon to watch NetFlix or Hulu or Amazon Prime etc.The only thing that needs looking at is the way it connects to WIFi networks that display a web page to login. This is a bit finicky and needs a software update. Streaming is fast, the included remote is excellent and the iOS app is pretty neat. I like the fact it has an HDMI extender cable included. The included power brick is small and the USB cable long enough to be useful.", "verified": true, "helpfulness": "0/0", "author": "J. Williams \"genuine, bona fide, geek\""}]