[{"rating": 3.0, "review": "I like it, but wish it had bluetooth keyboard and mouse/touchpad support.  I don't want to have to use a smart phone or tablet to type or move.", "verified": true, "helpfulness": "0/0", "author": "Opus"}, {"rating": 4.0, "review": "Kids love it...", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Same as APPLE TV  SOFTWARE MAY NOT BETTER BUT I ENJOY AMAZON. MOVIES/ BOOKS AS A PRIME MEMBER", "verified": true, "helpfulness": "0/0", "author": "TONI.N"}, {"rating": 5.0, "review": "Worked well, was easy to setup. Bought it as a gift for my girfriends parents who are less than tech savy, and this unit will be perfect for them. It's a no brainer to hook up, fun to use and interface is smooth as silk. I'm thinking I may want one myself!", "verified": false, "helpfulness": "0/0", "author": "Kevin K"}, {"rating": 5.0, "review": "I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "n"}, {"rating": 5.0, "review": "Best thing since white bread. Works great. Setup very easy. None of the problems mentioned in other reviews.", "verified": true, "helpfulness": "0/0", "author": "Ralph King"}, {"rating": 2.0, "review": "Bought the Fire TV Stick from Best Buy as it was selling $15 cheaper than at Amazon. Figure THAT one!It installed easily but was a big disappointment as it kept losing signal and taking forever to load. Took it back the next day.", "verified": true, "helpfulness": "1/2", "author": "Bob Platt"}, {"rating": 5.0, "review": "This is amazing!  I highly recommend it.  You don't have to get up and put a disc in.  You don't have to remember to record a movie you want to watch and you definitely don't have to put up with commercials and poor editing.  You can start to watch a movie or show and finish watching it later.  Streaming is the way to go.  You're not restricted to which discs came in the mail, what movies the channels are playing (always the same 4 over and over again) or what time they start.", "verified": true, "helpfulness": "0/0", "author": "Leilani Phillips \"Towergypsy\""}, {"rating": 2.0, "review": "Gave the Fire Stick 2 stars because setup and use (navigating menus) of the stick is very easy and straight forward.  Other than that its a disappointment to use. My TV and hence the Stick, is within 10 feet of my router and my internet connection is cable. While trying to view some trailers and watch a program the Fire Stick constantly had to buffer content. It did this about every 30 seconds or so and then began to pop up a message that my connection was too slow. To test the connection I streamed the same content through my Ps3 and iPad with no problems. Being this is the first generation of the stick it may have some issues that need to be corrected, so I may try one again in the future.", "verified": true, "helpfulness": "1/2", "author": "Ed A"}, {"rating": 5.0, "review": "Works great, I can move it from room to room, to different TV's and never have to worry about setting it up on each individual one. I can even take it with me when I travel, which is not as easy with my Roku, which is quite a bit bigger.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]