[{"rating": 4.0, "review": "Everything about the fire stick is perfect...except it's not. First, it can only mirror video from amazon fire devices. Also there is no HBO app for the fire stick -- big down side. There are other features/apps lacking. I won't go into detail because people want different things out of a streaming device. The apple TV is a lot better, but the price of the fire stick is good. So either plan on buying the fire stick first and and apple tv later or go ahead and get an apple tv now.", "verified": true, "helpfulness": "1/2", "author": "Kimberly Huey"}, {"rating": 5.0, "review": "This is a very great product! Simple to use and operate. I have attempted to use other products (cables, etc.,) using my phone to complete the same thing as this device and it has cost me more.There are 2 complaints that I have.1.) It's another cable that I have to hide because it requires you to either use the USB or an outlet to operate.2.) IOS compatible...not yet... C'mon Jeff Bezos! Hurry up...I recommend that you use the HDMI extenderOther than that, I really love this product!", "verified": true, "helpfulness": "2/2", "author": "y12srt \"y12srt\""}, {"rating": 1.0, "review": "Fired up the stick, loved the content layout. Loaded the Hulu app and fired up a show - btw, I am a subscriber. Show started with a commercial, oh joy! Commercial came in beautifully. Then the show started and I get this blue screen saying, HDCP unauthorised. content disabled (yes, I spelled unauthorised as the screen displayed). Audio came through fine. Got on chat with amazon's helpdesk while letting the show continue to play. Time for a commercial, video came up beautifully! Watched the commercial, then the show started with the blue screen again. I tried my amazon prime account to play something, same results.BTW - amazon chat was clueless. My issue was esculated to engineering. I think that means I might hear something in 6 months? IDK - very disappointing in amazon's new technology. This was to be a test to see if I wanted to go for the full Fire TV, thinking not now. We'll see if they EVER respond to my issue, but I'm not holding my breath.One other thing - google the error message - this is not a \"unique\" issue. Amazon should have done a better job at beta testing. Fail. Good thing I still have my Chromecast. ;-)2/27/2015: No feedback from Amazon's Tech Support. Zero. Nada.", "verified": true, "helpfulness": "33/38", "author": "Murph \"Not zucchini, fettuccini, or bulger wheat, but a big warm bun and a huge hunk of meat.\""}, {"rating": 2.0, "review": "Interface leaves a lot to be desired, I like the Roku interface much better. Netflix plays ok but Amazon prime has a need to buffer frequently as does Youtube . Buffering may be due to my ISP, but Amazon Prime movies do very little buffering with my Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Kevin L. Pottorff \"retired\""}, {"rating": 3.0, "review": "It worked really well when I first set it up. I use it for Netflx, Prime Video and WatchEspn. Slowly after using it for about a couple of weeks it began to freeze up when use, but I would just unplug it from the tv and power and replugin. After then about another week it stopped connecting to the internet. Now it basically is unable to do anything.The worst about the Fire TV stick is the stupid video they force you to watch when setting up. This device is great because even stupid people should be able to use this device without watching a video teaching you how to use it.", "verified": true, "helpfulness": "0/0", "author": "nazman"}, {"rating": 5.0, "review": "I have several Rokus ranging from old low-end ones to the latest Roku 3 around the house and have highly recommended them to all my family and friends for years.  I also have 2 chromecasts.  I also tried, and returned, the Roku speedstick.  The Firestick is the best on the market so far.  It it way, way faster than anything else.  No buffering at all most of the time, and very short buffering the rest of the time.  I don't have real fast internet (<3mbps) so buffering is always a problem especially if trying to watch in HD.  With ASAP built into the Firestick, it learns what you watch and pre-buffers stuff.  The startup time is phenomenal and the screensaver pictures are fantastic.  Everything about it works perfectly and I would now recommend these over the Roku.  The only two things Roku has going for it over these units is 1. you have more channel options (I only watch Netflix and Amazon movies) and 2. you have a USB input option on the Roku 3 and the Roku 2 in case you want to run a flash drive or hard drive with pictures or movies on them (but you can also use the Plex channel on the Roku or the Firesticks to play them from your computer).The Chromecast sticks are very limited in what they can do, and they have no remote control.  They are good for one thing, streaming a website off your computer, and even then, without a remote control, they are not user friendly.  This is the streaming tool you should buy.", "verified": true, "helpfulness": "0/0", "author": "Spydie"}, {"rating": 4.0, "review": "Purchased the Fire Stick at the promotional price for Prime Members, so this really made it a great deal.  The fire stick was easy to setup and does make it easier for me to access my online content (primarily Amazon Prime and Netflix) via my TV.One neat feature that I was pleasantly amused by was when you play music (from Amazon) on your Fire Stick it provides you with the Lyrics to the song... just like a karaoke machine :)The major issue that I've had with the Fire Stick is the lag and sometimes glitchy interface.  I've had to reset the fire stick a couple of times because it became unresponsive.  Minus 1 star for this.", "verified": true, "helpfulness": "1/1", "author": "Mahalo Amazon!"}, {"rating": 1.0, "review": "It was advertised as providing the ability to mirror the display of Kindle devices. After I purchased and installed it, and it did not work, I found out (after a lot of useless work and research) it only mirrors displays for some Kindle devices. Even though my KindleFire HD is less than a year old, it's not one of them. I did not buy it for video streaming so I should return it, but it's not worth the hassle.", "verified": true, "helpfulness": "2/2", "author": "gene connolly"}, {"rating": 4.0, "review": "I was so excited. My rural area has only recently acquired DSL fast enough to stream and I had caught the first day bargain price for the FireTV stick. I had no problem setting it up. But then it said it needed to download updates and the !&)? thing would not stay connected for the download. The directions to try unplugging it did nothing. So first day reaction : total disappointment. The next day, after Amazon customer support replied that I would have to call for help,  I sought advice from other owners and saw how many people were having the same problem. So I moved the TV as close to the router as possible and read a book while I restarted the connection over and over again until it finally stayed connected. It's almost like it was getting a busy signal from the server until it finally snagged an open slot. It took about 1.5 hours on slow DSL to complete the download. Then I found out that all those apps they tout?  Each one has to be downloaded separately. So day 2 -- still not finished setting up. Today, day 3 -- I finished getting my favorite apps -- PBS, history channel, etc, moved tv back to where it lives and had no signal problems there. The only small disappointment was finding that I couldn't access the amazon prime music channels that I've been enjoying on my Fire. Prime music, yes, playlists, yes -- but not the channels -- at least not that I can find.So after too much effort and a lot of frustration, I'm actually happy with the final result. If you have a lot of patience, it's a great deal.", "verified": true, "helpfulness": "2/2", "author": "O. McIntyre"}, {"rating": 5.0, "review": "I love it! It gives me such variety in the choices I have to watch on my TV. I am amazed that I can use my smart phone and tablet as the remote. What will you think of next. I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Deborah Speiser"}]