[{"rating": 4.0, "review": "It works great but if I am not near my wifi box it does not load and is extremely slow. Other than that I love it!", "verified": true, "helpfulness": "1/1", "author": "Elaine"}, {"rating": 4.0, "review": "Bought this when it was on sale for 19.99 to put on my son's tvHe loves it and is able to work it just fine to find what he needsI have a Apple TV and Roku 1, this stick is faster than the Roku but I still prefer my Apple TV for primary useIt is good for what it is and the remote is a bonusNot sure I would go with this over a Roku stick for regular price since Roku has more apps but if you use the bare minimum then this works great", "verified": true, "helpfulness": "0/0", "author": "KAllen"}, {"rating": 5.0, "review": "love love love this! i can now cut my cable, i am an amazon prime subscriber. love the quality and works very well.", "verified": true, "helpfulness": "0/0", "author": "ROSE TREVINO"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "maude ann mannella"}, {"rating": 5.0, "review": "Smarten up a non smart TV. Glad we invested in it", "verified": true, "helpfulness": "0/0", "author": "Vern"}, {"rating": 5.0, "review": "Love this! The remote is especially nice and easy to use. The Firestick has a very smooth and user friendly interface. Glad we bought this. We may be buying another one for a second TV.", "verified": true, "helpfulness": "0/0", "author": "R. Winch"}, {"rating": 5.0, "review": "This is fantastic! We ate saving a lot on our cable bill with using firestick. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "needing information on the fire tv stick what kind of internet do you have to have for it to work? we have hughes net satilite internet would that work good with this?", "verified": false, "helpfulness": "1/3", "author": "charlene pittman"}, {"rating": 3.0, "review": "I bought this product when it was a special price. If you do not have another product to compare it to you would like it . I have a roku and I prefer the roku. I just feel that amazon attempt to direct the user to amazon products. If I did not have the roku I would satisfied with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Den"}, {"rating": 5.0, "review": "I bought  Chrome Cast and hate it. I replaced it with the Fire Stick and  that is the best thing I could have done. Easy to use and lots of options come with it.  I'm returning The Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Robert Arsenault"}]