[{"rating": 5.0, "review": "Works as advertised!  Well worth the investment.  I'm accessing Netflix much more than in the past as a result.", "verified": true, "helpfulness": "0/0", "author": "Gary Jong"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Cheryl thunberg"}, {"rating": 4.0, "review": "Very responsive and abled device. I am pleasantly surprised at this little unit as I also have a Roku and Apple TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Cesar A. Nau"}, {"rating": 3.0, "review": "Fire stick works well. Movie rental fees are expensive.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "It works great and seems to load quickly.  Watched a few Netflix programs and it never paused to buffer the program.  My only complaint is with Amazon Prime.  I understand some of it is out Amazons control but some older shows on Prime still cost money to watch but on Netflix they are free, other than your monthly fee.  I paid for a year of Prime.  Like I said its my only complaint.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "bunyon"}, {"rating": 5.0, "review": "great easy to use service", "verified": true, "helpfulness": "0/0", "author": "M. Gillispie \"mdg\""}, {"rating": 5.0, "review": "The interface is a little clunky and takes one or two extra clicks to get to content compared to AppleTV.  But there is a ton of content available if you put some time in to dig through the available APs. Can't beat it for the price!", "verified": true, "helpfulness": "0/0", "author": "Wayne Welch"}, {"rating": 5.0, "review": "Great new tool for my tv!", "verified": true, "helpfulness": "0/0", "author": "Danny S"}, {"rating": 5.0, "review": "Works as advertised.Good Parts: The included cable adapter was really handy on a TV with an oddly placed HDMI port.Less Good: For a little stick, needing to attach the included power adapter was a surprise. They should be more forthcoming in the marketing.", "verified": true, "helpfulness": "0/0", "author": "Shawn Turner"}]