[{"rating": 5.0, "review": "Gets the job done and perfectly priced.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple set up, super results!", "verified": true, "helpfulness": "0/0", "author": "Gerrie Smith"}, {"rating": 1.0, "review": "I have been unable to use.  There is something wrong with this product.  Everytime I go to an app to watch it keeps rebooting in the middle of the programs/movies.  I tried everything and called and was guided by your technical support staff - nothing!  Now, I am waiting for a new one.  In the meantime I've read reviews where this is a universal problem with the apps and Amazon's fire stick.  Let's wait and see when I get the new one if it still does it.  If it does - I'm returning.", "verified": true, "helpfulness": "0/0", "author": "Mtanner \"CreamofLasVegas\""}, {"rating": 5.0, "review": "Set up was so easy. The whole family loves it.  I don't have a smart tv so this is lets us watch Prime Videos and netflix withiut having to upgrade the tv.", "verified": true, "helpfulness": "0/0", "author": "R. Ceron \"RC BronxNY\""}, {"rating": 5.0, "review": "Super easy to set up. Great content. Makes amazon prime a staple.", "verified": true, "helpfulness": "0/0", "author": "bigfeatherpen"}, {"rating": 5.0, "review": "So far I have been very pleased with the Fire Stick.  I am just tired of paying $70 a month for TV with 140 stations of which only about 8 or 10 are actually worth watching and several of those are iffy.  It is nice to sit down and watch a movie all the way through with no commercials breaking in every 10 minutes or so.", "verified": true, "helpfulness": "0/0", "author": "Desert Dor"}, {"rating": 3.0, "review": "It times out a lot, says lost signal and when you go to settings, says signal strong.", "verified": true, "helpfulness": "0/0", "author": "Diana L. Smith"}, {"rating": 5.0, "review": "Just what I needed, easy to use", "verified": true, "helpfulness": "0/0", "author": "rrhy"}, {"rating": 5.0, "review": "LIKE IT EASY TO USE", "verified": true, "helpfulness": "0/0", "author": "grace campbell"}, {"rating": 5.0, "review": "Easy to install and use", "verified": false, "helpfulness": "0/0", "author": "Cynthia Mazliach"}]