[{"rating": 1.0, "review": "This thing gets extreamly hot and freezes up all the time. What a wast of money", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Actually a lot better than I expected very impressed with fire stick, I went to target at first and bought the Roku stick they did not carry the fire stick, I was very disappointed with it, the roku would not hook up to my wireless, everything to do with it I had to go to the computer which was a pain I got frustrated took it back for a refund saw the firestick at bestbuy plus it was 10 dollars less than the roku, brought it home it took all of 3 minutes to hook up, almost everything you do straight on the tv, very simple, nice picture sound all in all excellent. Larry Jones", "verified": true, "helpfulness": "0/0", "author": "Larry Jones"}, {"rating": 4.0, "review": "This product has been great for us. We put it in our spare room so the kids can watch Netflix. They love it! No issues at all!", "verified": true, "helpfulness": "0/0", "author": "Myra D Darter"}, {"rating": 1.0, "review": "It wont connect to the wifi", "verified": true, "helpfulness": "0/1", "author": "fire tv stick hater :("}, {"rating": 1.0, "review": "This thing has major issues connecting to the internet.  DON'T PURCHASE", "verified": true, "helpfulness": "0/1", "author": "Romey1911"}, {"rating": 5.0, "review": "Great deal.", "verified": true, "helpfulness": "0/0", "author": "Madman"}, {"rating": 4.0, "review": "I expected some free channel and series, but most of the things I have to pay for it.", "verified": true, "helpfulness": "0/0", "author": "cgranados"}, {"rating": 5.0, "review": "I stay in a lot of hotels for work and leisure and after a work dinner listening to some blowhard in love with the sound of their voice, I want to unwind and watch something.  At home I use Netflix, Hulu, Xfinity On Demand and DVR where I can access a broad variety of shows on my schedule on a big screen.  In a hotel I can watch most of the same stuff easily on my relatively tiny laptop or tablet screen while the room’s 40-inch TV offers programs that either cost money or started 10 minutes ago and don’t have a pause button.  I can sometimes connect a cable from my laptop to the TV, but it needs to support either the VGA or HDMI cable that I have.  But mostly I can’t tolerate having to get my butt of the bed or couch without a remote.  I tried a few MiraCast adapters, which are basically cable replacements, but the video streaming was jerky and laggy.  So the advent of streaming sticks seemed to be perfect for me until I found out that my Chromecast and Roku can’t get past the hotel’s Wi-Fi validation screen.  I don’t know about AppleTV, but I’m not part of that ecosystem.  Then a few months ago the Amazon Fire TV Stick got a firmware upgrade that added a browser that gave it the ability to fill in the hotel’s web page to access their Wi-Fi and hallelujah, everything works the way I want it to and I can access everything I can at home except my DVR.  It also does MiraCast which lets me add a second screen to my laptop just like I do at home.Five Stars, I can’t recommend this product highly enough.  And did I mention that I got it for $20 with their introductory offer.  That’s half the other products’ price.  I wish I had bought the limit of 5 in hindsight.  I assume the others will add this feature (heck Chromecast begins with Chrome) but I’ll still stay with AmazonThere is still the problem of hotel Wi-Fi being slow, but that’s not something any stick can solve.  And finally I want to dig at Comcast for not supporting HBOGo.  Not relevant to this product, but it’s one of my many first world technology annoyances.", "verified": true, "helpfulness": "1/1", "author": "Kerry Ogata"}, {"rating": 4.0, "review": "It's a really cool little thing, sometimes I have issues with it connecting to the WiFi but I'm not sure if it's my signal or the stick", "verified": true, "helpfulness": "0/0", "author": "abraham leyva acosta"}, {"rating": 5.0, "review": "It was easy to install, and works well. Very simple to navigate.", "verified": true, "helpfulness": "0/0", "author": "khalil"}]