[{"rating": 4.0, "review": "We love it! I'd give it 5 stars but we do have an issue with it lagging at times.. Overall, we are very happy with this purchase", "verified": true, "helpfulness": "0/0", "author": "Marcella Campbell"}, {"rating": 3.0, "review": "The fire TV  was easy to install, but always use it with the extender. Without the extender the remote does not work properly. The main reason I got the fire TV was to watch cnn app and abc app. Both of them are available on Apple TV but not on fire TV. Other than that the product is average for the price. Good luck everyone!", "verified": true, "helpfulness": "0/0", "author": "Yordan Hristov"}, {"rating": 5.0, "review": "Best invention ever. ...love ...love...love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Awesome just needs a key board xD", "verified": true, "helpfulness": "0/0", "author": "Jdk"}, {"rating": 5.0, "review": "great if you don't have a smart TV; easy to install, easy to use.", "verified": true, "helpfulness": "0/0", "author": "WIT_writer-in-training"}, {"rating": 2.0, "review": "114.59 Mbps download speeds, less than ten feet away from the router, the Fire TV Stick buffers almost constantly. This is not a good product. Buy the Roku stick instead.http://www.speedtest.net/result/4524044994.png", "verified": true, "helpfulness": "0/0", "author": "VitaminAnarchy"}, {"rating": 1.0, "review": "save your money", "verified": true, "helpfulness": "0/2", "author": "Day"}, {"rating": 5.0, "review": "Excellent product. Worked easily and immediately.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really like the firestick! Incredibly easy to use, just plugged it in. Now I'm watching Amazon Prime shows and Netflix on my nice big TV instead of my computer. Thinking about getting a second one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Readerly"}, {"rating": 5.0, "review": "I love the Amazon Fire Stick! Was fortunate to get it at $19 prime member deal. Love the remote and remote app. Love the update that included the wifi login portal. Sometimes laggy, but I think that has something to do with the internet connection.", "verified": true, "helpfulness": "0/0", "author": "Treneicia"}]