[{"rating": 5.0, "review": "As a longtime user of the Roku line of devices, I was skeptical.  We had tried the Google Chromecast and had been underwhelmed.  Plus, we already had access to things like Netflix and Pandora through most of our televisions via other devices (e.g. game platforms or Tivos).However, the fire stick leaves them all in the dust.  The difference, really, is Amazon itself.  To have access to things like Prime Music, some of the game apps that I have downloaded to my Kindle, and all of the movies I have purchased in the past is amazing.  We have spotty access to all that Amazon offers us on various devices, but this is, hands down, the best all-inclusive Amazon device.It also does great with the other apps.  Things like Netflix and Pandora work as they should.  There are many other apps available to purchase, and lots available free.  As a Roku user, this was the real treat.  FREE games for my kids?  Yes, please.The only thing I miss is the motion-control remote, like our Rokus have.  This is a tiny issue and really only applicable for game-playing.I did get this with the special promotion Amazon had running a few months back, so I know I got it at a steal, but it's easily worth the regular asking price.  This *is* our new streaming device -- we will not buy any other incantation of the tiny black box!", "verified": true, "helpfulness": "0/0", "author": "Carlye G"}, {"rating": 5.0, "review": "This was easy to set up as promised!", "verified": true, "helpfulness": "0/0", "author": "bonbon55 \"Bonbon H.\""}, {"rating": 5.0, "review": "This is an amazing device, with fire TV you don't need a smart TV any more", "verified": true, "helpfulness": "0/0", "author": "Hamid Tofighi"}, {"rating": 2.0, "review": "Just being honest...  I picked one of these up because it was only $20.  I had hopes of it being able to free up a Chromecast that I use mostly with Plex.  Unfortunately, there are some clear disadvantages.1. The remote control is spotty.  There is random delay and hit/miss with button presses making it navigation error prone. - Just noting that I did use the extension cable and the external power to avoid interference.2. Not specifically against the Fire TV Stick, but the Plex interface is lacking and streaming via Plex has random pauses and disconnects.  I did try different profiles and settings and could get streaming to work with some videos, but it was not consistent with other videos.  With the Chromecast, it just works...  I read somewhere that the Fire TV Stick has a 20 Mbps video bitrate limitation.3. The Fire TV did a couple of updates and I found it annoying after each update I had to enter in user specific information, including Wifi details.In the end, if the idea of this device is to compete with the Chromecast and enable Amazon Video access, I would be more likely to use an Amazon video app on a tablet and stream to a Chromecast (if it were available) then deal with the Fire TV Stick experience.", "verified": true, "helpfulness": "0/0", "author": "S. Walton"}, {"rating": 5.0, "review": "Love the Fire TV Stick!  Does everything as described, easy to install, easy to use.  Installed the remote controller on my Kindle and that works great!", "verified": true, "helpfulness": "0/0", "author": "Christine Bowser"}, {"rating": 5.0, "review": "Works great and packaging was well done.", "verified": true, "helpfulness": "0/0", "author": "JAWC"}, {"rating": 2.0, "review": "Thought it came with Plex, but the app is $5 extra. Also, if you don't have Prime, it's not super useful. Apple TV and Google Chromecast are better.", "verified": true, "helpfulness": "1/2", "author": "Fake Name"}, {"rating": 5.0, "review": "A terrific buy, got it for the kitchen since we have a roku player on the main TV. This works great. We can pick our favorite show or movie fromAmazon Prime, Netflix or play music with Pandora. We use the kindle app as a remote so that we can use voice commands. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Tom C. 2013 \"Tom C.\""}, {"rating": 3.0, "review": "My Fire Stick cuts out randomly and freezes up. I'd like to replace it but, now it's out of stock.", "verified": true, "helpfulness": "0/0", "author": "TeeShot"}, {"rating": 5.0, "review": "Great tool.  Very easy to use.  Remote is very sensitive even though the stick is at the back of tv", "verified": true, "helpfulness": "0/0", "author": "Quan Chen"}]