[{"rating": 1.0, "review": "not as great as showed, also the Netflix doesn't work or don't know how to put the username and password", "verified": true, "helpfulness": "0/0", "author": "Ali Hassan"}, {"rating": 2.0, "review": "I over heats and stops working.  If I am on my tablet cruising the internet, it also stops working saying it cannot reach the signal.  Being 8ft away further from the wireless signal, everything is fine on my tablet.  Can't return it as I am outside of my window to do so.  I would suggest buying the other Fire TV item and not the stick.  If people had a better outcome than I do, I must have been sold a refurbished one with a \"new\" description.  For now I will use it when my tablet needs to charge.  Luckily I bought it on the Amazon birthday sale so it wasn't a complete bust.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 1.0, "review": "DOES NOT WORK WITH ANY OTHER APPS EXCEPT AMAZON. Netflix, skips. Hulu, skips. Most annoying price of equipment I have bought. Do yourself a favor and just buy chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Zack"}, {"rating": 1.0, "review": "Terrible video quality!  Runs HD for about 2 seconds then switches to low quality.  Lots of distortion.  I tried all the different resolution settings and still there was no improvement. Also tried using a different HDMI cable and nothing changed.  I tried Amazon prime and Netflix videos and the results were all the same - horrible, horrible quality!!  I bought this  to replace a Roku because the fire stick reviews were so good - my Roku is a million times better than this junk.  Tried the same movie on the Roku as I did on the fire stick and the Roku quality stayed at HD with no resolution problems.  I am returning this ASAP.  What a huge disappointment.", "verified": true, "helpfulness": "0/0", "author": "LB"}, {"rating": 5.0, "review": "This is a great device! Easy to use and set up. Love the remote! I also have another TV that is a smart TV but this is easier to operate and much faster than dealing with the menu on the smart TV. Price is right too!", "verified": true, "helpfulness": "0/0", "author": "Kenneth R. Kirkland"}, {"rating": 3.0, "review": "Didn't live up to my expectations.... The connectivity is really bad. Seems to no pick up wifi from router being about 3-4feet away. Keeps losing signal. Have to reboot  frequently and is just anoying. The content is always nice and looks looks. Pretty easy to maneuver but it lacks the ability to turn volume up and down. ALSO IT WOULD BE VERY CONVENIENT  IF IT CAN USE THE INTERNET  OF AN ALREADY ETHERNET CONNECTED TV!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 1.0, "review": "It keeps dropping wifi connection. I will hopefully be returning both sticks for a refund.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "Why did we not purchase this earlier?  This is so simple to use and we love having everything so easily accessible.  This is a must have item for sure.", "verified": true, "helpfulness": "0/0", "author": "Paula Hardin Steele"}, {"rating": 2.0, "review": "Having trouble with the stick just locking up while watching Amazon content.  I have used it several times now and it locks up more than half the times i have used it. The screen just goes fuzzy and blank alternatively.  I have to unplug it to reboot it, to get it to unfreeze.  I like how it works when it works.  But it has a real bad problem, completely locking up and needing a cold boot to get out of it is a seriuos bad issue.", "verified": false, "helpfulness": "0/0", "author": "Jared Schimmels"}, {"rating": 1.0, "review": "Very weak product.  Lots of stalling and stuttering when it came to Hulu plus and Amazon prime streaming.  I thought it was my wifi connection but decided to try roku 3 player based on a neighbor's suggestion.  Although it is a larger initial price, Roku has been a far superior product.I do not know about the fire TV. I tried to trade in my fire stick and pay the difference to get fire tv.  I was a bit surprised customer service would not credit me the fire stick price but since I had it for more than 3 months, they said this was not possible.  I have moved on to a competitor product and have been very happy since the change.", "verified": true, "helpfulness": "0/0", "author": "John Gargiulo"}]