[{"rating": 5.0, "review": "I love this thing!! You can take it anywhere as long as there is wifi and a tv with the right connections!!", "verified": true, "helpfulness": "0/1", "author": "Chantel"}, {"rating": 5.0, "review": "Love it.  Works great! I will be buying the Fire Stick TV next.", "verified": true, "helpfulness": "0/1", "author": "Barbara McCrae"}, {"rating": 5.0, "review": "LOVE LOVE LOVE!!!!!!!!! I have a TON of VHS that I was trying to replace with DVD. Well, with the fire stick and Netflix, I don't have to replace all of them. Great item!!! GET IT!!!", "verified": true, "helpfulness": "0/1", "author": "Danyelle"}, {"rating": 5.0, "review": "Love this!! It was so easy to set up and use.  I can add so many different products to view tv shows, movies, music videos and even game apps.  My daughter is 7 and she loves it as well.", "verified": true, "helpfulness": "0/1", "author": "veronica0514"}, {"rating": 2.0, "review": "I don't get a really good signal.  It jumps in and out.  My router is a good one too.  So I am not really sure what the issue is.  However, the few times it works it looks good.", "verified": true, "helpfulness": "0/1", "author": "Femi Jones"}, {"rating": 5.0, "review": "best little gadget I ever connected to the Panasonic TV I bought from Amazon....", "verified": true, "helpfulness": "0/1", "author": "Bill Gibson"}, {"rating": 3.0, "review": "The Amazon Fire TV Stick always show my network with a full signal, but it still keeps loosing connection. All of my apps perform better on my smart TV. A lot of the Amazon Fire TV Stick Apps, such as the History Channel, ask for proof of your cable provider for full access to their app, but they don't even have the two main providers in my area on their list; Comcast and Direct TV. I will take it with me on vacation in two months, see if I have any use for it there.", "verified": true, "helpfulness": "0/1", "author": "Brian K."}, {"rating": 1.0, "review": "Cant even use it. it keeps dropping the wifi signal. The router is fine, and my other devices picks it up just fine. I never got to watch anything on it. I havent found the time to return it. But thats my next step. I wanted to upgrade from my apple tv since it gave out on me. But i guess i'll just get another apple tv since it didnt disappoint me.", "verified": true, "helpfulness": "0/1", "author": "Michael S."}, {"rating": 5.0, "review": "I love the Fire stick. It's very fast and the picture is crystal clear and there is a ton of available content. Between HBOGo, Showtime Anywhere, Prime video, and Netflix I have everything I need. I have a Chromecast and the Fire stick is superior hands down. The Android app is great and even though it's nice having a remote, the app is all I need.", "verified": true, "helpfulness": "0/1", "author": "Rex Y"}, {"rating": 5.0, "review": "Works great...Great for watching movies we missed", "verified": true, "helpfulness": "0/1", "author": "Kevin Woomer"}]