[{"rating": 4.0, "review": "Way faster processing than our DVD player that we were using to access Netflix and Prime. The only \"negative\" is that the stick requires a power source, so you have to put the stick into the TV HDMI port, then stick a power source into the side of the stick and run that 3 foot long power source to a 110V plug (which we didn't have close to the TV - so we had to add another power extension cord). So we have a power cord dangling in view from our wall mounted TV, which I didn't anticipate, and it does not disclose in the listing.", "verified": true, "helpfulness": "0/0", "author": "peternewport"}, {"rating": 3.0, "review": "WiFi range is poor. I want to replace chromecast from the living room with this one but the WiFi sign lost a lot. Not happen the same with Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Chris M."}, {"rating": 5.0, "review": "We love the fire stick.It is very easy to use and set up is a breeze. Unlike our Apple TV the remote does not need to be within direct line of sight to operate the Fire TV Stick. However there is not an optical audio output which means we cannot use the Fire TV Stick with our projector and surround sound system. We must use our Apple TV for that to be able to hear what we are watching. Overall the Fire TV Stick is a fantastic option for any TV with an HDMI input.", "verified": true, "helpfulness": "0/0", "author": "Skyler Baird \"sky bear\""}, {"rating": 2.0, "review": "Cannot connect in hotels that use website for login. Also needs app. Harder to navigate than Roku with fewer channels. Bought for traveling but doesn't work in that capacity. Help forum is useless. Spend less money on Roku 1 and get better features and function", "verified": true, "helpfulness": "0/0", "author": "Judith L. Hamilton \"celtic music fan\""}, {"rating": 4.0, "review": "Great value, great performance", "verified": true, "helpfulness": "0/0", "author": "eugene jones"}, {"rating": 4.0, "review": "The major problem is that it is not linked to comcast so the  subscriptions that I have can't be used.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Not having a lot of experience setting up TVs and the additional items, I found the Fire stick relatively easy to get set up. The most difficulty was typing in my information on the little punch pad. Why does one always get down to the next to last letter or number and goof up? But now that it is all set up it is very nice to use.", "verified": true, "helpfulness": "0/0", "author": "Adelyn J. Grudier \"A creative user\""}, {"rating": 5.0, "review": "I love this! Works great!", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 2.0, "review": "This is a fast device compared to others and it performs better and faster than the built-in apps on my new Sony TV. However, this device whose primary function is watching movies has NO 24HZ OUTPUT SO THE MOVIES LOOK LIKE CRAP VS. THE 24HZ OUTPUT MODE MY TV HAS.", "verified": true, "helpfulness": "0/0", "author": "Trace"}, {"rating": 4.0, "review": "We live in the country so our internet is slower than some.  We upgraded our router to make the Fire Tv Stick work.  It works ok for most programs but ESPN keeps loading during games.", "verified": true, "helpfulness": "0/0", "author": "Carla"}]