[{"rating": 5.0, "review": "Easy to set up and use, great value at $40. Highly recommend to anyone, especially those with an Amazon prime account.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 4.0, "review": "I am very happy, it's very fast y easy to use.", "verified": true, "helpfulness": "0/0", "author": "Luis Alvarado"}, {"rating": 5.0, "review": "Very easy to use and set up on your television.  Love the variety of programs available.", "verified": true, "helpfulness": "0/0", "author": "Tabitha"}, {"rating": 4.0, "review": "Easy to use and install", "verified": true, "helpfulness": "0/0", "author": "LuxeBuy"}, {"rating": 4.0, "review": "Worth it.  I'm happy.", "verified": true, "helpfulness": "0/0", "author": "Thomas P Baltes"}, {"rating": 4.0, "review": "I've tried several media sticks / boxes and this is my favorite.The app for your phone makes searching, searching by voice, navigating, and typing very easyAny content I use is on the Fire Stick - Netflix, Spotify, Primce, etcI like that the stick is a stand alone device.  I love the ChromeCast, but for the same price, the Fire Stick is independentAs far as imperfections, it seems to need a very strong wireless signal.  I can't use it in the upstairs bedroom farthest from the router but I can use my Roku.  Easy fix, move the router.The searching isn't as good as the Roku.  I wasn't paying attention a few times and selected content I thought would come up in Netflix (free) but I accidentally bought a show.  My own fault for going too fast, but I'm used to the Roku that tells you what channels the content is available on and what the price is so you can choose the free or cheapest one.Anyone that watches Netflix or has Prime should have one of these.", "verified": true, "helpfulness": "0/0", "author": "MB & LB"}, {"rating": 1.0, "review": "remote control is too small and gets lost easily and gets stuck a lot. I use it for Netflix and I get quite a bit a loading problems and connection problems. I thought maybe it was the wi fi but I have a smart TV that already has Netflix on it and it doesn't have the problem so I know now its the fire stick. It works well enough I guess.", "verified": true, "helpfulness": "0/0", "author": "AMANDA TORRES"}, {"rating": 4.0, "review": "it would have been nice to know I needed  wi fi before I bought it", "verified": true, "helpfulness": "0/0", "author": "markturpin"}, {"rating": 5.0, "review": "Using the remote easy work. Love the device", "verified": true, "helpfulness": "0/0", "author": "Carroll walls"}, {"rating": 5.0, "review": "First off paying 99 for a year of prime is a steal the ordering online is nice but I like it for the tv shows and videos and games are fun as well it let's me stream Netflix as well the video quality is great being all in hd for the movies and shows. Its portable to take on the go as well as mirror my smart phone or fire hex tablet to it so many apps and music is even better as well. It with the money I have 3 of them it makes your normal tv into a smart tv. If I was you I would already stop reading and buy one already.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}]