[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Pablo Velasquez"}, {"rating": 5.0, "review": "The FIRE TV Stick performs exactly as advertised, was really easy to install and totally unobtrusive.", "verified": true, "helpfulness": "0/0", "author": "OC"}, {"rating": 5.0, "review": "Wow. Easy to set up. Easy to operate. Very cool what you can stream to my TV.", "verified": true, "helpfulness": "0/0", "author": "Leo W. Morrissey"}, {"rating": 5.0, "review": "Super convenient, great quality.", "verified": true, "helpfulness": "0/0", "author": "Kirby D. Runyon \"nasaman58\""}, {"rating": 5.0, "review": "I got this to address problems with slow loading and buffering of Amazon Prime videos. As advertised it is especially fast loading those. Not so much with Netflix.It's easy to set up. Runs a little warm so should be kept away from other heat producing devicesAll in all ir odes what it says it will and is worth the price..", "verified": true, "helpfulness": "0/0", "author": "Anyone's Nana"}, {"rating": 5.0, "review": "Just what I needed. The interface is great, no real lag with wifi. Very happy with this.", "verified": true, "helpfulness": "0/0", "author": "Aimee Lind"}, {"rating": 4.0, "review": "Didn't work on my primary 61\" Samsung dlp. I realize its 8+ years old now, but it has HDMI, so it should just work. Works good on my 32\" LCD, and I'm happy with its function there.", "verified": true, "helpfulness": "0/0", "author": "Kelly Monson"}, {"rating": 5.0, "review": "The directions for hook up were very easy. I am very pleased with my Fire stick. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "SHEILA R STAHL"}, {"rating": 4.0, "review": "So sar so good.", "verified": true, "helpfulness": "0/0", "author": "Gigs"}, {"rating": 1.0, "review": "I don't know if I got a defective model, but it is completely unable to stay connected to the Internet. I am on my computer as I type this, same room, same Internet. My computer has no problem connecting. The Fire TV stick-- nothing but problems. We previously had a Roku and did not experience the same issues, so it is pretty much down to the device. It is worthless, and I can never get more than 5-10 minutes into any given show. I did try the work around someone suggested of using the HDMI attachment, but that did nothing. So disappointed.", "verified": true, "helpfulness": "0/0", "author": "MamaBreak"}]