[{"rating": 5.0, "review": "No problems", "verified": true, "helpfulness": "0/0", "author": "Harriett Dokken"}, {"rating": 4.0, "review": "Set up was fairly simple (took several tries to connect to my wi-fi) and it is really easy to use. The non-voice-recognition remote feels like the plastic is paper thin so I wouldn't be surprised if that is the first thing to break. Love how easy it is to watch movies and other content. Also have used it to play background music while reading.", "verified": true, "helpfulness": "0/0", "author": "R. Williams"}, {"rating": 5.0, "review": "its great.", "verified": true, "helpfulness": "0/0", "author": "fred rodriguez"}, {"rating": 5.0, "review": "Really handy, had been using Xbox connection which took too much time for updates", "verified": true, "helpfulness": "0/0", "author": "Mary E Wiltfong"}, {"rating": 2.0, "review": "The product itself works great, it's the features that left me wanting more... We were hoping to replace cable with it but that won't happen anytime soon. Hate how Hulu is offered but not Vudu", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "Love it!  We don't have cable in our bedroom, so this allows me to enjoy my shows in the quiet of my room.  Much better than using my tablet as i have in the past.", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 1.0, "review": "really poor quality. there support do not respond to your query just keep on apologising and keep the issue pending, worst kind of customer support from amazon for fire stick.don't buy this product rather buy any other device.", "verified": true, "helpfulness": "0/0", "author": "sachin rawal"}, {"rating": 3.0, "review": "I purchased one of these Fire TV Sticks when Amazon had these on sale for Prime Members. My wife and I loves it so far, except it seems to keeping on rebuffering Netflix streams a little too often. This problem never occurs on our Apple TV, which is significantly further away from the WiFi router with Netflix, so I am pretty sure it's the TV Stick or the Netflix app is the culprit.By the way, this thing is great for side loading apps to make it do other things besides play videos and some games off the App Store. I will let your googling skills figure out what else this thing can do.If Amazon or Netflix can fix the continuous buffering issue, then I could jack this up to 5 stars, as this problem is very irritating. I should also mention that this problem even occurs on Amazon Prime videos, but not as often. I am unsure what causes, but I know it has nothing to do with my network, since Amazon Prime Videos play fine off my Blueray player and Netflix plays fine on other devices without a hitch. This is clearly a problem with the TV Stick", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": " I picked this up for use on business travel. It's compact and works in most hotels.", "verified": true, "helpfulness": "0/0", "author": "Matthew H. Worley \"Film Maker\""}, {"rating": 3.0, "review": "I like all that it has to offer, but it freezes so much.", "verified": true, "helpfulness": "0/0", "author": "Vickie Moreno"}]