[{"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "michael king"}, {"rating": 2.0, "review": "I have had my fire tv stick since they came out in December. I have had nothing but trouble with it. I have to unplug the power source every time we want to watch anything. This morning it just went nuts and kept flipping through the netflix menu and then just froze. I would not recommend this product until they fix things. I like my roku 100% better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"book lover\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 4.0, "review": "I have a Roku, Apple TV, and now a Firestick all on the same TV. Each has its own personality. Firestick works well with Amazon movies ( not found on Apple TV). The Apps seem skittle weak compared to apps on Roku and ATV. For example The Golf Channel app on Firestick only has a dozen things to watch. No current PGA updates, only a few lessons.The remote is fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "W. Zowtiak \"Billy Z\""}, {"rating": 5.0, "review": "My wife, daughter use it all the time. When I have free time I use it also. It's nice to watch movies on Lifetime that my wife misses she says. We feel it was a good deal.", "verified": true, "helpfulness": "0/0", "author": "bill allen"}, {"rating": 5.0, "review": "This works great. Have bought two.One of the few electronic devices that works on first set-up. Use on my projector with a HDMI to VGA adapter and TV.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "I personally like the Fire TV Stick. It is easy, simple to use and understand. I like that it is portable. The apps that came with the TV Stick are more than what I need but having options is always good. I have not had any issues with this. No connectivity issues. Quality is awesome. Amazon has a good number of programs that I enjoy watching on prime and the ability to watch them on my TV instead of my laptop is way more enjoyable. I feel that Amazon got this one right. It is small, portable and easy to use. Apps available are perfect for MY wants and needs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and Simple to use", "verified": true, "helpfulness": "0/0", "author": "Kiki"}, {"rating": 5.0, "review": "Google stick price with all Apple TV functions & quality! I had three of them but already dropped Google stick into a trash.", "verified": true, "helpfulness": "0/0", "author": "SZ"}, {"rating": 4.0, "review": "It's good", "verified": true, "helpfulness": "0/0", "author": "Eric T."}]