[{"rating": 4.0, "review": "Shortly after writing my original scathing review (still preserved below), we had the cable/internet guy show up to install a new phone line for business reasons.  While he was here, he installed a second wifi box - he said it was an extension unit that uses the same IP but is on a different wifi channel.  I plugged the Fire TV stick back in, I told it to forget about the old wifi connection and put in the password for the new one.... this product is back in business, have watched a few hours of TV over two days and it has not dropped the signal or given me the error messages that were disabling the unit. So I am raising the evaluation from 1 star to 4 stars. I'm not sure that it won't eventually stop working as it did before. I still think there is a problem in the way the unit was designed, and Amazon seems to be rather disconnected from the customers. But my problem is solved, so I don't have to return this and buy some other product to replace it.------When I first got this, it worked pretty well. Then, suddenly, it developed problems related to the network - none of the menus are available, it prompts me to check the network settings, it finds and connects to the network, and then it soon loses the connection and prompts me to check the network settings again. My roku (which is on another TV farther away from my wifi box) continues to work fine, as do my tablets and other wifi devices. On various forums, there are thousands of posts complaining about the same problem. People are posting all kinds of complicated solutions that they claim will sorta work for a while... things like rebooting it, uninstalling all the aps, doing a factory reset and re-entering all the email and password data, taping a copper wire of precisely 14 inches to the stick to serve as an antenna, or editing the settings of the wireless router. But do any of these really seem to fix the problem?  Doesn't seem that way.  As far as I can tell, Amazon has not addressed this problem. I plan on calling Amazon for tech support (which is likely to do little good according to other forum posts which indicated that Amazon does not recognize this specific problem, it just steps people through generic troubleshooting that takes one half hour or more, but does not solve the problem ) ... if they don't have a recognition of the problem and a real solution, I want my money back.", "verified": true, "helpfulness": "1/1", "author": "Jonathan"}, {"rating": 1.0, "review": "Search does not search for content within apps - makes it difficult and very clunky to find content. interface is slow. streaming generally works OK.  Android app takes ~45s to connect every time the phones screen powers off! I think its too late for me to return this, but i will be replacing it with something else soon", "verified": true, "helpfulness": "1/1", "author": "Zachary Rubin"}, {"rating": 5.0, "review": "Amazon fire stick and Amazon prime THE PERFECT COMBINATION.", "verified": true, "helpfulness": "0/1", "author": "POOKIE D"}, {"rating": 5.0, "review": "Awesome!!  I'm glad I have it and also that I signed-up for Netflix and YouTube.", "verified": true, "helpfulness": "0/1", "author": "Kristina L. Luttrell"}, {"rating": 5.0, "review": "its really cool. so easy i caught my dog using it", "verified": true, "helpfulness": "0/1", "author": "robotjones"}, {"rating": 5.0, "review": "THE FIRE TV STICK IS EASY TO INSTALL AND IS SO EASY TO OPERATE.  IT IS WELL WORTH THE MONEY.  I AM NOW ENJOYING PANDORA'S MUSIC AND NETFLIX MOVIES JUST TO MENTION A FEW OF THE GOOD SHOWS AVAILABLE.", "verified": true, "helpfulness": "0/0", "author": "opinionsplus"}, {"rating": 5.0, "review": "Works great.  Highly recomended for a simple solution to make a TV smart.", "verified": true, "helpfulness": "0/0", "author": "gnome"}, {"rating": 5.0, "review": "Way better than the chromecast it replaced.  It's almost perfect.  If only I could let my son use this with my prime streaming and prevent him from inadvertently purchasing things on my account it would be much better.  Still, it is great with netflix even though I had to remove the amazon prime streaming account.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "First of all, this is a great product for the price as a prime member. I have bought the Y-cable, similar to this http://www.amazon.com/StarTech-3-Feet-Cable-External-Drive/dp/B0047AALS0/ref=sr_1_9?ie=UTF8&qid;=1426642915&sr;=8-9&keywords;=y+cable+usb+a+to+usb+b to supply power to the TV stick and it works. The normal single USB cable is not able to supply enough power to the TV stick! Don't buy it from StarTech on amazon as I got it for less than $5 from a local store.", "verified": true, "helpfulness": "1/2", "author": "Tan Choon Seng"}, {"rating": 1.0, "review": "You tube no longer works on the firestick. If you play videos it cuts off at least of screen in blackness.", "verified": false, "helpfulness": "0/1", "author": "Matthew Lyons"}]