[{"rating": 3.0, "review": "Doesn't work as good as the Amazon Fire TV Box.It does alot of buffering and stopping throughout some of the movies.Don't think I would recommend this product to someone else unless it  was programmed better than the one I got.", "verified": true, "helpfulness": "0/1", "author": "Jasper Talbert"}, {"rating": 1.0, "review": "I purchased it when it came out. It plays the initial video upon setup but everything else gives me an unkown error. It says to contact Amazon if problem persists but there is no where to get help.", "verified": true, "helpfulness": "0/0", "author": "HH"}, {"rating": 5.0, "review": "Took some time to get used to it. Love it and the remote. Really good for older parents who do not use smart phones as remote. It is responsive and the video preview when scanning forest and back is excellent.The only issue I had was when I plugged it into a samsung TV the colors were over boosted. And I was not able to adjust the settings. On a Vizio they are perfect. So may be an issue with the TV.We have a chromecast, Apple TV and this and we have defaulted to using this now. It is the most user friendly with the included remote.The remote app however is pretty sub par.", "verified": true, "helpfulness": "0/0", "author": "Mr C"}, {"rating": 4.0, "review": "Its ok.....", "verified": true, "helpfulness": "0/0", "author": "J.D."}, {"rating": 5.0, "review": "Great little device. Keeps my family entertained. Supports Plex, Netflix, and Amazon Prime TV. What more could you want?", "verified": true, "helpfulness": "0/0", "author": "Mr. Smith"}, {"rating": 1.0, "review": "Update 2/15/15:Freezing is back on Netflix.  Buy the FireTV box or a roku.  The stick is terrible.____________Amazon exchanged the stick and power adapter.  Yes, defective exchanges will be just the stick and just the power adapter separately.Buzzing/freezing is still gone.  The video/audio sync issues seem to be fixed, but now I still get a very tiny pause in the exact same times on certain netflix video.  For the price I paid $20, I'm going to keep it; however, if you a picky about perfect streaming video and have to pay $40 MSRP, get something else._________Spoke too soon.  Now instead of freezing/buzzing, the streaming video will slow down for a few seconds but the audio remains perfect.  It then goes back to normal until it does it again in 30 minutes or so.  Zero streaming issues, zero buffering issues, local vs internet streaming does the same thing, etc.  I have two and both are doing this.  Have to send them back and look for better devices._____________Replaced the supplied adapter with a 5V 2A one.Buzzing and freezing?  Gone.Remote control glitches / ghost presses that I thought was just normal?  Gone.So far things have improved but I'm going to keep testing for it._______________Every ~40 minutes I get a very noticeable buzz along with a screen freeze and then the video resumes normally.  You can't ignore it and it completely removes you from whatever you were watching.  This happens over and over after about the same amount of time passes.It isn't my wireless network nor my internet connection.  A quick google search reveals that the probable source of the freezing is that the power supply provided is causing the issue.  The solution is to use a different USB power source or go against the explicit instructions in the manual and plug it into a USB port on the TV.  Well I don't have a usb port on the TV so I am screwed and must listen to this buzz.  Hopefully I can send these back.Everything else is great.  The UI, the wireless range, the apps, etc.  Everything is great except for the buzz / freeze every single 40 minutes you watch.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "easy. works perfect.", "verified": true, "helpfulness": "0/1", "author": "DSL"}, {"rating": 5.0, "review": "I bought this because I have many movies and TV shows for viewing and they look very good indeed in HD.  Unlike some of the other purchasers I needed only to follow the instructions provided for a successful viewing of a movie I had that my wife had not seen. Excellent product recommend to all!", "verified": true, "helpfulness": "0/0", "author": "Jim H."}, {"rating": 5.0, "review": "Amazing equipment, easy to use, kids friendly, and i get to watch all that Amazon Prime has to offer in big screen! Love it!", "verified": true, "helpfulness": "0/0", "author": "diana"}, {"rating": 2.0, "review": "I'll consider this little thing \"beta.\" For the $19 pre-order price, it's just about a value, provided Amazon will do some updating.Pros:- Decent UI. Best option I found for streaming Amazon Prime.- Small.- Can't complain too much for the price.Cons:- UI stutters and hangs frequently.- Every -- and I mean: EVERY -- episode or movie watched will stutter for a few seconds until the buffering is done.- Ridiculously poor placement of the power-supply (microUSB) jack. Take a clue from ChromeCast! Placing it on the side will inevitably restrict where the FireTV Stick can be used without blocking the HDMI port next to it.- Remote is unreliable. I often need to press it a second or third time to wake it up.- Wifi dies regularly... video playback will stop, the device will suggest going to network settings, and not a single network will be found. Needs powercycle to recover.- No way to stream locally hosted videos without PLEX -- which costs $5 and requires their spyware/server running inside your network.- Restricted to Amazon's \"app store\" -- so if you already purchased certain apps in the proper app-store, you get to buy them all again.- No decent way to provide shortcuts on the home screen -- i.e. weather? Favorite item from the watch list?- Haphazard parental controls and no filtering capabilities at all -- yes, we can restrict purchases, but what if I want to block/hide all content rated PG-13 and above? I personally don't watch R-rated garbage either, so I don't want to see it, thankyouverymuch, and certainly not have my children exposed.One of the two stars here is value-for-money. A streaming Android Device for $20 is a decent value, even though it's lacking quite a few features. In practice, it's restricted to playing very limited content, and really just Amazon Prime Video -- and for that, it really ought to be free. The other star is unbridled optimism that Amazon will take the feedback seriously and improve this thing... and if they don't, that the major gaps in functionality will be filled by fellow app developers.Amazon -- work with Plex and make it free, or develop your own.", "verified": true, "helpfulness": "0/0", "author": "F. Lastname"}]