[{"rating": 5.0, "review": "Love it.  It is easy.", "verified": true, "helpfulness": "0/0", "author": "Jeanne Romano"}, {"rating": 5.0, "review": "Love it everything I hope for is a great product switch from chromecast to fire stick and the stick is 100 times better", "verified": true, "helpfulness": "0/0", "author": "irvin"}, {"rating": 4.0, "review": "I would love to give the fire stick a five star review but I have only owned it for roughly a month now and I have had numerous problems with it freezing. I switched over from Google chromecast simply for the Amazon video. I like the remote with the fire stick but ultimately the chromecast ran smoother", "verified": true, "helpfulness": "0/0", "author": "Anjanette"}, {"rating": 5.0, "review": "My new Fire TV Stick is wonderful! The best $39 I ever spent!", "verified": true, "helpfulness": "0/0", "author": "Ginny Arbuckle"}, {"rating": 5.0, "review": "Makes any TV a smart TV....lol", "verified": true, "helpfulness": "0/0", "author": "maclady24"}, {"rating": 5.0, "review": "I love it! Bosch alone was worth the price, but having so many other originals as well as TV shows and Movies make the Fire TV stick a must have!", "verified": true, "helpfulness": "0/0", "author": "Mike Schrader"}, {"rating": 2.0, "review": "I preordered this gem and got it for $20.  When it's running, it's pretty great.  It really front loads Amazon Prime media, while burying everything else in a single row of 'apps,' which is annoying.  The real problem is that it crashes quite a bit, and because it's behind the receiver, it's a pain to get back there and unplug it/plug it back in.We use Amazon's instant video, Netflix, and Plex on this device.  If it's not the hardware, it's one of those apps.  In either case, I'd have been angry if I paid the full price.Also, in case it may be an issue for others, we are using the stock cable / power adapter.  That is not the concern.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Forrest Talley"}, {"rating": 5.0, "review": "This thing kicks butt! The only downside is that you have to plug it in. Otherwise it does exactly what it says. Get ready to have binging marathons. Each video loads instantly, since the next episode was downloading in the background while you were watching the last. GREAT for Amazon Prime Instant Video. Netflix and several other useful apps are available.One of the coolest things is that it comes pre set-up for you with your info already installed, so you don't have to spend time typing it in in the beginning. For those of you that hate searching for videos by scrolling with a directional pad, install the app on your phone. You can just use your phone's keyboard to type in what you want to find, or do a quick voice search, which has been spot-on so far.I would highly recommend this, unless you are looking for the ability to cast to a TV. It can NOT cast from a PC or tablet that is not Amazon-branded. It CAN mirror your android device's screen, but that device has to remain on.  If you want casting ability, get the Chromecast. This could be easily rectified if Amazon allowed an app to be made for Chrome, but I wouldn't count on that happening.", "verified": true, "helpfulness": "0/0", "author": "m"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Carrie Bard-DeNike"}]