[{"rating": 4.0, "review": "Just purchase it but I am loving it so far.  Waiting for updates", "verified": true, "helpfulness": "0/0", "author": "pridge"}, {"rating": 5.0, "review": "If you buy from your amazon account it comes preconfigured. Just install the app on your phone for great remote.", "verified": true, "helpfulness": "0/0", "author": "R. Anderson \"rick\""}, {"rating": 5.0, "review": "Awesome features and media capabilities. Very easy to set up and so much better than the Google Chromecast HDMI option. Remote is easy to use and works great with my LG Smart TV. I love this thing.....", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 2.0, "review": "It works.... BUT we cannot read the information on the screen. My husband or I have to get up and walk up to the TV to be able to read it. We have a Roku for another TV and that has much larger print.  I would have given this a higher rating if it weren't for this issue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Okay. I got this on sale on black Wednesday 15th. I have an excellent cable modem that speed tests at 50+ Mbytes/sec and an excellent router 802.11 Linksys n speed tests 50+ ethernet and 20+ wireless. The system shows I have an excellent connection 3ft away. It keeps kicking me off saying no network connection. I have shut off every other wireless device in the house. Still kicking me off(on prime). I've watched movies on 3 separate other devices simultaneously on other devices. I've tried all their tricks and with the same results. I'm getting kind of dissappointed. I wish I could speed test thru the fire stick and see what's really going on. When I first got this I was pretty keen on this and bragadocious. Now I'm feeling taken like someone on the street with 3 card monty...every day unplugging my router 3 times a day or the joy of forgetting my connection and putting in a mile long password which fixes the problem. Oh, yes it's called a Fire Stick because...OMG that thing is hot. I would humbly change this review if someone would come down from the mountain and just say you have to grease the framejigulator or just give me a new stick. Electrical Engineer 26 years of fixing everybody's computers,programming TVs/blurays/VCRs, fixing networks, programming cell phones, mirroring displays & greasing framjimbulators.", "verified": true, "helpfulness": "1/1", "author": "Guy Hardy"}, {"rating": 5.0, "review": "Surprised at what this little thing can do, love it.", "verified": true, "helpfulness": "0/0", "author": "Raynold Law"}, {"rating": 1.0, "review": "UPDATE (8/14/15):I ended up selling my fire stick to a friend who wanted one but it was out of stock on Amazon. I gave it the best try and when it did work, it was great. But most of the time it would drop from the network. I even moved my router to the same room and still didn't work. I think the WIFI is just not strong enough on the stick and cannot get a good/stable signal. The troubleshooting says not to have the stick in a cabinet but my entire entertainment center is in a cabinet. My Xbox One has no issues with WIFI within the cabinet. Maybe if they HDMI extender was long enough to reach outside the cabinet it might perform better, but who knows. I came on here to order the Amazon Fire TV but now it is saying out of stock. Seems to also be out of stock in my local stores. Guess no Amazon Fire TV for me...for now!ORIGINAL POST:I picked up the Fire TV Stick from Best Buy when they were on sale yesterday. First day I had I couldn't even finish the setup. Kept telling me that either my password was wrong (which it was not) or it would lose network connection. So I gave up. Tried again today and it was doing the same but after a while it finally let me log into my account. And that's where the fun stops. It let me watch that intro video and that's it. It just keeps telling me that it has no network connection but when I check it says I have a very good signal (see images). In the rare instance that the home screen actually does load I am unable to play any of the videos. All I get is a little spinning circle for however long until it comes back and says I have no network connection. This is not an issue with my WIFI. My cell phone and my laptop both can connect with no issues. If fact, I can hook my laptop up to my TV via HDMI and stream Prime movies and Netflix with no buffering.I have tired the Fire TV Stick with and without the HDMI extender and the results are the same.I have tired the Fire TV Stick with and without the the USB power and the results are the same.I tired different HDMI ports and the results are the same.I am going to some router \"fixes\" like rebooting it and try it on a TV that is closer to the router, but odds are I will be returning the Fire TV Stick.* Too bad the Fire TV Stick didn't have a wired option because I have a network jack at the TV location. And I am not sure I want to spend $100 on the Fire TV box.", "verified": false, "helpfulness": "1/1", "author": "Homer3D"}, {"rating": 5.0, "review": "Works just as well as all the name band sticks out there. Very happy I did my homework on all of them.", "verified": true, "helpfulness": "0/0", "author": "Jessica Bidot"}, {"rating": 4.0, "review": "So Far,set up was easy and straight forward. I find that the interface is quick and easy to use. The interface and streaming on the Stick is much faster than the Amazon app built into my HDT", "verified": false, "helpfulness": "0/0", "author": "Valencia \tEvangeline"}, {"rating": 5.0, "review": "Fantastic device! Netflix, espn app, fox sports app, Disney app, Sling TV, etc all in one place, finally. It's easy to use and quick to navigate.This will allow me to CUT THE CORD to DirecTv! So long suckers!", "verified": true, "helpfulness": "0/0", "author": "Jennifer L Ranick"}]