[{"rating": 5.0, "review": "I really love my new Amazon Fire TV Stick.  I am still getting to know all of its features, but have used Netflix, YouTube, and Amazon streaming movies and music so far.  It took me a long time to decide between the Fire TV Stick and the Fire TV box, but, in the end, I decided on the less expensive stick.  Thus far I have been pleased with my choice.", "verified": true, "helpfulness": "0/1", "author": "Theater Geek"}, {"rating": 1.0, "review": "One of the worst consumer products I've bought.Does not work connected to my AV Pre-Pro; has to be connected to the TV, which would mean having to switch inputs at the TV and getting the audio output back to the Pre-Pro.The TV ONLY connects to the Pre-Pro; everything must come through it.Too easily drops the network connection. I was using the iOS app to navigate, and it hung. Finally got a message saying the internet connection was lost. However, internet radio was playing at the same time and never dropped. The iOS app never reconnected; had to use the supplied remote, which is way too sensitive when trying to scan through a list--have to be careful that multiple entries are skipped over.Did play a song from a CD I had bought from Amazon (the only time the device actually connected through the Pre-Pro; and guess that had something to do with my Prime account). The sound quality was dismal compared to the 128bps MP3 stream the radio station I was listening to uses.The device is is the garbage.", "verified": true, "helpfulness": "0/1", "author": "Mellow"}, {"rating": 5.0, "review": "Love it !!!! I wish I had purchased it sooner", "verified": true, "helpfulness": "0/1", "author": "JKemp"}, {"rating": 2.0, "review": "I'm a little disappointed in the Fire TV Stick. It was more difficult to set up and connect to my internet service and it has not stayed consistently connected to the internet.  I have Comcast which could be part of the problem, but I was really looking forward to using this device while recovering from a recent surgery and it just hasn't worked.", "verified": true, "helpfulness": "0/1", "author": "Emily Woodward"}, {"rating": 5.0, "review": "Love the Amazon stick!!! It does get stuck on 25% after about 8 hours use and u have to reboot it if u have a slower internet speed.", "verified": true, "helpfulness": "0/1", "author": "SNS"}, {"rating": 5.0, "review": "Really fun, cool, and easy to use! Perfect for Netflix and Amazon Prime Movies. Doesn't get any better for the price. Highly recommend.", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 5.0, "review": "I love the fire stick and will be ordering another one soo just love it and love working for Amaxon", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As described with quick delivery!", "verified": true, "helpfulness": "0/1", "author": "Lisa"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Quade Allen Richardson"}, {"rating": 4.0, "review": "All is good..........", "verified": true, "helpfulness": "0/1", "author": "Donna Baron"}]