[{"rating": 5.0, "review": "Had been thinking about getting fire stick since it first came out. Wish I had made purchase sooner. It was easy to set up and works flawlessly with Amazon prime as well as other apps such as Hulu.", "verified": true, "helpfulness": "0/0", "author": "Donald Davis"}, {"rating": 5.0, "review": "Easy set-up, works very well.", "verified": true, "helpfulness": "0/0", "author": "David Ryall"}, {"rating": 1.0, "review": "Poor choice for watching Netflix.  HBO Go works fine, but Netflix stops every 30 seconds to buffer.", "verified": true, "helpfulness": "0/0", "author": "Glenn Siegert"}, {"rating": 5.0, "review": "Great product, reasonable price!", "verified": true, "helpfulness": "0/0", "author": "dantoweed"}, {"rating": 4.0, "review": "Maybe my wireless internet but it sometimes stops in he middle of a movie", "verified": true, "helpfulness": "0/0", "author": "Rita Oliver"}, {"rating": 5.0, "review": "I love it! It's an amazing little gadget.", "verified": true, "helpfulness": "0/0", "author": "Sandra D. Weisner \"Rev Sasha\""}, {"rating": 5.0, "review": "Works well. We have Smart TVs, but advantage to the Amazon Fire TV Stick is that it can be moved among several TVs, including Smart TVs. Apps more updated than those fixed in Smart TVs.  REDUCED CABLE TO BASIC using Amazon Fire TV, Netflix & Sling TV and monthly TV bill has dropped from nearly $200 monthly to about $60. Yes, it is possible. Internet cost is separate. We don't miss paying for a 300-channel tier *required* by the cable service provider, in order to get the dozen or so channels that I **actually watch on a regular basis**.  Sling is LIVE streaming and the Amazon Fire TV Stick makes that possible.  Photo is the Fire Stick TV menu, as it appears on screen.  This is a Smart TV, where we opted to use the Fire Stick to access the Sling TV app.", "verified": true, "helpfulness": "2/2", "author": "Goldenmom \"kdj\""}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Michael ray brown"}, {"rating": 3.0, "review": "Got it for the Prime introductory $19 price.  Love most everything about it (remote, interface, features), but didn't like the fact that it required an upgrade to my Slingboxes (From Pro-HD and Solo to 350 to the 500) run the app.  Difficult if not impossible to connect on hotel tv's over their wi-fi.", "verified": true, "helpfulness": "0/0", "author": "B. Moscardini"}, {"rating": 5.0, "review": "awesome tool!", "verified": true, "helpfulness": "0/0", "author": "Inez Alexander"}]