[{"rating": 5.0, "review": "Just awesome...who needs the evil empires of cable tv anymore??  Just get an HDTV antenna, and the Fire TV...your'e all set!", "verified": true, "helpfulness": "0/0", "author": "Patrick  Campbell"}, {"rating": 5.0, "review": "It is easy to install. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Empress"}, {"rating": 2.0, "review": "I have a pretty fast internet speed but the Fire Stick always lags.  Even though it does what its suppose to do, I can watch hulu, prime, and netflix.  The lag kills me from switching from app to app.  Originally I bought it so I didn't have to hook up my kindle fire to my TV directly but i've gone back and reverted to plugging my kindle directly to the TV again.  Hulu plus is spotty, some shows work and some shows don't, I hear sound for the show but no image plays.Overall it does what it does but its a little glitchy.", "verified": false, "helpfulness": "0/0", "author": "baldwin thai"}, {"rating": 5.0, "review": "Got my firestick with remote. Love it. Easy to hook up and install.", "verified": true, "helpfulness": "0/0", "author": "Michael Louis Marinaro"}, {"rating": 5.0, "review": "The fire stick offers more than what I expected.  It streams beautifully.  And I love the screen saver pictures.We could get ri of our cable and be totally entertained with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Carma Hilliard"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "tanya"}, {"rating": 5.0, "review": "Works great!!!  We love it.  I wish I would of bought one sooner.  I wish the remote was a little bigger but it's manageable.", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "I was incredibly pleased with the new Fire Stick...then Amazon started charging to watch old tv sitcoms.", "verified": true, "helpfulness": "0/0", "author": "Lisa Liberi McGarvey"}, {"rating": 5.0, "review": "We love the convenience of the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Tara Trigg"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Sharon"}]