[{"rating": 5.0, "review": "Simple to use. Love it", "verified": true, "helpfulness": "0/0", "author": "nancy l mcney"}, {"rating": 5.0, "review": "Just replaced a Roku XD-S with the Amazon fire stick. Love it, love it, love it. Better picture, sound and ease of navigation. So very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "James R. McCoy \"VITAMINGIANT\""}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "IamWoody"}, {"rating": 3.0, "review": "It's ok when it comes to Amazon Instant Video. Netflix and Youtube apps are choppy as hell. Barely watchable. Amazon really needs to fix this.", "verified": true, "helpfulness": "0/0", "author": "Mookie \"Mookie\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Paige"}, {"rating": 3.0, "review": "Lowered my rating because I'm not able to view Crackle shows using my Fire Stick. This could be a Crackle/Fire Stick combined issue, because I am able to watch Crackle shows from my Vizio Smart TV and computer, but not from a TV using the Fire Stick. It starts out okay, but after the first set of commercials I get an error that says \"An error has occurred while playing this video.\" Everything is hooked up correctly and I'm able to watch Netflix and Amazon using the Fire Stick without any problems.", "verified": true, "helpfulness": "0/0", "author": "My Amazonian World"}, {"rating": 5.0, "review": "WORKS AS ADVERTISED STILL LEARNING ALL OF THE OPTIONAL CHANNELS BOB", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not too bad of a stick. The remote through the iOS app is extremely senstive. No ABC or TNT app. I would like to see the HBOgo and Spotify app improved.", "verified": true, "helpfulness": "0/0", "author": "MGA"}, {"rating": 5.0, "review": "To me, Fire TV stick is better than the ROKU and other devices.  I really enjoy watching Netflix or Amazon movies using this device.", "verified": true, "helpfulness": "0/0", "author": "teachermom \"teachermom\""}, {"rating": 4.0, "review": "Not as fast loading as the Amazon Fire TV but the price is a lot better.  I use on a second TV to Netflix and Amazon Instant Video.  I never use for games, etc.  It loads and runs fine. I have never had a video stop to buffer the file.  If you are going to use for gaming I would definitely recommend the more expensive Amazon Fire TV.  It works exactly the same as the Amazon Fire TV but without the microphone search option.  The microphone search works best on Amazon Instant Video so it is not much good to me since I use mostly Netflix.  Very easy to use and setup.I did notice that the Fire TV Stick gets warm if left plugged in even when not using.  Since I use mine on a second TV only occasionally I unplug the AC adapter when not using.  I would recommend to a friend.", "verified": true, "helpfulness": "1/1", "author": "Ray"}]