[{"rating": 5.0, "review": "My dumb TV instantly became a \"smart\" TV.  The Fire Stick was so simple...just plug it in and away you go.", "verified": true, "helpfulness": "0/0", "author": "Mona C. Busick \"MokieRan\""}, {"rating": 2.0, "review": "The clarity of Amazon Instant Video through the FireStick is amazing compared to watching programs through our Wii... We were looking forward to using this device but we are now returning it...Unfortunately, the parental controls that apply to all of the other devices registered to our Prime account do not apply to the FireStick. If your parental controls are ON, you have to input a PIN for for every single thing you watch (including animated children's programs) and if you turn parental controls OFF, there is complete access to mature content programming. This is not a mistake that Apple would have made before rolling out a product like this and, frankly, I'm a very disappointed customer...Amazon usually hits it out of the park, but this time, I'm calling FOUL BALL!", "verified": true, "helpfulness": "1/1", "author": "Amanda Love"}, {"rating": 5.0, "review": "Shipped quick and just as described.  Works great.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Douglas Liebert"}, {"rating": 5.0, "review": "So far, so good! Can't beat the price (we bought it on pre-order during the 2 day sale) and I love that it's portable. I ended up buying a converter so we could use it with our old TV that doesn't have an HDMI connection and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 5.0, "review": "I love the Fire TV stick. Nicely packaged, simple installation instructions, high quality picture resolution (much better than Netflix), and fast navigation response. The remote control is adequate but a prefer using my phone to voice search and to navigate through content. So far I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "nvashopper"}, {"rating": 1.0, "review": "Garbage. Restarts when it wants and hardly works right. Mine just stopped mid show,shut down,restarted but won't reboot.", "verified": true, "helpfulness": "0/0", "author": "Hope"}, {"rating": 1.0, "review": "Horrible product! I have gone through two of these Sticks. The wifi connection has been the main issue where I lose connection to the Stick frequently. If you google this, Amazon's forum has a 20+ page discussion of others having the same issue. Buy a chromecast or roku instead.", "verified": true, "helpfulness": "0/0", "author": "arrowv"}, {"rating": 3.0, "review": "It's a good deal, only one problem, it's super sensitive, I have to be careful when using it.", "verified": true, "helpfulness": "0/0", "author": "ann"}, {"rating": 4.0, "review": "Works great. I am thoroughly enjoy having it.  Easy to attach and load up on my TV", "verified": true, "helpfulness": "0/0", "author": "spunkygrams"}, {"rating": 5.0, "review": "This is great", "verified": true, "helpfulness": "0/0", "author": "Richard E. Wadyko \"rwadyko\""}]