[{"rating": 5.0, "review": "If you are an Amazon Prime member, the Fire Stick is a great choice....Very efficient way to stream all of your entertainment...You should be able to take this with you on vacation and use in your room/condo, etc...Assuming the wifi isn't locally blocked...Amazon is always good to deal with...", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "I love this gaget!  My Dish Network box is HD, so the Fire TV Stick delivers HDTV and my picture is wonderful. There is so much to watch now that I will cancel my Dish.  I bought Chromecast and was not pleased.  I had to use my computer to connect and my internet did not steam well.  With the same internet, no computer necessary, the Fire TV Stick delivers a perfect picture with no static.", "verified": true, "helpfulness": "0/0", "author": "LakotaDLynn"}, {"rating": 1.0, "review": "> Ordered on October 27, 2014, Arrived on Dec 06 2014 with 2 days shipping on prime account.> its like giving your wallet to a kid. one click you will be charged.> Not for me. i am not amazon prime video fan, Fire TV stick doesnt like much anything other than Prime account.Good things:+Other limited apps to install.+Good if you have prime account.+Worth for money, Bundles you will get are worth the money.++ interesting and graphics Games .+voice search app", "verified": true, "helpfulness": "85/100", "author": "Chetan B"}, {"rating": 5.0, "review": "I purchased this during the 2 day sale when it was first announced, it arrived a few days ago and today got around to setting it up. I already had the Roku Stick, but for $20.00 I figured I would use this on another TV and as a backup if the Roku every decided to quit on me.My first impression after opening it was that it was sturdier built than the Roku and the remote was substantially smaller and very basic - which I think is a very good thing.Setup was very easy, even came with my Amazon account already loaded. Found my WIFI on first try and was ready to go in about 5 minutes total. The setup was much easier than the Roku. Little things like how the on screen keyboard was laid out was very nice. It synced my Amazon Prime account in about 30 seconds, so all of the stuff I had previously watched showed up. All of my pictures and songs from my Amazon cloud account were their waiting for me. The on screen menu is similar to the Roku, maybe a little less cluttered. Seems to be faster to navigate and start the shows than the Roku.Only negative I have found is that the app is not yet available for the Apple operating system. The video manual (which automatically shows during the setup) says it will be available soon.Overall can't go wrong, I would purchase this over the Roku Stick, although the Roku is also a very nice system.", "verified": true, "helpfulness": "0/0", "author": "TonyC25"}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 5.0, "review": "I waited with much anticipation to receive my Fire TV Stick and was not disappointed. Very easy to setup, connect and log on! Prime members are automatically registered, another great service from Amazon! Remote control sets it apart from other similar devices.Video quality as good as anything I have seen.If you are a Prime member, this is a must have device. The remote makes it a stand alone unit. Android users can download the app for voice search and remote control functions.Amazon cloud features were incredible. Just took Christmas pictures of the Historic Medina, Ohio square and the picture quality is incredible.Amazon has hit a Home run with this device.I will update this review as other features are used.", "verified": true, "helpfulness": "0/0", "author": "Roger Coy"}, {"rating": 5.0, "review": "Wow! This is awesome. It was very easy to set up and connect to Amazon Prime movies and more. I hardly use my Dish 120 anymore except for news.", "verified": true, "helpfulness": "0/1", "author": "MacBobT \"catso\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Maggie"}, {"rating": 5.0, "review": "We have a smart TV, however, hotels where we stay charge for movies. Most, if not all, offer free WiFi, so the fire stick is a great work around. I recommend the purchase of one of these devices.", "verified": true, "helpfulness": "0/0", "author": "Philip W. Snyder \"Leftneck\""}, {"rating": 5.0, "review": "I got it on sale at best buy for 25, it is a great device for the size. If you need an easy way of streaming to a tv that has no smart capabilities, Fire Stick is the way to go. And then you get extra content from Amazon so you can rent movies as well. I still don't see why one would spend 99 on the Fire Tv or the stick does it all... If you want the extra gaming capabilities of the Fire Tv, then it's fine. We are still missing the iOS app.", "verified": true, "helpfulness": "0/0", "author": "lric"}]