[{"rating": 4.0, "review": "The one I received works great.  It was really easy to instal. I thought I would be able to access my existing Netflix account but have not figured out how. I also received one of the two I ordered in a box that was open and had no packing slip. Having difficulty getting help with that.", "verified": true, "helpfulness": "0/0", "author": "Beverly Collins"}, {"rating": 5.0, "review": "Great device! Great movie selection", "verified": true, "helpfulness": "0/0", "author": "Glenn Lawson"}, {"rating": 5.0, "review": "Good product.  Easy to set up and really exceeded my expectations for quality.", "verified": true, "helpfulness": "0/0", "author": "MikeBot"}, {"rating": 5.0, "review": "This thing is awesome. Plug it in and go! Works flawlessly and love my Prime! The ads are a bit misleading though as you do have to plug this into the wall with the provided adapter, but still awesome!", "verified": true, "helpfulness": "0/0", "author": "Rdawg \"Thanks\""}, {"rating": 3.0, "review": "Works well, no problem yet.Need more apps", "verified": true, "helpfulness": "0/0", "author": "Indo Dude"}, {"rating": 4.0, "review": "It works great and the set up was easy, once I could actually get the batteries into the remote. That is my only complaint, the remote is extremely difficult to open the back of to load the batteries. I finally had to google it to see a youtube video that someone posted based on their own problems getting the thing opened up. Once that was done though everything else was smooth and we are enjoying the options and versatility it gives us.", "verified": true, "helpfulness": "0/0", "author": "helpful husband"}, {"rating": 5.0, "review": "Very easy setup; I'm enjoying it very much!!", "verified": true, "helpfulness": "0/0", "author": "DrJAW \"DrJAW\""}, {"rating": 2.0, "review": "We were really excited to get this stick until we actually got it.  After it was plugged in and we started using it I realized the hard way how limited the shows and movies on Amazon Prime are.  In fact, I would never have paid the subscription fee for Prime if I'd done my homework.  Also, you cannot stream from your laptop with this device the way you can with Google Chromecast.  I also don't like that you have to have Hulu Plus in order to stream.  I was hoping I could just stream regular Hulu on here using my account, but I can't.  I am so utterly disappointed in this thing.", "verified": true, "helpfulness": "0/0", "author": "Bookilicious"}, {"rating": 5.0, "review": "Amazing how easy to install and watch.  Being a prime member many are free to watch.", "verified": true, "helpfulness": "0/0", "author": "Blanca Castrillo"}, {"rating": 4.0, "review": "Not as many movies or shows as I thought.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Roush"}]