[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Victor"}, {"rating": 5.0, "review": "Very pleased overall. Good WiFi reception overall - tends to lag just a bit, but using the extension cable has helped a great deal. I have compared the picture quality of the stick vs. the box, and the box is definitely better on a large set, but for me and the 32\" set I am using - it's just fine.I have had 2 issues worth mentioning. My first stick had a defective remote where the navigation ring would stick - it was a local purchase and an easy exchange. The second deals with an Android Lollipop based smart phone... the app does not work. Not a defect or problem with this item, but worth mentioning if you are running into the same thing. The option to use your smartphone for a keyboard and voice command is really a nice feature.", "verified": true, "helpfulness": "0/0", "author": "A. Maier"}, {"rating": 4.0, "review": "Received as a gift from my wife. Set-up was a snap. Response is decent. The reason I gave it 4 stars and not five is that the organization of accessible content just escapes me. Amazon's \"genre,\" \"mood,\" \"theme,\" organization seems very oddly contrived. Other than that, though, I would recommend the product.", "verified": true, "helpfulness": "0/0", "author": "Richard Green"}, {"rating": 5.0, "review": "The only bad thing about this is that I don't have the mic. I use it nightly. I also have a Chromecast. I'm much happier with this.", "verified": true, "helpfulness": "0/0", "author": "ThinkGeek"}, {"rating": 5.0, "review": "Excellent stick to have around in your possession.", "verified": true, "helpfulness": "0/0", "author": "JAMES A. ELLISON"}, {"rating": 4.0, "review": "The concept is great and probably if we upgraded our internet it wouldn't interfere so much with our WIFI.  Love it overall.", "verified": true, "helpfulness": "0/0", "author": "Amanda Hooker"}, {"rating": 5.0, "review": "I've been so happy with this device. Worlds better than a Chromecast, which I've had all kinds of technical issues with. The Fire TV Stick just WORKS. Very smooth setup and it has everything I need, and tons of apps if I find I need something more.", "verified": true, "helpfulness": "0/0", "author": "Michael Vollbrecht"}, {"rating": 5.0, "review": "The only product I found that will let me mirror my Samsung Tab 4 10.1.I researched, bought, and returned many that cost twice what I paid for the Fire Stick. Even the Samsung adapters that Samsung claims will mirror any of their products, NOT. I love the Fire Stick because it comes with numerous aps that when and if you decide to use, are always available.", "verified": false, "helpfulness": "0/0", "author": "Mario piña"}, {"rating": 3.0, "review": "haven't had time to use it.  assume its ok.  would like to see more write ups on how to use it", "verified": true, "helpfulness": "0/0", "author": "Patricia Holland"}, {"rating": 3.0, "review": "I am a little disappointed in the wireless reception capability.  It had numerous network drops depending on the location of the TV in my house.  I compared it to a ROKU player or Slingbox player (not stick versions) on the same TV's.  I would not get drops from the other devices but many times on the Fire I got network not available.  So if you have a good wireless connection, this stick should work great for the price.", "verified": true, "helpfulness": "0/0", "author": "Jeff eliason"}]