[{"rating": 5.0, "review": "I like the remote.", "verified": true, "helpfulness": "0/0", "author": "sandran"}, {"rating": 5.0, "review": "I just installed this 'fire stick.  It was very easy to install and am excited about using it.  I know I will enjoy it", "verified": true, "helpfulness": "0/0", "author": "rvlady"}, {"rating": 5.0, "review": "I already have Fire Stick and it is great. I ordered another one as it has Sling TV which is great as we can get TNT, AMC, HGTV, Life Time and more. We have an antenna and stream everything. Great item to have even if you watch Netflix and Hulu! Great buy! Great Stick!", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Great content and design. My only complaints are that it will no work on my laptop and you have to plug the power supply into the wall. Much better design and function that Roku (which I own) and the chromecast (which I also own). This will be my media stick of choice until the Big A makes one.", "verified": true, "helpfulness": "0/0", "author": "Bandit 300"}, {"rating": 2.0, "review": "It was easy to install but I am having problem getting anything but netflix?", "verified": true, "helpfulness": "0/0", "author": "DANIEL JANKOWSKI"}, {"rating": 5.0, "review": "The set up easy simple, and it was what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "H. Falmer"}, {"rating": 4.0, "review": "fairly idiot proof. A good selection of materials online.relatively simple to set up and operate.Since it does take up an hdmi port in the tv, make sureyou have a free one. My older tv only has 2.Also, nowhere did it say that the 'stick required wireless-n.If you use the earlier (and slower) wireless-g, it will keepgiving you warning messages about not being able to catch up.time to upgrade, I suppose.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It would get five stars, except that the remote stopped working within the week. thhis would not be a problem, since my regular TV remote seems to work with it, but I DID spring for the extra convenience of the voice-recognition, and it would be nice to have it.", "verified": true, "helpfulness": "0/0", "author": "william j teska"}, {"rating": 4.0, "review": "Setup was flawless! I was mostly concerned about our slow internet connection (1.1mbps download/.93mbps upload w/49ms latency), but it's buffering has been minimally invasive on movies and music. On movies, it will buffer approx 5-7 times early on, but catches up and is constant for the rest of the video. Buffered somewhat when launching music but streamed fine even while downloading pix to Amazon Cloud via their app.As a tip, I turned off all of our networked devices to ease up more bandwidth. I believe this helped.Very simple setup, yet many features to play with. So far I am extremely satisfied!Now I have to find out how to get my Yamaha 5.1 stereo to work with it.Using a Samsung UN46D6050 TV", "verified": true, "helpfulness": "0/0", "author": "Highbypass Turbofan"}, {"rating": 5.0, "review": "Love this product! So much better than a huge cable bill!!!!Rate it 10 :)'s!!!!!!!! Thanks again AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Wendy Castro"}]