[{"rating": 5.0, "review": "I ordered one when it was announced and it came today.The good news is it installed easily, did the obligatory software upgrade and in less than10 minutes I was watching videos.My experience might be different than some so I will mention a couple of things for current and potential buyers.I plugged mine into the one of HDMI ports on my Integra Receiver so the content would be routed through my Home Theater system. Then go into settings and turn on Dolby Digital. Some modern TV's have good built-in sound systems but nothing like a good surround sound system.Picture and sound quality are excellent and there was no stutter or apparent buffering this afternoonPositives:Easy to set up and operateExcellent picture and qualityThe Menu system works well but the search interface is not as good as it once was but that is not the fault of the Fire TV StickAn upgrade over the DVD player I was streaming with beforePicture and sound as good (or better) than an Apple TVNegatives:None so far", "verified": true, "helpfulness": "0/0", "author": "M. J Bauer \"Mike Bauer - Voracious Reader\""}, {"rating": 4.0, "review": "I just received two of these today and I really like them.  I have them on two TV's that I couldn't otherwise stream on.  My one and only complaint is that one is in my son's room and the Netflix children's screen is not very kid friendly.  Perhaps once he starts watching things it will show more things he likes but I think so far the most kid friendly Netflix screen I've seen is on the Wii.  He is elated that he can finally watch stuff in his room, and with my help he is able to work the remote with my assistance so overall I am happy with my purchase.  This little stick has a lot to offer and it will probably take many many uses to figure them all out", "verified": true, "helpfulness": "1/1", "author": "jmduvi"}, {"rating": 5.0, "review": "I own both the Chromecast and now the Fire Stick and have found that, although there are some redundant features, I am using and enjoying both thoroughly. Where some features are lacking on the Fire Stick that I use, they are done on Chomecast and vise versa. The Fire Stick is a great option and very easy to use. I would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "E. A. Smith"}, {"rating": 1.0, "review": "Amazon!  How about posting that this device does NOT work on ALL tv's?  I waited 1 1/2 months for the device.  Plug it into my 3 year old $800 Sharp LED and it does not work.  I get a Blue screen  displaying \"HDCP unauthorized. Content Disabled\".  Would have been nice to know that it May or May Not work......Now I have missed out on all the Black Friday weekend sales for other streaming devices....", "verified": true, "helpfulness": "1/4", "author": "SB \"SB\""}, {"rating": 5.0, "review": "What a fantastic little device!  The setup was easy and the navigation is quick and intuitive.  My only small complaint would be that the site photos should really show that this device needs external power through the included microUSB cord and wall adapter.  Other than that we have used this device a lot the past few days and have had no problems.  Highly recommended for anyone who uses Prime Instant Video.", "verified": true, "helpfulness": "0/0", "author": "brandon w curnutte"}, {"rating": 5.0, "review": "I got this under the promotional price of 19.99.  You can't beat it for that price.  It's a Roku at a better price.  So far, I don't mind that it doesn't have the kazillion apps that Roku has.  If I had one negative about the product, it's that the remote control's left-right-up-down navigation button is not nearly as good as Roku.", "verified": true, "helpfulness": "0/0", "author": "John E. Marlowe"}, {"rating": 3.0, "review": "I am a long-time user of ROKU, owning the original and ROKU 3. So I am very familiar with media streaming devices. I bought the Fire Stick because Amazon offered it for 1/2 price to Prime members, making it a low risk transaction. And I am very glad for the price discount... because the Fire Stick is an inferior product!While visually pleasing, the Fire Stick start menu is a PAID ADVERTISEMENT. Meaning you are paying Amazon to display all of their content, both pay and Prime, plus a very lame selection of \"new apps and games\" before you can get to your chosen apps. Want to use Netflix? Be prepared for 8 remote clicks through the menu just to load it. Hulu Plus? Same thing. Using either ROKU, 2 clicks and Netflix has started.I was also hoping Fire Stick would somehow bring order to Amazon's video collection, which is the most jumbled mess on the web. No luck. You still have to scroll through endless pages to make sense of their collection.Lastly Fire Stick offers dual-band wifi. Don't hold your breath on the 5Ghz connection. My router is 10 feet away and Fire Stick shows a nearly full-strength signal, but cannot connect. ROKU 3 is over 30 feet away and locks onto the 5Ghz for a fast connection.There are some positives: portability and strong CPU enables smooth streaming. But I see Fire Stick as a work-in-progress that was rushed to market to grab a share of the Christmas demand. You'll be happier with a ROKU.", "verified": true, "helpfulness": "0/0", "author": "Andy Roid"}, {"rating": 4.0, "review": "Bought 2, the first works great but the second one had some flaws so I had to return. But we are enjoying the fire tv stick that works.😃", "verified": true, "helpfulness": "0/0", "author": "Cjrak"}, {"rating": 4.0, "review": "I really expected this to be just a little novelty that I would hardly use, but I am shocked to say, I think it has become my primary \"TV\" watching tool.I have my computer hooked up to my TV, so that has been my default viewing machine for about two years now. But, this little device manages to deliver a better user experience and even a better image that my computer does...I love it, and I really think you will too.The downside:1. Navigating is a little slow. The menus just aren't quite as snappy is I would have expected, but really, that is a minor issue.2. You CANNOT use it at most hotels. Because hotels usually require you to verify terms and conditions via a web browser (which the Fire Stick does NOT have), the Fire Stick basically becomes unusable. Honestly, if they could fix that issue, I'd give them 5 stars, even with the navigation lag...This item is definitely a buy. It's simple to setup (pretty much just plug it in...), it has an amazing picture, and a good selection of apps too. But if you're more of a road warrior, Chromecast is still probably the better fit for you.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Still learning all the ins and outs of using this but love it so far.", "verified": true, "helpfulness": "0/0", "author": "Dollar Family"}]