[{"rating": 4.0, "review": "A little slow sometimes", "verified": true, "helpfulness": "0/0", "author": "Maria J Pugh"}, {"rating": 5.0, "review": "Like that it come with its own remote unlike Chromecast", "verified": false, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very small and compact and does everything the Apple TV does without all the Plugs.I strongly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Siver16"}, {"rating": 4.0, "review": "This is a truly amazing device. The only reason it did not get 5 stars is its some times glitchy nature.After a very simple install and startup, I would get error messages about slow internet connection. I had expected this as we were running basic ATT internet. We had ATT come out and install a midrange uverse package (6 whatabites) and the stick preformed much better. We still do get the occasional slow or lost internet signal, but I'm starting to wonder if it is the connection, as in almost all instances I can clear the issue by resetting the Fire stick. That said, so far I'm very pleased with the programming content and the fact that a good portion of it is free with my Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Stephen A Schmitt"}, {"rating": 5.0, "review": "great thing to buy. I love mine. thinking of buy more for gifts.", "verified": true, "helpfulness": "0/0", "author": "Pamela Adams"}, {"rating": 5.0, "review": "Best purchase for television/movie services. I now use air antenna for local, added sling for twenty or so cable channels, other apps for more tv and cable channels, and prime movies. I'm set. Figure I'm saving $80-100 per monthly entertainment. Also with amazon music I cancelled sirius as music is included with prime and I think better than sirius for sure. Very pleased. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "KDub"}, {"rating": 4.0, "review": "This streaming stick is pretty straight forward in using. However, in terms of streaming apps like Netflix, it stalls, starts,and the focus is off, sometimes. Gets frustrating. I have yet to figure out how to make my viewing in HD format to accommodate my HD flat-screen, as the movies do not stream clear, even when using movies from amazon prime.", "verified": true, "helpfulness": "0/0", "author": "yssascat 1960 \"book hungry\""}, {"rating": 1.0, "review": "So completely unimpressed with this device. I was expecting so much more that what I got. You have to get the Amazon prime subscription in order to fully utilize what's being offered. And, you have to be subscribed to HBO to be able to watch that app. Totally disappointed!", "verified": true, "helpfulness": "0/0", "author": "Melissa Nelson"}, {"rating": 5.0, "review": "Great product worth more then the price tag", "verified": true, "helpfulness": "0/1", "author": "brian delp"}, {"rating": 4.0, "review": "Easy to install easy to use", "verified": true, "helpfulness": "0/0", "author": "Jack tran"}]