[{"rating": 2.0, "review": "It's pretty cool except it doesn't play through your home theater system. So if you don't mind listening through cheesy tv speakers then get it.", "verified": true, "helpfulness": "1/1", "author": "Brent Ferguson"}, {"rating": 5.0, "review": "With my Prime account this is great as there is so much content offered on Amazon I gave my Roku to someone else...", "verified": true, "helpfulness": "0/0", "author": "Steven Salzer"}, {"rating": 3.0, "review": "Not impressed with the quality of the remote. The fact that it has to plug in to power or the fact that it displays adds. I should have just bought the actual fire tv", "verified": true, "helpfulness": "0/0", "author": "crystal newton"}, {"rating": 4.0, "review": "Almost perfect.  Very easy to use.  Absolutely love it, but the ommission of vudu is glaring.  Hard to fully recommend to any vudu user until it has been included.", "verified": true, "helpfulness": "1/1", "author": "eric"}, {"rating": 4.0, "review": "It's aight", "verified": true, "helpfulness": "0/0", "author": "Joshua Knoedl"}, {"rating": 5.0, "review": "We love our  new fire stick", "verified": true, "helpfulness": "0/0", "author": "Bob Vince"}, {"rating": 5.0, "review": "Love it for Netflix, hulu, Pandora, amazon prime! Watch out cable tv!", "verified": true, "helpfulness": "0/0", "author": "Craig Baker"}, {"rating": 5.0, "review": "This Fire Stick works quite well. I tried the Roku stick and it worked for about 3 months and has not work since and when it was working there were constant issues. This stick is on another TV in my home and I am quite pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "newjohnn"}, {"rating": 1.0, "review": "I previously owned a roku xd and decided to replace it with this. first off, the reaction time for button presses is extremely slow. It also constantly drops WiFi connections. The worst part is that it doesn't match sound with video. My outdated roku was way better than this. I would recommend getting any roku product over this.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What a difference a little stick can make.  Glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "joanne bradley"}]