[{"rating": 1.0, "review": "Cannot get it to work properly. The first couple of days it would work fine for maybe 1-2 hrs then quit. Would then work the next morning, and now it is totally froze up. All other wifi devices in the house work fine. Stick is junk.", "verified": false, "helpfulness": "0/1", "author": "Dan"}, {"rating": 5.0, "review": "Easy to install. Love the remote control.", "verified": true, "helpfulness": "0/0", "author": "Heriberto Ibarra"}, {"rating": 4.0, "review": "Only serious negative is the WiFi sensitivity. Probably because of the small size, this device has a harder time getting and maintaining a solid connection with my WiFi router. Note: I am comparing this with a Roku box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It has problems with internet connection and keeps disconnected from my home network. I have different streaming devices (Apple Tv and Chromcast, Samsung TV..) and all of them work fine on my wifi network.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "This is a nice streaming device that works well whether you want to use it for your main tv, move it around the house to different tv's, take outside and hook up to a projector for driveway drive-in night, or take with you when traveling for pleasure or work and staying in a hotel.  I have not used it for gaming nor do I plan to. This streaming device seems to just as fast as my Roku 2 device and is more portable. I wish they would offer a vudu app on this device, there is a flixter app which gives me a a lot of my movies but not all, primarily my disney movies are missing. I mainly purchased it to try out since at the time it was $20. I will most likely use this to access my amazon prime movies since It does seem quicker than my Roku device. I have downloaded various apps on the fire stick (primarily disney apps) and am pleased with the way that it runs.  I cannot compare this to the fire tv since I do not own one.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 3.0, "review": "Great little device. Because it includes Amazon Instant Video and supports mirroring I'd say it's much better than the Chromecast I bought and returned 2 weeks later.The Fire TV Stick lost one star because it still doesn't do anything an Xbox 360 or a PS3 doesn't already do. If you have one of those, you really don't need any of these Roku, Fire TV, Apple TV or Chromecast devices.It lost the second star because it's a little too complicated for the over 50 crowd. We bought two of these, one for my parents and one for my wife's parents and while I wouldn't qualify it as difficult to use, it's a little too hard for both of our families. Both families have had computers since the mid 1990s and currently own laptops, smart phones and tablets. Wifi setup is about as easy as it can get, but, still a little too hard.How to Setup of the Fire TV Stick with your ParentsStep 1Plug the stick into an HDMI port and plug the stick into the wall for power.You're best off just taking care of this one yourself. While you plug it in your dad will likely go over and have a seat on the couch. As soon as you plug it in, don't be surprised if the TV inexplicably turns itself off. As your dad accuses you of unplugging something just think to yourself \"That's strange...\" You're already right next to the TV. Your best bet is to just turn it back on without argument.Step 2Now you've got to get the TV to the correct input.Be prepared to spend approximately 5 minutes explaining the cable box remote doesn't change inputs on the TV, neither does the remote for the stereo, nor do keyfobs for old Toyotas. We all know the cable remote actually does change inputs but remember, you've got to press the TV button and then press a small poorly labeled multipurpose button and then you'd have to press the Cable button to get the thing functioning for the cable box again. You're surely better off just using the TV remote. Next you'll need to find the TV remote control. Remember when the TV oddly turned itself off? Turns out your remote was under the couch cushion your dad was sitting on. Now explain \"source\" means the same thing as \"input\". To complete this step explain we have to cycle through two or three screens before we see the Amazon logo pop up on the screen. Reassure your family, yes, you will have to go through all of these screens every time you want to use the thing.Step 3Amazon Start ScreenClick \"Start\"The video will show all of the fantastic things the Fire TV Stick can do and how amazing it is with Amazon Prime. Unfortunately, your parents will get bored and begin an unrelated conversation within seconds of the beginning of the video. Even though you, the only person that doesn't need to watch the promo video of what it can do, are the only person paying attention, sit back and relax. Step 4 will require your extreme patience.Step 4Log on to your wifiBe prepared to take about an hour on this step. Before beginning this step please understand that finding the password to your router is a complicated task and you will likely try between 3 and 5 different passwords before finding the correct code. Remember, passwords are the only thing keeping your wireless network safe and it's important your parents have used a jumble of 20 some character alpha numeric codes that don't mean anything to anyone for ultimate security. These seemingly pointlessly complicated codes make the jobs of would-be hackers somewhat more difficult. As you carefully point-and-click your way through these passwords, bear in mind your folks are mildly safer from their neighbors monitoring their 40 thieves solitaire and hearts games because of their diligence in carefully crafting their passwords. During this step your family will require a great deal of reassurance after each failed password attempt. Please anticipate spending several minutes reassuring family that it will indeed work and it's not broken. Our testers have found statements such as \"The Fire TV Stick is working perfectly! This screen is telling us that your router didn't accept that password either!\" work equally well if screamed at a high pitch or mumbled under ones breath.Step 5Create an Amazon AccountYou'll need an Amazon account to make use of this device. Please spend the next 2 hours telling your father that his credit card information is safer on Amazon than it is when the bill gets paid by mail. Facts about sending a piece of paper with your bank account number and routing number to your checking account along with the credit card number tend have special impact.Step 6Explore your contentHand the Amazon remote to your father. Because you've also paid for Amazon Prime as part of the gift you should have already scrolled to the Amazon Prime heading. As your father immediately attempts to exit Amazon Prime to get to Netflix explain all of the benefits to Amazon Prime, to which you have purchased a membership for him, compared to Netflix, to which you have not purchased a membership. Please do this again for Hulu Plus. Next, explain ESPN will not have free access to all of the football games that are not in your area. Finally reassure your family, yes, essentially the only \"free\" content is the Amazon Prime library of over 4,000 titles. You should probably not mention that \"free\" content cost you a hundred dollars a year or you'll have to entertain a conversation about \"How is this better than cable?\"", "verified": true, "helpfulness": "1/1", "author": "Steve K."}, {"rating": 5.0, "review": "This is EXACTLY what I needed: Netflix and Amazon Prime in one small efficient package. Neither Apple TV nor Google Chrome gives you both and the picture and sound are flawless. It froze on me once, but all I had to do was hold down two buttons on the controller and it reset immediately and has delivered 100% ever since. Very Pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "G. Reid"}, {"rating": 5.0, "review": "The Fire TV Stick is amazing! Not only does it work well, the quality, color and clarity of the picture has improved as we watch our favorite programs. I am very happy with this product and I recommend it!!!", "verified": true, "helpfulness": "0/0", "author": "Christopher Ahern"}, {"rating": 1.0, "review": "This device is very cool in concept but fails to deliver in usability.  In particular, WatchESPN and HuluPlus constantly crash or freeze or black out.  Check the reviews for those apps on Fire TV Stick specifically and they confirm my assertion.  I tried every troubleshooting method possible and nothing resolved the issue.  Both of those apps work flawlessly with my Chromecast.  And for reference, I have a 50mbps internet speed, so that was not the issue.", "verified": true, "helpfulness": "0/0", "author": "t-mac"}, {"rating": 2.0, "review": "I'm pretty frustrated.  It's constantly cutting out and buffering or telling us the network is too slow. I'll run a speed test from my computer and we'll have anywhere from 25-40 mbps and no other devices running.  I would not buy this again.", "verified": true, "helpfulness": "0/0", "author": "Jessi-Liz \"Jessi-Liz\""}]