[{"rating": 3.0, "review": "I enjoy watching my favorite Amazon Prime shows on the big screen rather than my kindle or laptop. Navigating the programs can be time consuming by alphabet though there is an app that can be used once down loaded to your smart phone. It's voice activated. I have not used this app yet.  With that being said, I dislike having to unplug my cable to insert the fire stick. Then again remove the fire stick to insert my cable wire. Any suggestions would be appreciated.", "verified": true, "helpfulness": "0/0", "author": "Dawnbird"}, {"rating": 5.0, "review": "Love it! Much faster than I expected . Even with TWC $15 internet", "verified": true, "helpfulness": "0/0", "author": "mcsd"}, {"rating": 1.0, "review": "The stick worked fine for 2 days, and now I can't log in or use.  :(", "verified": true, "helpfulness": "0/0", "author": "T. jensen"}, {"rating": 5.0, "review": "Works great.  The family loves it.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Rita M. Kane"}, {"rating": 4.0, "review": "Easy to use and shuts off with the tv. Great streaming device if you pull the plug", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great we love it. a lot of enjoyable movies to watch on prime. will probably continue the prime account i have got to the point where i don't care for action movies with a lot of shot up bang bang.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It was a piece of junk and I had to send it back.  I couldn't get a good wifi connection, even though all the other devices that use wifi in my house worked just fine.", "verified": true, "helpfulness": "0/0", "author": "Veronica Wileman"}, {"rating": 3.0, "review": "not the best thing ever but ok", "verified": true, "helpfulness": "0/0", "author": "Pj`s And Vanessa`s"}, {"rating": 5.0, "review": "It was very easy to install and exceptionally easy to use!  Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Gail Stone"}]