[{"rating": 5.0, "review": "The product works very well.  I was just a little disappointed in how many programs I still have to pay for despite being a Prime member.", "verified": true, "helpfulness": "1/1", "author": "ajafk"}, {"rating": 5.0, "review": "I have 3 rokus and a micro pc that I have been using for quite some time, I purchased this unit because of the unbeatable price and better specs. The stick performs well and has bonus features like device screen mirroring which can only be found in the newer 3 times the price Rokus. My only complaint would be is the remote is so small I have already lost it several times.", "verified": true, "helpfulness": "1/1", "author": "Nolan Rice"}, {"rating": 5.0, "review": "It cuts off frequently. I have done everything advised and the router is right beside of the tv.  Update:  After contacting Amazon,  the technician was able to solve my issues and I am now 100% happy with the fire stick!", "verified": true, "helpfulness": "1/1", "author": "nicki"}, {"rating": 4.0, "review": "Apple TV does not include Amazon so I purchased Fire Stick. Only complaint is that when plugged in while watching cable TV, the stick interrupts the signal for a second or two every 5 minutes. Very annoying so have to unplug when not using. Not sure if there is a problem with the TV.", "verified": true, "helpfulness": "0/0", "author": "LJO \"Linda O\""}, {"rating": 5.0, "review": "Super easy to set up even for a non-techie like me!  So far, I've been catching on movies from my watchlist.  Really cool to watch on TV as opposed to laptop or Kindle Fire.  Downloads are just as quick as on demand movies.  Worth the money paid!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "good option", "verified": true, "helpfulness": "0/0", "author": "James Boston"}, {"rating": 4.0, "review": "I'm enjoying my new fire stick however I'm trying to find a way to enjoy without running out of WiFi airtime.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Washington"}, {"rating": 5.0, "review": "Works Great.  Bought it for my daughter.  I just wish Amazon Prime invitees could get the movies too.", "verified": true, "helpfulness": "0/0", "author": "Bill Esposito"}, {"rating": 5.0, "review": "We've had this about a month and so far I really like it. One question I have is do I have to unplug it everytime we are done with it? Any answers would be very helpful", "verified": true, "helpfulness": "0/0", "author": "PJR \"P. Raskin\""}, {"rating": 5.0, "review": "LOVE being able to switch to movies with the flick of a button. Easy to switch back to cable/satellite, as well. Lots of great original series to watch, as well as movies, like Bosch! Just plug this in, walk through the self-setup, and sit back to enjoy your new toy!", "verified": true, "helpfulness": "0/0", "author": "Janet O'Connor"}]