[{"rating": 5.0, "review": "I had it installed in less than 5 mins with no issues. The device is obviously geared toward Amazon prime content and the scroll speed through menus is slower using HBO Go and Netflix but shows load quickly once selected. I got mine on sale but even at the current price of $39 this is a great value for adding streaming functionality to a TV.", "verified": true, "helpfulness": "0/1", "author": "Christopher Forsythe"}, {"rating": 5.0, "review": "you can use your phone to control the fire stick through an app! That's amazing. Netflix, spotify, YouTube, and even Kodi run great on it. I love being able to push music to my tv using the spotify app and also being able to push YouTube videos to my tv as well.I've used a chromecast before and this is way better. You can use your phone but you don't have to unlike the chromecast.", "verified": true, "helpfulness": "1/2", "author": "Jesus I"}, {"rating": 2.0, "review": "Slow speed than Chromecast and roku,  and unable to use mirroring feature with andoid devices.", "verified": true, "helpfulness": "0/1", "author": "yewming chiong"}, {"rating": 5.0, "review": "Exactly what I ordered and on time", "verified": true, "helpfulness": "0/1", "author": "Kevin McCann"}, {"rating": 5.0, "review": "Although I feel most of the movies they want you to rent or buy should be free I really like that when we do decide to buy a movie we don't have to worry about lost or damaged discs. The movie selections are \"OK\". I haven't had time to check out any of the amazon series but I will definitely look into it once the summer is over", "verified": true, "helpfulness": "0/1", "author": "Lisa"}, {"rating": 3.0, "review": "I love the great show options, especially those available with Prime. However, if Amazon has tech issues, you can't watch the Prime shows or movies. This is happening to me tonight. Also, it spends quite a bit of time buffering. It's also hard to fast forward and rewind shows and movies because the buffering takes so long. It has trouble connecting to our internet even though it says the connection is \"very good\". Other than that, I've enjoyed having it.", "verified": true, "helpfulness": "0/1", "author": "J lo \"Jessica\""}, {"rating": 3.0, "review": "Encourage everyone order this item the best product for Netflix with great graphics.", "verified": true, "helpfulness": "0/1", "author": "Mark Delahunt"}, {"rating": 5.0, "review": "I'm honestly a little shocked. This thing is pretty incredible. Loading times are super fast. It has great flexibility in terms of apps. I didn't need it but it comes with an HDMI extender in case you can't fit the stick in an HDMI port. The remote works great, only thing is I don't care for the way the \"arrows\" or the black circle feel but that is so very minor. Connection to WiFi is superb. When you first start it up it gives you a brief animated walk-through of it's features which was kinda cool. The power adapter is small profile so if your TV is sitting on a dresser like mine is and the outlet is behind it you don't need to pull it very far away from the wall. All in all, I am very impressed. Good job Amazon! If I had to suggest anything it would be to change the feel of the wheel thing and perhaps illuminate the buttons because they are about impossible to see in the dark. Very minor things though. Not enough to take off a star.", "verified": true, "helpfulness": "0/1", "author": "Heath Converse"}, {"rating": 5.0, "review": "I bought this and have never used it, as I don't own a TV.I will still give it a 5 star review because it seems good.", "verified": true, "helpfulness": "0/1", "author": "Mark P Jung"}, {"rating": 3.0, "review": "Somewhat happy with this device.  It freezes often. Hoping that stops and it becomes more consistent. Also hoping more variety in programming becomes available.", "verified": true, "helpfulness": "0/1", "author": "E. Hughes \"Hughes\""}]