[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Michael Lombardi"}, {"rating": 5.0, "review": "Excelent!. with this little device you can have al lot of fun", "verified": true, "helpfulness": "0/0", "author": "Eduardo Icaza \"E I\""}, {"rating": 2.0, "review": "I was very excited to receive the Fire Stick, however, it wouldn't work properly.  Netflix would not play even though it showed good signal strength. I purchased a Blu-Ray player with streaming instead and Netflix and Prime stream much better on that. Very disappointed! Loved the idea of the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "MANDY"}, {"rating": 1.0, "review": "Funny enough this required a cable to power the device…nowhere in the commercials do they show the cable and to my knowledge it's not present on the page ordered from…plus it has connectivity issues that can only be attributed to the device as there's another competitors product that connects with ease from same location.", "verified": true, "helpfulness": "0/3", "author": "Ben S. \"Ben\""}, {"rating": 5.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 2.0, "review": "Roku is better.", "verified": true, "helpfulness": "0/1", "author": "Jeff Byrd"}, {"rating": 5.0, "review": "as good or better than my roku. i would not hesitate to encourage anyone to purchase this.  it is also somewhat cheaper than other brands", "verified": true, "helpfulness": "0/0", "author": "Julia S."}, {"rating": 5.0, "review": "Absolutely love it. It's so easy to use. It's in my 7 yr Olds room and he loves it.", "verified": true, "helpfulness": "0/0", "author": "Tia"}, {"rating": 5.0, "review": "I had a little trouble hooking it into my hdmi port of the tv but after it was hooked in, it was easy to implement.  The picture was clear and audio was perfect.", "verified": true, "helpfulness": "0/0", "author": "interested reader"}, {"rating": 3.0, "review": "Bought this as a gift for my husband and we thought it would be nice to actually utilize as a second source for cable TV but unless you are an AMAZON Prime member, it is not worth the extra money spent.  I can toggle my Kindle Fire to the TV and get the same results.", "verified": true, "helpfulness": "0/0", "author": "Karzak"}]