[{"rating": 4.0, "review": "The stick works like a champ but the remote is no working as expected, the round middle key (select/enter) seems to be stuck and won't allow me to select anything.Going through tech support (based in Philippines) made the troubleshooting process painful and I truly hope I will never have to contact them again. I ended up buying another remote.", "verified": true, "helpfulness": "0/0", "author": "Luigi"}, {"rating": 4.0, "review": "We had a bit of trouble getting Netflix to work properly when we first installed the Fire TV Stick.  After going through multiple trouble shooting attempts, Amazon finally had their tech support remotely fix the issue and we've had no trouble since then, so far.", "verified": true, "helpfulness": "0/0", "author": "Darlene Abshier"}, {"rating": 4.0, "review": "Works well most of the time.  Every once in a while it will freeze and we have to turn it on and off.", "verified": true, "helpfulness": "0/0", "author": "SA"}, {"rating": 5.0, "review": "Compact - easy to move, great selections!", "verified": true, "helpfulness": "0/0", "author": "The Henns"}, {"rating": 5.0, "review": "What a great idea this is!  I've already used it far more than the Chromecast I got a couple of years ago.  Chromecast is always pausing to load - of course, that could be my internet connection, but I don't have that problem with Amazon Fire TV stick.  I use it to view yoga and other fitness videos.  No pauses which makes these videos so much better!  It's also great for watching movies or kid shows with my nephew who is 4, and worries about his show coming back when we watch traditional TV.", "verified": true, "helpfulness": "0/0", "author": "Coco deLo"}, {"rating": 5.0, "review": "Great addition to our TV viewing.", "verified": true, "helpfulness": "0/0", "author": "James Rump"}, {"rating": 5.0, "review": "When this TV stick arrived I carefully followed the setup directions by using all the provided items. I connected the USB cable to the TV stick and the other end of the cable to the power adapter which I then plugged into an outlet. Next I plugged the stick into the HDMI port on my TV. I turned on the TV and selected the HDMI port where I had plugged in the stick. I then installed the two AAA batteries into the remote and sat back to watch a movie. Bah, humbug! No movie could be watched because the stick could not find the network. I tried everything I could think of but no connection ever could be made.I was out of ideas and decided to pack the stick and other contents back up until I decided whether to return the stick or just eat the loss. When I opened the box to replace the items I noticed that the last item, the HDMI extender cable was still curled up in the box. Just for the heck of it I decided that since I tried everything else why not install this extender cable even if I could think of no reason why this would have any bearing on the problem. I pulled the stick out of the HDMI port and connected it to the extender cable.  I  plugged the other end of the extender cable into the HDMI port from which I had just removed the stick. Incredibly, the stick was now connected to the network. I clicked on a movie and while the movie was playing I did some settings searches and found the way to turn on the CC.This morning I decided to see if the movie connection was just a fluke so I turned on the TV, pushed a button on the stick, picked a movie and voila! everything worked like a charm including the CC. All's well that ends well.", "verified": true, "helpfulness": "0/0", "author": "Duffer. \"Bo\""}, {"rating": 5.0, "review": "I love this Fire Stick..well worth the money, great movies to choose from. Easy to navigate. I'm a prime member and loving it!!", "verified": true, "helpfulness": "0/0", "author": "Margarita \"Teresa\""}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Juan Rodriguez"}, {"rating": 3.0, "review": "Good for home use. Very limited when travelling. I have Fire TV for home and Fire Stick for travel. Limit is not being able to connect to hotel network. Use Kindle to cast to the firestick but this has limits also, especially in other countries.", "verified": true, "helpfulness": "0/0", "author": "MFSI"}]