[{"rating": 1.0, "review": "Unit I first received was complete defective garbage.  No trained tech support.  Bad product.  Using buyers as Beta testers is not nice.  Shame on you Amazon.  My defective unit was replaced by a re-furbished instead of new - I paid for a NEW one!", "verified": true, "helpfulness": "0/0", "author": "S. Tank"}, {"rating": 4.0, "review": "For my purposes, the Fire TV Stick works really well. I generally have used it watch Netflix content or items we already own digitally from Amazon, both tasks for which this works perfectly. This item was a replacement for my trusty Wii console that I was previously using to stream video, and as such I was very pleasantly surprised from the first viewing of the crisp and clear picture. I have had very few issues with streaming speed or quality. I haven't tried any of the games or other apps yet, but they are nice options to have. Over all, for the introductory price I paid, I could not ask for a better streaming video device.", "verified": true, "helpfulness": "0/0", "author": "LiteraryJess"}, {"rating": 3.0, "review": "I'm not impressed.  The device itself is pretty cool- it beats the pants off the Chromecast because:1. Way snappier interface2. Remote means it works without a computer/iPad to control itBut I was looking forward to leveraging my Prime membership and discovered that the Prime selection is pretty poor.  There are a lot of serial TV series that I'd like to binge watch all the way through (The Sopranos, for example) only to discover that the first season is free with Prime, but after that you have to pay extra per episode/season.I'll probably use it because there's a lot of Prime content that isn't available on Netflix, but it just feels like a loss leader for Amazon to make more money off you.  Oh well.  My Western Digital player is a lot more versatile, but Amazon won't license their client to anyone.", "verified": true, "helpfulness": "0/1", "author": "Jimbo \"jimbo@abs.net\""}, {"rating": 5.0, "review": "The FireTV Stick is, simply put, FANTASTIC!  I pre-ordered mine and have been using the heck out of it :)  It has had a couple of minor issues however.  The user interface is not always as intuitive as it could otherwise be.  I am VERY willing to forgive any small shortcomings it has, though, given the amazing speed and functionality stowed away in such a compact, stylish, package.", "verified": true, "helpfulness": "0/0", "author": "Casey B. Cessnun"}, {"rating": 3.0, "review": "Needs HBO Go", "verified": true, "helpfulness": "0/1", "author": "Ben Call"}, {"rating": 1.0, "review": "Complete garbage. Worthless.As of today (May 19, 2015) ALL PRIME INSTANT VIDEO FAIL TO PLAY.I get LICENSE_ERROR whenever I attempt to play any prime video, even though I have valid prime membership through August.Oh, also, everything was working yesterday.So Amazon really screwed its customers on this product. WORTHLESS P.O.S.", "verified": true, "helpfulness": "2/2", "author": "Database Developer"}, {"rating": 5.0, "review": "I used my free trial of prime to get this for $19 during the 2 day sale.  For that price, I really can't complain.  But the Fire TV stick may not be the flawless TV device you think it is.First off, I've never used Roku, Apple TV, or the larger Fire TV version, so I can't make any comparisons to those devices.When I first plugged in the device, even though I was using the included AC adapted which was plugged into a surge protector, I got the error message saying there wasn't enough power supplied.  Rather than fumble around with whatever the issue was, I just clicked okay and moved on.  After you set up your wifi, the rest is pretty much done.  The unit is shipped with your account information, so you don't even need to worry about that.The interface is pretty easy to navigate.  A deticated home button on the remote always brings you back to the home screen and you're able to find your recently used apps there.  There are plenty of free apps to make your device feel useful without spending a dime.  Apps such as Crackle and History channel all have a few free episodes to watch, and Apps such as PBS kids and Nickelodeon all have free episodes with kid friendly shows.  If you have a cable subscription with these channels, you're able to get even more.The device also works well for gaming.  Again, there's a fair amount of games for free, and even more for just a buck or two.  Graphics are obviously not PS3 level, but still pretty good.  You likely won't get this as a gaming console, but it's a very nice bonus.  Also, if you plan to play games on this a lot, you may want to invest in one of the optional controllers.There's also a few extra features that are rather nice.  For instance, any music you've downloaded from Amazon is automatically added to the music section.  Unfortunately, nothing from iTunes.  Also, if you download the Amazon cloud drive on your phone, it will automatically upload pictures from your phone so you can look at them on your TV.Another thing worth noting is that the remote communicates via bluetooth.  This is both good and bad.  Good because you don't have to worry about your TV or other things getting in the way of the signal, but bad because you won't be able to use a Harmony or other universal remote.  So if you're sick of how many remotes you have, guess what, you're getting another one.The biggest drawback for me is this device seems to be pretty much an advertisement for Amazon and Amazon Prime.  The watchlist, movies, TV shows, search option, are all for Amazon videos.  This means if you're not a Prime member and/or don't have an interest in downloading movies from Amazon, roughly 1/3 of this device will be useless.  I wouldn't even mind so much if you could customize your home screen, but it always suggests movies and TV shows and you're always scrolling past it in the menu.  Even the voice search function (if you bought the remote or have the ap) brings you to Amazon content.  While this isn't a huge problem, it's still a bit of a let down.So to recap...Pros:- Affordable- Easy to navigate- Easy to setup- Quick and powerful- Plenty of stuff for free- Even more content for just a few bucks- Games are impressive for just a tiny stickCons:- The device is really designed with Prime members in mind- Videos and search functions are just for Amazon content- Can't customize the home screenOverall, I'm really pleased with this, and the few drawbacks mentioned weren't even enough to take away a star.  I'm really looking forward to learning more about this device and filling it up with games and apps.", "verified": true, "helpfulness": "1/1", "author": "D. Surine \"Stanley\""}, {"rating": 4.0, "review": "I bought this on a whim when it was $20 preorder and glad I did. Even though I have a computer hooked up to my TV, I'm finding myself using the stick. I get better picture quality and faster loads. Setup was fast and intuitive. Loads are pretty fast.My main quibbles:The phone app remote is very twitchy and hard to control.The Amazon Music app lacks search feature so you have scroll individually through artists and albums. If you have thousands of artists in your library, that's impossible. You have to use the main search and select results from music as opposed to prime videos. then once you find an artist, you have to select a song before you can go to a list of albums. I hope they fix this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First off, this product isn't for everyone. No product really is, but for me and many like me, it's a great product. Let me also say that I may be slightly partial, because, although I did not get it for free, I did get it half price during the promotion.Like many people, my family has cut the cord and we just use internet services and local streaming of our own movies such as:NetflixAmazon Prime StreamingPlex (for streaming local content from our network)NBA Gametime (to stream NBA League Pass Broadband directly to TV)Hulu Plus (occasionally we get a month. Hate the ads, love some of the content)HBO Go (we'll be subscribing when it is available by itself. Currently pay a friend who has Dish to subscribe so we can use his HBOGO login)Pandora music (free, great for parties)Amazon Music streaming (free, but only has your Amazon music unless you also subscribe to streaming music. Prime Music is awesome, but requires you to manually add albums from their library before playing on the stick-- you can't just browse all and play like you can on the IOS app for iphone)Over the past few years, we've ripped all of our DVDs to PC, so Plex basically lets us use a network hard drive as our own personal movie jukebox. Between that and the streaming services listed above, the device is a one-stop shop. We rarely even change TV inputs unless we are playing games. FireTV is where we go for music, movies, TV, etc.The good+Streaming works flawlessly for all apps tried, except for NBA League Pass which has an occasional hiccup. It looks like it may just be the programming of the app+The 2-3 second boot up for Netflix films isn't terribly noticeable+lots of options+game apps work relatively well with any bluetooth controller, but are limited graphically (still, there are some cool games for it) It's never going to be a gaming console, but you can play a quick round of Tetris while you wait.The bad-well, there is some lag when accessing stuff other than Amazon's stuff. I don't have an issue waiting 3 seconds to pull up an episode I'm about to binge watch for 1-2 hours, but some may complain. It's definitely less pronounced than my Apple TV2, but not instant like the Fire TV box.-Amazon's stuff is front and center and dominates the UI (for obvious reasons), but the \"recent\" bin makes it easy to get to other apps-Within Amazon streaming, it's often difficult to determine what is free and what is a rental. the little blue stripe at the top indicates it, but you are better off looking through their Prime library than actually looking for specific movies.-No easy way to directly stream content to the stick/TV a la Chromecast. As I've said-- I'm thrilled watching streaming services and local content, but I havent found a way to mirror a web browser or tablet screen onto the device. For me, that is inconsequential. For others, that may be a game breaker. Just know what you are in for.-minor hiccup, but with a top-rated USB power port, it told me that the USB port wasn't supported, but still worked flawlessly. Maybe that is an error.It's basically an elegant stick for a cheap price that does everything it does well. It's beefier than all the other \"stick\" form factor streaming devices, but weaker than all the \"box\" streamers (duh). It's missing a couple of features that not many people will notice. It's also held back by the (intentionally?) bad UI within the Amazon Streaming App. Still, this was the best purchase I've made this year at $20 and at $40, it would still be worth it.", "verified": true, "helpfulness": "4/4", "author": "W. baron"}, {"rating": 5.0, "review": "Very easy to set up and use. The remote is basic, but does the job well.Slightly different use case than Chromecast. With Google's dongle you absolutely require a second device (phone, tablet, PC) to control the playback.  Fire TV Stick's remote is quite sufficient for 99% of all navigation and control.  It only get cumbersome for text searches.  The Stick is a low-spec version of Amazon's Fire TV, so don't expect to play resource intensive games on it.  Basic games work just fine on it though.", "verified": true, "helpfulness": "0/0", "author": "Dmitriy Briskin \"DB\""}]