[{"rating": 5.0, "review": "This thing is great! We used our Wii U for Netflix, Prime, and HBO Go. This stick has everything in one place! The only thing I would warn you about is that the remote is very small...", "verified": true, "helpfulness": "0/0", "author": "TatersDad81"}, {"rating": 3.0, "review": "There is a lot to like about the Fire Stick, but periodic connection problems are causing me to give 3 rather than 4 stars. I occasionally lose the Internet connection for reasons unknown. Also, I experience ongoing streaming issues with Hulu, but that might be an app issue because I seldom have problems streaming Netflix. Also, I wish I checked the compatibility issues a bit more before purchasing. I thought that I was going to be able to mirror my Kindle Fire to my tv screen using the Fire Stick; however, only certain models of the Fire allow you to mirror. Overall, the pros outweight the cons, but I am not quite as excited as I thought I would be.", "verified": true, "helpfulness": "0/0", "author": "mpa 64"}, {"rating": 5.0, "review": "A 66yr.old and taking in all music and film ,well pleased !", "verified": true, "helpfulness": "0/0", "author": "Michael Castillo"}, {"rating": 1.0, "review": "I was not impressed.", "verified": true, "helpfulness": "0/0", "author": "Thomas Hurlock"}, {"rating": 5.0, "review": "Beyond my expectations! Very user friendly. Love it!", "verified": false, "helpfulness": "0/0", "author": "lance"}, {"rating": 5.0, "review": "Super fast shipping, really easy to use, just plug it in, set up your wifi, and you're done within minutes!", "verified": true, "helpfulness": "0/0", "author": "Meredyth Merrow"}, {"rating": 3.0, "review": "I like to concept of the fire stick.  Unless you have a really fast WIFI plan or it's close to the source, it doesn't work very well.  We had to buy a WIFI booster to use it and even then, sometimes it's slow.", "verified": true, "helpfulness": "0/0", "author": "Mom of BBB"}, {"rating": 3.0, "review": "It loses the WiFi signal a lot and you have to reset the firestick to have it catch the signal. I know it's not the WiFi because the 2 or 3 other items on WiFi have no problem.", "verified": true, "helpfulness": "0/0", "author": "dubbled21"}, {"rating": 5.0, "review": "We've had the Fire TV Stick since the end of February (6 months) and love it.  It has a bunch of apps on it and more available to download.  We mainly use it to watch Amazon movies and shows, Netflix, Twitch and YouTube.  Haven't tried any games yet.  It's small and portable.  Sometimes I'll move it to one of our other TVs because our Blue-ray player is missing a specific app.  On one of our TVs, we need to plug the stick into the wall because the USB doesn't have enough power and other other one we can plug it into the TV because the USB provides enough power.Only issue we have on occasion is with the sound, but I don't know if it's the stick to blame or the app we are using.  Sometimes it won't play any sound at all.  I did go into the sound settings and change it to basic settings and it seemed to have helped.I would buy again.", "verified": true, "helpfulness": "0/0", "author": "Adam B"}, {"rating": 4.0, "review": "So far it has been easy to operate, that is my main concern when we buy new gadgets.", "verified": true, "helpfulness": "0/0", "author": "Maria Cremo"}]