[{"rating": 3.0, "review": "PANASONIC PLASMA OWNERS BEWARE!  Love the Stick and hardware, bought one for every TV in the house and the \"EDC Bag\".  But there is a known issue with most Panasonic Plasma TV'S.  You will get a fast blinking green screen every 15 minutes or so.  The only way to cure the problem is change inputs for a few seconds or turning of the Pixel Orbiter option in the menu, which with a plasma is not ideal.  Amazon really needs a fix for this.", "verified": true, "helpfulness": "3/3", "author": "Delana Patnode"}, {"rating": 4.0, "review": "Easy to use and it doesn't freeze like my Roku 3. The only thing I dislike about the Fire TV Stick is the UI and prefer the layout of the Roku's better.", "verified": true, "helpfulness": "0/0", "author": "Father_of_3 \"Father_of_3\""}, {"rating": 3.0, "review": "When it comes to browser media play, chromecast cannot be beaten. Amazon fire stick lacks this feature. It also lacks sports apps(cricket).", "verified": true, "helpfulness": "1/1", "author": "Praveen"}, {"rating": 3.0, "review": "So, so, so BUGGY!!! My netflix keeps crashing and other apps won't load.  It seems to take up much more band width than streaming with my wii.  When it works, it is nice.  Totally unreliable, though.", "verified": true, "helpfulness": "1/1", "author": "Penny Lane \"frecklpwr\""}, {"rating": 5.0, "review": "Good as of now.", "verified": true, "helpfulness": "0/0", "author": "Jose Soto"}, {"rating": 4.0, "review": "The Fire TV stick was very easy to setup on my LG TV and seems to work very well. Right now the only problem I have is the battery cover on the remote.  It has no grip. I couldn't get it opened.  I finally had to grip it with duct tape to open it.  Once the batteries were installed, everything ran smooth.", "verified": true, "helpfulness": "0/0", "author": "S. Davis"}, {"rating": 5.0, "review": "I already have a Fire TV, but the price was so good for this Fire TV Stick, that I could not pass it up.  I plan to give it to my son for Christmas and let him use my Prime account for a month to try the TV Stick out.  I am sure he will sign up for his own Prime account. I downloaded a free copy of Amazon Fire TV Stick User Guide so I can learn a bit more about the stick, and probably will buy one for myself to use in my computer room.", "verified": true, "helpfulness": "0/0", "author": "Snowflashdrop \"Retired = reading and writing!\""}, {"rating": 1.0, "review": "We would have loved to love this thing but just too many connection issues for us.  We're Comcast users with download speeds at just under 120 mbps.  We went through over an hour of tech support doing resets, app testing etc but the fix was only temporary and withing 48 hours the Stick could not maintain any usable connection.  All the support people were great as well as the customer service agent who immediately processed out return.  Fix this thing Amazon...We really want it to work!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is great!  I got it for my wife to use in the bedroom as a Christmas gift.  I have it installed and it's so small and unobtrusive that she hasn't even noticed.  I wrapped the remote but I have been using it with the Android app on my smart phone (which works really well)  It is easy to use and I know she will love it!", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Parks"}, {"rating": 5.0, "review": "fantastic.  Much better than a chromecast because of the remote.", "verified": true, "helpfulness": "0/0", "author": "Kevin Hollingsworth"}]