[{"rating": 2.0, "review": "Doesn't seem to work very well on the Hotel WiFi. Got half way thru a show and lost the connection and could not get it back.", "verified": true, "helpfulness": "0/0", "author": "John R Williams"}, {"rating": 5.0, "review": "It is nice especially that I am prime member, when there is nothing else on cable and we love the words with the music, so we have karaoke night.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this! Instead of paying for cable, I use this and my roommates and I love it. It literally has everything and I love that you don't have to pay monthly for it. Just $40 up front and you're done. Simple. I would definitely recommend this!!", "verified": true, "helpfulness": "0/0", "author": "Shanice Kareema-Haley Sanichar"}, {"rating": 3.0, "review": "The Fire TV Stick serves the purpose as advertised.  Here are my Pro's and Con's after about 4 months of usage:Pros:• Easy to hook-up/install: the process is very intuitive and requires no tools.  From opening the package to using the product took 10 minutes• A relatively surprising library of Apps for various streaming type servicesCons:• Loses Wifi connection periodically and manual reconnect is required• Appears to lack enough allocated memory so there’s often a “buffer lag” when streaming• Does not compare with the ease of use such as iPhone, iPad, and Fire HDX7Overall this is a decent product and would be ideal for people that don't have a good smart phone or table and would like to stream movies/tv programs/music at home to watch on a real TV screen.", "verified": true, "helpfulness": "0/0", "author": "AZDinkster"}, {"rating": 5.0, "review": "Easy to install and the interface is clean.  I have about 5 different media players of this type and this is one of the more easier ones to get up and running. The best way to watch Prime Instant Video in a portable way.  App available for it are not the greatest, but pleasantly surprised there is a way to side load android apps that are not available for direct download on the device using an Android phone.  A little tricky to get mouse based apps to work, but it can be done.", "verified": true, "helpfulness": "0/0", "author": "jumpg8"}, {"rating": 5.0, "review": "Great!  Would buy it again.  I am considering purchasing another for my other TV.", "verified": true, "helpfulness": "0/0", "author": "Gail"}, {"rating": 4.0, "review": "The fire stick was easy to install. It confused me because it is hidden behind the TV and I thought it had to be out front for the remote to work. That's on me. What I do not understand why I have to have both an Apple and a Fire Stick. You both have net flicks but different shows.  Can't there be  universal plug in?", "verified": true, "helpfulness": "0/0", "author": "Joy Walker"}, {"rating": 4.0, "review": "Great product for reasonable price.  Able to watch MLB.tv and HBO with no problems.", "verified": true, "helpfulness": "0/0", "author": "Benjamin J Weigel"}, {"rating": 5.0, "review": "Love it! I can choose everything on my amazon account with ease. It's fast, reliable andeasy to use. The only 2 drawbacks are that  the info for your selection is too small to read even on my large flat screen tv. And most importantly, i bought mine locally from Bestbuy amd it wad the same price as on my amazon prime account and I got it same day. Other than that it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Saliba"}, {"rating": 5.0, "review": "Having a ball with this.", "verified": true, "helpfulness": "0/0", "author": "Roxanne R. Reynolds \"Rox\""}]