[{"rating": 5.0, "review": "Now I can get rid of Direct TV", "verified": true, "helpfulness": "0/1", "author": "Anima Katz"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/1", "author": "Steven Davis"}, {"rating": 1.0, "review": "Amazon...what is the problem w/connectivity? It worked okay at first but now will not connect w/my wi-fi. I get to first page then refuses to recognize my wi-fi.......Apparently this is a frequent problem. almost 1000 comments on it. I dont believe its the TV, I actually bought a new wifi system and still no good, its in the same room, and now Ive spent more time on this then I really wanted. But it haunts me, what is the problem? Is it me, is it the product, is it something that I can change about myself. Come on a trouble shooting help wouldnt kill you would it? How about an upgrade, or admission that maybe you have a problem. Then we can go from there. Pls fix this stix.......", "verified": true, "helpfulness": "2/2", "author": "M. Towne"}, {"rating": 5.0, "review": "its very good, like it better than roku", "verified": true, "helpfulness": "0/1", "author": "M.J.L \"mike\""}, {"rating": 3.0, "review": "I was told by the sales person that the Fire Stick included You Tube. I was not able to find it.", "verified": true, "helpfulness": "0/1", "author": "victor duran"}, {"rating": 5.0, "review": "Awesome! :)", "verified": true, "helpfulness": "0/0", "author": "Alison Strittmatter"}, {"rating": 5.0, "review": "Works exactly as described. Everyone else in the family had a different brand and were amazed that I could access several other providers with one stick.", "verified": true, "helpfulness": "0/1", "author": "J Young"}, {"rating": 3.0, "review": "For context, we have been Roku customers for around 2 years. We subscribe to Amazon Prime, Hulu, and Netflix rather than having cable. We also use Spotify almost exclusively for our music listening. We pre-ordered the Fire TV Stick, excited to check out Amazon's offering. After a month of heavy use, we have switched back to our Roku (see downsides below).There are certain features of the Fire TV Stick that I really enjoy:* It is lightning fast in its navigation.* The implementation of Amazon Prime is (of course) fantastic. As heavy Prime users, this is almost enough to keep us using it.* Netflix app works about as well as it did on Roku, pretty good for the most part.* The feel/experience of the interface is overall very nice.* The ability to \"fling\" YouTube content to your big screen is pretty darn awesome.Downside:* Inability to search all installed apps for a movie or show (Roku has this). It's fairly annoying to have to go in and out of every app to find the cheapest way to watch a particular movie.* The menus are somewhat hard to use, particularly the way one gets to apps is not very intuitive. Sure, I can do it, but after a month I should have been able to do it in my sleep.* Hulu is very broken. To be fair, Hulu works poorly at best on any platform I've tried. That said, there are times when it's completely unwatchable on the Fire TV Stick. Sometimes it'll freeze every couple seconds, other times the image will freeze but the sound will keep going. This all happens when our internet is confirmed good and other apps work fine. This may not be the Stick's fault, but ultimately if you're a heavy Hulu user like we are this just doesn't work.* Spotify app requires a smart phone in order to run and is very hit-or-miss in performance, losing connection to your phone pretty regularly. Roku can stream your music right on the device.I hope that helps those who are looking at Fire TV Stick vs. Roku make their decision. It may be that your deal-breakers aren't the same as mine, but these were big enough issues that I really found myself disliking the Fire TV Stick. It has a lot of potential, and I hope there are some updates to help rectify the issues I've mentioned above.", "verified": true, "helpfulness": "2/2", "author": "Amber Baird"}, {"rating": 5.0, "review": "I have a Sony Media Player and I like the Fire TV Stick better.  It is very user friendly and I have not had any problems.  I am thinking about buying another.", "verified": true, "helpfulness": "1/1", "author": "Steven Pike"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "mommac82"}]