[{"rating": 5.0, "review": "Awesome. Makes watching Prime easy.", "verified": true, "helpfulness": "0/0", "author": "Jo Mo"}, {"rating": 5.0, "review": "Love it! It was so easy to figure out and have been very happy with the remote.", "verified": true, "helpfulness": "0/0", "author": "E. Ruthstrom"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Homer F Cummings"}, {"rating": 5.0, "review": "Used it twice it Hampton Inn hotels and works great for Amazon Video and Netflix, now that web browser logon is available.  Great for traveling.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "The Fire stick is everything I wanted an more. I'm so happy with it!", "verified": true, "helpfulness": "0/0", "author": "AR"}, {"rating": 1.0, "review": "It keeps buffering", "verified": true, "helpfulness": "0/0", "author": "Gary Johnson"}, {"rating": 5.0, "review": "Worked as advertised...good stuff.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'm really pleased overall with the Fire TV stick. I originally had a Roku 2 box. I wasn't happy with its interface, which I found hopelessly outdated and clunky. When I cut the cord on my cable, I decided to sign up with Sling TV, and they had a promo for a free Fire TV stick when paying for 3 months of service up front. Great deal!First of all, a comparison of the specs between the Fire TV, Chromecast, & Roku sticks are a slam dunk for Fire TV. They out class their competitors  in every way. (See here http://gizmodo.com/fire-tv-stick-vs-chromecast-vs-roku-stick-streaming-do-1651295833) And you can really feel the difference when you interact with the Fire TV's interface. It is very slick and modern. It scrolls through options quickly and smoothly. There are a few moments where there is some \"jerkiness\" in the response, but overall very responsiveAs you would probably guess, the Fire TV stick works seamlessly with Amazon services such as their streaming video and music offerings. Plus it comes preset to your Amazon Prime account. So right out of the box you have access to all of the included Prime goodness. And I was able to purchase a couple of episodes of Mad Men with just a click of the button.My only knock on this is the lack of compatibility with HBO Go when using Comcast. I'm able to watch HBO Go on my iPhone while on my home network, so I'm assuming there is some legal mumbo jumbo at work here between Amazon and Comcast preventing it from working on the Fire TV stick. Considering having HBO Go was one of the biggest reasons I wanted a streaming entertainment device, this is a BIG disappointment. If they can get this worked out, I'll raise my review to a perfect 5 stars.", "verified": true, "helpfulness": "0/0", "author": "W. Wittenberg"}, {"rating": 5.0, "review": "Love love love!", "verified": true, "helpfulness": "0/0", "author": "Brittany McGirt"}, {"rating": 4.0, "review": "Just plugged it in and replaced my several years old Apple TV. So much better and easy to use. Just plug it in and start watching.", "verified": true, "helpfulness": "0/0", "author": "Bob"}]