[{"rating": 5.0, "review": "Does exactly what I needed it to do.", "verified": true, "helpfulness": "0/0", "author": "Shad Hargrove"}, {"rating": 5.0, "review": "Great item. Lov it", "verified": true, "helpfulness": "0/0", "author": "J. Thornton"}, {"rating": 2.0, "review": "The fire stick seems to be much more sensitive to inconsistencies with the WiFi signal.  Other streaming devices do not lock up and buffer near as often as the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Ken Simington"}, {"rating": 5.0, "review": "I am very satisfied with the Fire TV stick.  The instructions are very clear, and once you set up the stick is all to go.  Also I like the feature to put it to \"sleep\" and change to regular TV when I am ready to go back, just one click and I am ready to continue watching a movie or listen to music.", "verified": true, "helpfulness": "0/0", "author": "Maria Teresa Perez"}, {"rating": 4.0, "review": "So far, so good. I've been a Netflix customer for 12 years. I can stream their videos and I also receive DVDs, since many older and foreign films aren't available to stream. The Fire TV Stick was easy to install and has worked well. I have noticed some streaming glitches on House of Cards programs and the Nina Simone program aired on June 26, possibly due to a large number  of viewers, not Fire TV. Otherwise, a good product at an affordable price.", "verified": true, "helpfulness": "0/0", "author": "John J. Pruyn"}, {"rating": 5.0, "review": "Delivery was right on time. Easy set up and worked flawlessly. Just what I was looking for. Just make sure you have adequate internet service .", "verified": true, "helpfulness": "0/0", "author": "Gilbert"}, {"rating": 5.0, "review": "Loved it!!", "verified": true, "helpfulness": "0/0", "author": "Susan Turner"}, {"rating": 5.0, "review": "Easy set up, works great!", "verified": true, "helpfulness": "0/0", "author": "Carolyn Hernandez"}, {"rating": 3.0, "review": "It's ok but it's not all it was cracked up to be. I expected a little more power as a posed to having to plug it in for power. Apps worked great not as easy to use withApple products and that's all we own. But at least it worked some what.", "verified": true, "helpfulness": "0/0", "author": "Richard Castellano"}, {"rating": 4.0, "review": "Works great! Has an excellent image, easily connected with wifi and has great apps.", "verified": true, "helpfulness": "0/0", "author": "Jim Cantrell"}]