[{"rating": 5.0, "review": "Best media streaming device I have found yet. Neo tv and Roku does not compare to speed of Fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "jamie broce"}, {"rating": 2.0, "review": "Very limited on show's and movies and a lot of times they can't find a signal.  Wifi is less than 20 feet away.", "verified": true, "helpfulness": "0/0", "author": "kol"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Richie"}, {"rating": 5.0, "review": "use it all the time. Couldn't be easier and so nice to have the option of movies or series.", "verified": true, "helpfulness": "0/0", "author": "Marty"}, {"rating": 5.0, "review": "Easy to set-up and the price is very reasonable.", "verified": true, "helpfulness": "0/0", "author": "judy"}, {"rating": 4.0, "review": "It was much more difficult to set up than advertised.  But once I got it working, I love it.  The content is great!", "verified": true, "helpfulness": "0/0", "author": "Big Aunt Sal \"samc\""}, {"rating": 2.0, "review": "I liked it for the couple months it did work. HDMI gave out and the stick gets super hot, The last time I tried, I can plug it into a computer, even ADB bridge can get screen shots out of it, unfortunately it no longer displays on the multiple tv's I tried it on. They want me to call them but I don't think I will have time, I plan on building my own tiny media center like stick in the future, I can only pray it lasts longer than this fire stick did.", "verified": true, "helpfulness": "0/0", "author": "Internet User"}, {"rating": 2.0, "review": "I can't seem to get it to work. I am not a tech-ki person maybe thats the problem. I hope I can work it out and come back and give you a final \"BRAVO\" review", "verified": true, "helpfulness": "0/0", "author": "gloria fernandez \"Dr. Fernandez\""}, {"rating": 5.0, "review": "GREAT PRODUCT! I like this it gives me NO COMMERCIAL TV and a lot more selections than dish.cable etc...", "verified": true, "helpfulness": "0/0", "author": "Kyle W."}, {"rating": 5.0, "review": "Great quality and price!", "verified": true, "helpfulness": "0/0", "author": "Lisa T."}]