[{"rating": 1.0, "review": "After trying to get it to find my wifi for over an hour.....it finally says successful. ...only to keep dropping signal.  This is the only device in the house that is having connection problems.  Of course amazon gave great customer service and has a replacement on the way but as of right now I have a sour taste in my mouth about this stick,  I got it because I have the nexus player and I can't get anything amazon up there which sucks when your a prime member.  As of right now I'm really not happy with this tv stick, hopefully the replacement will be better and if so I'll adjust my review,  but for right now all I can give is one star and that's being generous since I can't really watch it without Internet connection.", "verified": true, "helpfulness": "0/0", "author": "tbreez"}, {"rating": 5.0, "review": "I've only had the Fire TV Stick for a few weeks but it has by far been a great purchase as I have been enjoying some great prime shows on it. Set up was a snap and haven't had any connectivity issues as of yet. I would recommend this product if you need a good streaming stick with an easy user interface that has plenty of shows and movies to watch for free.", "verified": true, "helpfulness": "0/0", "author": "Matthew Survell"}, {"rating": 3.0, "review": "Streams perfectly. The only reason I gave this a 3 star review is because the remote is sticky when selecting to the left or right. I will go to scroll to the right on Netflix and one click to the right and it will skip over 5+ titles making it real annoying when I'm trying to select a specific title. I'm thinking this might be just with my remote but still would recommend it because of how small it and discrete it is", "verified": true, "helpfulness": "0/0", "author": "Ray R."}, {"rating": 3.0, "review": "Its not as easy plug and play as they say it is. And less free content than advertised.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 5.0, "review": "I love the fire stick. It's small and doesn't take up any surface area space. Being able to control the apps and what my daughter watches is an added plus.", "verified": true, "helpfulness": "0/0", "author": "Gracie A Hines"}, {"rating": 5.0, "review": "So I am an ex Apple employee and all of my products are Apple ecosystem friendly. The only thing keeping this from being perfect is AirPlay support (I know that will never happen). Outside of that the response from the remote/ app is perfect! The video quality is great! I have had zero lag while streaming (I can't say that about my Apple TV). Dolby Digital plus playback for most audio content which is impressive for a small dongle. This baby does require an AC outlet to get a little more juice but other than that there is nothing I can say to complain about this product. If I could use AirPlay on this thing I would literally smash my crapple TV with a sledge hammer.", "verified": true, "helpfulness": "0/0", "author": "Bryan P."}, {"rating": 4.0, "review": "Love it, very easy to setup and use. I wish I had learned about this earlier. My cable bill  will soon be a thing of the past. It does have a tendency to skip a bit not sure why. But overall it's great!!Thanks,", "verified": true, "helpfulness": "0/0", "author": "Frank Negrete"}, {"rating": 5.0, "review": "I'm loving this!! Super convenient access to redbox and my amazon prime and a ton more on my TV. While visiting family, I was able to bring this super small, ultra-convent little guy and plug it into their tv in the guest bedroom. A wifi password later and I had access to all my favorite show-watching programs.", "verified": true, "helpfulness": "0/0", "author": "Brittaney"}, {"rating": 5.0, "review": "Our new technology gadget ! OMG It's amazing. so worth the price and service.", "verified": true, "helpfulness": "0/0", "author": "Heather J. O'dell"}, {"rating": 4.0, "review": "The Fire TV Stick is a teaser if you are not a Amazon Prime member.  They allow you to view the first episode for free and then $.  Once you decide to become a AP member you will be a member for life.  Well worth it!!!!", "verified": true, "helpfulness": "0/0", "author": "kaden munsey"}]