[{"rating": 5.0, "review": "An absolutely brilliant piece of technology! For me, this is an absolute must in the event more HDTV's find they way into my home. Well done, Amazon - well done.", "verified": true, "helpfulness": "0/0", "author": "Michael Peuse"}, {"rating": 5.0, "review": "After much debating and researching, I decided to order the Fire TV Stick.  I had been streaming through my Wii which didn't work the best.  I decided to give this a try to better utilize my Prime membership.It wasn't going to be available for awhile but I ended up getting it earlier than promised.  The set up was very easy!  The interface is easy to use and makes finding something to watch much easier.  I know I'm going to enjoy using the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "GayleN"}, {"rating": 2.0, "review": "The WiFi did not work as expected. The initial installation was in the family room (10 feet away from the modem) alongside an existing Apple TV system that works perfectly. It took a minimum of 20-25 attempts for the stick to learn about the home network - Very frustrating. I reset the modem on multiple occasions in the process of trying to sync the stick with the WiFi. After an hour of trying, it got connected to the WiFi and I was happy. However, the connection dropped immediately when I tried to access the menu. Keep in mind the Apple TV has no problem with the WiFi network from the same exact distance/location where the stick was placed.Long story short, I am limited and was forced to relocate the stick to another room within 5 feet from the modem. I called the help desk - Not much help in that area. The stick is now connected in my office (not the desired or intended location) - I want it in the family room. I Do like the Amazon interface, but I do not like the WiFi limitation. It also freezes often and must be powered cycled periodically. Maybe future product will perform better.", "verified": true, "helpfulness": "0/0", "author": "Barbara Safadi"}, {"rating": 5.0, "review": "This is such an amazing deal! Tons of movies and shows, and installation takes seconds.", "verified": true, "helpfulness": "0/0", "author": "Brandolan"}, {"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Roberta Jones"}, {"rating": 5.0, "review": "The Stick was easy to install and set up and now I am able to watch Amazon movies as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Harold E. Schwartz \"Hal the consumer\""}, {"rating": 4.0, "review": "easy to installeasy to use", "verified": true, "helpfulness": "0/0", "author": "jdlgeo"}, {"rating": 4.0, "review": "Really liking this so far. Previously we only used Amazon Prime on the computer, which meant we'd have kids clustered around a laptop to watch a movie. Once these came out, the price was basically in \"impulse buy\" territory so we pulled the trigger. Now they can watch movies on the TV, which is a huge improvement. Live streaming of other services (i.e. from an Android phone, or even over AirPlay from OS X via an app you can buy) is also possible, which I didn't expect and which is pretty cool. Overall I'm really impressed and quite glad we bought it. Amazing how far this technology has advanced", "verified": true, "helpfulness": "0/0", "author": "David L Mobley"}, {"rating": 5.0, "review": "This arrived earlier than expected, was easy to install, and works great!  I love it.", "verified": true, "helpfulness": "0/0", "author": "June"}, {"rating": 5.0, "review": "Works perfect and great price!", "verified": true, "helpfulness": "0/0", "author": "Austin Scheidemantel \"AU5T1N\""}]