[{"rating": 5.0, "review": "I love my fire stick.", "verified": true, "helpfulness": "0/0", "author": "Julia Brown"}, {"rating": 4.0, "review": "Very good product!", "verified": true, "helpfulness": "0/0", "author": "javier macias"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "The only thing that could make this better would be for ESPN to offer their service for a monthly fee like Hulu or Netflix.  Then I could truly ditch cable!!!!  Also, the voice remote would've been nice as standard equipment.", "verified": true, "helpfulness": "0/0", "author": "Timothy Daniel"}, {"rating": 2.0, "review": "Its nice to access all of your netflix, hulu, and other streaming apps but the games are troublesome first I bought my daughter the 10 dollar disney game and it would go to the intro and stop working then she was playing crossy road and the screen keeps going a blank color in the background. I love Amazon and truly think they are an amazing company who betters my everyday life. I order something from amazon every other day. I love same day shipping! I even planned on my daughter doing her gaming on the amazon fire stick as oppose to her other gaming systems but this has been a flop for gaming. :( I really expected more! Keep at it amazon! I really want to see this function smoothly games and all. Maybe the one I have is a bust? but I just bought it 2 days ago and I am already disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "We love the Fire TV Stick.  In fact we love it so much we purchased a second to leave at our second home (so we don't forget to take it) and just purchased as a gift for our Son.  You can't beat the price and the selection as a Prime member is super.", "verified": true, "helpfulness": "0/0", "author": "P Lambert"}, {"rating": 1.0, "review": "Was expecting to have instant browser access, not able to connect to web.", "verified": true, "helpfulness": "0/0", "author": "Christin DiMario"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Ron \"RC\""}, {"rating": 5.0, "review": "Love it the best item i gave bought in the last six months", "verified": true, "helpfulness": "0/0", "author": "Jeanette Rodriguez"}, {"rating": 5.0, "review": "lov it  really neat", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]