[{"rating": 5.0, "review": "Love this thing. Haven't used my Apple TV since I got it. I've been an Apple fan for years, but find myself slowly converting over to Amazon because their devices integrate better, and for less money, with a larger selection of content.", "verified": true, "helpfulness": "0/0", "author": "Vermonter"}, {"rating": 5.0, "review": "I think it's great for the price verry cool use it every day like it more then using the PS3 for media", "verified": true, "helpfulness": "0/0", "author": "chaz perriera"}, {"rating": 5.0, "review": "AWESOME!!! Exzatly what I was looking for!!", "verified": true, "helpfulness": "0/0", "author": "KimD"}, {"rating": 5.0, "review": "It's been very convenient and we have enjoyed a good variety of content so far.", "verified": true, "helpfulness": "0/0", "author": "Chris Fazzari"}, {"rating": 5.0, "review": "Works just fine!", "verified": true, "helpfulness": "0/0", "author": "Marilyn J. Miller"}, {"rating": 5.0, "review": "I Actually got two of these products when they first came out. Gave one away to my brother, who loves it, and kept one for myself. I use this when I travel. Plugs right into the TV's HDMI port and connects quickly to a WIFI signal. It allows me to stream pretty much anything I want to watch, so I don't have to brother with the lame 15 channels that the hotels offer.", "verified": true, "helpfulness": "0/0", "author": "ACUSERCOR"}, {"rating": 4.0, "review": "Works very much like its larger sibling, and since the recent software update it is really useful for hotels and other places that require you to log in via a web page.  I haven't been to a hotel that requires this level of authentication since using the stick, but it was a big feature touted for the new software.  I use it to play Prime video and Plex content, as such it works extremely well.", "verified": true, "helpfulness": "0/0", "author": "Mr. P. T. Drew"}, {"rating": 5.0, "review": "Love it! Easy to install and use. Plus the sselections are amazing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Grandpa Bill\""}, {"rating": 5.0, "review": "thumbs up", "verified": true, "helpfulness": "0/0", "author": "Horacio Muro"}, {"rating": 3.0, "review": "It's not all it's made out to be, but if you don't own a smart TV it's good.", "verified": true, "helpfulness": "0/0", "author": "Francis W. Burger \"Cash Register Man\""}]