[{"rating": 5.0, "review": "I live in an area without great OTA reception. I receive NBC and ABC with ION only occasionally. Now that I have cut the cord with the cable company, I rely on my Fire TV stick for most of my TV watching. Between the Prime Video choices and a number of free streaming apps I have plenty of viewing choices.", "verified": true, "helpfulness": "0/0", "author": "C. Mehner"}, {"rating": 5.0, "review": "Enjoy it more than my Chromecast. Much more convenient.", "verified": true, "helpfulness": "0/0", "author": "Zachary N Vanselow"}, {"rating": 5.0, "review": "An ideal compliment to any Prime user who is interested in additional video and music options to what is available through commercial satellite or cable.  Very reasonably priced.  I personally use it as much for access to my Prime Music library through my Sony audio system in my den as I do for the video alternatives to broadcast media.  Also comes in handy for remote display of my Kindle Fire HDX, both for apps and photos to my 70\" Sony.  My only wish is for more streaming radio/music choices.", "verified": true, "helpfulness": "0/0", "author": "Bruce W. Kissell"}, {"rating": 1.0, "review": "Terrible!!  Worked for one day and then I could never get it to connect again. Swapped it out for a Roku I had in another room. Roku connects every time I use it. Don't waste your money. Very disappointed. Amazon is usually very good.", "verified": true, "helpfulness": "0/0", "author": "Chris Langmack"}, {"rating": 5.0, "review": "Set up and use very easy.  Great value for what you get. Exactly as expected!", "verified": true, "helpfulness": "0/0", "author": "mudrungirl"}, {"rating": 5.0, "review": "Foreign product and it works superfast. No wait time to buffer or stream a movie.", "verified": true, "helpfulness": "0/0", "author": "Donald K. Kuchta \"Find Him\""}, {"rating": 3.0, "review": "If this device was not so buggy with Plex content it would be 5 stars.  I have hundreds of movies in my library that my kids watch constantly and the stick keep forcing my Plex server to crash.  I don't have that problem with chromecast or apple TV.  I was really hoping the 5Ghz wifi would work better, but it doesn't.", "verified": true, "helpfulness": "1/1", "author": "Clinton D. Hart"}, {"rating": 5.0, "review": "Easy to use and play", "verified": true, "helpfulness": "0/0", "author": "Gretchen Olsen"}, {"rating": 1.0, "review": "I'm extremely upset about this item,its always freezing up,rebooting!!!.  Also we had NO idea that we had to pay for all the shows,we thought it came pre loaded!!; but it doesn't!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Justin Walter Woodard"}, {"rating": 5.0, "review": "Excellent Streaming, Arrived on time, great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]