[{"rating": 1.0, "review": "the advertising for this product is deceptive and very much misunderstood. I have all the same features with my tv provider. this product did not afford anything different except for Netflix which I would never purchase because they only have old old tv shows and movies. we have amazon prime from our device amazon kindle fire tablet. Not pleased not even using. have boxed it up and put in a drawer for when My daughter gets here. she may use it. My neighbor who was curious as to how it worked  will not even take it. He already has same services with his tv provider--different than mine. perhaps that is why your advertising is so deceptive so the public will buy it thinking they are getting something when they are not. if it were possible I would give MINUS 5 stars.", "verified": true, "helpfulness": "0/2", "author": "Cheryl A Giroux"}, {"rating": 5.0, "review": "Easy to set up, great... Love it", "verified": true, "helpfulness": "0/0", "author": "Debra Morton"}, {"rating": 5.0, "review": "Wonderful!", "verified": true, "helpfulness": "0/0", "author": "patty arnold"}, {"rating": 5.0, "review": "very cool portable and easy to use. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it, especially the fact that I can access my Amazon Prime features along with a few games, which is cool when you are visiting someone or in a hotel room on a trip and there is nothing to watch or do. Easy setup, compact, and great for travel.", "verified": true, "helpfulness": "0/0", "author": "PrettyinParis"}, {"rating": 4.0, "review": "When I received this in the mail I was very worried after I started reading reviews (kind of did that in the wrong order I admit).  There are a lot of reviews saying the stick simply doesn't work very well, and many of them are very recent as of the time of this writing.That being said, mine works perfectly.  My router is in my living room and the fire stick is getting the signal all the way up in my bedroom through a vaulted ceiling and more or less diagonally from the router for what that's worth.  The signal is probably travelling about 30-50 feet and is almost flawless.  A one second pause will occur when scrolling through movies or shows very quickly, but that's about it.  I streamed a movie and a few shows over the course of two separate evenings and had no problems.  I also have the middle of the road internet service from my provider, so I'm not using anything crazy fast.  Perhaps some people don't have very good/consistent internet speed?  Maybe they're not using the extender cable that comes in the box (which is recommended)?  I wouldn't know, but I have had zero problems after using mine in a typical fashion on multiple occasions.I think the Fire Stick, Chromecast, and Roku will be seen as more or less identical to most people, although the Fire Stick gets a point docked for not having HBOGo.  With Prime having some HBO stuff they obviously already have a relationship with them so I'm not sure what the hold up is.  If you love HBO like I do you'll have to wait until spring of this year to use it on your Fire Stick.All in all this is a great device and I don't think you can go wrong with any of these sticks.  If you like \"Amazon stuff\" and can wait a little while longer for HBOGo, it's a solid purchase and a great alternative to paying for another cable box in a room you don't use all the time.**PS:  I had to order these from Best Buy since Amazon is out of stock until after Valentine's Day (don't ask me how that works.  back orders?).  I personally would not recommend buying from them.  They were sold out in store so I had a couple shipped to me for free.  Only took one day, however one of the two I bought had the seal broken on it, although everything looked well-packaged inside.  Took it home and I was actually IN someone else's Prime subscription.  As in, I could've sat there and ordered movies and shows to my heart's content on someone else's dime.  This was confirmed by the fact that when I went to sign in to Netflix, someone's e-mail address was already in there.  In short, do not buy from Best Buy and definitely don't return yours there unless you can wipe it clean or ensure that they will do it for you.**", "verified": true, "helpfulness": "0/0", "author": "mjk280"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Milton Clapp"}, {"rating": 5.0, "review": "I love it!  it's awesome.  i can use it in multiple rooms.  it's fast and works great!!  best purchase I made!!", "verified": true, "helpfulness": "0/0", "author": "m kat"}, {"rating": 5.0, "review": "It's wonderful!! We tried (and returned) other products. This one is by far the best!!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 3.0, "review": "The Fire TV stick is fine. The lack of an instruction sheet SUCKS!", "verified": true, "helpfulness": "0/0", "author": "W. Pack"}]