[{"rating": 5.0, "review": "Easy set-up & operation.  Haven't used it much to date, but plan to do so soon.", "verified": true, "helpfulness": "0/0", "author": "Mike Selders"}, {"rating": 5.0, "review": "Works the best for out of everything I use netflix on... however if my roommates would stop playing crossy road on it the up button wouldn't be becoming less responsive... but that is because that is what they do most of the day when they are home trying to beat each others records... love how simple the controller is for it. Nothing to be disappointed about at all!!!", "verified": true, "helpfulness": "0/0", "author": "Charity Spencer"}, {"rating": 5.0, "review": "the thing works as advertised", "verified": true, "helpfulness": "0/0", "author": "Jim Baumann"}, {"rating": 5.0, "review": "It works as expected. The interface is quite a bit different than what I am used to but not hard to learn. I have had it freeze up a few times especially when watching SlingTelevision but that is more likely the service not the stick. Streaming Prime media is great, smooth and clear. Setup was easy and integration with Harmony Hub was covered as well. I have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Set up was a breeze and it's a much better way to access Amazon than through our Bluray player.", "verified": true, "helpfulness": "0/0", "author": "jkolden"}, {"rating": 2.0, "review": "It's very unlikely that I will be using this device.Since it has no connection with you home entertainment servers, so you won't be able to get videos from you media center or musics or photos.", "verified": true, "helpfulness": "0/1", "author": "Roberto Mello"}, {"rating": 5.0, "review": "Awesome,  Just as advertised!", "verified": true, "helpfulness": "0/0", "author": "robert"}, {"rating": 5.0, "review": "Love it, large variety of movies, etc.  Have recommended to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Staci Novak"}, {"rating": 5.0, "review": "This has helped me enjoy many shows I can't see on my satellite programming", "verified": true, "helpfulness": "0/0", "author": "vic"}, {"rating": 5.0, "review": "All you could want and more. We actually use it in the kitchen so my wife can watch when she is in there doing her thing. Very happy", "verified": true, "helpfulness": "0/0", "author": "Gregory Cicchetti"}]