[{"rating": 5.0, "review": "I love it....easy to use....haven't quite figured out the voice control part but I will", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "having issues getting my phone to connect using All-Cast otherwise, so far, pretty decent device.", "verified": true, "helpfulness": "0/0", "author": "Derek P"}, {"rating": 3.0, "review": "Seems to be descent..The problem I have is it doesn't stay connected to my phone's cellular hot spot. It has to be reset to connect to my phone once it loses the connection. The other problem is the screen mirroring is very choppy. Netflix and Amazon instant video work well as long as it stays connected to my phone.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "My boyfriend and I absolutely LOVE our new Fire TV Stick!! Not only is there NO buffering, I can listen to Pandora while doing housework, play solitaire if I'm bored, and even stream local TV stations for free! This is definitely a must have for anyone who enjoys easily accessible entertainment. Set up was quick and easy and only took about 5 minutes!! I would give it ten stars if I could. I was 100% satisfied with this product!", "verified": true, "helpfulness": "0/0", "author": "KState2011"}, {"rating": 5.0, "review": "Very satisfied. Good price and streams very well.easy to use, thanks", "verified": false, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 4.0, "review": "So far it works great. The only drawback is you cannot set the IP address. It has to be auto...unless somehow i am completely missing that option in the menu. Fortunately I have extra routers and I just enabled one. I prefer setting the IP on all my items >.< ...if they update the device to set manual ip/dns etc then it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Vlade \"darkvlade\""}, {"rating": 4.0, "review": "I ordered this when it was on a special promotion for $20. I wish I ordered more. My sister has a Roku and loves not paying for cable. I'm not there yet but I love my Prime movies and TV. I set it up, which only involved plugging it in and typing my wifi password and it was good to go. There is not as much content as Roku, but I wanted this for an extra TV that isn't used all the time and not hooked into cable.It works great. The picture is great and I am very happy. It's better than other options that only work with android (I'm an apple user) and I'm waiting for the app to turn my phone to a remote so I have more options. It is worth the purchase. Amazon has yet to let me down.", "verified": true, "helpfulness": "0/0", "author": "And I Quote \"My Soap Marks\""}, {"rating": 2.0, "review": "Who do I upgrade?  Movies are old.", "verified": true, "helpfulness": "0/0", "author": "D walker"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Yes like others I picked this up for $20 and finally had time Thursday to connect it. It's easy to do and have already put in my favorites. I use a small wireless internet company so I might not be able to watch HD but really don't care. When I get some more time I'll ad the app to my Moto X phone so it will be voice active.", "verified": true, "helpfulness": "0/0", "author": "jo6pac"}]