[{"rating": 3.0, "review": "Functions like a Roku or ChromeCast. Had it plugged in with the extension cable and kept getting a copy protection notice on every single video. Such bulls***!! Re-arranged the cables in the back of the tv so I wouldn't have to use the extension and so far so good. Remote is difficult to use, keeps skipping past the spot you want to stop or the selection just doesn't move. Not real impressed, but it does what it's supposed to.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 4.0, "review": "I'm glad I bought it on sale, I would have hated to pay full-price for this. It's a touch clunky to navigate (all linear, no grids) but it's still worlds better to watch Prime videos on the wide screen rather than on the laptop.  Likewise it's easier to get to/through than bringing up Amazon via the PS3. The fastest way is to browse Amazon.com on your computer than go search for it on the Stick.It's still relatively new and there is room for growth. Time will tell. As of right now, I check it about once a week to see if there's anything new and interesting.", "verified": true, "helpfulness": "0/0", "author": "JamesK144"}, {"rating": 5.0, "review": "I love that I can stream Amazon and Netflix movies and TV shows instantly on my TV. Super easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "Works great !", "verified": true, "helpfulness": "0/0", "author": "dkv"}, {"rating": 2.0, "review": "I don't have the ability to browse without a bunch of inapropriate images coming up.  I don't like the fact, to be able to watch the few clean things available, that I have to sift through the unavoidable filth.", "verified": false, "helpfulness": "0/2", "author": "Sunset Island"}, {"rating": 5.0, "review": "Very happy with purchase.", "verified": true, "helpfulness": "0/1", "author": "Kyle T Rother"}, {"rating": 1.0, "review": "Warning!! If you use wireless internet like \"Xfinitywifi\" and not your own personal network Fire TV will NOT work.  To explain this a little clearer...you know when you go to a hotel and the internet is unsecured but brings up a log in page when you get on for the first time?  Fire TV will see that type of network as unsecure, not prompt you to login, and isn't capable of bringing up a login page.  If I had known this I would have never wasted my money on it.  I'm sure it's cool for people that have their own private networks but if you live in an apartment make sure you're not on some sort of hotspot because Fire TV Stick will be utterly useless.", "verified": true, "helpfulness": "4/5", "author": "David_P"}, {"rating": 5.0, "review": "I have enjoyef the Fire Stick for about a week.", "verified": true, "helpfulness": "0/1", "author": "Jon D"}, {"rating": 5.0, "review": "Well worth the money. Fast and easy setup and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "tkincaid"}, {"rating": 5.0, "review": "Easy", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]