[{"rating": 2.0, "review": "Didn't like the fire stick because you still had to buy single episodes of the majority of popular shows.", "verified": true, "helpfulness": "0/1", "author": "Jason Brogley"}, {"rating": 5.0, "review": "I love the Fire TV Stick. It gives me access to so many show and movie apps.  It it so easy to hook up and use too.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Durham"}, {"rating": 5.0, "review": "Very good I'm enjoying it every day.", "verified": false, "helpfulness": "0/0", "author": "Paulino Burgos"}, {"rating": 5.0, "review": "I bought this to use in my guest room as I don't have cable anymore. It is more responsive than the stick from Google, possibly because it's newer. It has everything I need, and works well. What more could anyone ask for? Oh. The price is great too!", "verified": true, "helpfulness": "0/0", "author": "J. A. Thomas"}, {"rating": 2.0, "review": "I really love Amazon products, so I wanted to love this. Unfortunately i will be sending this back. The HBOgo app doesn't work with Comcast subscribers, and the Spotify is actually a \"Spotify Connect\" that didn't work with either my IPAD or my Iphone. Looking over reviews, these seem to be widespread issues that won't be addressed anytime in the near future. I'm choosing instead to go with a competing model.", "verified": true, "helpfulness": "1/2", "author": "Charisse Petersen"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Steve Satterlee"}, {"rating": 5.0, "review": "I have an Apple TV and a Cromecast...the Fire TV Stick, at least at this point, has them both beat. It offers content thru Prime that I actually want to watch and enjoy. Bundling in music makes me wonder if I'll keep my Spotify account up to date. I bought this in anticipation of cutting the cable, with Fire TV Sticks ability to side load apps it make that option a viable alternative.", "verified": true, "helpfulness": "0/0", "author": "joegrows"}, {"rating": 5.0, "review": "We LOVE our Amazon Fire Stick!!!!!! I like that I can link it with my Kindle and phone, plush it was so easy to set up!!! And we are enjoying the original programs and all the music.  We've completely binge watched Bosch and can't wait for more!Best purchase ever!!!!", "verified": true, "helpfulness": "1/1", "author": "M_M_M"}, {"rating": 5.0, "review": "Love the compact size, it's undetectable and fits on the side of my TV.  Hands down the best streamer, with lots of content.", "verified": true, "helpfulness": "0/0", "author": "N. Buckman"}, {"rating": 5.0, "review": "Absolutely love the Fire tv stick. You can do so much more than with chrome cast. And best part since I'm a prime member it's basically all free!! Love love love this!", "verified": true, "helpfulness": "0/0", "author": "Therise Bond"}]