[{"rating": 4.0, "review": "I like this a lot better than google chromecast, there's a lot more features offered and it's very small and sleek. The only downside is that it randomly loses internet connection and stops playing right in the middle of a movie or tv show. I know it's not my internet because very often I take my work home and am using my laptop when the service drops, my laptop has internet connection, fire tv stick doesn't, it's a no brainer that it isn't my internet providers fault. I still like it though, very fast when it does connect to the internet, and even formats the picture before you play your first show, so it's precise to your screen and viewing requirements. I would five the fire tv stick five stars if there wasn't the common connectivity issue.", "verified": true, "helpfulness": "0/0", "author": "Krysta"}, {"rating": 5.0, "review": "Love this! Thankful for the Prime early purchase price.", "verified": true, "helpfulness": "0/0", "author": "Doc Marine"}, {"rating": 5.0, "review": "Absolutely the best deal we've had in a long time.  Because our Internet service is slow and unreliable, our Netflix just won't stream properly and our provider, Cincinnati Bell, says they never should have sold us 'high speed internet' because we are too far out (after how many years of collecting our fees????)  The Amazon Fire TV Stick gives us the usability to keep us unplugged from satellite.  We are VERY happy and I've recommended this product and Prime TV to a number of co-workers who are tired of poor internet service.  Couldn't be happier.....", "verified": true, "helpfulness": "0/0", "author": "Hometown Girl \"Kathy\""}, {"rating": 5.0, "review": "*happy dance* OMG.....I LOVE IT!! love, love, love! Get it! Everything is included to get set up in five minutes or maybe seven minutes. I'm so happy with it!! You won't regret it. The only thing you need is HDMI port on your tv and a wi-fi network.", "verified": true, "helpfulness": "0/0", "author": "Mary Dixon \"Spider Woman Web Design\""}, {"rating": 4.0, "review": "Pleased with overall operation and ease of use, including Apple Ipod Touch remote app. All apps/channels that we use, such as Hulu+, Amazon PRIME, and Netflix work fine. Not pleased that the recommendation is to have USB powering, however, it appears to run okay with the USB port power on the HDTV (close by).Would love to have the anticipated/promised ability to log into Hotel networks, which is why we bought this device (for travels). Until then, it's not that much different than a Roku stick in terms of high level functions.", "verified": true, "helpfulness": "1/1", "author": "SuchaGoodDeal \"Rick\""}, {"rating": 5.0, "review": "I really love this!  I grabbed a couple of these to put on my tv that dont have internet access. Now we can watch Netflix and Amazon Prime movies from all the tv. Wanted to get a couple more for holiday presents but they are all sold out.", "verified": true, "helpfulness": "0/0", "author": "Randz"}, {"rating": 5.0, "review": "Works great!  Beyond my expectations for the price.", "verified": true, "helpfulness": "0/0", "author": "Wofford M. Poore"}, {"rating": 5.0, "review": "Great Product! So glad I made the investment.", "verified": true, "helpfulness": "0/0", "author": "Global One Jets Aviation"}, {"rating": 5.0, "review": "Worked perfectly. We were killing our kindle after getting rid of cable and I got a great deal on this. It does have to be plugged into an outlet but most people have enough outlets by their tv anyway. Still need to learn how to add music other than on my phone but everything else works fine. Obviously like everyone else it would be nice to be able to search just prime options br it is a business and they are in it to make money so I can't blame the current layout. Great addition to our home. So glad I don't pay for cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Whippedcream"}, {"rating": 1.0, "review": "I have been unable to reach either of my HDTV's with the included power adapter, as it only ships with a five foot cable.  Not very convenient for a product that tout's portability.  I would have purchased a longer cable had I known.", "verified": true, "helpfulness": "1/5", "author": "Lou-Dawg \"2D Aficionado\""}]