[{"rating": 4.0, "review": "Easy to install. Worked well for videos, apps, etc. Usability of the interfaces continue to lag Apple products. Have problems with music playlists - need to reboot once in a while. For the price one pays, a bargain.", "verified": true, "helpfulness": "0/0", "author": "Sathis Menon"}, {"rating": 1.0, "review": "Bad lag:(", "verified": true, "helpfulness": "1/3", "author": "DS"}, {"rating": 2.0, "review": "i recently order an amazon fire tv today and i would like to know if i would receive it before Christmas", "verified": false, "helpfulness": "0/9", "author": "Crystal"}, {"rating": 5.0, "review": "Do you have to have WiFi or internet connection to use it", "verified": false, "helpfulness": "0/3", "author": "erica johnson"}, {"rating": 1.0, "review": "Reception is poor, does not stream well.", "verified": true, "helpfulness": "1/3", "author": "Swain's"}, {"rating": 1.0, "review": "I purchased the Fire TV Stick for $19.99 on a whim.  I've been really disappointed ever since it arrived.  Setup was fine, there was the obligatory update and the rest of the process was ok.  Nothing else worked, however.  Just navigating around in the menus my TV will randomly turn off.  This doesn't happen when playing content like Netflix or Amazon Instant Video, just when navigating the OS menu.Speaking of Instant Video, I purchased Guardians of the Galaxy and spent about 30 min trying to get it to play.  Despite reboots and restarts the video always plays out of sync with the audio.  This is not a problem when I view the movie on the Amazon app built into my Visio TV, or BluRay player, or Xbox.My wife asked me why I purchased something to do what our TV already does.  I'm asking myself why I purchased something that CAN'T do what my TV already does.", "verified": true, "helpfulness": "4/5", "author": "Daveed"}, {"rating": 4.0, "review": "This device works great, is easy to use, and has a pretty sweet remote control app that I was able to download from the Google Play store. As far as what it's intended to do, it's a great product. I don't own a kindle fire, so I am unable to take advantage of the device mirroring capability. I own an iPad, so there's obviously no way to mirror that to the Fire TV Stick. That being said, I was hoping that the Fire TV Stick would keep me from having to purchase Apple TV. And here's why I'm only giving it four stars: Since there are so few apps available on Fire TV, I ended up having to get Apple TV anyway (I don't have cable). For example, Fire TV does not provide apps for FoxNow or for ABC. Apple TV does. However, if you are purchasing this to watch Netflix or Hulu, this is a great option for the price. I moved this device to my bedroom to use for streaming Netflix. Awesome for that! If it had more available apps, it would be five stars, hands down.", "verified": true, "helpfulness": "1/1", "author": "MT###"}, {"rating": 4.0, "review": "Fire stick is working well.  I initially tried using the extension for the HDMI stick that goes into my TV, since the instructions said that I would get a stronger pickup of my Wifi signal.  But my extension must be defective, since it would only work for a couple of seconds before the screen went blank.  Since the system is working well without the extension, I'm not going to bother asking for a replacement for now.  If I moved my router further from the TV I might need it.", "verified": true, "helpfulness": "0/1", "author": "Thomas W Metzger"}, {"rating": 1.0, "review": "Amazon becoming too big ... will lie just to sell a product .", "verified": true, "helpfulness": "1/9", "author": "Emmett Rice"}, {"rating": 1.0, "review": "I have a kindle  fire 7\" HD.  What I am looking for is some device that will let me watch movies on my kindle fire HD without needing an internet or wifi connection.  For example, perhaps a stick that you can record several movies on and then plug into your kindle fire HD and watch wherever you happen to be where wifi or internet is not available.  Is such an application available at a reasonable cost?", "verified": false, "helpfulness": "1/10", "author": "Jed Kelson \"Big Kahuna\""}]