[{"rating": 5.0, "review": "Works great! Installed Kodi app on the firestick and ditched cable.", "verified": true, "helpfulness": "0/0", "author": "jeremy shirey"}, {"rating": 4.0, "review": "It's great for movie night with the family and downloading the hottest apps. Become a member and it's like almost everything is prime. My only concern is not being able to go to amazon site to purchase products.", "verified": true, "helpfulness": "0/0", "author": "TaShaka McMillion"}, {"rating": 5.0, "review": "Absolutely does everything it says it will.  Works great on the older flat screens that are not \"Smart TV's\" or internet capable. A great product and a good investment.  Cheaper than buying a new TV.  It's easily mobile between TV's. but I am going to order two more, so I don't have to switch it out.  I do however recommend you have a strong wireless router that can handle multiple devices.", "verified": true, "helpfulness": "0/0", "author": "Barry Stewart"}, {"rating": 5.0, "review": "Amazon Fire TV Stick is awesome! As a streaming TV lover who ditched cable TV, it's considerably faster than a Roku when using the remote. Although honestly, my Roku offers many MORE channels so it's got some definite advantages there. But, based on the sheer tiny size of the Fire Stick, it will be easy to travel with. I got the stick on special offer for Amazon Prime members and seriously, I thought I'd be giving this thing away as a gift. I wasn't even expecting to LIKE it. But, nope! I'm keeping it right here on the living room TV. I'm sure Amazon will add more channels along the way.", "verified": true, "helpfulness": "0/0", "author": "Taylor in Michigan"}, {"rating": 4.0, "review": "I like the fire tv stick better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ellen Turner"}, {"rating": 5.0, "review": "Fantastic! Love being able to get newer movies.", "verified": true, "helpfulness": "0/0", "author": "amy3"}, {"rating": 3.0, "review": "its not as good as the fire tv. It wont work on all the TV's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome little gadget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "C. Eichhorn"}, {"rating": 4.0, "review": "We like having this - especially when our kids are home as they are movie freaks.  However, we needed a longer cord for it to be able to hook it up, and if you don't have great internet speed, you get times when you either can't access the movie or there are buffering times during the movie.  The selection seems good to me - but I'm not a huge movie buff.  (We did get to watch Mockingjay II in the comfort of our own home before it was released on DVD.  For a fee, but cheaper than going to the movies or buying the DVD.)  If you have really hot internet, this is probably fabulous!", "verified": true, "helpfulness": "0/0", "author": "Sue \"suezieqt\""}]