[{"rating": 5.0, "review": "Best purchase I ever made for my tv.", "verified": true, "helpfulness": "0/0", "author": "Matty"}, {"rating": 5.0, "review": "Does exactly what the description says it will.", "verified": true, "helpfulness": "0/0", "author": "Chad Hult"}, {"rating": 5.0, "review": "I find that this product is fast and easy to use. It is a wonderful addition to the Amazon digital family.", "verified": true, "helpfulness": "0/0", "author": "andrew"}, {"rating": 5.0, "review": "Love the Fire TV stick!  Just ordered 3 more.  Insanely simple to install........plug and play ......literally.  Also have had a google chromecast for several months, still not loving it.  Fire Stick is the way to go!  Only issue, it occassionaly freezes, and can't find home........have to hold the select and play key to reboot it.  (and when it does this I can turn other TV's on and stream or stream on kindle, so it's not a wifi issue.)", "verified": true, "helpfulness": "0/0", "author": "Innovative Restorations"}, {"rating": 4.0, "review": "Great value for the money!", "verified": true, "helpfulness": "0/0", "author": "Peter Mankiewicz"}, {"rating": 5.0, "review": "So easy!", "verified": false, "helpfulness": "0/0", "author": "Lynn Sky"}, {"rating": 5.0, "review": "Love this. The setup on my t.v. Took some getting used to. It responds quickly and the picture is great.", "verified": true, "helpfulness": "0/0", "author": "Zebek2002"}, {"rating": 1.0, "review": "I didn't realize that you needed to be a Prime member in order to utilize most of it's services.  If I was a Prime member, I'm sure that it would be worthwhile, but since I'm not, that doesn't make me very happy or inclined to recommend it.  Or inclined to utilize a company that isn't upfront about the products that it is selling.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I purchased this item in hopes to keep my upstairs \"dumb\" TV alive long enough until I feel the need to purchase a \"smart\" TV. Overall the fire stick does its intended purpose of connecting you to apps and amazon prime accounts. However, there are a few bugs that still need to be worked out. The random dropped wifi and the random buffering problems of tv shows and movies is a big pain. I have read multiple reviews commenting on the very same buffering and dropped WIFI network issues happening. Again, it has some bugs but it was worth the small price as it works 90% of the time.", "verified": true, "helpfulness": "1/1", "author": "D. Ott"}, {"rating": 4.0, "review": "So far so good", "verified": false, "helpfulness": "0/0", "author": "Michael Kidane"}]