[{"rating": 5.0, "review": "HBO Go, Amazon Prime, Netflix, Plex, and XBMC (side-loaded), all on one super fast device? Simply loving this little thing, and I'm so glad I got two when they were available for $20.  This device has replaced my Chromecast and Raspberry Pi.  The best part is that since it supports 5GHz wifi channels, streaming videos over wifi actually works flawlessly in a NYC apartment, where all the 2.5 GHz channels are terribly congested. The bundled bluetooth controller feels great and is very responsive, and voice search on the iOS and Android apps is surprisingly zippy and accurate. Still waiting for PlayPad Pro game controller, now backordered 2.5+ months, though the gameplay experience is better than expected.  Amazon really nailed it with the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Alok Anand"}, {"rating": 2.0, "review": "remote is terrible !!! constantly sticks.. very frustrating.. went back to my rokuif I could, I would return it! or just run over it..", "verified": true, "helpfulness": "0/0", "author": "Idinlv"}, {"rating": 5.0, "review": "love it. I have bought 3", "verified": true, "helpfulness": "0/0", "author": "Cathy Bennett"}, {"rating": 5.0, "review": "Love this thing! Super easy to install and it is sooooo fast!", "verified": true, "helpfulness": "0/0", "author": "Beth Java"}, {"rating": 5.0, "review": "Everyone should own one", "verified": true, "helpfulness": "0/0", "author": "mike216"}, {"rating": 5.0, "review": "The best device ever made for under $40.", "verified": true, "helpfulness": "0/0", "author": "Pablo M."}, {"rating": 4.0, "review": "Has tons of streaming, user friendly scans fast. Enjoying it quite a bit so far", "verified": true, "helpfulness": "0/0", "author": "Desire Hunter"}, {"rating": 5.0, "review": "Awesomeeeeeee!", "verified": true, "helpfulness": "0/0", "author": "Glen S. Garcia"}, {"rating": 1.0, "review": "I don't see the purpose of this product.  There is absolutely no advantage to getting the Fire Stice over cable.  Yes, the overall price is lower than cable but you can't view live shows........such as the Super Bowl but the real kick in the beans is that although you do save money, you have to pay for many services ala carte.  When you total it all up, I'm not sure how much you'll be saving with the Fire Stick as opposed to just sticking with cable and again, with cable you get live shows and local programming.  That's not something the Fire Stick can boast about.I would not recommend this item.", "verified": true, "helpfulness": "0/1", "author": "Nick J. Cuccurullo"}, {"rating": 5.0, "review": "Very good little stick. We already subscribe to Prime and Netflix, so we wanted to take advantage of the streaming video. Although, I wish the app store was more diverse. For example, on Android and Apple, CBS and other regular network stations have their own apps with streaming videos of their latest episodes. That would be nice to have on Amazon Fire TV Stick and its app store.", "verified": true, "helpfulness": "0/0", "author": "E. White \"E&L.White;\""}]