[{"rating": 5.0, "review": "so far it is great", "verified": true, "helpfulness": "0/0", "author": "alva roman"}, {"rating": 4.0, "review": "works well, I wish I could filter out all the non free prime movies.", "verified": true, "helpfulness": "0/0", "author": "W. Ortega"}, {"rating": 4.0, "review": "I bought mine in November ($25 Best Buy) and it has worked just fine even with slow DSL (2.5).  I had no problem with the setup.  The only issues I have had was that it does not show my \"prime\" music playlists and the menu system is a bit lame.", "verified": true, "helpfulness": "1/1", "author": "Papa Vern"}, {"rating": 4.0, "review": "works like a charm", "verified": true, "helpfulness": "0/0", "author": "James Patterson"}, {"rating": 1.0, "review": "..very little substance. Don't get me wrong, it is a nice dongle and the remote is a really nice touch that I miss in my Chromecast device. However, the fact that there is no way to install many apps (including Netflix, YouTube and tons of other) for me is a deal breaker. The support is really nice (although they call at weird hours.. at 10 pm on Sunday I will not do additional testing, sorry) but ineffective (we ended up even loosing an Amazon shipment because they messed up with our address).So if you plan to only watch Amazon Prime Video, this is perfect.Otherwise don't bother and buy a Chromecast device.", "verified": true, "helpfulness": "2/4", "author": "Paolo"}, {"rating": 4.0, "review": "I called 1-888-280-2073. We had unplugged from the t.v but didn't think to unplug from the wall. We did and we are back in business.", "verified": true, "helpfulness": "0/1", "author": "Alexander"}, {"rating": 1.0, "review": "Constantly freezes. Has to be unplugged and plugged back in nearly every time I try and use it after any period of non-use. Also has network issues, and it isn't my network as none of my other devices have any issues when the fire stick is acting up. When it works the picture quality is great. Unfortunately there are just too many issues to make the great picture worth all the other hassle. Time to plug my Chrome back in I guess.", "verified": true, "helpfulness": "4/5", "author": "adam jones"}, {"rating": 5.0, "review": "I'm comparing this to the Roku stick, which I also own.  I much prefer the Amazon Fire TV Stick to the Roku stick.  There response is better.  The picture is better.  I have no issues with the remote (whereas I have had with the Roku stick).  I don't have the loading issues the Roku sometimes experiences.  I'd recommend the Amazon Fire Stick over the Roku any day!", "verified": true, "helpfulness": "1/1", "author": "wtcdean"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kathryn J Venezia"}, {"rating": 5.0, "review": "Love it!Better than cable!Better than Netflix (which is part anyways)!I am yet to stump it and I have a pretty eclectic  taste. Don't be fooled this isn't a cheap alternative to cable. This is a more powerful library with more extensive stacks for those who are willing to pay for it's use.However the money is worth EVERY DIME.", "verified": true, "helpfulness": "0/0", "author": "Patrick Devine"}]