[{"rating": 1.0, "review": "It never works, won't stay connected to internet and/or it constantly buffers while trying to watch a show or movie....$40 wasted", "verified": true, "helpfulness": "0/1", "author": "Angie Potraffke"}, {"rating": 4.0, "review": "It's good but no quality video for showbox.  Kinda wish it was a  little more powerful.  may have to add the fire box for 99.00", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "this amazon fire tv stick is amazing! I recommend for anyone to buy this!!", "verified": true, "helpfulness": "0/0", "author": "samantha j."}, {"rating": 3.0, "review": "I found it a bit confusing as some movies appear, at first point, to be free for Prime members but when you go to play there's a $5.95 charge.It's user friendly and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "I really like the Fire TV Stick.  It was extremely easy to set up and it works well.  The only thing I don't like is that every once in awhile it lets off an electronic buzz sound.  I haven't figured out why.  But other than that, I really like it.", "verified": true, "helpfulness": "0/0", "author": "Sandra MacKay"}, {"rating": 5.0, "review": "terrible of me, did not connecet yet", "verified": true, "helpfulness": "0/1", "author": "k9drl"}, {"rating": 3.0, "review": "Good for the price, but loses signal unless I move the wifi router closer to the bedroom.", "verified": true, "helpfulness": "0/0", "author": "C. Matthews"}, {"rating": 5.0, "review": "Love my fire stick. Extremely easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Mark W"}, {"rating": 4.0, "review": "Works great grand children love games. Downside old moves that we like to watch are to  expensive", "verified": true, "helpfulness": "0/0", "author": "Roger Bartz"}, {"rating": 4.0, "review": "I already had a Google Chrome Cast but we pay for amazon prime (which isn't available on the Chrome Cast) so for our second TV I wanted something that allows me to stream Amazon Prime Instant Video in addition to the other apps I can stream with the Chrome Cast (ESPN, Netflix, YouTube, etc).  The price was right.  Now for my thoughts on the device:For the most part, this is a very good streaming device.  Additionally, it took very little time to set it up because it came pre-set with my amazon account info.  I don't love the user interface; it is not quite as quick and easy as it should be, but it's obviously not rocket science either.  You have to download the apps that you want to use, and if you want to stream something other than amazon prime, you have to go to the applications menu to find the app you would like to use.  The responsiveness isn't going to knock your socks off either...when I'm in the ESPN app for example, it takes a good 3-5 seconds from the time that I click the remote to change the channel to the time the page refreshes to show a different channel.  The same lag happens when I am trying to type to search for a movie in Netflix.  I love the Chrome Cast interface as it is so much more simple and streamlined.  Find what you want to watch on your phone and cast it up to the screen.With that said, on the fire stick I really like that I can download the amazon fireTV app and use my phone as a remote.  The included remote is fine but I hate typing with that thing...\"a\" click, click,click,click,click, \"n\" click, click,click,click click, \"d\" click, click...Over all I think this definitely worth the price.  If faced with the decision again, I would probably buy the fire stick again over the chrome Cast ONLY because I like to be able to use amazon instant video in addition to the other streaming services.", "verified": true, "helpfulness": "0/0", "author": "NPA"}]