[{"rating": 4.0, "review": "The Fire TV Stick does what it sets out to do, efficiently, effectively, and (mostly) painlessly. It won't get you to any new content, but it will make Netflix and Amazon Prime stream conveniently, for a very reasonable 40 bucks.Two minor comments: the remote is poorly designed, and getting the batteries in was like the old SNL skit, \"Triopenin.\"Fortunately, everybody else has had the same problem, and the Internet is full of helpful advice. There is also a downloadable app for various phones and tablets that can be used to control the Stick.Second, I haven't really found any Fire Stick apps that seem worthwhile; most of them are just \"free\" invitations to subscribe to another service. There are some free games, but, in general, Fire TV Stick streams content from services you already subscribe to, and not much else.", "verified": true, "helpfulness": "1/1", "author": "John I. Hamilton \"casual gamer\""}, {"rating": 3.0, "review": "Its OK", "verified": false, "helpfulness": "0/2", "author": "E A 3000"}, {"rating": 3.0, "review": "Got it to only use netflix. Does just that. Not sure if you bought amazon prime if everything is free but its frustrating to clickon what you want and it isnt free. I have yet to find a free show i actually want to watch.", "verified": true, "helpfulness": "1/1", "author": "Casey"}, {"rating": 5.0, "review": "It Is a great product .", "verified": true, "helpfulness": "1/1", "author": "Lisa"}, {"rating": 4.0, "review": "I'm pleased.  No problems except main enter button sticks easily and keys are very senstive--if you press too long multiple presses are detected.But once you learn how to press quickly it's ok.", "verified": true, "helpfulness": "0/0", "author": "T. Coddington"}, {"rating": 5.0, "review": "Roku Stick has more Apps. Fire TV Stick has better picture quality.", "verified": true, "helpfulness": "0/0", "author": "Krzysztof Turek"}, {"rating": 2.0, "review": "I really like the fire stick, but I get a constant crackling after a few minutes of rebooting it. This has happened on 2 TVs so far.", "verified": true, "helpfulness": "0/1", "author": "Faith kimery"}, {"rating": 1.0, "review": "hi seller. I have buy fire TV stick. But i work tow month. I see a problem. It don't work. No power on. I live at Vietnam. Very far as Us. I can't return it. Can you help me?", "verified": true, "helpfulness": "1/4", "author": "ruanlixin"}, {"rating": 4.0, "review": "It helps cut down on the cable bill", "verified": true, "helpfulness": "0/0", "author": "elijah waggle"}, {"rating": 5.0, "review": "this is much better than a ChromeCast", "verified": true, "helpfulness": "1/1", "author": "Cozette A. Savage"}]