[{"rating": 4.0, "review": "I love this thing. The only downfall is that even with a prime account you are required to pay for shows that are free on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "I love the Fire Stick! We were looking for a resolution to get rid of our cable which kept going up in price month after month.  The Fire Sticker has been our savior!  It's extremely easy to use, connect and navigate.  I watched two complet seasons of the Amazon prime shows in one week- Transparent and Black Orphan.  Love the Fire Stick...waiting for them to come back in stock so I can get another one for one of my other TVs!!", "verified": true, "helpfulness": "0/0", "author": "Melanie M."}, {"rating": 5.0, "review": "Works exactly as described. The remote interface is excellent and responsive.My TV is built-in so I had to get a range extender (NETGEAR N300 Wi-Fi Range Extender) for my wireless network in order to connect.I strongly recommend using the web site to browse the offerings and create your \"favorites\" list.The TV browse doesn't have the real estate to do it well.", "verified": true, "helpfulness": "0/0", "author": "P. Hampel"}, {"rating": 5.0, "review": "works as good as the fire tv", "verified": true, "helpfulness": "0/0", "author": "JOHN MAT"}, {"rating": 5.0, "review": "Arrived on time, easy to set up and worked as advertised.", "verified": true, "helpfulness": "0/0", "author": "Sundance 3200"}, {"rating": 5.0, "review": "so simple to use and works like a charm", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LThornton\""}, {"rating": 5.0, "review": "We Love the Fire Stick. We can now watch movies and shows that we cannot watch on cable because t costs too much. It was not hard to set it up and I Love Net Flex. Thank You so much Tonnie hemphill", "verified": true, "helpfulness": "0/0", "author": "Tonnie"}, {"rating": 3.0, "review": "I'm always on board to try new technology, and had this pre-ordered a month before it was released. It is actually a great product being small and portable, but it so far does not add any convenience to our Vizio with its own apps. I'm sure I'll use the Fire Stick more when the Sling app works with it (especially when Sling gets AMC added to their lineup). But there were some concerns with setup that warrant noting and are the sole reason for not having 5-stars:- Amazon claims quick and easy setup. When first plugging in it connected to Wi-Fi quick enough, but immediately downloaded an update that took almost a half an hour to complete. Minus one star.- Before the update on first boot, I connected to my 5G internet. After the update, there are no longer 5G connections. Why would a software update DOWNGRADE the wireless connection? Minus one star.I haven't used the remote control app since the first day, but that is because it was dumb and made no sense to control. It's a shame, because the onscreen keyboard for the Fire Stick is also ridiculous. Functionally- the stick works well, but is no faster or clearer than the apps included on my television already.Oh, and on a final note, when is the Mirracast for Windows ever going to work as originally advertised? This feature alone would make the Fire Stick worth the price even without its core features. But it just doesn't work with Windows or any of my Android Samsung devices.", "verified": true, "helpfulness": "0/0", "author": "Paul M. Zahorosky"}, {"rating": 5.0, "review": "This is a great little gadget.  I've had it about a week now and it's worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "Moonman"}, {"rating": 5.0, "review": "I have Fire TV and purchased the stick for my parents room. They love it! The only thing is my voice remote does not work with the fire stick. I wish it did. It would be easier for them to search for movies they want to see.", "verified": true, "helpfulness": "0/0", "author": "christine m waters"}]