[{"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/1", "author": "Jigu patel"}, {"rating": 5.0, "review": "It's awesome! Way better than a Chromecast. Easy to use. Recommend.", "verified": true, "helpfulness": "0/0", "author": "Karl Fisher"}, {"rating": 5.0, "review": "It was given as a gift...but I am extremely satisfied with all of its features.", "verified": true, "helpfulness": "0/0", "author": "Gary Hill"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Adrian Chinchilla Borbon"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "victor cruz"}, {"rating": 5.0, "review": "Great value and function. We thought about buying a Roku years ago, but this turned out to be the better choice.", "verified": true, "helpfulness": "0/0", "author": "looliepoolie"}, {"rating": 5.0, "review": "It was soooo easy and enjoying our Netflix", "verified": true, "helpfulness": "0/0", "author": "Bernard Dell"}, {"rating": 2.0, "review": "LOVED the idea, can't say the same with the delivery...  Our household owns 3 Roku, 1 PS4, 2 Laptops, 1 Chromecast, and 5 personal devices (cell phones & tablets), all of which run at any time of the day in this household.  What happens when I try to watch something on the Fire Stick because I'm the last to get priority on another device (being the one who pays the bills doesn't go far)?  I end up in the office watching it on my computer...  This thing is the most fickle WiFi device I've ever dealt with...truthfully.  I've gone into my router settings and set up QoS priorities to make this thing second-to-none...yet the boy is in the other room watching Minecraft videos for hours on end on his PS4 (which I've demoted to low priority - shhh)...without skipping a beat, yet I watch a spinning wheel ~ 40 seconds of every minute (oh, I get treated to 20 seconds of seamless video in return, but..well, you get the idea).  I wish I could say it was something else, but all other devices work and I've set this thing as the King of my WiFi Olympus in my router settings.  The girlfriend won't even watch tv with me if I'm utilizing this fine piece of technology.Seriously, if you can get away with something else, go that route.  If not?  Get a bigger monitor for your PC.", "verified": true, "helpfulness": "0/0", "author": "Patrick S."}, {"rating": 5.0, "review": "Love it! Got rid of my cable. So nice not to have commercials and kids get to see what they want.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Meyers"}, {"rating": 5.0, "review": "Great product. Intuitive.", "verified": true, "helpfulness": "0/0", "author": "Kent D. Eilers \"Kent Eilers\""}]