[{"rating": 5.0, "review": "This is the GREATIST item I have every bought.  I would recamend  to everyone. It was easy to install and very easy to use. GET ONE!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "charles huffman"}, {"rating": 5.0, "review": "Awesome!!!!!! Just got another one!!!", "verified": true, "helpfulness": "0/0", "author": "ihas 524 man"}, {"rating": 3.0, "review": "Time will tell on this one. I love the concept, but the component itself seems glitchy at best. There's a pretty significant lag time between pressing a button on the remote and having the unit respond...sometimes several seconds requiring several clicks of a button. We'll keep using it and see if it grows us on any better. The programming itself is good; has all the channels we regularly watch so worth the money there for sure.", "verified": true, "helpfulness": "0/0", "author": "ValeryR"}, {"rating": 5.0, "review": "One of the best electronic gadgets I've ever owned.  Works flawlessly.  If you don't have one, you need one, especially if you're an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Milford Duane Hickory Montgomery \"gotfish\""}, {"rating": 1.0, "review": "could not get it to work properly. very hard to navigate.", "verified": true, "helpfulness": "0/1", "author": "glenn"}, {"rating": 2.0, "review": "Very disappointed that VUDU isn't on you Fire Stick. Most of my DVDs have been converted to digital and I need VUDU to access them.", "verified": true, "helpfulness": "0/0", "author": "Fast Eddie"}, {"rating": 5.0, "review": "I LOVE IT!!!!!!! ITS WORTH EVERY PENNY..........", "verified": true, "helpfulness": "0/0", "author": "Orelia Alston"}, {"rating": 5.0, "review": "We are very happy with the Amazon fire stick! We cut off the cable and just kept our wifi for netflix. We also have hulu. By switching to fire stick we have saved around $40 a month. That really adds up at the end of the year. I do recommend having pretty fast wifi or netflix will lag behind sometimes.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Dusty"}, {"rating": 5.0, "review": "It's exactly what we needed to be able to watch Amazon instant videos on any TV we want", "verified": true, "helpfulness": "0/0", "author": "Terri Dunn"}]