[{"rating": 5.0, "review": "Really impressed by the features and the quality of streaming.Installation was a breeze.", "verified": true, "helpfulness": "0/0", "author": "Mike Sweat"}, {"rating": 2.0, "review": "Tried two separate Fire Sticks on two TVs with two different brand new routers with strong wireless signals... junk resolution, when they even worked at all. Picked up a Roku and AppleTV and they worked beautifully in the same scenarios. Will be returning both Fire Sticks. One extra star given because the menu/navigation is great.", "verified": true, "helpfulness": "0/0", "author": "Elinneb"}, {"rating": 1.0, "review": "Update after buying a second stick: serious amazon service shortfall: if you have a technical problem, like say a stick's inability to see your 5GHz network on the network scan (but sess the 2.4GHz and works through that one), good luck getting a tech support that can understand the issue, let alone have the technical competency to resolve it. I spent 2 hours on the phone, I have to re-explain the issue 5 times, each time you are either given a runaround how they created a case with \"higher technical support\" that never gets resolved (I guess they are waiting for you to give up), or when you ask to be transferred to a US based tech support, you are put on 30 minute plus holds (again the system in place hopes you will abandon any hope in resolution).Update on other shortcomings: there is easy way to cast from your other devices by using apps: allcast that requires allcast client on your device, or AirPlay/DLNA Receiver PRO that works with DLNA and AirPlay devices. Hotel problem is solved with one HooToo TripMate or TP-LINK routers in bridge mode. There is still no way to double dip into your digital purchases across digital ecosystems (iTunes, Google Play).", "verified": true, "helpfulness": "1/1", "author": "Nik Malenovic"}, {"rating": 5.0, "review": "Blows away the Roku Stick in performance and capabilities.  Have a second one on order.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 4.0, "review": "Would rate a 5 if the remote battery compartment was not so difficult to open .Once I got the batteries in the system functioned beautifully.", "verified": true, "helpfulness": "0/0", "author": "G. Roger Miller"}, {"rating": 3.0, "review": "Cool, but the remote needs some help. I have both voice and std. Buttons will either not register or repeat 7-10 times.  Sometimes wakes up tv from sleep- sometimes not. Power requirements not easily met without wall adapt. Speed is fair. Range untested, as it is 6 ft from router. Voice search is a little clunky in what it searches IN. Should be able to search netflix Hulu YouTube catalog etc. always trying to sell me something/ too many unavailable  titles to sift through. Screensaver needs more options. I like it more than I don't like it.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "John W."}, {"rating": 3.0, "review": "apparently our internet provider isn't very strong, as every movie I have tried to watch with my stick has had constant interruptions in service, making it very frustrating to try to watch a movie.  Won't be using it much", "verified": true, "helpfulness": "0/0", "author": "Peggy L. Simmons"}, {"rating": 5.0, "review": "I ordered this when it was offered to Prime members for $19. The price basically said buy it. I must say it is more functional than a Chromecast. Like the games. Netflix/hulu works as required.I would recommend, but only if you have Prime membership, as only then you can access all it has to offer.Delivered as expected.", "verified": true, "helpfulness": "0/0", "author": "raveye"}, {"rating": 4.0, "review": "When it works, the family really enjoys it.  We've had it one week and three different sets of batteries and multiple uplugings...it mostly works.  It seems to get hot too.  Granted, it is only one week so I'll write more if there are any more developments.", "verified": true, "helpfulness": "0/0", "author": "T. Diaz"}]