[{"rating": 5.0, "review": "I love the fire TV stick!!!", "verified": true, "helpfulness": "0/0", "author": "Tara Morell"}, {"rating": 5.0, "review": "Plug N Play, could not be easier to use. Gave me all the access to Prime on a TV with out the smart features. Very happy with it to date.", "verified": true, "helpfulness": "0/1", "author": "Keith Precht"}, {"rating": 3.0, "review": "Not what I expected", "verified": true, "helpfulness": "0/0", "author": "Monica Polanco"}, {"rating": 3.0, "review": "I bought the Amazon Fire TV during the recent Prime week last month. I had a hell of a hard time setting it up, and determined a few things: it's wifi reception is not as good as the Chromecast or the Roku LT, and it does not play as good as either of those devices. It is so weak, that it constantly lagged and crashed. Didn't get any real help from Amazon tech. Just got done with a guy who's going to tell me that I cannot play Kodi/XBMC on my device, and he tried to remove it. Apparently they have the ability to see what we have on our devices, and can decide to remove what they do not like. I am very resentful of this practice. The device is not as good as any of the competition. A Roku runs rings around it as for stability and programming. As mentioned, it is not as sound technically as Chromecast. I know this because I have two Chromecasts and two Roku devices. It's only saving grace is because it runs  Kodi/XBMC, otherwise it's very tech limited.", "verified": true, "helpfulness": "0/0", "author": "komboa"}, {"rating": 5.0, "review": "As advertised. Does need an easy fios app", "verified": true, "helpfulness": "0/0", "author": "MikeMcG"}, {"rating": 5.0, "review": "Love love love my fire stick!  Expands my viewing options Expotenially! Everything is on the big screen so joint decisions can take place… get one, you'll love it!", "verified": true, "helpfulness": "0/0", "author": "Rapid reader"}, {"rating": 5.0, "review": "Great! Easy to navigate and get all my providers on my TV instead of computer easily.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Like the product. Delivered on time. Easy to set up but had trouble with typing password etc. Buttons real touchy, took a little bit to enter info. Other than that enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Perry"}, {"rating": 1.0, "review": "I have 2. Neither is working. All other devices are working fine.", "verified": true, "helpfulness": "0/0", "author": "BJ"}, {"rating": 5.0, "review": "Absolutely blown away by how much power this little stick has. Everything loads on it extremely fast. It is more geared toward Amazon content, but being an Amazon product it is expected. Didn't have internet connection issues that others have spoke of.  Everything for me has been great.", "verified": true, "helpfulness": "0/0", "author": "Ladarian"}]