[{"rating": 3.0, "review": "I've had this 4 days now and already have had to unplug the power twice to reboot it because it wouldn't play any content - could still scroll through selections but got an error when I selected something to play. the reboot restored playtime. I took off a star for that and one for no iOS app.I bought this because I love Amazon, it's prime media content, the amazing discount offered during Black friday deals for PRIME members ($19?) and I am annoyed at my blue ray player's slooooooow and rude interface (demands tv source until it fully loads ~ 2-3 minutes!!). The fire stick is quick to load and scroll and I love how it keeps a feed of my most recently played content. With a toddler we watch THE SAME stuff over and over so its nice that its so easily accessible :) I am very happy with it but am impatient about the iOS app because I want the voice searching features. I don't mind too much that I have to keep rebooting the device, but I've yet to see if this will be an ongoing issue.", "verified": true, "helpfulness": "0/0", "author": "Carrie Staiger \"CS\""}, {"rating": 1.0, "review": "Bought to plug into my computer monitor and use when I shut the computer off (save power and get a remote) but since the monitor itself has no volume control and the stick has no software solution, it's unbearably loud.", "verified": true, "helpfulness": "3/5", "author": "Jordan"}, {"rating": 4.0, "review": "This was easy to setup and works well. The picture is very good, but I do fine that the stick doesn't always respond to the remote. In fact, one time, I had to unplug the power to the Stick to get the remote to work.", "verified": true, "helpfulness": "0/0", "author": "NaplesHow"}, {"rating": 4.0, "review": "If your TV doesn't have internet access the Fire Stick will provide it.  It provides access to Amazon Prime, Netflix, Hulu, and many other apps.  My only complaint is it disconnects from the wifi connection on a regular basis.  My network is strong and I don't have this problem with any other devices.", "verified": true, "helpfulness": "0/0", "author": "Jason L."}, {"rating": 5.0, "review": "i have an Amazon fire TV stick and xfinity cable with ESPN and the watch ESPN app no longer streams live TV like the app says. A week ago live TV was streaming just fine. I believe this is due to the new xfinity app; however, the xfinity app does not work on the Amazon fire TV stick.UPDATE 12/23:Overnight the issue was fixed!  I woke up this morning able to stream Mike and Mike with no issues.  I don't know what the issue was, but it is fixed now.  Adding to the review of the problem, I was able to stream the Monday Night Football feed through the same xfinity account on the watch espn app on an Xbox 360, so I know it wasn't a problem with the xfinity account.", "verified": true, "helpfulness": "2/3", "author": "George R. Harrum"}, {"rating": 5.0, "review": "Works like it should. I got it for the $20 pre-order price, is a great addition for my bedroom TV. I have AppleTV in the living room and this is as fast or faster. I downloaded the remote app for android - a great addition to this device.", "verified": true, "helpfulness": "0/0", "author": "M. Brady"}, {"rating": 5.0, "review": "My husband and I really are enjoying our New Amazon Fire Stick. I would recommend this to anyone who is looking for a good way to stream. They offer so many varieties of movies on Amazon Prime, we find it hard to choose. So go ahead get try it out! It is so  easy to set up. If you like Lifetime movies Amazon Prime is for you. :)", "verified": true, "helpfulness": "0/0", "author": "Alice Saavedra"}, {"rating": 5.0, "review": "Nice product, work great, easy to install. I did discover that if its connected to a HDMI close to the antenna input in will cause reception interferenceon free tv stations. Just move to an HDMI as far away as possible or use provided extension.", "verified": true, "helpfulness": "0/0", "author": "P. R. Hall \"four thumbs\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rae"}, {"rating": 5.0, "review": "this has replaced a boxee box in the bedroom. i have to admit that I approached this tiny gadget with much apprehension; but at $19, i thought it was worth a try. I had received it a few weeks back but in the back of my mind i was thinking this wouldn't work and didn't have the motivation to tinker with it to get it working. I quickly found how mistaken I was!pros:1. wireless - works incredibly well; the old boxee box wireless was worthless and I was a bit apprehensive about the firestick, but i was able to stream some very high bit rate content. i have a firetv and the only difference is that when rewiding/fast forwarding the firestick takes a second or 2 to buffer while the firetv is virtually instanteneous.2. open - with adb turned on; any app can be side loaded. I was able to get kodi/xbmc gotham 13.2 up and running in no time3. kodi gotham 13.2 runs unbelievable well - high bitrate movies work great; i have only a few frames dropped on some very large bitrate items. in fact it worked better on some movies than 13.1 on my firetv; so I immediately upgraded firetv to 13.2.4. compact and easily hidden; radio remote is awesome. don't really use the voice with xbmc. i was able to configure the keymaps they way we like the remote and it works perfectly.5. i got it when it was $19 - and this has to a better deal that the rpi which I have played with as well; still think this is a better bang for the buck at $39 given the other apps (netflix, prime instant video, etc) that it boasts.cons:1. usb power cable is too short; i have the bedroom tv mounted above standing eye-level; so landed up have to include an extension which is not very aesthetic for now.summaryoverall, I'm very impressed by this tiny flash drive looking this. I own the chromecast, boxee box, firetv; owned for a short while all three versions of the apple tv; built my own openelec media center; and this HAS to be the best bang for the buck even at $39; and at $19 it was a steal!", "verified": true, "helpfulness": "0/0", "author": "BCHOOR"}]