[{"rating": 5.0, "review": "great product. expect improve in performence. it is laggy at times.", "verified": true, "helpfulness": "0/0", "author": "Pappu"}, {"rating": 5.0, "review": "We have really enjoyed the Fire TV Stick and are still exploring all the features. Our cable company offers something similar but they can't compete with Amazon Prime membership that allows us so many more options.", "verified": true, "helpfulness": "0/0", "author": "Billy Voliva"}, {"rating": 5.0, "review": "This could not have been any easier to install.  Works great!", "verified": true, "helpfulness": "0/0", "author": "Country Fan"}, {"rating": 4.0, "review": "I got this for Christmas and it loads quickly and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "amra"}, {"rating": 5.0, "review": "Set-up was intuitive and easy and streaming is almost always seamless.  On a shared Uverse line you sometimes have to wait for buffering, depending on who else is online and what they are doing.  Pausing the playback for a minute or two usually allows complete playback without any more buffering delays.  There is a decent selection of materials on Prime without having to subscribe to another service, but if you're looking for the latest releases, you would need something more than Prime.  For my entertainment needs, it fits the bill.", "verified": true, "helpfulness": "0/0", "author": "James T. Beighlie"}, {"rating": 5.0, "review": "Love it. Easy to install, easy to use.", "verified": true, "helpfulness": "0/0", "author": "PaulDeb 7183 \"Rosetapestry\""}, {"rating": 5.0, "review": "love the fire stick easy to use,use it about every day", "verified": true, "helpfulness": "0/0", "author": "rodger"}, {"rating": 5.0, "review": "The Stick takes the frustration out of streaming", "verified": true, "helpfulness": "0/0", "author": "Gary Breen"}, {"rating": 5.0, "review": "It's great! Took me a bit to download the apps I wanted but am glad I purchased this. The movies included through amazon prime aren't as up to date as Netflix but the Fire Stick has SOOOO many channels I've never seen before. I think I'll really enjoy this.", "verified": true, "helpfulness": "0/0", "author": "Ronda L. Ringler \"Ronda\""}, {"rating": 2.0, "review": "I love the the options it gives and simplicity. I only rate it low because it periodically drops the wifi connection. After it does this you have to reset it and reconnect. Many others have same problem. Other devices work just fine on the wifi it won't connect to.", "verified": true, "helpfulness": "0/0", "author": "Brett"}]