[{"rating": 5.0, "review": "Awesome, Working perfectly, no complicated set up. LOVE IT!!", "verified": true, "helpfulness": "0/0", "author": "Pennie"}, {"rating": 3.0, "review": "When its working I like it  but it seems to freeze up and have bad pic quality too often", "verified": true, "helpfulness": "0/0", "author": "eben bubbins"}, {"rating": 5.0, "review": "Love the Amazon Fire TV Stick!  Very small and compact, but packs a big punch! We have also owned a Roku, and the Fire Stick is by far the best choice!", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 5.0, "review": "I was very surprised by the abilities in this little device. I am a Amazon fan!! I havent used any other service on the internet b/c Most of my needs are met with amazon. Most important, it's affordable. I live on a strict budget, I am a single Mother with 3 children. There is onlt one thing that I have had a problem with and that is when the device gets HOT (to the touch) , it doesnt work. My remote will not be able to stop the choices from running on and on. Example: If I choose Netflis and Press it with my remote, My choices start rolling on the screen and I can't stop it until I unplug the fire stick and let it cool off. Then it works normal again. Thanks again.", "verified": true, "helpfulness": "0/0", "author": "Michelle Kornegay \"Michelle Kornegay\""}, {"rating": 5.0, "review": "I like this the only thing I don't like about it is that you have to have game controller to play the games and you can't buy them anywhete. I have some on order with amazon and they are taking forever to come and my Grandsons want them now I hate that about the fire stick", "verified": true, "helpfulness": "0/0", "author": "ARLEEN HARRISON"}, {"rating": 5.0, "review": "Does not take much space, easy to setup. Need power cable and plug this into HDMI.You need to download apps , like Netflix and hulu , as  initially I thought they are pre-installed but installation was very fast.Really convenient and you can also download an app to your phone if you don't want to use the remove it comes with.", "verified": true, "helpfulness": "0/0", "author": "A. Massourian"}, {"rating": 4.0, "review": "Excellent value for the price.", "verified": true, "helpfulness": "0/0", "author": "bob johnson"}, {"rating": 5.0, "review": "Works GREAT here in Hilo, HI!  Worth purchasing.", "verified": true, "helpfulness": "0/0", "author": "surfergal"}, {"rating": 5.0, "review": "Love this!  A must for Prime users!", "verified": true, "helpfulness": "0/0", "author": "B. Blades"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick... I didn't think it would work, as a BluRay player I bought never did sync up with my WiFi.  But, it was SO easy to connect to my TV.  It turned on immediately, showing the step by step set up.  Got connected to the WiFi signal. Showed all the available choices.  I chose an episode of \"The Good Wife\" I had missed, and it started right up!  All High Def.  Just like playing a BluRay movie!  AWESOME! So clear, just - AWESOME!.  I don't know if it will connect to my sound system.  I haven't figured that out yet.  But the speakers on my HDMI Sony are pretty good- not as great as running sound through the audio system.  But good.  I plan on trying out NetFlix, Hulu, everything available through my Amazon Prime subscription.  I am very satisfied with my purchase of the Amazon Fire TV Stick. I think it is terrific!  And I recomend buying one for any one who considers them self any degree of a \"TV-aholic\"!  Happy TV viewing, TV Lovers!", "verified": true, "helpfulness": "0/0", "author": "Kathryn A. Lininger \"K. A. Lininger\""}]