[{"rating": 4.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "WEI-MING JANG"}, {"rating": 4.0, "review": "Looks good on my bookshelf", "verified": true, "helpfulness": "0/0", "author": "Banaszewski"}, {"rating": 1.0, "review": "I think roku is much better. I have that as well.. i pick roku over fire stick because roku has More free apps they offer", "verified": true, "helpfulness": "0/1", "author": "Bullzeye"}, {"rating": 5.0, "review": "Instructions are crystal clear and takes less than 5 minutes to hook up. I was able to start watching Downton Abbey right away. After I surfed the site, I found plenty of free prime entertainment. I did check out my options including Netflix and found I made the right choice with Amazon.", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 4.0, "review": "What I really wanted to do was get easy access to netflix, amazon video and, most importantly, the movies/pictures I have on my network storage drive. Well... I was disappointed because it doesn't access my NAS out of the box. BUT i was able to sideload xmbc to it and now I can play whatever I need from my nas. It's mind blowing (to me anyway) that this thing can decode 720p or 1080p mkv files by itself when sometimes even my laptop struggles. One star docked because I had to put my \"hacker\" hat on and side load xmbc to the device to get it to do what I need.Oh, the remote is great too!", "verified": true, "helpfulness": "0/0", "author": "SerZ"}, {"rating": 5.0, "review": "Love it. Easy to set up and love binge watching series.", "verified": true, "helpfulness": "0/0", "author": "sd carlson"}, {"rating": 5.0, "review": "works great most of the time!", "verified": true, "helpfulness": "0/0", "author": "ccbenn"}, {"rating": 5.0, "review": "I recieved this as a gift with my new tv and im quite pleased, ive enjoyed it and havent had any issues or complications", "verified": true, "helpfulness": "0/0", "author": "Linda Heuder"}, {"rating": 2.0, "review": "STARTED WORKING GREAT THEN STOP WORKING ANOTHER XMAS GIFT GONE BAD THXS AMAZON WONT CONNECT WITH THE NET.", "verified": true, "helpfulness": "0/1", "author": "Jesse D. Walker"}, {"rating": 5.0, "review": "We cut the cable and are glad that Amazon has a low-cost alternative to the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Joseph A. Helt \"-joe\""}]