[{"rating": 5.0, "review": "Prime TV, Netfilx, Pandora, Hulu, Prime Music and so much more in one little, easy to install device. What more could you ask for?", "verified": true, "helpfulness": "0/0", "author": "Lee H."}, {"rating": 5.0, "review": "Several weeks ago I received a pre-release offer of the Amazon Fire Stick for $19.95 instead of the norm $39.95. I wasn't really looking into adding a digital Wi-Fi dimension to my TV viewing but at <$20 instead of the usual $50 to $100 it seemed just the thing. So I ordered one. It arrived on Dec 3rd, one day earlier than promised. The package included everything I needed to install it on my HD tv. In fact it took longer to open the package than to install. In a few minute I was able to watch all the videos I used to watch on my Kindle Fire. I must say I was impressed with the quality of the product, ease of installation and use. The download of videos is as quick or quicker than Xfinity \"On Demand\" and I have access to all Amazon Prime content. I am very pleased. I viewed one movie and now am re-viewing an old, British comedy favorite of mine, \"Red Dwarf\". Bravo Amazon an excellent buy @ even $39.95.", "verified": true, "helpfulness": "1/1", "author": "William A McLaughlin"}, {"rating": 5.0, "review": "Thank You Amazon, I tried the Roku  and it is not as good as the Fire stick TV , and I will let other know that the fire TV is much better . I like it so much that I bought another one. Thank You Amazon", "verified": true, "helpfulness": "0/0", "author": "Snickers"}, {"rating": 4.0, "review": "Better than Chromecast (more selections and remote control); however; either is enough", "verified": true, "helpfulness": "0/0", "author": "JET"}, {"rating": 5.0, "review": "Exceeded expectations, faster and easier to use than Chrome cast.  It learns preferences such as were to start on Netflix even!  Remote is a very nice touch.", "verified": true, "helpfulness": "0/0", "author": "J. Fegan"}, {"rating": 4.0, "review": "I find the amazon fire tv stick very mobile and easy to use. Streaming is very smooth as long as your internet doesn't have issues. I love all the apps I can get on it, but I'm currently waiting for HBO Go to show up in an update. I'm very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Fred Henderson"}, {"rating": 1.0, "review": "Giving one star because the device has to be plugged into an outlet in order for it to work. Also many options (tv or movies) are extra cost even with amazon prime.", "verified": false, "helpfulness": "3/9", "author": "Kristi E."}, {"rating": 5.0, "review": "Works as stated. so far so good.", "verified": true, "helpfulness": "0/0", "author": "Dennis L. Burke"}, {"rating": 4.0, "review": "This is a fantastic product! Very easy to setup (it took less than 10 minutes) and the menu/options are very easy to use.Just a few notes:1. I have a smart TV - the Fire Stick still needs to connect to your home Internet network. The stick works as an HDMI input so it does not interact with any other apps on your Smart TV.2. I am able to use the Fire Stick without the extender and have had no issues with streaming. The picture has been clear and uninterrupted.3. I am a Amazon Prime member and the Fire Stick came attached to my account. On setup you just verify your Amazon account name.4. Very easy to install and use. When I first installed, the stick took about 3 or 4 minutes to verify & update. After that you are prompted to watch an introductory video that may be helpful for the 'technology challenged'I also noticed when you leave the TV on the Fire Stick input for a while it goes to screen saver, which to me seemed pretty neat.I'm very happy I purchased this. Worth the wait!", "verified": true, "helpfulness": "0/0", "author": "Brian B"}, {"rating": 5.0, "review": "This thing is great. It's really smooth, has a great selection of apps and prime features. You can sync all your prime stuff. Music videos and pictures too.  The selection for apps is pretty good. There isn't alot of coop games for use with the fire stick remote in my opinion bit they did have hill climb racing which I'm addicted too lol.I got this on the 20 dollars sale pre order. Even still. its totally worth full price. I definitely recomend.What I like the most is that you can also have Netflix and plex.", "verified": true, "helpfulness": "1/1", "author": "Joe"}]