[{"rating": 5.0, "review": "Kids wanting to watch their shows? Pop this baby out of the tv and take it anywhere. Your shows go with you. I've visited friends and family and this has been a welcome addition each time. You can watch your prime shows through this. you can watch netflix hulu, etc through this. I dropped cable with the help of the fire stick and I haven't looked back since. It is easy to step up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Q. Herman"}, {"rating": 5.0, "review": "I got one from my pre-order close to Thanksgiving last year and have used it every day since I received it. It's a no-brainer for Prime users.Just make sure it's in decent range of your wifi router - this sounds like unnecessary advise, but a lot of people having connectivity issues could avoid it by using it within range.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "It hooks up in seconds. Plug the device into your TV on one end and an electrical outlet on the other (so be sure you've got one available and accessible). Sign in to your wifi and you are up and running. You'll have to set up your accounts for Amazon and other carriers you might use to access HBO and such. In my case, I log on to my Comcast account to gain access to that content. You only have to do it once, though, and you have access all the time. There is so much available as far as content and I won't go into all that because you can see it in the product description. There is a LOT available to you, though.I bought a Chromecast first and it was meh, so I decided to try the Fire Stick and it was a huge improvement in terms of content, speed, consistency of retaining the signal, and having the remote control which is a huge plus. I am using mine pretty far away from my router. The router is downstairs and the Fire Stick is on a TV upstairs and the connection is always listed as \"good\". Not excellent but good seems to work just fine.I use my stick for watching movies and shows on Amazon, HBO, and other providers and I play a couple of the free games. It works perfectly for all that I want to do with it. I have had one for several months and I just bought a second one. You will want to be careful in keeping track of the remote control, though, because it is pretty small. I actually love that it's small because it's so easy to keep in your hand and navigate easily. As is the case with many products today, there is no instruction manual included but it's available online and through the device which walks you through the set up as soon as you plug it in. I'd also thought I'd try the Fire Stick before investing in the more expensive Fire TV but I can't see any reason to upgrade. If you compare the features, the Fire TV may be better suited to those who want to do more with it than what I do.", "verified": true, "helpfulness": "0/0", "author": "mcc57 \"mcc57\""}, {"rating": 5.0, "review": "I personally prefer my Roku on my primary TV, but this works nearly as well and does everything you'd need with a streaming media device.", "verified": true, "helpfulness": "0/0", "author": "J. Jackson \"JJ\""}, {"rating": 5.0, "review": "Very nice, way faster then any other device that we've had. Easy to set up, easy to use. Other streaming devices that we've had left out Amazon, but the Fire Stick includes all the places we want to stream from even Netflix. No negatives at all. Not to mention price, which is far less then other harder to use and less reliable devices. Kudos Amazon...Very well done.", "verified": true, "helpfulness": "0/0", "author": "Maria H. Goldman \"Maria\""}, {"rating": 4.0, "review": "Does not have the voice search or memory of the Amazon Fire TV but works great on the bedroom TV.  I can stop a movie or show in the living room and continue using the stick in the bedroom.  Great value", "verified": true, "helpfulness": "0/0", "author": "Jim \"Just Me\""}, {"rating": 5.0, "review": "I LOVE this product! It works without any lag, and I have access to all my streaming apps.", "verified": true, "helpfulness": "0/0", "author": "cjones"}, {"rating": 5.0, "review": "I absolutely love this!  Finally bought it during the Amazon Prime Day sale and it's so much more than I expected.  I completely cut the cord from cable tv & satellite well over a year ago and with being able to mirror from my Kindle Fire HDX onto the Fire Stick, there is absolutely no way I will ever waste money on cable or satellite services again.  Between my antenna, Roku & the Fire Stick, I am more than set with hours upon hours of all sorts of entertainment, not just with movies & shows but now being able to play Prime Music, use the many apps from my Kindle, my books, everything.  This is a MUST for any Prime member!!!", "verified": true, "helpfulness": "0/0", "author": "Debbie R."}, {"rating": 4.0, "review": "Connected thru Wii.  Firestick remote doesn't work.  Wii remote better for games.", "verified": true, "helpfulness": "0/0", "author": "Carol Cone"}, {"rating": 5.0, "review": "Simple, easy to work and fits well into my small living space.  Thanks.", "verified": true, "helpfulness": "0/0", "author": "Dan Heidel"}]