[{"rating": 5.0, "review": "I was impressed first of all by the way that the Fire TV Stick was packaged. It came in this really nice box. I have been very impressed with it. My mother-in-law enjoyed watching it while she was here with us. Today my husband was watching Fire Stick TV because he said that Netflix is a lot faster and that the picture is better than on our Wii system. I would recommend purchasing it. I paid $35 for it but it is normally $39. For that price (a one time purchase) it is very affordable and a great way to be able to watch TV.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "easy to use great value with amazon prime,movies,music and more!", "verified": true, "helpfulness": "0/0", "author": "Dale D."}, {"rating": 5.0, "review": "LOVE IT.", "verified": true, "helpfulness": "0/0", "author": "deborah Moore"}, {"rating": 5.0, "review": "The fire stick works perfectly. It was a snap to set up. Does every thing it is supposed to do. It works better than the chromcast that I have in my bedroom and you don't have to run it with your tablet just use the remote. GREAT...", "verified": true, "helpfulness": "0/0", "author": "Edmund Rivas"}, {"rating": 5.0, "review": "The Fire Stick was quite simple to set up.  I absolutely love it!  the best part, it was relatively inexpensive.  I highly recommend this to anyone, young or old!", "verified": true, "helpfulness": "0/0", "author": "Ann M Trott"}, {"rating": 5.0, "review": "Great product kids love watching their movies on the tv.", "verified": true, "helpfulness": "0/0", "author": "ahmad bacharouch"}, {"rating": 3.0, "review": "Sluggish playback compared to the Amazon apps on the XBOX 360 and on a Sony TV-had to return. Really nice little gadget though. Worth a try.", "verified": true, "helpfulness": "0/0", "author": "t"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "HB \"HB\""}, {"rating": 3.0, "review": "The device seems to have gotten pretty slow after 6 months of regular use. There are also occasional pauses during movie playback.The video will freeze for 1-5 seconds while audio continues to play.", "verified": true, "helpfulness": "1/1", "author": "Max"}, {"rating": 5.0, "review": "Super Fast on my Big Screen, picture quality exceeded my expectations.  This little thing does a lot", "verified": true, "helpfulness": "0/0", "author": "soldier"}]