[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Tiffany Gorski"}, {"rating": 5.0, "review": "This little thing does the thing. It works just like a fire TV, except that it doesn't have a mic for voice commands and responses a little slower, but still quite remarkable, considering its small size and low cost. (Fire TV responses really fast.) Overall, it's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Shan J."}, {"rating": 5.0, "review": "Amazing for the price.  I was lucky enough to get this for the ridiculously low price of $19, but even for $39, it's a tremendous bargain.This pushes Amazon Prime Content to your HDTV HDMI Input.  It's an amazing little piece of equipment.  The streaming is fast, almost instantaneous, and without lags or jumping or delays.  Of course, you need a decent internet connection.  If you have that, you are set.I love watching Prime Movies on my HDTV now, but it also streams great TV shows, HBO series, Netflix, Hulu, Showtime, PBS, Crackle, and many others.  And, you get great Music streaming like TuneIn Radio, and Pandors.  Of course, all of your Amazon Music is pushed to the device.  I downloaded the \"Voice Recognition Remote\" to my Android Phone.  Works great, but the little remote that comes with it is just fine as well, it just does not do Voice Recognition to pull up videos.  Amazon has designed this device from the ground up to be SIMPLE and FUN to use.  What a GREAT entertainment accessory this is.  Sure beats viewing Prime on my Laptop, Tablet or Chromebook when I am home.One of the easiest decisions to buy in my experience with Amazon.  It's simply terrific.  Buy it and I'd be surprised if you were not completely satisfied.Thanks Amazing... I mean AMAZON!  You guys ROCK!", "verified": true, "helpfulness": "9/10", "author": "WLT"}, {"rating": 3.0, "review": "Its a good start and concept but there need to be more options for movies on prime", "verified": false, "helpfulness": "0/1", "author": "Eileen Borodich"}, {"rating": 2.0, "review": "Requires power cycle reboots almost daily. Not sure why. Power from included USB power adapter and using hdmi extension with the wifi router 10 feet away.  The remote sometimes quits responding and is stuck on menu option and then jumps rapidly between menu options. Does not seem to matter what app I am using. Sometimes says it loses network connection. I thought maybe it was DHCP lease expiration but all other devices like my Kindle Fire TV and Chromecast work great. Hope there is a firmware upgrade that fixes the problem. I wish I had bought another full size Fire TV when it was on sale for $80 instead of the stick.", "verified": true, "helpfulness": "1/1", "author": "Thomas E. Mendenhall"}, {"rating": 4.0, "review": "Really good!", "verified": true, "helpfulness": "0/0", "author": "User"}, {"rating": 4.0, "review": "Amazon has such a nice clean interface. I picked this up and I am so pleased. One done side is if you have Comcast showtime anytime doesn't work. Verizon works fine. If you wanted to use Showtime Anytime with Comcast just go get the Chromecast. I hope which ever party is holding up the deal quickly fixes this since we are moving to Comcast at the end of the week.", "verified": true, "helpfulness": "0/0", "author": "Brian Joyce"}, {"rating": 2.0, "review": "Updating Review of Product, it has been a pain over the last few months, the remote stopped working.  Some of the more popular applications like Hulu and Netflix freeze and shutdown in the middle of a program.  I would not recommend and look at other better alternatives to use.  Waste of money.Great product, would highly recommend, it is a little hard to use at first but as time goes by the interface will improve.  Shipping was another story, it was delivered on a Sunday via USPS and left on my driveway near the road, not even brought up to the door.", "verified": true, "helpfulness": "0/0", "author": "Me"}, {"rating": 4.0, "review": "Wi Fi is very unstable. No issues with Apple TV, PS4 or Roku. Works fine for a while then loses connection.Update...After installing the HDMI extension the connectivity issues no longer exist.", "verified": true, "helpfulness": "0/0", "author": "D. Marley"}, {"rating": 3.0, "review": "Navigation around the offerings is clumsy.", "verified": true, "helpfulness": "0/1", "author": "Walter Skurda"}]