[{"rating": 4.0, "review": "works great, gets you right to the apps you need, the only reason i am not giving it 5 stars is it takes a while to download each app. now i dont know if that is my wifi or the sticks speed to download but still very much so worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jim C \"jc\""}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "WN2"}, {"rating": 5.0, "review": "Performed as I had hoped and expected.  I would recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 5.0, "review": "I got this when Amazon offered a special price for Prime users.  I have an Apple TV and I find the fire stick to be so much easier to use especially when I want to mirror my iPad. Setup was super easy and quick.", "verified": true, "helpfulness": "0/0", "author": "amazon junkie \"amazon junkie\""}, {"rating": 1.0, "review": "Does not work very well at all. Netflix is constantly not working and is very choppy when it does work. I used to have a Roku and I'm thinking of going back to it because this stick is not way better like it claims to be. Do not waste your money on it, it doesn't do any of the things it says it does and it is not fast at all.", "verified": true, "helpfulness": "0/0", "author": "Kirk Schoneman"}, {"rating": 5.0, "review": "It's remarkable how affordable HDMI stick streamers have gotten between the offerings from Google, Roku, and now Amazon as well. The Fire stick is in direct competition with Google's chromecast with only $5 setting them apart in list price; $35 vs. $39. I got this at launch with Prime so it was a no brainer at just under twenty bucks!As far as functionality, both are very similar and will add capability to your Tv to stream netflix and assorted other video services, or your own content via Plex. The Chromecast integrates really well with Google services so Play tv/movies/music are a cinch to use, youtube is there, and the ability to \"cast\" from many ios/android apps. BUT, google expects you to use your phone or tablet as the remote which I found cumbersome over time; switching between apps and resuming control was not always seamless. It crashed on me a few times after I turned off the tv and came back the next day. The app casting support sounds like a great idea but probably a novelty in real life use since I found that I most often just wanted to walk into the room and watch something instead of fiddling with my phone to control the chromecast. Plex support is there but again issues with the handoff from phone to chromecast and just more taps needed overall to get something on the screen.The user experience changes with the Fire stick, with the inclusion of a remote it becomes much more like a self contained viewing experience. Turn on the tv, grab the remote and click to Netflix, Plex, or Amazon's content. The bargain is that you lose Google's tight integration if that matters to you. But for me, I intended to use Netflix and Plex mostly and while the Netflix experience is about the same, Plex really comes alive on the Fire vs Chromecast with full screen poster like view of all your content and it just works with no \"casting\" hand of issues. So if Plex is your preferred choice as well, I highly recommend the Fire over the Chromecast.Oh and the Fire also passes the wife test much easier, she gets the remote experience over the \"only some apps support Chromecast\" explanation.", "verified": true, "helpfulness": "0/0", "author": "BuyItOnce \"Just_Slightly_Geeky\""}, {"rating": 5.0, "review": "Great product great life", "verified": true, "helpfulness": "0/0", "author": "Dana Berg"}, {"rating": 5.0, "review": "I ordered this before it was released.  When I got it I hooked it up and found I liked the interface and the performance.  My youngest son likes to play Flappy Bird on it.  I found that I almost never used it though so I held off on writing a review.  I would occasionally watch movies using my Prime membership and watch BBC shows like Orphan Black on it.  I have Google Fiber TV without AMC and IFC.  Google Fiber TV just added BBC but still hasn't added AMC.  Now that my Fire TV Stick has Sling TV on it and I signed up for Sling TV for $20/month, I know that I will now be using my Fire TV Stick for 2 hours every Sunday night to watch Walking Dead and Talking Dead, every Monday night for an hour to watch Better Call Saul, and every Friday night to watch Comedy Bang Bang on IFC.  So after being virtually unused for months, my Fire TV Stick has now become an indispensable part of my entertainment system being used at least 4 hours a week.", "verified": true, "helpfulness": "0/0", "author": "losmurfs"}, {"rating": 4.0, "review": "it does what its advertised to do", "verified": true, "helpfulness": "0/0", "author": "gloria lofte"}, {"rating": 5.0, "review": "This beats the Chromecast widget by a mile. Streams flawlessly. Menus a smart chimp can navigate....", "verified": true, "helpfulness": "0/0", "author": "Vince"}]