[{"rating": 5.0, "review": "Works great.  The picture is high definition.  The interface is easy.", "verified": true, "helpfulness": "0/0", "author": "F. Parsons"}, {"rating": 5.0, "review": "Works like a charm. Simple and effective.", "verified": true, "helpfulness": "0/0", "author": "Judith A. Anderson"}, {"rating": 5.0, "review": "I love this thing.  The only problem I've had with it was when the cache was full on the netflix app it wouldn't stream.  It took me a while to figure out that you must clear the cache every few months.  Other than that it works great!", "verified": true, "helpfulness": "1/1", "author": "Anthony Ferraro"}, {"rating": 5.0, "review": "MORE movies, No commercials, CUT my cable bill in half and got BETTER content because we opted to join Prime. Also... My older smart phone works GREAT as a second remote.", "verified": true, "helpfulness": "1/1", "author": "Garry Towns"}, {"rating": 5.0, "review": "love it !!!!", "verified": true, "helpfulness": "0/1", "author": "Lilly Ocasio"}, {"rating": 1.0, "review": "Note to Self: Always read the reviews before buying. Samsung and Firestick, thumbs down. I'm sending mine back. Roku?", "verified": true, "helpfulness": "0/0", "author": "paulamjames"}, {"rating": 5.0, "review": "Simple and easy to use", "verified": true, "helpfulness": "0/0", "author": "Sc"}, {"rating": 4.0, "review": "We just received the Fire TV Stick - It took all of about 5 minutes to set it up and start using it. So far we love it. Since we already had an account with Netflix it allows us to view our streaming videos on the bedroom tv easily.Updated review - wish I had this years ago. It works great and we love it.", "verified": true, "helpfulness": "1/1", "author": "Leslie Keller"}, {"rating": 3.0, "review": "Video playback for me is jittery in every app, but its most reliable while playing amazon content.  I have 50 Mbps internet, so I dont think thats the problem, and I also checked for updates.  Seems to run rather hot, I took mine apart and glued heat sinks on, but its still glitchy on playback, so im guessing heat isnt the problem.  However, the temperature may affect lifetime.  It turns on supper fast and navigation is smooth.  The HBO GO app does not run well on mine.  There was one instance I got a blue screen error code about licensing while attempting to play netflix content, but a power cycle of the TV and stick resolved the issue.  The remote works good. Overall it works pretty good and has the ability to improve with software updates, and I like it better than the apple TV", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 1.0, "review": "Constantly locks up on me, have 3 Chromecasts and rarely see an issue.", "verified": false, "helpfulness": "1/1", "author": "Aaron Glaesemann"}]