[{"rating": 4.0, "review": "The idea is great but the selection of free shows and movies is sparse. When will you be adding another \"Bosch\"?", "verified": true, "helpfulness": "0/0", "author": "pat long"}, {"rating": 5.0, "review": "It worked right out of the box.I saw a question about the stick woreing with YouTube.once I purchased the app, $0.99 It works.", "verified": true, "helpfulness": "0/0", "author": "M. Gottovi \"Michael Gottovi\""}, {"rating": 1.0, "review": "Be careful, Fire Stick packages things like NY Times subscriptions and will charge you even if you didn't explicitly ask for it. I had a charge on my CHECKING account!!! Very disconcerting to say the least!", "verified": false, "helpfulness": "1/3", "author": "Caryn Melvin"}, {"rating": 5.0, "review": "I love how easy this device is to use.", "verified": true, "helpfulness": "0/0", "author": "Amanda Procter"}, {"rating": 5.0, "review": "Love this. set up on the family tv and my daughter started watching old episodes of warehouse 13 and Doctor who.As it's linked to the amazon account I can rent movies and  watch them on the TV.Linked to the family Netflix account without issues expanding its use even more.", "verified": true, "helpfulness": "0/0", "author": "fireballux21"}, {"rating": 5.0, "review": "This is the absolute greatest invention.  Honestly.  Works exactly as described. Setup is as easy as described.  It actually motivated me to ditch my previous ISP because I had slight buffering issues; once I changed ISP not a single buffer.  It has a great screensaver that you can customize with your own pictures via Cloud. Access to your shows, apps, music.  What more can you ask for?  100% recommend.  I was one of the lucky ones that purchased during the 2 day sale for $19!  The delivery date was sometime after Christmas but got an email one day saying it would be shipping soon and I ended up getting it on or about Dec. 11th.  Absolute great option for any household.  Portable to any of your televisions.", "verified": true, "helpfulness": "0/0", "author": "BookWorm \"teaguem2005\""}, {"rating": 5.0, "review": "The fire stick is as good as any large media player. For the price it can't be beat and with the Fire Stick APP for voice control its even better.", "verified": true, "helpfulness": "0/0", "author": "Desktop"}, {"rating": 5.0, "review": "With the cost of Cable skyrocketing and my company was going to start charging for a box on every TV I thought I would try this beings we already subscribe to Netflix. Very easy setup great picture.  Not to mention not having to pay the monthly charge for Cable box.", "verified": true, "helpfulness": "0/0", "author": "DEBBY ROBERTS"}, {"rating": 1.0, "review": "Had to return this after having to reset it every single use. I was getting the message that the content is disabled. Ordered a Roku instead.", "verified": true, "helpfulness": "1/3", "author": "Katie"}, {"rating": 4.0, "review": "Works great. Buffers a little in bad weather.", "verified": true, "helpfulness": "0/0", "author": "StacyWest"}]