[{"rating": 5.0, "review": "It rocks!  I am still discovering the many features and attributes but overall I am overwhelmed by the ease of use and the remarkable options it provides.  I love that I can go to Amazon Prime on-line - look up a title and add it to my watchlist immediately - very cool. An excellent value at a very reasonable cost. Thank you", "verified": true, "helpfulness": "0/1", "author": "Shawn Lamberson"}, {"rating": 5.0, "review": "Absolutely great 👍👍👍 highly recommended", "verified": true, "helpfulness": "0/0", "author": "JOSE."}, {"rating": 3.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/1", "author": "D. McCoy"}, {"rating": 5.0, "review": "loe it", "verified": true, "helpfulness": "0/0", "author": "donald bolton"}, {"rating": 5.0, "review": "So inexpensive and chock full of entertainment for all the family.  Ease of installation, simple to use and now we could not go without it!", "verified": true, "helpfulness": "0/0", "author": "Jeanne"}, {"rating": 5.0, "review": "Incredibly easy to use!! I'm 64 years old with minimal tech experience and I was able to install and connect to my wireless in minutes!!! I was streaming video and music in no time!! So happy I got the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Bernard Brackley"}, {"rating": 1.0, "review": "Sadly, the Amazon Fire TV Stick would not work with my wireless system.", "verified": false, "helpfulness": "0/0", "author": "Rose Ann Brady"}, {"rating": 5.0, "review": "It what I was looking for! Perfect.", "verified": true, "helpfulness": "0/0", "author": "Carlos Ricco"}, {"rating": 5.0, "review": "This is the greatest, the whole set up with remote is Awesome. The only downside is sometimes you have to wait for a movie to load even with movies you have purchased or with Netflix. I don't have this issue on my computer so I don't think it is the internet- it could be though since it is a much bigger picture. Once it loads (when I have the issue), you can't beat it", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Spillman"}, {"rating": 5.0, "review": "Perfect great easy to set up I bought a wifi extender to improve my reception", "verified": true, "helpfulness": "0/0", "author": "Ericks1 \"radman51\""}]