[{"rating": 1.0, "review": "Extremely disappointed.We got the fire stick for Christmas and were so excited since our Roku had just bit the dust. At first it worked great, we loved the interface, the picture was great, etc. But for the past 4 months it has been on a steady decline.It constantly disconnects from the internet, for starters. At first we thought this was our mistake, so we replaced our router even though none of our other devices seemed to have any issues. Same problem.At some points we could disconnect the fire stick from the power source, plug it back in and it would work for a while. But now that doesn't even work. We haven't been able to use it in almost a month.Tldr; don't waste your money. Amazon does a lot of things right, this is not one of them.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Daughter loves it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This stick is awesome !!! I'm obsessed", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonderful device.  Easy to use and install.  Perfect for the technology challenged.", "verified": true, "helpfulness": "0/0", "author": "teresa nicholls"}, {"rating": 5.0, "review": "Finally!!!! It arrived, and I love it!!!! I just got it, but so far so good. Easy setup. The menu and layout will take some time for me to get use to it.", "verified": true, "helpfulness": "0/0", "author": "Brittany D. Herndon"}, {"rating": 5.0, "review": "Bought this for my daughter. She complains all the time except for this...also got her tablet to go withit.", "verified": true, "helpfulness": "0/0", "author": "kevin cissell"}, {"rating": 5.0, "review": "I have one of these for our household and I bought one for my daughter's household. We both have 46-inch LED HDTV sets and fast wireless routers in our houses.The Fire TV stick is very easy to set up when you first plug it into your HDMI port on your TV. It walks you through the setup. You don't really need the manual. It was also easy to set up streaming on our wi-fi router. We were up and running in no time. Amazon has a great lineup of programming, It is actually mind-boggling what you can get via the Fire TV stick. There is so much content to watch, that I cannot even begin to list things we discovered. It is fun just going through the program guide, which kind of reminds you of Windows 8, and discovering interesting channels. Some channels (or apps if you will), like Netflix, will cost you  to watch. But there is a ton of free stuff if you are an Amazon Prime member. You get a trial subscription to Amazon Prime when you buy one of these, but I am an Amazon junkie, so I already have Prime Membership. Prime is well worth the $99/year when you see the large amount of programming that is available to you. I buy a LOT of stuff on Amazon because I live in the boonies and it is easier to get stuff on line than drive for miles and waste gas. So I use my Prime membership mostly to get free 2-day shipping. Free programming content via the Fire TV stick is just a bonus for me.We have not had any issues with program lags because of slow Internet connections. The Fire TV stick does some kind of magic buffering in the background so that you can watch shows without any program freezes on the screen. This is a great buy and may wean you from cable or satellite TV.", "verified": true, "helpfulness": "2/4", "author": "Rockster"}, {"rating": 1.0, "review": "Let's see. First of all, I purchased the stick with a Prime account, hoping to receive it as soon as possible. When it finally shipped, I made sure I would be home at the time it was expected to be delivered. Shortly after lunch an alert sounded on my phone to notify me my stick had been delivered. I stepped outside my front door. Not a package to be found. I looked everywhere I could think of where a package might have been dropped off. Nothing. I contacted Amazon immediately. They told me to relax. The USPS had until 8 p.m. to complete the delivery. It's sure to show up. I left for the evening, came home and still no package. Called Amazon immediately again and was assured it would show up the next day. It didn't. Turned out the USPS lost the package and Amazon waited so long to do anything about it that it couldn't be recovered. So, just know Amazon places no emphasis on and puts no effort into holding the USPS accountable for upholding the delivery dates they promise their customers. Strike one. Eventually a replacement stick was mailed via UPS. It arrived without incident. Now I'm using it and two of the things I wanted to use the stick for most were MLB.TV and HBO Go. Last week I tried watching a few baseball games and each and every one of them buffered and stalled to the point I was lucky to see two straight pitches without interruption. I checked my internet speed. That wasn't the problem. Decided to try the MLB.TV app on my smart TV and, voila, the games play perfectly fine. Strike two. OK, so live action isn't the stick's strong suit. Fine. Surely it can handle streaming TV series. Well, not on HBO Go anyway. I've been trying to get into The Sopranos. It's a good show. I've enjoyed watching it. Except EVERY SINGLE TIME I LOAD UP THE APP, IT FREEZES, THE SCREEN TURNS BLACK AND I HAVE TO START BACK FROM THE MAIN MENU. Pathetic. And once I get it to play, once one episode ends, rather than skipping ahead seamlessly to the next episode, again, the screen just goes black. Strike three. Fortunately I do have a smart TV. Watch ESPN is the only app the stick has that my TV doesn't and apparently that's all it's good for. It'll pay for itself over time, but definitely isn't all it's cracked up to be. If it's a better product than the competition, then that's a sad statement on how far the technology still has to go.", "verified": true, "helpfulness": "1/3", "author": "SS \"SS\""}, {"rating": 4.0, "review": "Very nice device.  I got rid of cable almost a year ago.  There's a nice selection of apps. The price worked for me.  There's plenty of content to keep me busy along with my Hulu Plus subscription.  One of the best electronic purchases I've made in a while.", "verified": true, "helpfulness": "0/0", "author": "violingirl"}, {"rating": 2.0, "review": "Connected OK but constantly disconnects and reconnects when streaming. Pretty annoying.", "verified": true, "helpfulness": "0/0", "author": "Could Be Wrong"}]