[{"rating": 5.0, "review": "This thing is awesome,  we love it.The kids love watching old amazing race  shows, I like the movies you can't beat the price for what your getting. GREAT Buy", "verified": true, "helpfulness": "0/0", "author": "Gr"}, {"rating": 5.0, "review": "Once I figured out installation & found my network password..it was a breeze!  I love it, streams a lot better than on my laptop. but I guess I'll have to buy a couple more for other TVs now.", "verified": true, "helpfulness": "0/0", "author": "NANAMARY"}, {"rating": 5.0, "review": "PROS:I had Pre-Ordered weeks before and it was shipped a month in advanced Excitement.I love the fact that it comes with all the tools and more.Amazon prime members soak in your benefits! hahaEasy to install, cute, afforable!CON:Only thing is that it isn't like the commerical, I hate wires that is the main reason I got the Stick, but you have to plug into the charnger which leaves me with a wire problem.BUT I totally love my Fire Stick... I have prime for over 2-3 years now and finally able to watch my movies on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Janessa Tamayo"}, {"rating": 5.0, "review": "Does exactly what it is supposed to do. I love how small it is and that it comes with a remote.", "verified": true, "helpfulness": "0/0", "author": "TBC"}, {"rating": 3.0, "review": "As many of the other reviews stated my stick would work fine for a while and then just would lose the connection. I would switch over to the Roku and it worked fine. I don't find that there's enough difference with this product to go through any problems. Roku stick also does not need any additional power so that's much cleaner install. Back she goes....", "verified": true, "helpfulness": "0/0", "author": "J. Mast"}, {"rating": 5.0, "review": "Very good...works as predicted. Turned my Old TV to a smart TV", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 5.0, "review": "OMG! This little device is amazing! Got it hooked up yesterday. Pretty easy but had to unplug and plug it back in several times before it recognized my network wifi. Once it was up and running - just follow onscreen directions - I spent the rest of the day watching TV. I am a Prime member so many selections are FREE. A few of the movies I looked at you have to rent/buy, but prices were still cheaper than going to the movie theater.  Starting to wonder why I need cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"wrightgal\""}, {"rating": 3.0, "review": "The Fire TV Stick hand controller is awful. The cursor jumps back to start for nor reason when searching. The controller is too small for  real human hands.  Search function does not find words in titles???? It is supposed to be a search function, right?  Menus just repeat the same items.  Help function less than helpful....on the positive side the device seams to play selection well.The device installs after doing some automatic sensing (maybe 10 minutes updating)  without issues.3 stars may be generous for this device. the Google Chromecast for the most part has a much better interface. Prime movies is the only plus.....They might try bata testing before releasing the produce. Disappointing product from Amazon.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got this for my mom, who is a senior with macular degeneration.Can already get to Amazon Prime with a Roku but this remote isjust so much easier for my mom to use and the Prime interface menu is easier to navigate.It's worth it to us to keep the Fire TV Stick on/tuned to the Amazon Prime app and the Roku on Netflixfor ease of use.", "verified": true, "helpfulness": "0/0", "author": "kkdigerati \"kkdigerati\""}, {"rating": 5.0, "review": "I will update after we use for awhile longer, but first impressions have been great! The fire stick was very easy to set up, connected to our WiFi without difficulty, and seems to have good range (our router is upstairs) and the fire stick is downstairs).  Videos play from amazon prime and Netflix well.  The interface is easy to use.  I hear that there's an app you can use for a remote... looking forward to trying that.  Overall, I'm impressed and am looking to purchase another stick for my daughter's bedroom.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]