[{"rating": 1.0, "review": "Hooked it up to my Samsung TV and all I get is \"Not Supported Mode\".I've tried everything I know: turning tv off/on, plugging/unplugging the stick, various button combos on the stick remote.  No luck.  I thought the problem may have been with the Stick itself but when I plugged it into my PC monitor it came up running.  The thing is I bought it so I could use it on my Samsung TV.  VERY DISAPPOINTED.Will probably have to return the unit and get a Chrome Cast.UPDATE: After spending a few hours trying to get this to work on my Samsung TV and reading anything I could find online about how to fix \"Not supported mode\" I had to give up and returned the unit to Amazon.  Looking at other similar devices such as Chrome Cast and Roku they all seem to have one problem or other.  I think I'll wait some.", "verified": true, "helpfulness": "3/5", "author": "JLM"}, {"rating": 2.0, "review": "It is NOT Miracast Certified, and I have no idea how Amazon is getting away with continuing to advertise it us such despite knowing it is not. The stick will not most likely not Miracast if you are using a laptop (specifically Windows), technical support confirmed as such on the phone that it is not yet compatible for those devices. In fact a supervisor was pretty surprised to hear that there is still a big green check next to Miracast Compatibility. Extremely disappointing.", "verified": true, "helpfulness": "2/3", "author": "Ben K"}, {"rating": 5.0, "review": "I am happy  with this product.", "verified": true, "helpfulness": "1/1", "author": "jeff"}, {"rating": 5.0, "review": "I love my Fire stick and got it at a bargain - on sale", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Kuban\""}, {"rating": 4.0, "review": "Love the Amazon Fire Stick!  Only complaint is that you can't turn it off w/o unplugging it. Great for Netflix, Hulu, Vevo and much more!!", "verified": true, "helpfulness": "1/1", "author": "disneymom"}, {"rating": 5.0, "review": "Very simple to use, and great price for what you get.  If you're considering an AppleTV or other similar device, save yourself a bunch of money and get more features with this unit.  Fired up right away, already set up with my Prime credentials.  Got ESPN going live within seconds, too.  I don't see ever considering an AppleTV or other related device again.", "verified": true, "helpfulness": "2/2", "author": "Mike Cross"}, {"rating": 5.0, "review": "Can't believe how much you get for how little you spend.", "verified": true, "helpfulness": "0/0", "author": "Bryan Barnes"}, {"rating": 5.0, "review": "I only bought this to be able to watch streaming channels and applications, instead of having to turn on my video game consoles, which pull a huge  amount of electricity in comparison. It works very fluidly and clearly, and the processing speed of the controls are on point! The remote control feels lacking at the very beginning, but is just perfect! One learns that there is honestly no need for more buttons on a streaming stick item. I use this daily, and it is just amazing!The capability for downloading applications is also massive. I don't use those much, as of yet, but I may in the future, as the Fire TV Stick makes it extremely simple to do so.", "verified": true, "helpfulness": "0/0", "author": "Xavi"}, {"rating": 4.0, "review": "It's a great product but the screen casting is a bit buggy", "verified": true, "helpfulness": "0/0", "author": "Ashar Zaman"}, {"rating": 1.0, "review": "The firestick is a great idea but it will not maintain a connection with my server. All of my other equipment will ambition the connection and the firestick is right above the server but it repeatedly drops signal. This makes it nearly impossible to enjoy the program or the music.", "verified": true, "helpfulness": "3/3", "author": "David Snyder"}]