[{"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Corinne Lucas"}, {"rating": 1.0, "review": "I received one of these as a gift.  I was excited when I opened the box to see what all it would do.  I installed it, as directed by the instructions, signed into my home wifi, it went thru its update process, and then it asked me to sign in with my amazon account info.  I have an amazon.com account with a credit card account attached and also set up for \"1-click\" operations.  I still can not get signed on.  I went to help and went thru so many hoops I got dizzy.  I am sure that this is a good product - others seem to like it.  So in Summary:  HEY AMAZON - YOUR \"HELP\" SUCKS!!!!!.", "verified": false, "helpfulness": "0/0", "author": "Frustrated (Very)"}, {"rating": 1.0, "review": "I bought my fire stick from Best Buy. It didn't work well at all. And I tried to return it to Best Buy and they said Amazon is responsible. Amazon said Best Buy was responsible . So I got  stuck with a  piece of junk .", "verified": true, "helpfulness": "2/3", "author": "Amay"}, {"rating": 5.0, "review": "Works great,,", "verified": true, "helpfulness": "0/0", "author": "Tina Tekavec"}, {"rating": 5.0, "review": "Absolutely love it!!!", "verified": true, "helpfulness": "0/0", "author": "S Dominguez"}, {"rating": 5.0, "review": "So happy that I finally spent the $35 to get this and cancelled my $87 cable!!! This is amazing. We have not missed our cable for a minute! We haven't tried all of it's featured yet. The endless tv and movies are great!! The remote is little and so easy to use! No more big, bulky remote with a zillion buttons!I will probably get a second one for our kitchen tv!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Works great! Only upset I did not set up the pass code BEFORE my son bought $40 worth of Blaze and the Monster Machines. Parents - set up the passcode", "verified": true, "helpfulness": "0/0", "author": "erin russo"}, {"rating": 5.0, "review": "Great  gizmo! We have the box and the stick, and both are fast and easy.", "verified": true, "helpfulness": "0/0", "author": "mike bennett"}, {"rating": 5.0, "review": "Best investment made", "verified": true, "helpfulness": "0/0", "author": "Rashi Copeland"}, {"rating": 5.0, "review": "Great, works fine.", "verified": true, "helpfulness": "0/0", "author": "Gustavo A. Flores Sabillon"}]