[{"rating": 5.0, "review": "So glad we made the purchase for the Fire TV Stick, we are enjoying very much.", "verified": true, "helpfulness": "0/0", "author": "Porch Kitty"}, {"rating": 5.0, "review": "Gave as gift....my son-in-law loves it!", "verified": true, "helpfulness": "0/0", "author": "Mary P Murray \"mpm4bama\""}, {"rating": 5.0, "review": "Love the Amazon Fire TV Stick.  Set up in less than 5 minutes!  Great variety of movies and shows to choose from.  Well worth it!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Baldi"}, {"rating": 1.0, "review": "Waste of time and money. Worked fine the first time, second time, not. would lock up while \" validating pin\". Restarts accomplished nothing. Support was unable to help, said send it back and we'll send you another. Said no thanks, I wil just send it back, enough time wasted on this thing....", "verified": true, "helpfulness": "0/0", "author": "krm"}, {"rating": 5.0, "review": "Love it!  I am able to share all the videos on my Kindle with friends and family members on our television!  It was easy to install and I have access to thousands of free videos with my Amazon Prime membership!!!!", "verified": true, "helpfulness": "0/0", "author": "Reba"}, {"rating": 5.0, "review": "Gr8 product very fast and user friendly. I have a smart TV blue ray players all get the job done but not as fast. clearly the current leader...", "verified": true, "helpfulness": "0/0", "author": "speedy shopper"}, {"rating": 5.0, "review": "It is what I hoped it would be", "verified": true, "helpfulness": "0/0", "author": "Jeffery Akers"}, {"rating": 4.0, "review": "I have this and the Chromecast. The Chromecast is better", "verified": true, "helpfulness": "0/0", "author": "t bird"}, {"rating": 2.0, "review": "Doesn't connect in pass thru mode to my receiver. Every other device on the planet will connect in pass thru mode why not this one?", "verified": true, "helpfulness": "0/0", "author": "James C. Higgins \"jchiggi\""}, {"rating": 5.0, "review": "So sorry we didn't get it sooner.  Great to watch on the big screen", "verified": true, "helpfulness": "0/0", "author": "Lynn Cohen"}]