[{"rating": 4.0, "review": "It's easy to install and offers great features for my TV. I love it.", "verified": true, "helpfulness": "0/0", "author": "Pamela Mullins"}, {"rating": 4.0, "review": "It's GREAT!!", "verified": true, "helpfulness": "0/0", "author": "Carol Ann Ferrari-rogers"}, {"rating": 5.0, "review": "It is awosome and make it easy to use with the included remote control. Waiting to have the app in ios.", "verified": true, "helpfulness": "0/0", "author": "abdullah saad"}, {"rating": 5.0, "review": "I bought this for a gift and my friend and I got to use it the other day.  It's a fabulous product!  It is as sturdy and nice in quality as an Apple TV!  We are very impressed!", "verified": true, "helpfulness": "0/0", "author": "Maggie Parke"}, {"rating": 3.0, "review": "Really not better than the chromecast mine requires frequent restarts for content to load properly which is something I've never had to do with chromecast", "verified": true, "helpfulness": "0/0", "author": "Joshua Thompson"}, {"rating": 1.0, "review": "I was so excited for this to come in the mail!! It worked perfect for1 day ... now it is pretty much useless.  I am not able to keep a wifi connection on the fire tv stick.  My network is running several other devices with NO PROBLEM, this device either has no connection, or \"connected with problems\". Netflix won't even open, and prime videos play for 6 seconds between buffering.  I have checked the discussion posts and several users are experiencing the same issue.  There obviously needs to be an update rolled out, however the device probably won't stay connected long enough to download it!  Very frustrated right now!", "verified": true, "helpfulness": "2/2", "author": "A. Davenport \"sallyjo889\""}, {"rating": 1.0, "review": "I must have gotten a bad one.  Wireless would connect occasionally but would not stay connected.  Constant \"Network not available\" messages.  It sits just 15 feet from my wireless router!Also, keep in mind that some apps (like Plex for example) which are free on other media players (Roku... cough, cough) cost money to get on the Fire TV.  Plex costs $2 on this device.Time to try something else.", "verified": true, "helpfulness": "1/1", "author": "Someone K."}, {"rating": 4.0, "review": "Great streaming device,  does everything that's advertised plus some. Is fast and awesome for Amazon Prime video streaming,  as well as Netflix.  But will not replace your Chromcast.  Amazon stick is for Amazon Prime  like Chromcast is for Google Play.  Indispensable of one another and both brilliant in their way.", "verified": true, "helpfulness": "0/0", "author": "S. Dobrescu"}, {"rating": 1.0, "review": "So after waiting over 2 months to finally receive it, it doesn't work! I have prime and keep getting this error page on everything we try to watch, very frustrating!", "verified": true, "helpfulness": "133/152", "author": "Elizabeth Derencz Wolfe \"Libby\""}, {"rating": 5.0, "review": "Wonderful product, I have been using it a few weeks. My family loves to play the games it is a great option if you can't afford a more advanced gaming system and it is nice to be able to purchase movies directly to my tv without needing a dvd player!", "verified": true, "helpfulness": "0/0", "author": "Megan Blum"}]