[{"rating": 5.0, "review": "This device is amazing. The only thing I wish I had done is get the voice remote.", "verified": true, "helpfulness": "0/0", "author": "Emily Ellisor"}, {"rating": 5.0, "review": "Works great! Very easy to set up and it's nice to have internet TV somewhere besides the 'main box' downstairs.", "verified": true, "helpfulness": "0/0", "author": "SillieOlMe"}, {"rating": 4.0, "review": "it is good; specially when you are subscribed to Amazon Prime Services.But could be great it it allow stream from laptop as well, and this is a major let down for many.", "verified": true, "helpfulness": "0/0", "author": "Amit Jain"}, {"rating": 4.0, "review": "I got it as a gift I already have a machine for Netflix. So not sure yet what I will use it for but I like the simple use and setup also the phone as a remote is cool", "verified": true, "helpfulness": "0/0", "author": "Corey J. Blau \"CBlau\""}, {"rating": 4.0, "review": "Seems to be so far. The only issue is that it does not have all the apps like my apple TV unit does eg. Willow.tv.", "verified": true, "helpfulness": "0/0", "author": "Lorna D. Wallace"}, {"rating": 4.0, "review": "I like it but it would be better if you did not have to plug it in a outlet (always have a wire hanging around)", "verified": true, "helpfulness": "0/0", "author": "Ed Rolfngsmeyer"}, {"rating": 5.0, "review": "Fire TV Stick is all you need. Say no to cable.", "verified": true, "helpfulness": "0/0", "author": "Matt Istvan"}, {"rating": 5.0, "review": "Really didn't know what this was when I bought it for the kids for Christmas, but now that I have used it.  Love it.  Super easy to use and gives access to more than I knew I wanted.", "verified": true, "helpfulness": "0/0", "author": "msp"}, {"rating": 5.0, "review": "Love Love Love! Easy set up. Much easier than my Chrome-cast. But they are different systems too. Plug and play!", "verified": true, "helpfulness": "0/0", "author": "Dave & Susan"}, {"rating": 5.0, "review": "best Christmas gift EVER!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Avalos"}]