[{"rating": 4.0, "review": "I got it today and when I first connected it to my Samsung LN-T4665 I got a \"Not Supported Mode\" on the tv. I was so disappointed. I then tried it on my Sony tv and it worked. I set it up and installed the plex app, added the parental control pin, and tried a couple of home videos from my plex library. Everything seems to be working good. I then decided to try again in my Samsung LN-T4665 in another HDMI port and voila it worked! I am so glad since I bought this device for this tv in my office. I have a Chromecast in my 53\" Sony tv. Later on and this weekend I am going to put it through it paces. Unlike other users who complained about the remote, the remove response it's fine not too slow or too fast. The user interface is kind of intuitive. I was also able to use the MiraCast function from my phone to mirror my android galaxy s4 screen in the fire tv stick. Very nice. This device complement Plex very well since it emulates the Plex web interface really good. That is something that is lacking in the Chromecast Plex android app. What I sometimes do is use my laptop and open the Plex web interface with the chrome browser and cast it to the Chromecast so that I can see my media info. This is kind of inconvenient but do also like the Chromecast.So far in terms of functionality, the manufacture claims (Amazon) and my expectations, in my opinion, this device does what is claims and it does it well. So why do I give it 3 stars? Any device that force me to keep bloatware and/or registration with credit card info for in-app purchase automatically is a 2 stars item from my point of view. I searched and there is no way to remove the featured apps list and other prime video advertising. If I am not a prime member then don't offer me or show prime membership stuff. That is why I love the Chromecast.Changed it to four stars considering that the hardware probably cost a lot more than the $39 I paid for it and they most likely make money by 'scamming' people into buying stuff and becoming prime members. I guess that is one of the reason they gave it so cheap to prime members because once you get used to it you are hooked and will be compelled into renewing your prime membership.", "verified": true, "helpfulness": "0/0", "author": "kiskeya"}, {"rating": 5.0, "review": "k", "verified": true, "helpfulness": "0/0", "author": "Mark Caklovic"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jesus a cervantes"}, {"rating": 5.0, "review": "I love this thing", "verified": true, "helpfulness": "0/0", "author": "Erika"}, {"rating": 5.0, "review": "Works great!! Bought it for Sling TV app and for Amazon prime which I will be getting in the next month or so.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Great purchase.  I was using a laptop for prime videos and the wifi on it died.  The Fire Stick is a great replacement.  Since it came tied to my prime account, it only took a couple of minutes to set up.  Then I watched to short video on how to use it, and that was all that was needed.  I did find once that the stick was taking a long time (15 seconds or so) to connect to my wifi once.  I just unplugged it and plugged it back in and it connected immediately.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "W. Carlson"}, {"rating": 5.0, "review": "Love the firestick. Works better than I had hoped. Highest recommendation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it good love it", "verified": true, "helpfulness": "0/0", "author": "johnny straight"}, {"rating": 3.0, "review": "I don't know if it's Time Warner's incredibly awful service or the Fire TV stick that's to blame, but I have to reboot the stick almost every night.  My wife watches a lot of Netflix, and after about 2 hours of watching, it hangs...resumes....and then says there's no internet connection.  So we wait, and eventually I put my book down and stroll over to the tube, remove the power plug, plug it back after a few seconds, and everything's ready to go.  I've done speedtests from Time Warner's servers and it seems I'm getting my usual poky 11 mbps down, .6 mbps up, so it's most likely not that.", "verified": true, "helpfulness": "0/0", "author": "Emmett Hoops \"at78rpm\""}, {"rating": 1.0, "review": "Does not work, it will not connect to the internet", "verified": true, "helpfulness": "0/0", "author": "Bob Azbell"}]