[{"rating": 5.0, "review": "It works really well. Great with Hulu and Netflix. If you plug it into power it world's even better. If you have a good high speed Internet connection and a newer TV with a USB it's perfect!", "verified": true, "helpfulness": "0/0", "author": "Jason Hansen PFT"}, {"rating": 5.0, "review": "Very happy with this product. Easy to install", "verified": true, "helpfulness": "0/0", "author": "Edward L Brunelle"}, {"rating": 3.0, "review": "The service is great, but would warrant a higher rating if it was more up front about the shows and movies you have to buy.", "verified": true, "helpfulness": "0/0", "author": "Glen H."}, {"rating": 5.0, "review": "the fire stick is awesome have tv without having to pay over 150.00 a month on cable thank you", "verified": true, "helpfulness": "0/0", "author": "Della Hernandez"}, {"rating": 4.0, "review": "After using this stick for about a week, I can verify that this is 10x better than Google's Chromecast offering.  And here are the reasons why:- Extremely fast and intuitive- Wide range of apps (music, news, AIV, games)- Mobile remote support- Games (not that I would play heavily with the given remote)I think the biggest thing that the Fire TV Stick is missing in my opinion is HBO Go.  I am sure they will add this later, but I would really like to have that app available in the near future.  If you are looking for a good device on the market for a huge selection of apps and quick user response from the remote or your phone, look no further!", "verified": true, "helpfulness": "0/0", "author": "Mitul Mittal"}, {"rating": 5.0, "review": "Couldn't be happier with it!", "verified": true, "helpfulness": "0/0", "author": "Jody H."}, {"rating": 3.0, "review": "I found the ad somewhat misleading and therefore my expectations were not met. As near as I can tell so far it's just a smaller BluRay that can't play DVDs.", "verified": true, "helpfulness": "0/0", "author": "William Cox"}, {"rating": 5.0, "review": "Absolutely Love It a lot of good apps", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "very nice product, its like an iPad on my TV", "verified": true, "helpfulness": "0/0", "author": "VegasPBS"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Mitch Morton"}]