[{"rating": 5.0, "review": "Totally amazing! ! It was everything I expected!", "verified": true, "helpfulness": "0/0", "author": "NatashaLRustchak"}, {"rating": 5.0, "review": "Wow", "verified": true, "helpfulness": "0/0", "author": "tom aquaviva"}, {"rating": 5.0, "review": "Installed simply and easily.  Delivers a TON of content.  Remote works perfectly.  Using it with a (dumb older) VIZIO 50\" LCD TV in my basement that has no other video input than the FIRE TV STICK feed from my home WIFI (60mbps from COX).  Presentation is perfect.Fire TV Stick could well be the best purchase I've made in quite a while.(In another location, I have DISH, have used DIRECTV, have DSL-based internet with ROKU.  Have a SMART SAMSUNG TV in the location where I use the Fire TV Stick.  Have not used cable-TV for some years.  Fire TV Stick is best.", "verified": true, "helpfulness": "0/0", "author": "principle instigator \"JL\""}, {"rating": 5.0, "review": "Had to wait to receive, due to demand I would imagine. Works better than we expected. I think Amazon nailed it with this one. Now that I know how well it performs I probably would have upgraded to the voice remote. Takes a little to navigate to figure out what is actually free and what will cost you.", "verified": true, "helpfulness": "0/0", "author": "Jeff b."}, {"rating": 5.0, "review": "Very nice,I love it so far.I just got to get use to it...", "verified": true, "helpfulness": "0/0", "author": "Farmon Childress"}, {"rating": 4.0, "review": "PROS:- Has a remote- Easy to set up- Great for WATCH ESPN and AMAZON PRIME- SLING tvCONS:- NOT GREAT for Hulu- Voice search app doesn't work for non-Amazon video libraries- Less Apps than Chromecast; no HBOgo-Browsing movies could use some improvementSummary:Before buying this app, I already owned the Chromecast; I wanted to see what the Fire Stick had to offer. Generally, I'm a fan of the Fire and wouldn't discourage anyone from buying it, but it definitely isn't a complete replacement for the Chromecast simply because it has fewer apps. That said, it does have a good list of apps including some the Chromecast lacks (namely Amazon Prime and SlingTV) and works great on most of the apps with the exception of Hulu; I've always had problems with it buffering when using the Fire stick. This Hulu problem may be isolated to me so you need to read other reviews to figure out if this is a larger problem.One app that works much, MUCH better on the Fire Stick than the Chromecast is Watch ESPN. This app constantly disconnected or required you to relaunch the stream with Chromecast but seems to work just fine on the Fire.I'm also a fan of the remote because it helped ease my roommates into the world of streaming sticks. For reasons that I cannot understand they never used the Chromecasts that I had in the house, but the second I got an Amazon Fire Stick which has a remote they started using the streaming sticks constantly...I dunno. I don't get it, but I think this is a great gift for the luddites in your life who have resisted being introduced to the world of streaming devices and services.", "verified": true, "helpfulness": "0/0", "author": "The guy"}, {"rating": 5.0, "review": "easy to use!", "verified": true, "helpfulness": "0/0", "author": "GKK \"GKK\""}, {"rating": 4.0, "review": "The Fire Stick Works Great. However it doesn't come with a Power Button. The only way to turn it off is to unplug it. My USB Fire Stick is on back of TV so climbing over the TV wasn't something I wanted to Do. This leaves the only way to turn it off is unplug it from the wall. So I bought a extension cord with switch, So when I hit the switch it cuts the power. The Fire Stick comes with a Screen Saver I guess it stays on all the time. When cutting the power off all settings are saved so nothing will be lost. Once you turn it on the first time it will go to a screen asking you to log on or registered a amazon account. Once you are finished you can always go to setting and log out and log on or create a account. You can restore back to factory setting also. So for gift purposes you need not to worry anyone can created an account or log into their account. The main screen is an app screen this is an android device. So the main screen is Amazon screen from there you can log onto Netflix, Hulu, etc. However when logging into Netflix its an app screen. So a little different then the computer but still easy to work with. The streaming is Great, Perfect Picture, Perfect Sound. The Fire Stick comes with other stuff like Pluto TV which is all music videos kind of like MTV selected your type of music and watch all day. The fire Stick comes with a lot of stuff they are all apps so you have to click download and then the screen comes up. Overall its easy to work, easy to watch movies, music, etc. Its Fast the home button on the remote takes you back to the main screen. Its really nice to watch with the remote, kick back watch movies all day from the couch. I love it my only complaint is no power button but with the extension cord a flick of a button its off.", "verified": true, "helpfulness": "0/1", "author": "Johnny"}, {"rating": 4.0, "review": "Our first step in getting rid of cable. Nice interface for Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "frank nance"}, {"rating": 4.0, "review": "Works pretty well. I'm on the other side of the house from the router. Some times it lags, but that is just the distance. I purchased a Firetv first and it had the same issue.  It works outstandingly when located closer to the router.", "verified": true, "helpfulness": "0/0", "author": "GreyBird4u"}]