[{"rating": 5.0, "review": "Easy to set up and figure out.  I find getting on my laptop to view more of the selections, then putting them on my watch list so I can get to them easier on the TV.  I'm happy to get to my Prime on my TV.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 4.0, "review": "As a frequent viewer of digital content, I have used several streaming media devices including the Apple TV, the Roku and Chromecast. When the opportunity came to purchase the Amazon Fire TV Stick for $19, I took the plunge.The device was simple and straightforward to set up. On my first try, I could not get it to connect to my 5Ghz WiFi connection and had to resort to my slower and more crowded 2.4Ghz band. But - after a quick system update, it connected to my 5Ghz connection fine. I then proceeded to check out the features and channel offerings. I installed several additional channels including Netflix, YouTube, A&E;, History, NatGeo, etc. I tested each and they worked fine - good quality video and quick to load.Having never before used the \"Fire\" interface, I find it a bit confusing to get to channels other than Amazon offerings. I realize that it is geared towards steering me to Amazon content but an easier to use interface might be nice.I have only had the device for a few days and have not had a chance to really give it a good, thorough run but it looks like a great value.I'm hoping that with time, more channel providers will climb on board. There are not many tech offerings for example and it would be nice if the Fire line of devices had more available providers like Roku and Apple's selections...", "verified": true, "helpfulness": "0/0", "author": "Bill Langton"}, {"rating": 1.0, "review": "Purchased 4 for X-MAS gifts wow WASTE i have Rokus and they are much better... first night it was great then in the morning i had to HARD reset it... then spent 30 minutes re loging into all services then no wifi issues and i was 20 ft from router my roku about 50 ft away connects fine and doesnt have issues i returned ALL 4 and I bought more Rokus as gifts this thing is JUNK save your money buy a Roku stick if need be you will be glad you did...........", "verified": false, "helpfulness": "19/25", "author": "DwightMStone \"Dwight Stone\""}, {"rating": 3.0, "review": "Love the quality, love the speed, and love the clarity. Hate that it needs to be plugged in with its adapter directly to an outlet. The tv in our room is mounted on the wall and it's such an eye sore to have the cable just dangling there. The cables length is very comparable to that of a phone charger. But hey can't beat the price of $19.99 gonna go and grab an extension cord and get creative. Yeah I know more cables!", "verified": true, "helpfulness": "1/1", "author": "Chrystal Valerie"}, {"rating": 5.0, "review": "Love it.  Super fast and responsive", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "The control it self makes it that much better than chromecast.Software wise its still a bit raw but definitely full of potential!Looks like this one will replace all my chromecast devices at home.Great job amazon!", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 5.0, "review": "Ok.", "verified": true, "helpfulness": "0/4", "author": "Ralf Pais T. Furtado \"rockrocha\""}, {"rating": 5.0, "review": "I am impressed by its streaming capability. Its better than some of wired devices I have used. User interface is simple to use.", "verified": true, "helpfulness": "0/0", "author": "yogesh \"yk\""}, {"rating": 5.0, "review": "Love it! Very easy to install and navigate. Loving it so far.", "verified": true, "helpfulness": "0/0", "author": "raom"}, {"rating": 4.0, "review": "A solid item. Only thing that is unclear is that the stick mesa power connection,something that is not shown on the ad copy on the left. I'm sure if it was conversion rates would drop.this amazon figures that most in happy purchasers will keep tue item.anyway.for what is worth it's a sold alt to roku", "verified": true, "helpfulness": "0/1", "author": "Practical and funcional"}]