[{"rating": 1.0, "review": "Stopped working, no way to fix it.  Haven't heard back from tech support.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "QUESTION: My TV only has 1 HDMI port and 1 USB port the HDMI port is plugged into cable box. is there an adaptor for a HDMI to USB port????? is this possible", "verified": true, "helpfulness": "0/0", "author": "Kathy Olinger"}, {"rating": 5.0, "review": "I saw this show up as an Amazon Prime exclusive during the initial introduction and thought '$19 is worth the try.' We are an Amazon family entirely and this definitely would be worth the full price. The remote is small and intuitive to work with, reminiscent of the initial ipods.Connectivity on this was a breeze. Plugging it in to the TV, connecting to WIFI and finally linking it to the Amazon Prime account used for purchase. It is important to note that it comes already pre-set to the account you purchased it for. There is the ability to change this (as I discussed with my husband) but we chose to keep it.We stream Netflix often and downloaded the Disney Junior for our child. I'm still learning about the benefits of Prime on this, but I can tell you there is a TON of material available!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "I so love this device. I used my wii before and th8s is just smoother and easier plus i have my phone connected to it so if i cant reach the remote or dont feel like looking i can just use my phone.", "verified": true, "helpfulness": "0/0", "author": "tigeractress"}, {"rating": 4.0, "review": "Works great at home, serious pain to use anywhere that uses a web-based logon. I had to sideload Firefox to use it at hotels, and that still requires a Bluetooth mouse most of the time.", "verified": true, "helpfulness": "0/0", "author": "Eric S Hatter"}, {"rating": 2.0, "review": "EDIT: Guess you get what you pay for. Great while it lasted...which was under 6 months. Started to have issues with battery life, then freezing up and having a mind of it's own bouncing from page to page. Then just died. Too bad!AWESOME! Why didn't I buy this sooner. So practical and great value. Who needs cable?!", "verified": true, "helpfulness": "0/0", "author": "kellie"}, {"rating": 3.0, "review": "The Fire Tv Stick addresses a number of issues. It's not dramatically better than its competitors, but it's not the worst. For $39, it's okay as a streaming-media option, and if you're into Amazon's ecosystem.Pros:1. Unobtrusive design2. Improved On-screen keyboard3. Dedicated Prime Video sectionCons:1. No HBO Go2. Remote lacks voice search button3. Have some rough edges", "verified": false, "helpfulness": "0/0", "author": "lordraph97"}, {"rating": 5.0, "review": "Love it soo much!!  I watch what I want to watch NOW....not infomercials!  OMG!  It is sooo awesome.  Plus I discovered music I purchased from Amazon I can listen with Firestick TV...another OMG...Make Cable TV a dinosaur...Live your life outside of TV ...I am...It will only get better than awesome..Amazon You Rock!!!", "verified": true, "helpfulness": "0/0", "author": "Mary Aleffi"}, {"rating": 1.0, "review": "I am extremely upset with this product.  Continuously I have received the error message HDCP unauthorized. Contest Disabled.  I have tried everything to fix this.  Including speaking to Amazon Customer Service and going online to see what others have experienced.  I am so disappointed that this doesn't work and that there are so many bugs with this unit.  Customer service was supposed to call me back when I was trying to figure out the problem.  They didn't instead I received an email that went to my junk mail only to read it says try unplugging the unit.  Really!!! I have done that continuously and yet no solution.  I have a SONY Bravia TV from about 2008.. it seems to be a common issue that needs to be fixded.  Very disappointed", "verified": true, "helpfulness": "1/1", "author": "MARY C. BRANHAM"}, {"rating": 2.0, "review": "I don't like giving a negative review, but I'm less than happy with this.  I can't watch a program without it cutting out several times -it doesn't want to stay connected to my network -the only hardware that has an issue.  This really makes it pretty much worthless.", "verified": true, "helpfulness": "1/1", "author": "CJH in A2"}]