[{"rating": 5.0, "review": "I was very surprised with the GUI and the menu items ease to use. I bought this for my 7 year old TV and Netflix and it's easy for him to navigate. If only the Amazon controller was cheaper I would order it for him to play games on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "realgravy"}, {"rating": 5.0, "review": "I've owned the costar, ruku, and other streaming devices. I love my Fire TV and wanted to see how the Fire Stick in my bedroom would stack up to all them. The Fire TV is the best streaming device I've ever owned, and the Fire Stick preforms just as well as the Fire TV. It's fast and loads movies very quickly. For such a low cost us more than worth it.", "verified": true, "helpfulness": "0/0", "author": "James Hogue \"James W. Hogue\""}, {"rating": 5.0, "review": "LOVE", "verified": true, "helpfulness": "0/0", "author": "Shawndel Centofanti"}, {"rating": 5.0, "review": "Fantastic product! Now I can watch all my prime movies and tv shows on the big screen!  The device itself is very easy to install, literally just plug it in! I have not had any trouble with it being wireless, no dropped signal or remote problems. I didn't really need the gaming capability of the Fire Box so I went with this instead and im glad I did. Have had no lags or constant buffering, will play with no interruptions at all (this will depend on your internet speed of course) Btw be sure and get the Fire stick app for your IPhone, it works! This way don't even need the remote, and can use the voice activated feature. Really neat to be able talk to your TV and tell it what to do. Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "JaredT"}, {"rating": 3.0, "review": "THE STICK WHEN WORKING IS FINE, REAL EASY TO USE AND VERY FAST NO REAL ISSUES. ALTHOUGH AFTER HEAVY USE, IT SEEMED TO RUN OUT OF SPACE AND START TO LAG AND EVENTUALLY FREEZE WITH THE ONLY REAL WAY TO UNFREEZE WAS TO DISCONNECT IT FROM THE POWER SOURCE. I TRIED TO RETURN IT A FEW DAYS BACK TO GET A NEW ONE AND SEE IF IT WAS JUST THIS PARTICULAR STICK BUT AS OF TODAY HAVE NOT HEARD NOTHING BACK OR RECEIVED A REPLACEMENT. AS MENTIONED PRIOR THOUGH WHEN IT WAS WORKING IT WAS GREAT BUT NOW NOT SO MUCH...", "verified": true, "helpfulness": "0/0", "author": "CVTAX"}, {"rating": 1.0, "review": "Looks like an easy product to set up, but I found it quite frustrating because I could not get the sound to play.I could see a lovely clear picture, but try as I might, no audio could be heard.Yes, I am quite disappointed that it does work with my television system.", "verified": true, "helpfulness": "0/0", "author": "Joan Simon"}, {"rating": 5.0, "review": "I've been streaming Hulu, Netflix, Amazon and HBO GO (among others) on my XBox for 4-5 years now, and between being not so sure how many more years the XBox has on it and the server for XBox being hacked with relative frequency, I had been wanting to get a back up device to stream for quite some time.  I finally decided on the Fire Stick, and I'm just thrilled.  It's so easy, so smooth and I'm sure takes less energy than having the XBox running all day.  Love it, and am so sorry it's taken me this long to get on board!", "verified": true, "helpfulness": "0/0", "author": "Liz S."}, {"rating": 5.0, "review": "Simple setup and a great product!", "verified": true, "helpfulness": "0/0", "author": "Ron Maving"}, {"rating": 5.0, "review": "ABSOLUTELY LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Dawn Amiot"}, {"rating": 5.0, "review": "I loved this purchase.  My girlfriend has been begging me for something like this ! I looked into the roku and the chrome but I decided to get the first stick !  Best decision I have ever made ! This thing makes my life so much easier .  With the  nephews and nieces this is a huge hit.", "verified": true, "helpfulness": "0/0", "author": "Blake johnston"}]