[{"rating": 5.0, "review": "Device works as advertised. It's a must have if you are a Amazon prime member.", "verified": true, "helpfulness": "0/0", "author": "Bruce Ford"}, {"rating": 4.0, "review": "I'm just dabbling with it right now, but the setup and interface is intuitive and the ability to link my phone (photos) to the device automatically is a bonus. The available apps are numerous and I can't wait to explore further!", "verified": true, "helpfulness": "0/0", "author": "hemitchell \"hemitchell\""}, {"rating": 5.0, "review": "Very easy to use.  Offers a wide variety of choices.", "verified": true, "helpfulness": "0/0", "author": "IRA BARNETT"}, {"rating": 5.0, "review": "Easy set up, easy to navigate, so far so good.  Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ernie LeBlanc"}, {"rating": 5.0, "review": "Excellent product.  Easy to use, easy to setup and performs beyond expectations.  Could not be happier!!", "verified": true, "helpfulness": "0/0", "author": "Jeff Lincoln"}, {"rating": 5.0, "review": "Love it!  Super easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "phinny63"}, {"rating": 4.0, "review": "Make sure you have a secure fast connection. There were times when the program I was watching froze up. Sometimes I had to restart because WIFI connection was slow. Also, having unlimited Internet would be great. Used a lot of data. The device is great though!", "verified": true, "helpfulness": "0/0", "author": "Trudy"}, {"rating": 5.0, "review": "works very well, great design for the power connection location vs the end. Also came with small HDMI cable to extend TV stick from TV. Great thinking on design by Amazon. would recommend.", "verified": true, "helpfulness": "0/0", "author": "PH \"PDBSEA\""}, {"rating": 4.0, "review": "The fire stick works great and is easy to set up and get going quickly. My only negative comment is I wish the categories / genres were organized better. For some reason, category searching is cumbersome on amazon fire stick", "verified": true, "helpfulness": "0/0", "author": "paul logan"}, {"rating": 5.0, "review": "I think it's a great little gadget.  Only thing is I wish there were more mainstream movies to watch; seems to be a lot of older stuff.  I think in the long run, however, once I convert everything to Netflix, an antenna, the Fire TV stick and Plex, I will be more happy with what's available to me.", "verified": true, "helpfulness": "0/0", "author": "shadkat"}]