[{"rating": 5.0, "review": "I can't believe how much I am getting for the price of this! This was so worth it. You can't even see anything plugged in to our bedroom TV, yet we are getting all the same great apps we get on our living room TV with Xbox. The remote is incredibly simple and intuitive. I could control it with my eyes closed. If you are thinking about this, just buy it already! I have zero regrets.", "verified": true, "helpfulness": "1/1", "author": "Erica Shapalnd"}, {"rating": 5.0, "review": "The fire stick is easy to use and works great with Android devices.", "verified": true, "helpfulness": "1/1", "author": "Gretchen Stanley"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "David Waddell"}, {"rating": 3.0, "review": "it's not very user friendly", "verified": true, "helpfulness": "0/0", "author": "Joyce w."}, {"rating": 2.0, "review": "Device locks up, loses network connection quite often, flash crashes often as well. Movie and show rental prices are too high, Redbox way cheaper. Network shows that can be watched for free, are being charged for through Amazon. Overall, very disappointed in what, on paper is a very good idea. It's execution leaves a lot to be desired. Almost makes AppleTV interesting. Known problems have been around for a long time and not fixed. That is known as poor company support and does not help in getting or keeping customers.", "verified": true, "helpfulness": "0/1", "author": "superman's friend"}, {"rating": 5.0, "review": "Works great. No issues. Set up was a breeze", "verified": true, "helpfulness": "0/0", "author": "D. Webley"}, {"rating": 5.0, "review": "The stick is so great. I ordered it for my mom as a gift. She has no problem using it or navigating through the apps.", "verified": false, "helpfulness": "0/0", "author": "JFD"}, {"rating": 1.0, "review": "I didn't get my refund for this product", "verified": true, "helpfulness": "1/2", "author": "genieve padilla"}, {"rating": 5.0, "review": "I see what I want, when I want.  Thank you Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Emma G"}, {"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/0", "author": "Rodrigo N."}]