[{"rating": 5.0, "review": "It's perfect for me", "verified": true, "helpfulness": "0/0", "author": "KMH"}, {"rating": 5.0, "review": "Excellent delivery, offering as many, if not more choices than cable. You don't need a Smart TV with the Fire Stick. Saving hundreds of dollars while adding comfort and ease to your television viewing.", "verified": true, "helpfulness": "0/0", "author": "Don Bouie"}, {"rating": 4.0, "review": "I have to say I was very excited when I first heard about the Amazon Fire TV Stick.  I wanted a device that I could stream both Netflix and Amazon Prime Videos, which my Chromecast could not do, plus the Fire TV Stick came with remote.  I ordered it shortly after it was released but due to the high demand the Fire TV Stick was back ordered.  I am happy to say that our Fire TV Stick  arrived earlier than our expected delivery date (by about a month).  We quickly set up the Fire TV Stick by following the easy to use instructions included with the device and within minutes I was streaming movies from both services.  Everything worked great for the first few weeks, no buffering of videos or dropping of network connection which I would often experience with my Chromecast.  After about a month of use, we had an issue with movie playback (sound only on a blue screen).  I called the Amazon customer support number and quickly had the issue resolved by resetting the device and adding the supplied HMDI extension cord.  Since then we have only had minor playback issues, which are most likely related to our poor internet service provider's wifi router.  I actually want to buy a second Fire TV Stick for our second TV so I don't have to switch it from room to room.Pros:Ability to stream video from both Netflix and Amazon Prime VideosRemoteEase of setupAbility to play video games from device (can purchase a game controller separately)Cons:A few bugs with playback as mentioned above (none recently)", "verified": true, "helpfulness": "0/0", "author": "Trickster"}, {"rating": 1.0, "review": "If I could give 0 stars, I would. This thing has given me nothing but a headache since I got it. Currently battling with it saying that I am connected to wifi with very good signal strength, but still not letting me connect to any apps because it has no connectivity. Don't waste your money - there are plenty of better products out there.", "verified": true, "helpfulness": "0/0", "author": "Meghan"}, {"rating": 1.0, "review": "I am really disappointed with this.  I was not prepared to enter as credit card over my wifi network to have it do anything.The technical support was nill at first, but 3rd try was very effective man  from south Africa who helped a lot.  it is not really a media TV viewer.really, it is a convenient way to view and pay for \"Paid \" programming.I would never have bought this if I knew that most of the programming was requiring payment.I got an email from amazon, offering to give free programming if I join prime service. I clicked on more information tab and got very little moreinformation.  the next option was Sign up now.  No mention of price.  This is an insulting tactic.This is  just another scheme to get my credit card.Fred", "verified": true, "helpfulness": "1/1", "author": "Fred Bowers"}, {"rating": 5.0, "review": "I have a \"smart\" bluray player and it's so clumsy and annoying to find anything on there. I was going to buy the newest Fire TV with the voice remote when I realized by downloading the app I can use my phone as the remote and have the same experience. (I won't be using the games.) I love that Fire TV also notifies me if something I want to watch is available elsewhere-- like the other system I considered, the Roku, although that's  only avail for certain apps. Love it!", "verified": true, "helpfulness": "0/0", "author": "Theresa \"LaProfeTere\""}, {"rating": 2.0, "review": "Great product.  Remote sucks. I love the Amazon Firestick.  Love it so much I disconnected my cable.  However after a week of use the remote no longer syncs. I have tried multiple different trouble shooting techniques and to no avail it still doesn't work. I was using my Fire Tv app on my phone but it also disconnects and will not reconnect....so now I am stuck with no cable, no damn remote, and a fire stick that is useless. The store I purchased it from won't take t back because I threw the box away.", "verified": true, "helpfulness": "0/0", "author": "Jennifer G."}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "betty"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ruel"}, {"rating": 2.0, "review": "Can't watch anything without it freezing every 3 minutes. The library is horrible!! There are 100's of the crappiest movies and TV shows. The only way to watch something that is any good is to pay extra. (above prime)", "verified": true, "helpfulness": "0/0", "author": "Linda Palma"}]