[{"rating": 5.0, "review": "This is awesome.", "verified": true, "helpfulness": "0/0", "author": "Avid shopper"}, {"rating": 5.0, "review": "I am in love with the fire tv stick.  I got all kinds if apps for my kids and I.  Works fast and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "jennifer lopez"}, {"rating": 4.0, "review": "A little confusing to use at first but once you get used to where to find your programs it is pretty nice. I like the Amazon prime app on my xbox360 better but for the promotional price we got it for it is well worth it. You can bring this to hotels and friends houses, anywhere there an hdmi port and access to wifi, and you're good to go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing product and easy to use. Love the idea that I can take it with me and just plug it into any TV. I only Amazon prime were less costly since I don't use it that much.", "verified": true, "helpfulness": "0/0", "author": "jonh"}, {"rating": 5.0, "review": "I did a lot of research and viewed many videos before I decided to purchase the Fire TV Stick. I am very satisfied with it and how easy it was to set up.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Paul Dean"}, {"rating": 5.0, "review": "While there are some pros and cons, I do love it, it does what its supposed to do and it does it without a flaw.what I wish it did is, be able to use free-time as you would normally with the Amazon Fire TV box. I originally purchased 2 when they first came out and were priced for a special price of $19 and wanted them for my kids room, and the guest room. So I ended up switching the Amazon fire Tv box to their playroom and kept the stick in the living room. Not a problem. My children will sometimes still watch TV in the living room, and the Fire Tv stick's controller does not have voice control, once again, not a problem, but while the amazon fire Tv box does, it makes it easy for my 6 year old to look up cartoons they want to watch since he has a hard time spelling things on the screen.Still at $39 is a great price, and is very competitive in features as opposed to the other TV streaming sticks out there available. Overall pretty happy with it, we use it every day without a single issue.", "verified": true, "helpfulness": "0/0", "author": "Mizmelt"}, {"rating": 5.0, "review": "Never used It.", "verified": true, "helpfulness": "0/0", "author": "Ghost Of A Lion"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Eleanor"}, {"rating": 5.0, "review": "Works great and simple to use", "verified": true, "helpfulness": "0/0", "author": "JWV"}, {"rating": 5.0, "review": "Works great and easily installed. Like watching Netflix on the tv", "verified": true, "helpfulness": "0/0", "author": "W. Schwartz"}]