[{"rating": 5.0, "review": "It's hella good", "verified": true, "helpfulness": "0/0", "author": "Forrest Romine"}, {"rating": 4.0, "review": "Arrived very quickly and set up easily (well, I couldn't get it to connect on 5Ghz but 2.4Ghz was no problem).My only real complaint is that I that some apps require you to select your cable provider from a list before you can use them. No problem if yours is there (and many are, I counted almost 100), but if it isn't you are out of luck. I was specifically looking to use FoxSportsGo which is listed as being good on the Fire Stick but my provider is not listed (Cox!). Found the same problem with the History app. Haven't tried recently to see if there have been any updates.Weirdly, I recently purchased a Fire Phone and FoxSportsGo works on there (guess I can mirror to my Fire Stick!) and it also works on my iPad (can't mirror from there, at least not easily).", "verified": true, "helpfulness": "0/0", "author": "thekitedude"}, {"rating": 5.0, "review": "Amazing stick lots of new content.", "verified": true, "helpfulness": "0/0", "author": "Neal"}, {"rating": 5.0, "review": "For Prime members this is a must have.  It's so easy to set up and use.  If you have Wi-Fi you can be up and running in minutes.  The navigation is quite simple.  Highly recommend this item, especially if you have a Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "There's no way to turn it off without unplugging it which sucks. Otherwise I'm pretty happy", "verified": false, "helpfulness": "0/0", "author": "Alexandra Iverson"}, {"rating": 5.0, "review": "This and the fire TV box are the best streaming devices out by far in my opinion! I recommend them to everyone!!", "verified": true, "helpfulness": "0/0", "author": "Derek Holtzapfel"}, {"rating": 4.0, "review": "Still exploring its capabilities. But so far so good!", "verified": true, "helpfulness": "0/0", "author": "Jason Oneal"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeremy Bross"}, {"rating": 5.0, "review": "Excellent!!", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "Love this thing...much more than I expected.", "verified": true, "helpfulness": "0/0", "author": "Mr. Sunshine"}]