[{"rating": 1.0, "review": "I bought this when they were $19.95 and it has worked great for months but recently the video would freeze. Called tech about the problem but they did not know what to do about it, tech even called me back but they never solved the problem. I've reset the device but that didn't help. I think it could be the firmware or just a defective unit. Amazon should replace it under warranty but will not. I can't buy a product from a company if they don't stand by their warranty.", "verified": true, "helpfulness": "1/1", "author": "RTS"}, {"rating": 1.0, "review": "Setup was somewhat difficult.  It worked for about a week and now I can't watch anything.  The Fire Stick is working but says everything is unavailable.  Boy, try finding a phone number to call someone at support!!!", "verified": true, "helpfulness": "1/1", "author": "Jannice Nutting"}, {"rating": 5.0, "review": "Love it, fast and easy to work. Its like Netflix but a lot more options and easier to search..", "verified": true, "helpfulness": "0/0", "author": "Michele Morgan"}, {"rating": 5.0, "review": "Wifi needs to let the user know when password entered is incorrect, it just seis no network and made my think there was something wrong with the network in the firetv stick. Had to forget network and add new network with the correct password . keyboard layout is not qwerty, it is abcde. Would be nice if we could change the keyboard layout in settings other then that we enjoy this firetv and it works better faster smother then Xbox one with streaming, menus, and uses a lot less electricity", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "What TV should have always been like!!!", "verified": true, "helpfulness": "0/0", "author": "hawkcaller"}, {"rating": 5.0, "review": "We love our Amazon Fire Stick. So much, that we have eliminated our cable bill altogether and choose to just use Netflix, Hulu and Amazon Prime Plus. I was a little apprehensive about how well this would all work together but it is awesome and is saving us over $100 per month. I am going to say something pretty obvious here, (but for those less \"technically inclined\")--Make sure you have Internet capabilities to support audio and video streaming at a fairly rapid rate, so that you don't run into any hiccups. All you do is call your current Internet provider, who will help you figure this out:)", "verified": true, "helpfulness": "1/1", "author": "Angela M Brown"}, {"rating": 5.0, "review": "Very happy with the Fire Stick.  It is easy to install and use.  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Wish three where more apps but good for the price, Mine randomly pauses or looses signal for whatever reason I have done all the trouble shooting suggested and have even exchanged it once thinking I just got a lemon but the newest stick also randomly pauses and looses signal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"S. Hampton\""}, {"rating": 5.0, "review": "Dont know how I lived without it!", "verified": true, "helpfulness": "0/0", "author": "DL"}, {"rating": 5.0, "review": "I am taking advantage of see it Prime at no cost and watching lot of show!!", "verified": true, "helpfulness": "0/1", "author": "SLTaylor"}]