[{"rating": 5.0, "review": "Great solution for the tv", "verified": false, "helpfulness": "0/0", "author": "ahmed"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "saucy sue"}, {"rating": 5.0, "review": "Enjoying it a lot.", "verified": true, "helpfulness": "0/0", "author": "Maggie Ferrell"}, {"rating": 5.0, "review": "Really good product. I definitely recommended.", "verified": true, "helpfulness": "0/0", "author": "Cecilia Seda"}, {"rating": 5.0, "review": "Love it!!!The Fire TV stick works well for me.  My one wish is that I could get local news.  Other than that, I am not a huge fan of network television.  I have watched many movies that I otherwise would not have seen.", "verified": true, "helpfulness": "0/0", "author": "Dionne"}, {"rating": 3.0, "review": "We do not have cable because theres just so many channels u pay for that dont even get watched. Its a waste of money. So we got the fire stick. Its alot better except I wish it had web browser or google. We at least thought it would have an amazon shopping app on it. Be nice if it did.", "verified": true, "helpfulness": "0/0", "author": "Jody Carlilse"}, {"rating": 3.0, "review": "I cannot get anything with this device, no games, no movies, no music.  The wifi signal is hard to get and everysingle thing is paid.  I cannot even access my NETFLIX account which I keed a monthly paid account.  Additionally I cannot loaded in more that one HDMI TV.  Please help me to make it work.  The  video included helps but from the wifi signal and on and that is one of my issues.  I do not buy things to return them.  I am very sorry to spend time, money and effort to bring things to my final destination and have these results.", "verified": true, "helpfulness": "0/1", "author": "Giginaty"}, {"rating": 5.0, "review": "Thank you!  Excellent!  Walked me through the set-up which was very helpful,  glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "irma B Pressley"}, {"rating": 5.0, "review": "It's great.  Does everything I was hoping it to do.", "verified": true, "helpfulness": "0/0", "author": "Philip Hebenstreit"}, {"rating": 4.0, "review": "This used to play nexflix without a flaw. Now no matter what I do it will not play. Done everything people say and still won't work. All other house devices play netflix except this fire stick. Very disappointing cause thats the main reason I bought it. Either doesn't find the netflix servers or doesn't find my internet connection.  Well after some more time removing and reinstalling the netflix app it finally started to work. I'm keeping my fingers crossed.", "verified": true, "helpfulness": "0/0", "author": "stingy"}]