[{"rating": 5.0, "review": "excellent no problems", "verified": true, "helpfulness": "0/0", "author": "timothy walsh"}, {"rating": 3.0, "review": "Not sure yet. Works fine. Fast/responsive. Not very many apps.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "I ordered Fire TV Stick before it was released, and while Amazon was running a promotion for the Prime members. It arrived about three weeks sooner than it was originally promised.Product itself works really well, and I had some idea what to expect since I already own and use Google Chromecast. Difference between Chromecast and Fire TV Stick is that you don't have to use your phone to control the device. With the included remote control, you can browse and play apps, movies, tv shows, games, basically anything you want to do on the TV screen, you can do with remote control. I like this feature. The only disadvantage is that now there is another remote control added to our collection. That all said, Amazon recently released an \"Amazon Fire TV Remote\" app on iOS that lets you do all (or more) of tasks from your phone. This helps when you need to type movie names, etc. In fact, you don't have to type, you can just speak to it. It works really well in my opinion.I took one of my friends' advice and plugged it to power with the included adapter, as he mentioned USB from the TV does not seem to provide enough power to run it as smooth. I did not do extensive testing on this, but plugged in to the wall outlet, it performs very smoothly.Content wise, the biggest thing we miss is the Xfinity app, which Chromecast doesn't have either (Xbox 360 has an app for it). However, I am not sure whose decision that is. That all said, Amazon Prime does have lots of content, especially if you are looking into finding new TV shows. It's an easy and cheap way to check out shows and see if you like them - if you have missed the first seasons on TV. Once you catch up, you can watch the current episodes on TV, Xfinity app, or Hulu.Fire TV Stick is also supposed to support Miracast, however, I did not get a chance to use that quite yet. Finally, you can play games if you bought the controller, or with the remote. When you search for games, you could filter your results to search for games that are playable by the remote.In conclusion, this is a really good device to have, especially if you are an Amazon Prime member. I really like mine, and would definitely recommend it to a friend. If you are not a Prime member however, it's doesn't have loads of features that blows away the competition. I should note that it seems more responsive (faster) than Chromecast. Also, remember to not get carried away with which streaming stick (device) has how many channels, etc. I find that I use only a handful of apps. Just because it has a billion apps doesn't mean it's better.", "verified": true, "helpfulness": "1/1", "author": "Amoinus \"amoinus\""}, {"rating": 5.0, "review": "I love my Fire Stick! 😍", "verified": true, "helpfulness": "0/0", "author": "Alice Burrows"}, {"rating": 2.0, "review": "Ad infers plenty of free viewing with prime....not so", "verified": true, "helpfulness": "0/0", "author": "2swifts"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Vee"}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "Carol White"}, {"rating": 5.0, "review": "I love it when people trash a product because they didn't do their homework prior to buying it.  Like assuming that you will get free access to services like Netflix or Hulu. Or not knowing that a huge chunk of the Prime video library is not free. Or not realizing that the stick requires an outside power source (mine works great connected to the USB port of my UVERSE box, did't work on the TV's USB port). If you don't have memberships to the above mentioned services, and are not planning to get one, this product is not for you, unless you don't mind spending 40 bucks to play a few free games on your big screen TV.The stick works as advertised. Immediately detected my 5GHz network and connected flawlessly. No drops in the connection. If your router is \"far\" from the stick, you may want to try a 2.4 GHz connection (reaches farther that the 5 GHz). I don't have Netflix or Hulu, but Prime videos stream without any issues, even the HD ones.  I sideloaded XBMC and I'm enjoying my video and music collection from my NAS, even 1080p movies.  I have access to my Amazon music files, plus playlists provided by Amazon for free. There's a cool Shutterfly app that allows you to see all your albums directly from your online account. Pandora, IHeart radio, etc. And I'm sure many more apps will be available pretty soonThe stick runs a little bit warm, but that doesn't seem to affect performance.The user interface is \"Amazon heavy\", but what do you expect?I pre-ordered it for $20, so it was a no brainer, but if I needed another one now, would not hesitate to buy it for $40.Again, great product if you know what you'll get from it.", "verified": true, "helpfulness": "1/1", "author": "AKW"}, {"rating": 5.0, "review": "Great item - especially for Prime members.", "verified": true, "helpfulness": "0/0", "author": "Brad Burdick"}, {"rating": 5.0, "review": "Works great with our older TV", "verified": true, "helpfulness": "0/0", "author": "lauren"}]