[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "JayUtz"}, {"rating": 2.0, "review": "Won't pick up signal enough to stream video - right next to our Blu-ray player which picks up wireless signal just fine.", "verified": true, "helpfulness": "0/0", "author": "JaymieE"}, {"rating": 5.0, "review": "I bought this for my daughter's TV, she likes old television shows and the selection on DirecTV was poor at best. It took a bit longer to set up than my Fire TV box but not much. My daughter downloaded the app for her smart phone and now has all the functionality of the remote that came with my Fire TV box.Collectively our family really enjoy both the Fire TV Stick and Fire TV and give them both 10 thumbs up", "verified": true, "helpfulness": "0/0", "author": "Oldman"}, {"rating": 5.0, "review": "love it! so easy to use!", "verified": true, "helpfulness": "0/0", "author": "Phuong Tram"}, {"rating": 5.0, "review": "Works awsome . No probs. Real amazon prime account is to expensive so netflix it is.", "verified": true, "helpfulness": "0/0", "author": "Tiffany Anderson"}, {"rating": 3.0, "review": "I would have rated this much higher as it works flawlessly for streaming movies and such.  However, the mirroring function does not work with my Apple devices and I bought the Fire TV Stick in hopes it would work with them.  I guess I should have read the description more closely before I spent the money for this, which would have been a great value if it worked with my Apple devices.  I can only hope that Amazon will develop an Ap that would provide that functionality.  If that happened, I would be able to rate this device much higher.", "verified": true, "helpfulness": "0/0", "author": "Terrence Paul Ott"}, {"rating": 5.0, "review": "So Smmoth. I mean the device works awesome. Stays connected! A must for Prime Members! If you have other devices connected to your HDMI port(s) and have  limited  ports. Order a switcher/ splitter now. Use the ac connector with the device. Happy streaming!", "verified": true, "helpfulness": "1/1", "author": "R.Crenshaw"}, {"rating": 5.0, "review": "Great product!!!!  Works better than I expected", "verified": true, "helpfulness": "0/0", "author": "Mark Arthur"}, {"rating": 4.0, "review": "I bought this device when Amazon offered at $19, so I decided to give it a try before any reviews.. So far it has been great.Pros:- a lot of reviews (and Amazon for that matter) say it will not work through a AV receiver. Well, mine is working. I connected it through one of the HDMI on my Sony STR-DH820 and works perfectly.- Much easier and smoother to run amazon prime videos from this device than on an app I have on my blu-ray player.- no lost connection with my Wi-Fi.- pretty decent video quality on some videos/movies I have watched so far.- Small. Get hidden behind my AV receiver.- nice remote- All prime features (video, music, photo, etc.)- I uploaded some photos on my PC and shared it through this device on the TV. Awesome feature. No more gathering around a PC monitor to see the latest vacation photos..Cons:- Still missing some apps, but I am sure Amazon will make more available in the future. Waiting to have HBO GO. Today I watch it through a PC connected to the AV receiver..- Not exactly miracast for Android devices in my point of view. With my phone I can mirror my display to the TV, but it is a mirroring effect. If I am playing a video the phone and its display must be turned on for the duration of the video. This is a different experience from google chromecast with any android device, where, in my understanding, you kind send the link and the device takes care from that point on.. This is why not five stars. And it drops the connections from time to time.- The \"cast\" effect doesn't (understandably) works with iphones or ipads.And last comment: In my opinion, this is a great device if you are an Amazon prime customer. This is how you can take the most from it. If you are not, maybe a Roku, for example, could be a better option.", "verified": true, "helpfulness": "0/0", "author": "Luis S."}, {"rating": 5.0, "review": "awesome invention highly recommends", "verified": true, "helpfulness": "0/0", "author": "Angela"}]