[{"rating": 4.0, "review": "This thing does not work with Windows 8. I have other miracast receivers work well with my windows tablets and computers. The only reason I bought this was for the miracast ability. But this device failed miserably at that. I will up my rating once Amazon releases the update to actually be miracast certified.And also, I have observed Audio sync issues on streaming video, observed on both Netflix and Youtube.EDIT: Recent updates on the stick have solved the windows 8.1/windows 10 miracast issues. Updated the star rating to 4.", "verified": true, "helpfulness": "1/3", "author": "LalKav"}, {"rating": 3.0, "review": "I was looking to replace my Roku 2 which was showing its age. I was fortunate to have bought this device when it was announced and was $19 for the first two days. After a bit of a wait, the unit came packed in a nice box. I have a Denon AVR1913 and set this up on one of the HDMI input ports.The initial screen came up without any issues including connecting to the Wi-Fi. But when I wanted to watch a movie, the dreaded blue screen with \"HDCP unauthorized. Content Disabled\" came up, but with sound. After reading other reviews, I switched off all the devices (The receiver, TV and the fire stick) and restarted them. This resolved the issue and hasn't re-occurred since.After leaving the device overnight plugged in, I tried accessing it in the morning only to find that the WiFi connection had dropped. All my other devices were online without any issues. The router is about 2 feet away with both 5GHz and 2.5 Ghz available and I had setup both the access points to the Fire Stick. Was able to resolve this issue by rebooting the device - There are two ways to do it:1. Using the remote: Press and hold the select and the play button simultaneously for about 5 seconds.2. Unplug the USB cable and re connect after about 5-10 seconds.Just a note that this issue does NOT happen every night, or every time the unit is left untouched. I haven't been able to associate a pattern to this issue.The performance of the device is good and responsive. I like the navigation layout with the recent tab showing both movies and apps. The games is an added feature and some of them really hook you in.There have been about 3 times when a game app has frozen and had to reboot the stick.I would only give 3 stars as it can't beat the $19 price. However, for the current price and competition in Google ChromeCast and Roku Stick, Amazon needs to pull up its socks to resolve the Wi-Fi issues and the freeze and add more features.", "verified": true, "helpfulness": "0/1", "author": "Sumanth Rao"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "yardgirl1976"}, {"rating": 5.0, "review": "like very much . watch all of my old movies and a lot that I missed. if you have amazon prime its a must.", "verified": true, "helpfulness": "1/1", "author": "doug fabs"}, {"rating": 4.0, "review": "Pros: Easy setup, low initial cost to Prime Members @ $19, access to my Amazon cloud photos, remote control, excellent Prime video playback. Apple/Android remote app with voice search. Can stream to Fire TV Stick from iOS apps like YouTube.Cons: ... **update** recent firmware revisions have really fixed all my complaints thus far.I am in the middle of a move and have not yet moved my big AV setup. I moved a 32\" TV with the Fire TV Stick and have been relying on it exclusively. It is up to the task. I can now rely on it as my sole streamer (minus the Apple stuff)", "verified": true, "helpfulness": "0/2", "author": "Edward J. Moore"}, {"rating": 5.0, "review": "Love it!!!  Easy to install.  Just wish the remote had volume control.", "verified": true, "helpfulness": "0/0", "author": "Feeling good Mom"}, {"rating": 5.0, "review": "Very easy to use. Works great. I  bought for my mom. We had chromecast before this come out. Switched to this and she has no trouble anymore. I recommend to anyone who wants a simple device to watch Amazon's prime or netflix.", "verified": true, "helpfulness": "0/0", "author": "william hawthorne"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Barbara Norlie"}, {"rating": 4.0, "review": "Very convenient. The stick screensaver will activate after a certain time if not used. One can put Fire TV to sleep from the settings menu. Most applications work; just a few that may not function properly.", "verified": true, "helpfulness": "0/0", "author": "S R"}, {"rating": 5.0, "review": "Works as advertised can't find any bad words to describe it so that's good.", "verified": true, "helpfulness": "0/0", "author": "Davit"}]