[{"rating": 5.0, "review": "I thought that I would only buy a smart tv. Now? I love the Fire Stick & saved $ buying a less expensive TV. Now I'm the smart person in this story problem😉", "verified": true, "helpfulness": "0/0", "author": "Heather McBride"}, {"rating": 5.0, "review": "VERY VERY HAPPY", "verified": true, "helpfulness": "0/0", "author": "georgeferguson"}, {"rating": 4.0, "review": "I like it though some of the channels don't have audio.  Also, i had to unplug it when i kept getting knocked off the internet.  The modem wifi doesn't like it.  disconnecting it solved modem issues.  Another problem it has is when it goes to sleep, it doesn't wake up.  I have to go behind the tv and unplug the power to the device for a few seconds and plug it back in for it to work.", "verified": false, "helpfulness": "0/0", "author": "Pepper"}, {"rating": 5.0, "review": "Amazon is a lot easier to use than our playstation 3 and Netflix. Play station was purchased for grandkids to use, I don't have any interest in computer/playstation/xbox games.", "verified": true, "helpfulness": "0/0", "author": "Ron23897"}, {"rating": 4.0, "review": "The Fire TV Stick works fine.  I had a problem with the set-up because he HDMI cable was not long enough to connect my TV to the cable box that are built-in to my custom cabinet.  I found a way to get this solved but the HDMI should be longer.", "verified": true, "helpfulness": "1/1", "author": "Gil J"}, {"rating": 5.0, "review": "Great product!!  I should have bought this a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Michael Mooney"}, {"rating": 5.0, "review": "I love the  fire tv stick,  it  was  so  easy to  use", "verified": true, "helpfulness": "0/0", "author": "Diann McCullough"}, {"rating": 2.0, "review": "The on screen viewing of the options are too small.  Roku menu is more user friendly and easy to read.", "verified": true, "helpfulness": "1/1", "author": "B. J. Thayer"}, {"rating": 1.0, "review": "I want my money back; this doesn't stream well or not at all on amazon content. I've been through a couple of hours of time on the phone with your techs at level 1 and 2 (your websites recommended method of contact BTW) I still have the problem. THE ISSUE IS NOT WITH MY BANDWITH ; YOUR TECHS  SAID THAT. ACCORDING TO YOUR LEVEL 2 TECH, THE ISSUE IS THE PROXIMITY OF THE FIRE STICK TO THE TV. OK, WILL THE FIRE TV WORK BETTER?  YOUR SALES DEPT TOLD ME THERE WOULD BE NO DIFFERENCE OR I WOULD HAVE BOUGHT THAT.  SO SEND ME A FIRE TV, BUT BASED ON MY EXPERIENCE SO FAR, DON'T EVEN THINK OF CHARGING ME. THEN I MIGHT BE SATISFIED....IF THE DAMN THING WORKS. BTW THAT SAME TECH TOLD ME THIS IS NOT AN UNCOMMON EXPERIENCE. SO....WHAT ARE YOU GOING TO DO ABOUT IT.....", "verified": true, "helpfulness": "1/2", "author": "writer block"}, {"rating": 5.0, "review": "Have a chrome cast as well and this blows it out of the water", "verified": true, "helpfulness": "0/0", "author": "Jason Leewright"}]