[{"rating": 2.0, "review": "Some slowness and restarting issues.", "verified": false, "helpfulness": "0/0", "author": "Vishal S"}, {"rating": 3.0, "review": "I bought the Amazon fire stick, having high expectations, but so far I am not pleased.  It seems the remote does not work.  All comes up, but remote does not work---NO it is not the batteries!!  Hopefully, I can exchange and try again.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "Hands down the best media stick for the money, nicely packed, every single item inside the box is worth your money, this is my third week with my fire tv stick I use it for about 3-4 hours a day with no problems so far, picture and sound  quality it's amazing, I was doubtful about buying this fire tv stick because I had a google stick before and honestly it was a pain to use it, but Amazon did a great job with this device, this fire tv stick can beat any other stick in the market, you won't regret buying it.", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 5.0, "review": "Makes my dumb tv smart and comes with Prime ready to go (bought when offered for lowest price to prime members)Easy to set up and play!!", "verified": true, "helpfulness": "0/0", "author": "woody7"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Lukez"}, {"rating": 5.0, "review": "Got my fire stick during the $20 pre-order promotion and could not be happier with this product. It is faster and more user friendly than my Apple TV with the huge added bonus of being able to access Amazon's huge library of content through Prime instant video. Fire stick also has way more apps than Apple TV plus neat features like parental controls. Having used Apple tv and roku 2 previously, nothing compared to the features and performance of this tiny media streaming device. Hats off to Amazon for another great product", "verified": true, "helpfulness": "0/0", "author": "jritch"}, {"rating": 5.0, "review": "Love all the options", "verified": true, "helpfulness": "0/0", "author": "Katie Boik"}, {"rating": 5.0, "review": "Great product.. Ordered this item when it was acounced at discount price for Prime members. installation is very simple, not like google cromecast, that's pain and unfortunatly that never worked for me, so waste of money and time on google chromecast..This is great product and strongly recommand", "verified": true, "helpfulness": "0/0", "author": "venkat veerapaneni"}, {"rating": 5.0, "review": "This is what the Google Chrome Cast promised to be and never was...Amazon delivered a superior product all the way around!", "verified": true, "helpfulness": "0/0", "author": "Michael Douglas Pickerign"}, {"rating": 5.0, "review": "This is the most amazing technology of its kind to date.  Literally, just plug it in and you are watching Amazon Prime (and many others).  I have a Google Chromecast, but you need another device to stream to the stick.  Fire TV Stick is self contained... no device needed, just wifi.  And fast!  No noticeable buffering, just choose your entertainment and you are watching.", "verified": true, "helpfulness": "0/0", "author": "John Photo"}]