[{"rating": 4.0, "review": "I own a Google Chromecast and Apple TV so those are my comparison devices.At first this device blew me away. Amazon is really onto something. The ability to add apps and customize the experience is fantastic.  The only downfall is that it doesn't seem to consistently stream very well.  I use Plex media server to manage personal video collection.  The UI is fantastic through the Fire TV Stick.  Unfortunately, the streaming is not consistent.  Sometimes a movie would play completely fine. Other times the same movie would hesitate or freeze at various points. I tested this with a kids movie that my children regularly watch.  I have reduced the stream quality but that didn't seem to make a difference.At first I thought this might be my network but later determined it was not because I can play from my phone or tablet and then broadcast to my AppleTV or Chromecast without any issues.I feel it is a matter of time before Amazon addresses these issues.  Overall this is a great product and you really can't go wrong for the price.", "verified": true, "helpfulness": "1/1", "author": "Silicon Ghost"}, {"rating": 2.0, "review": "Would have loved this if it had a proper Twitch app, but as it stands it only plays in 480p and there is no way of increasing the quality. I purchased this primarily for watching Twitch on my TV. Can't believe Amazon would allow such disappointing Twitch functionality when they've just recently acquired Twitch. Works fine with Netflix.", "verified": true, "helpfulness": "0/1", "author": "laserz"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Leslie Mitchell"}, {"rating": 4.0, "review": "As a previous Chromecast User the Fire TV Stick is hands down the better option. With Chromecast you must have a PC to access YouTube, Netflix or other websites on the internet and then broadcast them wirelessly to the device. The Fire Stick is a stand alone device with a remote so no PC is required to access media. You do however need an internet connection with a wireless network. The Fire TV Stick also streams data much faster with fewer hiccups! Love it!", "verified": true, "helpfulness": "0/0", "author": "OCD \"Blues Addict\""}, {"rating": 4.0, "review": "Nice device.  Works well right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Harold Muetzel"}, {"rating": 5.0, "review": "love the.ease.of using this fire stick...i might just cancel my cable service now an just watch what i want ,when i want!!!...its easy to set.up..loads very.fast...even has the game play feature...so far we love it!!!", "verified": true, "helpfulness": "0/0", "author": "william costello"}, {"rating": 1.0, "review": "1 star rating.well, after having the fire stick for about a week I find that it doesn't work as well as they promote it to be.when I tried to hook it up to my TV it would not work through the sound system.I contacted Amazon and they said to check with they manufacture which I did and they said it was a problem with the fire stick. I guess no one wants to own up to the problem.", "verified": true, "helpfulness": "0/3", "author": "Glen smith"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick loaded with XMBX from Ebay (not sure why Amazon is asking for the review), I absolutely love it.  I bought the stick and a small tv antenna for live shows and canceled by cable and only paying $30 a month for internet through AT&T.;  I will be saving $150 a month.  Wish I had done this sooner.  It is a new way to watch television but after about a week we have adapted and love it.  Quality is great on our large HD television.  Best part no commercials on tv shows.  I will be buying a few more for bedrooms and gifts.", "verified": true, "helpfulness": "0/0", "author": "Dorothy"}, {"rating": 4.0, "review": "EDIT: I called customer support, and surprisingly all it took to resolve most of the issues was a factory reset (I also set it to connect to the 2.4 GHz signal instead of the 5 GHz but I'm pretty sure the factory reset made the difference).  Actually pretty happy with the product now. Leaving the original comment below in case anyone else experiences similar issues.Seriously disappointed in this this thing.  So many issues.  I bought this mainly because it was supposed to work with Plex, unfortunately it only supports a very limited amount of audio formats.  This leaves half my library unwatchable (anything with surround sound you're out of luck. only supports 2 channel audio).  The movies or shows I can watch, the connection drops intermittently and I have to reboot the stick to connect to my server again.  When trying to watch Crackle, at random points in a movie it will cut to advertising, then instead of resuming my movie it will start a new episode of Comedians in Cars Getting Coffee.  Even Amazon Prime, THE ONE THING that someone should think would be perfect, has audio/video syncing issues.  Every single prime movie or tv show I try to watch the audio is just slightly behind the video.  It's maddening.  Thank god I didn't buy this at full price, but hoping updates will fix the slew of issues.", "verified": true, "helpfulness": "1/1", "author": "Janet Van Zant"}, {"rating": 5.0, "review": "Works great! I was a little disappointed  that the CBS app was just CBS News.", "verified": true, "helpfulness": "1/1", "author": "Michael J DeFoe"}]