[{"rating": 5.0, "review": "Very easy to install, affordable, and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Christopher Michaels"}, {"rating": 4.0, "review": "It's ok, a little more difficult to use than chromecast. But the remote is nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I LOVE IT!  A fraction of the cost of other streaming units and works wonderfully.  I have been singing its praises since I started using it.  Definitely going to buy another.  Buy one! You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not my favorite. I ordered this stick because I always had great experiences with Amazon. This has definitely fallen well below the average experience. I constantly have network interruptions. I even quadrupled my network speed to accommodate. It hasn't made anything better. I tried calling customer service twice, and both times got awful service. I was told multiple times that it was my connection speed. My phone, tablet, and gaming system all get excellent service in the same location. Since talking to customer service, I have removed the gaming devices and turn off the wifi on my phone when ever I am watching the fire stick. I still have issues. Not sure if there is anything more I can do. I recently got the roku box and don't have any issues with the connection.", "verified": true, "helpfulness": "0/0", "author": "Kristen Teaff"}, {"rating": 5.0, "review": "Love it!!!  Works great, love the old shows I can watch again....such as Lassie, Lucy Show and etc.", "verified": true, "helpfulness": "0/0", "author": "Maureen"}, {"rating": 3.0, "review": "For people who only watch stuff on Amazon Prime, it's fine but I love Netflix and it will not work well with Netflix. Very frustrating. Also, if you are trying to eliminate cable/dish then the apps, like A&E;, are useless as they make you enter a code that has to be verified by a cable or dish company. Completely ridiculous!! I would have given it fewer stars but I got in on the introductory price so it's getting an extra star since I didn't pay full price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kellysquestforjoy\""}, {"rating": 5.0, "review": "I love how easy it was to set up. It's the best streaming device I've ever used. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "this guy"}, {"rating": 5.0, "review": "This item is amazing , and I would recommend it to anyone that's needs all the streaming in one small bundle", "verified": true, "helpfulness": "0/0", "author": "Jessica hawley"}, {"rating": 5.0, "review": "We really enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Kent Roberts`"}, {"rating": 5.0, "review": "This was the easiest set up ever.  I would recommend to anyone!", "verified": true, "helpfulness": "0/0", "author": "Maedgee"}]