[{"rating": 4.0, "review": "I love this thing. The only thing that would make it better is if it could do the internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Julie G. Loera"}, {"rating": 2.0, "review": "I give this two stars because it's a good idea. However it has terrible problems staying connected. Amazon should recall this and give people their money back . Stay away .", "verified": false, "helpfulness": "1/1", "author": "Ernest Bullard"}, {"rating": 4.0, "review": "Haven't had a chance to use all the features yet.Overall pleased with the possibilities. Only disappointment is the lack of availability with new release movies, either you have to buy or they aren't accessible.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Like it!", "verified": true, "helpfulness": "0/1", "author": "patrick smith"}, {"rating": 4.0, "review": "When our internet server is at it's best, the Amazon Fire Stick works great.", "verified": true, "helpfulness": "0/1", "author": "CJ"}, {"rating": 5.0, "review": "love this thing!", "verified": true, "helpfulness": "0/1", "author": "jeffrey farmer"}, {"rating": 3.0, "review": "Not only did I get the Fire TV Stick, but I was charged for Prime even though when Stick was purchased, it said I got a month of Prime to try it out.  I'm very disappointed the number of movies that have to be paid for, and I'm not talking about recent movies.  I wanted to watch a Tom Selleck movie that was made in 2000, yet I would have had to pay for it.  I would suggest those interested in the item to call customer service and get a full understanding of just what you get.", "verified": true, "helpfulness": "0/1", "author": "BRH"}, {"rating": 5.0, "review": "I had order this on pre-sale.The best 20 dollars that i have ever spend.Works well!!!", "verified": true, "helpfulness": "0/1", "author": "Luis Colon"}, {"rating": 5.0, "review": "This thing is amazing. I'm seriously considering canceling my cable and just using this amazing entertainment geyser.", "verified": true, "helpfulness": "0/1", "author": "billsamazonianbear"}]