[{"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Frank Roth"}, {"rating": 5.0, "review": "Does exactly what it needs to do and more purchases 3 of these for gifts and everyone enjoying streaming TV", "verified": true, "helpfulness": "0/0", "author": "jk"}, {"rating": 4.0, "review": "Its okay wish you didnt need the subscription of prime to watch shows .. will review again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sheri\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Lauren Crawford"}, {"rating": 4.0, "review": "It works pretty well for watching Netflix and Prime. The remote is pretty simple to use but can be a little too sensitive some times. I would say that the biggest disappointment was that you have to have the Fire Stick connected to the power cable all of the time. All and all, I'm pretty satisfied with it.", "verified": true, "helpfulness": "0/0", "author": "Justin Cate"}, {"rating": 4.0, "review": "Plugged it in and checked settings. Works great. Have not had time to load all of my pictures and music. There is some occasional buffering but that might be my wifi speed. I will update as I become more familiar with the system.", "verified": true, "helpfulness": "0/0", "author": "regjane"}, {"rating": 5.0, "review": "This is an easy installation and worth the time, trouble and expense. Maybe now I can 'cut the cord'!", "verified": true, "helpfulness": "0/0", "author": "retirement2012"}, {"rating": 2.0, "review": "I would have rated this higher BUT when connected the language was German, not high German but Austrian German. Web site was of little help . It took a phone call and with excellent handholding I got things into English.  The printed instructions are sub minimal and the website is useless if you want to know how things work and can be used.  A potentially great product with woeful support.", "verified": true, "helpfulness": "0/0", "author": "pen name"}, {"rating": 5.0, "review": "Happy customer.", "verified": true, "helpfulness": "0/0", "author": "Rubayat Mahmud"}, {"rating": 5.0, "review": "I bought this item from Bestbuy a week or two ago on sale And I love it. The price point was perfect for what I was looking for. The setup was easy. Took under 3mins to install and connect to my home network. One of the best purchases I made since my Chromecast.I listen to music and watch my tv series and movies thru it. I LOVE IT!!!AMAZON makes good s***!! Works perfectly with my Amazon fire tablet aswell", "verified": true, "helpfulness": "0/0", "author": "Kelz \"**Kelz**\""}]