[{"rating": 3.0, "review": "Goes out frequently.", "verified": true, "helpfulness": "0/0", "author": "Jean Funari"}, {"rating": 4.0, "review": "I've only watched a couple times and not sure I will use much. It is as described and and I would tell friends about it.", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "everything about the fire products are great.", "verified": true, "helpfulness": "0/0", "author": "Deborah Catalano"}, {"rating": 2.0, "review": "It does what it supposed to do but only on 1 of my tvs. If I move it to the living room where my other TV is it won't connect. Even though all my other devices do. If the fire stick didn't have such a s***ty WiFi adapter I'd say it was 5 stare but not being portable is really kinda unforgivable since that is really the appeal of the stick.", "verified": true, "helpfulness": "1/1", "author": "jamie"}, {"rating": 3.0, "review": "Loved it when it worked, but unfortunately it would not hold the WiFi connection and constantly dropped. Amazon refunded quickly, but it seems to be an all to common problem. Hope they get it fixed as I enjoyed it when it would work.", "verified": true, "helpfulness": "0/0", "author": "Marion & Steve  Rathbone"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Pooran Ramrattan"}, {"rating": 5.0, "review": "Excellent!!!!", "verified": true, "helpfulness": "0/0", "author": "toyloy"}, {"rating": 5.0, "review": "Fantastic answer to my kids being stuck in a hotel for a week. Worked right out of the box.", "verified": true, "helpfulness": "0/0", "author": "C. Townsend"}, {"rating": 2.0, "review": "I was under the impression that it didn't have as many directions to just plug and play and I still don't have it working properly", "verified": true, "helpfulness": "0/0", "author": "Renea Inges"}, {"rating": 5.0, "review": "So happy with this purchase that we bought two of them. Super easy UI for the software, access all the streaming apps I needed especially Amazon prime video!", "verified": true, "helpfulness": "0/0", "author": "Abbas A. Naqvi \"Blistered Brains\""}]