[{"rating": 4.0, "review": "love the remote's simplicity. Also, besides Amazon content it has other features. Easy to plug in and out. Installation a breeze. My purpose for this stick was to enjoy the Prime Video. I did cancel my Netflix membership because Amazon prime had almost same content. However, they are lagging behind and therefore I don't use the Prime video as I would love too. If this product is to be totally successful, at least for me and many others, it must have same or more quality content and updated movie video collection for Prime members rather than trying to sell me episodes or movies that are easily viewed by competition or available at Netflix.", "verified": true, "helpfulness": "0/0", "author": "Cooldude"}, {"rating": 3.0, "review": "Video frequently jerks and has to buffer even though my older Roku does not have any of these issues.  Does not play friendly with my Plex media server either.  If I try to play a TV show through my Plex server that Amazon also offers on a pay basis through them,  my audio mysteriously doesn't work on my Plex tv show.  Go figure.  I also did some Speedtest tests while streaming and the Firestick seems to pull twice the bandwidth than either my Panasonic smart tv or my Roku.  One of my Speedtest reports showed that my Firestick was using 6mb/sec.  That's absurd for a standard 1080p video over Netflix.", "verified": true, "helpfulness": "0/0", "author": "Thomas Fish"}, {"rating": 5.0, "review": "I got this when Amazon was running a special so the price was great and between this and nextflix we are actually thinking about canceling our Dish, if not reducing some of the channels. In addition I have stopped buying DVDs.", "verified": true, "helpfulness": "0/0", "author": "D. Clemons"}, {"rating": 5.0, "review": "One of the best thing I ever bought from Amazon besides the Kindle Fire. This item is so easy to use and plug into your TV that you really don't need the instruction booklet. Just plug it into the TV and electrical outlet and then turn it on. Then follow the instructions on the TV.", "verified": true, "helpfulness": "0/0", "author": "G. Tung \"GT2of3\""}, {"rating": 5.0, "review": "This thing is amazing. I love that it is not another box that I have to add to my entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Texas Droid"}, {"rating": 5.0, "review": "Works exactly how I need it to for the wife and daughter, blown away by the picture quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple, fast, easy to use...great entertainment value!", "verified": true, "helpfulness": "0/0", "author": "Pierre in Marin"}, {"rating": 5.0, "review": "Love it.  Not bulky and ugly; easy to set up and use. Only negative was battery door which made me feel like a chimp trying to use a tool!", "verified": true, "helpfulness": "0/0", "author": "Elina Filander"}, {"rating": 3.0, "review": "At the moment I am so disappointed. I got the Fire Stick to accompany my Fire TV, but am so disappointed the HBOGo app won't work unless I buy another voice Remote for $29+. It isn't the $29+ bucks, it is the principle of having to buy more crap that I don't need. I downloaded the FireTV voice app for my Android phone to handle the app, but am just too fustrated or aggravated to bother. Please fix this SOON, I would hate to wait almost a year as I did for the FireTV to catch up with the rest of the media app stream devices. Other then the app issue, I love the Amazon media devices, they provide wonderful media playback. I will update my rating when this is fixed.", "verified": true, "helpfulness": "0/0", "author": "DanaJoy Florio-May"}, {"rating": 5.0, "review": "Fire TV is great.  My kids love it.", "verified": true, "helpfulness": "0/0", "author": "John Mancinelli Jr"}]