[{"rating": 5.0, "review": "Had a few weird things happen with the ui skipping around when I first got it.  After the first day it stopped skipping and has been working great.  Nice fast UI", "verified": true, "helpfulness": "0/0", "author": "Ryan Moore"}, {"rating": 5.0, "review": "SO EASY TO INSTALL AND MOVIE SELECTION IS FANTASTIC....LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "When I was a small child my dad would tell me stories of Tibet.  I was taught that Spiritual Masters of Tibet could manifest anything they want.  I had to wait a long time, but Amazon made this a reality.  Almost every day I manifest things with a few mouse clicks, and that sure is easier that the training the Tibetan Masters had to go through.  Then there is the idea of Nirvana -- a Spiritual State of bliss.  So when I watch the Fire Stick I think to myself, \"This must be Jeff's Nirvana.\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "love it, love it!! and really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Shirley McWhorter"}, {"rating": 3.0, "review": "Works well, easy set up, best part for me supports Plex", "verified": true, "helpfulness": "0/0", "author": "S. G. Olson \"grasshopper\""}, {"rating": 1.0, "review": "It is freezing up every single day! I am probably going to get my money back!", "verified": false, "helpfulness": "1/1", "author": "walter mainville"}, {"rating": 1.0, "review": "I have the Fire phone and I bought the Fire stick assuming that the Fire stck app would work seamlessly. It did the first day. After that the phone never detected the Fire stick even though both the phone and the stick were on the same wifi network. Even the Fire stick when operated by itself needs to be consistently 'rebooted'. I need to remove it from the HDMI slot or from the power source to be able to view the apps. I also own Chromecast and Roku3 and both of the other products seem better. Chromecast is great in that I am able to get my tablet and spare android phone perfectly connected everytime.", "verified": true, "helpfulness": "1/1", "author": "Jay"}, {"rating": 5.0, "review": "Preliminary review as I just got the Fire TV Stick last week, but it is as easy as pie to install and use.  I can already see how my late nights, when I can't sleep and there is nothing on the television, will improve.  I have a huge \"Watchlist\" with Amazon Prime and to be able to watch on my tv in lieu of the computer (plus the comfort of the couch versus the office chair) is a huge bonus.  My only negative (unless I haven't researched enough) is that there is more detailed information on the listings on the computer.  For instance, if a movie on your \"watchlist\" is no longer streaming but is now charging a fee to watch, that is not information that is provided on the television.  Just make sure all of the items on your \"watchlist\" are free and you're good to go.", "verified": true, "helpfulness": "0/0", "author": "Anne Schulman"}, {"rating": 5.0, "review": "Works like a charm.  Have 2 Roku units, but the Fire TV Stick works as good or maybe at times better.  It was a gift and a very nice gift. If I knew it was going to be this good I would have had a Fire Stick when they came out.", "verified": true, "helpfulness": "0/0", "author": "M. Urso"}]