[{"rating": 4.0, "review": "Great stick for watching Amazon TV and Netflix.  Setup and connection are easy.  Fair warning, the remote is small and easy to lose.  The Android app is hard to use since it doesn't have buttons like the physical remote (swipes only).", "verified": true, "helpfulness": "0/0", "author": "Michael Mutch"}, {"rating": 5.0, "review": "being I a prime customer got the tv stick and very happy with it cant wait to see what there is to watch", "verified": true, "helpfulness": "0/0", "author": "PAULA PETERSON"}, {"rating": 5.0, "review": "I am in awe of the simplicity of setting this up; I'm not particularly tech-savvy, but I was able to get this going on my first try. I have started a Transparent-athon; it is a remarkable series. Congratulations on what looks to be an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Rolling Fork"}, {"rating": 5.0, "review": "great purchase!", "verified": true, "helpfulness": "0/0", "author": "denice"}, {"rating": 1.0, "review": "Biggest piece of junk I have ever owned. If I could give this thing 0 stars I would. I got this to replace the functionality of my PS3. I use my PS3 to stream my movies from the PC to my TV. The Fire TV Stick is supposed to have apps that can do the same thing. It has a few apps that advertise they do.. but they don't. Of all the types of media files the apps can only read mp4 and even then the video is very choppy and only half of the audio is transferred. I have troubleshot everything in my network to make sure the problem wasn't from my end, and it is not. I can stream my movies flawlessly from my PS3, but not from the Fire TV Stick. Streaming media from my PS3 is not the only reason I bought this thing. I was also very interested in the Twitch.tv app. I have to admit that the Twitch app on my iPhone 4S is much superior than this piece of junk. You cannot log into your Twitch account from the Fire TV Stick and there is absolutely no search bar to look for specific casters or games. Since you cannot log into your Twitch account from this app, you cannot see if any of the casters you follow is casting, nor can you avoid those pesky commercials if you happen to be a turbo user. So if the caster you like to watch is not a big name on twitch and/or if he/she is not playing one of the top games on Twitch, good luck finding their channel. Oh and one last thing about the Twitch app on the Fire TV Stick. You can only watch on a crappy resolution. Looks like its 480p, and there is no way to improve the resolution. So basically I have a state-of-the-art, high definition TV, but am forced to watch Twitch in what seems to be 480p. Like I said, the Twich app on my cellphone is superior, not only in stream quality but also in functionality. This was the biggest waste of $40. I could have bought crack with that money and would have enjoyed myself more than I did with this piece of junk.", "verified": false, "helpfulness": "1/2", "author": "Dave"}, {"rating": 5.0, "review": "Love it!  I watch shows using the Fire TV Stick more then cable.", "verified": true, "helpfulness": "0/0", "author": "LEW"}, {"rating": 5.0, "review": "LOVE it!  It's easy to install and it's cheap.  It transformed my tv into a smart tv.  The only down side is that I all I want to do is stay in bed and binge watch tv!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Waste of money. It drops countless time while watching Netflix. I wish I could return it", "verified": true, "helpfulness": "1/1", "author": "Anderson Pierre"}, {"rating": 5.0, "review": "Exceeded expectations. Easy to use, much better performance than the built in apps in the TV", "verified": true, "helpfulness": "0/0", "author": "Steven D. Doyle"}, {"rating": 5.0, "review": "So easy to install and use. Can not wait till more drama series are out from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]