[{"rating": 1.0, "review": "It worked for a week. I'm sorry but it's not a very good product. I have had Roku for years and years. And they still work.", "verified": false, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Lukasz Turolski"}, {"rating": 5.0, "review": "I Love this,so simple to install and BAM your on! I only wish you would have made it possible to preorder more than 1. I would have brought 3 more for christmas! Well I'll save for next year, My family will LOVE this !This is a must have! My only concern is the stick does get very hot,solution unplug when not in use!", "verified": true, "helpfulness": "0/0", "author": "patti knauff"}, {"rating": 5.0, "review": "It's fantastic!", "verified": true, "helpfulness": "0/0", "author": "E Prince"}, {"rating": 5.0, "review": "Set up was very easy.  System started right away and there have been no issues.  Have watched something every day since we received the stick.  Added a few games but I'm not really a gamer.  Been wanting a fish tank so I now have one from Amazon. Like the selection for TV and Movies and the picture and sound quality are very good.  Extremely happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I haven't used it much. But it was easy to hook up", "verified": true, "helpfulness": "0/0", "author": "Mary Tschirhart"}, {"rating": 5.0, "review": "I was watching a movie in five minutes. I love it. Very responsive remote. I have tried to get the Firestick App to recognize it, but it has not worked yet. I have a dual band modem, which was a problem when I set up my Chromecast, so this may be the problem. I have not had time to figure this one out.", "verified": true, "helpfulness": "0/0", "author": "Mark Fowler"}, {"rating": 5.0, "review": "I would recommend to anyone. This little guy comes with a punch. It will turn any tv into a smart tv and it fits in your pocket so you can brings it anywhere. You get a lot for your money.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "Awesome product, we are enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Katie in VA"}, {"rating": 5.0, "review": "Received as a gift.  I like it ALOT.", "verified": false, "helpfulness": "0/0", "author": "Janice A McConnell"}]