[{"rating": 5.0, "review": "Really easy set up...nice to use ...would recommend", "verified": true, "helpfulness": "0/0", "author": "Michel Carpenter"}, {"rating": 1.0, "review": "Worked OK at first..until it started freezing. I went back behind my TV and touched the \"fire\" tv stick (to which it is living up to its name), the plastic case was so hot it was uncomfortable to touch for more than a second or two. After I got it out I tapped the metal connector part real quick and it was hot enough to burn the skin on my finger. Suffice it to say I will not be using this product any more as it seems to be a major fire hazard. Be wary.", "verified": true, "helpfulness": "1/1", "author": "Matthew S. \"Sam L.\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lynne A Couture"}, {"rating": 5.0, "review": "Love it! Very fast streaming", "verified": true, "helpfulness": "0/0", "author": "Jade"}, {"rating": 2.0, "review": "The FIre TV stick strive for greatness yet once again, just like the Fire Phone, fell short of expectations.As is the case with Amazon product, the products appear well constructed, first-class built and hyped greatly by its well-developed advertisement wed page. When I have the choice between this Fire Stick and Roku Stick for my 3 month special Sling promotion, I chose this after reading its wed page and considering all the hypes around its hardware. And as was the case with the Fire Phone, I was quite disappointed.First, the Fire TV isn't exactly popular with apps developer, as is the case with everything in Amazon stratosphere. You will notice that in app advertisement, Amazon put Youtube.com and not the usual YouTube red logo. That's because YouTube doesn't have a dedicated app for Amazon Fire Stick yet. Though this is the least of my problem since there is alternative app that function just the same. I am only mentioning this as proof that app developing for Fire Stick is quite underdeveloped.Second, the app that is active for Fire Stick isn't exactly well developed! SlingTV and MLBTV apps were the main reasons I got this stick to begin with and the lagging, slow responsiveness, freezing and untimely exits have caused me to pull out quite a few hair from my head. I can't vouch for Netflix, Hulu, or HBO Go since I am not subscribed to their services but I can safely assume that their functions isn't much better than what I experienced with Sling or MLBTV.Lack of contents and dysfunctional apps really drive the value of this seemingly powerful stick down. I don't know exactly how Amazon's gonna woo all those developers when the public interest in its Fire Stick remains limited either. So save yourself some time and grief (hair as well), go buy either the Roku stick or Nexus player. The Amazon TV line slowly but surely will end up just like its phone, giveaway nobody wants.", "verified": true, "helpfulness": "0/0", "author": "KIET N."}, {"rating": 2.0, "review": "Was promised a membership with Prime if I bought the Paperwhite and so got this too.  If you don't sign up for Netflix, Prime, etc., your \"free shows\" are limited.  I could get basically the same with the rabbit jack.  Also, he said you could talk your commands to tv with the remote.  NOT, you have to get an app for your smart phone and use the smart phone to talk to the tv.  Who wants to keep their phone on just to turn the programs?  Another disappointment Amazon.", "verified": true, "helpfulness": "0/0", "author": "Aminuts \"D. Mendez\""}, {"rating": 5.0, "review": "Great interface, super convenient remote, snappy and quick.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Chunglo"}, {"rating": 1.0, "review": "I had high hopes for the Fire Stick, but it's just not working for me. The control was broken when I first got it, I ended up having to take it to get fixed, now it's hit or miss whether the whole thing works. It doesn't want to stay connected to internet (yes I've called both Amazon and my internet company), I will be in the middle of a movie and it will disconnect and it'll take me thirty minutes or more to get it back on. So frustrating! I'm definitely not a fan.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "We love this!  Its got about as many bells and whistles as the Roku.  Sometimes it takes a while to load.  And also to start up after being off all day.  Wasn't happy the insurance I got to go with this didn't start until this shipped, and we had pre ordered it.", "verified": true, "helpfulness": "0/1", "author": "Tanks Daddy"}, {"rating": 5.0, "review": "We love this! Got it for my husband for Father's Day so we didn't have to have the computer connected to the TV anymore. It's fabulous! So glad the price is low too!", "verified": true, "helpfulness": "0/0", "author": "Katherine"}]