[{"rating": 5.0, "review": "The set up was quick and simple (maybe 5 minutes).  The speed is impressive.  I mean the spinning wheel that I am used to with my Xbox has been replaced with quick and snappy content loading.", "verified": true, "helpfulness": "0/0", "author": "Heavy \"Heavy\""}, {"rating": 4.0, "review": "Great device. One star off due to some wifi connectivity issues/dropped connections.", "verified": true, "helpfulness": "0/0", "author": "V P"}, {"rating": 5.0, "review": "In my opinion this device provides the best value of all the other media players available.", "verified": true, "helpfulness": "0/0", "author": "Boltsfan91"}, {"rating": 5.0, "review": "We have been considering getting rid of cable and this may very well be what replaces it! Setup was easy and works great so far. Would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Jody \"JodyT\""}, {"rating": 5.0, "review": "Easy to install.  What a great deal this was", "verified": true, "helpfulness": "0/0", "author": "Felando"}, {"rating": 4.0, "review": "I bought the Fire TV Stick because I was tired of keeping my phone plugged in while binge watching The Sopranos, and Amazon is not available on Apple TV. The Stick was easy to install and \"fired\"up immediately. It took a couple of tries for it to connect to my wifi, but that was not really a big deal. The Fire Stick provides excellent picture and sound and I have not had an issue with buffering, something that did happen occasionally when streaming through my phone. The only thing I don't like about the Stick is that navigation is not as easy as I think it should be. Many times, what I want seems to be highlighted and I press the center of the circle to select it, then it jumps ahead to the next item instead. It's a bit annoying and I know someone with less patience than I would be very frustrated over that.", "verified": true, "helpfulness": "0/0", "author": "Else Karlsen"}, {"rating": 2.0, "review": "Would not work on my Samsung tv", "verified": true, "helpfulness": "0/0", "author": "Darrell Wicker"}, {"rating": 1.0, "review": "cant get it to work", "verified": true, "helpfulness": "0/0", "author": "james lakosky"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "marcos vargas"}, {"rating": 1.0, "review": "frustrating to set up, constant disconnects from wireless, no hbo go or twc access.  Once I finally got it working - there were some issues with it even powering up using the power plug and cord provided - and it still said no power was hooked up afterward - took far longer to update than I would have expected.  I guess I shouldn't expect much tho - it's basically worthless at this point tho. At least it was only 20 bucks.", "verified": true, "helpfulness": "0/0", "author": "jared Young"}]