[{"rating": 5.0, "review": "A great device that allows so many options. Great movie selection! Amazon music is impressive. Works great with my Fire HD tablet. Would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "GIrigoyen"}, {"rating": 5.0, "review": "So much easier than the other type.", "verified": true, "helpfulness": "0/0", "author": "Chris Granda"}, {"rating": 5.0, "review": "i love the stick and how it works just need more fastnloud shows and car reality stuff", "verified": true, "helpfulness": "0/0", "author": "greg cook"}, {"rating": 4.0, "review": "Got the fire stick and love it so far.", "verified": true, "helpfulness": "0/0", "author": "Amanda Martinez"}, {"rating": 1.0, "review": "poor.....could not maintain signal strength.....", "verified": false, "helpfulness": "1/2", "author": "Randy Mcallister"}, {"rating": 5.0, "review": "Great price, open platform for future app development, easy to use and quick processor.", "verified": true, "helpfulness": "0/0", "author": "MCP"}, {"rating": 5.0, "review": "Can't complain!", "verified": true, "helpfulness": "0/1", "author": "Dale Gasser \"gasserd\""}, {"rating": 4.0, "review": "Great item, only thing I don't like is how you can't stream media from a phone or pc to it like you can do with chromecast", "verified": true, "helpfulness": "1/2", "author": "MrRafikki"}, {"rating": 5.0, "review": "I don't know how I lived without this!  The Fire TV Stick is wonderful!  I love to listen to music on my tv and dance around the living room.  It even puts the lyrics up on the screen, so you can sing along!  It's great to have all my shows on my tv, without having to hook up the laptop to stream.  Best Amazon invention!", "verified": true, "helpfulness": "0/0", "author": "grad student"}, {"rating": 5.0, "review": "I love it, nice way to be able to watch my streaming shows on the bigger screen. Interface is easy. Can take with me to friends for viewing parties. Would eventually love something that doesn't also need to plug in (the outlets behind the TV are overflowing at this point), but that doesn't affect the user experience. Remote works well.", "verified": true, "helpfulness": "0/0", "author": "SC23"}]