[{"rating": 1.0, "review": "I have been unable to access NetFlix.  I have had several people work on it.  I have someone else coming to help me this weekend and hopefully we will be able to get it working.", "verified": true, "helpfulness": "0/0", "author": "Kay Gage"}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Eric Johnson"}, {"rating": 1.0, "review": "Purchased this for one particular TV series \"Justfied\" but when I went to tune in I was notified therewould be a 2.99 charge for each episode since the 6th Season was not included in the free viewings...I have not used it since. I will return it. I guess if I wanted to view movies or other shows it would be great.", "verified": true, "helpfulness": "2/2", "author": "Tried It"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "rheif callahan"}, {"rating": 2.0, "review": "I like the content and the quality. However, quite frequently the screen goes blank for a few seconds while watching which is very irritating. This is on a 25Mbps Comcast Business Internet link. I have other streaming devices which don't have any issues. Also the stick seems fairly warm/hot to touch. I see these issues on both my Fire TV sticks. I am hoping that hopefully some future software update will fix it.", "verified": true, "helpfulness": "0/0", "author": "Aamir Syed"}, {"rating": 5.0, "review": "Having just let go of a $248 a month Comcast cable payment I decided to try the Firestick since I already have Prime. It's an extremely nice alternative to cable. Granted you don't get as many tv shows but you have the option to purchase your favorite series at reasonable prices which is, for me, FAR less expensive than Comcast.  There is a good selection of TV shows and a wide selection of past and present movies.", "verified": true, "helpfulness": "1/1", "author": "Moose2u"}, {"rating": 4.0, "review": "Item received as described. Working as expected.", "verified": true, "helpfulness": "0/0", "author": "Malvin Loaiza"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Kiet"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "It is the best thing I have purchased in awhile!! Love The fact that we can get Amazon prime and Netflix is great!", "verified": true, "helpfulness": "0/0", "author": "sue moyer"}]