[{"rating": 5.0, "review": "Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "laba"}, {"rating": 3.0, "review": "Well the concept for me was good, but I could not get the audio to work with my surround sound system on my main Television.I am using it on a smaller tv, which disappointed me!", "verified": true, "helpfulness": "0/0", "author": "Domenick Versaggi Jr"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "amanda deleon"}, {"rating": 4.0, "review": "very impressive piece of art! wide selections of apps you can download for free, and very quick browsing!the only reason I give it 4 star is because it has to be connected to the power source! not as Chromecast where it feeds off the HDML port!very good device though on a great deal!", "verified": true, "helpfulness": "0/0", "author": "malak"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Matthew Losik"}, {"rating": 3.0, "review": "Pros:Nice interfaceCan sideboard Android appsCons:-Audio slightly lags behind the video.-Netflix causes my router to crash when it works fine on other platforms.-Have had it for three days but have already encountered numerous app crashes.-Hulu videos often freeze while the audio continues to play.-Search integrates with Hulu and Prime but not Netflix or Plex.It's ok but clearly not ready for prime time.", "verified": true, "helpfulness": "0/0", "author": "Patrick Zarbis"}, {"rating": 3.0, "review": "I think it is pretty simple to use, I like the selection and the Prime exclusives.  My husband and I share a Prime membership (he is the primary Prime member).  I do not like that the shares Prime benefits do not include the Prime exclusives. Any time we want to watch any of the free Prime programs we have to deregister and then log in under my husband.  There are many programs you would need to pay for, but I did find a lot of the stuff I wanted to watch that I would have to pay for I can find on Netflix.  I also feel this loses connectivity pretty frequently and the only way to restore is by resetting the Fire stick.  It is not an issue with being far away from the modem (it is literally about 2 feet from the modem).  I gave this 3 stars because I only paid $19 and for that little money it is pretty good.  If I had paid more I would have given 1-2 stars.  Not sure if the FireTV is better with the connectivity.", "verified": true, "helpfulness": "0/0", "author": "Michelle Sullivan"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 4.0, "review": "Nice little portable package that can be carried with you anywhere. Easy setup. I haven't tried streaming a movie yet, but plan to soon, as I am a member of Prime. The only negative that I don't like is that the dongle electric plug is too wide and takes up more than one socket on my surge protector. I suppose that it can also be plugged into the TV's USB port, but Amazon recommends to use the dongle for best results. I did appreciate the $19 offer for Prime members, back in November, which I did take advantage of!Update; I just finished streaming a nature show, it was very smooth and easy with great picture quality. I am tech challenged so I really cannot over stress my appreciation for the ease of setup and use.", "verified": true, "helpfulness": "0/0", "author": "virginia  d"}, {"rating": 5.0, "review": "Very easy to setup. Really nice to have a access to all the benefits.", "verified": true, "helpfulness": "0/0", "author": "Lisa Freetly"}]