[{"rating": 5.0, "review": "Goodbye U-Verse. with sling TV, Netflix, Hulu, and prime all TV is covered. love the voice search. This will add up to $150.00 a month in savings.", "verified": true, "helpfulness": "0/0", "author": "Ken A Bitter"}, {"rating": 5.0, "review": "everything as advertised", "verified": true, "helpfulness": "0/0", "author": "James Ansley"}, {"rating": 5.0, "review": "get it now!  one of the best things I have ever bought for the house and I sent one to college with my daughter.its amazing!", "verified": true, "helpfulness": "0/0", "author": "Connie Pawlak"}, {"rating": 4.0, "review": "Overall good item.", "verified": true, "helpfulness": "0/0", "author": "LC"}, {"rating": 4.0, "review": "Easy to use & fast access of my fav movies..", "verified": true, "helpfulness": "0/0", "author": "George Porchas"}, {"rating": 5.0, "review": "WoW. Brings us into the 21st century. We've long been Netflix users, having the cd's mailed to us. We have not watched television for 10 years or better, so movies or select TV series are our 'thing.' Along with free shipping to our home in Hawaii for most items we order, our Prime membership now means we can eliminate the hassle of waiting for cd's or having to run to our small post office and mail them back. It's like suddenly having someone give us a shower of presents. And set-up is so easy!", "verified": true, "helpfulness": "0/0", "author": "Bela Johnson \"Medical Intuitive/Life Coach\""}, {"rating": 5.0, "review": "Who needs cable anymore? I love my Fire TV stick and it's saved me from many expensive Redbox bills (I'm very guilty of renting a movie and returning it a week later, sometimes without watching it). The only thing that stinks is that on the Prime TV content, you always have to pay for the most recent season even if all previous seasons are free.", "verified": true, "helpfulness": "0/0", "author": "LindseyLouWho \"Jane of all Trades\""}, {"rating": 5.0, "review": "a lot smart technologies in a small extremely affordable package. and you can jailbreak it to add more features such as live tv", "verified": true, "helpfulness": "0/0", "author": "V.K."}, {"rating": 4.0, "review": "Love Amazon prime and thus is a great addition. Only draw back is it loses connection frequently, a buffed network card in the device would be a godsend! Overall can't complain about the responsiveness and ease of use of the fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Derek Treadway"}, {"rating": 4.0, "review": "So far so good! I have Neo TV and that does not give access to Amazon Prime. Now I do and that is exactly what I wanted:)", "verified": true, "helpfulness": "0/0", "author": "Debby"}]