[{"rating": 1.0, "review": "Paid for 2 day shipping. I got 2 week shipping instead, I'd like my shipping fee's refunded.", "verified": true, "helpfulness": "0/2", "author": "adam"}, {"rating": 5.0, "review": "Works very well, easy and convenient.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 4.0, "review": "Just have had it a week, works well with Prime and netflix. (That is all I have played with thus far). Occasionally is blurry or pauses during streaming, but could also be wifi related. I recommend!", "verified": true, "helpfulness": "0/0", "author": "Dayna Gilmore"}, {"rating": 5.0, "review": "I join the disappointed ranks, may be a complete waste of money. It is constantly buffering and doesnt seem to do much.Update:  after using I like it now,, so giving five stars, it does everything as advertised, kind of amazing with a simple setup. Amazon is good atvwhat they do.", "verified": true, "helpfulness": "0/0", "author": "Stevo"}, {"rating": 3.0, "review": "I'm not pleased with my purchase at all. There are no instructions that come with it. And the availability of programing, although ample, is scattered and hard to access. I thought that this purchase would have condensed my viewing mediums but instead I have just made more choices with one more device to operate.", "verified": true, "helpfulness": "0/0", "author": "Paul Hebert"}, {"rating": 5.0, "review": "So pleased with the Fire Stick, very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "carol nelson"}, {"rating": 4.0, "review": "This device replaced my Roku box immediately! It works very well and I love having my Amazon selections right there on the main page. It's great that you don't have to worry about where it's placed for the remote to work. I'm hoping in the future they add CrunchyRoll and HBOGO, because then this would definitely be a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "Karyn E. Bate-Defoe"}, {"rating": 4.0, "review": "I like that I have a lot to choose from", "verified": true, "helpfulness": "0/0", "author": "Kayla"}, {"rating": 5.0, "review": "I love my fire stick tv . I'm able to watch movies and shows on both my  tv's .I just unplug it and take it with me . And you can't beat the price.I'm no longer paying for cable for two tv's. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Christine Blanchard"}, {"rating": 5.0, "review": "Everything that I hoped for.", "verified": true, "helpfulness": "0/0", "author": "Justin Nelson"}]