[{"rating": 4.0, "review": "I was able to buy these on Amazon for 19.00 which was a great deal. I bought more when they were on sale for 24.99 still a great deal. They are normally $39 which I think is still a decent price. It compares well with the Chromecast which I also use. The addition of the remote and subtraction of Google services is worth the price premium over the Chromecast.The two mains reasons I bought the Fire TV were for the remote control and for the Prime Video capability. They are the two main things missing from the Chromecast which I also use and own. I use the Fire TV mainly for Netflix and Plex which behave much better on the Fire TV Stick than with the Chromecast. The Fire Stick is much quicker at loading, Fast Forward/Rewind, and seeking.PRO: Has a remote control. Works with Prime Video. Faster CPU and more storage than Chromecast.CON: The main issue is the sound glitching problem that appears to be widespread. It seems there is an issue with the power adapter, really surprising that the product shipped like this.A couple minor issues are occasional freezing and restarts. Another minor but nagging issue was getting the remote batter door open was difficult. I would not give this to someone who might be old/young or have hand mobility issues without putting the batteries in for them.It also does not work with Google Play Music (or apps/services to the best of my knowledge). I also prefer the Chromecast for Youtube as it seems to work more smoothly.", "verified": true, "helpfulness": "0/0", "author": "Gavin H."}, {"rating": 5.0, "review": "This was simple to set up & took no time at all to start using. We've been using the Wii to connect to Netflix but Fire TV is so much quicker & easier to use. Plus I have a lot more selections, Prime Plus movies, TV shows, etc. The problem I now have is not enough time to watch it all.", "verified": true, "helpfulness": "0/0", "author": "Lloyd Tabbert"}, {"rating": 5.0, "review": "Looked forward to playing Contract Killer Sniper (guilty pleasure) on Fire HDX 7 viewed on a Samsung 42 HD. Tablet would try to connect and restart, try and restart. While on Amazon tech support, I discovered that although Fire TV Stick said that it was looking for updates during the initial setup, it didn't upload and install the update. Did it manually and it now works ok, though not flawlessly (occasional disconnects) - the Stick and HDX 7 (Fire OS 4.5.2) are less than ten feet apart. Also, the picture quality is a bit bright and over-saturated but is sharp and barely perceptible lag.", "verified": true, "helpfulness": "0/0", "author": "ren0901 \"ren0901\""}, {"rating": 1.0, "review": "Terrible device! Does not work with IOS or by itself. Needs dongle to work with wireless router sitting 10 feet away. No You Tube...no nothing...wireless app is worthless, disconnects every 15 seconds. Will return back to Amazon.", "verified": true, "helpfulness": "0/1", "author": "Klonch"}, {"rating": 5.0, "review": "Update:  it took many hours to download the update on the fire stick.  After it got updated it immediately worked better with my Apple airport extreme router.  Everything is good now.-----------Initial thoughts:The idea of the Fire TV Stick is great.  Unfortunately it has such a slow connection to my Apple Airport Extreme.  My just did speedtest.net and had 13x13 speed.  My samsung phone, iphone, ipad, and IMAC all connect great and run well.  For some reason my Fire TV Stick has such a slow connection that any show pauses for 20 seconds to load the next 10 seconds.  If the connection would be faster I would probably give this 5 stars.", "verified": true, "helpfulness": "0/0", "author": "David Watson"}, {"rating": 5.0, "review": "i love it. it is amazing, smooth and flawless.", "verified": true, "helpfulness": "0/0", "author": "Ragafellah"}, {"rating": 5.0, "review": "Better than", "verified": true, "helpfulness": "0/0", "author": "Kai Schwarz"}, {"rating": 5.0, "review": "Easy set up and great customer service when you need it. I'm thinking of getting another one.", "verified": true, "helpfulness": "0/0", "author": "Kathi"}, {"rating": 5.0, "review": "Easy to navigate. Good picture quality and fast response. Replaced my laptop connected to my TV.", "verified": true, "helpfulness": "1/1", "author": "Squeemey \"runchummey\""}, {"rating": 4.0, "review": "Had it for only a month, still not sure if I like it...", "verified": true, "helpfulness": "0/0", "author": "James D Cochran"}]