[{"rating": 5.0, "review": "Works great...good price.", "verified": true, "helpfulness": "0/0", "author": "Pamela Zyski"}, {"rating": 5.0, "review": "Easy to set up and use. Small and compact. Now I can watch Amazon Prime movies and Netflix on my upstairs TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "LicheeNut"}, {"rating": 5.0, "review": "This was a great purchase in my mind! I can cast straight from note 4, or just use one of the many apps on the Amazon app store. I went from a chromecast to the Fire stick, and I love it", "verified": true, "helpfulness": "0/0", "author": "Dylan Bushong"}, {"rating": 4.0, "review": "It was a gift. I found it very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "sandra harvey"}, {"rating": 4.0, "review": "An absolute must if you have Amazon Prime. Simple interface, easy to search, lots of power in a little stick. Once it gets HBO GO, it'll be perfect.", "verified": true, "helpfulness": "0/0", "author": "Daniel Stefano"}, {"rating": 5.0, "review": "Love it! Love it! Love it! Why can't Apple do the same thing with the AppleTV product.  Amazon, keep up the amazing work. Kudos!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Johnny Bridge"}, {"rating": 3.0, "review": "Would probably give this a 3.5 star if I could.Pros:Simple setupNice enough interface, easy to navigate aroundCons:* No Hbo (I know this is coming down the line)* What's the point of the stick like interface, if I still need a power cord dangling behind my wall mounted TV?* No method of playing Google Play Store videos* No WPS setup for WiFi - entering that long key takes forever* Setting up Netflix requires you to enter your user and password, versus having you visit a unique URL on your laptop to link it to your account, like the PBS Kids app does.* No way to skip to intro video, I know there are people that need it, but not all of us do.", "verified": true, "helpfulness": "0/0", "author": "Sue Madre"}, {"rating": 4.0, "review": "The Fire TV was intriguing but I couldn't justify the price. Now the Stick is a different story. I picked it up during the initial sale, so for $20 it was worth a shot. And man, has it been great. It's much faster than my smart tv at streaming shows from all sources. I have also gotten XBMC working on it. It streams MP4 just fine. Struggles with mkv. All in all very happy.", "verified": true, "helpfulness": "0/0", "author": "S. Blake"}, {"rating": 5.0, "review": "Wow what an amazing device.  My Fire TV Stick arrives this afternoon. Setup was so easy, I can see why some folks were up set about the time it took to check for updates a minute is a really long time. I was up and running in about 3 minutes.  While you do have to watch the video I found it informative. Video and sound quality is fantastic and they load very fast. Viewing photos is great anything you have on the Amazon cloud drive will be on your Fire TV stick. Any music you have on Amazon will be there as well with great sound quality. The Fire TV App for android works great.  One more thing the remote battery compartment is very easy to open.  Amazon really hit the mark on each and every point with the Fire TV Stick. I highly recommend the Fire TV StickUpdate: I couldn't be happier with my Fire TV Stick. There is one feature I found while I had an Amazon video on pause. The screen saver...it's not like any TV screen saver I've seen Amazon outdid  themselves with the beautiful pictures they used. Well done Amazon, well done.", "verified": true, "helpfulness": "0/0", "author": "D. Maloney \"Pepaw\""}, {"rating": 5.0, "review": "I love this Fire TV Stick. It works out of the box without problem. One minor inconvenience is the thin and small size of the  remote. It is easily misplaced. Would it not be good if it has a keychain on its bottom side?Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Tomahawk One"}]