[{"rating": 5.0, "review": "I had the device installed in 5 minutes. Was online in another two. Able to watch content my blue ray player hadn't been able to play for the past two months first attempt.", "verified": true, "helpfulness": "2/2", "author": "Christopher Riddle"}, {"rating": 5.0, "review": "I was reluctant to have to buy another device and service (I have Apple TV and Netflix) but I am a TV junkie. I admit it. Full disclosure. I am so happy and impressed with the stick and the original Amazon productions. The layout is very user friendly, the remote only has what it needs to have. We went thru Bosch in a matter of days. Loved it! Next up is Transparent, Alpha House  and Mozart. So glad I invested in the stick. We had to place it in a different room due to the location of our router and have had no problems with buffering (annoying).", "verified": true, "helpfulness": "2/2", "author": "Musiclover35"}, {"rating": 5.0, "review": "Easy to set up. Really enjoy watching my kindle movies on large flatscreen TV", "verified": true, "helpfulness": "2/2", "author": "Barry Paules"}, {"rating": 5.0, "review": "GREAT!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome experience. It combines all of media acct s onto one device that I can travel with and use on hotel Tv's.", "verified": true, "helpfulness": "1/1", "author": "Elroy Cartwright"}, {"rating": 3.0, "review": "I purchased this to watch Amazon Prime movies because the Sony Blu-Ray player required more bandwidth than was available. I still had a problem with more buffering than time watching with the fire stick. I contacted support to see of there was a way to go to SD over HD but they had no answer for that. I purchased an HDMI cable and run it through the computer which gives me the option of SD over HD (SD requires less bandwidth than HD). There is a little difference in the quality of the picture but is better than continual buffering.Check to make sure that you have enough bandwidth to make this work before purchasing. It will require 2.5 Mbps to function for HD.", "verified": true, "helpfulness": "2/2", "author": "D Look \"lfi@midmaine.com\""}, {"rating": 4.0, "review": "easy to hookup and use", "verified": true, "helpfulness": "1/1", "author": "John W."}, {"rating": 5.0, "review": "It awesome  easy to work with", "verified": true, "helpfulness": "1/1", "author": "michael garcia"}, {"rating": 5.0, "review": "Very easy to hook up and use.", "verified": true, "helpfulness": "1/1", "author": "Eric"}, {"rating": 5.0, "review": "Really really cool. I love that you can stream Amazon Prime TV and Netflix, and also play games. My only dislike is the location of the usb port on the stick itself, it makes for an awkward fit behind my TV. The cord actually sticks straight up out of the middle of the stick and not out of the end. Kind of a design fail if you ask me. Five stars for performance though.", "verified": true, "helpfulness": "2/2", "author": "Andrew B"}]