[{"rating": 5.0, "review": "Love it! Just wish you didn't need a cable provider to watch sports.", "verified": true, "helpfulness": "0/0", "author": "Holly"}, {"rating": 5.0, "review": "Great device, coming from a Roku and a XBMC box, this is the the simplest solution I have used. This does everything you need but could lack full features. This is a great secondary device or a device for a bedroom or a children room. If you are looking for a all in one solution look into the larger Fire Tv. I am very happy with my Fire Stick, I would buy one for each TV in the house!", "verified": true, "helpfulness": "0/0", "author": "Bryan B"}, {"rating": 2.0, "review": "It was good when it worked, but it would not stay connected to the wireless internet.  My smartphone, laptop, and tablet all do without a dropped connection in a couple of years.  This dropped every 20 minutes or so - or would work all the way through a show and then not work the next time I tried.  When it worked it was pretty slick but I spent hours trying to find a work-around.  Back to accessing Prime through my Smart TV but the other TVs in the house are out of luck.  I was disappointed and really wanted it to work.", "verified": true, "helpfulness": "0/1", "author": "ccjay"}, {"rating": 1.0, "review": "So far, it's a dud.  Video with no sound, after an hour with a customer service agent whose English was marginal I requested a supervisor.  He then admitted that there is a \"problem,\" they are aware of it and will try to get it fixed in the next few days.  Fine, why take me through almost an hour of troubleshooting if you know there is a problem with the sound, you have a large volume of calls regarding the same issue and you know it is a software update issue.  Tell me it won't work up front and don't waste my time.", "verified": true, "helpfulness": "0/0", "author": "Nathalia Hardy"}, {"rating": 5.0, "review": "My dad has been essentially asking for a really long time,  for a way to get access to amazon and other movie sites onto the TV without having to a pay a ton. When I saw that Amazon was coming out with the TV stick, I knew this is what he would want and Christmas was coming up.  Instantly I knew we would have issues in our house because we have several WiFi dead-zones. So when the stick arrived and we plugged it in, sure enough it had connection issues. SO FOR ALL  OF YOU COMPLAINING ABOUT THIS ISSUE, do what we did and buy a WiFi extender or a more powerful router altogether. Soon as we had the WiFi issues settled, the stick worked like a charm. Thank-you Amazon.!", "verified": true, "helpfulness": "0/0", "author": "Sarah C."}, {"rating": 2.0, "review": "I bought it because I wanted to watch TV episodes & movies that I had 'missed' on TV in the last year or two... only to find out that Any Episode Season 1 of Any Show was going to cost me an Additional $1.99 to $2.99 per Episode! That didn't even start on any movies I might want to watch!It was a ripoff. All the Ads make it sound like 'all you need is this device to watch any streaming program or movie' on your TV from the Internet... Nooo... you have to pay for them just like Pay Per View or any Netflix or Cable Viewing.So I had it taken back. For the $2 - $3 every show I want to watch (5-6 shows a night) that would add up to more than my Charter Cable Bill!! Gimme a break!", "verified": true, "helpfulness": "0/0", "author": "Linda Beghtel"}, {"rating": 2.0, "review": "Promptly got rid of it after using it for a bit.  Nothing beats a Chromecast...", "verified": true, "helpfulness": "0/0", "author": "dorrellg"}, {"rating": 1.0, "review": "Useless..unless your router is next to where you plan on connecting...it doesn't work. Waste of time and energy. .. now i have to go through the process of returning. ..which i hate to do.", "verified": true, "helpfulness": "1/1", "author": "Tsedenia Woldehanna"}, {"rating": 4.0, "review": "This is a nice media device.  It will be worth 5 stars one day.  Right now the apps are very buggy.  My girls watch Disney Jr and the app resets a lot.  Same goes for the history channel app.  Things just seem buggy.  The amazon content seems to work well, but the secondary applications need work. The device can hide behind a TV that is mounted on the wall.  Mine has a powered usb right next to the hdmi so I didn't have to worry about power adaptor.  The Fire remote is nice, but if you have little ones keep it away from them because it is very small and can be hidden very well.  Once this has been out and the bugs worked out this will be an awesome tool.  I do wish I could cast video similar to the chromcast.  That would be a nice feature.", "verified": true, "helpfulness": "0/0", "author": "EEdesigner83"}, {"rating": 5.0, "review": "I bought the Amazon Fire TV and loved it so much I bought the Fire TV Stick for the bedroom. Super easy to set up. This remote doesn't have the voice search like the Amazon Fire TV but with the app for the iPhone you can use voice search...Easy Peasy!", "verified": true, "helpfulness": "0/0", "author": "S K Conn"}]