[{"rating": 1.0, "review": "I have 30 mbps internet service, and this device has constant interruptions throughout shows. Often freezes picture in middle of shows, sometimes audio continues but picture freezes. Our internet is great. Streaming on xbox works without any problems. I have yet to troubleshoot", "verified": true, "helpfulness": "0/0", "author": "ROBBY B"}, {"rating": 4.0, "review": "Amazing!!! Works like a charm and its good for travel too. I love my Fire TV stick. Amazon just keeps it coming with the great products and this one is really A plus! only thing I don't like is the remote. Wish it were easier to tap the keys because they a little sticky", "verified": false, "helpfulness": "0/0", "author": "Marsgurlwiebe"}, {"rating": 4.0, "review": "A nice, easy way to stream videos. Working well so far.", "verified": true, "helpfulness": "0/0", "author": "Scott G Sharp"}, {"rating": 3.0, "review": "this product looks very beautiful,but have some shortcomings.the design of power is extremely strange.when you wtach the video,every 15mins there will be a cutting.not very fluent.  comparing to other android tv box,there is no advantage.and my information show the memory is 494m", "verified": true, "helpfulness": "0/0", "author": "shaww517"}, {"rating": 3.0, "review": "Works qui.te well...", "verified": true, "helpfulness": "0/0", "author": "Kevin Donaldson \"kevin donaldson\""}, {"rating": 5.0, "review": "Best investment ever!", "verified": true, "helpfulness": "0/0", "author": "P. Mason"}, {"rating": 4.0, "review": "Works great with my Slingbox M1, can be a challenge to get online on hotel wireless systems...", "verified": true, "helpfulness": "0/0", "author": "RYAN M ROBERTS"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Diakil"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Gianna Felix"}, {"rating": 1.0, "review": "I have been able to get it to connect 1 time to the internet since I bought it 2 months ago. I thought it may be my internet so I borrowed it to my mom and nothing. Could not connect. Also you need to plug in into the TV which I knew but that if had to be plugged in to a outlet also was a bummer. If you want any help with it GOOD LUCK!!!!!! I thought maybe there was a setting that I could change to get better luck but the manual that come with it basically tells you plug it into you TV and the wall. If you aren't getting a good signal add the extender to it. I had my router sitting behind my TV and that was still not strong enough signal. I have very fast internet for everything else. (use the XBOX and a BluRay player and they are perfect) Bought this to have something easy to move from TV to TV.SAVE YOUR MONEY!", "verified": true, "helpfulness": "0/0", "author": "Heidi Hemmesch"}]