[{"rating": 4.0, "review": "Works OK. I would like to be able to connect it through my sound system, because my HDTV does not have good sound quality. Problem is  probably with my sound system.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Great features and value.  Love the integration with Amazon Prime, as well as access to pretty much all the other streaming services.  I also have the full size Amazon Fire TV, so the Fire TV Stick isn't quite as smooth or responsive as its bigger brother.  That's probably to be expected due to its size.  It still works great regardless... just not as refined.  I would buy it again without hesitation.", "verified": true, "helpfulness": "0/0", "author": "William E Kraft"}, {"rating": 5.0, "review": "Easy and useful", "verified": true, "helpfulness": "0/0", "author": "Marcia Moore"}, {"rating": 4.0, "review": "Works well for the money.  Would be nice to have netflix as part of the home menu.  Instead you have to go to the app section and run the netflix app.  Netflix works very well with HD and no buffering or freezes.  Amazon prime occasionally looses sound or picture will freeze but not too bad.  Haven't yet tried to send android display to the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "William Godwin"}, {"rating": 5.0, "review": "Easy to install, everything you need is in the box.  Within minutes I was up and running.  I already had Amazon Prime hooked to my main tv and wanted to add the movie and tv options in another part of the house, with the price of the Fire Stick it was a no brainer.  My only issue is not with the product but with my internet connection, it isn't strong enough to watch more than one tv with this set up at a time but works fine for me", "verified": true, "helpfulness": "0/0", "author": "Dottie C"}, {"rating": 5.0, "review": "It is awesome! User friendly!", "verified": true, "helpfulness": "0/0", "author": "Deanne Holman"}, {"rating": 5.0, "review": "It performed well and did everything it was supposed to do.Easy to set up and get started.", "verified": true, "helpfulness": "0/0", "author": "Deborah A."}, {"rating": 4.0, "review": "I was impressed with the Fire TV stick's easy install and setup. I installed the physical device on a HDMI port on my surround sound system which not only let me us the TV but gave me a much better listening option. The interface is simple and saves recently viewed or listened to items which allows easy continued viewing of TV episodes in a series. As well as favored music choices of Prime music. It imported all the saved music from all of my networked computers. The only downside to that was a lot of duplication and I have yet to learn how to reduce the duplications.I would have given it five stars if I had been able to listen to Prime Music Stations but, alas, I could only access saved music and playlists along with the Prime playlists on the device. This was a big disappointment as it was the primary reason for getting the Fire TV stick was to listen to Prime Music Stations on my stereo. Big disappoint there, but what I can listen to sounds really great.", "verified": true, "helpfulness": "0/0", "author": "Colonel C."}, {"rating": 5.0, "review": "I haven't watched any movies or programs yet, but have set up a watch list for later.  It was so easy to hook up and I'm sure I'll enjoy using it in the future.  One thing I really like is the great variety of things available.  The quick shipping was an added bonus.", "verified": true, "helpfulness": "0/0", "author": "Mary K. Heath \"Marida\""}, {"rating": 5.0, "review": "Easy to use even for a novice", "verified": true, "helpfulness": "0/0", "author": "Gregg Arickx"}]