[{"rating": 5.0, "review": "Very Good", "verified": true, "helpfulness": "0/0", "author": "Javier Brenes"}, {"rating": 5.0, "review": "LOVE THIS!!!! Makes my program viewing all the more personalized.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "I really like the fire stick, in fact the one that just came is the second one I have purchased. Now I have one for my bedroom TV, and the big one in the living room. I thoroughly enjoyed \"the Glades\", and some of the movies I can stream with those, and prior, the \"Bosch\" series. I had a lot of Connelly's audiobooks, and love to see it come to life life on screen. Having Amazon prime, and having it for some time, I appreciate all the additions that come along that are accessible with the fire stick. I would highly recommend this as an addition to your home entertainment systems.", "verified": true, "helpfulness": "0/0", "author": "James LaBundy"}, {"rating": 5.0, "review": "The new update that allows for an browser login has really helped", "verified": true, "helpfulness": "0/0", "author": "Andy Parker"}, {"rating": 5.0, "review": "For anyone wanting to turn their regular tv into a SMART television...this is the product to buy! Setup was a breeze right out of the box and the update went with NO problems. The perfect fit for my bedroom television...thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Tammy Garibay"}, {"rating": 5.0, "review": "works much better than expected, need  a good wifi signal so it works properly, got it for Netflix but youtube comes in good, has other service streaming channels that I haven't gotten around to trying", "verified": true, "helpfulness": "0/0", "author": "MetalVagabond"}, {"rating": 4.0, "review": "I was able to set up the Fire TV Stick easily.  So far the system has worked very well.", "verified": true, "helpfulness": "0/0", "author": "Robert S. Burr"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "jim fisler"}, {"rating": 5.0, "review": "Amazing experience!!!", "verified": true, "helpfulness": "0/0", "author": "Shaun Lawson"}, {"rating": 5.0, "review": "It worked great from the very beginning.", "verified": true, "helpfulness": "0/0", "author": "J. Kee"}]