[{"rating": 4.0, "review": "Disapointed that we can't watch Game of thrones free", "verified": true, "helpfulness": "0/1", "author": "Becky"}, {"rating": 1.0, "review": "it broke before I used it for 2 months. I was very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Hobbs"}, {"rating": 5.0, "review": "I bought this as a gift for my 72 year old mother,  Finding most technological gadgets hard to understand, my mother was able to comprehend the Fire TV Stick's instructions and steps.  She has no problem navigating Fire TV Stick's various channels/programs and loves its simplicity and benefits.  I thank Amazon for creating and offering it.Beth", "verified": true, "helpfulness": "0/0", "author": "beth"}, {"rating": 5.0, "review": "Great, I could see my favorite TV shows and series.", "verified": true, "helpfulness": "0/0", "author": "Luisin"}, {"rating": 5.0, "review": "Simple to setup.  Simple to use.  Reliable.  Customer support is excellent.", "verified": true, "helpfulness": "0/0", "author": "John Sloat"}, {"rating": 3.0, "review": "It was decent yet I took it back to the place i purchased it from as I was able to hook my computer to my television so I'm happy with the setup I have!", "verified": true, "helpfulness": "0/0", "author": "Cindy Jones"}, {"rating": 5.0, "review": "Very easy to install,instructions are simple and easy to follow.", "verified": true, "helpfulness": "0/0", "author": "ray snarski"}, {"rating": 4.0, "review": "The device is very good, it's fast and powerful for such a small device. It's definitely better that google chromecast. And more powerful than Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Ninjas"}, {"rating": 5.0, "review": "I have used many devices like this and being able to mirror devices to the firestick plus it searching all attached services when I am looking for something specific is very nice. I liked it so much I bought two. Occasionally on long use the video would begin to break up some. Just unplug it for 10-15 minutes and it should begin working like a champ again.", "verified": true, "helpfulness": "0/0", "author": "P. Ryan"}, {"rating": 5.0, "review": "Ease of use,very fast.opens a new way of TV entertaining and conveniences for me.The best way to turn you TV with HDMI ports into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "H Q Pham \"Tech enthusiastic\""}]