[{"rating": 5.0, "review": "Seriously, this is one of the best things that has happened to me as far as streaming video goes. I use to use the Xbox 360 solely for netflix, and since I didn't want to pay the Gold membership fee, I decided to grab one of these on prime day. So glad I did! The iPhone app that you can get for this works like a dream as well. Not to mention, you hardly had to lift a finger to find your Fire Stick and start taking control. Awesome piece of technology, very fast and easy to setup, I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Daniel Dalton"}, {"rating": 4.0, "review": "This is great for my sons bedroom but I wish it has a Netlfix button on it. Otherwise perfect and I really like the Amazon pin to safeguard purchases.", "verified": true, "helpfulness": "0/0", "author": "Tee Adams"}, {"rating": 3.0, "review": "keeps dropping Netflix stream, don't know why", "verified": true, "helpfulness": "0/0", "author": "Michael J Cross"}, {"rating": 5.0, "review": "Works as described. Expectations were met.", "verified": true, "helpfulness": "0/0", "author": "William Daniel Herman"}, {"rating": 5.0, "review": "Fantastic divice!  I'm might stay with this for a while and then get the bigger one.", "verified": true, "helpfulness": "0/0", "author": "all about the music"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "ks"}, {"rating": 5.0, "review": "It does great when it has the adapter plugged into the wall so it can get all the power it needs. I needed something simple so I could use my plex server on my TV without another computer connected. Now all I need is a better wireless router.", "verified": true, "helpfulness": "0/0", "author": "Alexander T."}, {"rating": 5.0, "review": "Easy to use and delivers!", "verified": true, "helpfulness": "0/0", "author": "Wish things worked"}, {"rating": 5.0, "review": "You really can't beat the price of the Fire TV Stick. This thing is great! I'm no longer stuck watching videos on my computer, or kicking my boyfriend off of his Playstation to watch Netflix. You don't need to upgrade to a smart TV, this thing is all that you need! I especially love the Fire Remote App that you can get on your phone, and while it's not necessary it certainly is convenient. I would definitely recommend this to anyone, and if you are a Prime member I don't see any reason why you shouldn't have one!", "verified": true, "helpfulness": "0/0", "author": "K. Sedar"}, {"rating": 5.0, "review": "This Item hardly needs another 5 star review. But I'll give it one anyhow.I have had a computer connected to my TV for as long as that has been possible. Therefore I didn't understand the purpose of this thing. Why would anyone want yet another \"Thing\" to deal with, when you can do the exact same thing with your computer. Still, I am a gadget nerd and I have been looking at this thing for quite a while. We cut our cable off almost 2 years ago and have been doing fine with the internet and an antenna. But recently, I saw this for $39 and thought what the hell. Let's see what the hype is about.Turns out that the fire TV stick is tuned up for watching internet based Media on your TV. Lol. No kidding right? But the point is it is many times better at feeding you media than your computer alone. The way you interface is much easier and far superior to using a keyboard and mouse. And further, I never would have thought of looking for half of the stuff that is available to you. I never would have gone looking for \"NOVA\" documentaries on my own for example. But seeing them offered was all I needed to be interested in watching them. We had Amazon Prime anyhow, and Netflix. Both items we used on the computer previously. I am a huge YouTube watcher, and that is here too along with a host of other things that I never really knew about before. And it’s all accessed with about the simplest remote I have ever seen. This gets 5 stars because it's simply brilliant. It is many times better at delivering internet based media to your TV than your standard computer setup. Far from being a gimmick, I wish I had got this lil gadget sooner.", "verified": true, "helpfulness": "0/0", "author": "SallyMacLennane"}]