[{"rating": 3.0, "review": "Sometimes crashes and needs to be unplugged. Most amazon games don't load onto it like they say they do. I still like it and use it daily. Fix these things and 5 stars all the way.", "verified": false, "helpfulness": "0/0", "author": "Samuel R Wart"}, {"rating": 5.0, "review": "Perfection!", "verified": true, "helpfulness": "0/0", "author": "K. Rena Whittaker"}, {"rating": 5.0, "review": "After reading the manual (sold separately) I found this surprisingly easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "cricutgal123"}, {"rating": 5.0, "review": "Was torn between Fire TV Stick & Fire TV Box. We love the stick. It truly was easy to set up following the instructions. So far this is replacing Cable TV for any TV viewing in our house. Thank you Amazon for another great product.", "verified": true, "helpfulness": "0/0", "author": "DB \"Finally a Mom\""}, {"rating": 5.0, "review": "I have all of the gadgets (Roku, Apple TV, Netflix, etc). But I have to say the Fire TV Stick is my favorite.  The picture quality is impeccable (sometimes my Apple TV is pixelated) and the download is almost instantaneous (Netflix on my older DVD player tends to buffer while the Apple TV may have to restart).  I think Amazon is changing the way we watch TV and movies.  Plus the fact that it comes with my Prime membership may be enough to make me cancel my other services.", "verified": true, "helpfulness": "0/0", "author": "Shawn Maus"}, {"rating": 5.0, "review": "Awesome product!Easy to use and works great. Now I can watch Netflix on my tv instead of my phone... I love it.Just be aware when you get it that the round circle on the remote is actually a navigation button... press it. It took me a minute to figure that out and I couldn't get started until I called tech support for help... yes, I felt very dumb!", "verified": true, "helpfulness": "0/0", "author": "Outrageous Lady"}, {"rating": 3.0, "review": "Can't understand why it stops working when there is no internet connection. I still want to use the PLEX app to access the movies in my PC when the internet is down.", "verified": true, "helpfulness": "0/0", "author": "Tracy N"}, {"rating": 5.0, "review": "The little brother to the Fire TV set top edition, however don't let the size fool you, these little guys are packed full of power. Streams in full 1080p flawlessly!", "verified": true, "helpfulness": "0/0", "author": "arsonone"}, {"rating": 5.0, "review": "I signed up for Prime and ordered the Fire stick. I did not get it when I thought was supposed to, contacted Amazon, they got right back to me, I did not see that the Sticks were on backorder. Amazon was able to get it to me much faster than expected I am real happy with the service and the Fire Tv.", "verified": true, "helpfulness": "0/0", "author": "riverstone"}, {"rating": 4.0, "review": "Excellent! very easy to install. Great for me that I am a traveller and I use it en every hotel. Very easy to carry on..", "verified": true, "helpfulness": "0/1", "author": "Gugusera \"AndreaPM\""}]