[{"rating": 5.0, "review": "Very nice product. It is very fast and fairly easy to setup. I had to consult the help to find the MAC address. I did learn that the Fire TV app is really for phones and not tablets. I installed it on my Nexus 7 and it ran, but could not get it to register the device. I installed the app on my android phone and was able to register the device to it and use it, including the voice control. It was a great deal for the $20 I got it for. I should have ordered the maximum on 2.", "verified": true, "helpfulness": "1/1", "author": "J. Tidwell"}, {"rating": 4.0, "review": "This was well worth the $19 I paid just to access Prime video & other amazon content streaming instead of having to wait for a download to the TiVo. Haven't even explored the other apps yet as most are already available on our other devices, but impressed with the Prime content alone already!", "verified": true, "helpfulness": "0/0", "author": "Tracey Birch"}, {"rating": 4.0, "review": "I was disappointed that I can't add channels as I can with Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I ordered this during the 2 day sale and only paid 19.00.  I still don't have it. I've been notified I won't get it till mid-Jan. I am moving the end of Dec. Now I have to  cancel my order and get in line again in Jan. Amazon - I love you but you really dropped the ball here.", "verified": false, "helpfulness": "0/9", "author": "Cynthia Bigelow"}, {"rating": 4.0, "review": "It's bigger than I expected, and it took 4 tries to find my wireless network, but once it found the network and updated its software, it seemed to work nicely.  I only explored Amazon Prime so far and was pleasantly surprised at the choices.I am looking for a way out of my expensive and unreliable cable TV.  Maybe this will help.", "verified": true, "helpfulness": "0/0", "author": "Jean A Gresick Schugsta"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "1/1", "author": "SaraJin"}, {"rating": 5.0, "review": "Easy to use. I love it.", "verified": true, "helpfulness": "1/1", "author": "Shirley Maraman"}, {"rating": 5.0, "review": "So easy to set up, intuitive remote and simple operation. Love the music app, complete with scrolling lyrics! Kids love the games. Overall A+ -- I am a Prime subscriber for the shipping, but I can definitely see myself using the full offerings of Prime now that it is in my living room, rather than just a PC!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works really well. Deducted 1 star for no HBOgo app. Easier to use than chromecast for watching netflix and Hulu, and I like that it has a remote.<edit>: After months of use, I really wish I could \"cast\" to this, but screen mirroring doesn't work with windows 8. I guess I'm stuck using chromecast for some things until they get that straightened out. Maybe windows 10 will fix it.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "This is a good product. I payed $100 for a Roku Cube and this does everything and more than the cube", "verified": true, "helpfulness": "0/1", "author": "Dorothy A. Anagnostis"}]