[{"rating": 1.0, "review": "This product is a piece of scrap. I bought this thinking it would be a good replacement for my dish tv because I have several other providers besides Amazon such as Netflix hulu.... I received the device plugged it in and it worked great the next evening say down to watch it and selected a show to watch from Amazon prime and 2 minutes into it it shuts off and won't restart so I thought maybe it was just a glitch. I was very wrong. In the mean time we had a vacation and many other life things going on didn't use it say down this morning to watch it and have been making a trip after every episode to go and unplug the device wait 5 minutes plug it back in plays one episode then shuts down 2 minutes into the second episode...every time. Whether it's on Netflix or prime same results...look into returning it now and it's past the30 days so I can't...not very happy figured it would be a great device being it was from Amazon I could at least watch that again I was very wrong...", "verified": true, "helpfulness": "1/1", "author": "Steve wood"}, {"rating": 4.0, "review": "iam very impresed with this little device,very easy to install,faster than roku ,very good interface,easy to follow guide,i made the conection in a few minutes,currently iam using netflix as my main entertainment provider,the only downside i found is the lack of apps missing that i could get only via roku........ for example with fire tv i can not get the following channels available for free thru roku channels like: Vudu  ,M go premium  ,google play movies & tv  ,watch free flix  ,Ov guide free movies and tv  ,Film rise free movies & tv  ,Snagfilms  ,Viewster  ,Frightpix  ,Epix channel  ,Popflix  ,Bigstar movies and a few more channels not available via fire tv.so as u can understand for me this is fustrating but maybe for other people this is not going to be a problem.i hope fire tv could fix this by adding at least a few of this channels available thru roku.thats why i give 4 star if u fix this i will give 5,however i still recomend fire tv if you don't mind loosing any of those channels i mentioned above..by the way i forget to mention something positive about this little gadget it can play many video games most of them for free of course will be better buy and use the fire tv game controler than use the remote control included but it works.", "verified": true, "helpfulness": "1/1", "author": "ariel"}, {"rating": 5.0, "review": "My son loves it!", "verified": true, "helpfulness": "0/0", "author": "OnlyChristine"}, {"rating": 5.0, "review": "I love it !!!!!!", "verified": true, "helpfulness": "0/0", "author": "Shirley Werner"}, {"rating": 5.0, "review": "This is the second one I've purchased . It's great !", "verified": true, "helpfulness": "0/0", "author": "Helen  Banda"}, {"rating": 5.0, "review": "So Far It's awesome. Only had it up for one week yet", "verified": true, "helpfulness": "0/0", "author": "Cryochic"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "harold dean steelman"}, {"rating": 3.0, "review": "I am not highly impressed with the quality of this streaming device. It does not work as well as others that I have had in the past.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as described.", "verified": true, "helpfulness": "0/0", "author": "Barry A. Kinsella"}, {"rating": 2.0, "review": "I am one of the people that likes Amazon Prime video (I also have netflix), I thought ohh nice I can have something for amazon prime. But the remote part sucks. I thought I would be ok with it, but no, I hate having to open an extra thing. I regret purchasing it as it now sits plugged into my TV doing nothing.Basically if you are ok with having yet another app you need to use in order to use what for the lack of better description other apps, then its fine. But not for me", "verified": true, "helpfulness": "0/1", "author": "S. Melamed"}]