[{"rating": 5.0, "review": "I got this tone replace a broken chromecast, and I'm so glad I did.", "verified": true, "helpfulness": "0/0", "author": "T. D. Bostic \"Just some dumb military guy\""}, {"rating": 5.0, "review": "love this!!!", "verified": true, "helpfulness": "0/0", "author": "trish"}, {"rating": 5.0, "review": "After using it for about a month, I can say it is an excellent product, previously used the connection to my Smart TV Panasonic, the access was not very fast compared to Fire TV which is pretty fast in the process of selection of the movies is pretty good. I can also control my FIRE TV with my mobile galaxy S5 just download the application, this is incredible!.", "verified": true, "helpfulness": "0/0", "author": "Glenn Olivo \"Icegle\""}, {"rating": 4.0, "review": "This works great.  I am a Roku fan and it works just as well.  Not good for gesDue to the remote.  Roku remote resembles a gameController, Fite Stick does not. Makes it terribly difficult to play games.", "verified": true, "helpfulness": "0/0", "author": "jc \"Janice\""}, {"rating": 5.0, "review": "Love it! It has totally replaced our Apple TV. We love amazon prime video too which this makes super easy to use. It also has Plex, which is a huge plus!", "verified": true, "helpfulness": "0/0", "author": "Roger Henry Miller"}, {"rating": 5.0, "review": "Nice and easy", "verified": true, "helpfulness": "0/0", "author": "Marco A Rodriguez"}, {"rating": 1.0, "review": "Terrible picture, its like an old VHS. Yes, have checked settings. Sound is off too (lips move different than video).Just get the fire box or the apple tv.", "verified": true, "helpfulness": "1/2", "author": "S. Devitt"}, {"rating": 5.0, "review": "We bought this for our Smart TV which is actually a Dumb TV and would so often not be able to access TV shows on Netflix or Amazon prime saying \"this video is unavailable.\" I'd read this device is has much stronger connection than other devices. And they were right. Using this through the HDMI instead of using the Smart TV's software... it never has trouble with internet or finding an episode available. It loads apps way faster. Works just as good as our ROKU on the other TV but was a whole lot cheaper than what we paid at the time for ROKU.  And we love that it has PBS for Downton Abbey. Plus, it's small enough to travel with. We used it at our family's house during the holidays on their TV.Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "AvidReaderGirl"}, {"rating": 4.0, "review": "The Fire TV Stick is great but it still lacks a bit in the Plex department.  I often have to run it at a lower resolution but I know it is because it is using the built in software to run as opposed to the PC that the content is located.  Other than the Plex issue the Fire Stick has been great and has replaced our Chromecast because of the interface.", "verified": true, "helpfulness": "0/0", "author": "Jamie Ivey"}, {"rating": 3.0, "review": "to many pay movies and to expensivefor one short movie", "verified": true, "helpfulness": "0/0", "author": "Joe Hayes"}]