[{"rating": 5.0, "review": "Have really enjoyed being able to switch over to Amazon on my TV.  I have Amazon now on a new smart TV and the Fire TV Stick is much faster than the smart TV.  Been great it seems to update on its own, or when I don't notice.", "verified": true, "helpfulness": "0/0", "author": "J. Lyle Martin"}, {"rating": 5.0, "review": "Bought one Fire Stick last year during the pre-order time and loved it so much we bought another one to replace our Google Chrome Cast stick.", "verified": true, "helpfulness": "0/0", "author": "mtaylor"}, {"rating": 5.0, "review": "This thing is very nice.  Very easy to hook up, easy interface to use, ultra compact.  This is just as good as my $100 Apple TV.", "verified": true, "helpfulness": "0/0", "author": "D. Price"}, {"rating": 1.0, "review": "Technically it's great, the fact you have to rent or buy any newer movies with the price you have to pay for prime membership is ridiculous.", "verified": true, "helpfulness": "0/1", "author": "frank deitsch"}, {"rating": 5.0, "review": "Absolutely LOVE IT! Was so easy just plug and play!  Perfect !", "verified": true, "helpfulness": "0/0", "author": "Carla Hanlin"}, {"rating": 5.0, "review": "Easy to install and use.  Good directions.  Thanks.", "verified": true, "helpfulness": "0/0", "author": "Susan Burns"}, {"rating": 1.0, "review": "I bought it to stream amazon prime, my tv is a year to young to be That Smart.  It does not work with out buffering for The Wire, it works perfectly with Sopranos.  What's up with that?", "verified": true, "helpfulness": "0/0", "author": "janet"}, {"rating": 5.0, "review": "I love it! Super easy to install, great picture and easy use. The back of the remote can be a little tough to take off, but nothing a little butter knife didn't help.", "verified": true, "helpfulness": "0/0", "author": "Kathleen99"}, {"rating": 1.0, "review": "Not at Amazon standards", "verified": true, "helpfulness": "0/0", "author": "AmazonUser"}, {"rating": 5.0, "review": "Perfect order", "verified": true, "helpfulness": "0/0", "author": "Christina campisi"}]