[{"rating": 4.0, "review": "I would be happier with this product if CBS All Access was accessible with this device. I can get on CBS All Access with my Google Chromecast and my Roku 2.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We ordered this to replace our Chromecast for our bedroom TV.  The Chromecast was not broken, just started getting finicky when trying to stream Netflix.  That said, we are so happy that we replaced the Chromecast with the Amazon Fire TV Stick.  This thing is so awesome.  You can download apps and games and you have access to pretty much whatever you want to watch.  If you have a lot of streaming media subscriptions, this is a must own.  My only word of warning is this: It is wayyyy to easy to accidentally sign up for Prime!  I signed up with one click unintentionally.  My wife has Prime and we use her account to order everything, but the Fire Stick was registered to my name and when I tried to watch a move available on Prime, I signed myself up.  Amazon quickly cancelled my subscription and reimbursed my money at my request so no harm, no foul.  Just be careful if you have no plan to order Prime.", "verified": true, "helpfulness": "0/0", "author": "Dave M."}, {"rating": 5.0, "review": "This is AMAZING.  So worth the money!!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Velez"}, {"rating": 5.0, "review": "It really works!", "verified": true, "helpfulness": "0/0", "author": "James Keller"}, {"rating": 5.0, "review": "Cheaper than cable or a smart TV. All you need is internet connection and you're good to go!", "verified": true, "helpfulness": "0/0", "author": "Larynda"}, {"rating": 5.0, "review": "The Fire TV Stick was so easy to install and it worked perfectly!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Mirrors cell phone so I can watch movies on TV, awesome product.", "verified": true, "helpfulness": "0/0", "author": "Jonathan P."}, {"rating": 5.0, "review": "Love it. My family was using our wii for Netflix. It took forever to load and the Xbox would cut out wifi signal. This hasn't done any of that. We used to think our internet was screwed up but this has excellent options for different streaming apps and the prime movie options are very good. We just purchased another one for our other TV and have down graded our cable service. It is very easy to use and picture is crisp and clear. Even older shows look great.", "verified": true, "helpfulness": "0/0", "author": "Mary W"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "YUNJUNG KIM"}, {"rating": 5.0, "review": "Lots of options. Easy to use. Great for the tv junkie.", "verified": true, "helpfulness": "0/0", "author": "Ro Pugliese"}]