[{"rating": 3.0, "review": "I got it with the intention of getting amaxon prime too but I thought it would offer more free shows and movies. But the stick it's self isn't bad.", "verified": true, "helpfulness": "0/1", "author": "Chelsea"}, {"rating": 5.0, "review": "I love it! Now I can watch WatchESPN & other shows without the cableTV.", "verified": true, "helpfulness": "0/0", "author": "John Van Ooyen"}, {"rating": 1.0, "review": "This device seemed promising but ultimately had too many problems, like it was something that was never quite finished, not quite ready, but put on the market anyway just to boost the year end financials. The biggest issue was video that froze and stuttered regularly, sometimes taking a few seconds to recover. The device would lose the Wi-Fi connection sometimes, would not log in again when the password was re-entered, and only restarting it would help. It also kept logging out of Netflix, so you had to reenter that password frequently.", "verified": true, "helpfulness": "2/4", "author": "Denis \"photowithmonkey.com\""}, {"rating": 5.0, "review": "Excellent device. I will probably get more for the convenience and the price. I'm surprised about how good the video is and how easy it was to setup.", "verified": true, "helpfulness": "0/0", "author": "Daniel D'Eon"}, {"rating": 3.0, "review": "The commercials and pics show this as just a stick into the tv, but it needs power, so another cord runs to an outlet. The cord is way too short, so instead I power through my TV's USB. It works, but I get warning messages that it would work better plugged into an outlet.", "verified": true, "helpfulness": "0/1", "author": "LucaBrasi"}, {"rating": 5.0, "review": "Fantastic device Highly recommended Super easy set up. Had three of my buddy's buy one also They are all very happy with there's also", "verified": true, "helpfulness": "0/0", "author": "Denise Boring"}, {"rating": 5.0, "review": "So far I like the content", "verified": true, "helpfulness": "0/0", "author": "samuel bringas"}, {"rating": 5.0, "review": "Easy to set up, works extremely well to stream movies and TV shows. Almost ready to cut the cord to cable.", "verified": true, "helpfulness": "0/0", "author": "Nordin Zeidner"}, {"rating": 5.0, "review": "Love the stick and the varity in tv and movie viewing options!!", "verified": true, "helpfulness": "0/0", "author": "Star"}, {"rating": 5.0, "review": "So far the wife is very happy with the tv fire stick.  haven't heard a peep out of her since I installed it.Wish I had one years ago. As long as I keep fresh batteries in the remotes she is happy as a lark.MONEY WELL SPENT !!!!!", "verified": true, "helpfulness": "0/0", "author": "Earl T. Majors"}]