[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Christy L Carpenter"}, {"rating": 5.0, "review": "Love it. Set up was quick and easy. Thinking about purchasing another one to replace my roku", "verified": true, "helpfulness": "0/0", "author": "Adrienne"}, {"rating": 5.0, "review": "Great for watching Prime video and netflix. I bought it when it first came out at half the price. Great for making dumb TVs smart. The interface is slick and responsive. The earlier TVs with smart functions had a clunky interface, which led to accidental movie purchases. This streamlines the process and mistakes are few.I wish the there was a faster way to put it to sleep, like directly in the home menu. Having to dig it up takes a bit of effort.", "verified": true, "helpfulness": "0/0", "author": "franziz"}, {"rating": 5.0, "review": "Love this !!!", "verified": true, "helpfulness": "0/0", "author": "danielle langreder"}, {"rating": 3.0, "review": "Did not know what to expect. Still getting used to it.", "verified": true, "helpfulness": "0/0", "author": "Dr Kenneth L.Lim"}, {"rating": 1.0, "review": "The fire stick had a surge and blew the hd out of our tv. Only used it two days. Wouldnt hook up to dish or anything. Ruined our tv", "verified": true, "helpfulness": "0/0", "author": "GWEN HOSSLE"}, {"rating": 5.0, "review": "Great Product for the price a great price.  I also have the Fire box, but I use this more.", "verified": true, "helpfulness": "0/0", "author": "Kat's mom"}, {"rating": 5.0, "review": "Best thing ever.", "verified": true, "helpfulness": "0/0", "author": "Jaret V. Aparo"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "So, this was supposed to replace the hand-me-down Roku that has been experiencing mild hiccups.  Plus, as a paying Prime member this seemed like a good option.  Setup was simple (other than the 'let's plug a power cord into your stick so a cord can dangle from your HDTV- that looks impressive' issue).  Powered up no problem.  Found the WiFi signal, and after some issues concerning passwords, connected.  Logged in as my Prime member name with all my preferences and apps and music etc.  Unfortunately, accessing them has been iffy at best.  And when I DO get connected to, let's say, Grimm, it constantly buffers throughout the episode.  It also buffers for music.  And Netflix.  And, so far, every other app attempted.  Many times, it either just hangs, or reports that it cannot open said app.  Try again two minutes later and it'll open the app.  Then buffer.I'm double checking WiFi signal strength, but it is showing as 'very good' and 'strong'.  The Roku did not suffer from signal issues (it's problems were more of the show freezing mid-episode-style).If I cannot troubleshoot this to a satisfactory resolution, it's going back to Amazon.  Either way, I'll update my review.", "verified": true, "helpfulness": "0/0", "author": "ORAquabat"}]