[{"rating": 5.0, "review": "Very easy to set up and use. Love this product.", "verified": true, "helpfulness": "0/0", "author": "Judy Morgan"}, {"rating": 5.0, "review": "Love it! Easy to use at a great price.  Does exactly what I needed it to do- stream Netflix and content on prime.", "verified": true, "helpfulness": "0/0", "author": "J. DiPietro"}, {"rating": 5.0, "review": "I got the fire stick as a gift from my sister. Originally she bought me the google chromecast.  I spent 6 hours that day trying to get the chromecast to work and dealing with the worst customer service I have encountered.So when i plugged in the fire stick i was weary... I it turned on, it connected to my internet, and was working in under a minute.If you are debating between google and amazon, go with amazon 100%. Its the easiest thing in the world. Google requires you to change settings on your router to work. ..but you don't need to with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Natalie K Stratton"}, {"rating": 5.0, "review": "Works great.  Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Perky"}, {"rating": 2.0, "review": "Highly disappointed with Amazon and the Fire TV Stick.I have a Fire TV, several Roku devices, and a Chromecast in addition to this Fire TV Stick, and by far the Fire TV Stick performs the worst of the bunch.  Even when I am just in the menus, there is a noticeable lag not present with the other devices.  It feels like everything is delayed and slow, which is surprising considering the listed specs.  I don't have any buffering on the other devices, yet the Fire TV Stick buffers/freezes every few minutes during video playback.  This is all tested from the same location in the house and on the same TV.  I am pretty disappointed because my Fire TV works like a charm and the other devices with lesser specs work better.  I have a Roku LT that beats it hands down and it is several years old.Also, another frustrating limitation of the Amazon ecosystem is the 10 device limit on your Music account.  I can understand this limit 5-6 years ago, but now with more devices using this service, they really should consider raising this limitation or exclude Amazon devices from the total.", "verified": true, "helpfulness": "1/1", "author": "Adamonic"}, {"rating": 5.0, "review": "We really enjoy using the Firestick, it is so much faster than our Apple device.", "verified": true, "helpfulness": "0/0", "author": "LINDA L."}, {"rating": 5.0, "review": "It works", "verified": true, "helpfulness": "0/0", "author": "Phillip"}, {"rating": 5.0, "review": "It does not work if you are at a hotel which requires signing in on a browser.", "verified": true, "helpfulness": "0/0", "author": "Anon"}, {"rating": 4.0, "review": "only reason i am not giving 5stars is i cannot get it to work on my main tv in the family room. won't stay connected to wifi. but it works perfectly in my bedroom... strange.  i was on with tech support several times, has something to do with proximity to my wifi router (too close?).  anyway that is a bummer, but i do watch in bed, so did not send back.", "verified": true, "helpfulness": "0/0", "author": "susan filipos"}, {"rating": 5.0, "review": "Love the fire stick!", "verified": false, "helpfulness": "0/0", "author": "Lynn Beck"}]