[{"rating": 5.0, "review": "Very easy to install, very easy to navigate through the menu and you can't beat the price. I made a good choice.", "verified": true, "helpfulness": "0/0", "author": "Ro"}, {"rating": 5.0, "review": "i love this item it was so easy to install !", "verified": true, "helpfulness": "0/0", "author": "cindy"}, {"rating": 5.0, "review": "Excellent product, especially when paired with Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "James S Lyon"}, {"rating": 3.0, "review": "This has mostly the same movies as Netflix & anything I really want to watch I have to pay for. Expected to have more for the price. Rather disappointed", "verified": true, "helpfulness": "0/0", "author": "Mary Coster"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Chris Payne"}, {"rating": 5.0, "review": "Great fun to be able to stream more programs via Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "bettyjo01"}, {"rating": 5.0, "review": "It is a great little gadget.  Don't know how we managed all this time without it.  We have 2 of these; one in the living room and one in the kitchen.  We can stream netflix or the amazon prime shows etc.  We haven't explored any of the other forums but will in time.  There were a few glitches in the begininning with the wifi password being dropped and having to re-enter but we haven't had that issue in a while.  I would highly recommend this as it broadens up your viewing capacity.  I've seen more documentaries in the past few weeks than I have in years.", "verified": true, "helpfulness": "0/0", "author": "L.K. \"garden lady\""}, {"rating": 5.0, "review": "I think the stick is great best buck for hour money", "verified": true, "helpfulness": "0/0", "author": "john mckinney"}, {"rating": 5.0, "review": "I like it a lot !My daughters like it so much.", "verified": true, "helpfulness": "0/0", "author": "Anibal M Matasol"}, {"rating": 5.0, "review": "We love the Amazon fire stick.  My husband and I can stream Netflix and Pandora.  I also love Pluto and our son love PBS kids.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}]