[{"rating": 5.0, "review": "I love this! The movie streaming is great especially with amazon prime and the games are pretty good! I wish there was more integration with the fire stick remote and more apps would be nice but overall a great experience!", "verified": true, "helpfulness": "0/0", "author": "shamsham77"}, {"rating": 5.0, "review": "What a difference New tech makes! I had been streaming on a roku 2 that I've had for 4 years. I decided to try out the fire stick when Sling TV offered it free with 3 months of prepaid service. The picture clarity is amazing, videos load almost immediately and I love that it's practically cordless (still has a power cord, but no nerd for component cables like my old roku).The remote is really responsive, but I'm not a major fan of the button placement. It took me neatly a week to stop mistaking the home button for the play button. Minor problem in the long run. For less than 40 bucks. I can stream from my kindle, play spotify, and watch live tv. If only comcast infinity would approve hbogo on the Fire Stick, I'd completely throw out my roku (comcast users, Showtime anytime and HBOgo are not allowed yet on the fire stick - also there's no Starz app or FX app like on the roku). But again, for 40 bucks, I can't really complain.", "verified": true, "helpfulness": "0/0", "author": "Nikki Jay"}, {"rating": 4.0, "review": "Good, simple menu options", "verified": true, "helpfulness": "0/0", "author": "Jessica Wilmoth"}, {"rating": 5.0, "review": "Works just as advertised.  I'm and older fart and this was easy to install and set up and use. If I can do it, anyone can.", "verified": true, "helpfulness": "2/2", "author": "Jack C."}, {"rating": 2.0, "review": "Erratic.  I guess I got a bad one, I've read other reviews with a similar issue.  The unit worked when first plugged in, but the next time I went to use it, it would not wake up.  I had to unplug and then power it up again, and since my TV is high up on a wall, that meant getting on a ladder.  I also had to do the same to get the iphone app to recognize it, and that often did not find it either.  When the iphone app was working, it was so sensitive that I found it impossible to use.Then, when it was powered up, it erratically dropped the Wi-Fi connection even though the signal is very strong, and other units near to it worked fine.I'm returning it.", "verified": true, "helpfulness": "0/0", "author": "Ed \"Scales USA\""}, {"rating": 2.0, "review": "If you go on amazon and see the specs compared to chrome tv and the roku stick, it states this is the fastest. Any other website shows the Roku stick and Fire stick are exact same memory and specs. I have returned my fire stick due to buffering during Netflix playback. My Roku never buffers any apps. My friends who have the firestick report the same problem. Roku stick remote has Netflix and Amazon shortcut buttons and their customer service is the best. If all you have is amazon prime, this is fine. Any other streaming apps will give you problems. I'll never regret returning this firestick and investing $10 more for a Roku Stick for both tv's.", "verified": true, "helpfulness": "0/0", "author": "TomDaBomb"}, {"rating": 5.0, "review": "Nice, way better than Roku..", "verified": true, "helpfulness": "0/0", "author": "Tracy E. Mundhenk"}, {"rating": 3.0, "review": "The features arent great and comparable to Roku or Apple TV", "verified": true, "helpfulness": "0/0", "author": "YE Siva"}, {"rating": 4.0, "review": "This is a neat little item. I really like its ease of use and portablity. I knocked off a star, becuase it is a little undpowered. Streaming occasionally suffers and updates take forever.", "verified": true, "helpfulness": "1/1", "author": "David Hoffmann"}, {"rating": 5.0, "review": "I have two smart tv's but still purchased the fire stick so that I could dump comcast cable (blech!!!) and move to sling. Since neither of the tv's currently support Sling I needed to upgrade. Couldn't be happier.  When streaming to my tv downstairs (wi-fi) I would get a very choppy connection. Zero problems and much faster with the fire stick. Use if for plex as well and stream in HD with no lag (currently only have a 25 mbps connection at home). It helps that I'm already in the amazon eco system but I got one fire stick for free (pre-paid for 3 months of sling) and I got the other one for 10 off (29.95) as another sling promotion. Would highly recommend to any one who's thinking of cutting the cord or simply to boost your streaming exp.", "verified": true, "helpfulness": "0/0", "author": "monty45"}]