[{"rating": 5.0, "review": "Easy to use even my 3 year old can navigate it. I am not a huge fan of that I have to have a wire hanging down behind my hung tv. But its in my bedroom not the living room so its ok.", "verified": true, "helpfulness": "0/0", "author": "Antonino B Cifaldi"}, {"rating": 5.0, "review": "Far superior to Google Chromecast Unfortunately I bought the Google unit, before I Bought the Firestick, as I was unaware of the availability of the Firestick, until a Best Buy salesman told me about the Firestick. You wouldn't want to Buy a Google Chromecast, by any chance, would you?!", "verified": true, "helpfulness": "0/0", "author": "79Trans Am"}, {"rating": 5.0, "review": "I'm enoying the movies when I want them.", "verified": true, "helpfulness": "0/0", "author": "tony habeger"}, {"rating": 5.0, "review": "Very nice product!", "verified": true, "helpfulness": "0/0", "author": "Doris Palmer"}, {"rating": 4.0, "review": "Would like to be able to have captions other then that I love it....", "verified": true, "helpfulness": "0/0", "author": "linda nekola"}, {"rating": 4.0, "review": "So far the Fire TV Stick is as advertised and everything I hoped it would be. I would have given it 5 stars if it had included better documentation and/or tutorial, reference the necessity to download apps for such things as Netflix; my sister hooked it up while I was at work and she is still of the flip phone generation. But it works great and so far is another marvel of technology well executed.", "verified": true, "helpfulness": "0/0", "author": "Mr. Rev"}, {"rating": 4.0, "review": "Love this little guy! 10 minutes to set up and works wonderfully!", "verified": true, "helpfulness": "0/0", "author": "Mindy Stagg \"Mindy A Stagg\""}, {"rating": 5.0, "review": "Absolutely LOVE the Fire Stick (and Fire TV).  It is handy to carry around and plug-in when traveling.  I do wish that you didn't have to carry the electric adapter and wish this was somehow able to hold a charge of some sort, but maybe a future model with have a small battery.  But overall, it gets the job done and I love it!", "verified": true, "helpfulness": "0/0", "author": "Elaine Otsuka"}, {"rating": 5.0, "review": "Love the stick and remote, now we are not stuck with the same show weekend after weekend. Lots of variety and ready when we are...and pause sets a screen saver in motion. Very nice.", "verified": true, "helpfulness": "0/0", "author": "Vickie lollar"}, {"rating": 5.0, "review": "This little devise is easy to use & set up on multiple tv's. Exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "jane rooney"}]