[{"rating": 4.0, "review": "Love it, But To whatch hulu plus you have to Pay even The primer, should offer the free hulu app, like Apple TV.", "verified": true, "helpfulness": "0/0", "author": "silvania pimentel"}, {"rating": 5.0, "review": "Easy, quick setup and navigation. Fast streaming ends interruptions of programs we watch which was a constant frustration with the old app we had been using on our bluray player to access Netflix and other content. The video quality of content is much better as well. It was a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Ronald Peterson \"Author\""}, {"rating": 3.0, "review": "I bought the fire stick, It worked for one month and suddenly stopped. I called up customer support and they was not able to help and had me on the phone for over 30 minutes, They eventually said that they don't know the problem and will have to do a follow-up call. Five days later there is no call so I return a call. I waited approximately 15 minutes and the person finally process a replacement and I have to return the old one. The fire stick is under warranty so they should have taken it back if they did not know the problem and I should not have to wait a whole week and make a second call.The product worked great when it was working. The only thing that sucks is the customer service", "verified": true, "helpfulness": "0/0", "author": "Aaron Maharaj"}, {"rating": 2.0, "review": "The remote only worked for a couple of days. Put in new batteries; still didn't work.", "verified": true, "helpfulness": "0/0", "author": "Martha Lowe"}, {"rating": 3.0, "review": "Ive had the fier tv stick for about 8 months. It was great while it lasted.  It quit working all together.  I have tried 6 different tvs and it will not turn on at all.", "verified": true, "helpfulness": "0/0", "author": "herminio gonzalez"}, {"rating": 5.0, "review": "I love my fire stick! It gives you a lot of options to choose from. Its very easy to install and use. My wife does not even watch cable anymore since we installed the fire stick. And since it's only $40, I installed it in every room in my house.", "verified": true, "helpfulness": "0/0", "author": "TBTECHREVIEWER"}, {"rating": 3.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Judith I."}, {"rating": 5.0, "review": "I love being able to watch movies using the Fire stick.  It's so much easier.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 4.0, "review": "When your gateway is right next to the TV it works great.  It can be a little fussy about the signal otherwise.  But since I moved the gateway it's fantastic.", "verified": true, "helpfulness": "0/0", "author": "Stacy"}, {"rating": 1.0, "review": "This seems like a pocket drainer to me. You purchase the Fire Stick, pay to become a Prime user (annually), then you pay for most of the apps that you use within the Stick (monthly)??????I hope I'm incorrect and just not understanding how this work! If not....Anybody wanna buy a Fire Stick?", "verified": true, "helpfulness": "0/4", "author": "LaTasha Neal"}]