[{"rating": 5.0, "review": "The Fire stick meet my expectations. The setup was very easy. I've been using it without any issues.  I will be buying another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's not bad.  I didn't notice that it needs to be plugged in and since it does it could use a longer cord. I bought two and I had to set up the WiFi twice for both. You would think that a new product would show up up-to-date. The apps are great.  I would love a keyboard for it but so far the phone app works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Setup was a little convoluted with the update installing right away and having to put in my wifi password twice.The interface makes looking for new shows a bit odd. Wish it would show more show thumbnails 8 the screen.Also SD versions of tv and movies are hidden back behind the \"more ways to watch\" button which took me forever to find.", "verified": true, "helpfulness": "0/0", "author": "Karl Carpenter"}, {"rating": 4.0, "review": "Great deal especially if you're a prime member. Very convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Vadim Minosyan"}, {"rating": 5.0, "review": "Great cost/entertainment ratio.  Plug and play and keeps the family occupied.", "verified": true, "helpfulness": "0/0", "author": "G. Sherman"}, {"rating": 5.0, "review": "There are a lot of reviews comparing this stick to others -- this isn't one of them. Forgetting competing products for a bit (I own both  Chromecast and Roku), I couldn't be happier with this streaming device. It's very easy to install, has great WiFi connectivity, and very fast operation with the included remote. If you watch Prime videos, NetFlix and Hulu, this device is a no-brainer - it's the price/performance winner.", "verified": true, "helpfulness": "0/0", "author": "Jim Logan"}, {"rating": 5.0, "review": "Excellent device and I love how fast it is.", "verified": true, "helpfulness": "0/0", "author": "manuel"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Shaniqua Williston"}, {"rating": 3.0, "review": "I picked mine up from Staples yesterday.it is a great device for money but remote plastic is very cheap. It lloks like from toy store. Thus is the only bad thing I find about device, rest it is very powerful, includes LIB-CEC meaning you can use your TV remote as Stick remote (your TV must have CEC too)t can run side loaded apps as good as fire TV.Over all a good device but very cheap remote", "verified": true, "helpfulness": "0/0", "author": "Vivek Jain"}, {"rating": 5.0, "review": "I love it!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "James Furst"}]