[{"rating": 5.0, "review": "I would recommend this to anyone!!", "verified": true, "helpfulness": "0/0", "author": "Kathy Martinez"}, {"rating": 5.0, "review": "Excellent product.  Nice performance", "verified": true, "helpfulness": "0/0", "author": "lorenzo gonzalez"}, {"rating": 3.0, "review": "Too similar to Netflix. Still working my way through the evaluation process, but no WOW factor yet.", "verified": true, "helpfulness": "0/0", "author": "Michael Scott"}, {"rating": 5.0, "review": "I can't go beyond the ease of set-up as I haven't had sufficient time to utilize the promised potential of the gizmo however, it was a no-brainer to hook-up, with but one exception:  the lengths of the cable for the USB connection and the power cord were a bit short and made it difficult to hide the wires coming off of my wall-mounted TV.", "verified": true, "helpfulness": "0/0", "author": "Dann"}, {"rating": 4.0, "review": "I love being able to connect to the Amazon Prime streaming via the Fire TV Stick! Accessing NetFlix via the Fire TV Stick is SUPER Slow and constantly buffering, unlike when i access it via Apple TV. In short, Fire TV Stick should only be used for Prime streaming.", "verified": true, "helpfulness": "0/0", "author": "Alison Blaus"}, {"rating": 4.0, "review": "I love this thing! It performed just like it says it would. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Johnnita Rayner"}, {"rating": 5.0, "review": "I love it so far", "verified": true, "helpfulness": "0/0", "author": "Teresa Gonzalez"}, {"rating": 5.0, "review": "I purchased this for one main reason.  I was tired of streaming my Amazon Prime movies and Netflix to my iPad.  I wanted to be able to watch these videos on my TV.  It was easy to set up and I am enjoying it thoroughly.  I like the other features but I am still exploring all of them.  The price is fabulous and compared to others, it is so very reasonable.  You will not be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rnin85\""}, {"rating": 5.0, "review": "This is one of my best investments.  It was very easy to set up.  Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "judith jordan"}, {"rating": 5.0, "review": "Freaking amazing best thing I have ever boughta", "verified": true, "helpfulness": "0/0", "author": "Desiree"}]