[{"rating": 5.0, "review": "I purchased an Amazon Fire TV Stick to compare against the Google Chrome Cast device.  Being an Amazon Prime user, I have to say that hands down, the Fire TV Stick is far superior.  Apps are easy to install and use (We use Netflix, Pandora, Sling TV, HBO Go, and PLEX primarily.)  The kids also play Crossy-Roads with no problem whatsoever.  Utilizing the smartphone App as a remote control is helpful as well.Pros:  Easy to install and set up.  Good remote control.  App installation and use.  Powerful processor.  Able to connect to 5g home network with ease.  Speedy and responsive.Cons:  Cannot customize home screen.  Would like to be able to set up a dashboard of Apps rather than simply the most recently used.Overall a good purchase.  So much so that I now have 4 separate devices, outfitted on all of our televisions in the house.", "verified": true, "helpfulness": "0/0", "author": "Destby"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Mark Hairston"}, {"rating": 4.0, "review": "works great, but sometimes have problems hooking up to hotel passwords", "verified": true, "helpfulness": "0/0", "author": "kent skeens"}, {"rating": 3.0, "review": "started off good but stopped doing Netflix after just a few episodes", "verified": true, "helpfulness": "0/0", "author": "K. Morrow \"captain kelly\""}, {"rating": 1.0, "review": "I had a Google Chromecast stick in my TV.  I primarily used it for Netflix and Pandora.  I decided to get the Amazon stick so that I could access Amazon Prime videos as well (not supported by Google).  Wow, dissappointing!  I unplugged my Google device just to be sure to give the Amazon device unfettered access to my network.  Amazon videos are ok.  Picture quality seems limited to standard definition.  Completely fails to stream Netflix about half the time.  I plugged my Google device back in to a neighboring HDMI port to compare.  Netflix was 100% reliable, and a high def picture that crushed what the Amazon device was giving me.  My conclusion is that Amazon released this product without refining the software.  Or there is an intentional neglect of Netflix.  Either way, I'm going with the Google device for Netflix and Pandora.  Will continue to watch Amazon videos on my ipad:(.  BTW, the Google product runs off the power of a usb port on my TV.  Amazon product does not function at all unless it has power from its wall plug-in.", "verified": true, "helpfulness": "0/0", "author": "Mark B."}, {"rating": 5.0, "review": "After studying all the options, I decided to try the Amazon Fire Stick. I was concerned about the reviews claiming it would not work in a receiver and thatAmazin claimed they only support it when plugged into a TV. That really doesn't make sense since they advertise multi channel Dolby audio. It's not possible, normally, to get 5.1 or 7.1 Dolby from a TV. I had hopes that the stick would not be able to tell the difference between an HDCP compliant receiver and TV. It can't OR I'm very lucky. It's perfect....it offers all of the interfaces I wanted ( Netflix, HBOGO, MLB Premium, Pandora and, of course, Amazon Prime.) and it integrated easily into my home theater via my Sony receiver. \"Good as it gets\".", "verified": true, "helpfulness": "0/0", "author": "sue2b"}, {"rating": 2.0, "review": "After many months now, I am not impressed. Luckily I only paid $19 - still, I'd like that money back. I can mirror what everyone else having issues is saying, adding that Hulu will not load at all, but loads fine on my Roku. This was a nice idea, but cannot hold a candle to my Roku buddy. When it comes to technology such as this, I say spend the money and buy the best.", "verified": true, "helpfulness": "0/0", "author": "Cate"}, {"rating": 4.0, "review": "Nice product.  Works better than the google chromecast for 2 reasons:  1) remote and 2) iPhone app.", "verified": true, "helpfulness": "0/0", "author": "BT \"BT\""}, {"rating": 5.0, "review": "Works great!  Easy to use interface, easy setup.  If you're a prime member, the stick is pre-registered to you already, so all you have to do is plug it into your TV and start watching Prime videos on your account.  Which I wouldve bought this sooner.", "verified": true, "helpfulness": "0/0", "author": "John DeGirolamo"}, {"rating": 5.0, "review": "I love how easy to use and the setup.  The even start with a video that takes you through all the steps. I have used all the devices and considering the price and ease of use this is a perfect starter unit for your steaming needs.  Also I downloaded the app on my phones and tablet.  The cool thing is if you have a fire tablet they work together so you can watch something on one and flip it to the other.  Also has great speed.", "verified": true, "helpfulness": "0/0", "author": "lovefreeeegameguy"}]