[{"rating": 5.0, "review": "I couldn't be happier with this wonderful little device. I installed it yesterday evening and except for needing to imput my WiFi code, it did ALL of the work setting up and showing a little informational video before I took over....Imagine watching House Of Cards on your TV screen instead of a laptop or even a 20 inch desktop screen...WOW....Probably took less than 10 minutes to have it set up including take my WiFi code and connect...I was just amazed as it did all the work for me and I watched on the sidelines....I am VERY pleased....VERY glad I bought it....", "verified": true, "helpfulness": "0/0", "author": "S Goryan"}, {"rating": 5.0, "review": "This stick is fast. Just wish they would add HBO go soon. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Adam Weisensel"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "rallyon"}, {"rating": 1.0, "review": "I received the fire stick four days ago....I was very excited to connect this to our HDMI TV to receive amazon prime movies...well it displayed a blue screen and message \"unauthorized content\" but I could hear the movie.  I read the instructions to connect and I connected correctly...I read instructions for my tv everything seemed fine but still blue screen with message...I was just ready to ship the fire stick back to AMAZON and I googled my problem.  A lot of people are having the same problem and one person stated to \"unplug fire stick from TV, unplug TV from outlet, power down wireless router...IT WORKED...just got it working this morning...gave 1 star because this should be stated in instructions AND I'm not sure if I will have to continue this procedure in the future. For now though I will keep the fire stick because when it works it is awesome.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Corson"}, {"rating": 5.0, "review": "Although I've only been using my Fire TV Stick for a couple of days, I love it. It was easy to set up and loads quickly an easily. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Bruce Bogin"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Donald"}, {"rating": 5.0, "review": "Slick!", "verified": true, "helpfulness": "0/0", "author": "M. Johnson"}, {"rating": 5.0, "review": "This is a great device to put your favorite media at your fingertips. I love watching the historical series in order from beginning to end  (i.e. Band of Brothers; The Pacific). The sound quality of my Prime music is outstanding and full of rich sound. Awesome device and even better price point for what you're able to access. I've recommend this device to several friends.", "verified": true, "helpfulness": "0/0", "author": "Dennis Harang"}, {"rating": 4.0, "review": "Response time \"booting up\" seems to be a little slow but when it's up and running it's good", "verified": true, "helpfulness": "0/0", "author": "J. B. Clark"}, {"rating": 5.0, "review": "n.c.", "verified": true, "helpfulness": "0/0", "author": "WILLIAM J. HILL SR."}]