[{"rating": 5.0, "review": "Love it!! Easy to use, very stable streaming player.", "verified": true, "helpfulness": "0/0", "author": "Cassidy King"}, {"rating": 3.0, "review": "Brings Netflix and HULU in much clearer and faster but its not easy to figure out what apps are free and what you have to pay for until youve downloaded the apps only to find out they are not free and you have to cough up the money or go through a process to eliminate the app", "verified": true, "helpfulness": "1/1", "author": "donald b stoney"}, {"rating": 1.0, "review": "Did not work with WiFI 15' away. Amazon support said that the WiFi needed to be in same room to work effectively. Wasted 2 hours trying to get it to work. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Marmie"}, {"rating": 3.0, "review": "i'm kind of disolutioned. i wanted to like it, but it doesn't function at all with my 2008 RCA tv. it would flash the amazon logo for a split second and do nothing else at all. another customer complained about the same issue. amazon just thought it was defective and sent me another with the same issue. it works with the newer vizio just fine, but i wanted it for the tv that has no cable hook up. we had the kindle hooked up to it for a while but it's connected with an hdmi cable and even that has been finicky. so i think we'll be getting chromecast instead for the bedroom. too bad it doesn't support amazon instant video though. you win some you lose some i guess. not really wild about the kindle app either.  kind of would prefer something where i can see what's going on. with a toddler i have to start the same disney movie about 500 times a day, and come june i'll be strapped to a new baby and a pump while likely recovering from a csection so getting up for random things will kind of suck for a bit.", "verified": true, "helpfulness": "1/1", "author": "Liz"}, {"rating": 4.0, "review": "It is Muy bueno.", "verified": true, "helpfulness": "1/1", "author": "Corry Westinghouse"}, {"rating": 5.0, "review": "So simple to use, my 80 year old dad was able to navigate with ease. So nice that it opens up such a huge selection of choices.", "verified": true, "helpfulness": "0/0", "author": "Alicia Maldonado \"Alicia M.\""}, {"rating": 5.0, "review": "Best product I've ever buy in such a small package...", "verified": true, "helpfulness": "0/0", "author": "Jorge Capella \"jjcv\""}, {"rating": 5.0, "review": "nice system", "verified": true, "helpfulness": "0/0", "author": "ironmorgan"}, {"rating": 4.0, "review": "Being that I only paid $20 for this I guess it's OK. In my opinion it's only a slightly updated ruku with games that's free so after an hour or so you get bored with it. However, if it was more compatible with more cable providers and had more content this would be great!", "verified": true, "helpfulness": "0/0", "author": "ccolbert"}, {"rating": 5.0, "review": "Works really well", "verified": true, "helpfulness": "0/0", "author": "Karen Roberson"}]