[{"rating": 4.0, "review": "Prime needs to have more movies its kind of limited.  And the movies it does have are not good.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 3.0, "review": "I was hoping to mirror my iPad on a bigger screen but of course fire tv does not support mirroring iOS devices. It would have been better to know that before I made the purchase and wait three weeks for it to arrive. I will be returning it for that reason.", "verified": true, "helpfulness": "0/0", "author": "Rick bryan"}, {"rating": 1.0, "review": "I'm not sure how the Fire TV Stick was Miracast certified, it works with none of my devices. I purchased it purely for the wireless display feature. I have used Chromecast, Roku, HTPCs and even Raspberry Pis that perform much better than this limited device. Not what I expected from Amazon.", "verified": true, "helpfulness": "0/1", "author": "William D"}, {"rating": 5.0, "review": "Sad to have to admit this because I love chromecast...but this is better! More options, more user friendly, and having a dedicated remote is SO much nicer than I expected it'd be...  Firestick is the best on the market right now, hands down!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "pretty cool but I cant get to you tube, which sucks", "verified": true, "helpfulness": "0/0", "author": "Ben B. Photography"}, {"rating": 3.0, "review": "Easy setup. Be sure to download the Amazon remote app for your smart phone. But could not get the mirroring for my IPhone or IPad to work. Biggest issue is lack of manual or online support. Did not find an 800 help phone number.", "verified": true, "helpfulness": "0/0", "author": "S. A. Nelms"}, {"rating": 5.0, "review": "Very cool, Amazon. Nice touch with the voice remote via the app. I'm a fan.", "verified": true, "helpfulness": "0/0", "author": "Nicole Henderson"}, {"rating": 5.0, "review": "I have a dvd player that offers lots of options like DirecTv, You Tube etc.,  but Amazon Prime is not one of them.  I bought this and love it.  It is easy to install, easy to use, and I am totally impressed with the programming options.  Amazon is continually getting better in this field.  I can't wait until I can cut my Cable/Satellite connection.", "verified": true, "helpfulness": "0/0", "author": "Chazz"}, {"rating": 4.0, "review": "So far i love this gadget, and so does my girl friend.", "verified": true, "helpfulness": "0/0", "author": "paul mark jeglum"}, {"rating": 5.0, "review": "fire stick does everything its supposed to very happy with it", "verified": true, "helpfulness": "0/0", "author": "carl holt"}]