[{"rating": 2.0, "review": "It does a lot of buffeting. Which causes movies to start and stop continues.", "verified": true, "helpfulness": "0/0", "author": "Charlotte Johnson"}, {"rating": 5.0, "review": "Love this! Easy to install and works great on my bedroom TV. Paid only $27 and its well worth it. Packaged nicely as well.", "verified": true, "helpfulness": "0/0", "author": "allaire a lagrone"}, {"rating": 5.0, "review": "Traded my wife this for the laptop. She absolutely loves it! Streams better than the laptop for whatever reason.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this because as a prime member it was discounted. It sat around for a week or so before i used it, but when i did i was suprised of the options included with the fire stick. Easy to use, and transfer from tv to tv in other rooms. It has a lot of room for growth but the apps included justify the purchase price. I have chrome cast, apple tv, and the fire stick. The Fire stick is by far my favorite. The remote included is solid and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Morgeson"}, {"rating": 4.0, "review": "It's a great product I recommend it to friends", "verified": true, "helpfulness": "0/0", "author": "Vanessa Jenkins"}, {"rating": 5.0, "review": "A must have for Amazon Prime. If you are sick of AppleTV, Chromecast, or anything else that you can't view prime videos on, then get this! I just got mine and love it. I'm on the verge of saying it is better than AppleTV.  Amazon just needs to add HBOgo and it would be amazing.", "verified": true, "helpfulness": "0/0", "author": "Lauren D."}, {"rating": 5.0, "review": "Makes Netflix seem silly.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 4.0, "review": "Turned my older plasma into a \"Smart\" TV and it's easy to navigate.  Great buy!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "TH REMOTE NEEDS TO BE RETURNED IM HAVING PROBLEMS", "verified": true, "helpfulness": "0/0", "author": "Terrence \"terrence santos\""}, {"rating": 3.0, "review": "was not everything I thought but it is a good device", "verified": true, "helpfulness": "0/0", "author": "Daleyna Galvan"}]