[{"rating": 1.0, "review": "roku box far superior for our needs. we only have dsl and roku box with amazon works with little or no delay amazon has to refresh every 10 seconds what an embarassment for amazon. if you have hi speed internet amazon stick works almost as well as roku", "verified": true, "helpfulness": "0/0", "author": "Iguy \"eyeman\""}, {"rating": 5.0, "review": "Very easy and nice to have around :)", "verified": true, "helpfulness": "0/0", "author": "Lynn S."}, {"rating": 5.0, "review": "This is how I watch most TV and it works seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Jackson"}, {"rating": 5.0, "review": "I like that I don't need to \"cast\" data to view movies, videos, and games. It was easy to set up, and the video quality was great.", "verified": true, "helpfulness": "0/0", "author": "Yen Chen"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to install and once I connected it to my internet service, it's a cinch. This technology opens a whole new world for TV, movie and games for individuals as well as families. I have Netflix as well as Prime accounts, thus it provides an abundance of great animated movies and recently released movies for my two young children and my wife. I highly recommend Fire TV it's an awesome technology!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is awesome! Bought it for my son. It's our favorite new toy.", "verified": true, "helpfulness": "0/0", "author": "arlene key"}, {"rating": 4.0, "review": "Loveed it. Ineptos recomend it 100% even owning a smart TV this little guy is a must have!!It have 4 and not 5 because the AppleAir is not there something that even u have apps to do it doesn't work Greta and is not native...", "verified": true, "helpfulness": "0/0", "author": "EK"}, {"rating": 1.0, "review": "Worked great for about 4 weeks. Now, while it finds my wifi (I have great speed on all other devices), it has playback issues - 90% of the time it doesn't work at all. Maybe this is a faulty unit, but quality control should be reflected in the ratings, hence the 1 star.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I ordered this around black Friday last year for $20. The fire tv stick is awesome! I can stream all of my media on an hdmi tv anywhere I go. Great product.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Awesome!! This thing is just the best. LOVE it!!!", "verified": true, "helpfulness": "0/0", "author": "curtis elam"}]