[{"rating": 4.0, "review": "So far so good. Pretty easy to use for a senior  citzen.", "verified": true, "helpfulness": "0/0", "author": "Patricia McNeil"}, {"rating": 5.0, "review": "Fantastic!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "iris s forbes"}, {"rating": 5.0, "review": "Great as always...it is a great tool to connect!!!", "verified": true, "helpfulness": "0/0", "author": "Solimar Caruso"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Daniel Rodriguez"}, {"rating": 5.0, "review": "We use this every day. As a prime member I love all the free shows and movies, my kids watch all their favorite shows on this thing. Incredible how much is packed into this little thing.", "verified": true, "helpfulness": "0/0", "author": "Scott J \"Fan\""}, {"rating": 5.0, "review": "My family really likes this streamer! We've always used Roku, but decided to try this because of the price. In the beginning, I was concerned because it kept losing the wifi signal, but that seems to have corrected itself. It gets all the apps that my family uses to stream, which some other streaming sticks do not.  I'm really happy that I can now get HBO Now on it.  We actually plan on buying more as soon as we upgrade our other televisions to ones that it's compatible with. This really is a great device - especially for the price!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey & Elizabeth Demofonte"}, {"rating": 5.0, "review": "Love the fire stick! Buffers very quickly and is easy to hook up and use. Great picture. Makes streaming as easy as just watching tv.", "verified": true, "helpfulness": "0/0", "author": "sweetea"}, {"rating": 4.0, "review": "I wish I could stream pandora or spotify, but other than that, a great product!  (There may be a way, but I haven't figured it out yet)", "verified": true, "helpfulness": "0/0", "author": "Rachel A"}, {"rating": 5.0, "review": "GREAT!", "verified": true, "helpfulness": "0/0", "author": "Moustafa Elgolany \"Food Lover\""}, {"rating": 5.0, "review": "Came in original package and was even surprised that the controller and stick were individually plastic wrapped. Nice packaging in general.It was an extremely easy setup and can pick up both our 2.4 and 5 gig ac wifi channels. Also this thing is no slouch! Runs super smooth and quick.I was originally looking for something like the Apple TV after using one. This product is as good if not better! The quality of streaming is very good 1080p hd.", "verified": true, "helpfulness": "0/0", "author": "Brandon Lipin"}]