[{"rating": 2.0, "review": "Works only sporadically.", "verified": true, "helpfulness": "0/1", "author": "James Sorensen"}, {"rating": 4.0, "review": "Easy to install and use, no problems at all", "verified": true, "helpfulness": "0/1", "author": "Edward Horton"}, {"rating": 5.0, "review": "As an It geek from wayback when, I love new tech. But what I don't like is bloated, unfriendly tech. Some android apps for example are so ridiculously useless due to complexity and inability to guide even a savvy user in set up. Fire TV STick is not one of those frustrating, I will never get to use this thing, type of tech. Easy to set up, easy to use. For some, losing the remote is extremely easy as well. But I do not have that issue because we have a dedicated bin for such things and well, they tend to stay there. But no kids and no shaggy kids either.I live in the foothills of a mountain range and still have no major issues with buffering or stuttering, even during peak viewing times.I have been able to easily view other apps such as Netflix or YouTube. Far easier than other options I've tried.Because I was able to get this for a discount, under $30, it was very well worth the money.", "verified": true, "helpfulness": "0/1", "author": "SK \"k333\""}, {"rating": 3.0, "review": "Not working well. Sporadic reception issues. I love Amazon prime on my kindle fire. Wished the stick worked as well.", "verified": true, "helpfulness": "0/2", "author": "Glo"}, {"rating": 5.0, "review": "Excellent product, very pleased.", "verified": true, "helpfulness": "0/1", "author": "Jud Risley"}, {"rating": 2.0, "review": "Initial boot up instructions poorly written.  Had to take to Best Buy to verify wi-fi communication.", "verified": true, "helpfulness": "0/1", "author": "Art"}, {"rating": 4.0, "review": "Fire stick rules! I love the tutorial video that just pops up!", "verified": true, "helpfulness": "0/1", "author": "Kris Martens"}, {"rating": 5.0, "review": "Fire stick great but remote could be better.", "verified": true, "helpfulness": "0/1", "author": "Rosemari Martin"}, {"rating": 4.0, "review": "No regrets with this purchase. Only thing its missing is TWC TV app but thats not a complete deal break for me and is only relevant if you have time warner, though thats the main reason it didn't get 5 stars. I was told I could not cast from a windows machine to the fire stick, but I was able to do it so that's a nice plus. That way I can mirror my laptop display to the tv and watch movies from my hard drive without the need for hdmi cables. It's pretty fast though sometimes you may have to wait a few seconds for it to load, not a big deal though. Solid purchase, would recommend.", "verified": true, "helpfulness": "0/1", "author": "BertB"}, {"rating": 5.0, "review": "Much better than google chrome works great.", "verified": true, "helpfulness": "0/1", "author": "Rosalie harris"}]