[{"rating": 5.0, "review": "I recently purchased this device and up till now I've been satisfied. The only thing you will need to be aware of is the distance from your wireless router, specially if you have other wireless devices. The fire stick tv will have a lag, either than that it's a good product for the price. Installation and setup was easy. I recommend it, specially for first time streaming device users.", "verified": true, "helpfulness": "1/1", "author": "Atheizzy"}, {"rating": 5.0, "review": "WOW! I bought 2 of these for my daughters tv's in their bedrooms.  It has turned their inexpensive tv's into a \"smart\" tv like we have in the front room.  Had I known this we could have saved hundreds of dollars on our 60\" \"smart\" television in our front room.  I would recommend this very highly!!", "verified": true, "helpfulness": "2/2", "author": "suziemak \"Loven Life\""}, {"rating": 4.0, "review": "Was surprisingly pleased with the Fire TV Stick!", "verified": true, "helpfulness": "1/1", "author": "TamsterH"}, {"rating": 3.0, "review": "Seems to function as advertised. However remote is too sensitive and prints multiple letters when pressed only once. Necessitates constant erasing of extra letters and then re-entering correct letter. Frustrating !!!", "verified": true, "helpfulness": "1/1", "author": "damille"}, {"rating": 5.0, "review": "Love it.  Better than chrome cast", "verified": true, "helpfulness": "1/1", "author": "Helena Coleman"}, {"rating": 5.0, "review": "I bought this due to the price. It was delivered and i installed it. That was easy and the setup was easier than the other ones i have. The format is different so you will need to adjust to that if you are use to Roku or Itv. This unit does seem to preform better than the others i consider it to be the hardware make up. I do recommend the Fire Tv Stick to anyone who is considering Streaming Tv. Try it you will like it I'm sure.", "verified": true, "helpfulness": "1/1", "author": "ray40472"}, {"rating": 5.0, "review": "work very well. have used a blue ray for netflix and it never would stay working the fire stick has been working great.", "verified": true, "helpfulness": "1/1", "author": "Tracy"}, {"rating": 5.0, "review": "Works great. Had no trouble installing. Included instructions had me watching in minutes. Good choice for a novice.", "verified": true, "helpfulness": "0/0", "author": "Jim Hohn"}, {"rating": 5.0, "review": "V Good", "verified": true, "helpfulness": "1/1", "author": "Aziz Abdullah"}, {"rating": 4.0, "review": "A great device for convenience, no messy wires and no having to hook up my laptop to the TV. The remotes the best feature.", "verified": true, "helpfulness": "0/0", "author": "James Mets"}]