[{"rating": 5.0, "review": "Love it, plug and Go with my Sony TV.. Tried many other items, none worked..", "verified": true, "helpfulness": "0/0", "author": "Joanna"}, {"rating": 4.0, "review": "I am amazed at the # of movies available. Games & T V  showers are available too. It is easy to install. If I can do it, anyone can! This one devise added a whole new avenue of entertainment for my wife and I. We love it. Gotta go. We are going to watch a movie of our choice! FREE!", "verified": true, "helpfulness": "0/0", "author": "Anthony R Collins"}, {"rating": 1.0, "review": "Very disappointed,", "verified": true, "helpfulness": "0/2", "author": "vita"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick worked beautifully.  I have a Samsung TV and was told I had to get the Samsung TV Internet stick (which didn't work).  So I tried the Fire TV Stick and in less than 5 minutes was watching Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bridget Arce"}, {"rating": 1.0, "review": "I've bought 2 of these stupid things. Both times they work great for like 3 months and then one day, for no apparent reason, they decide to just stop connecting to my network even though it says the strength is \"very good\" and even though my wi-fi is working fine with my other devices. Nothing fixes the problem. Not restarting. Not unplugging and restarting. Not even resetting back to factory settings. Nothing. The first time it was after a powerful thunderstorm and I thought maybe it was related to lightening. So I sucked it up and bought a new one. This time it just quit. For no reason. After only 3-4 months of daily use. Grrrrr", "verified": true, "helpfulness": "1/1", "author": "Vixie"}, {"rating": 5.0, "review": "WORKS GREAT much better than the M/S one and about 1/2 the price.  the only item that I can find fault with and this is really pickey and it is because I am not 12 years old, I am seventy eight  and all of this stuff has just came about lately.  Expand the instructions a little for us older folks.", "verified": true, "helpfulness": "0/0", "author": "John F."}, {"rating": 5.0, "review": "this is a power-packed little device works much better then the chrome stick and even auto advances on disney jr channel!!! works well on hotel tv's", "verified": true, "helpfulness": "0/0", "author": "Naomi"}, {"rating": 5.0, "review": "Easy to use love it", "verified": true, "helpfulness": "0/0", "author": "Omar"}, {"rating": 5.0, "review": "Easy to operate, works well and is reliable. I would recommend your TV have 2 HDMI slots if you are also using one for your cable t.v., otherwise you will have to rotate between the two. I especially liked having Amazon Prime Music access in addition to my Netflix and Pandora accounts.  I prefer Amazon Prime Music to Pandora.  Used it on a t.v. at a vacation rental home. You will need the WiFi password to connect it, as well as your other subscription passwords. I plan to use it on a home t.v. as well.  I also have a Roku.  Fire stick with remote was half the price for essentially the same functionality, as far as my needs go.", "verified": true, "helpfulness": "0/0", "author": "LisaDF"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Brian Bates"}]