[{"rating": 3.0, "review": "works good but , watched 5 seasons of true blood just to find out season 6 and 7 were not included !", "verified": true, "helpfulness": "0/0", "author": "JOHN"}, {"rating": 2.0, "review": "I have a ROKU 3 device already and it works pretty good, but I do get a lot of buffering at times.  Will this happen with the Fire Stick ?  Also can I access USTVNow. ??", "verified": false, "helpfulness": "0/0", "author": "Tom D."}, {"rating": 4.0, "review": "I am enjoying the easy access to amazon prime and netflix. Many of the programs, like nbc do not update and are old news when I go to them. Some programs seem to stall and go off regularly and at times shows/ movies on prime stop though this does not seem to happen with netflix.All in all I think it was a good investment in entertainment. It set up fairly easy once I figured out how to enter the access code for the internet. It is far more enjoyable to watch on my TV than it was on the computer...I like that I can take it from the main TV to the bedroom TV though I may buy another for downstairs in time.  For the price it is a good alternative to those who don't want to pay for cable.", "verified": true, "helpfulness": "0/0", "author": "pj"}, {"rating": 5.0, "review": "Best purchase EVER!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth A. Bulger \"ebulger\""}, {"rating": 5.0, "review": "This is great! Highly recommend fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Derri M Dalton"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Margaret Wallace"}, {"rating": 1.0, "review": "This product never seemed to work from the start. The remote control worked fine, but as soon as I wanted to do anything that required connection to the internet, that is where this product didn't even earn a star. I tried downloading an app last night and the router for the wifi was literally on the same tv stand as the tv with the the Fire Stick. I tested the internet speed to make sure that it wasn't an internet speed problem and i was testing at 23mbps. for those who don't know, that i plenty fast to watch HD on at least a couple of devices. The fire stick would download the app, it lost connectivity about 4 times. Finally it did it. but then when i went to watch ESPN, it looked like is was broadcasting in 360. All fuzzy and blurry, and buffering after 5 seconds or so of viewing. So then i switched over to my apple tv which also runs off of wife, and ESPN came on in full HD and didn't buffer once.I have seen the roku and appletv in action and support those products. but this fire stick has given me problems from the start. I thought it was slow because at first i had the fire stick around a few walls, so i placed the router right next to it and it had the same problems.But if you like horrible connections and the temptation to throw the remote at the TV, then this product is for you! (by the way, i should note, i LOVE Amazon and their products, just not this one)", "verified": false, "helpfulness": "2/2", "author": "Karen L Strong"}, {"rating": 2.0, "review": "The features and apps are great, but it is too slow.  When you press a button to play/pause, select, etc. sometime it will take multiple seconds before it responds.  Often just becomes unusable.When it works, the picture quality is great.", "verified": true, "helpfulness": "0/0", "author": "alightled"}, {"rating": 5.0, "review": "Works great.  Happy with it.", "verified": true, "helpfulness": "0/0", "author": "Pat Allen \"Pitterpat\""}, {"rating": 5.0, "review": "The product great! works wonderful and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mustapha Maslouhi"}]