[{"rating": 3.0, "review": "The picture is beautiful but somewhat difficult to use sometimes the pic just goes dark and remote don't respond", "verified": true, "helpfulness": "0/0", "author": "Michelle McLain"}, {"rating": 2.0, "review": "It is ok and works like it says but I was expecting the voice command feature.  Would have paid for it too.  They also don't give you much of a tutorial on how to use it to its fullest.  Would like to see about using this instead of cable.", "verified": true, "helpfulness": "0/0", "author": "AZ"}, {"rating": 3.0, "review": "Great product easy to set up. The user interface could be cleaner though. I have a appletv as well and the menu is much cleaner to navigate.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "We love it!!", "verified": true, "helpfulness": "0/0", "author": "PattiK"}, {"rating": 4.0, "review": "So easy to use, just plug in and go. I was hoping to use HBO GO but learned that Charter and Comcast don't support hbogo on fire stick, which is disappointing.", "verified": true, "helpfulness": "0/0", "author": "KyBee123"}, {"rating": 5.0, "review": "I love this little gadget.  I had the chromecast, which was cool, but to be honest I give this higher marks.  Don't consider it if you don't have prime!  If you have prime, it's a must !", "verified": true, "helpfulness": "0/0", "author": "Dave Puckett"}, {"rating": 5.0, "review": "It's better than I thought. It's so good I'm waiting for my cable contact to run out to cancel. The Fire Stick is all I need.", "verified": true, "helpfulness": "0/0", "author": "Carol Gentry-Harrod"}, {"rating": 5.0, "review": "Good value.", "verified": true, "helpfulness": "0/0", "author": "Jroski"}, {"rating": 5.0, "review": "I enjoy the fire TV stick. The remote control that comes with it is great! Very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Bobby Blankenship"}, {"rating": 4.0, "review": "Works Great! The remote could be bigger", "verified": true, "helpfulness": "0/0", "author": "Robert Hartner"}]