[{"rating": 5.0, "review": "I bought as many as i could i brought a couple of my family  members into the subscriber age and the are having little to no difficulty with it", "verified": true, "helpfulness": "0/0", "author": "ian dixon"}, {"rating": 5.0, "review": "Totally plug and play.  Works beautifully!", "verified": true, "helpfulness": "0/0", "author": "Pam DeVengencie"}, {"rating": 5.0, "review": "Great gadget for the price.  Can wait to watch all of the movies through Prime.", "verified": true, "helpfulness": "0/0", "author": "Jerome Hayes"}, {"rating": 5.0, "review": "While I like my Chromecast very much (and it can do some things that the Fire Stick can't) the Firestick streams better/faster and more reliably. I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "M Jordan"}, {"rating": 3.0, "review": "Candidly, the Fire TV stick is not ready for Prime Time.  Overall I like our 2 Roku devices (the Roku 2 & Roku 3) much better than the new Fire TV Stick. The Fire TV Stick navigation is clumsy and cumbersome compared to the Roku.  Surprisingly, navigating to find my favorite music on Amazon Music is terrible (I much prefer using Roku to stream my music through Amazon Music).However, the video and audio quality of the Fire TV Stick appears to be slightly better than the Roku, boosting my rating to a mediocre 3-stars.", "verified": true, "helpfulness": "1/1", "author": "BeachBum"}, {"rating": 5.0, "review": "Love the Fire TV Stick!", "verified": true, "helpfulness": "0/1", "author": "Tony Mason"}, {"rating": 4.0, "review": "Still playing with it and seeing what's available and not, but if you don't subscribe to Amazon Prime, the device is very limited in what you can get as the free channel/apps are not interesting. Otherwise, you will need to purchase a lot of the content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Easy to use!", "verified": true, "helpfulness": "0/1", "author": "Kolt Chauvin"}, {"rating": 5.0, "review": "LOVE IT!! We got this during the $19 sale too and are super happy we did! I thought we might try it out and then pass it along as a gift to parents but once my husband tried it he wouldn't let it go. Sorry Mom and Dad!Does everything it promises and more! Amazon content at finger tips and Netflix is super simple to access. Downloads lots of Apps and we're still having fun playing around with it. Easy to set up and use right out of the box. We have replaced the Wii access we were using and now are thrilled with the ease of the Fire Stick access.Suggestion for upgrade, sleep mode on main menu, right now you have to go into settings to turn the thing to \"sleep\". Remote, although similar to iPad TV remote is a bit small and \"delicate\" to the touch compared to standard TV remotes.", "verified": true, "helpfulness": "0/0", "author": "K. Morton"}, {"rating": 1.0, "review": "The fire sticks tv is not as good as the bigger fire tv, the  larger one has much better streaming and much less buffering .. I wish I never bought the sticks.......This a up date: In previous review I gave this 2 stars, now going down to 1 star, to bad Amazon has drop the Fire TV Box by far much better built and much better picture, the stick has to many problems... The One that drives me Nutz is when it stops working,,, saying Network problems,, open Network,,, then saying good signal - connection with problems... you have to unplug it from power, and wait a few moments, replug it in, this will let it clear it's memory and rebuffer,,, then it will work again,,, another thing you can do to help this problem is put a longer HEMI cord on it get it away from the TV, you will get a better signal and it stays COOLER", "verified": true, "helpfulness": "1/1", "author": "Glenn S."}]