[{"rating": 4.0, "review": "outstanding", "verified": true, "helpfulness": "0/0", "author": "Dorsey Abbott"}, {"rating": 1.0, "review": "The only reason I bought this is, because of the sad fact that it was the only way I can watch Amazon video on TV with subtitles and guess what? FireTV Stick break again and again, it won't work again after a week. I'm sick and tired of it.Network disconnections, constantly rebooting, glitchy video playing, and so much more.", "verified": true, "helpfulness": "1/2", "author": "Tyler"}, {"rating": 4.0, "review": "Had issues getting it set up. Was told by tech it wasn't designed for a RCA they were wrong would be 5 stars if it wasn't for the tech support department", "verified": true, "helpfulness": "0/0", "author": "ALbert Nadeau"}, {"rating": 5.0, "review": "I use amazon on a daily and ordering the firestick for my TV was the best choice I've made. I used to have to plug up my computer and that was getting to be a pain. Just plug the firestick in and go. Set up was really easy, and they had a short video to explain the things you could do. Now my movies, tv shows, music, and games are all at the control of a remote!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Efren Romero"}, {"rating": 3.0, "review": "After having used and tinkered with it for 4 months, I now feel I can fairly review it - I personally find \"I got this today\" reviews of something like this a bit lacking. I have access to Amazon Prime built into my circa-2012 Vizio TV (purchased secondhand from someone moving overseas), but I couldn't get subtitles and my hearing is not so good, especially when people have strong accents or soundtrack music is loud, so I bought the Fire TV Stick almost specifically for that. I would rather have gotten the box model but $99 was just out of my budget. I guess you get what you pay for though.The main issue I have with this device is slowness/lag. With the extender dongle, it is literally 15\" from my WiFi router (which is not even 2 years old) so there really is no excuse. HBO specifically is atrocious, hanging every couple of minutes, but the response from using the remote is often very slow as well. Replacing the remote battery did not help, not that I thought it would because I hadn't been using it anywhere near long enough for the battery to be exhausted. It's the Stick itself. Videos from the PBS app also have been lagging some in the last few weeks and even Prime videos do sometimes which is intensely frustrating. ASAP NEVER works for me. I know it's not my internet connection speed because I routinely stream from other sources including a HDMI cable plugged into my laptop which is connected to internet via WiFi and the speed is perfectly adequate. Streaming music from the radio apps,  Prime Music, or Spotify (although the Spotify apps are terrible, someone please kick them to come out with the regular app in this format) is much better, I guess audio-only has much lower demand on the gadget. I don't think I would want to try playing games on it.Setup was tedious, mostly stripping out garbage apps with which it came preloaded, which took forever using that silly little remote. I really disliked the Android remote control app, I found it prone to locking up and dropping connection, and it needed to be re-paired every single time I started it, so it is more trouble to me than it is worth. I'm not going to buy the other remote because I dislike using voice commands as I have a naturally soft voice and it never gets picked up properly (and living in an apartment building with the usual thin walls, shouting at my remote at 2am is unkind to my neighbors, to say the least. Deleting the crap-apps via the website using my laptop doesn't seem to remove them from the Stick, not quite sure why, the icon remains with a box asking to install the app. I would much rather have had it arrive with the bare bones and added what apps I wanted.If you are expecting to be able to mirror your devices, do some research first - I can't mirror either my 2012 Nexus 7 tablet or my LG Lucid phone. That's a little disappointing because sometimes I'd like to stream a movie via a website (speaking of which, why isn't there a decent web browser app for this gadget?) while using my laptop for something else.However, the X-ray feature is definitely snazzy and I've gotten a bit spoilt by it, to the point where sometimes I'll try to access it by habit on other streaming apps where it doesn't work. :)", "verified": true, "helpfulness": "0/0", "author": "Yet Another Semi-Anonymous Amazon Customer"}, {"rating": 5.0, "review": "Works great, easy to take from TV to TV, seeing that I'm not replacing a couple of my TV's just because they aren't smart TV's.", "verified": true, "helpfulness": "0/0", "author": "Shane C"}, {"rating": 5.0, "review": "Love it, very clear picture.", "verified": true, "helpfulness": "0/0", "author": "Chris Silence"}, {"rating": 4.0, "review": "Really have enjoyed using our Fire TV stick.  Watching some series that we were unable to catch when aired.  Enjoying selection of movies and streaming music.  Especially good since there is so little to watch on regular cable TV channels.", "verified": true, "helpfulness": "0/0", "author": "Helen Claussen"}, {"rating": 5.0, "review": "Super quick delivery. Easy set up. I'm looking forward to traveling with this.", "verified": true, "helpfulness": "0/0", "author": "DH Bear Co"}]