[{"rating": 4.0, "review": "Finally we could stream movies and tv shows on our led hdtv without having to subscribe to expensive cable services.  We don't really watch live so it doesn't really matter.  It's a good way to watch tv and pass time without the need to spend more.  I like this over chromecast because of the included remote control.  Not everyone has the latest android/iphone devices to control everything on their fingertips.  I have ordered another one of these for our other hdtvs at home.  Great switch from cable tv to streaming.", "verified": true, "helpfulness": "1/1", "author": "enamel_pearl"}, {"rating": 5.0, "review": "So far so good. Easy setup and operation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "First Class unit.", "verified": true, "helpfulness": "0/0", "author": "Craig H Casey"}, {"rating": 5.0, "review": "Does everything I wanted in an easy to use small package. My three year old runs it on her own. We have a large HDTV but it doesn't have \"smart\" features so this extended the life of the TV. Also the Fire Stick stays on all the time unlike having to turn on a Playstation 3 just to use Netflix etc.", "verified": true, "helpfulness": "0/0", "author": "seth6984"}, {"rating": 4.0, "review": "Fire TV Stick is easy to set up and is certainly easier than Chromecast in my own experience. It comes loaded with popular apps. I gave 4 stars because every time I unplugged and re-plugged it back into my TV, it would play the setup video again and there's no way to skip it. Other than that, it's great!", "verified": true, "helpfulness": "1/1", "author": "Steve W."}, {"rating": 5.0, "review": "Love this, easy to use and gives us exactly what I want!!", "verified": true, "helpfulness": "0/0", "author": "molly klipp"}, {"rating": 3.0, "review": "It's ok. But I would like to be able to add apps from the play store because there are apps for stations such as Nat Geo available.", "verified": true, "helpfulness": "1/1", "author": "SHERRY MCCAUGHTRY"}, {"rating": 5.0, "review": "My wife and I are enjoying the Fire TV stick very much. It certainly offers many viewing options. Also it enables the viewing of photos, etc. on the TV screen. We consider it a library if you will. It is an excellent gadget to have and certainly priced right.", "verified": true, "helpfulness": "0/0", "author": "W. H. Ghali"}, {"rating": 5.0, "review": "We cut the cord three years ago.  Around that time, there was an awesome device out called the Boxee.  It has been our go-to device all these years, even though they stopped doing updates and sold to Sony or something.  We tried all the Roku boxes, Apple TV, Xbox, Chromecast, WD Live...nearly everything.  We have yet to find any one device that replaces our Boxee and something else for us to watch Hulu (no support on Boxee).  We have a fairly large digital movie collection so we need something to let us play media from our NAS.Anyway, I did the pre-order for the TV Stick.  Yanked the Chromecast out, popped the new device in and ran through the setup, etc.  My wife and I really like the interface.  It was also super easy to install Kodi (play NAS content) so this device is a one stop shop for us.  We will be getting another one if it goes on sale again.  It's worth the price, and maybe if I can sell one of the two Chromecasts we have, then I will buy it, but we already have too many devices laying around.", "verified": true, "helpfulness": "1/1", "author": "j4bles \"J.B.\""}, {"rating": 4.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "L S"}]