[{"rating": 2.0, "review": "Very pleased with the stick! Learning more everyday. Hope to get the most of it soon.", "verified": true, "helpfulness": "0/0", "author": "michael p. sanders"}, {"rating": 5.0, "review": "Love it - watching so many movies.", "verified": true, "helpfulness": "0/0", "author": "Judy Gauithier"}, {"rating": 5.0, "review": "Love this item.  Easy to hook up and use even for my parents.", "verified": true, "helpfulness": "0/0", "author": "Milissa Stormer \"Mareth1969\""}, {"rating": 5.0, "review": "Love it and also have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use. The setup was quick and simple. It is the best way to stream prime shows. Nice to watch on the large TV screen instead of always watching on the Kindle. I am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Disappointing that there isn't more access to complete seasons of shows without purchasing. Also, disappointed not to be able to mirror from an iPad or apple device. Should have access to mirroring from IOS devises or access to download Xfinity.Works well with Amazon prime instant download", "verified": true, "helpfulness": "0/0", "author": "Robert J. Hicks"}, {"rating": 5.0, "review": "Xbmc installed and watching pay per view and movies", "verified": true, "helpfulness": "0/0", "author": "Kanaka"}, {"rating": 5.0, "review": "Wow. Everything I expected and more.  So .such entertainment in a small thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Be side the loading and upgrade the tv show are good and am a prime member is a plus.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I felt disapointed in the fire stick. I have a t.v. that is five yrs old. The fire stick would not play because the t.v. dosent have a chip to prevent pirating.  I feel that I spent money for nothing and that I should have been told before it was purchased.  The tech told me I would have to upgrade my t.v. do we have to buy more and more just to satisfy needs. I feel it's ridiculous and this is why the U.S. is a throw away country.", "verified": true, "helpfulness": "0/0", "author": "Sheena VanHooser"}]