[{"rating": 5.0, "review": "After using chromecast for the last year I am a Fire TV stick convert. My kids love the games. My wife and I like the ability to watch prime shows and movies. With my chromecast I was limited to Netflix and Youtube. Fire TV Stick offers these and so much more.", "verified": true, "helpfulness": "0/0", "author": "Nakia B. Green \"Nakia B. Green\""}, {"rating": 1.0, "review": "trash", "verified": true, "helpfulness": "0/2", "author": "Bernard Blackmon"}, {"rating": 5.0, "review": "Wanted to get rid of my cable tv service and chose this as my streaming device. This gets everything I need (Netflix, Hulu, ESPN, etc...) as well as games from the Amazon app store. Plugs directly into my tv's HDMI port and uses my home WIFI. I definitely recommend this to others.", "verified": true, "helpfulness": "1/1", "author": "Serendepatia"}, {"rating": 3.0, "review": "I use the Fire TV in my living room and the Fire Stick in my bedroom.  The Fire TV in the living room is flawless.  I don't get lag timeand the little circling 25%.My Fire stick is in my bedroom basically right next to my modem/router.  It seems to speed up and slow down a lot and I can't figure out what the problem is.  I don't know if it needs more memory for buffering but that is what it looks like.  I wish you could add memory to it.  A little slot that we could put a mini memory card would be awesome.  I really don't want to add another Fire TV box.  The biggest problem has been with things I am watching on Netflix. I guess I will need to attach my Blue Ray player in my bedroom and see if I still have that problem.  Does anyone else have the same problem?", "verified": true, "helpfulness": "0/0", "author": "Michele M Siedenburg"}, {"rating": 5.0, "review": "we love it,  I don't need HBO or stars now", "verified": true, "helpfulness": "0/0", "author": "William Riddick, Jr."}, {"rating": 3.0, "review": "Nice compact media viewer, how ever not all apps are compatible.", "verified": true, "helpfulness": "0/0", "author": "Erwin"}, {"rating": 2.0, "review": "Doesn't work all the time", "verified": true, "helpfulness": "0/0", "author": "Stacey Sinclair"}, {"rating": 5.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "G. Pruckmayr \"GP\""}, {"rating": 2.0, "review": "I started off by being disappointed that many of the games I had purchased for my Fire TV box was not compatible with the Stick. Secondly, the remote that came with the unit works . . . sometimes. It goes to sleep during the middle of a game or program. When you try to reset it, the screen goes black. Even when it does work, there is a lag time. It's like being on dial up cable again. Select the program, push the button, go make a cup of tea, start the dishwasher, come back and maybe it has decided to work. Overall, I'm very disappointed. I only ordered it because my Fire TV box stopped working everytime I rearranged my furniture.", "verified": true, "helpfulness": "0/0", "author": "BECKY CUMMINGS"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "JIMMY SUTTON"}]