[{"rating": 4.0, "review": "I really like this little device. I love that it is so portable. I can take it with me to a friend's house and stream content available to me through my Amazon Prime account and this has probably sold a few of these simply because people are impressed with what they can do with the Fire TV Stick.  The only reason I did not give this five stars is because, unlike my Kindle, Comcast Xfinity is not a listed cable provider to access Showtime Anytime.  It does appear that HBOGO, just made available through Fire TV Stick, allows users to login through their Comcast Xfinity account, but not Showtime.  I'm not sure how this can be resolved, but I'm sure I'm not the only Comcast subscriber who is perturbed by the fact that I can stream HBOGO through my Kindle and Fire TV stick, and I can stream Showtime though my Kindle--but not on my television?", "verified": true, "helpfulness": "1/1", "author": "Kathryn E. Claxton"}, {"rating": 4.0, "review": "The Fire TV Stick works as expected.  I would like to have found more recent movies/TV shows available at no charge from Amazon Prime.  Most of what I did find I can already get from Netflix.", "verified": true, "helpfulness": "0/0", "author": "jsc"}, {"rating": 5.0, "review": "Great additional to my TV watching experience.", "verified": true, "helpfulness": "0/0", "author": "Geraldine T MacLellan"}, {"rating": 5.0, "review": "Fire TV Stick is great. And very easy to set up. I love this.", "verified": true, "helpfulness": "0/0", "author": "connie"}, {"rating": 5.0, "review": "This was a great investment for the price. Even at full price.  It's easy to use and move around the house.I watch use my fire tv stick mostly for Netflix, YouTube, Amazon prime and pandora. My entire family (5) shares mine, but I'm thinking about buying more because it's just so cheap.", "verified": true, "helpfulness": "0/0", "author": "dawnajo"}, {"rating": 4.0, "review": "Does everything I expected, Would have been nice if it charged off the TV power as opposed to having its own power supply.  That why I did not rate 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Felicity MacDonald"}, {"rating": 5.0, "review": "I want three more hahaha", "verified": true, "helpfulness": "0/0", "author": "C Harper"}, {"rating": 5.0, "review": "Really cool stuff.", "verified": true, "helpfulness": "0/0", "author": "Doug Beek"}, {"rating": 5.0, "review": "I received the fire TV Stick as a Christmas present from my children.  I have been enjoying the numerous selections of movies and television shows it offers. No more loading and unloading DVD's. It's very easy to use and I can move it to any TV in my house.", "verified": true, "helpfulness": "0/0", "author": "V.B.H."}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Paul W Memminger"}]