[{"rating": 5.0, "review": "Selects  from 3 hdmi inputs wireless.", "verified": true, "helpfulness": "0/0", "author": "Steven J. Kammeraad"}, {"rating": 4.0, "review": "Love my Amazon Fire TV Stick, for Streaming it works well. I like PBS so I am able to catch Downton Abbey. It does give you some channels but like all streaming devices, you still have to pay for the premium channels. For what I need it suits me just fine. Just keep in mind that it does not have a browser app yet, waiting to see one, this would make it better, then I can catch my local news via the Internet. So I am keeping cable on a little longer until the browser app is working and in place.", "verified": true, "helpfulness": "0/0", "author": "Eddie T. \"Video Shoots\""}, {"rating": 1.0, "review": "Temperamental would be a good description of the device. I love the Fire TV and thought I would get the Fire Stick for a secondary television. The Fire Stick wouldn't stay connected to the internet and when it did for a few minutes it couldn't deliver anything but the pre-programmed 'how to' video. I own several Fire tablets and the Fire TV box so I expected better. I'm disappointed with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Graham"}, {"rating": 5.0, "review": "Love it! Easy to use. Bought another for my elderly mom since it's a breeze to install and use.", "verified": true, "helpfulness": "0/0", "author": "Riley McGee"}, {"rating": 5.0, "review": "well done, excellent user interface.", "verified": true, "helpfulness": "0/0", "author": "Frank Fell"}, {"rating": 5.0, "review": "Love it.  Very fast compared to the blueray player I was using.Trying out the Amazon Prime option.", "verified": true, "helpfulness": "0/0", "author": "ME"}, {"rating": 5.0, "review": "I loved it so much that I bought two more when they went on price reduction.  It saves from moving my TVs to plug it in.  A great way to receive Netfliks and Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Shoe Goddess\""}, {"rating": 5.0, "review": "Way smarter than my smart TV is alone.", "verified": true, "helpfulness": "0/0", "author": "J'Amie"}, {"rating": 3.0, "review": "Pros: stable WIFI connectionCons: 1) No volume control 2) too many non-prime contents", "verified": true, "helpfulness": "0/0", "author": "Seungjin Shin"}, {"rating": 5.0, "review": "Fire Stick has a learning curve at first, but it gets easier.  The user interface is easy to navigate,  and I hope more apps and movies are on the way.", "verified": true, "helpfulness": "0/0", "author": "Glenn E Oller"}]