[{"rating": 5.0, "review": "THE BEST!", "verified": true, "helpfulness": "0/0", "author": "Eva Busch"}, {"rating": 5.0, "review": "This has to be THE greatest thing EVER! What did we ever do without this contraption? I thought to myself \"I'll buy it and if I don't like it, I can return it, Amazon is good like that.\" Nope, not going back - EVER! There are so many options...only thing I don't like or maybe just haven't figured out is I can't see previous seasons to some of my shows, only the current ones are available. Otherwise, I love it!", "verified": true, "helpfulness": "0/0", "author": "Marissa Guerrero"}, {"rating": 5.0, "review": "Ready to watch right out the box!", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Great Product. I use it every day.", "verified": true, "helpfulness": "0/0", "author": "Mark Johnson"}, {"rating": 4.0, "review": "Works good. Easy to install. I like easy.", "verified": true, "helpfulness": "0/0", "author": "Dorothy Smith"}, {"rating": 3.0, "review": "No problem streaming but download is often not in HD despite the fact that it should be.  I spent time with an Amazon tech but the problem continues. My other WiFi device, a Sony DVD player, has a great picture but very inconsistent download capabilities.  I was hoping for a predictable download and a great picture from the Fire TV Stick and I'm not getting them.", "verified": true, "helpfulness": "0/0", "author": "Martha H. Sigler"}, {"rating": 1.0, "review": "Very laggy compared to a roku very disappointed", "verified": true, "helpfulness": "1/1", "author": "JoJuan"}, {"rating": 5.0, "review": "Sick", "verified": true, "helpfulness": "0/0", "author": "Jack Cardenas"}, {"rating": 5.0, "review": "Very awesome  recomend it to anybody", "verified": true, "helpfulness": "0/0", "author": "jacob"}, {"rating": 5.0, "review": "This was one of the best purchases.  It was truly easy to set up and it consistently works well.  I have now been recommending it to others.", "verified": true, "helpfulness": "0/0", "author": "Cindy \"Cindy\""}]