[{"rating": 4.0, "review": "Regarding fire tv stick:It was great & flowless for the 1st few days then had few glitches.  Now it's working well again.  I haven't had it too long to give much details.As far as prime tv, I love it!", "verified": true, "helpfulness": "0/0", "author": "AG"}, {"rating": 5.0, "review": "It is very easy to connect.  I like it a lot just wish they had more current movies.", "verified": true, "helpfulness": "0/0", "author": "Rhonda"}, {"rating": 5.0, "review": "Very satisfied!  Highly recommend 😃", "verified": true, "helpfulness": "0/0", "author": "Kent Fan"}, {"rating": 5.0, "review": "Amazon hit the nail on the head this awesome streaming device!", "verified": true, "helpfulness": "0/0", "author": "Gabriel L."}, {"rating": 5.0, "review": "I used the Amazon Fire TV Stick to replace an older Roku device, which I then moved to an older TV that uses RCA connections (the Fire Stick only supports an HDMI connection). The Fire TV Stick is much faster than the Roku and offers more apps/games, although the channel line up is similar. The Fire Stick allows only a WiFi connection (both 2.4 GHz and 5 GHz) but requires a physical power connection.Our first attempts at streaming movies were disappointing. While the picture and sound quality were both good, there were multiple buffering interruptions. I configured my router to assign a static IP address to the Fire Stick, enabled QOS, and set aside download bandwidth for the Fire Stick. My initial bandwidth allocations offered some improvement, so I kept adjusting until I got to 8192K (half my available bandwidth at the time). However, movies were still buffering. Finally I figured out that I had to allocate upload bandwidth as well; when I allocated 768K the buffering stopped. At that point I lowered the download allocation to 6144K with no loss of performance.Downloading the Fire TV app to my iPhone provided a spare remote for the Fire Stick, with the added feature of voice search. However, the phone is not responsive enough to use as a remote when playing a game.For a great price, great variety, and great performance, I give the Fire TV Stick five stars.", "verified": true, "helpfulness": "0/0", "author": "Darryl P. Howard"}, {"rating": 5.0, "review": "Works real good", "verified": true, "helpfulness": "0/0", "author": "Arnold W. Smith \"Sir William\""}, {"rating": 5.0, "review": "This thing is great. It worked great out of the box and was easy to set up. Added a few apps that fit my needs. We have a more expensive media streaming box that we love and this surpasses that box. Best of all it was 1/3 the price. It does have one short coming. It tends to drop the wifi connection more than I would like. Using the jumper extension and mounting the stick vertically helped. The wifi is a strong signal and is only 4 feet away. Read a lot of complaints about this problem. Hopefully it will be addressed in a future software update. Otherwise I love it. Would like getting another or two for my daughters.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the device. It works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Darrell Allen \"937andheartbreak\""}, {"rating": 4.0, "review": "Pretty cool overall, my only complaint is that it has had a few glitches here and there. Nothing major, just seems to get overloaded. Perhaps I should have chose the larger Fire TV if I was going to download a bunch of Apps. But overall I am pretty happy with it. For $39...buy one.", "verified": true, "helpfulness": "0/0", "author": "HHOMedia"}, {"rating": 1.0, "review": "i do not usually write reviews but I have to on this. I bought this during the Prime Day sale as I needed a streaming device in my bedroom. I have an Apple TV in my living room and have for several years now without any problems but the Fire Stick is nothing but a problem. It continually says that it can not find my network or the signal strength is weak even though it's a 15ft straight shot with no walls blocking from my router. Then it will play for 5 seconds then buffer or drop the signal all together. I pull up speed test on my phone or iPad in the same room and I am getting between 30 and 50 Mbps download speed. If you have more patience for this than I do then this is the product for you. If you are like me a just want to watch a show before bed without resorting routers and modems and the stick itself trying to get it to stream, then spend your money some other place.", "verified": true, "helpfulness": "0/0", "author": "Tyler Robert Oldaker"}]