[{"rating": 4.0, "review": "Excellent for prime members.  Easy to setup, use, fast, nice quality picture.  Finally a way to use my PRIME membership besides the 2 day shipping.  It has an AC adapter that it says you need to use for optimal use.  I plug the USB directly into a USB slot in my TV, works perfectly.  I didn't try it with the AC adapter as suggested, but like I said my way seems to work perfectly.  It will give you a warning, but you can ignore. As good or better than I expected.  I got it for $19 but would pay the $39.  For a casual user get this vs fire TV.  A must for PRIME members.", "verified": true, "helpfulness": "0/1", "author": "A. Simon"}, {"rating": 2.0, "review": "- Update Dec. 8th. 2014 -Well one of the two Fire Sticks I purchased decided to stop working a few days ago and I have been working on troubleshooting it since.It was fine and dandy and then suddenly it lost it's video signal. Restarting it, switching power adaptors/cables, using it with and without the HDMI extender, etc... all to no avail. Tried a multitude of different TVs, all say 'NO SIGNAL', and I know all the HDMI ports on the TVs are working because the Rokus and game systems work fine.So until I can get this resolved or figure out what the issue is, the Fire TV Stick has been downgraded to 2 stars. If only one of the two I purchased is working... that's not good.- Update-The Amazon Fire TV Stick is not without it's flaws, as with many devices it has them, but that should not stop you from giving it a try.Setup was dirt simple. Plug it in, follow the on screen instructions, and you're good to go. I had a slight issue with it dropping or losing the connection (downloading at the speed of nothing) during the updating process but that resolved itself quickly by me reestablishing it's connection to my Wi-Fi hub.Once updated, it was ready to rock and roll. Unlike other reviewers, I did not have to input my wireless information after the update. And ever since it has maintained it's connection without me having to tinker with it. This is a huge step above the Roku 2 player that was previously being used as it never seemed to want to stay connected.Amazon Instant Video, Netflix, Hulu Plus, and most other apps all run smoothly and faster than the Roku 2.The remote is tiny (though twice as large as the Fire TV Stick) and super functional. No unnecessary buttons, scroll wheels, or motion controls, just the epitome of simplicity... love it!Now for the reason I docked the review one star... the goal and reason for purchasing the Amazon Fire TV Stick was to eliminate as many unnecessary cables and wires as possible. While the stick did indeed eliminate a few cables, we noticed that the performance (how fast it streams/buffers, accesses content, etc.) seems to slow down when the provided AC adaptor is not used. In addition to that every time you shut the TV off (without the AC adaptor plugged into the Stick), it has to initialize, establish a connection, update, etc.. For the occasional user, using it without the AC adaptor will probably be fine, but for us folks that like to stream practically everything, ALL THE TIME, keeping it powered up is definitely the way to go.I will be timing and testing how it performs with the AC adaptor used and without to see if there really is a performance difference. So I'll update this as soon as I can with the results.So at the end of the day, the Amazon Fire TV Stick has delivered on MANY fronts and was a nice upgrade from our Roku 2.", "verified": true, "helpfulness": "0/2", "author": "J. Brooks"}, {"rating": 3.0, "review": "Static and flickers on and off.  Mainly blank screen.  I will send it in for exchange and edit this post when I get a working unit.", "verified": true, "helpfulness": "1/5", "author": "C. Burch"}, {"rating": 5.0, "review": "Great for watching amazon prime video, YouTube, netflix, and other content apps. Picture is crisp and clear, interface is speedy enough, glad I waited and got this instead of Chromecast or Roku. They do need to do a few updates:-Parental controls should be a little more customizable. I had to enter the code 3 or 4 times just to use settings and install free apps. I just want a code to protect from accidentally charging money to my card-Dolby Digital Plus doesn't work with my sound system. To be fair...it's a cheap sound system, but it would be nice to have something better than stereo, maybe regular Dolby Digital?-I get why they put Amazon stuff front and center, but it would be nice to pin favorite apps like Netflix and YouTube in an easy location.", "verified": true, "helpfulness": "3/5", "author": "Alex Evans \"Alex\""}, {"rating": 5.0, "review": "I don't know why people are giving this negative reviews.  We have never owned a streaming box so we didn't really know what to expect.  After reading the reviews I was hesitant to buy the Fire TV stick but for $39 I figured it was worth a shot.  I found one at my local Staples.  For those still looking to purchase one in time for Christmas I suggest trying Staples.  You can even buy online and pick up in store.  Anyway, within 10 minutes of unpacking it from the box we had it up and running and we were watching one of the free Amazon Prime movies.  We didn't have any problems setting it up or with our wi-fi. Maybe our wi-fi is faster than other people who were saying they were having problems with the the stick losing the internet connection.  My advice is give this thing a try.  Its reasonable and worth it for the free Prime TV and movies alone.  The only negative I see so far is that the power cord does hang from the device.  Eventually we will get it behind the TV like the other cords but for now it does look messy.Update- Staples has the Fire TV Stick on sale right now for $24.  I bought it at $39 and I called and got a price adjustment.  For $24 get it!  You can't go to the movies for $24.", "verified": true, "helpfulness": "2/5", "author": "NJ mom of 2"}, {"rating": 5.0, "review": "This works just fine and a lot of the 1 Star ratings have been misleading. The one person who complains about all the extra cables and plugs probably doesn't realize you can just plug the USB power adapter right in to your TV's USB power port. You have to do this very same thing with the Chromecast as well. I own both the Fire stick and the Chromecast and both are perfectly fine choices. Take your pick. One other note, the Fire stick will suggest that you use the plug adapter, but I haven't seen any issues with powering through the TV USB port so far.As for the software updates, it does take some time, but no issues for me. It did ask for my WiFi password twice, but hardly a headache.The navigation is okay. The remote is handy enough, but I do recommend using the app via iPad, phone or other tablet. It certainly makes it easier for kids to navigate, just by scrolling and touching what they want instead of typing in every letter with a remote.", "verified": true, "helpfulness": "2/5", "author": "GaVaHokie"}, {"rating": 4.0, "review": "Unfortunately the first one delivered was faulty, and would not download.  I had done everything correctly, and followed the instructions to the letter, so I was more than a little upset when the first person I spoke to was rather condescending and had me go through the same steps again, and of course it didn't work, then she said lets try HDMI2 and I said lets not, I have already done that, she then put me on to a most helpful man, thank goodness, who tried everything to make it work including resetting to factory defaults.  I did not have a problem with him as he was polite and helpful, but in the end he had to send me a replacement, and label to send the faulty one back for free. The replacement downloaded without a problem and I have been watching Amazon Prime regularly. I prefer to sit and watch TV.  I would not recommend this to anyone who has Cable or Satellite TV,  but the TV I have it on, is not connected to either, and I can now watch movies on this TV as well as local channels, and go to the other TVs if I want Satellite.", "verified": true, "helpfulness": "0/1", "author": "Pat"}, {"rating": 5.0, "review": "Best Buy had a limited supply of Fire TV Sticks for $24.99, this weekend. I got one on Friday and plugged it in right when I got home. Just to clarify, you plug the stick into a HDMI port not a USB port. All you need is a TV with a HDMI port, WIFI, and an outlet within a few feet of the TV to charge the Stick.----- otherwise everything is included that you need. I got the Fire TV Stick mainly to watch Netflix. I loved how easy it was to setup and start browsing. I wish it would come with a year of PRIME not just a free month.", "verified": false, "helpfulness": "3/5", "author": "Estee"}, {"rating": 5.0, "review": "If you download the app for your smartphone you will enjoy this device a lot more. I had no trouble setting up but the included remote while serviceable has its limitations. The app so far has worked for voice command and gives you the ability to swipe around on the screen and control what's happening on the TV.", "verified": true, "helpfulness": "1/2", "author": "John Breitenbach"}, {"rating": 5.0, "review": "Let me preface my review by stating that I am a technological idiot with epically bad luck with anything requiring internet connectivity. Even with that background, I found the Fire TV stick incredibly easy to set up (plug it into the TV, plug it into the wall, you're done!), connect, and use. I have watched an embarrassing amount of programming since getting it, and have had absolutely no connection, streaming, or other problems. Long story short, I love it (and for $19, the special pre-order price, my expectations were low).Five stars all the way!P.S. to the people giving a bad review because the remote is hard to open: Press it with your thumb, boom, it's open. I have the relative strength of a fruit fly and thought it was a piece of cake.P.S. to the people giving a bad review because there's no way to fast forward through the instructional video: Relax, it's like 3 minutes long, and you only need to run it once. If you can't bear to sit through it, just get up and go brush your teeth or something. By the time you're done, the video is over (and you have minty fresh breath)!", "verified": true, "helpfulness": "250/277", "author": "Keldy23"}]