[{"rating": 5.0, "review": "Great! It works very well.", "verified": true, "helpfulness": "0/0", "author": "Rick Ferro"}, {"rating": 5.0, "review": "This thing is awesome.  We have three now, I give them as gifts to family.  If you're willing to share your password to Netflix or Hulu, your family can watch from their houses. There is a remote app for iPhone and iPad in case you lose the remote that comes with it.  Great for turning a regular TV into a smart tv.  If you already have a smart tv, you won't need this.", "verified": true, "helpfulness": "0/0", "author": "Heather Jones"}, {"rating": 5.0, "review": "Love it and so easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Sherri Bujano"}, {"rating": 5.0, "review": "Perfect for my needs: just a little bit a TV at night to relax after a long day of work.", "verified": true, "helpfulness": "0/0", "author": "Solene Fabre \"Solene Fabre\""}, {"rating": 5.0, "review": "New Life for an old Plasma TV. This allowed me to take advantage of the Prime Videos I could not receive before having the Fire Stick.Now we can enjoy Prime Videos and so much more.If you have an older TV, with a free HDMI input and Wi-Fi home network, this is what you need to get streaming media. It is very easy to set up.Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ReneP\""}, {"rating": 5.0, "review": "So love it", "verified": true, "helpfulness": "0/0", "author": "Sandra R."}, {"rating": 2.0, "review": "This fire stick has good apps but is the biggest piece of crap when it comes to the Internet connection capabilities. I pay for extra high speed internet with a router not more than 25 feet away and it literally NEVER works. It is the only device of 6 we have that ever has problems keeping a connection. I would not recommend getting this product until they get a firmware update to fix the problem.", "verified": true, "helpfulness": "0/0", "author": "Wade Derby"}, {"rating": 3.0, "review": "I hate that it has to be plugged into an outlet.  The device works great but the cord is a pain.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "How do I live without this? Although wish it had you tube (it doesn't for obvious reasons)", "verified": true, "helpfulness": "0/0", "author": "Earl Jackson"}, {"rating": 5.0, "review": "been using to watch movies. just wish had a owners manual with it. slowing able to figure how to use prime. quality of product great, works great looking forward using it more. Thanks Terry", "verified": true, "helpfulness": "0/0", "author": "terry p deharte"}]