[{"rating": 5.0, "review": "love love love", "verified": true, "helpfulness": "0/0", "author": "Jeannie"}, {"rating": 5.0, "review": "Just got this yesterday.  This thing is awesome. I can watch all my Amazon Prime and listen to Prime Music without being tied to laptop.  Great.  Should have bought this when it first came out.", "verified": true, "helpfulness": "0/0", "author": "Sharon Barger \"driver\""}, {"rating": 3.0, "review": "I was led to believe it would work with my Sony Bravia, so I purchased it. After about 20 minutes of speaking with a tech rep, it was determined that the Fire TV Stick only works on the television in my basement. There is a chance Sony may have software updates available that I could download to make the 2 devices compatible, but I haven't taken the time to research this. So, the reason for the 3 stars (vs 5), isn't due to the product; it's due to the product not being compatible with my equipment, and I was led to believe that it would be compatible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's ok", "verified": true, "helpfulness": "0/0", "author": "Djep"}, {"rating": 5.0, "review": "The fire stick was great.Much better than the Google Chrome stick.Would recommend the fire stick to all.", "verified": true, "helpfulness": "0/0", "author": "ANNIE"}, {"rating": 5.0, "review": "Easy plug and play, prce vs apps no other can compete.Transform a non smart TV to a 90% smart TVGreat simple usefull remote.", "verified": true, "helpfulness": "0/0", "author": "Jon Sanjuan"}, {"rating": 1.0, "review": "This device has severe wifi connectivity issues. It doesn't matter if it is directly beside the router. It. Will. Not. Stay. Connected. All of my other devices are fine. Trying to use in a different room? Forget about it. Garbage.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 1.0, "review": "It's totally bulls***! loses wifi signal very easy, pauses to much in the middle of what your watching. to long to down stream, most pictures aren't clear. have to pay for most apps they claim are free, and worst yet, boot leggers get there hands on it and try upgrading it to sell for $300.00 and still nothing good about it! GARBAGE!!!!!!!!!", "verified": false, "helpfulness": "0/0", "author": "Mr.  Anthony Cardoza"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "James W."}, {"rating": 5.0, "review": "Performs very well for Netflix and Amazon Video", "verified": true, "helpfulness": "0/0", "author": "mzat"}]