[{"rating": 1.0, "review": "terrible, no HBO Go, Hulu Plus sporadically worked and then the whole thing stopped working", "verified": true, "helpfulness": "0/1", "author": "Cam Bauchner"}, {"rating": 1.0, "review": "CONS:1. I have been using Chromecast for 2 years now.2. Not sure why I decided to go Firestick route.3. Poor bluetooth connection4. Poor WIFI - Slow - Very poor.5. Powering is problem - Connecting to Firestick USB to the TV is not enough AC juice. This device MUST BE PLUGGED IN AC outlet--- Bloody stone age... So if you have already mounted TV on the wall then better get ready to take it down to run this wire to AC plug.6. NO YOUTUBE embedded..... What??????????? Trying to download youtube app is takes for aware.PROS:Interface is good.", "verified": true, "helpfulness": "0/2", "author": "Jay"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Joe B."}, {"rating": 5.0, "review": "Good sefvice.", "verified": true, "helpfulness": "0/0", "author": "Larry Lovell"}, {"rating": 1.0, "review": "If I could give it 0 stars I would. I pre-purchased it on the strength of how good two separate kindle readers have been.The UI is laggy and doesn't always register a click from the remote. It freezes when using Netflix or HBO go. Issues that do not occur with competing products that I also own. I cannot recommend the fire stick to anyone when the other products have given me zero problems.To give credit where it's due, the lyrics with music streaming is pretty nifty. So that's nice if you're just looking or something to use for karaoke/sing along.", "verified": true, "helpfulness": "0/1", "author": "Alexander Navarro"}, {"rating": 5.0, "review": "excellent device for streaming video. easy to use and inexpensive.", "verified": false, "helpfulness": "0/0", "author": "Abbey Maintenance"}, {"rating": 4.0, "review": "Works very well for Netflix, Hulu and Amazon prime.  Sometimes feed is jumpy is the only draw back, but very limited.  Have not used for the games yet, but would like to get into that at some point.", "verified": true, "helpfulness": "0/0", "author": "Matthew Coffey"}, {"rating": 5.0, "review": "Awesome !!!!", "verified": true, "helpfulness": "0/0", "author": "C Yocom"}, {"rating": 5.0, "review": "Fantastic, cheap and well worth it if you are a Prime member.  We have it on one of our older TVs that we aren't paying for a cable box for when guests are over.", "verified": true, "helpfulness": "0/0", "author": "Mickey"}, {"rating": 5.0, "review": "I was always skeptical of products like this and Chromecast, because I didn't really see the need for them.  Lately we've been looking for ways to save money, and our cable bill is starting to be a bit of a pain point for us.  I saw one of these on sale at a local retailer and I figured I'd give it a try.We've been pleasantly surprised by it, and the streaming is very consistent with no buffering.  We just might end up subscribing to Hulu and Netflix so we can just get rid of our cable bill once and for all.", "verified": true, "helpfulness": "0/0", "author": "Normalization"}]