[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "margarito ruiz"}, {"rating": 5.0, "review": "I love my new Amazon Fire TV Stick!  It was easy to set up and is very easy to use.  So glad I made this purchase and would recommend it to anyone who does not have a \"smart\" TV but would like the ability to stream movies and TV shows and more right to their TV sets.", "verified": true, "helpfulness": "0/0", "author": "Michele S."}, {"rating": 3.0, "review": "I wanted it to work like a Chromecast to push my stuff from a browser from my iPhone/pad to the tv. doesn't do that. Otherwise, nice remote, Netflix, all work ok.", "verified": true, "helpfulness": "0/0", "author": "Kevin Shirey \"SineQuaNon\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kiley Renae Smith"}, {"rating": 4.0, "review": "Can't get my Wi-Fi to work so I can't use any features... not even miracast...which is why I bought it... for my Fire phone... you must have internet to use this.", "verified": true, "helpfulness": "1/1", "author": "Andrea Bisson"}, {"rating": 5.0, "review": "Awsome but hard to get all it needs is user friendly for uploading....and external camera will pay a lot more for extras...", "verified": true, "helpfulness": "0/0", "author": "juan"}, {"rating": 5.0, "review": "LOVE IT sooooo much!!!!", "verified": true, "helpfulness": "0/0", "author": "M. Farmer \"SongBelle\""}, {"rating": 5.0, "review": "Absolutely love my Fire TV stick and with the addition of the HBO Go app, it has mostly everything that I need. It's still missing a few TV apps like NBV Live Extra, but I'm hoping they will keep adding them.As to the performance, I really have no complaints. I plugged it in to the HDMI at the back of my TV, but I have no problems using the remote as it uses WIFI to connect and it's pretty responsive. I have used it regularly over the past 3 months and I think it lost connection with the WIFI about twice. Not perfect, but considering I paid 20 bucks for it, I'm willing to let that go.", "verified": true, "helpfulness": "0/0", "author": "nutcracker84"}, {"rating": 5.0, "review": "Better than expected", "verified": true, "helpfulness": "0/0", "author": "Donna H. \"D.\""}, {"rating": 5.0, "review": "I was very happy with the simplicity of operation.  Everything I needed to hook up and get started using the product was provided and instructions were clear and concise.  I love that all the commands can be accessed by scrolling through menus with the compact remote provided.  This is helping me get even more value out of my Prime membership.  anyone who has Prime but does not have the fire stick is missing out.", "verified": true, "helpfulness": "0/0", "author": "david conn \"Dave Conn\""}]