[{"rating": 5.0, "review": "Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Bob3433"}, {"rating": 5.0, "review": "We love it! We are able to watch sports and movies without a cable box.", "verified": true, "helpfulness": "0/0", "author": "Bootz"}, {"rating": 4.0, "review": "With the exception of this needing strong wireless internet service to work without constant buffering (a WiFi hotspot won't cut it) it's a great device to bring internet access to your TV where it isn't already available from the TV itself.  Easy to set up, easy to use and even better if you have a Prime membership and can stream tons of free entertainment and games.", "verified": true, "helpfulness": "2/2", "author": "D. M. Cavalier \"DMC\""}, {"rating": 5.0, "review": "works very well", "verified": true, "helpfulness": "0/0", "author": "P. Tyler"}, {"rating": 1.0, "review": "Requires high speed internet (via cable or fiber). I have a 4GLTE connection, but its too slow; too much buffering.  That said, the buffered picture was poor quality, not HD. I was very disappointed.Also, the menu does not clearly indicate which shows and programs are free per my Amazon Prime account, and which are ones I have to pay for.I think Fios is coming in a month or two. If the picture quality does not improve, and the buffering does not go away, I will surely cancel my amazon prime account.", "verified": true, "helpfulness": "0/2", "author": "Nils Anderson"}, {"rating": 5.0, "review": "The Fire Stick was a Christmas gift for which I give hearty thanks to Santa. Simple to install, simple to use, once you get used to to controls on the remote.  Lots of great content new to those of us who never had HBO or premium cable. With this little device you will not need cable.The only problem I had was opening the battery cover to install the included batteries was a challenge. The sliding cover was really tight.", "verified": true, "helpfulness": "1/1", "author": "Frost"}, {"rating": 4.0, "review": "The stick works great. Just a little dissapointed with the prime video selections. All the tv and videos I want to see I have to pay extra for :-( I thought a $100 a year would get me more.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "useful if your TV doesn't already have the app", "verified": true, "helpfulness": "0/0", "author": "C. Constantinescu"}, {"rating": 5.0, "review": "Love it! Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The \"Fire TV Stick\" was a gift from my son, and I didn't know what to expect. My wife (the mother of my son who gave it to \"us\") doesn't use email, or computers, and doesn't understand physics (or computing), is, non-the-less fascinated by the enjoyment that the \"fire stick\" gives us, and we have been enjoying the entertainment that it provides almost daily.  In short, it is terrific!", "verified": false, "helpfulness": "0/1", "author": "Hylmar Karbach"}]