[{"rating": 4.0, "review": "First, let me say since the Fire TV Stick has just been released at the time of this review I expect that problems will be fixed and more apps will become available over time.  It appeared to be very responsive with the Bluetooth remote.  Menu navigation is well organized and fairly intuitive.  It certainly worked well with Amazon's video and music service, especially with Amazon Prime.Now as to problems.  The unit is power hungry.  I could not use the USB port on either my AV receiver or my TV to power it.  I had to use the supplied power supply.  I tried using the Android app on my Google Nexus 7 to control the Fire TV Stick.  While it worked like the Bluetooth remote it would not work properly with the touted voice search.  The Fire TV Stick would respond that it could not understand what was said.The current app offering is rather limited.  But I expect it will increase over time depending on the Fire TV Stick's popularity and how tightly Amazon will control app development.  The Fire TV Stick is my fourth such device.  I hope that it will become as popular as the Google Chromecast with many apps to exploit its power.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Work great. Gets all the typical channels. Roku has more channels but fire has enough of them.  The interface is more refined and faster then roku.  I way prefer this to chromecast.", "verified": true, "helpfulness": "0/0", "author": "sjidzior"}, {"rating": 2.0, "review": "The main reason I bough this was so that I could watch Prime videos that I already had downloaded to my Fire HD 7 on my TV. However apparently the Fire HD 7 does not support \"mirroring\" and thus if you switch from viewing on your fire to viewing on the TV, it streams the video again to the Fire stick. Since I have a slow Internet connection due to living rural (and no other options), the streamed video quality is garbage. I can download to my Fire HD at 720P in the background, so getting decent quality video on the fire is not an issue. So basically this does nothing that the Amazon app on my PS3 can't already do. It's getting returned.", "verified": true, "helpfulness": "0/0", "author": "Texas Mark"}, {"rating": 5.0, "review": "No need a device like tablet or laptop to watch streaming. Extra advantage that it has remote.", "verified": true, "helpfulness": "0/0", "author": "skb"}, {"rating": 4.0, "review": "Super. Easy to use. Would have got a fifth star if had a browser.", "verified": true, "helpfulness": "0/0", "author": "Stefan"}, {"rating": 5.0, "review": "The Fire TV Stick is a great low-cost choice for streaming media on your HDMI equipped TV. Setup is simple and straightforward and the WiFi connection was seamless for me. While it may not have everything the full-featured Amazon Fire TV has, like voice-search, it's $60 less, and the basic remote works fine. It's also ultra-portable, unlike the bigger boxes (I also have a Roku 3). Since I wanted a dongle to carry around when I'm on the move, the Amazon Fire TV Stick more than meets my expectations and needs.Streaming and playback matches the high quality of my Roku 3, and the interface is very straightforward and responsive. In fact it's probably the easiest to use I've experienced. Like all Amazon media devices, to get the most out of it, the device is best with a Prime account, which gives you access to the Amazon Prime video and music libraries. I also keep my very large audio collection stored on Amazon's Cloud service, so I have access to playback of all my music through the Fire TV Stick.A great choice!", "verified": true, "helpfulness": "0/0", "author": "S. Jones"}, {"rating": 3.0, "review": "remote control design is poor, especially up and down key not user friendly. some times slow response comes from remote control", "verified": false, "helpfulness": "0/0", "author": "ma"}, {"rating": 5.0, "review": "The Fire Stick was on sale for $19 so I figured, 'what do I have to lose.'  What I did not realize was how much I would gain.  As a Prime member the numbers of options to watch with Fire Stick are really comprehensive.It onlt took a few minutes to setup and then the family was enjoying movies, HBO shows and a whole host of Web content via the app store.Final raversion is the quality of the streamed content.  It's top notch.If you're looking for a great, one inexpensive gift to stuff in the stocking of someone you love...I highly recommend the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Wolf Georges \"Wolf Georges\""}, {"rating": 3.0, "review": "The packaging is nice but the device in the package is just plain.  Seems like they put lots of money and thoughts into the packaging but the actual device design is just after thought.  once it is connected, it takes very long time to download a new software.  After 30 minutes or so of waiting it is finally downloaded.  The apps are very very limited.  I have 2 chromcasts, Apple tv, and roku and this fire stick needs to add more apps soon.  with this sick I only uses it for Netflix and Amazon prime movies.", "verified": true, "helpfulness": "0/0", "author": "DonaldC"}, {"rating": 5.0, "review": "I have 3 Chromecast Sticks and I got the FireStick on a promotional deal.  I have to say, it's twice is good as the Chromecast after adding all the extra apps along with the Android App for my phone.  I use it and abuse it .. only thing I can knock is that the remote app seems a little too sensitive the cheap little app that comes with it works fine.", "verified": true, "helpfulness": "0/0", "author": "Dave"}]