[{"rating": 5.0, "review": "Love it !  Plain and simple !", "verified": true, "helpfulness": "0/0", "author": "shauna n schebel"}, {"rating": 5.0, "review": "This was an impulse buy, just wanted to try it out. Plus I had just cut my cable off because it was pointless to have when i could just stream video from the internet. After reading all the reviews, bad and good, I was a bit skeptical.Then I received it in the mail, hooked it up within minutes....and man this thing rocks! The picture quality is top notch, crystal clear and very easy to use.I read a review that said amazon puts \"click bate\" to get you to automatically sign up for a service that you don't want. This is false. Maybe it was like that in a older version but not anymore. Also what I REALLY love about the FireTV stick is the parental controls. You can set a 5 pin password, then just \"click the boxes\" you want to deny access to. So basically, i set it up so that no one can make a purchase or install an App without my password. Problem solved, now no one can accidentally purchase anything.With the FireTV stick, i think its pointless to ever pay for cable again. If you have an amazon prime account its well worth it. $99 for amazon prime for the year; verses $40-100 per month for cable (sometimes more), its a no brainer! Even if you dont have amazon prime, you still have access to Netflix and other apps. Even HBO has an app thats basicly like Netflix but with all HBO content, like the tv series \"Game of Thrones\". Seriously who needs cable when you have this.I usually dont do reviews, but I liked it so much I had to write a review. Im very happy with my purchase, I think you will be too.", "verified": true, "helpfulness": "0/0", "author": "xavier palafox"}, {"rating": 3.0, "review": "Prime video is great with this.  Netflix app lags a lot and resolution drops regardless of my 60mbps internet.Prime video search is very nice.  Netflix app search function is poor.", "verified": true, "helpfulness": "0/0", "author": "Goonies"}, {"rating": 4.0, "review": "My only complaint is the remote is too small. Not as easy to handle as I'd expect.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Lewis"}, {"rating": 5.0, "review": "Far easier to use than Roku.", "verified": true, "helpfulness": "0/0", "author": "gulatin2"}, {"rating": 5.0, "review": "Very happy with Amazon Fire Stick. Great picture quality and the audio is fantastic. I will buy another one. Will recommend to my friends.", "verified": true, "helpfulness": "0/0", "author": "Andrew F. Ali"}, {"rating": 5.0, "review": "The best 40 dollars I ever spent, I have a Samsung smart tv and I would have to honestly say this little stick does a much better job when it comes to wifi connection which I've been suffering from for the last two years... I wish I got it sooner :) bad Samsung and good job Amazon. Oh btw did I mention the nice simple but really much better remote than the $1500 TV remote. Read more about the issue at MyBananaCafe", "verified": true, "helpfulness": "0/0", "author": "moe"}, {"rating": 5.0, "review": "Awesome. This helped me cut ties with my cable provider. It doesn't do all but it does a lot more than you think. Watch the youtube videos on it and youll see why.", "verified": true, "helpfulness": "0/0", "author": "Trevor B."}, {"rating": 3.0, "review": "Highly disappointed. But I suppose it's my fault for not researching this product more thoroughly. This device does not deliver 1080p. I had my laptop connected to my TV for the longest time because it allowed me to watch 1080p on a big screen. I thought the Fire Stick would be a good idea because I'd be using my laptop less for such applications--I also figured there would be less clutter on my desk with the Stick. The device is compact, easy to take with you anywhere, and has some other nice attributes. Still, I am disappointed with its output. Plus, one would think that if it plugs into the TV's HDMI input, it should be HD! Not only that, but I am constantly seeing the TV stick being used in advertisements without a power cord--you have to plug in this thing for it to work. I assumed the HDMI input would charge the TV Stick. Well, you know what they say happens when you \"ASSUME.\" I am not saying this item is completely terrible, because some will undoubtedly find it useful.", "verified": true, "helpfulness": "0/0", "author": "mark \"Mark Valdez\""}, {"rating": 1.0, "review": "Wasted money...my tv does Not have a port.. it's only about four years old..Geeze..anyone have a suggestion on how top Jeri rig it top make it work????  The port it does have dosen't work with the stick.. I had to call to get the tv back on line....geeze...sounds sho easy but not for me....", "verified": true, "helpfulness": "0/1", "author": "Sharon \"Sue\""}]