[{"rating": 5.0, "review": "Faster and more powerful then chromecast and with all the good stuff from amazon and the option to side load apps ,great and all for 39 bucks", "verified": true, "helpfulness": "0/0", "author": "Johnny Rivera"}, {"rating": 4.0, "review": "I like it alot I get to see alot of shows i miss. the only thing i find pointless is the constant need for the cord to be plugged in. i thought it was supposed to be just for charging.", "verified": true, "helpfulness": "0/0", "author": "cassiesmommie"}, {"rating": 3.0, "review": "dosnt work unless you have a fast enough internet service i thought i can watch netflix with it now i have to get cable internet sevice for it will work", "verified": true, "helpfulness": "0/0", "author": "SAL"}, {"rating": 2.0, "review": "The second call to your help center did the trick. We had an awful time getting it registered in our name ( it was registered to the gift giver) and it took a 2 hour phone call to get us up and running. On a more positive note, the Amazon employee directing me was very knowledgeable, willing to stay with me until the end and had a sense of humor. She begged me not to throw the darn stick in the canal at the back of our house. Ladies, my husband just sat on the couch enjoying my frustration, and now he's watching Netflix, thanks to me!In the beginning I would have given it a negative star rating, Now that it's up and running I'm happy with it so it deserves more stars,", "verified": true, "helpfulness": "0/0", "author": "Donald Glasstetter"}, {"rating": 1.0, "review": "Most of movies are years old, nothing current. TV series are OK.", "verified": true, "helpfulness": "0/2", "author": "Mike Woltenberg"}, {"rating": 4.0, "review": "Works great on apps such as Netflix.  Have some minor issues using it to watch Sling TV but since other apps work so well, the issues may be due to Sling TV rather than the Fire Stick.  Works well.  Enjoy that I can easily move it to another TV if needed.  Well pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "Jason S."}, {"rating": 2.0, "review": "From the start i flipped over a nail trying to open the remote battery door.Contacted Amazon support and the their official guide to open the remote battery door is to use a screwdriver. I used a screwdriver as instructed and i marred the back of the remote control.Now i have a bloody & scratched remote.Once i inserted the batteries the Fire Stick displayed on the TV: \"Unsupported USB Port\". That was with the original power adapter plugged in and original USB cable, as described in the manual. Had to unplug & replug everything twice for it to start.Once it started, everything worked okay.And one more thing: no HDMI CEC support. All the flat-screen TVs on the market today are able to tell the devices connected using HDMI what buttons are being presses on the TV's remote. With a simple firmware update you could be able to control your Fire TV Stick from your TV remote so you don't have to juggle 2 remotes. But Amazon choose not to do it.", "verified": true, "helpfulness": "0/0", "author": "Sergiu Partenie"}, {"rating": 5.0, "review": "I was at a crossroads about getting the Amazon Fire Stick or A Blue Ray DVD player with all the streaming channels preloaded onto it already.it was an easy choice after I considered the space I had to work with.I knew  with the Fire Stick all I had to do was plug it into an HDMI port on the TV and set it up.and just as I stated the set up was a breeze just linked it to my wireless router,added my Amazon account and my Net Flix account and BAM !! it was ready to go.I use a Roku in my livingroom and the Amazon Fire Stick in my bedroom.to be honest the Fire Stick does load faster than my Roku and that was part of the reason I went with it.I read about it being 6x faster than some other streaming devices. so I'd say if you're looking for a streaming device that will work as promised this would be the one to go with. I love it,priced right too", "verified": true, "helpfulness": "0/0", "author": "TEXtownJ"}, {"rating": 3.0, "review": "Got it for Amazon Prime, works very well but there are to many Amazon fees on most of the movies and also TV programs. I left Netflix for Prime, I do not think I made the right choice.", "verified": true, "helpfulness": "1/1", "author": "Ted Wienski"}, {"rating": 5.0, "review": "SEE ABOVE REVIEW. BOTH WORK WELL. RAG", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]