[{"rating": 4.0, "review": "I like it very much", "verified": true, "helpfulness": "0/0", "author": "Charles C Feldkamp lll"}, {"rating": 4.0, "review": "I do like the Fire TV stick. The product comes with a small and beautiful remote control and a smart HDMI plug-in. You have to connect the HMID plug-in with power, otherwise it will die. I guess there is not battery in this small plug-in. The inconvenience of the product is it does not have an internal battery to support its power, so I have to connect it with power all the time. The plug-in comes with Wi-Fi, you could access high-speed internet by using this.The most exciting thing is you are able to access thousands of free movies though this Fire stick. By the chance, if you are an Amazon prime, you could unlock more fancy movies. When you plug your fire stick into your smart TV, you could do lots of things, like play games, watching movies and even watch videos in YouTube app. However, if you want watch the latest movies; you still need to pay some dollars. You have options to buy or rent, which is flexible.The speed of this is super-fast; the design is amazing. I would definitely recommend this product to my friends. Price is affordable which 39 dollars is; I would assume most people would afford it. The set-up process is super easy. If you purchased through your personal Amazon account, the stick will come with all the information installed, which is pretty cool.Hope your guys who have purchased this small stick would have a nice experience using this product, and hopefully you could share post-purchase review to help others make decisions.", "verified": true, "helpfulness": "0/1", "author": "Qinqin Zhu"}, {"rating": 4.0, "review": "works good but you do have to unplug about once a week to reboot it but will worth the money", "verified": true, "helpfulness": "0/0", "author": "madison noll"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/1", "author": "Michael L. Thompson"}, {"rating": 3.0, "review": "The instructions are a tad simplistic. (Demonstrating how to operate the remote AFTER operating the remote to run the setup was another kink in the works.)I connected the stick as explained, but didn't get any sound at first. Finally I figured out that I had to change the input source on my TV in order to do so. However, that caused the sound to go through my TV speakers, not my stereo speakers.That made for rather poor sound in comparison with my stereo speakers. In addition, having to switch the input source on the TV deviated from how I'm used to managing my audio and video components (all connected via HDMI cables and all controlled through the receiver).I wound up unplugging the stick from the TV and plugging it into my receiver. Of course, since the power plugs into the side of the stick and not the back end, that took some juggling. I believe I'll need to re-run the Bravia sync so my remotes all do what they're supposed to do.Meanwhile, the stick itself works fine and the sound is good now that it's coming through my stereo speakers. I had been streaming the videos I purchased through my laptop, which resulted in freezing every time my Comcast high speed Internet burped. So far no freezing.This sort of thing makes my head feel like it's about to explode. After 30+ years in IT as a tech writer, I am effing sick and tired of having to screw around with things before they work the way they are advertised to do. So my rating reflects the p-poor marketing and documentation on this thing, more than the actual technology itself.Amazon may have kept the marketing and documentation simple, but that doesn't mean the technology itself truly is.", "verified": true, "helpfulness": "0/0", "author": "Nellie Nobody"}, {"rating": 4.0, "review": "We hooked up the fire stick and another similar device.  They both are great,  but it seems that the selection is better on the stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was concerned at first because I gave cable the ax and went with a digital antenna. I could not be happier, thanks amazon. Now I watch what I want when I want.", "verified": true, "helpfulness": "0/0", "author": "Terri Gayhart"}, {"rating": 4.0, "review": "So far it seems to be working great.  Specs are quite a bit better than similar products on the market.  Selecting the Fire Stick input on your TV doesn't appear to bring up the Fire Stick menu as expected.  Instead you'll most likely see a blank screen.  This may vary on some TVs.  The included remote will wake up the device which is fine.  Additionally this can be done on any mobile device using the Amazon app.  Highly recommended for blaze subscribers that have comcast or other cable companies that don't offer the program.", "verified": true, "helpfulness": "0/0", "author": "jason peffers"}, {"rating": 3.0, "review": "Had high hopes. Still can't get device to pair with smartphones or tablet. Bought for when I travel & use in guest room.  I like Amazon prime which I have access with my smart tv. Might return stick. Haven't decided.", "verified": true, "helpfulness": "0/0", "author": "lotsakids \"call me mom\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Cynthia swan"}]