[{"rating": 5.0, "review": "Super easy to install..... Great access to many different apps or amazon TV/movies, Netflix etc. I cancelled my cable!", "verified": true, "helpfulness": "0/0", "author": "Ananda Willett"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "Jan Foy"}, {"rating": 5.0, "review": "nice.", "verified": true, "helpfulness": "0/0", "author": "cove"}, {"rating": 4.0, "review": "Makes my stupid tv a smart tv.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Easy Setup.  Does what it was supposed to do. Does what I expected it to do.", "verified": true, "helpfulness": "0/0", "author": "patell"}, {"rating": 4.0, "review": "The Amazon fire stick is a huge improvement for streaming Amazon prime video and movies over the internet.  The ability to search and identify Amazon content with the fire stick is much better than the interface on our older \"smart TV\", and the interface is also faster and more reliable, since we can use a 5 ghz Wi-Fi connection which is about twice as fast as the standard 2.4 ghz Wi-Fi connection to our main TV set.  Moreover, it supports more content than our smart TV allowed, and I am able to stream ESPN and ESPN2 sports content by way of our Sling TV subscription.  However, the NETFLIX channel interface is subpar, so we use a computer directly connected to the TV set to stream Netflix movies and TV shows, rather than the fire stick, for this data source.  (Hence, the four star review instead of five stars.)", "verified": true, "helpfulness": "0/0", "author": "Anthony W."}, {"rating": 4.0, "review": "For the price of the fire stick in the ease ability of moving it from TV to TV for an hour and tethering it off of my phone and it doesn't seem to drain my seven gigabytes too much and all the movies seem to be relatively new and everything is crystal clear so far so good", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Keith J WAGNER"}, {"rating": 5.0, "review": "Love it. Easy to use. I was concerned about \"buffering\" issues but there are none. So happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy set up & very easy operation. If you can maneuver through the regular Amazon site then you can easily fumble your way through the fire stick. Also there is an app for your phone which you can control the stick.", "verified": true, "helpfulness": "0/0", "author": "chris"}]