[{"rating": 4.0, "review": "It's a great device you have an amazing internet connection but if your like most of us that doesn't happen. So it stops all the time if your watching a movie or you have to let it load for longer then your movie is.", "verified": true, "helpfulness": "0/0", "author": "christina clendening"}, {"rating": 5.0, "review": "so far so good, setup was easy and my amazon content loads very quick on this device.  Nice to be able to watch games on the watch espn app, just waiting for hbo to go and to be able to use in hotels which is coming and it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Sean M"}, {"rating": 4.0, "review": "I like the stick. But operating it is by trial effort and guess work. You have to figure out by yourself how to get it To dc what you need it to do. Those books for sale are mostly useless. Be careful what you purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Cassandra\""}, {"rating": 1.0, "review": "Pointless , you have to pay for everything you wants to watch, only good for netflix and you tube.", "verified": true, "helpfulness": "1/2", "author": "Jean Senat"}, {"rating": 5.0, "review": "If you can keep your internet access and have a good digital antenna, you may consider canceling your cable, it's that good. The operation, picture and sound quality is excellent as is typical with all Amazon products. But one of the coolest things about, when I got logged on as me, it had access to EVERY cd I have ever ordered from amazon. Very impressive product.", "verified": true, "helpfulness": "0/0", "author": "cajunjason"}, {"rating": 3.0, "review": "I found that it cut out half way into a movie, I had to turn my TV off and back on to finish watching the movie.  I tried the stick for a week before returning it to Best Buy and purchasing the Apple TV.  I find it works much nicer, easier to navigate, can watch movies without having any buffering (*like the chromcast) or cutting out like the stick... and more I can listen to my iTunes on my surround sound! :)  Hope the stick works for you better than it did me!", "verified": true, "helpfulness": "0/0", "author": "Lori A. Witkop"}, {"rating": 4.0, "review": "Nice performance for the price", "verified": true, "helpfulness": "0/0", "author": "Judaco"}, {"rating": 5.0, "review": "It works great. The hand control is a bit too cheap but it does work well.", "verified": true, "helpfulness": "0/0", "author": "Richard G. Snell"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is really great! The way it handles Amazon content is fantastic. It pre-loads the content in your watch lists so that no buffering is necessary. This is a life saver on slow DSL. The third party apps are great too but the Amazon Content definitely shines the brightest! This is the perfect streaming accessory for almost everyone, and a game changer for those who subscribe to Amazon prime. I would rather watch on this Fire TV than my Apple TV, XBOX One, or Macbook. It handles content brilliantly.", "verified": true, "helpfulness": "0/0", "author": "Suzannah Davis"}, {"rating": 4.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "dolly m mitchusson"}]