[{"rating": 3.0, "review": "We like the way it works with one major disappointment on the commercial there is no illusions of the fact it has to be plugged in it simply looks like it is just the stick in your TV that limits where you can use it and that was very disappointing", "verified": true, "helpfulness": "0/0", "author": "Becky Byrd"}, {"rating": 1.0, "review": "The Fire TV Stick is junk. Same problem as many others; the connection drops constantly. We haven't been able to watch a single movie. The router is a foot away from the stick. Tried another HDMI port, rebooting, even went back to factory defaults and set it up again.  The WIFI TV and the WIFI DVD player stream perfectly and never lose a connection. I love shopping at amazon but I don't plan to buy any more of their electronics.", "verified": true, "helpfulness": "1/1", "author": "gofish"}, {"rating": 5.0, "review": "So easy to use. But you must have a power outlet or extension cord within 2 feet. It's the same as a Playstation except no DVD. Great piece of electronic s.", "verified": true, "helpfulness": "0/0", "author": "Michael Gray"}, {"rating": 5.0, "review": "Love this device! Once the setup is complete it is so easy to move from room to room.", "verified": true, "helpfulness": "0/0", "author": "Amanda K."}, {"rating": 5.0, "review": "Awesome!!!!!", "verified": true, "helpfulness": "0/0", "author": "SCHEROD STEWART"}, {"rating": 5.0, "review": "I LOVE the FireStick. I does exactly what I need.. and I can watch Amazon Prime Videos, and my HuluPlus account .. thank you Amazon for a GREAT product!", "verified": true, "helpfulness": "0/0", "author": "Joanne LeBlanc"}, {"rating": 5.0, "review": "Very happy with this purchase. Figured I would try Prime for a year and see how we like it. So far we are loving it! While there is not quite as much content offered as Netflix, there is an excellent selection. I enjoy doing business with Amazon, and dislike Netflix after their company and services restructure.  The on-screen interface is much easier to navigate than Netflix as well.", "verified": true, "helpfulness": "0/0", "author": "Bon"}, {"rating": 5.0, "review": "Worked as expected.  The remote is handy, much better than using a cell phone.", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 4.0, "review": "Good product, much better then the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Charles Spiteri"}, {"rating": 5.0, "review": "Love love love this stick !  Great picture quality, vast array of things to watch and what a bargain!", "verified": true, "helpfulness": "0/0", "author": "Ravyn"}]