[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Christine H."}, {"rating": 5.0, "review": "Excellent products. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Toan Vu"}, {"rating": 5.0, "review": "very easy to configure and use. great product!!", "verified": true, "helpfulness": "0/0", "author": "Louis D'angelo"}, {"rating": 5.0, "review": "We love, love, love our Fire TV Stick!!!  So easy to set up and so many choices!", "verified": true, "helpfulness": "0/0", "author": "Malen Braswell"}, {"rating": 4.0, "review": "So far, so good. I really have to dig into it more to get the most out of it, though.", "verified": true, "helpfulness": "0/0", "author": "gearfreak"}, {"rating": 5.0, "review": "My husband and I have been using a Wii to stream Amazon/Hulu/Netflix, and we are thrilled to have replaced it with this FireStick. It loads right up, and since it never actually turns off, there's no wait time! Usually it doesn't need to buffer, but even when it does, the buffer is quick.I do want to mention that we have had a few problems with it 'freezing' while we are trying to find something to watch. It has only happened twice, and never during a show, just when we are on the home screen. Our solution is to unplug it completely to reset- and it's back to business as usual.Since we don't have cable, and buy most of our television from Prime (and watch the free stuff!), it's nice having this quick access.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "Awesome product.......A++++++", "verified": true, "helpfulness": "0/0", "author": "milan"}, {"rating": 5.0, "review": "I know I'm going to love this more when I get the Amazon Fire Stick User Guide I just ordered (getting the most out of your Fire Stick).  Just got this about one week ago but have already watched a world-class movie (The Tudors - Episode 1) and it sure beats watching the Amazon Prime Movies on my HP Laptop.", "verified": true, "helpfulness": "0/0", "author": "Carol Hastings"}, {"rating": 5.0, "review": "this works very well", "verified": true, "helpfulness": "0/0", "author": "MichelleCM"}, {"rating": 5.0, "review": "For $39 this is the best piece of entertainment you can find.", "verified": true, "helpfulness": "0/0", "author": "Stephanie A."}]