[{"rating": 3.0, "review": "Generally satisfaction was ok mainly concern on prime. Every other movie I search is not available", "verified": true, "helpfulness": "0/0", "author": "willians"}, {"rating": 4.0, "review": "Seems to be very good and easy to use.", "verified": true, "helpfulness": "0/0", "author": "james gunsallus"}, {"rating": 5.0, "review": "it works great. its easy, its simple. i have no complaints.", "verified": true, "helpfulness": "0/0", "author": "DenGar"}, {"rating": 5.0, "review": "Love it so easy to use and set up!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Hall"}, {"rating": 5.0, "review": "It's incredibly easy to install.  Amazon walked us through the process.  The only struggle is streaming ESPN.  Our cable provider did not make that easy and I don't have it installed.  I don't blame Amazon for this though.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Heidi Sturm"}, {"rating": 5.0, "review": "I Love the Amazon Fire TV Stick. My husband labeled it \"Mommy's new toy\":-)  I have no previous experience with Roku or Hulu, or any other similar product so I don't really have anything to compare it to...  I do know that I love the concept of having my photos, movies, music, t.v. programs, etc.  in one convenient place!  Who knew that years ago when I first subscribed to Amazon Prime for the 2-day shipping, that I would end up loving all of these \"extras\"?!  I put the free app on my phone for voice control and that was super easy & cool to use too!  We haven't tried gaming yet, but think that will be a fun family activity (since our other video games are in the kids' area).", "verified": true, "helpfulness": "0/0", "author": "readingsanity"}, {"rating": 3.0, "review": "Bought this to use plex and Xmbc and the overall results are slightly disappointing. The Plex ap doesn't load recommended or new videos nor does it have 5.1 sound. This should be an easy fix with an update but from what I've read in the firestick forums, an update might not ever happened. Please update this! I know the roku versions has 5.1 sound and displays correctly for plex.", "verified": false, "helpfulness": "0/0", "author": "David Tran"}, {"rating": 4.0, "review": "I really enjoy the speed of the Amazon Fire TV stick.  It is much faster than my Roku LT. I have a 42\" 2012 Samsung Plasma TV. The USB port on this TV was not powerful enough to run the Fire TV Stick despite it being powerful enough to run my Chromecast. A bit disappointed that I had to plug it into an outlet using the supplied power block (I like to keep all my wires hidden).  I discovered this issue while the Fire Stick was going through its initial updates/setup. It restarted itself repeatedly, maybe 15-20 times. I first thought it was part of the update process but soon realized it was due to insufficient USB power coming from the TV.  I also have a 27\" 2014 LED Toshiba TV.  This TV's USB DID provide sufficient power to run the Fire TV Stick. I am unsure what the Mah output are for these TVs.My wife and I use the Fire Stick solely for Netflix.  She prefers the Roku menu layout over the Fire. I believe it's a bit more straight forward on the Roku, plus the Fire is heavily designed for the Amazon Prime user which we are not.Final Take:  For the person who mainly only wants something for Netflix and also prefers a dedicated remote, I would highly recommend this product!  If you are OK with using your Android/iOS device as a remote I would go with the Chromecast which requires less power to operate and can sometimes be found at the Big Box stores for around $25. Hope this helps.", "verified": true, "helpfulness": "0/0", "author": "Brandon Rumker"}, {"rating": 4.0, "review": "Very cool product, it works well.  I like that it has more streaming options than my Google Chromecast, but the remote isn't nearly as effective.  I would prefer a better phone interface, like the Chromecast, but overall I am very satisfied with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 5.0, "review": "WAY cool. Super easy way to watch all my favorite Prime movies! ALSO since my music is in there we can officially take our speaker out of the living room and put it in the bedroom - Amazon MP3 is my only source of music playing so this was super handy.The only thing I wish was different was that I had the option to filter by \"song\" on the music - I can't seem to find any of my Prime songs through the fire stick.", "verified": true, "helpfulness": "0/0", "author": "asunnysnowman"}]