[{"rating": 5.0, "review": "Love it, Thank you Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Rivera"}, {"rating": 1.0, "review": "Chrome cast still wins", "verified": true, "helpfulness": "1/6", "author": "jake"}, {"rating": 5.0, "review": "I ordered this when Amazon offered the $19.99. I planned on using this in my bedroom but for some reason it would not work with my bedroom television (maybe because it is a 2008 Model). I also have a Fire TV I had planned on using in the living room. Long story short I tried the stick in the living room plugged into my home theater receiver and it works perfectly. I moved the Fire TV to the bedroom and I really cannot tell a difference it the two. My Fire TV stick has been very fast, smooth and responsive. I use it mostly for Amazon instant video, Netflix, watchespn, and I have set up a plex server and use the plex app to access it and all have worked smoothly with very good picture and sound. I thought there may be a noticeable difference in performance between the Fire TV and the Stick but I have not noticed any. I am very satisfied with both and would recommend either to anyone interested.", "verified": true, "helpfulness": "0/0", "author": "15T3FN1"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "carolyn"}, {"rating": 5.0, "review": "If you already have an Amazon Prime account, you need to get this for all the free entertainment. It pays for itself. If you don't get one, you are wasting one of the advantages of having a Prime account.The device came with everything I needed to set it up and pre-loaded with my Prime account information (how do they do that!?!), so all I did was plug it into the USB port on my TV. Follow the on-screen instructions to connect to your WiFi (or you can plug it directly into your router), and you are done. The controls and menus are simple and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "DN"}, {"rating": 5.0, "review": "I have had the Fire Stick for a 2 month now and I have to say that is quite easy to setup and navigate.  Really the only complaint is that you can not set up separate user accounts for watch list and the like. Other than that it has been a nice addition", "verified": true, "helpfulness": "0/0", "author": "GW"}, {"rating": 5.0, "review": "If you are an Amazon Prime member this is a must have!  Seriously I am so impressed with this device and all it offers!  Way to go Amazon!!  My new favorite toy.", "verified": true, "helpfulness": "0/0", "author": "AR Stringer"}, {"rating": 5.0, "review": "Had the Chromecast-could never get it to work-The fire TV stick really was as easy as 1.2.3. and is all the entertainment I will ever need and more. Amazon prime is well worth the fee.", "verified": true, "helpfulness": "0/0", "author": "Pepper Haning"}, {"rating": 4.0, "review": "I love the Fire Stick.  I would have given 5 stars but for the design of the power input.  It's placed about mid way in the Fire Stick and as such makes you use the extension thus making the Fire Stick protrude out.  If they had the input closer to the end you would not need the extension.  A minor thing, but you have to use the Fire Stick before you can get to the place for the video explaining how to use it.  I would suggest in the future the first thing upon installing is the video.  I figured it out but would have been easier with the video first.", "verified": true, "helpfulness": "0/0", "author": "Duane E. Webb"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome.", "verified": true, "helpfulness": "0/0", "author": "Kenneth S Payne"}]