[{"rating": 5.0, "review": "I love my amazon firestick. The firestick is a great entry level streaming device its easy to use for anyone in the household", "verified": false, "helpfulness": "0/0", "author": "Koney D Loso"}, {"rating": 3.0, "review": "It is nice to have a smart TV now (thanks to the fire stick), but the jury is still out on the service.I find that the written text on the TV is too small to read.  I have to get up and stand in front of the TV to read the movie description.  Honesly - everything on the TV while using the fire stick is too small.  It would be nice if Amazon would make the user interface bigger.  For example:  look at the rolling text on the news channels - bold and large.  I don't have bad eyes either.I was hoping to do away with cable TV, but it doesn't appear that that is going to happen.  Sure I can get broadcast channels with an antenna and old movies through Amazon.  But what about current movies?  What about the cable channels I like (SCIFI, BBCAM, History, TLC, cable news)?", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 3.0, "review": "I was able to use it a few times until it stopped working. The error would say signal strength is weak? I tried to reconnect it a few times and won't just go through the whole setup. I have a very good wi-fi in my house. BTW, it's refurbished.", "verified": true, "helpfulness": "0/0", "author": "Jinky Littlefield"}, {"rating": 4.0, "review": "Enjoy, don't get time to use as much as I'd like", "verified": false, "helpfulness": "0/0", "author": "Annita Orourke"}, {"rating": 5.0, "review": "I have been going back and forth on buying a streaming stick for about a year now. My hesitation has been the negativity that I have heard about it; many people complain about how hard they are to navigate and set up. I finally pulled the trigger and purchased the amazon fire stick due to the amount of apps you you download. I am ecstatic about this purchase, not only is is extremely fast and easy to set up, navigating through it is a cinch! It took me a matter of minutes to set up and it prompts you on how to use the device before you are able to full use it, making it a seamless transition from start to finish.The quality is fabulous and the connection speed is even better. I have recommended this to every family member and friend who is in the market for a streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Neva Graham"}, {"rating": 4.0, "review": "Really like this.  Easy to install and use.  Great selection of apps that are usually free.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Easy hook up and was a fast delivery", "verified": true, "helpfulness": "0/0", "author": "Candace Lawrence"}, {"rating": 5.0, "review": "My wife and I got this for our bedroom TV to gain access to Netflix and Amazon Prime without having extra clutter with a separate internet enabled device. Works great with no headache during set up! Just plug it in and go!Easy interface to work with and the remote has a very simple and intuitive design. No complaints whatsoever!", "verified": true, "helpfulness": "0/0", "author": "MTucker"}, {"rating": 1.0, "review": "I dont even use this anymore.  I purchased thinking it was going to be faster than my Roku.  Instead I constantly get a 'network error' that will not allow the device to connect to wifi, rendering the device useless.  My Roku, ps3, and apple TV all have no problems with connecting to wifi.  Additionally, when it actually decides to work, it scrolls past several movies, episodes, youtube videos with one click.  This results in a lot of time wasted going back to see what it had skipped over.", "verified": true, "helpfulness": "2/3", "author": "jel33"}, {"rating": 4.0, "review": "The Amazon Fire TV Stick has far exceeded my expectations in most aspects. I purchased the Fire Stick when it was on sale for $19/99. Set up was quick and easy, and I was able to begin using the device right away. There are a few problems that still need to be worked out. For example, I am unable to use display mirroring most of the time. When it does work, it is slow and often \"cuts out.\" My husband and I usually use the Fire TV Stick for watching Netflix or movies on Amazon Prime, and the device works beautifully for that purpose!", "verified": true, "helpfulness": "0/0", "author": "Brooke"}]