[{"rating": 5.0, "review": "I'm done with cable tv when my current contract runs out.  With this and Amazon prime I have more than I can watch.  I can get all the main networks with rabbit ears so that's enough sports ...which is all that's missing with Fire TV.  This is also idiot proof.  My six year old grandson figured it out in two seconds.", "verified": true, "helpfulness": "1/1", "author": "M. Riley"}, {"rating": 5.0, "review": "Worked very well for my wife while she was in a physical rehab center with limited channels on tv but excellent wifi...", "verified": true, "helpfulness": "0/0", "author": "Roger"}, {"rating": 5.0, "review": "Exellent product I will recomed it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Anyelina"}, {"rating": 4.0, "review": "Fire TV Stick is great. My only complaint is...After searching for a while for an extra power supply on Amazon.com with no luck. I contacted Amazon to find out if I could purchase another power supply for my TV stick.I want to be able to use it on two TVs. The CS rep on the phone was very confused at first as to what I was asking. Then when he finally understood what I was asking he directed me to the USB cable to power the TV stick.  Both of my TVs are older and do not have a powered USB port to use as a secondary power source. I explained that to him and then at that point he could not help me. I hope that Amazon makes the power supply that comes with the Fire TV stick available as a separate item.", "verified": true, "helpfulness": "0/0", "author": "REC6 \"REC\""}, {"rating": 5.0, "review": "This fire stick does what it basically advertises. I didn't see the need to get the Fire TV. It's pretty fast and it's predominantly used for my bedroom TV. I don't have cable so this thing is all ready to go when I turn the TV on. It doesn't take forever to quit or load a new app which is great because I'm pretty indecisive whether I want to watch Netflix or Hulu. It moves faster compared to switching an app on the Xbox 360. I don't really use it for gaming. If you just need streaming then this is the product for you.", "verified": true, "helpfulness": "0/0", "author": "Lina"}, {"rating": 2.0, "review": "I was really excited to buy the Amazon Fire Stick and finally get a chance to use it. So far, it's Meh...it's constantly buffering and that really frustrates me. Especially when I can go right to my iPhone and just watch the same exact thing without the buffering. I really have only tried it twice since I bought it last month. I just didn't want to deal with the buffering and frustration that I dealt with the first two times I used it. We have the highest speed internet that we can possible purchase since my son is into gaming. So, I know it's not our internet connection. He thinks it might have to be near the router to pick up the wifi signal better but honestly, I thought that this item would have compensated for those kinds of issues. So far...I am not impressed at all and seriously thinking about returning this and getting a smart tv instead. Much less of a hassle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Prime User"}, {"rating": 5.0, "review": "I love being able to stream video and games to my tv without having to hook it up to my computer.  When I ordered the stick I also received a free month of Prime and got to check out all the movies and tv shows that I can watch for free.  I am officially addicted and you can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Rambling Holly"}, {"rating": 4.0, "review": "It's fast n cool needs for free games and apps", "verified": true, "helpfulness": "0/0", "author": "William Thomas"}, {"rating": 3.0, "review": "I do t like that it doesn't have a power button.  I have to unplug it to shut it off. it buffers more than the fire tv.  If everyone is running on wifi it slows and buffers more so I have to unplug the units because they bog down the wifi.  If the had a power switch it would me much better.I like the idea but it is slower han the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good so far", "verified": true, "helpfulness": "0/0", "author": "archie santos-diaz"}]