[{"rating": 5.0, "review": "I am so glad I bought this, it amazing! I can watch movies as well as fitness and sports apps", "verified": true, "helpfulness": "0/0", "author": "Candita"}, {"rating": 5.0, "review": "Works as advertised easy to install. Still checking out the features.", "verified": true, "helpfulness": "0/0", "author": "lkell"}, {"rating": 1.0, "review": "I got this as a gift, the remote does not work. i click on it once and takes it twice. Netflix on fire stick get stuck all the time. if i cast the same from the computer using chrome cast it works flawlessly. its cant mirror my laptop screen like chrome cast. its was a mistake. i should have just waited for chrome cast 2.0. the only advantage is when and if it works is the remote.when getting it i thought i can get rid of my chrome cast. but chrome cast is more useful than this stick.", "verified": true, "helpfulness": "2/3", "author": "Sa"}, {"rating": 1.0, "review": "Bought 2 of these for $19 each. Was going ti give one for a gift. Thats not happening. Im returning both. The first connection was fine and took about 10 minuted to pair and find my wifi. Im using the supplied power adapter. It paired once and has never been able to find my network connection since then. Ive tried 2 different wifi connections both with great signals and well within range. This fire stick now says it can not connect to any of my wifi. It can find my wifi but it wont connect. If it cant connect to 2 of my wifis then there is definately a problem with the fire stick. I refuse to give the other fire stick as gift because I dont want to give my friend a piece of trash for xmas. First time Ive given a bad review from anything on Amazon. This is unacceptable.", "verified": true, "helpfulness": "1/3", "author": "Morehead"}, {"rating": 3.0, "review": "Hooked it up in 5 minutes..Good quality..Does not connect to 5Ghz Wi-Fi...only supports 2.4GUpdate:Works with 5GHz WiFi with the current FW.Compatibility with LG UB9200 65\" UltraHD TV.I have connected the Amazon Fire TV stick to one of the HDMI ports of my 65\" LG UltraHD TV UB9200 . The SMPLINK (a.k.a HDMI CEC) feature of the TV/fire TV stick whereby you can use the TV's remote to control Fire TV works with the Fire TV stick with one major Flaw. For the HDMI CEC to get activated, you need to power cycle the fire TV stick every time the TV is turned OFF and the then turned back ON.So if you are watching the Fire TV and then you turn off the TV and then turn it back on again, the CEC feature stops working. To make it work again, you will need to power cycle the fire TV stick too by disconnecting the usb charging adapter of the Fire TV and connecting it back again.This is a major Flaw and Fire TV stick needs to fix this,.", "verified": true, "helpfulness": "0/0", "author": "Kishore Karthikeyan"}, {"rating": 5.0, "review": "Great product! Easy installation and fun to use for all ages.", "verified": true, "helpfulness": "1/1", "author": "Avis"}, {"rating": 2.0, "review": "I really wanted to like the Fire TV stick.  I had no issues getting it connected or wifi dropouts like some of the other reviewers.  My issue is that the audio on the device is slightly out of sync with the video.  I've tried every audio setting on the device and also on my TV.  If I turn my TV on and off while a video is loaded the audio will correct itself.  As soon as I load a new video the audio will be off again.  This is true for Amazon Prime video, Netflix, or Flixter.  My DVD player that also plays Netflix and my Chromcast both have no issues on my TV.  I hope that there will be an update that makes it usable but as of now I'm very disappointed.", "verified": true, "helpfulness": "0/1", "author": "B. Emett"}, {"rating": 4.0, "review": "It's great.  Only wish I could see all movies instead of a wait list or renting.you can't stop a child from wanting everythingIn candy land.  But it's great none the lest.", "verified": true, "helpfulness": "0/0", "author": "Maureen"}, {"rating": 1.0, "review": "I bought it for our upstairs Viewsonic tv but it was incompatible and we got the HCDP errors many others have reported. It does work (for 2 days so far) on our Vizio family room tv. I then moved our old Roku upstairs And it works fine. Hopefully amazon will eventually fix all the issues with software updates and if so I will redo this review.", "verified": true, "helpfulness": "0/2", "author": "Scoutmaster"}, {"rating": 1.0, "review": "The stick seems to work well and is responsive. I like the remote control, the onscreen layout is very clunky and weak compared to the Roku 3. Channels, apps, and content are scarce and lacking. It does have a very limited selection of apps but does have Netflix and Hulu. lacking HBO GO and other channels. you have to scroll to the left and right through each app and this is annoying and can take time. would also be nice if you use the USB output from your TV to power the stick but it requires you to use the included ac adapter. Overall the Fire TV stick is okay for the money. we will have to see long term how the content and interface progresses. if you are looking for more content, polished interface and more options for steaming your own media go with a Roku 3 or chromechast.", "verified": true, "helpfulness": "0/2", "author": "rick alvarado"}]