[{"rating": 2.0, "review": "The Fire TV Stick continually \"drops\" the wifi connection.  After repeated setups, nothing has improved.  Bad product.", "verified": true, "helpfulness": "1/1", "author": "AB"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Todd A. Whaley"}, {"rating": 3.0, "review": "I'm not impressed. Way to much lagging!", "verified": true, "helpfulness": "0/0", "author": "John McNally"}, {"rating": 5.0, "review": "I travel a lot and this is the only streaming device I've found that will work in a hotel", "verified": true, "helpfulness": "0/0", "author": "Patty"}, {"rating": 5.0, "review": "Great, fast dongle to watch TV. About the same cost as Netflix, but the free prime shipping really makes prime worth it", "verified": true, "helpfulness": "0/0", "author": "B. King"}, {"rating": 5.0, "review": "Works well and as advertised.", "verified": true, "helpfulness": "0/0", "author": "J. C. Goble \"82abn\""}, {"rating": 2.0, "review": "I just threw the darn thing in the trash. I've been using Roku for years, and I like the interface, especially for the MLB.com app. I put a TV out on the deck and thought I'd watch a little baseball via Wi-Fi with it, but the fire stick interface with MLB.com is maddening. It's hard to select a game, choose where to start watching the game, and imprecise in advancing through an archived game.  It works OK with Netflix and Prime, In general with fire stick, I find it difficult to know where I am on any given screen. I did fish it back out of the trash, but haven't used it since.", "verified": true, "helpfulness": "0/0", "author": "Scubanut1000"}, {"rating": 5.0, "review": "Awesome product.", "verified": true, "helpfulness": "0/0", "author": "ruddy r barrenos"}, {"rating": 5.0, "review": "We replaced our WII with the Fire TV Stick and what a difference.  No more connection delays for Amazon Prime and a slight delay for Netflex.", "verified": true, "helpfulness": "0/0", "author": "ramon haderlie"}, {"rating": 5.0, "review": "gettin rid of cable thank you to help w/that", "verified": true, "helpfulness": "0/0", "author": "tim garcia"}]