[{"rating": 4.0, "review": "UI is lacking, but worth the $20 I paid for it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Miller"}, {"rating": 4.0, "review": "So far im happy with the fire stick.  Works smooth and fast, I am hoping that amazon will come out with hbo go and starz play, then I can have all of my apps in one place.", "verified": true, "helpfulness": "0/0", "author": "jason epton"}, {"rating": 5.0, "review": "The Fire TV Stick is my  first experience with a streaming device. When I first set it up , I binge watched one of my favorite TV programs. It worked flawlessly. Then I tried to watch a movie and ran into problems. The device kept giving me an error message. I've actually abandoned using the device until I can approach the issue without frustration. If I can resolve the problem, I would gladly change my rating. I chose the Fire Stick because of the low cost (compared to other devices) and because I am an Amazon Prime member. I hope that wasn't a mistake on my part. (Update 1/5) There must have been a problem with my service, because I updated my Wi-Fi and the Fire Stick performs wonderfully. I look forward to years of enjoyment", "verified": true, "helpfulness": "1/1", "author": "kenneth"}, {"rating": 5.0, "review": "i purchased this to watch netflix and amazon prime. It was soooo easy to set up. Everything you need is in the little box the device comes in after ten minutes i was watching netflix,  the video is so clean. I downloaded a free game just to test it. It worked very well. I would say this is a wonderful product. I will probably buy a second one so I don't have to keep unplugging it to use in a different room.", "verified": true, "helpfulness": "0/0", "author": "wanda hallmon"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Michael Perez"}, {"rating": 2.0, "review": "Update 5/29/15 -  I downgraded my review from 4 stars to 2 because of a few reasons:  1) searching.  You cannot select free vs pay when you search.  You get every thing.  2)  Display of search results.  Cannot tell which listings are free or which cost money.A real nice enhancement is x-ray.  you can see who is in each screen.-----Do Not purchase unless you have Amazon PrimeI purchased as a gift to my kid.  She doesn't have prime and found it somewhat useless.  While you can install netflix and a few others, this unit is \"amazon\" centric.  So we traded the amazon file stick for an older roku.  The Roku worked well for people with out prime.The unit is very easy to setup.  The remote is small, plain and functional.  They have an android app that control the unit.  I found the app useless.  It crashed a lot.  Other times it could not find the fire stick.", "verified": true, "helpfulness": "0/0", "author": "bc"}, {"rating": 5.0, "review": "Simplicity of installion, the large selection of movies and the cost of the Fire Stick make this purchase and exceptional value.", "verified": true, "helpfulness": "0/0", "author": "Bill Stilwell"}, {"rating": 1.0, "review": "I really wanted to like this. I already had a Chromecast and was looking forward to the Amazon Fire TV stick. The Fire stick is definitely faster than the Chromcast and I absolutely love the utility of the remote, but the pluses end there. The Fire stick repeatedly freezes to the point where you have to unplug the power cord and plug it back in again in order to fix it. Also, it won't hold a constant internet connection. So, when you are watching something on say Netflix or Plex, every 10 mins or so, it has to stop to buffer.  Overall, I was very disappointed with the Fire TV stick.", "verified": true, "helpfulness": "1/1", "author": "DMC"}, {"rating": 4.0, "review": "I am starting to learn how to play with this new toySo far so good!", "verified": true, "helpfulness": "0/0", "author": "Fuad Ziai"}, {"rating": 5.0, "review": "Love love love the fire stick! Prior to this, I was hauling my laptop around unhooking the hdmi cord from the dvr box to my computer but now there is no need to do that! Ours came already initiated with our credentials so setup took no time and we were watching tv in seconds!", "verified": true, "helpfulness": "0/0", "author": "Ashley"}]