[{"rating": 5.0, "review": "Awesome product. My only problem is the netflix app. Not a fan of it. Everything else Is really cool.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Exceeds expectations. Love the game apps.", "verified": false, "helpfulness": "0/0", "author": "patti b"}, {"rating": 5.0, "review": "Great product for a spare room, or a room that is not used as frequently.  I don't care about the remote and voice command options - it functions just as well as a fire tv.  Paired with Amazon Prime and you can really see the benefit of having a fire tv, or a fire tv stick.  Works well just like the fire tv.  For some, read other people in this house that are techies..., they really like the voice command.  They don't actually use it everyday but they like the option to use it.  Seems like a minor point given the difference in price.  Would be good for a child's room too.  I would use it in every room, but again some may like the voice command and it would be worth it to spend the extra money so I mention that it would be good for a spare room.  We've tested both remotes, and they appear to work with both the stick and the regular fire tv.", "verified": true, "helpfulness": "0/0", "author": "Thrifty shopper"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "JDW"}, {"rating": 1.0, "review": "I am writing this under my wife's account. I picked it because our Roku failed in less than a year.After about the first two months we had to have it replaced. Less than a few months it is barely working now. I am more than displeased. I would not purchase this unit again. I would stay away.Having tried two different brands I do not know where to turn too.", "verified": true, "helpfulness": "0/0", "author": "Roslyn Carrier-Brault"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is more than I expected.  It works very well.  I wish more \"free\" movies and games were available, but that have nothing to do with the Fire Stick itself.  A great product, with room for improvement.  Looking forward to those enhancements!", "verified": true, "helpfulness": "0/0", "author": "Larry McRee Peden"}, {"rating": 2.0, "review": "It would have been much more informative to include the fact that it does not include internet access like other 'sticks' I have.", "verified": true, "helpfulness": "0/0", "author": "Judi Eaton"}, {"rating": 2.0, "review": "Ditto the experience of other users.  This thing is great when it works, but it tends to freeze or lose its network connection a lot, even though the signal strength is good.  The only remedy is to then unplug the device from its power supply, plug it back in, and let it reboot.  Then things works fine again.", "verified": true, "helpfulness": "1/1", "author": "BKini"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Timson Leung"}, {"rating": 5.0, "review": "It Is GREAT!! I bought 4 and those that I have given it to loves it as I do.", "verified": true, "helpfulness": "0/0", "author": "Anna Diehl"}]