[{"rating": 5.0, "review": "Great little device to open up viewing options.", "verified": true, "helpfulness": "0/0", "author": "Charles R Smith"}, {"rating": 4.0, "review": "Amazon Fire TV stick easy to use", "verified": true, "helpfulness": "0/0", "author": "Maryellen"}, {"rating": 5.0, "review": "Very neat little gadget! Watching on Kindle fire is cool but this makes it all the more wonderful!!!!!", "verified": true, "helpfulness": "0/0", "author": "Terri M. Blocker"}, {"rating": 5.0, "review": "Awesome awesome", "verified": true, "helpfulness": "0/0", "author": "Jj"}, {"rating": 5.0, "review": "Best HD media streamer stick.", "verified": true, "helpfulness": "0/0", "author": "Vizzo"}, {"rating": 5.0, "review": "Much better then Netflix,", "verified": true, "helpfulness": "0/0", "author": "Donald R. Slagle"}, {"rating": 2.0, "review": "This system is not what is is raved to be. It constantly goes out and has a very weak signal with the wifi. We tried everything, moving the modem, removing items that may have blocking the signal but nothing worked. I contacted customer service and they were helpful. However they gave me many solutions when i really wanted a refund.", "verified": true, "helpfulness": "0/0", "author": "Peter S."}, {"rating": 5.0, "review": "This product is exactly as advertised and more! Easy to install and operate. Choice of programs is excellent. We have Google TV, but Amazon Fire TV surpasses it in available free channels and subscriptions. It was easy to activate Netflix, Hulu, HBO Go and of course Amazon Prime. I compared it to other TV sticks available and this has the most features. I love the idea I can take it with me to hotels and watch my programs. I would recommend it! We have relatively slow internet connection as cable is not available where we live, but viewing movies and serials is smooth and uninterrupted. Kudos to Amazon for giving us Fire TV! I would recommend adding voice activated remote, but the remote that comes with the stick is easy to use as well.", "verified": true, "helpfulness": "0/0", "author": "Martha Lacko"}, {"rating": 5.0, "review": "The fire stick is easy to use, plug and play. I don't have to download to my kindle and watch, I can just watch. If your a prime member this is the way to go.", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "Works great! Tons of movies, music, tv series to choose from...Very happy customer.", "verified": true, "helpfulness": "0/0", "author": "DONA L BOUSE"}]