[{"rating": 2.0, "review": "Worked well for a week or two. Then the Netflix app stopped working.  Then Hulu stopped loading.. or when it did it would freeze every 20 seconds. Only works well for buying/renting/watching Amazon material. Which is great of you have another way to watch your other avenues of entertainment.", "verified": true, "helpfulness": "0/0", "author": "M. Ambrose \"MasterMom\""}, {"rating": 5.0, "review": "I love it. It was easy to install and to use. the variety of programs and movies offered is awesome. My original reason to get it was because of the series Bosch. I am so glad there is going to be a season 2.", "verified": true, "helpfulness": "0/0", "author": "Carol J."}, {"rating": 4.0, "review": "Great option for streaming at a good price. Like the remote and the app options.", "verified": true, "helpfulness": "0/0", "author": "GrantM"}, {"rating": 3.0, "review": "Had the same problems with HDCP protected content that lots of other Fire TV Stick users have been having (\"HDCP unauthorized. Content Disabled\").  Much like some other users have reported, power cycling the stick *and the TV* did the trick.  But this is very inconvenient since the TV is flush to the wall and the power plug is behind the TV and very inaccessible.  But when it works, it works well.", "verified": true, "helpfulness": "0/0", "author": "Captain Dunsel"}, {"rating": 4.0, "review": "I am happy with the Fire TV Stick I purchased. It was easy to install and access my Netflix account; however, other offers seemed to require cable hookup or another additional service for more money. I specifically purchased the Stick to stop using cable and reduce my bills. Multiple service bills will just raise my bill to Comcast's price since I have to have internet to use any of them.", "verified": true, "helpfulness": "0/0", "author": "Kaye M. Brown"}, {"rating": 5.0, "review": "Best streaming device known to man!I love this sooooooo much. We use it daily and it is better than any Roku we have owned.", "verified": true, "helpfulness": "0/0", "author": "Lindsay"}, {"rating": 5.0, "review": "The Fire TV stick gives me access to good entertainment without needing cable or satellite.  Since I already subscribe to Prime it is basically free.I love it and use it daily. Oh and by the way now I am up to 3 Fire sticks.", "verified": true, "helpfulness": "0/0", "author": "sled \"winter lover\""}, {"rating": 2.0, "review": "Does not compare to apps available on other similar devices.", "verified": true, "helpfulness": "0/0", "author": "Cali_Angel01"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Madelyn"}, {"rating": 5.0, "review": "WOW!  I wish I had done this long ago.  It was so easy to get hooked up and started up right away.  Listened to my music and you can even see the lyrics printed out, which I loved!  Watched the second season first two episodes of Red Road and so enjoyed being able to watch two episodes back to back. The whole thing is amazing.  What a great concept!  If anyone is on the fence about this, jump on it!  The cost is minimal and the end result is so worth it!", "verified": true, "helpfulness": "0/0", "author": "Renee L. Still Day \"ojibwawife\""}]