[{"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/1", "author": "dk"}, {"rating": 5.0, "review": "Bought this on Prime Day with a deep discount.  Extremely easy connection and set-up and adds tons of access to a non-smart TV.  I'm on a 30-day trial Prime membership and the free Prime Instant Video sealed the deal.  I'll be buying a full membership for sure.We have a smart TV in the living room but this makes our second set so much more useful.  Navigation through Amazon and non-Amazon apps is easy enough.  A full keyboard would be nice for searching titles but at this price-point that's an unreasonable expectation.If I was a gamer, I'd look for a more high-end device.  This fits my needs nicely, for streaming video.", "verified": true, "helpfulness": "0/1", "author": "Mick"}, {"rating": 1.0, "review": "I have time to write this review while I restart my Fire TV stick for the third time in 10 minutes. It is tough to watch anything when the device drops the wireless network frequently. No matter what I do this keeps happening and Amazon has no solution.We have two Roku boxes that never fail. I would rather pay for a Roku than accept a free Fire TV Stick.", "verified": true, "helpfulness": "1/2", "author": "bwholst"}, {"rating": 5.0, "review": "Best ever investment", "verified": true, "helpfulness": "0/1", "author": "John E. Varga"}, {"rating": 4.0, "review": "I love it! The only downfall to me is how to get to music stations.", "verified": true, "helpfulness": "0/1", "author": "nurseynurse88"}, {"rating": 4.0, "review": "Very good.  A little bit slow once you add many apps.", "verified": true, "helpfulness": "0/0", "author": "Enmanuel"}, {"rating": 5.0, "review": "Works well.  The interface is intuitive and easy to use.  Let's you stream just about anything on the net and makes any TV with an HDMI input into a smart one.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 2.0, "review": "goes to sleep and won't start again unless I pull it and restart, says I have 500 coins I use to purchase plex, I then get notifications I didn't pay for it then it gets deactivated. I can't find a way to contact amazon customer service to find out what is going on...... hmmm can't connect bluetooth headphones..... I don't know may just send it back", "verified": true, "helpfulness": "0/1", "author": "bessary"}, {"rating": 5.0, "review": "Easy setup and a number of entertainment options.", "verified": true, "helpfulness": "0/1", "author": "pravin"}, {"rating": 4.0, "review": "Thanks to the Black Friday on July 15th I was able to get the Amazon Fire Stick for $24.99. Great price and speedy 2 day shipping. I love the firestick and the ability to get several apps, however I wish there was a way to get a better movie selection as well as purchase hbo,starz, etc. if you do not already have it included through your cable carrier. Overall great product.", "verified": true, "helpfulness": "0/1", "author": "Danielle"}]