[{"rating": 5.0, "review": "Hooks right up to TV. Joined network instantly. Makes any HD TV a Smart TV. The prime programmimg is excellent, with more movies I think than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Tile Tool Jim"}, {"rating": 5.0, "review": "Fire stick great product I wish in worked with movietube.com chrome cast does.", "verified": false, "helpfulness": "0/0", "author": "Alvin Lee"}, {"rating": 5.0, "review": "WOW!  If you have Amazon Prime, you HAVE to get this!  It opens up a whole new world of entertainment.  Can't believe we lived for so long without it!!", "verified": true, "helpfulness": "0/0", "author": "Alan L. Elliott"}, {"rating": 5.0, "review": "getting rid of staz and HBO  and soon as I can", "verified": true, "helpfulness": "0/0", "author": "bcole85202"}, {"rating": 5.0, "review": "Helping to save me money", "verified": true, "helpfulness": "0/0", "author": "lauren mattiace"}, {"rating": 5.0, "review": "Easy set up and performs as described......a bargain for the price!  Instantly turns a wired  HD tv into a wireless tv.", "verified": true, "helpfulness": "0/0", "author": "Erik s. anderson"}, {"rating": 5.0, "review": "Awesome......", "verified": true, "helpfulness": "0/0", "author": "oscar"}, {"rating": 5.0, "review": "Easy to setup. Most media choices cost extra for non-Prime members, but the third-party apps are easy to access.", "verified": true, "helpfulness": "0/0", "author": "Pauline Pewther"}, {"rating": 4.0, "review": "Extremely simple installation and setup. I paid $20 for this (as an early promotional price) and at that price, it's an excellent device. I currently have an older version of Roku (which is functionally very similar to the Fire Stick but with longer buffer times) and a Boxee Box (which is functionally similar to the Fire Stick, has longer buffer times, and handles FAR more file types than the Fire Stick) that perform equally or better than the Fire Stick. Having to have an app to \"cast\" content is sort of a pain, too, especially considering you have to buy the app (with \"points\" that are already credited to your account, but still...). At any rate, load / buffer times are very short and the picture and sound quality are great.One of the biggest downsides, though, is the size of the Prime Instant library; it's very, very small. BUT, I can't hold that against the device, itself.", "verified": true, "helpfulness": "0/0", "author": "D. Marks"}, {"rating": 4.0, "review": "It's mostly great; the remote doesn't have to be pointed at the device (I can stay cozy under the blankets), I don't need a brand-spanking new tv, or a new BluRay/DVD player. It comes ready to connect to some great apps, including to Gaiam, which has some awesome yoga videos. My only problem is that I'm constantly having to reset the internet connection; nothing else experiences connection problems at the same time. Not my phone (we have Vonage), not my laptop, not my phone's WiFi.The upside is, I've memorized my network password now... If that can be considered an upside.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]