[{"rating": 5.0, "review": "This product is awesome. My son loves playing his games on his tv and I love the convenience of the setup", "verified": true, "helpfulness": "0/0", "author": "sabrina reese"}, {"rating": 1.0, "review": "I love amazon, I however am not a fan of this product at all. We have two Apple TVs plus the Fire TV Stick on each one of our TVs, and the Fire stick by far functions the worst out of all of them. With our Apple TVs, we never have connectivity issues. We can run our laptops, cell phones and an Apple TV all at the same time with no disruption in connection whatsoever. And we have Century Link internet, which isn't the best, but it stays connected with all we like to do. With the Fire Stick, it seems like every single program or app is always loading or buffering, and this is with NO other devices in the house running. It cannot go 2 minutes without the program stopping to load. I know this is not a problem with our internet because of the fact we have no issues with our Apple TVs or Laptops doing the SAME EXACT streaming (such as Netflix or Hulu). I usually don't write reviews on anything but this product has definitely been a disappointment. It is cheaper, yes, and I do like that it is essentially cordless when connected to our TV, unlike the Apple TV, but I was expecting a better functioning product since it has the Amazon name on it. I will likely be buying another Apple TV to replace this.", "verified": true, "helpfulness": "0/0", "author": "Samara Rogers"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Shamu"}, {"rating": 5.0, "review": "Great!!!!", "verified": true, "helpfulness": "0/0", "author": "Chengiz"}, {"rating": 5.0, "review": "easy set up, functions beautifully, very reliable viewing", "verified": true, "helpfulness": "0/0", "author": "S. Hansford"}, {"rating": 5.0, "review": "Easy installation, performs well.  Appreciate not having another box sitting around.", "verified": true, "helpfulness": "0/0", "author": "BillTX \"BillTX\""}, {"rating": 5.0, "review": "I am completely satisfied with my fire sticks", "verified": true, "helpfulness": "0/0", "author": "Stephen Barone"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like the ease of use and have used it in every room.  What I don't like is that unless I have it close to the router, it tends to stall out (buffering).  After waiting a couple of years and finally purchasing it to find out it stalls is a let down,  Other than that its ok... good for rainy days and I'm sure it will be good for snow days as well.", "verified": true, "helpfulness": "0/0", "author": "Helen Rice \"mzrice\""}, {"rating": 5.0, "review": "Excellent product.  Excellent value.", "verified": true, "helpfulness": "0/0", "author": "Moon"}]