[{"rating": 5.0, "review": "Love this thing. I have a decent cable package and a Chromecast, but have found myself using this all the time. Before this, I wasn't really making use of prime content cause it wasn't offered as an app. The device is really simple to set up and love that it's already synched with your account.", "verified": true, "helpfulness": "0/0", "author": "Viva San Fermin"}, {"rating": 5.0, "review": "Amazing! So simple to set up. HD sound and picture and no delay. Well done Amazon! Bye bye cable.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Gray"}, {"rating": 5.0, "review": "I have told many people, that this is the best.", "verified": true, "helpfulness": "0/0", "author": "Susan C. McRae"}, {"rating": 5.0, "review": "I'm a big fan of Netflix so that was one of the main reasons I purchased the Fire Stick.  I also love the fact that I can access a lot of other different options to stream music, movies, and TV.  I'm enjoying it %100.", "verified": true, "helpfulness": "1/1", "author": "Niesha Hudgins"}, {"rating": 5.0, "review": "So far, I'm loving it.  Easy to install and set up", "verified": true, "helpfulness": "0/0", "author": "Denise Y Jameson"}, {"rating": 5.0, "review": "Love this! Easy to set up, clear instructions. My wife and I love the Prime TV shows on here, we actually don't carry cable as we can watch most of what we want with this guy. If you are an Amazon Prime member then you should definitely get this to take advantage of the free shows available. The free Prime movie listings are not as good as the shows. We haven't really utilized the apps available to download.", "verified": true, "helpfulness": "0/0", "author": "M. Hague"}, {"rating": 5.0, "review": "Works Really good. Easy To install and use. Take it with you anywhere a TV is available. Or you can run on laptop.", "verified": true, "helpfulness": "0/0", "author": "Michael John"}, {"rating": 5.0, "review": "This is fabulous. It was very easy to set up and is easy navigate through. I bought it for my mother and she loves it. I like the portability of it. i have not set up the app for voice on the phone yet. Will check back when I do", "verified": true, "helpfulness": "0/0", "author": "Murph"}, {"rating": 2.0, "review": "As much as I wanted to love this thing (it's so cool, right?), I just don't.  It was awesome the first few months I had it.  I got a great deal on it since I am a Prime member.  However, after awhile, it stopped loading the shows.  On both Prime and Netflix.  It would load the menu then just give up.  I had to switch to a Wi-Fi enabled blu-ray player.  That hasn't given me as many problems as the Fire Stick.  Sorry, Amazon.  I love you, but this one was not so good.", "verified": true, "helpfulness": "1/1", "author": "Caitlin Malk"}, {"rating": 5.0, "review": "thumbs up", "verified": true, "helpfulness": "0/0", "author": "julie hallman"}]