[{"rating": 4.0, "review": "I liked it very much and it was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Don in Ballwin, Mo."}, {"rating": 4.0, "review": "If your wondering about the app and the voice control to be clear it's a phone app NOT one you get on your fire stick, that was not clear to me before I got it. Aside from that though it's pretty cool. I have a kindle fire hdx that it works with, very easy to set up, simple and portable so you can take it when you travel our to a friend's house. If you have a prime membership it's worth the money for the stick just to watch your prime videos on your tv. Overall I'm happy, but there's always room for improvement Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jimi Busch"}, {"rating": 5.0, "review": "i love the fire TV stick! ive been streaming videos on my old wii in probably 720p with an even older tv so this makes netflix and other streaming videos look awesome! it works just great for me since i dont have a smart tv. Just log into your accounts and enjoy!", "verified": true, "helpfulness": "0/0", "author": "Megan Taylor"}, {"rating": 4.0, "review": "Works very well for Amazon programming.  No problem with prime programming or renting instant videos.  I did have some trouble using the Netflix app which seemed to take a long time to buffer and would freeze often.", "verified": true, "helpfulness": "0/0", "author": "Jennifer L. Poole"}, {"rating": 5.0, "review": "Easy to set up if you remember to use the HDMI extender. If not could be a little frustrating. Once installed it's easy to use. Most free stuff available, meaning you don't have to pay any additional fees to use/download, if you are a prime member. I now can have more apps then what is native to my TV and they run well. I love the firestick.", "verified": true, "helpfulness": "0/0", "author": "adbastille \"Ad\""}, {"rating": 2.0, "review": "First of all i paid 10 bucks more than what chromecast costs...with not much of a difference in apps except the one i needed.But my major disappointment was with quality of remote...its plastic of dollar stores...and does not have enough controls to navigate quickly...It has latency issues too", "verified": true, "helpfulness": "0/2", "author": "suhas"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "jose fernandez"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "nancy wu"}, {"rating": 5.0, "review": "So great to have so many viewing options at your fingertips!  Very easy to activate and navigate.", "verified": true, "helpfulness": "1/1", "author": "Debi Camp"}, {"rating": 5.0, "review": "i just wish it could play movies from my google acct.", "verified": true, "helpfulness": "0/0", "author": "MonkeyWithAGun"}]