[{"rating": 5.0, "review": "I have both the Chromcast and the Fire TV stick and I totally enjoy having the remote with the Fire TV Stick", "verified": true, "helpfulness": "0/1", "author": "Jan Kelly"}, {"rating": 5.0, "review": "I am tremendously pleased with the FireStick; both the quality of features and shows offered are exceptional.  Have been catching up on some missed episodes, and enjoying my Amazon Prime music.  Thank you, thank you, thank you.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It looks nice but merely moving your computer to your TV. You still need to pay for Netflix and other TV services. Nothing is free.", "verified": true, "helpfulness": "2/4", "author": "Jun Lei"}, {"rating": 4.0, "review": "Very easy to set up and navigate. Bought two, one for a friend.", "verified": true, "helpfulness": "0/1", "author": "Charles Fasterling"}, {"rating": 2.0, "review": "I was impressed with the overall build quality and packaging, but, that is were it stopped. I got the Fire TV Stick for Amazon Prime Instant Videos and NetFlix. I have an Android \"Mini Console\" for playing Android games on my TV but the Amazon Amazon Prime Instant Video and Netflix apps are hard to control. So I thought this would be a good option for that. Sadly, I was wrong. The Fire TV Stick has limited cache and even more limited wi-fi reception. For these reasons it is constantly buffering during streaming. It is impossible to even get through a 40 minute episode with out it buffering at least 3 times. We also loose access to Netflix all together whenever someone uses the microwave.", "verified": true, "helpfulness": "0/2", "author": "Sir Jaxxy \"Jeff\""}, {"rating": 3.0, "review": "It's ok.  I have great internet connection and my wifi is 12\" from the fire stick and I still had buffering during movies.", "verified": true, "helpfulness": "0/1", "author": "Marvin J Schuamcher"}, {"rating": 5.0, "review": "GREAT PRODUCT¡¡¡", "verified": true, "helpfulness": "0/1", "author": "Carlos G."}, {"rating": 5.0, "review": "High quailty product. Excelent performance and full family entretainment device.", "verified": true, "helpfulness": "0/1", "author": "LUIS G GARCIA GUERRERO"}, {"rating": 5.0, "review": "👍🏻", "verified": true, "helpfulness": "0/1", "author": "Jennifer Lecuyer"}, {"rating": 5.0, "review": "I got this to use my Prime benefits and watch some interesting things.  It is awesome that it comes with all the needed cords and batteries.  The remote was difficult for me to open, but everything else is nice and easy.", "verified": true, "helpfulness": "0/1", "author": "L N"}]