[{"rating": 4.0, "review": "Its small and powerful but does have some small glitches. One of the issues I have is quick and random black screens about 1 to 2 seconds in length. For the size and the price it doesn't bother me but it does get annoying when it happens 2 or 3 times during a movie or a show you are trying to watch. Other then that small minor issue. I think its a great product. I also like the remote app on your smart phone. I dont like using the physical remote to search so I use the voice search which works great and its extremely accurate. I dont think I will buy the remote with the voice feature since this was a budget buy. Overall the system functions are user friendly and it includes a tutorial before you start using it.I gave it 4 stars since the black screens are really annoying. I hope there will be a firmware update to fix this issue.", "verified": true, "helpfulness": "0/0", "author": "Tony Fasuto"}, {"rating": 1.0, "review": "Didn't work consistently at all.  I have Apple TV, which always works but this kept shutting down when trying to start Netflix.  Also didn't like running Sling TV much.", "verified": true, "helpfulness": "0/0", "author": "Bob Larson"}, {"rating": 1.0, "review": "IF YOU HAVE COMCAST DO NOT PURCHASE THIS DEVICEIf you are looking for a device to play HBO Go, Showtime, or any live tv network and you have comcast DO NOT bother.The only thing my fire tv stick is usable for is Netflix and Amazon Prime.I did not come across this information during my search of Chromecast vs. Amazon Fire Stick, until I had ordered, shipped, and attempted to set it up. Do not waste your time with this device if you have Comcast and care about TV.", "verified": true, "helpfulness": "0/0", "author": "P Chandor"}, {"rating": 4.0, "review": "Only problem was directions were hard for set up.  Confusing if your not as tech savvy as others.", "verified": true, "helpfulness": "0/0", "author": "Diana \"deeklunker\""}, {"rating": 5.0, "review": "Love this - exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "l"}, {"rating": 2.0, "review": "It works ok, has to be plugged in to wall outlet which I did not realize when I bought it, a little difficult to navigate through apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "GREAT! Awsome little product keeps the family entertained with movies, games youtube.", "verified": true, "helpfulness": "0/0", "author": "Alberto Mattar \"BERTIMUS MAXIMUS\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "We have a few chromecasts and opt to use it instead of the Firestick for streaming netflix because it seems to have a sharper picture and never gets caught buffering. The fire stick consistently needs to buffer to watch Netflix. Our Internet speeds are 50 mbps down and 5 mbps up. The only reason we got the fire stick is because there is no Sling TV app for chromecast yet. Will be nice to be able to rent Amazon movies since we are prime customers however wish they just made a chromecast app as well.", "verified": true, "helpfulness": "0/0", "author": "dbrand"}, {"rating": 5.0, "review": "Love it. Works great. Would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Starr Gardinier"}]