[{"rating": 3.0, "review": "I love the idea of this, but I haven't been impressed with its performance. No matter where it is in relation to the router, I get glitching, lag, and occasional freeze-ups while streaming. I can sit in the exact same room and stream something on my tablet with NO issues, yet I always have trouble with the Fire TV. I even had it replaced once thinking maybe it was just a bad unit - that didn't help. Overall, it's ok, but it often tends to be more frustrating than not.", "verified": true, "helpfulness": "1/1", "author": "Jodi Hoyt"}, {"rating": 1.0, "review": "Don't buy it's not up to the hype freezing issues buffering issues no customer support maybe in future it will work wait for Google to come out with Internet and tv", "verified": true, "helpfulness": "0/0", "author": "DANIEL J MANNING"}, {"rating": 2.0, "review": "The Firestick probably works well, but SlingTV is a disaster. Therefore I can't say if the Firestick would work or not. Sorry, I have told SlingTV to remove me from their subscriptions. Maybe I will try another provider.", "verified": true, "helpfulness": "0/1", "author": "mark pearlman"}, {"rating": 5.0, "review": "I'm really happy with our new Fire Stick.  It has great response time and the remote make it simple to use.  We made the decision to drop cable and go with streaming services.  We already had Amazon Prime and Netflix and then we added Hulu to the mix.  I can't say that I miss cable and the $70 a month I'm saving paid for the Fire stick the first month we had it.  I think that integration with the Amazon Echo would be awesome for voice commands.  Hopefully something like that is coming soon.  The only downside to it is the lack of an app for Windows Phone.  I hope that an app to support Windows will be coming soon.  Overall it is a GREAT product!", "verified": true, "helpfulness": "1/1", "author": "Kris B."}, {"rating": 5.0, "review": "I love my fire stick. the apps are easy to navigate and the installation, if you really want to call it that, was super easy. Would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "Kim Alaniz"}, {"rating": 2.0, "review": "Bought this so we could watch prime and netflix however it kinda blows. It constantly buffers and yes we have an awesome internet connection, secured network and great wifi. My roommate is a computer wiz so it gas nothing to do with our end. The stick nust cant keep up with the frame speeds, etc... it's pointless to even use it at this point. Worked well for a few months and i even recommended it to all my friends. Guess will either buy the roku or the bigger box fire tv. It's a shame it was such a nice idea.", "verified": false, "helpfulness": "0/0", "author": "Aurora Nebula"}, {"rating": 5.0, "review": "Enjoying this product!", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 1.0, "review": "Too many connection issues. My five year old blu ray player connects to apps just fine. Waste of money and upsetting", "verified": true, "helpfulness": "0/0", "author": "Oliver Reynolds"}, {"rating": 5.0, "review": "Great deal fast service will tell my friends about product very pleased with it", "verified": true, "helpfulness": "1/2", "author": "Manny Mejia"}, {"rating": 2.0, "review": "I have this and fire tv, it seems like this doesn't work when using the fire tv. It continuously is stalling, like it is buffering. The whole point of buying this was to be able to stream to two televisions at once. I'm not a fan. But I love the Fire tv.", "verified": true, "helpfulness": "0/0", "author": "Chris S."}]