[{"rating": 5.0, "review": "Works great.....no.more buffering....$40 well spent", "verified": true, "helpfulness": "0/0", "author": "Diane Huffman"}, {"rating": 5.0, "review": "Works great.  We have watched live streaming on Sling, Netflixs, HBO, ESPN with no issues.  We love it.  You can easily do without cable with the Amazon HD antenna and the Fire Stick in the Kansas City area.  So much cheaper.", "verified": true, "helpfulness": "0/0", "author": "chergess"}, {"rating": 5.0, "review": "Works very well, quite a change from watching Netflix on my I pad. Very easy installation and set up. Love it, well worth the $39!", "verified": true, "helpfulness": "0/0", "author": "ANNE WADE"}, {"rating": 5.0, "review": "Really great bargain!! I can hardly tell the difference in speed with the Fire TV if you want to get something a little cheaper. I don't do gaming though, so I can't vouch for that.", "verified": true, "helpfulness": "0/0", "author": "Kim G"}, {"rating": 1.0, "review": "This Fire TV Stick is a piece of $%#@!  It hasn't worked at all ever since I had the darn thing.  Amazon doesn't seem to have a customer service department.....so how in the heck can you get a replacement without paying more money.  I've had the stick for months now, and have yet to be able to watch a program more than 1/3 through!I definitely do not recommend it.  Buyer beware!", "verified": true, "helpfulness": "1/1", "author": "Gail L. Stelling"}, {"rating": 5.0, "review": "Great!  Hdmi extender was huge help!", "verified": true, "helpfulness": "0/0", "author": "Vincent C Betro"}, {"rating": 5.0, "review": "This is one of the purchases where you can not believe how great it works.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Shelia Gilbert"}, {"rating": 5.0, "review": "Loving it.", "verified": true, "helpfulness": "0/0", "author": "Tammy J Johnson"}, {"rating": 5.0, "review": "This is the best product in the market so far. I love everything about this product. In fact I am buying another one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Samson S."}, {"rating": 4.0, "review": "Works great for Amazon Prime and Netflix. We purchased a send one for another TV", "verified": true, "helpfulness": "0/0", "author": "Garland Krabbenhoft"}]