[{"rating": 3.0, "review": "Great hardware and software, however compared to my Roku ( on my living room TV) this has way too few channels, like 1/25 the number. Other than Amazon Prime Video and Netflix, there is not too much else. The fact that this unit was bought for my occasional bedroom TV use is the only reason it is at all acceptable.", "verified": true, "helpfulness": "0/0", "author": "eye4bear"}, {"rating": 5.0, "review": "Works like apple tv", "verified": true, "helpfulness": "0/0", "author": "Raudel Tolentino"}, {"rating": 2.0, "review": "No Showtime (Xfinity) and HBO Go support.", "verified": true, "helpfulness": "0/0", "author": "Anno"}, {"rating": 5.0, "review": "Awesome, get one.", "verified": true, "helpfulness": "0/0", "author": "stcahillsr"}, {"rating": 5.0, "review": "Connected my Fire TV Stick to an older LCD TV that had no network connectivity of any kind.  The stick easily attached to my WiFi then updated it's software first thing.  I have Amazon Prime and Hulu Plus.  Everything works beautifully and has made our oldest TV the best one in the house!I only have 3Mb DSL and the HD streaming is flawless, responsive, and never has to stop to cache more of the stream.", "verified": true, "helpfulness": "0/0", "author": "Yo Coop!"}, {"rating": 5.0, "review": "Worked great. No nearby power outlet so am running it without power. Surprised it worked.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Brody"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick meets and exceeds my expectations for a streaming device of this class since I've tried many others. I'm happy with this purchase and I've been able to use it 10 minutes after it was delivered. I heartily recommend this product to anyone looking for an easy-to-install, easy-to-use streaming device.", "verified": false, "helpfulness": "0/0", "author": "Nadia A Stumbo"}, {"rating": 5.0, "review": "It's perfect", "verified": true, "helpfulness": "0/0", "author": "Vickie Smith"}, {"rating": 5.0, "review": "Works quite well, thank you. I bought it on sale in Best Buy for $26, and it is worth every penny. It is far cheaper than a Roku stick and unlike Chromecast, it has its own remote. The software interface is pleasing enough and I was able to find all the apps I want. So, yes, I am very pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 4.0, "review": "The fire stick work well. unfortunatelyit didn't use all apps", "verified": true, "helpfulness": "0/0", "author": "MELVIN PARKES"}]