[{"rating": 5.0, "review": "works well,", "verified": true, "helpfulness": "0/0", "author": "William E. Burse"}, {"rating": 5.0, "review": "Simple & Easy, We love it.", "verified": true, "helpfulness": "0/0", "author": "FUZHEWUZHE"}, {"rating": 5.0, "review": "I have a smart TV, but it didn't have access to Amazon prime, so I purchased this Fire TV stick.  I love all the benefits, music, videos and photos using the cloud experience.  So far when watching videos, the frames doesn't freeze up/delays.  When I first signed up for Netflix I didn't have problems but it appears they don't have enough bandwidth to service their customer base, started to experience frame freezing and delays, I disconnected Netflix.  When friends come over I show my photo on my 60 inch TV and play music in the background, they are surprised to hear that this application is Amazon Prime.  Being in the telecom industry for 40 years, I receive discounts for TV service, what I did was disconnect channels that we don't watch and view them on Amazon Prime for free.  Using Amazon prime I am receiving more financial benefits.  Mahalo Amazon!! Please keep the deals coming for Hawaii consumers..", "verified": true, "helpfulness": "0/0", "author": "Nalani Kahimoe"}, {"rating": 5.0, "review": "What a Great product!!!  Amazon hit on something fantastic!!  The Fire Stick brings a World of entertainment to my fingertips.  Thanks Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "donald p angotta"}, {"rating": 4.0, "review": "Would have given it a 5 but my cable (cox communication) does not support the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Destry"}, {"rating": 1.0, "review": "Was sold a refurbished unit when buying a NEW unit. My order details specifically state I purchased a NEW unit, so there is clearly a false advertising issue and a bait and switch issue as well. This refurbished unit arrived LATE, and doesn't work at all. Will not allow me to get past the login credential page. Have spent 35 minutes and counting getting bounced around the planet, no one can tell me why the unit will not function. Their solution, have me wait even longer (keep in mind the product arrived LATE to begin with) while their \"technical engineers\" investigate the problem. No offer to replace the unit at all, just told to wait and wait and wait.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "Works great...set up took 2 minutes and I was off and running. You have to watch a tutorial video after set up but it only takes 5 minutes. Lots of good videos to watch. Nice apps for Netflix and Pandora and such...just in case you don't have a smart TV with built in wireless. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Dennis Cropper"}, {"rating": 4.0, "review": "I like it. A little hard to navigate at first, but over all great.", "verified": true, "helpfulness": "0/0", "author": "Tom I."}, {"rating": 5.0, "review": "I love this thing! There's so many movies and shows I have right there at my fingertips. I love being able to turn my TV into a smart TV. and the cherry on top what is the speedy delivery. I ordered it Friday had it in hand Sunday morning!", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 4.0, "review": "Really Nice device", "verified": true, "helpfulness": "0/0", "author": "Eric Valedon"}]