[{"rating": 5.0, "review": "Works fine. I especially like the voice selection speaker. Saves an amazing amount of time when searching for movies.", "verified": true, "helpfulness": "0/0", "author": "Stan Daley"}, {"rating": 5.0, "review": "first time user of the Amazon fire stick. So far I'm totally impressed with it! Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jeff kellogg"}, {"rating": 5.0, "review": "Love the fire stick. Now need to get more for each tv", "verified": true, "helpfulness": "0/0", "author": "Will Charboneau"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "A gem. My Mother in Law has a god awful cable lineup but who cares when I can just plug in the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Edward Chapman"}, {"rating": 4.0, "review": "Ok for the price! But if you're looking for something that performs a little better you have to go for the fire tv.", "verified": false, "helpfulness": "0/0", "author": "Nunoboxe"}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Michael B. Hill"}, {"rating": 5.0, "review": "Canceled DirecTV because of this awesome little TV tool. Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Bradley Sullivan"}, {"rating": 2.0, "review": "Didn't expect that it would differ from my Kindle. The Kindle allows apps like Disney Junior to play without a cable provider, fire stick does not. It's also a pain to add apps and then go to a website to activate them and then realize you again need to have a cable provider. We got Fire Stick and Chromecast because we don't want to pay for ridiculously high priced cable.", "verified": true, "helpfulness": "1/1", "author": "buckmm"}, {"rating": 5.0, "review": "Easy to set up and very user friendly. We now have access to everything in one place.", "verified": true, "helpfulness": "0/0", "author": "suzanne"}]