[{"rating": 5.0, "review": "Amazing device. Made my parents Netflix junkies. Simplest way to get your tv to do what you want in streaming", "verified": true, "helpfulness": "0/0", "author": "Frank Castaneda"}, {"rating": 5.0, "review": "I love the Amazon firetv stick.  All I did was follow the instructions in the box and setup was completed in 5 minutes.I get a clear picture to everything I have watched so far.The only minor thing, you may lose a connection once in a blue.  Don't panic.  Pull out the firetv stick, wait 30 seconds and stick it back in the hdmi port.  All is good in your world!", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 1.0, "review": "I think Roku is the way to go. It has a much better selection of TV shows and more in general.The music streaming is a joke, unless you have Prime. Even if you do have prime you still have to pre select which music you can hear through the stick.", "verified": true, "helpfulness": "1/2", "author": "Lawrence J. Blank"}, {"rating": 5.0, "review": "I really like this ptoduct. I have a chromecast and that was my intro to the stick products and like that as well. But considering that i am a prime member and have access to many more shows that aren't  on Netflix i enjoy the firstick bc i no longer have to watch on a laptop or kindle , i just enhoy it on my tv.I would recommend this products for its affordability  and for it's many apps that it has that not many others don't have.", "verified": true, "helpfulness": "0/0", "author": "Greenis90"}, {"rating": 5.0, "review": "Works great. Exactly what I needed", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "Way better than the chrome easy to use", "verified": true, "helpfulness": "0/0", "author": "Derrick Evans"}, {"rating": 4.0, "review": "nice toys for me. more app i can use. UI is not as good as roku.", "verified": false, "helpfulness": "0/1", "author": "thymesu"}, {"rating": 5.0, "review": "Must have to go with your Prime Membership. Get rid of cable or Satellite TV and get Prime for the best of Movies, TV, Music and more. Definitely the best deal in town for entertainment.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "Was a great buy!!!! Love it", "verified": true, "helpfulness": "0/0", "author": "penny filus"}, {"rating": 5.0, "review": "very impressive little stick. Start up is a breeze and before you now to you are surfing. If you are a Prime member, its a great way to access all the content. Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Douglas J Kummery"}]