[{"rating": 5.0, "review": "back ordered", "verified": false, "helpfulness": "0/0", "author": "Natale A. Fruci"}, {"rating": 1.0, "review": "So I received a launch unit for $20 for preordering. At first I really liked the device but after installing about 7 apps I noticed lagging going on in the menu and HUGE bandwidth drops. Once I rebooted the device it seemed to work like new, only to return the next day to its glitchy nature.I immediately ordered a replacement from amazon, set up my 2nd amazon stick and the problem returned about a week later. After reading many reviews I noticed many others were having the same issue. I tried many different troubleshooting ideas even tried setting the fire stick on its own frequency on my router (5ghz). Finally I gave up and contacted Amazon again. They said \"this was the first they were hearing of the issue\" (nice blatant lie, go read a few negative reviews on your own device). I feel like it is not releasing memory like it should when you close an app, or maybe its something completely different. Either way I am holding out for a firmware update (I am up to date as of April 20th).Amazon: I feel like an easy bandaid would be to just have the device reboot every night or at a time the user specifys in the menu?It is a great device when it works, just wish it worked better.", "verified": true, "helpfulness": "6/6", "author": "Eclipse01"}, {"rating": 5.0, "review": "Works and I don't have to look at a box all the time.Don't know how anyone could complain about what you are getting for the price.I am thinking of ordering the game controller,because though I am only an intermittent game player the remote is poor when used for games.Would be nice if the game controller was rechargeable....that's the only reason I haven't bought one yet.Edit...After using this thing for a bit it is starting to freeze up and once it does it won't work for quite a while.It says the network is down,but I can switch over to my PS3 and watch movies just fine while the Fire stick is locked up.There is a glitch in the thing that needs to be fixed.If you don't have another way to watch when this thing freezes up it could get quite tedious.I think soon I will have to unplug it and forget I ever bought it,which is a shame since the picture is much better than my PS3.", "verified": true, "helpfulness": "1/1", "author": "wesley"}, {"rating": 1.0, "review": "Pretty disappointing with intermittent streaming. Trying to watch anything is irritating with screen lockups every couple of minutes and at times video just pauses and you have to hit the play button on the remote to get it going again.My home network also has a smart Sony DVD player on the home theater that that will also pick up the same WiFi and stream Amazon and other services perfectly. The DVE player is 3x the distance from the wireless router as the Fire TV Stick yet the Fire TV Stick stutters, has moments of white noise and pauses in video.Its just not worth it.", "verified": true, "helpfulness": "1/2", "author": "David E. Trogdon"}, {"rating": 5.0, "review": "I have a bit of a gadget addiction, and have used the following devices recently:Kindle Fire TVKindle Fire TV StickGoogle ChromeCastAppleTVFor the price i'd say that the Kindle Fire TV Stick hands down offers the best value and the most functionality.  I was initially drawn to the ChromeCast but the lack of a dedicated remote makes it clunky to operate along with limited content.Apple TV is great, but there isn't much free content, and the device itself is several times the price of the Kindle Fire TV StickThe Fire TV Stick on the other handle is phenomenal for the price!  I can stream Netflix, Amazon Prime TV, etc. it was easy to use and set up, and affordable enough to buy more than one to use in multiple rooms.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "MisterStorm"}, {"rating": 5.0, "review": "I got this pre-purchased for $20, best deal of my life because this stick is awesome. It runs fast and destroys the Roku.", "verified": true, "helpfulness": "1/1", "author": "Jesse B."}, {"rating": 1.0, "review": "Netflix constantly can't play shows (while I switch over to my chromecast and they play fine)Other apps just sit on Loading... with nothing happening.I also ordered one on Amazon on Oct 17. Beginning of December it said it would be delivered on Dec 18 - I canceled the order, drove down to BestBuy and bought one off the shelf that was on sale.", "verified": true, "helpfulness": "1/2", "author": "Michael Gauley"}, {"rating": 1.0, "review": "What a disaster. I waited 2 months for this thing to arrive. I have been using Apple TV for years now, but wanted something for my glitchy smart tv in the bedroom, so I ordered this. I got it today, packing was sleek and stylish, easy to set up, done in a few minutes, working perfectly. Then in the same time span it completely stopped working. It won't hold a connection 10 feet from my wireless router. I have already requested a refund. I think Amazon rushed out a product to get ahead of competition. Sadly, what they have provided is a worthless lille black stick. I also just purchased a normal fire tv and have enjoyed that. It works fine minus one issue so far. Not sure what happened with the stick, but I cannot recommend it in the least.", "verified": true, "helpfulness": "0/2", "author": "J. Lucia"}, {"rating": 3.0, "review": "Does not work with iPhone, hopefully they would improve on it soon", "verified": true, "helpfulness": "0/0", "author": "O.Bruin"}, {"rating": 5.0, "review": "My older 50\" Pioneer Plasma is not internet ready so needed something to watch Amazon on Demand.  This unit does the trick.  Super easy to set up and watching shows in no time", "verified": true, "helpfulness": "0/0", "author": "Gadget Geek"}]