[{"rating": 5.0, "review": "We are very pleased with this product.  We were on the search for a Smart TV to replace our main TV, which is almost 10 years old, but still works perfectly.  We aren't techies by any means, so got some input from someone who is.  This worked great right out of the box, and we are enjoying a \"new\" Smart TV for probably 1/10 the price.  And, it's portable!  So, when we travel, we can take it with us & plug it in wherever there is a compatible TV and WiFi.", "verified": true, "helpfulness": "1/1", "author": "WandaH \"Ginger in SC\""}, {"rating": 2.0, "review": "I have problems with saying it's unavailable/ wi if connection lost. But in settings it shows wo do signal strong. Not sure if it's the stick or something else. All other wireless works during these issues. It'll drop what ur watching every couple minutes", "verified": true, "helpfulness": "0/0", "author": "Julie Winters"}, {"rating": 1.0, "review": "Cant watch HBO Go because Comcast won't allow it, can't watch HBO Now because Amazon doesn't offer it.", "verified": true, "helpfulness": "0/0", "author": "Michael F."}, {"rating": 5.0, "review": "Works great.  I use it to connect to my Plex server where I have all my media stored and it works great.  I haven't tried any games yet as this was not the reason I purchased it.", "verified": true, "helpfulness": "0/0", "author": "David S."}, {"rating": 1.0, "review": "its just turned out to be far to glitchy, and far to cheap to really be worth it to me, my remote fell apart a little after a month of use, and now the stick is having a hard time staying connected to the internet, in spite of the fact that no other device i own has any difficulties, including my chrome cast or old xbox 360, or the cheap htc evo i can stream netflix on easier and with less problems than this amazon stick... and even during the time it didnt have any problems connecting to the internet, it would end up freezing and having to rebuffer soooo many times, whether on netflix or amazon prime, made no difference... yet once again, not a single problem with any other device i own... i love amazon, i wanted to love this, but just so not worth it, way to frustrating of a device.", "verified": true, "helpfulness": "0/0", "author": "Curator"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Lisa D"}, {"rating": 5.0, "review": "Very easy to set up...and use... o bulky remote...we love it..", "verified": true, "helpfulness": "0/0", "author": "Patricia Singleton"}, {"rating": 5.0, "review": "LOVE the Amazon Fire TV Stick.  I just plugged it into the back of our television upstairs and it connected to our network, quickly and easily.  Now we can watch Netflix and Amazon Prime upstairs and we don't need a Playstation to stream.  Lovely, small (maybe a bit too small for older hands) and easy to install and use - if I had another television, I would buy a second Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "P. A. Muccigrosso \"patsquared\""}, {"rating": 5.0, "review": "Fast, love it!", "verified": false, "helpfulness": "0/0", "author": "Nancy k."}, {"rating": 5.0, "review": "Very happy with this.  Thinking about getting a second one for the other tv and getting rid of the sattilite", "verified": true, "helpfulness": "0/0", "author": "Wendy Cohoon"}]