[{"rating": 5.0, "review": "Great way to watch Amazon Prime shows & incorporate Netflix into 1 device. Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Luis Gonzalez"}, {"rating": 5.0, "review": "Works very well. Easy to setup. Great picture.", "verified": true, "helpfulness": "0/0", "author": "Silverwolf341"}, {"rating": 4.0, "review": "Not quite as good as the Roku stick but all I really use it for is Netflicks.", "verified": true, "helpfulness": "0/0", "author": "Just Me"}, {"rating": 5.0, "review": "Unlike Google's chrome, this device is not dependent upon other devices. Setup was a breeze and the video is excellent as is the sound.Out of the Box the Fire TV stick was easy to set up and has an intuitive interface. A short into video when you first active the device was a nice touch and coves the rudimentary operation. The device offrs more than just Prime TV with the ability to run other apps that include Netflix and Hulu+.There is no lag between the remote and the device. The fact that other controllers are available is a bonus and even better, there is an app that allows you to use your smart phone and voice commands.I purchased this on a bit of a whim. This is one of the rare occasions where I am really pleased that I acted on the impulse.", "verified": true, "helpfulness": "0/0", "author": "Adrian Sebborn"}, {"rating": 5.0, "review": "Just got it and it was easy to set-up and it has been working great with no issues.", "verified": true, "helpfulness": "0/0", "author": "Excellent"}, {"rating": 4.0, "review": "Update: The Wi-Fi connectivity now seems to be working great. Perhaps there was an update at some point. For the price, it is a great device. I like the user interface of my Roku3 much better. The amazon Fire TV stick puts Amazon's services front and center on the home screen, and it is a slight hassle to get to the other services (Netflix, Hulu, HBO Go, etc.) The Roku3 interface makes it a little easier to find what you are looking for.Original review: I am having the same problem that some other reviewers have noted. It keeps dropping Wi-Fi with my router about 30 feet away. I have a Roku3 in the same place and it gets a consistent signal. Perhaps with a longer HDMI extender I could put the stick in front of my TV and that might work. The extender cable that comes with the Fire Stick is only ~5 inches long. Otherwise it seems to be an amazing amount of functionality for the price. I am disappointed that I will not be able to use it. I will play with it a little more to see if I can get it to work.", "verified": true, "helpfulness": "0/0", "author": "Peter Cardillo"}, {"rating": 5.0, "review": "Its a very good way to use my Prime subcripition.", "verified": true, "helpfulness": "0/0", "author": "Winford Stell"}, {"rating": 4.0, "review": "I have been using a Roku for a couple years and it started acting up so I was looking for a reasonably priced replacement. The Fire Stick was on sale for $25 and although I like the Roku better, it is a great device for  the price(even at $35 I'd say it's worth it). I bought another at the $25 price to put on one of our other TV's.", "verified": true, "helpfulness": "0/0", "author": "Chris H Linker"}, {"rating": 1.0, "review": "This did not worked with my Toshiba TV.Amazon customer care tried few times to fix the problem of Audio but finally gave up.I returned and bought Roku.Cheers,", "verified": false, "helpfulness": "1/1", "author": "V. Kapoor"}, {"rating": 5.0, "review": "Have had the Fire TV Stick for only one day but so far I am enjoying it immensely.  The remote was a little hard to figure out but that's probably just me.  I also installed the remote app on my kindle and my cell phone.  Looking forward to playing with them since you can use voice commands with the apps.  I am excited to have this.", "verified": true, "helpfulness": "0/0", "author": "Liz Tuggle"}]