[{"rating": 4.0, "review": "Easy to setup, works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "R Estrada"}, {"rating": 5.0, "review": "This was a gift for my granddaughter and she seems very happy with it.", "verified": true, "helpfulness": "0/0", "author": "JUDY SHARPE"}, {"rating": 1.0, "review": "Not the best connection. I did expect a little better. But I guess you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Sierra Jackson"}, {"rating": 3.0, "review": "0k", "verified": true, "helpfulness": "0/0", "author": "Lina Li"}, {"rating": 5.0, "review": "So far it's awesome. Setup was extremely easy. So far I have synced up HBOGO, Netflix and WatchDisneyJr with no problem. Pretty easy to navigate. No performance issues yet. I'm glad I purchased. Now with my kindle fire and firetv I get to use Prime for more than just 2day shipping!", "verified": true, "helpfulness": "0/0", "author": "Jerri W. \"springer901\""}, {"rating": 5.0, "review": "Perfect for our bedroom TV. Didn't want to rent another cable box so this gives us access to our Netflix and Amazon accounts.", "verified": true, "helpfulness": "0/0", "author": "JSK"}, {"rating": 5.0, "review": "We love ours, it is so easy to use.  We were having problems trying to watch prime stuff on the TV and now we have no problem.  We are seniors and don't understand all the gadgets as well as our Grandchildren do, so this is a big help.  We also will take ours with us when we travel and have stuff to watch wherever we are.", "verified": true, "helpfulness": "0/0", "author": "Janet  Sue"}, {"rating": 5.0, "review": "My husband calls the fire stick crack tv (he's a little addicted). We love it & have thus far only used it to watch movies & tv shows. So easy to use & set up. Amazing.", "verified": true, "helpfulness": "0/0", "author": "PJR"}, {"rating": 5.0, "review": "I like it. Very fast and usefull.", "verified": true, "helpfulness": "0/0", "author": "Lazara"}, {"rating": 4.0, "review": "Where to begin?  I was using a chromecast in my bedroom to watch TV before bed.  It was clunky, didn't always stay connected or fully load sometimes/lock-up 50% on Netflix requiring a hard reset.  I only liked the chromecast for the convenience as well as ease of use.  I was lucky to get the Fire Stick on Prime Day, figuring if I didn't like it my parents could have it for their cable-less life.  Too bad for them I couldn't get two.  So what's so awesome about the Prime Stick?  It is loaded with your Prime info before you boot it up which I think is a nice personal touch.  Although I only use it for streaming, there's so much more you can do with it, such as play games that you buy with Amazon coins, which isn't bad for little kids or even a spare room without a console or PC.  Although there's no mirroring like the chromecast (which didn't like prime video anyways) for a little more than the price of the Chromecast, the Fire Stick is much more versatile, let's you play games, stream Prime Video, and has more options to stream shows than its initial offering.  I'd recommend the Fire Stick as improvements are continuing and it's much more than just a streaming stick, it's a multimedia streaming stick that is highly portable, to take to your hotel with you if you're out of town and don't want to deal with the local TV options.  Of course it is not perfect.  Some cons are that it is fully integrated with Amazon (DUH), which may not be kosher to an Apple or Android person.  Also it can be finicky with its connection, although it is stronger than a Chromecast that uses a middle man, a strong connection is desired.  The remote is basic, I like it but others may not.  A remote play like Apple TV would be cool, it may have this but I haven't found it.  It's well worth the price of Prime Day and still worth it at full price just in stiffer competition with Roku, Google, and Apple (kind-of).  If you're on the fence, go for it especially if you have prime, it's totally worth it, and if you travel a lot or have cut the cord.  I don't regret my purchase at all and will be placing the Chromecast somewhere else.", "verified": true, "helpfulness": "0/0", "author": "JRH"}]