[{"rating": 5.0, "review": "these are great!!! have ordered 2 now- one for us and one for a gift - works amazingly great!!", "verified": true, "helpfulness": "0/0", "author": "Jessica Orr \"jorr\""}, {"rating": 5.0, "review": "I absolutely love this. I gave my chromecast away!  Incredibly easy to set up and use.  I plan on buying one for every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Biggpoppi"}, {"rating": 5.0, "review": "This was a wise purchase. Easy to install, set up, and convenient. My husband and I use it everyday and have never had any issue. The interface is simple and easy to use. I love it!", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Love it!! Works great!!", "verified": true, "helpfulness": "0/0", "author": "Tracey Avans"}, {"rating": 5.0, "review": "Totally satisfied.  Easy to install and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "I LOVE IT.  only issue is I use a hot spot for internet and it eats up all my time.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 4.0, "review": "good product and meets requirements.  wish the interface gave the ability to search across all providers.  Very Amazon Prime centric.  But overall a very good product; streaming is great and interface is intuitive.", "verified": true, "helpfulness": "0/0", "author": "mark thompson"}, {"rating": 5.0, "review": "Worked just as described.  We like it a lot.", "verified": true, "helpfulness": "0/0", "author": "sueholc \"sueholc\""}, {"rating": 5.0, "review": "i just need a faster internet.. not amazons fault", "verified": true, "helpfulness": "0/0", "author": "joseph lee delozier"}, {"rating": 2.0, "review": "If I leave this on for an extended period of time, it starts to go in and out. It like looses its signal, like a tv with an antenna. I am not very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Rick Wayne Jr."}]