[{"rating": 5.0, "review": "Gave everyone access to lots of great shows after cutting cable.  Easy set up.  Stays plugged in all of the time but have switched it from TV to TV very easily.", "verified": true, "helpfulness": "0/0", "author": "Cold Stone"}, {"rating": 5.0, "review": "My daughter is super happy. She loves see Disney Jr, Hulu, Netflix and PBS kids. It was the best I buy it.", "verified": true, "helpfulness": "0/0", "author": "Solymar"}, {"rating": 4.0, "review": "Amazing! A little bit laggy sometimes, but a great product.", "verified": true, "helpfulness": "0/0", "author": "Martin Epelde"}, {"rating": 4.0, "review": "This is as awesome as I thought it would be. Ended up downloading an app to my phone and tablet to use as a remote control too and they both work great. I think the only improvement I could suggest is an on/off switch. Why have it run all the time? And I certainly don't want to have to plug and unplug it with every use.", "verified": true, "helpfulness": "0/0", "author": "Tim Schoenbeck"}, {"rating": 4.0, "review": "Product is great.  My roku arrives a week beforey firestick arrived. Love the games all the movies music extra is great with prime memberships", "verified": true, "helpfulness": "0/0", "author": "Michael Mills"}, {"rating": 5.0, "review": "This is a happy addition to my house. I have the Amazon Fire TV in my living room and the Fire TV Stick in my bedroom. I am very pleased with the Stick and I find it to be fast and easy to use. Very easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Susan K"}, {"rating": 5.0, "review": "I love the fire stick I have it attached to the flat screen in our living room, it works perfectly as our centralize entertainment hub in the living room, no loss of signal, picks up wireless with no issue, doesnt heat up, works great and its easy to set up.", "verified": true, "helpfulness": "0/0", "author": "hector torres"}, {"rating": 1.0, "review": "The fire stick is not what I expected it buffers all the time my internet is fast I uae my laptop on the TV and it does not budder I rate the fire stick as a bad productSincerely William Cruz  billzruz80@gmail.com", "verified": true, "helpfulness": "0/0", "author": "bill cruz"}, {"rating": 5.0, "review": "Love it!!! I used the app on my phone because I lost the remote and I think that the app if better.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 4.0, "review": "It does seem to lock up. Love to be able plug in no cords and can not be seen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kimmy\""}]