[{"rating": 4.0, "review": "I love it. It was easy to set up and we can move it to different TVs with no problems. I'm already ordering another one for my daughter. It's definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Shannon Long"}, {"rating": 2.0, "review": "Very laggy. Buttons on remote are not very intuitive. Accidentally hit the home button a lot.", "verified": true, "helpfulness": "0/0", "author": "David \"David\""}, {"rating": 5.0, "review": "Everything I hoped for and more.", "verified": true, "helpfulness": "0/0", "author": "amy"}, {"rating": 5.0, "review": "This is so easy to use. I was able to do it all by myself. (As I am tv impaired) Love it. I watch something every day. And it is wonderful on the new HD TV.", "verified": true, "helpfulness": "0/0", "author": "michele"}, {"rating": 5.0, "review": "Great device, multiple apps, I wanted it for Netflix and Hulu. Literally 10 mins after opening the box I was watching a documentary. Greatly recommended!", "verified": true, "helpfulness": "0/0", "author": "CJ24Ventura \"CVentura\""}, {"rating": 5.0, "review": "I love this thing. It's way better than cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely worth the money!! Streams great! A ton of apps on here all the movies you could ask for. I highly recommend this!!", "verified": true, "helpfulness": "0/0", "author": "samuel macias"}, {"rating": 5.0, "review": "Don't wast money on buying a smart tv . You can add the fire stick an does the same it's great . My kids love it", "verified": true, "helpfulness": "0/0", "author": "manuel garcia"}, {"rating": 2.0, "review": "I purchased the Amazon fire for the side loading apps so I could watch xfinity and surf the web.  What I didn't realize was that you can't use a keyboard without some hacks.Pros- sideloading apps- Can watch xfinity and surf the internet but it's a pain.Cons- Amazon is the center of attention. Unless you buy a lot of content from them it's annoying.- Plex isn't free. I don't have to pay for it on roku. Didn't feel like purchasing the app since I already have it on tablets and free on Roku.- Working with sideloaded apps is cumbersome.- Busy home screen. I like the cleanness of roku better.Overall it's a nice product but is way too amazon focused. Amazon prime has a horrible selection as always and I don't buy video from them.If you're more of a Netflix or Hulu watcher and/or use plex, stick with Roku. The only thing I use my fire for is watching live channels on the  xfinity app.", "verified": true, "helpfulness": "0/0", "author": "D. King \"sci-fi fanatic\""}, {"rating": 5.0, "review": "Everyone should own one of these.", "verified": true, "helpfulness": "0/0", "author": "lee strickland"}]