[{"rating": 2.0, "review": "I love the thing!  But I have a clearly defective unit that will not work properly.The device will play far faster than the Roku stick i have but there are glitches.  The video will continually glitch ever 30 seconds to a minute I will get a glitch in the screen covering anything from 1/4 to the full thing starting at the bottom and going up.  the rest of the screen keeps going with what it was doing and I can continue to watch the movie or what ever I was watching but this happens so often that if I am really wanting to watch the movie it makes it impossible to enjoy it.  I think I have a defective unit, would order a new one and return this but not for twice the price!", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "Not bad, could be great. One glaring omission is a software volume control. Especially when I have it hooked to equipment that doesn't have one readily available, and I already have the Fire remote (or remote app) at hand. It will be interesting to see how it develops.", "verified": true, "helpfulness": "1/1", "author": "smp"}, {"rating": 5.0, "review": "This shoul;dn't be a 5-star rating, but rather a 4.7 star rating.  I love it, much more than I anticipated, but there are definitely some design problems.I've long thought that Microsoft and Apple were conceited in their design, ignoring established standards, expecting the world to go along with them.  That's why I have long tried to avoid products of those two companies, starting in the mid-1980s when Microsoft stopped licensing the Lattice C compiler, and started writing their own.  They changed how the int86() function worked, which was an extremely critical function, and immediately, all my existing programs stopped working, and I spent a month going through, rewriting them - and a month's work without pay was devastating to a self-employed programmer with a terminally-ill wife.If it were just that Amazon wanted you to buy books, music, and video from them, it'd be understandable, as they are unquestionably the world's greatest resource (sorry, Google, not yet!),  Unfortunately, the design engineers ignore the world of standards as well.  To power the Dire Stick, you plug in a micro-USB into the side.  That means that the Stick not only uses an HDMI port, but it blocks anything else from being plugged into the *next* HDMI port as well.  They've included a 5\" HDMI cable in the box, but do you really want dangling dongles on the back of your TV?  The other end of that USB cable, when I plugged it into an Acer desktop computer, resulted in an error message that there wasn't enough juice, and I really needed to plug into am AC outlet using their adapter.The Amazon AC adapter is the same one that came with my Fire HD7, a cube.  It will work in the bottom of a wall socket, if you have a surfeit of those, but if tou have plugged in a router, a TV, a DVD player or computer, maybe a printer, possibly a lamp and a VoIP adapter, and a charger for your cell phone, you probably need a power strip - and it noit only uses the jack you have it plugged in, but the jack on eitrher side of it.  A more polite engineer would have that USB cable attaching to the *end*, rather than the side, of both AC adapter abd Sirre Stick, and would use an AC adapter that's roughly the width of a standard AC plug.  There's no excuse fdor such arrogance, Mr. Bezos; the world is not going to redesign every TV and every power outlet to accommodate thoughtless engineers.I've been accessing Prime Video through my 'puter, and the Fire Stick not only gives me better images, but it seems to \"stutter\" less than my 'puter.  (It stutters less on my Fire HD7, too, so it not my 6mbps broadband most of the time.)  I was surprised to find that the FireStick does more than stream TV.  It seems to be a Fire without battery or storage, as I can use apps I've obtained for my HD7.I've been trying to extract the cable company from my wallet, and the Fire Stick definitely helps.  I bought an indoor antenna  (http://www.amazon.com/gp/product/B00DIFIO8E) and tried to rely on Prime Video and a few other sites, but tonight, I was watching Histort2 (which isn't available on smaller cable packages) and I discovered the CBS News app on my Fire Stick.  I initially had trouble getting sound with CBSN, nut I tried again a half-hour later, and everything was hunky-dory.  With the Christmas rush and the flood of Dire Sticks arriving (I ordered mine a month ago, before they were available), it might be that the servers were having trouble keeping up with installations.I had a little difficulty with the \"Search\" function. I typed in HI and selected \"hitch\" showed up in the suggestions, but when I clicked, I got taken to \"Hitchhiker's Guide to the Galaxy\"  Tried typing the entire HTCH and the same happened.  Finally typed HIYCH_ with a space on the end, and was able to select \"Hitch movie\", which worked.  I suspect the Amazon programmers will fix for that in an upgrade that will download itself in the next few weeks.I'd like to be able to install apps from Google Play, such as those from local TV stations; I have trouble seeing them on my HD7, and it was hard to find the instructions to install non-Amazon App Store apps on that.  Since we keep our stuff for the Fire Stick in the Cloud, we might never be allowed to install unapproved apps.  I guess I need to lobby my local stations to get their apps in the Amazon ecosystem.I'm already struggling with a remote for the TV (needed to switch the HMDI, VGA and antenna), mouse, and a couple of cell phones sitting here.  I got a phone call an hour ago, and I answered the Fire Stick and the mouse before the call went to voicemail.  Thank goodness it was a politician soliciting funds.  When they're voting to give more srtuff to the banksters, I'm not going to give money to keep them in office!  But I'm not sure how they could design a single device to control my computer, TV, Fire Stick, and lert me answer my calls.Oh, and there's a place in the settings to enter your time zone, but apparently no setting that allows you to display the time in the corner of the screen.  I'm not sure what they use the time zone for.One last piece of advice.  They offer you a free 30-day trial of Prime.  If you already have Prime, do NOT accept it, because it just confuses things. If you don't have it, of course, DO accept it.  It pays for itself in reduced shipping, and you really CAN fire your cable/satellite carrier with an antenna and Prime.  The slowest broadband package will support Prime video AND if it's not satellite broadband (which has too much latency), you can replace your phone with VoIP.  (Hint - install VoIP, then sign up for Googlr Voice - free - and forward voice calls to your VoIP number, then pay $10 to switch your Google Voice number to your cyrrent landline number, and that way, your phone number doesn't need to change.)You *gotta* get a Fire Stick.  I don't normally give 5 stars to a product with problems like I've detailed, but in this case, I'm making an exception.", "verified": true, "helpfulness": "6/6", "author": "Steve Thomas"}, {"rating": 1.0, "review": "So far, I've plugged it in, attached it to power, loaded the batteries in the remote and...........nothing, nada, zip, zero.  Apparently it's not nearly as simple and trouble free as advertised.  Anyone have a phone number I can call?", "verified": false, "helpfulness": "1/1", "author": "nprman"}, {"rating": 5.0, "review": "This is one of the best purchases I have ever made. It puts the Google Chromecast to shame! Chromecast is but a very tiny subset of the Fire Stick's capabilities. I would buy one for every TV you own!", "verified": true, "helpfulness": "0/0", "author": "Justin Maneri"}, {"rating": 5.0, "review": "this is awesome it works great and it easy to use", "verified": true, "helpfulness": "0/0", "author": "BillK"}, {"rating": 1.0, "review": "I thought that I would try this cheap version, to check it out, before I bought the more expensive box. Thank Goodness I only paid $20. It was wasted money. I am a bit spoiled because of my Roku players. But this stick is a real disappointment.The WiFi is very sketchy. I have it in the same small room as my modem. It works sort of all right until I try to watch Netflix. Then it just stops working. Sorry, it says, Try Again Later.Well, Later is what I intend to try. After I unplug and disconnect the fire tv stick, and go back to my Roku.My Amazon Prime Watchlist has no catagories. You have to search through the whole thing to find what you want to watch.The APPs are disappointing too.I gave it one star. Maybe I can find someone to give it to. I sure don't want it.I don't normally give a bad rating for anything. But this Stick really deserves the knocks.", "verified": true, "helpfulness": "0/0", "author": "Linda L Paxton"}, {"rating": 5.0, "review": "Very responsive and It's feature packed that's all I have to say....for the money u can't go wrong...", "verified": true, "helpfulness": "0/0", "author": "Slider"}, {"rating": 5.0, "review": "So glad I pre-ordered!!!!", "verified": true, "helpfulness": "0/0", "author": "Angela Greene"}, {"rating": 1.0, "review": "Why I can't  install YouTube or tunein radio? I'm outside us.", "verified": true, "helpfulness": "0/0", "author": "d1egoaz"}]