[{"rating": 4.0, "review": "Pretty nice little device.  I have a bunch of similar products (Roku, Chromecast, Google TV Box).  Each has its' own pros and cons.  The Fire TV stick is great for Prime (as should be expected).  Using other apps is about as easy as any other device.  The Roku wins in terms of number of apps, but for the apps I use (Prime Video, Netflix, PBS Kids) the Fire works well.  I wish it supported Hulu (as opposed to Hulu Plus), but I'm not sure any of the streaming players support that.  I haven't used the Android app, but I like the simple remote (I like it more than the app-based chromecast interface and the remote on the Google TV box).  Just enough buttons to do what you need and to make it easy to use in an unlit room.", "verified": true, "helpfulness": "1/1", "author": "dave"}, {"rating": 5.0, "review": "Have had it for a couple weeks, really like it, glad it came with Plex installed so we didn't have to sideload an app for streaming. Only hang up we've found is that it can't/won't stream 5.1 channel audio from a DLNA source. Interface is really intuitive and easy to use. Hasn't hung on us once or needed a reboot at all.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Foote"}, {"rating": 5.0, "review": "The fire stick was very easy to program to my TV and has performed as stated. What more can one ask?The price was right.", "verified": true, "helpfulness": "0/0", "author": "Nickie Kirk"}, {"rating": 5.0, "review": "Super easy to set up. After 5 minutes I was watching the intro video on it. I had no problems watching any of my Prime stuff and Netflix was quick and easy to set up and use. Now I don't have to use the wii in the living room to watch the stuff my family watches. The only thing is my tv's usb port wasn't strong enough to power it so I did have to plug it in. It happens, that's more on my tv than the fire stick though.", "verified": true, "helpfulness": "0/0", "author": "Rose D"}, {"rating": 5.0, "review": "This was so easy to set up even a middle aged woman with a little computer knowledge can do it.As said in previous reviews you need the password for your router/modem for wifi and it will set itself up.All the choices for programs you see on your computer you will now see on your TV screen.I purchased this when it was on a two day sale for $19. and I figured what the heck, but at  $39. it's stilla bargain.", "verified": true, "helpfulness": "0/0", "author": "Frugal Shopper"}, {"rating": 5.0, "review": "Love it!  Works great giving you a cool new navigation  interface. I even take it with me on trips, giving me the ability to watch my Amazon and Netflix shows. I have found that you can even use some TV remotes to navigate the fire. Much better than the Roku or your Blu-Ray player. This would make an excellent gift for family and friends.", "verified": true, "helpfulness": "0/0", "author": "Rosco"}, {"rating": 4.0, "review": "Simple. Straight forward. Works.", "verified": true, "helpfulness": "0/0", "author": "RG"}, {"rating": 5.0, "review": "I own three Chromecasts but decided to try one of these out. I'm hooked, its gui is great and streams start much quicker than the Chromecast. I like that I can select what I want to watch from the screen instead of using my phone. I don't have any proof but stream quality does seem better than the Chromecast. Overall, I would buy one of these again and if I didn't already have the Chromecasts I would buy a Fire Stick for the other TV's", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "This works just great.  Pretty simple to hook up and get going.  Highly pleasedd I ordered this", "verified": true, "helpfulness": "0/0", "author": "Stephen L. Disney"}, {"rating": 5.0, "review": "AMAZING.Simply superb for what it does, the Fire TV stick blew me away with the amount of functionality it offered for the price. I bought it for the $19 dollars it cost Prime Members when it was first announced, and I couldn't be happier. The UI is efficient and responsive, the remote works great (unfortunately it runs on AAA batteries), and the app selection is fantastic for a device that's just been released. This is mostly due to the fact that the Stick is essentially a pared down version of the Fire TV set top box, but props nonetheless.That said, it's important to understand that this is essentially a window into Amazon's ecosystem. Netflix, Pandora, and other media apps are there, but they all appear in the Apps section of the store, while Movies/Music/TV options in the menu only offer the option of buying from Amazon's catalogue, or viewing Prime content.Because of this, the Fire TV Stick becomes a lot less useful if you're not a Prime Member (and you don't want to pay every time you sit down to watch TV). Prime members get a great selection of TV shows, Movies, and Prime Music (which is fantastic in its own right), giving them utility across every item in the Fire TV Stick's menu. Non-Prime members, however, will only ever use the Games and Apps sections unless they want to buy a TV show, movie, or song.I haven't felt the need to sideload any apps onto the device just yet - if I ever get around to buying a Fire Game Controller I'll update this review with how games play on the device. Haven't tested the screencasting features either, as I don't have an Android or Fire device.TL;DR - Essential for Prime members with TVs, less great but still good value for those looking to stream video to their television. Good app selection, games pretty much require a controller (as the remote doesn't have buttons).", "verified": true, "helpfulness": "0/0", "author": "Martian"}]