[{"rating": 5.0, "review": "Awesome little media player especially for the price.  Can't be beat.  You can side load xbmc and stream from a nas.", "verified": true, "helpfulness": "0/0", "author": "Brandon H."}, {"rating": 5.0, "review": "Very easy to set up and use.  Love the ease of moving from one tv to another.", "verified": true, "helpfulness": "0/0", "author": "shelly callaway"}, {"rating": 5.0, "review": "1000% Satisfied,I also have a ROKU,and I disconected it & brought another FIRE STICK for $25 @ Best BUY on BLack Friday..", "verified": true, "helpfulness": "0/0", "author": "Roy G."}, {"rating": 1.0, "review": "Was unable to make a WiFi connection. It found multiple networks, but couldn't complete a connection to any open or encrypted ones. Needed to return it.", "verified": true, "helpfulness": "0/0", "author": "sfmillburn \"sfmillburn\""}, {"rating": 2.0, "review": "Some issues with this, it doesn't work as I expected. Of course I had great expectations, since I never had a Chromecast thing, I only had an AppleTV that's much better. It still does photos/videos/music, the movie/series selection is not that great.", "verified": true, "helpfulness": "1/1", "author": "Pablo Viedma"}, {"rating": 4.0, "review": "I already  have a Roku2 but for the special prime price back a few weeks ago I couldn't turn this down.  There are a few things missing like HBO GO which is supposed to be available by years end.  What I do like vs. the Roku is that with the recent unlimited photo and video storage for prime members is the ease of which to view photos on the tv and to flip with the touch of a button.  I did have the ability with Roku to view photos from my computer using a pay for app but it is awkward and cumbersome and more like a slide show then the Fire Stick.  The Youtube app is pretty easy to use and it is easy to setup the ability to send the video to the tv.  The fire remote seems more sensitive then the Roku remote in that you don't have to be right in front of the device to activate it.  It is also smaller and easier to take it to another location.  The app for tablets is ok, the best feature of it is voice search.  Lastly, it came early and was delivered on a Sunday of all things.  Awesome.", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 4.0, "review": "I really like the Fire TV Stick; however, the remote is a little hard to use.  You really have to push hard on the directional buttons.  Other than that, the content and performance is really good.", "verified": true, "helpfulness": "0/0", "author": "Thomas Spurlock"}, {"rating": 1.0, "review": "This is the worst device I have ever bought.  I plugged it in and set it up but the sound would only come through periodically.  The picture was great and worked with no hesitation.  The device also got very hot.", "verified": true, "helpfulness": "0/1", "author": "Michelle Hafford"}, {"rating": 4.0, "review": "Remote control is the best. Don't have to use my phone to control it like my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Wasted money on this junk.  As many others say, horrible network connections.  It could not find signal from nearby Asus RT-N56 router when plugged in HDMI port in center of 50\" tv, whether direct or with the supplied short extension.  Checked signal with phone, found mid-range strength.  Plugged into side port it saw network, but would not connect to 5 ghz stream at all, and had trouble with 2.4 ghz.  When it finally did \"connect,\" it first could not download, but on re-start said it needed to download updates, then crashed.  Re-re-started it began to download, hung, then crashed for the last time here.  It's trash to me, so into the gift drawer for someone with a router closer than 25 feet.", "verified": false, "helpfulness": "0/1", "author": "RC"}]