[{"rating": 5.0, "review": "Just love it😍", "verified": true, "helpfulness": "0/0", "author": "april otero"}, {"rating": 4.0, "review": "Goood..however, it doesn't have youtube app.", "verified": true, "helpfulness": "0/0", "author": "EL_CAZADOR"}, {"rating": 3.0, "review": "I installed it a few days ago.  I already had the Chromecast, which I like a lot.  I don't like the Fire TV Stick by comparison.  They work quite differently and the Fire unit takes a while to get used to.  Once it is operational it seems to work fine.", "verified": true, "helpfulness": "0/0", "author": "Christian Humanist"}, {"rating": 5.0, "review": "LOVE IT!!!!!! Totally satisfied and more so. The video library is great. Super easy to install and use. No wireless problems at all. You shoukd buy it!!!", "verified": true, "helpfulness": "0/0", "author": "Sarah  Walton"}, {"rating": 4.0, "review": "Works great one our newest t.v.,but on the large plasma,we get squiggly lines on it. on the whole I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Linda K. Goble"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "don't act like you don't know my name"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Andrew S. Kim"}, {"rating": 5.0, "review": "So far so good. The initial set up went fairly well . I did have a few talk to myself moments  . The first being that my TV did not recognize the Fire Stick . I had to go into the TV sets programing and set up the HDMI port to recognize  Fire Stick. After that the programing went fairly well.I did have to input my wireless modem password. I've only watched one movie so far with no issues. I've been checking out all the programming available  and adding some to my watch list. Looks like a good amount to choose from.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Skip\""}, {"rating": 5.0, "review": "Better than the Roku stick. Not better than the Roku 3. But that's not a fair fight. I like the chromecast... However having a dedicated remote is nice. So in the end, for a cheapish media player/bridge... This thing works well.At the 19 I paid I would order a few more. At 40... I have to mull it over.", "verified": true, "helpfulness": "0/0", "author": "Kris Hamilton"}, {"rating": 2.0, "review": "Wont connect to the internet for more than 15 seconds at a time", "verified": true, "helpfulness": "0/0", "author": "Janice M. Parro"}]