[{"rating": 4.0, "review": "Enjoying the fire stick better than roku so far. However I have noticed that it's glitching lately. But overall I'm happy with it. Had it for three months now", "verified": true, "helpfulness": "0/0", "author": "Virginia Heckard"}, {"rating": 5.0, "review": "Our first 'high tech\" device for TV. Easy to use. We are still learning all the benefits. Maybe we can skip cable.", "verified": true, "helpfulness": "0/0", "author": "HAPPYCHIK777 \"Cheryl F.\""}, {"rating": 5.0, "review": "amazing! if you already have an account, it's already set up. you literally plug and play.", "verified": true, "helpfulness": "0/0", "author": "S.L. Koger"}, {"rating": 4.0, "review": "Awesome! It will be even better once Amazon natively includes the Firefox or Google Chrome browser. I had to install the Firefox browser in order to use my Fire Stick on a hotel's wifi. Not the easiest task but doable.", "verified": true, "helpfulness": "0/0", "author": "Jerome Murray"}, {"rating": 4.0, "review": "Worked Great to start with.Long Time Customer", "verified": true, "helpfulness": "0/0", "author": "Matthew M Miller"}, {"rating": 5.0, "review": "Great tool for your TV and very inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Florida Jo"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Chuck1150"}, {"rating": 3.0, "review": "Works ok. Glitches at least 8 times per half hour show.  Frustrating.  And thought with my amazon prime I would try out amazon tv.  They charged me after a week and I didn't use it since there is a charge to watch each tv show of at least 2.99!Disappointed", "verified": true, "helpfulness": "0/0", "author": "Melanie B."}, {"rating": 5.0, "review": "Love this! Easy set up and easy to use. Even my husband who wasn't so sure about this is liking it.", "verified": true, "helpfulness": "0/0", "author": "juicypez"}, {"rating": 5.0, "review": "Fire TV Stick is Awesome! It's so easy to hook up to your TV and the streaming of what ever you want to watch is great! Also with Prime you get tons of Free shows, movies, and games, You Tube and Etc. Why would you need anything else? This is It! Very happy With Fire TV Stick! I would recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "AUGDOG"}]