[{"rating": 5.0, "review": "Why clutter up the space your 55 plus inch HiDef TV already takes?  Combine your Prime account with this nifty little gadget to watch all the movies, series, foreign and domestic.If you buy this easy-to-use product, expand your viewing pleasure and watch The Good Doctor, an excellent Korean drama, love story.  So, okay .  You have to read the subtitles.  Chinese, Japanese, Korean, Indian , and even British actors. Oh, yes, outstanding US everything.Enjoy", "verified": true, "helpfulness": "0/0", "author": "mrl"}, {"rating": 5.0, "review": "Works well needs to be plugged into wall power in addition to the TV to work", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Big things do come in small packages!  A great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "what I wrote for the user guide applys", "verified": true, "helpfulness": "0/2", "author": "Johng"}, {"rating": 5.0, "review": "it was all I needed", "verified": true, "helpfulness": "0/0", "author": "charles     amrowski"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "It worked as advertised. Easy to set and great picture. Like Apple TV you have to turn the sound way up. It's a good bargain.", "verified": true, "helpfulness": "0/0", "author": "dchyde"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "This review is mainly a warning for people who are buying this device primarily for the Twitch app.  As of April 5th, 2015, the Twitch App is TERRIBLE.  Non-stop buffering and freezing with a very strong internet connection.  The whole reason I bought this fire stick was for the Twitch App. I already have an Apple TV but was interested in the different Apps available on Amazon's option.  I regret buying this device but am holding on to in the hopes that Amazon will improve the Twitch App so that it becomes actually watchable.  PLEASE FIX TWITCH.", "verified": true, "helpfulness": "0/0", "author": "Veist"}, {"rating": 4.0, "review": "Some problems with the hulu app crashing causing me to pull the power cord to restart the stick.", "verified": true, "helpfulness": "0/0", "author": "austin grawe"}]