[{"rating": 5.0, "review": "Love it!  Not only is everything in HD.  There is such a broad spectrum of apps to use.  It's easy to install and navigate.  It was well worth the cost .", "verified": true, "helpfulness": "0/0", "author": "Denise Garner"}, {"rating": 5.0, "review": "DELIGHTED - a life changer!Using Fire TV Stick for help with my pro images and enjoying Video from Netflix, Amazon Prime and my own library and more.The ap for my iPhone allows for easier search typing and logins and the voice-activated search is efficient and great fun! ONE REQUEST: will there be an ap soon that will allow DVDs played on my iMac DVD player to display on my HDTV???", "verified": true, "helpfulness": "0/0", "author": "LadyShopper"}, {"rating": 5.0, "review": "Beyond expectations!!!!", "verified": true, "helpfulness": "0/0", "author": "SPARKY"}, {"rating": 5.0, "review": "Great product and a must have for a cord cutter.", "verified": true, "helpfulness": "0/0", "author": "Daniel J Ramirez"}, {"rating": 5.0, "review": "I just love the quality and quantity of selections to watch.  It is much more enjoyable and easier to follow the storyline without all the commercial interuptions. I am hooked!", "verified": true, "helpfulness": "0/0", "author": "joan jauch"}, {"rating": 4.0, "review": "I really like the ease of setting up the stick on my spare TV. I also really like the fact that EVERYTHING came with the purchase (i.e., the stick, an HDMI cord, an HDMI/stick extension, power cable, batteries and remote). Here's what I was not happy with: 1) Trying to open the remote back to install the batteries took nearly 45 minutes! I had to use a paring knife to separate the edge in order to push down and then pull the back out. You might want to have users of different age groups with dis/abilities test the ease of handling; and 2) send better instructions for use of the device. It is silly to purchase this, then be expected to buy a Fire Stick/TV manual for $8.99.", "verified": true, "helpfulness": "0/1", "author": "drcmb"}, {"rating": 3.0, "review": "I'm sure this will be a good purchase.  However, haven't been able to use it yet since the condo we're renting at the beach doesn't have wifi strong or fast enough for the stick to work without buffering every 30 seconds or so.", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "Just moved and decided to cancel our $200.00 monthly Uverse bill. Now we pay $15 a month for Hulu and Netflix (also an Amazon prime member) and we are just as satisfied if not more since we are saving so much more money!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Lee"}, {"rating": 5.0, "review": "Easy to install/setup.  Started streaming without any lag time at all.  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "I have had the Fire Stick for a little over a month and am very satisfied.  I debated between this and Apple TV as we use Macs and I-phones, but as Prime users felt the Fire stick was the better choice.  It loaded quickly and set up was straight forward.  As I did not buy it through Amazon due to a Best Buy gift card it was not set up with my account info prior to receiving it.  Signing in to my account information was simple.The search feature without voice is a bit cumbersome, but after a few uses was not a problem.  The remote, though small and simple, is intuitive and works well.  I have downloaded several new apps with no problem.  Amazon material certainly loads much quicker and is front and center in the format, but other items load with little wait time and are easy to see.  I watched \"Band of Brothers\" and each episode was ready to go when prompted with minimal wait time.I did set up a wireless router extender that is located right near the TV so my signal is very strong.  The primary purpose for this purchase was so we could \"cut the cable\" (other than internet), and with a new OTA antennae for the TV we are pleased with the set up.I will update this review in a few months if necessary .", "verified": true, "helpfulness": "0/0", "author": "Doc Clay"}]