[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Kikimax"}, {"rating": 5.0, "review": "This was SO easy to set up. Absolutely love the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "A great extension of the TV's capabilities and worthy competition to Comcast.", "verified": true, "helpfulness": "0/0", "author": "John Ralston"}, {"rating": 5.0, "review": "I am 45 and not tech savy, I have never used Roku or Chrome..whatever so I can't say how they compare. I ordered this with skepticism. Figuring out how to work electronic devices is not my thing. In ONE day I declared myself at expert at navigating the Fire TV Stick AND I downloaded the app on my Galaxy S3 (I know, old phone) and have used that as well to navigate my Fire TV Stick. I have an older 36\" Symphonic TV and was using a Wii to use Netflix. THIS. IS. SO. MUCH. BETTER! It is ONLY $39. Actually I like it better than using our actual 'smart' TV that is not so easy to navigate. I should mention I am a prime member so when I plugged this in to the TV all my saved shows and cloud pics are already on there. I use Netflix and it was already on there and I just had to sign in just like I would on any other device. NOW, I do have to unplug the stick and plug in our DirectTV Genie to watch satellite because I just have the one plug in thing but not a big deal for me. IF you wanted to have both plugged in you would have to buy an extra gadget. Yeah, I don't know the names for all those things but you know what I mean.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 5.0, "review": "I love this so much better then the one from the fruit company.  Many more apps and so easy to use even my mother-in-law has no problem.  I'll be getting another one for sure.", "verified": true, "helpfulness": "0/0", "author": "Newmansdad"}, {"rating": 5.0, "review": "Just want to know if the wiFi is unlimited?", "verified": false, "helpfulness": "0/0", "author": "Karine Melikyan"}, {"rating": 2.0, "review": "First one didn't work at all.. Sent me a replacement even though I was told it would be impossible to get one until February.. So I was pumped to get one.. But it won't find my network anywhere but in the living room.. Since every other electronic device is already out there and I got this for my room and after two tries is useless to me.. I'll probably not get another one..", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "I love it! It's so easy. My Wii remote just stopped working right before I received the Fire TV Stick so it was good timing.", "verified": true, "helpfulness": "0/0", "author": "Becky L. Tilghman"}, {"rating": 3.0, "review": "Don't watch TV that much anymore", "verified": true, "helpfulness": "0/1", "author": "Jack Weber Jr."}, {"rating": 3.0, "review": "It functions \"OK\". It had a hard time connecting to my wireless at first. Once connected, everything worked well. There are some major quirks. One issue is the choppiness of Netflix. There is a stutter, almost as if the program wasn't calibrated well enough. The second issue is the remote. It's hit and miss; literally. Some times it's responsive and a single click will move you 1 space over, and some times it launches you 100 rows over. I'd say buy if you can get it for super cheap (under $20), if not buy something else. Also, not all the games that play on the Fire TV can be played on the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "ERICKPRIME"}]