[{"rating": 5.0, "review": "Great product,easy to use and kid friendly", "verified": true, "helpfulness": "0/0", "author": "sharon e geiger"}, {"rating": 5.0, "review": "Love, love, love it!", "verified": true, "helpfulness": "0/0", "author": "Cricket"}, {"rating": 5.0, "review": "Love the firestick is a great product. Well worth the investment and the cost was extremely reasonable. I am so glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "sherrye nelson"}, {"rating": 4.0, "review": "For the price, it is a great media streaming device. That being said, it is sluggish and the organization is horrid. It does do what it is supposed to usually. Sometime PLEX has some issues that my Roku does not. Anyway, it is really just a meh device but on sale, it is worth it.", "verified": true, "helpfulness": "0/0", "author": "JavMan"}, {"rating": 1.0, "review": "Did not meet our expectations!  Returned products.  Had to call customer service for support.  They were outstanding.  The product was disappointing.", "verified": true, "helpfulness": "0/0", "author": "James P."}, {"rating": 3.0, "review": "Having a problem with the connection constantly. Always says check settings very annoying when the signal is very good.", "verified": true, "helpfulness": "0/0", "author": "Candice Murphy-Suarez"}, {"rating": 4.0, "review": "Its okay", "verified": true, "helpfulness": "0/0", "author": "dman"}, {"rating": 4.0, "review": "It functions perfectly but I would give it full stars if it operated more like a website so I could log into my xfinity online.", "verified": true, "helpfulness": "0/0", "author": "ptowngirl"}, {"rating": 5.0, "review": "The item works well. I would like better instructions. There are other features I would like to use but I have not figured out all the details as I'm not quite as tech savvy as I would like to be. I'm using the fire stick in conjunction with my Directv which gives me even more options thanks to Netflix. I'm also watching You Tube on the TV through the fire stick which I enjoy much more on my 65\" big screen. I understand It is possible to view my photos and videos through my  iphone but I have not figured this out yet.", "verified": true, "helpfulness": "0/0", "author": "Dr. D.M.Mauser"}, {"rating": 5.0, "review": "Very cool and easy to use. Only problem was I didn't discover it sooner. Great variety of movies and games. Not completely clear on exactly how it works with non-prime selections and a little afraid of surprise fees. Too cool for school.", "verified": true, "helpfulness": "0/0", "author": "Gregory"}]