[{"rating": 1.0, "review": "If you have a slow internet connection this product is useless, I bought it because it was a special deal for $19.00 and would send it back but I accidentally threw out the box it came in. I would recommend the Roku player which works much better.", "verified": true, "helpfulness": "0/1", "author": "John Simonetti"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick simply due to the initially discounted price offered to Prime members. However, as it turns out, I love it. I currently use 3 different device types to stream digital content; Google Chromecast, smart TV and a Blu-Ray player. I figured I would give this a shot and see how it stacked up. It does quite well...In the box:The Fire TV Stick comes with an HDMI extender (needed for my TV), a power block and USB cable and remote. The remote works very well. I assume it is RF, as line of sight seems not to be necessary.Setup:Connecting to the TV was quite simple. Simply plug the Fire TV Stick into an empty HDMI port and supply power. The directions say to use the included power block to supply power to the Fire TV Stick, but on 2 different TVs, the TV's USB port offered sufficient power to run it, so that's how I have it connected. YMMV. Once it powers up, the setup screen walks you through a very simple connection process to connect to your wifi and Amazon account for Prime. Piece of cake.Fire TV Stick vs Chromecast:Obviously this is the most direct comparison. While certainly different, they are in the same class of device. I picked up the Chromecast to use on a non-smart TV. It's fine, but the Fire TV Stick is much better (at least for streaming). The Chromecast is a very basic device. It requires the use of your smartphone to control it, as it has no other input method. This is where the big difference between the two devices comes through. The Fire TV Stick has an includes remote, and therefore has standalone functionality. The main advantage to the Chromecast is it is much better integrated with your phone, allowing virtually anything you are looking at or watching to be immediately displayed on the TV. This includes screen casting, which is occasionally helpful. While there is an app for the Fire TV Stick, it is different than the Chromecast app. It is basically just another remote, but with the added capability to use your phone's keyboard or voice control for searching. But when it comes to actual streaming (Netflix, Prime, etc), the Fire TV Stick is the clear winner. Having it's own UI and standalone usability is great. The device is very quick, and the FF/RW/Pause controls are extremely fast reacting. Using the Chromecast to stream is a less enjoyable overall experience. As for physical differences, the Fire TV Stick is slightly longer than the Chromecast. On my TV, this required the use of the conveniently included HDMI extender. While not a huge deal, on some TVs this may be a bit of a pain. The winner is the Fire TV stick for streaming, but the Chromecast if you are looking for a way to mirror your phone to your TV.Fire TV Stick vs smart TV:My main TV is a Samsung smart TV. The TV is slightly more convenient to use to stream initially since you don't have to change the input, but in overall usage, it isn't close. The Fire TV Stick has a much better UI, the ability to use the phone's keyboard, and is faster than the TV. Also, and this may be a model/brand specific issue, my smart TV delays audio for a couple of seconds when coming out of pause, so you can miss dialog. No such issue with the Fire TV Stick. The smart TV UI is also very bloated and cluttered, making it's usability less appealing. The clear winner her is the Fire TV Stick.Fire TV Stick vs Blu-Ray player:The Blu-Ray player I have is not a top of the line model, but a middle of the road player. Higher end players may fare better, but mine gets crushed by the Fire TV Stick for streaming. It is clear that the processor in the Blu-Ray player just can't compete with the one in the Fire TV Stick. Everything is done much faster in the Fire TV Stick. It's night and day. Using the Blu-Ray player is much more tedious. This one is a slam dunk for the Fire TV Stick, as the Blu-Ray player offers no advantage, and is much slower.Final thoughts:Amazon hit a home run with this one. Assuming the Android app gets updated with further capabilities to more compete with the Chromecast in phone mirroring, it will be a much better device. As it is, I have the Fire TV Stick in my bedroom on my non-smart TV (so I don't have to use the aforementioned Blu-Ray player to stream), and the Chromecast on my living room smart TV. I will probably use the smart TV for streaming and just use the Chromecast for phone mirroring. If you are looking for a streaming device, I cannot recommend the Fire TV Stick highly enough.", "verified": true, "helpfulness": "1/2", "author": "Douglas Hill \"hilmar2k\""}, {"rating": 4.0, "review": "So far it seems to work well. I have this, a ROKU 2 and a Chromecast, all on different TVs. Each device has its pros and cons, but since this is a review for the Fire TV Stick, I'll \"stick\" to reviewing that device (pun intended).Pros- Speedy. While I don't have quantitative data, it does seem to stream in HD faster than the ROKU 2- Nice remote. A plus over the remote-less Chromecast, and a nicer execution than the ROKU. Even though it's nice to have the headphone jack option on the ROKU remote, it's buttons and menu interface aren't as intuitive. The Fire uses icons similar to most non Apple smartphones for navigation and the streamlined design seems less likely to fall victim to the dreaded sticky button phenomenon that happens when you have young children.Cons (and why I gave it 4 stars)- \"Not Support!\" Uh, what? This error came up when I first plugged it in to the HDMI port without the HDMI cable extension. Which I did as I interrupted my wife and daughter listening to music on the ROKU. \"It'll be quick and easy!\" I said. Well, the daggers they were shooting from their eyes were much quicker to hit me as I dangled from a step stool with one arm behind the TV, one arm holding the device while trying to plug it into one of the ports, only to have it do nothing, but give me an error written in broken English. \"Not Support!\" Adding the cable extension fixed the issue, though.- Power supply. While it might be able to be powered via usb on the tv, it comes with a plug for an outlet. The plug is somewhat large and awkward, which made finding space for it on a power strip difficult.- \"Apps.\" While not the end of the world, you must search for and download the apps you want to use. Not a problem. Just tedious when you aren't familiar with the menu set up.We have had one or two hiccups with the streaming since installing it, which required shutting of the TV to fix, but it hasn't been a regular issue.Overall, the experience is good if not perfect and I'd recommend it for the price", "verified": true, "helpfulness": "0/0", "author": "John A"}, {"rating": 4.0, "review": "A few setup/compatibility problems...The great content and sharp picture I expected...1. VIdeo sync - I have an HDMI switch I bought here.  At first video did not sync up - black/blue screen - no signal...Plugged directly into HDMI 3 input of my TV (also bought here) -- and I got a picture -- after getting WiFi setup the stick took 5-10 minutes to update its firmware. Tried HDMI switch - voila - good video2. Sound sync - my HDMI switch splits sound out to fiber optic.  With default settings stick sound my cut out and go silent.  Or may not get anything at all.  Go into the Stick settings for audio - force to plain stereo (not Auto, not Dolby Plus) and sound is good, but I expected and hoped to get nice Dolby Digital like my Roku.3. Android phone remote - I got this thing for the voice reco feature - BUT the fire tv remote app does not show up in the Google Play store for my oldish (Gingerbread 2.3) phone.  I will update the review when I get a chance to try it with my wife's Android 4.x phone.", "verified": true, "helpfulness": "0/0", "author": "Bob Teatow \"Bob Teatow\""}, {"rating": 5.0, "review": "So I bought the FireTV when it came out and I love it! So when I say this for 19 bucks on pre-order for Prime members I jumped on it.I've used the AppleTV (great product but limited), Roku 2, HTPC (Home theater Personal computer), LG and Samsung smart TVs, and the chromecast. Chromcast is great but in it's own way.The  Fire TV Stick is small and easy to use. I was a little sad my HDMI and on board TV usb was not powerful enough by it self. I had to use the A/C USB plug.The options on this are the same as the FireTV. Streaming is just as fast and the interface is the same.It's a very CHEAP Plex streamer.I don't play hardcore games but my kids love minecraft.  It does that with ease.Over all it's under 40 bucks at retail and if you are a streamer of netflix, hulu, plex, and of course PRIME this is deal.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 4.0, "review": "Took about 15 minutes to set up after connecting to network and downloading updates.This device basically saves me from having to go on my PS3 or laptop/PC and chromecasting Netflix, Hulu, or Amazon Prime videos.Remote works well.  For the price and functionality, can't really beat it.  It's main selling point is its small size and independent operation.  I'd say Amazon has a winner in this product.My only gripe on this device is the wall plug.  The rounded square shape basically takes up 2 outlet spaces in either direction (up/down or side/side).  Personal rant: My only TV USB slot is already being used to power my Chromecast so I had to use the wall outlet to power the Firestick.  My cables are all buried behind my TV so I had to squirm and roll my way to get access to the power strip/receptacle.  After finding out the Firestick adapter is too big to occupy a single outlet, I ended up using my Chromecast adapter to power the Firestick.", "verified": true, "helpfulness": "0/0", "author": "King of the Noobs"}, {"rating": 3.0, "review": "The fire stick does very good at accessing prime features and playing back smoothly.  I haven't noticed any lag moving between apps/screens.  Was able to get it for the $20 special so pleased with it for the low cost.I do have a big complaint though.  I was planning on using this in a camper setting where internet would not always be available.  The plan was to use the Plex app to access media always available on the local network.  With the Fire Stick it disables all of your content, apps, etc when a connection to the internet is not present.  This blocks you from being able to launch the Plex app that would still work perfectly without internet.  If you reboot the device, you can sometimes get the app launched before the menus are disabled, when you can get in, Plex works fine.  My suggestion to amazon is to enable a way of continuing with only local network access.  There is no reason to require internet connection to function for many things the Fire Stick does.  It should function like any other Android device does when the internet is not available.", "verified": true, "helpfulness": "0/0", "author": "willc"}, {"rating": 4.0, "review": "Great product but not too many free movies or shows :(", "verified": true, "helpfulness": "0/1", "author": "Jeff Trantham"}, {"rating": 5.0, "review": "Very good product. Really easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "Mike Denzler"}, {"rating": 5.0, "review": "I've bought all others (i.e. apple TV and Roku) and this is the best - outstanding!", "verified": true, "helpfulness": "0/0", "author": "Donald P. Marchand \"Carefulwhatyoubelieve\""}]