[{"rating": 1.0, "review": "Cant work with out network like the Microsoft stick can. Can't just set it up for screen sharing. Can't work with out the remote. Can only watch steaming movies. Just like the other 15 devices connected to my TV. Buy the Google or Microsoft sticks. they do more.", "verified": false, "helpfulness": "0/2", "author": "slnb"}, {"rating": 5.0, "review": "Low price, easy to set up and use....we love it!", "verified": true, "helpfulness": "0/0", "author": "FLKayak"}, {"rating": 5.0, "review": "Easy and works as advertised! Plus, I got it at a discount from Best Buy ($25). No glitches. You have to look around for some apps, like YouTube. It wasn't featured, I guess, but I found it. Buy one now!", "verified": true, "helpfulness": "0/0", "author": "VSap"}, {"rating": 1.0, "review": "BEWARE BEWARE BEWARE!!! Advertisement says it will mirror \"your\" phone or tablet. That is a LIE! If you have an iPad tablet or an iPhone, it WILL NOT mirror them. Also very disappointed with the fact the advertisement makes no mention of THE POWER CORD, this takes away the portability you think you are buying, yes it comes with a power cord, will not work without it, the ad does NOT mention it, the pictures do NOT show it. Amazon fire tv stick is a rip off!", "verified": true, "helpfulness": "0/5", "author": "Gilbert Wallace Jr"}, {"rating": 5.0, "review": "Worked perfectly out of the box.", "verified": true, "helpfulness": "0/0", "author": "William A. Tomeo"}, {"rating": 4.0, "review": "I think that the Amazon Fire TV Stick is great but it does have a small problem. After I have used it for a while it has a tendency to freeze up and become unresponsive. I have to reset the stick by removing the power from it. Normally not a problem, but there is no on and off switch and I have to remove the power cable from the Fire TV Stick. I am concerned that over time it will cause the micro usb plug to become in operative.", "verified": true, "helpfulness": "0/0", "author": "Richard T. Bolgeo"}, {"rating": 5.0, "review": "I really love the fire tv stick. I bought it to watch my Netflix from my bedroom tv . The setup takes  about 20 mins but it's easy to install and the quality is great! I definitely recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Eto16"}, {"rating": 5.0, "review": "Excellent device for Prime members, Netflix users, and etc. The remote is a nice touch. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Capt. Dee"}, {"rating": 5.0, "review": "Really enjoying the Fire TV Stick.  We have already watched several movies and are exploring others.  A nice change from watching commercial TV all the time.  The price was right as I got it when it was offered as a special for $19.99, but I think it is worth the regular price of $39.99 (I think).", "verified": true, "helpfulness": "1/1", "author": "Karen"}, {"rating": 5.0, "review": "The remote is amazing the link up is amazingly simple. super easy to pack up and take to hotels on business trips. considering a second to keep in my carry on luggage.", "verified": true, "helpfulness": "0/0", "author": "Joel Hecht"}]