[{"rating": 5.0, "review": "I absolutely love it!!! So fast and easy to use. What a great purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Orlando Rosales"}, {"rating": 5.0, "review": "Best money I've ever spent! I love my fire tv stick! It's so much more fun to watch movies on my tv than on my iPad when I'm at home! It was easy to plug in and to figure out! And it easily transfers from living room to bedroom!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Clammer"}, {"rating": 4.0, "review": "it provides a pretty smooth interface for all the channel selections except on Netflix, dont really know how to access and make changes to the channels.", "verified": true, "helpfulness": "0/0", "author": "Jackie Lee"}, {"rating": 5.0, "review": "High quality and easy to install product.  Exceptional quality of video on my 1080p HDMI TV.", "verified": true, "helpfulness": "0/0", "author": "Elderly One \"Bob\""}, {"rating": 4.0, "review": "love it, catching up on the series I missed, watched all the Vikings and Walking Dead before the new series started", "verified": true, "helpfulness": "0/0", "author": "Diane Walters"}, {"rating": 4.0, "review": "Pretty happy with it. Had to side load Avia to get DLNA support though. HDMI/CEC would nice to use the TV remote.", "verified": true, "helpfulness": "0/0", "author": "Stew Benedict \"dog lover\""}, {"rating": 2.0, "review": "Screen mirroring (my primary reason for getting it) doesn't work. Attempted with 3 different devices.Sideloaded apps are hidden in the settings menu.Good if you need something to stream from Netflix or Prime. Not as good as XBMC (Kodi) but you can sideload that.", "verified": true, "helpfulness": "0/0", "author": "William M Durr III"}, {"rating": 5.0, "review": "Easy to install and provides easy access to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Cathy Mikus"}, {"rating": 5.0, "review": "Works awesome no flaws. Already mentioning it to friends", "verified": true, "helpfulness": "0/0", "author": "justin bousman"}, {"rating": 5.0, "review": "Love this thing. Being able to sideload apps is a plus.", "verified": true, "helpfulness": "0/0", "author": "Rian S."}]