[{"rating": 1.0, "review": "Crapyest gimmick yet, there is no 30 day free use, as advertised, I purchased thinking I could extend my net flix  subscription to another room sorry the greedy people at amazon have a paid script ion service worst than a motel/ hotel and you get billed by just looking for something, NOT ordering the movie, well planned to be confusing for billing purposes…...", "verified": true, "helpfulness": "0/1", "author": "poor service"}, {"rating": 4.0, "review": "Once I got it working it works very well.", "verified": true, "helpfulness": "0/0", "author": "Jerry F. Shaw"}, {"rating": 3.0, "review": "Overheated and returned for another one from Amazon. New one works perfectly", "verified": true, "helpfulness": "0/0", "author": "Guadalupe Salinas"}, {"rating": 1.0, "review": "Let me tell you a story about a man who dared to dream big. He decided to place his faith in a higher power, and he knew that it was a gamble-- but he was willing to risk everything for a shot at greatness. So he bought the Amazon Fire TV stick.He was utterly disappointed.Just get the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Faris"}, {"rating": 5.0, "review": "Easy to install and use.  Very happy with this purchase.  Would recommend this to anyone looking to update the older model TVs.", "verified": true, "helpfulness": "0/0", "author": "Chill"}, {"rating": 5.0, "review": "So glad I got the Fire TV Stick! I have a non-smart TV and this little device makes my TV  experience so much better. Took all of 5 minutes to set up, and I was watching Netflix in a flash! In addition its super convenient to be able to access Prime movies,  Netflix, and HBO GO, instead of flipping between my cable box and the Fire Stick. Overall I love this product!", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "EXCELENT", "verified": true, "helpfulness": "0/0", "author": "miguel suncar \"Miguel Suncar\""}, {"rating": 5.0, "review": "I love my amazon fire stick so much more than cable, and it's alot cheaper also. I have an issue with the live tv freezing a bit while I'm into a movie but other than that it's still great!", "verified": true, "helpfulness": "0/0", "author": "Nikk Nak Patty Wak"}, {"rating": 4.0, "review": "I'm just learning but overall very intuitive. I wish it would refresh choices per day to make it seem like I was looking elsewhere in the movie archive. Big selection of movies but not every single release. You need to \"rent\" new releases. Same goes for TV shows.", "verified": true, "helpfulness": "0/0", "author": "B. Parker"}, {"rating": 5.0, "review": "We are very pleased.  Having Prime is an important part of enjoying more with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Goss"}]