[{"rating": 5.0, "review": "Awesome, just plain awesome.", "verified": true, "helpfulness": "0/0", "author": "Donald D. Lloyd"}, {"rating": 2.0, "review": "This probably works as it has been sold often. My experience was HDCP Unauthorized with a blue screen for all movies after getting great picture and sound with the initial setup. Don't know why. Did my review of options and tried them. Have a Vizio TV so that may be the problem. Got a suggestion from the Amazon help and one HDMI port worked for a few minutes, then the program went to the blue screen and stayed there. Not worth this much effort. Bummer as this stick, if working, seems very neat. Being returned.", "verified": true, "helpfulness": "0/0", "author": "Richard D Sheresh"}, {"rating": 5.0, "review": "Fast shipping. Love it! It took me awhile to get into buying streaming gadgets but finally got this one during the Amazon Prime Day. Easy to install. Very clear and crisp picture shown on my big TV. I watched Downton Abbey series after the installation. Fast and no lag. I also like it that I can bring this gadget wherever I go. I brought this to our lakehouse and was able to watch movies there too! Really enjoyed it. Anyways, I may have to sign-up for Amazon Prime now that I've enjoyed this gadget. Unfortunately, I heard that I can not bring this overseas when I travel. That would have been awesome! Highly recommends!", "verified": true, "helpfulness": "0/0", "author": "M.ENONE"}, {"rating": 5.0, "review": "This stick is fantastic! Our main television is not a 'smart' tv, but has the input option for this.  I love how easy it is to turn it on and go right to a movie or even watch my son's football video's that we've uploaded on YouTube.  It made my not so smart TV... smart!", "verified": true, "helpfulness": "0/0", "author": "F. K Walker \"sydsmom\""}, {"rating": 5.0, "review": "Love Amazon Prime and our fire sticks. We have been using for several months and no issues!", "verified": true, "helpfulness": "0/0", "author": "Kenneth and Symeta Marcum"}, {"rating": 5.0, "review": "A must have in all households !! Super :)", "verified": true, "helpfulness": "0/0", "author": "Kimber"}, {"rating": 5.0, "review": "Love it!  So easy to use.", "verified": true, "helpfulness": "0/0", "author": "MD"}, {"rating": 5.0, "review": "I bought the Fire TV Stick to watch Downton Abbey...love the show and the stick.  I have been using the stick to watch other shows on Amazon, Netflix, etc.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Corlene V.  Forde"}, {"rating": 5.0, "review": "Did not know how much I would actually use this until I got it. Now use it everyday to watch both Amazon Instant video and Netflix. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "It's all about the price! 😀😜", "verified": true, "helpfulness": "0/0", "author": "Hartwell Peebles"}]