[{"rating": 5.0, "review": "Love it! Easy to install and use and has SO many features!", "verified": true, "helpfulness": "0/0", "author": "phtmofopr"}, {"rating": 3.0, "review": "Need a USB port on your tv.  I do not have one!", "verified": true, "helpfulness": "0/0", "author": "Clay O. Stiles \"usetobe wannabe again\""}, {"rating": 5.0, "review": "This is great.  I highly recommend the Fire Tv Stick.", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Watt"}, {"rating": 2.0, "review": "I admit I like this product, but it defiantly has connectivity issues from time-to-time. Besides that, it's a great product, just needs some bugs worked out of it via update to smooth connectivity to high speed wireless.Update: I've given up on the firestick's performance, made the switch to Apple TV. You get what you pay for I guess.", "verified": true, "helpfulness": "0/0", "author": "Blake E."}, {"rating": 2.0, "review": "We don't have a strong wi-fi signal, and picture kept freezing & lots of pixelation. Waited too long to return, so sold on Craig's list for $25.", "verified": true, "helpfulness": "0/0", "author": "D. Ryan"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Annie"}, {"rating": 5.0, "review": "Works fine, has good WiFi range and streams pretty seamless.", "verified": true, "helpfulness": "0/0", "author": "August Scarpelli"}, {"rating": 5.0, "review": "Excellent easy to install and works great!", "verified": true, "helpfulness": "0/0", "author": "Monica James"}, {"rating": 1.0, "review": "Can't even open remote to put in batteries. Researched Utube and found how you do it but it doesn't work. I'll need to return. Guy on video said it was hard. No kidding.", "verified": true, "helpfulness": "1/1", "author": "Alfred J DiOrio"}, {"rating": 3.0, "review": "Good unit and it works great but I like the Ruko better simply because it has more channels that I enjoy.  We bought this for a BR TV that is not a smart TV.", "verified": true, "helpfulness": "0/0", "author": "J.R.M in TN"}]