[{"rating": 5.0, "review": "The Fire Stick was one of the best purchases I’ve made in a while. It was a gift for my wife and she just loves it. Now all of our televisions are streaming Netflix. There’s a lot more available on the Fire Stick than we expected.The Fire Stick was easy to install on our TV and it hooked right up to our wireless network and began streaming within minutes.", "verified": true, "helpfulness": "0/0", "author": "Phillip Floria"}, {"rating": 4.0, "review": "Great device to stream to your TV, setup is a snap, lots of free prime movies and shows, looking forward to more.  Just remember to use your free 30 days of prime before purchasing prime.", "verified": true, "helpfulness": "0/0", "author": "Gregg M Szafran"}, {"rating": 4.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Ian Williams"}, {"rating": 5.0, "review": "Stop buying cable or satellite. Best quality videos,movies!  My favorite gift. My whole family fell in love with this .Apple is attempting to copy it. The world of entertainment just took a major shift in quality and choice.  Even Hollywood has been put on notice. Take a quantum leap or recede into history.", "verified": true, "helpfulness": "0/0", "author": "Lucy Mcoosie \"OleetaJ.Hays\""}, {"rating": 5.0, "review": "Is better than I expected.  Easy Easy set-up and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Nicole C."}, {"rating": 5.0, "review": "The Fire TV stick works great and easy to install!  So glad not to have to buy computer cords and hook it up the old way!", "verified": true, "helpfulness": "0/0", "author": "Teri M"}, {"rating": 4.0, "review": "nice product and nice picture.  i use it mostly to watch hulu+, netflix, and amazon prime.  the picture is very clear and it's easy to use - pretty much plug and play.  Just attach everything in (it's intuitive what plugs into what), plug this into the wall socket and TV HDMI, then connect to your wifi, add the channels you want (and username/password if applicable) and it's good to go.", "verified": true, "helpfulness": "0/0", "author": "Kid T"}, {"rating": 5.0, "review": "The Fire stick was supra singly easy to install and use.  I have amazon prime and hulu plus. I was able to install the stick and set it all up without difficulty. It already had my amazon prime loaded onto it. Now I no longer have to watch from my laptop. The Fire stick was an excellent idea and very affordable.", "verified": true, "helpfulness": "1/1", "author": "Lisa W."}, {"rating": 4.0, "review": "This is a great way to add  I your Amazon based devices. I've owned a Kindle for 3 years and adding the Fire stick allows me to stream my movies and music from any media source now.I give it 4 stars because I too have had a problem with it disconnectimg from my router.  I had 4 bars on my phone and lap top when the Fire tells me it can't find home and to check my router...When I reboot the Fire Stick it reconnects without a problem... So, yeah there's that.", "verified": true, "helpfulness": "0/0", "author": "Charles Dartt"}, {"rating": 5.0, "review": "The Fire Stick is great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Anderson \"Car Guy\""}]