[{"rating": 2.0, "review": "I am giving this device two stars because when it works it is great. I love that I don't have to have cable to my tv and I can use this to stream tv shows and movies. I also love that I can have iheartradio on my tv. However two weeks after I started using the device any time I try to stream tv or movies using both prime and Netflix is comes up with a blue screen and says hdcp unauthorized. content disabled. Really annoying. It takes me about ten minutes of going through and switching apps and unplugging stuff before it starts to work. It wouldn't be that big of a deal if I knew how to fix it right away, but no one thing ever fixes it twice in a row. I got it for $19 dollars when it first came out and the set up was easy. But I would not pay full price for this even at $39. I was thinking of trying amazon fire tv for my other television but I don't want the same issues with the more expensive unit. Hopefully this issue can be fixed.", "verified": true, "helpfulness": "2/2", "author": "Stephanie"}, {"rating": 5.0, "review": "The Fire stick works better than I expected. I am able to pull movies and shows off of my internet. I recommend it to anyone who wants to upgrade their tv to a smart tv. It is a great product.", "verified": true, "helpfulness": "0/0", "author": "1888 Fan"}, {"rating": 3.0, "review": "my fire stick works great but I am unable to get video when I switch back to HDTV 1, the fire stick is on HDTV 2, the TV screen is on, the cable box is on and I have a sound bar so I get great audio. I tried disconnecting the firestick and checked all the wires, but no luck,watched about 8 episodes of House of Cards but I need to get my cable video back, anybody have any ideas?", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 3.0, "review": "Let me start by saying I am a big Amazon user.  I am a Prime member, shop Amazon on a weekly basis and use most of the Prime services, so when I saw that I could try this Fire Stick out at the introductory price of $20, I jumped on it.  I \"cut the cord\" a while ago and do not have cable TV, so we use high speed internet to stream all of our content (Amazon, Hulu and Netflix) to our 3 TVs.  I didn't need this Fire stick since we were already using a PS3, a blu-ray with streaming apps and a ROKU, but for $20 I thought it might work better than my blu-ray player and would be a great backup.Setup was a breeze and the responsiveness was an upgrade from my basic ROKU and blu-ray player.  I have a USB port on my TV so I was able to power it from there instead of having yet another device plugged into my power strip.  The remote is well laid out and responsive (most of the time, see below).  I also like being able to do voice searches from the Fire Android app.I figured that the Fire Stick menus would be somewhat Amazon specific, but it is straight up dominant.  The entire menu system is set up around Amazon and the other streaming apps are tucked away as an afterthought.  Since I use most of their services, I will benefit from this, but if I was looking for a ROKU replacement, I would be severely disappointed.I have also suffered from the \"HDCP unauthorized. Content disabled\" issues that some others have complained about.  Basically when trying to view content from Hulu or Netflix, you will get a blue screen with this warning across it.  From internet research, it appears that this may happen with older TVs.  My TV is not ancient (Sony KDL-46Z4100/B), but is about 5-6 years old and there have been no issues with any other manufacturers equipment.  It appears that a fix is to unplug all your HDMI devices and the power to everything and plug it back in.  This worked for a day and I got the error again.  I unplugged everything again and it went away.  I don't know if this will be a reoccurring hassle, but if so, this thing will become useless to me.One final issue is that when playing some games, I have had the entire unit lock up on me.  The home button would work, but the controls for a very simple game would not work.  I had to exit out and try again.  Overall, i really wanted to like this Fire Stick, but its become more of a hassle than a pleasure.  I'm hoping a future firmware update will resolve some of these problems.  Since its currently working, I give it 3-stars.  If the HDCP issues continue, I'll give it 2-stars.  If a firmware update fixes some of the issues, I'll give it 4 stars.  Revamp the menu system to make it easier to access, sort and search 3rd party apps to get a 5-star rating from me.UPDATE: I have a receiver as part of my Sony HTCT550W Sound Bar that had an extra HDMI, so I plugged this into that and the HDCP errors went away.  This was only about a year or so newer than the TV, so I still feel that it should have worked in the back of my TV, but I am happy its working now.", "verified": true, "helpfulness": "7/7", "author": "Chilehead Craig \"Captured Moments are the Spice of Life\""}, {"rating": 4.0, "review": "Decided to buy this instead of replacing my smart Blu-ray player. Sony decided to intentionally not support profiles in Netflix in order to get you to buy one of their newer models. I decided to do this instead. The app on the iPhone needs a little work, but overall the main unit runs pretty seamless. One caveat is that there isn't an easy way to tie this into your speakers unless you have an extra HDMI port on your receiver but this is the value option so... that probably makes sense. I expect this to only get better if they decide to push any updates in the future.", "verified": true, "helpfulness": "0/0", "author": "D. Hubby \"Darkshin\""}, {"rating": 4.0, "review": "5 stars once hbo go app is released.", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "I have had a Roku for several years and was so happy to have access to Netflix, Amazon Prime, Hulu Plus as well as other applications.  Acquired the Fire Stick recently in order to have access to these same applications on a secondary TV.  I was so pleasantly surprised after a quick and easy set up to have the same applications that I have on Roku available on the Fire Stick.  What I didn't expect was how much quicker the downloading of programing is and how much cleaner not only the picture and sound is as well.  What is also incredible is the cost of the Fire Stick is by far more affordable.  I am not a gamer so I am not in a position to address the merits of the Fire Stick versus Roku.  I use both for movies and TV programing and the Fire Stick is superior in its delivery.", "verified": true, "helpfulness": "0/0", "author": "John J. Schubert \"Schubej\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "BC"}, {"rating": 5.0, "review": "Nice... :)I don't own a competitors version so I can't say anything about that but comparing specs to specs, this WAS the better choice.", "verified": true, "helpfulness": "0/0", "author": "Edward Moreno"}, {"rating": 5.0, "review": "Everything loads so fast I love it.", "verified": true, "helpfulness": "0/0", "author": "anthony henson"}]