[{"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Felipe Díaz Alvarado"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Larry J. Lozon"}, {"rating": 5.0, "review": "It is working very well. We now can move it to any tv with no wires or issues. We are getting lots of use out of it.", "verified": true, "helpfulness": "0/0", "author": "Kimberly \"texasbluebonnet\""}, {"rating": 3.0, "review": "Recently purchased the Fire TV stick and I am very disappointed.  While the features are great, especially being able to verbally call up movies, I have found that when movies play, the scenes shot at night or in dark rooms are virtually impossible to see.  I tried adjusting the TV's brightness and other controls to no avail.  I have a Roku player on my TV up front and I do not have that problem.  The TV I had the Fire Stick on was a Samsung 27\" LED, and the TV with the Roku on it is a Samsung 37\" LCD.  i am going to try another similar product and see if that makes a difference. .", "verified": true, "helpfulness": "0/0", "author": "Billf"}, {"rating": 5.0, "review": "Has worked flawlessly over the last few months since purchased! No bandwidth issues streaming movies or music.  For anyone with Prime this is a great purchase and already has been well worth the purchase price.", "verified": true, "helpfulness": "1/1", "author": "Kevin B Muhich"}, {"rating": 5.0, "review": "This device is awesome. I give it a 5 star. It's very fast, I like the processor speed, the memory is a decent amount. I'm glad I bought this and as as gift for mother's day. More faster than the Roku 2 box and cheaper in price . I recommend this to anyone. Buy it, it's awesome! Worth the price .", "verified": true, "helpfulness": "1/1", "author": "Anthony"}, {"rating": 5.0, "review": "Works grate I have not had any problems with at all.", "verified": true, "helpfulness": "0/0", "author": "Paul R. Tyler"}, {"rating": 4.0, "review": "I like it. it works ok. I wasnt a fan of the remote, so i use the app on my iphone 6. The app works alright, and better than the remote.  A problem is that it works through the wifi and it seems like it has to reconnect every time you do something else on your phone.", "verified": true, "helpfulness": "0/0", "author": "matthew corliss"}, {"rating": 5.0, "review": "A great alternative to cable. I love having Amazon Prime, Netflix, etc at my finger tips on my \"non-smart\" TV. And a great price!", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "So far this streaming device is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "rocco costa"}]