[{"rating": 5.0, "review": "loving it but wifi just a little buggy with Plex other apps fine.", "verified": true, "helpfulness": "0/1", "author": "Green Monkey"}, {"rating": 5.0, "review": "Got mine a bit earlier than expected with the pricing from being a prime member. So far so good. I do wish the power plug was on the end like the roku stick, but it works. Also, noticeably faster to startup compared to the roku stick. I gave that one up for this and it seems like a good trade. I'm just waiting for HBO2GO on this and I'll be set.", "verified": true, "helpfulness": "0/0", "author": "haruman \"haruman\""}, {"rating": 5.0, "review": "The Fire stick was easy enough to set up. It took several attempts to connect to my wifi. You will definitely want to use the ac power cord or the Fire stick will fire up each time you turn the tv on. The remote is easy to use and the program is simple to maneuver through. So far, I love it!", "verified": true, "helpfulness": "0/0", "author": "Kristen Coble"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "FLOYD"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Conejita \"Conejita\""}, {"rating": 5.0, "review": "Works great! I have a Google chrome and like the fire stick more. It's faster and easy to navigate. Will be buying another for basement tv.", "verified": true, "helpfulness": "0/0", "author": "Gregory V."}, {"rating": 2.0, "review": "I'm only giving it only 2 stars because of an annoying feature that I can't seem to shut off.After watching a TV episode on either Amazon prime or Netflix it automatically starts the next episode, what if I don't want to watch the next episode? And yes I did check all the settings..", "verified": true, "helpfulness": "0/1", "author": "ET"}, {"rating": 4.0, "review": "Fairly easy setup.  Great device for the money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Everything i needed thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "penman"}, {"rating": 4.0, "review": "Good for.it use.", "verified": true, "helpfulness": "0/0", "author": "Terina Davis"}]