[{"rating": 3.0, "review": "I have problems with youtube loading but I can watch the movies with it barely buffing. Overall its ok but could use better and faster loading time", "verified": true, "helpfulness": "0/0", "author": "cliffford jones"}, {"rating": 5.0, "review": "I now cannot live without my Fire Stick.  AWESOMENESS!", "verified": true, "helpfulness": "0/0", "author": "Gilbert Ulpindo"}, {"rating": 4.0, "review": "Great piece of hardware! Easy to setup, works great with my television, so much to offer and not enough hours in the day to see everything it offers! Well with the the money", "verified": true, "helpfulness": "0/0", "author": "Tom Doyle"}, {"rating": 5.0, "review": "i love it!", "verified": true, "helpfulness": "0/0", "author": "elvin"}, {"rating": 5.0, "review": "LOVE IT.  Easy to install, easy to use.  Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "C. Hobbins \"book, movie, & comfy things enthusiast\""}, {"rating": 3.0, "review": "After using this stick for awhile I am not supper impressed by it. Currently I much prefer my Roku stick and there is one big reason why. All the optional or hidden channels that you can access through Roku. Amazon does not have anything like that and honestly that is what is killing the Fire TV Stick for me. I understand the desire of Amazon to be able to control what content a person can utilize by their product, I have an iPhone 6 and that is something Apple is famous for doing. Still though, when the leader in the industry offers more options right away, it should tell Amazon that they needed to do the same thing. It's not a bad product if you haven't used any other internet TV streaming option before, it is just lacking if you have. Yes I know I can play games with this, and I do, it isn't what I watch tv for though.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "We love the Fire TV Stick, it's fantastic.  We used to run a long HDMI cable across the room from our MacBook Pro but now this Stick eliminates it.  The remote is great and it's all responsive, quick and high quality image.", "verified": true, "helpfulness": "0/0", "author": "azwacorban"}, {"rating": 4.0, "review": "Easy to set up. Sometimes the Wi-Fi Connection is interrupted, despite being very close to my router, usually resolves itself. There has been 1 time where it became completely unresponsive, so I unplugged the unit from my tv and wall and then plugged it back in again and it worked fine. I got this for $19, so I really can't complain.  Love how easy it is to stream Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 4.0, "review": "very good for watching amazon prime instant video content. meh for everything else.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]