[{"rating": 5.0, "review": "I absolutely love this.", "verified": true, "helpfulness": "0/0", "author": "Jessika Ugarte"}, {"rating": 5.0, "review": "So glad I bought it! We are getting rid of our cable now that we have this. I can watch all my shows through Amazon, Netflix, and Hulu now so no need for the cable bill! Highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "T. Quinn"}, {"rating": 3.0, "review": "Had a hard time setting this thing up. After it was step up it would loose connection to my internet. My wireless router was only 5ft away. I had to reset the stick a few times. After it finally keep the memory and wouldn't loose connection to the wireless, I got a pop up saying that it was experiencing slow internet. I have 50MPBs down/ and 10up. Not sure why I am having this issue. But once it works, it works well. So 3/5 for now until I am done playing around with it.", "verified": true, "helpfulness": "0/0", "author": "Epicmaster"}, {"rating": 5.0, "review": "Great easy way to catch all my favorite shows amazon prime hulu plus and netflix", "verified": true, "helpfulness": "0/0", "author": "Daniel Edwin Bortner II"}, {"rating": 5.0, "review": "Exceeded ALL expectations- took with me on the road- watched youtube on my tv all night long in my hotel room, along with the effortless viewing of my movies in my ultra-violet collection", "verified": true, "helpfulness": "0/0", "author": "Kevin P."}, {"rating": 5.0, "review": "Great and responsive. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael Armanious"}, {"rating": 5.0, "review": "I LOVE THAT I CAN STREAM MY SHOWS AND MOVIES DIRECTLY FROM MY TV.", "verified": true, "helpfulness": "0/0", "author": "Kimber"}, {"rating": 5.0, "review": "Bought the stick from Bb as an open box return, awesome deal.Works as well to watch t.v. as full size Amazon fire t.v. or a rokuI would recommend to anyone looking for a streaming stick.", "verified": true, "helpfulness": "0/0", "author": "Son of the Most high"}, {"rating": 2.0, "review": "It over heats and doesn't pick up the signal even went the device indicates the signal is good.", "verified": true, "helpfulness": "0/0", "author": "Carolyn"}, {"rating": 5.0, "review": "Easy to install if your savy to wifi.  Logged on and began exploring.  Great choice in Prime and have already seen more movies this week than the prior year.", "verified": true, "helpfulness": "0/0", "author": "Sailor"}]