[{"rating": 3.0, "review": "Freezes frequently. Other than that, it's a good product.", "verified": false, "helpfulness": "0/0", "author": "Kathlene Longstreth"}, {"rating": 5.0, "review": "Great product, fast acting, very pleased.", "verified": true, "helpfulness": "0/0", "author": "William H. Cook"}, {"rating": 5.0, "review": "Love the fire stick. Have a chromecastBut that doesn't have a remote.", "verified": true, "helpfulness": "0/1", "author": "Veronica Matteucci"}, {"rating": 5.0, "review": "I bought it expecting to mostly use it to stream movies, but it turns out that this little stick packs a punch and can play some really decent games too. Awesome device.", "verified": true, "helpfulness": "0/1", "author": "Pascal"}, {"rating": 5.0, "review": "I have not used it much so far.  However, I can say that setup was easy, just followed the instructions.  Fire TV gives us access to a number areas we did not have before. Looking forward to enjoying it.", "verified": true, "helpfulness": "0/1", "author": "Ron Osborne"}, {"rating": 4.0, "review": "The Fire Stick is a slick little device and worked great once the software update was complete.  But like other people who complained online, I had problems getting it to update it's software the first several times I tried to set it up.  It would stop updating about 75% of the way through the process.  I did an online search and one user mentioned installing the Fire Stick in HDMI1.  I tried that and it finished the update quickly.  I don't know why that solved the problem but it did.  Other than that, I have been happy with the performance and I really like the remote that comes with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Very easy to hook up. Amazon cloud drive works well. Unlike some reviews said it can be organized now.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great picture easy to use.", "verified": true, "helpfulness": "0/1", "author": "Josh"}, {"rating": 5.0, "review": "Pleasantly surprised!! I have had a chromecast for nearly a year now and it has survey its purpose but this is so much cleaner. The menu system is really user friendly the remote is actually very useful. The only complaint I have is the need for the usb to be connected to a power outlet and not just the USB connection on my TV. I enjoy the apps that are available I would recommend this item to anyone.", "verified": true, "helpfulness": "0/0", "author": "Marcelle Budnick"}, {"rating": 5.0, "review": "I might order another one... I love it", "verified": true, "helpfulness": "0/0", "author": "elizabeth huerta"}]