[{"rating": 1.0, "review": "No video downloads or scheduled preloads allowed, it's does streaming only despite misleading marketing.  The \"storage space\" so widely promoted is not available for customer use, a fire stick team tech told me tonight the 8 gig storage space is entirely consumed by operating system and firmware/system software.  To be clear, this amazon fire stick specialist confirmed that this stick does steaming only, no downloads, no preloads' no scheduled data buffering, all you can do is stream live, so if you already have a computer then an hdmi cable is a cheaper way to get much more functionality and user control.  This device is only worth purchasing if  you don't own a computer or prefer to travel without one, and if you have unlimited unmetered Internet data whenever you wish to view a video. Otherwise it's a useless waste of money that is harder to use and much less functional than your computer with a plain old cheap hdmi cable.", "verified": true, "helpfulness": "0/0", "author": "Andrew Thomson \"12 year amazon customer\""}, {"rating": 3.0, "review": "the product is ok it's the service that is lacking", "verified": true, "helpfulness": "0/0", "author": "Peter Massaro"}, {"rating": 4.0, "review": "I purchased the stick since day one.  The initial setup was quite easy. There are not as many Tv apps available as the Fire TV box.. e.g. there is no Fox or NBC... there is, however, PBS, Smithsonian, CBS news.  We don't pay the subscription like Netflix or Hulu.. so TV streaming apps are quite important for us. It has easy access to amazon prime videos and music. It's very handy and bring it to hotels too... However, right now we still have to steam it from the cell phone hot spot because as of right now (end of Feb 2015) it is still impossible to use fire stick in places that requires login for internet connection. I hope amazon will make this feature available soon as it promise on its fire tv stick page.", "verified": true, "helpfulness": "1/1", "author": "whimseyland"}, {"rating": 3.0, "review": "Still working on it to see if I can access everything I like to watch. Have to switch it out with cable to use it, if it works well I plan to disconnect my cable. It does get very warm when plugged in... is that normal?!?", "verified": true, "helpfulness": "0/0", "author": "Tina M Germany"}, {"rating": 5.0, "review": "I love it, the best perches i've made!", "verified": true, "helpfulness": "0/0", "author": "forevermore"}, {"rating": 5.0, "review": "I have recommended a Fire Stick to several friends.", "verified": true, "helpfulness": "0/0", "author": "Don Dodson"}, {"rating": 5.0, "review": "Arrived ahead of schedule, was very easy to install, works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "BSJ"}, {"rating": 5.0, "review": "Daddy and I watch something on it at least one a week or more. Worth every penny 😃", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amy Clark"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "cheryl corriveau"}]