[{"rating": 5.0, "review": "Love this! We can access our Amazon Prime videos quicker and easier than through the browser on our Google TV. It's even easier to watch our Netflix on the Fire Stick than through the Netflix app. And we can quickly and easily move it to our TV in the bedroom or any other TV with a USB plug. Very happy with it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I was very pleased I have Comcast but not in the bed room so the fire stick really came in handy I can enjoy movies now sports games an more good job amazon two thumbs up thank you.", "verified": true, "helpfulness": "0/0", "author": "eric l kendrick"}, {"rating": 5.0, "review": "Fire TV stick is terrific.", "verified": true, "helpfulness": "0/0", "author": "Peanut12"}, {"rating": 5.0, "review": "Great! Many options. Love it. Just glad I have a 20 something grandson who hooked it to my cell phone. Love Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "cujosmom"}, {"rating": 5.0, "review": "Easy to \"install\" such as it was, just plug it in & go & works easily too.", "verified": true, "helpfulness": "0/0", "author": "geri srite"}, {"rating": 2.0, "review": "This might be a great device. But unless you have a tv 2 years old or newer.... it's likely NOT to work. This is something that you would THINK the product description page would mention but nooooooooooooooope. So make sure it will be compatible with your tv before you buy. my tv is only 3 and a half years old, so its not like its ancient or anything....and.. for the record... amazon does not want to publish my true, not mean or nasty but not product flattering, review. Which makes me question all the reviews I see now.....", "verified": true, "helpfulness": "0/0", "author": "Ocracoke Bound \"Eternity begins and ends with the ocean's tides...\""}, {"rating": 1.0, "review": "No", "verified": true, "helpfulness": "0/0", "author": "Alex Rodriguez"}, {"rating": 5.0, "review": "Amazon did good job in  hardware and let it do anything", "verified": true, "helpfulness": "0/0", "author": "reinaldo b."}, {"rating": 5.0, "review": "It was already set up for my account, simple to install, and now I can watch my Prime movies on the TV besides my kindle fire HDX!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "so far, we are very impressed with the offerings, and the ease of use.", "verified": true, "helpfulness": "0/0", "author": "M. E. Osburn"}]