[{"rating": 5.0, "review": "It's good. Works well. We haven't used it too much but overall everything with it has been fine.", "verified": true, "helpfulness": "0/0", "author": "YelenaHeart"}, {"rating": 5.0, "review": "LUV IT SO FAR.", "verified": true, "helpfulness": "0/0", "author": "Stuart M Saine"}, {"rating": 5.0, "review": "This little guy is amazing! Easy to use straight out of the box, but also runs sideloaded android apps.The remote is a great addition, and oddly enough makes flappy bird pretty darn fun :)Hopefully a remote friendly browser is built for those annoying hotel splash pages, otherwise a sideloaded install of Firefox will have to suffice.", "verified": true, "helpfulness": "0/0", "author": "Phillip A."}, {"rating": 5.0, "review": "Was pleasantly surprised.", "verified": true, "helpfulness": "0/0", "author": "Doug Burke"}, {"rating": 5.0, "review": "Great added dimension to watching TV.  I'm so glad I'm a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Kootchy"}, {"rating": 5.0, "review": "Yes, you do need this if you don't have a smart TV or are the least bit unsatisfied with your smart TV's (or blu-ray player's) streaming apps, or if you want to see your pictures and, above all, if you use Amazon Prime for streaming.  The ASAP technology really speeds up the start of any Prime video.  I didn't do any stopwatch tests but I would guess the start-up time is less than a 10th of what it was using my TV's streaming app.Another reason you want this is the WiFi seems to be faster than with other devices.  I couldn't find definite answers on the net, but my TV stick connects to my newer 802.11ac router using the higher frequency channel.The cute little remote is nice and works well.  It is not fun to enter search data or passwords with it, but I hope to do that with a tablet I've ordered.  Still, I bet you don't use it for much data entry.  I also played a game with it and found that the center button \"bounced\" (made 2 clicks when I hit it once).  Again, if you're a serious gamer, you'll want to upgrade the remote (or maybe use a phone or tablet).There was only one minor problem.  The Fire TV Stick gets a little confused about what episode of my favorite series is next.  It did this with only one show--the others seem ok.  But never mind that.  You can scroll through the episodes (with pictures for each one) in almost no time by simply holding down a button.  This thing is amazingly responsive.What about picture quality?  The programs look as good as you can imagine.  I briefly had a cable modem problem and the image quality got poorer (doubtless, the Fire TV Stick was attempting to match the video quality to the reduced bandwidth).  But normally, the images are very sharp and the sound is great.  The images on the menus look phenomenal as well.As far as the apps go, I only tried the YouTube app.  This is really nice.  It gives you lots of relevant choices and they are well presented.  Everything on the menu screens is sharp, pleasing to look at and fast.Setup is simple and easy.  You will need an AC outlet within 5 feet of your TV.  Either an AC extension or a micro USB extension cord will be required if you don't.  Because the Fire TV stick plugs into a wall outlet, activating it with the remote can turn on my TV (this is convenient).  Unless it was a gift, it comes linked to your Amazon account, which is nice and avoids a step in the setup.I have a Google Chromecast and it just doesn't do nearly as much as the Fire TV Stick with its remote, which I find to be more convenient.  All in all, this is a phenomenal product that is really nice.", "verified": true, "helpfulness": "1/1", "author": "BWK"}, {"rating": 5.0, "review": "Simple and easy setup. Amazon Prime have a ton of movies and tv shows to watch. With this device it makes it fun. In addition, it works really well with Plex. I run plex on my ipad and use it as a remote that outputs to the Plex app on the firestick.", "verified": true, "helpfulness": "0/0", "author": "Luda"}, {"rating": 5.0, "review": "Fantastic product.  I received my fire stick yesterday and within 5 minutes had it set up.  For me, that says a lot!  Instant access to Amazon prime and netflix.  I should probably deduct a star because due to the ease of use I will probably be watching more tv.  For the price, you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Nicole Vanderwolf"}, {"rating": 4.0, "review": "I use this in one slot and the Chromecast in the other.Advantages equal.While this doesn't allow me to stream files from my phone or computer like the chromecast does (correct me if there is a way), netflix and amazon prime works better here, since it's also not streaming from my phone.Both the remote and the app remote work well.The software is responsive, but I think it's a little confusing the way it is organized.I haven't tried it plugged into the TV via usb, but if you plan to use it that way be warned Amazon asks you to plug it into the wall. Mine is and it still asked me to do that, so I'm not sure if this is a glitch or not.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Reyes"}, {"rating": 5.0, "review": "Great value for money", "verified": true, "helpfulness": "0/0", "author": "Awwab"}]