[{"rating": 5.0, "review": "Has everything I needed.", "verified": true, "helpfulness": "0/0", "author": "Marisela Díaz"}, {"rating": 5.0, "review": "easy setup cancelled the movie channels on fire stick now", "verified": true, "helpfulness": "0/0", "author": "Clarolopez"}, {"rating": 5.0, "review": "we love it so far. start up was simple and it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tyla Berger"}, {"rating": 4.0, "review": "It works well.  Would give it 5 starts but I have to reboot it sometime to get it to connect to wireless.", "verified": true, "helpfulness": "0/0", "author": "useless"}, {"rating": 5.0, "review": "Easy to use.  I like the remote that came with it.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Mims"}, {"rating": 4.0, "review": "An amazing piece of technology.  I will be so relieved when I can get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Loretta A. Estrella"}, {"rating": 2.0, "review": "Was basically just access to more pay per view movies, not much at all and poor ability to find any free content. I got this on sale, but have not found a single use for it. Even old movies such as scarface, happy gilmore, goodfellas, caddyshack all were pay to view. Sorry, i can get same thing on my regular internet or nextflix", "verified": true, "helpfulness": "0/0", "author": "Hemlock256"}, {"rating": 5.0, "review": "I decided to get rid of my satellite and ordered one of these to use instead.  I'm not sure why I waited to long!  I loved it so much that I ordered a second one to have in my bedroom.  My son enjoys watching shows with it but also loves the fact that he can play video games as well.  I've rarely had issues with it and when I have, it has been issues with my internet and not the stick itself.  I would highly recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Amanda K Plotner"}, {"rating": 4.0, "review": "We like the movies on the big screen However stick seems to get very hit and will freeze up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Not sure how I lived without it before.", "verified": true, "helpfulness": "0/0", "author": "MomMedic"}]