[{"rating": 4.0, "review": "I purchased a fire tv a while ago and was extremely happy with the decision. The fire tv is so easy, even people who want immediate \"instantly working\" devices are able to get the device working. I ended up moving the fire tv upstairs and my parents use the thing every day. Unfortunately, that also meant that whenever I wanted to use the device, it was already taken. Rather than fight them for it, I thought I would purchase the fire stick. It seems to be extremely popular at the moment, and I can see why!The fire stick, even without the voice over remote, works perfect. The only complaint I had is that there was no direction to put the batteries in the remote, nor were there any directions on how to open the back of the remote. Aside from that, set up took less than 20 minutes. I did notice that there was a big difference between the picture on the fire tv and the picture on the stick.The fire tv has a clearer picture, while the stick does it's best, but gets a bit fuzzy at times. I do like that there is no HDMI cable required with the stick (part of the reason I got a stick, rather than another fire tv) and I like that there are apps you can get, which allow you to play or stream music and audiobooks straight from your ipad. So even if you don't have a kindle fire, the device can be tricked into using airplay mirroring technology (just look at the different apps available). I'm extremely happy with the fire stick & the fire tv, and plan to use the fire stick for personal use while leaving the fire tv for family use.", "verified": true, "helpfulness": "0/0", "author": "Mary Greenman \"book lover, audio listener\""}, {"rating": 5.0, "review": "All information has proven to be true. Works great and my family is really enjoying all the features. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "vic"}, {"rating": 4.0, "review": "It works well, since the captive portal update, I have no major complaints. Some minor hiccups scrolling through apps occasionally occur and more apps would be nice. Other than that, it is a no brainier for $19 offered to early birds. For $39, some other alternatives might be worth a look at, but it still is worth it's price. The miracast feature does not work well with my android devices; it is enough for showing photos or stills, but almost unwatchable when trying to show videos. With software updates, and additional time for apps, it will hopefully get better.", "verified": true, "helpfulness": "0/0", "author": "Sanhonymous"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "Barbara Ricci \"cheepskate\""}, {"rating": 5.0, "review": "Side loaded XBMC and good to go.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Teri A Tompkins"}, {"rating": 2.0, "review": "Not nearly as nice as Roku.", "verified": true, "helpfulness": "0/0", "author": "Shootability \"Sol\""}, {"rating": 5.0, "review": "Great little device that is easy to hook up, even for a 70 year old. Just follow the short instructions that come with it. The remote was the clincher for me so that I could select and control on the TV what we streamed from the computer with Wifi, such as Netflix. You may need help opening the remote's battery pocket. It fits so tightly from the manufacturer that it took the fourth person to get it to slide open. It takes a little practice to figure out how the remote works, but then it's easy.", "verified": true, "helpfulness": "0/0", "author": "Nana"}, {"rating": 1.0, "review": "Not simple to set up and not easy to use. It was next to impossible to open the remote to put in batteries. You need a knife and a lot of pressure to open the remote. After plugging the fire stick into the HDMI outlet on my 6 year old Sony TV, I got... nothing. I called for assistance and they were very helpful and will be sending another fire stick, but I don't believe that one will work either since I'm fairly sure at 6 years old my Sony is not compatible with the fire stick. It would be helpful if Amazon could list the TV's the fire stick is compatible with and if yours isn't on the list, you can pass on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "M. T. Wilson"}, {"rating": 4.0, "review": "Easy set-up and easy to maneuver on screen.  Good choice.", "verified": true, "helpfulness": "0/0", "author": "Leonor Ortiz"}]