[{"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Wetter"}, {"rating": 4.0, "review": "Got it mainly for sling TV considering it was free with 3 months service. The device itself is ok but the UI needs some smoothing and more logical layout.", "verified": true, "helpfulness": "0/0", "author": "Raver.vanc3"}, {"rating": 4.0, "review": "Yes..met my expectations. .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "well..didn't really work. After just a week or so the picture on Hulu or Amazon kept lagging behind the sound. It would stop every minute or so and then sync back up...very annoying when you want to watch something...back to my Apple TV", "verified": true, "helpfulness": "0/0", "author": "Jimi  Gibson"}, {"rating": 5.0, "review": "Works very well. Will be fun to stream new things.", "verified": true, "helpfulness": "0/0", "author": "Donna Seymour"}, {"rating": 5.0, "review": "The fire stick met and exceeded all of my expectations", "verified": true, "helpfulness": "0/0", "author": "Bill F."}, {"rating": 5.0, "review": "This is the best yet from amazon", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Cateron"}, {"rating": 5.0, "review": "Quick, easy, convenient, and portable.  Great product for a t.v. that moves around the house frequently.", "verified": true, "helpfulness": "0/0", "author": "Daniel C. Brittain"}, {"rating": 5.0, "review": "When I upgraded my Samsung Smart TV with the built in software upgrade option it rendered the internet and widgets useless that I used to be able to access amazon prime movies with.  I went in search of something that would remedy that, because their tech support at Samsung told me it was not their issue it was Yahoo Widgets I needed.  (That isn't true - you can't even buy widgets from Yahoo-most likely Samsung can't afford programmers to fix that software upgrade that ruins your internet).  Anyway, this little Amazon Fire Stick remedied everything. It returned all my options like getting access to my Amazon Prime movies and Hulu Plus TV and now I am happy again.  There isn't a lot of difference between the Fire TV Stick and the Fire TV - you only need one or the other and I didn't realize that, so I bought both thinking they would work together.  Actually, I am keeping both because I can use Amazon Fire on the big tv (its remote has voice command and is a bit more convenient).  But the Fire TV Stick has most of the same features without voice command so I am using it on the smaller Samsung. I find both Fire TV and TV Stick have extremely high definition and nice selection of games, prime music, prime movies, Hulu TV and everything I really wanted.  Love both.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Great buy!  Has all the amenities of any other tablet and kid friendly.  Easy to set up parental controls.", "verified": true, "helpfulness": "0/0", "author": "Isaiah Rodriguez"}]