[{"rating": 3.0, "review": "It is almost what I wanted. I think I'm a little disappointed with prime.we should be able to watch more show/ movies with it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to hook up! Love it for our bedroom tv but it will be nice to take it with us when traveling too!", "verified": true, "helpfulness": "1/1", "author": "Kimberly S. Baldwin"}, {"rating": 4.0, "review": "A more Budget oriented approach to a media streamer. I bought this for use in my room so we could use the roku in the living room for dailyburn.com. Only problem with it is that its not really just the stick that plugs in, but you will need to have it plugged into an outlet also.", "verified": true, "helpfulness": "0/0", "author": "ealadin"}, {"rating": 5.0, "review": "Best device I ever bought..easy to install & operate. Choose what u want to watch when you watch it.", "verified": true, "helpfulness": "0/0", "author": "Patricia Bitzer"}, {"rating": 5.0, "review": "I can't wait for the hotel WiFi capabilities. For now, I am using my phone as a hot spot and this device is great.", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 2.0, "review": "Everything is great EXCEPT Netflix rarely works. It will work fine, and then suddenly titles will not load like there is a connectivity error. I check the Internet connection and everything is fine. I have to uninstall the app and reinstall it to get Netflix to work again (for awhile at least). If they fixed this I would give this five stars. Netflix is all I watch so I'm going with two.", "verified": true, "helpfulness": "0/0", "author": "Tyler Parks"}, {"rating": 3.0, "review": "I just got the fire tv stick today. Setting this up was a breeze. So very easy. It came with an HDMI converter - everything you need is in the box. I basically just wanted to be able to watch Netflix on TV (without a computer) and have no issues with that part of it. I didn't really get to navigate the rest of the programming. If I have any issues I will update my review.My only real issue is that I opted for free shipping. I ordered January 8 and it came on February 6. Almost one month. TOOK TOO LONG TO SHIP. If you don't want to wait a month opt for something other than the free shipping.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Keeps losing connection - only 9 Ft. from router. - Tried everything to get it working - 4 diff. wifi stations, great product when it worked, but that wasn't very long. At least Amazon is letting me return for refund.", "verified": true, "helpfulness": "0/1", "author": "Larrylsmall"}, {"rating": 5.0, "review": "Awesome. Its so easy to use and the WiFi reception is great!", "verified": true, "helpfulness": "0/0", "author": "Danielle Farris"}, {"rating": 5.0, "review": "Really like the features, and ease of use. Setup was a snap.", "verified": true, "helpfulness": "0/0", "author": "Dale Wilson"}]