[{"rating": 2.0, "review": "Can't get the audio? I'll try again.", "verified": true, "helpfulness": "0/0", "author": "Larry Well"}, {"rating": 2.0, "review": "I thought this was the coolest thing, so I ordered two.  The remote and interface are good, but the playback is not smooth.  The frames witll freez momentarilly, and then the video will catch up by playing quickly for a moment.  Either my network just happens to have problems only when I'm watching on the fire TV stick, or it's the device.  I never have these issues streeming videos on my computer, I have them every time on the Fire.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "Very happy with all the variety and super easy to set up  and use", "verified": true, "helpfulness": "0/0", "author": "Jim Ziegler"}, {"rating": 5.0, "review": "Love it. It's great", "verified": true, "helpfulness": "0/0", "author": "Leslie Gaines"}, {"rating": 4.0, "review": "The stick comes preloaded with many popular apps.  I think in time it will prove a one stop place for my online viewing, however the start menu and remote aren't easy to navigate at first.", "verified": true, "helpfulness": "0/0", "author": "sarah white"}, {"rating": 5.0, "review": "I bought this to watch Bosch movies.  After I souped up my modem, it works great.", "verified": true, "helpfulness": "0/0", "author": "Marven Riggins"}, {"rating": 2.0, "review": "We have two Kindle Fire's and a Roku Stick.  After cancelling cable I purchased a Fire TV Stick for our second TV.  As we almost exclusively use the Roku for watching Amazon content, I was hoping the Fire TV Stick would deliver.  Unfortunately, it did not. Compared with the Roku the loading speed, connection quality, time to connect and overall ease of use was lacking.  I returned it and will be purchasing a second Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Thanks.", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Long"}, {"rating": 5.0, "review": "Better than expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty amazing little device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]