[{"rating": 3.0, "review": "I did not think that it would require the extra AC plug to work.  It Auto pauses often.  I have not made it an entire hour of use without the show pausing automatically.", "verified": true, "helpfulness": "0/0", "author": "David G. Lawrence \"David\""}, {"rating": 2.0, "review": "Not really sure about this product yet. It works yet so far everything your interested in viewing cost money to view. I had to buy hulu at $7.99 and Amazon prime at $99 a yr to enjoy the Damn thing. I'm missing something here. Cables been ripping me off for yrs, so I figured I'd give this a shot. I'll follow up later on this one when I've learn more.", "verified": true, "helpfulness": "0/0", "author": "SGt Morris US ARMY"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "DEBRA  A  DAVIS"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Jose Manuel Rodriguez A."}, {"rating": 4.0, "review": "Works well, clear pictures etc. Some channels are a bit choppy though. A good product overall.", "verified": true, "helpfulness": "0/0", "author": "wahid0ne"}, {"rating": 5.0, "review": "Works great. I have Amazon Fire TV box, too. In fact, I had that first for my great room television. I just bought the stick for my bedroom. Wifi works great! The fire TV remote is quicker (I have it wired instead of wifi) and smoother, but the fire TV box is more like a PC (own processor and memory) as opposed to the stick which is not. All in all...I really like it a lot. Love amazon's Internet tv...I thought I'd be lost without cable. I don't miss it at all. I especially don't miss the $200 bill I'd get every month from Time Warner. I may even get another one for the kids playroom!", "verified": true, "helpfulness": "0/0", "author": "Frank Visca"}, {"rating": 5.0, "review": "Perfect just what I needed and at a great price !!!!", "verified": true, "helpfulness": "0/0", "author": "Malena"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Christopher Conmy"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "jose alberto trogliero"}, {"rating": 4.0, "review": "Lots of clicking with set up and all, but overall - OK.", "verified": true, "helpfulness": "0/0", "author": "Tiffany Gong"}]