[{"rating": 4.0, "review": "I use it to watch Plex.  The UI is a bit inefficient and there aren't many options, but it works reasonably well.It also worked with Kodi but that was pretty ugly.  You have to install it from your computer and it's very technical.  Then, to actually access Kodi on this, you have to do about 10 clicks through weird menus.  It's not worth it for Kodi.  That's why we switched to Plex.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "Awesome, I love it", "verified": true, "helpfulness": "0/0", "author": "Dorys"}, {"rating": 5.0, "review": "The fire stick is awesome! We cancelled our cable and switched to the Fire stick and haven't looked back! You really need a decent high speed Internet service to run this. We run it on 7 mbps and have a little issue while someone is gaming on the xbox. This has nothing to do with the fire stick tho. We love it!", "verified": true, "helpfulness": "0/0", "author": "TRT"}, {"rating": 4.0, "review": "Amazing totally worth for the amount of money I paid", "verified": true, "helpfulness": "0/0", "author": "Thomas murillo"}, {"rating": 5.0, "review": "I'm thrilled with the fire stick! I live way out in the country which limits my streaming options. This is great. Works so simply.", "verified": true, "helpfulness": "0/0", "author": "Sandra Johnson-harris \"art and craft lover\""}, {"rating": 5.0, "review": "Love the fire stick!!! it works great!!!! Had to buy another one so we could have one for our daughter tv and one for our tv.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Having the remote is definitely what sold me.  The remote's battery lasts so much longer than using my smartphone as the remote.", "verified": true, "helpfulness": "0/0", "author": "Thomas Ducusin"}, {"rating": 4.0, "review": "Hooked up to tv easy and set up and running in about 10 min. I want it for Netflix and have not used it for anything but that yet. Works well for that so far. I was using WII and that just sucked. Would hit and miss work. It seems to be a nice working unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"DOGON\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Melissa Ivy"}, {"rating": 1.0, "review": "Amazing streaming quality! It exceeded my expectations!", "verified": true, "helpfulness": "0/1", "author": "Jennifer"}]