[{"rating": 5.0, "review": "I love this thing.  Just set it up and it works great.  I just need to figure out how to mirror my LG GPad 8.3 LTE to it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kevin Cowan"}, {"rating": 3.0, "review": "Not anything special, in my opinion. I love tech and I love gadgets, so I bought this at its intro rate. It went into a drawer pretty quickly, since it does nothing that isn't already done by Roku and Chromecast. I found its interface to be clunky and unfriendly, and it seemed that it was pushing sales of digital media rather than facilitating my access to the media already offered in Prime.", "verified": true, "helpfulness": "0/0", "author": "julio"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Maryann"}, {"rating": 5.0, "review": "Very easy to set up. HD picture is great and surround sound is also great. I love the capability of showing my own pictures on the big screen", "verified": true, "helpfulness": "1/1", "author": "Howard"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Sean Snell"}, {"rating": 1.0, "review": "It worked for two days, but now we cannot get it to work in any of our TVs; Amazon sent us a replacement...still did not work.", "verified": false, "helpfulness": "0/0", "author": "Mark A."}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "kpalmer"}, {"rating": 5.0, "review": "Works great my android phone mirrors to it and gives a very good picture on my TV .was disappointed to find out the three kindles I have are the model before the one that will mirror to the fire stick should be an update or an app that would help with that. If there is please let me know.", "verified": true, "helpfulness": "0/0", "author": "Myron mccowan"}, {"rating": 5.0, "review": "Great device!!  Very easy to install.  Had a little trouble connecting to the internet, but once I got on, it works beautifully.  Now I can finally get more out of my Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Kramer"}]