[{"rating": 5.0, "review": "really cool, use it more and more each day", "verified": true, "helpfulness": "0/0", "author": "John Ropelewski"}, {"rating": 4.0, "review": "BEST BUY!!!! i love the fire stick! i did my research on the google chrome, rook, and fire stick. Im glad i went with this one!!", "verified": true, "helpfulness": "0/0", "author": "LewisLove"}, {"rating": 5.0, "review": "This device is amazing!!! First, it's cheaper and better than Apple TV (and I have two). Second, it loads much quicker than Apple TV. Third, the remote is very easy to use and very comfortable (unlike Apple TV).What I love most is the fact that if my husband and I watch a show in our living room using Amazon Prime on Smart TV, and then go to the bedroom, the Fire Stick remembers and let's us resume from where we stopped. It's also easy to turn off than Apple TV.The only bad thing I have to say is that Hulu doesn't work as perfectly as I would have hoped for. It's not Fire Stick's fault because Hulu does the same exact thing on my phone, but when I try to load the same episode on the computer, it works. I am guessing there is just a problem with Hulu streaming to the Stick or to the phone. It just stops you from watching the rest of the episode and won't let you unless you watch it on the computer.Overall, great purchase. I also recommended it to my friend who is now a happy owner of a Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Alexandra Mosiyachenko"}, {"rating": 2.0, "review": "Tried two separate Fire sticks, neither worked on two separate TVs.  Roku and chrome sticks did though.  The amazon hardware is just not up to snuff.  The first Fire Stick would not hold the network, the second never got past updating.  Both sticks where in same room as router, and other devices did work.  Gave One additional star because amazon phone operators tried to be helpful, but the hardware/firmware is worth only one star.", "verified": true, "helpfulness": "0/0", "author": "JWP \"Say something about yourself!\""}, {"rating": 3.0, "review": "i thank it could be better by not over heating  all the time but othere wise it works great", "verified": true, "helpfulness": "0/0", "author": "Foreverknight"}, {"rating": 5.0, "review": "Easy to use (and I'm not a tech person).", "verified": true, "helpfulness": "0/0", "author": "Vinita Hilburn"}, {"rating": 5.0, "review": "If you already have a Prime Membership, this purchase is a no-brainer! Pretty much plug and play. It is so easy to use that my 2 1/2 year old can almost operate by herself.  What a great value as a companion to your Prime Membership.  Also very convenient to stream directly to your tv.  My daughter loves the ability to watch her favorite shows on the big screen on demand!", "verified": true, "helpfulness": "0/0", "author": "J. Sinnet"}, {"rating": 5.0, "review": "We bought this for the guest bedroom.  So they don't have cable, they can watch 1,000s of movies and TV shows plus use our netflix account.  This is a ridiculously easy way to get entertainment on TVs as long as you have WiFi.", "verified": true, "helpfulness": "0/0", "author": "Terp Allan"}, {"rating": 5.0, "review": "Great buy! Very user friendly and is everything I hoped for", "verified": true, "helpfulness": "0/0", "author": "Carol J. SAnders"}, {"rating": 5.0, "review": "Works great with Amazon prime,so far so good.", "verified": true, "helpfulness": "0/0", "author": "Joe"}]