[{"rating": 5.0, "review": "Terriffic application. works great. Im sending them for gifts.", "verified": true, "helpfulness": "0/0", "author": "Brian Scully"}, {"rating": 5.0, "review": "This is exactly what I was looking for to replace paying for cable!", "verified": true, "helpfulness": "0/0", "author": "G Brodecky"}, {"rating": 4.0, "review": "Love it works better than my smart tv.", "verified": true, "helpfulness": "0/0", "author": "Terry Howard"}, {"rating": 5.0, "review": "Love it! AWESOME! Works perfectly! Easy, SUPER EASY setup! Price is awesome! Apps are limited to YOUR choices & taste! On a personal note, I use it in my room when I get \"kicked out\" of the living room. I get to watch my favorite movies, tv shows & my personal favorite, WWE Network! So by all means, get it if you're not \"ready\" or price range is still out of your reach for the smart tv's, or your smart tv has less than stellar performance in the streaming department! Awesome, easy, user friendly tech!", "verified": true, "helpfulness": "0/0", "author": "Victor Bourdon"}, {"rating": 5.0, "review": "Great better the n smart tv", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "We have been using it for about a week now and are very pleased with it. Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Sherry M"}, {"rating": 5.0, "review": "Great item to have!", "verified": true, "helpfulness": "0/0", "author": "Malori"}, {"rating": 1.0, "review": "So you need an active internet connection to use this?  Most TV's are already wifi enabled or able to connect to the internet.  If you already have a Amazon Prime account.  You don't need this.Now where this would be actually advantageous is that you use it to download programs and movies available on prime to the device and migrate it over to your tv or another media viewing source (i.e. laptop) at a location not able to receive a tv or internet broad cast and watch the downloaded content.  WOW!!!  No there is an idea.  No need to waste money on this when there are cheaper identical versions from other vendors providing the same content.", "verified": false, "helpfulness": "1/7", "author": "T. Rogers \"T Rog\""}, {"rating": 5.0, "review": "Fantastic product at a fantastic price.", "verified": true, "helpfulness": "0/0", "author": "Ricky W."}, {"rating": 5.0, "review": "Very nice! User friendly! Excellent gift", "verified": false, "helpfulness": "0/0", "author": "Laura Williamson"}]