[{"rating": 4.0, "review": "I had mega issues syncing with my home computer, but once I got the Fire Stick to work, it's dandy!  My only issue now is the downloading time or \"buffering\".  While I've only used this one evening, our show was constantly interrupted by the buffering.  I called Customer Service (both Amazon and Netflix), and both were extremely helpful. But I practically had to disassemble the entire operation to get going again.  I'm hoping the downloading issue levels out.  We've never used a streaming service, and the convenience of that is remarkable!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "Bought two of these for my daughters - they love them.  Great gift.", "verified": true, "helpfulness": "0/0", "author": "power ranger 1"}, {"rating": 4.0, "review": "Overall, a great piece of work.  A bit sluggish in its own menus though, which is probably what affects my star rating--down from a 5 to a 4.  It's actually annoying enough to drop it down one star. However, the functionality is great.  The remote suffers from the same little glitches that my parents' Amazon Fire TV's remote does.  \"Ghost clicks\" after releasing the directional buttons.", "verified": true, "helpfulness": "0/0", "author": "LordJair"}, {"rating": 2.0, "review": "iPhone app for Amazon instant video works always. Fire stick will only work about 1/2 of the time. Too many error messages.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "This thing is great!", "verified": true, "helpfulness": "0/0", "author": "T. Heslin \"Yogi12\""}, {"rating": 5.0, "review": "It works great! Tons of movies to watch and enjoy. My daughters love it!", "verified": true, "helpfulness": "6/6", "author": "Darius Moore"}, {"rating": 3.0, "review": "When it works it's great. I got this as a gift for my girlfriend. She's not very tech savvy. Unfortunately this stick doesn't just plug in and work every time. In fact every time she's tried to use it, there's a problem. She travels a lot and stays in hotels a lot. I bought this so she could watch what she wants off of the hotel wifi. Unfortunately it doesn't work with hotel wifi. Most of the time, she can't get it to work using her cell phone as wifi either. You would think that the fire stick would be designed for travel but it apparently isn't. Once Amazon can get this to work with hotel wifi and work better with cell phone wifi, it will be a truly remarkable product. Right now tho, it's just a nice idea. I give them three stars for trying.", "verified": true, "helpfulness": "0/0", "author": "Jason W."}, {"rating": 1.0, "review": "Horrible.  Half the time there are issues with streaming.  The other half everything is fine. Sometimes the audio cuts out and I have to restart the device.  When an update is downloading, good luck streaming.  This thing is so flawed.  Maybe the next version will be better but shame on Amazon for releasing such a horrible product.", "verified": true, "helpfulness": "0/0", "author": "RBanta"}, {"rating": 5.0, "review": "I love it since I don't have cable I can watch my Netflix on my tv instead of computer", "verified": true, "helpfulness": "0/0", "author": "Isabel"}, {"rating": 2.0, "review": "What a waste.  Even with Prime membership, almost everything costs money.  Limited selection.  No streaming feature.  There's a reason this is cheaper than Chromecast.  At least it's not as bad as VUDU.", "verified": true, "helpfulness": "0/0", "author": "Jon Gerow"}]