[{"rating": 5.0, "review": "Everything I need and extremely easy to use", "verified": true, "helpfulness": "0/0", "author": "Samantha Nieto"}, {"rating": 5.0, "review": "I enjoy mine tremendously! I do wish Family Matters was included in Prime though.", "verified": true, "helpfulness": "0/0", "author": "Emily Weir"}, {"rating": 5.0, "review": "Really like this. Works as well as the full size Fire TV. Can even run the ip camera viewer to see our wireless cameras on the TV.", "verified": true, "helpfulness": "0/0", "author": "Suezq716 \"S Murphy\""}, {"rating": 5.0, "review": "Awesome device, easy to use and no problems with getting it hooked up.  I had been using my smart tv to go to netflix and hulu but it didn't have amazon prime on it so I purchased the fire stick.  It's worked great because along with having my amazon prime shows to choose from, I've also noticed that it's way faster than my smart tv!", "verified": true, "helpfulness": "0/1", "author": "johnny"}, {"rating": 5.0, "review": "I love it, works great, and is very fast, easy to use, gread audio and video quality, direct cast to Youtube and Netflix app (on Android) for $39 is great price.", "verified": true, "helpfulness": "0/0", "author": "Luis Miguel C S"}, {"rating": 5.0, "review": "Well played, Amazon.  Well.  Played.Disclosure:  I have Google Chromecast, I have a nook, I have a Samsung SIII, I have a Samsung Note 10.1 (which, after owning it for about a year, I wish I would have bought the Microsoft Surface instead) and an iPod Classic.  I’m not a “fan” of any one company; if a product works for me, I buy it and use it.In my personal, and professional, opinion Amazon has the best cloud service in the world…and I’ve used plenty.  Google, Barnes & Noble, Samsung Media Hub, Drop Box, Apple & iTunes, you name it I’ve probably used it.  None of them, I mean, NONE of them compare to the cloud service that Amazon provides.I *almost* didn’t buy the Kindle Fire TV Stick because I thought, “how much different could it be than Chromecast?” buuuuuuut, I did anyways since it was on special for Prime Members when it was first released so I bought it as a Christmas present for “the house”.  I mean, how different can it be from Chromecast?Holy moley guacamole and Pumpkin Spiced Latte with an extra shot of espresso on the side.Greatest – Thing – Ever!You insert the stick into your HDMI insert, much like Chromecast, you can beam and mirror your tablet and phone to your TV, like Chromecast (Chromecast has issues with this mirroring, as it doesn’t work for all hardwares, but I won’t get into that here), but that is where the similarities end.The big difference is that the Fire TV stick comes with a remote control and works with Amazon’s great cloud service seamlessly.  You have a number of apps that you can download to your cloud and use at your discretion:  Pandora, Plex (which we use), Hulu+, Netflix, Crackle, etc .  If you’re a prime member, you have access to all the Prime tv shows and movies, and you have access to everything that Amazon streams.  It seamlessly connects to your Amazon payment account so it’s not cumbersome to buy or rent items (DANGEROUS!).  There’s also a myriad of games.  My boyfriend and I are far from gamers but having something stupid to play to decompress when you don’t want to watch TV is a nice touch as well.  We’ve played bowling, trivia, and ping pong so far.Now if I can get Amazon to send me fresh fruit, veggies, and meat I may never have to leave my house again.Amazon: Influencing Agoraphobics since 1994.", "verified": true, "helpfulness": "0/0", "author": "Jessica Nagel"}, {"rating": 5.0, "review": "Was very easy to connect and use. I am using with prime to watch movies.", "verified": true, "helpfulness": "0/0", "author": "c j w"}, {"rating": 5.0, "review": "should have bought 2 while they were on sale!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.  Don't have any negatives at this point, having used it for about 10 days.", "verified": true, "helpfulness": "0/0", "author": "Rxman"}, {"rating": 5.0, "review": "Very handy and affordable option to make use of tvs in rooms where we don't have cable/satellite wired. Which is doubly convenient when the kids are arguing over the main tv in the house. It's comparable to the Roku, but less expensive. I use it for Netflix, Amazon Prime Videos, and YouTube. There are endless options with those 3 channels.", "verified": true, "helpfulness": "0/0", "author": "Matt Soreco \"Matt Soreco\""}]