[{"rating": 5.0, "review": "Love it.  Turned our dumb TVs into smart ones in two shakes of a cats tail.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Russell Foster"}, {"rating": 5.0, "review": "Awesome and inexpensive option to streaming through my Amazon Prime account and for Netflix and other options. Very easy to install and saved me hundreds of dollars on either a new game system or a more expensive streaming device. And it's portable as well!!", "verified": true, "helpfulness": "0/0", "author": "Diana Miller"}, {"rating": 5.0, "review": "I have Netflix on my Kindle but the ability to see it on full screen is absolutely the best!! I'll get to watch Longmire in the fall for their 4th season and all my favorite shows. For me, this has been a great investment.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "It's fin flipping awsome! Love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "Had trouble with my smart TV streaming movies from Amazon.  The Fire TV Stick works great.  Wish I would have known about this device sooner. It is really easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Carroll B \"Carroll B\""}, {"rating": 5.0, "review": "Easy to set up and use.  Wish I had gotten it sooner!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Wow,  does not  get  any easier  than this. I've  been  wanting  Netflix  for  a  long time.Since  I didn't have  a  smart TV, I was  confused  as to what to do in order  to achieve this. Finally,decided on the Fire Stick and so  glad I did. IT  DOES NOT  GET ANY EASIER  THAN THIS!  Easy instructions, a  few items in the  small box and bazinga, I was  set up!  The  price  was  awesome  as well. So very happy with  this  purchase!", "verified": true, "helpfulness": "0/0", "author": "McBeach \"sea maiden\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Anthony H Goodwin"}, {"rating": 4.0, "review": "Still learning how to work it all and all the feathures.", "verified": true, "helpfulness": "0/0", "author": "Rascal"}, {"rating": 5.0, "review": "Like!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]