[{"rating": 2.0, "review": "I like the idea of Amazon fire tv stick; however I purchased 2 sticks and only 1 was fully operating. The defective one did not reboot when I unplugged it from the HDTV and the wall socket. Also, removed AAA batteries and used my battery tester; found out the batteries were stillin the \"GOOD\" range.", "verified": true, "helpfulness": "0/1", "author": "Kevin D. Robinson"}, {"rating": 3.0, "review": "I gave it 3 stars because i got it for $20 during the initial pre-order. Knowing what i know now about it, i would not pay the full price.It is nice and compact and plays Amazon Prime stuff really nice. I didn't have Dolby Digital Plus when i got it, so I did get a new AV receiver to play DD+. I needed a new one for a future 3D tv purchase and i needed the receiver to handle it. So once i got the new receiver, i hooked up the fire stick and it played the Amazon Prime really well complete with surround sound. But the main reason i bought it was for the Flixter app. I have a lot of ultraviolet and Vudu movies and i wanted to watch them using the firestick instead of the Xbox One. So i fired up the app and quickly realized it doesn't give me 5.1 surround, just 2 channel stereo. I can't comment on the video quality of the Flixter app, because it was so awful sounding that i turned it off.So bottom line, if you want it for Amazon video, and you have DD+, then this is probably a good deal. If you wanted to use the other apps, then maybe not. I don't know if the other apps also have this limitation of 2 channel sound or not. If the Apple TV had a Vudu app, i would never have purchased the fire tv stick.", "verified": true, "helpfulness": "0/1", "author": "E. Bluebaugh \"EWade\""}, {"rating": 3.0, "review": "Does anyone know if you can browse the web on this?", "verified": true, "helpfulness": "0/0", "author": "Steven Gleyzer"}, {"rating": 1.0, "review": "Do not buy before checking that your TV is compatible. I bought it for my 32\" Samsung and was told by Amazon that it's too old. The HDMI is the wrong version.  Funny the Amazon Instant Video app on my PS3 works on this tv. Maybe Amazon should update the software for backwards compatibility.", "verified": true, "helpfulness": "1/2", "author": "Tim"}, {"rating": 5.0, "review": "very easy to use, another Amazon hit", "verified": true, "helpfulness": "0/0", "author": "tonroc"}, {"rating": 4.0, "review": "I have Prime and was able to purchase for $19 as part of their introductory offer. We have Google Chromecast and Amazon Fire TV stick. I prefer Chromecast for tab casting or computer casting but prefer Amazon Fire TV stick for streaming Amazon Prime Instant videos. I think they both have their benefits and are both low cost. We will likely continue to use both.", "verified": true, "helpfulness": "0/0", "author": "PM"}, {"rating": 4.0, "review": "It's a good product. Works well. It loads video fast and has a good UI. Once it gets more apps it will be even better.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "So far so good! Appears to be a solid option when looking to drop cable. When paired with Amazon Prime and Hulu Plus, plenty of viewing options available. Small device nicely eliminates box too. Remote is good but small and will have to try not to lose. Came with HDMI extender which helped a lot. Not being able to browse Amazon music, just play what you added to your playlist online, is a minor hassle.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "There is much to love about the Fire Stick - it's small, and brings Amazon streaming to any TV for a very low price. And Amazons selection for streaming are amazing - I love that I can watch a lot of things for free with Amazon Prime, and get Amazon's own shows too, and also that if its not available on Prime I can rent it easily from the same device and service - no jumping back and forth between different apps just to find something. The remote on this device is basic but straightforward and easy to use, though it would be nice if the buttons had better markings or colors, just to make it easier to use. My issues with the stick come down to two; first, the wifi receiver isn't as strong as it could be, and in my case that lead to some connectivity issues. Nothing that couldn't be fixed with some rearranging of the router, but if your wifi isn't strong where you have your TV this could be a problem. Second, the fact that this requires the use of a wall plug is a little frustrating - it would be nice to have it plugged in to one of my TVs USB ports to draw power, but apparently that's not possible. At least that's what the instructions say. Ymmv. Overall it's an excellent product for people looking to \"smarten up\" their TV at a low price. And for Existing Prime members who have only been able to access video on the computer until now. It's a no-brainer. People who have wifi issues should opt for the speedier and more capable Fire TV unit, which not only has better wifi reception, but also supports more gaming options.", "verified": true, "helpfulness": "0/0", "author": "waetherman"}, {"rating": 5.0, "review": "I have used it a few times to watch Prime Videos. The interface is very user friendly. The videos played without a single hiccup. I initially used it powered by the power adaptor as recommended. I then tried it with the USB cord plugged into my TV and that work equally well. The only minor quibble I have with my setup, is that when first switching to the designated HDMI input on my AV system, there is a black screen for about one minute, before the Fire Stick home page shows up. It makes one question whether it's working at all. This happened with every attempt to start it. I do not have that issue with Chromecast when connected to the same input. Other than that delayed, black screen startup, it works really well. The remote works nicely, even though the Stick is buried behind my receiver which is inside a cabinet.", "verified": true, "helpfulness": "0/0", "author": "F. Orlando"}]