[{"rating": 5.0, "review": "The gist one we received didn't work but they sent another out ASAP. Second one works perfect, very fast controls on it. I thought it would be a little sluggish for some reason. I would highly recipient this product.", "verified": true, "helpfulness": "1/1", "author": "Heather Castro"}, {"rating": 4.0, "review": "Easy to set up and I am really enjoying it so far.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 5.0, "review": "Very happy with how it works for the price. Is it as good as the fire TV box.  No. But for less then half the price it does more the 75% as well. In my book that is a win. Perfect for the traveler that wants to bring his movies and shows with him. Love the fact that it automatically switches to it when I send a video from YouTube on my iPad (something my Apple TV doesn't do) on my Samsung TV.", "verified": true, "helpfulness": "1/1", "author": "Robert V Morgan"}, {"rating": 5.0, "review": "Replaced my Chromecast with this and it is literally the best thing ever. I love it so much and certain apps will still mirror", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I received the Fire Stick on December 8, 2014; here are my initial impressions. I'll try to update my review if I encounter issues, but so far it's been a breeze.--The device immediately found the available networks, i.e., within a few seconds.--Connecting to our home wireless network was simple; I selected the network, entered the password, and it connected immediately.--It found my Prime account, I confirmed the account name, and it initiated the update process. The updates took about two minutes (I timed it). After that, I was off and running. This was the easiest setup of a network device I've seen.--The included remote worked flawlessly and instantly. We've been connecting to Amazon on our other TVs with Panasonic Blu-Ray players, but the response time with the Fire Stick is far quicker.--Using the menu is intuitive (for me, at least, but I'm the one who always gets this job in our house--I've nicknamed myself the MOThR).--Scrolling through menu options, adding shows to my watchlist, etc., are all quick and easy.--UPDATE 12/9/2014: we wanted to access YouTube, which is on the supported app list. HOWEVER, YouTube is not one of the apps that shows up on the list by default. To access it, go to Apps-->Categories-->Entertainment and scroll through the list to find YouTube. Install it (free), and then it will show up on the list of your apps.Because another reviewer commented that they'd had to reset the Stick after powering the TV off without putting the Stick to sleep, I checked to see whether this one did so. It didn't; when I powered the TV on again, it went right to the Home screen. NOTE: getting to the \"Sleep\" option wasn't hard, but it's in the Settings menu. If it really is necessary to put the Stick to sleep when powering off, you should be able to do it from the main menu (I didn't look for it there, but there aren't that many options on the main menu). UPDATE 12/9/2014: After the TV was turned off overnight, I turned it on this morning and switched it to the input source where the Fire Stick was connected. Blank screen. Pressed the \"Home\" button on the Fire remote, and it came up almost instantly to the home page.So far, I'm loving it. I bought it to use with the only TV that doesn't have a Blu-Ray player attached, but I may end up getting another one for the big screen in the family room. Yes, it is Amazon-centric; but I bought it primarily to access our Amazon Prime account, so that's no big deal for me.If you haven't read cnet's review of the Fire Stick (cnet.com), I recommend that you do so. It may answer some questions you'll have to scroll through hundreds of Amazon reviews to find.", "verified": true, "helpfulness": "2/2", "author": "madmak"}, {"rating": 5.0, "review": "I tried the Chromecast device.  For me its wifi connection was weak and unreliable.  The Fire TV Stick works flawlessly!  Nice assortment of content due to its connection to my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Stuart B. Wtherbe \"sbwetherbe\""}, {"rating": 1.0, "review": "Plugged it in - not detected! Tried every HDMI port on my Samsung HDTV, used the supplied power cord, tried with/without HDMI extension cord.. but it is not being detected. I tried my friend's TV (sony) and it is not being detected. My chromecast stick works fine on both the HDMI ports. I am planning to send it back. I am disappointed with it as I waited for a long time to get it and there is no troubleshooting information anywhere on the amazon website.", "verified": true, "helpfulness": "1/1", "author": "Vagrant soul"}, {"rating": 4.0, "review": "This is a good buy easy set up plenty of shows. and games.", "verified": true, "helpfulness": "0/0", "author": "roger"}, {"rating": 4.0, "review": "easy to connect and worked great.", "verified": true, "helpfulness": "0/0", "author": "Love my Labs \"Cheryl\""}, {"rating": 1.0, "review": "I ordered this in October at the amazon prime special price. We received the package in November but upon setting it up, found the stick was faulty. I spent a long time on the phone with two separate technical service reps troubleshooting the item, which would not make a connection to the television. We tried every single thing (and we're quite techy).  Finally CS decided it was faulty and I was to send it back, which I did. They received it. In December I received a replacement refurbished **remote** only -- no actual Fire TV stick. (Which was the faulty item in the first place.) I then called customer service again and was on the phone for an hour while they tried to issue a replacement. Instead, they are having me order another one and promising a refund on one of them with delivery now at the end of JANUARY. (I originally ordered in October, when they offered the special.) I've now spent many hours on the phone on hold and with CS and also made two trips to the UPS store and ordered the item (as directed by customer service) TWICE and paid for it TWICE and I have yet to receive a new working FIre TV Stick set, and probably won't receive it until 3 months after my initial order and I suspect it won't be new, either -- just a refurbished one. I love amazon and order all the time - however this really seems to be ridiculous incompetence.", "verified": true, "helpfulness": "0/0", "author": "Pittsburgh Reader \"Pittsburgh Reader\""}]