[{"rating": 2.0, "review": "While it worked fine, I found the available apps limited. Not being able to access YouTube directly was obnoxious, and I use VUDU for a lot of movies and would not be able to access them at all. Only reason to really have it is for games or Amazon Prime, which i can get just fine on an xbox. Traded it in for a Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Amanda Whipple Murrell"}, {"rating": 5.0, "review": "Excellent, easy to install, exceeds expectations.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Martin"}, {"rating": 1.0, "review": "This device is terrible.  I bought this device because I have a smart TV, but it does not have the hulu plus app.  The apps programmed on my smart TV do not skip, but on my smart stick, the shows skip all the time and it always has to reload.  I end up watching TV on my laptop.  The TV stick was bought to avoid this!! I even have AT&T; Uverse with 18 MB so I know that it is not my internet.", "verified": true, "helpfulness": "0/0", "author": "Colleen Mayhew"}, {"rating": 5.0, "review": "Great purchase", "verified": true, "helpfulness": "0/0", "author": "Benjamin Ledesma"}, {"rating": 5.0, "review": "Its legit, the fun happens when you turn on developer options, definitely ground breaking tech", "verified": true, "helpfulness": "0/0", "author": "Austin Michael"}, {"rating": 5.0, "review": "Excellent price and excellent product!", "verified": true, "helpfulness": "0/0", "author": "John Gray McGraw"}, {"rating": 5.0, "review": "Wonderful, very satisfied....", "verified": true, "helpfulness": "0/0", "author": "Julia"}, {"rating": 2.0, "review": "Just recently purchased them amazon fire stick about a few week ago and  it tried it out when it hooked it up to My tv and it didn't  meet my expectations. I'm tried to look at you tube and Netflix  with them stick but something  messed up along the way and it couldn't  get it on my tv. Amazon you have to do much better than this with them firestick. Make improvements  please", "verified": true, "helpfulness": "0/1", "author": "jeffrey bishop"}, {"rating": 5.0, "review": "The best purchase if your cutting the cable! Awesome if you an Amazon Prime customer", "verified": true, "helpfulness": "0/0", "author": "flascuba \"flascuba\""}, {"rating": 5.0, "review": "Great Product!!!!", "verified": true, "helpfulness": "0/0", "author": "Deon Brewley"}]