[{"rating": 5.0, "review": "This FAR exceeds my expectations. I plugged it into my TV and it was ready to go. Really cool idea to pre-register it to Prime members!!! I've had the stick for 3 days and I wonder what life would be without it. Making content to easily accessible is awesome. The phone app the is voice-controlled as well as tap-controlled - very sweet. My kids LOVE the thousands of fames...I do too. Haha.", "verified": true, "helpfulness": "0/0", "author": "James Snider"}, {"rating": 4.0, "review": "Pretty cool gadget.  Does take a few minutes to load though.  They don't advertise that it has to be plugged into an outlet as well as the tv though.", "verified": true, "helpfulness": "0/0", "author": "Tim Kramer"}, {"rating": 5.0, "review": "Have all The aplication that I use netflix, hulu, amazon prime and easy to install. Much better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "jorge chaves rios"}, {"rating": 5.0, "review": "Seriously, just buy this now if your TV is not internet ready. Or if you don't want to stream media via PS3/Chromecast/Roku. Or if you are or a loved one is disabled, or otherwise unable to play musical chairs with your media streaming boxes. It does what it's supposed to do; nothing more and, more importantly, nothing less.", "verified": true, "helpfulness": "0/0", "author": "No Name Just Punch"}, {"rating": 5.0, "review": "Very easy to setup.  Too bad it doesn't have Vudo.  Works very well.", "verified": true, "helpfulness": "0/0", "author": "James Nelson"}, {"rating": 5.0, "review": "I have a Google Chromecast device, but this one is actually cooler.  It gives me access to my prime subscription, including my prime music playlists and has lots of apps.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "I like this streamer. I also own a Chromecast and Roku, compared to them the Fire stick is as fast in bringing the media on-screen and I like the fact that it buffers shows so there isn't that dreaded spinning wheel. The Firestick is positioned farthest away from the router and around a corner in the hallway, I was still able to get steady streaming. I'm totally satisfied with this little guy and considering I bought it at Best buy for $25 bucks, it was the best of buys!", "verified": true, "helpfulness": "0/0", "author": "JohnnyB"}, {"rating": 5.0, "review": "Works very easily with a newer tv system.  You will want to add items to your 'watchlist' FIRST from your computer (prior to going onto the FireStick) to be sure that you have items that are FREE for Amazon Prime members.  It is sometimes confusing as to what is FREE when searching through the Fire Stick, and so I highly suggest that you first search via computer, add it to your 'watchlist,' and THEN go to your TV and Fire Stick to see your options.  :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Worthless. I can get the same apps plus MORE on my Xbox 360, Wii, Sony Smart Blu-Ray, and my Smart TV.  In fact all my other products on their own offer me more apps. The games are B-rated and are lacking. If I had the time with the holidays I would absolutely send it back!!!", "verified": true, "helpfulness": "2/3", "author": "J. J."}, {"rating": 4.0, "review": "All in all a great HD product.  I'm using mine on a wall mounted 42 in. In my living room.  Its small enough that the stick and accompanying wires are easily hidden.  Takes a little syncing to get all amazon content initally but after that its a breeze to use.Now for the cons:The remote that comes with it is extremely basic.  Does enought just to surf content.Amazon features games which say you can use the basic remote for, but it's more frustrating than whats its worth especially for children who are used to an xbox or ps controller.  A controller like that of course is extra.  Amazon needs to allow you to customize your home so you can omit things like pictures and music, etc which you may not want broadcast on the tv.  And finally the parental controlls are archaic,  its either all or nothing.  I wouldnt mind my boys \"purchasing\" a prime movie or other prime content which is free, but i have to enter my pin every single time which gets annoying if I'm doing something else.  They need to update that so you can allow prime purchases without a pin while safeguarding against accidental or purposeful rentals or in app purchaces that cost money.Overall a great product for a HDTV that doesn't have built in app / wifi connection.  Needs some updating for my liking before its a 5 star.", "verified": true, "helpfulness": "0/0", "author": "mcoulter"}]