[{"rating": 5.0, "review": "Easy set up. Works great. This is a very good choice.", "verified": false, "helpfulness": "0/0", "author": "Yvette Casey \"Afferore\""}, {"rating": 5.0, "review": "Easy to set up and use.  No problems whatsoever.  Received on 03/16/15 and was up and running within 1 hour.  Plug it in and follow the instructions on screen and off you go!", "verified": true, "helpfulness": "0/0", "author": "Deborah A Wojick"}, {"rating": 5.0, "review": "Very easy to install, took just a few minutes. Quality of the streaming video is superior to what we got from the Samsung Smart Box.", "verified": true, "helpfulness": "0/0", "author": "Paul Whittier"}, {"rating": 2.0, "review": "While the app itself works great, I'm verry disappointed to see that most/many of the shows and movies require rental, and are NOT free as part of being a prime member.  This is simply not comparable to net flix, as the goal here is clearly to create purchases rather than provide free streaming movies as part of prime membership.", "verified": true, "helpfulness": "0/0", "author": "Adrian Marbry"}, {"rating": 5.0, "review": "very easy to use, love all the choices", "verified": true, "helpfulness": "0/0", "author": "Linda Schleede Jacob"}, {"rating": 2.0, "review": "Doesn't have very many apps to choose from :(", "verified": true, "helpfulness": "0/0", "author": "Debi Vance"}, {"rating": 3.0, "review": "I got the FireTV Stick upon it’s initial release, I like it because it’s very easy and convenient but let’s get down to the nitty gritty:Plex:The plex app (not amazon’s fault) is kind of a disaster, if you’re used to Plex on the web or Plex Home theater you’ll wonder what the hell is going on, because none of the same terminology is used so it’s confusing at first to find where you stuff is, it’s obtuse at best because it requires way too many clicks to get to simple stuff and thumbnails load like molassis (which is unfortunate because on the roku and other it’s much faster) the biggest complaint i have is that it’s almost alwasy BLANK but you have to navigate down to the menu at the bottom left (several clicks) and then do ‘refresh’ just to get the already-connected server’s contents to show - then you’re forced to look at ‘on deck’ and ‘recents’ no matter what they are, you can’t change the order or anything - to see your library you need to scroll down way way past those to the very very bottom and the large icons for your library will be visible (e.g. Movies, TV shows, etc.) these should be at the top - or left, i have no clue why they are hidden from view until you go looking for them (again not Amazon’s fault, but they should work with PLEX to make this better because it’s not like this on any other platform) then if you have any shared servers with friends - you have to go to the ‘social’ button (What? social? where is that word used in PLEX? no where that’s where, except on Amazon FireTV and Stick) in the social menu you’ll be able to navigate to a friend’s share and see the icons - it takes several clicks to get here. The worst and almost DEAL BREAKER for some plex users is the ‘channels’ which simply do not function at all in Amazon Fire TV. The reason is up for debate, no one has a definite answer, and no one has a solution - but every one who uses ‘channels’ in plex knows that they don’t work - you can go into the channel, e.g. the Daily Show, and in every channel if it has a “full episodes” link, it’s just missing, all you can do is go to ‘bonus clips’ and none of them play, so channels is totally non-existant in plex and there’s no explanation or acknowledgement. The weird thing is that it’s also impossible to stream any full-episodes from channels to plex in any way, e.g. the plex extension/bookmarklet for safari/chrome/firefox doesn’t work for anything but youtube and similar sites. so if you go to a website that has full episodes that stream, adding them to your queue and then trying to play them on the FireTV’s plex client just doesn’t work (they either don’t appear or it freezes up the plex app).Movies and TV shows faire far better - there’s a couple of tweaks you might have to do - for example if in a movie you can only hear the ‘surround’ channels but not hte main dialog (center channel) looking for all the dolby and 5.1 and DTS settings will be futile, what you have to do is go into the plex app’s settings and turn off “direct play” and “direct stream” this forces your PLEX server to have to transcode the video, which will then be playable on the firetv (again, no other plex client has this issue, only the firetv) this happened on about 1/3 of my library until i turned that option on.HBO GOI wouldn’t know, I have Comcast, and Comcast decided that they don’t like Amazon, so they don’t allow HBO GO via the FireTv or FireTV Stick (but they do allow it through other players like roku, apple tv etc.) so if you have comcast and want the firetv for HBOGO, don’t, that will likely never happen. both companies basically say ‘pound sand’.HuluOne of the better behaved clients out there, the hulu app works great on fireTV and it shows up in FireTV’s search results as ways to watch, which helps BIG TIME. Hulu is pretty much the same on other platforms, pause on one platform pick up on another and resume playback, it has all the odd hulu anti-favorites methods of getting to your shows (e.g. ‘shows you watch’) which is usual now (why do they hate ‘favorites’?) and the HD quality looks wonderful. Thumbs way up.NetflixIt’s great, also showing up in search results now; netflix runs really well on firetv, and also works cross platform so that you can open up the netflix app on your iPhone/iPad/Android device, find a title, and then chrome-cast style - have it sent to the netflix app in firetv for playback. great HD quality.Amazon Prime VideoThe crown jewel but also the IN YOUR FACE jewel. What’s confusing about prime video on the firetv’s interface is that it’s at the same top level as apps are. so you’re scrolling a list with “YOU TUBE, NETFLIX, Buffy the vampire slayer, TETRIS, star trek the next generation, WALL STREET JOURNAL” it’s weird because i wish i could have the apps separate from my titles. regardless - amazon works with voice search to find titles by actor names and such - it’s pretty sweet, BUT be careful - and always look for the ‘prime’ banner in the corner of a title or else you’ll be one click away form a $ price tag.Streaming AllCast from iOSIf you have an amazon tablet or phone, I hear it’s very nice. If you have any other device, don’t count on streaming. it’s ridiculously laggy and doesn’t work half the time. especially for HD videos - most just don’t play or play with no audio - photos are fine, screen-casting is pretty much useless because everything it would be cool for (games and video) are so laggy and choppy that it’s infuriating. Just ignore this capability even exists, it shouldn’t be seen as a feature UNLESS you have amazon devices.Interface: CONFUSING. All the top level items on the left are a mixed back of ‘what?’ and as you move to the right - the icons animate into position and the menu disappears (why?) it’s hard to find what you want, and I WISH there was JUST A GOSH DARN LIST OF APPS! but there aren’t, finding the apps you’ve installed is nearly impossible to see them all in one place. you have to hunt through ‘recent’ and category lists but it doesn’t show you YOUR apps in the categories, it shows you ALLL apps in the entire store, including ones that cost money. Why can’t I just see my apps? Imagine going onto an iPhone and having to scroll through the entire app store just to find an app you have installed on your phone?!Why can’t they just have a ‘favorites’ or ‘my apps’ section so you can sort them how YOU want them? nope, you’re stuck with ‘recents’ which auto populates with randomness, even from other amazon sites and devices - which is a little disconcerting. Often the app you want - say youtube- gets burried so far you have to scroll right and do ‘more’ to see it, it shouldn’t be this hard to get to a damn app. why is every other platform dedicated to ease of use when Amazon is dedicated to ‘BUY THIS’ I should have known. oh well.If it weren’t for the fact that Amazon prime isnt’ available on Apple TV, I would have bought an Apple TV. I should have bought a Roku, but I heard the FireTV was ‘faster’ and it is fast at loading video - but it’s a constant struggle to do simple things sometimes.Also - if you have an older HD TV (more than 3 years old) you might have a blue screen “HDCP” error on your screen when trying to play streaming content - this is part amazon’s fault, part tv manufacturer’s fault, try with or without the little extension cord that comes with the FireTV Stick; and try it on every HDMI port you have, do an update on your TV’s firmware, unplug the TV and the FireTV Stick from power and leave them off for a few minutes and try try try try try again. eventually it will work… until one day it just decides to NOT work, then you have to do that all over again. It’s very annoying. only have this problem with the fireTV stick - to Amazon’s credit though; they offer a same-day replacement if you chat with tech support (or call). very prompt service.", "verified": true, "helpfulness": "3/3", "author": "Joey"}, {"rating": 5.0, "review": "Well not much to say... If you wanna enjoy it, you must have Online subscription for $99/month. Otherwise not very helpful. But you can also rent or buy movies if you don't have Prime.Another way to free movies.... Install Kodi in it, setup from YouTube. And enjoy anything and everything free. Even latest ones too...", "verified": true, "helpfulness": "0/0", "author": "Mohammad Manzar Seyum"}, {"rating": 4.0, "review": "This is great I love it. I would recommend to everyone! Especially for those who don't have cable and have a Netflix or Hulu account. Also comes with parental controls for the kids. Only thing is the remote control that comes with the Amazon fire stick, took me an hour to get the back open to put the batteries in, I had to watch a YouTube video to figure out how to open. I know, sounds silly but it's extremely difficult. Recommend you guys at Amazon have instructions on how to get the remote open. Other than that very user friendly and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "chantelle"}, {"rating": 3.0, "review": "Works okay on my old TV but the design of the remote sucks. I don't think I should have to watch a YouTube video and use a flat head screw driver to set up a remote with batteries.", "verified": true, "helpfulness": "1/1", "author": "Sharleen"}]