[{"rating": 5.0, "review": "it's a great device very happy with it  im glad I bought it", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "Loads pretty fast and has tons of hrs. Of entertainment. Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "mario"}, {"rating": 5.0, "review": "I love the resolution.  And having access to all my media outlets is great. My poor blu-ray doesn't get much action anymore.", "verified": true, "helpfulness": "0/0", "author": "Restaurant girl"}, {"rating": 3.0, "review": "Needs an update as well as more applications.", "verified": true, "helpfulness": "0/0", "author": "Chris Laubert"}, {"rating": 5.0, "review": "Very happy with this. Good selection of apps and Amazon Prime shows too.  Helped us drop cable.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "Not needed with smart tv", "verified": true, "helpfulness": "0/1", "author": "Daniel c Brach"}, {"rating": 5.0, "review": "So easy to set up!! I couldn't wait any longer for my husband to do it, so I unwrapped it. I had it set up in minutes and they had a cute cartoon tutorial. My son now loves Fireman Sam!", "verified": true, "helpfulness": "0/0", "author": "LMR"}, {"rating": 5.0, "review": "Was able to acquire my stick for under $20.00 by invitation as a Prime Member.  This is a great little media player whose effectiveness goes up exponentially when used in conjunction with the accompanying Android phone app.  I have a Chromecast installed on another TV and while I like the Chromecast, there are many advantages to the stick compared with it.  The user interface is intuitive, content search and playback are a snap.  Voice search using the Android app is outstanding.  Video and audio quality are superb.  One disclaimer.  Content management (building playlists, deleting watched items) is cumbersome and sometimes impossible.  The end user is far better off doing content management on a pc and then using the stick strictly as a playback and streaming device.  I would recommend this gadget even at the MSRP of $39.00.  A must have for Prime subscribers.", "verified": true, "helpfulness": "1/1", "author": "Dave D"}, {"rating": 5.0, "review": "Has great content and works with a WiFi too weak for other devices. I'm very pleased with this purchase!", "verified": true, "helpfulness": "1/1", "author": "William R. Norman"}, {"rating": 3.0, "review": "I can't get it to connect to my wifi network. All my other devices are fine. I am trying to upgrade my dsl speed To see if that helps.", "verified": true, "helpfulness": "0/1", "author": "Robert E. Greenwald"}]