[{"rating": 3.0, "review": "Should offer a way to set a sleep timer rather than only allowing to set the fire stick in sleep mode. Sleep mode is also very cumbersome to get to.", "verified": true, "helpfulness": "0/0", "author": "Steve M. \"Matt\""}, {"rating": 3.0, "review": "Really 2.5 stars due to the constant buffering. 3 stars if I consider that Amazon prime charges for shows/movies that are FREE on Netflix. The fire stick itself is great! Super easy to get up and running, even my 5 year old can operate himself. Actually his room is closest to the internet router so experiences fewer buffering delays. Our room is farther away so it has to buffer every show. Annoying!", "verified": true, "helpfulness": "0/0", "author": "LJM"}, {"rating": 4.0, "review": "I got this for $19 during the launch as a prime member so for that price there is nothing which can beat this.I also own Roku 3 and ChromecastJust to be clear this is not a competitor for chromecast as with chromecast you need to have a phone or computer to do anything which I started to feel can be done with miracast using Roku or even fire stick with future update.. (Although all those free dollar and trial you keep getting with chromecast made that device already free for me so no complain...)Coming back to this stick you will little lag if you are coming from Roku 3 but otherwise this has been pretty solid with my second TVHas almost most of the app you may need they also have now sling TV which is great for me, quality of video are always good never has any issue with buffering..Sometime I see it is loosing wifi but again that could be the problem with my router.So coming to the price point would I have paid $39 for this? May be or may be not but I am not complaining for $19.If you are just starting with all these internet TV I will put money on amazon fire stick any day.", "verified": true, "helpfulness": "0/0", "author": "Arun K. Sharma \"Arun Sharma\""}, {"rating": 2.0, "review": "I want to like the FireStick, but I consistently have problems connecting to the services. It might work better if I can get my wireless in the same room, but for being in a different room, it's pretty substandard.", "verified": true, "helpfulness": "0/0", "author": "jma3974"}, {"rating": 5.0, "review": "Amazing technology. Beautiful packaging. Clear & easy instructions. I bought mine in pre launch. Would buy again at full price.", "verified": true, "helpfulness": "0/0", "author": "Frank A Riker"}, {"rating": 1.0, "review": "the device goes to sleep and is not reliable for multiple hours of streaming etc.  Called tech support made sure it was set up properly, still have to physically power cycle the device/reboot each time I want to use it", "verified": true, "helpfulness": "0/0", "author": "Robert G."}, {"rating": 5.0, "review": "Better than Roku. Love everything about this product. I might cancel my dish tv now that I got this!", "verified": true, "helpfulness": "0/0", "author": "CSmith"}, {"rating": 5.0, "review": "It's easy to use and small enough to fit in the remote control container", "verified": true, "helpfulness": "0/0", "author": "Paula Ehrich"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "ginger \"ginger\""}, {"rating": 4.0, "review": "Does More Than I Expected!", "verified": true, "helpfulness": "0/0", "author": "garymonz"}]