[{"rating": 5.0, "review": "Got this on the prime 2 day sale.  It connected right in for me. This is extremely easy to install. The downloading of the update was really slow so I was afraid I couldn't stream well.  After done updating I streamed two different movies without any hesitation or skipping.  The one thing that annoys me and I called CS on is that I have to put pin in to let kids watch movies.  I can adjust what they watch but she said without my pin they can rent movies.  This doesn't make sense to me if I have on no purchases allowed without pin.  Hopefully it was wrong info on CS's part and someone here can chime in if they know differently. I did buy 2 controllers now so kids can play their favorite games.", "verified": true, "helpfulness": "0/0", "author": "dream4more(Carol)"}, {"rating": 5.0, "review": "Excellent choice, so simple to use. Performs as advertised, glad we made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Robt. M"}, {"rating": 5.0, "review": "This is the real deal, especially when you use it with the first generation Google TVs, like the Sony NSX-46GT1 (http://www.amazon.com/gp/product/B004BBCHJG).  You can finally have a real Amazon interface (much better than using the Chrome browser), and the TV remote control can be used to scroll through the Fire TV Stick.  It'll warn you about not having the remote control provided, but you can just ignore it for most of the applications (Amazon Video, Netflix, etc.).  You also get a Hulu interface, something I hadn't missed before.The Fire TV Stick is fast loading, especially with content we already bought through Amazon Video.I did get an error message using the the TV USB connections vs. connecting it straight to the power plug - but it still works, and I haven't seen any glitches from lack of power.  However, I haven't done much gaming on it, which may require more horsepower (thus more power).", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 4.0, "review": "The product is very useful, works as it should and great for the Prime price of $19.99 except for the set up.  Was extremely annoying to get past the \"Downloading\" phase.  Took us about 10 attempts and at least 8 times of rebooting/pulling the power cord as suggested!!!  Should have a bypass section for the Demo, but other than that great product!  I have all my access to Amazon Prime video, music and additional apps at a minimal price!", "verified": true, "helpfulness": "0/0", "author": "Mai Cortes"}, {"rating": 5.0, "review": "I got my Fire TV Stick last night and it is awesome. I also have an apple TV and a chromecast. This is by far the best of all three.", "verified": true, "helpfulness": "0/1", "author": "John M. Trevaskis"}, {"rating": 5.0, "review": "I purchased this for the fact that it allows you to login to hotel WIFI, which will at times require you to accept terms of use. I have not used this function of the device yet, so will update my review when I have done that. But at this time here is what I think so far.Being an avid Roku user ( I have 7 of them at this time), I wanted to give the Fire TV stick a try and for the price I figured why not.Set up is simple, but did take a little long to update software right out of the box, no biggie but wanted to mention it.  I like the look of the remote and the simplicity of it. The only grip that I have is it comes already signed in to my amazon account right out of the box.I ordered 2 of these, one for myself and one as a gift for my dad, so no big deal, but if giving as a gift keep this in mind as others could order apps and movies from your account. Once the update goes through the interface and use of the Fire TV stick is very nice and easy.I use Plex more than anything with my Roku's, and you do have to purchase that app through the Amazon app store for the Fire TV, but for those that use amazon prime or purchase a lot of TV shows/Movies through amazon, this device is for you. The fire TV puts all that right there up front and easy to get to. All the other apps are easy to find and use as well. Overall picture quality is good, speed is good, and the more you use it, the better it gets.", "verified": true, "helpfulness": "1/1", "author": "ryan"}, {"rating": 5.0, "review": "Simple and easy to use.  I love the size which makes it easy to travel with.  Setup was quick.  Just connect to a nearby WiFi network, wait while it updates the OS, and its ready to go.  The interface is just like the Fire TV, and the remote makes it easy to get watching videos quickly.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "The set-up was extremely simple. The \"Watch List\" feature is great. I can save movies to watch at a later time as I scroll through the offerings. I worried about the signal strength, since it operates via Wi-Fi, but it was great. The resolution was better than when I watch standard television programming. The movie quality was even better than I had hoped for. In the middle of severe thunderstorms that kept knocking out my satellite, the Fire TV Stick never wavered. I've only used it for a few days, so I hope that the performance stays at this level. If not, I will be back to update my review.", "verified": true, "helpfulness": "0/0", "author": "Nae-Nae"}, {"rating": 3.0, "review": "So I've got a chromecast and I find the fire stick much simpler to use.  It's also much less glitchy than the chromecast. Not as easy as Apple TV and no HBOGo app which I knew going in. Also I was disappointed that the showtime anytime app only works with a limited number of providers and direct TV isn't one of them.But I do love that we can easily watch Amazon videos on the TV.  My kids both have kindle fires and I buy them movies for their kindles when we travel, so this gets them on the tv.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The good (so far): Initial welcome video was cool.  Setup was simplified with the included remote.  Which was my dislike with the Chromecast.  The remote is radio frequency so don't have to point at the tv!The bad (so far): Gray and black setup menu seems old and cheap.  WiFi reception issues.  The Chromecast connected to the same TV(downstairs) connected to the router (upstairs) without problem.  Fire TV Stick connected to the same router shows good WiFi strength but once connected it has problem staying connected.  Moved Fire TV Stick to upstairs TV and everything was fine.  I thought basic function/apps like Netflix(since it was advertised to work with that as well as other streaming services) would already be on but nooo you have to download it.  Which is not a problem.  Decided to show off to the wife by launching Netflix and playing one of her Korean flix that current & in HD format.  Got audio and subtitles(in English - that's another story) but the video comes on and freezes.  Tried it again and does the same thing.  Switched to another Korean flix same thing.  Not a problem with WiFi speed cause I'm able to look at Amazon Pic and other Amazon related feature without a problem.  Connected the Roku 3 back in and that works flawlessly.  Also, could not get the Amazon Fire TV Remote App for Android to work.  It couldn't find the unit.By this time the wife said, \"Put my Ruku back on.  Return it!  I want my money back\".  I'm sure the Fire TV Stick needs firmware update to fix initial release bugs.  Did not get a chance to try the regular Netflix movies or other apps/services.  Hopefully Amazon will release a new firmware fix soon or maybe I just got a defective Fire TV Stick.  Did I mention I like the remote?", "verified": true, "helpfulness": "1/3", "author": "Amazon Shopper"}]