[{"rating": 5.0, "review": "I set this bad boy up in under 5 minutes, from package to streaming my first show.  I have a ROKU and love it, but I was excited to get this due to its small size.  I have it on a bedroom TV on a stand with no room to put even a small box.  The stick hangs off of the TV vice on a surface.  Very easy to use, I have tapped into NETFLIX and Amazon Prime (just got it tonight, running it thru its paces).Great price, great capability.  I have stripped back to $24 a month cable (Broadcast) and use streaming for most of my TV viewing.  This helps make the cut from cable even easier.", "verified": true, "helpfulness": "0/0", "author": "TammyinMD"}, {"rating": 1.0, "review": "Although it says \"coming soon\", so far I still cannot mirror any iOS device onto the fire fire tv stick without buying third party apps. I will probably update my comments after Amazon set up their iOS support, but it might be easier to return the device and purchase chromecast instead.", "verified": true, "helpfulness": "1/2", "author": "Samuel"}, {"rating": 5.0, "review": "This is amazing! It does benefit you more if you are a Prime member. It was so easy to install.", "verified": true, "helpfulness": "0/0", "author": "J. York \"Jyork\""}, {"rating": 5.0, "review": "We just opened ours and it was running in two minutes. This puts Amazon at the same level as Apple in terms of product savvy, quality, and easy experience. I LOVE this thing, and I love that I only paid 20 bucks for mine! If you want to belong to Prime, this is how you watch Prime.I find no negatives. The remote is absolutely cool. The stick is lightening fast. The menus make sense, operation is a no brainer, and the picture is gorgeous.", "verified": true, "helpfulness": "1/1", "author": "Mark S. Deneen \"juicymusic\""}, {"rating": 1.0, "review": "Followed instructions but it will not work. Referred me to Amazon.com but I cannot find a number to call or what to do. I have unplugged it several times but it still will not load. It says I am connected to internet.  Guess I will return it.", "verified": true, "helpfulness": "3/3", "author": "Niklee"}, {"rating": 3.0, "review": "Everybody has the same stuff.  If it's interesting you will have to pay, and pay, and pay for it.", "verified": true, "helpfulness": "0/1", "author": "Walter Prochorenko"}, {"rating": 2.0, "review": "Fast and easy to use. Good Wi-Fi reception.However, no support for YouTube. I know Google (Owns YouTube) and Amazon are fierce competitors, but I want, and expected, to have a YouTube app. When companies try to hurt each other, we, the consumers lose. Wise up Amazon.I WANT MY YOUTUBE!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer \"Savy Shopper\""}, {"rating": 5.0, "review": "This is an awesome item to have! It works really fast and easy to use. the games are also fun to play and music streaming is great too.", "verified": true, "helpfulness": "0/0", "author": "gloria"}, {"rating": 4.0, "review": "So far, the Fire TV Stick seems to have been a good deal for $20.  I'm not sure I'd feel that way if I'd paid $40 for it, though.  It has a few drawbacks that have me scratching my head.  First off, it doesn't play well with others.  The closer it is to my TV, the more feedback I get in the form of alarming beeps and boops and buzzing.  It isn't  constant, but it was often enough that I've plugged it into an HDMI hub and moved it off to the side which has cut the incidences significantly.Second is the user interface.  It's pretty, but like a lot of things created by Amazon, it seems badly thought out in certain areas.  Obviously the bulk of the thought went into presenting the Amazon's Prime and Cloud Drive offerings, and they're reasonably good, but when you get to the Apps section, you have to scroll through all of your apps to find the one you want.  There's no way to organize them.  Finding them originally isn't a problem, but once you've added them to your Stick, then it's a long slog through however many you have.  Some of the apps behave oddly too.  Amazon music goes on playing unless you hit the pause button.  Everything else stops cold when you back out of it.I think the app that bothers me most, though, is Spotify (I'm sure there are other ones that share this drawback, but I've not encountered them yet.)  In order to use Spotify on my TV, I have to run it on my phone.  Um... no, I'm not going to sit here and run down my phone battery to play music from my Spotify account on my TV.  I'll just listen on my computer.  Thanks very much.  What's up with that?  However it's nice to see that I can finally access my movies in Flixster with the Stick.The remote?  Well it's... okayish.  No volume control at all, which means it's not a stand-alone remote by any stretch.  That's fine, I suppose, but I hate juggling multiple remotes for one source.I know this sounds really complain-y for a four star review, but I really do like the Stick.  If I didn't like the options and the quality, this would have been a three-star review at most.  But access to my photos, my music, my Prime stuff for $20?  I'm content.", "verified": true, "helpfulness": "0/0", "author": "Tracy Rowan \"Tracy Rowan\""}, {"rating": 5.0, "review": "I love it.  It has been great to have access to all of my Amazon stuff on our tv.  We used to use a gaming system to watch Netflix and Hulu, but with this tv stick I was able to clean a lot of the clutter off my tv cabinet.  This stays plugged in to the tv neatly, and takes up no space.  It was easy to set up and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dory Gale"}]