[{"rating": 4.0, "review": "I purchased this as a pre-order, at the discounted price for Prime members. At $20, this little stick is an amazing value, but it would still be worthwhile at the full price. I have had multiple streaming devices: the original Roku box, the Roku 3, a Chromecast, plus a Panasonic Blu-ray player with streaming capabilities. I feel like the Fire TV Stick presents a happy middle ground between the Chromecast and the Roku 3. The Roku 3 seems to have a slightly smoother interface than the Fire TV Stick. The Chromecast has a few unique features due to the tie-in with the Chrome browser, and being able to cast my PC desktop. However, i regularly found myself looking for a dedicated interface, rather than having to rely on playback controls within individual apps or websites. I currently have the Chromecast and Roku 3 together in my living room, with  the Roku 3 taking advantage of its proximity to my router to get an ethernet connection. The Fire TV Stick is now running in my bedroom, and we have been using it daily. I feel the wifi reception has been fairly strong. The only lags I have noticed have been while using the youtube.com \"app.\" On occasion, the Watch Disney Junior apps is slow-loading. For some reason, this app loads directly to live video, which I think is unnecessary and likely puts a strain on the available processing and data connection resources. Pandora, Netflix, Plex and other apps load without noticeable delay. In fact, the Plex app on the Fire TV Stick might run better than the Roku 3 version.The content access is really sufficient. We have access to the various Watch Disney apps, Netflix, and Pandora. Some reviews note the delayed arrival of HBO GO, but due to the agreement between HBO and Amazon, Prime members can still access the back catalog of HBO shows through Prime Video. I like the interface of Prime Music, even if there are noticeable holes in the available catalog. I hope Amazon is able to reach agreements with the remaining record companies to fill in some blanks. I like the kid-centered exclusive content available on Amazon Prime video. Amazon tends to co-mingle content included with Prime and pay-per-view content, which is a bit of an annoyance.Setup of the device was very simple, as has been the registering of the apps I use.", "verified": true, "helpfulness": "0/0", "author": "Daniel N. Gillespie"}, {"rating": 5.0, "review": "Set up is extremely easy & it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "T. Bentivegna"}, {"rating": 5.0, "review": "Also works with hdhomerun prime to watch cable channels. YouTube app, TVMC Kodi app is good for watching online movies through add-on.", "verified": true, "helpfulness": "0/0", "author": "Madhava N. Boyalla \"Real Man\""}, {"rating": 3.0, "review": "it's getting stuck sometimes, when i click remote to move it to other app or channel it's getting freeze and exiting that app.", "verified": true, "helpfulness": "0/0", "author": "MAYDAYKARRAO  CHINTHAPANDU"}, {"rating": 1.0, "review": "Constant freezes and disconnects. I can't watch anything on my fire stick. It freezes the screen every 10 seconds or so... un watchable.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "This thing is FANTASTIC! All the applications work seamlessly, especially ones like Plex which has become one of my favorites. I am now able to transfer files from my windows HTPC with free server side software to any of my fire/android devices. Well worth any price you'd have to pay for the Plex application. I bought 3 of these sticks for 20 bucks; wishing I would have found a way to buy more.", "verified": true, "helpfulness": "0/0", "author": "LazyAce"}, {"rating": 5.0, "review": "Once again Amazon comes out with a winner. This device works great plus its compatable with my Amazon Tablet and Android smart phone. And the best part is I took advantage of the introductory offer and got it for $19.00.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 4.0, "review": "I bought this when amazon was offering it for $20. It's definitely worth it! It's very fast and easy to use and I love that it has a remote. I wish that screen mirroring was possible all devices, not just amazon ones. But it definitely works a lot better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jessica A Witt"}, {"rating": 4.0, "review": "Not quite plug and play as there were some day one updates to install.  Fortunately, these corrected the issues I was seeing.  So far, this is a nice streamer.  Provides easy access to all of my Amazon content.", "verified": true, "helpfulness": "0/0", "author": "Nick R"}, {"rating": 1.0, "review": "not what I expected", "verified": true, "helpfulness": "1/2", "author": "frederick c jackson"}]