[{"rating": 5.0, "review": "I've bought 3 so far for myself and family members and will probably purchase more. It's easy to travel with super small usb size and the charger is compact. Netflix Amazon video and everything else loads faster than my PS3. Loved it.", "verified": true, "helpfulness": "0/0", "author": "Tenzin S."}, {"rating": 5.0, "review": "Very easy to install and works very well.  A world of content is at my fingertips.", "verified": true, "helpfulness": "0/0", "author": "Peter Conway"}, {"rating": 5.0, "review": "Many other solid reviews here so not a lot new to add.  The Fire TV Stick with a prime membership is great.  While devises that stream content are nothing new, it's small with minimal cords and footprint, which means less to play with for my toddler boys.  Very easy to set up and use.  The amount of content available is huge.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "It's great, we are loving it.", "verified": true, "helpfulness": "0/0", "author": "Vicki"}, {"rating": 5.0, "review": "love it works like I expected to", "verified": true, "helpfulness": "0/0", "author": "Georgette D Miller"}, {"rating": 5.0, "review": "I had originally just purchased this for my Plex Server but I ended up getting so much more out of it. I love having all of the prime on demand stuff right at my fingertips.", "verified": true, "helpfulness": "0/0", "author": "Alexander Weir"}, {"rating": 5.0, "review": "Why would anyone pay for cable again? I love this little device. I am getting for each tv in my house.", "verified": true, "helpfulness": "0/0", "author": "Brad A. Hamilton"}, {"rating": 2.0, "review": "Does not work on old type TVs. Wish it did", "verified": true, "helpfulness": "0/0", "author": "Peggy A."}, {"rating": 5.0, "review": "Great tool for accessing Amazon Prime services and more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jhf388\""}, {"rating": 5.0, "review": "Amazing hardware that works great.  Easy setup makes for a great product.", "verified": true, "helpfulness": "0/0", "author": "Rob"}]