[{"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tricia Bazzey"}, {"rating": 5.0, "review": "The stick came packaged very well and arrived ahead of the expected delayed delivery date.  It was easy to install.  The instructions do not state the first thing you see on your screen is that you have to select your modem.  When the screen comes up all it says is that you need to select your wi-fi (which is your modem) so have your pass word ready.  That being said I called fireTV tech support and they walked me through the confusion.  They were very helpful and stayed on the phone with me to make sure my fire stick TV was on the screen and ready for me to use.  In fact they stayed with me thru the intro video in case I had any questions.  Great job Amazon tech support.  The fires stick is easy to use when program searching.  I down loaded the app so that I could use my kindle and phone as voice command for the fire TV program selection (this I liked).  The selection of programs and movies is vast so that there is something for everyone.", "verified": true, "helpfulness": "0/0", "author": "rlinton"}, {"rating": 4.0, "review": "Love it. Simple to use.", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "Great for a guest room that isn't connected to a cable box. Very impressive. I have the Fire TV too and this is almost as good. No voice control on the remote, but for the price it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 1.0, "review": "You have to be so close to your router or you get no signal at all. I wanted it for my bedroom, but the router in the dining room (separated by just a bathroom). Not a big house, not a big separation, but it did not work at all.", "verified": true, "helpfulness": "0/0", "author": "CoffeeCrazyPhD"}, {"rating": 5.0, "review": "Awesome!! Love it", "verified": true, "helpfulness": "0/0", "author": "Vanity Tuquero"}, {"rating": 5.0, "review": "Works great!  Easiest internet tool I have ever set up!", "verified": true, "helpfulness": "0/0", "author": "zip31"}, {"rating": 5.0, "review": "User friendly, affords a variety of entertainment options.", "verified": true, "helpfulness": "0/0", "author": "kapaul"}, {"rating": 5.0, "review": "This piece of equipment is powerful and does exactly what it promises to do without any complicated installation. Bravo, Amazon! You have done very well by your customers on this one...now to offer more free viewing options... ;-)", "verified": true, "helpfulness": "0/0", "author": "F. Salvato \"FrankS\""}, {"rating": 5.0, "review": "It was so user friendly to set up and start enjoying.  We haven't had any problems and are so happy with all the viewing options it affords.", "verified": true, "helpfulness": "0/0", "author": "Linda D Davis"}]