[{"rating": 4.0, "review": "I will start out by saying I have a roku 2 and chromecast.  The fire stick is great and I was able to pick it up for $20 just like my chromecast.  I would only recommend the firestick if you have an amazon prime account. Without prime you are limiting yourself with this device.  With prime its great to be able to stream amazon movies and music or use my TV as a photo viewer with amazon photo backup. The fire stick has crashed once on me but I think Hulu was acting up and locked up on my tablet.If you don't have amazon prime then look at a different device like the chromecast.  If you have prime spend the extra over chromecast and get the fire stick but both are great devices and have there pros and cons.  Feel free to ask me any questions.", "verified": true, "helpfulness": "0/0", "author": "APalmo"}, {"rating": 1.0, "review": "Mine is dropping the signal like many others.I will be returning it.", "verified": true, "helpfulness": "3/3", "author": "oldtrn"}, {"rating": 5.0, "review": "sooo much faster than my smart tv alternative plus hulu, plus netflix, etc. love it", "verified": true, "helpfulness": "0/0", "author": "Chris Reed"}, {"rating": 5.0, "review": "Works great! Using it on my Sony TV. I stream from Amazon Prime and a Plex server on my mac mini. Fast response times, great video quality! Highly recommended on a Amazon Prime account and/or as a Plex viewer for sure! Like the bluetooth remote as well. CBS News, Watchup applications works pretty good for news and YouTube works good as well. I was able to install some android apps with AFTV Side Loader on android very easily...", "verified": true, "helpfulness": "0/0", "author": "Erel"}, {"rating": 4.0, "review": "Had this baby up and running within 3 minutes of opening the box.  The best part so far is that no sign in was required.  Amazon had programmed my info into it prior to shipment.  So when it fired up, it asked if I wanted to sign in as ....  It's the small stuff like that which makes me love this little device.  Not having to use a remote to sign in with a long email and complicated password does make a big difference...at least for me.Within 1 minute of booting up I was watching a stupid this is how it works video that I couldn't bypass.  I found the Watch ESPN APP and within seconds was watching Denver vs. Cincinnatti.  Still watching it, crystal clear reception which I can't say for my Apple TV TONIGHT  that kept giving me playback issues.  Did I mention no additional login for ESPN NEEDED?  ie cable TV provider login not required.  It just went straight to full access to ESPN!2 problems.  The remote needs to light up.  I watch TV in the dark and although the remote has 6 buttons, I need to see them.  Also, I don't like the power option of mini USB to USB power supply.  I got lucky and my power strip is just barely close enough.  I had no idea this thing needed plugged in.  I just thought it got the power from the TV.I have a 3D LG TV and this device will Simplink to it meaning just going to the input will turn on the TV and device at the same time.  Love that too.So far, all movies and TV shows on Prime have been as \"instant\" to play as possible.  Meaning, as soon as I hit play, the movie or show starts.But I still love my stick and can't wait for more apps.  Loving the NFL Now and Hulu Plus apps also.", "verified": true, "helpfulness": "0/0", "author": "D. Couse \"darkman1969\""}, {"rating": 2.0, "review": "It won't play Netflix - keeps coming up with error nw-4-8, and no solution available.  Menu is poorly organized, and it's much harder to find apps compared with Roku stick.", "verified": true, "helpfulness": "1/1", "author": "Thomas Adams"}, {"rating": 5.0, "review": "Excellent streaming product!  We own 2 and are ordering two more.", "verified": true, "helpfulness": "0/0", "author": "Scotty W."}, {"rating": 1.0, "review": "What? Miracast certified?!", "verified": true, "helpfulness": "2/3", "author": "JL"}, {"rating": 2.0, "review": "I would give it more stars if I could get more of the apps that I want, such as DramaFever and HBO go.", "verified": true, "helpfulness": "1/1", "author": "Emily MN"}, {"rating": 2.0, "review": "I wanted this to work- I missed the $19 price and was about to buy one at $39 when I was given one as a gift.Newer TV, plenty of HDMI outlets. Great wireless signal.And it would not work. A few dozen attempts (with and without customer support) to reset, replug,etc. Nada.It would let me connect to the internet then freeze. Amazon issued a replacement stick, which arrived promptly. Again, it did the same thing. I tried each HDMI port. I tried another TV just to see if it was the TV. No luck.Wish I knew why, and I wish there had been a solution other than sending it back for a refund (since it was a gift, they were willing to refund me with credit to Amazon, which was great.", "verified": false, "helpfulness": "0/0", "author": "MidwestMom"}]