[{"rating": 4.0, "review": "Works good but it's a little glitchy needs to be reset from time to time", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "Everything I expected and more.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 4.0, "review": "Works just fine. Lots to choose from. Could have more newer movies", "verified": true, "helpfulness": "0/0", "author": "Roger Ball"}, {"rating": 2.0, "review": "So much of what is available has to be paid for, might as well watch cable that I am paying for already.", "verified": true, "helpfulness": "0/0", "author": "michael shelton"}, {"rating": 5.0, "review": "Easy install and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Laurelin Janda-Backman"}, {"rating": 3.0, "review": "I don't like how items are organized in the interface. I have to go to an \"apps\" section to use my Hulu, Netflix, etc. and hey are mixed in with my son's game apps so there's more scrolling. It's not as user friendly in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Christy Long \"Mommy Marchand\""}, {"rating": 5.0, "review": "Works well.  Streams everything we could want with ease and also allows to purchase movies and games right from the comfort of your home!", "verified": true, "helpfulness": "0/0", "author": "Brenna Perez"}, {"rating": 4.0, "review": "Didn't work on my tv in my bedroom.  It wouldn't stay connected.  However, it worked as expected on my Samsung in the basement.  I purchased it for use in the basement so I'm not too bent out of shape about it.  Not sure why I'm having connection problems in the bedroom that's only 5-6 yards from the router.  Haven't experienced a disconnection yet on the one in the basement.  It's location is just about directly underneath the router.", "verified": true, "helpfulness": "0/0", "author": "Dindsol"}, {"rating": 5.0, "review": "So easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "D. Buckley"}, {"rating": 4.0, "review": "No problems streaming  from all sources I have tried. Sideloading apps can be found by searching net. Plus was sideloading settings app and connecting keyboard and mouse by bluetooth. Installed xbmc(kodi). No way yet to install my xbmc backup data. Had to install my setup manually. Great experience so far.", "verified": true, "helpfulness": "0/0", "author": "Lawton Bruce"}]