[{"rating": 3.0, "review": "Disappointed. Before I purchased this Fire Stick, I chatted with Amazon to see if I would be able to mirror my MacBook Air to my tv and they said yes. After I received it, I found out that I can't use it that way. It only supports Fire phone and Tablets. Boooo Amazon. Luckily, I still have my Apple TV. Amazon, if your gonna compete, you need to step it up.", "verified": true, "helpfulness": "0/0", "author": "Enjoy Shopping!"}, {"rating": 5.0, "review": "I have apple - roku & hulu nothing compares to Amazon Fire Stick - easy to use very responsive to command.", "verified": true, "helpfulness": "0/0", "author": "RENNY ABRAMS"}, {"rating": 5.0, "review": "I would consider myself an electronically challenged person even tho' I hate to admit to it. Anyway, this firestick is so easy to install and use!! I love it and am so happy that I did purchase. I haven't even scratched the surface of the possibilities!! Amazon you are way cool!!", "verified": true, "helpfulness": "0/0", "author": "country granny \"country granny\""}, {"rating": 5.0, "review": "Very nice!! Easy to install and now I have TV MY WAY!!!!", "verified": true, "helpfulness": "0/0", "author": "Sara R. Cuenin"}, {"rating": 3.0, "review": "a lot of the movies we want to watch cost additional. Its always uploading when watching a show. Don't use it to much", "verified": true, "helpfulness": "0/0", "author": "Connie J. Atwood \"cja\""}, {"rating": 5.0, "review": "Amazing little USB style media device. It works very well for me. I really like the fact I can put movies into my Amazon watch list then view them on my TV with the Fire Stick. For the price you simple can not beat it IMO.", "verified": true, "helpfulness": "0/0", "author": "Bill in Vero \"BillC\""}, {"rating": 5.0, "review": "Very good programing, the best if you want to get out of paying high cable bills.", "verified": true, "helpfulness": "0/0", "author": "Annys"}, {"rating": 5.0, "review": "The Fire TV Stick was easy to install and use. I am very satisfied with the ease of using it to view Amazon Prime shows and Netflix. I have not tried anything else.", "verified": true, "helpfulness": "0/0", "author": "Betsy Moore \"B. Moore\""}, {"rating": 4.0, "review": "OK, it's working, but there is a learning curve. I had also ordered two digital books on using the Stick to supplement the meager instructions that come with, and they have been very helpful. One thing that I did learn was that when I ordered my HDX Kindle Fire, to replace my first LCD one, it was specifically because the product info told me that it would wirelessly \"fling\" video content to my Samsung TV - and it turned out that my TV was one year too old to be flung to, so the stick was my next option. BUT it also turned out that when i thought I was ordering HDX for my second fire, what I actually got was HD (with no X), and the Stick works with HDX, not HD. Bummed again. But there ARE ways to compensate. While I could not \"mirror< from my Kindle Fire, I can from both my laptop as well as another tablet device that has an Android OS. Only after accomplishing that, I realized that mirroring is, for me, not as satisfactory as \"pairing\" my device, which does not require that the displays on the device and the TV screens to be tied together for the duration. Eventually I stumbled across the Fire TV Stick Remote App, which I DID download to my merely HD (not X) Kindle Fire, and THAT is the best solution of all - the actual remote that comes with the stick does not have voice control (although I believe you could order one separately), but since my Kindle Fire HD (not X) also has a camera and the microphone that goes with it, the app turns my Kindle Fire into a Fire Stick remote WITH voice control - and if you want to search by typing, the keyboard on your Fire is a hundred times better than selecting one letter at a time on your TV screen with the small Stick remote.SPEAKING of the remote, it is really cute, but too small, which makes it (1) easy to lose and (2) hard to use if you have big hands, fat fingers, or arthritis. I made a removable, padded \"pant\" with foam rubber and duct tape that addresses both issues (picture attached). Also, regarding the remote, iras VERY difficult for me to remove the back cover in order to install the batteries included in the  box -- SOLUTION for that - go to YouTube and search fire stick remote batteries, where you will find a video showing you exactly how to get into the dang thing. Seriously, I was on the verge of grabbing a hammer and smashing it like a nut, it was that exasperating.OK, so on now to the \"one concern\" referenced in the subject line. If you order your Stick from amazon (as opposed to getting it third hand or at a local retailer), it will come preloaded with viewing suggestions based on your amazon order history and, as you use it, it is supposed to refine its idea of things you might like to see. I just have to wonder how sophisticated this learning process is. It would be wonderful it it would distinguish things that you watch and enjoy from things that you start watching and find too horrible to continue. The QUESTION therefore is: does it imprint on things you SELECT, assuming that just because you selected it you would enjoy seeing similar things -- or can it learn to disregard things that you watch for a few minutes before determining it's not your cuppa tea. Part B of the same question -- is it possible to TEACH the device what to ignore but deleting things you did not like from your viewing history?", "verified": true, "helpfulness": "4/4", "author": "V. Schmidt \"blue9112\""}, {"rating": 5.0, "review": "It is amazing! I have Amazon Fire TV in my family room and loved it so much, I bought the Fire TV Stick for my master bedroom. I had been watching on my Kindle Fire HD 8\" sitting on my nightstand, or hooking it up to my large screen in the bedroom, but having to get up to change channels or shows is a pain, and at $30 plus dollars, the Stick is an inexpensive, wonderful alternative. Plus it frees my Kindle Fire for simultaneous web surfing or reading!  The Amazon Original Series are all top notch too. I can't say enough good things about everything Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Linda M. Sarnecki"}]