[{"rating": 5.0, "review": "My favorite stick!", "verified": true, "helpfulness": "0/0", "author": "Guillermo Trovato"}, {"rating": 4.0, "review": "In my recent experience I can tell is a good start. I still haven't tried all the channels and features, but the setup was easy and I feel comfortable and enjoy using it. The performance is really good and the remote control answer to my commands is ok.", "verified": true, "helpfulness": "0/0", "author": "JK"}, {"rating": 3.0, "review": "Too similar to Netflix. Wireless connection stops randomly for the fire stick when it is still running fine for other devices and even other networks through my TV and it continually freezes up; sometimes for many minutes.", "verified": false, "helpfulness": "0/0", "author": "Renee Sheeler"}, {"rating": 1.0, "review": "we took it back it did not work for us", "verified": true, "helpfulness": "0/0", "author": "dianne persad"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Dan Corbett"}, {"rating": 4.0, "review": "Amazon Fire TV Stick is great! A must for Amazon Prime members.  I think with Fire TV I can finally cut the cord.", "verified": true, "helpfulness": "0/0", "author": "\"drodneys\""}, {"rating": 5.0, "review": "I love my Fire Stick. I was originally interested in Chrome Cast but decided to purchase a Fire Stick on Prime Day. I like it so much that I decided to go buy another one at Best Buy (I didn't want to wait for it to arrive from Amazon). I love having access to all my streaming accounts and not having to hook up my laptop all the time to watch something.", "verified": true, "helpfulness": "0/0", "author": "Adriana"}, {"rating": 5.0, "review": "Very happy", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 5.0, "review": "Ok I've had a roku stick for about a year, and wanted a stick for my bed room so i got a fire stick for my living room TV. Both work well. I'll review both. The ROKU works great for me, every now and then I had to reset it to get Netfix to work. not that big of a issue, but about once a month or so i had to reset thru the settings for Netflix, Amazon prime worked without issue. The fire stick runs Netflix great, hulu and of course Amazon prime, the fire stick is Much faster and much more responsive than the roku. Audio and video are equal on both sticks, got 1080p with both. Both came with remote controls and work almost identically (the roku is way less responsive it takes more clicks and runs past what you want often.) The fire stick came with a HDMI extender that will work better for wall mounted TVs, the fire stick is 10 to 15 dollars cheaper. So if you are going to buy a stick, I think the Fire stick is better just slightly.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 1.0, "review": "Sales rep. at Best Buy thought the Fire TV Stick box I purchased from them would work almost similar to the Kindel Fire tablet my daughter bought me that has a fantastic amount of free movies, etc.  Big surprise....complicated, sign up went as far I wanted with little info., costs, etc. plus very few free movies!Anyway FYI - I returned the Fire TV Stick back to Best Buy same day....only answer from their Geek was that the Tablet probably had older apps. on it then the new TV Fire Stick.Thanks - Ken", "verified": true, "helpfulness": "0/0", "author": "Ken Haggard"}]