[{"rating": 5.0, "review": "Thank you enough said", "verified": true, "helpfulness": "0/0", "author": "Brian Gallegos"}, {"rating": 3.0, "review": "So far so good. Getting used to the interface, looks nice but feels a little awkward to me. I do love how speedy this little thing is. I do with the power plug was a little smaller.One star off cause it took a while to get here.Update:Amazon content is fine but interface for the hbogo and showtimeanytime apps are both pretty sluggish. The streaming is fine once I select a show or movie but the interfaces are so sluggish and slow that is can be pretty frustrating. I have deleted cache and uninstalled and reinstalled the apps, and restarted the fire stick and there's been no improvement.", "verified": true, "helpfulness": "0/0", "author": "doodlebang"}, {"rating": 5.0, "review": "So far so good! Very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "J.E"}, {"rating": 1.0, "review": "The Kindle stick did not work.  I could see movie trailers but not the movies.  2 hours on the phone with customer service and tech support didn't help either.  They were supposed to call back two days later with a resolution.  A week later still waiting. ....", "verified": false, "helpfulness": "0/2", "author": "K Man"}, {"rating": 3.0, "review": "It was really hard to get the remote open to put the batteries in and it took awhile for it to connect to the Wi-fi. I had to do a lot of troubleshooting and unplug it, add the hdmi extender, reset my internet, etc. I contacts Amazon customer service and the reply I got had nothing to do with the fire stick, which was disappointing and I love Amazon and their products. I'll be keeping the fires stick, but I think Amazon has a lot of work to do in this product.", "verified": true, "helpfulness": "0/0", "author": "Cherith A. Chase \"C. Chase\""}, {"rating": 5.0, "review": "YES, you want this!!!!! With all the great offerings on Amazon and other streaming video, you don't need to pay cable bills and deal with the poor customer service offered by cable companies. I got so sick of cable companies not bringing specific equipment I requested, specifically a DVR that WORKED, that I stopped using cable and switched to streaming video several years ago. But once I bought a TV and tried to stream video on it, my \"high-speed\" Internet, which I was paying $90 a month for, caused very frequent pauses for buffering -- like 3 in half an hour! I ordered the Fire Stick as soon as it came out. It's FANTASTIC!!!!! It took less than 15 minutes to get it up and running. The video is sharper than it ever was; even my non-HD TV series look better than HD used to. No more problems with pauses for buffering -- not ONE in three weeks!!!! Amazon gives you access to lots of classic movies and TV you won't find on cable, and current series are generally available maybe one season behind. You never have to see another commercial, and with elections coming up, avoiding all those stupid political commercials is a real blessing. I was able to switch to a lower speed Internet service for half what I was paying and have better service with the Fire stick. It's one of the best purchases I've ever made. Now if Amazon could just get access to past seasons of all the soaps ABC canceled, I would be absolute heaven!!!!", "verified": true, "helpfulness": "0/0", "author": "Deborah M. Okey"}, {"rating": 4.0, "review": "Pros: Cheap price! User friendly! Tons of content!Cons: The introduction video is long and annoying. There is no way to by pass it. One of the Apps I really was excited about was Twitch. However, I found out I can't search for specific channels. I am stuck with the channels they display.So I got this neat little black box on my door step today. I opened it up to find the TV stick. Excited!! I quickly opened the package and removed everything.Inside I found the remote control, the stick, two AAA amazon basic batteries, a usb plug and wall adapter (which I didn't use).I plugged my power supply directly into a open usb port on my TV. When the TV is off the stick is off.After powering it on and selecting my wireless router, I found my account was already attached which to me was fine. I know some people have issues with their account being already active on amazon devices. Some people reported devices being stolen in the mail.Alright so the system is up and running.. but oh wait.. issue number 1. You have to watch a boring video that tells you the capabilities of the streaming stick. Funny.. I knew all this. That is why I bought it. There is no way to opt out of this long and stupid video.Finally at the home screen. Everything is laid out pretty friendly for what you would expect. Easy to navigate and find the content you want. I personally only use it for Amazon, Twitch, and games. I haven't really gotten into the games yet, but was struck a blow finding out twitch has limited use.I am sure there will be plenty of updates from other users on the other content.All in all the set up was easy and the device is nice. For being assembled in china, it is a sturdy little item. I hope it has no failures and lasts a while. For the price I would rather have this than a roku stick. I wouldn't even compare this to the chromecast. This is far better.", "verified": true, "helpfulness": "0/0", "author": "Dice55"}, {"rating": 5.0, "review": "Love it! I already had Chromecast but like this better. It has the remote which is nice and great features. You don't have to use a computer or tablet with it. Good format and easier for fast forward. Includes Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "butterfly"}, {"rating": 5.0, "review": "This is great, better than having to hookup a laptop for streaming. It doesn't have disconnection issues as does my Xbox when running an instant streaming provider. Nice deal for the price, plus prime is only 50 a year which makes it cheaper than Hulu or Netflix per month.", "verified": true, "helpfulness": "0/0", "author": "Josiah Hendricks"}, {"rating": 5.0, "review": "just what I wanted!", "verified": true, "helpfulness": "0/0", "author": "laura nicholas"}]