[{"rating": 4.0, "review": "Good.Met our expectations. Different in the beginning but little by little we are learning. Still sometimes we miss to review the movies.", "verified": true, "helpfulness": "0/0", "author": "Ketty"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "petra vinas"}, {"rating": 1.0, "review": "It loads very slowly if you don't have super fast internet. We thought this would be our solution to no cable access where we live, it was not. Our kindle can load fine but it takes days to load on the tv fire stick", "verified": true, "helpfulness": "2/4", "author": "Kindle Customer \"I love to read, and listen.  I listen to all types of things as well: fiction: romance, thriller, mystery; non-fiction: biographies, leadership, etc\""}, {"rating": 5.0, "review": "Amazing.  Everyone should have one!", "verified": true, "helpfulness": "0/0", "author": "Edward N. Schweitzer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "greg dumorne"}, {"rating": 1.0, "review": "The Fire TV Stick was easy to set up and I like the interface. It's about as navigable as Apple TV. I don't like the separate power supply - the \"wall wart\" is small but it's still a separate power supply. The Fire Stick worked great for the first few weeks but in the past week it has begun to lose the wifi connection and locking up on movies (Netflix). While watching one movie today, I rebooted the unit (unplugging its power supply and reconnecting) twice to get through it. For this alone give it one star since my Apple TV, Samsung Smart Hub, and other wifi-connected devices (iPad, iPhone, computers) aren't having any wifi woes.", "verified": true, "helpfulness": "3/4", "author": "New Castle K. \"Gadget Geek\""}, {"rating": 4.0, "review": "I have a modern, Internet-enabled TV... but I also have an early, first-generation 24\" Sharp digital TV that has HDMI inputs, but no Internet capability, and that's why I bought a Fire TV Stick. The good news: The Fire stick not only works better than my Roku box, it's better at streaming digital content than my 55\" LG TV. I've had many problems streaming Amazon content with my LG, but the Fire Stick seems to handle it effortlessly, with no waits while the TV stops and fills the buffer again. All in all very well engineered product. But it does have a few flaws. As others have noted, the small size is a bit misleading, as the Fire Stick needs an external USB power supply- which is included.The bigger problem is that it doesn't work with my Sharp old TV. It took me a while to figure out that there was an incompatibility problem, and that I wasn't just dealing with a defective Stick. After a half hour of restarting, plugging and unplugging, changing batteries and pushing buttons, I switched TVs... and it started up right away. So while it's a great unit, be aware that it may not work with your older TV. Having an HDMI input is no guarantee of compatibility.Two month update:I have been very pleased with the performance of the Fire Stick for the past two months. It's far better at streaming Amazon video than is my Internet-ready LG TV- no pauses for buffering, sound synch errors, etc- and better at You Tube and Netflix streaming, too. It works better than the Roku boxes I've owned in the past, too. But tonight it suddenly quit working after only two months. I put in a warranty repair/replacement request, and I'll report back here how long it takes to get a replacement.", "verified": true, "helpfulness": "1/1", "author": "Michael J. Edelman"}, {"rating": 3.0, "review": "It's okay, but it needs some upgrading. I presume they wanted to get this out for the holiday season, but it has minor issues. I've had to unplug it a few times due to a system freeze. The GUI is flakey and jumps or freezes some times.I was one of the lucky ones who paid $19.00 for it and for that I am glad. It's no match for my Xbox.", "verified": true, "helpfulness": "0/0", "author": "!!!!! C5 !!!!! \"Chip...\""}, {"rating": 2.0, "review": "Worked fine for a couple weeks. Now the WiFi signal drops out way too often. I've tried many different router settings with no luck. Running Tomato firmware on a Linksys E2000 router. I hoping this issue is addressed with a new firmware update.", "verified": true, "helpfulness": "1/1", "author": "Alan Wilson"}, {"rating": 4.0, "review": "Pretty good.  I didn't realize that it had a wall wart power supply, but it isn't too big and still fits behind my tv.  It has crashed a couple times, preventing movies from loading.  I had to remove power and reboot to get it to work.  Amazon should give these away as it is a good conduit to buy and rent movies.", "verified": true, "helpfulness": "0/1", "author": "Brian Hale \"yesterday gone\""}]