[{"rating": 5.0, "review": "I bought this as a gift for my brother.  However, I tested it before sending it.  It was easy to install and I was immediately was able to locate movies which interested me.  My brother does not have cable so this gift will allow him to catch up on many missed sci-fi episodes.", "verified": true, "helpfulness": "0/0", "author": "Ria"}, {"rating": 5.0, "review": "so far I am really pleased with the fire TV stick. Controller and menu response is quick and accurate a lot more convenient then turning on my Xbox to watch Amazon prime movies. it syncs with all of my other Amazon accounts which comes in very handy and convenient when showing off photos I have put on the Amazon cloud.", "verified": true, "helpfulness": "0/0", "author": "chris p"}, {"rating": 2.0, "review": "I gave this item two stars because I haven't been able to get this to work., and I bought two of them.  When I plug it in it gets processed all the way to  when it is support to update.  And it doesn't.  There is a message that comes on the screen telling me to contact www.amazonfire.com/tv but when you do there is absolutely nothing the comes up for technical support. I spent 40.00 dollars for nothing or for something that doesn't work or have a contact for technical support.", "verified": true, "helpfulness": "1/2", "author": "C. A. davis deveaux \"cadd\""}, {"rating": 5.0, "review": "Great buy no regerts lol", "verified": true, "helpfulness": "0/1", "author": "MarkRN"}, {"rating": 5.0, "review": "Love the Fire TV Stick. If you are a prime member it's a great  buy. Video quality is great.", "verified": true, "helpfulness": "0/0", "author": "Donald D."}, {"rating": 5.0, "review": "One of the better investments in my later years!!", "verified": true, "helpfulness": "0/0", "author": "senior chief"}, {"rating": 4.0, "review": "Very easy to install! Wish apps were already pre-installed.", "verified": true, "helpfulness": "0/0", "author": "Melissa Huerta"}, {"rating": 4.0, "review": "Nifty little device, but the Apple IOS app does not have all the features that are advertised (such as watching something on your phone/tablet and then flipping it to your tv screen).  Also be aware that the stick does not draw power from your tv, you must plug it in to a wall socket in addition to plugging it into an hdmi port.", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "James L. Porter"}, {"rating": 5.0, "review": "My son installed the Fire TV stick; now we are enjoying Prime movies and shows and just received Netflix from our eldest for Christmas. Great entertainment over these long winter months in the Northeast.", "verified": true, "helpfulness": "0/0", "author": "Jonel"}]