[{"rating": 3.0, "review": "We thought there would be more apps in the app store, so far none of are music app s are there", "verified": true, "helpfulness": "0/0", "author": "Charles F. Curry"}, {"rating": 5.0, "review": "We are delighted with our Fire TV stick! It was extremely easy to install and run. We get a great picture and have no trouble with buffering. It was the perfect solution for the basement TV which has no cable connector. It works so well we are thinking of getting one for our upstairs TV too!", "verified": true, "helpfulness": "0/0", "author": "Ruth"}, {"rating": 4.0, "review": "Works great on my LG tv, but on my vizio smart tv it has a hard time connecting.", "verified": true, "helpfulness": "0/0", "author": "Derric R."}, {"rating": 5.0, "review": "Works a treat.", "verified": true, "helpfulness": "0/0", "author": "Ian Cornish"}, {"rating": 5.0, "review": "I keep telling those other guys to stop calling me. After 18yrs of a satellite provider and we all know Directly who, the bill kept creeping up for one thing or another. I saw all these cheaper rates they were offering to new business but not rewarding old reliable business so I got rid of them and got an antenna that reaches over 70 miles, wow all my local channels are free. Then I got this firestick, AWESOME! I can watch what I want to watch and if I want to watch. Some show I may have to pay 1,99 to see them but its still at my leasure and the best part, I am not paying 1200.00 a yr anymore for the same thing. lol Now Direct keeps calling trying to get me back, they had their chance before I went this way. I love it! I am totally happy and with my Prime membership its a double bonus. I get lots of other things along with my prime besides movies and television shows. I get free music, I can watch a whole season of my favorite shows for free, now hooked on Downton Abbey, lol and Reign.  I am still exploring all the fun things I am getting with Amazon Prime and Fire stick. I highly recomjmend it.", "verified": true, "helpfulness": "0/0", "author": "Lisa Hickey"}, {"rating": 5.0, "review": "I LOVE the fire stick.  Bought it for my husband for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Deborah"}, {"rating": 1.0, "review": "I woud have enjoyed this product had I had access to unlimited Internet.", "verified": false, "helpfulness": "1/3", "author": "Fun, but a little easier Than I expected at first."}, {"rating": 4.0, "review": "It's wonderful band easy to use. We have however lost the remote several times. Could be a little bigger.", "verified": true, "helpfulness": "0/0", "author": "Katie Dorsey"}, {"rating": 5.0, "review": "Works great with my cell phone especially the voice command!", "verified": true, "helpfulness": "0/0", "author": "Dennis R Cherry"}, {"rating": 4.0, "review": "This is a great gadget. Bought it when Amazon was selling it \"pre-ordered\" for $19.00. The speed is awesome for such a small gadget. The wireless speed is amazing... My TV (Sony) has built-in wireless (very crappy) this gadget is at least 4 to 5 times faster. Movies never chop or lag. TV is on a different floor, and about two additional walls away. Wireless speed is awesome.HERE IS WHY I WONT GIVE IT A 5 STARS... even though it deserves it.... The bigger brother has a voice search feature that is second to none. WELL... Amazon can sell you the remote SEPARATELY for this unit... why not offer a model with a voice search equipped remote for a few extra dollars.I must also point out that I don't care much for the voice remote search, but my wife and kids really like it. I might have to buy it for an additional $20.00 to $30.00 (I think)Highly recommended. Very fast. The cover flow when showing the movies cover is the smoothest I have seen.", "verified": true, "helpfulness": "0/0", "author": "Ralph Montague \"R. Montague\""}]