[{"rating": 4.0, "review": "Getting used to handling remote and choosing things off on screen options.  I do not like the fast forward abilities-maybe I'm doing something wrong", "verified": true, "helpfulness": "0/0", "author": "Cleaner after dogs"}, {"rating": 5.0, "review": "Awesome enough said, Best $40 I ever spent", "verified": true, "helpfulness": "0/0", "author": "lehman eugene"}, {"rating": 4.0, "review": "I bought this for my parents because they aren't very good with technology and I figured a chromecast like device that had a user interface and a remote would be perfect for them. While this is true, the Fire TV Stick is not all I'd hoped it would be. Terrible product name aside, the device has worked well besides a couple of things:1. It runs on apps off the amazon android appstore. For example, Plex has to be purchased in order to be used, along with any other service you hope to use that costs money on the amazon android appstore2. I've had a couple of stability problems, for example with plex the movie will often freeze, crash, and then continue playing where it left off at least once a movie. I don't have this problem on any other device3. The TV automatically changes input to the fire stick whenever it is plugged in. This means I have to either unplug it when I'm not using it, or change the input every time I turn on the TV. Not a big deal, but I really don't see why Amazon thought this would be a good idea.", "verified": true, "helpfulness": "0/0", "author": "Matt D"}, {"rating": 3.0, "review": "I own three different streaming systems. After using all three, the Amazon Fire, the Google Chromecast and the Amazon Fire, I have frankly reached the conclusion the Roku is the best, Amazon Fire is the second best, and the Google Chromecast is my least favorite of the three.If you can't get a Roku, then get the Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Newsguy from Bama"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 3.0, "review": "Works similar to Chromecast with addition of Amazon prime.  most expected and disappointing feature is Miracast  remote display . it does not work with windows 8.1 neither does it work with Lollypop.would be nice if Amazon would let you distinguish between free  and paid apps", "verified": true, "helpfulness": "0/0", "author": "YR \"YMR\""}, {"rating": 5.0, "review": "Love it! Easy to install. Even easier to use. And the price is right. It goes perfectly with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "david potter"}, {"rating": 5.0, "review": "Awesome! Love It!", "verified": true, "helpfulness": "0/0", "author": "sara"}, {"rating": 4.0, "review": "Works like advertised.  Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "threedad"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "diane"}]