[{"rating": 2.0, "review": "Great until it sleeps.  When it sleeps, it creates an error with my TV's HDCP connection.  Each time the fire stick sleeps I have to unplug my tv and the firestick and then restart them both.  Turning sleep off is not an option in the settings which it should be, and if it was an option then i would give it 5 stars, but since it isn't it creates a huge pain every time i want to use it.  So now I will just stop using it.", "verified": true, "helpfulness": "0/0", "author": "Josh T"}, {"rating": 4.0, "review": "Works great! Does all the set up work by itself!", "verified": true, "helpfulness": "0/0", "author": "C.Draper"}, {"rating": 5.0, "review": "Excellent apps, videos, games, overall it's been an incredible experience to play with this.", "verified": true, "helpfulness": "0/0", "author": "Cliff Bragg"}, {"rating": 5.0, "review": "Amazing! Reasonably priced and gives me access to many shows and movies without having to pay for cable!", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 5.0, "review": "We have the ROKU and the Fire TV stick and hands down, our favorite is the stick. We ordered the stick before it was officially released and we couldn't be happier with the price we paid.Games, Prime content, purchased content, channels (Netflix, etc) - it's all there and we use it regularly. I can quickly browse our library, search, or browse content and I'm impressed with how much material they have for both the kids and the adults.Every so often (after many weeks), we have to unplug the power source and let it sit so that it resets. I see that this has been mentioned, but ours is nowhere near every 3 days like I've read here.One suggestion for improvement: headphones in the remote.", "verified": true, "helpfulness": "0/0", "author": "Sarah Nenni"}, {"rating": 4.0, "review": "Set-up was a snap.  We haven't had a lot of time to play as yet, but the menu seems to be pretty self-explanatory.  We are long-time Netflix users and were a little concerned with buffering we saw.  We'll have to explore a little further, as my other devices have no issue in streaming wirelessly in the same room.  Looking forward to lots of enjoyment with our Firestick!", "verified": true, "helpfulness": "0/0", "author": "Vicki from Cincy"}, {"rating": 5.0, "review": "I simply love this product.  This has made our lives so much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "elizabeth savage"}, {"rating": 4.0, "review": "After researching the different streaming devices, I decided to go with Amazon FireTV.  This is my first one ever.  I originally planned to get the box, but bought my dad the stick as a gift, which he didn't want.  Anyway, I am using the stick myself and find that it is fast enough for me.  My main goal was to be able to get youtube on my tv, which I can do with the firetv.  I have cable hookeup and most everything streams without buffering.  There may be some buffering once in a while, but not much.  I don't like not having a manual on how to do things, but when I did call amazon, they did help me on one issue.  I also don't like how youtube placed inappropriate videos on my \"history\", when I didn't even view them.  I had to set the \"control\".  This is probably the only reason why I didn't give it five stars.  Also, there are not many \"free\" movies on Amazon Prime Videos.  I like Glen Ford and there are only three free ones.  All others you have to rent or buy.  I know this has nothing to do with the firetv, but just worth mentioning.  This is also the case for many other actors.  HBOGO is also available on the firetv.  In time I may also purchase the firetv box.", "verified": true, "helpfulness": "0/0", "author": "bhumane"}, {"rating": 5.0, "review": "Such an amazing product beats all the competition out there for the stick market google chrome cast and Roku stick don't stand a chance against this product thank you amazon :D", "verified": true, "helpfulness": "0/0", "author": "TheMatthew562"}, {"rating": 5.0, "review": "Brilliant! Have to have one. Beats the HDMI cable from your computer. Has Netflix so you can binge watch all their Netflix only shows on your TV without an HDMI cable from your computer. Also has Amazon Prime, Showtime, Espn and more. Now I just need one more for my other TV but it's very portable. Did take a while in shipping probably due to demand. I love it though and am thinking about getting another one. How did I live without it?", "verified": true, "helpfulness": "0/0", "author": "Peggy H."}]