[{"rating": 5.0, "review": "Works great. But with the need for the power source to the stick, very similar to the box version. Same quality as the box version, just at a much cheaper price.", "verified": true, "helpfulness": "0/0", "author": "DOUGLAS R BRITTON"}, {"rating": 1.0, "review": "Had a difficult time getting the device to pick up our wifi. Actually ended up taking our roku upstairs and trying this downstairs. Not much better. Took forever to download netflix and hulu. Screen freezes but audio runs. Wrestled for quite a while just to get batteries into the remote. Online now buying another roku device. Google chromecast even blows this away. Not worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tina Stawiarski"}, {"rating": 5.0, "review": "AWESOME SAUCE!!!👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍", "verified": true, "helpfulness": "0/0", "author": "frankietri"}, {"rating": 5.0, "review": "So simple to install, started using it right away. Need to get another one", "verified": true, "helpfulness": "0/0", "author": "Leticia Molina"}, {"rating": 5.0, "review": "I have Amazon Prime and I used my smart TV to access my subscription.  I found out that wasn't the easy way to do it.I ordered the Fire TV Stick and all my problems we solved.  It was easy to install and easy to use.  Plus I have the benefitsof the subscription at my finger tips. great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "GOODSTUFF"}, {"rating": 5.0, "review": "I don't have cable, this product is AMAZING so far! I've only had it for about a week and there is still so much to explore on there! I recommended this to family already.", "verified": true, "helpfulness": "0/0", "author": "Amber"}, {"rating": 2.0, "review": "This would be awesome if it didn't stop to buffer all the time. Really irritating. I loved the concept of an out of the way streaming device, and it was very easy to set up as well as being very user friendly. But the constant interruptions in streaming isn't tolerable. Glad I only paid $19 for it.", "verified": true, "helpfulness": "0/0", "author": "Margaret R."}, {"rating": 5.0, "review": "I have all the smart phone plug ins and this is  by far is the best value. It blows away the chrome cast and the Roku too. It is very close to Apple tv but it is so much less expensive that the fire stick is the one I would recommend especially to someone that is budget minded.", "verified": true, "helpfulness": "0/0", "author": "John D."}, {"rating": 3.0, "review": "The set up was pretty simple. It randomly shuts down pretty often, which is very frustrating. I would not order again.", "verified": true, "helpfulness": "1/1", "author": "AMBER STYRON"}, {"rating": 4.0, "review": "I'm still learning about all its features...so far so good.", "verified": true, "helpfulness": "0/0", "author": "R. B. Eveslage \"Yankee Woodworker\""}]