[{"rating": 5.0, "review": "Fantastic device for streaming!", "verified": true, "helpfulness": "0/0", "author": "scott dollar"}, {"rating": 4.0, "review": "I enjoy it very much and was very easy to install", "verified": true, "helpfulness": "0/0", "author": "nellieb322"}, {"rating": 5.0, "review": "Simply awesome, best $40 spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "Corey D Vaughn"}, {"rating": 5.0, "review": "Great, I love it", "verified": true, "helpfulness": "0/0", "author": "shalisa"}, {"rating": 5.0, "review": "More than met my expectations!!", "verified": true, "helpfulness": "0/0", "author": "carstant"}, {"rating": 4.0, "review": "I'm a fan of the FireTV Stick. I'm hoping I don't get jinxed by writing this review and run into other posters' issues with connectivity, but thus far I've had great success. I will say that when I tried to move the stick into another room in the house, it was not as successful, but the overall experience has been great. Tons of movies and TV shows to choose from. Really like this product.", "verified": true, "helpfulness": "0/0", "author": "Amy \"a\""}, {"rating": 5.0, "review": "Love it!!! I like how I can easily move it to different tv and even take it with me when traveling. I wish the power cord was longer though or the mini cable worked..", "verified": true, "helpfulness": "1/1", "author": "Melissa C."}, {"rating": 2.0, "review": "I really wanted to like this, and I do like it when it works.  But, sadly, it just doesn't work often.  For the first day I had it, it connected to my network and worked perfectly.  The interface isn't as intuitive as I might have liked, but I was able to find what I wanted quickly enough and the apps are all great.  The included remote works very well, and unlike the stupid Apple TV remove has enough buttons that there's zero learning curve.  It boots up quickly, goes into sleep mode when not in use, and wakes up with a single button touch.This is where the positives end.  After that first day, the device simply stopped connecting to my network reliably.  It would connect for a few seconds, and then drop connection.  Once dropped, it would never reconnect even though the network settings show my network with strong signal, and even showed that it was connected.  Very frustrating.  I Googled it, and apparently this is a very common issue with the Fire TV Stick that is not present in the full Fire TV device.  It is well-known and widely reported, but has never been addressed by Amazon.  It was suggested that the device simply doesn't work well on Wireless N networks, and prefers Wireless B and G.  I set my router to only broadcast B and G, but it solved nothing.  Even if I place the device within 5 feet of my router, it will not say connected.  I have given the device to my girlfriend in hopes that it will work better on her network (for whatever reason), and if not, then I will be returning it.Also, the mobile remote app for this thing is terrible.  It does offer you the advantage of using a keyboard to type, but what you are typing doesn't even show up on the app itself, only on the TV screen.  So you find yourself trying to divide your attention between the phone and the TV screen to type, which probably doesn't sound as bad as it is.  But trust me, it's less than ideal.  The app is so bad that I have to wonder if the developers have ever actually tried using it themselves.My advice to anyone scoping this thing out is to try it, but keep the original packaging and be prepared to return it.  Based on other reviews, it is working well for most.  But my research after having these issues proves that my bad experience is not unique.", "verified": true, "helpfulness": "3/3", "author": "FullmoonCat"}, {"rating": 5.0, "review": "I currently own four of these. I bought one in Feb. 2015 and after some preliminary testing and successful side-loading of XBMC/KODI, I now own four of them -- one for each TV in the house and one just for travel. These have worked out so well for me that they have replaced three, large Windows 7 PC's I had hooked-up to my TVs for the sole purpose of XBMC/KODI. With Amazon Prime and Netflix support, it's just icing on the cake. I have since told a few buddies about it and now they each have one.When I travel, I bring my 4th FireTV Stick plus my HooToo TripMate Nano Wireless N Pocket Travel Router (HT-TM02) which has a USB drive loaded with content (movies, TV shows) that I can watch anywhere -- including a recent cruise I took:http://www.amazon.com/HooToo-TripMate-Wireless-Pocket-Travel/dp/B00HZWOQZ6/While I have been successful at streaming from a hotel's own wi-fi network, sometimes the speed is just too slow and therefore the picture quality is terrible. In those cases, I check to see if have decent 4G LTE speeds on my Sprint cellphone. If so, I enable the Hotspot function on my phone and then connect my FireTV Stick to that. A few weeks ago, I was able to stream clear HD content from Amazon Prime Video as well as SlingTV via my phone without any issues for hours. Very impressive!I should add that because of the FireTV Stick + SlingTV and other apps, I recently cancelled DirecTV after 15 years (and almost $18,000 spent during that time!!!). So, yes, this thing can save a lot you money.Lastly, I am delighted that they now have hotel portal support. When the FireTV Stick detects such a connection, it brings up a simple webpage showing the hotel's login screen. You can then use your FireTV remote to login and bypass that hurdle.I cannot recommend these devices more! I wish they came out 10 years ago. I would have cancelled DirecTV then and not spent the money for those 3 PC's.", "verified": true, "helpfulness": "0/0", "author": "TD99"}, {"rating": 3.0, "review": "The drive gets hot and starts to act up.", "verified": true, "helpfulness": "1/1", "author": "JoAnn"}]