[{"rating": 3.0, "review": "I have a roku as well as the amazon fire stick so comparing this to a roku is pretty easy. First off, no one in the family likes the browse setup. it seems much more difficult then it should be and doesn't give you all the options you get in the other streamer. It says its faster but I seem to have alot of issues with the frame freezing but the audio continues. After about 15 secs or so the video with play triple speed to catch up, which gets real annoying, and it isnt noticeably any faster. I check the network settings and it says it is getting excellent reception and I dont have this issue on the roku. Pandora will continue playing when you go back to home page. You have to go back in, manually stop your music then back out to home page. Just more extra steps for no reason.  Not all the apps are available on this that you get on the other. a lot less. Its not a bad streamer just a lot of small annoying things that really shouldn't be there. If I had a choice to buy this again, I would choose the other streaming device.", "verified": true, "helpfulness": "0/0", "author": "Stephen Rodriguez"}, {"rating": 5.0, "review": "The tiny little gadget and it's accompanying controller are so easy to use and bring way too many options to the screen. You could make it a 24/7 job just watching what is available:)", "verified": true, "helpfulness": "0/0", "author": "Philip L. Carnahan"}, {"rating": 1.0, "review": "Never gets a signal.", "verified": true, "helpfulness": "0/0", "author": "Andrea Andrews"}, {"rating": 2.0, "review": "This is the 3rd Fire Stick I've received. Amazon cannot fix the problem. I really like the Fire TV Stick but I don't have the problem when I use Wii. So...", "verified": true, "helpfulness": "0/0", "author": "Kathy Flood"}, {"rating": 1.0, "review": "Interface moves very slowly.  Very difficult to browse the Prime Movies menu, some shows that are available with my Prime membership did not appear when I used the search function.", "verified": true, "helpfulness": "0/0", "author": "PutterGuy"}, {"rating": 5.0, "review": "I am madly in love with this gadget.", "verified": true, "helpfulness": "0/0", "author": "greatgary"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Timothy S. Doering"}, {"rating": 4.0, "review": "I pre-order this when it was on sale for $20. I already have an AppleTV but thought I'll give this a try. It's interesting playing Flappy Bird on this. I mostly use this for Netflix through.", "verified": true, "helpfulness": "0/0", "author": "Mimi"}, {"rating": 2.0, "review": "It's probably a decent media device, however it was promptly returned to Best Buy when I realized I needed to supply billing information just to download free apps like Netflix. Sorry Amazon, you lost me. The included hdmi extension was nice though, since my tv didn't offer enough clearance for the stick.", "verified": false, "helpfulness": "0/0", "author": "Max"}, {"rating": 5.0, "review": "I have a chromecast and some Android computer stick my brother gave me for Christmas. Of the three the Fire Stick is far superior. The remote makes it easy to use and the unit is very stable compared to the other two devices we own which would log out of Netflix or freeze occasionally. The only advantage of the Android was browsing ability.", "verified": true, "helpfulness": "0/0", "author": "Greg Collins \"Maverick\""}]