[{"rating": 1.0, "review": "Does not support twc tv. No time warner cable tv app!!!!Supports paid subscription apps like netflix and hulu which my smart tv already has. Not much else.", "verified": true, "helpfulness": "2/4", "author": "av g e \"av g e\""}, {"rating": 5.0, "review": "I bought this on the Prime Membership special offer.  Set-up is easy and it appears to work well...", "verified": true, "helpfulness": "0/0", "author": "Jim \"Jim\""}, {"rating": 4.0, "review": "This streaming stick is really good for it's price. It's cheaper than the Roku Streaming Stick and costs a bit more than the Chromecast. The performance of the device is great. It never lags. But for some reason, there are barely any games on this thing. Overall, this device is great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty awesome!!!! Makes having amazon prime even better", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Horrible week internet connection signal. Maybe I have falty product, but It does not work in any room where my Apple TVs works just fine. And the setup had a bunch of glitches and froze and I had to unplug it (it was purchased on another Amazon prime account and given to me as a gift) and when I tryied to first set it up it would not let me login to my account because it was pre registered to the other prime account that it was purchased on. I am a tech guru, and it had a bunch of glitches so I had to factory reset it and took me 30 minutes to set up because of all the glitching.I love Amazon, but this is an epic fail.Because of the poor programming design, everytime it looses connection the device freezes up and doesn't let you access it. They should just have the device function normally if it looses connection so that you don't have to go through turning it off and on to re establish the connection every time!", "verified": true, "helpfulness": "1/2", "author": "The Biggest Critic"}, {"rating": 5.0, "review": "Great product.  Love the way it works.", "verified": true, "helpfulness": "0/0", "author": "Arsenal \"CK\""}, {"rating": 5.0, "review": "simply and great...", "verified": true, "helpfulness": "0/0", "author": "Leroy Morrow"}, {"rating": 5.0, "review": "This is great as it give me all the extras that I like.", "verified": true, "helpfulness": "0/0", "author": "Mark M."}]