[{"rating": 4.0, "review": "Small, compact, versatile. It is nice that it only takes a few moments to turn on and open Netflix's. Compared to consoles, this device is down-right snappy.Pro'sFastPlenty of web TV options including Netflix, Twitch.tv, Hulu+, Youtube and more!compact, and (can be) self powered by the HDMI slot. Though it is recommended to use the USB > Wall charger.Integrates with your phone or tablet with either the fire app or if you like Youtube, the youtube app on your phone. This makes it easy to NOT lose your remote (unless you tend to lose your phone)Con'sArbitrarily changes the resolution depending on context even if the item can be displayed at a higher resolution. An example would be Netflix, on a PS3 you can always get Netflix at 1080p, but the Firestick will sometimes decide 720p is better and not give you the option to enforce a resolution.Some of the apps (which is not really Amazon's fault, hence only one star off) are not well designed. This FireStick uses a very specialized Android-ish operating system. So ideally you would have generally the same functionality. However this is not always the case. For example, the Twitch.tv app does not have any search or sign-in feature, so if you are following a smaller, less followed channel. You can end up going through several pages of channels to find the one you are looking for.Overall, I would buy again and recommend to friends for a low cost Web TV streaming solution", "verified": true, "helpfulness": "0/0", "author": "Blizzard McGuiness"}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "1/1", "author": "joseph f. moran"}, {"rating": 5.0, "review": "I love the fact that's it's not bulky and there isn't a lot of wires.  It's clutter free, and no interruptions.  My computer doesn't have to be on to watch TV.  I can do other stuff on computer while watching on TV.  Love, Love, LOVE IT!", "verified": true, "helpfulness": "1/1", "author": "Ed-word \"Urban\""}, {"rating": 3.0, "review": "I wanted to love this Fire Stick. Much of the time I do. It would border on being a wet dream for an Amazon Prime streamer of Instant Video and Music,  if it only it were more reliably robust when scrolling through the various menus. Right now (after a couple of months) the Fire Stick and I definitely have a love/hate relationship. When it's working, it's rather brilliant at what it does. Very little, if any buffering going on when streaming video. But the incredibly smooth and fast menu system is definitely buggy, whether one attempts to use the included remote or use the Android app. I tend to have much much better luck when controlling it with the Android app and very sparingly even fool with the remote. It feels like the hardware side of things can't keep up with the really fast and responsive Menu software controls, and then the Menu and/or hardware freezes up. Much of this is happening when utilizing Amazon Prime Music and attempting to scroll through artists and/or albums. But it also happens throughout the menu system. I have the best luck when every few hours I perform a soft boot of the device by unplugging and replugging the power.", "verified": true, "helpfulness": "1/1", "author": "​Anthony (Tony) Peña"}, {"rating": 5.0, "review": "Love the fire stick!  Especially since we can side load other apps.  The word is in your hands!  Thanks Amazon", "verified": true, "helpfulness": "1/1", "author": "Tamatha D. Ogden"}, {"rating": 3.0, "review": "The extension need to be taken off so it would work on older than 5yr TVs other wise it freezes up on you! Hulu streams in like a bad internet connection were on PS3 it comes in fine!!! All the other apps seem ok but way bummed out ab hulu n the glitches!!!", "verified": true, "helpfulness": "0/0", "author": "Marion Varner"}, {"rating": 5.0, "review": "I was surprised at how flawlessly the device installed; the user interface was simple and intuitive. Wished voice command came standard with the remote. The Android app worked well but where is the iOS app? A must for all Amazon Prime members.", "verified": true, "helpfulness": "1/1", "author": "Steven Chan"}, {"rating": 5.0, "review": "Got this as part of the pre-order special from Amazon, and I love it! It's a really nice all in one media center stick that you can plug into the back of any \"dumb\" TV and turn it into smart TV with customizable apps. I love the fact that I can control it with the remote, or with a simple app I can control it anywhere in the house with my android smart phone. We use it extensively for Amazon Prime movies, Netflix, Amazon Music, etc...5 out of 5 stars, it's useful, easy to configure and fills a nice niche!", "verified": true, "helpfulness": "2/2", "author": "Joshua Collins"}, {"rating": 4.0, "review": "Good unit. i like having the remote so I don't have to use a Mobil device lime other products.  I thought the unit was supposed to also do screen mirroring and I don't see it having that ability. Love that I can pull prime music from it as well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am positively happy I decided to buy the fire stick . The only problem I am too addicted to watch shows when I have other important business to take care of. Have told my friends to try it. Great gift as well.", "verified": true, "helpfulness": "1/1", "author": "Irene Azzarito"}]