[{"rating": 4.0, "review": "the volume from the amazon video is too low so I can not really watch because I can not hear what is being said in movies, however on Netflix the volume seems to work properly. So I do not really use it with the amazon video I use My rokku instead.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After months of waiting on back order, I finally got it.  These things are fantastic and basically have replaced my apple TV.  I have been a long time prime member but never really used the movie or TV episode function.  I have and love it.  This thing just works seamlessly and even though it is VERY portable and easy to use, I will now have to buy no less than 5 more for additional TVs.  Darn you amazon.  You can not equal the power and functionality of this thing for the price.", "verified": true, "helpfulness": "0/0", "author": "Crackin4 \"Paul\""}, {"rating": 3.0, "review": "Always freeze in the middle watching this not happened with chromecast but chromecast can't stand alone and no remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use, cost was fantastic", "verified": true, "helpfulness": "0/0", "author": "MARK E. SNAPP"}, {"rating": 5.0, "review": "I love this more than I thought I would.  More than anything, it's fast.  I'm used to waiting for load times using apps on a bluray player, this works almost instantly both for amazon video as well as netflix and other apps.  Plus, it is small and unobtrusive so it ends up feeling like it is just built into the TV.  I got it for $20 as a prime member before they went on public sale, I wish I had bought 4 of them so I could have one on every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Christopher C. Ferro"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "Marvin D. Klang"}, {"rating": 5.0, "review": "Very cool product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Alot better than having to use a second device.", "verified": true, "helpfulness": "0/0", "author": "shannon mcdonnell"}, {"rating": 5.0, "review": "The fire stick is awesome and I recommend it", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Great product for the price. Performs well. Nice video playback... Very smooth.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Fossali"}]