[{"rating": 5.0, "review": "I'm satisfied with all purchases.", "verified": true, "helpfulness": "0/0", "author": "stephen c prokop"}, {"rating": 5.0, "review": "I really like this product. It was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Aimee Dietz"}, {"rating": 5.0, "review": "Love this! We had it hooked up within a couple of minutes and streaming movies off Netflix. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Staci S."}, {"rating": 2.0, "review": "This was great right up until the wifi stopped connecting to it. I am having to constantly unplug it, leave it off for a few minutes and then plug it back in. My wireless router sits RIGHT next to it. I've seen other people with the same complaint and no fix or response from Amazon. Very disappointed!", "verified": true, "helpfulness": "0/1", "author": "Josh Bowers"}, {"rating": 5.0, "review": "What a great product that fits perfectly with all things Amazon. I am sold on everything that Amazon is willing to put their name on.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "best thing since the kindle fire", "verified": true, "helpfulness": "0/0", "author": "PHILIP FRANK"}, {"rating": 3.0, "review": "Remote broken in first week, the cursor circle on remote is broke and no response to replace from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jimmie Lavender"}, {"rating": 5.0, "review": "Setup was fast and easy. The unit itself works quickly, there doesn't appear to be any appreciable lag and the video quality is good. I like the size and build of the remote", "verified": false, "helpfulness": "0/0", "author": "rick johnson"}, {"rating": 5.0, "review": "Really easy to use", "verified": true, "helpfulness": "0/0", "author": "Katheryn Hickey \"Claudia\""}, {"rating": 4.0, "review": "So far so good. I'm having a great experience with my prime and learning to download apps for other movie watching.I wish the YouTube was a bit more like the web page so I could like and and save by folder or just to watch later.", "verified": true, "helpfulness": "0/0", "author": "GDCB"}]