[{"rating": 5.0, "review": "I love my Fire Stick!  It isextremely easy to use and now I can watch all of my Netflix and Amazon stuff on my TV.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Great size. easy to install", "verified": true, "helpfulness": "0/0", "author": "Dennis Scholl"}, {"rating": 3.0, "review": "NOT REAL SURE ABOUT IT YET", "verified": true, "helpfulness": "0/0", "author": "Suzanne"}, {"rating": 4.0, "review": "Amazing, one tiny problem... My Netflix app often has issues with the audio not syncing correctly", "verified": true, "helpfulness": "0/0", "author": "redsonja48"}, {"rating": 5.0, "review": "We love this! I just finished watching a 5 season HBO series The Wire. No problems at all. My Amazon Prime works wonderfully,as does the other selections. Truly a bargain at the price. Much easier than using Wii or other game systems! I have told everyone I know about this. Would definitely recommend!, *****", "verified": true, "helpfulness": "0/0", "author": "PJ"}, {"rating": 5.0, "review": "Easy to install and get running", "verified": true, "helpfulness": "0/0", "author": "James McAllister"}, {"rating": 5.0, "review": "This is great, the best thing I've ever gotten.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 4.0, "review": "Great access", "verified": true, "helpfulness": "0/0", "author": "Marg"}, {"rating": 2.0, "review": "I got this as a replace item. But this one worked for few days and now it is no good compared to the previous item. Remote does not respond sometimes. Navigation is terrible. It just jumps from one menu to the other or back. None of the apps have quality. Should not buy any Amazon Fire products. I hope I can return this item. I would like to buy a 100% android product. Sometimes network error. My old roku and PS3 are much better then this device.", "verified": true, "helpfulness": "0/0", "author": "Manu"}, {"rating": 5.0, "review": "Amazon Fire Stick in one word- ADDICTING", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]