[{"rating": 5.0, "review": "Great funtionality inside a little stick. Be aware of wireless noise when it tries to connect to the router as that will cause issue with apps available on the stick.", "verified": true, "helpfulness": "0/0", "author": "Evan Stanley"}, {"rating": 1.0, "review": "Worst product ever.  Went back to chromecast", "verified": true, "helpfulness": "0/2", "author": "Logan F."}, {"rating": 1.0, "review": "I don't hate it, as the 1 star indicates, it just won't work with my television.  I have an older Flat Screen but it's not ancient by any means.  It won't allow the picture onto the screen, it just goes blue.", "verified": true, "helpfulness": "0/3", "author": "Kevin Michael Dinneen"}, {"rating": 5.0, "review": "This is our third stick and we have given up cable. Love the variety and services.", "verified": true, "helpfulness": "0/0", "author": "Angelica Kate"}, {"rating": 4.0, "review": "With over 34k of reviews I wont delve into stuff already overly mentioned. I will just say I like mine a lot. I have streamed using my ps4, ps3, sony blu ray player, and a old roku 3 and the fire stik is my favorite so far. It loads much faster than the others when starting it up and it loads netflix much quicker as well.The only reason I didn't 5 star it was because the interface doesn't seem quite right to me, like its a little jumbled with too much fluff in it, or perhaps just not streamlined. I cant quite articulate what it is I don't like about it, but it definitely does not ruin the experience or its use. I still love the device, I just wish the main interface was a little more intuitive and wasn't crammed with stuff I have no use for at all. I also wish it had a section for stuff that is free with amazon prime that was more clearly displayed and in its own section.", "verified": false, "helpfulness": "0/0", "author": "Gargus"}, {"rating": 3.0, "review": "Seems like more of a tool for amazon to sell you stuff....", "verified": true, "helpfulness": "0/1", "author": "Anthony J Zukaitis"}, {"rating": 1.0, "review": "terrible device , doesn't work!!!!!", "verified": true, "helpfulness": "0/4", "author": "Marcin Mielczarek"}, {"rating": 5.0, "review": "A perfect product.  Gave these as gifts to friends and family and they loved them.  So convenient and easy to use.  Amazon does it again.", "verified": true, "helpfulness": "0/0", "author": "TDRock"}, {"rating": 3.0, "review": "does the fire stick work with HBOGO? I went to the activation page on HBOGO to enter the code provided and there was not an option for fire stick just fire tv.", "verified": true, "helpfulness": "0/0", "author": "Lara Polster"}, {"rating": 3.0, "review": "I purchased this on sale for Prime members when first released.  I also own two Roku 3 players and two AppleTV players.  I cut the cord on cable, so anything I watch on TV is either DVD/Blu-ray or a streaming service (iTunes, Amazon Prime, Hulu+, Netflix, HBO Now, etc.).  This is a decent streaming stick, and is very much like and AppleTV.  If you're an Amazon Prime member, Prime video and music seem to stream faster than on the Roku 3.  Amazon Cloud Photos load fast as well.  You can access your Netflix accounts and Hulu+ on this, but like Apple, Amazon's FireStick is a semi-closed ecosystem.  You won't be able to access your iTunes library on this much like you wouldn't access your Amazon library on an AppleTV.  It's still a great product, I love that it comes with a remote or you can use an app on your phone to control it.  You can optionally purchase a voice-controlled remote from Amazon, which I haven't tried, but seems pretty cool.The FireStick has two problems with it that prevent me from using it more than maybe once a month: the interface and lack of UltraViolet support.  The interface is just a bit messy to me.  I'd take boring and streamlined compared to its current look.  The lack of support for UV (UltraViolet digital copies that often come with the purchase of a DVD or Blu-ray).  This is where services like Vudu, Flixster, CinemaNow, and M-Go excell; they let you access and purchase digital copies that can be used across devices.  The FireStick has no support for any of these services, so if you have a digital library outside of Amazon's, you have to switch streaming devices.  The Roku devices end up being clear winners when it comes to streaming devices (they support UltraViolet libraries, Amazon's prime libraries, and many more channels).  The benefit of Amazon's streaming service is that they have a lot of movie rentals not available anywhere else, however, you can access them with a Roku.  As a stand-alone device, it pretty good and super-fast.  But it's lack of features and support for other technologies prevent it from being a great device or even In the competition.", "verified": true, "helpfulness": "0/0", "author": "Morgan Newton \"Super-Dad\""}]