[{"rating": 5.0, "review": "This is great as it give me all the extras that I like.", "verified": true, "helpfulness": "0/0", "author": "Mark M."}, {"rating": 5.0, "review": "It works great.  Everything thing I expected.  Very easy to install and get started streaming.", "verified": true, "helpfulness": "0/0", "author": "Jerry P."}, {"rating": 5.0, "review": "Got it on the prime preorder discount for $20, have already gotten more than $20 use out of it. Love how i can use my kindle fire as a 2nd remote and use the voice search.", "verified": true, "helpfulness": "0/0", "author": "JZ"}, {"rating": 5.0, "review": "Quick and easy to install; easy to use.  I was watching the programs indicated, in no time.", "verified": true, "helpfulness": "0/0", "author": "J. Ray"}, {"rating": 5.0, "review": "Great, luv this item. Now time to cut the cord and sock it to the Cable behemoth!!!", "verified": true, "helpfulness": "0/0", "author": "Brent B."}, {"rating": 1.0, "review": "I've had this for nine months now and it's never worked properly.  Occasionally I can get the stick to work alone without the extender cable, but only if the TV is configured so it can fit without the extender cable. The cable itself came out of the box broken, which I didn't figure out until it was too late to return the thing as this was a gift.  It doesn't work at all - and I've now tried it on other people's Fire Sticks so I know that to be true.And can I figure out how to contact anyone to get a new cable?  Nope.  Glad I didn't waste too much money on this thing.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "i was disappointed that so many of the movies I want to see are still pay per view even with the stick...older movies like  Anger Management and Christmas Vacation to name 2 I wanted to see...", "verified": true, "helpfulness": "0/0", "author": "brooke16"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Mysura Reddy"}, {"rating": 5.0, "review": "Love it!!! Goodbye cable!", "verified": true, "helpfulness": "0/0", "author": "Michael Sutton"}, {"rating": 4.0, "review": "My Firestick worked fine when first installed (1 day) but now refuses to recognize my a Wifi network. All other devices on my network connect with no problem.Revised Review: after turning the Firestick on and off several times it now works as advertised.", "verified": true, "helpfulness": "1/2", "author": "Gil Few \"Gilbert E. Few\""}]