[{"rating": 3.0, "review": "Recommend reading the online instructions before operating the stick. Otherwise you may be surprised with unexpected charges.", "verified": true, "helpfulness": "0/0", "author": "Terry Roberts"}, {"rating": 5.0, "review": "Ivery had a Google Chromecast for about a year now... I liked it except I could not play videos from my Amazon Prime Account and I had to always use my phone as a remote... well, then this was released! Im really enjoying it! It was easy to set up, similar setup as the Chromecast.. My kids like the game features too. I do wish we could play videos from our Google play accounts. If there is a way I have not found it yet. The remoremote for this is somewhat small so make sure you put it up and not lose it!", "verified": true, "helpfulness": "0/0", "author": "Mal Green"}, {"rating": 5.0, "review": "So far I love this device.  Super fast and easy to use. I only had it for one week.", "verified": true, "helpfulness": "0/0", "author": "RHUCS"}, {"rating": 4.0, "review": "Love it... we didn't suffer from any set-up glitches, thank goodness, and haven't had any trouble with the stick finding our Wi-Fi. The interface is quite klutzy but it's not a deal breaker... would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Mayflyaway"}, {"rating": 5.0, "review": "Functioning very well so far for streaming and the introductory price is hard to beat.  Had to use an extension cord to get power to the stick given that the adapter and cord are on the short side for where my second TV is placed (high on a dresser unit).  Don't really have much of a comparison point given that I haven't tried the chromecast stick.  Seems just as fast as the streaming option on my LG HDTV.", "verified": true, "helpfulness": "0/0", "author": "Older Expert"}, {"rating": 1.0, "review": "Sorry, but this is a loser.  Specs looked interesting, but things load much slower, not faster, than Chromecast or Roku.  Constant freezeups in the same locations the other two systems streamed just fine. If they can fix it with firmware update, I'll give it another chance. If not, it's tossware.  I couldn't in good conscience sell this to someone else. It's $20 and a half-hour of testing I'll never get back.", "verified": true, "helpfulness": "0/0", "author": "Harry Miller"}, {"rating": 5.0, "review": "Great product and easy setup!", "verified": true, "helpfulness": "0/0", "author": "Juan G. Cruz"}, {"rating": 5.0, "review": "Love it!  I picked it up on the two day special for Prime members for $20.  I've been waiting to pick up something for streaming without paying a lot for it.  Cannot beat $20.  Like a few others I was slightly disappointed that the stick needs power, especially seeing I am planing on using this in my RV sometimes too.  But not a deal breaker, especially for what I paid.  I added a digital optical audio cable to connect the audio through my Bose (picked up that idea from searching YouTube how to videos) because I need more out of my audio than TV speakers.  The remote is a huge plus, especially for this price, even at the regular $40 it's well worth it and I recommend it.  Games and other apps are nice too.  Hoping to get Show Box on there somehow too.", "verified": true, "helpfulness": "0/0", "author": "J. Leonard"}, {"rating": 1.0, "review": "Very disappointed this is not as \"portable\" as they make it out to be.  Looking at the pictures in the general description it does not show a plug.  Thought I would be easily able to move this from one TV to the next but it must be plugged in at each TV.  Need to make it clear in the general description and pictures that this needs a power cord and is not powered by the TV!  Why have all the pictures without a cord unless you're trying to mislead people into thinking it's actually portable?", "verified": true, "helpfulness": "1/2", "author": "Beth"}, {"rating": 3.0, "review": "Unable to switch back to FIOS after using the fire stick. I have to turn off the entire system and turn back on after using the fire stick. Searching for movies is a little difficult. When I have found something to watch, it's been great. Great potential for a great product.", "verified": true, "helpfulness": "0/0", "author": "peach257"}]