[{"rating": 5.0, "review": "Got my new Fire TV Stick and it works great.  Netflix comes up faster on the stick than my DVD player that has an Ethernet connection.  All of the apps are easy to find and the menu system works well considering all the items you can search through.", "verified": true, "helpfulness": "0/0", "author": "lfh"}, {"rating": 4.0, "review": "Having a good time with it. I thought it would be more free movies", "verified": true, "helpfulness": "0/0", "author": "Rev Mike Carrow"}, {"rating": 2.0, "review": "having a difficult time with the stick skipping and pausing. got new internet and still has a habit of doing it. has limitations to the internet", "verified": true, "helpfulness": "0/0", "author": "Lisa L Owen"}, {"rating": 5.0, "review": "Wworks great!", "verified": true, "helpfulness": "0/0", "author": "michael alves"}, {"rating": 5.0, "review": "Works Great!!", "verified": true, "helpfulness": "0/0", "author": "Ronald Ames"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome! It does what it's suppose to... and loads really quick! Has alot of content on it! Love it!", "verified": true, "helpfulness": "0/0", "author": "Jessica R"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Thomas Lanoie"}, {"rating": 5.0, "review": "Awesome!!! Quick and easy and I would recommend this too everyone.", "verified": true, "helpfulness": "0/0", "author": "Janet Perez \"Jp\""}, {"rating": 5.0, "review": "I don't normally do reviews but on this I decided I should.  I have a Roku that I love.  After getting the Fire TV Stick, the Roku doesn't come close.  I love the fire stick! More apps and games.  Easy to navigate and quickly find everything I want. I will probably buy another one for my other TV. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Janet Bu \"Jbu35\""}, {"rating": 4.0, "review": "I have a great connection to the Internet and a very good router in my house (AC).  This unit has more jumpiness to to the picture than the built-in Netflix app on my Vizio TV and much less smooth than the 4 Apple TVs we have in the house.  It has great specs but it doesn't seem to be quite a good as the other devices I have.  I like the remote being Blue Tooth because it is in the bedroom and I like not having to point it anywhere or use it from under the covers.  I sometimes wish there was a reset on it because it does go hinky at times.  But I can unplug and re plug the power and it seems to reset ok.  If the video was better I think I'd love it.", "verified": true, "helpfulness": "0/0", "author": "M. Earl"}]