[{"rating": 1.0, "review": "Just bought one today.  Worked fine for a few a hours then crapped out over and over and over again watching netflix.  Thought it might be my IP provider (comcast) but netflix worked perfectly well on my computer.  Amazon probably working against netflix to catch up?  Does the same problem occur with Amazon prime??  maybe the software just sucks...Taking this piece of crap back to bestbuy tomorrow.", "verified": true, "helpfulness": "0/0", "author": "Rico Machismo"}, {"rating": 5.0, "review": "Very cool!!! When traveling in hotels on vacation or whatever it is so cool to be able to plug in the stick and have all your previously purchased Amazon movies available to watch. Prime members can get free shows or movies or you can purchase/rent new ones. Just need a wifi signal for it to work. No brainer. Buy it. We take it with us on vacation for the kids to watch movies on nights when we are not going out and for the Travel sports weekends we spend at various hotels.", "verified": true, "helpfulness": "0/0", "author": "Brian S."}, {"rating": 5.0, "review": "The fire stick is easy to use", "verified": true, "helpfulness": "0/0", "author": "Angel Bird"}, {"rating": 5.0, "review": "Got this today set up was easy and fast. I love the price well worth it. Its a little entertainment center.", "verified": true, "helpfulness": "0/0", "author": "leecharles"}, {"rating": 4.0, "review": "Love my amazon fire stick!", "verified": true, "helpfulness": "0/0", "author": "Cassandra Hoffner"}, {"rating": 5.0, "review": "I love it! My husband and I watch so many movies now and we can catch up on our shows, too.", "verified": true, "helpfulness": "0/0", "author": "Kristine \"Kristine Liwanag-Pereira\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "TIFFANY"}, {"rating": 5.0, "review": "Was able to set it up in about 3 minutes. Easy to use. Got pictures and video from phone synced up through cloud very easy.", "verified": true, "helpfulness": "0/0", "author": "Celin A"}, {"rating": 4.0, "review": "it really is that simple to setp. plug and play!", "verified": true, "helpfulness": "0/0", "author": "RSMITH1316"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Arturo Leon Jimenez"}]