[{"rating": 5.0, "review": "yes!", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 4.0, "review": "I needed to have a better Internet upgrade, otherwise the program kept buffering, making watching both much fun.", "verified": true, "helpfulness": "0/0", "author": "sallie"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "pinkberryjg"}, {"rating": 1.0, "review": "Well, I didn't \"hate it\" but it just didn't work with my TV...lots of internet comments about incompatibility with my particular model. That said, returned it for an easy and effortless refund from Amazon - 5 stars for customer service, even if the product didn't perform as stated.", "verified": true, "helpfulness": "0/0", "author": "Bob T"}, {"rating": 1.0, "review": "Okay, so I got this thing to watch Netflix on because I don't have a smart TV. I was able to watch one single movie half way thru. Now it just tells me it cant access the movie, try again later or another title. Well, absolutely nothing will play on it. I followed all of the directions, reset everything and it still gives me the same message. It has even been updated and still will play a movie. So, ZERO STARS. do not waste your money.", "verified": true, "helpfulness": "1/1", "author": "Antony G."}, {"rating": 2.0, "review": "Good platform, however I am experiencing similar problems as other buyers wirh wifi connections.  It doesn't matter how good your product is if it won't stay connected to yhe nerwork. Even though my connect status was very good it would still cut out.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "very satisfied, it's small and it doesn't take up a lot of space, yet the image is amazing.", "verified": true, "helpfulness": "0/0", "author": "Errol Bhagan"}, {"rating": 5.0, "review": "i love it but this signal from the remote to the device was weak.  we would have to press the button repeatedly to get it to respond.  eventually we placed a mirror angle behind the tv and device and it solved all of our problems with the remove to device communication.  amazon should work and solving this issue.  also the device uses up a small amount of bandwidth even when not in use so if your watching your internet usage make sure you turn it off or unplug when not in use!", "verified": true, "helpfulness": "0/0", "author": "Martin Bing"}, {"rating": 5.0, "review": "Awesome plus can sideload.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 4.0, "review": "I purchase the Fire TV Stick to \"cut the cable\", which has in whole been a success. It was a snap to install and the set up was simple, since I already had an Amazon Prime account and a Netflex account.You can subscribe to other perks as well if you would like. I truly watch most of my programs through HULU, Netflex and Amazon Prime.A few things I feel could be better is the wifi connection and speed. It seems to drop sometimes, which causes a pause in the movie but its nothing I would ditch the program for, because I'm saving money so a little inconvenience is okay for me. You?? Only you have the answer for that question. The other thing is it does take a bit of navigating to find the programs you would like to watch. I wish they had more \" add to my lists\" available. Allowing you to place movies and programs that are age friendly and FREE for the children to browse, And then my list or lists.Overall I like the system and I would purchase it again in a heart beat.", "verified": true, "helpfulness": "0/0", "author": "LeahSay's Views \"LeahSay\""}]