[{"rating": 5.0, "review": "This has been the best addition to our entertainment thus far. It is as easy to use and enjoy as advertised.", "verified": true, "helpfulness": "0/0", "author": "Regina"}, {"rating": 5.0, "review": "When coupled with our Amazon Prime membership, this product gave us access to a variety of shows at no extra cost that we have really enjoyed and to which we would otherwise never have had access. Great product!", "verified": false, "helpfulness": "0/0", "author": "Donna Fox \"best books collector\""}, {"rating": 5.0, "review": "Far better than the Chromecast.  Much quicker!!!!", "verified": true, "helpfulness": "0/0", "author": "Mystarmaker"}, {"rating": 5.0, "review": "I am so impressed with the selection of movies and shows that we can watch at anytime. My grandson loves it!", "verified": true, "helpfulness": "0/0", "author": "Ann T. Holden"}, {"rating": 5.0, "review": "love it.  use it all the time .  great with Prime.", "verified": true, "helpfulness": "0/0", "author": "DALW"}, {"rating": 5.0, "review": "The products made in the Amazon.My television has made a smart tv.Anytime, anywhere in the house you can see the video.The very good product.", "verified": true, "helpfulness": "0/0", "author": "Hiroki"}, {"rating": 4.0, "review": "Great to use for quiet time for the toddlers, Curious George is attention getter!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have had to unplug and replug this item several times to have it function properly.  Also, even though my internet connection is \"very good\" movies stop and will not restart until I unplug and replug the Fire Stick.  To say the least I am dissapointed.It would be a big help if Amazon provided a phone number for tech help.", "verified": true, "helpfulness": "0/0", "author": "M. Venuti"}, {"rating": 2.0, "review": "Being stuck with mostly paid viewing, cable isn't much better.", "verified": true, "helpfulness": "0/0", "author": "Barry P. Rummel \"I enjoy listening to Catholic and other religious books. I'm happy to see these books snowballing in available titles.\""}, {"rating": 5.0, "review": "pretty nice, I like it", "verified": true, "helpfulness": "0/0", "author": "JR Weger"}]