[{"rating": 5.0, "review": "Great, could not be happier", "verified": true, "helpfulness": "0/0", "author": "Becky Grafton"}, {"rating": 5.0, "review": "Love my amazon stick with remote Very nice quality !", "verified": true, "helpfulness": "0/0", "author": "Davonte Watkins"}, {"rating": 4.0, "review": "I LIKE IT", "verified": true, "helpfulness": "0/0", "author": "TREBOR"}, {"rating": 2.0, "review": "Because", "verified": false, "helpfulness": "0/1", "author": "Chad"}, {"rating": 3.0, "review": "Did not realize till after I purchased Amazon prime that the majority of the TV series  I want to see cost money. I can't find very many shows that there is not a fee associated with it. Netflix is much better. Disappointed I bought Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Kathie J. Lyman"}, {"rating": 5.0, "review": "We are really enjoying our Amazon Fire TV Stick!  We moved our Apple TV to our bedroom and put the Amazon Fire Stick in the living room.  It is very user friendly and the setup was very easy!", "verified": true, "helpfulness": "0/0", "author": "Jen \"Jen\""}, {"rating": 1.0, "review": "Purchased this device in March and have had nothing but problems with it.  I am now in the process of returning it and purchasing a Roku in its place.  I own 2 Roku's  for other tv's in my home, but wanted to give the fire stick a try. Don't waste your time or money! It's a horrible device!As for Amazon's customer service and return policies... Awesome!", "verified": true, "helpfulness": "0/0", "author": "shatori"}, {"rating": 1.0, "review": "Love the option and the Fire Stick itself. Only complaint is the remote has already stopped working. I have had this less than 2 weeks.Update: Fire Stick gave out too. Going to get my money back.", "verified": true, "helpfulness": "0/0", "author": "Desiree Z. Lightsey \"dezilou2\""}, {"rating": 5.0, "review": "Great as a replacement for cable. I was able to install Kodi easily. I recommend this to anyone looking to cancel cable.", "verified": true, "helpfulness": "0/0", "author": "Georg A Brodzky"}, {"rating": 1.0, "review": "Constantly losing connection makes the firestick useless. I'm wondering what the return policy is. All other devices work fine at the same location. I love Amazon but I hate firestick. Don't buy one until the antenna is improved!!", "verified": true, "helpfulness": "0/0", "author": "Julie Culverhouse"}]