[{"rating": 5.0, "review": "OMG! A must have for T.V. entertainment.  I was skeptical at first. The stick sounded to good to be true, but it's everything it's advertised to be. Simple easy assembly!  123 you're done! Wha la! I love listening to my music on the TV through PANDORA. So many of my old movies on Netflix are at my fingertip.  Im a Prime member so the firestick gives me a cess to 1, 000's of movies. I loved watching the old comedians. There is also a parental control icon if you need to monitor tv watching for V the kiddies.", "verified": true, "helpfulness": "0/0", "author": "Elaine"}, {"rating": 2.0, "review": "Doesn't stay connected to my internet. Keeps saying out of range even though it's right above the router. Also, The titles available are no better than Netflix.  Redbox has more up to date videos than those two services.  Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Cecelia R."}, {"rating": 5.0, "review": "Works better than I expected!", "verified": true, "helpfulness": "0/0", "author": "Loring E. Viands"}, {"rating": 4.0, "review": "Loving it to the fullest....", "verified": true, "helpfulness": "0/0", "author": "Tanja Walton"}, {"rating": 5.0, "review": "It great wished I boughtMore than one", "verified": true, "helpfulness": "0/0", "author": "S. C. Proctor"}, {"rating": 2.0, "review": "About to get the fire stick but want to know if ill be able You want to watch NASCAR or NFL", "verified": false, "helpfulness": "0/0", "author": "ladyredhead428"}, {"rating": 2.0, "review": "Just OK, nothing different from The Fire TV, I wish there were more apps on the Stick and the Fire TV that is on the Kindle. I feel cheated not having the other Amazon apps", "verified": true, "helpfulness": "0/0", "author": "Ursel Flippen \"Ursel F\""}, {"rating": 5.0, "review": "Great Product and easy setup.", "verified": true, "helpfulness": "0/0", "author": "Dennis Carver"}, {"rating": 2.0, "review": "Glitchy product that works okay in spells. My Roku works better and more consistently.", "verified": true, "helpfulness": "1/1", "author": "Andres Mars"}, {"rating": 1.0, "review": "Crashes a lot, on a strong internet connection. Very disappointed", "verified": true, "helpfulness": "1/2", "author": "josh wagoner"}]