[{"rating": 3.0, "review": "Cant stream things in your browser from your Computer to the TV. Chromecast for that. I need this capability for OD things.Plex just streams local content. And Side loading doesn't work well the firestick. This is a closed system. A gated gardenIf all you want to do is use the services they provide,  get this. I'm going to keep it because I got a prime membership, and can see myself using this once and  awhile. But I ordered Chromecast for what I really need want to do.", "verified": true, "helpfulness": "0/0", "author": "Auth"}, {"rating": 5.0, "review": "Awesome device we have one for all our tvs", "verified": true, "helpfulness": "0/0", "author": "Miranda M."}, {"rating": 5.0, "review": "4 stars, easy to use.  Good value!!!!", "verified": true, "helpfulness": "0/0", "author": "kathy Norsoph"}, {"rating": 5.0, "review": "So far we have purchased three Fire TV Sticks! We use them at our offices and they work wonderfully. I do hope some updates fix a few minor issues with some of the apps, but overall, we are very happy and excited about the purchases!Definitely recommend! Especially if you're a PRIME Member!!", "verified": true, "helpfulness": "0/0", "author": "Edward Gonzales"}, {"rating": 4.0, "review": "This was very easy to intall and set up as promised. It accesses a lot of content, including Amazon original content. The total entertainment value compared to the cost of this kit is well worth it. As a Prime member, I was a little disappointed to learn that not all content is free. The misunderstanding may be mine. Also, was disappointed to realize that if you do pay for a program you want to see, some of the programs give you a time limit in which to watch it. This is more restrictive. On the plus side, you do get to watch a \"Preview\" of all selections (there are a lot). Also, if you experience program interruptus, Amazon seems to remember where you left off. One thing that would make the experience better is having a way to organize you \"Watch List\" into categories. We're not using the Fire TV Stick as frequently as we thought we would, but it's at our fingertips if we want something more than syndicated reruns.(PSSST...Amazon, when are you going to bring us another season of Alpha House?!?)", "verified": true, "helpfulness": "0/0", "author": "Kathryn \"Ms Frugal\""}, {"rating": 5.0, "review": "Love this. Great for the kids and movie nights. Worth every penny, plan on taking on road trips and sleepovers", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Problema", "verified": true, "helpfulness": "0/0", "author": "ap"}, {"rating": 5.0, "review": "I have an Apple TV, a Roku and now the Fire Stick.  With my Amazon Prime membership, the Fire Stick is the best of the three for my Amazon stuff but my Apple TV provide me more capability to my iTunes account and home network computers.  Still, they complement each other and I would not want to give up either one.", "verified": true, "helpfulness": "0/0", "author": "jfield1"}, {"rating": 3.0, "review": "Remote doesn't work well enough", "verified": true, "helpfulness": "0/0", "author": "Adrienne roberts"}, {"rating": 3.0, "review": "Nice, but video tends to stutter. I've tried many things, but the stuttering doesn't go away.", "verified": true, "helpfulness": "0/0", "author": "The Reviewer"}]