[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "bobby"}, {"rating": 2.0, "review": "I  purchased the fire stick on sale for $19.99 and was in love with it until my internet  provider called and said my data was all used. Is there anything I can do so, It does not use so much data quickly?", "verified": true, "helpfulness": "0/1", "author": "Belinda"}, {"rating": 1.0, "review": "4 stars for style ease of use. Negative stars for not having away of storing / removing unwanted factory apps. Theres a lot of apps but me 'm simply and detest having always navigate what to me is junk.......", "verified": true, "helpfulness": "0/1", "author": "R. J. Rodriguez"}, {"rating": 5.0, "review": "Awesome stick", "verified": true, "helpfulness": "0/0", "author": "Jesus R Zamora"}, {"rating": 5.0, "review": "Super easy to set up! Had absolutely no problems what so ever! Access in less than 5 minutes!Great content and available apps! I am enjoying watching all my prime videos!! Cancelled cable!The best part is the android remote app! Can use talk to search and all other controls as well!Really a great addition to my home system! Probably will buy​ another so I don't have to take this one to another room!", "verified": true, "helpfulness": "1/1", "author": "The Ardent Reader \"L4JA\""}, {"rating": 5.0, "review": "LOVE LOVE LOVE this!!! Works awesome :D pretty easy to set up and a nice video to explain what you can do with the remote. I use this on a daily basis just about every night!", "verified": true, "helpfulness": "0/0", "author": "El \"lab\""}, {"rating": 5.0, "review": "I had originally had a roku so had to get used to the menu of the FireStick... but I think I'm going to get another one for my other TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love using it, it is literally my cable especially using slingtv", "verified": true, "helpfulness": "0/0", "author": "Danielle Pereyra \"DGR4CE\""}, {"rating": 3.0, "review": "Great product but needs some work on app that I owm.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "My entire family loves this product. Worth much more than it costs. Easy to install, set up and use! Lightening fast with everything we've used it for so far.", "verified": true, "helpfulness": "0/0", "author": "Danielle Geraci"}]