[{"rating": 5.0, "review": "It's perfect to just view movies and tv right on my television.", "verified": true, "helpfulness": "0/0", "author": "Brian McBeth"}, {"rating": 5.0, "review": "It covers my expectatives about tv with internet", "verified": true, "helpfulness": "0/0", "author": "Jorge S."}, {"rating": 5.0, "review": "Love it! Can easily watch what I want or play games. It has lots of capabilities that I haven't even tried yet. Planning to take it on vacation, so the kids will have endless things to watch without lugging discs or all of their devices.", "verified": true, "helpfulness": "0/0", "author": "SC Dad"}, {"rating": 4.0, "review": "Best streaming media stick on the market but lacks everything to replace streaming blu-ray player. Excellent speed, size, and best quality.  There is NO Disney movie anywhere app for Disney/ Marvel content and there is NO VUDU access to purchased digital copy's in Ultraviolet library. Flixster app falls far short for viewing and streaming via UV library; poor quality, app design, and doesn't allow for Disney library items to be accessed.", "verified": true, "helpfulness": "1/1", "author": "Nancy Klimper"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Wanda Shelton"}, {"rating": 5.0, "review": "Excelent, more than expected. Its better than an apple tv", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 4.0, "review": "Great device but I couldn't get kodi icon on the home screen", "verified": true, "helpfulness": "0/0", "author": "Dan Jordan \"dan\""}, {"rating": 5.0, "review": "Unbelievably easy to use.  I was a little concerned because our WIFI is a good 30 feet away and beaming through 3 walls and a bathroom.  Plugged the Stick into an HDMI slot, plugged in the power adaptor.  Turned on the TV and selected that HDMI input slot and \"we were on Fire (stick that is).Watch the tutorial video...maybe 5 minutes of your life...Navigate around.  Search a favorite show (we are Masterpiece Mystery-aholics).  Searched \"Grantchester\" and settled in to watch.  Whole process Box to show less than 30 minutes.If I had to gripe about anything it is the way Amazon lists a series.  For example, Grantchester episode 1 is really the series preview.  Episode 2 is the REAL episode 1.  Annoying, critiqued it on a feedback, but once you break the code it's no big deal.Now to go buy Amazon stock-these folks have their act together!", "verified": true, "helpfulness": "0/0", "author": "R. B. Thompson"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Oleadys"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "David A Webster"}]