[{"rating": 5.0, "review": "extremely easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Our fire stick worked well for about a week.  Now it crashes constantly and can't seem to stay connected to the wifi. The remote is cool looking and compact but hard to use in the dark because it's practically invisible.  Back to our old Roku we go!", "verified": false, "helpfulness": "1/1", "author": "Fuji"}, {"rating": 1.0, "review": "If this product worked i would buy one for every TV in my house.  But it simply just does not work.  Dropping wifi every 20 minutes and requiring a reboot to get wifi connection back is <> working.", "verified": true, "helpfulness": "1/1", "author": "Thomas Dutton"}, {"rating": 5.0, "review": "Super easy to set up. And works great!", "verified": true, "helpfulness": "0/0", "author": "S. Mikkelsen"}, {"rating": 4.0, "review": "Like it, but there's frequent connection issues. I assume it needs a firmware update. Hopefully this will be coming soon from Amazon.", "verified": true, "helpfulness": "0/0", "author": "CHARLES M HAYS"}, {"rating": 5.0, "review": "I love the Fire Stick.  We  use it at home in the living rooms and it's super zippy compared to the Roku. Since it's so portable we're able to take it into my son's room where we places a small tv and can use it there as well.  When we go to grandmas we also take it.  I'm thinking of buying one for there house now but it's so small it's super easy to transport back and forth.", "verified": true, "helpfulness": "0/0", "author": "JassoFamily \"Damon Jasso\""}, {"rating": 5.0, "review": "I have the full size Fire TV and was excited to see the Stick released and of course the price.Compared to the Fire TV it does almost everything, of course the Fire TV is faster and the remote with that includes voice commands (need to use the App or buy the upgraded remote on the Stick)  Otherwise its a great device.In addition to the Fire TV and Stick I also have a Chromecast, older Roku, Roku 3 (latest) and I use internet TV (and antenna) exclusively.  The Fire TV and Stick are my go to devices, effectively retiring the Chromecast and Roku.Why?  Well I am a big Prime user, so that is huge, but I also use Hulu and Netflix, but in the end, the Fire TV devices are just easier to use.  The lack of remote on the Chromecast is frustrating and I am a huge smartphone user and it still feels unnatural and annoying.  As for the Roku, the interface is dated and the apps seem isolated compared to the integration in the Fire TV.For the price you can't beat the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "Much faster than the Netflix/Amazon Prime apps that come with smart TVs and DVD players.  There are a few bugs, but overall I love this thing.  It's much better for members who have Amazon Prime (Maybe this should be called the Prime TV Stick). The image tiles load almost instantly, and there is no lag as you're navigating around.  Content loads significantly faster than native smart TV apps!Note: To get the FULL advantage of the Fire TV Stick, make sure you're using a 5 Ghz wireless connection. You'll get sharp HD this way.  If your router only supports 2.4Ghz connections you won't be enjoying a good HD experience and you'll notice occasional skips and glitches in the audio. You'll probably also notice a lot of buffering with the Netflix App.", "verified": true, "helpfulness": "0/0", "author": "OAO \"MR GPS\""}, {"rating": 3.0, "review": "It's just ok. I have to reboot it often to get it to work, and the screen freezes frequently.", "verified": true, "helpfulness": "0/0", "author": "Virginia \"Alabama Born and Bred\""}, {"rating": 5.0, "review": "Very happy with this. I replaced my older Roku and don't regret it one bit. It is easy to use and has a great picture on my 1080p TV. I like not having to point the remote directly at the device too.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]