[{"rating": 4.0, "review": "Just got my fire stick today. It was easy to set up and already like the fact I have many apps and movie selections on my tv.", "verified": true, "helpfulness": "1/1", "author": "Hector Rodriguez"}, {"rating": 5.0, "review": "It is great to use...lots of different items to see and do...love it", "verified": true, "helpfulness": "1/1", "author": "jenni o"}, {"rating": 3.0, "review": "This worked pretty well, and was amazing for the size.  But so is Google Chromecast and Roku.  I'm already using Roku devices everywhere, and in my opinion they offer more, so I stuck with Roku.  But, I'm still glad I got the Fire TV stick, because its a good travel companion.  I'll take this on the road to use in hotel rooms.  It will be a bake-off between Firestick and Google Chromecast.  The Firestick might come out ahead by including a remote.  But the Chromecast browser plugin ability to stream the whole browser is pretty great too.  It's tough to pick the best one.  If you already have Prime, you might like it.", "verified": true, "helpfulness": "1/1", "author": "Brian C."}, {"rating": 5.0, "review": "Very good I will be buying more. Easiest way to have a smart tv.", "verified": true, "helpfulness": "1/1", "author": "Brobooger \"Brobooger\""}, {"rating": 5.0, "review": "Works great save me lots of money", "verified": false, "helpfulness": "0/0", "author": "Ali Saboor"}, {"rating": 5.0, "review": "So easy to use!  Love it!  The only part that was difficult was getting the back cover off to put in the batteries .. took a LOT of finger force.", "verified": true, "helpfulness": "0/0", "author": "susan steege"}, {"rating": 5.0, "review": "I love this Five TV Stick", "verified": true, "helpfulness": "1/1", "author": "T. Vo \"tvo\""}, {"rating": 4.0, "review": "Easy to set up, I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Ro"}, {"rating": 2.0, "review": "The feature are quite nice for the price, especially since I got it for the introductory price when it was $19. It worked fairly well when I got it but that didn't last long. At first button presses would move in a direction long after I let go. So I couldn't tell if that was a problem with the remote or the device. Recently, it has a problem either keeping connection or has to buffer often. Other times, the picture is grainy.Before anyone asks if it could be my internet connection, it isn't. Right at this moment while watching Netflix, I was annoyed by the buffering and freezing, I turned it off and switched to my Xbox 360 and the same show is playing fine. I also have another TV that is a smart TV along with an Xbox One and all play/work great. The same is true of my computer and phone running off the same Wi-Fi connection.I can't be too upset since I didn't pay much and when it works occasionally, it's nice and I like the Prime music app on there. However, even for the fairly low price of $39, if it has the same issues as mine, I couldn't recommend it.", "verified": true, "helpfulness": "0/0", "author": "coasterlove"}, {"rating": 4.0, "review": "Easy to use and set up. If I can set it up anyone can! I like the parental control that it has on it so that my daughter doesn't \"accidentally\" pay for something without me knowing. I got this to replace cable. So far so good. We like it.", "verified": true, "helpfulness": "0/0", "author": "Valerie"}]