[{"rating": 3.0, "review": "Good start. Needs memory (rom) upgrade, but is still tolerable.", "verified": true, "helpfulness": "0/0", "author": "Robert Maxwell"}, {"rating": 2.0, "review": "i love the way it looks, I wish I could say that about the way it works. My roku xsd streams faster than this. My comcast gateway wifi doesn't seem to suit this stick. The signal strength is good, but it will buffer for a long time and finally show the network error message. I called Comcast, but they say they can't do anything if one of the devices doesn't stream. With 25mbps download speed, I can't use this device. During the brief period that it worked, I loved the interface, apps etc. the iPhone app has a keyboard and it can also play directly from the iPhone YouTube app. There was no lag while playing from iPhone. I am not a techie, and there is only so much I could troubleshoot. I am quite disappointed that this nice stick didn't work for me. I would say, give it a try. If your wifi can work with this stick, it is an awesome deal.", "verified": true, "helpfulness": "0/0", "author": "ksun"}, {"rating": 3.0, "review": "Unfortunately  for us, we've  gone through two of these now.We're  frustrated and done with this product.We've  spent hours on the phone with very nice people to try to get this product to work.HOWEVER, it will great for a few weeks, then, it freezes.  Then it fast forwards.In my opinion a serious software glitch.WHen paying $5.99 for a top rated movie, that stalls, freezes, then fast forwards like a cartoon, there is a software problem.I will be returning this fire stick too. SAME ISSUES AS OUR first one.With that said and done...The people who work at Amazon, are awesome in my book.", "verified": true, "helpfulness": "0/0", "author": "Diane L. Nusser"}, {"rating": 4.0, "review": "Works great.  Easy to set up and use.  Still exploring it's capabilities.", "verified": true, "helpfulness": "0/0", "author": "M E Palmer"}, {"rating": 5.0, "review": "Nice little unit", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 2.0, "review": "Bought this product solely for MLB.tv app purposes. Unfortunately for me, this product sucks (or at least this app's compatibility sucks.) Constant lag, missing connection, etc.. I cannot stream 10 seconds of smooth mlb action. Netflix was fineish, but the MLB app is unusable. Tried my computer to see if it was my internet, and my computer was about 14 times better than the fire stick. Do not buy it for MLB.tv. This review does not even come close to justice for my disappointment with this product.I am giving 2stars for Netflix, number of apps, and cost.ps-interface isn't good-needs its own power supply-controller looks like it might break any second.it was a modest $40, but come on amazon. don't put a product out prematurely", "verified": true, "helpfulness": "0/0", "author": "Milo Johnson"}, {"rating": 5.0, "review": "Easy set up. The rest is just awesome.", "verified": true, "helpfulness": "0/0", "author": "Micah R. Pelfrey"}, {"rating": 5.0, "review": "Very small. I would love it more if it could design the power inside. The power adapter is almost the same size as the stick.", "verified": true, "helpfulness": "0/0", "author": "JoeKim"}, {"rating": 5.0, "review": "Simple to hook-up, and operate.", "verified": true, "helpfulness": "0/0", "author": "L. Trzepkowski"}, {"rating": 1.0, "review": "Very unhappy doesn't work and Amazon will not take it back and send a new one. The Fire TV customer service even said it doesn't work in all HDMI ports. Right out of the box it took 30 mins to fuss and get it to work. When you do get something to play like Sling TV get interested in a show it just goes black. It is not my internet as tablet and laptop are fine. My HDMI ports work fine with DVD players. I got it free with 3 months prepaid for Sling TV but it is money lost as I cannot use Sling without the fire tv stick working. Was going to get Roku but this value seemed better, not so. 1 year warranty I have had just 36 hours and they will only switch out one part at a time. I said well at least I have Prime ship it fast. Was told it will be faster, ha 5 days then if that part doesn't work start all over hours on phone then 5 more days. Cannot recommended this.", "verified": true, "helpfulness": "0/0", "author": "kindred spirit"}]