[{"rating": 5.0, "review": "Incredibly useful for non-cable/dish people like myself that still likes to curl up on the couch with the SO and watch things.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device easy set up... What more do you need?", "verified": true, "helpfulness": "0/0", "author": "Jason cramer"}, {"rating": 5.0, "review": "So many options that i am still discovering them. (smile)", "verified": true, "helpfulness": "0/0", "author": "robert b hughes, jr"}, {"rating": 5.0, "review": "I like it but it requires a Prime subscription which is cheaper than Netflix and many more benefits. I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "G. Ruppert \"mom of 2 angels\""}, {"rating": 1.0, "review": "It took forever to set up. I plugged it into a wall socket using the adapter provided and I kept getting a message saying the power supply was insuffucient and to plug into a wall socket using the provided adaptor???  I hooked up a volt meter to the outlet and I had 120V. Not sure what the problem was but I was finally able to get to the setup screen. I entered the correct password for the wifi and it kept saying it could not connect to the network. No other devices have problems connecting to the wifi in that room which is directly below the room where the router is located. When it finally connected it would not accept my amazon account information.  I logged into amazon on another device to ensure I was using the correct log in. After about 15 tries I contacted amazon support.  They first told me that since my amazon password had a special character and number in it that the stick wouldn't recognize it. I argued that point with them and they finally admitted that didn't make sense.  They had me reset my password, to one that still had a special character  and number, still wouldn't accept it. They entered the device serial number directly to my account as an approved device, still didn't work.  While on hold I reset the power 2 times (this step was not suggested by the tech support) before it finally logged onto my account. Once it was connected I tried to use amazon prime and netflix, both have to buffer constantly. No other devices have that problem in that room. I left it alone for a couple days and tried to use it again, it was disconnected from the network again. None of my other devices randomly disconnect from the network. Reset power again and had to renter network password. Worked ok for a while then started buffering again.", "verified": true, "helpfulness": "1/1", "author": "Valerie Collopy"}, {"rating": 3.0, "review": "when it works it great, when is doesn't its crap", "verified": true, "helpfulness": "0/0", "author": "Thomas Barker"}, {"rating": 5.0, "review": "Great replacement for satellite pay TV", "verified": true, "helpfulness": "0/0", "author": "Leonard R Hansen"}, {"rating": 5.0, "review": "Worked exactly as expected.  No Complaints and I would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "MIchael Ochoa"}, {"rating": 4.0, "review": "My husband and I love our fire tv stick.  Setup was quick and easy, simply plug in and a video introduces you to the Amazon fire tv.  Navigation is easy.  You don't have to worry about turning it on and off, it simply goes dormant after a period of not using.  They have a large library of programs and apps, I wish there was a few more but I'm sure there will be more in the future!", "verified": true, "helpfulness": "0/0", "author": "Hailey Oliver"}, {"rating": 5.0, "review": "Works great! No problems with loading ever!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}]