[{"rating": 1.0, "review": "Honestly, I love the Fire TV stick when it works.But therein lies the problem. This stick has HORRIBLE WiFi reception. You will not get good use out of this stick unless you have it in the same room as your router. At my home, that renders this product almost useless.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Love my new Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Barbara White"}, {"rating": 3.0, "review": "I really wanted this devices to work for me add to my collection of media streaming devices, but quite a few setbacks.  I own a Chromecast, Roku LT, and soon to get an AppleTV, and because of my kids attention span and my busy schedule, we stream across all devices often splitting movies and TV into 2-3 viewing sessions.  Besides the media streamers, we watch through gaming consoles, PC's, Mac's, Apple phones and tablets, and our most used services are HBO-GO, Netflix, Watch ABC, FOX Now, and our DVDs via Plex.  Unfortunately, the Fire TV Stick is not quite ready for primetime.  On a positive note the device has a nice user interface, and the voice search, when it works, is convenient.  However, for one, after trying several times, can't get YouTube to pair efficiently with my iPhone 6+.  It seems to connect, but then won't search through phone, and won't cast.  Secondly, Amazon's HBO-GO app does not have my cable company as one of my providers (which is probably the cable company's fault), but it's now the only device that won't authenticate my HBO access.  Sometimes Netflix won't play videos, so although the hardware is strong, the firmware still has bugs for me.  Perhaps I will repurchase at a later date.", "verified": true, "helpfulness": "0/0", "author": "Paul S. Rojo"}, {"rating": 2.0, "review": "Not loving it. We have a high grade router and wifi set up and my smart tv in the bedroom does fine. Using this on the non-smart tv in the living room and it takes 10 min to start up properly and then buffers constantly. Add to that, I finally figured out that this thing is what has been making my entire system slow down to a crawl. Unplugged it and my pc acted like new again. Going in the trash. Don't have the patience for it. Will go back to Roku.", "verified": true, "helpfulness": "0/0", "author": "Grace"}, {"rating": 2.0, "review": "Worked great for a few months then went blank. Can't seem to reboot or reinstall. Changed batteries, unplugged and replugged but did not help. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Bob S"}, {"rating": 1.0, "review": "It would not work at the Hilton where I stayed.  No information available on how to make it work.  This sentence in the product information is not true:  \"Connect to your hotel or dorm room Wi-Fi with captive portal support—Take your favorite movies, TV shows, games, and more with you when you’re away from home. Fire TV Stick enables you to connect to Wi-Fi that requires web authentication—this includes Wi-Fi at most major hotels, as well as some universities.\"", "verified": true, "helpfulness": "0/1", "author": "Douglas R. Ross"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Douglas M Berger"}, {"rating": 5.0, "review": "Perfect! Exactly what I needed. The Fire TV app works flawlessly with the Fire TV stick too. In my opinion you don't need a smart tv when you can get this very cheap.", "verified": true, "helpfulness": "0/0", "author": "Felixo"}, {"rating": 4.0, "review": "Used a few times so far.  Meets all expectations so far.", "verified": true, "helpfulness": "0/0", "author": "Heather E Doerr"}, {"rating": 1.0, "review": "I didn't realize it was just a slippery gimmick to try and get more and more of my money! You advertise it as though you can watch all this entertainment with just the cost of the firestick. WHAT A FRAUD!!!! Ron Moore", "verified": true, "helpfulness": "1/2", "author": "Ronald Robert Moore"}]