[{"rating": 4.0, "review": "We're very pleased with the Fire TV stick and Amazon's library of content. We're considering purchasing another one for our living room TV.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 5.0, "review": "Awesome gift to a non tech person", "verified": true, "helpfulness": "0/1", "author": "Lu topher Lu"}, {"rating": 4.0, "review": "I would have given this product a 5-star review, but there was a problem that I have been encountering. First, the connection continuously drops and, in turn causes you to not be able to use it.", "verified": true, "helpfulness": "0/1", "author": "jared"}, {"rating": 5.0, "review": "This is great for any TV that doesn't have wifi connections to movie sources.  We use Fire sticks in guest bedrooms that do not have cable hooked up.", "verified": true, "helpfulness": "0/1", "author": "Jerra Dooley \"jerradoo\""}, {"rating": 5.0, "review": "much easier for my aunt to use than the chromecast, now i don't have to leave my phone in the front room when she wants to watch Netflix", "verified": true, "helpfulness": "0/1", "author": "Christina"}, {"rating": 5.0, "review": "Love the portable device. Just had to plug the stick into the port on my T.V. and Amazon did the rest; already had my account info. Perfect for my camper trailer.", "verified": true, "helpfulness": "0/1", "author": "Linda"}, {"rating": 5.0, "review": "The differences between Time Warner internet speeds are negligible. So I hooked up my Fire with a 50 ft. HDMI extension placing the Fire at the far end from the TV and closer, 15 ft. to the router. ROKU LT does not even perform as well at 15 ft. with my other TV. In short, FIRE IS A LOT FASTER!", "verified": true, "helpfulness": "0/1", "author": "FRANK JASKO"}, {"rating": 5.0, "review": "It works just great, if your internet is fast. If the internet is slow, it doesn't work. But we enjoy it.", "verified": true, "helpfulness": "0/1", "author": "Tom D."}, {"rating": 4.0, "review": "Great little streaming device!  The only downside would be that it can't connect to network/DFS/NTFS shares to watch media from a computer or mediacenter.", "verified": true, "helpfulness": "0/1", "author": "Mike Young"}, {"rating": 4.0, "review": "Good product at a good price.", "verified": true, "helpfulness": "0/1", "author": "Charles Maurice"}]