[{"rating": 5.0, "review": "Made a huge difference. We stream movies etc and this really fixed things in a good way.", "verified": true, "helpfulness": "0/1", "author": "Bella"}, {"rating": 5.0, "review": "User friendly, easy set up, effective parental controls. Love the app so I can control it with my phone when the remote is lost or I want to mess with the kids :)", "verified": true, "helpfulness": "0/1", "author": "8of8"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick. Pretty straightforward, and a great plus for Amazon Prime users.", "verified": true, "helpfulness": "0/1", "author": "Fred J."}, {"rating": 5.0, "review": "Cool little gadget. I like the portability offer.", "verified": true, "helpfulness": "0/1", "author": "Freddy S."}, {"rating": 5.0, "review": "The Fire TV Stick has been a welcome edition to our house.  I am an Apple person so I wasn't sure how much I'd like this compared to Apple TV.  When Amazon offered this for $15 off I decided to try it.  Love it!  I plan to order another one for travel.  Actually, that is the reason I wanted it originally, but hubby likes it too much to remove it from the family room 😀.  Compared to Apple TV, it costs a lot less and does everything I need.  Easy install.", "verified": true, "helpfulness": "0/1", "author": "Deedee"}, {"rating": 5.0, "review": "I love this product!  User friendly,  so happy I purchased.", "verified": true, "helpfulness": "0/1", "author": "Tracy Miller"}, {"rating": 3.0, "review": "On the whole I would recommend purchasing this device, the interface is easy to setup and use, the streaming is a decent quality.There is an issue where a load popping noise occurs  (like a static discharge or something). Other users have suggested removing the power supply that plugs into the wall and instead use the USB connection directly on the TV.  This is at odds with the recommended instructions that comes with the product, but does significantly reduce the occurrence of the popping.", "verified": true, "helpfulness": "0/1", "author": "Jim"}, {"rating": 4.0, "review": "Works great.  My daughter loves it.  Get yourself a 3-6ft HDMI extender though.  The unit is susceptible to wi-fi connection problems depending on the orientation of your TV to your wireless router.", "verified": true, "helpfulness": "0/1", "author": "Mike Roell"}, {"rating": 5.0, "review": "better than the roku I had..", "verified": true, "helpfulness": "0/1", "author": "richard turel"}, {"rating": 5.0, "review": "Works exactly as advertised.  Great little device.", "verified": true, "helpfulness": "0/1", "author": "kaibabsquirrel"}]