[{"rating": 3.0, "review": "I'm disappointed with this device. I bought two of them when they became available to Prime customers at a big discount. I kept one and gave one to my son at college. I do love the ability to connect my Amazon music into my home theatre and seeing the lyrics on screen for some songs made the Christmas season more fun for the family. However not all features work as designed. For example, the voice recognition in the Android app is not very good. I work with Nuance voice recognition products in my job, so I'm very familiar with how the voice reco should work. Bottom line, it just doesn't work as well as it should. Voice recognition is spotty at best. Plus, connecting the Fire Stick to your tablet or phone to control You Tube is extremely kludgey. There is a consistent disconnect between what is on your device and what your TV recognizes via the Fire Stick. The device almost always loses sync with the TV and you can't control what you're seeing on TV like you should be able to do. This is unfortunate because  I love Amazon and I am a committed customer, but I'm just not convinced that this device is their best offering. I also own a Chromecast and a Roku, so I'm very familiar with how these things should work. The Chromecast is still the better product and is easier to use. Sorry, but I would not recommend another purchase of this generation of Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Like it a lot.  Super easy to set up and to operate, and performance and picture are great.  Only thing is, the stick has a power cable which is not shown in any of the advertising.  You have to plug this thing into an outlet.  Think Amazon is being slightly disingenuous by not featuring this in any pictures or tv adverts.", "verified": true, "helpfulness": "0/0", "author": "Objective Reviewer"}, {"rating": 1.0, "review": "I liked the Fire Stick while it was working.  Two days after the initial use, it stopped working.  The unit would not turn on due to a bad power supply.  I had to return it to Best Buy for a full refund.", "verified": true, "helpfulness": "0/0", "author": "Lost Jedi"}, {"rating": 5.0, "review": "Great interface, easy to use and set up.  I like it more than my chrome cast", "verified": true, "helpfulness": "0/0", "author": "darrell fullmer"}, {"rating": 5.0, "review": "It's working just as expected", "verified": true, "helpfulness": "0/0", "author": "Shellie Ripple"}, {"rating": 2.0, "review": "Amazon Fire TV Stick is a great idea, but I have seen performance issues right from the start.  I’m very tech savvy and I have other similar products to do side by side real time comparisons.  I have compared this to my Panasonic streaming media player and watching videos on my computer.In every case my experience with Amazon Fire TV was poor to fair.  Setup crashed my router multiple times.  I never determined why, but each time I entered the router password and selected to continue all other devices connected to the router lost internet connection.  I am a professional computer network engineer.  I have multiple wireless routers.  Only the router I connected to the fire stick was effected and only for a few minutes just after I attempted to register and failed.  Then my router would reset and work properly with no further efforts.It took more than 10 attempts and 4 hours using the same procedure and password to get it set up for the first time.  I would guess 20+, but after 10+ I stopped counting.  Mostly it failed to connect to the network, but it also failed at parental controls and the home page a couple of times during setup.  Then there is no way to bypass the first use video.  It is not a bad video, but after 4 hours it seems like my time has been stolen.Overall, the time I wasted learning that this is a challenge to use cost me many times the price of the device.  If it worked, I could travel with this and not bring a computer or HDMI cable, but since it is so unreliable and hard to set up, it is likely to end up on a shelf then in the trash.  It is a shame, the idea is great.", "verified": true, "helpfulness": "1/1", "author": "NA"}, {"rating": 5.0, "review": "We already had a Fire TV which we liked.  This was a great choice for the TV in the master bedroom where we just wanted the ability to watch streaming content.", "verified": true, "helpfulness": "0/0", "author": "K. Crabbs"}, {"rating": 2.0, "review": "Slow performance. Buy  the Fire TV box  instead of this and you will be much happier", "verified": false, "helpfulness": "0/0", "author": "John Bartos"}, {"rating": 4.0, "review": "Love it.  I think they have some bugs to work out.  I have to keep finding my WiFi.", "verified": true, "helpfulness": "0/0", "author": "C. Bailey"}, {"rating": 5.0, "review": "I have been really thrilled with the Fire Stick. I know some of the other reviews had issues with dropped connections, etc. I have had it almost 3 weeks and have only had one drop and a few slowdowns. I blame that mostly on my internet provider. (My iPhone 6 loses it's wifi connection at least 2 or 3 times a week, so these are the trials of technology, I think.) Anyway, I already have prime (love!) and since I don't have cable, it is absolutely the easies way to watch stuff on my real TV instead of my laptop. Former roommate had an Apple TV and this is as easy to use but half the price.", "verified": true, "helpfulness": "0/0", "author": "Merridee"}]