[{"rating": 5.0, "review": "Very satisfied.  Syncs great with Kindle.  Well worth the price for the device and Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "peggy bluemer"}, {"rating": 4.0, "review": "This little thing is great! I finally have amazon prime TV and Netflix on the same device! The connection is always good (Internet depending of course) and it's pretty simple to navigate. It does plug in via HDMI and yes it does have a mini USB power cord port off the side of it that you need to use in order for it to work.  Amazon seems to still be leaving that part out of their commercials and advertising.So dumb me, just plugged the thing into the HDMI port and was wondering why it wouldn't work. Then I dug into the box more and found the plug and power cord (complete palm to forehead moment). Other than that snafu (which was mostly my fault) it has worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Loyal Amazonion"}, {"rating": 4.0, "review": "I like this thing but, after owning it for a month and three days, the left directional button is starting to rub on the controller, making me worry that further degradation will lead to a stuck button.", "verified": true, "helpfulness": "0/0", "author": "Burdenofhope"}, {"rating": 5.0, "review": "Easy to use and fun. Had a problem with connection, initially, with my Sony Bravia. Simply, unplug tv, the HDMI cables connected-and start over. Solved the problem. Love it!", "verified": true, "helpfulness": "1/1", "author": "Mary Muehlbauer"}, {"rating": 5.0, "review": "OK, this is pretty cool.  I snagged it when Amazon had it on sale for just $19 and it is so worth it.  I have Amazon Prime, so the amount of offerings you can get for free is staggering.  Set up was beyond simple, and we started using it immediately.  Well, well worth the cost.  Also download the free Fire TV Stick remote for your Android phone.  It's awesome and allows you to use Voice Command, which is pretty cool.", "verified": true, "helpfulness": "1/1", "author": "John F.D. Taff \"John\""}, {"rating": 2.0, "review": "The amazon fire TV stick will not work with 5Ghz DFS wifi channels. This is the same with Roku 3. I'm seeing worse performance on my wifi network simply because the commonly used DFS channels aren't supported.", "verified": true, "helpfulness": "1/1", "author": "Ryan Egan"}, {"rating": 4.0, "review": "Except for losing the WIFI pass code every couple of days this is a great addition to our home entertainment system and it was a very good buy.", "verified": true, "helpfulness": "0/0", "author": "James M. Corwin"}, {"rating": 5.0, "review": "This stick is even faster than I expected it to be. It came pre-registered to my Amazon account, so set up was silly simple!", "verified": true, "helpfulness": "0/0", "author": "M. Rosenberg"}, {"rating": 5.0, "review": "So far so good. I love Amazon Prime Instant Movies and that this can support some games too. This is a must have for Amazon Prime members as it allows us to fully take advantage of the products offered in the Prime package. I got mine on the special $19 pricing back in Oct-Nov. Still, at full price, it's a good deal.", "verified": true, "helpfulness": "1/1", "author": "J. D. Martin"}, {"rating": 3.0, "review": "Needs chromecast added with it, then it would be great.", "verified": true, "helpfulness": "0/0", "author": "christopher s childress"}]