[{"rating": 3.0, "review": "I like this a lot, i just wish it worked all the time.  Constant need to restart due to screen lock ups, cursor movement/selection for no reason, connectivity issues.  I'll probably return it to get a new one, as this first one is super buggy.  Also to anyone who like to use it for Twitch.tv, dont.  Twitch and Netflix apps interact and make the FireTV go nuts.  Picture quality is great, sound is great.  I do love it, but the issues im having are getting annoying.", "verified": true, "helpfulness": "0/0", "author": "Gizmoduck"}, {"rating": 2.0, "review": "This Fire TV Stick seemed good when I got it however besides Amazon movies, i also wanted use my Netflix and Pandora.  Every time I try to use either, the Fire Stick needs for me to re-enter my user name and password.  This is tedious at best using the provided remote.  I feel that I've just wasted $39.95.  I tried to find anything in the user, guide, online, or in the Fire stick settings that would allow this info to remain in the stick's memory, all to no avail.  I'm very disappointed.", "verified": true, "helpfulness": "1/1", "author": "Evan Clements"}, {"rating": 2.0, "review": "We mostly stream Netflix, so performance with it is the most important criteria for any streamer in our home. I compared Fire TV Stick to a Chromecast in exact same location in my house: same WiFi network, same TV, etc. Despite the Fire reporting a very good-to-excellent WiFi signal, it has trouble maintaining a consistent connection without pausing/buffering and then degrading video quality to non-HD. Watching any Netflix content, the Fire cannot make it through a show without interrupting to buffer a few times an hour and dropping to non-HD for a few minutes before recovering.  Swapping in a Chromecast -- and the difference is quickly obvious -- steady 1080p HD with no buffering. Using the Netflix \"Example Short\" test video and the observations bear out with numbers -- Chromecast locks in at >5000kbps 1080p and stays there.  Fire Stick has trouble staying above 4000kbps and flips between 1080 and lower resolutions. Perhaps Fire does not like my WiFi, though I've not had problems with other devices.I do prefer the physical remote of the Fire TV Stick and the menu interface. And the option to stream from Prime is nice. But neither offsets the connection quality problems I've observed. For our house, Chromecast is the winner.", "verified": true, "helpfulness": "2/2", "author": "CR"}, {"rating": 5.0, "review": "I am really happy I bought this instead of going with a pricier item such as a new bluray player that I didn't really need.  I haven't bothered with cable for almost a year, choosing to just use Prime Movies/TV.  We've been using the Amazon Prime function on our bluray player, though I must say now I realize just how outdated that version is.  I bought the Stick for our second TV.  It is a BREEZE to use and so simple to navigate with.  I haven't tried to unplug it to use on a different TV is, but I am sure it isn't difficult.  If you want to be able to access Amazon TV or any of the other apps listed for this device, it is an amazing item and well worth it.", "verified": true, "helpfulness": "0/0", "author": "Paula Rogers"}, {"rating": 1.0, "review": "First off, I wanted to give a head's up to those considering buying this item.  I am an IT professional with more than 15 years experience.  I have a ton of home automation and entertainment equipment and gadgets and have no bias towards any company or product.  Having said that...We purchased a Kindle Fire HD7 and Google Chromecast earlier this year for my mother in law.  Both worked flawlessly together.  She has stage 4 breast cancer and she had trouble trying to watch Netflix/Hulu on her tablet in bed while keeping it plugged in, charged, etc.  The combo was perfect while she underwent treatment because she didn't have to get out of bed or mess with DVD's in order to watch what she wanted.When this product released, Amazon (very discretely) turned off support for Chromecast for it's Kindle tablet line.  I am assuming they did this to force users to buy this product (Fire Stick).  Very frustrating that my mother in law has a perfect setup and now we have to buy new hardware to keep things working.  So I broke down and bought it and received it before Christmas.  I gave it to her for Christmas and went to set it up...This is where things went really badly.  I started the setup and it was similar to the chromecast.  Plug it in with attached power brick (didn't use TV usb power at all) and connect to HDMI port.  Logo came up and started setup.  After initial setup with wifi, it mysteriously reset itself.  Then on the second attempt, after wifi was successful, it would ask me to register and it would freeze on the \"checking network speed\" screen and restart. Tried every step on online guide (restarting router, unplugging device from power, using the included HDMI extender, soft reset and hard reset with remote, etc).  I then called Amazon customer support.  I was transferred 3 times and explained the same issue and verified all my information with 3 different people.  I asked if this was happening a lot with these devices and the young woman told me that they had several calls that day regarding them.  I was then asked to walked through all the troubleshooting steps again with the technician, even though I told them what I had tried them already and the listed the results of each.  I understand there is protocol so I went along politely. After over an hour on the phone I was asked to provide the model of my router, my television and my internet speed.  I was then told that an \"engineer\" would review my configuration in the next 3 business days to determine the next steps....Now this is a defective device.  It does not mean that they are all defective.  It's small, it's manufactured overseas, it can break.  Anything can and I want to reasonable.  However, when I am forced to buy your product because you prevent me from using a previously supported product, my expectation is that the new product should work in the same or similar fashion as the previous or you at least offer to fix or replace and obviously bad device.  I agree that my gripe is more with Amazon customer service than the product but the product itself clearly needs review, especially if it's going to be mandated and others blocked..", "verified": true, "helpfulness": "383/429", "author": "Kennedad"}, {"rating": 1.0, "review": "WiFi only works with encryption turned off.", "verified": true, "helpfulness": "1/1", "author": "what?"}, {"rating": 4.0, "review": "Cons:1.  Installing the batteries in the remote was somewhat difficult.  However, googling the issue revealed that you just need to push really hard on the indicated spot on the back of the remote to open it (Amazon does e-z open packaging; would be great to have a way to more easily open the battery compartment).2.  Received a \"low power\" message when plugged into the USB port of the LG HDTV; however, it still worked fine and when I unplugged it from the USB port it powered off, so it's working anyway.3.  Voice searching only covers the Prime videos, not Netflix etc.Pros:1.  Very fast interface - don't take this for granted as slow interfaces are real killjoys.2.  Great phone app IMO - the \"touchscreen\" concept with swiping works well and is helpful.3.  Voice searching feature really speeds up searching, although would be better if it searched the entire universe of apps on the stick.  I have a Tivo, and it's very helpful to search for a show and see all the places it's available.  Also, it would be better if the Fire stick had more particular searching (i.e., The Wire, Season 2, Episode 7 etc.)4.  Setup was relatively easy and no issues with wireless connection for me.5.  Portable - I can see bringing this on trips to other people's houses or hotels could be really great.", "verified": true, "helpfulness": "0/0", "author": "Trivia Hunter"}, {"rating": 5.0, "review": "The Fire TV Stick was a hit on our holiday retreat. We were visiting our relative's house and I brought the Fire TV Stick with us to hook up to their TV.  The set up was as easy as putting into an open HDMI connection on TV and connecting to their Wifi from the menu.  Instantly, the room was filled with entertainment from Prime and Netflix movies and tv shows for the kids, Pandora music while we were eating, and YouTube videos on the TV screen.  Having the Fire TV Stick was really a game changer in providing free and exciting entertainment content which livened up our holiday retreat.Pros: instant entertainment, ability to also use Pandora, Netflix, YouTube and many other Apps through the TV.  Easy to use remote and iPhone app to use in place of the remote.  Fast and instant viewing of content.Cons: works better if you use the supplemental power supply in addition to hooking up to HDMI connection.  Would be ideal if you could just hook up to HDMI without also needing a power supply (outlet) nearby.", "verified": true, "helpfulness": "0/0", "author": "DMS NYC"}, {"rating": 5.0, "review": "Nice App playing for the price I got to buy early. You do have to wait through the entire setup can't skip anything that is kind of annoying otherwise the menu seems clear so far. A would say it is a good buy.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 3.0, "review": "So far I am happy with my Amazon Fire Stick.  My TV is located close to the router so I have yet to experience any problems with the connection.  It is easy to set up and easy to use.June 2015.  I have a second Fire Stick - a gift from the people at Sling TV - and it is located in my kitchen which is not next to my router.  This unit does not work as well as the other one.  Not nearly as well.  My Roku functions just fine in that location as does my laptop so it is not a connection problem.  If I had paid for this Fire Stick I would have returned it.  I really think that the Rokus are a better choice.August 2015.  Swapped the Fire Stick in my kitchen for the Roku on the living room tv.  There are just not enough apps available for the Fire Stick.  I am a Tennis Channel fan and the app is not available on the Fire Stick.  A lot of apps are not available on the Fire Stick.If you are going to buy an internet accessing \"toy\" for your tv check out what apps are available before you buy.  Then buy the Roku.", "verified": true, "helpfulness": "0/0", "author": "JJO"}]