[{"rating": 5.0, "review": "Meets all of my expectations. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "bigtex52"}, {"rating": 5.0, "review": "Great item, lots of options, another way to enjoy Amazon Prime movies.  Glad I was \"forced\" into trying, well worth the money!!", "verified": true, "helpfulness": "0/0", "author": "Bernice"}, {"rating": 5.0, "review": "We've been using the Fire TV Stick consistently for a little over a month now and it has been great!  Setup was SUPER easy. The only limitation is the bandwidth that you receive from your ISP.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Great way to watch shows on my TV screen without having cable service! The remote is convenient.", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Great device. Easy setup, wide array of streaming apps. Just love it!!", "verified": true, "helpfulness": "0/0", "author": "Maher Al-Khaiyat"}, {"rating": 3.0, "review": "works fine, easy to install. However the advertising and description neglect to tell you that 95% of the things to watch or do have to be bought separately.", "verified": true, "helpfulness": "0/0", "author": "Richard H. Crose"}, {"rating": 5.0, "review": "Easy to use even for technologically challenged", "verified": true, "helpfulness": "0/0", "author": "lbsormore"}, {"rating": 5.0, "review": "Love..love..love.  so easy to use.  Only pluses when trying to get away from multi-channels of nothing cable tv.  Now dowenew to basic plus the fire stick.  Win win!!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 1.0, "review": "Netflix is easier and cheaper.", "verified": true, "helpfulness": "1/1", "author": "david aaron potter"}, {"rating": 4.0, "review": "So far so good.  The menus aren't the most intuitive to navigate but overall I am happy.  I love that they have a Slingbox and Amazon Prime Video stand alone app as well as Nexflix.  For the price- I am happy.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]