[{"rating": 5.0, "review": "Set up was a breeze and appears to work well.  This is used in the guest bedroom so yet to be decided for sure", "verified": true, "helpfulness": "0/0", "author": "bapbam"}, {"rating": 4.0, "review": "Great picture quality. Gives me access to Prime shows which my Apple TV does not. Very straight-forward to use.", "verified": true, "helpfulness": "0/0", "author": "Bee Myers"}, {"rating": 3.0, "review": "It does not perform well with what it calls a \"Very Good\" signal.  Our wifi is a little week in the living room (3 out 4 'bars'), but the Chromecast I have on the same TV never had a problem streaming Netflix or YouTube using that signal.  The FireTV stick has lots of buffering with the same signal, or loses the signal frequently.  Moved the Fire TV stick to upstairs TV with stronger Wifi, and no trouble with buffering.  It's nice to be able to watch my Amazon Prime TV on an actual TV now.", "verified": true, "helpfulness": "0/0", "author": "MonkeytoesY2k"}, {"rating": 5.0, "review": "It's my first to use the internet for TV, I really like it. At first I couldn't figure out how to play it through my stereo system. I found if I plug the fire stick into the PC port of my stereo the system sounds great. The apps are plentiful because i already pay for cable with HBO and all of the pay tv. The fire stick lets access most of them. I like being able to find a movie when I want. The system does nickle a dime you for certain season of tv shows. This if not watched could cost more that cable TV so you must be smart when finding shows to watch.", "verified": true, "helpfulness": "0/0", "author": "kevin burns"}, {"rating": 1.0, "review": "I am a frequent buyer for amazon products but they missed it this time. This device is very slow compared to my Roku. They are both wireless. I will not be using Fire TV Stick, it will just be sitting at home or replace it with something else if possible.", "verified": true, "helpfulness": "0/0", "author": "Shehab Hassanien"}, {"rating": 5.0, "review": "Fire stick was a little difficult to set up and seems to buffer more than the Chromecast did, but it has more options which I like.  Definitely a good investment.", "verified": true, "helpfulness": "0/0", "author": "Common cents"}, {"rating": 5.0, "review": "I love it...Use it everyday...I'm 75 and my son got this for me...I wasn't sure I would use it, but it is great...Watching allthe Downton Abbey episodes...Which I had not seen before...Had no trouble learning to use it...", "verified": true, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 3.0, "review": "It freezes a lot. It freezes more than my computer did. Other than that I like it", "verified": true, "helpfulness": "1/1", "author": "Shadae Richardson"}, {"rating": 5.0, "review": "It's awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Pamela Rider"}, {"rating": 1.0, "review": "Netflix did not work on two different sticks.", "verified": true, "helpfulness": "0/0", "author": "jimmy"}]