[{"rating": 5.0, "review": "I plugged it in, signed into Amazon and Netflix and was ready to watch. This is a great product.", "verified": true, "helpfulness": "0/0", "author": "nancy graham"}, {"rating": 5.0, "review": "Supremely easy to install. Ultra-fast speed for streaming HD. A true bargain, given the various offerings and functions.", "verified": true, "helpfulness": "0/0", "author": "Eric Almeida"}, {"rating": 5.0, "review": "My husband loves this Fire Stick.  He is on there everyday and we don't have a Prime subscription yet. He loves being able to get on our Netflix so easily.  It didn't always work that great with his Xbox.  He really wants to dump our cable because of it.", "verified": true, "helpfulness": "0/0", "author": "K. L. R."}, {"rating": 5.0, "review": "makes tv a new experience", "verified": true, "helpfulness": "0/0", "author": "redlead"}, {"rating": 5.0, "review": "Awesome we love it!", "verified": true, "helpfulness": "0/0", "author": "SUE"}, {"rating": 5.0, "review": "Quickly delivered, quickly installed and very user friendly. It's nice to be able to watch TV series that we missed out on and so many movies!!", "verified": true, "helpfulness": "0/0", "author": "A. Lucas"}, {"rating": 1.0, "review": "Amazon fire stick is awful! Haven't been able to do anything on it due to the wifi connection not working on it! HUGE waste of money!", "verified": true, "helpfulness": "0/1", "author": "vwarren22"}, {"rating": 5.0, "review": "Love it! Very fast loading and a perfact picture.", "verified": true, "helpfulness": "0/0", "author": "John Hawk"}, {"rating": 3.0, "review": "Keeps kick us out of our Wi-Fi provider. My wife will sit next to me and use her kindle( same wi- fi provider) and not have a problem. Meanwhile, I have to retart and sign in to Wi-Fi a few times before the firestick will recognize the connection.", "verified": true, "helpfulness": "0/0", "author": "Cliff Noyes"}, {"rating": 5.0, "review": "I've had the Fire TV Stick for about a week now and so far I am very happy with it.  There have been a couple of times when either I had difficulty navigating or the video would stop intermittently but I believe that these issues were due to my ISP.  There were a few surprises with the TV Stick.  I didn't expect to have access to YouTube which is nice since there are HBO shows like Real Time and Last Week With John Oliver that I am able to view clips from.  I would think it would be in the best interest of others like NBC and CBS to get on board with Amazon and add there programs as well.  When you team up Amazon Prime with Hulu and Netflix you have a decent library of entertainment at your fingertips and so far at a fraction of the cost cable tv.", "verified": true, "helpfulness": "0/0", "author": "Ed Swayback"}]