[{"rating": 5.0, "review": "Works great and is easy to use. We ended up buying two.Two things to consider:1. Make sure your wi-fi signal strength is good, otherwise it operates slowly, if at all.2. Use the parental control to require a password for purchases. Accidentally buying a movie is much easier than you might think.", "verified": true, "helpfulness": "0/0", "author": "Sigimund"}, {"rating": 2.0, "review": "It's ok for kid shows but there's not a whole lot of free movies and shows that are good. Also you can't get on he I gerber with it either which stinks. My kids love it tho for their shows!!!", "verified": true, "helpfulness": "0/0", "author": "loveymom"}, {"rating": 5.0, "review": "Greatest invention on earth, had to order one for each child and myself!", "verified": true, "helpfulness": "0/1", "author": "Edmund Foley"}, {"rating": 5.0, "review": "I got a roku but like this fire stick better. So much more for the money", "verified": true, "helpfulness": "0/0", "author": "robert"}, {"rating": 5.0, "review": "WOW!  I've been struggling with the problem of trying to play Amazon Prime Video/TV.  Playing through my computers resulted in intolerable frequent dropouts in voice and video.  Further, my Netgear boxes do not connect to Amazon.  The Fire TV Stick is sleek, packaged well, has great manual, literally sets up in less than 5 minutes.  Further, it plays both Netflix and Amazon Prime.  It appears to have connectivity to many other content providers, but I don't use them so I did not check it out.  The fire stick is literally the size of USB memory stick and plugs directly into the HDMI port of a TV.  It has been running virtually 14 hours per day for a week already without any problems whatsoever.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Bought this for my parents and they live it. It is easy to use and lots of fun.", "verified": true, "helpfulness": "0/0", "author": "name"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Matthew Wilger \"Matt\""}, {"rating": 5.0, "review": "I had been watching prime videos through our wii and the computer.  I am truly impressed!  The fire stick performs wonderfully in comparison.  The quality of video is superb and there has not been a lag due to poor signal yet.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Sadiegirl"}, {"rating": 2.0, "review": "Continuously have issues with this device. Constantly up and down on my wireless network, while ALL other devices on the network are connected and working, the Fire TV Stick refuses to connect. Now it refuses to connect to my network, despite resetting all the data and 'forgetting' the network. All attempts to connect to a WiFi network result in \"Authentication Issues\" and it will \"Save\" but won't connect. Also, it will read the network strength as \"Very Good\" and at full strength, but when attempting to connect will then show it as only \"Fair\" or \"Poor\", and then refuses to connect.I have been very dissatisfied with this product since receiving it approximately one month ago. I think it could be a great product, but unfortunately it appears to have been \"rushed\" to market, and there wasn't enough time taken to troubleshoot this device for potential issues. I hope they get this fixed, because it seriously taints my view of Amazon and their products.", "verified": true, "helpfulness": "1/1", "author": "Darin's Kindle"}, {"rating": 5.0, "review": "can't wait to see all of the programs on my fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "dining diva \"Mary\""}]