[{"rating": 5.0, "review": "The Fire Stick was easy to install and works seamlessly!", "verified": true, "helpfulness": "0/0", "author": "Ruby"}, {"rating": 1.0, "review": "This is probably the worst piece of hardware i've ever purchased. It constantly reboots itself. The rare times when its not just rebooting over and over, you'll get about 30 seconds of playback before it buffers, or loses network connection. This isn't a problem with my internet or router - my chromecast works just fine.", "verified": true, "helpfulness": "0/0", "author": "Aaron Brown"}, {"rating": 1.0, "review": "I have Sony ps3 since 4 years and it worked great for it's time. It got noisy and started dropping network but I am satisfied as it served my needs for quite a time. I purchased roku3 and Fire stick. Roku 3 is fastest device I have ever used, even better than ps3. You click on Netflix and within 3 seconds you are in. Not only Netflix, roku3 is fast in all the apps. Fire stick is the worst I have ever seen, I kept for 3 days and returned cause it doesn't catch network at all while roku3 is sitting right next to it and giving blazing speed. I put router right next to tv and fire stick started showing some action but I can't even watch single episode without buffer every 10 minutes. I saw positive reviews about fire stick so I am sure I got bad piece but I wrote whatever I experienced.", "verified": true, "helpfulness": "0/1", "author": "nikhil bhanderi"}, {"rating": 5.0, "review": "I love this.  It is so easy to use.  I had purchased another item like this and could never get it to work.  I plugged in my fire stick and it took me right to a instruction screen on my TV and setting everything up was a breeze.  I would recommend this to others for sure.", "verified": true, "helpfulness": "1/1", "author": "Janet Shute"}, {"rating": 5.0, "review": "Great device for enjoying television. Love it.", "verified": true, "helpfulness": "0/0", "author": "Ron McAllister"}, {"rating": 4.0, "review": "I love being able to use Prime Video and Netflix through the Fire Stick. The interface is great and easy to use.The only problem I am having (which I haven't check to see if there is a fix yet) is that it sometimes drops the network connection in the middle of streaming and needs to be reset. It's really annoying.", "verified": true, "helpfulness": "0/0", "author": "Pirate Pete"}, {"rating": 1.0, "review": "Piece of S*** all it does is BUFFER", "verified": true, "helpfulness": "0/0", "author": "dan erikson"}, {"rating": 5.0, "review": "This is my second one. Now I leave one attached to the \"big screen\" and use the other one for travel and guest tv.", "verified": true, "helpfulness": "0/0", "author": "John E. Semelsberger"}, {"rating": 5.0, "review": "My whole family is enjoying the Fire TV Stick. It's really awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Cutina Watts"}, {"rating": 4.0, "review": "You have to ensure a strong WiFi signal for it to work properly.", "verified": true, "helpfulness": "0/0", "author": "MichMich"}]