[{"rating": 5.0, "review": "Bought 2 of these devices as Christmas gifts, both recipients loved them and use them more than their primary cable/Verizon providers", "verified": true, "helpfulness": "0/0", "author": "jeanne"}, {"rating": 5.0, "review": "Had the Fire stick just about a week. Simple to use and understand. So far a good product.", "verified": true, "helpfulness": "0/0", "author": "Carla"}, {"rating": 5.0, "review": "Easy to use and to set up!", "verified": true, "helpfulness": "0/0", "author": "Debra C."}, {"rating": 5.0, "review": "Best purchase ever. And, it does everything it promises to do! Set up was pretty easy. Now, no more dragging around my lap top, hdmi cord and waiting for buffering. This little device is convenient and packs great entertainment options. Amazon Prime, Netflix and Pandora are my go-to favs, but now my boyfriend found that his MLB subscription works with a Fire Stick app and he no longer has to watch all the baseball games on his lap top - he just plugs it into his TV. I never tried the Fire TV box, but the stick is amazing and I'd say probably the same performance. Carry it around the house to all your TVs without any problem. Resume watching, etc.", "verified": true, "helpfulness": "0/0", "author": "J. Navarre"}, {"rating": 3.0, "review": "Fire Stick will not work in hotels where the WiFi needs a password on a Web Page. The unit is useless to me until that gets resolved. Fix that, and I will love this thing.", "verified": true, "helpfulness": "0/0", "author": "Tony Esposito"}, {"rating": 4.0, "review": "I have no cable so I was using my computer to watch tv netflix and other streaming apps.  But the fire stick is awesome and I get HD quality.  The only problem is the sleep mode does not have a timer.", "verified": true, "helpfulness": "0/0", "author": "Curtis MArra"}, {"rating": 1.0, "review": "After multiple problems with this device, I think it's time to leave a review for it.I had to reset this item about 3 times for the last three months since after I bought it, because it would either froze or I would receive a message saying network is not available, even though my wifi signal is very strong.  And I am using 50 mbps internet connection from Comcast.The most interesting story is that there's no way to turn it off and turn it back on.  And re-entering my WEP key (pass code) to reconnect to my internet on this device takes a whole lot of time.  Aren't you guys familiar with something called \"WPS\"?  I think it would have been much easier if that option was available.  I would have just choose that option and then press the WPS button on my modem and everything would be okay.", "verified": true, "helpfulness": "0/0", "author": "Mr. A"}, {"rating": 4.0, "review": "I like a lot but there are a lot of glitches. It freezes up a lot and I must restart or the remote randomly stops working. I really like how it works when it is working properly! I wish it worked right most of the time. It's almost like it should have been tested a little more or something. The setup was super easy although I do have one issue. The fire stick must be plugged into a power source, unlike chromecast which gets it's power from the usb outlet alone. It's difficult to free up another outlet for the fire stick.Overall I would buy it again its just all the glitches that I don't like.", "verified": true, "helpfulness": "0/0", "author": "Molly A Abbott"}, {"rating": 5.0, "review": "I bought this as a gift for friends.. The product arrived on time and works great.. My friends were very happy with the product..", "verified": true, "helpfulness": "0/0", "author": "Edward Raasch"}, {"rating": 5.0, "review": "This was an excellent purchase for use on our son's TV.  This has many different options for use, but his is used mostly with Netflix kids and the Disney app.  He also loves the gaming features on it. We cancelled cable, so this is definitely worth the money in our case.", "verified": true, "helpfulness": "0/0", "author": "JessicaH"}]