[{"rating": 5.0, "review": "This is a great alternative to cable! I ordered Sling tv and its  great! And my Amazon Prime is right there. Awesome if you don't have a smart tv.  The fire stick is great, sling will pause every now and then.", "verified": true, "helpfulness": "0/0", "author": "ami1231"}, {"rating": 1.0, "review": "I have had this item since December, and I have not had a good experience with this product at all.  It does not stay connected to the internet, and when I do try to connect, it says that it avoids it due to poor internet connection even though I have the fastest internet offered by Comcast, and my other home devices seem to not have any problems connecting.  This even says my signal is good (see picture).That's not the only problem.  When I finally do get it connected, it does not give me any sound through the TV.  When I called Amazon about a warranty, all they could do is issue a refund (which I was fine with of course).", "verified": true, "helpfulness": "3/3", "author": "Ryan"}, {"rating": 4.0, "review": "Received as described. Shipped fast. Bought as gift. So far so good.. Thanks", "verified": true, "helpfulness": "0/0", "author": "Joseph R."}, {"rating": 1.0, "review": "Cannot seem to get it up and running and cannot find information on how to.  cannot seem to get on-line despite my lap top getting on line with same password.", "verified": true, "helpfulness": "0/2", "author": "Norma J. Meakes \"shiny curly\""}, {"rating": 5.0, "review": "Great TV addition.", "verified": true, "helpfulness": "0/1", "author": "Mary"}, {"rating": 4.0, "review": "Really great little device that stomps the Chromecast and Roku (I have both)! Boot-up time is very quick, it can be powered off the USB on the TV, can \"side-load\" apps from an Android device or PC, nice menu selections that are easy to navigate, etc. etc.. Just can't beat it for the price!Only downfalls I'd say are: 1) the method of alpha-numeric input (would be nice to be able to use a keyboard of some kind) and 2) Was not able to side-load Google Play. I realize it is an Amazon competitor but many people use it for music and movies so having a device that can't access your library is a little irksome.I'd also warn that casting directly to this thing from another device is somewhat of a no-go and really needs to get polished up for this thing to dominate the market.", "verified": true, "helpfulness": "2/2", "author": "dbagpiper"}, {"rating": 5.0, "review": "Perfect for me!", "verified": true, "helpfulness": "0/1", "author": "Gonzalo Lens"}, {"rating": 5.0, "review": "Easy to use great value", "verified": true, "helpfulness": "0/1", "author": "Patrick Nothnagel"}, {"rating": 5.0, "review": "Bought this for my parents so they could use Netflix, so far they are really happy with this.", "verified": true, "helpfulness": "0/0", "author": "Tamara Ma Mercado"}, {"rating": 4.0, "review": "Great little device. Helps when watch movies outside on a projector", "verified": true, "helpfulness": "0/0", "author": "Rob Burns"}]