[{"rating": 5.0, "review": "Fantastic TV stick. Works wonderfully, and is easy to use and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Minnis \"MMinnis\""}, {"rating": 5.0, "review": "I love it,we have loaded my music,watched movies and viewed the new tv series from amazon.", "verified": true, "helpfulness": "0/0", "author": "mama"}, {"rating": 5.0, "review": "I love this. I don't usually watch shows on my computer so this give me big screen access to all those prime shows. Also makes me love prime more. I had heard some people having difficulty setting it up. Set up was easy. Did have one issue with it disconnecting to my internet but unplugging and plugging back in solved it.", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Smith"}, {"rating": 5.0, "review": "I love this little thing.  My husband and I don't watch a lot of movies on the computer so I haven't really been able to use that portion of my amazon prime membership.  $40 was worth it.", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 4.0, "review": "Works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ann Walsh"}, {"rating": 5.0, "review": "I am an Amazon Prime junkie!  The Fire TV Stick has opened up a whole new genre of TV for me. It was simple to install and easy to use.  I had the Google stick that I never used and ended up giving it away.  Not the case here. I use it every evening with my Prime account.", "verified": true, "helpfulness": "0/0", "author": "Susan in Hummelstown"}, {"rating": 5.0, "review": "Amazing product for the price !!!  only complaint is that the video in some aps like netfix and youtube will lag or frame skip wile audio is still playing .. please amazon fix this in a firmware update ....", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 4.0, "review": "easy set up", "verified": true, "helpfulness": "0/0", "author": "Laura Davis"}, {"rating": 4.0, "review": "I installed Fire Stick after I changed to a dual band router and Chromecast would not work. So I expected Fire Stick to work the same as Chromecast. The stick installed much easier than Chromecast and functions well with the internet and my desktop.I also used real player cloud to cast all my desktop files, photos, videos, music, etc. The Stick needs to use Amazon cloud drive so any file used by the Stick has to be in the cloud drive.. I am still working through the operations of showing my \"treasures on the big screen and so far I am pleased. The remote is very handy but lacks a volume control.", "verified": true, "helpfulness": "0/0", "author": "Eagle Saint"}, {"rating": 4.0, "review": "This replaced the SmartTV function for my Samsung and works much better. I haven't been able to get the phone app to work yet. Overall worth getting. Simple. Excellent design and packaging.", "verified": true, "helpfulness": "0/0", "author": "Luis Cuadros"}]