[{"rating": 4.0, "review": "I like it so far. The interface is pretty slick and I was surprised at how responsive it is. I do find it laggy at times but that is only because my wifi source has to pass through a room. I feel a wifi booster may help solve that but I'm not knocking the fire stick because of my lack of bandwidth. Would love to see some others popular apps namely HBOGo but that's a whole different convo. Haven't tried some of the device streaming features yet but I have noticed my family using it more over our actual cable tv which is a good sign for the cord cutting later.", "verified": true, "helpfulness": "0/0", "author": "Andre Brown"}, {"rating": 4.0, "review": "Compared to Chromecast, I love the Firestick more. It's a much more enjoyable experience and the navigation is much easier, especially within apps like Netflix. If possible though I'd like to customize my menus.", "verified": true, "helpfulness": "0/0", "author": "techgirl"}, {"rating": 5.0, "review": "very easy to set up and use. I like it as much as my ROKU that I am  using on bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "Louis"}, {"rating": 5.0, "review": "Great device, HD quality,super fast. And the still pictures are phenomenal. Amazon great product, very happy with. I give it a AAA+++ still wish i could search the google internet with it though. The game are a nice touch too...Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "shannon thomas"}, {"rating": 5.0, "review": "Absolutely amazing.  Before I got the fire stick, I was using an Xbox360 for streaming.  The experience with the stick is so much better, and it was so cheap!  Holds a network connection like a champ, awesome picture, huge variety of apps, and both remote experiences (physical and phone-based) work great!  I can't imagine going back to any other streaming device now!", "verified": true, "helpfulness": "0/0", "author": "Yarharhar"}, {"rating": 5.0, "review": "I already own a Roku 3 and a Roku Streaming Stick. Both have worked great but when I heard about the Amazon Fire TV Stick I was curious and then I had the chance to grab it for $19 on pre-order. I received mine on December 5th, 2014. There was a slight annoyance with connecting to my network since my wireless networks are hidden and limit access via checking device MAC addresses. Nonetheless, once connected it was smooth sailing. I'm very pleased with the UI and just how smoothly things flow in use. Thus far I've mostly focused on using Amazon VOD and the Netflix app. Both work beautifully. I'd highly recommend the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "C. G."}, {"rating": 2.0, "review": "I mainly replaced my Chromecast for the Fire TV Stick for Twitch TV app and unforunately the Fire TV Stick is a disaster for Twitch. It only shows video quality as 480, meanwhile Chromecast is 1080. I'm really surprised especially since Amazon now owns Twitch. Hopefully this improves in the future.", "verified": true, "helpfulness": "2/2", "author": "R. Calderon \"The Duck Knight Rises\""}, {"rating": 3.0, "review": "The sole reason for purchasing this was that it boasted much more powerful hardware specs over competitors and has a Plex app.The Plex app playback is sporadic and stutters. It has been narrowed down to the FireTV Stick and/or Plex app as the network was tested and source device have been ruled out (competitors stream flawlessly through Plex app).Netflix works just fine.", "verified": true, "helpfulness": "0/0", "author": "Tyler Jones"}, {"rating": 3.0, "review": "The interface is great and easy to navigate.  The reason for the 3 stars is that you have to plug it in to run it.  It's advertised as such that you don't need a power source for the stick, when in fact you do.  Not suitlbe for my needs as I wanted it for a wall mounted TV.  The USB cord provided isn't that long and wont run behind the wall.  You do NOT just plug this in and it works, you have to run it on a power cord.  However if this is not a problem for you then you will most likely love it.", "verified": true, "helpfulness": "1/2", "author": "Kfuofa"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Ronald King"}]