[{"rating": 4.0, "review": "Great little device but be aware that you will need to plug it into an electric outlet. The photos on the Amazon page don't show that until you scroll down to the What's In The Box area.", "verified": true, "helpfulness": "0/2", "author": "nObama NoMore \"Just a working stiff\""}, {"rating": 5.0, "review": "We just got our fire tv stick earlier than expected and so far I am loving it! Easy to set up and use. I haven't tried out the phone app as a remote control yet but looking forward to seeing how it works.", "verified": true, "helpfulness": "0/0", "author": "T. Frey"}, {"rating": 5.0, "review": "Love this!!!! Love the music feature!", "verified": true, "helpfulness": "0/0", "author": "L. Haddock"}, {"rating": 2.0, "review": "I want to love the Fire Stick..... I do. But it has major glitchy programming issues. Like many others, mine has network issues ever hour or so of streaming. The video will just quit and it says it has network problems even though it shows a strong wireless signal. Wish Amazon would address thos quickly and find a programming update to fix it. May return it.", "verified": true, "helpfulness": "0/0", "author": "BrockettM \"MMR\""}, {"rating": 4.0, "review": "Amazon fire TV stick is really amazing. It has very good wi-fi receptor, even though my TV is more than 50' from the router I do not have buffering issues even with 5mbps download speed. The home button on the remote is awesome. 4 stars because stick has to powered, means one more visible wire from TV to power outlet.", "verified": false, "helpfulness": "0/0", "author": "Shari"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Cristina Sampsell"}, {"rating": 1.0, "review": "The Netflix app only worked 1 time and now everytime I go on it, it says that you are unable to watch this episode, please select a different one.. For everything.  Hulu works.  I looked for troubleshooting and tried all that,  but still nothing. Does anyone know if there is a number to call?", "verified": true, "helpfulness": "0/0", "author": "Carissa Holder"}, {"rating": 4.0, "review": "I like the Fire TV stick overall. The remote is a nice relief because I don't always love grabbing my phone or tablet to switch something on the program I'm watching. I'm giving it a 4 because it's a bit wonky (like Roku, which is to say sometimes it works well and other times not so much, unless I unplug it and start all over) and therefore less stable than Chromecast. Whereas I get the added advantage of Amazon Prime shows and a few of my vital \"go to\" apps like Netflix and YouTube, I miss HBOGo. That has more to do with HBO and Amazon than with the stick but it would be nice to have one streaming device to control them all. Overall, I like the stick but think it needs work in terms of stability. I switched to Chromecast to avoid the whole unplug, reset drama I encountered with Roku. And YES, I use the USB cable and it's still not that stable and I would blame my tv but for the Chromecast working without incident.", "verified": true, "helpfulness": "0/0", "author": "Kidada E. Williams"}, {"rating": 5.0, "review": "Very easy to set up and use, only in use a few days but everything is working fine.", "verified": true, "helpfulness": "0/0", "author": "Joan M. Taylor"}, {"rating": 4.0, "review": "excellent performance but does no close caption. Since I am hard of hearing that is a problem", "verified": true, "helpfulness": "0/0", "author": "Ralf Kraemer"}]