[{"rating": 3.0, "review": "When it works it is great, but the wireless drops off a lot and you have to start over.  All other devices have not problem staying online.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "it's working as far as for using netflix, amazon videos but I like to be able to stream from my laptop to the TV screen .will check out the google chromecast to see if it can do this.", "verified": false, "helpfulness": "0/1", "author": "Kim"}, {"rating": 4.0, "review": "Only had for a few days, but very pleased so far.  Set up was relatively easy, and the software is easy to use and responsive.  Wish it had more apps, and an iOS remote.", "verified": true, "helpfulness": "0/0", "author": "Dale Collingwood"}, {"rating": 3.0, "review": "Pretty good except you cant cast to it from anything but a fire phone :(Still have to use my chrome cast for that", "verified": true, "helpfulness": "0/0", "author": "Shrubby"}, {"rating": 5.0, "review": "It's great! Love what it offers.", "verified": true, "helpfulness": "0/0", "author": "Rhoda L. Grabowski"}, {"rating": 5.0, "review": "I love this! And found it for $25 regular price! Best money I spent since I travel so much! Easy set up and saves all passwords!", "verified": true, "helpfulness": "0/0", "author": "Laura Williams"}, {"rating": 4.0, "review": "Everything is awesome I just wish I didn't have to keep it plugged in while I'm using it.", "verified": true, "helpfulness": "0/0", "author": "Markwell Fletcher"}, {"rating": 2.0, "review": "was not what I expected, there is no way to tell it what cable channels you already have so it wants to charge for even TV you get for free.  not sure whey you would want this?", "verified": true, "helpfulness": "0/0", "author": "Tech"}, {"rating": 4.0, "review": "I'm a ROKU 2 user and I also have a ROKU Streaming stick, but could not pass up the $19 offer for prime members and just received my two Fire TV Sticks.  I am also incorporating them into our Church's media distribution system in combination with a Plex server.  I have conducted testing with both the ROKU Streaming Stick and Fire TV Stick in low signal WIFI conditions.  ROKU Streaming stick had extensive buffering most of the time.  Fire TV stick other than about a 2 second initial buffer, ran smoothly with no issues.  On the CON side, I am disappointed with the configuration of the Parental Controls on the Fire TV Stick, as it requires you to enter your PIN to watch videos included with Prime for no charge!  Quite annoying and a security problem as if an unauthorized user is present they can see you enter the PIN on the screen, not very secure.  I'm waiting for the promised enhancement that will allow me to hook up to hotel WIFI when traveling that require web confirmation.  Overall I'm happy with it, I just hope they work on the minor annoyances I mentioned.  Additionally, the Android remote app needs work as it is very hard to work with and often responds erratically.  For instance it will interpret a click for a swipe  and swipes are not smooth.  I would reprogram with buttons rather than swipe or at least use a button for the click feature.  Voice feature is cool, but wish it worked across all apps e.g. Netflix.", "verified": true, "helpfulness": "0/0", "author": "Richard Gutknecht"}, {"rating": 5.0, "review": "Great way to watch Amazon Prime shows & incorporate Netflix into 1 device. Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Luis Gonzalez"}]