[{"rating": 3.0, "review": "The Fire TV Stick apps need to be updated with VUDU and STARZ.  I have a Chormecast and these apps are available.", "verified": true, "helpfulness": "0/0", "author": "Michael Hall"}, {"rating": 5.0, "review": "Best ever!!", "verified": true, "helpfulness": "0/0", "author": "Faisal Dhirani"}, {"rating": 5.0, "review": "Everything I want to access is working great", "verified": true, "helpfulness": "0/0", "author": "vam"}, {"rating": 2.0, "review": "The Fire Stick picture quality has been glitchy.  In using the Netflix and Hulu apps, the videos frequently pause.  Sometimes it happens throughout the entire show, and sometimes it does not occur at all.  Other times the picture quality randomly changes from HD to grainy and back to HD.  I am currently troubleshooting this problem.Otherwise, it has been easy to set up and use.  The apps available are great.  I have used it since Christmas and if I can get the problem worked out I would rate it a 5.", "verified": true, "helpfulness": "0/0", "author": "Sari Winham"}, {"rating": 4.0, "review": "Freaking cool", "verified": true, "helpfulness": "0/0", "author": "joseph deroy"}, {"rating": 5.0, "review": "love it, want another one!", "verified": true, "helpfulness": "0/0", "author": "peter noonan"}, {"rating": 2.0, "review": "We have Google Fiber installed. If I don't shut down virtually everything going to the Google Fiber boxes (meaning stop all streaming on the system), the Fire TV Stick can't get enough bandwidth to show anything. Kind of an either/or situation. It would be nice if one person could be watching something on Google Fiber on one box while another is watching something on the Fire TV Stick. My son-in-law got a Roku. That seems to have been a better solution.", "verified": true, "helpfulness": "0/0", "author": "W. Lund \"wbl2745\""}, {"rating": 5.0, "review": "Great product, easy to set up and so far no problems. Tons of TV and movie options with Prime and my TV becomes an additional device to watch Hulu.  Super happy.", "verified": true, "helpfulness": "0/0", "author": "marier3"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Dozier"}, {"rating": 4.0, "review": "seems to have great picture, but for some reason I have to plug and unplug it every time I use it.  Could be the way we have it hooked up with our Dish thing.", "verified": true, "helpfulness": "0/0", "author": "debora"}]