[{"rating": 5.0, "review": "Works GREAT!", "verified": true, "helpfulness": "0/0", "author": "Joel Albert"}, {"rating": 5.0, "review": "This is one awesome Media Stick!  Took it along for a weekend away at a competition with my son and we were able to setup with ease and watch out netflix and flixster media without a hitch.  Great Job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Leonidas C. Romero"}, {"rating": 5.0, "review": "What little I know about, I like it a lot....Can't wait to really explore all of its capabilities", "verified": true, "helpfulness": "0/0", "author": "Ronald LeBlanc"}, {"rating": 5.0, "review": "Although it's harder to hook-up then what they'll tell you @ Best Buy, or even in the directions, I luv the Fire TV stick. Extra calls were required to Amazon and Time-Warner Cable to set settings. But once it's working Fire TV is Awesome and provides instant access to thousands of Netflix movies/TV shows [w/$8/mo membership] on your TV screen. This is welcome relief from the 20/30-yr old movies like 'Pretty Woman' and 'Die Hard' that run ad nauseum on cable; I'm constantly amazed that 200+ channels on cable offer Nothing. Conclusion: once it's hooked-up Fire TV Stick is a cost-effective [$40] easy cool movie option.", "verified": true, "helpfulness": "0/0", "author": "Andrea M Hebert"}, {"rating": 5.0, "review": "works really well. Great for streaming movies!", "verified": true, "helpfulness": "0/0", "author": "Richard Hughes"}, {"rating": 5.0, "review": "Very easy to use. Excellent product.", "verified": true, "helpfulness": "0/0", "author": "susan"}, {"rating": 5.0, "review": "Great product.  Easy set up and immediate link to my Prime account.", "verified": true, "helpfulness": "0/0", "author": "70's TV is the best"}, {"rating": 5.0, "review": "I love the Fire TV Stick!  The set up is incredibly easy and intuitive.  We are thrilled about the extensive selections for both children and adults...this may get us one step closer to no relying on the local cable company!!!", "verified": true, "helpfulness": "0/0", "author": "cassiej"}, {"rating": 5.0, "review": "Great freakin product - By far best of class - to date", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "Last year, I bought a small \"smart\" TV for my kitchen that allowed me to use my Amazon Prime account to watch free movies and TV shows. When they came out with the Fire stick, I was excited because I would now be able to get all this on the other larger TVs in the house. I LOVE LOVE IT! It was very easy to initially set up and I have had no problems using it. I have nothing bad to say about it!", "verified": true, "helpfulness": "0/0", "author": "CB02864"}]