[{"rating": 1.0, "review": "If you are looking for a device that plays movies using plex; look elsewhere.  I have tried a myriad of setting in order to get the Fire  TV stick to play movies trough plex without pausing and or crashing and nothing has helped.  I regret the purchase, love the remote and the idea behind the product.", "verified": true, "helpfulness": "0/1", "author": "Brian Smith"}, {"rating": 5.0, "review": "Love it. Is an awesome device.  Basrd on an open platform you are able to customize the channels you need and desire to watch. You even can habe Kodi on it if you want.", "verified": true, "helpfulness": "0/1", "author": "AdiAri"}, {"rating": 1.0, "review": "Don't waste your money, just go for a roku. Functionally, this brings you nothing extra. Sped is very slow and delayed, home screen is clumsy and functionally has no direction", "verified": true, "helpfulness": "0/1", "author": "Urbanite1985"}, {"rating": 4.0, "review": "great device for such a reasonable price", "verified": true, "helpfulness": "0/1", "author": "john"}, {"rating": 4.0, "review": "Really awesome product!", "verified": true, "helpfulness": "0/1", "author": "Genita Walker"}, {"rating": 5.0, "review": "Our Fire TV Stick, is simply amazing.  It functions flawlessly.  Installation was easy, even for my techno- challenged, self.  I can't say enough about this product...Other than, buy it !!", "verified": true, "helpfulness": "0/1", "author": "Gary Scott Fischer"}, {"rating": 5.0, "review": "I luv it", "verified": true, "helpfulness": "0/1", "author": "Erich Lane"}, {"rating": 3.0, "review": "So I did my research on the Amazon Fire TV Stick and bought it because it was affordable and I'm getting rid of my COX TV in the next month or two.One thing I didn't count on or even notice was the length of the USB Cable (60 inches).  I plugged the Fire Stick into the TV and tried to plug it into the power strip and it wouldn't reach.Nowhere on the description does it mention how long the USB Cable is.  Also, when you buy the Amazon Fire TV Stick it doesn't give you the option to buy a longer cord.Make sure your TV and power cord are within 60 inches of each other or else you won't be watching Amazon TV.", "verified": true, "helpfulness": "1/1", "author": "Kevin Sheehan"}, {"rating": 5.0, "review": "Looooove", "verified": true, "helpfulness": "0/1", "author": "Lacey K."}, {"rating": 5.0, "review": "The Fire TV Stick provides me with everything I need to make my TV viewing more individualized to meet my unique needs.  Plus, I is very easy to use for a total non-techno geek like me.", "verified": true, "helpfulness": "0/1", "author": "Doris Machinski"}]