[{"rating": 5.0, "review": "Easy to use and customize, a great product.", "verified": true, "helpfulness": "0/0", "author": "Clarence Clarke"}, {"rating": 5.0, "review": "Very fast for the price", "verified": true, "helpfulness": "0/0", "author": "primetime"}, {"rating": 2.0, "review": "As many others have stated, at times the fire stick will lose it's signal or constantly buffer which seriously takes the enjoyment out of watching live tv on Sling TV.  I have a smart tv and stream netflix on it with no problem.  I assumed the fire stick would work just as well.  Certain times there is no problem, other times you can't watch anything without it buffering or \"catching up\" continually.  Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "K. Flint"}, {"rating": 1.0, "review": "I was excited to give this one a try.  But it just can't hold a candle to the Roku boxes I have.  It continually disconnects from my wifi connection, although it shows it as being a very good connection.  It's very frustrating and I haven't been able to get a fix for it, even with two chats with the always awesome customer service.  I think I would try the fire box versus the stick and hope that it does better at holding on the connection.", "verified": true, "helpfulness": "1/2", "author": "hsmom"}, {"rating": 5.0, "review": "So far so good, very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "grow"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "I can't speak highly enough of the Fire TV Stick....I like my chromecast, but this is much better as it has a remote. Sometimes I don't want to grab my phone or tablet, and there is something comfortable and warm about just having a remote in your hand.", "verified": true, "helpfulness": "0/0", "author": "Timtherockstar \"TimtheRockstar\""}, {"rating": 4.0, "review": "I enjoy it could be better it was good shipping fast delivery", "verified": true, "helpfulness": "0/0", "author": "Brandon humble"}, {"rating": 5.0, "review": "Super easy to setup and use... love it!", "verified": true, "helpfulness": "0/0", "author": "Ed Hartel"}, {"rating": 5.0, "review": "Great purchase! Small, quick, remote is really responsive. Give me ability to access tons of great apps on my tv without tons of wires, and devices.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}]