[{"rating": 5.0, "review": "Updated... Great device, now it has HBO NOW.", "verified": true, "helpfulness": "0/0", "author": "Kelley Harvey"}, {"rating": 5.0, "review": "Easy set up. Surprised me at the speed and quality of picture. How is that since it's using the wifi?  Needed this because trying to connect to amazon via the Sony blue ray was so tedious we didn't bother but really wanted original shows. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "helen rader"}, {"rating": 5.0, "review": "I love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Rhonda Humphries"}, {"rating": 5.0, "review": "absolutely great and easy to set-up and use right out of the box.  another great Amazon product!!!", "verified": true, "helpfulness": "0/0", "author": "susan hansel"}, {"rating": 4.0, "review": "It's better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "James King"}, {"rating": 4.0, "review": "I love my Amazon fire stick.  I enjoy the free options as well as the paid ones.", "verified": true, "helpfulness": "0/0", "author": "A. S."}, {"rating": 5.0, "review": "Works great for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Jason Gamboa"}, {"rating": 4.0, "review": "I have Apple TV, Ruko stick, and chromecast and amazon fire tv stick is by far the best  must buy for anyone and if u cord cut your cable  then it TV for everyone.", "verified": true, "helpfulness": "0/0", "author": "WCMasseJr"}, {"rating": 3.0, "review": "We have three of these things, two I bought when they first came out ($20/stick deal) and one recently during the Prime sale ($25/stick)...we have a lot of TVs in the house and recently cut our cable. We also have a Roku 3 in our living room. I am not basing my comparison on performance because that would not be fair (the Roku 3 is obviously the stronger, and more expensive, option), but I am using the Roku as a comparison for design issues I have found with the Firestick. First of all, the fact that the Firestick only searches Prime content is driving us crazy. My kids are pretty good at finding new content and half the time it is not free on Prime. I then have to search each service (we have Prime, Hulu, and Netflix) separately to check if we get it free on another service besides Prime. Roku searches all services. The next issue we have is that Hulu occasionally has issues and hangs while we're watching it, like once every few days there will be an hour where Hulu won't play well. It doesn't seem to happen with the other services...just Hulu. Weird.As far as processing speed goes, it's not bad. It works as well as a low-end streaming device should. At $20/$25, I think it is a good deal. I think it is good for a guest TV, a kid's room TV, a travel option, essentially a TV that is not used every day. We will be replacing the one in our bedroom with another option. The search issue is a deal breaker, so I would consider the regular Fire TV if the search works like the Roku. If not, then I'm going to be purchasing another Roku soon. =)", "verified": true, "helpfulness": "0/0", "author": "gadgetymom"}, {"rating": 4.0, "review": "Loving it!  Tons of things to watch!", "verified": true, "helpfulness": "0/0", "author": "Scott E. Levine"}]