[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Belinda Frank"}, {"rating": 5.0, "review": "This product has been fantastic.  Because of this, I've finally cut the cord here in Northern California to get away from the big cable company that dominates the area.  I went from paying about $240 per month for TV, internet and phone (which I didn't use since I had Ooma), to about $60 per month for just internet.  With a subscription to Hulu and to SlingTV I can get most of the things I want to watch like ESPN, and Sopranos etc.  The one thing that's lacking though is sports though there are other ways to get them (not uncommon to most people that have cut the cord).  Is it perfect, no, but relative to the Roku, AppleTV, etc. it's comparable.  It's a little slow - need to beef up the processors a bit - but other than that I really can't complain.", "verified": true, "helpfulness": "1/1", "author": "Fetty"}, {"rating": 5.0, "review": "Best thing since sliced bread. I have an amazon fire box in my living room and I purchased the stick for my bedroom. I very seldom watch cable TV anymore.  I can start watching a program in my living room, stop it and continue to watch in my bedroom. Remote is easy to operate and installation was easy.  The only thing I wish was that Pandora was available on the fire stick. It is on the fire box. I am a prime member so I do have access to a lot of music. I plan to purchase one of these for every TV in the house.. Everyone has their favorite progams and with Netflix and hullu plus there is something for everyone", "verified": true, "helpfulness": "0/0", "author": "Tanya Escort"}, {"rating": 5.0, "review": "work wonerful thank amazon", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Y. Marichal"}, {"rating": 5.0, "review": "fantastic ..it does what it claims", "verified": true, "helpfulness": "0/0", "author": "Sir David Barclay"}, {"rating": 5.0, "review": "Love it, can watch whatever I want almost anytime I want.", "verified": true, "helpfulness": "0/0", "author": "Mettie O. Asp"}, {"rating": 5.0, "review": "This is the best product in it's class. I was using one for my bedroom tv for about 6 months, then I had  to buy a second for my main tv because it's so user friendly.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "Steve K"}, {"rating": 5.0, "review": "This is my second Fire Stick, so it just goes to say that I am happy with this product. I also don't seem to have to reset my WiFi connection as often with the newer Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Jennie L. Kilby"}]