[{"rating": 5.0, "review": "Love it! It's so cool and even i can understand how to use it. I'll be enjoying it from now on", "verified": true, "helpfulness": "0/0", "author": "jodie ritcheson"}, {"rating": 5.0, "review": "I really can't say enough about this great new product from Amazon. After almost a year and a half with the Chromecast, I was tired of its frequent unpairing and terrible connection quality, so I jumped right on the early purchase deal for the Fire TV Stick. While it's certainly in its infancy right now, the Fire Stick already far exceeds the Chromecast in its usability and functionality. It's a lifesaver and I'll be using it for a long time to come!", "verified": true, "helpfulness": "0/0", "author": "Harris Walker"}, {"rating": 5.0, "review": "Early review got it yesterday a n d watched content late last night.  Would like to use the fire t v stick to download content late at night go watch during day time.  Why, well we ha v e satellite internet and at night content is uncapped.  Very pleased my kindle video watch list comes thru to fire stick.  Never saw a buffer issue or quality problem.  Set up was a snap.  Packaging was well done.", "verified": true, "helpfulness": "0/0", "author": "john gibbons"}, {"rating": 5.0, "review": "Super easy to set up and use. The remote control works very well and has a nice, clean design. I immediately set up and used the phone app to control the TV Stick and it was super easy to do and to use. It works very smoothly and the user interface on the TV screen is idiot-proof; it's super easy to use.I also love how well Amazon is integrated - on my TV, the stick allows me to see movies/shows that I recently watched/added when I was on my computer. It's so easy to use from room to room, and I like that I can use my Pandora account and others through it.I just need to see how it works when I go to friends' houses and/or hotels, as I travel a decent amount. The only thing I haven't figured out - does it have a volume control? That is one thing that is lacking (to my knowledge), so I have to still have the \"real\" TV remote handy (like that's a real big problem?!).", "verified": true, "helpfulness": "0/1", "author": "Kristin Lee Sotak"}, {"rating": 5.0, "review": "I ordered this during the pre-order sale and it has been, thus far, worth every penny of the $19 I paid.The set-up process took us about 15 minutes or so, but went smoothly.  We have had, thus far, no issues with freezing or wifi connectivity.  We have used it to stream Netflix, YouTube, Pandora and multiple other things -- thankfully, we have had no issues.  We have paired it with our LG HDTV and we love it!I like that it comes with a remote, which makes things quite convenient.  The streaming is crystal clear and like I said, we've had no freezing issues so we are quite pleased.We look forward to seeing what else will be unveiled with the Fire TV Stick in the future but for now we are quite happy with everything!", "verified": true, "helpfulness": "0/0", "author": "Little Mama"}, {"rating": 1.0, "review": "I am really disappointed in AMAZON! I was so exited to get this. But When I got it. It didn't work. The FREAKING!! control was taking for ever... I change the batteries to see if it was that. But It wasn't... GRRRR,... very very disappointed!!!", "verified": true, "helpfulness": "1/1", "author": "Julio c, santana"}, {"rating": 5.0, "review": "I was not sure I needed another dongle thingy to watch TV with but I like this device. I like that it has a dedicated remote (apps on computers and phones work but not as well as a real remote). It seems to play Amazon video and Netflix without a hitch. It is pretty seamless and took a minute or two to setup. I did not even both with the tutorial. The price they gave it to Prime members (20.00) made it pretty much a no brainer for those of us who crave technology do-dads (is that a real word?).", "verified": true, "helpfulness": "0/0", "author": "Cliff"}, {"rating": 2.0, "review": "I purchased 2 of them when the promotion was on for the price of 19.99 and gave one away as a gift. I did not know it at the time of purchase that Amazon pre-configures each one to automatically log on with my Amazon Prime account. So if my friend decides to give it to someone else then that person plugs it in, all they have to do is scroll down on the menu, select photos and they can see all my personal photos that I have stored in my personal Amazon cloud account. I did not notice any warning during the time of purchase that these devices automatically log on with my account. If you are going to give one away make sure you plug it in first and remove your account log on information before you give it away. Luckily I have sense enough not to store any photos in the cloud that have potential to ruin my reputation. Here is how you remove (or add) your Amazon Prime account from the Fire Stick:  From the Home screen, select Settings, select My Account, and then review the registration information.If no account is currently registered, select Register to register your Amazon Fire TV to the desired Amazon account.If you would like to register a different Amazon account, select the Amazon account that is currently registered, and then select Deregister.", "verified": true, "helpfulness": "1/1", "author": "Amazonian"}, {"rating": 5.0, "review": "The Amazon Fire stick is efficient for the relatively inexpensive cost.  It definitely lacks some features but the price point makes up for them in comparison to the competition.The Good:I found the device to be pretty speedy, occasional lag, but not significantCurrently streaming PLEX, Prime, Netflix, PBS kids, Showtime, and a few other appsMuch easier to use than my homebrew HTPCThe remote is simple and intuitiveThe Cons:No custom menus - this wouldn't be a big deal, except the first 5 options are basically all the same.At $19 it was an absolute steal, at $30 its a good deal. It didn't add a whole of of services (I already had Plex, Prime, and Netflix), but it streamlined them all and made my entertainment center much easier to use.", "verified": true, "helpfulness": "0/0", "author": "D. Lusk \"D\""}, {"rating": 3.0, "review": "It was a good product but it didn't have some programs that I want such as funimation and crunchyroll. It ran fast, I had no problems with it freezing or loading content but it would be a 5 star product for me if it had the programs I wanted.", "verified": false, "helpfulness": "0/0", "author": "Luigi Tassielli"}]