[{"rating": 4.0, "review": "Yes its great for the nextflix and getting online, but you really need a prime membership to enjoy all the extras.  Also setup was very easy and I had no problems.  Now I have to get my son one for his tv", "verified": true, "helpfulness": "0/0", "author": "Shamieka Racquel Johnson"}, {"rating": 4.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Jahaira  Rodriguez"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Linda Sipkens"}, {"rating": 5.0, "review": "Very easy to install and great content", "verified": true, "helpfulness": "0/0", "author": "Lynn"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "SUNG KIM"}, {"rating": 5.0, "review": "Everything worked great out of the box", "verified": true, "helpfulness": "0/0", "author": "Russodc1"}, {"rating": 5.0, "review": "Work's Great, some connection issues to router at times.  Wish the game remote was more reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "The stick has given me lots of free movies.  Some movies had buffering issues.  But what do you want for free, right?  Many of the movies offered through Prime require a payment. So I linked my device to a third party source to get movies and TV for free.  If I had it to do over, I would have bought the Fire BOX and not the Stick.  I read that theFire BOX has better hardware installed, and it comes with a \"Voice Search\" Microphone (the Stick does not).  All in all, it is worth the money.  It's already paid for itself.", "verified": true, "helpfulness": "0/0", "author": "Ted S."}, {"rating": 4.0, "review": "Works very well; the only bad part is the vagueness of the setting up instructions", "verified": true, "helpfulness": "0/0", "author": "toby rose"}, {"rating": 5.0, "review": "Loved the Fire Stick. Easy to connect. Comparable with the Apple TV but at a great price.", "verified": true, "helpfulness": "0/0", "author": "Princido Texidor"}]