[{"rating": 5.0, "review": "I love the firestick! It's better than I expected. Endless hours of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Jamie dean"}, {"rating": 5.0, "review": "Think I can get rid of the premium movie channels in cable. So far, Fire Stick is Great!", "verified": true, "helpfulness": "0/0", "author": "Joelle Hargraves"}, {"rating": 2.0, "review": "A few days ago I received the Fire Stick TV, I installed it and it worked immediately without any glitch. While buying and installing the device I was Amazon Prime user, so expect to see movies and music available (in theory) for this type of user. The truth is that despite the globalized world, Prime services are only available in USA and it was very frustrating to have nothing further to Chromecast that I already had, I admit it's nice to have a remote control, but in practical terms for users who are out of USA does not have anything extra..In short, not recommended for those who live outside the US, because even when you're willing to pay for content is not available.", "verified": true, "helpfulness": "1/1", "author": "Robin"}, {"rating": 1.0, "review": "Would not allow me to enter my WiFi password even though it found the name of the WiFi. The remote is flimsy and felt easily breakable.", "verified": true, "helpfulness": "1/2", "author": "vince bardo"}, {"rating": 5.0, "review": "Works really good, pretty awesome since I got it for the promo price.I'm just really disappointed that it doesn't have all the Amazon Appstore available. Lot of apps that would be great for it that simply are not \"compatible.\" Amazon needs to work with developers to get broader support.", "verified": true, "helpfulness": "0/0", "author": "Isolder"}, {"rating": 5.0, "review": "So far this is great.  I have only had it for a few weeks.  It is a vast improvement over the 2 year old smart tv.  So far I am impressed and will likely purchase again.", "verified": true, "helpfulness": "0/0", "author": "AWB"}, {"rating": 3.0, "review": "It is difficult to find the items on it that are free/included with your Prime membership. Need to change the search both on the Fire Stick and on the Amazon website.", "verified": true, "helpfulness": "0/0", "author": "Leslie Schilling"}, {"rating": 5.0, "review": "This was possibly one of the best purchases I have ever made- I got it on a promotion for $19, but I would definitely purchase again at regular price. I have not had any problems with streaming and buffering but mine is only a few feet from my router- I need to note though that my router is the bare-bones model that I got from my cable company, so I have been very pleasantly surprised with the fire stick's performance. Great purchase- highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "Vg44"}, {"rating": 5.0, "review": "Very good device!", "verified": true, "helpfulness": "0/0", "author": "Juljan Daci"}, {"rating": 5.0, "review": "love my fire stick! Purchased a chromecast, and have had roku as well, so far this is the best choice for adding smart capabilities to your TV.  it's user friendly, and if you have an Amazon Prime Account you have access to tons of movies.  Connection was a breeze and hooked me up immediately after I entered my Amazon login.  I will be purchasing more for my other TV's.", "verified": true, "helpfulness": "0/0", "author": "Marinag1978"}]