[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Sheri verville"}, {"rating": 4.0, "review": "EASY TO INSTALL  AND USER FRIENDLY.  HAD TO INCREASE INTERNet SPEED.", "verified": true, "helpfulness": "0/0", "author": "Robert O. Smith"}, {"rating": 4.0, "review": "Have this hooked up to a back room TV on WiFi and use it mostly for Netflix. More than worth the price for that feature alone. We've also tried some casual gaming and playing background music with the built-in Amazon Prime playlists. I have no complaints with the device itself. The Sling TV app as of now (July 2015) seems more stable than the PC based app but Sling has a long way to go.", "verified": true, "helpfulness": "0/0", "author": "IT Guy \"Brian\""}, {"rating": 5.0, "review": "In contrast to DirecTV, Roku, Sony DVD player and Chromecast, this streaming system hardly ever stops to \"buffer\" more data.  All on the same slow Century Link DSL modem.  Amazing!", "verified": true, "helpfulness": "0/0", "author": "taoshum"}, {"rating": 3.0, "review": "THERE WERE NOT ENOUGH INSTRUCTIONS AS TO HOW TO UTILIZE THE SYSTEM, [APPS] ETC.", "verified": true, "helpfulness": "1/1", "author": "Robert J Landry"}, {"rating": 5.0, "review": "Having just moved into an area with minimal TV programming and satellite being the only option. This is great, we watch movies, childrens programming. Easy for my kids to get around and watch there shows. Strongly recommend because of cost. It truly is a great deal. Oh, our internet there is not the fastest so every once in awhile it will pause. Not a problem with us. Where our internet was faster, we never had a problem at all.", "verified": true, "helpfulness": "0/0", "author": "webehillbilly"}, {"rating": 2.0, "review": "I can't get it to work :(", "verified": true, "helpfulness": "0/0", "author": "Joanie M.- Atlanta"}, {"rating": 2.0, "review": "I had bought this to replace an older Roku2 device because of the price, but sent it back because of the quality of play. It would constantly stop what you were watching to buffer to a point of annoyance (both the old Roku2 and the Fire stick were used on the same TV across the same wi-fi network so it was easy to compare and see the difference). I ended up sending it back and getting the current, slightly more expensive Roku3.", "verified": true, "helpfulness": "0/0", "author": "DMFriend"}, {"rating": 5.0, "review": "Was apprehensive when I purchased the Fire Stick, but this is great. Easy setup and operation!", "verified": true, "helpfulness": "0/0", "author": "vickie v"}, {"rating": 1.0, "review": "Not what I expected. Can't stream anything from the internet", "verified": true, "helpfulness": "0/0", "author": "LaShaunda Alexander"}]