[{"rating": 4.0, "review": "If I were stuck on a desert island and had food and a fire stick and Wi-Fi to get it running I would never be at a loss for being bored there is more to do on the stick than anyone could ever wan,t it's great!  -Eric", "verified": true, "helpfulness": "0/0", "author": "Eric D."}, {"rating": 5.0, "review": "Easy to install and learn.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Stanley"}, {"rating": 5.0, "review": "An excellent alternative to competitor streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Joseph Barbato"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "delane foster"}, {"rating": 1.0, "review": "Apparently you have to have the Fire TV Stick right next to a router for it to work without dropping the signal over and over and over.  Speech does not keep up with mouths on programs.  Constantly freezes and screen goes blank.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very impressed. I have Chromecast also, and Fire Stick seems to have more options. Easy to learn operation, and there are lots of apps for viewing movies, and TV. And of course Prime Movies, TV, and music are great. Hopefully someday we can just pick channels 1 by 1, but my cable is already gone!!", "verified": true, "helpfulness": "0/0", "author": "Todd Johnson"}, {"rating": 4.0, "review": "Love that it works on hotel networks where you need to type in a code for Internet (captive portal)", "verified": true, "helpfulness": "0/0", "author": "Indiana Jones"}, {"rating": 2.0, "review": "All is good as long as you don't try to watch MLB.TV with it.  If you are looking for a way to watch live sports I suggest you go with the Apple TV.  $30 more but at least you can watch a gane without waiting for it to buffer every 20 seconds.  In case you are wondering, I use FIOS for my Internet connection and the buffering has nothing to do with the speed of the connection.  Under the same conditions my Apple TV is perfect.", "verified": true, "helpfulness": "0/0", "author": "Vangelis"}, {"rating": 1.0, "review": "Unfortunately this does not meet my expectations. I thought this would work as Roku & offer as such, but falls short to my expectation. Very little free channel offers to choose from. But it does carry all other subscription channels ie Netflix, Hulu. Fire is just a vehicle for Amazon marketing. Any Smart TV already has these feature so there is no reason for Fire.", "verified": true, "helpfulness": "0/0", "author": "Tweet"}, {"rating": 5.0, "review": "Works great. we love it!", "verified": true, "helpfulness": "0/0", "author": "Sue"}]