[{"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "Eugene Gimblet"}, {"rating": 5.0, "review": "Turns a non smart tv into a smart tv. Works great", "verified": true, "helpfulness": "0/0", "author": "TSKW"}, {"rating": 4.0, "review": "If you are not tech savy, this item is absolutely amazing.  But chromecast is still better in my opinion.  The acess to Amazon's services is quite amazing, and useful.  But there are downfalls.  The pros other people have listed are valid.  Though I decided to give mine to my parents instead, it is still quite a nifty device.  Here's some info though that might affect your decision to buy one though.- The GUI is quite cluttered, and almost confusing.  The layout is not very easy to use.- For having 4x the power of the chromecast, it actually seems slower to respond (Probably because of the cluttered and overly busy gui taking up it's resources).- You can not stream files from your computer like the chromecast can with the videostream app (Which is the main reason I bought the chromecast).  Now, keep in mind the chromecast did not have this ability at first either, but was later added as a third party app after launch - so the same thing might be true for the fire tv.  If that's the case, I may have to buy another one!", "verified": true, "helpfulness": "1/1", "author": "Zach Torino"}, {"rating": 2.0, "review": "Really? I can't skip the intro video?", "verified": true, "helpfulness": "1/2", "author": "Ryan P"}, {"rating": 4.0, "review": "I love the clarity and ease of use. However, I resent being charged for programs after paying for the Fire Stick and for Amazon Prime.  Being further charged for programs is an insult.", "verified": true, "helpfulness": "0/0", "author": "edbrooklyn"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Raquel Black"}, {"rating": 5.0, "review": "The only real difference you will have with the Fire Stick and Chromecast is this comes with a remote. Which is really handy rather than having to use your phone as one.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 4.0, "review": "I will be one of the the 5000... But anyway after 5000 positive reviews it is pretty obvious this thing works well. Now that being said here is a review from a father of a 3 year old and 6 year old. All the positives are true this thing is great for a adult without kids hurry up and buy one. Now the real world, this thing has major concerns for parents in a few departments:  1. The remote is very small and thin. This thing will get lost, just a matter of time,  2. There is lots of things to click on for a kid, they can download games, apps... Parental control is a must but the parental control is not perfect. It took me $50 worth of buying to figure it out and so far so good. There is a parental control to turn on games or off games. What is the best is parental control on.. Pin on purchase. Under Apps section select \"in-app purchasing off\"  3. Don't make the pin easy to see because when you select them on the screen it makes a visible blink on every number so if you use 55555 they will only watch it once and see it because there is no number buttons on the remote you must move and click each number individually. I used something like 54545 and then I move the remote to other numbers before pushing the correct ones. They watch it very carefully.  4. I wish they could make it so I have to enter the pin to turn it on completely that way I can limit how easily they can use this thing.  5. The content is all mixed together so some Prime free tv shows are then mixed with purchase only shows and my children get frustrated. If you select Amazon Prime first this doesn't happen but the homescreen is littered with clickables and it hard to navigate past all the goodies if you were 6 or 3..To sum it up this Fire stick is awesome but has its drawbacks for a parent with children. I will keep it and use it because it works much better than my Sony Blu-Ray player. It streams much faster with no buffering while the blu-ray will buffer on most movies.", "verified": true, "helpfulness": "0/0", "author": "IowaHawkeyesFan"}, {"rating": 5.0, "review": "It's great, so easy to use and I like to use the app on my phone for typing when doing a search.", "verified": true, "helpfulness": "0/0", "author": "mmccu720"}]