[{"rating": 1.0, "review": "At first I thought this would be nice, but then I got it programmed & it seems you have to pay for everything unless your doing the prime movie or shows. It wouldn't even let me download Netflix & it's suppose to be 1 of the free downloads.", "verified": true, "helpfulness": "0/2", "author": "Brittany McIntyre"}, {"rating": 3.0, "review": "I loved this device when I first received it, but now it skips, delays and will simply stop playing.  I'm not sure why it cannot hold a signal anymore and steam any programs.", "verified": true, "helpfulness": "0/0", "author": "All-access Customer \"Diana Nichols\""}, {"rating": 2.0, "review": "Need to have listed the internet speed needed for the downloads.  Buffering is not good", "verified": true, "helpfulness": "0/1", "author": "Gary P Ritchie"}, {"rating": 5.0, "review": "Works great, no complaints. I was surprised that this works good. I've been using this for 2 weeks now.", "verified": true, "helpfulness": "0/0", "author": "James Wegner"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Devon Kuerten"}, {"rating": 5.0, "review": "It was so easy to install I couldn't believe it.  And, so easy to use..", "verified": true, "helpfulness": "0/0", "author": "Judith Blazevich"}, {"rating": 4.0, "review": "Great tool for watching Netflix!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Very poor device - slow loading and won't hold a 30 mbps Wi-Fi connection worth squat. If you have Prime, it takes even longer to load - hours and hours.  The unit seriously overheats with the AC power adapter and is supplied with a very short hdmi m/f extension that doesn't help trying to get a better Wi-Fi signal position.  The remote control is a joke, and a ridiculous design for installing batteries.  All in all, this is just pure junk and a complete waste of money and both hardware and firmware are junk.  I'm only giving it a star because I have to.  Don't waste your time and money.  Once again, Mr. Bezos has ripped me off.", "verified": true, "helpfulness": "0/2", "author": "Tony V"}, {"rating": 5.0, "review": "I use an Apple TV at home for my Netflix and HBO Now needs, and typically with an iPad to stream Amazon Prime videos.  I now often use this at home for Amazon Prime Instant Video.  I had bought it primarily for travel, but find these days at most hotels that wifi is not free or fast enough to get the job done.  Still great for visiting friends/family and having on the go access for the slow or rainy days.", "verified": true, "helpfulness": "0/0", "author": "Tucker"}, {"rating": 3.0, "review": "Using the fire stick is easy, the remote control is kinda hard for searching for movies and TV shows. . Singed up for prime and not everything is included,  I would spend lots of money to watch TV and movies..", "verified": false, "helpfulness": "0/0", "author": "brian mahas"}]