[{"rating": 5.0, "review": "very pleased", "verified": true, "helpfulness": "0/0", "author": "Bryan A."}, {"rating": 3.0, "review": "Great interface, weak wifi. I bought this for a TV directly upstairs of my router, and it kept losing the signal. I eventually bought a new router, and now it works well. So, I was excited about the $40 price tag, but I ended up spending $250 to get the thing to work properly, which was not cool. Maybe the Fire TV box works better, but it's hard to find a decent head-to-head comparison to know.", "verified": true, "helpfulness": "0/0", "author": "Steve K."}, {"rating": 5.0, "review": "Love this! I'm not a huge tech person and don't need to be to operate this. It's very easy to get around and find what you're  looking for. I've only had problems having a strong connection twice.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Murdock"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "nancy carr"}, {"rating": 4.0, "review": "Its a little slower than the apple tv or roku 3, but faster than the roku stick, chrome cast, and any other streaming device (not including the fire tv box). I do wish I had shelled out $60 more for the fire tv box. The interface is similar to roku's, except that the homepage not only shows recent apps used, recent prime videos watched, but also shows suggestions for new apps to try and more prime shows and movies. The interface is the same as the fire tv box and runs a little slower (of course). Loading times for apps are a little longer, but not by too much. The only issue is that HD doesn't always stream.", "verified": true, "helpfulness": "0/0", "author": "Michael Arnold"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Carolyn Urbis"}, {"rating": 5.0, "review": "Thank you Amazon!  This device is so cool and it really beats the Chromecast (since its just a 'dummy' media player device).Please whatever you do do not stop allowing people from side-loading APKs.  You really should make it easier for people to add things like XBMC or put the icons on the front screen.WHATEVER YOU DO DON'T LIMIT US FROM USING THIS WONDERFUL LITTLE DEVICE!", "verified": true, "helpfulness": "0/0", "author": "R. Augustine"}, {"rating": 3.0, "review": "Having issues with speed but don't have same issue with netf", "verified": true, "helpfulness": "0/0", "author": "K. Henderson"}, {"rating": 1.0, "review": "I regret buying Fire TV Stick.  Netflix doesn't work on this!", "verified": true, "helpfulness": "0/0", "author": "Dino \"dinoz7\""}, {"rating": 1.0, "review": "Awful, unwatchable, how do I send it back?", "verified": true, "helpfulness": "0/0", "author": "William Colvin"}]