[{"rating": 4.0, "review": "Great product for. A great price!", "verified": true, "helpfulness": "0/0", "author": "Vishal J Shah"}, {"rating": 4.0, "review": "Easy to use and interface is clean.Crashed on me twice randomly when roaming the interface.No UFC Fight Pass, please add.", "verified": true, "helpfulness": "0/0", "author": "Jee I Kwak"}, {"rating": 5.0, "review": "Love it but still have room for improvement like mirroring.", "verified": true, "helpfulness": "0/0", "author": "Agripino Cruz"}, {"rating": 5.0, "review": "Love it!  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Patricia S. Lutterloah \"Patti Lutterloah\""}, {"rating": 5.0, "review": "Great product. Chromecast was trash because of several shortcomings in the area of being able to use things like plex easily. This Fire TV stick is fantasticK(see what I did there?) I got mine yesterday(11/25/2014) and right out of the box it worked flawlessly. THe plex app is $2.49 which is cheaper than it was on Android and fapple app store.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Timmons"}, {"rating": 5.0, "review": "Love this item!", "verified": true, "helpfulness": "0/0", "author": "Christopher Murray"}, {"rating": 4.0, "review": "This is primarily geared for those that have Amazon Prime. The apps are lacking, but expected. Navigation isn't the best with the controller, but much better using the Fire Tv Kindle App. It will not replace my Roku yet it has a defined purpose for Prime subscribers.", "verified": true, "helpfulness": "0/0", "author": "Gamer"}, {"rating": 5.0, "review": "Worked as expected, and then some.  Its not clearly documented, but if you goto settings, display and sounds, and enable screen mirroring, you can cast to this device from any samsung product using Android 4.2 or later.  makes it a chromecast killer, and we love it.  Also has dual band wifi, and better hardware, so no sluggish video.", "verified": true, "helpfulness": "0/0", "author": "Richard Riedling II"}, {"rating": 4.0, "review": "If you just want to watch movies, its just fine.  Guess I misunderstood what all was on it.  I thought it was like roku, where you could get different TV stations! My bad!Who has time to just sit and watch movies all day?", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like it. Fire TV Stick installed easily and works as described. With this, I won't need to use similar functions built into my Blue-Ray player, which connected and buffered slowly. With the Stick's slick interface, I can find content I want and watch it very quickly.", "verified": true, "helpfulness": "0/0", "author": "DonC"}]