[{"rating": 5.0, "review": "I hate to admit it, but this thing has changed how I use my TV.", "verified": true, "helpfulness": "0/0", "author": "Aya Hauberk"}, {"rating": 4.0, "review": "Sometimes when I open an app (Hulu,netflix,Amazon prime) I will get a message on the screen stating that my bandwidth is insufficient to view the video. However when I open the same app in chromecast or Roku the same video will play without issue. This doesn't happen often but I felt that it should cost a star.", "verified": true, "helpfulness": "0/0", "author": "Brother"}, {"rating": 5.0, "review": "Exceeded my expectations. I didnt realize all the little perks and features. You can stream Netflicks yes, but you can also downlaod games and Youtube. Totally took my morning exercise routine to another level pulling up Zumba videos on Youtube straight to my TV.", "verified": true, "helpfulness": "0/0", "author": "Amber Golfe"}, {"rating": 1.0, "review": "not that great  did not meet my goals would not purchase again", "verified": true, "helpfulness": "0/0", "author": "crescenzo lepore"}, {"rating": 1.0, "review": "False and misleading information on TV about this stick.  They make it sound like you get 20,000 free movies and all kindsof free TV shows etc.  YOU GET NOTHING FOR FREE EXCEPT ONE NEWS CHANNEL.  You have to be an AmazonPrime member.  BUT THEY DON'T TELL YOU THIS UP FRONT.  So expect to purchase the Amazon Prime Membership.I was shocked and very disappointed.", "verified": true, "helpfulness": "1/3", "author": "Sharon Nelson"}, {"rating": 4.0, "review": "Very good, could be 4-1/2 stars. The DC power input should move to the end.", "verified": true, "helpfulness": "0/0", "author": "Quan Phan"}, {"rating": 5.0, "review": "Fast delivery. Great price! I had it for week now and no streaming issues. I love this thing. I wish i didnt need the power cable, but not a big issue. They should include a longer usb cable. Im still impressed with the performance of this stick", "verified": true, "helpfulness": "0/0", "author": "Jorge Rodriguez"}, {"rating": 4.0, "review": "Overall its fine.  I was hoping it would have more functionality using my apple devices or even with my laptop.  Typing with the handheld remote bites.", "verified": true, "helpfulness": "0/0", "author": "Fritz J. Guerrier"}, {"rating": 3.0, "review": "The occasional \"picture freeze\" problem is directly related to the power adapter that's included with the Fire TV Stick.  I decided to try one of the USB ports on the back of my 32\" LG 32LB520B television, hoping that the USB port had enough power to correctly operate the Fire TV Stick.  I substituted the long Amazon USB cable that was included with the Fire TV Stick with a 1 foot long (12\") high quality Anker cable to maximize the available power output from the USB on the TV to the Fire TV Stick.  A short 1 foot high quality cable (like the Anker brand available here on Amazon) will work best because it minimizes any power loss in the cable.  It solved the problem completely.  No more picture freeze.  Everything runs fast and smooth.  The USB port on my LG TV has enough \"horsepower\" (with the Anker 1 foot cable) to power the Fire TV Stick.The problem with the included Amazon power adapter (power supply) is most likely:  1. The 5 volt output is unregulated and does not maintain the constant 5 volts that's required.  2.  It is unfiltered or poorly filtered allowing electrical noise to pass into the Fire TV stick.  3.  It's rated at a 1 amp output, but that doesn't mean it's actually delivering 1 amp or the power needed to correctly operate the Fire TV Stick.  The included power supply looks cute, but internally it's junk and it actually might be suffering from all 3 of the above mentioned possible problems.Give this remedy a try.  Be sure to use the 1 foot Anker USB cable.  It should fix the picture freeze problem.  If your TV does not have a USB port or if the USB port on your TV doesn't have enough power to correctly operate the Fire TV Stick ... then use a quality 5 volt power adapter (power supply) from Anker or RavPower in place of the junk Amazon power adapter that came with the Fire TV Stick.  They are available here on Amazon.", "verified": true, "helpfulness": "2/2", "author": "John"}, {"rating": 5.0, "review": "I love it! So nice to have. So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Latrice Simms"}]