[{"rating": 5.0, "review": "Family starting to fight over it. Maybe two will be enough lol", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 4.0, "review": "Easy to hook up and fairly easy to operate, however I seem to have a balky remote which Amazon has graciously offered to replace after I talked to half of India. I have a suspicion that these remotes will be a problem because the disc on top reminds me of the ones on the old early 80's Intellivision video game systems, The games were great but the controllers didn't last because the disc wore out fast, and I suspect this might be a problem here too.The product is really good though. Maybe I just got a bad one.", "verified": true, "helpfulness": "0/0", "author": "J. Eccles"}, {"rating": 5.0, "review": "Works great going to order one more for the 3rd TV in the game room", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Excellent if you have an Amazon prime account!", "verified": true, "helpfulness": "0/0", "author": "michael varvara"}, {"rating": 1.0, "review": "Not much selection without additional charges above Prime subscription.", "verified": true, "helpfulness": "2/2", "author": "Timothy Sung"}, {"rating": 4.0, "review": "Just need to remember that to be effective you need to have an unlimited wi-fi connection.I thought my mobile hotspot would be enough but at 1 gig and up of data per show it runns out quick", "verified": true, "helpfulness": "0/0", "author": "John Macho"}, {"rating": 5.0, "review": "easy quick start up. worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "Geep"}, {"rating": 4.0, "review": "I like this so much better than the chromecast because I can watch movies (and even play games) without having to cast it from a device or laptop BUT lately I am starting to get frustrated with this product because for some reason every time that I want to use it - it won't work unless  I unplug and plug in the device from the wall outlet first. My TV is only 3 years old and it should not be a problem compatibility wise.", "verified": true, "helpfulness": "0/0", "author": "LoveLea20"}, {"rating": 4.0, "review": "Easy setup! Tons of tv shows and lots of movies (especially for Prime members-free). My only dislike is that a lot of movies (older) are not rentable yet, they are only for sale. Still giving money to movie rental stores Amazon 😥", "verified": true, "helpfulness": "0/0", "author": "Janet Welch"}, {"rating": 5.0, "review": "I really do like this,  It is really fast, I can watch Netflix, Hulu, Amazon prime and all the movies and such with out being hooked up to my modem with wires running everywhere", "verified": true, "helpfulness": "0/0", "author": "James Lloyd"}]