[{"rating": 5.0, "review": "Great device.  My only complaint is the size of the remote.  It is really easy to lose!Great for Netflix and Amazon Instant Video.  This is a must have for any prime subscriber.", "verified": true, "helpfulness": "0/0", "author": "gotaholen1"}, {"rating": 5.0, "review": "Once I figured out how to use it, I really am enjoying it.  One problem though.  The night I tried to install it, it wouldn't work and so I called the help line.  I could barely understand the guy who answered and he couldn't understand me to well and he told me I had to be clearer.  I got very frustrated and gave up.  A week later I figured it out by myself.  It has been great as I am really sick of cable.", "verified": true, "helpfulness": "0/0", "author": "Karla Hamilton"}, {"rating": 4.0, "review": "Works as described, however I could not get it to connect to my wireless network while not broadcasting my SSID. I had to broadcast my Network SSID before it would connect. Not a big deal, I just prefer to not advertise my network (although secured) to everyone in the neighborhood. This is the first device I have run into that is unable to connect to a network that is not broadcasted.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "This thing is awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Stacey Jones"}, {"rating": 5.0, "review": "We installed this into our kids room after we cut off our cable. They have Netflix, Amazon Prime, Hulu + and lots of other apps and our kids couldn't be happier about it! The installation and ease of use is extremely easy!", "verified": true, "helpfulness": "0/0", "author": "Tabitha Stanfield"}, {"rating": 5.0, "review": "Buenísimo", "verified": true, "helpfulness": "0/0", "author": "marilin grace salmeron campillo"}, {"rating": 5.0, "review": "Its great", "verified": true, "helpfulness": "0/0", "author": "Aaron Patrick"}, {"rating": 5.0, "review": "Love the firestick...its so easy and convenient to use. I dropped my cable and now just watch prime programming. Great purchase!", "verified": true, "helpfulness": "1/1", "author": "lee cook"}, {"rating": 5.0, "review": "I'm loving it", "verified": true, "helpfulness": "0/0", "author": "Winnie S Whitfield"}, {"rating": 5.0, "review": "Just love it. I dont have cable in the bedroom and I can access plenty of TV to fall asleep too.", "verified": true, "helpfulness": "0/0", "author": "Gail McGaughey"}]