[{"rating": 4.0, "review": "Since I already have a \"smart TV\" to watch most of the time, I decided to get this for my bedroom TV.  Compared to the \"smart TV\", it is little hard to get used to and not as easy to use.  The main screen is different.  But it works beautifully once I figured it out.  My wi-fi is pretty fast, so there is no problem with buffering of downloads.  I couldn't give it 5 stars, because I am hooked on the \"smart TV\", but considering the fantastic price, it is just what I wanted for my 2nd TV.  I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Shar"}, {"rating": 5.0, "review": "Great think to have", "verified": true, "helpfulness": "0/0", "author": "Lawrence J. McPhee"}, {"rating": 5.0, "review": "Love it, one of my best purchases.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Ross"}, {"rating": 5.0, "review": "I'm upset with myself for waiting so long. I jumped on the Chromecast right away and loved it. Worked perfect for my non-smart TV. But this has tons more content available and easy for my whole family to use. I'm buying a second one now.", "verified": true, "helpfulness": "0/0", "author": "venom909"}, {"rating": 5.0, "review": "Really enhances my Amazon prime viewing and also enhances my Netflix streaming usage.It's a bargain...", "verified": true, "helpfulness": "0/0", "author": "rattlefly"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick has been working very well. My complaints are not with the Fire Stick but with the two day late shipping on a Prime Item. I purchased this on Prime Day. It was supposed to arrive on 7/17 but did not arrive until 7/20.", "verified": true, "helpfulness": "0/0", "author": "sunikershaw"}, {"rating": 5.0, "review": "Love it!  Even my mom can work this", "verified": true, "helpfulness": "0/0", "author": "Ann F. Conway"}, {"rating": 4.0, "review": "Pretty good. It loses signal frequently.  Might be due the location of my modem and router. Have had to reboot 40% of the times I have used it so far. Other than that, and that is an inconvenience, it works well.", "verified": true, "helpfulness": "0/0", "author": "Sallie E."}, {"rating": 5.0, "review": "Awesome purchase. So worth it. Multiple movies and shows even UK shows available at little to no cost.", "verified": true, "helpfulness": "0/0", "author": "Cynthia L. Brooke"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "JOHN HINE JR."}]