[{"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Joyce A Munro"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Marci \"Marci\""}, {"rating": 1.0, "review": "It drops the Wi-Fi connection, literally every ten minutes. Once again, Amazon is using early adopters as guinea pigs. This is not as bad as me spending $350 on a Kindle. Thanks Amazon for giving it to me...again.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"csszrr\""}, {"rating": 5.0, "review": "The Fire TV Stick performance exceeds my expectations. Setup was very easy and the picture quality is amazing!", "verified": true, "helpfulness": "0/0", "author": "Dan N. \"Dan\""}, {"rating": 2.0, "review": "Pros:The interface is really aesthetically pleasing,Small and easy to change rooms in the house, or take on the go for travel.Bluetooth remote does not need line of sight to function properly.Cons:Keeps disconnecting from the internet saying \"connection problem\". The device is only 20 ft from a router and all my other electronics have no problem connecting to the internet. Loses several stars for this reason, terrible for trying to watch a couple shows or movies without the hassle of reconnecting the device to the network.Also all the movies available to purchase through Amazon default to purchasing in HD, and it takes a couple of extra steps to purchase the less expensive SD version. (Let's be real Amazon, you make enough money off everyone, there is no need to try and force HD for a couple of dollars more per show.)For now it looks like using the more user friendly PS3 amazon prime app will be the way to go. Especially without needing to reconnect the dang thing all the time to be able to do anything.", "verified": true, "helpfulness": "0/0", "author": "Anthony Mancuso"}, {"rating": 5.0, "review": "Love it!  Just the same as the Fire TV and at half the price.", "verified": true, "helpfulness": "0/0", "author": "Gail Geriak"}, {"rating": 4.0, "review": "has an issue buffering and frequently freezes.", "verified": true, "helpfulness": "0/0", "author": "N. Eggleston \"N. A. E.\""}, {"rating": 5.0, "review": "I preordered 2 of them and I LOVE them!!!  Amazon products are amazing....the interface is simple enough for my father to use, and the content available is plentiful....MIRACAST is the big PLUS there...you can mirror your device's screen if it supports it!", "verified": true, "helpfulness": "0/0", "author": "Mike and Jared"}, {"rating": 5.0, "review": "Amazon Fire TV...in stick form and cheaper!  I got a great deal on per-order making this half off, although I'd pay full price for this.  Setup was a breeze, just like it's big brother the Amazon Fire TV.  Performance for streaming seems to be the same as it's beefier big brother.  I have not played games on it so can't comment there.I like having the smaller package that I can pull and take with me!", "verified": true, "helpfulness": "0/0", "author": "R.J. Gura"}, {"rating": 5.0, "review": "I could not be happier.  WE have the Fire Stick HD that operates by voice for the living room and this less expensive model for the bedroom.  Love the AMAZON Series for TV and Movies better then anything presently on TV or cable.  All you need is a router in your home and away you go.", "verified": true, "helpfulness": "0/0", "author": "Bernie"}]