[{"rating": 5.0, "review": "The family LOVES out Fire TV Stick!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it, Love it, Love it!!! The prime member price was irresistible so I thought I give it a try. Boy, I am so glad to have bought this gadget. It instantly made my dumb TV an internet connected smart TV and I can watch all my Prime movies and shows now on my extra TV in my bonus room. Happy customer here!", "verified": true, "helpfulness": "1/1", "author": "Marcel vdB \"Marcello\""}, {"rating": 5.0, "review": "Love the remote, that is what makes it better than chromecast!", "verified": true, "helpfulness": "1/1", "author": "Amber Lewis"}, {"rating": 5.0, "review": "I plugged the Fire Stick into my TV, connected it to my wireless, and after waiting a minute or two for firmware to update was pleasantly surprised that my user information was already entered by Amazon.  Used the stick to watch a prime movie, and a Netflix show without issue.  Slick product and very responsive.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 5.0, "review": "totally awesome! way exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "kc lichter"}, {"rating": 4.0, "review": "so far its good my daughters love it and watch all their shows on it in there room", "verified": true, "helpfulness": "1/1", "author": "Grandpapa San"}, {"rating": 3.0, "review": "I have both Roku and Chromecast streaming stick and I just got the Fire TV stick.  Right away I had a couple problems with the Fire TV Stick.  I initially plugged it in to my Samsung 20\" LCD.  After the splash screen, I got no picture.  Tried several different things over the course of an hour with no luck.  I then tried another television and it worked.  This is the first HDMI device that did not work with this samsung TV.  Compared with ROKU I found the content quite limited, All of the major content was there(Netflix; hulu; youtube; etc) but there was no where near the content available that was available on the Roku.  Also, unlike the ROKU I hade to use the supplied power dongle.  If I tried plugging the USB into the TVs USB port like I did with the ROKU, I got an error message that the power was not adequate.  I also noticed that the video would get a little choppy compared to the ROKU even though I used it on the same TV in the same location with the same service(HULU).  This was really obvious with the screen mirroring from my android device.  With the ROKU the video was smooth and with the Fire TV Stick it was choppy.  All in all this device is OK and may be preferred for a less techy user.  Adding channels to the ROKU can get a little confusing.  Since this is version 1 of the device, I think that it will improve with later versions.  The chromecast streaming stick is not nearly as good as either the ROKU or the FireTV stick.  Also this device supports WIDI/Miracast. If you have a PC with Windows 8.1 that supports WIDI/Miracast, you will be able to mirror your PC screen to either the FireTV or the ROKU.....However, it seems that PCs that support this intel standard are not readily available.", "verified": true, "helpfulness": "0/0", "author": "pookie"}, {"rating": 3.0, "review": "I ordered 2 of the Fire TV Sticks and although they work ok, it was ALREADY REGISTERED to my amazon account!!  Amazon automatically registers the stick to your account, so BEWARE if you are giving this as a gift.  I had to unregister/deactivate these devices from my account.  Also, this device can only be used when inserted in a side hdmi port (so you can use the remote of course), but my hdmi ports are in the back of my tv.  An hdmi extension is included, but it is too short to bring the stick out from the back of my tv to the front where I can control it.  The extension wire should should be at least 24\".  I have always used the Roku boxes and never the sticks because of the fact that my hdmi ports are located in the back of the tv, but I was able to get the Fire sticks at the sale price of $19.99 and wanted to see how they worked and then give as gifts.  I think its ok! for the price of $19.99, but if I had to spend $40.00 I would stick with the Roku box for $10.00 more and be able to connect to any tv with composite or hdmi ports.", "verified": true, "helpfulness": "0/2", "author": "R. CALIGIURI \"DIYer\""}, {"rating": 5.0, "review": "I am wondering if anyone has used this for the WWE network, and if so, how are you liking it?", "verified": false, "helpfulness": "0/2", "author": "RegularRon"}, {"rating": 5.0, "review": "I have the apple tv, roku stick, ps3, and the chromecast. The Fire Stick beats them all for streaming tv. The UI is more responsive, better designed, then all the listed. Easy to connect to the wifi. With Amazon prime this is the best of the bunch and at a very reasonable price.", "verified": true, "helpfulness": "1/1", "author": "Jarrett S"}]