[{"rating": 5.0, "review": "So much easier than I imagined.  Watching movies in minutes!  Love it.", "verified": true, "helpfulness": "0/0", "author": "Pagosagal"}, {"rating": 3.0, "review": "It's alright", "verified": true, "helpfulness": "0/0", "author": "Cecarrizales"}, {"rating": 2.0, "review": "Amazon's web site states that Fire Stick's can mirror the display of devices running Android 4.2 or higher, (amazon.com/gp/help/customer/display.html?nodeId=201636640).However, I have been unable to get screen mirroring to operate with my Samsung Galaxy S5 (running Android 4.4.4).Both devices see & recognize each other over the network, and they begin the screen mirroring process, but it never completes.Following Amazon's troubleshooting suggestions (http://www.amazon.com/gp/help/customer/display.html?nodeId=201636520) failed to resolve the problem.  Upon contacting Amazon's Technical Support, I was advised that it was a Samsung problem, and I should get in touch with them.Based on this experience, owners of Samsung Android devices may experience difficulties when attempting to use the screen mirroring capabilities of the Fire Stick.Update: I experienced exactly the same problem with the Fire Stick & a Samsung Tab S 10.5, currently running Android Kit Kat 4.4.2.", "verified": true, "helpfulness": "3/4", "author": "DACA"}, {"rating": 5.0, "review": "I like the fire stick its fast and just like it", "verified": true, "helpfulness": "0/0", "author": "Riverfox"}, {"rating": 5.0, "review": "Great product ! Internet tv is just as good as cable! If it wasn't for sports I would cancel my cable ! Being a prime member and netflix subscriber is all you really need!  That being said the fire stuck is awesome !", "verified": true, "helpfulness": "0/0", "author": "PTHS teacher"}, {"rating": 3.0, "review": "I have been using it for a couple of weeks or so I like the speed of it!! As of late the picture freezes but the sound keeps going..that happens a lot...I reset my internet and unplug the fire stick and still nothing...that is the only problem that I'm having!!!", "verified": true, "helpfulness": "0/0", "author": "clifton"}, {"rating": 4.0, "review": "I was a bit nervous after reading reviews of the Fire TV Stick not working on some TVs - but I was worrying for nothing.This was so easy to set up. I am completely non tech-savvy -  and bought my TV in 2007 - but this was very easy to set up. Just connect the stick to the power cord and to the TV  (had to dig out my TV manual to find the HTMI port) and then switch the source.It took a couple of tries for it to connect to the wi-fi but then everything was easy. I was able to easily connect to my Netflix account as well.I will do another review after i have played around with it a bit more - but I am very pleased so far.", "verified": true, "helpfulness": "0/0", "author": "English Mary"}, {"rating": 5.0, "review": "Great piece of electronics. Works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Splash"}, {"rating": 4.0, "review": "need more apps", "verified": true, "helpfulness": "1/1", "author": "heng zou"}, {"rating": 4.0, "review": "It's been very good so far I am very happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "anthony"}]