[{"rating": 5.0, "review": "Works awesome and excited to see if it is useful when travelling as well", "verified": true, "helpfulness": "0/0", "author": "Tyler Z."}, {"rating": 5.0, "review": "awesome love it!", "verified": true, "helpfulness": "0/0", "author": "Valentina Rezk"}, {"rating": 5.0, "review": "It does work for what I paid", "verified": true, "helpfulness": "0/0", "author": "Thanh Le"}, {"rating": 5.0, "review": "I am very satisfied with the Amazon Fire TV Stick.  Setup  was very easy.The only thing I would like to have available is Acorn.  Previously I had one of the other streaming devices but it only lasted 11 months. Acorn was available on that device. Had previously purchased the Fire Stick for my son and he seems to like his quite well.  I do find a lot more to view with the Fire Stick - our cable has really too many sports channels so need  other programs to view. It is so nice that it just plugs into the HDMI port.  Nothing to sit on the furniture.  All in all, Fire Stick has provided nice service.", "verified": true, "helpfulness": "0/0", "author": "Sabrina"}, {"rating": 5.0, "review": "I got this during the Amazon Prime sale and it does exactly what I need.  I wanted to stream shows from Netflix and Amazon to a Sony TV in my basement.  Set up was easy.  I was watching a \"Murder in Paradise\" in just a few minutes.  The longest part was finding the remote for the TV to switch the input to the HDMI that the Fire TV Stick was on.  I was concerned that there would be hicups because the wireless router is on the second floor and the TV is in the basement.  But once started there isn't any obvious buffering or hesitation in any thing I have watched.  I think this is a solid product.  I don't know what else it does or doesn't do, but for my purposes it is great.", "verified": true, "helpfulness": "0/0", "author": "Section 101 \"Section 101 at the Ed\""}, {"rating": 4.0, "review": "As an Amazon Prime member, high praises for the ability to watch Amazon instant Video on the large TV screen.  I did not give five stars because I cannot mirror my IPad.  There seem to be only support for Amazon Fire devices, which is understandable, but also Android, which makes me question why not Apple products.  But overall an excellent value for the price.", "verified": true, "helpfulness": "0/0", "author": "robyn"}, {"rating": 5.0, "review": "It works perfect", "verified": true, "helpfulness": "0/0", "author": "Christian Debolt"}, {"rating": 5.0, "review": "Great compliment to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "swampfish1"}, {"rating": 2.0, "review": "Not worth the money with poorly built equipment.  It's not user friendly when using KODI app.  Too many unwanted apps.", "verified": true, "helpfulness": "0/0", "author": "Sothea Eang"}, {"rating": 5.0, "review": "I love the Fire stick, its sleek, compact, never had a problem with it, Loading and streaming is fast and I have never had a with streaming any video. You can use it for games, apps, videos, movies. Love it. If there was 2 things I would correct, the battery cover on the remote, can be extremely difficult to remove to replace the battery. And the remote itself is so touchy. The slightest touch almost by anything will send you to the fire tv screen, which then  you will have to find your tv remote and change it back to previous setting. Other than that though. I am a big fan. And you cant beat the price really. But I would say, the Fire Stick or Fire TV is only worth it if you are a Amazon Prime Member, because with that you have access to Prime Video and Music.  This is actually my 2nd Fire Stick. Thats how much i like them,", "verified": true, "helpfulness": "0/0", "author": "Christian"}]