[{"rating": 5.0, "review": "I'd been using my computer (an old, slow thing) to watch TV (I don't have cable) on Hulu, Netflix, YouTube, etc., and when the adapter that connected the computer to the TV broke, I started watching shows directly on my computer (small screen!).  Not to mention the other issues that arose when you have a piece of machinery that is simply Not up to par!  I'd seen the commercials for the Amazon Fire Stick and Knew That Is What I Needed!  YEA!  It was simple to set up (you will need your computer to get the start up process going) and it is easy to add more apps to the stick... very similar to what you do with your phone or tablet.  Even easier than adding new \"channels\" to a smart TV, of which I also have.  The Fire Stick remote is very easy to use as there are not tons of buttons you have to figure out and get used to.  I am beyond thrilled with my new toy and for the price it was a steal!  Enjoy!One thing I forgot to mention in my original review... The ScreenSaver that comes on the Fire Stick is AWESOME!  The pictures, of which there may be as many as 50 different ones, are OUTSTANDLY GORGEOUS & STUPENDOUS!!  It was worth the price just for the ScreenSaver pictures alone!  So, All in All, the whole package is a GR8 Deal!  Happy Watching~", "verified": true, "helpfulness": "0/0", "author": "FairyKat \"Fairy Kat\""}, {"rating": 4.0, "review": "Nice device, works well  and portable.", "verified": true, "helpfulness": "0/0", "author": "Ron F. Reed \"fritz\""}, {"rating": 5.0, "review": "I love my new fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Nathan Keelen"}, {"rating": 4.0, "review": "Works great and was easy to set up.  The only trouble I had was getting the back off to insert the batteries.", "verified": true, "helpfulness": "0/0", "author": "Rosanna Palmer"}, {"rating": 5.0, "review": "We love love love the Amazon fire stick. It works great, it is easy to use, and there is not a lot of boxes or bulk to it, which I love.!", "verified": true, "helpfulness": "0/0", "author": "BLM516"}, {"rating": 3.0, "review": "I was excited about getting the Fire Stick, but in the middle of watching my first show on Netflix, it buffered at 25% for at least 20 minutes, before I got frustrated and decided to just turn it off. I thought Hulu was one of the apps already on the fire stick, but apparently not because I could not locate it anywhere after going through all of the apps. It was a nice idea in the beginning, but with the consistent buffering and not being able to watch certain shows on different apps without purchasing them, just does not work for me.", "verified": true, "helpfulness": "0/0", "author": "TF7777"}, {"rating": 4.0, "review": "Very easy to install and use.  Easier than the usual remote.", "verified": true, "helpfulness": "0/0", "author": "TH \"TH\""}, {"rating": 5.0, "review": "Awesome but it needs tnt app", "verified": true, "helpfulness": "0/0", "author": "Phillip Hightower"}, {"rating": 5.0, "review": "It was easy to set up but I had a little glitch but I called Amazon and the person on the phone was great and walked me thru the glitch and it works perfectly now and so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jolene McKee"}, {"rating": 5.0, "review": "With Amazon Prime, we get to watch a lot of great shows and we can watch them when we want. Only a few commercials in a couple of channels. We love it!", "verified": true, "helpfulness": "0/0", "author": "Tarilyn Montague"}]