[{"rating": 5.0, "review": "I love it! I the way to canceling Comcast!", "verified": true, "helpfulness": "0/0", "author": "Jayne"}, {"rating": 5.0, "review": "This works better and faster than my Smart TV, Delivery was fast even at the holiday rush. Very pleased and worth the money, now we can watch Amazon Prime without buffering and enjoy the shows.", "verified": true, "helpfulness": "0/0", "author": "Michael Siedler"}, {"rating": 5.0, "review": "Easy to install.  Easy to use.  Programs better, in my opinion, than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Christine Cash"}, {"rating": 3.0, "review": "fairly new to this devise and so far in terms of its display quality for streaming quality I would probably rate a fourhowever I'm a little disappointed that there was nothing in the explanations that the apps you have to download I discovered that I had him to call service additionally there was no informationadvised me that it would not stream or mirror with all my Android devices", "verified": true, "helpfulness": "0/0", "author": "Charles E. DaVis"}, {"rating": 5.0, "review": "Easy to use...easy to set up. Not sure how it knew who I was but booted up to my name and movie choices.", "verified": true, "helpfulness": "0/0", "author": "J. Walker"}, {"rating": 5.0, "review": "Excellent device....easy to set up, works as advertised and has great content. A sure winner.", "verified": false, "helpfulness": "0/0", "author": "ezflyer13"}, {"rating": 5.0, "review": "We've had several roku's but the fire stick is amazing! My husband love's it. It's so easy to use and find movies when nothing is on regular TV. We haven't even used the other features but are very happy with the purchase just for movies!", "verified": true, "helpfulness": "0/0", "author": "Sggett \"Sggett\""}, {"rating": 4.0, "review": "Excellent product with a great price.  Definitely the choice if you are looking for an inexpensive media streamer.  The Stick is very small and unobtrusive; plug it into an HDMI port on your TV and you will hardly even notice it is there.  It is very fast and has excellent video; no lag at all.  However, I have noticed some issues with the audio skipping/cutting out.  This was especially bad when I first started using the unit and there was also some loud buzzing; with continued use this has gone away and it is now hardly noticeable.  Also, the remote control is a bit small and difficult to use; you will have to get used to that.  If these issues sound like too much to you, you may want to consider paying more for the full size (and more powerful) Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "PS Player \"Al\""}, {"rating": 5.0, "review": "This is a great little device.  I use mine for Prime Video/Music, Netflix, Pandora, and some games with the kids.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "Easy to use and navigate even for those of us that are tech phobics!", "verified": true, "helpfulness": "0/0", "author": "Lynn Austin"}]