[{"rating": 4.0, "review": "A little tricky to install, but it works well.", "verified": true, "helpfulness": "0/0", "author": "Clyde Selleck"}, {"rating": 5.0, "review": "Awesomw", "verified": true, "helpfulness": "0/0", "author": "johanna perdomo"}, {"rating": 4.0, "review": "Works great.  And I especially like the 'Watch ESPN' and Fox News apps.", "verified": true, "helpfulness": "0/0", "author": "john e moss"}, {"rating": 5.0, "review": "Works great. With this, Apple TV, and indoor antenna, I have cut the cable bill to internet only service.", "verified": true, "helpfulness": "0/0", "author": "William G Huitt"}, {"rating": 5.0, "review": "Great way to watch TV.  Easy to use.  Very user friendly.  Love all the free apps available and the Amazon originals available on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Addie"}, {"rating": 5.0, "review": "Very easy to install.  If anyone has trouble connecting to their wireless.  Turn off you modem and restart it.  Using the Fire stick is a breeze. I wish I would have waited a little longer  for HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "I love this!! It's so easy to use. We also have an Apple TV as well which is in the front room where we don't run a cable box. We put this in the main living room and it's so much easier for me to navigate!! All I have to do is hit the home button and BOOM there it is. It's kinda like a Droid vs iPhone in my opinion when comparing Fire Stick to Apple TV navigation. I can easily locate what I am looking for in shows, NextFlix etc. The Original Series have been pretty good. I really like Catastrophe and I hope more episodes come out soon!!! HILARIOUS!My only CON:When viewing a series, you have to locate the seasons individually. Unlike Netflix where you can click to find more seasons and flip between those. It would be nice to be able to roll into the next season rather than having to look for it. Sometimes I am not sure how many seasons something is so it's nice to be able to see all of that at once instead of wasting time searching for something.", "verified": true, "helpfulness": "0/0", "author": "Danielle Joyce"}, {"rating": 5.0, "review": "I just got it yesterday and I'm very impressed.  I've been a programmer for over 30 years, so I know a lot about the perils of \"set up\" programs.  This is the very best I've ever encountered.  Bravo to all the folks who worked on it!", "verified": true, "helpfulness": "0/0", "author": "Gregory Peterson \"The professor\""}, {"rating": 4.0, "review": "Like Ithis but sometimes lags a bit", "verified": true, "helpfulness": "0/0", "author": "Eugene Gonzales"}, {"rating": 5.0, "review": "Great product.  Very easy to use and set-up was also easy.  The only problem I had was opening the remote to install batteries.  I watched the video but my thumbs were not strong enough; I had to get help.", "verified": true, "helpfulness": "0/0", "author": "Daisy J. \"Daisy J. Flores\""}]