[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Cynthia Paternostro"}, {"rating": 5.0, "review": "it works great", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 3.0, "review": "I HAVEN'T USED IT MUCH, SIMPLY BECAUSE I HAVE NOT HAD THE TIME.  THIS IS PROBABLY NOT A TRUE RATING.", "verified": true, "helpfulness": "0/1", "author": "dorothy"}, {"rating": 4.0, "review": "I'm watching it right now. Doesn't seem to be any lag. Setup was easy. I even downloaded the fire TV app to my smartphone and iPad. The app can use voice control. Only problem I see is that it needs power and the power cord may not be long enough to get to an outlet.", "verified": true, "helpfulness": "0/0", "author": "Mamacita"}, {"rating": 5.0, "review": "It could not be easier - great product", "verified": true, "helpfulness": "0/0", "author": "Sam Turner"}, {"rating": 4.0, "review": "works well if the buddy app worked would give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Ami Dinsmore"}, {"rating": 5.0, "review": "Very easy to install and excellent streaming. I wish I had known about this before I purchased my Sony wireless LAN with built-in Wi-Fi Blu-ray Disc/dvd player.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Shelia A Gray"}, {"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "nicole fleming"}, {"rating": 5.0, "review": "works great. I highly enjoy it", "verified": true, "helpfulness": "0/0", "author": "Jason Rowe"}, {"rating": 4.0, "review": "If only it would do VUDU and allow purchased videos in Youtube then I could replace all my other streaming devices in my family room.  To be fair it wasn't advertised to do this and it does well at what it is supposed to do.  Faster than most other devices that do streaming apps (like DVD players and TVs in particular).  People ask how it compares to Chromecast - they are really not exactly the same device.  This is a bit easier to use in some ways and if you are an Amazon + Netflix person that doesn't have a burning desire to send things from your multiple different types of devices you will be very happy with this.  You can supposedly send stuff from Android devices like casting in Chromecast but I can't verify that.The remote is simple and functional.  It seemed to be taking commands from my multifunction remote as well which I will need to explore further in my efforts to reduce the remote clutter in my house.", "verified": true, "helpfulness": "0/0", "author": "Clostridium"}]