[{"rating": 5.0, "review": "This is a perfect fix if you are not wanting to have cable on extras TV's.  We use this in both of the bedrooms which we normally don't watch much anyway.  The grandsons love to lay on the bed and play games.  In fact we just ordered a fire gaming controller.  Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Marti Powell"}, {"rating": 5.0, "review": "It's was a good purchase for me because,  I can choose what I want to watch, when I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Brenda Jones"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Janet Berry"}, {"rating": 2.0, "review": "I like this because the price is great. However it glitches out a lot. The sounds and video get messed up and you have to reset it which can be annoying.", "verified": true, "helpfulness": "1/1", "author": "Haley"}, {"rating": 5.0, "review": "I am using this stick more than Apple TV because with Prime there are more shows available. The quality of the product is not as well constructed as Apple but cost is less.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 4.0, "review": "So far we love this product. Very light and easy to use. Before this we had a roku. I think the roku had a better outlay but it also broke. The firestick doesn't have as many apps and options as the roku.", "verified": true, "helpfulness": "0/0", "author": "Ashdro"}, {"rating": 2.0, "review": "Had to reprogram Wi-Fi every time i to use it", "verified": true, "helpfulness": "0/0", "author": "shawn"}, {"rating": 3.0, "review": "It is fine at what it does but if you have a Roku you do not need it.", "verified": true, "helpfulness": "0/0", "author": "John K. Russell"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Robin Zimmerman"}, {"rating": 5.0, "review": "We love the fire stick!  I can't believe we waited so long to get it!  It is super convenient and my kids love being able to watch D*sney channel again with the Sling TV app.  We've been without cable just over a year because who wants to spend $80+ a month on tv.. This is so much better especially with Prime.", "verified": true, "helpfulness": "0/0", "author": "Jennifer H"}]