[{"rating": 4.0, "review": "Great product. Setup was a little wierd. I couldnt connect to a hidden network manually. It kept rebooting->asking to select network (did that for atleast 10 times)->applies some update->Reboot (for 10 times)..Then finally worked after I selected an visible network.I dont see any stammering issues that I saw with ChromeCast. The screen mirroring didnt work with Samsung S3 running Kit Kat. When I go to mirroring section, the remote app disconnects the device.", "verified": true, "helpfulness": "1/2", "author": "A Natarajan"}, {"rating": 5.0, "review": "After my initial review I contacted Amazon. A very helpful employee worked with me and first got the device to realize it was no longer 1970 and then I proceeded to download the update. After about two hours without progress, I rebooted the Firestick and the download /install happened quickluy. The update cured whatever was wrong so I can now give it 5 stars. If you have connection problem go to Home>Settings>System>check for Updates. If there is one, get it.Doesn't stay connected to my WiFi. I tried with two TVs, both within 8 feet of router (open room): the FireStick found and connected with the network but after I entered the PW signal was lost within 2 minutes - repeatedly. As a test, I checked the signal with two tables: a Nexus 7 and Kindle Fire. Both showed excellent signal and did not drop the connection.Nice concept and I hope the replacement model works better.", "verified": true, "helpfulness": "9/18", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Original promotional material advertised support for iOS, on release does not actually support iOS.  The only reason I preordered one was the advertised support for iOS.  Waste of my money and time.", "verified": true, "helpfulness": "5/27", "author": "Adam Combs"}, {"rating": 5.0, "review": "UPDATE 2/26/2015:  This has been rock solid since I set it up in November.  Have not had to do any more resets.Setup is easy.  You do have to put in your password for your Wi-Fi network & then the stick does a software update.  My internet connection is not very fast & perhaps the Amazon servers were being hammered so this took about 20 minutes.  It was not doing the software update so I also needed to do a reset by pressing/holding the \"Select\" & \"Play\" buttons on the remote for 5 seconds.  Then everything was smooth sailing.I was soon streaming a movie & it did not have any glitching/loading problems throughout the entire movie.  I took it to other TVs in the house & it worked great on all of them.Netflix worked great.  You just need to quickly download the App - it prompts you & then put in your Netflix password.  I did not have to repeat adding passwords after the first time setting it up.  I could take the stick to other TVs with no problem.The remote is responsive & easy to use.  It does not need to be in line of sight to the TV.  The included remote does NOT have voice search but you can download the APP to use on your smartphone or buy the voice remote for the fire.In the box you will get everything you need to use this, including the cables, wall power plug, remote w/batteries  & an HDMI extender cable which I need for one of my TV's because the auxiliary speakers are in the way of the HDMI port.", "verified": true, "helpfulness": "23/29", "author": "Katawampas"}, {"rating": 5.0, "review": "The best value of Set top box device on the market! It uses same Android 4.x system as Fire TV, so you can easily enable adb debug option and using adbfire to connect to it and loads tons of apk apps that designed for TV, fantastic!!! Can't explain how much I love it.", "verified": true, "helpfulness": "0/1", "author": "Win Tsa"}, {"rating": 4.0, "review": "The Fire Stick comes in similar packaging to the other Fire devices. I decided to pick up two of these at the prime price they had and I'm very happy with the value. The device feels nice (not that you'll spend a lot of time handling it) and it's relatively easy to setup. That being said, why, why did I need to type in my password after the system updates? Not terrible but inconvenient. I didn't have to do that with my Fire TV. Also, was it not possible for Amazon to allow us to skip past the tutorial video? I have several Amazon products, I know how to use thing device. I pressed all of the buttons to skip the video and I ended up backing myself all the way back to having to enter my network password again (only two taps of the back button to get there from the Tutorial video). After entering my password a third time I sat through the video...Overall, good value and a good device. Nothing groundbreaking here but the setup process could use an option for skipping the tutorial video and someone should make it so I don't back all the way over to typing in my password again. And even if it does, it should not have asked me to type in the password a third time since I had already provided the device with valid credentials; it should have remembered.The RemoteThe control feels a little stiff but Ill chalk that up to it being new. Definitely a step down from the Fire TV remote but at $40 I can't complain. Also, there's a short delay in the device reacting after pressing a button if you don't use the remote for a while. It's about a second long but it's manageableThe AdI didn't know that there would be an add at the top of the UI when I purchased the device. It's not terribly obtrusive but it's also not there on my Fire TV.", "verified": true, "helpfulness": "4/7", "author": "Melvin Soriano"}, {"rating": 5.0, "review": "Very easy to set up, and operate.  Watched an HD movie without any hiccup.  Awesome device!", "verified": true, "helpfulness": "0/1", "author": "Frank Silver"}, {"rating": 5.0, "review": "Got it yesterday and was streaming in a matter of a few minutes. I have a Roku stick but I like this one ALOT better. The only downside was the fact that it needs to be plugged into the adapter for maximum performance which isn't a big deal really. I got it when it was on sale for $19 (bought 2 of them) and I must say you're not going to find a better deal out there. If you're new to streaming media or you want to cut the cable/satellite cord then buy this little guy and become a \"Prime Member\" and you'll be all set. One last thing...uploading pictures and videos to the Amazon Cloud so you can see them on your tv using this stick is gonna be fun at parties. I took a quick video and within a couple of minutes I was watching it on my tv...pretty cool!!", "verified": true, "helpfulness": "3/5", "author": "Johnny Wolf"}, {"rating": 5.0, "review": "I was fortunate to order one of these as soon as it was announced.  As an Amazon Prime member, I was able to buy the Fire TV Stick for $19 during a two day sale.  I figured, for that price, I might as well test it out!Set up was easy and straight forward.  I find that the interface is quick and easy to use.  The interface and streaming on the Stick is much faster than the Amazon app built into my HDTV.  This fact alone made this a great purchase. Here are some more thoughts I have on the Fire TV Stick so far:✔ PROS:- Quick, easy to use, polished interface- Wireless streaming works really well- Amazon Instant video loads, fast forwards, and rewinds really fast- A dedicated Prime Menu allows Prime members to easily see what free content is available- Unlike Chromecast, the Fire TV Stick includes a remote- Can stream your own videos by first uploading them to your cloud disk- Can play quite a few casual games- Awesome, irresistible price for Amazon Prime users. I got it for $19 during the two day sale.- Better specs than Chromecast and Roku Stick- Ultraportable.  I plan to use Fire TV Stick when I travel for work and to visit family- Stream local videos and other content using the Plex app http://www.amazon.com/Plex-Inc/dp/B004Y1WCDE/ (Thanks BikeRider!)✔ CONS:- Included remote doesn't support voice search.  That remote costs extra.  Would be nice to have a second Fire TV Stick model that includes the voice search remote, rather can requiring us to buy a second remote.- Probably won't be able to use universal remotes with this unless Logitech offers a compatible device.- Not as fast as Fire TV, but since the Stick is so much cheaper, this is not really an issue.- Limited compatibility with older Android devices.✔ OTHER- Arrived associated with my Amazon account.  You can change this of course.  Just keep this in mind if you are sending the Fire TV Stick as a gift.- Unlike the Chromecast, the Fire TV Stick may complain if you connect its power port to a USB port on your TV instead of using the included AC power brick.- Setup will take 15 to 20 minutes- Would be nice if this thing was compatible with the Fire Keyboard: http://www.amazon.com/review/R1DFOMPMA8NG4V/✔ AMAZON FIRE TV STICK vs CHROMECASTChromecast is cheaper these days.  It's a very capable device. It currently has a few notable content sources that Fire TV Stick doesn't have, including HBO Go and Sling Player.  It doesn't have a remote and I find the user interface to be a little clunky.Amazon Fire TV Stick has a remote and a very quick and easy to use interface.  Your non-technically inclined family members will find the Fire TV Stick easier to use than the Chromecast.  If you have Amazon Prime, it's a no brainer.  Chose the Stick over the Chromecast.✔ AMAZON FIRE TV STICK vs FIRE TVThe Fire TV is faster, includes voice search, has more RAM, has more storage, has an Ethernet port, and can play more games.  It's also more expensive (although there are discounts on them all the time).The Fire TV Stick is more portable.  It's also a lot cheaper, especially if you are an Amazon Prime member and got the initial $19 price.If you can afford to the Fire TV, get that.  Otherwise the Fire TV Stick is a great alternative.  I plan to own both. :-)✔ BOTTOM LINEI really like the Amazon Fire TV Stick.  At only $19 for Amazon Prime members (during the 2 day sale), I REALLY, REALLY LIKE Fire TV Stick.Its interface is faster and easier to use than my HDTV's built-in Amazon app, plus it includes a lot more video sources.  It's really the best way to view your Amazon content on a TV.The interesting thing is, Fire TV Stick has convinced me to buy the more expensive Fire TV too.  I want to have the voice search and the faster interface on my main HDTV.  I plan to take the Fire Stick with me when I travel for work or travel to visit family.For Amazon Prime members, and for anyone that has a few Amazon movie/TV purchases, the both the Fire TV and the Fire TV Stick are must have devices and great stocking stuffers for this Christmas.✔ FREQUENTLY ASKED QUESTIONSQ: Where can I find the Fire TV Stick in stock?A: If Amazon doesn't have it in stock, try your local Staples or Best Buy.  You may be able to check their websites to view local inventory.Q: Do I have to pay extra for Netflix?A: Yes.  You must have an existing Netflix subscription in order to view Netflix content on your Fire TV Stick.  In general, if you normally have to pay a subscription to access a streaming service, that subscription is required in order for you to stream content via the Fire TV Stick.Q: Do I need Amazon Prime to use the Fire TV Stick?A: No. Amazon Prime is not required to use Fire TV Stick.  You can access Netflix, Hulu Plus, and even your Amazon Instant Video purchases, all without having an Amazon Prime subscription.Q: What is the advantage of having an Amazon Prime subscription with the Fire TV Stick?A: Amazon Prime give you unlimited access to over 40,000 movies and TV shows, including access to a large selection of HBO shows.  You also get access to Prime Music, as well as unlimited cloud storage for your photos.  You also get free two-day shipping, as well as the ability to earn credits for purchasing books, movies, and music.Q: Can I watch live ESPN broadcasts for free using Fire TV Stick?A: To access live ESPN broadcasts via your Fire TV Stick, you must already have access to ESPN through an existing cable TV subscription. The providers below offer access to WatchESPN live video:- AT&T; U-verse- Bright House Networks- Charter- Comcast XFINITY- Cox- DISH- Google Fiber- Midcontinent Communications- Optimum- Time Warner Cable- Verizon FiOS TVQ: Is the Fire TV Stick compatible with HBO GO?A: HBO GO will be available for Fire TV Stick in Spring 2015.  HBO GO is currently available for the Fire TV box.Q: Is a \"Smart TV\" required to use Fire TV Stick?A: No.  Any TV with an available HDMI port will work.Q: Can the Fire TV Stick play games?A: Yes.  Please note however that the Fire TV Stick doesn't play all Android games.  It doesn't even play all the games that can run on the Fire TV box.  Also note that some games require an optional game controller.Q: Can I use a universal remote control with the Fire TV Stick, such as a Logitech remote?A: IR based remote controls do not work with the Fire TV Stick.  However, Logitech's Harmony Hub and Harmony Home products are compatible with both Fire TV and Fire TV Stick.  For more details, google \"Harmony experience with Amazon Fire TV and Fire TV Stick\".Q: Can I use my TV's USB port to power the Fire TV Stick?A: The Fire TV Stick requires an amount of power usually not provided in standard USB ports.  The included USB cable and AC adapter definitely works, of course.  An AC powered USB hub may work.  A USB port on your TV or other equipment probably will not work.Q: Will the Fire TV Stick continue to work if I switch TVs?A: Yes.  You can use the Fire TV Stick on any HDMI equipped TV in your home.  You can also use it when you are away from home.Q: Can I use the Fire TV Stick in a hotel room, using hotel Wi-Fi?A: The hotel room TV requires an accessible HDMI port, of course.  If in order to access your hotel's Wi-Fi network you must first access a special web page to log in, this functionality is coming soon to the Fire TV Stick but not yet available (as of 12/18/2014).Q: Can I access the Fire TV Stick from my audio/visual receiver (AVR)?A: I haven't personally tested this but I believe it should work.  Your AVR must have an available HDMI port of course.Q: Can I stream content from my local computers to my Fire TV Stick?A: Yes, using the Plex app.Q: Can I view Ultraviolet (UV) movies on my Fire TV Stick?A: At least one person (B. Brown of Oregon) reports that you can watch Ultraviolet movies using the Flixster app.  I haven't personally tried it.Q: How do I turn the Fire TV Stick off?A: You don't have to turn the Fire TV Stick off.  It goes to sleep after a period of inactivity.  If you want to put it to sleep anyway, go to settings > system menu > click sleep. (Thx Selden Deemer)Q: How do I open the remote to insert the batteries?A: In the middle of the back of the remote, there is a small rectangle. Right next to it, there's the edge where the battery cover and the rest of the remote meets. Place your thumb on the rectangle and, with a little force, move the rectangle away from the edge. The cover should come off easily. Hope this helps!Q: Can I block family members from making purchases using the Fire TV Stick?A: Yes.  You can enable a feature that requires a PIN number to be entered before purchases can be made.*** If you like this review, please mark this review as helpful!  Also, feel free to ask me questions about the Fire TV Stick! ***", "verified": true, "helpfulness": "16/037", "author": "Quentin Moore \"The Tech Ranker\""}, {"rating": 3.0, "review": "My Roku 2 XS was getting fussy, and there were a number of options at my fingertips when deciding on its replacement. Ultimately I bought the Fire TV stick because of its early preorder discount price, and right away I'm noticing differences between this and my old Roku. Both good and bad.I'll start with a pet peeve. With my nearly 3 year old Roku XS, when I download a channel for which I have a registered account, to set up on the box it would display a short code of about 5 digits, give me a website to go to, enter the code, and everything worked. On this considerably newer and more powerful device, though, I have to enter email addresses and passwords, and if you're like me and use password generators to make long and difficult passwords, entering these for every app is quite a chore.Second, the available app library is SO MUCH smaller than the Roku's. It's got Netflix and Plex, my favorites, but many old favorites are missing. Crunchyroll, MLS, HBO Go, and so on are nowhere to be foundGetting those two problems out of the way, I love the speed, it seems much snappier than my Roku 2.But ultimately...its issues with ease of use and library size mean this is merely going to be a stopgap device for me until either a Roku 4 or a new Apple TV. I would recommend waiting, unless you only ever plan on using Netflix, Hulu, Plex, etc. And you don't mind taking a year to enter your passwords...", "verified": true, "helpfulness": "3/6", "author": "Zack"}]