[{"rating": 5.0, "review": "LOVE IT LOVE IT LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Susan Sagarin"}, {"rating": 4.0, "review": "I used to have a couple of media streaming boxes (the early ones), including a Seagate, a Western Digital, and a Sony Bluray player that streamed. The first two didn't stream Amazon and the Blu-Ray player was slow and always buffering. My kid mentioned the Fire Stick, so I tried it out and absolutely love this thing. So far, no issues with buffering and load times are pretty quick. Only thing I wished is the ability to use Bluetooth headphones (hence the 4 instead of 5 stars). I would highly recommend this for people looking at streaming players to hook up to their TV.", "verified": true, "helpfulness": "0/0", "author": "Bui"}, {"rating": 3.0, "review": "I'm enjoying this purchase with one exception.  The audio is unpredicable and I'm uncertain if it's a TV issue or a Fire Stick issue.  I have to turn the volume to nearly the highest level to hear conversations.  If/when there are sound effects the volume changes and is blasting loud.  I'm not pleased about having to watch a movie with my remote in my hand to constantly adjust volume.", "verified": true, "helpfulness": "0/0", "author": "MKG97 \"Marcia\""}, {"rating": 4.0, "review": "Interface seems a little sluggish, but it works and has support for all the major things a chromecast can do. Controller is very nice to have as well.", "verified": true, "helpfulness": "0/0", "author": "Calvin M Siemandel"}, {"rating": 5.0, "review": "It was so easy that it seemed too complicated!  It seemed like there had to be more to the directions than what was sent.  There wasn't.  It really is as easy as indicated from the description.", "verified": true, "helpfulness": "0/0", "author": "CMBeachMum"}, {"rating": 5.0, "review": "so simple yet so powerful. everyone without a smart tv should have one.", "verified": true, "helpfulness": "0/0", "author": "jmal"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Michael R Brook"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Shantiera"}, {"rating": 5.0, "review": "Very happy with the purchase of this Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Steve W"}, {"rating": 5.0, "review": "Works fantastic! Exactly what we needed for our extra TV.  No need to buy another cable box! So easy to use, even for my kids.", "verified": true, "helpfulness": "0/0", "author": "Taryn Young"}]