[{"rating": 1.0, "review": "Everything I can find that I would like to watch, mostly old movies all have to be paid to watch and others you actually have to buy. Don't waste your time and money!", "verified": true, "helpfulness": "0/0", "author": "Richard Elenbaas"}, {"rating": 3.0, "review": "With the advertised dual processor, I found this device to be slightly inferior to the Roku.  I have an old version of Roku that I purchased 2-3 yrs ago.  That older version Roku is still superior to this Fire TV Stick.  While watching streaming TV on SLING TV on the Fire Stick, the video was slightly blurred.  It was a decent picture, but not all that sharp.  Sometimes the audio lagged a little bit behind the video and the scrolling new at the bottom of CNN was scrolling very jerky.  I have Charter High Speed internet and it's pretty fast at 60MPS.  The Roku plays everything flawlessly.  The video and audio is sharp and precise.  I only purchased this device because I thought it was nice to have it hidden in the HDMI connection behind the TV rather than a small box sitting on the TV stand (Roku).  There seems to be more usable APPS on the Roku than the Fire TV Stick.  I will admit that I've not fully investigated ALL of the Fire TV Stick's APPS.  I do enjoy the games that comes with the Fire TV Stick.  But, that's about it.  Huluplus video is does not appear to be in High Def on the Fire TV Stick.  So, in closing, it's worth the $20 I paid for it but if you want the best picture quality and selections, I would go for Roku's newer version that also has a dual processor built in.  I bet that one really is nice!", "verified": true, "helpfulness": "0/0", "author": "Dennis Barker"}, {"rating": 3.0, "review": "I do nt  but every time  I each something  get freeze I have to umploget  and plug it back in again and I want returned  back", "verified": true, "helpfulness": "0/0", "author": "moises"}, {"rating": 5.0, "review": "We bought the Fire TV Stick as a trial to see if we could live without cable.  If we liked it we intended to get the Fire TV for our main TV and move our Stick to a secondary TV.  Well, we love our Stick and our subscription services.  We certainly don't have the fastest internet ever (I think it's around 4 mbps?) but we rarely have issues with buffering while watching shows or movies.  We officially cancelled our cable today and plan to buy another Stick (for our secondary tv) instead of Fire TV because we don't see any need to pay more when we're happy with what we get from the Stick!", "verified": true, "helpfulness": "0/0", "author": "Laura B"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Anita J Williams"}, {"rating": 5.0, "review": "Plugged it in and went through the tutorial, worked perfect. We love this thing.", "verified": true, "helpfulness": "0/0", "author": "Tom Wierenga"}, {"rating": 5.0, "review": "I never thought I could get so much out such a small package. Works every time. We hardly ever watch live TV anymore.", "verified": true, "helpfulness": "0/0", "author": "Lee Inman"}, {"rating": 2.0, "review": "Love the idea but very buggy. The signal often blacks out for a few seconds resulting in no sound or video for several seconds while the show (Netflix/Hulu) continues. Very annoying and sometimes unbearable. She otherwise device is great", "verified": true, "helpfulness": "0/0", "author": "Vikash Gayah"}, {"rating": 5.0, "review": "I absolutely love it!!! Meets our family programming needs and its half the cost of our previouse cable TV package.", "verified": true, "helpfulness": "0/0", "author": "Ana Vila"}, {"rating": 5.0, "review": "Love this. Easy to connect and control. Have all our favorites in one place.", "verified": true, "helpfulness": "0/0", "author": "naniroxlv"}]