[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Matthew Carucci"}, {"rating": 5.0, "review": "Works perfectly!!!!", "verified": true, "helpfulness": "0/0", "author": "Gregory B."}, {"rating": 2.0, "review": "it needs a high internet speed to operate, is only two languages ​​does not include the Spanish", "verified": true, "helpfulness": "0/0", "author": "Jhonny"}, {"rating": 5.0, "review": "We like it a lot it hooked us with netflix and prime", "verified": true, "helpfulness": "0/0", "author": "Sabrina Gipson"}, {"rating": 2.0, "review": "I hesitate to critisize at this point because I am not an expert in electronics.  So far I have yet to see any6 benefit in using Firestick, but it may be just my ineptness.  I will keep trying.", "verified": true, "helpfulness": "0/0", "author": "Charles A. Hird \"Izaak\""}, {"rating": 5.0, "review": "Easy to set up and works perfectly. I have roku, Amazon Fire TV box, and Apple TV and Amazon was my favorite. The stick works just as well as the box. Love it", "verified": true, "helpfulness": "0/0", "author": "Joanna Bianco"}, {"rating": 2.0, "review": "Sadly I have yet to watch an entire hour of television via Netflix without the feed dropping. Confusingly enough, the error message reads that I 'may not be connected to the internet,' yet when I check the setting on my Stick it reads as connected with 'very good' signal strength. I end up having to reset the Stick to continue to stream.I'll keep it for another week, but if it continues to be a problem it will go back.", "verified": true, "helpfulness": "0/0", "author": "Stephen R. Peluso"}, {"rating": 4.0, "review": "It is a very fine product. I like it's quality and performance. The only thing is when using the slingbox app instead of a copy of the controller on screen like other apps it has a somewhat cumbersome system to go through. Even though it is a good system.", "verified": true, "helpfulness": "0/0", "author": "Steve Twain \"happy camper\""}, {"rating": 5.0, "review": "Best gadget that I brought this year!!!", "verified": true, "helpfulness": "0/0", "author": "Joao Batista Mendes Neto"}, {"rating": 5.0, "review": "We can get rid of our cable bill!", "verified": true, "helpfulness": "0/0", "author": "Denise Grogan"}]