[{"rating": 5.0, "review": "It works as described. Faster when buffering than roku. Was having issues in beginning would not ask me for my Netflix account information. Was ready to return. Plugged it in, in morning and it was working properly. Worth the money. I like it. Needed something in kitchen cutting cord from cable company.", "verified": true, "helpfulness": "0/1", "author": "EA"}, {"rating": 1.0, "review": "Seriously - if I had known Netflix didn't work (though it is advertised as one of the apps) I wolud never have ordered this!  Pretty sure I will be returning! What a huge disappointment!", "verified": true, "helpfulness": "0/1", "author": "Doreen Wolf"}, {"rating": 5.0, "review": "I luv it. Works great.", "verified": true, "helpfulness": "0/0", "author": "James K."}, {"rating": 5.0, "review": "This was probably the best buy I have made in a long time. Easy to install and operate & many movies and TV programs to choose from.  Very, Very Satisfied!!", "verified": true, "helpfulness": "0/0", "author": "Dottie Brumback"}, {"rating": 4.0, "review": "For someone very low tech, this was very simple to install and I had no issues setting it up. I purchased it about a month now and so far, have no issues. I wish the remote was bigger.", "verified": true, "helpfulness": "0/0", "author": "Martha Plascencia"}, {"rating": 4.0, "review": "I bought this for my parents who are in their 80's. I also bought the voice remote. They are not tech wizards and this is an easy product to use.", "verified": true, "helpfulness": "0/0", "author": "Sandy Self"}, {"rating": 5.0, "review": "This is great. Very happy very easy to use", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love it, finding more stuff on it every day!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I wish I had known about this sooner. Fantastic product!!!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Piggott"}, {"rating": 5.0, "review": "This was a Christmas gift and it's just awesome.  Would recommend this to anyone.  It's so much fun to watch old movies and new movies and your favorite TV programs without a pause from Season 1 to whatever.  It was so easy to setup with Amazon on the phone to guide me through it.", "verified": true, "helpfulness": "0/0", "author": "Salsa \"Salsa\""}]