[{"rating": 1.0, "review": "I bought the Amazon stick and I was under the impression that I can download Apps on it freely, unfortunately, this is not the case as downloading apps is very restricted to Amazon store which is kind of limited compared to google and apple.The other major problem for me which rendered the stick useless is that I am unable to download any VPN app in order to enable me stream Netflix and others which are restricted in Qatar. Also I want to know how to download google chrome on it?It would be really helpful if someone could advise me as to how to overcome these issues which are preventing me from enjoy my Amazon Stick.RegardsAhmed", "verified": true, "helpfulness": "0/0", "author": "Ahmed"}, {"rating": 5.0, "review": "The Fire Stick installs easily and turns any TV into a smart tv. Better than Chromecast and cheaper to boot.", "verified": true, "helpfulness": "0/0", "author": "Donald Morris"}, {"rating": 1.0, "review": "Nothing but trouble with these", "verified": true, "helpfulness": "0/0", "author": "Melvin Shepherd"}, {"rating": 5.0, "review": "I purchased this for my bedroom TV. I have a Roku on my main TV and use it so much, I wanted something for my bedroom. I don't watch live TV much any more, I prefer to stream. This was very easy to set up, easy to use, compact to travel with, all around convenient. For my purpose of watching TV in my bedroom before I go to sleep, this is awesome. So far, no issues. However, I haven't used it for hours of streaming yet to review it's functionality.", "verified": true, "helpfulness": "0/0", "author": "KC"}, {"rating": 4.0, "review": "My fire tv stick is always needing to be reset.  The network connection either goes out or it says that it is connected with problems.  This means you have to manually turn off your network, WiFi, and 're enter your password.this happens several times a day.  The screen saver it amazing and the ease of use, other than its connection issues, is great.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Natarelli \"Lindsay Natarelli\""}, {"rating": 3.0, "review": "Even sitting next to the wifi extender, it unlike chromecast, looses reception continuously and is always rebuffering.The Channel content was excellent!", "verified": true, "helpfulness": "0/0", "author": "ROBERT D."}, {"rating": 3.0, "review": "The fire stick is a great way to access your prime features such as movies and music, and is very portable and easy to use. However, I've found it to be really buggy with lagging and random pausing and locking up which is super annoying. We own multiple devices to stream through, so comparing this to the Roku (best product out there), PS4, Xbox 360, Xbox One and smart TV, it falls right above the xbox 360 and smart TV, but below Roku, PS4 and Xbox One, in that order. It is the cheapest way to stream though, so it will get the job done if you don't mind random pausing and connection problems.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "OMG what have I been missing!!!! I love this thing getting one for every room in my house", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Can't activate it", "verified": true, "helpfulness": "0/0", "author": "Lee Ann Claytor"}, {"rating": 5.0, "review": "Better than Apple only because it has both Netflix & Amazon Prime videos and TV.", "verified": true, "helpfulness": "0/0", "author": "Susan \"Susan\""}]