[{"rating": 1.0, "review": "Constantly locks up with a quick flash of \"HDCP Noncompliant\" that forces me to re-push play on my remote. This occurs every 2 to 5 minutes. I love the interface and quality stream, but since it's basically unusable since I need to push play every 2 to 5 minutes, I have to give it one star until it is fixed via firmware. Its just too inconvenient.", "verified": true, "helpfulness": "0/0", "author": "C-DAWG YO"}, {"rating": 5.0, "review": "It arrived yesterday and I got a chance to play with it last night.  It's fast... much faster than my blu ray player for loading videos from the web.  I tried it with several services that I subscribe to and this thing excelled at all of them.  I also love that I can use my smart phone as the remote (you'll need to download the Amazon Fire TV Stick Remote ap).It arrived yesterday and I spent the evening playing with it, installing aps like Netfix and Hulu+.  It streamed the videos fast (via my N wireless router) and they looked great.  I also like that you can play games with it!The only con I have is that doesn't make my coffee in the morning.", "verified": true, "helpfulness": "0/0", "author": "Tone P."}, {"rating": 5.0, "review": "Got it yesterday. Set up was a breeze. A lot of very good content. So far, I've tested Bloomberg TV+, Watch ESPN, CBS News, PBS Videos, Netflix, Hulu Plus, YouTube, Flixster and some other apps. Except for Bloomberg TV+ (in which there was a split second delay between voice and picture), my experience has been excellent.", "verified": true, "helpfulness": "0/0", "author": "S.G."}, {"rating": 3.0, "review": "Got this during the pre-release offer.  It arrived yesterday.  I was up late working with it and checking out what it will do.As with most computer-related items, the software determines the value of the hardware.  The OS on this little stick is very capable and the resolution of the hardware is great.  Much of the options it offers for viewing, are duplicates of what is already available.To be up front, we cut the cable in our home 10 years ago, when broadband came out.Netflix has been on my Wii for several years.PBS is a great little app, as our coverage here with OTA is poor, but the content is limited.Most of the TV Channel apps require a cable subscription, ESPN, Lifetime, NFL, A&E;, etc.Hulu Plus requires a subscription.Even the news programs are tape delayed. CBSN seems to be a good candidate for best of the bunch.Many of the broadcasters are not updating the content frequently.The Miracast function of the Fire Stick is NOT compatible with the Dell Venue 8 Pro running Windows 8.1.  I WAS able to get Miracast running from the Dell on a different stick - (https://amazon.com/gp/product/B00LBON9IE/ref=oh_aui_detailpage_o09_s00?ie=UTF8&psc;=1)Amazon would do well, if they gave this item away to their Prime customers.  It is a GREAT Prime content server.I also LOVE the little remote.", "verified": true, "helpfulness": "0/0", "author": "Pastor Jay"}, {"rating": 1.0, "review": "My TV FireStick worked for two days then button-presses on the remote became intermittent. Shortly thereafter, it would not work at all. Just to be sure, I replaced the batteries. No improvement. I requested a replacement from Amazon but they said they won't be shipping more units until after January 15. They issued a refund and told me to place my order again and discard the one I have. Disappointed.", "verified": true, "helpfulness": "0/0", "author": "azcurt \"Tucsonan\""}, {"rating": 5.0, "review": "Amazon Fire TV Stick is the best buy on the market.  Amazon Prime is part of my Amazon life, and in addition to the bargains from Prime, I was able to order this for $19 as part of a two day deal. The Fire Stick arrived ten days before the actual promised date, which was a plus for me.The Fire TV Stick arrived well packaged with the Fire Stick, USB cable, Power adapter, HDMI extender cable, Two AAA batteries, and an Amazon Fire TV remote. Instructions included were specific and easy to use. I connected the USB cable into the Fire TV stick, and the other end into the power adapter. Plugged it into the outlet, and then connected to the HDMI port on my TV. I clicked on the remote and followed the on-screen instructions to complete the set up. This was the easiest set up I have experienced.With my Amazon Prime, I view the films offered, and there is usually a pause while buffering. Streaming with the Fire Stick completely eliminates the buffering, there is no pause, the film starts immediately. The picture is crisp and the sound enhanced. I have Netflix and that was an easy set up. I am so pleased with this new way of streaming films. I had considered a ROKU, but this small Amazon Fire TV Stick is the best purchase of the year.Highly Recommended. prisrob 12-04-14", "verified": true, "helpfulness": "1/1", "author": "prisrob \"pris,\""}, {"rating": 5.0, "review": "Bought one, loved it - bought another - from Best Buy for $25, since Amazon isn't shipping the one I bought for $19 until January.One will go to my Parents for Xmas.XBMC / TVMC has MUCH better performance than my Apple TV2.  I mean MUCH better.", "verified": true, "helpfulness": "0/0", "author": "Tim D'Aquino"}, {"rating": 3.0, "review": "After hooking up this product to the TV and getting a USB extension to get enough length to the power cord in order to power the darn thing, It took 5 tries to finally download the \"software update\" that it needed to even run despite having full wifi signal strength at that location. Not sure if that was because Amazon servers were loaded down or what, but was very frustrating. After the download the stick worked as expected.I am only giving three stars because of the design of these sticks. I know that all of them have the same flaw in that you have to power them because HDMI ports don't supply power, however, not everyone has power directly behind their TV either, this means that power cord is now coming out from behind the TV, running down the wall and 5 feet over to a power outlet (my TV is mounted above my fireplace mantel in a rental home, so cant run cables through the wall). Since the power cord is only about 2 feet in length and a USB cable to boot, I had to go purchase a USB extension cable, which was not as easy to find as you may think. My suggestion is to also make these run off of AAA batteries or coin batteries if possible. I would much rather have to replace the occasional battery than have to have some ugly cable running all over the place. But that is my opinion.", "verified": true, "helpfulness": "0/0", "author": "k5kzv"}, {"rating": 3.0, "review": "I was a little disappointed in this stick once I actually got it up and running.My main issues is that they are advertising this the same way as the full blown Fire TV, including all the Game features, which was one of the reasons I picked them up during the initial half price sale they had for them.While it DOES do everything it advertises in terms of streaming movies and videos, it misses the marks when it comes to games.  A LOT of the games I tried to download from the Amazon app store just do NOT work on the stick.  Plus out of the ones I did manage to get downloaded, MOST required a game controller, and don't work with the remote.  Disappointing...So I did some research and found that a lot of people use the PS4 controller with their Fire TV units.  Turns out that the Fire TV Stick can see it, but it will not pair with it.  So the Fire TV 'will' pair with a lot of blue tooth controllers, but the Fire TV 'stick' will not. Shelling out $40 for an Amazon only controller, when I have a perfectly good controller already, just doesn't make sense.  Again, disappointing.They marketed this as BOTH a streaming device and game play device.  While it meets the hype for streaming, it fails when it comes to games.  So for now I have to give it 3 stars.", "verified": true, "helpfulness": "2/2", "author": "Customer 2000"}, {"rating": 4.0, "review": "I picked up a Fire Stick while Amazon had a pre-order sale for $19. I currently use a Roku XS and two Samsung smart tvs, so my comparison will be to those. I do not have an AppleTV, so I cannot compare to that.Setup:Initial setup was fairly painless. It walks you through the steps and gives you a quick tutorial. I chose not to use the included a/c adapter and instead opted for USB power (even though it kept telling me not to use USB). The included HDMI adapter makes it easy to install in virtually any TV.Features:Most apps that I tried (Netflix, Hulu+, Pandora, A&E;) worked fine. Speed seemed about on par with my Roku XS.I am using Amazon Cloud for my music and pictures and it immediately synced my photos, so they were there for viewing or a slideshow.The iOS app is not currently available, so I could not test mirroring, etc...Remote works great. Feels good in your hand and the buttons are not hard to find.Wifi connection is good. Connected to my 5GHz network and streaming Hulu+ with no stuttering.Good Amazon Prime integration if you've purchased digital content from Amazon or have a Watchlist going with Prime.I don't play games on my tv, so I did not test any games or the optional game controller.Cons:A little buggy the first couple of days. Sometimes apps would disappear or show unavailable. Seems to be resolved now.I was a little disappointed that I had to pay for the Plex app. This was free on the Roku.Conclusion:At $19 (I've seen it as low as $24 during Black Friday/Cyber Monday) this is a pretty good deal. If you have existing digital content with Amazon or multiple Amazon devices (Fire, Fire HD, etc...), then this is a good addition. If you don't, then there are other devices that give you the same benefit depending on how much you want to spend. Nothing blew me away about the Fire TV Stick, but then again I was not disappointed as I generally expect better quality from Amazon.If anything changes in the coming weeks, I'll post updates, but for now so far, so good.", "verified": true, "helpfulness": "0/0", "author": "T. McElveen"}]