[{"rating": 5.0, "review": "Very smooth-running.  I have a Roku 3 and a Roku Stick.  I gave the Fire Stick to my dad for Christmas.  The Fire Stick does run smoother than the Roku Stick.  BUT, the Fire Stick is much more \"Prime-Centric.\"  This is great for my dad since he only has Prime.  But for someone like me who has Netflix, Prime, Hulu Plus, etc., it's a little annoying to have everything on the Fire Stick point you to Prime Video.  All in all though, a great Stick.", "verified": true, "helpfulness": "0/0", "author": "JWH"}, {"rating": 3.0, "review": "Easy to install and use. Searching videos isn't the best but it's ok. My biggest complaint is the video parental controls are horrible. You cannot set it up so the pin is only required for R rated content. If you set up a pin for videos you need to enter the pin for all videos regardless of ratings.", "verified": true, "helpfulness": "0/0", "author": "GiGiSam"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "retiredwooten \"retiredwooten\""}, {"rating": 3.0, "review": "A little tweaky... I received it the other day.  You have to power this baby, hooking it up to an adapter... your TV USB port is OK, but they recommend plugging it into an outlet with the USB adapter.  However, it sets up rather quickly, and is very easy to use.  Insure you have a fast internet connection or HD is out.  In fact, it takes a little time to get rolling once you are all set up.  Roku still has a hold on this market, but competition is good for all of us consumers.  The choices on the Fire Stick are not as friendly as Roku.  For instance, I own a subscription to PLEX allowing me to watch movies off my server.  Roku allows you to just download PLEX and then work with Plex to activate.  Amazon Fire Stick only has a purchase option of $4.95.  There is nowhere to sign in if you are already a Plex member.If I had my choice on rankings... I would give Amazon's Fire TV Stick a 6, and Roku a 10.  And catching up is all the fun... but they are both making improvements... I predict Roku will remain the leader.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey G. \"Say something about yourself!\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Richard Ballent"}, {"rating": 5.0, "review": "This is a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install, and it works as planned. I just don't have enough time to watch all the things on my play list!", "verified": true, "helpfulness": "0/0", "author": "B. M. Blauvelt"}, {"rating": 1.0, "review": "Piece of junk. Can't get through a rented Amazon movie without the dreaded spinning circle appearing time and again, lasting for minutes at a time. Often I have to get back to the home page and restart again for it to stream at all. Half the time the so called HD movie would stream at VHS kind of quality. I know I know you would say it must be my WiFi network. But my notebook is on the same WiFi network and it streams fine on my notebook! I also have a Roku and a Chromecast and I never have issues like that.While I'm at it, this thing must be a power sucker. My Sony TV has a USB port and I used it to power my Chromecast. When I use it with the Fire TV stick, it would go into an endless reboot cycle.Maybe Amazon should just go back to selling books instead of pretending to be a high tech company making gadgets.", "verified": false, "helpfulness": "2/3", "author": "davinci8x8"}, {"rating": 4.0, "review": "My Amazon Fire TV stick... Verdict: It's good.Short review for those not wanting to read everything: It is fast, very fast. WiFi can be a bit tricky, give it some space. Third-party DLNA support. This device is worth your money.Included in the box: Fire TV stick, HDMI extender, controller, micro-HDMI cord, and USB wall charger.We upgraded from a NeoTV MAX. Over time the NeoTV got incredibly slow. It wasn't fast to begin with. The new Fire TV stick is very fast. We have no problem with remote lag or loading shows / apps.The device itself is about the size of a large flash drive, but one that fits into the HDMI port on your TV. It comes with a micro-USB cable and wall charger to power the device. You can do without the former, however if drawing power from only the HDMI port you may have a decrease in performance. When I first set up the device, I plugged it into the USB service port on my TV for power, but it didn't seem to recognize it and wanted me to plug it into a power outlet. (I had the option to skip this however and just use HDMI power.) I would definitely recommend to Amazon to provide a longer micro-USB cable for those opting to charge it with a power outlet. After about two weeks I disconnected from the power outlet to the USB service port on my TV. There was no decrease in performance and the device still operated perfectly.The placement of my TV is about 6 in. from a wall. For the first several days my Fire TV stick operated normally, then the WiFi would start dropping. A few more days passed and the device wouldn't connect to the internet at all. I tried the usual: un-plugging it to restart and forgetting and reconnecting to WiFi. It would always connect to the WiFi, however the status was always: connected with problems. I tried my best to get it to work. I used the HDMI extender that was included so it wasn't as close to the TV. I even used some scotch tape to suspend the device in mid-air so it wasn't close to anything else. As a last effort I decided to move my TV stand about a foot to the left (the TV stand was against the wall of an inward corner, so moving it put it more toward the middle of the room) and that appeared to solve the problem, mostly. Once every couple of days I get the 'connected with problems' issue, but restarting the device always helps. I am not sure if I have a defective unit or if this is the result of cramming so much technology into such a small device, but I would definitely recommend giving your device some room.I love the controller that comes with the Fire TV stick. It is small, yet has some weight to it so it is sturdy in your hand. It has great range and does not need to be pointed directly at the TV. My NeoTV controller needed to be pointed directly at the device, which was a little inconvenient on a cold night when I didn't want to stick my arm out of the covers. That said, the Fire TV stick controller is small and I fear I may lose it one day.The device has a nice interface to it, perhaps one of the best I have ever seen on such a device / smart TV. It is also a lot different than similar devices, which has both good and bad attributes. Good: You can access movies and videos directly from the home screen, you don't (always) have to open an additional app to find something to watch. Bad: All of the movie and TV recommendations are from Amazon Prime Video, it can be difficult to distinguish between what is included in your Amazon Prime Instant Video subscription and what you have the option to rent and purchase. You will certainly know the difference however, when you click on the video. I'm not sure if this would be possible, but I would love to see Netflix and Hulu Plus recommendations on my device's home screen. I would also like the ability to disable video recommendations for anything not included in my Prime membership.You have the option to set up a numerical passcode to prevent unwanted purchases, if you have a child I strongly recommend setting one up. Even if you don't have a child I recommend setting one up so you don't accidentally purchase a video you may have thought was included in your Prime membership. I would love to see native DLNA support, but for those of you that are curious; there are third-party apps that can do this for you. So yes, you can stream videos from your PC to your Fire TV stick.The Fire TV stick was definitely worth the money and I would buy it again.", "verified": true, "helpfulness": "0/1", "author": "B. Butler"}, {"rating": 4.0, "review": "So I will start by saying I have two Fire TVs and on stick. The only reason to use a stick, is if you want to save money. There is noticeable performance difference between the box and the stick, but this does not make the stick a bad device. Far from it. It seems a little closer to on par with the Roku 2 I also have in that the menu is slow at times but bearable. I have this set-up wireless, which was easy, and really this works like a charm. I like the remote though a bit less, feels cheaper, no voice but for the price, this does really well. I showed a few individuals at Christmas how easy it is to use. This will probably wind up in the bedroom eventually, a place that it won't be used as often as the others. For comparison, I've not used a stick device before. If I wind up with the chrome cast or the roku stick, I can compare. Compared to the two BlurRay players I have, it still performs pretty well... if only Amazon offer DLNA at all like these older blurays do", "verified": true, "helpfulness": "0/0", "author": "Tanya McHenry"}]