[{"rating": 4.0, "review": "Bought to free up my laptop while I streamed Netflix on tv. Pretty convenient and straight forward", "verified": true, "helpfulness": "0/0", "author": "Steven Martinez"}, {"rating": 1.0, "review": "Disappointed with this product, super slow, and always buffering.", "verified": true, "helpfulness": "0/0", "author": "Wetbeard \"SS2.0\""}, {"rating": 4.0, "review": "Very easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Kenneth M McKenzie"}, {"rating": 4.0, "review": "Works as expected.  Like the remote and navigation.", "verified": true, "helpfulness": "0/0", "author": "Richard Vera"}, {"rating": 5.0, "review": "Great product! Exceeds my expectations!", "verified": true, "helpfulness": "0/0", "author": "Thorn Lear"}, {"rating": 1.0, "review": "There was a misunderstanding when I purchased it. I returned it and the TV that I bought to accompany it. I did not like the $100 annual fee to pay per view or purchase movies.", "verified": true, "helpfulness": "0/1", "author": "James Sloter"}, {"rating": 5.0, "review": "The fire stick is a real joy. Just plug in  and a few little tweaks and Eureka! There are your favorite movies and apps on the big screen. Only one semi weakness: this remote is hypersensitive. If you set it down face down it will hiccup. Very, very touchy. But all worth it.", "verified": true, "helpfulness": "0/0", "author": "tonibell"}, {"rating": 5.0, "review": "We like it quite a bit. It was a nice update for us.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "I bought this months ago and finally gave up. It's great for prime video, and I'm guessing the other streaming services like Hulu and Netflix. But if you primarily use Plex like I do, it's virtually unusable. It freezes constantly and crashes. I don't know if Amazon is to blame or Plex for not updating and fixing these bugs, but until they do I'm back to using a Roku.", "verified": true, "helpfulness": "0/0", "author": "Officer Rando"}, {"rating": 5.0, "review": "Excellent, just as advertised. Sound could be better.", "verified": true, "helpfulness": "0/0", "author": "Kenneth O'Block"}]