[{"rating": 4.0, "review": "Love this device!!!  Super simple to set up and video at the beginning makes it very easy to navigate.  The only problem I have is not with the device itself but with the apps.  Many of the channel apps that I wanted to view require a cable subscription to use and the purpose of this was to get away from cable all together.  Love all the free channels and with my Prime membership, I can watch a variety of shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Couldn't be easier to set up and use. Streams well. Lots of options, including Amazon Prime. Now if only I could get it to work in a hotel room....", "verified": true, "helpfulness": "0/0", "author": "Stella"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "CHRIS A"}, {"rating": 4.0, "review": "Overall this is very nice little device. My kids especially love it. There seems to be no end to the number mind numbing cartoons available to them. It is very easy to use and super fast on my home network. Which is also super fast.Here is my biggest complaint. Amazon actually markets the device as a tool to help you cut the cord with cable/satellite. However, almost all of the apps for channels like HBO, History etc, require you to have a provider account to use the online service. So they loose a star for that little omission in the marketing plan.None-the-less this is an awesome device and we have cut the cord. However, we did have to start paying almost double the amount for the internet service once we cancelled the cable TV. So the savings are not quite so great as one would hope but I am happy to get rid of all the boxes and wires required by the cable company for the pleasure of paying for the service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/1", "author": "Raven"}, {"rating": 5.0, "review": "I've got Chromecast, Apple TV, Vizio DVR, Samsung DVR, Vizio Smart TV, Roku and the list goes on.  This is my 3rd Fire Stick, so we had to go to the Score Cards.........Fire Stick, winner by Decision!!", "verified": true, "helpfulness": "0/0", "author": "Van Payne"}, {"rating": 1.0, "review": "Started off great but now ever skips and lags besides prime shows and movies. Netflix and Hulu are unwatchable. It's not my internet I know that much because when I use chromecast it works perfect. Maybe I got a busted fire stick idk.", "verified": true, "helpfulness": "0/0", "author": "matthew nobrega"}, {"rating": 5.0, "review": "I recently bought a Chromecast on sale at Amazon,and the difficulty and horrible experience in using it made me love the Amazon FireTV stick all the more.While casting or flinging is cool, it is nice to just navigate the Fire's menu of apps and movies instead. Browsing is quick, and skipping or freezing in playback is rare. I prefer the experience of watching Netflix or Hulu on the Fire TV Stick to my iPad, Android phone, or my computer. Plus as a prime member, I got it for $20 - it was a bargain!", "verified": true, "helpfulness": "1/1", "author": "Review Master \"Review Master\""}, {"rating": 5.0, "review": "It is everything I expected and more,I love it!", "verified": true, "helpfulness": "0/0", "author": "jes"}]