[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "R. Roy"}, {"rating": 3.0, "review": "Installation was fairly easy, but I can't get any sound on the radio apps, and my music will not download.", "verified": true, "helpfulness": "0/0", "author": "Frederick W. Chapman"}, {"rating": 5.0, "review": "LOVE IT! This thing makes any tv a smart tv and is extremely easy to use. I have a little 24\" vizio that is beautiful and works well, but wasn't a smart tv and we were getting ready to throw it out. Instead, I got this and a wall mount and I'm super satisfied with the result. Really a great device. My only gripe is that HBO Go is not supported yet. That's a pretty serious miss... Otherwise, it's fantastic.", "verified": true, "helpfulness": "0/0", "author": "I.B. Miller"}, {"rating": 4.0, "review": "Still getting used to this. So far so good. Hooked up easy. Instructions were easy.", "verified": true, "helpfulness": "0/0", "author": "Linda Grahn"}, {"rating": 5.0, "review": "It's so easy to set up, so fast to load, this thing has been amazing. I bought it with the $20 intro Prime price and should have bought 5 more for every TV in the house. I love it and can't say more good things about it. With Plex it's been perfect.", "verified": true, "helpfulness": "0/0", "author": "That One Guy, Over there."}, {"rating": 3.0, "review": "Luckily I bought the Fire Stick for $19 on sale for being a prime member. After using it for the last few days I am glad I didn't pay full price. It buffers quite often especially while streaming Netflix. As an owner of 3 Rokus I was hoping I would like the Fire Stick just as much however as of now this isn't the case. I hope it improves it's performance because it's lacking now.", "verified": true, "helpfulness": "0/0", "author": "c cook"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE IT!!!!!  So easy to use, especially for an \"oldie\".  Am finally getting to watch The Wire from the beginning. The choices are endless.", "verified": true, "helpfulness": "0/0", "author": "Carol L. Smith"}, {"rating": 5.0, "review": "I absolutely love the Fire Stick!Turn your newish but not smart TV into a smart TV!I also have the Google Chrome but like the Fire Stick much more due to the remote and not having to use my phone or other device.Absolutely recommend if you want to watch your Prime movies or Net Flicks on your TV.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"She's all heart\""}, {"rating": 3.0, "review": "There have been very few items that I purchased from Amazon that I have been disappointed with. However the Fire TV Stick has been disappointing.  Give me my ROKU any day.  The Fire is harder to use and understand than my ROKU.  For instance when looking for movies the Fire Stick allows only for a single advance of movies; while the ROKU shifts a page of 5 movies at a time.", "verified": true, "helpfulness": "0/0", "author": "RICHARD SALO"}]