[{"rating": 4.0, "review": "Like it", "verified": true, "helpfulness": "0/0", "author": "jim tadlock"}, {"rating": 5.0, "review": "we love all 4 fire sticks and we have no more cable bill ! yeah  !!!!!! we tell all of our friends to go on line and buy it from you . great price and service . Thanks", "verified": true, "helpfulness": "0/0", "author": "beverly leoffler"}, {"rating": 5.0, "review": "Absolutely Love it and have recommended it to all my friends 👍", "verified": true, "helpfulness": "0/0", "author": "P Taylor"}, {"rating": 5.0, "review": "Plugged it in and it worked as advertised, a rare occurrence in today's world of hype and exaggeration.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "seems fine but i have not really looked at any movies yet", "verified": true, "helpfulness": "0/0", "author": "Kathleen Csordas \"KC\""}, {"rating": 2.0, "review": "Not impressed! I got this a few days ago and was not able to use it on 2 of the 4 TV's I have ( one a fairly new Toshiba) I've gone ahead and checked all the troubleshooting steps and of course 1 TV is the one I really wanted to use this on.The Only reason I'm giving it two stars is that I've been able to use it on one TV. I really like the menus and it's got potential just not ready for prime time I guess!", "verified": true, "helpfulness": "0/0", "author": "J J Antonetti"}, {"rating": 5.0, "review": "Love the all the features!", "verified": true, "helpfulness": "0/0", "author": "Ashlee"}, {"rating": 3.0, "review": "Works great for what it does.  I have been using a Chromecast and prefer casting my laptop to the TV.  The Fire Stick is not able to do this.  I you don't mind another remote and searching with it, then this device is for you.  I prefer browsing with my mouse and laptop and then casting.It does provide a better picture quality for Prime programming.I had the Fire tablet.  I quit using it because I didn't like the restrictive Amazon software and the inability to load Google Pay apps.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Very happy with my Fire TV Stick. I love it. But how do I turn it off when done watching it?", "verified": true, "helpfulness": "0/0", "author": "A2J"}, {"rating": 5.0, "review": "Great buy!! No need for the apple tv anymore!!", "verified": true, "helpfulness": "0/0", "author": "Javier"}]