[{"rating": 1.0, "review": "Geographic restrictions make it pretty much useless.....", "verified": true, "helpfulness": "0/1", "author": "Jose P."}, {"rating": 2.0, "review": "Not as many Movies or TV Shows were free!!!", "verified": true, "helpfulness": "0/0", "author": "Gregory P. Johnston"}, {"rating": 3.0, "review": "Nice idea, really well thought out concept but its slow watching anything. I have high speed interenet, never had a problem with connection, but with this stick its slow. Ill see it change about 20-30 times from high def to standard to bad. But it is a great idea.", "verified": true, "helpfulness": "0/0", "author": "Joey Smithey"}, {"rating": 5.0, "review": "So far so good.  I especially like how fast the user interface responds and how easy it is to navigate.", "verified": true, "helpfulness": "0/0", "author": "Michael Collins"}, {"rating": 3.0, "review": "Love the stick but my problem is continuity.  Using apps such as Netflix or hulu also Pluto.  It always stops and rebuffers and sometimes won't continue playing.Tried using the kindle app but that doesn't work at all", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love the fire stick its everything i could  ask for n more", "verified": true, "helpfulness": "0/0", "author": "mina thomas"}, {"rating": 4.0, "review": "Okay", "verified": true, "helpfulness": "0/0", "author": "minh"}, {"rating": 5.0, "review": "What a great little streamer at such a small cost.", "verified": true, "helpfulness": "0/0", "author": "L Hatfield \"L Hatfield\""}, {"rating": 5.0, "review": "Changed from Roku to the Fire TV Stick and very glad I did. It is faster, easy to install and provides loads of selections and possibilities.", "verified": true, "helpfulness": "0/0", "author": "Avid Reader"}, {"rating": 5.0, "review": "I am so happy to say these worked as I hoped!!!  We are now cable free and I love it!  Thanks,  Oh how I wish a few more current series were on, but worth every penny and I will adjust!!", "verified": true, "helpfulness": "0/0", "author": "Vanessa D. Fitzgerald"}]