[{"rating": 5.0, "review": "Love it! Easy and Convenient.", "verified": true, "helpfulness": "0/0", "author": "KatM"}, {"rating": 5.0, "review": "I had a Chromcast set up previously and this one is much better and has a lot more functions. Not to mention it hooks up with amazon prime TV which I love. Between this and Netflix we have completely eliminate cable I also like Hulu six months out of the year. Catch up on all those TV shows LOL", "verified": true, "helpfulness": "0/0", "author": "Christie \"Love good motivational books and books about business.  I sell real estate and have since 2001.  Love being a mother of a little boy and love my 2 dogs!\""}, {"rating": 1.0, "review": "I had no idea that it was refurbished .smh...", "verified": true, "helpfulness": "0/1", "author": "dennis walker"}, {"rating": 5.0, "review": "Wow,  this little device produces such a good resolution on the TV,  despite my slow Att connection to the Internet!", "verified": true, "helpfulness": "0/0", "author": "cg"}, {"rating": 5.0, "review": "I already had the Fire TV box.  The stick is great for the other rooms and offers all the flexibility I needed from the box.", "verified": true, "helpfulness": "0/0", "author": "PK"}, {"rating": 5.0, "review": "It does more than I am aware of at this point. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Kandis"}, {"rating": 5.0, "review": "Quite handy. Made more useful as third-party developments target the non-cable (television) on-demand consumer. HBO's trial of their \"Now\" (no cable television service needed for on-demand viewing) coupled with Plex (workhorse of a media streaming management multiplexer) for those with oh-too-many old television series (Hey, Dude and its missing episode 43 spring to mind, and Might Max, of course) attached to networked data drives, clinched the Fire TV Stick's purchase with a base level of usefulness for me.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I have had one for my tv for almost a month & I love it!", "verified": true, "helpfulness": "0/0", "author": "Tasha M. Davis \"LIGHTHOUSE\""}, {"rating": 5.0, "review": "Works great. Kids like that you can play some the kindle games on it. I have zero complaints. Set up was a breeze.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Valdine Duperat"}]