[{"rating": 4.0, "review": "somewhat limited capability. gorgeous interface...", "verified": true, "helpfulness": "0/0", "author": "Jansen Granflor \"JANS one\""}, {"rating": 5.0, "review": "I already had Chromecast when I received this as a gift from a fellow tech nerd cosin. I had Prime already. I know they don't go hand in hand but I've canceled netfix and gone to using this 100%. I'm going to buy another one for our second television.", "verified": true, "helpfulness": "0/0", "author": "J. A. Perry"}, {"rating": 4.0, "review": "Okay, I do love it. Now.  But it took a \"give a moose a muffin\" sort of game to get it to work!  1) \"If you give your TV a Fire Stick, it's going to want a faster internet speed\".  Laptop had no problem streaming Prime videos over wireless but Fire Stick said connection was too slow.  2) \"If you give it faster internet speed, it's going to want a stronger signal.\"  Upgraded fios connection speed still didn't work, kept losing connection.  Luckily upgraded speed also came with an upgraded router. 3) \"If you get a new router, it's going to start off with a new password\".  Ugh.  Okay, change the password. 4) \"If you have a new password, you need to tell your Fire Stick.\"  Yes, done, okay?  And then, yes, it was okay.  Works great (now). Love it! (now).", "verified": true, "helpfulness": "0/0", "author": "Carol Hanson"}, {"rating": 4.0, "review": "The only problem I've had so far has been with the Youtube app. For some reason it won't buffer enough to make it through a long video (20+min). I can stream the same one on my laptop from the same wireless network without any problems.", "verified": true, "helpfulness": "0/0", "author": "A. Neff \"not workin\""}, {"rating": 5.0, "review": "Great product.  Lived up to expectations", "verified": true, "helpfulness": "0/0", "author": "Ira Jack Holz"}, {"rating": 5.0, "review": "We LOVE our Fire Stick!  This easily streams Netflix, YouTube, Amazon Prime shows and movies, plus we can use the slingbox app to watch what's showing on our cable box or shows on our DVR.  It's so easy to use, my toddler can work the remote.  Great product, we plan on buying another!", "verified": true, "helpfulness": "0/0", "author": "S. Wilson"}, {"rating": 5.0, "review": "good!!", "verified": true, "helpfulness": "0/0", "author": "Lee W."}, {"rating": 5.0, "review": "Definitely meets our expectations!", "verified": true, "helpfulness": "0/0", "author": "g"}, {"rating": 5.0, "review": "I love it. It was very easy to set up, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Angela Cruz"}, {"rating": 5.0, "review": "Great purchase!  Works wonderfully.  even my youngest children are able to operate the remote.", "verified": true, "helpfulness": "0/0", "author": "William Dennis Ely, Jr."}]