[{"rating": 3.0, "review": "It does work as well as advertised, but for some reason I thought my phone could stream photos and videos through it directly to my TV. It won't. But it is definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "J. Phelan"}, {"rating": 5.0, "review": "I like it i wont one more", "verified": true, "helpfulness": "0/0", "author": "Haroldjennings"}, {"rating": 5.0, "review": "Fast and easy to use. I've purchased 2 of these.", "verified": true, "helpfulness": "0/0", "author": "Paul Krowicki"}, {"rating": 2.0, "review": "Unfortunately like many, many others I am having dropped Wi-Fi issues while watching movies and TV shows.  I have had no issues using my Kindle and my router (Comcast issued) is in a computer room (shared wall with living room) approx. 25 ft from Fire TV stick.  Like many, many others I'll have to wait for a future upgrade or replacement.", "verified": true, "helpfulness": "1/1", "author": "Keno"}, {"rating": 4.0, "review": "I likes it - so far- catching up on old episodes of \"The Americans\" and \"Justified\".Didn't know I liked those shows till the last season. -", "verified": true, "helpfulness": "0/0", "author": "Hal in Augusta \"hrosser\""}, {"rating": 4.0, "review": "The fire stick is a great way to watch internet video on a non internet TV,  Pros: Access internet channels on a TV without wifi built in.  Easy to set up and use.  Cons: Needs an AC adapter to run which take up another outlet.  Where the AC adapter plugs in to the FireStick is an awkward placement. The cord is heavy pulling the stick downward.Overall a great way to watch Internet TV!", "verified": true, "helpfulness": "0/0", "author": "Leina Cochrane \"AmishPornStar\""}, {"rating": 1.0, "review": "After several weeks, still will not work. No help from amazon.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this fire stick.  I have 2 and would buy more if I ever need them.", "verified": true, "helpfulness": "0/0", "author": "bridget mckenzie"}, {"rating": 1.0, "review": "Most of the main networks apps (like AMC) don't work on the Fire TV.I bought Airplay app ($5) to mirror my macbook on the tv and it didn't work.read carefully before buying and don't trust Amazon TV stick reviewers", "verified": false, "helpfulness": "0/0", "author": "Abdulrahman"}, {"rating": 5.0, "review": "I wanted a media player that satisfied most of my requirements that afforded me easy access to my Prime account at a reasonable price. This fits the bill.", "verified": true, "helpfulness": "0/0", "author": "Bruce O."}]