[{"rating": 5.0, "review": "This device works so well.  I have other Smart TV's, but it has better consistent connectivity.  The Phone app for control also enhances everything!", "verified": true, "helpfulness": "0/0", "author": "Kerry A. Jerris"}, {"rating": 4.0, "review": "Would have been 4 stars if Amazon had not been so stingy with the power cord length...impossible for it to reach the plug behind my armoire...add one more ft to that cord please. I have a smart tv...but i got the fire tv stick so I would have crackle and amazon prime music....for some reason the samsung smart tv only has amazon prime instant video app not the music app.  Works great...but was not a simple plug and play....seems to fight the smart tv and verizon fios at first....now it it finally working great....The remote is great and the remote app for android is great too. Great deal even at regular price.", "verified": true, "helpfulness": "1/1", "author": "shopping crazy"}, {"rating": 1.0, "review": "Worthless because I paid $100 for Prime and most all movies and TV shows cost $ rather than 1000's of free choices AS ADVERTISED!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 2.0, "review": "I like my firestick, but it has a problem with losing Internet connection. I'm constantly having to disconnect it and reboot. I hope they have a second generation in the works.", "verified": true, "helpfulness": "0/0", "author": "M. Bazer"}, {"rating": 4.0, "review": "Great little device, the problem is that it is just too little. You think regular remotes get lost easily this one is gone in a flash.  Luckily you can use your smart phone as a remote using an app that works very well!Other than that I've been very happy since canceling cable and switching to this much more economical and overall superior way to watch movies TV music etc.", "verified": true, "helpfulness": "0/0", "author": "Jasun Cosgrove"}, {"rating": 4.0, "review": "Four stars", "verified": true, "helpfulness": "0/0", "author": "Cathey Davis"}, {"rating": 2.0, "review": "Don't need this if you have a computer.  I have Apple TV and like it better.  And most movies I want, I have to pay for, even though I'm a prime member.", "verified": true, "helpfulness": "0/0", "author": "mommyof2"}, {"rating": 3.0, "review": "Pretty good and nice it has a remote,  but it stalls and freezes a lot.  Don't have that problem with my chromecast.  Problem is chromecast doesn't do amz so, eh. Chrome is cheaper too.", "verified": true, "helpfulness": "0/0", "author": "annadownya"}, {"rating": 5.0, "review": "Purchased this for hotel use for 2 young children and didn't really do trial run prior to trip. However,  I was pleasantly surprised at how easy  the set up was, even for a \"non-techie\" individual as myself.The audio setup companion was very useful and the content was more than sufficient and diverse for it's intended purpose. Streaming quality was good even with hotel WiFi, so will likely be that much better if used with personal/home connection.Definitely one of my top purchases this year.", "verified": true, "helpfulness": "0/0", "author": "CO"}, {"rating": 4.0, "review": "I own Roku, Chromecast and Fire TV stick, Fire TV is so far my favourite.", "verified": true, "helpfulness": "0/0", "author": "TR"}]