[{"rating": 5.0, "review": "This is even better than I hoped and was extremely easy to setup. Absolutely recommend it.", "verified": true, "helpfulness": "0/1", "author": "Matthew Mattera"}, {"rating": 4.0, "review": "Doesn't mention it but works with Mirror Cast. I bought a MS stick and only works on some TV's. Tried this to screen cast with  my LG phone, ASUS x205 and a Surface Pro and it works on all of them.", "verified": true, "helpfulness": "0/1", "author": "T. Henley"}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/1", "author": "AARON P."}, {"rating": 5.0, "review": "Once the price dropped I purchased 2 additional sticks and am satisfied with all three.", "verified": true, "helpfulness": "0/1", "author": "Tony Newton"}, {"rating": 3.0, "review": "Connecting it to the TV set and activating it is uncomplicated. It's easy to use. BUT! The Prime Instant Video selections included with Prime membership are a major disappointment. There are way too many \"C\" grade movies. F-R-E-E movies and TV shows is the reason why I got the Stick. After reviewing what I can watch for free, I can say without hesitation that using Amazon to watch movies and TV shows will take a back seat to Netflix.", "verified": true, "helpfulness": "0/1", "author": "Deevah"}, {"rating": 5.0, "review": "I love this!", "verified": true, "helpfulness": "0/1", "author": "Kimberly A. Garcia \"makeitsew\""}, {"rating": 5.0, "review": "Works great!  set up was extremely easy.", "verified": true, "helpfulness": "0/1", "author": "Howard Hood"}, {"rating": 5.0, "review": "has all different app.", "verified": true, "helpfulness": "0/1", "author": "jw"}, {"rating": 3.0, "review": "As I write this, my Fire TV Stick says I'm not connected to the internet, when I quite clearly am. The only consistent thing about the FireTV Stick is that it's inconsistent. Some days it works fine, and other days it simply will not stay connected to WiFi. My AppleTV never has this problem, not do I have any issues with my Mac, iPad, or iPhone. When it works it's fantastic to be able to watch Prime on my TV without having to stream from my iPad, which is why I purchased this in the first place. Amazon needs to update the software so the Stick stays connected to the internet, because at the moment it's a $40 thing plugged into my TV that a rarely use, because having the internet constantly dropping is very irritating.", "verified": true, "helpfulness": "1/2", "author": "Nicole P."}, {"rating": 5.0, "review": "Awesome entertainment addition. Easy to use and is great if you do not have a smart tv. Absolutely the only decent thing purchased on prime day...", "verified": true, "helpfulness": "0/1", "author": "Mike"}]