[{"rating": 1.0, "review": "Crashes a lot, on a strong internet connection. Very disappointed", "verified": true, "helpfulness": "1/2", "author": "josh wagoner"}, {"rating": 1.0, "review": "I don't usually do reviews, but this is stick is awful. The video cuts in and out. I know it's not the internet connection because my Roku works fine. The remote is terrible. Sometimes I have to unplug the device just to get the remote working. The remote also freezes up or scrolls rapidly after pushing the up or down once. I'd much rather use any rook device than this one.", "verified": true, "helpfulness": "1/1", "author": "Randy Devine"}, {"rating": 5.0, "review": "First let me say I am new to this streaming stick/tv game.  I have never used any of the other similar products....Just what my family needed!  It is now saving me $5.99 a month as I got to return the digital adapter that Verizon was charging me each month to watch TV in low definition in a extra bedroom.  It is soooo convenient to just plug it in to the TV and GO!  If you have a younger child and let them watch tv (and have prime) this is a MUST.  There are many kid tv shows streaming FREE with Prime.  It might be a surprise to some of you but if you have Prime you have access to 1000s of TV shows and Movies for free!  This device makes them worth watching since you will get to watch them on your TV and not your little computer monitor.  The size is great, it is easily movable from TV to TV.  The one thing that is not really clear is there is a small power source you plug into the USB stick that makes it go.  I was thinking the USB was going to be magically powered by the TV itself, lol.  It is super easy to use as well,  they did not make it complicated at all.  I would think my parents who are almost 60 could easily figure this out without any help. I was bummed that HBO GO was not included but I read that its on the way,  once HBO GO is up an running I think I will be buying another fire stick!  The one thing I do not like is that amazon instant video prices are equal or  more expensive than DVDS and Blu-Rays!!  Why in the world would a digital copy from Amazon cost more than a Blu-Ray that comes WITH a Digital copy and sometimes even a DVD!TLDR version-If you have Prime and would like to watch TV where you do not have a cable/satellite box, buy oneIf you have Prime and would like the save anywhere from $5.99 to $24.99 a month for a box you do not use often, buy oneIf you have Prime and a kiddo, buy one", "verified": true, "helpfulness": "2/2", "author": "D. Bloom"}, {"rating": 5.0, "review": "Great product, have used it many times since I hooked it up", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 4.0, "review": "Works great! I travel a lot, so the Fire TV stays at home and this fire stick comes with me. If you have to have one, just way cost benefit, this little thing has few drawbacks and I use this all the time on the TV without the Fire TV. When out and traveling though, it's so convenient not to plug my laptop into the TV in a hotel room to watch a few movies or shows at night, and you then dont need to be getting up to touch the mousepad or keyboard (or bring external ones) because the remote does all of that. If you even want to youtube videos from your now-available laptop, you can throw them to the fire stick via the share button. Note: to do this, you must have a direct password entry for the hotel wifi, no login-webpage-redirect; if the latter, you would need to bring a router or something to make your own wifi = complications for non-techy people in this situation.To compare to the Fire TV, sometimes has some lag here and there with the stick, but it can be hard to tell between the stick and internet - but the stick does lag occasionally. The stick has less processing power, so this makes sense. One other drawback that corrects for the log-in passwords on wifi is that this device MUST use wifi, unlike the Fire TV which can plug into ethernet. Note however, that the Fire TV is quite a bit less portable, and less likely to come on a trip anyway, so keep this in mind. Lastly, the remote that comes default does not have the voice recognition, this would have to be purchased separately (but this device is so much cheaper, I can see why, just plan to type with some extra clicking on a remote). Overall though any drawbacks are not hindering and hardly become bothersome, and this device WELL worth the cost. Its a great item, with some very minor drawbacks.", "verified": false, "helpfulness": "0/0", "author": "Michele L. Ruman"}, {"rating": 3.0, "review": "I had high hopes, but it didn't work for me.  I live in the country, and although they call it DSL, it is pretty slow.  The Fire Stick could not stream at the speed I have, although my Roku players can.  I was looking to simplify with the smaller size, and I also mistakenly thought it was powered by the TV.  It was not clear to me that a power cord is required that hangs off the stick and needs to be plugged into an AC outlet.  So I was out on two counts: didn't simplify, and didn't work.  I'm sure if I actually had high-speed internet, it would have been fine.", "verified": true, "helpfulness": "1/1", "author": "Kelley Kat"}, {"rating": 4.0, "review": "My Fire TV stick was a gift.  I had no expectations; I didn't even know it existed. Prior to the receiving stick, I watched Prime, Netflix, Hulu, etc, thru Xbox live connection. The stick is WAY better sound and picture quality as well as so much faster to get to the show or movie I'm trying to view. And I LOVE the music choices available too", "verified": true, "helpfulness": "1/1", "author": "Kathleen jensen"}, {"rating": 5.0, "review": "Why use a different device. I am blown away by how easy this is to configure and how good the customer experience is. I have an Apple TV as well, and I just like the Fire TV stick better. Other than AirPlay, which is a really neat feature of Apple devices, the Fire TV Stick feels a bit more fluid. And the ability to access Netflix and Amazon Prime without headache is just fantastic.I hate to sound like a fanboy, but I am delighted that Amazon has released a stable, easily portable, and highly enjoyable device for such a low price.", "verified": true, "helpfulness": "1/1", "author": "JD \"When I Paint My Masterpiece\""}, {"rating": 4.0, "review": "Awesome device but it freezes from time to time.", "verified": true, "helpfulness": "0/0", "author": "Philip Montevirgen"}, {"rating": 3.0, "review": "Great! Except it doesn't stream in HD. Video starts in HD, but is then down sampled to something less in ~10 seconds. Sometimes the HD comes back in, but then quickly down samples again. I have a fast internet connection with no issues on other devices (incl Apple TV, which is hooked up to the same TV). Tried watching the same show on Fire Stick and Apple TV and the difference is obvious. Amazon, please update!", "verified": true, "helpfulness": "1/1", "author": "Glenn \"Glenn S.\""}]