[{"rating": 5.0, "review": "I love it!! And the remote app is so intuitive", "verified": true, "helpfulness": "0/0", "author": "Alison"}, {"rating": 5.0, "review": "easy setup.  great price.", "verified": true, "helpfulness": "0/0", "author": "KW"}, {"rating": 4.0, "review": "Magic. No more watching my iPad in bed. Wish I would have bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Lovie"}, {"rating": 5.0, "review": "Turn your TV into a Smart TV.... Kids can play, listen to music, and watch nice movies.... It's Amazon Brand, do you understand??????", "verified": true, "helpfulness": "0/0", "author": "David Mariani"}, {"rating": 5.0, "review": "This is PERFECT for cord cutters, just add Sling TV! :)", "verified": true, "helpfulness": "0/0", "author": "Robyn California"}, {"rating": 5.0, "review": "I have this hooked into my computer monitor. It is a 24 inch so it is like having another TV. The kids play the games you can download and I can turn on Pandora radio while I am cleaning up their mess after they go home. I can also watch all the streaming movie apps.", "verified": true, "helpfulness": "0/0", "author": "Karen Luna"}, {"rating": 5.0, "review": "Easy installation. Take with you when you travel", "verified": true, "helpfulness": "0/0", "author": "Chris J Parrino"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Rafael Hernández"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Rachel wile"}, {"rating": 4.0, "review": "Everything except the internet.  I am well pleased with the stick except it doesn't allow me to use social media on the TV.  I have another Kindle where I hook into the TV directly using mirror imaging.  I can show everyone what I'm searching for and use social media.  It's not wireless but it works.  I hope the developers come up with a program where I can do this remotely.  Also, the remote app has limited use even though it presents a keyboard.  Other than those two things, it's a great product.", "verified": true, "helpfulness": "0/0", "author": "Tate-Ray"}]