[{"rating": 5.0, "review": "I'm amazed at how this tiny stick works.  It was easy to install on my TV and It was up and running in just a few minutes.  I use it for all my Amazon Prime video content plus Netflix.  It also supports several other streaming services..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have had the Stick for less than 24 hours and I am in love! When we bought our TV, we had no hopes or expectations of getting internet at home so we did not invest in a smart one. We finally got internet so now I regretted that decision. Fire Stick took that regret away! I have one other small smart tv and it does not have 1/10 the available apps through the FS. I have downloaded more than I have been able to explore just yet, but so far they all work beautifully.. I can only get 3 mbps high speed so I was concerned about streaming ability. No problems! The Stick has only stopped once so far to buffer and that was only for about 2 seconds. Finally, with my free month trial of Prime, I am comparing their availability of shows and movies to Netflix. I have found quite a few that are not on Netflix and more current seasons than what Netflix offers. I will still likely keep my N but I think I will also sub to P. Overall, I am more than pleased with the value of my purchase and would highly recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "j97angels"}, {"rating": 4.0, "review": "I got this for the Kitchen/Nook area TV and it surpassed my expectations. It is very fast and no issue between the stick and the remote. I the user-interface could be improved so I will  take off one star. :-). If you are NOT an Amazon Prime member, I would go with the Roku version.", "verified": true, "helpfulness": "0/0", "author": "Mr.D of Texas \"Mr. D of Texas\""}, {"rating": 4.0, "review": "I'm enjoying  it . I wish I had more time to enjoy it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A.Benjamin"}, {"rating": 5.0, "review": "Great price; easy to install and use. I do not miss cable TV at all!", "verified": true, "helpfulness": "0/0", "author": "cdstokes"}, {"rating": 5.0, "review": "So far so good.  Got it setup in no time and haven't had any issues with it.  I have it plugged right into the tv with the included extender and have no issues with wifi signal.  Use it for Netflix and Plex normally and everything works great.  Plex comes up every time and plays the movie like it is nothing.", "verified": true, "helpfulness": "0/0", "author": "thebrad00"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "winnetta jackson"}, {"rating": 5.0, "review": "Easy to st up, although difficult to open remote to load batteries.  You need a very thin screwdriver or other such devise to pry it open.  (There are great YouTube links.)", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 4.0, "review": "Works pretty good.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Easy to use. Plug and play.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Robinson"}]