[{"rating": 5.0, "review": "I enjoy it. It made my dumb tv a smart tv. So overall not bad.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 4.0, "review": "Excellent new gadget.  Does exactly what I expected.  An improvement would be to access youtube or a better selection of music.", "verified": true, "helpfulness": "0/0", "author": "John Grass"}, {"rating": 4.0, "review": "works fine.", "verified": true, "helpfulness": "0/0", "author": "David Flick"}, {"rating": 4.0, "review": "Works very well on my 42\" Vizo TV.", "verified": true, "helpfulness": "0/0", "author": "Big Buzz"}, {"rating": 1.0, "review": "This device works OK for Amazon video content. Hulu makes it into the very first ad and stops and says there is a network connection issue. I have 100Mbps symmetrical fiber to the home connection and a solid wifi signal.  It is an application issue with no fix in sight.  On netflix it has issues of changing between connection speeds.This is my speed test wirelessly.http://www.speedtest.net/my-result/4272667893", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Everything you want and expect it to be. Only quibble: The need for an independent power supply beyond USB. But thats shouldn't be  a dealbreaker.", "verified": true, "helpfulness": "0/0", "author": "Chris Chase"}, {"rating": 5.0, "review": "Quick ship and easy to work with", "verified": true, "helpfulness": "0/0", "author": "tim liebhart"}, {"rating": 5.0, "review": "Incredibly fast and easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Roger Rabbit"}, {"rating": 1.0, "review": "i have tried to hook it up to 4 different TVs, Samsung, Visio, and Sharp.  i can't get it to work at all!", "verified": true, "helpfulness": "0/0", "author": "Marty Sampson"}, {"rating": 1.0, "review": "My FireTV Stick worked great and I loved it! -- Until about three or four weeks ago when it became totally unusable (and a source of serious frustration). One day I noticed some playback issues with the Netflix app. Next it was the occasional dropped connection from my home WiFi network. No biggie, I can live with that once in a while. But it once in a while quickly became all the time. Now it either won't connect at all, or it connects just long enough to load the home screen, then disconnects again before I can launch anything.It's worth mentioning that I've made no recent changes to my WiFi network, and no other device in our household has any difficulty staying connected (computers, iPads, smartphones, Xbox, etc.). Also, I've tried numerous reboots, uninstalling apps, manually clearing the cache, and even resetting the device to factory defaults, but nothing helps.As I said, it's currently useless. I would ask for my money back, but the thing lasted just long enough for my window of return to expire. It is, however, still under warranty, so I'm hoping Amazon will at least send me a replacement. Hopefully I just got a dud and the next one will be okay. I have an email out to Amazon Customer Service, and plan on updating this review to include what they say / do about the matter.Again, for what it's worth, I really did like it when it was working.", "verified": true, "helpfulness": "1/1", "author": "Geoff"}]