[{"rating": 4.0, "review": "Works well, but interface takes getting used to compared to Apple TV. The latter is more intuitive and easier to navigate. That said, still very good product.", "verified": true, "helpfulness": "0/0", "author": "Neal Pratt"}, {"rating": 4.0, "review": "I love the fire stick, my only issue is that i paid extra money to have by a certain date, an it took 3 extra days to be delivered. I would not have paid the extra money if i knew it was still going to take so long to deliver. But the firs stick itself exceeds all my expectations.", "verified": true, "helpfulness": "0/0", "author": "Aaron c Doty"}, {"rating": 4.0, "review": "Got it just as an easy way to get Netflix integrated into my system, but it does so much more. Plus its portable and Dual-Band complaint!MyHarmony universal remotes needs to get the IR codes for better integration. but that does not count against the Fire Stick, that's the universal remote guys.", "verified": true, "helpfulness": "0/0", "author": "Eli A"}, {"rating": 5.0, "review": "Great piece  of tech it has all the things I need to include caption since i am almost deaf", "verified": true, "helpfulness": "0/0", "author": "Edwin C. Hill"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Joseph martinez"}, {"rating": 5.0, "review": "Best thing going.", "verified": true, "helpfulness": "0/0", "author": "ry"}, {"rating": 5.0, "review": "Great little device that exceeded my expectations.I had the chrome cast and this device is way better", "verified": true, "helpfulness": "0/0", "author": "Jason Worley"}, {"rating": 5.0, "review": "Totally love the Fire Stick. My free month membership has been grea . I will be getting the yearly subscription", "verified": true, "helpfulness": "0/0", "author": "Tara Meeks"}, {"rating": 5.0, "review": "So far, superb!!  I had been watching my Prime videos on an iPad, then on a Mac, but being able to watch shows on the big screen TV is great.  Works flawlessly with Amazon content, I believe the audio coming out is also far superior to Directv; video quality is at least as good.  I tried the Google dongle using Chrome but the video quality was standard definition at best.  I think for Amazon content, Fire is the best bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Gorena \"schizaphis\""}, {"rating": 5.0, "review": "Works great and is so easy to use. I definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Cristine M Burns"}]