[{"rating": 5.0, "review": "Great,useful tv stick", "verified": false, "helpfulness": "0/0", "author": "JULIETTE VILLA"}, {"rating": 5.0, "review": "great product works very well no issues watching movies", "verified": true, "helpfulness": "0/0", "author": "Tim Woodall"}, {"rating": 5.0, "review": "I love this device. Now, having said that, here is why. We had a wii to watch our Netflix (very bad channel always freezing or not working) and when I got PRIME 2 years ago. We could not watch it well on the wii. Whenever we would buy a movie (even HD) we could only ever watch it in SD (SUCKED) but eventually we knew to save the extra $1 for HD and just rent the SD. But we always had problems with buffering. Yes, I understand the WII is practically ancient, but we are a budget conscious family, and it worked, so we stayed with it. Until July of this year -2015. I must repeat this multiple times throughout this review. \" I LOVE THIS DEVICE!\"As other 5 star reviewers, setup was super-easy. We had it working withing 10 minutes (problems with our router -hoping to buy another one -dual band since we have so many wireless devices (we are a family of 5 with 4 smartphones, and 3 computer, game systems and now the fire tv stick)But I digress. Our tv was purchased in 2010. Its a Phillips 40\" but it is not a \"smart tv\" It has 3 HDMI ports, and luckily there is a plug about 3 feet from the hdmi port on the side. -The stick needs additional power (make sure you use the dongle) so it must be plugged into an outlet in addition to the HDMI. For us this was NOT a problem, but if you do not have this, be aware.Now, I am a PRIME member (you just can't beat the 2 days shipping especially if you are a habitual procrastinator such as I (especially around holidays such as Christmas and Birthdays ;-) So this device was doubly nice. I did not purchase the voice remote -outrageous price (as much as the stick itself!) but I did download the Fire TV stick app for voice search, and it is good enough for me. A must have for fast setup rather than hitting over and up and down to put in network SSID and password. THE FIRST THING YOU SHOULD DO IF YOU have a smart phone is download thiss APP. We don't play games, but its nice if we decide to especially with my tech savvy 7 year old. Currently we have only used it for Netflix and Amazon. Since my kids have  tablets, we also do Flixster and I have yet to sign in to access our digital movies. (I only purchase DVDS -for the most part- that include the DIGITAL UltraViolet. LIFESAVER for long road trips!  I liked the portability option to take on vacation -Have not done this yet. Seriously thinking about purchasing 2 more for my kids tvs in their rooms.To make a long story a little shorter, lol, I have had NONE of the problems the 1 Star raters had. This has Dual-Band, and as we have been having issues with our router, I am going to be purchasing a dual band to help with this, and will update this review if needed. We have had this for 3 months, and WE LOVE IT. Thanks AMAZON!Lastly- I have a HD 7 Fire and do not have the option for mirroring, or flinging.", "verified": true, "helpfulness": "2/2", "author": "mother.jeni"}, {"rating": 5.0, "review": "Great appendage for my TV! Don't know why I waited so long to get one!!!", "verified": true, "helpfulness": "1/1", "author": "Jose Roberto Dominguez \"Mad Scientist\""}, {"rating": 5.0, "review": "A good choice", "verified": false, "helpfulness": "0/0", "author": "Juan H. Ott"}, {"rating": 4.0, "review": "Love being able to stream movies and music instead of hooking up my laptop to my tv. Little bulky on the back of my tv but worth it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got one of these for my mother and she absolutely loves it! It's easy to install, setup, and use. Compared to all of the different options out there this is definitely my choice.", "verified": true, "helpfulness": "1/1", "author": "Tyler"}, {"rating": 5.0, "review": "Easy to set up and use. Really enjoy watching on \"the big screen\" when at home.  I take it whenever I travel and watch in my iPad which is very convent when TV reception is poor.", "verified": true, "helpfulness": "1/1", "author": "Kathy Hughes"}, {"rating": 5.0, "review": "I bought this for netflix before realizing that I could just have used my PS3 for the same thing.", "verified": false, "helpfulness": "1/1", "author": "Kevin David"}, {"rating": 2.0, "review": "Well my main reason for purchase was the music.  However, the interface is far more restrictive than I expected.  I pay for prime music and it is a pain to find new music, build and listen to my playlists.  I will be returning it, and  will wait until the stick can access prime music in the format available on my computer.", "verified": true, "helpfulness": "1/1", "author": "steven p therrien"}]