[{"rating": 4.0, "review": "I ordered two when they were $20 and I received them much sooner than the expected delivery date.  After a day of use,  here are my thoughts:-I mainly stream Netflix,  hulu plus,  Amazon prime content and Pandora and before this,  I was streaming off blu ray players so I was looking for a more direct and smoother interface.-I also feel duped by the stick needing to be plugged into a power adapter since amazons description mentioned nothing about it but due to my tv/media stand/power strip setup,  it turned out to be a non issue for me.-Initial setup on the TV in my room which is furthest from the router was a bit of a pain because it took three tries to get it to update.  This may have been due in part to reception in there being unstable at times. May also be due in part to Amazon server being overloaded.Set up on the TV in the living room that is closest to the router was a breeze.-For those complaining about the battery compartment.. I had zero issues with both of mine.  Simply apply pressure to the top where the bar imprint is and slide down.  Took me 2-3 tries on each but came off easily.-After updating in the bedroom TV,  I tried playing Netflix and it rebuffered three times in 3 minutes,  then when you pressed any button on the remote,  the lag between press and something happening was a 30+ seconds.  Not a good start.  I restarted the stick and everything has been good since.  The living room TV has had zero issues so far.-Overall, I'm happy with the stick so far especially at the price I paid for it. It does what I want it to do,  streams HD smoothly and stays out of my line of sight.  I also really like that the stick doesn't require you to turn it on and off.  As long as it's plugged into a power adapter,  it will turn off after 30 minutes of no use and turn right back on to where you left off when you turn your TV on. The remote is also nice and simple and you don't have to point it at anything in particular to get it to work.I will update this review if anything changes.", "verified": true, "helpfulness": "0/0", "author": "Desirella"}, {"rating": 5.0, "review": "Easy to set up, easy to use. We love not having to connect the laptop to the television to watch our videos now. !!!", "verified": true, "helpfulness": "0/0", "author": "Bruce J. Carter"}, {"rating": 5.0, "review": "Wow this has incredible amounts of information, and, is quite user-friendly.", "verified": true, "helpfulness": "0/0", "author": "Mike Davis"}, {"rating": 5.0, "review": "Received the Fire TV Stick earlier than originally told.  The setup was easy and straightforward.  Great product that will only improve as more apps become available.", "verified": true, "helpfulness": "0/0", "author": "Matt H"}, {"rating": 4.0, "review": "So I won't go into as much detail as other reviewers.Reasons I like it- Perfect for the tv in the bedroom.- Plenty of applications for us (costumers)- It was $20- Comes with a remote.Reasons I don't like it- Doesn't have xfinity to go- Doesn't allow mirroring of iOS- Limited game selection- Doesn't like being USB'd into my cable box- Remote feels cheap and could break easy (Both plus and negative)ConclusionIt is hard to pick apart the features when the Fire Stick cost 19.99, If i paid full price I would say I wouldn't have gone with it. It is just easier to bring my laptop into the bedroom and hook it up to my tv, since I didn't pay full price 4/5 stars.", "verified": true, "helpfulness": "0/1", "author": "Shaun Santos"}, {"rating": 5.0, "review": "Very happy with the operation of the fire stick. Along with the prime membership, there is a lot of entertainment to take in. I also have the fire tv & rate that the same. Very good products.", "verified": true, "helpfulness": "0/0", "author": "236palm"}, {"rating": 5.0, "review": "Wow- I love it. Fast, clean, simple setup. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Gerard Flower"}, {"rating": 2.0, "review": "Feel like I was taken by Amazon on this one.  It works fine and seems good quality but I didn't know it was a lesser version and didn't come with the voice commands.  Even the instructions talk about voice command but it isn't there.  Be careful what you order.  Amazon usually stands behind there products very well but I feel duped on this one.", "verified": true, "helpfulness": "1/5", "author": "BuffaloBill"}, {"rating": 5.0, "review": "I find myself boycotting the outrageous prices apple commands for its hardware and have steadily changed over to kindle fire tablets, amazon prime, and now fire tv. This little device is a must have for anyone with prime and / or amazon content. The included accessories look and feel high quality and I've found them completely interchangeable with other Amazon products I own.My tv was able to power the Fire Stick solely from the usb port (despite the Fire TV Stick's warning) with no noticeable problems. The initial download was quick and from unboxing to watching a move took about as long as it took to make the popcorn and get the drinks.I was fortunate enough to get the $20.00 pre order but even at the current price the fire stick is a great deal.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 4.0, "review": "I purchased this already having a chromecast for another set in the house.  The fire stick does everything it can do and more.  Obviously, you get the advantage of Amazon video and music, but you also get the remote.  I love the fact that I dont always have to have my phone/tablet on me to be able to watch TV.  Which brings me to the one thing I don't like.  The remote is bluetooth.  This is great for no interference and no need for line of sight, but there is no way to use a universal remote with it.  I still need my other remote for volume control.", "verified": true, "helpfulness": "0/0", "author": "h2oskierfl"}]