[{"rating": 4.0, "review": "Haven't used it yet, but my daughter has and she loves it.", "verified": true, "helpfulness": "0/0", "author": "Myrna Thurnher"}, {"rating": 1.0, "review": "NOT Happy it woks fine on Amazon prime but lousy on Netflix the picture turns fuzzy after a few seconds. I'm sorry I got it.", "verified": true, "helpfulness": "0/0", "author": "G Fox"}, {"rating": 5.0, "review": "Was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Gail Besser"}, {"rating": 1.0, "review": "if it connected and stayed connected to my wifi it could be great...", "verified": true, "helpfulness": "0/0", "author": "morenoja"}, {"rating": 5.0, "review": "Up to this point, I have been very satisfied with the device using it daily.", "verified": true, "helpfulness": "0/0", "author": "Ros"}, {"rating": 4.0, "review": "I am also using Chrome cast (Google) I found fire stick is better in many ways. I also likeBeautiful Pictures with Fade in n out.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "Work great,just wish there was newer movie's to watch", "verified": true, "helpfulness": "0/0", "author": "James John"}, {"rating": 5.0, "review": "For such a bargain-priced streamer, I expected the Fire Stick to be slow and limited, but that couldn't be further from the truth! It feels as responsive as, say, my Apple TV or Roku, and the menu system and app are great! Voice search through the app is especially useful, and it's awesome that the remote uses Bluetooth because it can go through walls and A/V cabinets if you keep your equipment out-of-sight (like I do).The main draw for us, however, is that it seems to be the least expensive, most user-friendly way to stream Amazon Prime content, and since Amazon currently has an exclusive on Nickelodeon shows like Dora, Diego and Julius Jr., it's a favorite of our littlest daughter!Well worth the price. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "P. Colin McGraw \"AV, Computer & EnviroTech Nut\""}, {"rating": 5.0, "review": "Love it and it works great! Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Sunny Floridian!"}, {"rating": 5.0, "review": "I bought the Fire Tv Stick in order to sync my LG tablet to my TV. The Fire Tv Stick mircast capability that I needed.  It's a great device and I have no problem viewing from my tablet or watchINGAING Amazon Prime movies. I am very satisfied with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Lisa M."}]