[{"rating": 5.0, "review": "Easy to install- easy to use- great product, I was a previous chromecast user-- this is SO much better!", "verified": true, "helpfulness": "0/0", "author": "bobby"}, {"rating": 5.0, "review": "I love my Fire TV Stick. I've been able to catch up on shows I didn't get to watch and I love that I can remove it and put on another TV,", "verified": true, "helpfulness": "0/0", "author": "Faye C"}, {"rating": 4.0, "review": "Easy to install and works freat.", "verified": true, "helpfulness": "0/0", "author": "Bill Stanfield"}, {"rating": 1.0, "review": "It never works.  Always says network connection unavailable, but then when I run my prime though my DVD player, there is always a connection available.  It would be easier to use then going through the dvd player every time if it actually worked, but unfortunately, we haven't had any success since buying it.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 4.0, "review": "Easy to set up.  Works each time - hassle free.", "verified": true, "helpfulness": "0/0", "author": "E Kowalski"}, {"rating": 5.0, "review": "Works as advertized. Doesn't need the strongest wi-fi signal to function anywhere in the house.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Mark Bacon"}, {"rating": 3.0, "review": ". I was so excited when I opened this Christmas gift, which seemed to access well the first two weeks.  It's been downhill since then with constant access issues.  When it works, it's great.  There seems to be no consistent reason why it suddenly freezes or loops.  Access is sometimes limited  or unavailable.  I have changed batteries, held down buttons, etc, listed on Help website and it's still temperamental.  Would I suggest it to someone else?  No.", "verified": true, "helpfulness": "0/0", "author": "Lea"}, {"rating": 4.0, "review": "From initial use, it seems pretty solid. I have experienced a few problems where the sound goes out, but the picture doesn't. That gets annoying really fast. The other complaint I have is that you have to go through 3 menus to put it into 'sleep mode'. Either the remote should have a shut down button OR they should put an option right on the main menu to do that.", "verified": true, "helpfulness": "0/0", "author": "Joseph Malinowski"}, {"rating": 5.0, "review": "Awesome!  It's very easy to connect and set up. We used it to replace the internet streaming from our dvd player.  It's faster on YouTube and also has Netflix app and prime video.  Weather apps and news apps and so much more! Some apps are free trial and then you have to pay. But overall there are many free ones and we haven't even seen them all. I think we could completely do away with dish now!  I have chrome stick in our game room but I like the fire best overall.", "verified": true, "helpfulness": "0/0", "author": "Sherry Hunter"}, {"rating": 5.0, "review": "love this thing.", "verified": true, "helpfulness": "0/0", "author": "william anderson"}]