[{"rating": 4.0, "review": "Works great. Easy to use!", "verified": true, "helpfulness": "0/0", "author": "john cederstrom"}, {"rating": 5.0, "review": "I had an Apple TV for a while and just received the Fire stick I couldn't find a difference only that it's a lot smaller ,It works very well ,though non prime movies are rather expensive to rent .", "verified": true, "helpfulness": "0/0", "author": "Lou"}, {"rating": 5.0, "review": "So much better than my Blu Ray player with the apps built in.  Connects so much quicker and every TV app I could want.  So excited the last update came with HBOGo.  Stream GoT weekly with no hiccups.  Hulu has some lag and freezing issues that I believe are not this Stick's fault because Prime, Netflix and Flixter stream great.  I do wonder if the size of this thing means it lacks memory so Hulu can buffer better.", "verified": true, "helpfulness": "0/0", "author": "Gene C \"li0nhart79\""}, {"rating": 5.0, "review": "Absolutely love this product so much we cancelled our cable.", "verified": true, "helpfulness": "0/0", "author": "Andrea Wills"}, {"rating": 3.0, "review": "I purchased to install XBMC/Kodi. If you're looking to install other stuff such as Showbox or HD Cinema, then try a different unit like the Skystream X4 which allows you to use Mouse and keyboard as some apps require it.If you are new to XBMC/Kodi, installation of those Apps can be tricky and requires some level of tech. I installed it in less than 5 minutes, but could be frustrating for some.Will not play 4K Videos in XBMC/Kodi as it is only a Dual Core.However, everything else seems to work fine with no issues.", "verified": true, "helpfulness": "0/0", "author": "Jack Triphorn"}, {"rating": 5.0, "review": "Before the Fire TV Stick, movies and tv shows were choppy and hard to watch. After the Fire TV Stick, we have had NO problems watching anything on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Kirsten Storm"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Christina Will Spears"}, {"rating": 5.0, "review": "We have one cable box and our bill is outrageous, so I bought this for my daughter's room. I may get one or two more and tell comcast where to stick it.Set-up took less than ten minutes.", "verified": true, "helpfulness": "0/0", "author": "Kim Mullican \"I exist on coffee alone.\""}, {"rating": 4.0, "review": "The device works fine, but we felt fairly misled in one major respect: You get the impression you can watch all the programs/networks it advertises, but the fine print is you need to have a special, paying membership with nearly everything for the Stick to be of any use (unless you just want to use it for YouTube, which is free so far). So, that's our main disappointment.", "verified": true, "helpfulness": "0/1", "author": "P. Hulton"}, {"rating": 4.0, "review": "I am a big fan of the fire stick. It has so many features. Los to choose from. My only complaint is it sometimes will freeze and speed up to catch up. Not sure why.", "verified": true, "helpfulness": "0/0", "author": "Josh Davis"}]