[{"rating": 5.0, "review": "I absolutely love the Amazon Fire TV Stick. Previously, I received the goggle crome stick as a gift from my sister and it just was not that user friendly. The google stick was cumbersome to use but the Amazon fire stick does everything that I need it to do. It is amazing and I am so happy to have it.", "verified": true, "helpfulness": "0/0", "author": "Miami4Life"}, {"rating": 1.0, "review": "Netflix app has developed an error that we can no longer access Netlix using Fire TV Stick.  The HDMI connection is difficult to insert into our Samsung Smart TV. I received as an enticement to use Sling TV so the price is the only saving value.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Gilgenbach"}, {"rating": 5.0, "review": "Love it! I had struggles with getting my wifi ready tv to work for two years--Fire stick was up and running in three minutes (3!!). So so so happy!", "verified": true, "helpfulness": "0/0", "author": "john colman cleary"}, {"rating": 5.0, "review": "The Fire Stick has been working great. It was very easy to use prime membership to watch movies and TV shows. Once we installed the YouTube app, that became second nature for everyone in the family to use. The only annoyance is having to use the joystick pad to select letters for searching. Considering the nature of the way this device is used, I think a keyboard of some kind would be a great idea. Maybe even allow for use of wireless keyboards from computers.", "verified": true, "helpfulness": "0/0", "author": "st970742"}, {"rating": 5.0, "review": "Great and easy to use. Plugs right in and sets up quickly. Processes everything far more quickly than my Samsung blu-ray.", "verified": true, "helpfulness": "0/0", "author": "vicki in sc"}, {"rating": 2.0, "review": "I like what the stick has to offer. But I really don't like the fact that it freezes up so much.  I placed the wireless router right next to it and it still freezes up.", "verified": true, "helpfulness": "0/0", "author": "Deraved"}, {"rating": 5.0, "review": "Love everything about the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}, {"rating": 5.0, "review": "easy to use!", "verified": true, "helpfulness": "0/0", "author": "dara"}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Michael Regnier"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "susan m churchill"}]