[{"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 2.0, "review": "Not what I hoped for. It drops the signal all the time stops ans starts. It's a foot from my WiFi. I hate fact you can't use it with a Universal Remote. I MUCH prefer my Roku 3. Not sure where all the great reviews came from its nothing special, it barely works. I am going to throw it in a drawer and buy another Roku 3.", "verified": true, "helpfulness": "0/0", "author": "J. Griffiss \"lil goat\""}, {"rating": 4.0, "review": "It's a great thing to have", "verified": true, "helpfulness": "0/0", "author": "cheryl perry"}, {"rating": 5.0, "review": "Control is tiny, lost it twice in one 24 hour period.  Works so much faster than my Bluray player did for accessing program.  I would buy another if this one stops working.  Very few times of stalling and I have a really slow internet (Century link will not upgrade here)  Also the picture are sharper then what I used prior.", "verified": true, "helpfulness": "0/0", "author": "Bend RN \"moongoddess\""}, {"rating": 5.0, "review": "Best in class today! A++ I can do almost anything that I want. Music, movies and games. It's like a computer.", "verified": true, "helpfulness": "0/0", "author": "Brad Merle"}, {"rating": 5.0, "review": "Easy to set up ! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "beverly"}, {"rating": 4.0, "review": "It works slick and it adequate for what I need. Also the price is right.", "verified": true, "helpfulness": "0/0", "author": "Ed Stallings"}, {"rating": 4.0, "review": "Great invention! Almost like a smart tv. Add internet capabilities and I'll rate it a 5 star....", "verified": true, "helpfulness": "0/0", "author": "Robert Polio"}, {"rating": 5.0, "review": "We use it every day, works great 99% of the time. Every now and then we have to disconnect the power and plug it back in, because the wifi drops out. Other than that, it is our favorite way to watch online streaming. We only have the others because Amazon does not have an app for them, like: Apple TV, Vudu stick, and ChromeCast.", "verified": true, "helpfulness": "0/0", "author": "jmbtwo"}, {"rating": 5.0, "review": "Have one in every tv in our home.  Love the fire stick!", "verified": true, "helpfulness": "1/1", "author": "Andrew Searle"}]