[{"rating": 4.0, "review": "I just wish Amazon had more network TV apps available, like TNT, TBS, ABC, FX, Direct TV, Hgtv", "verified": true, "helpfulness": "0/0", "author": "chris terredanio"}, {"rating": 1.0, "review": "Wrong item was mailed to me.", "verified": true, "helpfulness": "0/0", "author": "SuperWoman"}, {"rating": 5.0, "review": "Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Nancy J Adams"}, {"rating": 4.0, "review": "Set up was quick and easy. Interface is easy for Amazon content although it is a little clunky for other apps. Haven't figured out how to display downloaded apps other than to go through the recent apps section.", "verified": true, "helpfulness": "0/1", "author": "Mitchell Fiedler"}, {"rating": 5.0, "review": "This is a much simpler device for use on Amazon Prime.  Works well.", "verified": true, "helpfulness": "0/0", "author": "George A. Shouse"}, {"rating": 5.0, "review": "I cut the cord 9 years ago, and I recently said good bye to my tivo and have to admit, the very inexpensive firestick with hulu and some crossy road has helped the grieving. It's not perfect, it does chug on occasion, but for the price and convenience, I couldn't be more pleased. My children, who have a bit of an addiction to the amazing world of gum ball, would revolt if I were to give it up!", "verified": true, "helpfulness": "0/0", "author": "Brian Polk"}, {"rating": 4.0, "review": "still learning how to use the stick so far it is amazing! I am able to watch any movie I want to see.", "verified": true, "helpfulness": "0/0", "author": "myra redd"}, {"rating": 5.0, "review": "I love it, works great...", "verified": true, "helpfulness": "0/0", "author": "Herman Hughes"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "FiatDale"}, {"rating": 2.0, "review": "Does NOT work with HULU.  Netflix, Amazon Prime, all other apps are fine.  Hulu will lag and ultimately freeze after a few minutes.  Not a bandwidth issue, not a wireless channel issue.  Google is filled with posts about people with this same problem, no response from Amazon.  I got my Fire Stick as a gift.  I will be returning it for a Roku.", "verified": false, "helpfulness": "0/0", "author": "Max"}]