[{"rating": 2.0, "review": "If I had the Stick first then I would probably write a much better review.  Unfortunately this box is underpowered compared to the regular fire tv.  If you need something for bottom dollar then this works as advertised.  If you can justify the extra money, just buy the fire tv.  It is much faster with the voice search.  I also noticed that it will freeze more often than the regular fire tv.  I will probably be replacing soon", "verified": true, "helpfulness": "0/0", "author": "Shawn M"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Steve Scott"}, {"rating": 1.0, "review": "So far, I have not been able to get this to work at all.", "verified": true, "helpfulness": "0/0", "author": "jsomer"}, {"rating": 4.0, "review": "Works great. Bought it to supplement tv shows after cutting cable.  Only reason for the 4 star is that the stick needs to have a USB power cord plugged into the side of it to work.  This is not mentioned in any advertising or packaging anywhere that I could see prior to purchase.  It makes the whole \"convenience of switching it to other TVs\" not very convenient.  Some of my other TVs do not have open outlets or they are too far for the plug to reach.  I really didn't want to have to add power strips to everything just to allow Fire Stick use, as it was advertised as \"Easy to switch to other TVs\".", "verified": true, "helpfulness": "0/0", "author": "Jeff Taplick"}, {"rating": 4.0, "review": "I love the idea of this gadget. And it works well. If you live in the country as we do you have to have a really good and fast internet service. And you have to pay attention to your internet limitations.  We actually bought this to see if it could replace the satellite tv service we have. (The stations we prefer you have to pay the higher price). So overall it is a cool thing!", "verified": true, "helpfulness": "0/0", "author": "DS"}, {"rating": 5.0, "review": "got it free with my sling tv very happy with it i like it better than my apple tv because i like being able to search and download apps", "verified": true, "helpfulness": "0/0", "author": "Steve Crosby"}, {"rating": 1.0, "review": "I had high expectations for the fire stick. It had great reviews, however;  we have had nothing but problems with \" connectivity\" issues. Our internet service works fine with all of our other wireless devices and it says our connection is \"very good\" but somehow we cannot connect even with Netflix.  We tried resetting as advised by the troubleshooting prompts on the fire stick but still it will not work. I'm so disappointed.", "verified": true, "helpfulness": "1/1", "author": "Melissa Byerwalters"}, {"rating": 5.0, "review": "Got 2 cheap on intro preorder.  So nice I got a third at full price.  Super easy to use and great with prime.", "verified": true, "helpfulness": "0/0", "author": "Adam Kottas"}, {"rating": 4.0, "review": "The apps offered in this stick provide a great experience and is miles above ChromeCast due to having a remote and being independent of other systems such as a computer or tablet.  I do find however sometimes it can load slowly indicating it is a bit underpowered, but the videos still play just fine which is all that matters.Where this loses one star however, is what I found out about the other day.  This product will not work at all if you do not have an internet connection.  The other day my internet went out, but I figured since I have a local media server and Plex on the fire stick, it shouldn't be a problem since it would simply stream the movie locally.  Unfortunately the fire stick wont load any apps if it can't connect to the internet, including a local player such as Plex.  Quite frankly, this was a big disappointment since I was forced to use my tablet to watch the movie rather than my TV.Other than that issue, this product is great and I'll probably get more for the other TVs in the house.", "verified": true, "helpfulness": "0/0", "author": "meltingcube"}, {"rating": 5.0, "review": "Big improvement over my experience with a Roku stick (which I returned).  Installation and setup in less than 10 minutes (spent hours on the Roku and it never would connect to my wifi network).  Seems just as functional as my Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "Joe B Stanley"}]