[{"rating": 5.0, "review": "Took 2 minutes to set up right out of the box. So far, it has worked perfectly!", "verified": true, "helpfulness": "0/0", "author": "Hawk Golfer"}, {"rating": 5.0, "review": "GREAT ITEM FOR THE PRICE", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very responsive. Great streaming Netflix/Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Shawn Powers"}, {"rating": 5.0, "review": "LOVED it! Works better than my Roku ever did. Great speed, easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Katlyn"}, {"rating": 5.0, "review": "Very quick setup!  This replaced my Google Chromecast.  Very easy to use and navigate menus.  My daughter loves the game so I'll probably have to order game remote.  Overall very satisfied.  So good for $19.99!", "verified": true, "helpfulness": "0/0", "author": "Andy Anders"}, {"rating": 4.0, "review": "love it, basically a smaller less expensive version of our fire tv", "verified": true, "helpfulness": "1/1", "author": "Savana Kretchmar"}, {"rating": 4.0, "review": "So here are the streaming devices our family currently has:Roku 2100X XDSRoku 2 XS3rd gen Apple TVVarious streaming blu ray playersPS3Amazon Fire TVAmazon Fire TV StickThese are the services we use:iTunesAmazon Instant Video (Prime also)Netflix StreamingHulu PlusVarious Cable TV related appsIn the end the our favorites are the Apple TV and the Amazon Fire products including the Fire Stick.We originally liked the idea of Roku until we realized that over time, Roku does not allow updates to the apps on older models.This effectively forces you to but the newest model of the Roku to get updates to apps.  It's one thing for the Roku operating system but for the apps, this is unreasonable.  This does not seem to be the case with the other devices.  As least at this time.  They are also all cheaper than the higher end Roku devices.  But I'm digressing, if you primarily use the more mainstream apps like Netflix and Hulu as well as Amazon related media, than the Fire TV stick is a no brainer to me.  It's cheap and it's fast.  We liked the Fire TV enough (it originally replace one of our Roku's) that we got another one to replace our other Roku.  The Fire Stick and Fire both stream things much faster than our other devices...including our Apple TV but we have lots of Apple devices so that's why the Apple TV is in our top three.  In any case, I think that's the main reason to get the stick over other devices aside from the relatively cheap cost is the speed.  It was always annoying how long it takes to load videos.  And i think the only real difference between the Fire Stick and the Fire TV is the voice recognition remote.  We really don't use that function on the Fire TV so it wasn't a lost to use.", "verified": true, "helpfulness": "2/3", "author": "RKC"}, {"rating": 4.0, "review": "I have only had it a few days but I think its pretty great. The GUI is slick and fast. Only thing I didn't like was that I was hoping to power it with a USB port on my TV but the stick didn't like it and wanted an AC power source.Not a big deal I guess.", "verified": true, "helpfulness": "1/1", "author": "Todd Wagner"}, {"rating": 5.0, "review": "Surprised, I was expecting something like chrome cast but with prime movies also, but when I set it up and found that all services were available without having to start on tablet, I was thrilled.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works awesome. Super fast. Great buy. Only issue is that the Miracast doesnt work with my Sony Xperia Z3 but other than that, great device.", "verified": true, "helpfulness": "1/1", "author": "Ryan"}]