[{"rating": 5.0, "review": "works so well I bought one for our motorhome!", "verified": true, "helpfulness": "1/1", "author": "Cal Newton"}, {"rating": 1.0, "review": "Does not stream content well. It's very slow, constantly freezes and picture quality is poor. My blue ray player streams video much better, never freezes and has a much better picture. Very disappointed with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Kruger"}, {"rating": 5.0, "review": "Works great to provide lots of options for cable-free living. With Netflix, Amazon Prime movies and music, Sling, Pandora, and various other apps at our finger tips, we aren't missing our whopping cable bill one bit!", "verified": true, "helpfulness": "0/0", "author": "S. Mccarter \"crazy mom\""}, {"rating": 5.0, "review": "The first one we bought wouldn't stay connected. After reading some reviews and realizing it was a problem with some I called Amazon. They were wonderful. The sent a replacement and a return slip for the first one. I could leave the connector on the TV and keep the remote. I only returned the stick. I got the replacement in a couple days and it worked perfectly. Now we have one in the bedroom and well as our Fire TV in the living room. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "L. Eder"}, {"rating": 5.0, "review": "Amazing device, very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Antonio"}, {"rating": 5.0, "review": "Wow.  It works great!!  The user interface is fantastic...very Apple-esque.  The fire stick itself looks like a long USB thumb drive with an HDMI connection instead.  It plugs into an HDMI plug on your TV & you control it with a small remote.  The small remote only has 4 buttons with obvious functions, plus a jog dial.  Very easy to navigate the onscreen menu and the interface is very easy to navigate.  I do agree with other reviews that's it's really annoying how Amazon mixes together the \"free with Prime\" shows in with the shows you have to pay for.  More than once I've picked a show I want to watch & then realize it's an extra charge.  The fire stick itself is wonderful and easy to use with loads of streaming services available directly from the menu.  Highly recommend!", "verified": true, "helpfulness": "1/1", "author": "beancounter"}, {"rating": 5.0, "review": "I love the Fire TV stick, I use it in my bedroom.  Gives my TV all the smart apps efficiently.  I recommend it if you do not already have a smart TV.  If you already have a smart TV, you may not need this..", "verified": true, "helpfulness": "0/0", "author": "Eric T"}, {"rating": 3.0, "review": "I got what I paid for. My opinion - not the greatest thing. Downloading movies can be troublesome with buffering. I don't have the problem when I stream to other devices.", "verified": true, "helpfulness": "0/0", "author": "Ruth"}, {"rating": 4.0, "review": "Love it! Does a good job of streaming all my stuff. Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Snow41"}, {"rating": 4.0, "review": "I love this product is so amazing how they did this fire stick to work so good so if anybody wants to buy this go head is worth the money even the sideloading  application (apk) is pretty cool.watching movies from hulu plus and amazon prime is so much fun ur alway have something to watch", "verified": true, "helpfulness": "0/0", "author": "Jose R Rodriguez"}]