[{"rating": 5.0, "review": "Honestly, having this fire stick will eliminate the need for cable.  The Kodi App is an wonderful addition. Overly impressed with this device.", "verified": true, "helpfulness": "0/0", "author": "Jimmy E."}, {"rating": 5.0, "review": "Great, I love it!", "verified": true, "helpfulness": "0/0", "author": "Antonio Leong"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Scott Clark"}, {"rating": 4.0, "review": "Works pretty good the remote and navigation are easier then I expected. The one bad thing is the picture resizing doesn't allow me to size the picture correctly you can only adjust bigger or smaller not left to right or up and down. So I either have a little bit of unused screen or I lose just a little bit of the image? It is close but this could be fixed if I was able to adjust left right and up down like my Google tv", "verified": true, "helpfulness": "0/0", "author": "User"}, {"rating": 5.0, "review": "works real good with my wifi network", "verified": true, "helpfulness": "0/0", "author": "Annie D. Clover"}, {"rating": 5.0, "review": "Lots of features makes it a little cumbersome, but worth it.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Adrienne Laurion"}, {"rating": 5.0, "review": "This is the second FireStick I purchased from Amazon. The first was for my daughter. Then when I replaced my old TV, I purchased one for myself. We really enjoy all the options and it is so incredibly simple to install. We love it!", "verified": true, "helpfulness": "0/0", "author": "jwatson"}, {"rating": 5.0, "review": "This item finally works as intended. Now all Amazon has to do is get some movies that are worth the fee. OH, that's right, their \"free\". That explains it!", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "We can't believe we didn't get this sooner! So small and provides so many options that has replaced our wii and blue ray DVD player and it's just a usb flash drive. The only qualm is they didn't mention sub port needs to be powered by a wall plug in. Also you have to buy the special  remote for voice controls.Otherwise we LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Shaleen"}]