[{"rating": 4.0, "review": "Works very well", "verified": true, "helpfulness": "0/0", "author": "bea jackson"}, {"rating": 5.0, "review": "Works great, we love it, bought two.", "verified": true, "helpfulness": "0/0", "author": "Cecil File"}, {"rating": 5.0, "review": "I was  bit skeptical at first, but this thing is great especially if you are a prime member. I got rid of Dish network and bought an over the air antenna to go along with the stick and haven't missed Dish at all. No more high satellite bills!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Panella"}, {"rating": 5.0, "review": "Great product.  So much better than the Sony DVD player we had been using to access amazon video content.  It's easier to navigate and about 5x faster to load programs (almost instantly).  Been using it about a month now, and only once did it seem to get locked up.  All I had to do was go to settings and restart it, which took less than a minute.  Haven't had any issues with needing to unplug it or anything I saw on other people's reviews.  Also, I hadn't seen this anywhere else, but I was able to connect this to my receiver, which then feeds video to the TV and sound to my stereo speakers.  It doesn't have to connect directly to the TV.", "verified": true, "helpfulness": "0/0", "author": "A. Paul"}, {"rating": 5.0, "review": "Took a little while to get the WI-FI set up. Works great!!!", "verified": true, "helpfulness": "0/0", "author": "James A. Smith \"jim\""}, {"rating": 4.0, "review": "We love it, Bing watched Justified. Only draw back is that we had to reset it a few times", "verified": true, "helpfulness": "0/0", "author": "Vernon Bishop"}, {"rating": 4.0, "review": "I love this device it let's me enjoy all my shows. If it had an Internet app things would be great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Skips some, despite fastest service our ISP provides. Seems to be a processing limitation of the device itself rather than a connection issue. Overall, still good performance for the price.", "verified": true, "helpfulness": "0/0", "author": "Amber E. Brown \"bambergirl\""}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "geoege estrada"}, {"rating": 5.0, "review": "The Fire TV Stick has exceeded my expectations.  Very easy to install and use.  The selections on Amazon( movies, programs, etc., ) are varied and so good I haven't signed up for any of the other services.  Definitely better than cable.", "verified": true, "helpfulness": "0/0", "author": "Jeanne Edwards"}]