[{"rating": 5.0, "review": "What I appreciated most was the ease in setting it up.  Plug it in, change the input source on the TV to the right HDMI port, enter your wi-fi password and bang.....you're in.", "verified": true, "helpfulness": "0/0", "author": "Steve in Texas"}, {"rating": 5.0, "review": "Best purchase ever!! The sound seems to have a problem sometimes, but other than that, I love it!", "verified": true, "helpfulness": "0/0", "author": "LisaB65"}, {"rating": 5.0, "review": "awsome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very convenient, much preferred over using a PC to order and watch online movies and TV shows.  Well worth the cost.", "verified": true, "helpfulness": "0/0", "author": "John Carr"}, {"rating": 5.0, "review": "Works great, love that I can take it on the road.", "verified": true, "helpfulness": "0/0", "author": "Neil Hull"}, {"rating": 1.0, "review": "I have a pretty constant 50 Mbits download and 10 Mbits upload from my service provider but yet in the evening I have constant dropped streaming and interrupted streaming mostly in the evening.  I also have Apple TV and never drop or have interruptions streaming.  I have an HD TV with 1080p support.", "verified": true, "helpfulness": "0/0", "author": "Steven Hreczuck"}, {"rating": 5.0, "review": "Great price. ..very fast and it is very simple to set up. ..wish amazon prime had more up to date titles for free but it's great anyway", "verified": true, "helpfulness": "0/0", "author": "Brad Garth"}, {"rating": 5.0, "review": "I love it!!! Streams perfectly and I love the additional apps.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "I like the Fire TV Stick a lot!  I would have given it five stars if the description/ads explained that you need to plug the stick into a power source for it to work. I am not a fan of that feature.", "verified": true, "helpfulness": "0/0", "author": "Jaime Conley \"addicted to books\""}, {"rating": 5.0, "review": "Love this.  It goes SO much faster than our blu Ray player (since we don't have a smart tv).  The only thing that annoys me is the remote is tiny and VeRY sensitive. So with 3 little kids (4 and under) it gets misplaced easily and when they are jumping on the bed and all around the buttons get pressed LOL!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}]