[{"rating": 5.0, "review": "I use Chromecast and the Fire TV Stick for streaming tv shows and movies so that's what I'm focusing on in this review. I'm a Chromecast fan, but for me the Amazon Fire Stick wins hands down because  I can stream from Amazon Prime and also Netflix, and the remote that comes with the Fire TV stick is more convenient.  I paid the full 39.99 and it's totally worth it.With the Fire TV Stick, I love that I can now stream to my tv while freeing up my iPad mini, which is how I usually watch shows. I love that Fire TV Stick has a remote. If you want voice activation, you need to download the app to your phone. (I haven't bothered to use that yet and don't really care about it.) Searching with the Fire TV Stick remote works pretty well, though it could be more intuitive. Basically, some shows are featured and you can select them with the remote, but otherwise it's an alphabetical search by name of the show or you can search by actor (which is cool I think). Picture quality is great and streaming is fast. I've experienced no interruptions in streaming as of yet. Setup was easy. You do need a nearby outlet and opening that remote to insert the batteries is a feat. Customer service explained just push down on the line and slide and if necessary take a screwdriver or tool to wedge in as you push and slide down. I finally got it open by wedging a dull knife in there. I'm a happy camper being able to watch Netflix and Amazon Prime on the big screen while still playing games, shopping, emailing etc. on my iPad mini. Fire TV Stick has other options, like gaming if you buy a controller, music, etc. But I'm not reviewing those functions as I will never use it for other purposes (especially because the Amazon Echo I ordered will be here soon and I intend to use that for music).As to Chromecast, we got one when it first entered the market and were so impressed with the capability of streaming Netflix on our big screen living room TV.  But unless it's evolved and I'm just not aware of the changes, for us it has had limitations. I watch Amazon Prime a lot and it is not available on Chromecast, so we really only use it for streaming Netflix. For that reason alone, the Fire Stick is preferable to me as I like Netflix and Amazon Prime. Also, Chromecast has no remote, and I have to use my iPad mini to start, stop, pause, rewind, etc. I get annoyed being responsible for the operation of the show the family is watching unless I'm watching it too. We also sometimes have lags in streaming Netflix. Chromecast is still a great product and was so innovative when it hit the market, but it has limitations and is not as versatile for my needs as the Amazon Fire TV Stick -- which in my opinion surpasses Chromecast for streaming shows because it has also has Amazon Prime available and has a remote I can use instead of my iPad mini. If I had to pick one, I would pick the Amazon Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 1.0, "review": "Garbage", "verified": true, "helpfulness": "0/2", "author": "Ed"}, {"rating": 5.0, "review": "Easy setup, easy use. Great product", "verified": true, "helpfulness": "0/0", "author": "justin"}, {"rating": 4.0, "review": "need one for up stairs now", "verified": true, "helpfulness": "0/1", "author": "Terrie badger"}, {"rating": 5.0, "review": "So far we love it.  Easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "kay"}, {"rating": 5.0, "review": "Great, I love it.", "verified": true, "helpfulness": "0/0", "author": "salim"}, {"rating": 5.0, "review": "Hands down the best tv stick for under $79", "verified": true, "helpfulness": "0/0", "author": "Waseem Traish"}, {"rating": 5.0, "review": "So much better than our Apple TV or Chromecast. It's nice to have a remote just in case you are charging your smart devices. Much easier to navigate and search than apple. If you have Amazon Prime this is a necessity.", "verified": true, "helpfulness": "0/0", "author": "S."}, {"rating": 5.0, "review": "Connectivity - GREAT! Variety - AMAZING! Best holiday purchase....EVER!", "verified": false, "helpfulness": "0/0", "author": "D'ana Downing"}, {"rating": 5.0, "review": "still learning, but so far so good.", "verified": true, "helpfulness": "0/0", "author": "Jill J Johnson"}]