[{"rating": 5.0, "review": "Setup in couple minutes. Awesome", "verified": true, "helpfulness": "0/0", "author": "ROGER STROUP"}, {"rating": 2.0, "review": "Product would not stream a movie on prime very disapointed the freezing up never quit . We can stream perfect using our kindle the product has major problems.", "verified": true, "helpfulness": "0/0", "author": "Michael  A. Began"}, {"rating": 4.0, "review": "So far it has been pretty good.  I have been unable to use it as much as I would like due to my travel schedule.  However I recently purchased a travel router which may allow me to use the device more. When I have used it I have found a number of TV shows and movies I like to watch.  And the addition of HBO Go in the spring will really make this a must have item.", "verified": true, "helpfulness": "0/0", "author": "Marsha Wells"}, {"rating": 5.0, "review": "hi my name is Jerry Watson and with the Amazon fire TV stick and I think that this is the best way within watching your TV shows and movies streaming through the Internet and I would tale everybody that I know a bout the fire TV stick through Amazon because I actually think that this is one of the best ways that you can actually watch your TV. with the Amazon fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Jerry Watson \"Jerry Watson\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "normag"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Benjamin L."}, {"rating": 2.0, "review": "Got it for 19 bucks and so far it is worth that but nothing more, loses network in mid show, very ify imho . Nice picture when u can keep it running. Not overly joyed with it , will go back to my Apple TV.", "verified": true, "helpfulness": "2/2", "author": "Beeman"}, {"rating": 5.0, "review": "works as designed - easy plug & play - great viewing & listening selections", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Simple to assemble and easy to use right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Kali the Cat"}, {"rating": 1.0, "review": "The installation was a breeze. However the connection is not consistent & when it is up it pauses every 20 sec. I've not been able to view anything without disruption.", "verified": true, "helpfulness": "1/1", "author": "Beancounter"}]