[{"rating": 3.0, "review": "While it works just as great as a smart TV does, what I don't like about this particular device is that it won't work ubless it plugged into to power source as well as television. So you can't just grab it and go like a true portable device.", "verified": true, "helpfulness": "0/0", "author": "A. Ort"}, {"rating": 5.0, "review": "I have a fire tv and now in my room the fire tv stick and i am very happy.", "verified": true, "helpfulness": "0/0", "author": "Juan R. Batista"}, {"rating": 5.0, "review": "It was very easy to install - and works great - so glad we ordered it from Amazon- as prime members we have a great selection of shows to choose from.", "verified": true, "helpfulness": "0/0", "author": "Frances Titus"}, {"rating": 5.0, "review": "Great little device.", "verified": true, "helpfulness": "0/0", "author": "Hien Nguyen"}, {"rating": 5.0, "review": "Works great, especially with the phone app. The phone app allows you to use voice recognition.", "verified": true, "helpfulness": "0/0", "author": "Carlo DeSando III"}, {"rating": 4.0, "review": "I didn't expect the USB power cord that must be attached, but suppose I should have.  Wish it was a little longer! Otherwise I LOVE this product.", "verified": true, "helpfulness": "0/0", "author": "Sierra Pedroza"}, {"rating": 5.0, "review": "Love this! We use it on a tv in the bedroom that has no cable outlet or box and it allows us to stream shows and movies easily. Previously, I would stream amazon though my kindle, which also works well, but the kindle had to stay plugged into the tv with an HDMI so I would have to get up to browse for shows to watch. The fire stick has a remote which allows me to be truly lazy and flip through content from wherever I am in the room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is one of my best acquisitions in streaming technology which I have purchased. I have cancelled my cable subscription and will be streaming all my program content using the Amazon Fire TV Stick and other similar products available on the market. However, the Fire TV Stick, with its remote control, it easily the best of these devices which can provide the services I need with little or no hassle. I highly recommend the Amazon Fire TV Stick for its solid construction and technology and ease of use.", "verified": true, "helpfulness": "0/0", "author": "TheChaNar"}, {"rating": 5.0, "review": "You guys are the best!!  We have firetv on main tv and stick on other...had a few minor glitches but response from customer service made up for the minor inconvenience!!", "verified": true, "helpfulness": "0/0", "author": "Ru2bsi \"Agi Cortez\""}, {"rating": 5.0, "review": "This is awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Poncho"}]