[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Loretta J. Hinton"}, {"rating": 3.0, "review": "I don't know sometimes it drops service when our roku doesn't and we aren't having problems with any other device in the house. It also stops when the microwave is going and its about 10 ft away when used in the kitchen...", "verified": true, "helpfulness": "1/1", "author": "Laura L. McFarland \"micky23\""}, {"rating": 5.0, "review": "Love it .. Easy to manover Instant Videos, watch list, libraries, games, searches and pictures.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I had skeptically high hopes for this device, I will admit that the feature set for this device is impressive and the ease of navigating the menus are very intuitive and easy to learn.  The problem lies in the performance, or lack thereof, the \"sync\" of the audio to the video is off on every stream type that I use (Crackle, Netflix, HBO Go, Prime).  I know it isn't my connection as my connection is around 60mbs with a 11ms ping.  I have wanted to return it but I just have not got around to it.", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 1.0, "review": "horrible firmware leaves device broken. poor customer support and virtually no idea of whats wrong or how to fix it", "verified": true, "helpfulness": "0/1", "author": "Ian"}, {"rating": 3.0, "review": "Eh.  My 4 year old Roku HD works better than this thing.  Netflix app playback is jittery.  Hulu playback is unbearable.  Amazon stuff works great (go figure).Not that impressed.", "verified": true, "helpfulness": "0/0", "author": "Sween"}, {"rating": 5.0, "review": "This is better than an Apple TV because of its open marketplace for Apps such as Plex which enables home media server capability for streaming purchased and private content from any source across the web.Better than the usual SMART TV interfaces offered because it has more apps and content and is not designed with cable TV as the primary input.Better than Raspberry Pi variations as set top boxes because of the specialty knowledge and extensive configuration needed to setup the RSP.At $39 it's also cheaper than any of the alternatives and comes with good integration for those of us who live on Amazon and can't imagine life without Prime.Only one major flaw that I hope is corrected via software update ASAP, specifically, Amazon Echo should be able to control Amazon Fire TV & Stick. Both already allow for voice controls via the iOS app and the remote. Why not allow \"Alexa\" to be my voice enabled remote interface to control my Fire TV? Trust me I have more than enough remotes lying around and considering I have 3 Fire TV's attached to TV's around my house, it's easy to lose or mixup the tiny black remotes.", "verified": true, "helpfulness": "0/1", "author": "CC"}, {"rating": 5.0, "review": "So far it's been working great... I love it.", "verified": true, "helpfulness": "0/0", "author": "unclefrank4"}, {"rating": 5.0, "review": "Works fine & looked new. Also save 10 bucks :)", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "So far not impressed . Regular messages about my internet being too slow. urn it off and turn on Netflix and it works fine.", "verified": true, "helpfulness": "0/0", "author": "sbrown3081"}]