[{"rating": 5.0, "review": "Very please. Lots of new programs. Speed and picture quality great.", "verified": true, "helpfulness": "0/0", "author": "Deanna Drum"}, {"rating": 4.0, "review": "works good once it connects,beware of what you click on. they will bill you for it. get a pin number!", "verified": true, "helpfulness": "0/0", "author": "marty heino"}, {"rating": 5.0, "review": "Its amazing what such a small stick can do. I held off on the Google Chrome device and now I'm glad I did. We use our Fire TV Stick on a nightly basis now, and it works great. We cut cable almost 2 years ago and have yet to find a device that really nails a lot of what we're missing. ESPN, Plex, Netfilx and Amazon Prime selection has just about everything we need. I see that TNT is becoming more stream friendly, so once they release an Android/FireTV app, we'll have everything replaced... without the $100 cable bill.From an operation standpoint, it works great. We use our Logitech Hub Remote 99% of the time, but the iPhone app works solid, and so does the remote. We probably unplug/reboot the stick once every two weeks as it seems like some apps become unresponsive, but thats understandable with technology. Sometimes you just need a reboot.", "verified": true, "helpfulness": "0/0", "author": "Trent Gillespie \"Trent Gillespie\""}, {"rating": 5.0, "review": "I love having all my shows in my room!! It makes your regular dumb TV a smart TV!", "verified": true, "helpfulness": "0/0", "author": "Nikky M."}, {"rating": 4.0, "review": "Versatile, lots of content, cheap, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "C.S. \"Chris S.\""}, {"rating": 4.0, "review": "Everything is great about the Fire TV Stick except for the fact that you cannot view screensaver pictures while listening to Pandora. Please Amazon change this feature because the landscapes that Fire TV Stick screensaver brings are beautiful. It would be nice to view them while listening to Pandora. Other than that the Fire TV Stick is fantastic!!", "verified": true, "helpfulness": "0/0", "author": "CAM"}, {"rating": 5.0, "review": "this is a great product setup is super fast you will enjoy how portable it is you can take it with you anywhere you go i recommed this product 100%", "verified": true, "helpfulness": "0/0", "author": "Milagros Cuellar"}, {"rating": 5.0, "review": "Meets all expectations!  The android app works great too.  It is faster and better than going through my Blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "Ninepounds"}, {"rating": 5.0, "review": "We absolutely love it!!!!", "verified": true, "helpfulness": "0/1", "author": "Lisa M. Clapp"}, {"rating": 5.0, "review": "I bought this specifically for use on the road. I stay 175+ nights a year in a hotel and trust me when I say, I needed the entertainment. The problem is, most hotels require you to visit an authentication screen via browser.....this is true with the Fire Stick; it has no browser capability. However, I invested in a HOOTOO travel router which allows you to visit a browser via your phone which in turn allows you to accept the terms and conditions page. I simply log on to the HOOTOO via my Fire Stick. Works like a charm!", "verified": true, "helpfulness": "1/2", "author": "ernie escontrias"}]