[{"rating": 4.0, "review": "Easy to install and setup. Being able to use the remote and voice control app on my phone is a plus. Loving it so far.", "verified": true, "helpfulness": "1/1", "author": "Fred Padgett"}, {"rating": 5.0, "review": "So many apps. Hours of entertainment.", "verified": true, "helpfulness": "0/1", "author": "Dorothea C. Belcher"}, {"rating": 1.0, "review": "Would not pick up a wifi signal where our Roku did (bought this to replace the Roku). Returned.", "verified": true, "helpfulness": "1/1", "author": "George"}, {"rating": 2.0, "review": "The service is fantastic; the gimmick of getting you to buy remote after remote and the previous ones become \"sofa lunch\".  I've purchased and lost another remote.  I called CS and asked how to locate the remote (surely, there is something I can make beep).  Oh no, you must find the little booger manually or buy a new one (another new one).  They act like it's no big deal to buy another remote, perhaps I should buy several and keep the extras for when I misplace the next one.No, I'm not buying another remote.  I've turned my smartphone into the remote and, aside for way too speedy scrolling, it works fine.  Damn, I'm still angry!", "verified": true, "helpfulness": "0/2", "author": "Jo"}, {"rating": 5.0, "review": "Best investment in entertainment I ever made. It was easy to set up, easy to use. I'm thoroughly enjoying it!", "verified": true, "helpfulness": "1/2", "author": "Alanna Parke Kvale \"Alanna Parke Kvale-\"Author/Freelance Writer\"\""}, {"rating": 5.0, "review": "I must be a bit behind the times because this was so much more than I expected. Guess what, the voice remote does work just as advertised!", "verified": true, "helpfulness": "1/2", "author": "Daggerly"}, {"rating": 5.0, "review": "I have both the full box and the stick.  The box definitely is faster than the stick.  Both are very smooth though and very powerful.  Great to have practically all of my streaming media options available.  Its seamless to pick up from any TV wherever you are in a series.  We actually prefer to use the fireTV box over the built in streaming apps on our vizio TVs because there is practically no lag.  The voice search is pretty nice but not essential.  Usually just saves time when searching for a long title.  However, after you have identified something with the voice control and added it to the watch list the stick and easily pick it up and play it on other TVs.  The screensaver was a nice little bonus.  Out of the box it has lots of great nature photography from all over the world.  You can also set it up to use your saved photos.  Music is nice over either pandora app or the amazon prime music app.  Well done amazon!  We are seriously considering using the sling app only for TV and dropping cable.  The only thing missing is local broadcast channels like ABC, NBC, etc.", "verified": true, "helpfulness": "1/1", "author": "W. Dan Marks"}, {"rating": 3.0, "review": "I have both apple tv and the fire stick. I kept having issues with the wifi dropping off where I had no issues with apple tv. Will be using the apple tv instead.", "verified": true, "helpfulness": "0/0", "author": "Bartender \"S\""}, {"rating": 1.0, "review": "I bought this product when it was selling for $19.  Should have sent it back after first use.  Where do I start?  Sound goes in and out when it feels like it.  Internet streaming is horrible. Constantly freezes up while watching something.  I have high internet speeds and have no other problems with other streaming devices we use.  Also, when searching for movies it all of sudden just goes off on its own  racing through the viewing choices like it is possessed.  Yesterday, I just ended my \"hate\" affair with this device and hooked up a ROKU 3 box.  Finally a device that works.  Amazon, you need to go back to the drawing board with this one.", "verified": true, "helpfulness": "0/0", "author": "BobD"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]