[{"rating": 5.0, "review": "Easy to use. I bought the voice remote to pair with it.  Was watching Netflix within 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Bkelly"}, {"rating": 5.0, "review": "Oh man, this thing is sooo nice.  We have two fire TV at home and hubby wanted one for work too.  We were waiting for after Christmas but in fall we got offered the chance to pre order the Stick at a low price and thought what the heck worth a try. We are happy with all our Amazon products so we ordered.This is another HIT for Amazon.  It is perfect to take to the Engine house and hubby can watch his prime on it or mirror his kindle.  He is really thankful for it.  AND it is nice because it is small and compact. He can put in his locker after his shift.  It just plugs in like HDMI and plug into an outlet and all set.  As a prime member it came with all the info so it was truly plug n play.LOVE us some Prime. :)  Highly recommend this to anyone. Works great and comes with a remote or you can use your kindle.", "verified": true, "helpfulness": "0/0", "author": "CraftsnCoffey"}, {"rating": 1.0, "review": "This is the worst product Amazon has come out with, to date. I've been a Prime Member for a few years, so as soon as I saw that I could get the Fire TV Stick, for $19, I ordered it. It worked just fine the first day, but the next day, it kept taking me back to reconnect to my network. It refuses to reconnect no matter how many times I try. I've reset it, unplugged it...etc. There have been no updates and it is still not working. I will not be recommending this product to anyone.", "verified": true, "helpfulness": "6/7", "author": "Jessica"}, {"rating": 5.0, "review": "Probably one of the best new products this year.  Small unobtrusive device is perfect for bringing content to your HDMI capable TV.Works very well.  Easy to use intuitive remote.", "verified": true, "helpfulness": "0/1", "author": "yellowpixels"}, {"rating": 4.0, "review": "Works well ... Has movies out roky doesn't but wish it charged from the tv instead of a cord", "verified": true, "helpfulness": "1/2", "author": "Tanya Maisch"}, {"rating": 5.0, "review": "I got this the day they came out for pre order. I couldn't wait to see how well it worked. I love it! Best choice for me. You easily use it with any tv in your home that is HDMI capable. It was 1/2 price when I got it, a promo sale, and it's the best $20 I spent. Very pleased! I would pay the full price, no problem. Just happy I didn't need to and got a fantastic deal!", "verified": true, "helpfulness": "1/1", "author": "LJ"}, {"rating": 5.0, "review": "The use of the device started out pretty well.  I had Amazon prime during it's trial run when I first received the Fire Stick.  The user interface is pretty intuitive.  The selection process for Amazon Prime is much nicer on the Fire Stick then it is for my PS3; you can transition between the TV/Movie genre's easier.  One thing I would have against it; when the Prime Trial ended and was basically just running Netflix through the device, it started acting up.  There was a delay in the remote to screen response; I would push the button and it wouldn't respond, so I would press it again, and it would jump two or three selections in the direction I was choosing.  I ended up resetting the device and it went back to normal, but that's going to be in the back of my mind; there could be a delay in the remote response in the future.  So far so good.", "verified": true, "helpfulness": "0/0", "author": "Brendan Barrette"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "kimbernc"}, {"rating": 5.0, "review": "The Fire TV Stick is better than I expected. I'm not a techie, but you don't have to be to set this up and use it. Works great right out the box. Since I have Amazon Prime I've really enjoyed using it from the first day. I'd recommend to family and friends but I think you get the full benefit of it with the Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Keshya T Becker"}, {"rating": 4.0, "review": "Preface:  I've had two Chromecast sticks for about a year and love them, so take that into account, and note that some of the below is a comparison to the Chromecast in real, actual use rather than what the marketing materials say.Fire TV Stick packaging is fine, but Google's Chromecast is better.  This is terribly nit-picky since you'll be throwing it away anyhow.Out of the box, the Fire TV Stick is pre-programmed for your account, so if you get or give this as a gift there will be some extra work to undo that configuration.  Configuring the wireless networking is fairly easy to do, even for mine which has a non-broadcasting SSID and cryptic password.The Google Chromecast needs separate power all the time, but the Amazon Fire TV Stick can operate (or so it is claimed) with just a USB connection.  Out of the box, I attempted to validate this assertion and crashed right into the first wall:  the first thing it wanted to do is a firmware update, and that update failed repeatedly until I plugged it into AC power.  So while it may 'work' with USB-only... it definitely does so a lot slower and probably won't be near as usable.  YMMV.The Fire TV Stick wins usability points for including an RF remote... but the buttons on the Fire TV Stick remote are REALLY LOUD and annoying.  TBD how long it will last -- noisy switches and buttons do tend to last longer, though, so maybe that was an intentional design decision.The Fire TV Stick quickly found my Amazon Music collection (all the stuff I'd uploaded years ago) and correctly presented it for listening, by artist, album and a few other sorting methods.  Switching between tracks and artists is quite painless with the remote (but again, noisy clicky).  Music plays while doing other things, such as looking at pictures or surfing for a movie to watch via Amazon Prime Video.  However, on many occasions the audio was broken up, dropped out, or made funky blargh noises -- I suspect this is the back-end Android stuff chewing on other things and not giving the audio workload enough horsepower, but no matter, it's kind of aggravating.  Some of the between-track transitions also had an annoying buzz or bleep sound, which isn't in the actual content (I still have local copies).  Don't plan on doing too much multitasking on this thing, but for things like Pandora where you just start it up and walk away, it will be fine.A few weeks before getting the Fire TV Stick, I uploaded about 30,000 pictures to the Amazon Cloud Drive (once Amazon announced it was free to do so) as a fourth-level backup.  The Amazon Fire TV Stick found all of those pictures, which was nice.  But in practice, the collection is so large, it's effectively inaccessible via the Fire TV Stick.  Except for small directories, it's impractical to actually use this device to view or show pictures at all -- they just refuse to display or take long periods of time to show the list/catalog/thumbnails.  For reference, I have very-fast Internets (>50Mbits down), so the connection itself is not the limiting factor.  It's unclear whether this is a limitation of the Fire TV Stick itself, or the speed of the Amazon Cloud Drive serving the info back down.  Either way, it was quite disappointing as I was looking forward to being able to show pictures on my larger TVs.For watching video, the Fire TV Stick is a closer analog to the Roku devices than the Google Chromecast, in that you have to install \"apps\" on the Fire TV Stick in order to support the various platforms and services (Hulu, Netflix, Qello, etc.).  So you'll spend 10-20 minutes installing those apps and configuring them as necessary.  The Google Chromecast is a bit simpler in that you just use your Android or IOS device to \"cast\" content to the Chromecast from, say, the NetFlix app.  From the Netflix or Hulu or Pandora apps (and others), you can choose which \"target\" on your network to send the content to.  This latter part is actually VERY useful because you can \"cast\" that content from somewhere else in the house.  The kids want to watch Barney upstairs?  You don't even have to get out of your La-Z-Boy chair to make it happen!  With the Amazon Fire TV Stick, you'll need to be in that room to navigate the menus on the TV with the clicky remote to get stuff going.  (To be fair, the Fire TV Stick also shows up as a 'target' device, so while I haven't tested it, conceivably you may be able to do the same thing here.)The Amazon Fire TV Stick offers games as well (it's an Android device after all), and we played a few.  Breakout-style games will be fine with the included remote, but anything else will definitely require another $40-ish purchase for the gaming controller.  If you're looking at this for games also, you should probably read other reviewers' comments in this area, as that's not even my tertiary use case for this.For you uber-geeks, there are actually options hidden in here to sideload content and even make the Fire TV Stick accessible to ADB, which is kind of fun to see.PROS:  Tangible remote, pre-configured out of the box (sort of), small form factor, could possibly be taken on the road (though navigating around most hotels' firewalls will be problematic for most people), good smattering of different types of apps for content.  Menus are fairly well designed and easy to navigate, even in the dark.  Remote only has a handful of buttons, so it's hard to mess that up.  Parental controls are very nice to have.  (The Chromecast, by design, doesn't need parental controls in-device, as they're handled by the apps that are \"casting\" content.)CONS:  You will still need AC power despite the marketing spin; the remote is annoyingly loud; large photo collections in the cloud are practically unusable; navigating Amazon's video offerings for content you actually want to watch is painful; and finding video that is free with Amazon Prime is hit-or-miss (there's no \"show me only the stuff I can watch for free right now\" option), and will require logging in via a real web browser to add stuff to your Watchlist; there is no LED on the Amazon Fire TV Stick to indicate that it's on, functional, connected to the network, nothing .... so if you have a problem you'll have to resort to the \"have you tried turning it off and on again?\" routine -- the Chromecast has a useful LED indicator to indicate power/network.  Parental controls for playback need more tweaking  -- having it display on the TV the actual PIN code entry means the kids can see it unless you bury their faces in the couch first.In summary, once it's installed and configured, you'll definitely use it, but it really feels like a pre-release product with some rough edges.  It tries to do too many things in an acceptable way rather than a handful of things in a glorious way.  For the price, you absolutely can't complain, though, so I still give it 4 stars.All those gory details boil down to this:If your prime use case is Netflix and Hulu and you don't care about games or other apps, the Google Chromecast offers a better experience all-around.  The ever-changing (and quite beautiful) photo backgrounds on the Chromecast are also a nice touch -- I have a plasma TV and burn-in is a real concern for me, while the other 99% of you with LED/LCD screens don't need to care.If you really want everything and the kitchen sink in one place and don't mind having to stand in front of the TV to make the magic happen, and can live with riding the Amazon ecosystem (though certainly nowhere near as much bondage and handcuffs as the Apple ecosystem!), the Fire TV Stick will do nicely.", "verified": true, "helpfulness": "1/1", "author": "HolyGrail \"hlygrail\""}]