[{"rating": 4.0, "review": "Pleasantly surprised on the FireTV Stick.  I own a Fire TV for the main TV in the house. For the price could not pass up on having FireTV Stick on the secondary TVs. Streams very well.I would give it 5 stars if it had the VUDU app since it links Disney Movies. I have VUDU on my other set top box - would be great to have it all in one device. Do not know why Amazon does not have VUDU - probably due to VUDU being owned by Walmart. Flixster does not have any linkage to Disney Movies.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 4.0, "review": "It does what it suppose to do. The Netflix and Amazon Prime works perfectly, the picture quality is very good. It took less then 10 minutes to set it up and get it running. The remote control is very intuitive and easy to use. My six year old had no problems learning how to use the remote control. The only reason I give it 4 stars is that it is not DLNA compatible. Most of my media is on my NAS drive and it would have been great if I could use it to play my media in my six year olds' room.", "verified": true, "helpfulness": "0/0", "author": "DesiPilot"}, {"rating": 3.0, "review": "I do like this device and the amount of media content is large.  The ui is clunky and search is not intuitive.  The apps have not been updated in a very long time and it is missing critical apps available on the roku.  But for the price and hide-ability factor it is amazing.", "verified": true, "helpfulness": "1/1", "author": "S. Leonard \"Software Writer\""}, {"rating": 5.0, "review": "Its great, you must use the hdmi adapter or your audio will be bad.  Disappointed you have to use a power adapter to use the stick but its great.  You can turn any monitor into a streaming tv :)", "verified": true, "helpfulness": "0/0", "author": "Happy go lucky! \"W\""}, {"rating": 5.0, "review": "I own an RCA streaming player, a Roku 3, and this Fire stick.  Out of all of them, I like the Roku 3 the best.  I don't like how your channel apps like Netflix flow right into the Amazon content on the Fire stick.  On Roku, you can tell where one starts, and the other ends.  The Fire stick programming kind of melds together.  The Fire stick is a very fast surfer though.  I bought this during their promotion for $20, so I figured it would be worth it.  I would definitely buy it again for $20.  For $40, maybe.  I originally bought this for a kitchen TV, but it wouldn't receive a wireless signal, only 25 feet from my wireless router.  I tried it on a living room TV about 20 feet away, and it works fine.  I don't know what that small difference makes, but I would have sent it back if that hadn't worked.Another thing I don't like about the stick is the power cord.  I didn't realized you had to plug a power cord into the stick.  I assumed the power for the stick was pulled from the TV.  So here you have a 3.5\" stick hanging off the back of your TV, and the power cord sticks out the middle of the side of it.  Very odd placement.The remote doesn't have to see the stick, so it operates flawlessly with the remote.  I've had a few times when the video lags, but I think my cable internet service isn't as good as it should be.  Overall, happy with my purchase.One thing to know about these streaming players though, they burn up a lot of data.  Since we don't have cable TV, we use the Fire stick and Roku most evenings for several hours to watch TV and movies.  I have 350GB of data allotted in my monthly plan with the cable company.  When I added the second player, I came within 95% of that 350GB of data for several months, and now around the holidays, I've gone over that limit 2 months in a row.  The additional cost of data could actually pay for cable service, eliminating the need for these players.  Something to consider.", "verified": true, "helpfulness": "1/1", "author": "Scott V."}, {"rating": 3.0, "review": "Make sure you have a strong WiFi signal if you are going to use this. It doesn't pick up the signal all that well, plus I have not been able to use the mobile app to control this. Will not find it on my wifi network", "verified": true, "helpfulness": "1/1", "author": "James T Nagasawa"}, {"rating": 2.0, "review": "It's really nice to have the remote (something I wish Chromecast had), but I feel like this device is under powered. Startup is slow and the menu system is sluggish.My biggest complaint is that I keep having to sign in to Netflix (our primary use) which is a huge pain to do with the remote. This seems to happen more than once a week. We leave it connected to the same tv.I have never had to re-sign in to Netflix on our Roku which we've owned for more than a year now and am considering just getting another one of those.Otherwise, for the few features I have used, it has worked as expected. I'll gladly update my review if we get a firmware update that fixes these issues or I get a new device because mine is somehow defective.I still love you Amazon", "verified": true, "helpfulness": "1/2", "author": "Aaron Wiginton"}, {"rating": 5.0, "review": "Like many others, I got the Fire Stick initially because the price was too good to pass up.  There are more in-depth and technical reviews out there, but let me just say that my non-techie family loves it.  It is easy for my wife to use, and she finds the interface very intuitive.  The Netflix app is speedier than others (such as the one 'built in' to our smart tv) and the aesthetic lay out is very nice.  One of our neighbors said \"Ooh, you have pretty Netflix\".  After playing with the Fire Stick, I have two relatives who were so impressed that they ordered their own.", "verified": true, "helpfulness": "1/1", "author": "James Tyler Dancy"}, {"rating": 4.0, "review": "Can't get it to work with our sound system", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"avid reader\""}, {"rating": 5.0, "review": "i lovr this thing", "verified": true, "helpfulness": "0/0", "author": "adam hoban"}]