[{"rating": 3.0, "review": "Its ok. Some of prime movies stink.", "verified": true, "helpfulness": "0/2", "author": "mitch"}, {"rating": 5.0, "review": "It's perfect for my kids. They want to watch Youtube(which is no longer available on Directv) and Netflix. I also can find some movies and shows to watch. I currently have directv but really only have it for football. Could see myself saving lots of money on satellite and just using this. Got it on sale for $24. Can't beat it.", "verified": true, "helpfulness": "0/1", "author": "klos"}, {"rating": 3.0, "review": "I wish Amazon will allow us to download Kodi (aka xbmc) as that will allow me to watch LiveTV using HD Homerun plugin.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it,  easy to set up and does everything advertised for minimal out of pocket.  I'm thinking about getting a second one for the TV in the living room.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wonderful little device for the price. I also own an Amazon Fire TV.  I wanted another streaming device but couldn't justify purchasing another Fire TV that wouldn't be used as much so I went with the Fire TV Stick. It has most of the same functions at a lower price.  While visually everything looks the same as the Fire TV, the Fire TV Stick does struggle at times when navigating the menus especially within the apps such as hbo go.  But once you start playing the videos all is well. No performance issues during playback.  If you are looking for something that gets the job done as a capable streaming device and can endure the sluggish menu navigation, get the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Jericho Datu"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/1", "author": "Joel aguilar"}, {"rating": 4.0, "review": "Works very nice", "verified": true, "helpfulness": "0/1", "author": "Roylin Walker"}, {"rating": 5.0, "review": "I love it. It turned my TV into a smart TV. I can stream movies and shows and it is easy to operate. I haven't even tried all the choice yet.Why spent hundreds of dollars on a smart TV when it can do the same for $40 for any TV that has HDMI input. I used a gaming console before that but it was very glitchy, this hardly has any hiccups.", "verified": true, "helpfulness": "0/1", "author": "siamcatp"}, {"rating": 5.0, "review": "The one thing I would like to see more free games on the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Rhonda V. Smith"}, {"rating": 5.0, "review": "Love it!!! So easy to use. Thanks for being here when I was ready to cut the cord.", "verified": true, "helpfulness": "0/1", "author": "Teresa Rodriguez"}]