[{"rating": 3.0, "review": "Not Enough apps", "verified": true, "helpfulness": "0/1", "author": "James Rigdon"}, {"rating": 2.0, "review": "I have had the Fire Stick for approximately 8 months now and up until the last few weeks I would have left a glowing recommendation.  I used it connected to my Pioneer Home Theater System so that I could listen to Amazon prime music on the larger sound system and of course, also to watch Amazon Prime and it worked great.  But, alas, now it will not stay connected to my WiFi.  I have tried all the fixes suggested on different sites and only can only conclude that this is a major issue affecting numerous Fire Sticks.  I don't know if it is a software issue or a hardware issue, but now it is a useless stick hooked up to my system.  Granted, the price was right, but it should of lasted longer than 8 months.  I think I will wait till the next generation to perhaps try again.", "verified": true, "helpfulness": "1/1", "author": "J. Smith"}, {"rating": 5.0, "review": "Have been using this almost exclusively since setting it up. Which was a breeze. Score one more for Amazon.", "verified": true, "helpfulness": "0/0", "author": "F. Arthur"}, {"rating": 4.0, "review": "Easy to install and use.  Limited selection of free movies and TV.  It was worth the price and the expectation of more variety.", "verified": true, "helpfulness": "0/0", "author": "Larry A. Baylor"}, {"rating": 5.0, "review": "Love it! We were running Netflix and amazon Prime through our Wii, and were very unhappy with the quality. They are both much better through the Firestick. Haven't had time to explore other apps yet, but can't wait to try them.", "verified": true, "helpfulness": "1/1", "author": "Mrs Laura L Hiebert"}, {"rating": 4.0, "review": "Works great.  Some spotty connection, but that's mostly due to my router placement.", "verified": true, "helpfulness": "1/1", "author": "Aaron Brooks"}, {"rating": 4.0, "review": "I was flip flopping between Fire TV Stick ; Chromecast and Roku as my streaming device of choice.  Three months ago I finally tried the Fire TV Stick.  It was truly plug and play into my TV.  Finding it would run both PLEX and KODI apps was a real plus since I have an old media center PC with 4 tuners recording OTA Broadcasts.  To stream from the web and lan with one device tops the ROKU and Chromecast.  I was so impressed I bought a second stick last month.  The HDMI2AV converter was necessary for the older composite video tube tv.  But it works flawlessly with Fire Stick.  Last Night I hit the real bummer of the TV Stick though.  You must have an internet connection to Amazon Services for Stick to work.  Loss of the internet means PLEX and KODI which are LAN apps fail cause the Stick Fails. Hope the next software release includes a local mode for local only apps.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Lightfoot"}, {"rating": 3.0, "review": "Its not set up to work with all the channels for att uverse very limited", "verified": true, "helpfulness": "0/1", "author": "J brown"}, {"rating": 5.0, "review": "love this, good-bye cable TV!!", "verified": true, "helpfulness": "0/0", "author": "ELR"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "andrew sicard"}]