[{"rating": 5.0, "review": "Fire TV stick was one of my best purchases through Amazon.  Easy to install and it works great and even better than similar device competitors.  It is well worth the investment! I recommend this item to everyone.  I am a tech instructor and I know what is good.", "verified": true, "helpfulness": "0/0", "author": "E Melendez"}, {"rating": 1.0, "review": "Unable to connect to Wi Fi. The online help was of no use. I will be returning the stick.", "verified": true, "helpfulness": "0/0", "author": "Gerard Westrup"}, {"rating": 1.0, "review": "Completely False advertising!!!!! Nothing works on this except for Prime videos. HBO GO isn't offered, Netflix, Huluplus, and Showtime are unavailable.  These great reviews must be made from people that work at Amazon. Because there is NO WAY this is a good product! 100% BS.  Why pay more to just watch Prime which i already pay a membership for. Quite sad that i was duped like this. This puts a tarnish on Amazon for sure. Shameful and totally false advertising. Even now it shows all of these networks as working on their site.", "verified": true, "helpfulness": "0/1", "author": "TripleBypass \"Matt\""}, {"rating": 5.0, "review": "Fast service and I love it", "verified": true, "helpfulness": "0/0", "author": "margarie Burley"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "JL"}, {"rating": 4.0, "review": "Only reason it didn't get five us because I can't cast everything as compared to my Chromecast however the clarity and speed is far better with my fire stick.", "verified": true, "helpfulness": "0/0", "author": "eulonda"}, {"rating": 5.0, "review": "Excellent product!!", "verified": true, "helpfulness": "0/0", "author": "Ian Acosta"}, {"rating": 4.0, "review": "Have a very nice HD TV but it was not a smart TV.  Added the Fire TV Stick and I'm a happy camper.", "verified": true, "helpfulness": "0/0", "author": "Kathy in Ahwahnee"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Fire stick!!!  I use it all the time, especially to watch movies and my son love the kids show available through Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "toddles76boston"}]