[{"rating": 3.0, "review": "Lovely screens and menus. Remote can get a little sticky and you can't mirror your computer which is what I thought I'd be able to do. Overall good but I'm really not getting anything new other than a remote and prettier menus.", "verified": true, "helpfulness": "0/1", "author": "H4nnita"}, {"rating": 5.0, "review": "Awesome device & so sweet to cancel cable!", "verified": true, "helpfulness": "0/0", "author": "Rachael Wagner"}, {"rating": 1.0, "review": "BEWARE OF BEING BLACKMAILED BY AMAZON.  THEY ARE NOW SAYING I HAVENT PAID FOR THIS ITEM 14 MOMTHS AFTER I BOUGHT IT. THEY ARE THREATENING TO DISABLE IT. I PAID WITH A GIFT CARD AND HAVE NO RECEIPT. BEWARE BEWARE BEWARE", "verified": false, "helpfulness": "0/4", "author": "Christine Broderick"}, {"rating": 5.0, "review": "I like it and it takes the place of my Blue ray player and it is simple to hook up so I will tell my friends to get one", "verified": true, "helpfulness": "0/0", "author": "Anthony wynn"}, {"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/0", "author": "mad jake"}, {"rating": 3.0, "review": "The device itself isn't too bad, though I would prefer a Ethernet connection versus WiFi.  The remote feels a little on the cheap side, and the fact that a separate power connector is a little off-putting.  I am not fanatical about the prime video service, though, as more and more of the content requires extra \"rental\" fees even though I pay for the prime service.", "verified": true, "helpfulness": "1/1", "author": "Arland M Smith"}, {"rating": 1.0, "review": "WORTHLESS.  Trying to stream content - ANY content. DOES NOT WORK.  Plays AUDIO and screen that says (in British English) \"DHCP Content UnauthoriSed\" (yes that's an \"s\").  The SAME thing happened when trying to use a 2014 Samsung Smart TV with Amazon Prime content (with no need of a FireStick because it was a Smart TV with a menu interface).  Further, if you enable parental controls - you have to \"type\" a password in for EVERY SHOW!!  WHAT THE F###!  In the 1960's the \"G-Rating\" came out.  MOST SYSTEMS allow you to apply controls BY CONTENT TYPE - not EVERY #*$@'ing SHOW!  And there's NO KEYPAD!  It's like you have to play Nintendo entering \"up left down - 'next page', left, left, up\" every $$*@'ing SHOW !  Customer service said: \"try pushing it in further\",  \"disconnect ALL other devices from now on\", and due to the INTENSE HEAT the thing puts out (best one) \"Ohhh - you have to disconnect it EVERY TIME YOU'RE NOT USING IT - it OVERHEATS\".  What the F***!!!!!!", "verified": true, "helpfulness": "0/4", "author": "Tour NewEnglander \"Tour NewEnglander\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "James McClure"}, {"rating": 1.0, "review": "this thing constantly loads, and a lot of time when you are watching something it just turns off", "verified": true, "helpfulness": "1/2", "author": "Joshua Myers"}, {"rating": 5.0, "review": "Great price. Simple setup. Awesome product overall.", "verified": true, "helpfulness": "1/1", "author": "Gully.Girl \"What happened to my bag of doughnuts?\""}]