[{"rating": 4.0, "review": "Plug and Play", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 5.0, "review": "Love it, cAble tv as a dominant superpower is quickly coming to an end!", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 3.0, "review": "It's good because it makes connecting to a variety of online media easy as pie...once it's set up. There were no instructions for set up (beyond the physical) with my stick. FYI, you need to download each app before use. Depending on your connection, this could take awhile. But it's a one time download.The first not so good is that when using the remote, there seems to be frequent loading delays during videos. However if I use my chromecast phone app to send it to the stick, there aren't delays. Second is that I haven't found a way to access the stick with my pc. This is unfortunate, because using the remote to type in a search term is annoying & slow. (update) Third is that if you move the stick, you may need to re-verfiy your accounts with some applications (I'm looking at you Hulu). Fourth is that when the stick hangs on playback, attempting to pause/rewind sometimes makes things even worse.It is a worthwhile purchase if you queue items to watch in netflix, hulu, etc before using the stick. If they'd fix these issues, it'd be a sweet piece of material. But it may be more likely that someone will develop an app to give chromecast a homepage like the firestick.", "verified": true, "helpfulness": "0/0", "author": "J Goner"}, {"rating": 1.0, "review": "I wish I could give this thing a zero. I plan on sending it back TODAY.... Whatever show I am watching it freezes and not only that the show continues to play even though the screen is frozen.  EVERYTHING you have to pay for except for apps that you have a monthly subscription to.  They give you NOTHING for free, no shows, or movies NOTHING..... I think I will go with a roku!", "verified": true, "helpfulness": "0/0", "author": "Jade the Great Aunt!"}, {"rating": 1.0, "review": "Got in trouble with data plan not covering my Netflix habit.  Cost me $ for my obliviousness.", "verified": true, "helpfulness": "0/1", "author": "barb"}, {"rating": 5.0, "review": "I like very much.  And work good on all my tvs.", "verified": true, "helpfulness": "0/0", "author": "becki"}, {"rating": 5.0, "review": "Awesome so far", "verified": true, "helpfulness": "0/0", "author": "Lezeth Y."}, {"rating": 5.0, "review": "fantastic!!", "verified": true, "helpfulness": "0/0", "author": "Dennis Ray"}, {"rating": 5.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "Thomas Friedlander"}, {"rating": 4.0, "review": "Definitely an improvement on reception for my bedroom TV.  Netflix/Amazon Prime interfaces are excellent.  Picture quality is quite good, but I do not get the 5.1 sound output.  My LG BD 540 Blu-ray has the same problem outputting sound.  Yes, I am connected to a 5.1 receiver and get 5.1 output through the TV when watching network shows via rooftop antenna.", "verified": true, "helpfulness": "0/0", "author": "Thom T \"SciFi 4evR\""}]