[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "ALLEYBOY760"}, {"rating": 4.0, "review": "Good product. My only grip is that, I wish Amazon would place on there product description, is that some apps need to have a cable or satellite service. For example, Encore and Starz.Other than that, I think it is a good product.", "verified": true, "helpfulness": "0/0", "author": "Edward Sloop"}, {"rating": 2.0, "review": "well i was really excited to try it and then i had to return it cause it quit working....don't know what happened but it just wouldn't work...so i bought a roku stick instead, and the remote doesn't work that great either, but their app works well, so i use my phone....technology isn't all its cracked up to be", "verified": true, "helpfulness": "0/0", "author": "claires"}, {"rating": 5.0, "review": "This worked great! Now out of the dark ages and enjoying Pandora, Netflix and Hulu on our tv. I love the extra variety as we don't watch a lot in cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Susan Schenck"}, {"rating": 5.0, "review": "LOVE IT, WORKS AS EXPECTED AND NO ISSUES W/CONNECTIVITY OR PICTURE QUALITY", "verified": true, "helpfulness": "0/0", "author": "Timm Chaffee"}, {"rating": 5.0, "review": "Excellent tool.  Took several days for my password to be accepted, but now working fine.", "verified": true, "helpfulness": "0/0", "author": "Fred Nichols"}, {"rating": 5.0, "review": "My Fire TV Stick just arrived yesterday and so far it's great!  Easy to set up - I needed to switch to another account to utilize the household Prime membership and that was simple, easy to link accounts - just have your log ins ready, and lots of apps available, including HBO Now!The one thing I wish was different was the lenght of the power cable.I purchased this on a Friday and on Monday the Fire TV Stick went on sale for $5.00 less than my purchase price.  I contacted customer service and Amazon even refunded that five bucks back to me!So far I'm very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Patrick Legg \"Dragonfly\""}, {"rating": 5.0, "review": "Just as easy as Apple TV.  Had an issue with the volume not working - but there are suggestions and advice on the internet that will help you with whatever make & model TV you have to resolve it.  After reading a few posts/blogs we were able to rectify the volume issue.", "verified": true, "helpfulness": "0/0", "author": "Angela Rehbein"}, {"rating": 5.0, "review": "It's amazing", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Alan"}, {"rating": 5.0, "review": "I like Fire TV. It works well for everyone.", "verified": true, "helpfulness": "0/0", "author": "TayB"}]