[{"rating": 1.0, "review": "I received mine at the end of November.This FireStick works OK (at best) some days, then others it locks up, and today it wont play anything.  Started out that playing music was the only problem, now its everything including TV and movies.I've already spent over an hour on the phone with the \"support\" team, getting past to 4 different \"techs\".  Then I'm told they'll put in a ticket, and get back to me in 2-3 days.  I get an email saying they dont see any problems, call if you still have problems, and thank you. I'm not calling back to be told to test everything I've already tested....restart, reinitialized, reregistered, adjust settings, unplugged, done it all. I have 2 separate Chromecasts in the house, both over a year old, and they still work perfectly.  My internet connection is solid, my router is good, my WiFi is good, etc....and I know how to test/compare all these variables.What I want is a refund at least , but even better would be a FireStick thats not filled with gremlins.  I appreciate the FireStick when its working, but this one has been nothing but flakey since day one.I really hope Amazon is paying attention, will understand my frustration, and make things right without wasting another hour of my time on the phone getting handed from \"tech\" to \"tech\".Long time Prime customer", "verified": true, "helpfulness": "2/2", "author": "AJLE"}, {"rating": 5.0, "review": "Love it, much better than chromecast, the remote is super useful", "verified": true, "helpfulness": "0/0", "author": "Z. Liu \"lzbob\""}, {"rating": 5.0, "review": "Excellent; It delivers more then expected.. Fast, excellent picture quality and lots of applications & games.", "verified": true, "helpfulness": "0/0", "author": "Manoj Kumar"}, {"rating": 5.0, "review": "I was fortunate to order one of these as soon as it was announced. As an Amazon Prime member, I was able to buy the Fire TV Stick for $19 during a two day sale. I figured, for that price, I might as well test it out!Set up was easy and straight forward. I find that the interface is quick and easy to use. The interface and streaming on the Stick is much faster than the Amazon app built into my HDTV. This fact alone made this a great purchase. Here are some more thoughts I have on the Fire TV Stick so far:' PROS:- Quick, easy to use, polished interface- Wireless streaming works really well- Amazon Instant video loads, fast forwards, and rewinds really fast- A dedicated Prime Menu allows Prime members to easily see what free content is available- Unlike Chromecast, the Fire TV Stick includes a remote- Can stream your own videos by first uploading them to your cloud disk- Can play quite a few casual games- Awesome, irresistible price for Amazon Prime users. I got it for $19 during the two day sale.I Love it", "verified": true, "helpfulness": "0/0", "author": "Leonard"}, {"rating": 1.0, "review": "It was easy to setup and basically had a great experience the first night. Next day for some reason I was unable to use it because said that there was no internet... Ended going to my living room to use the Apple TV. 3rdI give another try and I had to enter my network password because for some reason forgot the password (nothing else, my amazon prime was all good, etc), 5 minutes later asked me the password of my WIFI again.... After looking for something to watch and started watching netflix it was really slow and with a lot of pauses.... again I went back to my living room to watch Netflix with my Apple TV. 4th day I try again and boom: need to enter my wifi password.... I didn't and just factory reset the stick, put it nicely on the box again and exchanged it for the ChromeCast. It's a really young product and I will be willing to try it again but not now, it was a hassle that first bad experience.", "verified": true, "helpfulness": "0/0", "author": "luanpedrori"}, {"rating": 3.0, "review": "It's nice for Netflix viewing.  I hope more media/entertainment apps come to the service.  I would really like to see an Xfinity app!", "verified": true, "helpfulness": "0/0", "author": "wastingtime33"}, {"rating": 5.0, "review": "Great for watching Movies!!", "verified": true, "helpfulness": "0/0", "author": "D390"}, {"rating": 4.0, "review": "Updated July 6 2015:Despite my initial negative review, I now almost exclusively use FireTV Stick (FTS). Mainly because it supports 5.x GHz wireless channels. Chromecast doesn't. Important note is to force your FTS to connect to 5GHz channel, or it will default to 2.4GHz and suffer the same way Chromecast does. The other point is Miracast! It now works pretty nicely (not flawlessly though).I can even cast my entire desktop/extend desktop of *Windows 8.1* from my Surface Pro to it using the \"Devices > Project > Add Wireless Display\" path on Windows. Unfortunately you'd still have to manually each time set your FTS to \"mirroring\" mode, but Amazon has added(?) a shortcut in the clock screen in addition to existing Settings>Display>Enable Mirroring route.It also appears they have updated the apps I noted in my review so the experience is smoother now. YouTube works almost the same way it does on Chromecast for casting. It still sometimes gets stuck and I have to disconnect/connect my YT app, but it's a bug they have to fix. Given the above changes, I upgrade it from 2 stars to 4 stars.First version follows:==================[7/6/15: Title was \"Can't compete with Chormecast yet\"]I have had Fire TV Stick (FTS) for a few weeks now, and was excited to get it. Here are reasons why I don't like it:1. Main exciting feature was native Miracast capability. The \"no extra app needed, works on all Miracast devices\" promise was very charming. Unfortunately it doesn't work well. You have to go to Settings > Display > Enable Mirroring on your FTS and stay there to even see it on your phone. And every time I tried using it, it did a combination of these: had an uncomfortable lag, crashed the phone/tablet (Nexus 5 and HP 7 Plus KK),  could not connect, disconnected quickly. [7/6/15: now fixed, partially because of my terrible 2.4GHz noise. Enabling Miracast still annoying.]2. The YouTube app is hard to setup. You have to pair with a string of numbers (my Vizio TV gives a QR code at least). And then it sometimes cannot connect to phone/tablet YT app, it just stays in \"connecting\" state on the phone (tried with Android KK,L, iphone). Clearly the error is in YT on FTS or the FTS itself. [7/6/15: Almost fixed. Still have to connect/disconnect YT app to bring up YT on FTS]There are some reasons I do like it though:1. There is an independent UI on FTS.2. There is a remote! 1+2= you don't need to take out your phone every time, and guest can use it. Which is nice.3. There are many many apps on it. And I hope there will be even more.I got the promotional price of $19 so I will keep it, in case they finally make the Miracast to work. But for my real use, I just ordered a Chormecast :)", "verified": true, "helpfulness": "1/1", "author": "Ehsan \"Ehsan\""}, {"rating": 5.0, "review": "little magic genie. Better than chromecast.Unlike chromecast, you can use the provided remote.The interface is wonderful. It works as you would expect and sometimes even better.I havent tested the optional gamepad and voice remote.Give it to somebody without a Smart TV and they will get used to it very quickly.Hate the power cable which is a little stiff, but i replaced it with a flexible cable micro USB and it works great. (it only affects me because i think cables should be flexible).Try it and you will like it.Best stocking-stuffer.", "verified": true, "helpfulness": "0/0", "author": "Arun Ramakrishnan \"DRKR panel\""}, {"rating": 5.0, "review": "Think it's a great addition to our TV", "verified": true, "helpfulness": "0/0", "author": "Patricia H. Dunham \"AZPat\""}]