[{"rating": 5.0, "review": "looks and works great. Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "christopher schluntz"}, {"rating": 5.0, "review": "So far I love it.  I was thinking of making this purchase some time ago but had to wait for my satellite TV contract to expire.  I do not recommend this for those who will be using it with satellite internet.  I am making the switch to something else (AT&T; U-Verse or Cable internet) since the satellite internet cannot support the data needed for streaming.  This was probably one of the most simple tech gadgets I've ever installed.  I look forward to utilizing it's full potential when I move into my new house with the different internet service.  Works great with my wireless router and it had no trouble identifying my WiFi signal allowing me to sign on using the remote.", "verified": true, "helpfulness": "0/0", "author": "Froggymama"}, {"rating": 5.0, "review": "Better than cable", "verified": true, "helpfulness": "0/0", "author": "Darrick S. Williams"}, {"rating": 5.0, "review": "Really awesome , fun to use. I like being able to watch Netflix and YouTube on the TV. Be great if they would get a crunchyroll app for it. You can side load one but it takes time.", "verified": true, "helpfulness": "0/0", "author": "Asuka 24"}, {"rating": 2.0, "review": "It's just ok.  Not as versatile as the Samsung embedded SmartTV app or the ol' Roku.  Plugging the power cord, it sticky on the Fire Stick end.  I thought I had a bad device, turned out it needed a little umphh to make the connection.", "verified": true, "helpfulness": "0/0", "author": "MJK22"}, {"rating": 5.0, "review": "better than i thought.", "verified": true, "helpfulness": "0/0", "author": "robertseibert"}, {"rating": 5.0, "review": "Great price. Works great.", "verified": true, "helpfulness": "0/0", "author": "W. M. Greene"}, {"rating": 5.0, "review": "Purchased Fire Stick for Bedroom TV. So Easy to install, easy to use! Being a Prime member all my info came up on screen.. I have a Roku for Streaming  other TV, Love that! Cost $99.00. this Amazon Stick cost less than $40.00 And works just as well..I'm a 77 yr old grandma and this was an easy install!", "verified": true, "helpfulness": "0/0", "author": "sylvester \"Sylvia\""}, {"rating": 1.0, "review": "Nothing worst than this....... It always says network error for every 10-15 mins. When I go and check for network nothing will be wrong with the Internet.", "verified": true, "helpfulness": "0/0", "author": "Malathi Komirelli"}, {"rating": 5.0, "review": "Awesome....love it", "verified": true, "helpfulness": "0/0", "author": "Victor Delarosa"}]