[{"rating": 1.0, "review": "MINE WORKS BUT THE LACK OF SUPPORT OR A TECH NUMBER OR PERSON FORCES ME TO GIVE IT A ONE STARI have plenty of questions and no answers ......It does play Amazon Movies no prob but everything elsehas let me down", "verified": true, "helpfulness": "2/6", "author": "Excel"}, {"rating": 5.0, "review": "Love the fire stick. Easy to install, programs/music load fast. Very pleased", "verified": true, "helpfulness": "1/1", "author": "mben"}, {"rating": 5.0, "review": "I absolutely love this thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "IT Buffers all the time???So I whent back to my Roku2 works good with no buffering.", "verified": true, "helpfulness": "2/5", "author": "william e sanborn"}, {"rating": 5.0, "review": "This is, without a doubt, the best purchase I've ever made on Amazon!!  I have a smart TV in my living room... I bought the Fire TV Stick for the TV in my bedroom, and am I ever glad that I did!Plenty of variety... Netflix, Amazon, Hulu, etc., etc..  I absolutely love it!  And for less than  $40.00, you simply can't go wrong.  I wish I'd have gotten it when it first came out!Very easy to set up.  I had it up and running in about 15 minutes.  Now I'm watching movies on Netflix in bed and lovin it.", "verified": true, "helpfulness": "1/1", "author": "David Briggs"}, {"rating": 5.0, "review": "Plex Media Server, Netflix, Prime Video and PBS NOVA?  What the heck is network TV? I love this thing.Easy to set up, initially had some connectivity issues, would drop my WIFI connection from time to time.  Amazon must have run an update because it works flawlessly now.  I also have Chromecast, but the Fire TV Stick w/ Remote is working out better than expected.  You can also use your smartphone as a remote.  Overall very impressed.Bought a second for my sister in law for Christmas, delivered on time and she's already in business.", "verified": true, "helpfulness": "1/1", "author": "J Dizzle"}, {"rating": 2.0, "review": "Adds no value over a modern smart TV. My Samsung does everything the FireStick does. No need for it.", "verified": true, "helpfulness": "1/2", "author": "B. Robichaud \"CuriousGeorge\""}, {"rating": 5.0, "review": "If you don't have an internet (smart) TV, this is a must buy,especially if you have Amazon Prime. I love it.", "verified": true, "helpfulness": "1/1", "author": "Ron Larsen"}, {"rating": 5.0, "review": "We were lucky to be able to buy it on sale and at that price, roughly $15, you really can't beat it. With a very simple installation and easy on-screen commands, in a wink, our TV was playing beautiful music and a slide show of some absolutely stunning stock photography. Obviously it also has the advantage of bringing all of your Amazon prime viewing to your television, but the world-class photography images in the slide show made for a happy surprise.", "verified": true, "helpfulness": "0/0", "author": "Leerador"}, {"rating": 1.0, "review": "Would be great if it were ready for prime time.  But it's not.  I am a controls engineer with several years of enterprise IT experience before that.  And this device has the temperment of a wife.  It can work flawlessly for hours, then, at the drop of a hat, for no rhyme or reason, will loose connection, or connect with problems.  I've tried everything from moving equipment around, changing WiFi settings, disabling DHCP and setting up everything manually, restarting it, yelling at it, walking out of the room, and sleeping on the couch in front of my AppleTV.  So far, sleeping on the couch works best as in the mornings the Fire TV Stick apparently wakes up more refreshed on the bedroom tv and will start working.  For no known reason.  With no changed variables.The thing is nuts.  And with it working this sporadically means that the hardware isn't capable of handling the network load, which is rare, or that there is faulty programming to blame since restarts sometimes fix it.  It needs major updates and more reasoning as to why it's failing and what the problems are.Also, should you be reading this review for troubleshooting, to restart from the remote press and hold select and play/pause.", "verified": true, "helpfulness": "4/8", "author": "T. Fry \"Techrific.\""}]