[{"rating": 1.0, "review": "This product is terrible! I have not been able to use it once since I bought it in February! It shuts my tv off drops the Internet connection, just a bad product in general.  And big surprise when I wanted to return it it just happened to be right outside the window of time I had to do so.  I've used Amazon for everything and this is truly disappointing! (Only gave one star be use its required)", "verified": true, "helpfulness": "0/1", "author": "Samantha Fitzpatrick"}, {"rating": 5.0, "review": "Works great and there are lots of choices. Love that my kids can watch the older shows like Chitty Chitty Bang Bang and Pink Panther!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "Much better than chromecast. Easy to use and a fun gadget.I mirror European outdoor concerts from You Tube ( Andre Reiu ) from Kindle Fire hdx 7 and they are amazing.Will", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Easy to set-up, works great. No problems at all.", "verified": true, "helpfulness": "0/0", "author": "William J. Morrow"}, {"rating": 5.0, "review": "Great product would purchase again", "verified": true, "helpfulness": "0/0", "author": "Herbert Harris"}, {"rating": 2.0, "review": "Does not transfer movies from your laptopTo your television not much use to me", "verified": true, "helpfulness": "0/0", "author": "ANTHONY A."}, {"rating": 5.0, "review": "Now that I understand how to use it, I love it.", "verified": true, "helpfulness": "0/0", "author": "Phyllis J. West"}, {"rating": 4.0, "review": "It is very easy to use and has very good applications. If you download the Fire TV application on your tablet or smartphone will make it easier to use the device.", "verified": true, "helpfulness": "0/0", "author": "Ruben Maldonado"}, {"rating": 4.0, "review": "Stick works extremely well right out of the box. I was using an old Roku for watching Amazon Prime, but had problems with buffering. Sometimes, a show would restart every few minutes with the reloading bar slowly progressing across the screen. My son-in-law told my about Fire TV Stick, so I read up on it on Amazon. Info said it had lotsa storage, so for such a low price, I said what the heck. I was not disappointed, so far. However, I'm giving it 4 stars instead of 5, because the product lacks a detailed manual. The very brief instructions that come in the box will get you started watching movies and shows, but does not tell you how to set up more complex operations like mirroring your phone or tablet to your TV, or flinging favorite apps to free up your small screen for other uses.So, I ordered a manual from Kindle for $2.99. What a disappointment. This \"manual\" was nothing more than a poorly written sales brochure that didn't give any step by step instructions about more complex features. The \"manual\" seemed to have been written by some 3rd world high school student having English as a second language. Here's some advice for Amazon marketing: put a real manual in the box and adjust the price accordingly.", "verified": true, "helpfulness": "0/0", "author": "Timothy Doyle \"LowCountryGuy\""}, {"rating": 5.0, "review": "So easy to use and has everything I need for my multimedia needs.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}]