[{"rating": 5.0, "review": "I have one in my bedroom, and one on my living room.  I love it!  Casting made easy! Makes me wonder why I ever paid for cable in the first place. Looking forward to more app options in the future!", "verified": true, "helpfulness": "0/0", "author": "AK"}, {"rating": 5.0, "review": "We loved our Fire stick so much we bought a second for our bedroom. It is used daily.", "verified": true, "helpfulness": "0/0", "author": "James Branch"}, {"rating": 5.0, "review": "should have gotten this when I first became a Prime Member!!!", "verified": true, "helpfulness": "0/0", "author": "LS"}, {"rating": 5.0, "review": "Why pay for cable! I love this so easy to use and I'm not a tech person!", "verified": true, "helpfulness": "0/0", "author": "benjamin snow"}, {"rating": 5.0, "review": "Great product fast shipping", "verified": true, "helpfulness": "0/0", "author": "aaron"}, {"rating": 3.0, "review": "Disappointed in Amazon. The reviews were overwhelmingly good and the price was right. I bought this primarily for Netflix, and after about two weeks began having a major issue with buffering every four minutes or so, and the buffering gets stuck at 25%.In searching for a solution I found that a LOT of people have experienced this, and it's really only with the Netflix app: Amazon Video works fine. This has apparently been going on since the stick came out, and aside from telling users to \"clear cache, unplug from power and restart\", Amazon does not seem interested in really addressing the problem.Chromecast is lame, Apple TV doesn't have Amazon or Pandora, so I think I'm shopping for a Roku 2 or 3 now.:/", "verified": true, "helpfulness": "1/1", "author": "Michael S"}, {"rating": 5.0, "review": "Oh can you say awesome!", "verified": true, "helpfulness": "0/0", "author": "smarterthanyou"}, {"rating": 5.0, "review": "We have  found no problems with the Firestick. It has met our expectations. I would recommend the item", "verified": true, "helpfulness": "0/0", "author": "Loretta"}, {"rating": 3.0, "review": "Remote to small for larger hands or people that have stiff or arthritis", "verified": true, "helpfulness": "0/0", "author": "paul j labruzza"}, {"rating": 1.0, "review": "My fiance and I bought this because we don't have cable. At first, it worked great. Then, without having changed the router or our internet, the device just wouldn't stream. It was literally 4 inches from our router, so we know it got great signal strength. Eventually the device became unuseable. I contacted amazon support for help and they sent me a new device. That one had the same issue, if not worse. So I contacted support a second time. Then sent me a SECOND replacement. At this point, it was a week later and by the time the second unit came, I ended up with THREE unworking amazon fire sticks and lost the 40$ that we spent instead of getting a smart TV [we bought a new TV the same day we got the fire stick]. Now we have wasted hours of time trying to get the device to work with no luck.Support was also suppose to call me to help me with it and never did. I've even had my router replaced and paid for Comcast to come out to the house and check our exterior lines and everything and all signs indicate it's just the device. Bummer. We won't buy any more amazon specific devices.", "verified": true, "helpfulness": "2/2", "author": "Kelsie"}]