[{"rating": 5.0, "review": "Greatest purchase ever! No more wasted money for satellite service!!", "verified": true, "helpfulness": "0/0", "author": "Angie Frye"}, {"rating": 5.0, "review": "Got this for a sale price. Did not pay $99. I love it!!! Only problem was that it didn't work on the TV at my vacation condo. Don't know why because it was an HD TV but maybe because that TV was not hooked to a network.", "verified": true, "helpfulness": "0/1", "author": "Hbb1967 \"Retired reader\""}, {"rating": 5.0, "review": "Simply awesome. If it goes on sale again im buying a couple more", "verified": true, "helpfulness": "0/0", "author": "Peter D."}, {"rating": 3.0, "review": "Much faster than my Roku...worth the money", "verified": true, "helpfulness": "0/0", "author": "GAB"}, {"rating": 5.0, "review": "Great product. Does exactly what is needed and no more.", "verified": true, "helpfulness": "0/0", "author": "george bristow"}, {"rating": 5.0, "review": "Great product. Works well for my daughter watching Netflix and Amazon Video. She also likes the games. I was a little upset that I couldn't stream Comcast directly to the TV, but I think it's a Comcast issue not Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jeff Scoras"}, {"rating": 4.0, "review": "I love it! Keep the movies coming.", "verified": true, "helpfulness": "0/0", "author": "Joseph Bryant"}, {"rating": 4.0, "review": "just what I needed", "verified": true, "helpfulness": "0/0", "author": "Allan Thomson"}, {"rating": 3.0, "review": "Instructions said to plug it in to a power source.  I couldn't get it to work so I had my daughter come to help me.  She couldn't get it to work either but finally she got it to work by plugging it into the HDMI and I don't know what else.  No power cord needed.  WTH??", "verified": true, "helpfulness": "0/0", "author": "J. Schlichting"}, {"rating": 2.0, "review": "I bought a Firestick and a Roku stick at the same time expecting the Firestick to win the comparison.  It did not.  I installed the sticks on 2 different TVs.  The Firestick continually loses it's connection while the Roku never has.  The Firestick is plugged into the wall as recommended.  I switched the sticks onto the opposite TVs to see if location made a difference.  There was no change in performance.  The Roku still worked better.  I ordered another Firestick to see if the original was just bad.  We'll see.", "verified": true, "helpfulness": "0/0", "author": "M L G"}]