[{"rating": 5.0, "review": "We have the Stick and the actual Fire TV. Both work fine for us. We don't do much more than watch Netflix and listen to music with it but it's nice to just have an easier way to do that. The only problem I have with either device is that remotes are SUPER SUPER sensitive. You just bump them and it can shut off what you're watching...All in all, it's a great system and I love it aside from the ultra touchy remote.", "verified": true, "helpfulness": "0/0", "author": "M. Keifer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ricardo Araujo"}, {"rating": 5.0, "review": "Really nice if you don't have cable, and when you are traveling. It does require an Internet connection", "verified": true, "helpfulness": "0/0", "author": "Dale L. Doerr"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Izman"}, {"rating": 5.0, "review": "Works great. Much faster than vizio TV apps.", "verified": true, "helpfulness": "0/0", "author": "Adam D. Warren"}, {"rating": 5.0, "review": "This works great. Everything I needed and more. Would definitely recommend to anyone that is looking for a tv stick.", "verified": true, "helpfulness": "0/0", "author": "Jesse Evans"}, {"rating": 5.0, "review": "It is great...I love it.", "verified": true, "helpfulness": "0/0", "author": "Ricky J"}, {"rating": 5.0, "review": "I absolutely love it!!!!!! Super easy set up & user friendly!", "verified": true, "helpfulness": "0/0", "author": "Tiffiney"}, {"rating": 5.0, "review": "I Totally love the Fire  TV stick.  I previously used a ChromeCast.  When the Fire stick arrived,  I did a side by side test, and the Chrome went to the box where I keep things too good to throw out, but will probably never again be used.The Amazon product is far easier to use.  The remote is a pleasure.  The only improvement I could want is for faster internet without paying such a premium.  I am a customer of Time Warner and unlike many others, have no complaints about the service.  I just do not like their pricing policy.  Comcast is in the process of buying them, and I wonder what surprises are in store.I plan to someday, maybe  soon, to buy a \"Smart\" TV and will no longer need the Fire Stick,but since I installed it, the TV buying plans are on a long-term hold.  I am sure that the product has had the same reaction in a lot more homes because it performs so well.", "verified": true, "helpfulness": "0/0", "author": "Herbertk"}, {"rating": 4.0, "review": "Very happy with purchase - easy set-up and works just as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "Karen Toohey"}]