[{"rating": 4.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Alejandro Gambetta"}, {"rating": 5.0, "review": "I love this thing. I tried the Roku stick, but this was easier interface and it streamed better. I use it for Sling TV, WWE network, Netflix, and Amazon Prime (Obviously) There aren't as many private channels as Roku, but once you get into Roku, you will be disappointed by those channels quickly and the poor quality of the broadcasts. Screaming easy setup via WIFI. I also use Miracast from my phone and tablet, which works perfectly.", "verified": true, "helpfulness": "0/0", "author": "M. Bennett"}, {"rating": 4.0, "review": "Its really good and fast ..", "verified": true, "helpfulness": "0/0", "author": "Kavish"}, {"rating": 5.0, "review": "I have now put the Fire TV Stick, Apple TV, and Roku through their trials (and so did the kids... RIP Roku). What are we still using? You guessed it, the Fire Stick. Here is why...Small foot-print. I already have enough crap around my TV sticking out everywhere. The fact the Fire Stick tucks away behind the TV is just pleasant. Which brings up to reason 2.NFC remote. The Roku and Apple TV require the user to point the remote at the device. That is all good for us who grew up pointing remotes at TVs. However the next generation... those who are still under 3 feet tall may have difficulty with this. Isn't about time we stopped point at stuff and just used it. The Fire Stick uses some form of NFC i haven't really looked into, but its not line of sigh, and i love it. Also the the Roku did not survive the trials as the kids did something bad to the remote i can't figure out what but it no longer works.However the best selling point for the Fire Stick, has been its application support. The fact i have Plex, Netflix and Hulu on there is priceless. Not a big fan of gaming on the stick, but its also possible and kind of amusing when you can get a bunch of adults playing Cross Roads. Overall a win in my book.", "verified": true, "helpfulness": "0/0", "author": "Andrew B. Williams"}, {"rating": 2.0, "review": "I would rate the roku way over the fire tv stick. Roku is easier to use. Lots of work to be done on the fire tv stick.  I hope it improves as time goes on.  My verdict is out on the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Dedsey"}, {"rating": 5.0, "review": "Wonderful!Works great as promised.  So much better watching Prime & Netflix with the fire stick - using the Wii was slow and so inconsistent - I thought Prime and Netflix had the problems.  Very quick connection with Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "ks_colorado"}, {"rating": 5.0, "review": "Love being able to stream to my TV. Easy installation. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Charmor"}, {"rating": 5.0, "review": "I got the fire TV stick it was i was surprised. Took it out of the box took all of 2 minutes to install signed in to and to my surprise I have every thing from net flix to games. Buying one for all my TV's good buy cable", "verified": true, "helpfulness": "0/0", "author": "Wayne Soares"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Alex Hamm"}, {"rating": 5.0, "review": "Thoroughly pleased.", "verified": true, "helpfulness": "0/0", "author": "ayegeebe"}]