[{"rating": 5.0, "review": "Love love love this!  So much we bought a second for the bedroom!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Underwood"}, {"rating": 1.0, "review": "not what i wanted, couldent use it.the speed of hughes net could bring it up", "verified": true, "helpfulness": "0/0", "author": "harry goolie"}, {"rating": 5.0, "review": "Don't get this if you want to start a fitness plan. I have binge watched sooooo many shows and movies. It's wonderful but my couch is starting to show wear.", "verified": true, "helpfulness": "0/0", "author": "enjoy fiction"}, {"rating": 3.0, "review": "Easy to use, but didn't know it had to have a power source. Like having a separate remote.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Irish-Shaw"}, {"rating": 4.0, "review": "Pretty easy to use. Enjoying watching shows I missed during the regular seasons.", "verified": true, "helpfulness": "0/0", "author": "3Mgrandma"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "Mohammed S Haque"}, {"rating": 4.0, "review": "Good item", "verified": true, "helpfulness": "0/0", "author": "Carrol D Copeland"}, {"rating": 5.0, "review": "Daughter purchased a Fire Stick several months ago and really loved it.  We are Amazon Prime Members.  So we purchased one for ourselves.  We use it quite often.", "verified": true, "helpfulness": "0/0", "author": "JeffreyH"}, {"rating": 4.0, "review": "We have used this for a couple days now and really enjoy it.  It is very similar to an Apple tv but it is driven primarily around the Amazon prime system.  There are apps and games to play.  The apps download fast and they include hulu and Netflix to name a few.  I like the parental settings that force a pin #to be typed in when purchasing movies.  I also think the remote is easy to use.  I did notice that it seemed to get hung up when our internet slowed down and it persisted to show the spinning loading circle.  When our internet speed caught back up the Fire stick was still slow, so I ended up unplugging it and letting it reboot.  After that it worked fine and the picture quality is great.", "verified": true, "helpfulness": "0/0", "author": "JPants"}, {"rating": 5.0, "review": "Easy installation and good Amazon support.", "verified": true, "helpfulness": "0/0", "author": "Heidi B."}]