[{"rating": 3.0, "review": "I like being able to choose between using the dedicated remote with apps installed on the stick or casting from my tablet, but there is a problem that pops up periodically. Playback becomes jerky or freezes entirely. It's as if old data can't be dumped from RAM. Unplugging the stick and plugging it back in clears this up. They need to make the memory more efficient in this matter or give us an easier way to reset.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "too soon to tell how much I like it.", "verified": true, "helpfulness": "0/0", "author": "Robert M."}, {"rating": 5.0, "review": "working great, getting ready to dump dish.....  better movies not every single show has queers", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"cg\""}, {"rating": 3.0, "review": "It is indeed a good product and very useful except for one fact, there is no off or power saving setting. It will only either sleep or prompt you to sleep. Unless you unplug it then it will stay on.", "verified": true, "helpfulness": "0/0", "author": "Zac Haynes"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Mervin Campbell"}, {"rating": 5.0, "review": "I couldn't wait to get it up.  My internet connection is slow at times so I get a warning popup telling me that and I have told it continue watching.  It continues without any interruptions.  There is a lot more to explore on it.  So, far I have watched movies and TV shows.  Only played one game and it was good.", "verified": true, "helpfulness": "0/0", "author": "Dawn G. Eglinton"}, {"rating": 5.0, "review": "Better than my Roku3.... This product is awesome. No issues.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Wonderful device. Don't know how we managed without it.", "verified": true, "helpfulness": "0/0", "author": "janice grillo"}, {"rating": 2.0, "review": "Connection keeps dropping. I had to run a dvi/HDMI cable from my computer to my TV because it worked better with the desk top program has", "verified": true, "helpfulness": "0/0", "author": "gary pedraza"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Biker"}]