[{"rating": 5.0, "review": "Excellent product, would buy again", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best purchase on Amazon hands-down! Use for watching Amazon shows as well as Netflix streaming on my TV.", "verified": true, "helpfulness": "0/0", "author": "Michelle Delecki"}, {"rating": 4.0, "review": "Works like a champ. A little glitchy 😭when it gets too hot but(otherwise) ...it's smooth, fast, & very, very enjoyable!!! 👍👍", "verified": true, "helpfulness": "0/0", "author": "Eric Beater"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "val"}, {"rating": 2.0, "review": "Not kid friendly. My 6 year old can work the roku with no problems. This fire stick is difficult for an adult to use. It's been one headache after another. Can't even set up his favorite stations because Amazon doesn't acknowledge Charter. Should have bought another roku", "verified": true, "helpfulness": "0/0", "author": "Stacy"}, {"rating": 2.0, "review": "too many pauses for buffering", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "I decided to break up with my cable company and took the leap of faith on fire TV and let me say I am so happy I did.Pros-easy to set up, navigate, and use including a tutorial video when you first set up-all of my subscription services such as Netflix Hulu HBO Go, showtime anytime etc are all comparable and are at my fingertipsIf you are a prime member you will definitely get the best experience from fire TV because you get lots of free TV shows movies music right on your TV.-fire TV is comparable with your Amazon tablet so if you're watching a movie on the kindle you simply press a button and the movie goes directly to your TV so you can pick up right where you left off. I also have an iPhone and am able to download the fire TV remote app which allows me to control my TV with my phone including voice search.--portability, because the fire TV simply plugs into the HDMI port on your TV you can take it with you as long as you have wifi. I have taken it with me to hotels and my moms with ease so I can have my favorite shows wherever I am.-wide variety of apps games and lots of fun things-nicely priced and the assurity that Amazon will walk you through problems you may have.Cons-the remote given to you is so small easy to lose and not very durable.-unless you have good wifi you may experience some lagging while watching your shows but you have to remember you're streaming and it is a strong possibility.If you're looking to get away from cable this device is amazing and I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "AJSmith"}, {"rating": 5.0, "review": "Probably the most innovative idea ever! I was looking for a way to cut my cable bill, this will allow me to watch the programs I want to watch without the 100's of channels I do not need or watch. Thank you for bringing me into the future of tv watching", "verified": true, "helpfulness": "0/0", "author": "frowny"}, {"rating": 1.0, "review": "The internet connection is really bad.  In the same wrong my blu-ray works wonderful, so I'm sure it is the fire stick, i think i'll be returning it for Google Chome.", "verified": true, "helpfulness": "0/0", "author": "Amanda K Garcia"}, {"rating": 5.0, "review": "Love this thing.  Great selection of programs to watch.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Sandra Kluck"}]