[{"rating": 5.0, "review": "The fire stick is awesome. I travel a lot and this is the only device that works on the hotel WiFi. Setup was a breeze, I was up and running in less than 10 mins. Loving it now....", "verified": true, "helpfulness": "0/0", "author": "Arbee Jr"}, {"rating": 5.0, "review": "Awesome product..so glad I bought one", "verified": true, "helpfulness": "0/0", "author": "Teraca Louagie"}, {"rating": 3.0, "review": "Meh it's ok.", "verified": true, "helpfulness": "0/0", "author": "PainKiller"}, {"rating": 5.0, "review": "This makes life so much easier. This works well with Netflix, Hulu, Sling TV, Pandora and more. Very easy to navigate as well and love the remote app for smart phones.", "verified": true, "helpfulness": "0/0", "author": "Asha Loupy"}, {"rating": 5.0, "review": "Works great!  I find that it works best to choose what we are going to view from my computer and then watch it using the fire stick's watchlist on the tv screen.", "verified": true, "helpfulness": "0/0", "author": "Jean Kruft"}, {"rating": 4.0, "review": "I like the flexibility of being able to add apps and games. The system overall works very well. The only drawbacks that I could think of where (1) speed - maybe I am too spoiled but I noticed it doesn't move as fast as the Apple TV. Being used to move from one screen to the next instantly, with the Fire TV I noticed it lags for a fraction of a second. Similar to the difference between Android and iOS... once there it works great, but it takes a millisecond more to get there. The (2) was the power; I as hopeful I would be able to plug it to the USB port in the TV and do without the power outlet like with the Chromecast but it didn't work entirely. I got a message saying the power was insufficient or something similar, and while I carried on and it generally worked just plugged to the TB, it would turn off and on sporadically so I ended up plugging it to the outlet.", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 3.0, "review": "The Fire TV Stick was very easy to install and connected to my Wifi network.  However, the stick remote is less than desirable.  It is too small and respond too slowly after pressing needed buttons.  The arrow dial method also feels clumsy since you have to be careful when pressing the outer wheel and not press the inner button which is the OK ( Enter ) button.  I think it would have been far easier if the left, right, up, down button were all separated or at least have the ring higher off the inner button to keep from slipping off and touching the inner OK button; it would prevent making errors if you slip off the arrow ring and press accidentally the inner OK button.  I hope I made myself clear enough to potential buyers. I don’t recommend this product; it has issues with reception; too much buffering on certain websites.", "verified": true, "helpfulness": "0/0", "author": "J. G. Velez \"jopopart_books\""}, {"rating": 3.0, "review": "While this is a lower-priced alternative to the other non-cable options out there, a lot of the applications still rely on your subscription to whatever channel the app is \"free\" for.  Good selection of Prime movies, lots of free first episodes of series.  Overall, decent product for a good price and it performs well.  Any slowness would be due to the internet provider speed.", "verified": false, "helpfulness": "0/0", "author": "Cary Cartter \"Cary Cartter\""}, {"rating": 5.0, "review": "Wow!  Great TV!  And no commercials!", "verified": true, "helpfulness": "0/0", "author": "Kane Crawford"}, {"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "JUDSON F. ALVES"}]