[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Dannetta Duncan"}, {"rating": 5.0, "review": "Love this thing. Set up was super easy and it's great to have on a \"dumb\" TV.", "verified": true, "helpfulness": "0/0", "author": "Cynic"}, {"rating": 5.0, "review": "very glad I bought this", "verified": true, "helpfulness": "0/0", "author": "pam"}, {"rating": 5.0, "review": "Does YouTube but runs up against buffering alot", "verified": true, "helpfulness": "0/0", "author": "Michelle Maroot"}, {"rating": 5.0, "review": "This Fire stick is on point...love it!!!", "verified": true, "helpfulness": "0/0", "author": "derick fountain"}, {"rating": 5.0, "review": "I really like the Fire TV Stick. It was easy to set up and gives you a lot of viewing choices.", "verified": true, "helpfulness": "0/0", "author": "D. Compton"}, {"rating": 5.0, "review": "I am very happy with my fire stick. Plugged it in and away u go. Did not have any problems that others on these posts were having with signal. It has u on already if u are a prime member. Great product.", "verified": true, "helpfulness": "0/0", "author": "Heather M. Wilcoxon \"Jake\""}, {"rating": 5.0, "review": "I took advantage of the prime day and got the Fire TV stick after I refused to do so, since i also have the Chromcast. Sorry Google, you guys are grate BUT the different between the 2 is just unbelievable. The Chromcast, with all the respect, moved in the kids room to play YouTube before going to sleep. I found the Fire contain the same apps i used with the Chromcast and even more. The remote control is OK but try the phone app, you are going to love it. Most impotent, Amazon Prime. Also, device came already ready for me so all I had to do was just to plug it in and enjoy.You are going to love it.", "verified": true, "helpfulness": "0/0", "author": "zShuff"}, {"rating": 3.0, "review": "I have 2 Rokus and it is not as easy to use as the Roku.", "verified": true, "helpfulness": "0/0", "author": "Clyde"}, {"rating": 5.0, "review": "I don't know how I survived without this. I love the little remote and I love the interface. Wonderful way to get TV into a room without cable or console.", "verified": true, "helpfulness": "0/0", "author": "Randall Dunigan"}]