[{"rating": 3.0, "review": "Was a gift so I won't complain too much... Upset it does not have HBO go and the ridiculousness that is Prime Video takes over too much of the home screen... It serves its purpose of watching Netflix until I fall asleep", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 5.0, "review": "This is a FUN new toy.  I love my techie toys.  It really makes finding free Prime programming easy.  It's also a great way to find entire an season of a series.There are game apps available, too. I like being able to do the games and use internet sites on the large screen.  The stick is pretty much plug and play.  I used the short extension USB cable enclosed. Just be sure to follow the enclosed instructions.", "verified": true, "helpfulness": "0/0", "author": "S. J. Grider \"Audio Girl\""}, {"rating": 1.0, "review": "Highly disappointed, what had won me over the chromecast was its alleged ability to also mirror cast. This is a blatant lie as you come to find in the forums when searching why its not working.Hundreds of others duped like me. I just lost respect for Amazon, this was shady.", "verified": true, "helpfulness": "0/0", "author": "Richard Wainwright"}, {"rating": 5.0, "review": "I had a Roku 2 and bought this to replace it.....love the Fire TV Stick!!  It is so easy to set up and use...never any problems.Now I own three!!", "verified": true, "helpfulness": "0/0", "author": "deborah j jenkins"}, {"rating": 5.0, "review": "Easy to install, opening up viewing possibilities in minutes.  Very useful.", "verified": true, "helpfulness": "0/0", "author": "Marla C. Daniels"}, {"rating": 5.0, "review": "This thing is Awesome.  I hadn't been using my Prime Movies, but with this I can watch everything on my regular tv.", "verified": true, "helpfulness": "0/0", "author": "Jason Daniel"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Robert A. Smee SR"}, {"rating": 5.0, "review": "It is INEXPENSIVE, and GREAT!!. Hooked right up to my television and my Network VERY EASILY!! Came with a remote control and batteries, and HDMI EXTENDER and a USB charger cord with a Long reach, and I am watching my Netflix and Amazon Prime subscriptions and playing games on a new TV for a price of around $35. A steal !!", "verified": true, "helpfulness": "0/0", "author": "Peter A. Allegra \"Doc Allegra\""}, {"rating": 5.0, "review": "It is what I expected it to be", "verified": true, "helpfulness": "0/0", "author": "David Kibbler"}, {"rating": 5.0, "review": "Was easy to setup and is defiantly worth the time and money!", "verified": true, "helpfulness": "0/0", "author": "Glen McCullough"}]