[{"rating": 5.0, "review": "I liked everything about the Amazon Fire Tv stick but there is only one thing I would like it to have... And it is SPANISH SUBTITLES in it movies and tv shows! Don't forget that there is a huge latin community with the economic power to spend in a service like this but sadly without the hability to understand english at a 100%.Adding that would add a great feature to the service.", "verified": true, "helpfulness": "0/0", "author": "Maarten H. Arguinzones"}, {"rating": 5.0, "review": "I am a huge fan of the Amazon fire stick. It plays my Netflix, but you almost don't need it if you have prime. Music, TV, Movies. It's great. And they have their own shows that they produce which are pretty good.Easy to set up and carry with you. We take it on vacation.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "tech-ninja"}, {"rating": 5.0, "review": "This is the best streaming product on the market.  A must buy.", "verified": true, "helpfulness": "0/0", "author": "Loyal Amazon Customer"}, {"rating": 5.0, "review": "Awesome product!!", "verified": true, "helpfulness": "0/0", "author": "Charles Hess Jr."}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "sl"}, {"rating": 5.0, "review": "Great product. Easy to setup. Works perfectly. I would  recommend to friends and family.", "verified": true, "helpfulness": "0/0", "author": "D. Howard"}, {"rating": 2.0, "review": "I am extremely disappointed in the parental filter. It's only option is wide open for anything to be viewed, or closed so that my kids can only access it when I'm home. There should at least be a rating block.there are some very questionable shows/movies that they shouldn't be privy to. Unimpressed", "verified": true, "helpfulness": "0/0", "author": "cheran"}, {"rating": 5.0, "review": "Simple to set up and easy to use.  I have two flat TV's that are not \"smart\" TV's.  Being able to move the Stick from one TV to another is very convenient.  The remote is small, intuitive, and easy to use.  The only small issue I have is the placement of the power adapter plug halfway up the body of the stick.  The wire is pointing up awkwardly when plugged into the back of the TV.  I would suggest the next generation have the power plug on the end on the Stick to lessen the stress of the plug and wire.  Also, supplying a longer USB power wire would be a welcome plus.", "verified": true, "helpfulness": "0/0", "author": "Saltwatersal"}, {"rating": 5.0, "review": "Worked great right out of the box.", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 5.0, "review": "Great and easy streaming. It surpassed my expectations. Fantastic purchase.", "verified": true, "helpfulness": "0/0", "author": "Rachel D. Raines"}]