[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "U.M."}, {"rating": 4.0, "review": "The Fire Stick works well, but ONLY after I added a Netgear universal WiFi Adapter for Smart TVs to my TV.  It is an older TV (5 yrs.) but it was sold as a smart TV back then, with a few very limited video apps built in. When I initially plugged in the Fire Stick, all I could get was garbage on the screen.  After I hooked up the Netgear adapter,  Netflix, Amazon, etc. all worked fine.  So if you don't get the results you expect initially, consider this fix (less than $50).  Would have saved me much time if the Amazon website had posted this possible complication on the sales page.", "verified": true, "helpfulness": "0/0", "author": "Paul de Temple"}, {"rating": 5.0, "review": "I just love it thanks", "verified": true, "helpfulness": "0/0", "author": "herminia d cruz"}, {"rating": 5.0, "review": "Easy to use, much better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Richard W. Thrift"}, {"rating": 4.0, "review": "Only thing missing is its ability to receive local TV. It's great for watching movies", "verified": true, "helpfulness": "0/0", "author": "queen B"}, {"rating": 2.0, "review": "It does not work at this time because my wifi network is spotty.", "verified": true, "helpfulness": "0/0", "author": "Andrea E. Bettger"}, {"rating": 1.0, "review": "This thing was a frustrating experience. I just wanted to project PowerPoint and some anatomy apps off of my fire HDX.First I tried connecting normally and it just wouldn't work.On my second call to customer service I was told about the hidden function of tapping seven times to 'disable hdcp'. This allowed me to mirror my display...sometimes.I read on a few forums that this device is the least functional available for miracast support. They really shouldn't be allowed to advertise it as a 'function'. When I manage to connect it disconnects randomly and the image is always lagging by a large amount. Audio support is horrible. And of course, Amazon makes no wired adapters to connect a third generation device to a display. So now I have a useless 7\"HDX, less than a year old, and a useless fire tv stick. Save up and just get Apple. They're evil, but their stuff works.", "verified": true, "helpfulness": "0/1", "author": "Istananda"}, {"rating": 4.0, "review": "Good but I need the fire TV", "verified": true, "helpfulness": "0/0", "author": "Tyrone"}, {"rating": 5.0, "review": "It is so seamless and easy to set up and use in general. It seems crips and haven't had any issues streaming like I ha e had with other devices. Definitely a good product.", "verified": true, "helpfulness": "1/1", "author": "Jocelyn Mikutowski"}, {"rating": 5.0, "review": "A+++", "verified": true, "helpfulness": "0/0", "author": "aniyah-09"}]