[{"rating": 5.0, "review": "I ABSOLUTLEY LOVE IT!!!  I like to think I utilize my Amazon Prime membership to its max, and the Fire TV Stick is everything I had hoped it would be!!  I can watch all the shows I love and movies I've purchased right on my tv, no longer left to watch them on a much smaller computer screen.  I highly reccomend this product and would encourage all Amazon Prime members who enjoy the instant video streaming to get this product!", "verified": true, "helpfulness": "0/0", "author": "Dannielle"}, {"rating": 4.0, "review": "Great interface. Love the RF remote. Almost no setup time. It powers from my TVs USB. Highly recommend it for Sling subscribers.", "verified": true, "helpfulness": "0/0", "author": "Robert D Padgett"}, {"rating": 4.0, "review": "Sometimes it is slow to load. I had problems maintaining a connection on one tv.", "verified": true, "helpfulness": "0/0", "author": "oma quiroz"}, {"rating": 3.0, "review": "I'm satisfied with the firestick, but the remote is awful! It needs a pointer so you can see where you are on the screen!", "verified": true, "helpfulness": "0/0", "author": "Gary R. Fague"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Michael E. McDonald"}, {"rating": 5.0, "review": "Very good addition to TV viewing possibilities. If I would change anything it would be the navigation. Does not seem to be much logic to selections available. Some shows are featured on multiple platforms.", "verified": true, "helpfulness": "0/0", "author": "S. B. Cesareo \"Zoomar\""}, {"rating": 3.0, "review": "Works well - needs an HBO to Go app.", "verified": true, "helpfulness": "0/0", "author": "shaverdave"}, {"rating": 5.0, "review": "Everything was great on time and in great condition. Thanks and keep up the great work", "verified": true, "helpfulness": "0/0", "author": "Barry O'Dea"}, {"rating": 2.0, "review": "will not keep my wifi signal for the entire time, then keeps searching. I have to then switch to my rocu box that has no problems. will not purchase another.", "verified": true, "helpfulness": "0/0", "author": "Pablo"}, {"rating": 5.0, "review": "Easy to setup and extremely portable.", "verified": true, "helpfulness": "0/0", "author": "JM"}]