[{"rating": 3.0, "review": "I haven't been impressed with the fire stick.. It has been slow to connect, download and play movies.  I think I'll be returning it and looking for something a little more reliable.", "verified": true, "helpfulness": "0/0", "author": "Gabryelle Peterson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mobolaji Odewole"}, {"rating": 4.0, "review": "It was easy to install.  I'm enjoying all the choices I have to watch and plan to switch to basic cable to save money.  The only problem we had was the sound.  We have 7 speakers hooked up to the TV and couldn't get any sound.  Amazon customer service was no help and very rude.  We fixed the problem by switching the sound from external speakers to tv speakers and that solved the sound problem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My family loves our fire stick!", "verified": true, "helpfulness": "0/0", "author": "Amanda Welsh"}, {"rating": 5.0, "review": "Marvelous. So far.  Love it", "verified": true, "helpfulness": "0/0", "author": "d. whittaker"}, {"rating": 5.0, "review": "Haven't had any issues with mine.  Work well and a lot faster in accessing streams opposed to my Blu-Ray players and Smart TV's.", "verified": true, "helpfulness": "0/0", "author": "Crazy8oooo"}, {"rating": 1.0, "review": "I own 3 Rokus for other tvs and decided to give the Firestick a try.  What a mistake.  The thing locks up and has to be rebooted.  Some of the apps you download from the store don't work properly.  I have gone through the suggested diagnostics several times and have not fixed the problem  I have had it for about 45 days and the site told me it was too late to return it.  I am very disappointed that Amazon would market something that does not appear to be adequately tested - maybe they did the work for Obamacare web site also", "verified": true, "helpfulness": "0/0", "author": "James Hutchinson"}, {"rating": 1.0, "review": "I bought the TV stick because I wanted to watch the shows I purchased through Amazon on my TV.  While I am watching, it flashes black about once a minute.  To make it worse, every few minutes it freezes and I have to push the start button on the remote.  My wireless is not the problem.", "verified": true, "helpfulness": "0/0", "author": "liz64"}, {"rating": 4.0, "review": "Works great once I figured out that with my A/V system I had to connect it to the receiver and not the tv to get the sound to work. I tried a Google Chromecast first and it wouldn't connect to my wifi. I had absolutely no problem with the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Ken \"imkennyg2\""}, {"rating": 1.0, "review": "Would not connect with Amazon account. Tried 2 devices from 2 different locations.very disappointed, techs couldn't help me.", "verified": true, "helpfulness": "0/0", "author": "Kitty24 \"BookKitten\""}]