[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/1", "author": "Caro lucero"}, {"rating": 4.0, "review": "Purchased device on Prime Day. Checked online at work It's was price at $24 when I got home it was $39. Great for watch programs online most movies are old.", "verified": true, "helpfulness": "0/1", "author": "Mark C."}, {"rating": 3.0, "review": "I was using Amazon video app in my blu-ray player before buying fire tv stick. I liked the other apps navigation options showing multiple items in one screen. Fire stick shows only 3 max (blu-ray player app showed atleast 12 in one screen) and you have to keep scrolling to find something.Other thing i dont like is making you to buy the HD version by default instead of normal version which is $1 less. you have to go to other ways to watch option to select the cheaper price. thats unlike Amazon.", "verified": true, "helpfulness": "0/1", "author": "Caprisun"}, {"rating": 3.0, "review": "My first admission is that I really haven't had time to work with the Fire TV Stick.  Set-up and reception - picture quality are all acceptable.Currently I'm a bit confused with what is free and what I need to pay for.  Example? . . . I wanted to try music - found a selection that looked good.  The final screen before playing said something like \"Buy - $2.50\"  Now - I did listen - figuring I can afford the $2.50 - but by simply listening at home did I \"buy\".  Or if I opted for the \"buy\" option would I be able to download all the songs for my listening pleasure.  I'm sure most people who are more savvy than I am would understand.Screening the movies - even the old ones seemed like there were few - if any - that were free.  I may be wrong - again admitting that I didn't work too long.  But I found the short introductory video unhelpful when it came to explaining what the expenses were going to be as I move forward with this system.  Hopefully when my schedule settles down a bit I can explore and learn more.Bottom Line:  I'm confused with exactly what I bought and why it is anything that I want - especially if I want to access TV or movies at no cost.", "verified": true, "helpfulness": "0/1", "author": "Eric R Longman"}, {"rating": 4.0, "review": "Works pretty well.  It compares to many of the other streaming devices out there.  I'm not a big fan of the layout though. I wish the interface was more like my Roku 3.  Does lose signal sometimes and needs to be reset, but that may be an issue with my router.", "verified": true, "helpfulness": "0/1", "author": "N. Lupacchino"}, {"rating": 5.0, "review": "I bought this for my daughter who was moving out with her friend and they love it!  They don't have cable and I felt sorry for them so I bought this so they would have something to watch!  Sure wish they would have had these when I left home on my own!  Lol", "verified": true, "helpfulness": "0/1", "author": "Cheryl Thompson"}, {"rating": 5.0, "review": "Absolutely love it!! Just what we needed", "verified": true, "helpfulness": "0/1", "author": "alyson solch"}, {"rating": 5.0, "review": "Easiest electronic device I've ever installed.", "verified": true, "helpfulness": "0/1", "author": "Janet"}, {"rating": 5.0, "review": "I love this thing!!!", "verified": true, "helpfulness": "0/1", "author": "Omar Martinez"}, {"rating": 4.0, "review": "I like the  ease of use but the picture quality is bad.  The stick makes it  look like a soap opera with character's movements unnaturally smooth.  It's the soap opera effect.  Can anyone relate?", "verified": true, "helpfulness": "0/2", "author": "Angela  Bach"}]