[{"rating": 5.0, "review": "Awesome device. Wish I had bought two.", "verified": true, "helpfulness": "0/0", "author": "Brian C."}, {"rating": 5.0, "review": "Got it on sale at best buy for 25 bucks and it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Ramos"}, {"rating": 4.0, "review": "Netflix through my receiver is crystal clear, quality is on par or better than bluray - 1080p sharp, Dolby Digital II plus sound.I tried to play two racing games - super choppy and unplayable, maybe the CPU is too weak. On comparison games on the Fire TV /not the stick/ are with PS3 performance.Wi-Fi is stable, it takes around 20 seconds to start the device upon power up, there are numerous software apps and channels for media consumption. Interface is not bad, but not great either - quite puzzling, with HEAVY emphasize on Amazon media purchases...It is an OK device in general, I would not buy it again though, in my opinion is worthless unless you want Amazon video and quality Netflix streaming.", "verified": true, "helpfulness": "0/0", "author": "Ananke"}, {"rating": 5.0, "review": "Amazing! Great device and easy hookup!", "verified": false, "helpfulness": "0/0", "author": "Derek M."}, {"rating": 4.0, "review": "Works good, the remote could use a little help...not as good as the remote for my Roku.", "verified": true, "helpfulness": "0/0", "author": "Jose Limon"}, {"rating": 5.0, "review": "Great little device, its actually much better than the chromecast. Amazon finally updated the Netflix app so I'm pretty happy with this stick and my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Alex F."}, {"rating": 4.0, "review": "Works the way it should be", "verified": false, "helpfulness": "0/0", "author": "CHULHUN PARK"}, {"rating": 5.0, "review": "This is a nice product.  Tons of apps, which I find easier to research on Amazon, but there are good suggestions on the Fire app store.  No reason to skip this product, obviously if you use Prime too.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 3.0, "review": "Unfriendly menus,  apps are frustrating,  but at least I don't have sound issues like on the roku", "verified": true, "helpfulness": "0/0", "author": "hearthingkin"}, {"rating": 5.0, "review": "i would like to know if Fire TV will work if it is plugged into a home theater, or does it have to be plugged directly into the TV? I'm asking because if I plug it directly into my tv, I will not have the benefit of using my surround sound that my home theater provides.", "verified": false, "helpfulness": "0/0", "author": "Joe Sawyer"}]