[{"rating": 3.0, "review": "Hmm just got my device, interface works well and it is a breeze to set up. So you ask, why the low rating? It's not a lack on the device's side but a failing of Amazon corporate to secure more content/developed apps. I have Amazon prime, I love Amazon prime, but let's face it in this day in age I expect to be able to get all of the content I pay for on my smart devices. I want HBO go, Starz, ABC, and NBC on this device as well as Netflix and Prime. And, what's more, I think these are reasonable requests. They have all been boiled down into easy to use iPad apps so I don't see why they should be difficult to get on to this format. PLEASE FIX THIS & the device will go from \"acceptable\" to \"can't-live-without\"", "verified": true, "helpfulness": "0/0", "author": "Krystal Bertsch"}, {"rating": 5.0, "review": "Incredibly responsive, clear HD, very fast.I was surprised that so much was packed in a HDMI stick (size of a standard USB stick).Highly recommend for the price and content.**wish it came with the voice remote, but you can use phone/tablet app to have the same functionality.", "verified": true, "helpfulness": "0/0", "author": "JKU-MATT"}, {"rating": 5.0, "review": "Works great, I grabbed it at the initial unbeatable promotional value for prime members!", "verified": true, "helpfulness": "0/0", "author": "DesiInCT"}, {"rating": 4.0, "review": "Nice layout, but missing some user-friendly interface.I had trouble getting it to connect to my network, even though all my other devices were connecting fine. To fix it, on my router I changed my channel to 4 (guess not many routers use that channel), and instantly the firestick connected.The layout is a lot like Windows 8, with the square-shaped titles (tiles) across the screen but a little more organized. It looks nice.Video and movie watching from applications like netflix or prime is good, with no connection problems yet that I've noticed.The cons:1) There is voice search if you use the phone app, however the voice search is strictly for Amazon search, not input. So some applications such as iHeart Radio, to search anything you have to scroll through all the letters to get to the character you want to select. It's very cumbersome.2)There's also the issue of being able to buy something \"too easily\". There was some lag and somehow I accidently clicked onto something inside an application and 3 secs. later a window popped up saying I just purchased a $7 upgrade. There was no prompt for \"are you sure you want to purchase?\". To fix this, I'd suggest going into the parental settings and applying a pin, that way you get at least a warning.3) The user interface for the app market is pretty limited. Doesn't seem to have a way to filter out apps. Such as free or highest rated. You also aren't able to search a category of apps like you can for Android. If there is a way, I haven't figured it out yet.Overall however the stick was a good buy, especially for $19", "verified": true, "helpfulness": "0/0", "author": "Albeee"}, {"rating": 5.0, "review": "Delivered on time, 5 minute no hassle installation,  am enjoying direct streaming right to my TV.  Couldn't be happier am ordering more for family Xmas gifts.  Good job Amazon!", "verified": true, "helpfulness": "0/0", "author": "runcalamity"}, {"rating": 5.0, "review": "Fast. Reasonably priced. Virtually no streaming time and or buffering issues. This thing rocks.", "verified": true, "helpfulness": "0/0", "author": "Robert P."}, {"rating": 5.0, "review": "Easy to navigate. Excellent user friendly remote. Comes fully ready to use. The best thing I've purchased all year.", "verified": true, "helpfulness": "0/0", "author": "lyndii"}, {"rating": 5.0, "review": "Amazing.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 1.0, "review": "returneed", "verified": true, "helpfulness": "0/0", "author": "Jimmy Merchant"}, {"rating": 5.0, "review": "Very low cost way for me to watch all my amazon content on my tv and not just my kindle. Make sure you set a password if you have kids", "verified": true, "helpfulness": "0/0", "author": "Roy Brown"}]