[{"rating": 5.0, "review": "very good product very fast works well would buy again amazon needs to run another deal on these for 19 bucks", "verified": true, "helpfulness": "0/0", "author": "nick"}, {"rating": 1.0, "review": "I would love to be able to use this as my go-to streamer because the interface, apps, remote and video quality are all good. Unfortunately, the audio sync issue is not correctable with my TV or my receiver. Netflix, Hulu and Amazon Prime all have the issue. I know audio sync varies between devices and I've always been able to correct it either through my tv settings or my receiver a/v delay setting. It seems like the audio/video delay is already offset by several miliiseconds and any correction I try through normal means just makes it worse. This should most definitely be a software issue so hopefully it will get fixed. I will update and change my review if this ever does.", "verified": true, "helpfulness": "5/5", "author": "Jason Higgs"}, {"rating": 5.0, "review": "I bought the fire tv stick through my fiancee's prime account for the special $19 prime members price. Took about 5 min. to set up. At first it buffered a lot while watching Netflix but after calling Comcast and having them help me change some settings in my router it works flawlessly!!! I found it to be faster that the roku stick my brother owns. I love the selection of apps and games available. If you're a prime member this is a must to stream the amazon video content. Even if you're not its still a good streaming device.", "verified": false, "helpfulness": "0/0", "author": "po2015"}, {"rating": 4.0, "review": "I bought two of these and really like it. I was going to get the chromecast but this is so much better with the available remote and no need for a tablet or laptop for casting.", "verified": true, "helpfulness": "0/0", "author": "Perchi \"perchi\""}, {"rating": 5.0, "review": "Definitely the best investment I am hooked watching seasons...", "verified": true, "helpfulness": "0/0", "author": "Yaritza Rodriguez"}, {"rating": 4.0, "review": "Remote makes this more convenient than my chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jonny Pear"}, {"rating": 5.0, "review": "I have Roku, Apple TV, smart TV's, but this Fire TV Stick is the best streaming device of them all!  Love love love it!  The remote is bluetooth, so you don't have to aim it at the tv, you can even use it under a blanket.  The interface is fast and fluid.  Streaming starts almost instantly.  What's not to love?", "verified": true, "helpfulness": "0/0", "author": "Cix"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "For under $20 I gave it a shot.  Out of the box it wouldn't connect to my router despite an almost full signal.  Moved it to the living room and it connected, relocated back to original spot and still working.Navigation and playback along with Android app work pretty well.  I wish they would have included anytime of volume control as it requires fumbling with other remotes to just mute, but not a deal breaker.I've had Amazon Prime for years and rarely touched the video/music of Prime because they made it such a pain to use, this changes all that, selection of movies and TV was a nice surprise.Haven't tried the miracast yet, but if it works, this was a great deal.", "verified": true, "helpfulness": "0/0", "author": "Aj"}, {"rating": 4.0, "review": "Very pleased with my Fire TV stick.  It was very easy to setup , I had it working in about 10 minutes, however right after I got it installed it downloaded an update that took about 15 minutes.  Every time we wish to watch a movie the time between we order and it comes down to the TV in almost un-noticeable.", "verified": true, "helpfulness": "0/0", "author": "Robert J."}]