[{"rating": 5.0, "review": "Fire TV is the best streaming service I've use so far love it", "verified": true, "helpfulness": "0/0", "author": "Antwan Newkirk"}, {"rating": 5.0, "review": "Awesome and easy.", "verified": true, "helpfulness": "0/0", "author": "Doug Park"}, {"rating": 5.0, "review": "Everything I thought it would be!!", "verified": true, "helpfulness": "0/0", "author": "Kenneth McFeeters"}, {"rating": 5.0, "review": "Easy set up. Works great. This is a very good choice.", "verified": true, "helpfulness": "0/0", "author": "Happy Memories"}, {"rating": 1.0, "review": "Its ridiculous!!! I am so disappointed", "verified": true, "helpfulness": "0/6", "author": "Nadine"}, {"rating": 5.0, "review": "Great product, was worried about the speed and storage when I first ordered it but so far it's a non-issue. No lag like I frequentlys get with my play station. A great option if you don't need the extra silly features of the box! Also way better than the Apple TV.Only con so far is the USB charging connector. As soon I plugged it in it claimed there was insufficient charge and that I needed to use the cord orovided by Amazon...which I was already doing, which to me seems ridiculous that it'd say that.All the apps are great so far. I like that it gives you channels to watch and so many other options as well. Only frustrating part is Plex costs $4.99 on the apple store and the other apps got s***ty reviews.", "verified": true, "helpfulness": "1/1", "author": "Danielle McCulloch"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/1", "author": "R. Raby \"livingwell202\""}, {"rating": 4.0, "review": "Great little stick.  It definately holds its own against Roku, which I also own.  The Fire Stick needs power supplied.  Unless your TV have the special HDMI port then this is from the side attached usb cable.  Sometimes a USB maintenance port can give the needed power but something to keep in mind.  Also, the AMAZON stick is geared towards amazon prime as its primary source of entertainment.  Other apps can be installed, but they have to be found and selected.  By comparison, the Roku starts with a simple selector screen of which app you want to launch.  Fire stick start with what Amazon show do you want to watch.  Still a GREAT little device.  Occasionally needs to be rebooted which can be frustrating.  The only reason I can't give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "AutoExec"}, {"rating": 4.0, "review": "Works great, easy to hook up, but now one more remote to worry about.", "verified": true, "helpfulness": "0/0", "author": "Larry R"}, {"rating": 5.0, "review": "Just received my Fire TV Stick well before the expected delivery date; setup was easy, and I was immediately offered a free 30 day trial of Amazon Prime. Major plus! The picture quality is also amazing with my Samsung 1080p HDTV. The menu is easy to navigate and the included remote works well at various ranges and angles. After scrolling through everything, I must say that I'm extremely impressed! The things this little plug in can do are endless! Best purchase I've made since my Kindle Fire HDX!", "verified": true, "helpfulness": "0/0", "author": "Ceebaby143"}]