[{"rating": 4.0, "review": "Good product great resolution, but wish I had more control over it to install product like from the play store", "verified": true, "helpfulness": "0/0", "author": "Miguel Carbajal"}, {"rating": 5.0, "review": "Purchased 5 of these as gifts after seeing how awesome they worked. They can even run plex for your personal media. Side loading XBMC works too but speed is not as good as the fire TV it's closer to that of an Rpi.", "verified": true, "helpfulness": "0/0", "author": "Anthony Virtuoso"}, {"rating": 5.0, "review": "I give this product 5 stars. I love it!! It's easy to use and I can now share my Prime movies with my husband on the big screen. I would recommend the Amazon Fire TV stick to everyone. Buy it. You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Martin"}, {"rating": 4.0, "review": "It's not an Apple TV but the price is right.", "verified": true, "helpfulness": "0/0", "author": "TravelerMSY"}, {"rating": 5.0, "review": "Works great for the price. Very nice alternative to the box if you have good WiFi and don't need all the games.", "verified": true, "helpfulness": "0/0", "author": "N. ward"}, {"rating": 4.0, "review": "Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Steven Holder \"olerunner\""}, {"rating": 1.0, "review": "Won't maintain a connection. 4feet from the router, laptops, iPads, phones work fine, this thing says \"connection problems\".I found this Amazon forum discussing the problem, so it's wide spread and well known, but doesnt appear to have a solution.http://smile.amazon.com/forum/kindle/ref=cm_cd_pg_next?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdPage;=11&cdThread;=Tx2CDOG0K31UBSB", "verified": true, "helpfulness": "4/4", "author": "J. Rogers"}, {"rating": 5.0, "review": "Love it, going to order another for my daughter's TV.", "verified": true, "helpfulness": "0/0", "author": "Larry Grant"}, {"rating": 5.0, "review": "This is faster than chromecast.  But you can not stream a chrome browser window and many iOS and Android apps are supporting chrome cast to push to TV.Biggest advantage of this is the remote!  It's a pain to fast forward an YouTube video or some smartphone apps (e.g. YuppTV), but it's a a breeze with FireTV Stick.", "verified": true, "helpfulness": "0/1", "author": "S. Ghantasala"}, {"rating": 5.0, "review": "So far so good. I have the Apple TV and the Roku Box. So I am very familiar with these types of sets. I even had the Chromcast before I gave to my sister. This was a really easy one to set up. And the remote is nice and sleek, albeit, a bit to sensitive. I got this when it was on sale for $19 for Prime members. I like that it gives me really easy and fast access to all the video that I have through my Prime account. Before this I used the app on the Roku and it was slow and buggy. I do hope that Amazon expands that app library to include HBO Go and a few other missing ones. The one complaint I have is that I also bought the Fire Tablet 6 Inch and the app for the Fire TV does not work on it (cannot even install it). This is a very strange move by Amazon, which I hope they correct real soon. Besides that, I think that if you are an Amazon Prime member and deciding between this and the others, this one definitely is worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Akiva Zablocki"}]