[{"rating": 5.0, "review": "Install XBMC into the stick, works like charm. Now I can stream all my fav tv show.", "verified": true, "helpfulness": "3/3", "author": "sing"}, {"rating": 3.0, "review": "Pros :Fastgreat remoteSupports 5ghz WiFi networksCons :Amazon prime content is front in center. You have to navigate to the other apps in a round about way to access Netflix and huluNo casting from your phone like to just and chrome castNo iPhone app at the time of this review", "verified": true, "helpfulness": "1/1", "author": "Filet"}, {"rating": 4.0, "review": "Awesome, easy to connect and set up", "verified": true, "helpfulness": "0/0", "author": "Ricky iriawan"}, {"rating": 2.0, "review": "I have this for awhile now and have become disappointed with the performance. I am not complaining because I only paid $20 for it. It's just that I would not buy it again. The Roku is far better. The Fire stick is slow, real slow. HBO GO is the reason I have it installed on my Vizio SMART TV. It takes several minutes and multiple attempts to get a program to play. Slow, very slow.", "verified": true, "helpfulness": "0/0", "author": "paulg"}, {"rating": 5.0, "review": "Easy to setup and is fast! Much better than many \"smart tv's\" that offer the same features. As a bonus, you can even load XBMC on it!", "verified": true, "helpfulness": "0/0", "author": "My Experience"}, {"rating": 5.0, "review": "I have owned an AppleTV for about 3-4 years and I was excited when Amazon sent an email about this little guy.First it installs very easily and comes with an adapter for your TV incase it is a tight fit to simply plug it into your TV.  It also comes with a power cord which is recommended to use when streaming.  It will make a slight difference when it is plugged in or not (I am sure you TV plays a large part in this too).Each Fire TV Stick is set for your account also (unless purchased as a gift).  So when you first plug it in and turn it on it will download an update and force you to watch a 3-5 minute video (or let it run and go make popcorn).  After that it is smooth sailing.  The menu is easy to navigate and very simple.  Choosing between just Prime videos, your library & other possible shows/tvs to purchase can be done with ease.Remember to set up the settings you want in place if you have kids and do not want them to be able to purchase anything without a 'code'  With 5 kids in my house I have the code option setup and have avoided many purchases.  Other options are available to cut down on what can be seen (tv/movie ratings) to help protect little ones too if they do not know the code.The best part of this was I took it with me to my families house during the holidays, plugged it into their TV, hooked up to their internet and we were streaming movies in a minute :)I love this thing so much I haven't turned on my AppleTV in over a month!", "verified": true, "helpfulness": "1/1", "author": "Not a Mover or a Shaker"}, {"rating": 2.0, "review": "I was beyond excited for this to arrive, and considering I pre-ordered it, I felt like my wait was forever.  (The half off price I received as a Prime Member made me happy enough to wait it out).  As a matter of fact, I was so excited to get a Fire TV Stick, I ended ordering two!  I stream media basically 24/7 in my house, and my beloved PS2 had finally bit the dust, so this was my new adventure.  I won't even mention the shipping problems, since they as for that review separately, but lets just say, I didn't have a pleasant experience.  When I FINALLY was able to plug my Fire Stick in for the first time, my BRAND NEW, JUST REALEASED device had to update.  Wait, what?  Why is there an update already for something I pre-ordered and received upon it's debut?  The update felt miserably slow, then failed, and had to start all over again.  When it finally opened, I have to say that set up and use were quite easy.  As a matter of fact, even my 4 year old has gotten the hang of using this, and we have had it 5 days total.  But in these 5 days, the device buffers constantly.  And for those who want to say that it's my internet connection...wrong.  My former PS2, my Blu-ray players with wifi capability (in rooms much further from my router), my laptops, my cell phones, and my iPad do not have any problems with connectivity or speed.  The internet service I have is optimum for movie streaming, and has never caused a problem in the past.  The buffering on the Fire Stick is constant, and very annoying.  I have yet to make it through one movie or show without this constant loading, and have even had one movie stop playing all together.  I had read reviews about how fast this device was...well, that is not my experience.I give this device 2 stars for ease of use, how discrete it is behind my TV, and for the idea behind it all.  If it worked reliably, this would be an amazing media streaming device...but the truth is, it doesn't.  What a disappointment Amazon.", "verified": true, "helpfulness": "0/0", "author": "Kristen Nicole"}, {"rating": 5.0, "review": "Love it , but price is to high,  25 bucks would be a good price for this", "verified": true, "helpfulness": "0/0", "author": "Pachine"}, {"rating": 4.0, "review": "Not A review, I want to know if this will work without having my desktop up & running. I have WIFI with the modem & want to put this in my bedroom If it will pick up Netflix without my computer being necessary. Thank you very much, Robert", "verified": false, "helpfulness": "0/0", "author": "Robert W. Oliver Jr. \"MECHANIC\""}, {"rating": 5.0, "review": "Easy setup and navigation.  Great!!", "verified": true, "helpfulness": "0/0", "author": "Jacklyn V Hooper"}]