[{"rating": 5.0, "review": "Very convenient and nice options on the applications that can be utilized.  Setup takes less than 5 minutes and I haven't had any issues with the streaming content.", "verified": true, "helpfulness": "0/0", "author": "Christopher P."}, {"rating": 5.0, "review": "My first experience with the whole ‘I-TV’ market. The price alone made it a worthwhile purchase. I’m an Amazon Prime subscriber and own a Kindle HDX 8.9 64GB. The Fire TV stick was easy to setup, the only hassle being connecting the stick to an electrical outlet, which fortunately was close to the stick.The Fire TV Stick integrated easy with my Amazon Prime and connects with my Kindle with no issues, my tablet used either in mirror mode or as a keyboard controller.The menu is super responsive to the controller, and the layout is definitely Amazon Prime driven. Only issue I have is trying to look at full app/movie libraries. It kind of gives only featured or “favorite” choices upfront. (I found you can just go directly to Amazon website to browse all apps and movies available to Amazon Fire TV Stick).I got this mainly to avoid the hassle of turning on a console (like a PS3 or XBOX) for all my entertainment apps like Amazon Prime, Netflix, etc. This thing makes life so much easier in that regard.Then there’s the ability to play games! I bought the Amazon Fire game controller and it’s amazing. Can’t play any apps that uses tons of GBs for size, but haven’t yearned for any outside of the app library for Fire TV.Biggest surprise was the ability to install third party apps without rooting or messing the thing up. You can really beef this thing up!All in all, I’d get another if this thing broke or got stolen.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "jlt_fictionguitarist"}, {"rating": 5.0, "review": "I love Fire TV Stick! It is very convenient and easy to use. I use various platforms for entertainment (netflix, amazon prime video, hulu plus, funimation, etc) and the Fire TV Stick makes them extremely easy to navigate. For comparison, I was using a PS3 to do the same thing and it was much slower and took time to start up, whereas the Fire Stick is ready as soon as you turn on the TV.", "verified": true, "helpfulness": "0/0", "author": "danamyte9"}, {"rating": 5.0, "review": "Love this thing.  Its less than 1/2 the price of an AppleTv and does more.  I now own 2.", "verified": true, "helpfulness": "0/0", "author": "B-Mo"}, {"rating": 5.0, "review": "I think it works great. I love the price and I love the remote. It is great that you don't have to point the remote at anything in particular. I like the way the TV stick functions as well.", "verified": true, "helpfulness": "0/0", "author": "SkyD"}, {"rating": 2.0, "review": "I love the concept of this. Not a huge fan of the results of search when searching for apps but the worst part for me is what I paid for and the quality. When I plug it in I have to mess with the cord over and over just to get it to turn on and sometimes it will just stop working in the middle of a show. Also, the down button of the remote won't work unless you push super hard with your finger. I use it and stick it out because my kids like having all the apps on one device, but I'm definitely disappointed with what I expected granted it's an actual Amazon item.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "great for any prime member with hd tv", "verified": true, "helpfulness": "0/0", "author": "Thor"}, {"rating": 5.0, "review": "best gadget in the household", "verified": true, "helpfulness": "0/0", "author": "LUCY C YOUNG"}, {"rating": 5.0, "review": "Absolutely love it. Easy to set up and use for people like that are not tech savy.", "verified": true, "helpfulness": "0/0", "author": "Sam M."}, {"rating": 5.0, "review": "Magnificent... I enjoy it to the fullest thinking of purchasing another one!!!!", "verified": true, "helpfulness": "0/0", "author": "Brian Davis"}]