[{"rating": 4.0, "review": "Its been time consuming finding everything I'm used too but reception is great and there is less comercials", "verified": true, "helpfulness": "0/0", "author": "Evelyn Armatta"}, {"rating": 1.0, "review": "My fire stick loses connection on Sling TV", "verified": true, "helpfulness": "0/0", "author": "Jarvis"}, {"rating": 5.0, "review": "Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "william mcswain"}, {"rating": 1.0, "review": "Didn't work because my TV was 6 years old? Really?", "verified": true, "helpfulness": "0/0", "author": "Amber"}, {"rating": 2.0, "review": "TLDR: If you are the type of person who still doesn't own a smartphone or tablet, and can tolerate the slow input of a remote, then maybe this product is for you. Personally I would not have let it leave the drawing board. This would have been a great device in the age before smartphones and tablets. I think the hardware is a nice upgrade over the first gen Chromecast but attempts to be way more than it should without nailing the basics first.I got this for the $20 introductory price. After already owning a Chromecast I kind of just wanted to give this a try for comparison sake. I figured the additional memory, dual core process, and especially better WiFi would improve startup times and provide better quality. I honestly don't know if any of that is true because the usability is just so much worse than my Chromecast. This thing gets 0 use in my household.Failures:I tried casting from Netflix (iPad) to Fire TV. On a Chromecast it would launch Netflix, and then begin streaming. On Fire TV I am instead promoted to login... what???! I had to take out the stupid remote and manually type character by character. Perhaps there is some app for this that might be easier via phone, but it's still pointless (and voice doesn't work for email/pwd login). Chromecast Just Works. I and my girlfriend have phones, tablets and PCs. We can cast from any of these which are at our finger tips. We even have different Netflix accounts - both seamlessly work with Chromecast.I've paid for Plex on iOS and Android. I can cast again from any device to my Chromecast. Truly a great experience. Apparently I need to pay for the Plex app AGAIN on the Amazon Fire TV Stick. I'm not even sure if I can properly cast Plex or I would be forced to use the terrible remote again.I still can't cast Hulu. Again I am forced to interact with the device directly. I never want to do that.", "verified": true, "helpfulness": "0/0", "author": "Mark Bellon"}, {"rating": 5.0, "review": "So easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Westerfluf"}, {"rating": 3.0, "review": "It works fine, but you can't see much with out paying for something else", "verified": true, "helpfulness": "0/0", "author": "Ak"}, {"rating": 5.0, "review": "I really love this device!!! It is perfect! I love the endless streaming opportunities. Its small enough that you never notice it! The remote is simple and easy to understand. Great product!!!", "verified": true, "helpfulness": "0/0", "author": "SpeedRacer89 \"Ryan\""}, {"rating": 2.0, "review": "Was not apparent that hbo go and shotimeanytime do not work with Comcast.  Otherwise works well. No significant difference to the roku.", "verified": true, "helpfulness": "0/0", "author": "william brook"}, {"rating": 3.0, "review": "It's nice but there is a lot of buffing time sometimes while watching shows on Netflix. The quality of the picture is not all that great.", "verified": true, "helpfulness": "0/0", "author": "BOB HODGES"}]