[{"rating": 3.0, "review": "i bought this because I am a Prime member. This is the first device I have tried. I will use it when there is nothing on my cable TV channels that I want to watch. I do find it time consuming to surf the options for something to watch.", "verified": true, "helpfulness": "0/0", "author": "Earl"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Butterfly Heart"}, {"rating": 1.0, "review": "Sad to say that this product did not meet any of my expectations.  The device was slow to load on my LG SmartTV, and the Wifi was working perfect on every other device I owned connected to Wifi, but this device did not want to connect to my network.  Loading apps and general use of the device seems very slow.  I expected more from this device but this was a complete bust unfortunately.  In my opinion if a device has problems simply connecting to a network that is working 100%, then deeper internal issues are to be expected of this device unfortunately.  I certainly hope that Amazon works out the kinks someday or simply goes back to the drawing board, this is almost bad as HP.  I absolutely love the Amazon Echo, but I am certainly not feeling that sufficient time and effort was put into making the firestick, I imagine it was rushed in order to compete with other similar products in the market unfortunately.I would certainly purchase something like this again from Amazon if they get it right.....*I returned this product promptly back to Amazon...., upon realizing all their troubleshooting advice was useless", "verified": true, "helpfulness": "0/0", "author": "RMatila"}, {"rating": 5.0, "review": "Very easy to set up. And using my iPhone as a remote is great. I love the voice function", "verified": true, "helpfulness": "0/0", "author": "mrgreen"}, {"rating": 4.0, "review": "Fun, good bye Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Avi"}, {"rating": 4.0, "review": "This thing works great.  The only reason i'm giving it 4 stars is because i wanted to install Kodi on it and i'm not able to anymore.  I was told that with the firmware upgrade, they discontinued the support.  Wish i knew about that before i bought it.  :/", "verified": true, "helpfulness": "0/1", "author": "tC \"tC\""}, {"rating": 5.0, "review": "....sorry, can't write review now...busy enjoying all my 'stuff' thru Fire TV Stick...haven't been to work in 3 days. Got Fire Stick Flu...I hope you all catch it. Bye!", "verified": true, "helpfulness": "0/0", "author": "jimuleda"}, {"rating": 5.0, "review": "Easy setup, a myriad of free movies and a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Champion"}, {"rating": 2.0, "review": "It sucks,  it doesn't do anything I want to does it loses connection to anything. Plus it's laggy", "verified": true, "helpfulness": "0/0", "author": "Dylan Burger"}, {"rating": 5.0, "review": "Fantastic media player and more. We use them on a daily basis for video, films, TV, games, music, everything. It's fast and intuitive and a fine compliment to our home entertainment situation.", "verified": true, "helpfulness": "0/0", "author": "JamesVB"}]