[{"rating": 3.0, "review": "I was excited about this purchase for watching movies on my big screen for which I don't have a DVD player. I thought the fire stick came by itself. But it has a wire hanging down from the TV. I hung the TV on the wall and ran all the wires in the wall but now you see the Fire stick wire.", "verified": true, "helpfulness": "0/0", "author": "Rayrunn"}, {"rating": 5.0, "review": "We love the flexibility of the Fire TV Stick.  I can use it in the kids playroom, our Family room, and even on vacation.  Love the games, kids tv shows, tv selections for us.  The movie selection is OK, not great, but we knew that going into it.  I would highly recommend this if you have Amazon Prime as we do.", "verified": true, "helpfulness": "0/0", "author": "tmj73"}, {"rating": 5.0, "review": "Great product and totally meets/exceeds expectations.  Searching is a bit annoying so I would go for the bigger remote with voice option next time around.  Very satisfied overall.", "verified": true, "helpfulness": "0/0", "author": "Abbas Qasim"}, {"rating": 5.0, "review": "ITS A NO BRAINER FOR ANY PRIME MEMBER TO GET THIS. ITS EASY ALL THE WAY AROUND AND SO MUCH TO IT", "verified": true, "helpfulness": "0/0", "author": "THE RANGER"}, {"rating": 5.0, "review": "My family is just crazy about the Fire Stick and what it offers so much so that there is a bit of a fight going on for watching TV in our family room as everyone wants to watch their own favorites I see more Fire Sticks in our future for other TV's  in our home. Couldn't be easier to use plug and play. We had been anxiously awaiting this Fire Stick to use our Amazon Prime movies as our Samsung does not have the Amazon Instant Video App so now we have it and are thrilled to be able to access the  movies.", "verified": true, "helpfulness": "0/0", "author": "Lisa K. DiBucci"}, {"rating": 5.0, "review": "I love it....saved me from buying another smart TV later......", "verified": true, "helpfulness": "0/0", "author": "Theresa F. Hug"}, {"rating": 5.0, "review": "They work Great", "verified": true, "helpfulness": "0/0", "author": "JL"}, {"rating": 5.0, "review": "Works great, exactly as described.", "verified": true, "helpfulness": "0/0", "author": "FL"}, {"rating": 5.0, "review": "It's a pleasure to have, don't know why I waited so long to get one", "verified": true, "helpfulness": "0/0", "author": "kim stallings"}, {"rating": 4.0, "review": "Good but not as good as my Roku 3. It is worth the cost for a 2nd or 3rd TV but I would not use this on my primary TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]