[{"rating": 1.0, "review": "Unless you enjoy constant buffering and frustration, save your money. Even plugged in next to our router, and consistently getting more than 30Mbps speeds clocked on the wireless, the Fire TV Stick still has problems loading, playing, and doing just about anything. We REALLY wanted to like this thing, but it's utter garbage.", "verified": true, "helpfulness": "1/2", "author": "Fred Bauermeister"}, {"rating": 1.0, "review": "Awful product.  Not sure if the problem is with this particular lot, as I read reviews AFTER buying the item and was having problems and saw a slew of negative reviews.  This item would frequently short out and repeatedly not have sound at all.  I read the reviews of others who have had similar problems and decided to return it immediately.  I purchased a Roku stick instead and am thrilled with it.  Also, beware, this particular stick I am reviewing comes already loaded with all your Amazon billing information and somehow I had over $60 charged to my account in video on demand purchases.  Not sure how this happened but that is a small fortune and I didn't get a refund on that.  I am an Amazon Prime member and get all the shows that were charged to me free with Prime on Demand and am not sure what the malfunction is.  Needless to say this was one expensive mistake and is far gone from my house.", "verified": true, "helpfulness": "1/2", "author": "J. Saum"}, {"rating": 5.0, "review": "I am really enjoying my Fire Stick. Such a great alternative to cable TV!", "verified": true, "helpfulness": "0/0", "author": "Shanna Hadden"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Hilary Boudreau"}, {"rating": 3.0, "review": "While this is a great little streaming stick,the UI need work. Getting to the App Store is awkward. As well as general navigation. A great attempt but falls short like most.", "verified": true, "helpfulness": "0/0", "author": "Stephen Greco"}, {"rating": 5.0, "review": "well thought out product, simple to install and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Neal \"line worker\""}, {"rating": 4.0, "review": "While having many apps and providing access to movies and tv shows with relative ease, it falls short by not addressing a simple streaming access question from a pc. I am still unable to have a stream on my pc wirelessly picked up on the tv.", "verified": true, "helpfulness": "0/0", "author": "stephen marksamer"}, {"rating": 1.0, "review": "Kept losing wifi signal.  I tried all troubleshooting tips but nothing would work.  Its not my wifi, all my other devices work just fine.  All the tech troubleshooting directed me to moving my wifi closer, trying to get the stick into range of my wifi. etc.  my wifi is just in the next room.  very disappointed.  I really wanted to like this.", "verified": true, "helpfulness": "1/2", "author": "melisa m."}, {"rating": 5.0, "review": "Easy to use and quick to set up anywhere you go.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Long"}, {"rating": 5.0, "review": "Says what it does, does what it says. Flawlessly.", "verified": true, "helpfulness": "0/0", "author": "MissThang71"}]