[{"rating": 5.0, "review": "great service, nice unit. we got the optional remote for doing voice searches & it works really well out of the box. we're not gamers so we got the Stick. glad we did. well worth it", "verified": true, "helpfulness": "0/1", "author": "Terrence P Gallagher"}, {"rating": 5.0, "review": "Much smoother an faster than any alternative.", "verified": true, "helpfulness": "0/1", "author": "Benjamin Larrabee"}, {"rating": 5.0, "review": "It was a gift but I would definitely buy it. It's great love the picture quality", "verified": true, "helpfulness": "0/1", "author": "Phil"}, {"rating": 5.0, "review": "Great device! No more having to hook up my laptop to watch Amazon prime movies, YouTube or Hulu. Quick and easy setup and even connects to 5gHz wifi. Very pleased with my purchase.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Tom Cannon"}, {"rating": 1.0, "review": "Amazon stick kept freezing up in the \"amazon\" screen that comes up om the screen when it is powered on. Looks like i got a defective product.", "verified": true, "helpfulness": "0/1", "author": "tomas ramos"}, {"rating": 2.0, "review": "Extremely frustrating to use. Everytime I pause OINTB in Netfix it causes my sound bar to malfunction. Other television programs like Futurama work just fine. The audio programming is set up the same on both shows in Netflix so I don't understand it, but it's driving me crazy.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup and use.  I love the fact that it is portable.  I have even taken on vacation with me and used in hotels.", "verified": true, "helpfulness": "0/1", "author": "Marty Rand"}, {"rating": 5.0, "review": "Awesome love it a d easy to setup", "verified": true, "helpfulness": "0/1", "author": "Columbia /Columbo"}, {"rating": 5.0, "review": "Best way to get everything shown onto your tv without having to watch it on a computer. Can even surf the internet.", "verified": true, "helpfulness": "0/1", "author": "My Stuff"}]