[{"rating": 4.0, "review": "The device completely justifies the money(19$) that I spent on buying it. Everything works as expected; excellent picture quality, plentiful selection of apps and games.  The definite selling point of this device is the remote that ships with the stick. It makes navigation really easy in addition to supporting game-play out of the box. The only disappointing thing is that there is no way to shut down this device if we use an external power source to power it. The stick is advertised to conserve energy by going into sleep mode after 30 mins of inactivity, but I would have liked the ability to turn off the power to my gadget with the least amount of hassle.", "verified": true, "helpfulness": "0/0", "author": "Anand \"anand\""}, {"rating": 5.0, "review": "Amazing little gadget!  My Prime movies and my netflix and other channels chrystal clear!  Its an all in one!  The picture I get on my Vizio flat screen is amazing!!!!  I got it on sale a few months before for $19.99 what a great buy!", "verified": true, "helpfulness": "0/0", "author": "Linda Demars"}, {"rating": 5.0, "review": "It's the best than I think.", "verified": true, "helpfulness": "1/1", "author": "Dang X Nguyen"}, {"rating": 2.0, "review": "Here is my 1st day experience.During initial setup it froze on enabling parental controls. After navigating back and retrying it several times, it finally enabled parental controls.I have a very reliable AC router, and both 5GHz and 2.4GHz signals are quite strong (measured by two different Android test utilities). In fact the Samsung smart TV uses 5GHz band without ever dropping connections, while the Sony Player is on 2.4GHz frequency, and also works fine.I chose 5GHz band for the Fire Stick. It kept freezing, buffering, and eventually completely freezing, so I had to power-cycle it. I tried to use 2.4GHz, and it seemed to work stable, but occasionally was exiting the YouTube app.The interface is very slick and intuitive. The remote responds quite fast (much more responsive than Samsung H6350's remote)The build quality is very good. The remote control is perfect.I will keep it for another week or two to see if Amazon releases a reliable patch, otherwise there is no point keeping it.", "verified": true, "helpfulness": "0/0", "author": "Arsen"}, {"rating": 1.0, "review": "Worked when I first connected it, but has not worked since. It can't hold a connection and says \"connected with problems\". It just freezes constantly. Very annoying. Apparently this is a common problem.", "verified": true, "helpfulness": "0/1", "author": "Avid reader"}, {"rating": 3.0, "review": "I like that it's very stable, but what I don't like is that i can't play my own videos, because they want you to put all your personal photos and videos an there server even though they said no body else is going to see it, I don't feel secure, that's the down side.", "verified": true, "helpfulness": "0/0", "author": "Astrid Perez Pineda"}, {"rating": 1.0, "review": "giving 1 star because when it works, it works good. the wifi controller ( or the software) is the worst I've seen so far. I have few APs at my home, this one works with one of them occasionally, and all other times and all other APs this thing doesn't connect. the display is great when it works.my apple TV or my blue ray player never fails to connect to any of my wifi APs.this device is able to scan and accept the WPA2 keys, but display a message \" connected with problems \" even though it was able to acquire IP and DNS entries successfully.I truly hope this is a firmware issue and amazon will fix it with a magic f/w update.i still am a big fan of amazon's customer service and fantastic delivery, but this device is a failure", "verified": true, "helpfulness": "0/1", "author": "Gopa \"Gopa\""}, {"rating": 5.0, "review": "The best ever. Better than my blue ray player", "verified": true, "helpfulness": "0/0", "author": "Gar"}, {"rating": 5.0, "review": "Amazon got it right! I bought the Fire TV Stick during the Prime member sale. At that time I experienced the same WiFi connection problems the many others complained about. I sent it back for a replacement and now its great! No connection problems at all.The playback is far superior than most other similar devices. You don't have to start each program individually unlike BluRay streaming players. Content loads very quickly. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Robert Yale \"Pyro Bob\""}, {"rating": 5.0, "review": "Works great! I love that it comes with a remote and you don't have to use your phone or iPad like you do with Chromecast. I think this device is much easier to use and has more features. I am thinking of purchasing a second device for another TV in my home. Good buy!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}]