[{"rating": 3.0, "review": "Please help me understand how there can be customer reviews of a product that is not in stock until mid January 2015.", "verified": false, "helpfulness": "0/0", "author": "jameswhe \"James\""}, {"rating": 5.0, "review": "Love it when things do exactly what they are supposed to", "verified": true, "helpfulness": "0/0", "author": "Jason Tacoma"}, {"rating": 4.0, "review": "Easy setup and easy navigation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Plugged it in, it worked right away, no messing around!", "verified": true, "helpfulness": "0/0", "author": "Charles F. Goehler"}, {"rating": 5.0, "review": "I love it. Sets up in minutes. Now I can watch my Netflix on my old bedroom TV. Well worth the money. I wish I had bought a second one while they were on sale.", "verified": true, "helpfulness": "0/0", "author": "Reader from the suburbs"}, {"rating": 5.0, "review": "It's amazing, great quality, very easy to install", "verified": true, "helpfulness": "0/0", "author": "vickyvicks \"Vicky\""}, {"rating": 1.0, "review": "This thing works great, until it doesn't work. We were impressed by the streaming quality until the grey static screen showed up on our TV. This HDMI port on our TV always works without any issues with our Bluray player. The Fire TV won't stay on for longer than 30 minutes at a time so we still haven't finished watching this 007 movie. Is this a defective product that needs to be returned or is there something else we can do?", "verified": true, "helpfulness": "2/3", "author": "Annie T Yoshiyama"}, {"rating": 1.0, "review": "Without Prine membership it's worthless. ChromeCast is better for my use.", "verified": true, "helpfulness": "3/5", "author": "Alejandro najera"}, {"rating": 5.0, "review": "Really happy with this purchase. This item is cheap enough that I can put one on all of my tv's. I love the fact that I can quickly take my amazon library with me to a family members house. It comes with a power adapter but I was able to just plug the unit into my USB slot on my tv. I also have the roku stick and I prefer amazons stick due to the price.", "verified": true, "helpfulness": "0/0", "author": "Adrian R."}, {"rating": 5.0, "review": "Great product. Easy to set up/use", "verified": true, "helpfulness": "0/0", "author": "Abby Petrullo"}]