[{"rating": 4.0, "review": "I own two of them bought about 8 months apart both on sale.  The only things I do not like about them is the remote can be touchy on the directional buttons and the fact they do not have the time of day on the main home window.", "verified": true, "helpfulness": "0/0", "author": "Paul S"}, {"rating": 5.0, "review": "It works great!! Check your wi-fi and internet service before writing a negative review.I received the fire stick and from the second I used it, I loved it. It does exactly what it advertises. I really feel that those who have issues either live in the sticks or their internet service plans need to be revamped. Buy it!", "verified": true, "helpfulness": "0/0", "author": "Marvin Whitfield \"Progress is a slow process\""}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "John D. Parry"}, {"rating": 5.0, "review": "NO MORE NEED FOR REDBOX,", "verified": true, "helpfulness": "0/0", "author": "SLAVO"}, {"rating": 5.0, "review": "Perfect for netflix", "verified": true, "helpfulness": "1/1", "author": "michael"}, {"rating": 3.0, "review": "The Fire Stick functions well enough. I do prefer Apple TV for its interface, speed, and ease, but this does work. I'm using it for a guest room and would not use it as my main streaming device. In addition to the fact that they recommend plugging the device into an outlet (don't think it's actually a small, integrated HDMI device—they say it's functionality may suffer without the 110v.), the connection to Prime was not at all fluid for me. My wife and I have shared a subscription for years, and yet when I went to sign in, it refused to allow me to stream anything and instead signed my up for a new account! I cancelled immediately, and credit goes to Amazon (who I love otherwise) for immediately credited my account back, but it was still disappointing. What my wife and I found out later was that Amazon was changing their terms and no longer letting you share your subscription with anyone who does not reside with you. Not a problem for my wife and I, but still a disappointment and no reason for the device not to work seamlessly. Still recommend, but plug it in and make sure your account is straight.", "verified": true, "helpfulness": "1/1", "author": "David R. \"Abide\""}, {"rating": 1.0, "review": "The Fire Stick got extremely hot.  So hot that I could not remove it from my TV until I removed the power and let it cool down.  It has never worked and it has made one of my HDMI inputs non functioning.  I want to return it.", "verified": true, "helpfulness": "2/2", "author": "Roger Houser"}, {"rating": 5.0, "review": "Excellen!", "verified": true, "helpfulness": "0/0", "author": "GABRIEL DE LA ROSA"}, {"rating": 5.0, "review": "Great product, easy to use and easy to set up, so many viewing options", "verified": true, "helpfulness": "0/0", "author": "Alejandro Zamudio \"AZ\""}, {"rating": 5.0, "review": "Fabulous.", "verified": true, "helpfulness": "0/0", "author": "Christina Bloom"}]