[{"rating": 4.0, "review": "Solid device for $39. Undrstandably a little slower than the $99 Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Tim Kennett \"husband, father, and teacher\""}, {"rating": 5.0, "review": "Works great! I love the idea that I can take this on trips and use at a hotel. Plus, now I can watch what I want to watch and the kids and hubby can watch their shows on the other TV with the Fire TV box! Cool beans!", "verified": true, "helpfulness": "0/0", "author": "Shelly W. \"Shelly Wilson\""}, {"rating": 5.0, "review": "Fire TV is replacing all of the other TV devices I own. I live in Mexico and most of the apps worked just fine (Still trying to get the HuluPlus to work over here). Plus, I just cleaned up the setup I had on my projector room since I don't have to run the HDMI cables around anymore, I just plugged the Fire TV directly to the back of the projector and thats it. Perfect!", "verified": true, "helpfulness": "0/0", "author": "SALVADOR ANDRE CHAVEZ R"}, {"rating": 4.0, "review": "simple to use, and the remote is a big advantage over the chromecast, I have both but prefer the fire stick for most tasks.", "verified": true, "helpfulness": "0/0", "author": "Henry C. Suhr III"}, {"rating": 5.0, "review": "The FIRE TV STICK accedes my expectations. If you are anything like me moving into the 21st. century has come about with a great deal of kicking and screaming! However; just one day with this new FIRE TV STICK and I am raring to move to the next level. This is better truly an evolution in TV viewing. So much for so little if you are on the fence drop down an order this immediately!!! If you have family, friends, or others who may be stuck buy them a FIRE STICK and help them move seamlessly into this century. GET THIS NOW!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jennie Singletary"}, {"rating": 1.0, "review": "The first time we used it was cool, it didn't work after that. It displayed a blue screen with an error message on it.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 3.0, "review": "Roku seems to have more apps. Need a twc app so that I can get cable tv shows as well", "verified": true, "helpfulness": "1/1", "author": "Paul E. Prachyl"}, {"rating": 5.0, "review": "Nice one step to access Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Richard A Lee"}, {"rating": 5.0, "review": "This is great. I can watch my Tablo TV using this on any TV in the house even the non-smart ones. It allows me to listen to my Amazon music without a computer.", "verified": true, "helpfulness": "0/0", "author": "SoCal"}, {"rating": 5.0, "review": "Stable and easy to use", "verified": true, "helpfulness": "0/0", "author": "Shuang Du"}]