[{"rating": 4.0, "review": "got this for half price during the Amazon summer sale....would be worth the normal price.  I already have a Roku player...this is smaller and easier to use.", "verified": true, "helpfulness": "0/0", "author": "nosynora \"nosynora\""}, {"rating": 1.0, "review": "I could only find app I had to pay for. I live outside of the US and probably do not have a provider that support the free ones.I couldn't get any apps that are not registered with Amazon. So where I live it is worthless.", "verified": true, "helpfulness": "0/0", "author": "Klaas Ruitinga"}, {"rating": 4.0, "review": "I enjoy my Amazon fire stick one of the best products this year", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works flawlessly", "verified": true, "helpfulness": "0/0", "author": "Straight2the."}, {"rating": 5.0, "review": "Exelent picture quality! More choices of movies than satellite tv!", "verified": true, "helpfulness": "0/0", "author": "leverett autrey"}, {"rating": 5.0, "review": "Pretty impressed, had low expectations bc of the price but it was worth the gamble and definitely paid off.", "verified": true, "helpfulness": "0/0", "author": "Lance Baird"}, {"rating": 5.0, "review": "I love the Fire Stick! Very user friendly. Way better than Roku", "verified": true, "helpfulness": "0/0", "author": "Jill Brechtelsbauer"}, {"rating": 2.0, "review": "I received this item a few days ago and after about of week I can say I will no longer be using this. It's really easy to set up and would be great if it was more stable. I have high speed internet my router is no more then about 3 feet away from my TV and yet Amazon fire stick is always freezing and crashing. Never happened with my Apple TV at all. I can barely watch an entire show let alone a music video without it buffering in the middle or freezing up completely. I gave it two stars because it shipped speedy and packaging was great. And over it would be a great item the menus and everything are really awesome. It's just a really unstable source to be able to enjoy.", "verified": true, "helpfulness": "0/0", "author": "Louis P Irizarry"}, {"rating": 5.0, "review": "Easy to install...just plugged it in and started to watch shows.  It's also easy to navigate.  I would definitely recommend getting one.", "verified": true, "helpfulness": "0/0", "author": "K-Z"}, {"rating": 5.0, "review": "great product! buy two!!", "verified": true, "helpfulness": "0/0", "author": "Luis Barahona"}]