[{"rating": 5.0, "review": "Awesome gift", "verified": true, "helpfulness": "0/0", "author": "Amanda P."}, {"rating": 5.0, "review": "I got this for my daughter to be able to stream Amazon Prime, Netflix and Hulu, she loves it, easy to use, easy to set up, unlike our smart TV there is no interruption in the movie/show due to buffering issues.  Our internet connection can be very slow at times, but no issues with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "MHend"}, {"rating": 1.0, "review": "We really wanted to love the Fire TV Stick.If you only use Amazon Prime Instant Video, then this is the device for you! Amazon Prime Instant Video runs like a dream. Absolutely no issues until you start using third party apps. It freezes in Hulu, Netflix, and any other third party app. These freezes can occur every couple of minutes all the way up to 10-20 seconds apart. Also, the remote seems to go into some sort of hyper mode where one click will register has 5 - 10 clicks, almost as if you were holding the button down.At this point we only use it for Prime Video. I regret buying and should have returned it when I had the chance. There are much better streaming choices for cable cutters.", "verified": true, "helpfulness": "0/0", "author": "Scott Vaverchak"}, {"rating": 5.0, "review": "Do yourself a favor. Buy this and ditch your satellite or cable provider. Your wallet will thank you.", "verified": true, "helpfulness": "0/0", "author": "MykDnm"}, {"rating": 5.0, "review": "I LOVE this! I was debating between this or a Roku, but I am definitely more than pleased with my choice. I also love the fact that it is readily transferrable. I take it over to my friends or on vacations so easily. There are tons and tons of apps that are available for download. Far more than I have seen on any other comparable device. I also love the fact that it has a screen saver for when not in use.", "verified": true, "helpfulness": "0/0", "author": "Brittany Spain"}, {"rating": 5.0, "review": "This is my third firestick.  Easy to take with on vacation, etc.  Easy to use, trouble free.", "verified": true, "helpfulness": "0/0", "author": "Wayne \"Garden man\""}, {"rating": 4.0, "review": "My internet speed limits it for me.  I love this item, but I live in the Boonies and my slow internet speed caused blur scenes when things are in fast motion.", "verified": true, "helpfulness": "1/1", "author": "jdonnell"}, {"rating": 5.0, "review": "easy to use enjoying it", "verified": true, "helpfulness": "0/0", "author": "thomas l sanderson"}, {"rating": 1.0, "review": "No it has been nothing but slow. It freezes when watching Netflix or Hulu. It tells me I am not connected  to Internet or that it is Currently  Unavailable,  to try again later. My Internet signal says very good. Not sure what is the deal.Very disappointed.Danielle  Blaylock", "verified": true, "helpfulness": "1/1", "author": "Danielle Paquette"}, {"rating": 4.0, "review": "Works very well but every couple days of using I have to sign back in to them to use I have 4 of them and some I have to sign into more than others", "verified": true, "helpfulness": "0/0", "author": "Cindy  stenta"}]