[{"rating": 2.0, "review": "The device works ok, however the primary reason I purchased it was because it supported Miracast. Unfortunately it only works from Kindle and android devices, you cannot use the fire stick from other devices which support miracast.So it's now another item on the \"big pile of hardware that didn't live up to its promises\".Fortunately it was cheap.", "verified": true, "helpfulness": "0/1", "author": "Larry Osterman \"Larry Osterman\""}, {"rating": 5.0, "review": "I haven't used it extensively yet, but it was very easy to install and set up, It was programmed with my user information from Amazon, so I didn't even have to mess with that part of setup. Browsing for content was fairly simple, and no issues with loading or watching TV/Movie. Well done.", "verified": true, "helpfulness": "0/0", "author": "William P Halvorson"}, {"rating": 5.0, "review": "This is a great device.  The best solution I've used for streaming.  I piece of cake to set up.  Much easier to use than our \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "George Devereux"}, {"rating": 5.0, "review": "I love my Fire TV Stick.  I also have a Roku Stick, but Fire TV Stick is faster.  It loads apps much quicker.I use it on my Guest/Exercise room TV and play Netflix and my PLEX movies and music on it.", "verified": true, "helpfulness": "0/0", "author": "R. Juarez \"Amazon Man\""}, {"rating": 5.0, "review": "Worked great right out of the box.  Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Great product I bought one and then was so pleased I got another", "verified": true, "helpfulness": "0/0", "author": "Diana Brown"}, {"rating": 5.0, "review": "WOW!!!!  it is working great and i have already recommended it to a few people that do not have a smart tv.  great invention.", "verified": true, "helpfulness": "0/0", "author": "Nellie Lyle"}, {"rating": 5.0, "review": "Have only had it a couple of days but have really enjoyed it so far.", "verified": true, "helpfulness": "0/0", "author": "Patricia Campbell"}, {"rating": 1.0, "review": "I purchased this so I could watch Netflix, use my Amazon Prime, and other channels as I traveled on business.  I did not know at the time that it WOULD NOT be able to log in to Hotel networks that use a sign in page.  Very Disappointed.  Called Amazon help line in mid-January and the tech didn't know about the issue, or when it would be fixed (Not confidence inspiring).  I heard on a forum that it was supposed to be upgraded with a fix in January, but no fix that I know of as of yet.  Go with another streaming stick if you need to access from hotels or college dorms.", "verified": true, "helpfulness": "0/2", "author": "Marc Villemaire"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "lmdecock"}]