[{"rating": 4.0, "review": "Trying to find a Blu Ray player that ships with a link to Amazon services is nearly impossible. I have an older one for my living room, but I wanted to get one for my bedroom, too. I was about to give up when I started reading about the Amazon Fire Stick. It does everything except play discs! I only have a couple of small gripes (but I would still buy this product and have recommended it to friends).- It's a little slow on the uptake. When I come back to the TV after it's been off for a bit, it sometimes takes up to a minute (maybe a little more) to come back to where I left off. The responsiveness to the remote control in a new session is a little sluggish, too, and I realize I'm not very patient. Bear in mind that I am one floor away from my wireless router, so factor in some latency there.- The Fire Stick, with the power cord plugged into its side) is awkward to put into a HDMI slot. I have a row of slots across the back of my Vizio TV and a side HDMI port, as well. I finally ended up putting the stick in the side port. With its rather short power cord and its side socket, it takes up more width than necessary. I would recommend moving that power socket to the opposite end from the HDMI connector. That way, you're not using too much width, because most TVs have a line of HDMI ports versus a column. It's easy to end up taking up the space of two slots, once you've plugged in the power cord.Nice little device. Just be patient with it!", "verified": true, "helpfulness": "0/0", "author": "Doris Pavlichek \"Dora\""}, {"rating": 5.0, "review": "We bought the Fire TV stick when we decided to purchase Amazon Prime. Previously, we had access to Netflicks through our Blu Ray player, but navigating the menu was a bit clunky. The basic set-up took about 15 minutes, then we were off and running. We haven't tried any of the advanced features, but basic use is pretty intuitive. The interface is easy to use, giving us access to thousands of movies and TV shows with much less effort than our previous set-up..", "verified": true, "helpfulness": "0/0", "author": "S. Atherton"}, {"rating": 5.0, "review": "Super easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Deb M Hunt"}, {"rating": 4.0, "review": "Love it.  Easy to connect and easy to use once I got the hang of the remote buttons.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Rosalie Downs"}, {"rating": 5.0, "review": "I love it! Bye bye Dish..thank you for making this 🙌", "verified": true, "helpfulness": "0/0", "author": "Jennette Chism"}, {"rating": 5.0, "review": "I would recommend this to a friend. I t is easy to setup", "verified": true, "helpfulness": "0/0", "author": "james brosnan"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer McKenzie"}, {"rating": 5.0, "review": "Do not know what I did without it. Now couldn't live without it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Best purchase I've made in a while.  Well worth it.", "verified": true, "helpfulness": "0/0", "author": "A G"}]