[{"rating": 5.0, "review": "Installed easily and began to use immediately. No issues with video quality, wifi connection etc. It just works and the picture looks great! Got to go watch some more Prime Videos . . .", "verified": true, "helpfulness": "0/0", "author": "DJH \"Dan H.\""}, {"rating": 5.0, "review": "I didn't think having a remote was that big of deal (I have a Chrome cast as well).  Also if you have Prime Video this is miles better solution than casting your Tablet to Chrome.  Of course it would make sense that Amazon got the Prime Video and viewing down pat.  It also allows access to the Amazon music (on you TV) which makes it convenient to pop on some music when you want.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Love it. Easy plug and play set up.", "verified": true, "helpfulness": "0/0", "author": "Michael P."}, {"rating": 5.0, "review": "I love this thing. I discontinued Comcast and I am satisfied with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Cassandra"}, {"rating": 5.0, "review": "Should have gotten the Firestick dinner.  Love it!", "verified": true, "helpfulness": "0/0", "author": "AngieC"}, {"rating": 5.0, "review": "Love the amazon stick have plenty new movies on prime to watch", "verified": true, "helpfulness": "0/0", "author": "EmZuz"}, {"rating": 5.0, "review": "I love the Amazon Fire Stick. The set up is simple and because I ordered it with my Amazon account the device was already registered to my account so all I had to was connect it to the internet. Right out of the box I can control the Fire Stick with either my my Fire Phone or the Fire HDX without the need to download a secondary app. The device has a simple streamlined menu and allows you to download apps like PBS, HBO GO, and Netflix only if you want them unlike other devices liek the Apple TV which comes preloaded on it and you can't get rid of it. Also you can play games on it. The device also had seamless streaming and as long as the internet co0nnection is great no buffering.", "verified": true, "helpfulness": "0/0", "author": "Courtenay \"Flash\""}, {"rating": 4.0, "review": "Love it almost 100%. The only problem is that ever since I got it, it has slowed down my internet speed by a ton.", "verified": true, "helpfulness": "0/0", "author": "hunter"}, {"rating": 5.0, "review": "Nice but does need to be plugged up to workCool part is use remote from your phone", "verified": true, "helpfulness": "0/0", "author": "Tammie Hendley"}, {"rating": 4.0, "review": "I do like the fire stick a lot after finally getting it to work after a lot of trouble shooting, and after buying a wifi extender so it could be used in an upstairs bedroom. But once we got it working it is amazing and I enjoy a whole lot and it's a joy to use and very intuitive", "verified": true, "helpfulness": "0/0", "author": "Jaimell Johnson"}]