[{"rating": 5.0, "review": "I love it! I thought I needed a \"Smart TV\" to watch Netflix on my television without having to use an hdmi cord to connect to my laptop. When I found out about this device I did a lot a research before I decided to purchase it. I watched comparison videos and the Fire Stick TV clearly stood out above its' competition. I'm enjoying it a lot so far. I don't think it will disappoint.", "verified": true, "helpfulness": "0/0", "author": "Shironika Farrior"}, {"rating": 5.0, "review": "got for my mom! she's addicted!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Should have bought this thing a long time ago; didn't know how much I was missing.  Easy to use, even for those us who are half-blind and technically retarded.  Discovered a couple of shows I--we--love and didn't know existed:  Salem and Witches of Eastend.  I am sorry to hear that the latter has been canceled, I think we need a campaign to resurrect it!  Too many shows disappear before we have a chance to find it, or it has a chance to find an audience; however you want to look at it.  This is the show that women, their sisters and friends get together to watch; give it another chance.", "verified": true, "helpfulness": "0/0", "author": "monsterhunter"}, {"rating": 4.0, "review": "Best thing I've bought in a long time. Easy  to install and use. Only issue I have is that you can't type in what you are looking for, have to go thru all movies, etc to see what is available", "verified": true, "helpfulness": "0/0", "author": "NanaGeek"}, {"rating": 5.0, "review": "This products is superior. Love it. Was delivered in 2 days.", "verified": true, "helpfulness": "0/0", "author": "Virginia Sherman"}, {"rating": 5.0, "review": "It's amazon + TV = WIN. way more paid services than it is free stuffs.", "verified": true, "helpfulness": "0/0", "author": "MyCheapGeek"}, {"rating": 5.0, "review": "I was sick of paying $160+ each month for cable (we didn't watch most channels), internet and telephone (we didn't need/use).  A co-worker told me about FireStick, I had no clue what she was talking about, however I knew I had to find a more affordable way to enjoy watching TV. i ordered my stick in June I can honestly say my family loves it.  I also ordered HuluPlus, Netflix and Showtime Anytime for $25.97 a month my cable is $59.99 (no tax) so my total TV entertainment bill each month is $85.96.  That's half of my former bill. There are so many options TV shows, movies, specials, comedies, videos, games, apps...etc.  I only purchased one stick we keep it in the main living area and we have antenna's for the bedrooms.  There are 13 or 14 channels to choose from so it's working out fine so far.  I may purchase another stick for the master, but for now we enjoy this affordable way to watch TV.", "verified": true, "helpfulness": "0/0", "author": "gigi63146"}, {"rating": 5.0, "review": "I enjoy having the stick, it is easy to use and makes any place I go feel a little more like home.", "verified": true, "helpfulness": "0/0", "author": "Joe Davis"}, {"rating": 5.0, "review": "We received the fire stick as a birthday gift from my in laws. We don't have cable and pretty much watch Netflix all the time. After receiving this, we've noticed that we use the fire stick more. It has a great mixture of cartoons for the kiddos, action for my husband, and movies for me. The only problem we've had is a few of the apps don't run that well on the stick. Which is fine because we don't really need to user them. One of my favorite apps is Pandora.Highly recommend this product.", "verified": false, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "It is just wonderful.  I have been using my large Vizio smart tv to view Amazon movies, and it is slow and tiresome.  I bought the firestick for my smaller tv, and it is exceptional: so much better than the smart tv.  Downloads are instant and the user has much more control over viewing.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]