[{"rating": 4.0, "review": "The reflex times are pretty good. The WIFI antenna is also quite reliable (with the extension of course).I wish there were a dedicated button to put the unit on stand by. Having to got through several menus just to hibernate is a PITA$$.", "verified": true, "helpfulness": "0/0", "author": "PH \"agent Orange\""}, {"rating": 5.0, "review": "I'm just still learning how to get all the movies and local channels and connect to my other t.v. in house if you can help me please write me back thank you :-)", "verified": true, "helpfulness": "0/0", "author": "patricia neal"}, {"rating": 4.0, "review": "Simple plug and play.  Good interface.  Kids love it.  Some Netflix bandwidth issue that didn't exist with Amazon Prime video....on same Wifi connection.", "verified": true, "helpfulness": "1/1", "author": "Sean C."}, {"rating": 5.0, "review": "Neat device - Will work well for our extra TV that only has digital antena service", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "This is a great way to wean yourself off of a monthly cable bill! The best Prime Day deal by far!", "verified": true, "helpfulness": "0/0", "author": "Emily Weichel"}, {"rating": 2.0, "review": "It's literally not at all impressive. Everything on my computer I can get on fire stick and I Can stream anything from my computer to my TV. The movies and shows suck... I have Comcast and on demand has 1000 times more stuff a lot easier to access. This was a complete waste of money. I only bought this to watch out of state sports games in college but completely fails at doing that. Waste of money", "verified": true, "helpfulness": "0/0", "author": "Eric Freeman"}, {"rating": 3.0, "review": "The download of the HBO to go app and Pandora was a challenge.  It took about an hour to get Pandora working.  To this point have not been able to download the HBO to go app.  All other functions seem to work smoothly with no problems.", "verified": true, "helpfulness": "0/0", "author": "TJ \"Nochumdiver\""}, {"rating": 5.0, "review": "Beyond my expectations! $50 for the fire stick and $100 for Amazon prime??? I'm set for the year!!!! I refuse to get cable this is all I need. And I can take it to my moms house when I go stay the weekend!", "verified": true, "helpfulness": "0/0", "author": "Corinna Longoria"}, {"rating": 5.0, "review": "LOVE IT. Very easy to assemble and operate. I have had the fire stick about three weeks now and I have not had a problem with it. Love connecting to amazon music and playing from my very own playlist. Thanks Amazon. Great device.  Can't wait for the mirroring to be completed.", "verified": true, "helpfulness": "0/0", "author": "Charlotte Walker"}, {"rating": 5.0, "review": "This is a great alternative to cable TV.  I do miss local news, but there are other options for that.  We ran into a hiccup with our WIFI when we first purchased it, but that was resolved and now we have access to so many free programs.", "verified": true, "helpfulness": "0/0", "author": "Melbut123"}]