[{"rating": 5.0, "review": "I am am blown away at how great this is. Seriously Schocked. Quick and easy, plug n' play. No delay in pix. Wow. Super easy remote. I download the app on my Droid. Not so great, the keyboard doesn't really work, but the voice search works great. Quite surprised at the additional apps ( free and no sign ups) that are included to watch old TV shows and didn't know PBS had an app! I can watch missed episodes from Masterpiece!It was either the Fire stick or a smart TV for my bedroom. We have a Smart TV in the living room (50\" Samsung) but the smart part is crap. Thus stick blows it away. My buddy has the Chrome cast stick and loves it. I chose the Amazon stick because I am an Amazon Prime member and it had great reviews. I am glad it did!", "verified": true, "helpfulness": "0/0", "author": "Franny Stevens \"to catch a thief\""}, {"rating": 5.0, "review": "Love it !  We use it with Sling TV", "verified": true, "helpfulness": "0/1", "author": "Deb Coe"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Hutch Johnson"}, {"rating": 4.0, "review": "There are many reviews on this so I won't bother.  If you have Amazon Prime, you might as well spend the small amount to purchase this.  The investment is minimal and you get a lot more for your money on Prime movies/show alone.  Plus, it has Netflix so you get the best of these two services.  As of Feb, 2015, I would like to see Sling TV and that will be my cord cutter moment.", "verified": true, "helpfulness": "0/0", "author": "Phu Ngo"}, {"rating": 5.0, "review": "Love it so far... Being a prime member has its perks.  I was tired of wasting my money on cable and satellite!", "verified": true, "helpfulness": "0/0", "author": "Jodi"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Cosmo J. Barbardo"}, {"rating": 5.0, "review": "Love this little device!  I am very pleased with the size, the features, and the capacity of applications.", "verified": true, "helpfulness": "0/0", "author": "K. DOWNEY \"Califberry\""}, {"rating": 5.0, "review": "Now this was in the words of Monty Hall, \"a really good deal\".  I cannot begin to describe the ease of using this product as it is extremely intuitive.  A perfect complement to Netflix or Amazon Prime,  (my main source of inspiration for purchasing).  It is easily moveable between television sets and for the first time I have been able to search and view You Tube videos on the main T.V. in the house.  If you haven't purchased one of these by now, skip reading the rest of this review and go order one for yourself.  You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Jack Morrissey"}, {"rating": 5.0, "review": "Easy to operate", "verified": true, "helpfulness": "0/0", "author": "peggy constantino"}, {"rating": 4.0, "review": "Fire stick meet my expectations,except, Amazon CHARGES for Most movies that I wanted to watch. SOME were free but most of New movies were NOT free. I then swich over to NETFLEX.. Over all, it was very nice to watch movies through my wifi on a 55 inch TV with HD.I am still looking at all the different view possibilities at this writing.", "verified": true, "helpfulness": "0/0", "author": "N. VanCleve \"Happy Customer\""}]