[{"rating": 5.0, "review": "We have had other wifi devices for our TV and this one seems to work the best so far.  We really like it.", "verified": true, "helpfulness": "0/0", "author": "L. B. Woodbury"}, {"rating": 5.0, "review": "I have had a Roku 2, a Chromecast, and used Smart TV and Smart devices to let me connect to streaming media and none of them are as simple and well rounded as this tiny little stick. A form factor like Chrome cast is what I wanted so it could easily be hidden behind the tv, but this thing is far more powerful, much more stable than my Roku 2 grew to be. Chromecast was great for what it was, but was easily paced by this stick in both power and responsiveness, not to mention not having to use the cumbersome method of pushing streaming services from your phone. ALSO huge points for this being one of the cheapest Miracast sticks you can buy. I picked mine up for 24.99 during black friday and it is a steal at that price. I'd pay 40 for it easily after having it now for a few months. Amazon has pretty much convinced me also to buy the full sized Fire TV Box with this thing for my other tv in the house. Gaming on it is great, the ability to use apps I have purchased for my phone on here (not all but some) is awesome. If you need a streaming stick, there really is no better choice, and if your a member of Amazon Prime, there really is no other choice. This manages to enrich the service your already paying for so much it hardly seems like the cost of Amazon prime is enough. With this stick I will be cutting the cable cord soon enough.", "verified": true, "helpfulness": "0/0", "author": "Darrell Greer"}, {"rating": 5.0, "review": "Great product. Very satisfied with it!I like everything about it.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lifeblue3\""}, {"rating": 5.0, "review": "I really enjoy my Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Ouillette"}, {"rating": 5.0, "review": "\"Easy to use, easy to set up, the RF remote is wonderful, voice search via iOS on the iPhone is great.\"--So sayeth my techie husbandAccessing Amazon Prime's extensive kids programming content during a recent four-day fever…priceless.", "verified": true, "helpfulness": "0/0", "author": "Silver Spring Mom"}, {"rating": 3.0, "review": "a bit slow while changing apps. Internet connection is a bit slow and laggy. I'm running 50 MBS and my N-router is about 10 feet from the Fire TV stick. Good for the price( $20.00) , however It will not replace my Apple TV", "verified": true, "helpfulness": "1/1", "author": "Xman0499"}, {"rating": 2.0, "review": "I like it but am disappointed that it goes out a lot and I have to unplug the power and re-plug to get it to work again.", "verified": true, "helpfulness": "1/1", "author": "Mary Mueller"}, {"rating": 5.0, "review": "It's just great!", "verified": true, "helpfulness": "0/0", "author": "the orange"}, {"rating": 1.0, "review": "Doesn't work", "verified": true, "helpfulness": "1/2", "author": "Gary K Smith"}, {"rating": 4.0, "review": "The stick is easy to set up and use.  I only wish viewing options were not so limited. and that major networks would offer real time programing", "verified": true, "helpfulness": "0/0", "author": "patricia hamilton"}]