[{"rating": 1.0, "review": "I bought a new smartTV parallel to when Fire stick arrived and it seems it's unnecessary now.Is it possible to exchange it for the alt. free gift from Sling TV, which I think was 3 mos free Prime?", "verified": true, "helpfulness": "0/1", "author": "Brad"}, {"rating": 5.0, "review": "Like the product very much.. Again Amazon Comes through......", "verified": true, "helpfulness": "0/0", "author": "Buddy"}, {"rating": 5.0, "review": "REALLY COOL TO WORK WITH! I have a Smart Blue Ray player and it was neat to have but had alot of glickes. Fire TV Stick IS MORE AWESOME than the BluRay player. Only thing I wish it could do is play videos from my tablet via bluetooth.", "verified": true, "helpfulness": "0/0", "author": "Beedo"}, {"rating": 4.0, "review": "This little thing rocks!  I love taking this thing on the go when I travel!", "verified": true, "helpfulness": "0/0", "author": "Pasquale Lucenti"}, {"rating": 5.0, "review": "I love my fire tv stick. Unfortunately I've had a considerable amount of WiFi issues...mostly unrelated to the device. I use it pretty much every night now, I don't even bother using cable anymore. I would however love a remote that has a headphones jack in it like the roku does. It's a great feature for those of us that live with noisey people ...and dryers.", "verified": true, "helpfulness": "0/0", "author": "vermilion"}, {"rating": 5.0, "review": "Love this! It is better than I ever expected. I went back later and bought the game controller but I have not yet been able to get it to link up the the stick. Still working on that.", "verified": true, "helpfulness": "0/0", "author": "Scott M. \"Scott M.\""}, {"rating": 5.0, "review": "I've owned/used pretty much all the streaming devices out there, and this one is the best.  Most well-designed interface, smoothest operation, best WiFi performance (that is critical, folks).  Outperforms Roku by quite a bit, makes most smart TV and gaming console interfaces look like absolute garbage.A lot of other people have already described the features in detail, so I'll just say, the highlights for me personally are:- Seamless integration with Prime- Best interface available on the market today- Really, really reliable WiFi performance.  I get full HD streaming 98% of the time, and I have terrible Comcast internet service.If you are debating between this and a Roku of some kind, GET THIS.  I've owned three gens of Roku and this is a million times better.", "verified": true, "helpfulness": "0/0", "author": "PDXGAL"}, {"rating": 5.0, "review": "Brings the latest movies and series to my rural location.", "verified": true, "helpfulness": "0/0", "author": "Lee Love"}, {"rating": 5.0, "review": "I have to say that; I love this thing! I now have access to many more movies and some great TV shows many of which are not offered on your standard cable or satellite providers. The cost of the Fire TV Stick and Prime membership are less than a months cable bill.What more can you say, It's Great !! (sorry Tony).", "verified": true, "helpfulness": "0/0", "author": "keys wanabe"}, {"rating": 4.0, "review": "It is almost perfect! Would probably be better than Roku if it had a Vudu app. No good way to watch HD UltraViolet movies. The Flixster app is glitchy.We use this daily more than the PS3 hooked up to the same TV. Definately recomend. 5 stars if they ever get a vudu app or Amazon ever joins Disney anywhere and UV..", "verified": true, "helpfulness": "1/1", "author": "Page"}]