[{"rating": 5.0, "review": "Cord cutter's dream!  While it is missing a few apps here and there, this stick is a must for anyone who has Amazon Prime!  The ease of use is second to none.  While you can't search via speach directly on the remote itself (a la Gary Busey), you can download the app to your phone which equally does a great job.", "verified": true, "helpfulness": "0/0", "author": "wxnimbus"}, {"rating": 5.0, "review": "Love this gift from my son for xmas it works great!! Well worth the money", "verified": true, "helpfulness": "0/0", "author": "amazing"}, {"rating": 5.0, "review": "Excellent device, easy to use and offers exactly what I expected.", "verified": true, "helpfulness": "0/1", "author": "storksb"}, {"rating": 1.0, "review": "will not connect to any wifi network and there is NO TECH SUPPORT available...This is a total piece of you know what", "verified": true, "helpfulness": "1/3", "author": "Metal C."}, {"rating": 4.0, "review": "Works great as a streaming device. I had some difficulty getting it to connect to my 5ghz band wifi stream, but with a little work and manipulation of that particular band, it was able to connect. Video and audio quality is great, though there are some slight stutters in the playback from time to time. Overall, a great little device.", "verified": true, "helpfulness": "0/0", "author": "Stuart N."}, {"rating": 1.0, "review": "For a device \" from Amazon so powerful it could entertain humanity for an eternity”, this has been a large disappointment.If and when it works its just Ok..I will be moving this to my second dust covered TV and either try Roku or Chromecast.Its always losing connection to my wireless ( in range within less than 3 feet of device). Netflix and Hulu are always locking the device so that I have to unplug and reset it. The screen flickers and sound pops when it changes from SD to HD quality. My remote is  possessed, sometimes after clicking the navigation ring it will just auto scroll in the direction pressed requiring another hard reset.Where is VUDU, and Disney Movies Anywhere?? Or at least let me link  my content to my Amazon account.", "verified": true, "helpfulness": "2/3", "author": "GreyGhost"}, {"rating": 5.0, "review": "Very Cool!  My kids love the video games.  I love the interface.  Amazon hit a home run with this one.  I can now watch Espn and Disney channel (need someone with a participating cable provider to activate).  Netflix and Amazon interface is the best I have used so far.Only downloaded a couple games but 4,5,8, 16 and Dad all love playing and taking turns.Be sure to go into settings and activate parental controls to prevent in app purchases.  Thankfully amazon sent an email and the damage was limited to 3.99.", "verified": true, "helpfulness": "0/0", "author": "Tina Phelps Grace"}, {"rating": 3.0, "review": "Requires subscription to most channels through a TV provider.", "verified": true, "helpfulness": "0/0", "author": "Phili Wong"}, {"rating": 5.0, "review": "Works great unless there's bad weather, just like my Dish Network. Also, have to figure out how to increase my bandwidth to stream easier. I didn't realize there would be so many movies with a cost attached, but it's still cheaper than pay per view. Nice product to have. Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Susan M."}, {"rating": 5.0, "review": "I have the Fire Phone and they both work very well together.  I love having direct access to my apps, my photos, videos and I love having the app on my fire phone where I can send it directly to the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "dreamersland"}]