[{"rating": 5.0, "review": "A very efficient device for \"smartening up\" my TV! It works as well as I expected, which is to say it works very well.  I don't think you can find anything this good for the price.", "verified": true, "helpfulness": "0/0", "author": "Patk6789"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Henry N. Vo"}, {"rating": 1.0, "review": "I am so disappointed that this is not working very well. It has intermittent connection to our internet and it's definitely not our internet or any other device at home. The Roku was in the exact same location and had no problems, but the Fire TV Stick couldn't even get the signal. It had trouble even when we moved it to the TV that is 1 foot from our router. So disappointed!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "If Apple TV played nice and had an Amazon app, I would smash this firestick like a bug. I've never been so aggravated with a wifi device. My router is within 20 ft of the device. No other device has these issues.", "verified": true, "helpfulness": "2/2", "author": "Matthew C Humphries"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "panyuehua"}, {"rating": 4.0, "review": "As someone who uses chromecast daily, I pre-ordered fire stick for $20 just to try it out.It is impossible to do screen mirroring which is a big disappointment...It's still a must get if you are a prime member and have a dual band router at home.", "verified": true, "helpfulness": "0/0", "author": "HC"}, {"rating": 5.0, "review": "I set this up in five minutes flat. Super easy access  to all of my Amazon videos and with prime that's a lot of videos. The remote is really touchy, it took a while to get used to it without skipping past what I wanted, but who can complain about something being responsive? NAH.", "verified": true, "helpfulness": "0/0", "author": "Janet Fouts \"Social media strategist, speaker, author.\""}, {"rating": 4.0, "review": "Easy to set up and good reception.  Not sure how it will work with a weaker router if it should be used in motels or at another person's house.", "verified": true, "helpfulness": "0/0", "author": "david stewart"}, {"rating": 3.0, "review": "We bought the Fire TV Stick to compare to our Roku and Amazon account on our smart TV (smart HD TV was purchased in 2012, so it's not a fancy model).  We watch a lot of Amazon streaming movies and Netflix.  We noticed right away that the Fire TV Stick does not have the picture quality that the our Vizio Smart HD TV or Roku.  We have high speed internet, so it's not the internet speed.  We did like the ease of controlling the Fire TV via our Fire tablets.  Our next trial will be to take it with us when we travel and try to use it in a hotel, though I bet there will TVs).  This will probably drive down the cost of streaming devices, similar to the impact of the Fire HD driving down or at least containing the cost of tablets.Pro:  size, ability to control with Fire HD (easier to type titles from the virtual keyboards), Amazon linking to all devices, ease of installationCon:  picture quality is noticeably less than Roku or direct streaming from smart HD TV, comes directly linked to an account (I guess that might be a good thing for some people, but we find it an annoying assumption on Amazon's part)", "verified": false, "helpfulness": "0/0", "author": "Mary V. Crosby"}, {"rating": 1.0, "review": "Very misleading. This device sold my on its portability. It needs to be plugged in to a wall outlet. Funny how they don't mention this at all. It fits nicely in Gary Busey's hand without any cables", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer"}]