[{"rating": 3.0, "review": "Bought this to replace my ROKU in order to get Showtime Anytime app.  Everything hooked up easily.  Started streaming on Amazon, Netflix, HBOGO, and Showtime Anytime. But when streaming Netflix using Fire Stick app, there were delays.  Could hear audio, but video froze and then the video would fast forward to catch up audio.  That was a hallucinatory experience.  Went back to ROKU with same streaming movie no problem. To be fair the ROKU would lock up once or twice a month and I had to unplug it and plug back in to get the ROKU running again.  The Amazon was constantly doing this.", "verified": true, "helpfulness": "0/0", "author": "Denny \"Denny\""}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to set up...even for me!", "verified": true, "helpfulness": "0/0", "author": "Jan in Wi \"Jan Simonis\""}, {"rating": 5.0, "review": "Love my TV Fire Stick", "verified": true, "helpfulness": "0/0", "author": "marviyann brown"}, {"rating": 5.0, "review": "Great addition to our media center, especially since we have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Suzanne"}, {"rating": 5.0, "review": "The Fire Stick might be the coolest thing I have ever owned. It is easier to use than any smart TV I have ever used, and it has unlimited capabilities.", "verified": true, "helpfulness": "0/0", "author": "craborn"}, {"rating": 5.0, "review": "Performed as advertised.", "verified": true, "helpfulness": "0/0", "author": "fiesty \"Walter\""}, {"rating": 4.0, "review": "Lagging and stuttering here and there, but from my experiences with Roku and AppleTV, this product performs amazing. Especially so given its price point.", "verified": true, "helpfulness": "0/0", "author": "Dezz"}, {"rating": 5.0, "review": "We have no use for an X-box or anything like that...but wanted to have Netflix.  This little FireStick did the trick.We love it!", "verified": true, "helpfulness": "0/0", "author": "Christine Sabin"}, {"rating": 5.0, "review": "I got the Fire Stick instead of buying a antenna for an extra tv. I must say my children do enjoy this device and so do I. I am able to limit television watching by simply taking out the stick. I think it is a great device.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Simple to install.  Easy to use and with Amazon Prime plus the many other Apps it is an entertainment goldmine.", "verified": true, "helpfulness": "0/0", "author": "Harry J. Martin"}]