[{"rating": 5.0, "review": "i just wish all the remotes would sync up so we only had ONE instead of 4.  I have one for the TV, one for the DVD, one for the Fire and one for cable.  Blah.  Why is there no volume control on the fire remotes?", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Nice compact media player. Like the Amazon \"ecosystem\" interface. And price was a steal (got it at the super-low pre-holiday price just as it was being released). Wish I could connect directly via ethernet, but then it wouldn't be so small. I'll just have to swap my media players around so the Fire Stick resides closer to my wifi router where it won't complain.", "verified": true, "helpfulness": "0/0", "author": "MickeyD \"Michael\""}, {"rating": 3.0, "review": "It works, but we've had issues with it.  Every once in a while it starts slowing down so bad that you can't watch a show, at which point we have to unplug it from the back of the TV and then re-set all settings.  Other than that it does what it's supposed to.", "verified": true, "helpfulness": "0/0", "author": "Jessica A. Worley"}, {"rating": 5.0, "review": "This thing is awesome! I just plugged it in, and started watching T.V.! I bought the Sling T.V. package. Very happy with all of it!", "verified": true, "helpfulness": "0/0", "author": "Mark Herrin"}, {"rating": 4.0, "review": "The Fire TV Stick can be great if it doesn't buffer every few minutes. I bought this to use Sling TV. It keeps saying \"catching up\". HBO Go cannot go one minute without re buffering. The same app on my Smart TV works fine, so it is not my internet connection (25Mbps). I factory reset the Stick multiple times. I asked for replacement. Same problems. I am giving it 2 stars because it has a nice screen saver and it can play my music and display my photos that are on Amazon Cloud. If you are cord-cutter, look elsewhere.Update:After few weeks fighting with buffering, I moved the Stick to another HDMI port. Unlike other ports, this one allows the stick to be vertical to the TV. Voila. The Stick works fine now. This suggests that when it was parallel to the TV, its Wi-Fi signal was suffering from some noise and creating connectivity problems.", "verified": true, "helpfulness": "0/0", "author": "Tchanta"}, {"rating": 4.0, "review": "i would like to now if i will be able to use it outside U.S.<and if i will,will it be on its full efficiency?", "verified": false, "helpfulness": "0/0", "author": "Marios"}, {"rating": 5.0, "review": "Ok it is a bit small which means it can get lost in the coach cushions easier or taken by the kids.  However, I LOVE my fire stick!!!  Being able to have my shows on the big screen so to speak makes this an incredible bargain.  I would encourage anyone with Amazon Prime to seriously consider getting one!!!", "verified": true, "helpfulness": "0/0", "author": "nancy s. gebel"}, {"rating": 1.0, "review": "Spend the extra $60 on the fire tv instead of the stick. I bought the fire tv for my living room for $50 with a 3 month subscription to sling tv for $60 for a total of $110 plus tax.  Love both, bought the stick to try n save $60 for my bedroom and it pauses to buffer all the time.  Tried switching the stick to the living room so that it would be closer to my router and it still does the same thing.", "verified": true, "helpfulness": "4/4", "author": "Michael T. Jayson"}, {"rating": 5.0, "review": "as advertised. good price.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "I am hoping the buffering subside.", "verified": true, "helpfulness": "0/0", "author": "Charles Clayton"}]