[{"rating": 3.0, "review": "The problem that I am living out of USA and I cant use all features.", "verified": true, "helpfulness": "0/1", "author": "Mustafa Awwad"}, {"rating": 5.0, "review": "This was a great purchase. I got the fire stick during the pre-order sale. Waited very long for it but it was worth the wait. I use chromestick as well but this is much better with the remote that comes with it. I would recommend it over the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jay Makker"}, {"rating": 4.0, "review": "Amazon Fire TV StickI like this Fire TV stick. Finally I am free to install it even though I have already bought this a month ago.Pro:1. Remote control is using bluetooth so you do not have to be on straight line with your device2. Installation is easy3. A lot of application are already inside Amazon App Store e.g. youtube, netflix, PBS Kids, etc.4. You can use your phone as your remoteCons:1. I wish the remote allows infrared as well. My \"old\" logitech harmony will not work with bluetooth.2. Some of my favourite apps are not compatible \"yet\" with Fire TV e.g. crunchyroll but no big deal since I can still use Roku for that.3. Your own Library for Amazon TV Shows (deduct one star due to this)If you own episode 1 and 3 for a particular season, you would need to scroll through the whole season and look for \"Watch it\". I wish Amazon can just show the one that you own to safe time.4. Youtube \"stream\" from phone is a hit/miss. I see some people manage to make it work but I personally not able to make it work but since I have chromecast so not really a deal breaker for me.Note: For those that has message HDCP Content Unauthorised. Content is disabled. (No Video only sounds), Remove the extension for the Fire TV stick. In my case it works fine after I remove the extension. (Weird, in the manual, it is \"recommended\" to use the extension to get a better WIFI signal).", "verified": true, "helpfulness": "0/0", "author": "TWCA \"TW\""}, {"rating": 4.0, "review": "Great, but so learning how to use it.", "verified": true, "helpfulness": "0/0", "author": "Mala Thao"}, {"rating": 5.0, "review": "This was quick to install, every app worked flawlessly makes your regular tv into a smart tv for a fraction of the cost.", "verified": true, "helpfulness": "0/0", "author": "S. Thomas \"Panama'sBookEmpress\""}, {"rating": 5.0, "review": "I got the Fire TV Stick today, I had it up and running in less than 20 minutes and that was with my five kids constantly talking to me.  I Love it, it works perfectly, I have it plugged in behind my Sony Receiver into an HDMI port.  The Picture is perfect as well as the sound.  Amazon did an awesome job putting this thing together.  As of now its been running non stop for 5 hours.  Amazon Prime, Amazon and Hulu are all streaming in an outstanding manner.  If you have a good internet connection and like streaming media then grab the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Knife Nut \"Jeff\""}, {"rating": 5.0, "review": "Love this.  Super easy set-up", "verified": true, "helpfulness": "0/0", "author": "KJK"}, {"rating": 4.0, "review": "Did a fine job. Can get a good selection of movies.", "verified": true, "helpfulness": "0/0", "author": "Robert Pedersen"}, {"rating": 1.0, "review": "on the television commercial with Gary Busey demonstrating how the fire stick works it never shows the requirement of an additional USB cable and an additional power outlet to make it work properly. They should include this information in the commercial suppliers will be aware and make the correct choice. I'm returning this device for credit. It is not what I wanted or expected.", "verified": true, "helpfulness": "0/1", "author": "San Diego Customer"}, {"rating": 1.0, "review": "Worked great for the first two days, now refuses to connect even though its 10feet from the router. Like cheap toy that breaks after the first day", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]