[{"rating": 3.0, "review": "I'm big prime user could not wait to get the stick. I know how to build computers,setup wireless networks, this keeps kicking off my network have to reset by unplug power wait minute seems to have some bugs still maybe in Filmware. Also were is the love for vudu amazon more choices makes a happier customer you can't get all the business like Walmart. Offer more and I won't keep turning on my Roku and I will stay with amazon most of the time. Thanks", "verified": true, "helpfulness": "0/1", "author": "ted jones"}, {"rating": 4.0, "review": "I bought the fire stick with the intent to use it while traveling, I'm on the road 75% of the year. I'm pleased with the library of movies and shows, but find it difficult to connect properly on most hotel wifi", "verified": true, "helpfulness": "0/0", "author": "Greg Hall"}, {"rating": 1.0, "review": "Would not even turn on. The HDMI port senses that something is plugged in but no signal.", "verified": true, "helpfulness": "0/1", "author": "Wayne J. Gortmaker \"Badger Man\""}, {"rating": 3.0, "review": "It works great on my Insignia tv. IMPORTANT:  This is not compatible with all LCD TV's. The person I bought it for has a Sansui TV, purchased in 2009. We just gave her our Roku. Roku isn't TV specific. I wish they would say this somewhere in the write up.", "verified": true, "helpfulness": "0/0", "author": "Bradley L. Crews"}, {"rating": 3.0, "review": "Can it be used on old TVS?", "verified": false, "helpfulness": "0/2", "author": "LUDWIG ELSTAK"}, {"rating": 5.0, "review": "I bought this as a gift for my mom. I helped her set it up, and here is my experience.My mom couldn't figure out a chromecast, how to use the DVD players Netflix hulu stuff, or the Xbox ones navigation. So when I bought the Fire TV stick, and showed her how to use it, I didn't expect she would be able to use it with such ease. But she can!My mom is not very computer savvy or tech savvy at all. The ease of use of this is the best thing ever. She likes the fact she can rent, or buy movies from amazon. She also likes how she can log onto netflix, or hulu plus with ease. She also recently downloaded crackle on it, and likes how she can watch movies for free. (they have commercials)The plug: The HDMI plug goes into the TV. It does require a part of it to plug into a wall outlet. I found the cord to be not that long. Also found out that if you use other extension micro USB cords it might not work right.The remote: The remove is basic. It has a back button, home, back, forward, and play button. Its easy to navigate.Navigation: The simple navigation is probably what makes this the best media navigator. It literally connects all your services into one, and makes it easy to use.Only issue: I had an older TV that at first had issues recognizing it was plugged in. I had to play around with it for a few minutes to get it to work. Just move the D pad part around and it will come up, as long as your on the right HDMI channel.", "verified": true, "helpfulness": "1/1", "author": "robert"}, {"rating": 5.0, "review": "I installed it without a hitch and had a problem with installing some apps.  Problem solved in no time by Fire TV Support.  Works great!!", "verified": true, "helpfulness": "1/1", "author": "Luis F. Garrido"}, {"rating": 1.0, "review": "Cannot login existing account during setup, tried many times with both mine and my friends. Eventually had to create account and link credit card using fire stick.", "verified": false, "helpfulness": "1/1", "author": "James"}, {"rating": 5.0, "review": "I got this during the $19 two day sale and figured what have I got to loose.  I love this gadget!  I had a little trouble due to the fact that I had to switch 'input' on my tv, mute the sound bar and 'enable' the tv speakers (which were disabled so we could use sound bar) .Our tv is HD 5 yrs old, geek squad installed w/sound bar so if you don't have auxiliary sound you won't have that issue.  It took a couple of calls to cs to work out these snags but as usual Amazon is #1 in customer service.  This works DIRECTLY through tv, not through Hopper or dish receivers even though Hopper has hdmi port which I tried to use unsuccessfully, duuuhhhhhhhhhhhhh.  Now I can watch all the prime stuff on big screen that was only available on my Kindle Fire HDX Wow, i'm loving my fire tv stick.  Amazon rocks", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"beewrangler\""}, {"rating": 2.0, "review": "It works pretty much like the Roku I have and all that so that's fine and the quality is HD for sure. Speed is pretty good as well. But I am giving it 2 stars because when I received it there was a mini USB cable in the box. Well, in all the commercials and all the other advertising Amazon gives one the impression that you just plug the stick and ago. No. Not all all you plug it then you have to plug the power cable into it. This is, in my opinion, deceptive. Unless you go to the page that showcases the stick and you delve into the way it works you automatically think, oh all you need to do is plug into the TV. Well, no. For this I give it 2**.", "verified": true, "helpfulness": "0/2", "author": "Francois Elmaleh"}]