[{"rating": 5.0, "review": "It works nicely. I use it on two different TV's in my house works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "Just got my Fire stick and thought I'd been had.  NOT SO!!  YOU MUST PLUG THE ADAPTER DIRECTLY INTO THE  ELECTRIC OUTLET. Once I did that it worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "ardent reader"}, {"rating": 5.0, "review": "Bravo Amazon!  This is a brilliant device!  I absolutely *love* that the device incorporates screen mirroring.  The FTV stick pairs marvelously with my Samsung Galaxy Tab 3 8.0 and it's screen appears on my HDTV!", "verified": true, "helpfulness": "0/0", "author": "Former Yooper"}, {"rating": 1.0, "review": "So. Uh. We can't use this, basically.  We instantly lost the very tiny remote.  It works with my android phone, but it's kinda crappy and slow to use that way. I'm the only one who has an android phone, so my wife can't use it and my inlaws who come over to watch our kids some mornings can't use it.  Also, it keeps asking for my Netflix username and password to be reentered, which has to be done laboriously using the herky jerky android app.  I had bought this just for Netflix to replace the broken Wii (doesn't play Wii discs anymore) we'd been using just for Netflix.  I was so happy to have retired that Wii to the basement box of electronics doom, hoping my days of pointing a little thing at a screen to and getting frustrating were over.  Turns out I was doing the same thing with this thing, but instead of doing it to pick movies to watch, I was constantly re-entering passwords.  Add to that that without the remote your cell phone can't find the damn stick unless its woken up, but it goes to sleep and needs the remote to wake it up! So every time you use it (without the remote) you have to go over and unplug it and then plug it back in.  Horray! The future!  I tried to buy a replacement remote, but apparently it takes months and months because of the backlog. So guess what?  That Wii got dragged back out of retirement.  So much for the Firestick... At least it was only $19.  Also -- yeah - -this was probably our fault for losing the remote and having iphones, sure. But - so, 1 star review given I have a 2 year old who likes losing tiny remotes.", "verified": true, "helpfulness": "0/2", "author": "Tom Weaver"}, {"rating": 5.0, "review": "Amazingly Quick!", "verified": true, "helpfulness": "0/0", "author": "Roman Gunther"}, {"rating": 3.0, "review": "I was a bit disappointed since the original ad for this stick stated you could \"cast\" with it like the Google chrome stick. If you are looking for a less expensive device to stream from Amazon rather than their Amazon Fire TV, this will do it. Some reviewers said that the lack of power compared to the Fire TV, may cause some stuttering when streaming. I bought it because Amazon has done a great job with  its products in the past and this supposedly was more powerful than the Google Chromecast device. The Amazon stick cannot cast from your PC or tablet or android phone like Google Chromecast.  I pre bought the Amazon stick  at a low $20 price, since I was interested in whether it was better  for casting and the price was low enough to be willing to play with it. I already own an Amazon  Fire TV box, which has been an excellent product. Personally, I  recommend that you pay the extra cost for  the Fire TV box instead of the Amazon stick. If you want to cast from your PC, phone, or tablet, then you really want to buy the Google Chrome cast device. The only reason I can see for purchasing the Amazon stick, is if you want to stream movies and don't want to pay the higher price that the Amazon Fire TV costs.", "verified": true, "helpfulness": "0/0", "author": "Gordon R. Thomas"}, {"rating": 5.0, "review": "I really like the this item.  Easy to set up and connected to my Wi-Fi network very quickly.  I was up and running in about five minutes.  Easy to operate and is very fast.  No problems at all.  I'm not a fan of using a power cord directly to it but other than that I have no complaints whatsoever.", "verified": true, "helpfulness": "0/0", "author": "WDWFan"}, {"rating": 5.0, "review": "Purchased this onsale and do not regret it one bit. I have the Chromecast and this device is just as good but with added capabilities chrome currently does not have. This device has access to many apps including netflix. They perform as expected. You can sort content easily with the remote and do not need an external device like phone or ipad to cast, everything is done through the home menu. Streaming is very quick and appears strong. Very happy with purchase. Turns any tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "Fast /Clear picture/No lag /runs warm", "verified": true, "helpfulness": "0/0", "author": "Michael Mccurdy"}, {"rating": 1.0, "review": "I set up the Fire TV stick and have tried to watch two programs on it, one netflix and the other amazon prime.  In both cases, the picture was incredibly jerky---appeared to have too low of a framerate.  I switched to a different streaming device (chrome cast for netflix and roku for amazon prime) and the picture was much smoother.  There's no network difference here---they're all on the same wifi, so it's either the device itself or software that's delivering bad video quality.In terms of setup it wasn't horrible---the only odd thing was after it updated its firmware it first claims it needs the wifi password again, then about 15 seconds later remembered it and kept going even though I hadn't finished entering it.When you get the device it's attached to your amazon prime account, and I could immediately stream movies.  What was strange was that there was no way to view my watch list in the menu---I could only see a \"top movies and tv shows\" category.So the fire tv stick seems like a nice idea, but with poor video quality, I'd recommend a Roku instead, as it also streams amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Bruce L"}]