[{"rating": 3.0, "review": "It was ok...Nothing to really write home about. It is almost having an expanded version of Netflix, from movies to tv shows that are available. Of course, then there are the movies that costs... Then, if U r a game player, there are games to play and lastly, if U still have time n your day, you can watch/listen to music and last, you can scroll via your Amazon photos. I just don't have all the time in my day. Others people may have more time to watch the tube.", "verified": true, "helpfulness": "0/0", "author": "Lions_Share"}, {"rating": 5.0, "review": "This thing has surprised us with its speed and features. I thought we were only getting Amazon prime video but the photo options and the music was a great add on.  The remote is intuitive and the fact that you can turn your phone into a remote is a great feature.  No more lost remotes!  Finally I was surprised how quickly videos load and start. Better than my blue ray.", "verified": true, "helpfulness": "0/0", "author": "Brian M. Mathes"}, {"rating": 3.0, "review": "I ordered this and a chrome cast at almost the same time.  I much prefer the chromecast.  I don't stream much Amazon content though and it seems this is really geared for the amazon content", "verified": true, "helpfulness": "0/0", "author": "Mattski360"}, {"rating": 5.0, "review": "We love it, streaming is SO easy now!", "verified": true, "helpfulness": "0/0", "author": "DENRAY MACHINE INC"}, {"rating": 5.0, "review": "excellent.", "verified": true, "helpfulness": "0/0", "author": "S. Finkel"}, {"rating": 3.0, "review": "Putting it together and connecting it couldn't have been easier. But I'm a bit disappointed with the start up and the having to restart the whole thing when it goes into sleep mode.  Other then that is definitely a great product for what is worth.", "verified": true, "helpfulness": "0/0", "author": "Raymond Delgado"}, {"rating": 5.0, "review": "I really like it. Works well with my Samsung tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 2.0, "review": "Worked great for the first two months.  Now the remote does not work.", "verified": true, "helpfulness": "0/0", "author": "Isaiah \"Isaiah\""}, {"rating": 5.0, "review": "it do the work perfect,i can download kodi (XBMC) and watch movies from my computer streamingi can airplay from my iphone and mirror also with app called AirPlay DLNA Receiver PROvery smooth and fast with 1080 HDcheaper than apple tv and do the same and better work", "verified": true, "helpfulness": "0/0", "author": "Ahmad"}]