[{"rating": 5.0, "review": "I love the fire TV stick,  easy to use and works great. I have a slingbox and I love that this device has an app for that! Makes cable TV portable and I have one in every room now. No need for a media pc anymore!", "verified": true, "helpfulness": "0/0", "author": "Joengelhart"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Lisa F Binion"}, {"rating": 4.0, "review": "good value", "verified": true, "helpfulness": "0/0", "author": "captainjunker"}, {"rating": 4.0, "review": "I got this on the $19 Fire TV Stick sale.  When it arrived, we had it set up in minutes and started watching Amazon Prime movies.  The resolution is much better than the native Sony smart TV Amazon option.  I love the dedicated remote, it was too hard to remember what function the color keys performed on the Sony remote.  Overall it was a good buy and I love being able to listen to my Amazon music on my TV.", "verified": true, "helpfulness": "0/0", "author": "slow cooker"}, {"rating": 5.0, "review": "I previously I purchased a competitors product. It was the most complicated item I've ever purchased.  I then bought the Fire TV stick, in less than 5 minutes I was up and running, This was so easy to connect.  I highly recommend this to everyone instead of using a HDMI cord.", "verified": true, "helpfulness": "0/0", "author": "patricia ryan"}, {"rating": 5.0, "review": "So far so good. It was easy to set up, with clear instructions and a useful video tutorial. All the usual apps such as Netflix and Hulu Plus are there, as is Amazon Prime. So, no issues yet.", "verified": true, "helpfulness": "0/0", "author": "John D \"John D\""}, {"rating": 5.0, "review": "This is the greatest device I have every seen.  Can now watch Netflix in full screen.  Worked perfectly from the moment I set it up.  Just love it.  Wish I had this years ago.", "verified": true, "helpfulness": "0/0", "author": "padooka"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Barbara Knisley-Herron"}, {"rating": 3.0, "review": "A nice quality and layout system but not reliable.  First I was surprised you have to plug this system into the wall (kinda defeats my plan of just throwing a media stick in my pocket.)Let me say the quality is beautiful but I dropped signal occasionally when my Roku never does (maybe 1080 compared to 720?)Lastly the menu screen froze up on me after trying pictures mode. I noticed the unit was pretty hot so I unplugged it. After plugging back in I couldn't get the remote to work now.I packed it away and brought out my Roku. Since I paid $19 I will just keep it and hope Amazon's updates work out some kinks.Also is pretty cool you can buy a game pad for it!", "verified": true, "helpfulness": "0/0", "author": "JeffdaRev"}, {"rating": 5.0, "review": "This is the second \"stick\" I bought. First was Chromecast, which is ... OK, and I have to admit, that it would be good enough if it supported Amazon Prime Video.(I don't get Google playing these silly games with its competitors - let your product win on the merits, not by ridiculous, underhanded marketing tactics). The 50% off for Prime members made the Amazon stick hard to resist so... I bought it, and .... LOVE IT.1) It doesn't hang like Chromecast does from time to time (audio goes to Lala lend, without any reason). To this day, I had absolutely NO technical issues.2) The installation was AMAZINGLY simply. In comparison, the \"software\" company Google, made it so painful as I still have nightmares about it.3) FireTV stick interace is MUCH better (in my humble opionion - some disagree, but I don't care). It is snappier than this of Chrmocast and my native \"smart\" Visio TV (granted the latter is 3 years old, so it does have an excuse).4) FireTV gives me all online video accessm, even Google youtube with its chromecast casting, and video queing feature... LUV IT!  This prette much killed Chromecast stick for me.  Don't need it any more. Already disconnected, and probably will gift it to some of my friends.Cons? I simply don't have even one.In a nutshell, my Amazon viewing prime video viewing has improved (when I compare with the Vizio app),  The included remote provides better experience than the one of Chromecast stick (I really don't care about voice recognition, but if I change my mind, I CAN get a new remote in the future).I was seriously thinking about getting a Roku box, but this product made me stop. At least for a while. I am not a gamers, I do not care about this aspect of products like this. Also, I do not see any sense in running a huge 60\" tv to... listen to the musing. It would be like using Microsoft Excel for righting letters. CAN be done, but WHYYYYY!?  I don't watch musing, I only listen to it.", "verified": true, "helpfulness": "0/0", "author": "Boogie Man \"boggieman\""}]