[{"rating": 5.0, "review": "Great value with such small tiny package. Get it, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Brad Lai"}, {"rating": 2.0, "review": "First of all, I ordered this when it was offered for $19.99 to Prime Customers I believe back in October with a guaranteed delivery date of before Dec 23rd.  When I checked out, the delivery date changed to Jan 2015.  Best Buy then had them on special at the first of Dec for $24.99 so I Bought 2.  Amazon's Fire TV Stick arrived around Dec 18th finally, well after Best Buy and everyone else had them available and for only $5 more than that \"SPECIAL PREORDER PRICE FOR PRIME MEMBERS ONLY.\"I am extremely disappointed that it does not have the two most important Channel Apps that I use, HBOGO and SHOWTIME ANYTIME and several others.  I was going to give all 3 as gifts but am selling them on eBay instead because all three ppl that would have been the receivers of them, must have HBOGO and SHOWTIMEANYTIME.  And also the Time Warner Cable channel app as they all live in NYC.So, I and they are sticking with the ROKU 3 streamer, still the best on the market in my and many other friends and families opinions.Very disappointed in Jeff Bezos for releasing this half baked item.  Also, same with the Fire Cell Phone, which I will rate later in the appropriate space.....a disappointment.", "verified": true, "helpfulness": "0/1", "author": "gmpt"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Lenar"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Mtqpham"}, {"rating": 5.0, "review": "I love it.  I have access to lots of music  downside is not all prime music can be downloaded to listen too. I fine it on prime but when I search to add it it's not there.  It plays beautiful wallpaper on the tv.  It has the song lyrics so you can sing along like karaoke. I Attached the app to my kindle and also have voice command.  Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Wild Irish Rose"}, {"rating": 1.0, "review": "amazon fire stick tv \"upgrade\" took me off my prime free trial and charged me for the non-free trial. Upgrade did not have any confirmation it just charges you. (the free trial and non-free trial have the exact same benefits)", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 4.0, "review": "Really cool and easy to use", "verified": true, "helpfulness": "0/1", "author": "Christina Barbarossa"}, {"rating": 5.0, "review": "Much better than the chromecast, it's faster, more responsive and it have a useful remote for the much better UI.A MUST HAVE IF YOU ARE A PRIME MEMBER.", "verified": true, "helpfulness": "0/1", "author": "butter123"}, {"rating": 2.0, "review": "Stopped using it because it would not connect to my Wifi!  Im back to Chromecast and not a problem.", "verified": true, "helpfulness": "1/1", "author": "Beto"}, {"rating": 4.0, "review": "Bought this during the promotion for Prime members for less than $20 just to try it out. I have a Chromecast already, but it's in the box and being unused because I was ultimately disappointed that the Chromecast could not function by itself - it's basically just a \"mirror\". The Amazon Fire TV Stick is different - and it comes with a dedicated remote controller too, which is one of the reasons why I decided to try it out. That said, there's no turning back - the Fire TV Stick is (almost) exactly what I've been looking for in a set-top box. The interface is nice to look at and easy to use, the remote controller is also easy to use (and Bluetooth - meaning you don't have to point it anywhere specific), and it had the apps/channels I was looking for specifically (RedBullTV, Spotify Connect, Plex). The only gripe is that I don't like how it requires a USB cable to power it (not shown in most of the product photos, although the Chromecast was exactly the same way).After one day with the Fire TV Stick I ended up... disconnecting it from my HDTV - because I went ahead and purchased the Fire TV for the voice search, the added performance, and the built-in ethernet (the Fire TV Stick is WiFi only). however - the Fire TV Stick did not go back into its box (like the Chromecast), but it went into my travel backpack so that when I'm out of town I can just plug in the Fire TV Stick into the hotel TV and I'm good to go.I'm giving the Fire TV Stick 4 stars total because I've tried Chromecast, I've tried Roku, I've tried Apple TV, and I even built my own HTPC, and all of those are now pointless because the Fire TV Stick does what I wanted all those other machines to do in one small and very capable package. The only gripe (the power cable requirement) to me is enough to subtract one star from the overall score.", "verified": true, "helpfulness": "0/0", "author": "James R."}]