[{"rating": 5.0, "review": "Love the fire stick❤️.. Simple to assemble..", "verified": true, "helpfulness": "0/0", "author": "Lorraine"}, {"rating": 4.0, "review": "I like it, does what it is supposed to do.  We have several gadgets in our home and I find myself using this one more than I thought I would.  Though it doens't play as many games the the Fire TV box, it has a nice assortment offered.  I did add the game controller.  This one might end up in the second bedroom as we might upgrade to the box.  Overall I'm happy with it, and we have two other streaming devices in the home, we use this one quite a bit, especially being Prime Members, and after the addition of the game remote.", "verified": true, "helpfulness": "0/0", "author": "planettom \"planettom\""}, {"rating": 5.0, "review": "The Fire Stick has works great, I like using this rather than the apps on a blue ray or PS3.", "verified": true, "helpfulness": "1/1", "author": "Shawn Darnell"}, {"rating": 5.0, "review": "Wonderful product for the price.  Easy to install, easy to use, and I love having access to my amazon music through my TV.", "verified": true, "helpfulness": "1/1", "author": "LizWisco"}, {"rating": 5.0, "review": "EXCELLENT!!!!I LIKE IT!!!", "verified": true, "helpfulness": "1/1", "author": "PEDRO HERNANDEZ"}, {"rating": 5.0, "review": "Nice!!!! Very good", "verified": true, "helpfulness": "1/1", "author": "Victor"}, {"rating": 5.0, "review": "I have two Fire TV Sticks. First one was initially a big headache to set up in a TV located in a built-in concrete stand (wireless connectivity issues?) but once we moved our router from floor to a desk it worked very well. However, our second stick took just less than 5 minutes to set up and worked perfectly from the start. It's easy to switch between the Fire Stick and Chromecast if needed but we plan to transition to Fire Stick for Netflix so we don't have to switch between the two. If you have Amazon Prime and/or like to rent digital movies then this Fire TV Stick is wonderful. Easy search feature and Watchlist feature makes it easy to save titles for later viewing. We are enjoying the Amazon original pilots in addition to our extensive watch list.", "verified": true, "helpfulness": "1/1", "author": "MG"}, {"rating": 3.0, "review": "The battery cover was nearly impossible to remove. Had to take it to local hardware store to get help with it.  Has to be made easier", "verified": true, "helpfulness": "0/0", "author": "S. Winkler"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Saundra K."}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "1/1", "author": "jeff aiken"}]