[{"rating": 5.0, "review": "Simply perfect!", "verified": true, "helpfulness": "0/0", "author": "Beau Hottenstein"}, {"rating": 5.0, "review": "The UX is beatiful and easy — comparable with an Apple TV (but off course Amazony). Apps are limited but kind of unnecessary. The voice search features are buggy (you can see an ad for Transparent, and search for Transparent — and get no results...). We use it more than the Apple TV now.", "verified": true, "helpfulness": "0/0", "author": "SomeGoodPixels"}, {"rating": 5.0, "review": "Really easy installation. Walked right thru it and was watching my favorites an just minutes.", "verified": true, "helpfulness": "0/0", "author": "Richard Nehring"}, {"rating": 3.0, "review": "The Fire TV Stick has its uses. I enjoyed make our dumb tv smart. However unless you have Netflix and such its not all that useful. The number of apps that allow for free steaming are pretty low and they were buggy to me. It does not have a  built in web browser so you can't go to any steaming sites. Games are meh I did not really see any that caught my eye as far as must play's. Side loading things are possible but glitchy and if you get them on their a pain to access. The remote can be a bit slow but I think that's their to encourage you to get the app. I probably would not have bought it if A i did not pre-order it for $20 and B payed for it with gift cards. If you want to steam to your tv you would probably do better just hooking up a computer to your tv and just have a wireless keyboard with touch pad. You would be able to get to all the same content and more.", "verified": true, "helpfulness": "0/0", "author": "Josh D."}, {"rating": 1.0, "review": "did not have audio. Talked to tech at amazon he didn't know why.", "verified": true, "helpfulness": "1/1", "author": "Donald McCrorey"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "sarah thomas"}, {"rating": 5.0, "review": "Great product! Recommend it to all my friends and have numerous ones in my house.", "verified": true, "helpfulness": "0/0", "author": "Tom Baileys"}, {"rating": 5.0, "review": "Love it.Very easy set up", "verified": true, "helpfulness": "0/0", "author": "nadine"}, {"rating": 5.0, "review": "Awesome. Waiting to get the second one!", "verified": true, "helpfulness": "0/0", "author": "JLR"}, {"rating": 5.0, "review": "I've thoroughly enjoyed the Fire TV Stick....so much that I had to add another!  Besides Prime, it also gets me into other services I use such as Hulu, Netflix and Showtime.  Easy to set up, I had it up and running in less than five minutes.  Phone app on my android also makes it easy to use and voice searches are handy.  Highly recommended.  Hopefully more services to be added in the future to make it even better...HBOGO, MAXGO, CBS, etc. would make it a must have!", "verified": true, "helpfulness": "0/0", "author": "MartianSccr"}]