[{"rating": 4.0, "review": "Works well on my 60mbs internet service. I wish you could cast your computer screen to the TV like Chromecast does however.", "verified": true, "helpfulness": "0/0", "author": "Mike Clouse"}, {"rating": 4.0, "review": "No surprises! Everything I expected.", "verified": true, "helpfulness": "0/0", "author": "J. Weiner"}, {"rating": 5.0, "review": "Way quicker than the smart apps on my Samsung LCD.  Works great.  For best performance it says to plug the adapter into the side of the fire stick which adds to more cords.", "verified": true, "helpfulness": "0/0", "author": "tconno"}, {"rating": 4.0, "review": "I love my Fire TV Stick, works great, awesome value!", "verified": true, "helpfulness": "0/0", "author": "Vaughn A Clement"}, {"rating": 1.0, "review": "Cannot view same shows on kindle Amazon prime. It says I ordered something when I didnt", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Performed perfectly, just as expected.  Loved the exclusive Amazon content", "verified": true, "helpfulness": "0/0", "author": "Robert L Grenader"}, {"rating": 4.0, "review": "the fire stick is an easy way to connect to many streaming products now available by the Internet. There still are many apps missing. For example I am a member of acorn TV and really wish the app was available. I have read that it is coming but it would be appreciated if someone could tell me when. Also the screen mirroring function works great. I've tested it on my fire HDX and on my galaxy note 2 and it works well on both. The setup is easy and in about 15 minutes you're connected to the many products available on the fire stick . Netflix, Pandora , and many of the new streaming news services such as CBS and Huffington Post are also available . There also many other niche sites that are available and most of them are free . Enjoy the product and let me know if you hear about acorn TV . All in all it's a great start the key to long-term success is the number of apps available.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 1.0, "review": "Don't waste your time. I can't get it to connect to my network at all. That's only if I can get to the \"connect to network\" portion of the set up. It usually freezes three or four times before I get that far. The first one I received from Amazon did the same thing and it was extremely hot to the touch after just a few minutes. After chatting with Amazon they decided that the fire stick was the issue and they would send me a new one. Now the new one does the same and is also very hot to the touch. I am beyond disappointed! I bought two of these for Christmas presents and they are completely unusable!", "verified": true, "helpfulness": "0/0", "author": "M. Bloom \"Kenzie's Ma\""}, {"rating": 5.0, "review": "Buy it.  It's amazing.", "verified": true, "helpfulness": "0/0", "author": "Tiberius Lee"}, {"rating": 5.0, "review": "Fastest hook up ever. Easy as pie. Plugged it in and it worked. Love it! Great for gifts too.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Mcdermott"}]