[{"rating": 5.0, "review": "Fast", "verified": true, "helpfulness": "0/0", "author": "Phetnoy Oudomvilay"}, {"rating": 3.0, "review": "I like the service has alot of cool features the only problem is the freezing and glitches.", "verified": true, "helpfulness": "0/0", "author": "William Silcox"}, {"rating": 5.0, "review": "Great Device. Much Like the other devices out there, but it works like a charm. It can also do Mirroring, hopefully we see some great updates in the future. Sling TV is great, as well as Hulu, Netflix, and Amazon Prime Videos.", "verified": true, "helpfulness": "0/0", "author": "Lesley Kwan"}, {"rating": 5.0, "review": "hi all it works truly well easy to setup don't have to use your computer I would recommend it Gloria", "verified": true, "helpfulness": "0/0", "author": "Gloria V \"Roland V\""}, {"rating": 3.0, "review": "I got this product for my daughters room to stream some cartoons and what have you mainly from my plex media server. This definitely has some issues in terms of streaming capabilities. Your server needs to be plugged in via ethernet and you need a fairly high end router. I have a netgear ac1900 nighthawk and definitely couldn't stream 1080p without my laptop being plugged directly into my router. I also have a roku 3 which is really fast and has never had a slight streaming issue at all. But other than that the interface on this little thing is pretty good. No streaming issues in terms of netflix or anything. But if you intend to use plex a lot i would look elsewhere such as a roku 3.", "verified": true, "helpfulness": "0/0", "author": "Jon B"}, {"rating": 3.0, "review": "When it works, it's great. Sometimes it acts like it's buffering, but it doesn't start working again. I have to unplug it and then plug it back in for it to work again.", "verified": true, "helpfulness": "0/0", "author": "Bonnie CXhampagne"}, {"rating": 5.0, "review": "Grate product thanks", "verified": true, "helpfulness": "0/0", "author": "Yehoshua pal"}, {"rating": 5.0, "review": "Amazing little divice streams at 1080p", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 2.0, "review": "It is the second Fire I have bought. The first was Fire TV. It is fast, but not as versatile as Chromecast. Need to improve the software to connect to media servers, job that Bubble Upnp and Chromecast do amazingly!", "verified": true, "helpfulness": "0/0", "author": "mdzago"}, {"rating": 1.0, "review": "The return of the first television concept with 4 major channels of going backwards. In other wards one looses a great deal of independence of selection. A universal TV guide would make the search for available channel info at a specific time would be very helpful. Too, all my original programming I previous watched is not available on all markets. So I lost a lot of programming that I enjoyed watching with the flexibility of sight and choosing. There are still a lot of commercials, the pictures locks frequently.", "verified": false, "helpfulness": "0/0", "author": "N. J."}]