[{"rating": 1.0, "review": "Do not waste your money! TV shows Amazon charges money for when they are free on TV. Save your money!", "verified": true, "helpfulness": "0/0", "author": "Fred Dean"}, {"rating": 4.0, "review": "It would be nicer if you had more movies for the prime members, most of the ones you have to buy or rent are on tv and I can record it with my dvr or on HBO.", "verified": true, "helpfulness": "0/0", "author": "shay"}, {"rating": 3.0, "review": "Nice product.  Loved the simplicity.  I really only got it to play Amazon Prime videos, as it was the one thing lacking in my Samsung DVD player.  It does a good job streaming and the picture quality is good. I do wish it had some type of infra-red adapter or sensor, so I could use a universal remote.  Any time I want to watch Prime videos, I have the use two remotes.  Might look into getting a Roku HD.", "verified": true, "helpfulness": "0/0", "author": "Charles Pitman \"chazp\""}, {"rating": 2.0, "review": "Hulu is bad on this, as well as a very annoying delay in response from the remote to tv , constantly try to clear cache and data to no avail , get what  you pay for.", "verified": true, "helpfulness": "0/0", "author": "Caitlyn Wagner"}, {"rating": 5.0, "review": "AWESOME!", "verified": false, "helpfulness": "0/0", "author": "Rebecca Brown"}, {"rating": 5.0, "review": "I'm glad I can finally watch Amazon Prime and Netflix using the same stick. It works great. I even downloaded a game to try, that me and my 5 year old play together :-)", "verified": true, "helpfulness": "0/0", "author": "Francoise"}, {"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Anyone with Amazon Prime needs this. There are a lot of great original Amazon programs to enjoy as well as a ton of entertainment too numerous to mention here. We have AT&T; UVerse 450 and still use the Fire Stick every night. You can't beat the value of the Fire Stick with Amazon Prime. What a bargain.", "verified": true, "helpfulness": "0/0", "author": "shelman"}, {"rating": 5.0, "review": "By far better than roku. Thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Fire Stick is fine.  It's basically what I already had on my Kindle Fire, but it's nice to see movies now on a bigger screen.", "verified": true, "helpfulness": "0/0", "author": "writingdiva"}]