[{"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "sharon brown"}, {"rating": 5.0, "review": "Great value for the money. Great companion to Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "william s."}, {"rating": 5.0, "review": "It is awesome.  I especially love that I can view YouTube on it so I can see tutorials easier.  I love all the free apps but don't like that many of the items on the Fire tv are paid subscriptions.  My husband is having fun with the comedy and science apps and Netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Albers"}, {"rating": 5.0, "review": "I absolutely love this!!  It is a great addition to my fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "DAWN HEGLEY"}, {"rating": 5.0, "review": "Everyone needs a Fire TV Stick.  My daughter loves it to put on her children's smart TV.  They are able to watch Netflix and Prime Videos.", "verified": true, "helpfulness": "0/0", "author": "Christy J. Wrenn \"Academic Book Lady\""}, {"rating": 1.0, "review": "TV commercial makes it appear as if no power cord is needed. I should have done better research so it's partially my fault. I don't see how this is any different than a box sitting next to the TV. The price is nice I suppose.", "verified": true, "helpfulness": "1/1", "author": "KS"}, {"rating": 5.0, "review": "i bought mine on preorder for plex and netflix don't like the plex app if u buying for plex don't buy the ui sucks", "verified": true, "helpfulness": "0/0", "author": "Johnathan Denson"}, {"rating": 5.0, "review": "Easy to set up. For the price to get Netflix, Amazon Prime and other streaming media for less than $40. Works better than Google ChromeCast and cheaper than AppleTV box. Would highly recommend. Will by another one for TV that doesn't have a cable box.", "verified": true, "helpfulness": "0/0", "author": "Michael's review"}, {"rating": 5.0, "review": "Small compact and much better price compared to the brand I had bought for my son.", "verified": true, "helpfulness": "0/0", "author": "Moe"}, {"rating": 5.0, "review": "This is pretty awesome.", "verified": true, "helpfulness": "0/0", "author": "Annamonti"}]