[{"rating": 5.0, "review": "Very easy to use and love all the options!", "verified": true, "helpfulness": "0/0", "author": "Simply S \"simply_s12\""}, {"rating": 1.0, "review": "It doesn't work. It's constantly buffering. My wireless network is fine. Every other wireless device I have works perfectly.  This is useless. I got it to watch Netflix on my upstairs TV and it's useless.", "verified": true, "helpfulness": "0/0", "author": "Lisa R."}, {"rating": 5.0, "review": "Very fast compared to apple tv  and chromecast.  Having a remote is a must.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Stick was what we expected. Plan to order more.", "verified": true, "helpfulness": "0/0", "author": "Ronald Brown"}, {"rating": 3.0, "review": "HULU is a disaster on this. I'm sure Ellen D. Would agree.", "verified": true, "helpfulness": "0/0", "author": "Sheila c. Brown"}, {"rating": 5.0, "review": "It's awesome", "verified": false, "helpfulness": "0/0", "author": "jaime jimenez"}, {"rating": 4.0, "review": "I love it movie night  weekend", "verified": true, "helpfulness": "0/0", "author": "bjggvgghhhf"}, {"rating": 5.0, "review": "Love the firestick, its fast and easy to use.  It's faster then my Roku box :)", "verified": true, "helpfulness": "0/0", "author": "Monty Ehninger"}, {"rating": 5.0, "review": "easy to install and provides a lot of service for the costgo for it !!", "verified": true, "helpfulness": "0/0", "author": "ed wondoloski"}, {"rating": 4.0, "review": "Not much to say that hasn't been said in the previous 27k reviews. It blows Chromecast out of the water and is the best platform out there. I own the Fire TV (5 stars) and this.Unfortunately, I am about to return my 2nd Fire Stick. I bought it for my family room TV, which is wall mounted. I plug it in, connect to the USB port, turn it on, and I get a message saying I can't power it through USB. Whhaaaaaaaaa??????? Seriously? So, I am expected to fish the cable through a wall and try to find an outlet? Ummmm.... no. Major fail.If an outlet is convenient, it is 5 stars. Otherwise, it is useless.", "verified": true, "helpfulness": "0/0", "author": "michaelb1968"}]