[{"rating": 1.0, "review": "Horrible. I have been an Amazon customer for a long time. I use Amazon video on my current blu-ray device. The interface of the Fire Stik is ridiculous and hard to navigate. The connection was s***...and we have lightning fast internet. And the charger....yeah, it requires a charger...sticks off the side of this thing and makes it very difficult to \"hide\". Yeah, no. I'll stick with using their services but Amazon should stop with the electronics. Kindle is great. Kindle Fire is ok. Everything else is a glorified turd. I didn't even bother returning it. I'm just going to keep it incase my other tech crashes and I need a quick fix for a very short time.", "verified": true, "helpfulness": "1/2", "author": "Scott A. Broadbent \"Moon Knight\""}, {"rating": 4.0, "review": "works well and as advertised", "verified": true, "helpfulness": "0/0", "author": "Visitor \"Toys\""}, {"rating": 5.0, "review": "Got this for my mother who wants to get away from cable (she is paying ~$180/month). She doesn't know a lot about computers, so I had to set this up for her, and spend ~ an hour teaching her how to use it. She will be cancelling her cable tv soon, saving over $100/month (she signed up for netflix/prime/hulu already, after a short trial).Using a smart phone with this really makes the mic'd remote unnecessary, so don't worry about getting it if you have a decent phone. If you don't have a decent phone, the upgraded remote might be worth it due to the terrible on-screen typing system that *everyone* uses =P", "verified": true, "helpfulness": "0/0", "author": "Steven Worcester"}, {"rating": 3.0, "review": "At first impression - I LOVED the new Fire TV Stick.But, it has lost its luster after \"forgetting\" my login info many times, including the login info for the Wifi network - VERY ANNOYING!I have mainly switched back to using my CAT5 Wired Apple TV because there are no issues with \"buffering\" when you are on a hard wired cable.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Was easy to install.  I wished power cord was longer 6-8 feet.", "verified": true, "helpfulness": "0/0", "author": "Don J"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "marie colon"}, {"rating": 4.0, "review": "It perform as it claim although I could have gotten it cheaper if I had waited on Amazon.  But I hopefully the price will be more competative.", "verified": true, "helpfulness": "0/0", "author": "T. Ryan Harris"}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Lauren Thomas"}, {"rating": 5.0, "review": "This has been a great investment for us.  We had found our on demand feature from our cable company's upgraded box extremely hard to navigate through, so we would give up trying to find the shows our kids wanted to watch.  The Fire Stick has given us and them so many more options now, and it is so easy to use!", "verified": true, "helpfulness": "1/1", "author": "L. Morgan Cooper"}, {"rating": 5.0, "review": "I love the Fire TV Stick. It was so easy to set up and watch a program in less than ten minutes. It was highly recommended to me by two family members and I am happy to recommend it to everyone!", "verified": true, "helpfulness": "0/0", "author": "Susan C. Henderson"}]