[{"rating": 5.0, "review": "I Love it", "verified": true, "helpfulness": "0/0", "author": "Donald Estes"}, {"rating": 5.0, "review": "t.  Simple to setup and get started.", "verified": true, "helpfulness": "0/0", "author": "Neal Fisher"}, {"rating": 5.0, "review": "So glad i decided to make this purchase! I could sit here for hours on end playing with all its different features and games. Yes almost everygame clst money but just the same on any hand held device there are free games and paid ones. I love that there is no little piece of plastic at the end of it like there is on a TV remote so that you have to point it at the TV at the right angle. Its completely wireless and communicates with the TV through the little piece it comes with that goes into the TV. I could control iit with my hands under the blanker if i wanted. Its a very modernized device. My only complaint is that every movie it offers requires additional charges, although it does offer Netflix and i pay for Netflix monthly so that's not too much of an issue.", "verified": false, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 1.0, "review": "Do not waist your money on this device. It has horrible wifi and overheats. Spend the extra ten dollars on getting a roku.", "verified": true, "helpfulness": "0/0", "author": "Jachob Taylor"}, {"rating": 2.0, "review": "Power adapter blow out just one week use.  now I bought another adapter for 1.0A. That is my additional price to watch FIRE TV STIck", "verified": true, "helpfulness": "0/0", "author": "Yoon S."}, {"rating": 5.0, "review": "I couldn't believe how fast the Netflix app works for me. I was pulling it through the Blu-Ray. but this is 5 times faster. Amazon Prime Video is really quick too. Not bad for the price", "verified": true, "helpfulness": "0/0", "author": "Bear Man"}, {"rating": 5.0, "review": "Love it!!  easy to use, all kinds of shows/movies to watch.", "verified": true, "helpfulness": "0/0", "author": "amanda treska"}, {"rating": 5.0, "review": "Great product, better than advertised ! Very easy to set up. Love my Firestick !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "We have had this for over a month and have yet been able to get it to work. Tried everything. Wont connect. Still streaming on our ipad HDMI conected to TV.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "Does exactly what it's supposed to do. Very user friendly, easy to set up and install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]