[{"rating": 5.0, "review": "Works great and was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Book Lady"}, {"rating": 5.0, "review": "I have the tablet it this is even better for the hole family,Got Prime plug it in and you done.", "verified": false, "helpfulness": "0/0", "author": "James Patterson"}, {"rating": 5.0, "review": "Easy to install. Easy to use. And am loving the mobile app as the remote :)", "verified": true, "helpfulness": "0/0", "author": "Tiffany Ellis"}, {"rating": 2.0, "review": "I got this at a discount when it was first announced and I gotta say, I'm very disappointed.Pros:Remote is very convenient and handy. One of the only good things about this product.Interface is pretty good and convenient BUT is often laggy and crashes every now and again.The screensaver is absolutely beautiful and stunning. This is perhaps the only great thing about this product.Cons:Must be always plugged into the wall using ONLY their cable and adapter. Anything else won't work. Terrible decision considering the cable length might not always be long enough, let alone the inconvenience of the whole ordeal.Seemingly occasional bad reception. I hate WiFi for this reason and even though my other devices seemed fine (laptop, phone) every now and again streaming (netflix) just doesn't work. It would stutter and just be frustrating and unwatchable.Low app diversity and choice. I'm glad they even gave the option of having 3rd party developers make their own apps for this device, but there's so few of them and the ones that you might actually want or use aren't even there.The long con:No support for browser or webpage streaming. I'd say this is it's major and fatal flaw. Perhaps the main reason why you should consider buying a different product. (Wouldn't recommend chromecast either because those are just garbage. It has the ability to stream from browser, but still garbage).Would not recommend/10", "verified": true, "helpfulness": "1/1", "author": "Samir"}, {"rating": 5.0, "review": "The Fire TV Stick took care of all my issues with disconnects and buffering. Would recommend it to to anyone with similar issues.", "verified": true, "helpfulness": "0/0", "author": "Gary H."}, {"rating": 5.0, "review": "I purchased a Roku and was entirely happy with it but, unfortunately, I accidentally leaned on the chord and the stick broke.  Rather than reordering a Roku, I thought I'd try the Fire Stick.  I LOVE IT!!  Better.  Faster.  Easier set up.  Clearer picture.  I am completely satisfied with the Fire Stick and am considering the Roku mishap to be a \"blessing in disguise\".  100% satisfied!  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jan 14225"}, {"rating": 5.0, "review": "I have only used it a couple times since I got it, but so far I think it's great.  I had a Chromecast for several years, which I used all the time.  I lost it when I brought it out of town so I had to replace it.  The main reason I wanted to switch to the fire stick was to get access to the Amazon Prime video library, but now that we have it I think it is better than the Chromecast was.  It has a menu that is easy to navigate, and it has games that seem pretty fun so far.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Katherine H."}, {"rating": 5.0, "review": "Amazing I have both this and the Chrome and this exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "AMG \"AMG\""}, {"rating": 5.0, "review": "Fire tv stick is the best invention ever made! So wasy to use and it adds suxh demesion to what your tv is able to do. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Edward Albert"}]