[{"rating": 2.0, "review": "We absolutely loved our FireTV stick when we got it. The menus are easy, there are a ton of apps, and it allows you to play music from your Amazon library. However, we had two serious issues:1. After a week or two, there were constant connectivity problems. Movies were super blurry and sometimes the connection dropped out completely.2. The stick itself was incredibly hot to the touch. We tried using it plugged directly into the TV, and using the extension, but it didn't make a difference. It was very unnerving.After the first discussion with customer service, they sent us a replacement. When the second one did the same thing, we just asked for a refund. Such a bummer because we loved it. We just wish it worked for us. The customer service agent suggested it was a problem with our set up, but other reviewers seem to have the same issue. Maybe they'll work it out and release a second generation.", "verified": true, "helpfulness": "0/0", "author": "avidreader89"}, {"rating": 5.0, "review": "Love it! There are new things added everyday. The battery cover on the remote is a little hard to take off, but I just love that I can access all my favorite video sites", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Love this! Now I finally have a Smart TV!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth B. Regan"}, {"rating": 5.0, "review": "Love it, Love it, love it. I have beenv recomending it to all my friends.It turns my tv into a smart tv. I saved $150 by letting my smart tv go back.  And my cable bill was $133 a month....now I only have internet for $64 a month...saved almost $70. The apps are endless.  Smart Tv has a few apps....The Amazon Fire Stick....has game apps and an endless amount of movie apps and music apps.I ca watch YouTube on my cell and transfer it to my TV with the Fire Stick.  Thanks Amazon! !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Cassandra Pegues"}, {"rating": 5.0, "review": "This was a gift for my hubby's birthday.  He was pleasantly surprised and it has been a wonderful addition to our entertainment world.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little device is amazing.  I also have the Amazon Fire TV box on a different TV but this little dongle gives me most of the function of that box for much less $$$.  No, it doesn't have voice search but I rarely use that.  I like how the remote buttons are otherwise the same.  Batteries last plenty long enough in these remotes too.I'd read that the Roku was a better choice, and I was also tempted by Apple TV, but I use mostly Netflix and the Amazon ecosystem so the Fire TV Stick was the right choice for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as well as apple tv for a third of the price.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Wonderful!!!!!", "verified": true, "helpfulness": "0/0", "author": "AnnIam"}, {"rating": 5.0, "review": "I just got this Fire Stick but it has not rested much since it arrived. It was very easy to install and works way faster than my Apple Tv. I'm loving it! Also, I've been using it on my, get this, very old tv. I bought a neat converter here on Amazon and it allowed me to finally watch more than just dvd's (we don't have cable- lol). In case you're like me and have an old tv, the converter I bought is the enKo products Mini Composite HDMI To RCA CVBS AV Converter (Input: HDMI; Output: AV) For VCR DVD 720P 1080P With High-Speed HDMI Cable (6.5 Feet / 2 Meter). It worked great for me!", "verified": true, "helpfulness": "0/0", "author": "Maria Margarita Loyde"}, {"rating": 5.0, "review": "Our family's new favorite interface for accessing digital media.", "verified": true, "helpfulness": "0/0", "author": "Russ Turley"}]