[{"rating": 4.0, "review": "hesitates at times.", "verified": true, "helpfulness": "0/0", "author": "G. Wolf \"like in big bad\""}, {"rating": 2.0, "review": "Sorry Amazon, I really wanted this to be as good as Apple TV, especially with the lower price, but it has been unreliable with connection issues like cutting out during programs. It also does not have the amount of apps I would like to see.  At this point, I would not recommend it. Please keep working on it.  I love Amazon.", "verified": true, "helpfulness": "0/0", "author": "P. Sierra/Phoenix"}, {"rating": 4.0, "review": "if only it can work in Asia, nontheless its a very great product, and im beginning to be a fan of Amazon.Amazon, please come out with more and more devices in the coming future.", "verified": true, "helpfulness": "0/0", "author": "Kelvin Chew"}, {"rating": 5.0, "review": "Add KODI to this and it will be the \"Go To\" travel device.  I take mine everywhere and use it daily.  HIGHLY recommend!!", "verified": true, "helpfulness": "0/0", "author": "TechsMex"}, {"rating": 1.0, "review": "Got this stick recently and up to this day I can't watch five minutes of a TV show or movie. The connection to the WiFi sucks so bad.", "verified": true, "helpfulness": "0/0", "author": "A&V"}, {"rating": 3.0, "review": "my remote stopped working a month after i got it and the app won't connect to it. it was cool up until this point.", "verified": true, "helpfulness": "0/0", "author": "LeAndrea Siller"}, {"rating": 4.0, "review": "We have 2 Roku devices and purchased this for the third tv. I really had high hopes for the Fire Stick and wanted to love it before it even arrived. Compared to the Roku, I like it, but I'm not sure that I love it yet. It doesn't have the voice remote included and the app that is supposed to let you speak to the Fire Stick doesn't work properly. The app selection is more limited than the Roku. We frequently use Vudu and that's not even available on the Fire Stick. That said, there is a decent selection of apps, however, the ones I downloaded - A&E; and History channel both only had clips of shows, no actual full episodes were available to watch. I was kind of disappointed with that, but for a $25 streaming device, it is serving its purpose. We subscribe to only subscribe to Prime, so I guess we will be limited to just watching that. Conclusion: I'm not sure I'd buy another one, and I definitely don't think it is worth full price.", "verified": true, "helpfulness": "0/0", "author": "Dj121"}, {"rating": 5.0, "review": "Love it!Great device.", "verified": true, "helpfulness": "0/0", "author": "JBouts \"JBouts\""}, {"rating": 3.0, "review": "Has some connectivity issues at times.  Easy to use when connected and provides a good amount of choices.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Love it!!!! Great menu options, lots of choices, easy to use. Love the resume option, when you get interrupted it's nice to join your show where you left off. Has all my favorite shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Kc"}]