[{"rating": 1.0, "review": "Wont get past \"connect to network\" no networks are showing up hidden or not... And the stick gets super hot. Fire Stick indeed. I'll try my second one tomorrow.", "verified": true, "helpfulness": "3/9", "author": "Ramathor Bangsalot \"I rate things\""}, {"rating": 5.0, "review": "great device to play netflix and other usual online streaming content. super useful when you sideload tvmc or Kodi versions of xbmc. never ending possiblities ...all for 19 dollars i paid for fire stick. Awesome .", "verified": true, "helpfulness": "3/4", "author": "John Q"}, {"rating": 1.0, "review": "Amazon fireTV stick is a real disappointment. It is released more than a year after chromecast and is even not better than the apps on my three years old smart tv and does not provide any additional useful features to my TV. There is no way to control it through your laptop, there is no way to stream any contents from your computer, there is no way to browse the internet, there is no way to mirror your computer screen on the television. To control it and work with it, you should use the provided remote control which just takes a lot of time to enter a simple title (yes, using only arrows on the remote you should enter \"It is always sunny in Philadelphia\"!!). Amazon claims that they have an android app to fix it but there is no IOS app and no way to control it through the computer. It is truly a big disappointment. I bought it through the special offer (19$) for the prime members but even that does not worth it.", "verified": true, "helpfulness": "1/16", "author": "BruceT"}, {"rating": 1.0, "review": "It's not working, my tv can't recognize it, but it shows up in my remote app, which means it's connected to Wi-Fi. The support guy made me unplug and plug again for hours, they also don't know what the problem is. Came here to see few others havng same issues, so I am not the only one. Hope they fix it, or send me a new one asap....", "verified": true, "helpfulness": "4/10", "author": "vsarda \"vishnu\""}, {"rating": 3.0, "review": "Have been using it for two days now, and the stick seems to work well.  The initial updating process took about 5 to 10 minutes.  Menu layout is very linear, so navigation isn't quite as easy as a Roku, but is fairly intuitive (I have no previous Fire TV experience).  Control via Fire TV app for Android is very convenient, and flinging apps from phone to screen is simple enough.Complaints so far:-I was watching a Netflix video but sent a YouTube video to my screen to watch.  No immediately obvious way to switch directly back to Netflix without going back to homescreen, re-entering the app, selecting account, and continuing playback.  Using the back button on the remote only takes me back to the YouTube \"What to Watch\" menu.-The screen-mirroring option is buried in settings and doesn't seem to work with my Samsung Galaxy S5.  It would be nice for this to be more upfront and functional.I'll keep an eye on system updates to see how things progress.", "verified": true, "helpfulness": "2/4", "author": "Reviewer"}, {"rating": 1.0, "review": "This product is not working on my Sharp tv (model LC-26SB24U).  The initial amazon screen appears then goes away as if the device were disconnected. My chromecast works just fine in the same HDMI port which shows that it is a problem with the fire stick, and not my TV.I was able to get it working on a friend's Sony TV (I don't have the model number) and it's actually pretty nice.  However, if they don't fix the compatibility issue, I will have to return it.  I would rate the product at least 4 stars if there wasn't compatibility issues.", "verified": true, "helpfulness": "2/4", "author": "Scott"}, {"rating": 5.0, "review": "Loving my stick!  Very easy to set up and use. Got it with the special $19.99 and my only regret is that I didn't take full advantage and bought two.", "verified": true, "helpfulness": "1/2", "author": "L. Komidar \"Lisa\""}, {"rating": 1.0, "review": "I really wanted to like this. But I can't even get it to work. Either it can't connect to my wifi, which I get a 30 Mbps so it should connect. Or if I can get it to connect the screen turns a bright green and flips. We are giving it one more day of trying to troubleshoot and then if no success it will be returned.", "verified": true, "helpfulness": "13/21", "author": "Kelly"}, {"rating": 2.0, "review": "If only it would update. WTF out of the box it needs an update and won't work I have two and I wish I could see how well it works ;(", "verified": true, "helpfulness": "3/6", "author": "Thomas J Meehan"}, {"rating": 1.0, "review": "Disappointed with what this device all about. I thought it will beat the chromecast and ordered couple one for friend and myself. It is leased 14 months after chromecast and feel like old technology. The only good thing it is different from Chromecast is that you can watch amazon instant old movies you have watched when you where in little only if you are prime member.Pros: This device make me thankful and appreciate chromecast.Cons: 1: You have to log in to your subscriptions on the fireTv Stick (Stink/stuck).  2: Only powers up from wall power adapter - chromecast from my TV usb port  3: I paid half but if you are getting at full price, the cost is 4 times than it should be.  4: Logging into your subscriptions on the fire TV STINK is not fun. For chromcast you log in on your tablet/smart phone/ computer and just throw to your TV.  5: The doggle is long stick out on the side of TV.I don't know if I need for it since I don't watch prime videos anyhow.", "verified": true, "helpfulness": "0/12", "author": "Abba Firaa"}]