[{"rating": 5.0, "review": "It was easy to install and we have enjoyed watching several movies.", "verified": true, "helpfulness": "0/0", "author": "Debra Piscura"}, {"rating": 5.0, "review": "We have a chromecast and fire stick and much prefer the fire stick!  The ability to be a standalone device with a separate remote and not rely on a mobile device like chromecast is much better for our house of multi-taskers where everyone is on their phones while watching netflix, wherein you need to swap back to the netflix app to pause or change the selection.  As someone who also recommends tech to my parents who are in their 60s, I think a device like the fire stick would be much more intuitive for those used to operating a TV with a traditional remote.  Furthermore, through the youtube app on fire stick, you can still search for videos through your mobile device and mirror them on the screen.  To me, amazon got everything right with this one.", "verified": true, "helpfulness": "0/0", "author": "llalib \"laura\""}, {"rating": 5.0, "review": "I love the firestick and really wish I had bought 2 or 3.  The ease of installing could only be improved if I had a keyboard to sign into netflix, etc.!!  Luckily you should only have to do it once, ideally!  It does lock up on occasion but I truly am not surprised, I simply unplug and restart.  It is a bit frustrating and not sure if it's attributed to unit or my wifi.  Overrall the best option to stream your Amazon instant video and Netflix.  I bought it to use in my kitchen because the option to get cable in there would be too much.  This is my compromise.  I love it.", "verified": true, "helpfulness": "0/0", "author": "VAwife"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Katrina Klonowski"}, {"rating": 4.0, "review": "Its good but I really dislike how it places paid content with content included in my plan together. Performance wise its good, I doesn't feel faster than my Roku 3 but it offers a lot more options that the Roku can not.", "verified": true, "helpfulness": "0/0", "author": "Port"}, {"rating": 5.0, "review": "Amazing. Works like a champ.", "verified": true, "helpfulness": "0/0", "author": "Dan Craver"}, {"rating": 5.0, "review": "Although I've been an avid fan of Roku for some time now, the Fire TV Stick may have been just enough to persuade me otherwise. I'd bought one of these during their promotional event, so the $20 investment for a spare TV in our household has since been worth every penny. The design and overall customer experience built into the Fire TV Stick menus are great. It allows for you to easily access Amazon Prime, Netflix, and Hulu content quickly and effectively. Load time is minimal and the streaming service has been great. We'll be buying another soon!", "verified": true, "helpfulness": "0/0", "author": "Clayton Peacock"}, {"rating": 3.0, "review": "When it works it is great. Has some conncectivity and buffering problems.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "Super easy to use! We no longer watch regular TV, as this has taken over our world!", "verified": true, "helpfulness": "0/0", "author": "Jared Rosenkranz"}, {"rating": 5.0, "review": "Great Seller !!", "verified": true, "helpfulness": "0/0", "author": "Chris Bartolomeo"}]