[{"rating": 4.0, "review": "Perfect for on the go, tv/movie intake.", "verified": true, "helpfulness": "0/0", "author": "419_Girl"}, {"rating": 5.0, "review": "Love it! Second purchased - Good by Directv!", "verified": true, "helpfulness": "0/0", "author": "gardengirl"}, {"rating": 5.0, "review": "Great interface and super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael N"}, {"rating": 5.0, "review": "We are enjoying the Fire TV stick. It was a gift. It was easy to learn how to use it. Along with our Prime membership with Amazon, we are enjoying movies and TV programs whenever we want to.", "verified": true, "helpfulness": "0/0", "author": "Jean L. \"Senior\""}, {"rating": 5.0, "review": "It works great.  Plugged it in and it was ready to go.  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Ryan Dantin"}, {"rating": 5.0, "review": "Absolutely love this device! Haven't stopped using it since it arrived!", "verified": true, "helpfulness": "0/0", "author": "S."}, {"rating": 4.0, "review": "Seems to be okay. The menu button on the remote doesn't work, but they are sending out a replacement. If I am able to turn it off with the remote it will be good. Currently, I have to unplug each time I want to turn it off.", "verified": true, "helpfulness": "0/0", "author": "tami pankey"}, {"rating": 5.0, "review": "If you're looking for a streaming solution this is the best entry level option. After purchasing the ChromeCast I quickly became annoyed with having to stream from a device (computer/phone/tablet). The Fire TV Stick has the apps locally so no need for a separate device. Also with this you get 30 days free of prime which has lots of movies and shows you've actually heard of.This is the product to get if you're debating the two.", "verified": true, "helpfulness": "0/0", "author": "R. P."}, {"rating": 5.0, "review": "Good job amazon kerp it up", "verified": true, "helpfulness": "0/0", "author": "I would like retract my last review on the ravpower it was because of all the hacking 100% great"}, {"rating": 2.0, "review": "PLEX runs really laggy on this device and that's the only reason I bought it for. The PLEX app needed some serious update to fix this issue.Tried all the possible settings I googled to make it work better but it still did not make any difference. I'm sticking with my Chromecast for now until they fix the stuttering on PLEX-Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Joel Advincula"}]