[{"rating": 4.0, "review": "This is the second fire stick I have bought and I have been extremely pleased with them.  Easy to install and operate, looking forward to the HBO Go app.", "verified": true, "helpfulness": "0/0", "author": "Ronald Bailey"}, {"rating": 5.0, "review": "love having this to use to watch all my amazon shows!", "verified": true, "helpfulness": "0/0", "author": "bananna"}, {"rating": 5.0, "review": "Excellent couldn't ask or want anything more. Everyone should have.", "verified": true, "helpfulness": "0/0", "author": "Lettie Reinholtz"}, {"rating": 4.0, "review": "Amazingly easy to install and set up. Short tutorial video follows installation making navigation simple. Have had some trouble with movies stopping part-way through; then have to turn the device completely off to reset it. Following that I am able to turn it on again, find the movie I was watching and restart it right where it stopped. Not sure if it is the device or the streaming service or my ISP. Not having had the problem before, I tend to blame the Fire Stick. But since all the other devices I use to watch movies are hard-wired, it's hard to be sure. Would I buy it again? You bet.", "verified": true, "helpfulness": "0/0", "author": "Melanie Calder"}, {"rating": 5.0, "review": "Got this as a Christmas gift from my son who considers me \"electronically challenged'.  It works great -- no longer have to switch remotes or hook up my Kindle HD Fire to the TV.  I can watch everything from our regular channels, plus Amazon Prime and Netflix by using one remote.", "verified": true, "helpfulness": "0/0", "author": "Annie B."}, {"rating": 5.0, "review": "Great device!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Bought a pair at introductory price. Hookup was simple and straightforward. Having trouble with the unit overheating, then losing wifi connection and  then rebooting itself. Hopefully for the rest of the users this would be limited to the initial run and I just got some duds.In general, content is another issue, but I hope that will work itself out soon. I have Prime and Netflix but there never seems to be much else to watch. Maybe a change of mindset and developing market of cord cutters will solve that problem in the not too distant future. I understand the need for commercials, but the SAME commercial 8 times in a half hour is a bit much. Luckily, my Fire Stick reboots every 10 minutes so don't have to suffer through all 8 commercial breaks. I usually get fed up with it and turn it off before the half hour is up.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far so good . Easy set up as told and able to view movies right away. Wish i had bought two for our other tv also.", "verified": true, "helpfulness": "0/0", "author": "jani davis"}, {"rating": 5.0, "review": "Works as promised", "verified": true, "helpfulness": "0/0", "author": "DRH"}, {"rating": 4.0, "review": "love this!", "verified": true, "helpfulness": "0/0", "author": "Maya Johnson"}]