[{"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "jobeck1"}, {"rating": 4.0, "review": "As of now am happy I was able to get it started . Much easier than chrome cast. Now I'm working on how to stream from my kindle and my iPhone", "verified": true, "helpfulness": "0/0", "author": "Nat"}, {"rating": 5.0, "review": "It is great i gave it to my son as a gift. Now i bought one more for my granddaughter.", "verified": true, "helpfulness": "0/0", "author": "jim weidman"}, {"rating": 5.0, "review": "Worked perfectly, out of the box and streaming in less than 4 minutes!", "verified": true, "helpfulness": "0/0", "author": "houstonfc"}, {"rating": 2.0, "review": "I already had a smart TV that had many of the services available and I don't subscribe to the others.  But it was a gift and so we pluged it in.  I dislike that you have to run a power cord to the stick, more wires and cables to deal with coming off the TV.  You should figure out how to make it truly wireless.", "verified": true, "helpfulness": "0/0", "author": "Wendy Olsen \"Wendy O\""}, {"rating": 5.0, "review": "Waited over a month to get...well worth it!!!", "verified": true, "helpfulness": "0/0", "author": "DMDAVIS"}, {"rating": 5.0, "review": "I LOVE THIS! Fantastic product. It was super easy to set up and now I can watch all my Prime videos, as well as Netflix and others. If you don't have a TV that already came with access to all that already, this is ideal. No more long HDMI cable running from me laptop to the TV.I was also able to download the remote app for my Android. It works great as well.", "verified": true, "helpfulness": "0/0", "author": "DQTX \"“Humanity is a parade of fools, and I am at the front of it, twirling a baton.”  ― Dean Koontz\""}, {"rating": 2.0, "review": "I have had the Amazon Fire Stick for a few months now.  Other than having to re-log onto Netflix a few times, no problems. Until now. I recently installed the iheart radio app.  The device automatically registered and activated my device using SOMEONE ELSE'S email address.  I have no idea whose email it was.  Amazon tells me it is not a returned or refurbished model.  I was told that perhaps the email address and account I had access to belonged to somebody I have previously shipped items to.  So, because this person has an existing iheart radio account and I sent them an item, I was able to log on to an app automatically AS THEM.  Seems like a major security/privacy issue that should be handled ASAP.****UPDATE****  Received an email from Amazon customer service it states in part; \" I've researched 'iheart radio' and found that it isn't available for the Fire TV Stick at this time.... 'iheart radio' is only available on Amazon Fire TV\"  May have been a bot response but it is inaccurate and unhelpful.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "barb"}, {"rating": 5.0, "review": "More than Chromecast. Better.  I just thought it would be similar.  Have to have the service (IE Netflix, etc) to see.  Other things, Music(I Heart Radio), Games.  All on screen with remote.  No need for a tablet, or laptop to start process, then go to the TV.", "verified": true, "helpfulness": "0/0", "author": "Gardensaurus"}]