[{"rating": 5.0, "review": "I love that fact that you watch a whole lot of movies and tv shows and I can take it with me", "verified": true, "helpfulness": "0/0", "author": "Jewel Shufford"}, {"rating": 5.0, "review": "I love my new Amazon Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Jonna  lamb"}, {"rating": 5.0, "review": "Love this so much we purchased two --- one for each room", "verified": true, "helpfulness": "0/0", "author": "jeff willer"}, {"rating": 3.0, "review": "We've had Roku for a few months and wanted to buy something else for another TV that was cheaper. We used this Amazon stick for a couple days then sent it back. It was far more complicated than the Roku. Also, because it is a stick it is constantly loading. I guess we are just loyal to the Roku 3. It may be a great buy for someone else just not us. The return was painless and free.", "verified": true, "helpfulness": "0/0", "author": "Pint size mama."}, {"rating": 1.0, "review": "Horrible", "verified": true, "helpfulness": "0/1", "author": "Todd Canonica"}, {"rating": 4.0, "review": "Not quite as fast as the mainline FireTV, but you wouldn't expect it to be.  Works great for what it is though, and is super portable.", "verified": true, "helpfulness": "0/0", "author": "Sharon Barber"}, {"rating": 1.0, "review": "this is the second one. you sent me. It sucks. I does not work. it is defective. You sent me a second one. It is also defective. p.s. thanks for outsourcing jobs", "verified": true, "helpfulness": "1/2", "author": "smith"}, {"rating": 5.0, "review": "works fine.  easily used. Gives PRIME members lots of movies and TV series to watch free.  Music, and much other things.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Herbalist \"healthy driven\""}, {"rating": 5.0, "review": "Love the Amazon Fire Stick if you are deciding between the Chrome Cast and this, the Amazon Fire stick is the better buy. You are provided with a remote to control it and are able to use it from your cell phone. Great Purchase", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Great Product! the remote is a little difficult to get the battery cover off but so far that is my only complaint. I love that I can change what tv it goes to and that I can set parental controls.", "verified": true, "helpfulness": "0/0", "author": "Anika"}]