[{"rating": 4.0, "review": "The device is very good, it's fast and powerful for such a small device. It's definitely better that google chromecast. And more powerful than Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Ninjas"}, {"rating": 5.0, "review": "I have used many devices like this and being able to mirror devices to the firestick plus it searching all attached services when I am looking for something specific is very nice. I liked it so much I bought two. Occasionally on long use the video would begin to break up some. Just unplug it for 10-15 minutes and it should begin working like a champ again.", "verified": true, "helpfulness": "0/0", "author": "P. Ryan"}, {"rating": 5.0, "review": "Ease of use,very fast.opens a new way of TV entertaining and conveniences for me.The best way to turn you TV with HDMI ports into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "H Q Pham \"Tech enthusiastic\""}, {"rating": 5.0, "review": "Nice streaming device, clear picture.", "verified": true, "helpfulness": "0/0", "author": "Jacob Tubbs"}, {"rating": 5.0, "review": "Good deal", "verified": true, "helpfulness": "0/0", "author": "Dante"}, {"rating": 5.0, "review": "Works as advertised. Kodi runs great. great wireless connection. easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE MY AMAZON FIRESTICK!", "verified": true, "helpfulness": "0/0", "author": "G. Allen \"dragonfly\""}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Dawn Horrighs \"mamad\""}, {"rating": 2.0, "review": "An update on my Amazon Firestick. I was happy with it in the beginning, set up with no problem, connected to my internet instantly.Now I am constantly getting the message \"Home is Currently Unavailable\"  Go to network settings. When I check my network it shows signal strength \"Very Good\" and that I'm connected. So why am I losing the shows I'm watching, what does it mean that Home is unavailable? I have unplugged the Firestick, I am using the adapter, this is getting very frustrating.", "verified": true, "helpfulness": "0/0", "author": "infoplease"}, {"rating": 5.0, "review": "So easy to use---it works perfectly for my daughter", "verified": true, "helpfulness": "0/0", "author": "donald  autin"}]