[{"rating": 5.0, "review": "Works great, nice price. Want to get another one for different TV.  Really liking Amazon products. Love my fire tablet and now my fire stick.", "verified": true, "helpfulness": "0/0", "author": "American Mom"}, {"rating": 4.0, "review": "Two thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Ed Dolormente"}, {"rating": 1.0, "review": "Don't waste your money. Have had the fire stick for 2 days now and been on phone w Amazon tech support countless times to get it it work. Can't even get through the registration process . Won't accept my password. Instead of sending  us another one. I have to wait at least two days for some engineers to try to figure out the problem. Not good Amazon", "verified": false, "helpfulness": "3/3", "author": "Joyce Newman"}, {"rating": 5.0, "review": "This is our second Amazon Fire Stick we bought this to not have to keep moving our other, we love all the options with little bitty thing and the fact that its portable!!!", "verified": true, "helpfulness": "0/0", "author": "Dye4LeggedBabies"}, {"rating": 3.0, "review": "Bought for my daughter and is hard to use. No directions included. Difficult to operate", "verified": true, "helpfulness": "0/0", "author": "Pamela Guinther"}, {"rating": 5.0, "review": "Bought this on Prime day for an excellent price. Flawless for what I was looking for. I have a Roku player but needed a stick for traveling and this is THE one to get. Now I use it more often than the chromecast at home too.First it connects in hotels where virtually every other non smartphone/computer/tablet would have a problem getting by the splash screen where you have to agree to terms.Second, it will miracast everything with no problem. The Fire Stick has a slingplayer app but it only works with the newer slingboxes. No problem, I can send the slingplayer showing on my device to the TV and watch on the big screen. If at home you may have other ways of doing this wirelessly, but for traveling this is the best option.Third, watching anything from Prime (or playing music) simply works, great picture and again anywhere you have Wifi and a TV.While the Amazon App store may not have a ton of apps for it, in general android apps will work on it. There are apps that will put almost any Android app on the stick, not all may work correctly.", "verified": true, "helpfulness": "0/0", "author": "Tampa8 \"Tampa8\""}, {"rating": 5.0, "review": "Easy to install.  Excellent picture quality on my TV.  Lots of prime choices for viewing.", "verified": true, "helpfulness": "1/1", "author": "Mary A Pattinson"}, {"rating": 2.0, "review": "its slow and constantly pausing to load. I have a smart tv and when I use the apps on the smart tv it is fast are rarely has  to pause so im sure its not my internet connection and that the problem is the fire stick.", "verified": true, "helpfulness": "0/0", "author": "stacey christensen"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "melody sclippa"}, {"rating": 5.0, "review": "Love it , I'm not technology smart so i couldn't believe how easy to use and the verity it offers in entertainment, so glad my son encouraged me to get it", "verified": true, "helpfulness": "0/0", "author": "Corinne fedornak"}]