[{"rating": 5.0, "review": "The fire stick is easy to use.", "verified": true, "helpfulness": "0/0", "author": "sherry stanton"}, {"rating": 5.0, "review": "i haven't used it much but it was easy to install and i brought my netflix account to it besides my prime  so far very happy", "verified": true, "helpfulness": "0/0", "author": "Judith D. Woronka"}, {"rating": 4.0, "review": "Works as described. Lots of app options. My son loves the games. Only draw back that I have seen is that it doesn't have an off option. Overall I would recommend it to anyone looking to branch out into the world of digital shows,and games.", "verified": true, "helpfulness": "0/0", "author": "Jason helson"}, {"rating": 1.0, "review": "The design and quality of the stick looks very cheap. It didn't work with my wireless router. I can't say even if the stick is on or off. They should have a put a small light to indicate if it is on/off .", "verified": true, "helpfulness": "1/2", "author": "PADMANABHAN"}, {"rating": 5.0, "review": "This is great! I had no trouble installing it, and not only do you get Netlix and all the others but you get the Amazon prime. This allows you to watch all the prime time movies that are free with the subscription. We have used it every day since it arrived.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth J. Pucci"}, {"rating": 5.0, "review": "I'm a Prime member, but my TV, Tivo, and DVD player are not on the list for free Prime videos.  This device allows me to take advantage of that benefit at a very nominal cost.  It works very well, beautiful HD video and sound.  It does require an electrical outlet and an HDMI port on your TV.  So, make sure you have one of each available.", "verified": true, "helpfulness": "0/0", "author": "John R. Stummer"}, {"rating": 1.0, "review": "My first purchase broke after 10 days.  Initially, I thought this was the \"cat's pajamas.\"  They get to watch a series, get hooked, then try to charge you to continue the series, even with paying the full price of $99.  Scam!!  Be ware!", "verified": true, "helpfulness": "1/2", "author": "cktude"}, {"rating": 5.0, "review": "Awesome Sauce!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Like the idea and the programs.... remote could be easier to use if it had volumn control.....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The best invention ever. This has made my life easier and saved me money. In a word Fabulous.", "verified": true, "helpfulness": "0/0", "author": "Erin McLaughlin"}]