[{"rating": 4.0, "review": "Great device for the price. I just wish it didnt have to be plugged into an outlet.", "verified": true, "helpfulness": "0/0", "author": "miketmartin"}, {"rating": 4.0, "review": "Does well with Netflix and Flixster.  I use Amazon Prime but only as a trial.  It does sometimes disconnect from the wireless router.  And sometimes it does have to buffer during a movie or show but I will need to adjust the router.  Still, it's better than what I had before.  It has many apps to use but I wish it had a VUDU app.  I'm not liking Amazon Prime and it looks like Amazon makes it apparent that you should use it.  But it is pretty limited in terms of movies.  I also wish it didn't have to be plugged into the wall.  I also like that it works with my kindle fire especially for the voice recognition.  Overall I am happy with it but just wish Amazon Prime wasn't so \"in your face\".", "verified": true, "helpfulness": "0/0", "author": "TRFB"}, {"rating": 5.0, "review": "This was easy to install. I have just begun to use it, but so far I am very impressed. I have ordered some British mystery shows I thought I would have to buy. Now I can just rent them very inexpensively. I was able to find a kid's show for my young grandson when he was here. I know I am going to love having access to so many TV shows and DVDs at such good prices. If I can figure out how to use this, anybody can!", "verified": true, "helpfulness": "0/0", "author": "Carol J. Harman"}, {"rating": 5.0, "review": "Works really well! Lot cheaper than cable. I hope they offer more channels.", "verified": true, "helpfulness": "0/0", "author": "ARK"}, {"rating": 5.0, "review": "Cheap and easy. I like it.", "verified": true, "helpfulness": "0/0", "author": "Schoolboy"}, {"rating": 3.0, "review": "does not have everything that was on my blue ray but better than nothing at all.", "verified": true, "helpfulness": "0/0", "author": "albert l. robinson"}, {"rating": 1.0, "review": "I could not maintain my wifi signal with this device despite being able to do so with other media devices in that area of my home. So it did not work for me.", "verified": false, "helpfulness": "1/1", "author": "Pamela F."}, {"rating": 5.0, "review": "So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Vickie Gallichio"}, {"rating": 5.0, "review": "Easy to set up and use.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Vicki S."}, {"rating": 5.0, "review": "I went ahead and bought Fire TV Stick with the Sling TV bundle. I really like what Fire TV has to offer. The apps and the design are fairly simple to use. It sets up easy and quickly. It does lack and off button and will automatically move to a screen saver mode after prolonged usage.I would recommend Fire TV to cable cutters. It is going to get you Amazon Prime, Netflix and Hulu Plus as long as you have a subscription. Find out if cord cutting is worth it to you. Make sure you have a USB drive on your TV. You also need to be careful if it will stick out far enough. Fortunately it comes with an extension and that it works well with my older model TV.", "verified": true, "helpfulness": "0/0", "author": "MHoss"}]