[{"rating": 5.0, "review": "Awesome. I'm happy with it because I also have experience with Apple TV. This is cheaper and definitely comparably better. Every thing about being a prime member. Free music, videos, books, delivery, cloud and cheaper music compared to iTunes.  Most music has lyrics compared to iTunes. Easy to use and look at the size, much more compact and smaller than Apple TV.  Impressed and very happy.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Great so far", "verified": true, "helpfulness": "0/0", "author": "Matthew James Nowalski"}, {"rating": 5.0, "review": "Easy way to access netflix in our home without having to cast from the phone!", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 2.0, "review": "The fire stick tv has issues. I ordered 2 for different tvs.  Both would lock up or not have internet connection (not at the same time). They are now collecting dust in a cabinet. I switched to Roku Stick and have had no issues since.", "verified": true, "helpfulness": "0/0", "author": "Naomi Newell"}, {"rating": 5.0, "review": "Just perfect, we love it!", "verified": true, "helpfulness": "0/0", "author": "Anne Regh \"just me\""}, {"rating": 5.0, "review": "I can move it easily from one TV to another. I use Plex on the fire stick and it works really good. You do have to have WiFi in your home in order to use it though.", "verified": true, "helpfulness": "0/0", "author": "Rob_Holloman"}, {"rating": 4.0, "review": "I bought this because I now have a small TV in my room but no cable. I do not have Prime only Netflix. Works great for Netflix. I took it out of my bedroom and in the living room. I will be buying another one soon.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 4.0, "review": "So far, so good.  Takes a little coordination, but seems like the best of the bunch.  Have Google's Chromecast, but thought it was a bit complex to use, so received this as a gift and trying it out.  Seems much easier to use.  Will see.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Hines Jr. \"Morobi\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "JennaLeigh"}, {"rating": 2.0, "review": "When I first bought the Amazon Fire TV stick it worked great but it's been a few months now and it seems to be having more and more issues. The menu takes forever to load up and Hulu plus won't even start up sometimes. If it does, it freezes and lags. I've checked my internet connection and it seems fine, I don't know if it's an Amazon update issue or the Fire stick only lasts a few months before it dies.", "verified": true, "helpfulness": "0/0", "author": "Megatron"}]