[{"rating": 2.0, "review": "So disappointed! Bought this s our second \"fire tv\" in our house. We keep the first and origonal in our room and thought this ones lack of cord would be fantastic in the living room. WRONG. It's advertised on tv with no cord, now it never actualy says cordless, that's where they get you. Do ou see a cord when they lug it in on the commercial? Nope. How about in the advertised picture? Nope, not there either. But hey, imagine our surprise when we open the box and BAM a cord. Seems sily that it would be a big deal but now we have this thick ugly black cord hanging from our tv against my very beautiful wall. Whatever amazon...The product itself is subpar. We constantly have to reset it. I'm way too lazy to send it back or it'd be gone.", "verified": true, "helpfulness": "1/3", "author": "Amber"}, {"rating": 2.0, "review": "Really annoying beeps w/lags on video streaming.", "verified": true, "helpfulness": "1/1", "author": "sby"}, {"rating": 4.0, "review": "It's great...", "verified": true, "helpfulness": "0/1", "author": "Bradley Carson"}, {"rating": 5.0, "review": "Thank you", "verified": true, "helpfulness": "0/1", "author": "Martino"}, {"rating": 5.0, "review": "Easy to use and simple setup", "verified": true, "helpfulness": "0/1", "author": "Diana McDaniel"}, {"rating": 5.0, "review": "Best media player stick in the market. I don't know how they do it but Amazon Prime contents plays instantly.A must for Amazon Prime member", "verified": true, "helpfulness": "2/2", "author": "jimbo"}, {"rating": 5.0, "review": "got it at a great price", "verified": true, "helpfulness": "0/0", "author": "filmtexas"}, {"rating": 5.0, "review": "This thing rocks!!! There must be a million things to watch. If you want to cut the cable, you could do it with this and an antenna. I want to but the wife won't let me.", "verified": true, "helpfulness": "1/1", "author": "vwnut"}, {"rating": 1.0, "review": "Absolutely worthless if your network requires a web login. The stick doesn't provide any interface that would allow you to authenticate. It just tries to contact amazon directly,  and because you can't first login to connect to the Internet, it fails.", "verified": true, "helpfulness": "2/3", "author": "WEE"}, {"rating": 3.0, "review": "Just plugged it in today and the jury is still out. While we used Pandora for a bit and are excited about the Prime access on it, it lost it's connection repeatedly today to our wireless router. It also seems limited on apps. HBO Go is coming soon though so that will help. Going to take some additional time with it to really see if it wows but initial impressions are \"meh\". Can't beat the price though!", "verified": true, "helpfulness": "1/1", "author": "Gregory M Eid"}]