[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Schwieet"}, {"rating": 4.0, "review": "I do own Chromecast, Roku and Fire TV Stick. I am satisfied with Chromecast for watching Youtube but could not watch amazon instant movies. That is only reason for me to buy Roku and then this item. My initial experience is that there is no difference between Roku vs Fire stick. They work same and the things that I did not like with Roku also come along with this one. I wouldn't recommend to anyone who already owns Roku streamer.Update 01/02/2015: I got to change the review that I wrote earlier. This tv stick rocks with lots of potential. I installed few 3rd party app and the stick could perform very well. I am changing it to 4 star.", "verified": true, "helpfulness": "2/2", "author": "S. RAJENDRAN"}, {"rating": 5.0, "review": "LOVE THIS PRODUCT!!! We have a TV downstairs that doesn't have cable hook ups so this was perfect!!! Now we can watch any movies through Amazon...TV shows...even music!! And the best thing is there is no subscription cost! Runs off your house WiFi and has a great quality picture. You have to get one...NOW!", "verified": true, "helpfulness": "0/0", "author": "Lana Cripps"}, {"rating": 4.0, "review": "Pretty good use of $20. Dont know about $40.", "verified": true, "helpfulness": "0/0", "author": "john brennan"}, {"rating": 5.0, "review": "I think it is a wonderful thing.  Since owning it, I will be canceling my cable subscription as I will no longer need it.", "verified": true, "helpfulness": "0/0", "author": "Ukulele guy"}, {"rating": 5.0, "review": "Great device,  works in this household with 3 kids and one computer.  However,  the remote does get finicky and the app on your cell moves too slow for gaming", "verified": true, "helpfulness": "0/0", "author": "Paula D."}, {"rating": 4.0, "review": "The only knock to this piece of tech is that the USB power connection has to be in the wall outlet, rather than a TV USB outlet, to get power.", "verified": true, "helpfulness": "0/0", "author": "Gman"}, {"rating": 5.0, "review": "I love Fire Stick, great picture quality. With the remote control, it's the perfect stick", "verified": true, "helpfulness": "0/0", "author": "Angel Castillo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "niceboy718"}, {"rating": 5.0, "review": "Just what I wanted! Very easy to set up and super quick to get to playing what I'd like to see. No waiting time :) And for the price you just can't beat it! Was going to purchase Roku stick before and now that Amazon has their own we just had to try! Way cheaper and amazing quality! Can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Danielle"}]