[{"rating": 5.0, "review": "Absolutely love my Amazon fire stick! I would recommend it to anyone! It's VERY simple to install and came a week earlier then expected!", "verified": true, "helpfulness": "0/0", "author": "Danielle Peterson"}, {"rating": 4.0, "review": "Love It!  Sling TV works with ease. Wish I could access the HBO GO app.  Guess there is a contract issue with Comcast.", "verified": true, "helpfulness": "0/0", "author": "Charles Soules"}, {"rating": 2.0, "review": "While it was easy to set up and use the remote is over simplified. Amazon claims thousands of movies are available but only a few in each category show up. Then there are all of the fees. To beat all, when I tried to register it, it was already in someone else's name so it must have been returned by somebody else and in fact, wasn't new. Not a complete waste of money but not much for the money either.", "verified": true, "helpfulness": "1/1", "author": "D. H."}, {"rating": 5.0, "review": "Easy set up, works better than I expecter", "verified": true, "helpfulness": "0/0", "author": "Ken Conaway"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "A. Taylor \"Angel\""}, {"rating": 4.0, "review": "I got this because I have a Kindle fire tablet and wanted to mirror it on my big screen...haven't had any issues yet.  :)", "verified": true, "helpfulness": "0/0", "author": "Bryan Stahl"}, {"rating": 5.0, "review": "Amazing, love it. Just wish i could root it.", "verified": true, "helpfulness": "0/0", "author": "Nicholas W. Reyes \"Nick\""}, {"rating": 5.0, "review": "Awesome product. Love how easy it is to set up and use!", "verified": true, "helpfulness": "0/0", "author": "oddrey"}, {"rating": 3.0, "review": "I loved it at first but it won't stop pausing and skipping during netflix and hulu shows. It's very frustrating when your trying to watch a show and it keeps skipping every 2 minutes! If those could get fixed I would rate it 5 stars!", "verified": true, "helpfulness": "0/0", "author": "michaela miller"}, {"rating": 3.0, "review": "Good start. Needs memory (rom) upgrade, but is still tolerable.", "verified": true, "helpfulness": "0/0", "author": "Robert Maxwell"}]