[{"rating": 5.0, "review": "Haven't had a chance to use it much but so far so good. Very easy to set up and easy to navigate through the menu. Anxious to use it inn my rv when \"camping\".", "verified": true, "helpfulness": "0/0", "author": "Bob Kesler"}, {"rating": 5.0, "review": "Pretty dang cool", "verified": true, "helpfulness": "0/0", "author": "cde"}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Susan Cutler"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Loc Hoang"}, {"rating": 5.0, "review": "I love it ! Works great !", "verified": true, "helpfulness": "0/0", "author": "Mamaw of 10"}, {"rating": 5.0, "review": "It's  good", "verified": true, "helpfulness": "0/0", "author": "Trenise Donsereaux"}, {"rating": 3.0, "review": "Yes and no , its easier to navigate than the Apple TV which I also have but not as much free content", "verified": true, "helpfulness": "0/0", "author": "Margaret W Jacobson"}, {"rating": 5.0, "review": "We love this product", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "Wow, the Fire TV Stick is really a great product.  I wish I had known about it before I purchased my Roku 3 Stick.  Here I thought the Fire Stick would only stream Amazon content, or maybe mirror Fire tablets.  Boy was I wrong.  It has a huge app store, just like Roku.  For me it even has apps that my Roku does not.  I must say that it is superior in almost every way really.  Much faster to navigate menus for one!  I cannot comment on games, as I do not intend to use either device for them.  The only minor drawback of the Amazon Fire Stick is that it really needs an AC power source.  Neither one of my TV's has the necessary amperage on their USB ports to power the unit.  The Fire Stick gives a warning when I attempt to do that.  I assume this is a by product of the fact that the Fire Stick has a 2 core processor, which the Roku does not.", "verified": true, "helpfulness": "0/0", "author": "George L."}, {"rating": 5.0, "review": "Excellent purchase.  I'm sorry I waited so long to get this.  There is so much available for viewing or listening to (via the Music) that I've reduced by cable services and may end up reducing them even more. It's really cool that you can download the Amazon Fire TV app and use your smart phone as the remote with voice capability. I highly recommend this particularly if you are an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "J. K. Bennett"}]