[{"rating": 5.0, "review": "The Fire TV Stick is Awesome!  I bought it just for SLING TV (Since most Smart TVs don't decode it).  The presentation of the apps and the speed of scrolling is amazing.  I just purchased a 2nd stick for my bedroom!  I highly recommend the Fire TV Stick to everyone!", "verified": true, "helpfulness": "0/0", "author": "MOPC"}, {"rating": 5.0, "review": "I have the fire TV and the fire stick both are incredible!  The portability of this is awesome!", "verified": true, "helpfulness": "0/0", "author": "M. Braun \"My 3 Sons\""}, {"rating": 5.0, "review": "Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "jg \"JG\""}, {"rating": 5.0, "review": "No complaints so far. I've only had the stick for two weeks.  Easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Melissa Wilson"}, {"rating": 4.0, "review": "Need a web browser to get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jon B. Olson"}, {"rating": 4.0, "review": "Works perfect. Easy intall.very cheap good choice", "verified": true, "helpfulness": "0/0", "author": "Luiz"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Guy"}, {"rating": 5.0, "review": "I replaced a Chromecast so I could get Prime videos and the remote control.", "verified": true, "helpfulness": "0/0", "author": "C. Carey"}, {"rating": 5.0, "review": "I have been a rough owner for years. Recently decided to purchase the Fire TV stuck since one of my rokus broke down. The stick was on sale for $34 so I said to myself \"what's the worst that can happen?, it don't work\"Well I've had it for about 3 weeks now and love it. The Fire Stick is similar to the rokus, but with better performance. Since using the Fire Stick I have NOT experienced any lag or frame freezing, the quality of video output is 1080p I and it's the size of a small memory stick. I give it an A+. The only minor dislike is that it has to be plugged into power outlet, but not a big issue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Marsha Cavin"}]