[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Frost1995"}, {"rating": 4.0, "review": "This is a very good economical way to get Amazon prime on a non-primary TV.  It only works with wireless, so be sure that you have a strong internet.  I had weak internet for my TV and so I got a wireless extender:  Edimax EW-7438RPn V2 300Mbps 802.11/b/g/n Universal Wi-Fi Range Extender, Repeater here on Amazon and it fixed my problem.", "verified": true, "helpfulness": "0/0", "author": "Bakit"}, {"rating": 5.0, "review": "I preordered this as soon as I saw it posted.  Couple this with your Amazon Prime membership and you've got yourself a deal.  Plus, since Netflix cancelled Top Gear, I'll just save the $7.99 a month and stream from Prime.  I got this half off and will save $8 a month.  Win/Win situation.Quality was top notch.  The included power cable and adapter were plenty long enough to hook up. No complaints here.", "verified": true, "helpfulness": "0/0", "author": "Bobby Sutton"}, {"rating": 5.0, "review": "super easy to set up, tons of \"free\" programming with a Prime membership, and with the included \"extender\" the power cable on the side should be less of a problem for any tv.", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "Cheap way to stream  better than most others ive tried  fast and great picture quality  I have 3 in my home right now  and IM AN APPLE GUY!!!!", "verified": true, "helpfulness": "0/0", "author": "Ryan N. Cox \"xocnayr\""}, {"rating": 5.0, "review": "How easy can something be? The Fire stick is awesome", "verified": true, "helpfulness": "0/0", "author": "Dirk D."}, {"rating": 5.0, "review": "Our family owns 2 Roku players. When I saw the Amazon Fire Stick on sale over the holidays, it was too good of a deal to pass up. We are an AMAZON family and own several Kindles, so I knew that this would integrate well. We were not disappointed! It does everything our ROKU players do, but in a more 'user friendly' format. I like the graphics more and the ease of just plugging the stick into the back of the TV. No wires to deal with. What we love most, is that we can take the small Fire Stick with us on vacations and visiting friends. We have loved using this in hotels during our travels. It pairs up great with my Kindle Fire HDX and allows me to switch from my Kindle to the TV. The Android App for the Fire Stick is AMAZING! I can't believe how quick it works!  All in all, we are VERY pleased with our purchase.", "verified": true, "helpfulness": "0/0", "author": "JLC"}, {"rating": 5.0, "review": "Obsessed.", "verified": true, "helpfulness": "0/0", "author": "aander7"}, {"rating": 3.0, "review": "I would have given this 5 stars if it had HBO Go.  Now I have to also buy another medium to be able to have that also.", "verified": true, "helpfulness": "0/0", "author": "J.C."}, {"rating": 5.0, "review": "Easy to install and operate.  Fantastic to be able to access Netflix and Amazon Prime Instant Video without having to purchase a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Dr. Barbee Myers-Oakes"}]