[{"rating": 4.0, "review": "I wasn''t sure what to expect with something that costs less then 40 dollars but was amazed with the speed and ease that it worked with. It should be known that I have, a Sony blue ray player with smart tv as well as a Samsung smart tv and both Playstation3 and a Playstation4 and the Fire Stick out preformed both with loading speed and playback. I also tried the App for the Fire Stick on my phone and it worked as well with voice control on Amazon Prime. I have used it to play some of the games and have not had any complaints on that aspect either. The one thing I have noticed (and this doesn't happen often or with the other units) is that the picture freezes up for a second while the sound continues but then speeds up to the sound.( which is the reason I didn't give it 5 stars) All in all a great product for the money.", "verified": true, "helpfulness": "0/0", "author": "deadwood"}, {"rating": 5.0, "review": "My Amazon Prime !!!!!!", "verified": true, "helpfulness": "0/0", "author": "orlandotaz"}, {"rating": 3.0, "review": "I LOVE my Firestick. It's easy to use, has so much great content and you can use it on any tv anywhere. The 3 stars is tied with the remote. I've only had my firestick for a few months and the remote has already stopped working...what a disappointment. At first I thought it needed batteries but even after putting in new ones, it's not responsive. Other than that, the product was amazing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It has a good connection work well when watching movies or shows. The remote is very convenient for pause play and selection. I use to watch most of my hulu shows on my ps3 but have switched to the stick instead. It will play movies with a steady stream and load fairly quickly. I like the system overall and it is easy to take to another house and connect and play movies, music, or shows. I also have a chrome cast. I can't say at this point that I would substitute one for the other just yet. I like the ability to cast a larger amount of programs to chrome. A third party program has to be used with Amazon. Makes it a little inconvenient.", "verified": true, "helpfulness": "0/0", "author": "Jay McDaniel"}, {"rating": 5.0, "review": "The  units  work  extremely  well,  simple  1 2 3 installation.  QWuick  response  time  on  selections  smooth  picture  streams.", "verified": true, "helpfulness": "0/0", "author": "Joseph E."}, {"rating": 4.0, "review": "My son set it up, so I don't know how I would have done myself.  I didn't see any instructions. The remote is very small, & fairly easy to use. The system did go down one time saying something about my Internet connection being down, which it wasn't. Overall I've been pleased with programs, but definitely disappointed in the filthy language on HBO. It's like they invented the \"F\" word, & use it as much as possible.  One example is \"Veep\"- such a clever show & Julia Louis Dreyfus is a superior comic actress. But the ridiculous,  constantly vulgar dialogue is so off putting & unrealistic (Do intelligent Americans constantly talk such gutter trash?) I rarely am around people who use so much of this extremely profane language. Even though this is mainly about HBO programming,  it does reflect somewhat on Amazon. Of course there are some beautiful, well done shows such as Downton Abbey that I could watch with my grandmother, so  I'm glad to have that programming available- there just doesn't seem to be a lot thus far...", "verified": true, "helpfulness": "0/0", "author": "Tawna"}, {"rating": 3.0, "review": "It's great except when you try to watch something on Netflix (I don't have a smart tv). The program pauses every few seconds then speeds up to catch up. Annoying enough we had to turn the show off. Sadly it's one of the reasons we purchased it.", "verified": true, "helpfulness": "0/0", "author": "HK"}, {"rating": 5.0, "review": "Very Good!", "verified": true, "helpfulness": "0/0", "author": "moonbaelee"}, {"rating": 5.0, "review": "I love it! So easy to install and use. Enjoying it daily.", "verified": true, "helpfulness": "0/0", "author": "Ymkje"}, {"rating": 5.0, "review": "It works woderfully", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]