[{"rating": 5.0, "review": "Easy to install, nice tutorial to get you started. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daisy"}, {"rating": 5.0, "review": "Worked very well for me.  The less technical family members found it much easier to use than the internet access features built in to our Blue Ray player.  Its also much faster and doesn't suffer from the occasional glitches that the BR player seems to encounter from time to time.", "verified": true, "helpfulness": "0/0", "author": "JK Baker"}, {"rating": 2.0, "review": "Got this  and I want to say I do like it, when it works. First issue I ran into was the remote. After the first couple days, when scrolling with the remote it would \"jump\" or just start going all the way in the direction i was scrolling which made selecting a movie/action pretty difficult. Changed the batteries and that doesn't seem to help. Next issue is the wifi dc/network lag. I self mgmt my wifi and it just has issues with dropping it, and not finding any for a while. A hard power cycle and this seems to fix it. I've done a FR and reupdated and still the same. Could be that I have a dud, as I use to joke and say \"never buy first gen tech, they are always buggy nowadays\" but it seems to be true for this one. The stick itself might just need a firmware update, which Amazon could be working on but as for now,  As far as function, it works great as it says. Have no problem running Netflix, Hulu and Watching Vids on Prime, and Plex even works just fine. I do like it, its just got some issues...", "verified": true, "helpfulness": "0/0", "author": "Michael Serrano"}, {"rating": 3.0, "review": "Will be worth it when HBO GO is added", "verified": true, "helpfulness": "0/0", "author": "ebo213"}, {"rating": 4.0, "review": "Very disappointed that Gary Busey doesn't yell \"wwWOOAHH!\" when it starts up. Otherwise great concept, easy to use. I wish it had internet browsing capabilities (or have I just not figured that out yet?)", "verified": true, "helpfulness": "1/1", "author": "jacquelinenyc"}, {"rating": 5.0, "review": "so simple, now i can watch what i want in the comfort of my bed at nite.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Elaine"}, {"rating": 1.0, "review": "Terrible compared to ROKU stick. I bought this to use on a second TV but the fire stick will not stay connected to the internet and is therefore useless. I tried on 3 different TV's in the house all of which the ROKU stick work great on but the Amazon Fire stick will not hold a connection for more than a few minutes. Constant buffering and pixelated screen. Not worth it even for $19.00 so it's going back.", "verified": true, "helpfulness": "1/1", "author": "A Parent"}, {"rating": 1.0, "review": "I really wanted to like this since I love Amazon and buy virtually everything on this site.  I own this and a chromecast and this doesnt even come close to the quality and consistency of the chromecast.  I connect to both via an HDMI port and the Fire Stick loses the internet connection probably once every five minutes.  When it does connect to the internet it says that it did so with problems.Maybe my equipment is damaged, maybe.  I did send an email but got some 2 page response about i dont know what.  I was too tired to read it all.I have yet to try the roku but if your choices are between a Chromecast and a Firestick dont even think about it twice and go with the Chromecast.  Yes, it is true that with the Fire Stick you can stream amazon shows but what good is it if it cannot connect to the internet on a consistent basis.", "verified": true, "helpfulness": "1/2", "author": "MELISSA CORREA"}, {"rating": 4.0, "review": "I have only had it for a couple of days. But I want people to know that it does work with a 1.5 MB download speed. I was concerned that it would not work with such a slow internet connection, but it does work. It only showed buffering the first time I tried it and then it started to play with no buffering. I am impressed with that. That seems like a very good sign. after I use it for a little while more, I will post an update. But so far so good.", "verified": true, "helpfulness": "0/0", "author": "Steve Ritter"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Scott"}]