[{"rating": 5.0, "review": "Great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "Timothy J Little"}, {"rating": 3.0, "review": "This product is great for viewing Amazon content - especially Amazon Instant Video.  It is pretty good accessing other apps like Pandora and Netflix.  I really like that it has a remote control.On the downside - I wish it supported YouTube video (a big hole) and the layout of the UI is confusing and unorganized.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Moomaw"}, {"rating": 5.0, "review": "Only had it a short while but it was very easy to set up and start using.  No complaints!", "verified": true, "helpfulness": "0/0", "author": "Kirby Konz"}, {"rating": 5.0, "review": "I have been using chromecast for some time and I love it. The fire stick has taken the idea and made some improvements. I'm impressed. Works great with the android fire stick app also.", "verified": true, "helpfulness": "0/0", "author": "Eugene Armstead"}, {"rating": 4.0, "review": "Works Great!!!", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "If you have Amazon Prime and thinking about a Chomecast or Fire Stick.. I have both now and being a Prime member and having the Fire Stick is far better with amount options of things to watch", "verified": true, "helpfulness": "0/0", "author": "Clay Visage"}, {"rating": 5.0, "review": "It works better and is more fun than I could ever imagine!", "verified": true, "helpfulness": "0/0", "author": "L. Steve"}, {"rating": 5.0, "review": "More powerful than the Chromecast and it works with Amazon Prime Video. Easy to setup and use. At the $20 promotion price, you can't go wrong. For $40 I would more carefully weigh my options but I think this would have still been the best price for easy video streaming on the TV. Also the hardware has a lot of potential, if I get the free time to explore. Boots and operates pretty fast.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Grimm \"grimmace\""}, {"rating": 5.0, "review": "Worked right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Bob Nieman"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "DIANE HURST"}]