[{"rating": 5.0, "review": "I love the Fire TV Stick. It is intuitive, and provides a wide array of everything I wanted.  I researched all the streaming devices, read reviews, and could not be happier with my decision unless it also dispensed coffee.", "verified": true, "helpfulness": "0/1", "author": "LadyA"}, {"rating": 5.0, "review": "Item delivered on time, was as described.", "verified": true, "helpfulness": "0/1", "author": "arshaluys abrahamyan"}, {"rating": 4.0, "review": "I love how this brings all the apps to one device and made my non-smart TV more up to date. Quality of the remote is good as well as the other hardware.", "verified": true, "helpfulness": "0/1", "author": "Brian Post"}, {"rating": 5.0, "review": "Much better than Chromecast.", "verified": true, "helpfulness": "0/1", "author": "W. Burton \"Stockholder\""}, {"rating": 3.0, "review": "Owned this since May, it is now broken. Loved it while it worked. It started displaying menu options as if the remote was possessed. Finally it just doesn't connect with the network.", "verified": true, "helpfulness": "1/2", "author": "Rosered"}, {"rating": 5.0, "review": "This is how I watch TV now!  I love it!", "verified": true, "helpfulness": "0/1", "author": "Sherwood Robinson"}, {"rating": 5.0, "review": "I am very happy with this I ordered the streaming box a couple years ago and decided to try this out because I have a smaller space now and don't have anywhere to put the box I love this it's so much easier and faster than the box and takes up no room I have not tryed to take it with me in a trip but am excited to do so I am very happy with this purchase", "verified": true, "helpfulness": "0/1", "author": "A. Canepa \"Nanna2\""}, {"rating": 5.0, "review": "So far it has been awesome! I bought it because I don't have a smart tv and it works just the same and I love it. Being a prime member as well you recieve awesome movies and more.", "verified": true, "helpfulness": "0/1", "author": "Uinse"}, {"rating": 1.0, "review": "When we plugged it in to the TV it made all the colors switch to yellow and green. We tried to adjust the colors, but that did not work.We thought we had wrecked our TV. We looked it up on line and the complaints against Phillips TV s were over 1000 .... A bad TV!Then we disconnected the fire stick... And the TV went back to normal. It was the Fire stick that was bad. Now I do not know what to do with it!", "verified": false, "helpfulness": "1/2", "author": "edward s. kane"}, {"rating": 4.0, "review": "arrived on time easy to use", "verified": true, "helpfulness": "0/1", "author": "msh \"Marilyn S Hahn\""}]