[{"rating": 4.0, "review": "Used the Fire TV Stick to keep up with my YouTube and Netflix videos while renting a vacation house.  Setup was easy.  I was not able to properly sign in to my account on the native You Tube App.  I could only view the standard video suggestions. Sign in just kept asking me to sync with my device and never got to the sign in process for my You Tube account. I downloaded One Tube and was able to sign in and get all my subscriptions and favorites. Netflix worked great as well as Prime Videos and songs.  I will use it at home on my smart TV as it does not have many of the apps installed on the Fire TV stick. Missed the one day sale, but it is still a good value.", "verified": true, "helpfulness": "0/0", "author": "Limitby9"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "Very happy with this product! I bought two one for me and one for my son !", "verified": true, "helpfulness": "0/0", "author": "Renee M Spackman"}, {"rating": 4.0, "review": "The firestick is a great product and worth the $39.99 I paid. The image quality is far more superior than the Apps that come with my smart tv. I have Netflix on my smart TV app but I have decided to watch Netflix through Amazon fire stick because of the crisp, clear image quality. It is also very simple to operate. I had no trouble figuring out the remote or the registration process. I did have some trouble jamming in to firestick into my tv's HDMI port. It definitely took some muscle to get it in. Otherwise, it is an over all very good buy. My brother saw the image quality on my tv and had decided to purchase a fire-stick.", "verified": true, "helpfulness": "0/0", "author": "Mui Ying Kwan"}, {"rating": 3.0, "review": "Easy to use - nothing to watch", "verified": true, "helpfulness": "0/1", "author": "Carol Mullaney"}, {"rating": 5.0, "review": "Absolutely a good deal turns any dumb TV with a HDMI port into a internet TV.", "verified": true, "helpfulness": "0/0", "author": "Douglas Tyarks"}, {"rating": 3.0, "review": "Slow on streaming videos vs our smart TV", "verified": true, "helpfulness": "0/1", "author": "John Allen"}, {"rating": 5.0, "review": "Beat my expectations. It is a bargain at twice the price.", "verified": true, "helpfulness": "0/0", "author": "Douglas Gatchell \"dougg\""}, {"rating": 5.0, "review": "YouTube on the Big Screen!  And, now my husband doesn't have to use my laptop to watch prime movies on the TV.  I haven't gotten the nuances of talking to my phone to control everything, but the basics aren't difficult, and I'm catching on.  My mom got one a week before me and convinced me that I had to have this.  She was right, as usual!", "verified": true, "helpfulness": "0/0", "author": "Karla U \"KMU\""}, {"rating": 5.0, "review": "I absolutely love this . Super easy to use and I have slow internet and still works pretty good !! Gonna cancel my cable !! Between Amazon prime and netflix you have all the tv you need !! Love it !!", "verified": true, "helpfulness": "0/0", "author": "Teisha"}]