[{"rating": 5.0, "review": "What an awesome thing!!! Honestly can't say enough good about it. So worth the especially if you already have or are considering prime. Our whole family loves it. We own 2.", "verified": true, "helpfulness": "0/0", "author": "Brnsbaby"}, {"rating": 5.0, "review": "Excellent product.....", "verified": true, "helpfulness": "0/0", "author": "Manuel R."}, {"rating": 3.0, "review": "I was so excited when I got this little guy in the mail. I immediately plugged it in and got started. The instructional video was cute. I have used streaming devices before, but it's nice to learn what makes the Fire TV stick unique. Evidently, not much. It has most of the channels I typically use (i.e. Hulu Plus, Netflix, Pandora, and, of course, Amazon Prime), and I went through the standard routine of downloading and logging in. I noticed it was not a very intuitive list of apps, requiring me to look through all the lists, which seem comprised mostly of background scenes, like fireplace, fish tank, rainstorm, etc. These have a place and are very nice, when wanted, but considering There is no way to scroll over a screen at a time, I got a bit tired of pushing the over arrow repeatedly through all of them. But I did it, and got all the channels I wanted that were available. I was amazed by the cluster () that was the main screen. It was a mess, with apps all over, and no clear set order, rhyme or reason to the way everything was displayed. This might be fixable in the settings section, but the whole reason for getting the stick was to plug and go.The screen locked up. I waited. It seemed to fix itself after a minute, but every channel I accessed took an inordinate amount of time to load, then would stop and buffer a lot more than I expected, and I was expecting buffering and lag time. I assumed it must be my internet service so ran a speed test 20mbps. Not too bad, so it should run alright. I turned of every other device in the house, and tried again. Slightly better streaming, until I got on my phone. evidently at 20mbps, I can't stream and do anything else. Amazon seems to come through best, but not in some amazingly novel way that makes me recommend Fire TV over any other streaming device.I upgraded my internet, hoping that was the real issue, but even the fastest internet available in my area ( 50mbps) didn't seem to be enough for all the devices I have in my home, and 15mbps had been sufficient previous to connecting the Fire TV Stick. I will play around with it, and see if I can make this worthwhile, but honestly, I wish I had purchased the Roku stick instead. It is possible that the Fire TV Box is better, but I will most likely return this.If this is your first streaming device,or you don't like what you currently have, go for it, It is not horrible and does most of the things you will need to do. However, if you are trying to decide between trying out the Fire TV Stick or buying an additional/ upgrading a device you already have and like, stick with the brand you already like, this is not yet a game changer. I am admittedly biased, as I have been using Roku since it's inception (10 years or so) and have only had the fire stick for a few days. I  had hoped it would instantly convert me due to it's amazing features, and, no.", "verified": true, "helpfulness": "0/0", "author": "merri lecoq"}, {"rating": 5.0, "review": "The only way to Go Wrong is to Not buy one !!  Fire Stick is simply an amazing little device that delivers Huge entertainment access. Very glad to have bought it.", "verified": true, "helpfulness": "0/0", "author": "R Castle \"-- ray\""}, {"rating": 5.0, "review": "It's awesome. Recently cut the cable cord and I'm so glad I did.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Gary L Burdette"}, {"rating": 4.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Joseph Iding"}, {"rating": 5.0, "review": "It's fabulous!!", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "This was easy to install and works great on my WIFI.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Bunno"}, {"rating": 5.0, "review": "I love my fire stik!", "verified": true, "helpfulness": "0/0", "author": "Donna Garrett"}]