[{"rating": 5.0, "review": "It's great.  Way better than Netflix and Hulu put together", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Great product! Pretty fast for such a small and low price device.", "verified": true, "helpfulness": "0/0", "author": "Anderson Moles de Matos"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "l jordan"}, {"rating": 3.0, "review": "Put some movies for free", "verified": false, "helpfulness": "0/1", "author": "Luis Remache"}, {"rating": 4.0, "review": "Might have given it 5 stars, but trying to open the remote to install batteries was way too difficult. I even had to search for help after failing to figure out how to open it. Otherwise, the device works just great, though I have not explored all the options. More instructions also would be helpful, though more can be found online than the meager info that comes with the device. I got it on sale, so it's been well worth the money, though I would have liked to have had Vudu included among the streaming options.", "verified": true, "helpfulness": "0/0", "author": "C. Clines"}, {"rating": 3.0, "review": "Looking to easily type things? Get a Chromecast. This Fire TV Stick toy has an ABCDE keyboard that makes NO sense. No QWERTY in sight.Looking to use it quickly? Get a Chromecast. This Fire TV Stick toy forces you to watch a horribly long tutorial. Our family bought a few, and it took FOREVER to get them all setup because of the psychotic tutorial.Want to get around the obsolete idea of a physical remote and use the app quickly? Get a Chromecast. This Fire TV Stick toy forces you to watch the POINTLESS tutorial. I finally gave up.Want to use the voice search on the app to search YouTube? Get a Chromecast. This Fire TV Stick toy doesn't even search YouTube in the main search. Even then, Fire TV Stick does NOT have native YouTube ! HA!I've gone back to the Chromecast and using my Bluray player for my Amazon Prime TV.When I hear about these design flaws being fixed, then I'll try again. I don't have enough patience to suffer through all that.This is truly an infuriating little toy.", "verified": true, "helpfulness": "0/1", "author": "David Betz \"quantzai\""}, {"rating": 5.0, "review": "Just arrived -- Quick ReviewSetup was the easiest I have found on this type of device.  Just entered the WiFi password and boom.The controls are very intuitive.  The ring for L/R/U/D is a bit clunky but certainly workable.Steaming from Amazon Prime was flawless.I have an Android unit on HDMI 1 that may be more sophisticated.  The tradeoff with that is complexity.  The Fire Stick is just so simple that I really prefer it.  What it does it does as well or better than the fancier device.  For watching movies this device is as good as it gets.", "verified": true, "helpfulness": "0/0", "author": "KenP \"ken-p\""}, {"rating": 5.0, "review": "Easy to use. Better than crome cast because it has a remote. I don't like having to plug into the wall though. Otherwise works great, fast set-up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I'm glad I only paid $20 for this. So far I have had chronic issues with it disconnecting from my network. I've had it less than 2 weeks and I can;t even get through a TV episode on Amazon Prime. I keep hoping for an update to fix it, but there is nothing so far. No, the problem is not with my wireless network. I do this stuff for a living. There is definitely and issue with the wireless adapter or firmware on the Fire Stick.  I mainly got this so I could stream Prime Music on my home theater receiver. My Roku's already get more video content than the Fire Stick does. Works great while connected to the network. Too bad it can't maintain a connection.", "verified": true, "helpfulness": "1/1", "author": "Brad"}, {"rating": 4.0, "review": "I love Amazon's Fire TV I have the $99 FireTV in the den. I purchased the Stick while it was being offered at a really good price.  The reviews of the product say that it has a speaker remote, just like my other one, however, when I got it that is not the case, it has a search function, would prefer the speaker remote, not lazy but have learned how to navigate with the speaker function and it saves time especially when you are looking for something for a 3 year old.I will not be returning this one as the price was too good to pass up or return.  But would appreciate someone correcting their site or replacing my remote.I would recommend FireTV but would also recommend you getting the speaker remote.In response to NEXT's response to my review, he/she/it is correct.  I did overlook two small words at the end of the sentence about \"Voice Search That Actually Works\", since it was highlighted as a Feature I must have \"assumed\" that FireTV Stick had a voice remote, without additional charges.  I was WRONG.  Point, none of the other Features have additional charges, I would still suggest that Amazon clarify that a bit better.A big Thank You to NEXT for pointing this out so kindly. Because of it was my error I have changed my rating to a 4.", "verified": true, "helpfulness": "0/1", "author": "JWilson \"aromalife\""}]