[{"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "1/1", "author": "g.bilas"}, {"rating": 4.0, "review": "Love my Fire TV Stick. Still working on captioning to make it perfect.", "verified": true, "helpfulness": "1/1", "author": "Lora Ann Neill"}, {"rating": 5.0, "review": "So nice and easy to watch Netflix and Amazon, etc. The program is set up to be so user friendly, great for non-techies like me. Best 40 bucks I've spent in a long time!", "verified": true, "helpfulness": "1/1", "author": "T. Chavez"}, {"rating": 3.0, "review": "I have one Viziio smart tv, and one Vizio dumb tv.  I installed the Fire Stick in the latter.  Actually, I'm more pleased with the content provided by the Fire Stick than I am with the content of the smart tv.  Further, for those of us who are  technologically challenged, the set up of the Fire Stick was a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth DeBiasi"}, {"rating": 5.0, "review": "I have only had the Fire Stick for a week but we love it!  I got it for our bedroom tv.  We have a Roku 3 in the living room, which replaced an old blu-ray player we used to stream shows on.  The Roku is great but I would have been better off getting a Fire Stick for in there also since it cost less and the performance and ease of use is the same as far as I can tell.The only issue I have is that our tv is older and only has one HDMI port but I have easy access to the back and can switch it back and forth easily.  Just be aware of that if you have an older tv and want to also use cable at times.", "verified": true, "helpfulness": "0/0", "author": "Ellis E"}, {"rating": 4.0, "review": "Arrived quickly, sometimes gives me connectivity issues which can be annoying. Overall, pleased!", "verified": true, "helpfulness": "0/0", "author": "Amanda Saunders"}, {"rating": 5.0, "review": "I'm loving my new Fire Stick..!", "verified": true, "helpfulness": "0/0", "author": "smilingcatdesigns"}, {"rating": 5.0, "review": "thank you", "verified": true, "helpfulness": "0/0", "author": "hoop"}, {"rating": 5.0, "review": "Loved it! Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "maria garcia"}, {"rating": 5.0, "review": "Very handy and easy to use", "verified": true, "helpfulness": "0/0", "author": "Justin Russell"}]