[{"rating": 1.0, "review": "Returned it for the fire TV. Too slow, and lots of buffering.", "verified": true, "helpfulness": "0/0", "author": "Emily T"}, {"rating": 5.0, "review": "I really enjoy my Fire TV Stick.  learning more about it every day.", "verified": true, "helpfulness": "0/0", "author": "John J Gregory"}, {"rating": 5.0, "review": "I love this product.  Bought this for a second home since I didn't want to drag my Apple TV back and forth.  Very pleased with the ease of set-up and use.  Even my husband can do it (lol).  As they add more apps it gets even better.  Definitely holds down the cost of cable in a second home where I want to watch something fun without paying Comcast a fortune.", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Johnson"}, {"rating": 4.0, "review": "I wanted thd Fire Stick so that my mom could have Netflix in her livingroom and this stick allowed that without having to buy a smart tv or any additional boxes to the cable box. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ashley Brown"}, {"rating": 4.0, "review": "This is a great product. Only complaint i have is when you unplug this from its power source you have to sign back in to some of the apps. For some reason it logs you off. Other than that it's a good product.", "verified": true, "helpfulness": "0/0", "author": "Felix J. Ibarra"}, {"rating": 2.0, "review": "Worked great for exactly 1month and then it started with annoying network issues. Google Firestick +network and find all the others having problems with this device before you purchase. In theory a nice idea, but in practice a disaster. I also have an Apple TV and previously a Roku, both worked much better. Perhaps Firestick still has some growing pains to sort out yet. My advice, wait before you consider purchasing this, especially at full price. I bought mine while it was on presale special so although I'm annoyed, I'm only out $20.", "verified": true, "helpfulness": "0/0", "author": "L. Burger"}, {"rating": 4.0, "review": "Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Marissa"}, {"rating": 2.0, "review": "I pre-ordered two of these (Prime special) and my initial reaction was good. I replaced my older model Roku 2 HD with one of these.  Unfortunately, I gave that Roku 2 to my parents and I just couldn't ask for it back :( .As I said, my initial reaction was good.  I installed the PLEX app, a few games, and Netflix.  They all seem to run pretty good, except if you leave this thing on for more than a couple days.  I constantly have to reboot it to get things to play.  Sometimes NO SOUND. Sometimes NOT FULL SCREEN.  Returning the devices is no longer an option.My 2nd AFTV Stick is in my oldest kid's room.  It also needs rebooted from time to time. (These are both powered with the wall plug.)  She mostly plays games and PLEX on it.I've come to the conclusion that the only things that work really well on the AFTV Stick are Amazon products.  Amazon VOD, Amazon Prime Music, etc.Overall, I would not recommend these to friends/family.  Spend a little more cash and just get a Roku 3. (or something similar).  If you don't mind not having a PHYSICAL remote , get a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "bfb2k"}, {"rating": 4.0, "review": "I am very pleased with the fire stick. I have been having some lag issues but otherwise I like it better than the Google  Chromecast Stick.Hopefully I can figure out the reason for the lag issues.", "verified": true, "helpfulness": "0/0", "author": "J Melendez"}, {"rating": 5.0, "review": "I own several streaming media devices; Roku; Apple TV, Chromecast, and Kindle Fire TV Stick.The FTV Stick is my favorite of the bunch as it has a nice user interface that makes it easy to find free stuff to watch.With the Amazon Prime video bundle it's a pretty good deal. Sure, Amazon doesn't have as big a library as Netflix at the moment, and their streaming music library is smaller than the big ones like Spotify, but both Amazon services are perfectly acceptable.Though all of the afore-mentioned devices are good, for Prime customers, this is probably the best of the bunch. I was fortunate to pick one up for $20 the first few days they were on sale so I am extra happy.", "verified": true, "helpfulness": "1/1", "author": "Matt B."}]