[{"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "Ronald R Schrieber II"}, {"rating": 5.0, "review": "Zipa di dooda. Can't believe how simple plug play and work great. I can't believe I waited so long. Get one today seriously.", "verified": true, "helpfulness": "0/0", "author": "joseph rich"}, {"rating": 5.0, "review": "Amazing! Much faster than Chromecast! Works perfectly with Plex! Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "F. Zamiri \"Persian Prince\""}, {"rating": 5.0, "review": "recently bought this as a bday gift for a friend.  so far, it has gotten rave reviews and they love it.", "verified": true, "helpfulness": "0/0", "author": "Robin Burgos"}, {"rating": 4.0, "review": "I am very disappointed in this item. For starters, I bought it to watch HBOgo on my TV and it is not compatible with my cable provider (Comcast Xfinity) so it is useless to me. Then when I was setting it up, it offered a FREE 30 day Prime trial yet they charged me $99 for membership. Very frustrated right now!EDIT- Amazon refunded me and I've grown to like my Fire TV Stick for Netflix and Youtube. Still one star off for not being able to use it for HBOgo, the main reason I purchased it. I assume this is more of an issue with Comcast and/or HBO, just wish I would have know when buying.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 1.0, "review": "I bought this solely for the purpose of watching Netflix, with which it does not work. All of the ratings I saw for the Fire stick were great, until I actually bought it, plugged it in, and got into my Netflix. There the vast majority of rating were very bad, as people stated that this product is not compatible with Netflix. It took me an hour an a half to watch a 45 minute show because it cannot keep up and is constantly loading. Very disappointed.", "verified": true, "helpfulness": "3/3", "author": "Amber Bucy"}, {"rating": 5.0, "review": "Great deal on fire tv stick. No issues. Have been able to watch movies on Netflix and Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "Love this stick!  We have cable with our other TVs.  I didn't want the expense of another cable box but I did want the option of TV in my home office.  This is perfect.  My son comes in to play games while I am working as well and we chat while working and gaming.", "verified": true, "helpfulness": "1/1", "author": "cliftinax3"}, {"rating": 1.0, "review": "Unfortunately, the Fire TV stick constantly drops the network connection. We even exchanged it for a different one, hoping it was a faulty unit. It's even sitting directly next to our router. If you look at this Amazon page (http://www.amazon.com/forum/kindle?cdForum=Fx1D7SY3BVSESG&cdThread;=Tx2CDOG0K31UBSB), there are 733 (!) posts about this problem. Huge bummer.", "verified": true, "helpfulness": "1/1", "author": "Joseph"}, {"rating": 5.0, "review": "Awesome for our second TV in our bedroom. Interface is better than Ruku but not as good as Apple TV. Better than chromocast!", "verified": true, "helpfulness": "0/0", "author": "Richard"}]