[{"rating": 5.0, "review": "Bought one of these and loved it so much that I decided to add a second one to another TV.  Highly recommend.  Easy as 123 to set up. Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Daniel G. Paquin"}, {"rating": 3.0, "review": "wanted to use it in conjunction with Netflix.  Won't work with Netflix", "verified": true, "helpfulness": "0/0", "author": "jerryd"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Justin E Koetje"}, {"rating": 5.0, "review": "I LOVED this! I previously purchased & returned Google Chromecast. The Fire stick was soooooo much easier to use & is actually faster loading Netflix than it is through our Blu Ray player hooked to another tv. I'd recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "Corey Green"}, {"rating": 1.0, "review": "I sure hope Amazon reads this. I received this FireStick as a gift for Christmas. My kids and I loved playing games and using YouTube's TV Queue as a Karaoke! By February, I had to unplug the power cord often to reset the system because various apps stopped working while running or the device woukd freeze. Eventually, this unplugging of the power cord became multiple times daily. Now, Netflix and YouTube don't work at all - the main apps I use. I will go back to using my Google ChromeCast which, thus far, has had zero problems. ChromeCast doesn't have all the awesome games nor the remote like FireStick, but at least it works.", "verified": true, "helpfulness": "0/0", "author": "G. Moore"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "tomas g castillo"}, {"rating": 5.0, "review": "This is an amazing tool, especially for the price.  It has definitely turned my \"dumb\" HDTV into a \"smart\" TV!", "verified": true, "helpfulness": "0/0", "author": "Chuck T."}, {"rating": 5.0, "review": "comparing to Chromcast, much easier with the remote control. rich of content. I'm happy and with it.", "verified": true, "helpfulness": "0/0", "author": "Sadek Obaid"}, {"rating": 5.0, "review": "I've been waiting for this device to be available . Quick pain free set up right out of the box . Amazon hit this one out of the park .", "verified": true, "helpfulness": "0/0", "author": "Daniel F."}, {"rating": 3.0, "review": "I WAS EXPECTING MORE FREE MOVIES THAT ARE CURRENTLY AIRING ON TELEVISON", "verified": true, "helpfulness": "0/0", "author": "Daphne DeGraffenried"}]