[{"rating": 5.0, "review": "Easy set-up and good quality streaming, much easier than attaching a laptop with an HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "No more \"Nothing on TV!\" issues with this little thing. Wonderful!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "super easy to install, comes online much faster than the old Roku i was using, has closed caption.", "verified": true, "helpfulness": "0/0", "author": "Daniel V. Wilder"}, {"rating": 4.0, "review": "Good product, but sometimes blacks out or skips while playing. My wifi connection is strong, so definitely due to the device. All in all a decent product for the price though.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "I love this device! I haven't turned my cable box on in weeks. I can probably just cancel paying for cable! I use this for HBO, Netflix and Amazon video. I also use one in the bedroom where cable is not set up. Great device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love thei interface. Simple and useful.", "verified": true, "helpfulness": "0/0", "author": "Christopher Smith"}, {"rating": 5.0, "review": "We love.  It was very, very easy to set up.  Works great with Amazon Prime and with Netflicks. Still learning how to navigate and search but am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 5.0, "review": "Now that I have tried the Fire Stick, Chromecast and Roku the winner is Fire Stick for ease of use. I had won a Chromecast and then bought one of each of the other two because my mother wanted to use a streaming service to watch movies and I also wanted to try it. The Fire Stick was easy to setup expecially since I already had Amazon Prime and then using the small remote makes it easy to find and watch what your looking for quick. The Roku is similar in use and is great but I can't make it work through my surround sound receiver and the movies aren't the same with TV sound. As for the Chromecast let me just say it's  a good thing it was free or I would want my money back!", "verified": true, "helpfulness": "0/0", "author": "Thomas Lee Ball"}, {"rating": 3.0, "review": "I travel frequently and I purchased the Amazon Fire TV Stick to take along with me to have access to the streaming content I enjoy at home. The Amazon Fire TV Stick allows you to connect to hotel Wi-Fi, which often requires acceptance of term and/or authentication to connect. This is an advantage over the Roku Stick, which does not open a browser to connect to the Wi-Fi landing page. The hardware for the Amazon Fire TV Stick is also better than the Roku Stick.One big disadvantage for the Amazon Fire TV is the UI, which seems to be designed solely to sell you more Amazon services. See here for screenshots of the UI: http://www.engadget.com/gallery/amazon-fire-tv-ui-screenshots/ Missing from the screenshots is the banner advertisement on the Home page. In my opinion, the Home page would be better served offering a landing page for MY content, not redundant links to Amazon services already profusely offered on other menu pages.The search feature is inconsistent and does not always correctly identify that a searched item is available for free from another app (such as HBO Go or Netflix). Instead, the searched item is offered to purchase from Amazon. In comparing the search features between Fire TV and Roku, the Roku search correctly offered the free choice over paid services.Regarding miracast streaming from an external device to the Fire TV stick, all Windows devices are left out. So, if you are a Microsoft Surface owner you are better off with Roku devices that support it.Frankly, I'd return it, but it minimally suits my needs for streaming entertainment when I travel.", "verified": true, "helpfulness": "0/0", "author": "Christopher Shilt"}, {"rating": 5.0, "review": "A good unit in conjunction with your Amazon Prime.  Very easy to use and to hook up. Would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Walt Bates"}]