[{"rating": 5.0, "review": "Well worth the coin for systems not already on WiFi, or without an AmazonPrime connection...", "verified": true, "helpfulness": "0/0", "author": "TiggerBones"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "mary garcia"}, {"rating": 5.0, "review": "Love this product! Perfect for living in an apt complex this is the only device that will work! Love it!", "verified": true, "helpfulness": "0/0", "author": "als8830"}, {"rating": 5.0, "review": "A while back I got totally fed up with my cable service and went pure internet with my tv.  I bough the larger Fire Box and an Apple Box for my big screen and then bought a fire stick for my bedroom.  I am so happy with it.I also have an outdoor projector and used to mirror my kindle to it.  Now with this, I just plug it in and go!  So much easier!", "verified": true, "helpfulness": "0/0", "author": "MeAmazon"}, {"rating": 4.0, "review": "Still early to tell so far so good", "verified": true, "helpfulness": "0/0", "author": "Art Plummer"}, {"rating": 5.0, "review": "We have a home in a remote location, and we worried that the internet connection would not be strong enough.  Not the case!  We are thrilled to have access to our Amazon account, Netflix and Pandora for a start!", "verified": true, "helpfulness": "0/0", "author": "Sharon M. Campbell"}, {"rating": 5.0, "review": "I love my new firesticks.  So glad I got them.", "verified": true, "helpfulness": "0/0", "author": "Nancy Lee Holmes"}, {"rating": 5.0, "review": "Love itSuper easy to install!!", "verified": true, "helpfulness": "0/0", "author": "Michelle Campbell"}, {"rating": 5.0, "review": "This Fire TV Stick is such a great value!  We mostly bought it because we didn't like using an outdated Wii for the sole purpose of Netflix.  The Fire TV Stick took less than 5 minutes to set up, was super inexpensive, and we haven't had a single problem.  We use Netflix, Pandora, and Plex constantly and other features less frequently.  Also, we have small children who are (heaven help them) always \"misplacing\" our remotes.  For this reason, we set up the Fire TV remote apps on both our phones and we never have to spend time looking around for the remote because we can always use our phones just as easily.  This is an amazing product.", "verified": true, "helpfulness": "0/0", "author": "J. L. Drake \"I Like Cheese\""}, {"rating": 5.0, "review": "Oh! I am thrilled about the Fire Stick! I just don't like playing extra every time something new in video comes out.", "verified": true, "helpfulness": "0/0", "author": "Edward Abratowski"}]