[{"rating": 5.0, "review": "Works awesome!! I plugged it into a TV that is going on 8 years old and it now out performs our $1300 new Smart TV!", "verified": true, "helpfulness": "0/0", "author": "Chelsea"}, {"rating": 5.0, "review": "Very easy to set up, great reception and looks like all of the streaming options I choose are available. It even plays my cloud music. Nice product.", "verified": true, "helpfulness": "0/0", "author": "ibm360 \"old geek\""}, {"rating": 1.0, "review": "Very limited in what I exactly offers, must remain  plugged to experience optimal results", "verified": true, "helpfulness": "1/5", "author": "Lisa Hernandez"}, {"rating": 3.0, "review": "Power cord is too short and antenna is weak.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The FireStick is very responsive and easy to use.  The ability to power it through the included adapter is great because it allows you to instantly begin watching content when the TV powers on.", "verified": true, "helpfulness": "0/0", "author": "JJ Lee"}, {"rating": 5.0, "review": "Work exactly as expected. Hopefully will expand to allow you to use more apps such as facebook and instagram from your phone and shoot them on the tv just as youtube does.", "verified": true, "helpfulness": "0/0", "author": "Shane"}, {"rating": 1.0, "review": "Very Disappointed in the Fire Stick. Replaced by Amazon but never worked.  I spoke with Customer Service on four different occasions and they were unable to resolve the issues.  The Fire Stick is so slow that the network \"times out\" and the connection is lost.  The first Fire Stick never got past the \"looking for updates\" step.  The second (replacement) Fire Stick did load the updates, but could never get past the Home Page.  Every time I would navigate to browse content the connection was lost.  I had the Amazon Fire App on my Android, and while it was able to connect to my Fire Stick, only the \"Home\" and \"Back\" commands worked.  I was unable to use the keypad to sign in to my Netflix account because the \"Connection Lost\" error just kept coming up.  I talked to my Internet provider and there was no router restrictions on the number of devices it was supporting or the bandwidth.  I have never had Internet connection problems on my other devices, including streaming content to my PC or to my Kindle Fire.I ended up returning the Fire Stick to Amazon for a refund.", "verified": true, "helpfulness": "1/3", "author": "D. Kiker \"DK\""}, {"rating": 4.0, "review": "I like everything about it except movies buffer like crazy.Edit:  I was having trouble with my wifi dropping out.  I did some research and this solved the problem:Go to your router settings and select a channel other than the default \"auto\".  So many people use the same channels that apparently there is interference.I did this and it worked!", "verified": true, "helpfulness": "0/0", "author": "N. Clarke"}, {"rating": 2.0, "review": "Here's the deal, it refuses to log on to my account using my email address and password, my Roku does and other devices I use my prime account on.I am hoping an update fixes it.One thing I have not yet tried is disabling WPA on my router and seeing if it connects, it seems to connect with WPA but no way to tell what IP address it has taken other than check the DHCP list on my router.", "verified": true, "helpfulness": "0/0", "author": "dnob"}, {"rating": 5.0, "review": "The interface is really nice and it's not laggy  at all, got shipped to my home earlier than expected. Android mirror works great, want my laptop to mirror but has issues although.", "verified": true, "helpfulness": "0/0", "author": "rpinoys13"}]