[{"rating": 5.0, "review": "Easy to install!", "verified": true, "helpfulness": "0/0", "author": "ET"}, {"rating": 5.0, "review": "It was super easy to install.  I get lots of free movies and games.  If a 72 year old grandmother can install it in less than 30 minutes, anyone can.  The picture and sound quality is very good and I have had no streaming problems. It actually works as good as my smart tv.", "verified": true, "helpfulness": "0/0", "author": "Jaded Jade"}, {"rating": 1.0, "review": "We purchased the firestick because of the promise of the free movies on Prime. Wow, we were so disappointed with the selection - I couldn't believe it. Well, we can still join Netflix for a reasonable price, so I guess that's a consolation. Was really hoping for something better. Sorry I can't give it a better recommendation.", "verified": true, "helpfulness": "0/1", "author": "Mare"}, {"rating": 5.0, "review": "Amazing and simple to use!  one drawback I noticed is that when using other apps, like Netflix, there is a delay in streaming.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Gave them to my niece and nephew for their birthdays.  Big hit!", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "Very reliable and excelent hd quality", "verified": true, "helpfulness": "0/0", "author": "R"}, {"rating": 4.0, "review": "Great replacement for our old DVD player.", "verified": true, "helpfulness": "0/0", "author": "Matt Raczek"}, {"rating": 5.0, "review": "Great investment ... finally something to watch besides re-runs and old trash. It is like discovering TV all over again. I am super pleased and would recommend this to anyone becasue it offers so much it is sure to please everyone.", "verified": true, "helpfulness": "0/0", "author": "NOLA"}, {"rating": 4.0, "review": "It's great to use and no more directv,EVER! OR MONTHLY BILLS. FOR EVER.", "verified": true, "helpfulness": "1/1", "author": "Reuel Harvey"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Nicole Almonte"}]