[{"rating": 4.0, "review": "I like it but for some reason whenever I plug it into the wall with the included adapter, it gives me a message that says it's not plugged into the wall. Which I find odd. It allows you to continue anyway but then I decided to just plug it into the TV's USB port and I still got the same message(which I fully expected) and it works just fine on USB power.The content seems to be just the same content I'd find on my Xbox, PS3 and TiVo just with a different interface. I played around with the voice search(you have to use an Android app for that or buy an extra remote as the included remote has no mic) and am not quite as convinced of it's awesomeness. I expected when I told it to open an app or tv show that it would go to that app or show, not just give me search results. I told it to \"go to orange is the new black\" and it didn't even give me results related to my search, let alone play what I wanted it to. I could just be using it wrong though. Perhaps Amazon meant for it to be more of a voice search app rather than a voice command & search app. Which is what I'd prefer it be. Still a solid device and I'm still glad I got it(especially since as a Prime member I only paid $19 when it first was announced).Plus it's portable so the next time I travel, I'm planning on using it at my hotel. I will update my review after I do that with additional details(how it handles public wifi and logging into hotel wifi systems, as well).", "verified": true, "helpfulness": "0/0", "author": "Myrddin"}, {"rating": 5.0, "review": "Nice productBest deal at best price. Replaced my old netgear and amazon fire stick is 50% more faster than netgear.Love to watch educational videos on youtube, directly from my 60 inch TV.", "verified": false, "helpfulness": "0/0", "author": "John B."}, {"rating": 5.0, "review": "You will need a couple things to dump cable. First you need a digital antenna. Mine is as thin as a sheet of paper and picks up all the stations from 35 to 40 miles. Go to antennaweb.org to find the free digital HD signals in your zip. With the Fire you need Hulu Plus to get current TV shows already recorded for you. Like the world's largest TiVo with 400 networks including the 40 most popular. You can watch many the next day and some a few days later but often the entire series for power watching. Never wait for a program to come on. Just simply select it and watch. You of course want to watch movies. And Prime will give you all you can watch and 2 day shipping as a bonus. For your over the air local shows, some day you are going to want to record when there are three good shows all at the same time. For that you might want a Channel Master DVR+. It uses an antenna connection and records in 1080p and uses a hard drive (or two) for hundreds of hours. There is no rush to buy a DVR and after you save on cable fees you will have so much extra cash. I cut the cable 5 years ago when the digital transition happened. The picture quality was better than the cable since there was no compression. Watching sports on the weekend and Nature on PBS it was like being there and my TV never looked so good. With Prime and Hulu Plus the cost is $16.20 and since there is no monthly fee to own as many Fire TV's or Sticks as you want, might as well get both or some of each. If you have the bandwidth, you can run 2 Amazon streams and 1 Hulu Plus at the same time. At The Same Time. I'm not a big fan of Netflix. But if you want their service, you can run 1 to 4 streams for 8 to 12/mo.", "verified": true, "helpfulness": "1/1", "author": "Rosey1 \"Rosey1\""}, {"rating": 5.0, "review": "The best thing since sliced bread. Getting rid of cable and buying one of these for every tv in the house. A must have in every house hold. HULU NETFLIX AMAZON PRIME and MORE what else can you ask for. Endless entertainment!", "verified": true, "helpfulness": "0/0", "author": "Jynce"}, {"rating": 2.0, "review": "While I love how fast it moves,  the picture,  and sound so fast.  I am very disappointed with the WiFi connectivity.  At least once a day you have to unplug it then plug it in again.  You don't have to do that very often with the ROKU player.  Plus the commercial shows this running with out a power cord. Guess what?  You have to have one and it still losses WiFi once a day or more.  It's disappointing to know this came from Amazon.com . I expected more from them.  I bought it on sale at bestbuy.  29.95$ makes me wish it was cheaper. But it was a lot easier to set up than ROKU.  They demand a credit card of you try to set it up unless you spend an hour on the phone with them to set it up without.Amazon.  Please fix your connectivity issue! This could be such a great device if you did.", "verified": true, "helpfulness": "1/1", "author": "Sonya J. Steiner"}, {"rating": 5.0, "review": "Awesome TV Stick very fast dos not slow down at all or lag like most TV Stick's.Very impressed with it works very good no problems out of mine at all id buy another one for other TV that does not play netflix the amazon TV Stick does all what it says it does iv tried all programs on it very nice job they don on Amazon Fire TV Stick. Works just like the Amazon Tablet's", "verified": true, "helpfulness": "1/1", "author": "StealthNCC1701E"}, {"rating": 5.0, "review": "Spectacular deal for $19. Would still purchase for $39. Another good Amazon product", "verified": true, "helpfulness": "1/1", "author": "Grant"}, {"rating": 3.0, "review": "My God let me skip this stupid video...", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Wow, great things do come in small packages! Only 10 minutes using it but I am impressed. Of the dozens of things I've ordered from Amazon this is the first one i'm taking the time to review.", "verified": true, "helpfulness": "1/1", "author": "A. W."}, {"rating": 5.0, "review": "I received my Fire TV Stick today and love it! Its small footprint and versatility are matchless at the moment.", "verified": true, "helpfulness": "1/1", "author": "Kevin"}]