[{"rating": 5.0, "review": "I really like this so far ....may make my prime subscription  worth it. I'll  continue to evaluate.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 5.0, "review": "Love being able to watch NETFLIX thought the stick.  Have had a few issues with the live streaming sometimes with the internet, but other than that love all variety of shows to watch.  I even ordered one for my parents.  Easy to learn to operate.", "verified": true, "helpfulness": "0/0", "author": "Stacia"}, {"rating": 5.0, "review": "It works!  Very easy to install and easy to access Netflix.", "verified": true, "helpfulness": "0/0", "author": "Lyn"}, {"rating": 5.0, "review": "Easy to set up and a Breeze.to.learn especially with the android app", "verified": true, "helpfulness": "0/0", "author": "Joseph Wood"}, {"rating": 2.0, "review": "The fire stick does work but it doesnt work good they need to do some kinda update because it buffers a lot and the video gets blurry a lot I no its not my internet cause netflix and hulu all work perfect on other device just not the fire stick", "verified": true, "helpfulness": "0/0", "author": "anb2087"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "airanita"}, {"rating": 1.0, "review": "I was very disappointed in this product. It rarely worked. It would not hold it's wifi connection. Apps failed to work/load. I thought it was a can't miss at only $24, but boy was I wrong. I have an AppleTV that works wonderful and was researching the Fire TV Stick to use in other rooms. I have returned this as it wasn't even worth the $24 spent on it. Amazon failed greatly on this one.", "verified": true, "helpfulness": "0/0", "author": "Alana S."}, {"rating": 4.0, "review": "works great so far! just have to figure it out still.", "verified": true, "helpfulness": "0/0", "author": "Carol F. Wilson"}, {"rating": 5.0, "review": "great if you have prime!!!", "verified": true, "helpfulness": "0/0", "author": "Spatial_k"}, {"rating": 5.0, "review": "Easy to install and use.  Enjoying all the free Prime movies, tv programs and music.", "verified": true, "helpfulness": "0/0", "author": "Constantina Xanos"}]