[{"rating": 5.0, "review": "Great for a tv that doesn't have surround receiver", "verified": true, "helpfulness": "0/0", "author": "mtlkz"}, {"rating": 5.0, "review": "Easy to set up and use; Loaded with features.", "verified": true, "helpfulness": "0/0", "author": "JEL"}, {"rating": 5.0, "review": "Works exactly as expected.", "verified": true, "helpfulness": "0/0", "author": "Arthur N. Krauss"}, {"rating": 4.0, "review": "Fire TV Stick is an easy way to watch your favorite TV shows without cable. If you don't have Netflix or Amazon Prime, both would help you get the most out of your Fire TV Stick. I use it every day and have had problems with it freezing a few times, but nothing serious.", "verified": true, "helpfulness": "0/0", "author": "alea"}, {"rating": 5.0, "review": "It's great and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Joby Vega"}, {"rating": 5.0, "review": "I recently had UVERSE Cable and I am saving money. I watch what I want when I want and I love it. I also LOVE iHeart Radio so now I can listen on my TV as well. My daughters LOVE the YouTube App and the free games. Definitely recommend this to anyone that might be looking for another alternative to Cable TV", "verified": true, "helpfulness": "0/0", "author": "Ambie"}, {"rating": 5.0, "review": "The fire TV stick is every thing I thought it would. It woks great with my internet and only had minor problems while learning how it works. I get Hulu and Netflix with no problems", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "I couldn't be happier with the fire tv stick. Everything is easy to get to and works great.", "verified": true, "helpfulness": "0/0", "author": "Loretta A. Ludwick"}, {"rating": 5.0, "review": "Best device I ever owned !!!", "verified": true, "helpfulness": "0/0", "author": "Amir"}, {"rating": 5.0, "review": "This Fire TV stick is the TRUTH. The best $40 I spent in YEARS. My XBox One use to be my go to entertainment device. Since, I purchased this stick, I no longer turn my Xbox One on. Before this stick, I turned on my XBOX every day to watch netflix, amazon prime, youtube, crackle, etc... I could go on and on. I watch and did everything through it. The FIRE TV stick is just awesome. I believe its the best media streaming stick on the market. User Friendly easy to navigate. This stick comes with a remote that responds with ease. All my media in one place. It's very small and portable. I take it from room to room. Since, I purchased this stick, I no longer turn my Xbox One on. Before this stick, I turned on my XBOX every day to watch netflix, amazon prime, youtube, crackle, etc... I could go on and on. The technology is fast and no sluggish loading of video content. The picture is clear and I can't find anything bad to say about it. Let's just say I ordered a few more for family and friends.", "verified": true, "helpfulness": "0/0", "author": "JCookie"}]