[{"rating": 5.0, "review": "Works great for streaming on my TV.  I use the electric plug extension as recommended for best reception and  have had no problems so far.", "verified": true, "helpfulness": "0/0", "author": "violet \"easily confused\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Natalie"}, {"rating": 5.0, "review": "Just got it yesterday, easiest set up ever! Just started playing with it but so far it works great.", "verified": true, "helpfulness": "0/0", "author": "Sheryn neelands"}, {"rating": 5.0, "review": "Very handy and so much to it considering how low the price.", "verified": true, "helpfulness": "0/0", "author": "Jesus Renteria"}, {"rating": 4.0, "review": "as described", "verified": true, "helpfulness": "0/0", "author": "s woodruff"}, {"rating": 1.0, "review": "I was very disappointed with the Fire Stick. Most every thing is a purchase and the cost is more then other places.", "verified": true, "helpfulness": "0/0", "author": "Eugene L. Van Houten"}, {"rating": 5.0, "review": "Great addition to the tv entertainment center. Plugs right into the tv with no problems and was able to get it up and running with a couple of minutes. If you don't have a prime membership, I wouldn't recommend buying this as you can buy a roku or something else to get the same thing minus the amazon support. Very fast for a device the size of a thumb drive, streams music and videos almost seamlessly as long as it can get a good wifi signal. Tons of apps and and games to play around with, and about half the price of the fire tv.", "verified": true, "helpfulness": "1/1", "author": "Anthony"}, {"rating": 3.0, "review": "The Amazon prime service seems to be very fun.  It takes a bit of time to learn how to navigate.  There are more options that require additional payment than I expected.  One of the remotes stopped working in less than ten days of purchase.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Very easy to set up and use.  Likes the tutorial welcome clip.  Only compliant is that there is so many more movies available than just what you see on the home screen, but I feel like you really have to dig thru ro find them.  Sure you can search for soemthing you are looking for, but if you don't really know what you may want to watch, it takes a look of time to dig thru.  I think it needs more categories maybe.  Not sure why anyone would use it without being a prime member", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product and as good as the Roku I use on my other TV.  In fact the fast forward and rewind processes are better on the Fire . Stick than the Roku which tends to hiccup and really stall.  Very happy with this Fire Stick purchase.", "verified": true, "helpfulness": "0/0", "author": "powergirl"}]