[{"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "ashton"}, {"rating": 4.0, "review": "For the most part it is great! However,it caused MLB tv to black us out when we were not in a blackout area. It also quite a bit of buffering although it usually lasted a short time. Except for using it for MLB I would recommend it We have had the stick about three weeks. It was easy to.install and worked right away.", "verified": true, "helpfulness": "0/0", "author": "MEREDITH MARTIN"}, {"rating": 5.0, "review": "The Best stick out there thanks", "verified": true, "helpfulness": "0/0", "author": "Freddy Castillo"}, {"rating": 3.0, "review": "I had a hard time getting it to work with my wireless internet provider.  My daughter was living with me so I tried her wireless provider and it worked otherwise I would have had to return it.  I also have the Amazon Fire box.  I had no problems running that off my internet provider.  The Fire TV Stick remote does not have all the commands as the Amazon Fire box remote.  The Amazon Fire box remote is much better.  Like they say...\"You get what you pay for\".", "verified": true, "helpfulness": "0/0", "author": "Virgo Shopper"}, {"rating": 5.0, "review": "Great device to turn a dumb tv into a smart one. Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Chresta Harper"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "David Hyman"}, {"rating": 4.0, "review": "Great gadget! 2 things that need improvemts - streaming requires better sound and Amazon prime should have more popular movies included in its membership.", "verified": true, "helpfulness": "0/0", "author": "Stillsoft"}, {"rating": 5.0, "review": "Works great, enjoy it a lot. I'm using a Samsung 6 with no problems.", "verified": true, "helpfulness": "0/0", "author": "Stewart W Johnson"}, {"rating": 1.0, "review": "Although I love the concept of this thing, amd I was really pleased with the Pluto app, this is a headache. I love amazon and enjoy their services, but I never seem to get reliable streaming and the fire stick seems to just freeze altogether at times. It has been frozen for the past 15 minutes prior to this review. My internet is directly next to it, and it is alway buffering. Possibly this is because I purchased a refurbished one? Well I wi just continue to stream from my xbox one instead.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 3.0, "review": "YOU NEED FAST INTERNET!! Great device but you need 6Mbps + speed to use. A lot of free apps to use that work okay.", "verified": true, "helpfulness": "0/0", "author": "rick bickel"}]