[{"rating": 5.0, "review": "Very nice product. Worth every cent", "verified": true, "helpfulness": "0/0", "author": "James M"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Gracellen Wilber"}, {"rating": 5.0, "review": "Instant access to all of my favorite streaming apps. Super simple set up, user friendly interface. Love love love it.", "verified": true, "helpfulness": "0/0", "author": "Alyssa Marie Orozco"}, {"rating": 2.0, "review": "The Add with Gary Busey made it seem like you could mirror your computer and you can't. It also is very intermittent even with a strong internet connection there is constant buffering.", "verified": true, "helpfulness": "0/0", "author": "Isaiah flynn"}, {"rating": 5.0, "review": "I have both the stick and the box.  Enjoy them both and am glad I purchased them, but the stick is wonderfully adequate for my needs.", "verified": true, "helpfulness": "0/0", "author": "gobraugh"}, {"rating": 4.0, "review": "Remote did NOT have voice feature ... So sync'd Voice remote used for Fire TV box in another room ... But then due to proximity the remote signal thru the walls hits both the Stick & Fire TV box ... Otherwise - good", "verified": true, "helpfulness": "0/0", "author": "David \"DEWONN43\""}, {"rating": 2.0, "review": "Maybe the tech isn't there yet.  I don't know.  The remote constantly disconnects unless I use the extension HDMI.  But honestly, I bought the stick so it would hide behind the TV, not hang down below it.  Netflix streams like crap compared to my other WIFI devices.  Buffers during every 30 minute episode.  It's not the WIFI, because amazon movies stream perfectly.  I'm honestly disappointed.  Every feature I liked about it, or wanted it for, appears to be less than adequate.  Probably going to replace it with a roku.", "verified": true, "helpfulness": "1/1", "author": "James Veldman"}, {"rating": 4.0, "review": "Portable, easy to use and I can stream movies and music to it. Great! If they could fix the issue with connecting to a hotel network this would be a 5 star device. 4.5 Stars.", "verified": true, "helpfulness": "0/0", "author": "Kati"}, {"rating": 2.0, "review": "Not exactly the same experience as in my fire tv", "verified": true, "helpfulness": "0/0", "author": "Shay Deblinger"}, {"rating": 4.0, "review": "Good to use for the price.", "verified": true, "helpfulness": "0/0", "author": "Narasimha Kakulamarri"}]