[{"rating": 2.0, "review": "It sometimes freezes and you have to go all the way out to the main menu to get it to work.  This does not happen with the Apple TV device.", "verified": true, "helpfulness": "0/0", "author": "VMO"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Great to have if you don't have cable. I am a college student and its worth the money to get this.", "verified": true, "helpfulness": "0/0", "author": "Julia"}, {"rating": 1.0, "review": "I'm a secondary prime member so you don't get any streaming content for free. So in addition to the $40.00 for the fire stick, you also have to buy a prime membership for a $100.00.", "verified": true, "helpfulness": "0/0", "author": "Jimmy O"}, {"rating": 5.0, "review": "Awesome! Best thing ever! Don't bother worth your Xbox. roku who? Just listen to the wisdom of Gary Busey and get a fire stick.", "verified": true, "helpfulness": "0/0", "author": "Meagan Pendleton"}, {"rating": 5.0, "review": "This handy little tool makes viewing movies from my PRIME membership is so much easier than hooking up my laptop!", "verified": true, "helpfulness": "0/0", "author": "CindiB \"Avid Fan\""}, {"rating": 5.0, "review": "Very easy setup", "verified": true, "helpfulness": "0/0", "author": "Jennifer Isige"}, {"rating": 5.0, "review": "I love this device SO MUCH MORE than I anticipated. We own a lot of devices like this (apple tv, roku, play stations, xboxes, etc). But this one became a family favorite because we can jam it in a small pocket of a backpack and bring it with us when we travel. As long as we can find decent wifi connection we can then appease the 4 year old with some cartoons or we can catch up on some mom and dad relaxation / viewing anywhere we go. Was brilliant to have when visiting friends and family. Also worked in a number of hotels we stayed at. When not traveling it lives in our bedroom attached to an extra TV so mom and dad can watch netflix in bed. We got this for the super low introductory price of $19 and I appreciate that value every time we use it. $39 price point is fair and still recommended, especially if you don't already have roku or apple tv.", "verified": true, "helpfulness": "1/1", "author": "Michael Walsh \"Soundsdefygravity\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "D. cu"}, {"rating": 5.0, "review": "Very good streaming usb stick plus the included remote control. No need to download app to control the unit.", "verified": true, "helpfulness": "0/0", "author": "Kerwin S. Patrimonio"}]