[{"rating": 5.0, "review": "Like others leaving reviews, I too was fortunate enough to grab a Fire TV Stick during the 2-day Amazon sale for $19.  I didn't have high expectations to be honest, as I thought \"Well, another HDMI dongle on the market\" -- but for $19 I figured why not, let's give it a shot.  And I just have to say, wow was I wrong with those low expectations!Let me explain...I cut the cable/satellite subscription long ago, and my setup has been this for the past few years - A Chromecast, a Roku 2 XS (Primarily for Netflix/Pandora), and a dedicated Zotac ZBOX-AD04 running XBMC/Kodi (OpenELEC) to play local media.I've been using XBMC for over 10yrs, since it was originally released for the first Xbox, and I've grown to absolutely love it.  I've tried all the variants - Plex, Boxee (yeah, good old Boxee... is that on the Samsung TV's yet after the acquisition?), etc.. But in my opinion, nothing holds up to the XBMC experience.  I don't love the Netflix implementation on XBMC, but that's about the only thing that I don't love about the platform.I hadn't done much research on the Fire TV devices, so much to my delight when I discovered that these things are Android under the hood, and that you can sideload basically any Apk file onto them without much fuss.So a little bit of Googling, and a couple YouTube videos later and voila, I had a fully functional XBMC installation directly on my fire stick.  The beauty here too is, absolutely no tinkering needed with hardware -- no network issues, no audio issues, no remote issues, etc.. I'm assuming that since XBMC is simply an App on top of an already-configured OS with working hardware, this is why it all \"just works\".The only thing I did have to do was push 3 files over to the device -- advancedsettings.xml, passwords.xml, and sources.xml  I pulled these directly off my Zotac box, with zero modifications done.  Now my Fire TV XBMC fully sees my network shares, connects to my MySQL database, and saves the user credentials to authenticate to the network.I can honestly say, this $20 device can truly be considered a direct replacement for ALL THREE of my previous devices (Chromecast, ZBOX, Roku).  For my viewing habits, the XBMC user experience is exactly the same on this device as it had been on the $250 dedicated ZBOX with 8gb of memory.  Your experience may vary here if you love streaming gigantic HD files to your device, but I have yet to see a network buffering issue or a hiccup on this thing.I'm going to give it a little bit longer just to make sure, but I'm pretty sure I'll have a Chromecast, Roku & Zbox selling on eBay shortly :)", "verified": true, "helpfulness": "1/1", "author": "kgibbons04"}, {"rating": 4.0, "review": "Not all that hard to install for a non-techie, 74 year old. Picture does not look like HD and does not fill the screen but it was free so what the heck.", "verified": true, "helpfulness": "0/0", "author": "anthony petrick"}, {"rating": 4.0, "review": "god if you want something with better feel then your stock smart TV.Apps download a bit slow.", "verified": true, "helpfulness": "0/0", "author": "felipe Reyes"}, {"rating": 5.0, "review": "Easy to install and using MiraCast on our mobile devices allows us to watch anything on our devices on our large screen TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good deal", "verified": true, "helpfulness": "0/0", "author": "Karen W Crawford"}, {"rating": 5.0, "review": "Love it.  Works fast and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Love it.  Now i can watch all the movies and Shows for hours while i wood carve.", "verified": true, "helpfulness": "0/0", "author": "T. Bates"}, {"rating": 5.0, "review": "Easy to use. It was a gift for my daughter, she LOVES it.  Highly recommend this...can't wait for the iPhone App to come out.", "verified": true, "helpfulness": "0/0", "author": "Lisa Cross"}, {"rating": 4.0, "review": "Looking forward to using an app for iPhone and to HBO being included in the services.", "verified": true, "helpfulness": "0/0", "author": "E. McCool"}, {"rating": 2.0, "review": "Not a fan. Would be better if you could cast from your computer to TV like Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Raj M"}]