[{"rating": 5.0, "review": "I ordered the Amazon Fire Stick I was so satisfied I ordered another one the next day. I was tired of paying high a high cable bill just to watch TV.  The fire stick was very easy and simple to use. Enjoying it!", "verified": true, "helpfulness": "1/1", "author": "Meerin"}, {"rating": 5.0, "review": "love it alot", "verified": true, "helpfulness": "0/0", "author": "tameala white"}, {"rating": 3.0, "review": "I jumped in when this was only $19 for Prime subscribers. If I had paid the $39, I'd probably lower the rating by a star.This little device sets up fine, and has access to a bunch of apps. The Amazon Prime content is great and runs on what I assume is a lightweight video player that's integrated into the OS. I say this because YouTube content does not perform nearly as well. Not only is the app far from fully featured, it also seems to begin freezing after watching a few hours of videos. At this point, it seems to buffer on and off, but once this starts the Android remote app also fails connect. The included physical remote still works, but with considerable lag. Once you close the YouTube app, the Fire TV Stick becomes responsive again. At one point, videos refused to play. Black screen with audio only. A restart was required to fix it.The Twitch app is also next to worthless. You can't search for anything. You can't access your account. You can look through \"Featured Channels\", \"Games\", or \"Channels\", all of which are just scrolling rows with items dumped into them by number of viewers. No other controls.The included physical controller, even when the Fire TV Stick is not choking on YouTube content, sometimes gets \"stuck\". You'll press left once and it will fly by the next thing to your left. Press right once and it'll move one to the right. Press it again and you'll move two to the right. There's no rhyme or reason to it.The Android controller app works well enough barring the aforementioned issue with YouTube. My only complaint is that voice search is for Amazon content only. There's no integration with apps.Other than that stuff, it's decent enough. I haven't tried playing games on it, so no comment. I also haven't tried Netflix or HBO GO, but I'd be curious to find out if they have the same problems as the YouTube app.", "verified": true, "helpfulness": "0/0", "author": "Joshua Clukey"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Veronica Simmons"}, {"rating": 4.0, "review": "This is my first streaming TV box, as I have just been using my desktop or my laptop connect to my TV up until now. I got the Fire TV Stick for $20 with the Prime discount they had when it first released, and I definitely got my money's worth. I generally use it with Prime instant video, the few shows I've bought digitally on Amazon, and Netflix. It can be slightly laggy sometimes, and I've had very few issues with it losing signal (the WiFi router is right on the other side of the interior wall that the TV is mounted to), but it seems fairly solid. I like that it has a remote, which I believe chromecast does not. Overall it was worth the money, I'd probably still buy it for $40.", "verified": true, "helpfulness": "0/0", "author": "Jared N"}, {"rating": 5.0, "review": "Very simple to set up and use. Flawless operation.", "verified": true, "helpfulness": "0/0", "author": "Jerry G. Nutt"}, {"rating": 4.0, "review": "I liked it but eventually gave it to my sister.  I was on the fence to get one and eventually pulled the trigger because I read the stick supported miracast but turned out to only support miracast if you have a kindle fire tablet.  With that out of the picture it didn't do anything my xbox one doesn't do.  Couple with slow network performance I decided to give it away.  I know you can sideload apps and kodi and all that stuff but I don't want to deal with that stuff.My sister, who is now using it likes it except it doesn't have the greatest network range and she had to buy a wifi booster.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Love it! Works like a charm, so inexpensive, and delivers so much content.", "verified": true, "helpfulness": "0/0", "author": "P. Broom"}, {"rating": 1.0, "review": "Had to return it because of no service", "verified": true, "helpfulness": "0/1", "author": "Elaine"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "stacey c."}]