[{"rating": 1.0, "review": "I haven't experienced any of the technical difficulties that others have, however beware if your service provider is Cox Communications. The full content of some channels such as History, and A&E; etc.. are not available as Cox has not partnered with A&E;, History (and others) for any TV offerings through the Amazon Fire TV products. As such, many of the programs I would want to watch are unavailable to me. I wouldn't have known or even guessed that this was the case based on what I had read through Amazon's product info. Cox Communications does not plan to participate in these offerings any time soon according to a forum response I received recently from a Cox representative. If you are lucky enough to already be a customer of one of the approved service providers on the respective channel's website, (i.e. A&E;), then you can view full content for that channel. If not, then your choices are definitely less. I have read another review in which the customer had the same issue with a different provider.", "verified": true, "helpfulness": "0/0", "author": "E. Coleman \"thetoltec\""}, {"rating": 5.0, "review": "UNREAL.  THE AMOUNT OF CHANNELS AND CLARITY IS TERRIFIC.  GREAT BUY.", "verified": true, "helpfulness": "0/0", "author": "Paul W. Siegel"}, {"rating": 5.0, "review": "FREAKIN' AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Jon Fiddelke"}, {"rating": 4.0, "review": "Great product for the price. Some video and music apps show a teeny bit of lag in the menus but it's not bad at all. I tried using the USB ports on my TV to power the Fire Stick but was told on screen when it powered on to use the supplied USB power adapter instead. The supplied 1 amp power adapter was a little big to fit in the open outlet on the power strip between two other plugs so I had to use another USB power adapter I had on hand from an old Samsung phone. I think the only real improvement I can think of right away that Amazon should consider would be to add a volume up/down to the remote that could be programmed to either a TV or audio receiver so the user doesn't need two remotes at their side when using this device. The usb adapter could also be downsized for the reason noted above.", "verified": true, "helpfulness": "0/0", "author": "Lights On"}, {"rating": 1.0, "review": "Pre-ordered and it came quick. Picture quality is great. WIFI has issues. It will connect. Then it will loose connection. Must unplug and replug each time to reestablish the WIFI connection. Doing this about every 20 to 30 minutes is anoying.", "verified": true, "helpfulness": "1/1", "author": "M. Pfeiffer"}, {"rating": 5.0, "review": "We Love it.", "verified": true, "helpfulness": "0/0", "author": "Samuel B. Johnson \"S.B.J\""}, {"rating": 3.0, "review": "Had a terrible user experience when first powering up the device. I was all excited to turn it on and start using. I plugged it in, and then immediately it started updating the software. I was locked out of the device, waiting for it to update for almost 45 minutes! Come on Amazon!! Ship your product with the right firmware!!!Then, once the firmware was updated, I started navigating the stick. Downloaded a couple apps, and...bang...the stick kept freezing and then it crashed.I'm an Apple user and am used to flawless performance straight out of the box. Amazon...step up your game!With that said...I'm absolutely thrilled with the stick now that I've gotten it set up the way I like it. I bought a $5 app to enable AirPlay, and now I actually have no need for my Apple TV.Sure, the menu and navigation on the Fire Stick is EXTREMELY AND FRUSTRATINGLY clunky, crowded, cluttered, bloated, and poorly designed (in comparison to the Apple TV's clean and simple layout).But...At the end of the day, I'm mostly using this stick to Airplay from my iOS/OSX devices to my TV. I barely use the apps built in.I give 3 stars now, because Amazon still hasn't released an iOS version of their remote app, and because the device was not plug and play ready straight out of the box - leaving me with a frustrating first hour of ownership. I'll raise a star once I get a functioning remote app for my iOS devices.", "verified": true, "helpfulness": "0/0", "author": "KHJ"}, {"rating": 4.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "pete gordon"}, {"rating": 2.0, "review": "Fire TV Stick is not there yet.  It constantly locks up and has software issues.  The remote gets non-responsive and I have to unplug the device to reset everything.  Also, I can't figure out how to turn it off.  The instructions do not include how to turn it off (if there is a way to turn it off).  I would not recommend this device at this time.  It needs work.  Also, it's not totally wireless.  You still have to have it close to an outlet so it can be plugged in.  This was not made clear as there's no picture of the power cord in the product photos.  I also have a regular Fire TV.  It works great.  I haven't had the same software problems with it or the non-responsive remote.  Not wireless but neither is this stick.", "verified": true, "helpfulness": "0/0", "author": "Justin Daniels"}, {"rating": 5.0, "review": "I waz secaptal at first but after a few days I got use to the menus and other features and now I love it who needs cable when u got fire stick", "verified": true, "helpfulness": "0/0", "author": "matthew ray"}]