[{"rating": 5.0, "review": "Worth the money.", "verified": true, "helpfulness": "0/0", "author": "AJM1979"}, {"rating": 5.0, "review": "Loved it so much - purchased another for my son.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "I'll keep this fairly succinct. Should you buy this over other media streaming devices/dongles? Yes.  It offers a lot of great functionality and yet is very intuitive.  Very easy to setup, download apps, and stream media/play games. My only knock against it is that it doesn't allow (to my knowledge) you to reset the device from the menu, you must unplug the power to restart the device.At certain points it will not connect to my wifi and the Fire Stick TV must be rebooted for it to reacquire the networks. I believe is more on my wifi network than the Fire TV Stick in terms of connectivity loss.  A reboot/reset option within the GUI would be a great \"quality of life\" addition.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 3.0, "review": "I'm still testing it out. but..  it was very easy to install, easy interface, even great packaging.  But it buffered a little too often yet I have 802.11ac about 15ft away through two walls.", "verified": true, "helpfulness": "0/0", "author": "Jeff Perley"}, {"rating": 5.0, "review": "Very happy with my Fire TV Stick in every way.  Installed very easily and I am putting it to good use.  Thanks.", "verified": true, "helpfulness": "0/0", "author": "Linda E. Roberts \"Linda R.\""}, {"rating": 5.0, "review": "love this! so easy to use", "verified": true, "helpfulness": "0/0", "author": "kathy b"}, {"rating": 4.0, "review": "very nice... easy to setup and use... the wifi has had a few streaming issues that the FireTV might not have?", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Absolutely thrilled with our FireStick!  It's fast, seamless and has everything we need since we \"cut the cord\" almost 2 years ago.We've had ours for 8 months now and still love it!People seem to think they only have Netflix & Prime on this device, but that couldn't be further from the truth. You can download dozens of apps like Hulu, History Channel, SlingTV, HBOGo, Smithsonian Channel and dozens of other apps that provide free movies and tv.When you get this device, do some exploring in the app section and you'll find dozens of great apps that will quadruple your viewing options past Prime & Netflix.  Folks brag about the Roku & Chromecast, but this device offers so much more.  Plus, none of these other media sticks offer any Amazon Prime media.  So IMO, the Amazon FireTV and FireStick win hands down.", "verified": true, "helpfulness": "0/0", "author": "C.A.R. \"CAR85\""}, {"rating": 5.0, "review": "I was fortunate enough to grab one at the special $19 price. The day it was installed, our Apple TV got put into retirement. Fire TV Stick has very few delays in streaming, whereas AppleTV had become really slow to respond. No complaints. Bought one at full price as a gift and it is well loved as well. My AppleTV is currently up on Ebay if you're interested, but I'd recommend you go with Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Kristen Kidd Donovan"}, {"rating": 5.0, "review": "Life saver. No need to buy an expensive SMART TV, this works just fine for someone like me.", "verified": true, "helpfulness": "0/0", "author": "Lola Enriquez"}]