[{"rating": 5.0, "review": "We love it!  I'm not a techie but it was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Merc"}, {"rating": 5.0, "review": "I've had a fire TV for a while. I wanted to give this a try.... It was the right call. I was surprised at how snappy it was! Works PERFECTLY!Good job Amazon :)", "verified": true, "helpfulness": "0/0", "author": "Maximo B. \"Max - That's right!\""}, {"rating": 5.0, "review": "Wow, I just turned my flat TV into a \"Smart\" TV in less than 15 mins including the removing of the Cromecast stick and installing the Fire TV stick.So Simple and easy. 10 mins later I was logged onto Netflix.  Now I'm anxious to start viewing some shows on Amazon and Netflix.", "verified": true, "helpfulness": "0/0", "author": "BRB"}, {"rating": 5.0, "review": "I've had no issues with connection, and it's at least as fast to respond as my Roku 3.  It did need a power line that I didn't expect, but that's not really been an issue and is no different than the larger devices.  Relatively easy to program, and adding new channels has been quite easy.", "verified": true, "helpfulness": "0/0", "author": "D. Settles"}, {"rating": 5.0, "review": "The Fire TV Stick was simple to install and has been easy to use.  Coupled with a Prime membership it has greatly enhanced my home entertainment options.", "verified": true, "helpfulness": "0/0", "author": "ND72"}, {"rating": 5.0, "review": "This is the greatest little tool ever.  I love that it is portable, I take it with me when I travel.  There are tons of apps that can be downloaded for it and the easy access to prime video is great.  I regularly use Netflix and Hulu on this as well.  Easy to set up and use.  I can even control it from my smartphone.", "verified": true, "helpfulness": "0/0", "author": "J. Stevens"}, {"rating": 2.0, "review": "Nice interface but it is somehow causing my cable modem to periodically drop from network. I thought it was my ancient modem so I purchased a new one from my provider. This did not resolve unfortunately. Plugged my original Roku back in and have not had an issue weeks later. Also have not experienced it with my Apple TV. I suspected it was the fire stick when a network connection was lost one time at the exact moment I dropped the remote. I went from 4-5 lengthy network drops per day to zero once I boxed the fireTV stick.  Missed the window to return it evidently, but at least I hadmy old Roku to enjoy my Amazon Prime shows.", "verified": true, "helpfulness": "0/0", "author": "BC \"BCRI\""}, {"rating": 5.0, "review": "Great interface, it works as fast as my cell interface. The apps load very fast. The way that my account is integrated with my amazon y amazing. When I plugged in the hdmi adaptor to the tv and turn it on I got surprised when I saw my name.Videos load very fast even that my modem is not next to my tv.", "verified": true, "helpfulness": "0/0", "author": "Daniel Gallo \"Teacher\""}, {"rating": 5.0, "review": "This is a great device!  I have a Roku and Google TV, however this one seems to be the quickest navigator interface of them all.  Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "Butterfingers"}, {"rating": 5.0, "review": "Completely addicted and it's only been two days!!", "verified": true, "helpfulness": "0/0", "author": "Kwayera Leseane"}]