[{"rating": 5.0, "review": "I used to have a smart TV and didn't really need this, but I moved for a long-term assignment and quickly began to miss a smart TV. I was skeptical...how could it be so simple and actually be good...but it was. It's fantastic. In fact, it's much smoother than my samsung smart tv. It doesn't have the delays and crashing the tv did. It works very well and I love the remote. I use the cord extender they give even though I'm not really sure how it works, but my comparison was AppleTV. Between apple tv and the firestick, with the cost difference, this is the right way to go. Performance is so similar...the difference is really just the layout and this one is good. Extra bonus enjoyment for prime members, of course, be cause you get to watch everything for free on your TV.", "verified": true, "helpfulness": "0/0", "author": "David R. Carr"}, {"rating": 3.0, "review": "I have fios and I keep losing connection.  But I have no problem with my other wireless devices.", "verified": true, "helpfulness": "0/0", "author": "Amelia"}, {"rating": 4.0, "review": "There are a few glitches.  The fast forward and rewind need to be better. But other than that it makes your TV smart, as it is supposed too. Shows start immediately and it is easy to navigate through.", "verified": true, "helpfulness": "0/0", "author": "SQ"}, {"rating": 5.0, "review": "its great moves and shows whenever your ready and no big monthly cable bills!!! I love it", "verified": true, "helpfulness": "0/0", "author": "Diana Coppola"}, {"rating": 5.0, "review": "Very good product!!!!", "verified": true, "helpfulness": "0/0", "author": "Shelli Sullivan"}, {"rating": 3.0, "review": "It would be better if you could get a internet browser. Like PlayStation.", "verified": true, "helpfulness": "0/0", "author": "kevin mays"}, {"rating": 5.0, "review": "Works seamlessly. Setup couldn't be easier. Interface is simple and intuitive. Batteries included.The remote is very small and will want to get lost in the couch, This hasn't happened yet but its coming. I'm going to need to paint it red or tie a brick to it like a gas station bathroom key.", "verified": true, "helpfulness": "0/0", "author": "J. Ramsell"}, {"rating": 5.0, "review": "I was so excited to get my  Amazon fire TV stick so now we don't have to watch movies and such on our phones or iPads now we can watch it on our big 60 inch screen TV feel like we're at the movies .  I've been telling everyone about it. Over 200,000 movies and TV episodes in one little stick it's amazing we can now watch Showtime, ESPN, Netflix, Hulu plus,and Amazon TV immunities even listen to music with our Pandora or Amazon music", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "Really wanted to like it as have prime, but the menu is so limited and unfortunately the MLB.TV version only has about 1/4 the options of the ROKU version and it kept dropping wireless connection. I went and got a ROKU stick (as already had an older version of the regular Roku) and am satisfied at this point with the decision.", "verified": true, "helpfulness": "0/0", "author": "RCS"}, {"rating": 3.0, "review": "its nice", "verified": true, "helpfulness": "0/0", "author": "Theodore Vitale"}]