[{"rating": 5.0, "review": "Work much better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "richard noever"}, {"rating": 5.0, "review": "I love it!!!! I can watch movies and tv shows on demand. And there's such a variety, including using Netflix!", "verified": true, "helpfulness": "0/0", "author": "Wanda D. Kendrick \"shoe lover\""}, {"rating": 4.0, "review": "wow", "verified": true, "helpfulness": "0/0", "author": "Theresa Don"}, {"rating": 5.0, "review": "I am enjoying this immensely.  In a month it has paid for itself with the number of shows and movies I've watched.", "verified": true, "helpfulness": "0/0", "author": "Barb \"person\""}, {"rating": 3.0, "review": "Unit has decent performance. I was able to stream a 8GB mkv file using xbmc sideloaded.  It did pause/buffer a few times but I think that was more of it all being over wireless.  Overall, the unit seems very responsive.  For the price, it's a nice buy .. better than the chromecast I would say.One thing that I am very disappointed in is that I left the unit off for a period of time and when I went back to use it, it refused to connect to my wireless network (no changes).  Factory resetting did not help.  From a forum post, this seems to have been a common issue that happened recently.  Have not had much more time to go back and troubleshoot the connection issue but not being able to apply an update to it without being on wireless looks to be a bigger issue now that wifi has problems.", "verified": true, "helpfulness": "0/0", "author": "ctech99"}, {"rating": 5.0, "review": "I love it!!!TV, movies, games the fire stick has it all", "verified": true, "helpfulness": "0/0", "author": "R. Cartagena"}, {"rating": 4.0, "review": "Great, no excellent device. The only complaint is that it must be registered to an Amazon account with a valid credit card to download \"free\" apps.", "verified": true, "helpfulness": "0/0", "author": "ATECH COMPUTING"}, {"rating": 5.0, "review": "Its great.", "verified": true, "helpfulness": "0/0", "author": "Marco A. Garcia"}, {"rating": 4.0, "review": "Very easy to setup and dashboard is simple to navigate.  Received it as a gift and have been highly pleased with the Fire TV Stick capabilities.", "verified": true, "helpfulness": "0/0", "author": "JAC2CO"}, {"rating": 5.0, "review": "Amazed it could be so easy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]