[{"rating": 5.0, "review": "I really love, its amazing to have..", "verified": true, "helpfulness": "0/0", "author": "wanda"}, {"rating": 3.0, "review": "I receive a lot of buffering errors and have to delete the cache several times as a result.  These same sites work fine on my regular computer.  I enjoy the programming available but don't like that I have to contract with outside cable providers in order to work many of the sites.  Why bother with the Fire Stick if I'm already paying a cable provider for the service?  It's good but could be better if the buffering errors were corrected and third party providers eliminated.  Overall it's an okay product considering you pay a one time only fee to purchase it.  Not recommended if you don't already have a prime membership.", "verified": true, "helpfulness": "1/1", "author": "Katrina Slabchuck"}, {"rating": 4.0, "review": "It is a good way to streamline all of your TV and movie streaming services.", "verified": true, "helpfulness": "0/0", "author": "Angelique Soenarie Blair"}, {"rating": 5.0, "review": "We love our firestick!", "verified": true, "helpfulness": "0/0", "author": "Fred Angel"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "User friendly,  great product.", "verified": true, "helpfulness": "0/0", "author": "Marlene Posner"}, {"rating": 4.0, "review": "I love to be able to watch what I want when I want!", "verified": true, "helpfulness": "0/0", "author": "Mema"}, {"rating": 5.0, "review": "I'm not particularly tech savvy, but I was able to install and use my Fire TV Stick in less that half an hour.  And I love it.  I'm thinking of getting one for our other TV.", "verified": true, "helpfulness": "1/1", "author": "Linda Postlewaite"}, {"rating": 5.0, "review": "Great add on for TV viewing..", "verified": true, "helpfulness": "0/0", "author": "Patricia Bellerby"}, {"rating": 3.0, "review": "As far as the operational aspects, it's fine. The content... eh.... There are a pretty good amount of free Prime movies, but most I've never heard of. Yes, there's plenty to view if you just want to watch anything. Then, if you want more, it's ppv.", "verified": true, "helpfulness": "0/0", "author": "Jarvis Lankford"}]