[{"rating": 2.0, "review": "I wish I would have bought a Chrome cast,  FIre TV stick doesn't do anything new  that my DVD player doesn't already do.  I wanted to hook my laptop on my TV without using a HDMI cable. My nephew\"s Chrome cast will do that  but my Fire TV stick will not.  Plus I can only get sound to work if I go straight from my TV  I'm hard of hearing and I have to use headphones from a receiver but it will do not work with the Fire TV stick .  I'll see if anyone I know wants this or I'll try and return it.  Then I'll do has my nephew and buy Chrome cast", "verified": true, "helpfulness": "0/1", "author": "LeonR"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Greg Vierley"}, {"rating": 5.0, "review": "Quick, easy setup. Using", "verified": true, "helpfulness": "0/0", "author": "Ruger's owner"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Gloria S."}, {"rating": 2.0, "review": "At the time I purchased the Fire TV stick in January it was advertised that it supported HBO Go and the Plex app, and that you would also be able to stream from your phone to the TV similar to how the Google Chromecast (which I also own) operates.  When it arrived today, I was disappointed to find out that HBO Go is not currently available (with a tentative date of Spring 2015 on the website) and the Plex app needs to be paid for ($4.99).  The streaming functionality is only available if you have an amazon fire or a fire phone.  Seriously, how can you compare the Fire TV stick to the chromecast if you cannot stream from any smart phone or device to the TV.  The advertising is deceptive. Now I basically have a stick that is no better than my smart tv and provides no extra benefit.  I can't stream from my computer to the TV using the native apps without having to shell out more money.  I am planning on returning the Fire TV and buying a Roku which may cost more but provides the functionality I want without deceiving me into buying it and upselling me.", "verified": true, "helpfulness": "0/1", "author": "Tam"}, {"rating": 2.0, "review": "I was disappointed there wasnt more content available for customers who do not have an Amazon Prime account. It seems there would be thousands of programs to watch if you have prime but it wasnt made clear when it was purchased and seemed to me to be kinda self serving to Amazon. If i wanted prime i would have had it already, but i dont see spending 100.oo a year for content you can find elswhere. You also cannot access Nefflix or Huluplus without having those accounts activated as well. Seems the \"Free\" content isnt very abundant. Until i decide to get a Prime account, if i ever do, I now have another useless remote and something taking up one of my HDMI ports.", "verified": true, "helpfulness": "0/1", "author": "Kevin Aveyard"}, {"rating": 5.0, "review": "So easy to use.  It was already programmed to my Amazon account.  Pretty much sets up itself.  I love it!", "verified": true, "helpfulness": "0/0", "author": "RC Wood"}, {"rating": 3.0, "review": "I can not figure out how to use it. I did not want to pay extra for ever show I watch. Not for me.", "verified": true, "helpfulness": "0/1", "author": "cajunlady"}, {"rating": 4.0, "review": "Long wait but glad to get. It works as promised. Excellent entertainment!", "verified": true, "helpfulness": "0/0", "author": "sese2007 \"kriskris\""}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Charles R Overby"}]