[{"rating": 5.0, "review": "Good bye cable !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up even on our older model flat screen, even the app for the phone worked great the first time. Had been using the old dvd player to connect to Netflix, but it wouldn't get Amazon prime, and this does both now. I'm thinking of getting a second for another tv.", "verified": true, "helpfulness": "0/0", "author": "G. Byrne"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Yang Zhang"}, {"rating": 5.0, "review": "Better than what I imagined.. worth the wait and money", "verified": true, "helpfulness": "0/0", "author": "Cindy Z"}, {"rating": 5.0, "review": "I carry this with me on every trip I take...Plus with cloud drive, my family has full access to our family pics the minute we upload them,,,Home run Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "it's Okay. Performs as advertised.  However, searching for Netflix choices is slow compared to the PC.Hardware good; software iffy.", "verified": true, "helpfulness": "0/0", "author": "Fredex"}, {"rating": 4.0, "review": "It would get 5 stars if u could fling showbox instead of mirroring", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the Fire Stick.  We don't have Amazon Prime (are considering it) but are Netflix users.  This little gadget can be used on a whole host of apps for streaming.  We got it for the RV television which is not a \"smart\" TV and it's great.  It pulls the streaming sites right into the menu for you.  It's a bit tricky to get set up if you are not familiar, the directions leave a lot to be desired as what we were seeing on the TV was not the same as the instructions referenced, but we muddled through it.  Not that big a deal.", "verified": true, "helpfulness": "0/0", "author": "Yvonne C"}, {"rating": 5.0, "review": "Is like a huge tablet, depending on the size of your tv......absolutely recommend", "verified": true, "helpfulness": "0/0", "author": "esau talmadge"}, {"rating": 5.0, "review": "Easy set up, easy to use. Much more content than anticipated. Works very well. This product is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tom"}]