[{"rating": 5.0, "review": "Yes it did and I am thinking about buying another one for my TV in our family room", "verified": true, "helpfulness": "0/0", "author": "Barbara T."}, {"rating": 5.0, "review": "So easy to use, a Marine could set it up and do it!", "verified": true, "helpfulness": "0/0", "author": "Paul Ringheiser"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Steveb299"}, {"rating": 1.0, "review": "It was very easy to set up the fire stick. Out of the box, most things worked very well. However, when starting actual playback of any video content, it seems to skip and stutter quite a bit. Our old original Roku box sitting next to it does not have the same problems. Our other two Roku devices stream just fine. This particular device just can't seem to quite keep up.Amazon has contacted me and confirmed that they have known issues with Netflix and other issues on the Fire Stick. No update yet from them - -  still having issues with the various apps.", "verified": true, "helpfulness": "0/0", "author": "Robert Porter"}, {"rating": 3.0, "review": "Needs a strong Wi-Fi signal to work, and does not have the range of offerings comparable to AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Robert Waterbor"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love this! I can watch so many shows I have missed or see a rerun of a favorite show. Many options. So many choices for tv shows or movies, can always find something of interest. Very easy to set up. Good deal for the price.", "verified": true, "helpfulness": "0/0", "author": "Sonia M."}, {"rating": 4.0, "review": "Still figuring out what can be watched and what has to be subscribed to.", "verified": true, "helpfulness": "0/0", "author": "Tonia Holloway"}, {"rating": 5.0, "review": "It freed up my computer! Its great!!!", "verified": true, "helpfulness": "0/0", "author": "Judy Curtis"}, {"rating": 5.0, "review": "Bad ass.", "verified": true, "helpfulness": "0/0", "author": "Andy"}]