[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Traci Freeman"}, {"rating": 5.0, "review": "Install Kodi on it and watch your eyes POP!", "verified": true, "helpfulness": "0/0", "author": "Roy L Stewart Jr"}, {"rating": 2.0, "review": "I was hoping the firestick would be an improvement over my old Roku unit that I've been using for several years.  Although the firestick buffered quicker in the beginning,  it would pause a lot while watching a show.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "working great", "verified": true, "helpfulness": "0/0", "author": "Suzanna Hass"}, {"rating": 5.0, "review": "Perfect intro to technology for my parents. Easiest setup ever.", "verified": true, "helpfulness": "0/0", "author": "Caitlin R"}, {"rating": 5.0, "review": "Best way to receive Sling TV.  Netflix App is sub par compared to an Apple TV's app.  Obviously, Prime is conveniently accessed with it though.", "verified": true, "helpfulness": "0/0", "author": "WLReader"}, {"rating": 4.0, "review": "I have both the Amazon Fire stick and Amazon Fire TV. I have to say I prefer the Fire TV. The stick tends to buffer at least once per episode when watching TV on Hulu. The buffering is only a split second, but I have never noticed it on the Fire TV. It is not a bad purchase and I love being able to have my son watch Netfix on any of the televisions. I have noticed that sometimes the screen goes black after the commercial breaks sometimes, but I can hear the dialogue of the show I am watching. I think this may be a Hulu issue and not the Amazon Fire stick or TV since I haven't noticed this happening with Netflix. I just exit out of the show and click on Resume Episode. It fixes the issue.", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 5.0, "review": "👌🏻👌🏻👌🏻👌🏻👌🏻", "verified": true, "helpfulness": "0/0", "author": "ricardo"}, {"rating": 5.0, "review": "Works great. Who needs a smart tv now!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 4.0, "review": "I like the fact that I can see all the shows and movies I like and want. But it is not user friendly. To much navigating.", "verified": true, "helpfulness": "0/0", "author": "pamela lee"}]