[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Brad Nalls"}, {"rating": 5.0, "review": "All that I expected. Easy set-up.  Wish Vudu was an app.", "verified": true, "helpfulness": "0/0", "author": "Diona Dunn"}, {"rating": 3.0, "review": "It works ok. I got this exclusively to use for Sling TV. The picture is often very blurry for several seconds before becoming clear again...when you rewind and then play the channel often will freeze. I think the fire stick is a fine product but Apple TV is far superior in my experience.", "verified": true, "helpfulness": "0/0", "author": "Wade H Johnson"}, {"rating": 3.0, "review": "Was disappointed that I could not get Hulu as well as Netflix with the Amazon stick.", "verified": true, "helpfulness": "0/0", "author": "Rhonda T"}, {"rating": 5.0, "review": "LOVE the Amazon Fire and the Fire Stick. It's very simple and incredibly versatile. Great purchase", "verified": true, "helpfulness": "0/0", "author": "Micaela Lauer"}, {"rating": 2.0, "review": "Maybe it's just me and my Internet connection but I'm just not fond of the Fire TV Stick. I honestly prefer my Chromecast, which I have had ZERO problems with. The Fire seems to constantly have connectivity & serious lag issues  that the Chromecast doesn't have. Again, not happy but clearly others are so.... Try for yourself!", "verified": true, "helpfulness": "0/0", "author": "Melissa L. Johnson"}, {"rating": 5.0, "review": "Love this, very easy to use, and can watch many movies!", "verified": true, "helpfulness": "0/0", "author": "Wolfie"}, {"rating": 5.0, "review": "Love it I got one for a gift also and have it on another TV . Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Pamela J. Traverse \"Pam\""}, {"rating": 5.0, "review": "I love it! I waited for over 6 months to get it and finally I am enjoying it to the fullest....", "verified": true, "helpfulness": "0/0", "author": "Ofelia Rodriguez \"oleofe\""}, {"rating": 5.0, "review": "Easy to install. Love it! Much simpler and better than Apple TV .", "verified": true, "helpfulness": "0/0", "author": "S. Foster"}]