[{"rating": 3.0, "review": "Nice streaming device, especially if you have Prime. Setup was easy. Disappointed I can't stream my own photos or videos to my TV directly from my Samsung devices. Must first unload them to the Amazon cloud. Of major concern to me is the stick's data consumption. After little more than an hour of use, streaming a 54 minute episode of Rome, the stick consumed about 3-4 gigs of data. On my 30gb wireless data plan (no cable internet) that means the stick will only get very limited use. Using the Amazon Instant Video app on my smartphone didn't appear to consume nearly as much data.", "verified": true, "helpfulness": "2/3", "author": "Roy"}, {"rating": 4.0, "review": "works well.  I love it.  BUT, the remote control battery case is impossible to open.  Had to pry them both open with a knife.", "verified": true, "helpfulness": "0/1", "author": "Catski"}, {"rating": 1.0, "review": "My internet service is 150 down and 20 up. Blazing speed. But anything I watch on this Fire stick gets continual buffering and a pop-up telling me my available bandwidth is too low for uninterrupted streaming. What? 150 down is too slow? Don't have this problem watching on my computer. Or with my Roku. Just the Fire Stick.  Not sure where the problem lies.. But continually watching that little circle go around and around gets my blood boiling.", "verified": true, "helpfulness": "0/3", "author": "Mark Wallace"}, {"rating": 5.0, "review": "So far, it is working well. I like it better than the Google Chromecast I also have.", "verified": true, "helpfulness": "0/0", "author": "Dorian"}, {"rating": 4.0, "review": "This is NOT a reasonable replacement for Chromecast! I love the flexibility of the Fire TV Stick, but I can't use the apps I have on my tablet to stream content. You MUST use the apps offered by Amazon. And while they're offering a lot of cool apps and games, many that overlap with Chromecast's offerings, there is such a wide selection missing, I am forced to use both devices to get the widest selection of great content! No VUDU, no Crunchyroll, no Disney Movies... and that's just a start of what WON'T play on this device! That is VERY frustrating! I hope Amazon adds a casting option to this soon (there IS a mirroring option, but that's hardly the same!). I can only recommend this for folks who either don't plan on using Chromecast or have a spare HDMI port. Also, word of warning... this device is recommended to be plugged into the wall outlet, not the USB port on the TV, making it \"always on\" and thus, an energy drain if you don't use it a great deal!", "verified": true, "helpfulness": "0/0", "author": "rkr1970"}, {"rating": 5.0, "review": "Very Slick! I also purchased a ROKU Streaming stick at the same time to compare on my own. Well the Amazon stick won at my house!!!", "verified": true, "helpfulness": "0/0", "author": "Radcliff Hester"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Ingrid Martins"}, {"rating": 4.0, "review": "Ok this thing is pretty cool, I didn't expect to use it much as I already have a Chromecast but I have to admit having it's own remote is pretty awesome.  I'm taking off one star because it's performance is a little bit sluggish at times but then again it cost me less than a Chromecast.  The apps available are pretty impressive and it ties in to Amazon Prime nicely.  I think I would still recommend this to someone even if they are not a Prime subscriber, there is a good selection of 3rd party apps available.", "verified": true, "helpfulness": "0/0", "author": "Mike D"}, {"rating": 5.0, "review": "Love it.... Love it.... Love it.  I think this device is the best and cheapest smart tv solution available on the market.  I own 3 and only have 2 tv's in my home.  I even convinced my dad to buy 2.  This stick performs very well.  Prime videos is fantastic.  Combine this with the plex app, my cable subscription will definately be turned off soon.  I did have one go bad on me but no biggie. I think it over heated cause it never went to sleep and that cause it to not hold an Internet connection.  All I can say get yourself one and explore this greatness.  Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Thomas L James"}, {"rating": 5.0, "review": "Just set it up, so far love it!  It was easy to set up, crazy easy.  However, connecting to Hulu was a real pain (Hulu's fault), Netflix was a breeze as was CBSN news - and I stopped there on a high note and will resume tomorrow connecting to whatever else.......huge selection to choose from!So looking forward to ditching Time Warner Cable since they're bleeding me dry for crappy service and channels I don't even want!  Where I live you need some service because antennas don't work quite so well which makes this an absolute necessity.", "verified": true, "helpfulness": "0/0", "author": "kay collins"}]