[{"rating": 1.0, "review": "very angry with this. it worked the first day and now it will not connect at all.", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 1.0, "review": "This is absolutely the worst thing and i would not recommend it to anyone. It doesn't even work 90% of the time, it is very frustrating. I constantly have to keep resetting it.", "verified": true, "helpfulness": "0/0", "author": "Emily Burningham"}, {"rating": 1.0, "review": "Has a hard time playing on our tv.  Keeps droppinv signal.  Wifi box is in the next room.  Customer service is a joke.  Told me to take the wifi tower into the room I was watching the tv.  Does not work on the second floor.  Just threw the money out the window.  Told to me to ask my wifi carrier to extend the signal strength.  Very disappointed.  Can't hardly use it..", "verified": true, "helpfulness": "0/0", "author": "Royia"}, {"rating": 5.0, "review": "Great with lots of unique features.  All of the CDs I've bought are accessible  through the Fire Stick.  Didn't know to expect that.", "verified": true, "helpfulness": "0/0", "author": "Dr. Tim Wilson"}, {"rating": 5.0, "review": "Best product than chrome, Apple TV and Roku", "verified": true, "helpfulness": "0/0", "author": "Chandu"}, {"rating": 5.0, "review": "Super great value! $40 and this thing does all kinds of stuff.", "verified": true, "helpfulness": "0/0", "author": "James Walsh"}, {"rating": 5.0, "review": "It such an awesome device to have. Don't let the size and price fool you, it is capable of handling so much. I absolutely Love it. Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 5.0, "review": "Way better than google chrome which was returned in 24 hrs", "verified": true, "helpfulness": "0/0", "author": "Kristen K. Elliott \"Fabulous Single Chick\""}, {"rating": 5.0, "review": "We love it and easy to use especially for old dogs like us", "verified": true, "helpfulness": "0/0", "author": "Marilyn J. Mills \"mjm46\""}, {"rating": 4.0, "review": "I wish there were more options", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]