[{"rating": 1.0, "review": "Don't buy it if you have a poor connection for WiFi. I connected it in my bedroom only 60ft away from the wifi router and it always lost connection, even bought that netgear wifi booster and that didn't work!", "verified": true, "helpfulness": "1/1", "author": "Ken"}, {"rating": 5.0, "review": "I am very impressed with the Amazon FireTV Stick.  The set-up was easy.  I like the fact that not only can I use the remote that came with it, I can also set up my  smartphone as a remote.  I also like the compact size of the stick which makes it very convenient for me to use it with my second TV in my computer room.  Kudos to Amazon for this wonderful product!", "verified": true, "helpfulness": "0/0", "author": "Kipper"}, {"rating": 4.0, "review": "Think it's great.  I know I will like it better when I really find out all the ways to utilize.", "verified": true, "helpfulness": "0/0", "author": "Larry J. McPike"}, {"rating": 4.0, "review": "A little less responsive than the apple TV but works well and has a fair selection.", "verified": true, "helpfulness": "0/0", "author": "Athena"}, {"rating": 4.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "brad a mckenzie"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Mike Bromley"}, {"rating": 5.0, "review": "Love it. Can easily more it from tv to tv.", "verified": true, "helpfulness": "0/0", "author": "Jordan B"}, {"rating": 5.0, "review": "Work grate, I got it for my office.", "verified": true, "helpfulness": "0/0", "author": "Alvin"}, {"rating": 4.0, "review": "I had a few difficulties starting the Stick? I found using the extender, even when it isn't needed works better.  Now it starts up quick. Allows easy searching while having  a simple remote. I wish more content was available. I would like to access my xfinity content, or the major networks, but these apps don't exist.So, the product does what you want. I can get to Netflix, Hulu plus, PBS, etc. quickly and efficiently. (Utlra fast! ) But, now I wish more was available. It is worth the price.", "verified": true, "helpfulness": "0/0", "author": "Wherenow"}, {"rating": 5.0, "review": "Wonderful, works with my smart TV and all the applications.  Mostly use for Netflix and watching Amazon Prime movies.  Wish I had purchased a while ago.", "verified": true, "helpfulness": "0/0", "author": "June McDonald"}]