[{"rating": 4.0, "review": "I got this when it was on pre-order for $19.I do like it, but I don't like that you have to have cable to get a couple of the apps.", "verified": true, "helpfulness": "0/0", "author": "Kristen Johnson"}, {"rating": 4.0, "review": "It is easy to use. We're enjoying it however we found on one of the CRACKLE videos there was constant buffering. The wifi was strong on our other devices so we're unsure why that particular video had the problem.", "verified": true, "helpfulness": "0/0", "author": "Richard Harris"}, {"rating": 5.0, "review": "Easy to set up.  Good selection.  Similar to Roku but easier to use.  Much more flexible and useful than chromecase.", "verified": true, "helpfulness": "0/0", "author": "JAE"}, {"rating": 4.0, "review": "I thought there would be more PC to fire streaming instead of propriatary fire tablets and phone instant streaming to the device, but it has a lot of preinstalled options.", "verified": true, "helpfulness": "0/0", "author": "Carl Mcqueen \"xedef\""}, {"rating": 5.0, "review": "Great. Really nice.", "verified": true, "helpfulness": "0/0", "author": "Jack Weinbender"}, {"rating": 5.0, "review": "I have used the chromecast and Roku, but the fire stick has a nicer interface than the Roku and has the same streaming capabilities of the chromecast if you own a Kindle Fire tablet.  it also has a great app with voice controls built into it.", "verified": true, "helpfulness": "0/0", "author": "Andrew Garrabrant"}, {"rating": 3.0, "review": "Hate the remote. But otherwise, seems good. Disappointed that Showtime is shown as offered when, in reality, you have to already have SHO from your provider, so what's the point? Otherwise, set up was simple and I was glad for that.", "verified": true, "helpfulness": "0/0", "author": "Irm Brown \"Library Looney\""}, {"rating": 5.0, "review": "The GUI is pretty decent. I like the smooth transitions between items and its fast. I may buy another one for my other tv.", "verified": true, "helpfulness": "0/0", "author": "Bradley Stepp"}, {"rating": 4.0, "review": "Great device but is laking some big apps. The first thing I noticed was no VUDU or Target ticket app.We have a lot of UV so no way to see them with this device. So Just that means It doesn't get used very much. However everything that I have tried on it works fine and it is very easy to navigate. Just with it had VUDU.", "verified": true, "helpfulness": "0/0", "author": "Joseph Wheat"}, {"rating": 5.0, "review": "I love this little stick.  They worked great and turned my cheap TV's into smart TV's for a lot less money.  Movies load quickly and the connection is great, I have officially retired my Roku!", "verified": true, "helpfulness": "0/0", "author": "MsAngelaB"}]