[{"rating": 4.0, "review": "I need help with my fire TV stick  same its not OK was working fine until we switch tv's now ist working can same help me please", "verified": true, "helpfulness": "0/0", "author": "anabel"}, {"rating": 5.0, "review": "the stick works great!  I'm glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Diane Bingham"}, {"rating": 5.0, "review": "I really like the interface and the ability to control with my phone.  Good selection of channels and apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have two older Roku devices that I love. But after discovering that the Fire TV Stick could operate KODI, I bought the stick when it was on sale. This sucker is FAST! You can zip through all the channels and have a movie or tv show playing in no-time! I installed Kodi and have been on a movie watching binge...I cannot get enough of this thing. Best money I ever spent for entertainment...I totally recommend!UPDATE 8/24/2015: Still loving my Fire Stick-just bought another one! Get yur Kodi on!", "verified": true, "helpfulness": "0/0", "author": "Lavender Brown"}, {"rating": 1.0, "review": "it sucks", "verified": false, "helpfulness": "0/0", "author": "Marta Marino"}, {"rating": 5.0, "review": "Best $ I ever spent. I absolutely love it. It works perfectly and delivers on every aspect.", "verified": true, "helpfulness": "1/1", "author": "Kyle Cruz"}, {"rating": 5.0, "review": "So glad I ordered this.  Being a person over 60, I was worried about installation and operation, but it was really easy!  Enjoying all the new entertainment on Prime, that was underutilized till now.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Oh Amazon fire stick...where have you been all of my life?! This product was a replacement for my Logitech system (you know, the whole wireless keyboard system hooked up to your tv and another receiver that had to be used with it to work...all while collecting even more dust...yeah, that one). Anyway...this fire stick could not be easier to:1. Set up.2. Find shows.3. Forget you even have TV and binge watch OITNB and other Netflix and Hulu and SURPRISE....Amazon prime movies/shows!I love how simple this is and the setup animation was cute and simple and to the point. Highly recommend this affordable option for streaming shows and movies. I may even cancel my cable service and just keep Internet!", "verified": true, "helpfulness": "1/1", "author": "Stephanie Schaefer"}, {"rating": 1.0, "review": "Doesn't work to mirror iPhone or iPad.  That was the whole purpose of the purchase.  Very misleading to say \"Fire TV Stick lets you mirror your phone or tablet to your TV, or fling favorite apps to free up your small screen for other uses\" when it only works with Fire phones/tablets and some Androids.", "verified": true, "helpfulness": "0/0", "author": "Amy Sowards"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Yohana Valdez"}]