[{"rating": 5.0, "review": "Great product, easy to install, easy to use provides a lot of options", "verified": true, "helpfulness": "0/0", "author": "David Kochert"}, {"rating": 5.0, "review": "Love the fire stick.Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Donna key"}, {"rating": 5.0, "review": "I really enjoy the fire stick. It makes a different in my life", "verified": true, "helpfulness": "0/0", "author": "Janette H Pfaff"}, {"rating": 5.0, "review": "Love it!  Easy to set up and I love the idea of using it of need be for the kids while we camp!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent.  Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Marcie Sandoval"}, {"rating": 4.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Samantha Gunning"}, {"rating": 3.0, "review": "In our home we have two Roku 2's and two Fire TV Sticks. I bought the Fire TV Sticks when they first came out because I got a special deal for being a Prime member. Depending on what Apps you are planning on using, the Fire TV Stick might be all you need. If you are buying the Fire TV Stick for watching Amazon Prime, this is perfect. It has Netflix, Hulu Plus, HBO GO, etc. However, one HUGE thing missing from the Fire TV Stick is:  VUDU!!We have the majority of our video library on VUDU. The Roku obviously has VUDU and all the other streaming video apps we use (Hulu Plus, Amazon Video, HBO GO, WWE Network, etc.) On the Amazon Fire TV Stick, we are forced to use Flixster (when we can even get Flixster to load our library.) This is a very poor substitution for VUDU. Only the Ultraviolet movies will port over through Flixster and it will NOT port over any Disney movies. Sucks for the kids. (Disney Movies anywhere only ports to Vudu, Itunes, or Google play.)I do find the Fire TV Stick a little less user friendly as far as searching for what you need. However, once you have your apps set up it's not that much of an issue. Though the carousel view can be annoying while trying to locate an app if you have a lot. My husband prefers the WWE Network app on the Fire TV Stick over the Roku app. But, the Flixster app is horrible IMO.If you are searching for a streaming player, do your homework. Figure out what exactly you are wanting to use it for. If the Fire TV Stick had the VUDU app, I would recommend the Fire TV Stick to everyone. But, if you will use the extra content that the Roku provides, it's worth paying the extra money for the Roku. Right now, if any of our streaming devices decided to break, I would be replacing it with a new Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Ladyflower"}, {"rating": 5.0, "review": "This thing is awesome! So fast, so easy.", "verified": true, "helpfulness": "0/0", "author": "James Roddey Garrity"}, {"rating": 3.0, "review": "Overall it's good. But the interface respond slow after using it for some amount of time. When I restart it works good again. Please provide some way to shut down it when in no use.Also please provide support for cast screen of android lollipop devices. It's not compatible currently.", "verified": true, "helpfulness": "0/0", "author": "Japan Trivedi"}, {"rating": 5.0, "review": "This Fire TV Stick may just be the end to my ever increasing Comcast cable bill !  It is very easy to installand the remote is super easy to use.  I'm completely happy with this new gadget!  I'm telling everybody I know about it!", "verified": true, "helpfulness": "0/0", "author": "Karen Ende"}]