[{"rating": 5.0, "review": "I like it better than the chromecast, because of the build-in apps and games. Will be even better when you can do screen mirroring from your pc, tablet of cell phone. I have no lag whatsoever when using the included remote of the cell phone app.", "verified": true, "helpfulness": "0/0", "author": "Kyle D. Hudson"}, {"rating": 5.0, "review": "Everything the Chromecast should have been and more. Wish I had bought two during the fire sale.  I recently bought a smart tv and this fire stick made my older stupid tv smarter than my smart tv. Only cons are no obvious on/off method and limited ap choices. Hopefully this will really take off and Amazon will expand the lineup a bit. Where is my slacker radio??", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works well but after streaming for a few hours it looses Internet connectivity. I have a roku & chromecast & neither of them do that.(side note - I wish more channels were available like hbo)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Lack of apps", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I own a Fire TV and I've been very happy with it. I was excited to see Fire TV Stick and ordered on the first day it was announced. $20 was a no-brainer. My primary need for this was to use it with its parental controls enabled so kids could enjoy Amazon Instant Video / FreeTime.To my surprise, FreeTime app is nowhere to be found here. I was expecting it to have the same apps that the Fire TV does so this was rather disappointing.Next, I tried setting up the parental controls. The set up works fine but the execution of parental controls is woefully flawed. When it prompts you to enter your PIN for parental controls, the numbers can be easily read and memorized by kids because of the huge number pad visible on the screen. So it defeats the purpose of a parental lock when you have to inadvertently reveal the secret code to the kids. I used the Fire TV app on my Nexus 5, thinking that because I'm entering the PIN using my phone, it should not display the digits on the TV screen. No, it still FAILS MISERABLY when it comes to parental controls. There is no option to disable the feedback it gives showing each digit that you enter.Let's say that you do ask your kids to not look when you are typing the PIN, the way parental control works is still ridiculous. I wish it had the options to enable contents based on rating so I could block everything that was not rated G or PG. But I cannot. For every movie or TV show (including those for kids, rated G or TV-G), you MUST enter the PIN if you have parental controls enabled. When you enter the PIN so many times in front of kids, it's natural for them to memorize it, unless your child is so young (under 3) that they have yet to figure out numbers.So I thought that I would disable parental controls because it was useless. But I wanted to still lock it when purchasing apps or renting/buying content. It turns out that you cannot do that either. You must first enable parental controls to enable PIN-lock for contents.I only bought it for kids and since it cannot do basic parental controls, it is very much useless for me. I'm glad I only spent $20 on it.  I am hoping that Amazon gets this feedback to improve it in the next software update.▒▒▒▒▒ UPDATE 04/14/2015 ▒▒▒▒▒Amazon just released a software update (Fire OS Update 1.5) for Fire TV and Fire TV Stick that addresses the visible PIN issue. THANK YOU AMAZON!! I'm raising the rating for this product (4 stars). I'll update this review if Amazon finally offers FreeTime app with the Stick.", "verified": true, "helpfulness": "6/7", "author": "John Smith"}, {"rating": 4.0, "review": "Super easy to setup.", "verified": true, "helpfulness": "0/1", "author": "Tony Smith"}, {"rating": 3.0, "review": "The fire tv stick is good but the remote is too sensitive. Also, the fire stick tv freeze. I had to unplug and plug it back.", "verified": true, "helpfulness": "0/0", "author": "Michel Li"}, {"rating": 1.0, "review": "Wow I have never been this disappointed in a product I expected good things from.  As other mentioned it worked for the first day or two and was very excited, doesnt have every feature chromecast has, but the interface was very nice.Then, I havent gotten to connect to the wireless since.  The router is maybe 5 feet away and all my other devices have no problem.  Wish I could use it, but right now its just a small brick stuck into the side of my TV.", "verified": true, "helpfulness": "1/1", "author": "mdz_ctliu"}, {"rating": 1.0, "review": "Very disappointed with its performance. It hardly ever connects to my wi-fi and when it does it constantly drops the connection. I have it plugged in and am using the dongle but it doesn't work the way it should. I have other wi-fi devices in the exact same place and they all work.", "verified": true, "helpfulness": "3/3", "author": "Harold"}, {"rating": 4.0, "review": "So far it's been great.  No complaints and works as promised.  Wish there were more apps.", "verified": true, "helpfulness": "0/0", "author": "Mark  S. Fiala"}]