[{"rating": 1.0, "review": "Disappointed.  Cannot connect to internet. Have a strong signal but still can't connect. Tried everything troubleshooting says to do but nothing works.", "verified": true, "helpfulness": "0/0", "author": "Hank P."}, {"rating": 4.0, "review": "Easy to install and use.  Opens up so many great old shows.  Fun!", "verified": true, "helpfulness": "0/0", "author": "Douglas P Reynolds"}, {"rating": 5.0, "review": "This item is FANTASTIC!!! The wide base of viewing selection and the clarity of the picture is unbelievable!! Best Christmas gift I ever got for my husband at such an affordable price......I highly recommend this to everyone!!!!", "verified": true, "helpfulness": "0/0", "author": "Night dancer"}, {"rating": 5.0, "review": "Great little piece of equipment.  We tried the chromecast first and were totally frustrated with it.  The separate remote that is provided by FireTV Stick makes life easy.  Love it, love it, love it....", "verified": true, "helpfulness": "0/0", "author": "scott smith"}, {"rating": 1.0, "review": "The Fire TV stick is basically worthless as it has to be very close to a wireless router to update and stream movies. I could only get it to work if within 15- 20 ft (with and without the extender) of the router. Not functional in a house. I had purchased the stick to add the Fire TV in the master bedroom. I would not recommend this item if you want something that works well.", "verified": true, "helpfulness": "1/2", "author": "kak1002 \"Kristin King\""}, {"rating": 5.0, "review": "I have a fire TV and a fire TV stick. Love them both. It gets even better as more apps are added that support the basic remote.", "verified": true, "helpfulness": "0/0", "author": "MW"}, {"rating": 4.0, "review": "Amazon prime content is only available in EEUU", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 1.0, "review": "Disney apps that you can get with the Fire TV Stick do *not* work unless you have a current and supported cable TV subscription, which means that if you've \"cut the cord\" so to speak, you will not be able to access Disney content.  This is contrary to what the marketing material suggests.", "verified": true, "helpfulness": "0/1", "author": "Axe Grinder"}, {"rating": 5.0, "review": "Works better than I thought it would.  One very good purchase to say the least.", "verified": true, "helpfulness": "0/0", "author": "JOE O"}, {"rating": 5.0, "review": "works well so far", "verified": true, "helpfulness": "0/0", "author": "Alter Ego"}]