[{"rating": 5.0, "review": "I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Nature"}, {"rating": 5.0, "review": "Love it got tired of using Xbox to stream", "verified": true, "helpfulness": "0/0", "author": "marco maravilla"}, {"rating": 5.0, "review": "Much better than Chromecast.  Too bad Fire TV not available right now.  Don't plan on using it to watch anything at a hotel.  Most wireless services I have found at hotels are not fast or consistent enough to provide a video.  Firestick doesn't seem to be able to buffer enough to watch anything.  Otherwise the setup, apps and integration with Prime are easy to use.", "verified": true, "helpfulness": "0/0", "author": "Robert Wallace"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have the Amazon Fire TV for our bedroom TV and we love it.  We wanted another one for down in the living room but we don't have a lot of room for another peripheral item hooked up to it.  This was the perfect solution.  Works great and takes up no space!!", "verified": true, "helpfulness": "0/0", "author": "Auburn Sky"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Lori Edwards"}, {"rating": 5.0, "review": "I love, love, love my fire stick.  I only use it for Prime and Netflix right now, but debating whether to cut out cable altogether and use it all the time.  Oh, and my grandkids love pulling up one of the hidden object games I have on my Fire so we can all play together.", "verified": true, "helpfulness": "0/0", "author": "robyn6450"}, {"rating": 5.0, "review": "I am very happy with the amazon fire tv stick.  It is really easy to use.  I also have a Roku for another tv.  I find the fire stick much more user friendly.I bought it on sale which made the purchase even sweeter.", "verified": true, "helpfulness": "0/0", "author": "Kim Whitted"}, {"rating": 5.0, "review": "I was pleased with the simple and efficient set up. So much easier than the Roku (I have two of those.) Does not overheat like my Roku 2 and Roku 3. And the signal is stronger on my Amazon fire. I am now replacing my Roku devices with the Amazon Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Louise Santiago"}, {"rating": 4.0, "review": "Should be restarted after initial fire up and does need to be restarted once in a while otherwise it will stutter and freeze. Otherwise I think it was a good investment", "verified": true, "helpfulness": "0/0", "author": "Eva"}]