[{"rating": 5.0, "review": "I have never written a review on Amazon. But this product is worth it. I have only had it a short time so am not that familiar with everything it can do. What I am amazed at is how easy it is to install. I am not at all skilled in technology and remember having had a terrible time installing a dvd player just a few years ago. I thought(no matter what the product description said)that I would not be able to do it without help. I was actually nervous. Well, it took all of 5 minutes.Could not be easier! And works perfectly. I would encourage others who, like me, are older and not well versed in the tech world not to hesitate to try it--", "verified": true, "helpfulness": "0/0", "author": "Bruce Mintz"}, {"rating": 1.0, "review": "Disappointing.I live in Uruguay and have Netflix. I bought a Fire TV Stick only because I needed to watch Netflix in some of my devices but I cannot.Fire Stick does not work with Netflix outside USA but it is not stated anywhere. I only found out after I had already bought it.Please, only buy Apple TV. This was is not good at all.", "verified": true, "helpfulness": "1/1", "author": "fab"}, {"rating": 5.0, "review": "Love this, but needs better content still", "verified": true, "helpfulness": "0/0", "author": "Teresa M"}, {"rating": 5.0, "review": "It is an awesome device, very versatile and impressive, worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Carlos C."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Shermean Bellinger"}, {"rating": 3.0, "review": "Good selection of apps.  Netflix and Sling TV work well.  Would like to see it integrated with Chromecast TV and Android so users who have both, like myself, don't have to switch back and forth.", "verified": true, "helpfulness": "0/0", "author": "John Catapano"}, {"rating": 5.0, "review": "Just got our Fire TV Stick the other day, but so far it is awesome!  The remote is Bluetooth (I think), and it is really fast.  Putting in usernames and passwords for the various services is way faster than with any other device I have used.  Of course, if you need faster, you can use the app and input text from your phone, which also works well.We stayed at a hotel the other night and plugged it in to the flatscreen in the room.  We were able to connect to the hotel wifi despite the fact that it required authentication thru a webpage and then watch HBO and Netflix instead of whatever was on live TV.  It worked brilliantly.  If you stay in a hotel often, this thing has to be in your briefcase!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jatufalla\""}, {"rating": 5.0, "review": "What can I say I love love love my fire stick! It did mess up a month ago but after I changed the batteries it hasn't messed up again.", "verified": true, "helpfulness": "0/0", "author": "Danuelle"}, {"rating": 3.0, "review": "Gets a little buggy, responds poorly to remote.  Waiting for next gen of TV box hopefully with better specs. Otherwise it's good.", "verified": true, "helpfulness": "0/0", "author": "Richard Cervantes"}, {"rating": 3.0, "review": "First of all I'm a big Amazon fan. I have both the Fire TV Streaming Media Player as well as the Fire TV Stick. I have been using them both for many months now. Playing \"Amazon content\" is great on either device. The disappointment I have with the \"Stick\" is playing content from other vendors via one of the apps such as Netflix or \"Watch ESPN\".  On the Streaming Media Player all plays fine. Clear and uninterrupted. On the Stick however, playing Netflix or ESPN content quite often results in buffering. It's annoying to be watching and then to be interrupted frequently with the endless circular arrow -or- a frozen picture that, after 5 or 10 seconds, fast forwards to catch up. This happens frequently too.  like every 5 to 10 minutes. I've tried all I know to resolve this. I've uninstalled and reinstalled the apps, deregistered and reregistered my Amazon account. I've replaced my old router with a new dual band router. I have a strong signal throughout my home and I use Xfinity as my provider and get 30 Mbps speeds. Not really sure what else I could do to get uninterrupted playback. This issue only occurs with the Amazon Stick and not the Amazon Media Player.", "verified": true, "helpfulness": "0/0", "author": "Paul \"PW\""}]