[{"rating": 4.0, "review": "So far, it is working great. My biggest problem is that the games are not free. In the description, it is implied that the games are included for free. My kids were looking forward to playing many games, but cannot. Also many of the games require the game remote. So the 200 games isn't really 200 games. Otherwise I'm pleased.", "verified": true, "helpfulness": "0/1", "author": "Amy Adair"}, {"rating": 5.0, "review": "Excellent device.  The only regret is it won't play personal photos, videos, music from server on same network without moving media to cloud.", "verified": true, "helpfulness": "0/0", "author": "Richard C."}, {"rating": 3.0, "review": "I snatched one of these when they first went on sale at half-price for Prime members. After receiving it, I was disappointed that it needed a power outlet, since I already have so many things plugged in behind my television. I got it connected and found it to be a snappy device, but quickly realized I preferred the simplicity of ChromeCast to this device. One thing that worried me was the feature that tries to figure out what you want to watch so it can download and have things ready without buffering. Since my internet has a data cap each month, I was afraid of how much background data this thing was going to use. I decided to return it, but Amazon wanted $7 just to send it back. Considering I got it for $19 with free shipping, I figure I will just give it away before I do that.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Brian\""}, {"rating": 5.0, "review": "Seriously impressed with the Fire TV Stick so far!  Set up was easy and I was even able to hook it up through my Yamaha receiver's HDMI port to run the sound through my home system (with ARC hdmi to the TV).  I got this mainly because my (slightly) older Samsung HDTV doesn't support Amazon Prime Instant video.  I found a couple of pretty good apps including FilmMovement which plays great indie films in many languages for free (with ads, of course).  The usual familiar apps are also offered (Pandora, Youtube,Hulu+, etc).  If I were to offer any suggestion for improving this device would be to make the power cord somewhat longer to support having to run from the TV to a power outlet.  I'll update this review if any problems should present themselves :)", "verified": true, "helpfulness": "0/0", "author": "R. Stott"}, {"rating": 5.0, "review": "received this today and hooked it up easily... started watching a show from my watch list immediately.  I am sure I have a lot more to learn, but so far this beats the blu ray player we had been using.  I have to \"train\" my husband how to use it since he loves to watch crappy movies he finds on Amazon Prime.  I got in on the $19 sale and I may be wishing I had purchased more than one!  I have a Roku 3 as well in our bedroom, but I am the only one who knows how to use it.Glad I made the decision to jump in and buy it!", "verified": true, "helpfulness": "0/0", "author": "Lynnea"}, {"rating": 5.0, "review": "Got the Amazon Fire Stick after work today....watching Amazon Prime Videos within a half hour....very very easy to set up and start enjoying", "verified": true, "helpfulness": "0/0", "author": "Maxie \"MTV\""}, {"rating": 5.0, "review": "Easy to setup. Works faster than I expected. Perfect if you have Amazon Prime. If you want to try out distancing your self from cable, this is a small, cheap investment. I have an older Roku XDS and this thing kills it. I also bought a Roku 3 and it has a lot more choices, but this is a great deal and product.", "verified": true, "helpfulness": "0/0", "author": "D. Reprince \"Robo Ape\""}, {"rating": 3.0, "review": "We purchased this to replace the old Wii box that we used for streaming.  The set up was super easy.  I have had a few issues with the product.  First, and this may sound silly, the remote control is too small and sleek.  If you let this slip into your sofa cushions, it may be lost until your sofa breaks and you rip open the bottom to attempt self-repair.  The black color does not catch your eye if it is lying in a shadow.  I have little kids.  So, I am constantly searching for the remote.  It really needs a locator of some sort.Second, I still have not figured out how to turn it off without unplugging it.Third, the parental control feature prevents my 4 yr old from watching purchases I have made for her like Dora the Explorer without a pass code.  With the Wii, she could access all of the kids features without my assistance.Other than that, I think it is an excellent streaming device, especially for the price.  I managed to score the pre release price of $19.", "verified": true, "helpfulness": "0/0", "author": "zolunda"}, {"rating": 5.0, "review": "I have a Google ChromeCast and now I have the new FireTV Stick as well and it's really awesome. I have both because I look at it like a venn diagram - both do a lot of similar things, but both have things that the other won't do as well.So far the pluses are:1) Much quicker and smoother performance.2) Add-on apps (Spotify, as an example) make the experience even better.3) Amazon Prime content is native to it (of course) - which means, no more do I have to do the janky workaround to get it to play through the ChromeCast - that alone is worth it to me.Cons...The only thing I've come across so far is that the Spotify app does not allow you to just log in and access your content - so most likely other add-on apps will have some similar experience shortcomings. With Spotify, as an example, you have to play the content from your phone or tablet and \"fling\" it to the tv. Not a big deal.. but a fully integrated app would be a better UX (user experience).", "verified": true, "helpfulness": "0/0", "author": "Marc Cyr"}, {"rating": 5.0, "review": "Love this this stick. Very simple to hook up , set up instructions are very helpful. Amazon has a hit here with this product....I did  the pre order deal and got it for $19. I hooked it up on the back of my Yamaha surround receiver that has 4 HDMI inputs. Works well for me that way as my TV does not have any HDMI inputs. I will now sell my Roku and quit using my Blue ray player to stream. Highly recommend purchasing this product .", "verified": true, "helpfulness": "0/0", "author": "J. F. Vogel \"Road Runner\""}]