[{"rating": 2.0, "review": "While the design and interface of the Fire Stick are quite nice, I'm afraid I feel as though I've been sold something of a false bill of goods. Advertised as having double the memory of a Chromecast, I was expecting superior response times with similar abilities. Unfortunately, the responsiveness outside the main OS leaves much to be desired. It's slow to load and slow to respond everywhere but the main menu.My biggest gripe with the Fire Stick: want to play a locally stored video file? Better not be an mkv. Or even a large file. And it better be on the device you plan to stream from (not a network attached storage!) I attempted to use it with AllCast on my phone and it was either extremely slow or downright unresponsive, and crashed three times before I gave up. Want to stream anything of substance? Be prepared to pay for Plex (again) and have it be similarly slow to load and play, with frequent buffering. I suppose I could upload my videos to my hilariously small Amazon Cloud drive just to play them on my Fire Stick, but then I think \"nah, I can just use my Chromecast.\"Finally, I also downloaded the fire stick remote for my Galaxy S5. Unfortunately, this app takes 10-15 seconds to connect, but will lose its connection the moment the screen goes dark. This is quite frustrating if you are doing any sort of frequent navigation. The controls do seem to work reasonably well while connected, though.While I'm certain many folks will find this useful, if you want to do anything other than watch videos on Prime, be prepared to pay money for disappointment. I suppose I have only myself to blame for not digging deeper into the specs and capabilities of the Fire Stick.", "verified": false, "helpfulness": "0/0", "author": "B. Edelman \"Pluperfect Subjunctive\""}, {"rating": 5.0, "review": "Frickin Awesome! I love it", "verified": false, "helpfulness": "0/0", "author": "Ryan Rosander"}, {"rating": 1.0, "review": "Can't hate it enough.  I have never been so frustrated with a product.  We have not seen one more than 5 minutes at one time and mostly it's literally about 10 seconds.  Worst ever.", "verified": true, "helpfulness": "0/0", "author": "Jamie Amos"}, {"rating": 5.0, "review": "It is way more than I had hoped for, and probably only scratched the surface of what it can do.", "verified": true, "helpfulness": "0/0", "author": "Barry W. Harris"}, {"rating": 1.0, "review": "It does not work at all.  It plays for a few minutes and knocks every computer in the place offline.  What a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Orchardman"}, {"rating": 5.0, "review": "Great interface, and easy to setup.  I haven't done much with it beyond amazon prime video and netflix.", "verified": true, "helpfulness": "0/0", "author": "Michael Pinkham"}, {"rating": 2.0, "review": "When it worked... it worked great! The problem being that it rarely worked. To start I had issues with it when it connected to my internet. The screen would freeze up and nothing would happen. This would go on for an hour or more. Then I finally got it working, and as I scrolled through the quality programming on Amazon Prime, my TV shut off. Weird... but ok. So I turn it on and try again. TV shuts off again. So the remote buttons for some reason turn off my Vizio TV. No problem! I have a Kindle Fire HDX (which I love) that can control the app. It works fine for 2 days, and then the stick stops connecting to my internet... not just my internet, but all available open networks in my area. It won't connect to anything at all. So I'm returning it", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Easy to start a movie.", "verified": true, "helpfulness": "0/0", "author": "Linda Lambertus"}, {"rating": 5.0, "review": "OMG...I Love It...Just what I wanted....THANKS", "verified": true, "helpfulness": "0/0", "author": "OhioGrammyOf3"}, {"rating": 4.0, "review": "Just started checking it out so far I like what I see", "verified": true, "helpfulness": "0/0", "author": "Eugene Westland"}]