[{"rating": 5.0, "review": "I have a Amazon fire tv and now I have the fire tv stick for the bedroom", "verified": true, "helpfulness": "0/0", "author": "Milton Marrero"}, {"rating": 5.0, "review": "Convenient, compact for on the go.", "verified": true, "helpfulness": "0/0", "author": "Joe Zanghi"}, {"rating": 3.0, "review": "Can only get apps for Amazon no HBO", "verified": true, "helpfulness": "0/0", "author": "MichiganSucks"}, {"rating": 4.0, "review": "We've use it here and there. Seems a lot like Roku and similar stuff like that. Gets the job done. I do have to say I don't like paying for Prime and then having to pay for shows to watch. That's pretty ridiculous. Since I won't pay for shows, we use our Roku more.", "verified": true, "helpfulness": "0/0", "author": "J. Henry"}, {"rating": 5.0, "review": "Simply the Best, tried the rest while waiting, no comparison.Make sure you check out how to side load apps. Amazzzzzzing", "verified": true, "helpfulness": "0/0", "author": "Oldhockey"}, {"rating": 5.0, "review": "Husband have me this as a valentine day gift, I love it!!! Easy to work and connect!  We have an Apple TV but it doesn't have the amazon app., and the streaming fr my iPad to the Apple TV was sometimes a hassle the connection would give me error or cut off.  For the price it's an awesome tool and very easy to function and worth it!!! Telling and showing all my friends and family about it and they are interested in buying it....", "verified": true, "helpfulness": "0/0", "author": "Darleen Vega"}, {"rating": 5.0, "review": "Absolutely love the ease, of the Fire TV Stick  and the selection of programming available. My only problem is having to plug the power pack in to an outlet, my main TV in the family room will have to wait until I am able to access, but it is wonderful in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Kellianne"}, {"rating": 5.0, "review": "I love my fire stick. We have a smart tv but when streaming I constantly ran into buffering issues. Since I added the fire stick I don't have that problem at all. I dropped my movie channels on my cable since I am a prime member and get all the perks of the free streaming. I highly recommend this product if you all ready have a prime membership. It's extremely inexpensive for the benefits you receive.", "verified": true, "helpfulness": "0/0", "author": "Samantha R."}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Opening a whole new world of things to watch", "verified": true, "helpfulness": "0/0", "author": "K. House \"Memie\""}]