[{"rating": 5.0, "review": "It was so easy to install and started working immediately. We really like the Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Freedom1868"}, {"rating": 5.0, "review": "It is awesome!", "verified": true, "helpfulness": "0/0", "author": "Nancy Westerhoff"}, {"rating": 3.0, "review": "Wanted to use the Stick in the living room but it was too far away from the router and operation was intermittent. Moved it to the master bedroom a lot closer to the router and the operation is good there. Installation was quick and easy.", "verified": true, "helpfulness": "1/1", "author": "Rhettcoz"}, {"rating": 5.0, "review": "Synced up easily, remote was simple to use..It is everything I hoped it was.", "verified": true, "helpfulness": "0/0", "author": "Gary Hutton"}, {"rating": 5.0, "review": "There are great features that this little device brings to the media market. I like that not only does it do the regular video applications but you can listen to music and view images from my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Nomore MS \"Bob\""}, {"rating": 3.0, "review": "its okay. i din't realize i wouldn't be able to pull up the competition, like Pandora or Ihart radio, or at least i hadn't figured out how. as a prime member thats ok because they a lots of free music any way. the draw back to that is that you have to sit in front of a computer and load it like iTunes. I haven't really used for anything but music at this time but that is what i bought it for.", "verified": true, "helpfulness": "0/0", "author": "Randy J. Bye \"Bike Camper\""}, {"rating": 5.0, "review": "I have a roku and chromecast and by far this is a better solution from ease of use and user experience.  I have smart televisions in the house and I have switched them over as well.  Overall, nice design and function.  I have not played with Apple TV as much yet, but it's right there thus far", "verified": true, "helpfulness": "0/0", "author": "dhakimi"}, {"rating": 5.0, "review": "So much easier and intuitive than Apple TV. I set up my account one time and haven't had to enter it again (as I was having to do with Apple)  Truly, you don't need any technical know-how for this thing. If you think you don't need it because you have 'on-demand' with your cable service - you're wrong. Especially if you're an Amazon Prime member. This has allowed me to really take advantage of all the *FREE* material available to members. Best Christmas gift ever!", "verified": true, "helpfulness": "0/0", "author": "Margaret Mayer"}, {"rating": 5.0, "review": "Only four days with the stick but loving it. I plugged it into my Pioneer AVR and had to change the aduio settings from the pre-set fire stick setting but it worked. Streamed a few movies and TV shows and it had good quality picture and sound. Fantastic purchase for the price as long as you are a Prime member for the available content.", "verified": true, "helpfulness": "0/0", "author": "Aaron R Bart"}, {"rating": 5.0, "review": "I love my new Fire Stick from Amazon! Years ago I had purchased a Sony media streaming device, whose service was shorty at best. The Fire Stick is amazing, responds so quickly, plays shows without interruption, and has such a clear picture. Could not be happier! Plus, the remote app on my smartphone is flawless, and I use it often to mess with my boyfriend while he is searching for programming.", "verified": true, "helpfulness": "0/0", "author": "Jessica Spring \"Amira's Mommy\""}]