[{"rating": 3.0, "review": "I really like the concept of the Fire TV Stick, but the actual product could use some work. It takes a very long time to load and often drops the wifi connection.", "verified": true, "helpfulness": "0/0", "author": "Sarah Schnorrenberg"}, {"rating": 5.0, "review": "Excellent device, meet my expectations.", "verified": true, "helpfulness": "0/0", "author": "omar"}, {"rating": 3.0, "review": "Bought one, and thought it was great,then the Fire TV Stick died after a couple of months, I replaced it with another one. If this one dies, I will try Cromecast", "verified": true, "helpfulness": "0/0", "author": "Stephen A Casebolt"}, {"rating": 5.0, "review": "As advertised.  Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Nathan Rice"}, {"rating": 5.0, "review": "Excelente!", "verified": true, "helpfulness": "0/0", "author": "R. Goncalves"}, {"rating": 5.0, "review": "Saved me a lot of money buying this and it works great!", "verified": true, "helpfulness": "0/0", "author": "Doerames"}, {"rating": 5.0, "review": "Yes it did.  I am really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "just me \"Just me\""}, {"rating": 5.0, "review": "If you have a Netflix membership definitely download the app because there are a lot of TV shows you pay for even on Prime that are included with your streaming Netflix membership. We watched the Hunger Games (the three movies currrently out) and the first we had to buy (couldn't rent it), the second was available via Prime for free, and the third we had to rent. That was also disappointing. The device and how it works is still excellent, though, and that's why I gave it a full 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Sean Siemen"}, {"rating": 3.0, "review": "it was very disappointing.Spent almost 2 1/2 hours on phone with support team at tier 1,2 and 3 to no avail", "verified": true, "helpfulness": "0/0", "author": "Carmen V."}, {"rating": 5.0, "review": "Love this thing. Haven't used my Apple TV since I got it. I've been an Apple fan for years, but find myself slowly converting over to Amazon because their devices integrate better, and for less money, with a larger selection of content.", "verified": true, "helpfulness": "0/0", "author": "Vermonter"}]