[{"rating": 1.0, "review": "I got this for the $19 deal for prime members, but it does not work.  After spending a long time on the phone yesterday with tech support, there is still no resolution to the problem.  Hopefully they will eventually get back to us and fix the problem or send a functioning product.  If they do I will update my review.  But so far, we are very disappointed & researching the Google Chromecast vs. Roku as a replacement.Update:  I called again on Monday but was told there was no update on the trouble ticket yet.  I called again today (Wednesday) and was told there is still no update.  The person on the phone offered to have the unit replaced, but then said the replacement could not be processed because the trouble ticket is still open.  She transferred me to a supervisor who was not at all helpful and had a bad attitude.  He said someone will call me tomorrow (Thursday).  So after another 45 minutes on the phone today (Wednesday) there is no resolution and I am stuck with a non-funtioning product. I am very dissappointed in Amazon's customer service on this issue.  I have am generally an amazon fan - I have their credit card, 2 kindles, and the new echo, but I'm not thinking very highly of them any more!!!  If there is no resolution tomorrow I am returning the fire stick and will spend my $ on a roku - and won't buy it on amazon!", "verified": true, "helpfulness": "1/1", "author": "S. Phillips \"shannon\""}, {"rating": 5.0, "review": "AWESOME . . . nothing more to say.  Have two Chrome casts & the Amazon Fire Stick blows Chrome Cast away.  I was lucky to order one for only $19, but well worth the $39 asking price.Faster than Chrome Cast.Easier to control that Chrome castMore responsive to Fast Forward than Chrome Cast.Higher definition than Chrome CastJust about as easy to set-up as Chrome Cast.  Chrome Cast uses an app.  Fire Stick uses the remote.Only thing Chrome Cast does that Fire Stick does not is You TubeWe used to have to hook a laptop to the TV to watch Prime shows.  Now we do not & I darn happy about it.Chrome Cast does some things right.  Netflix is easier to search on a PC, Tablet or Phone than just send it.  Fire Stick you have to use the remote.All in all. . . side by side . . . Fire Stick comes out the winner.  No going the throw away the Chrome Cast, but it is not going to be used as much.", "verified": true, "helpfulness": "0/0", "author": "tell family"}, {"rating": 4.0, "review": "Love it you can have movie night every night easy to operate an great apps", "verified": true, "helpfulness": "0/0", "author": "Edward Fulton"}, {"rating": 5.0, "review": "I like it - easy to use.", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "TFRANK"}, {"rating": 5.0, "review": "Really have enjoyed this the past two weeks.  Lots of apps and covers many of the things we like to watch.", "verified": true, "helpfulness": "0/0", "author": "J. Joseph"}, {"rating": 5.0, "review": "The Best TV Stick ever ! very fast and quality product ! got it for $24 Bucks ! can't get better than this ! Love Amazon , Love Fire TV Stick !", "verified": true, "helpfulness": "0/0", "author": "Amish"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tammy L. Swartz"}, {"rating": 2.0, "review": "I seem to be one of the unlucky ones that is having Wifi connection troubles. I'm using a Wifi \"G\" network, and the FireTV Stick is connected to the back of my Sony receiver and in a cabinet. The WiFi connection is constantly coming and going...and I am using the extender cable (which is very short...about 1\"). It's in the same cabinet with my Sony Bluray player that is able to stream HD movies with no troubles from the same router.The remote is also very \"glitchy\"...it sometimes won't respond at all, and then \"catches up\" all at once to past commands. I suspect that the device software gets hung up dealing with the WiFi problems, which causes the remote to stop responding.I'm buying a 6 ft HDMI extended cable to see if repositioning the Stick will work.From what I have seen, I like the UI, and I really like how it connects automatically to my Amazon account and CloudDrive Photos....I'm looking forward to using it for slide shows.I just hope I can get it to work...luckily I only paid $19 for it (but now I'm buying an $8 HDMI extended...hmm....)** UPDATE **Tonight, I used an Android app on my phone called \"WiFi Analyzer\" to check the signal strength inside the cabinet. The app suggested that WiFi channel 6 had less \"competition\" from my neighbors (the router was previously on the \"auto\" channel setting, and had chosen channel 1). After switching to channel 6 in my router, things definitely seem to have improved. The network drops still occur, but far less often, and I was able to stream an entire \"Flight of the Conchords\" episode with only one buffering issue. I still think that the FireTV Stick has especially finicky WiFi reception, so you have to have to be extra careful with your network setup if you're having problems. Hopefully, the longer HDMI extender will allow me to reposition the stick to improve reception further...", "verified": true, "helpfulness": "0/0", "author": "Brian R. Williams"}, {"rating": 5.0, "review": "This is a Awesome product.Quick and easy to hook up.I'm going to buy another one.5 Star product for sure!!!", "verified": true, "helpfulness": "0/0", "author": "Maurio Davis"}]