[{"rating": 5.0, "review": "Fire stick was easy to set up.  Connection to the wifi was nice and strong despite being in another room across the house.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "K. N."}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "santos morales"}, {"rating": 4.0, "review": "I actually bought this to give as a gift for my Dad for Father's Day.  But I was curious about it, so I tried it out beforehand and liked it so much...I ended up keeping it!  The only gripes I would have about it is I didn't realize that you needed to have an outlet near the TV in order to plug in the stick in order for it to work.  Also, the remote is pretty small so it is easily lost.  Replacement remotes run $15 which is a little expensive in my opinion. They have an app for your phone or tablets, but it took up too much memory on my S5, so I had to delete it.  Also, I have to pay for a lot more movies and TV shows then I thought I would have to.  I already pay yearly for Prime, so they should really make more content available for Prime members...especially older movies.But all in all, it was a good buy and I would recommend it to other people who are already Prime members.", "verified": true, "helpfulness": "0/0", "author": "Kristin"}, {"rating": 5.0, "review": "worked great once we got directions from on-line.", "verified": true, "helpfulness": "0/0", "author": "Susan Eicher"}, {"rating": 5.0, "review": "this is about the best piece of high tech modern electronics i have ever came across.believe me i have been around for over 75 yealrs on planet earth.this a wonderful device and it seems like it gets better every day.", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 5.0, "review": "Works well, easy to install, should have gotten sooner", "verified": true, "helpfulness": "0/0", "author": "gale"}, {"rating": 5.0, "review": "easy to use, fast and easy set up... AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Gee Money"}, {"rating": 4.0, "review": "Some connection issues in a few occasions. But overall, good interface and options", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It was nothing special. I bought both Roku and a amazon stick and I thought the Roku was easier and had a easier and bigger remote. Amazons remote to small and not enough options. I don't like how I have to input a credit card right away and sign up for Amazon when using the stick....Roku didn't require  a Credit card when turning on....", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Works perfect, cheap, got shipped fast and would recommend to anyone", "verified": true, "helpfulness": "0/0", "author": "Jose Lopez"}]