[{"rating": 1.0, "review": "A rip off.  Videos are not free unless they are something not worth watching.  Even old episodes of Bonanza costs.  This was confirmed by the Amazon rep who took me to a previously unfound webpage explaining what they should have told us prior to ripping off our money.  Only good thing is I'm returning it and won't let it happen again.", "verified": true, "helpfulness": "0/2", "author": "Quil \"Phil\""}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "S. O. Smith \"Sandie\""}, {"rating": 3.0, "review": "works great with exception of Plex. If you use Plex app... you will be miserable as it stutters almost all the time", "verified": true, "helpfulness": "0/0", "author": "mrcisco"}, {"rating": 1.0, "review": "Did not meet my expectations, range to wireless Internet not good", "verified": true, "helpfulness": "0/0", "author": "Carmen Gaytan"}, {"rating": 3.0, "review": "The TV has to be  right next to your wifi signal.", "verified": true, "helpfulness": "0/0", "author": "Byron"}, {"rating": 2.0, "review": "My wife and I are unplugged and couldn't wait for the fire stick!My wife and I were really excited to finally get our hands on the new Fire TV Stick. We waited patiently for weeks before a new batch was in stock and shipped out. When it finally arrived we immediately unplugged our old Chromecast from the living room TV and setup the Fire TV stick. We loved that it came with a dedicated remote control (Chromecast does not have one) and that you could also control it through an app on your phone or device. We were also really excited that we would once again be able to watch programs on Amazon including digital movies that we rented or purchased AND Prime Amazon Instant Video content. Things were great for the first couple of weeks but then we started running into problems:- Hulu and Netflix skip and stop frequently during playback (but Amazon shows don't)- YouTube is difficult to navigate (takes FOREVER to type something into the search bar)- The keyboard on the iPhone app doesn't work- The \"cast\" button that you use with Chromecast recognizes your fire stick (YouTube app on iPhone and in the Chrome browser on your computer) and it says that it works but it doesn't.- Can't add things to the TV queue with YouTube the way you can with Chromecast- Because the Chrome browser cast button doesn't work (even though it sees your Fire TV and says that it will work) you can't share your desktop or your browser screen on the TV.Overall we are just disappointed with Fire TV. We really thought it was going to have greater capabilities than Chromecast, but in reality it's just the opposite. Now we are planning to go back to our Chromecast. I think that Fire TV will be a secondary device in our house. The only use I'll really have for it will be to watch any shows or movies that we buy, rent, or stream from Amazon from time to time but for the big players (Hulu, Netflix, YouTube) we will be using Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Michael E. Riith"}, {"rating": 5.0, "review": "Easily adds Amazon Prime to a TV.  Just plug and play.", "verified": true, "helpfulness": "0/0", "author": "1D"}, {"rating": 5.0, "review": "LOVING THE FIRE STICK!! Easy to install and use. Great selection of movies and shows.  Will be buying an addition device", "verified": true, "helpfulness": "0/0", "author": "Danielle R."}, {"rating": 2.0, "review": "This thing is a cheap p.o.s.It cuts on and off of wireless at will (regardless of what network I'm on), the menus are sluggish, and it is lacking in simple features (like a sleep timer).The Netflix App for it hardly ever works. The Amazon Prime videos buffer for days (again, regardless of what network I'm on) and it's just overall a piece of s***.Just buy a Roku or actually any other alternative and move on with your life, free of the burden of this thing.P.S. they call it a fire stick cause it will burn your time up via hopeless troubleshooting", "verified": true, "helpfulness": "0/0", "author": "Dasler04"}, {"rating": 4.0, "review": "I have only had the Stick for about a week. I find that the remote is much too touchy for my liking and takes a lot of patience to maneuver. I also have found that when using the remote, I see a delay in response time. Not certain if this is a result of a slower Wi-fi connection, the TV or the product itself.", "verified": true, "helpfulness": "0/0", "author": "Matthew E. McCue"}]