[{"rating": 5.0, "review": "Easy to navigate shows, fast (way faster than the Blu-ray I was using before for this), cheap, and simple! Great device so I bought a second one for the kids.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Brad Tanner\""}, {"rating": 5.0, "review": "Ecxelent", "verified": true, "helpfulness": "0/0", "author": "Raul Duran"}, {"rating": 5.0, "review": "It is the perfect accessory to have a computer on the TV screen", "verified": true, "helpfulness": "0/0", "author": "layla burrus"}, {"rating": 5.0, "review": "We LOVE this fire tv stick! It super easy to setup and use. So many options! I wish we would have gotten one sooner.", "verified": true, "helpfulness": "0/0", "author": "Leigh"}, {"rating": 5.0, "review": "So far an amazing little device (it replaced my Apple TV and is much better) and especially for the money! It's portability is much better than others and handy to switch to another tv with automatic use with no configuration! Love it!", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 5.0, "review": "Very good works great", "verified": true, "helpfulness": "0/0", "author": "Peter Osborne"}, {"rating": 5.0, "review": "So easy to  connect. Can move to any room.  Really like it.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 2.0, "review": "I bought this product, but had to send it back. The Fire stick kept getting disconnected from the internet even though all of my other devices were working just fine. After doing some research it seemed like many people are reporting this problem as well. When it was connected it worked great. It was just annoying to have to keep unplugging it to get it to reset.", "verified": true, "helpfulness": "0/0", "author": "NB"}, {"rating": 3.0, "review": "Have just started using it. Has all the features promoted. Navigation is not easy. Takes a long time to find what you want. The search mechanism is very cumbersome.", "verified": true, "helpfulness": "0/0", "author": "Royce A."}, {"rating": 5.0, "review": "This product is quite a surprise.  I've had Chromecast for a while.  Big difference.  Plug it into TV HDMI port, plug in power cord (won't power from a USB like Chromecast, but no big deal).  TV found it, and switched to that port.  Found my home network, asked me to log in.  Then it played a short video showing me how it worked, and bam!  Done!Remote control:  Fairly simple.  Up/Down/right/left/select buttons.  Sort of obvious.  Move around and pick stuff, when in main interface, Left/right buttons will back up, or go forward 10 secs (there are also buttons for that purpose, but this was more convenient for me, because they are at the top of the remote. Then a back button, like on a phone, to take you back one step, in the menus.  A home button (obvious).  A menu button that brings up a short menu of choices, like turning on captions, or whatever.  Then reverse, pause/play, fast forward.  More on this later.Don't remember exact menus, so from memory:Organization of media:  Pretty well done.  Far-left menu, Movies, TV, Games, Watchlist, others.  Then after picking, say TV, there are several lists, like Recently Watched, New on prime, Popular on Prime, New on TV, Popular on TV, etc.  Nice that they separate the stuff I can watch, for free, well not free, but included with the Prime Membership I've had for a couple of years, from the stuff I'd have to pay extra for.  Can search for stuff, fairly easily, with remote.Now that I've covered the negatives...On day one, went through several of the lists of movies, and TV shows, and used the \"Add to Watchlist\" option for anything that sounded like it might be interesting.  Several HBO series, and others I'd never heard of, and then a couple that were \"Amazon Original Series\", one of which was called \"Bosch\", which i will review separately with 5 stars.  The amazing thing is this:  Play the show, it has no commercials.  Finish, and while the credits are playing, an option comes up to start the next episode. No break, no mess.  Very cool.  However the best part is something I believe they called RADAR.  During a scene, in the show, push the up button, and you get a list of characters/actors IN THE CURRENT SCENE.  That came in really handy during a scene where we sort of recognized an actress from a long time ago.  No pulling up the program, on IMDB, on my tablet computer, then trying to figure out which of a hundred characters she was playing.  Nope, just the up button, and Fire pulled in info directly from IMDB.  Not everything, but enough.  From this same screen, you can find, even jump to, music from the show, by scene, all the characters/actors, even trivia.  Click on an actor, and GENERALLY get a list of their other movies/shows, which you can select to view, then save to watchlist.  Really well done, Amazon!Then there is the Fire Stick app for my phone (I use Android).  Works just like the remote, except it has use of a keyboard, which make searching easier, and the ability to use voice commands, which I haven't tested.  This is great, because with Chromecast, I have to use the device showing the movie, to pause, etc, and with Fire alone, my wife and I struggled with one remote.  Now we have TWO again!  Yeah.So far, I've seen no hesitations, or buffering, or any such nonsense.  One time, I did SOMETHING, and my movie went black.  Sound was there, but no movie.  Just backed out, and then resumed on that movie and it was fine.  Only happened once for us, so far.Great feature - AWESOME screensaver!  Awesome pictures!  COMPLAINTS-Can't stop them, can't back up, and they don't have a caption to tell you what/where they are!  Bummer!Bottom Line:  In one weekend I watched 4 movies, an old episode of \"Voyage to the bottom of the sea\",  a few minutes of a old Batman TV movie from the 60's, and 6 straight episodes of \"Bosch\" (an amazing series, so far).In addition to Amazon Prime regularly saving me money on shipping, money on movies/shows on my laptop, it even saved me on the cost of the Fire TV Stick I just bought.  Then all the stuff we watched this weekend, Amazon definitely earned my ten bucks this month.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]