[{"rating": 4.0, "review": "Am pleased with all with my Amazon Prime access except the inability to mirror anything from my preferred Apple platforms of iPhone and iPad.  Need to work on this.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Love it. Works great.", "verified": true, "helpfulness": "0/0", "author": "Alisha"}, {"rating": 4.0, "review": "I love my fire stick. I can mirror easily using my kindle fire, however, my new S5 will NOT mirror, found out this is common complaint.I ended up using my push2tv, which is fine I guess, but since everything is now hooked to my bedroom tv, on the ceiling, cannot really get to it to use in living room, SIGHI hope they get the software fixed soon with S5Btw, worked with my.s3", "verified": true, "helpfulness": "0/0", "author": "txcowgirl"}, {"rating": 5.0, "review": "I went to Best Buy to buy a Roku2 to replace my 5 year old one that finally died. When the salesperson mentioned the Stick and how much cheaper it was than the Roku2 I was intrigued. I really only used the Roku to stream Netflix, Pandora, and a few other apps. So if you are not planning on using all 1,000 plus apps on Roku and are satisfied with the ones the Stick has to offer then the Stick is for you for a lot less money than Roku. And there is no box to collect dust with the stick!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "It has a great interface and it's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey"}, {"rating": 5.0, "review": "Works great and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Dean M."}, {"rating": 5.0, "review": "very easy to use", "verified": true, "helpfulness": "0/0", "author": "philip seger"}, {"rating": 5.0, "review": "Perfect for my needs.", "verified": true, "helpfulness": "0/0", "author": "K. Kincaid \"Black Betty\""}, {"rating": 5.0, "review": "Very easy to install.  Comes already set up with your Amazon ID.  Works smoothly going from one application to the next.", "verified": true, "helpfulness": "0/0", "author": "Texas-Writer"}, {"rating": 5.0, "review": "So far it's pretty awesome. The cable cord is going to be cut very soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]