[{"rating": 5.0, "review": "A lot better than what I expect. Easy to use fast", "verified": true, "helpfulness": "1/1", "author": "jymga"}, {"rating": 4.0, "review": "This is so user friendly and easy to set up. It is also nice that it plugs into your TV instead of having a box to take up room.", "verified": true, "helpfulness": "0/0", "author": "Kelly Ball"}, {"rating": 5.0, "review": "5 stars for the device.***1 star to Amazon for fulfilling its channel partners first - direct customers (and most loyal, last - apparently). This same review goes for Basis Peak. Pre order at Amazon: nothing. Bestbuy.com next day. Ugh!!Just got mine at Best Buy for $25 DESPITE my pre order on day #1 as a prime member for $20.1) don't gripe if you \"pre ordered\" because Amazon doesn't care about us. Plain and simple. (I digress - go ahead Amazon and fulfill your Channel Partners before your direct customers...especially the loyal ones.2) the stick does exactly what it claims to do. I had no issues, personally.  A+Amazon: fix your fulfillment process.", "verified": true, "helpfulness": "3/5", "author": "Austinkid"}, {"rating": 5.0, "review": "Easily the best bang for the buck since XBMC on RaspberryPi...", "verified": true, "helpfulness": "2/2", "author": "BrokenAntler"}, {"rating": 5.0, "review": "Great Value for the money. It met and exceeded my expectations", "verified": true, "helpfulness": "1/1", "author": "Robert G."}, {"rating": 4.0, "review": "I own a Chromecast and right off the bat I can tell this is a much better piece of hardware. Not surprising given its specs. It's zippy, transitions are smooth and quick and the picture quality is much better than that of Chromecast (using comparable apps). For instance, Blu-Ray movies played from my local network via the same Real Player App are better with the Fire TV stick than with Chromecast. There's less buffering, the sound is better and the overall picture quality is top notch.Amazon does a really good job with the user experience with this device IMHO. Having a remote is the first step in that direction. Even the Netflix-inspired carousel, addition of your Prime wishlist and having a separate Prime tab (to show free content for Prime members) are all great. Amazon owns IMDB so it's no surprise that IMDB ratings are there on most content, yet another plus. The app selection is surprisingly large. Not only are you able to find an install music and video apps, but also games, screensavers, weather and news apps. The few basic (casual) games I tried, worked well using the included remote. Basically, the end goal here for Amazon is to have any app that is available on its Kindle app store. Another surprise big plus here was the inclusion of a LIVE 24-hour CBS and Bloomberg news apps. I don't know how Amazon pulled that one off, but kudos.Moreover, the Fire TV stick also allows connecting to WiFi networks that require access through a login page, something that the Chromecast doesn't support. A huge boon for travelers. I paid $19.99 for the device on pre-order but I would not hesitate to pay full price for it considering all the extras you get over other comparable devices.Now for the demerits of the product. So far, just one. From the get go this has been a buggy product, requiring several reboots to get  functionality working. For instance, it took me multiple reboots to get it to show up on my iOS and Android Youtube apps as a Miracast device and even then it wouldn't stick around. I have yet to be able to see the Fire TV stick as a Miracast option on my other supported apps, where Chromecast shows up. The much touted device mirroring functionality has also been a dud and MIA on my device. When I turned on my device this morning, no Prime content would load and the device would get stuck in a perennial black \"loading\" screen. This was only repaired after a hard reboot on the device.I suspect Amazon will have an OTA update to fix these glitches, but it just shows poor QA on their part. I did not have such issues with Chromecast. All in all, a great device and one that will ensure I finally start consuming more Prime Video content. Unfortunately, when it comes to software reliability \"it's still day 1 for Kindle TV stick\".", "verified": true, "helpfulness": "0/0", "author": "DigiSym"}, {"rating": 5.0, "review": "Just got back from Best Buy,  only $24.99 there.  Installation was so easy and connecting to my Amazon account was a snap.  I have never used a device like this before, so I have nothing to compare it to but I am happy so far with the ease of use and the quality of the picture.  So far, no problems with the streaming.  I downloaded the app from the Google Play Store and it makes it easy to search by voice.  Would highly recommend!", "verified": true, "helpfulness": "1/1", "author": "P. Burks"}, {"rating": 5.0, "review": "Does what it's supposed to do.", "verified": true, "helpfulness": "1/1", "author": "Kevin J. Kelly \"kalibreGaming(kevin)\""}, {"rating": 1.0, "review": "Major wifi connectivity issues, unusable", "verified": true, "helpfulness": "11/16", "author": "Kyle Hill"}, {"rating": 5.0, "review": "Sleek. Fast. Awesome!", "verified": true, "helpfulness": "1/1", "author": "Ehsan Choudhury"}]