[{"rating": 5.0, "review": "this is awesome!", "verified": true, "helpfulness": "0/0", "author": "Patrick S Sell"}, {"rating": 5.0, "review": "Need a bigger screen to view a Prime movie? Want to access all your Amazon files? Music, photos, etc. FIRE STICK is the answer--a gadget for a hdmi slot on your tv plus a simple controller that opens new viewing vistas. Requires wifi and an accessible electric outlet. The Stick is my candidate for Amazon's bargain of the year.", "verified": true, "helpfulness": "0/0", "author": "E.C. Norton"}, {"rating": 5.0, "review": "love, love, love this item. Great price, responsive, gets all my favs. Buy this you will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "R. Ferrara"}, {"rating": 5.0, "review": "Very great item hands down best I've used and easiest", "verified": true, "helpfulness": "0/0", "author": "keith"}, {"rating": 5.0, "review": "I love it.  It was easy to set up and easy to watch movies.  A great item.  Only one problem.  When the Fire Stick is connected it interferes with my regular TV viewing, so I have to unplug it.  I've read other Samsung owners have the same problem.  Other than that I am really glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "D Dunn \"Old Dave\""}, {"rating": 5.0, "review": "Works great.  I bought another!", "verified": true, "helpfulness": "0/0", "author": "Rick Tremmel \"rtremmel\""}, {"rating": 1.0, "review": "I bought 2 firesticks.  They work real well on amazon prime movies. But then I subscribed to netflix and thats when the trouble started.  The picture on netflix would start breaking up and tiling.  Amazon told me it was my internet connection but as I get 40 mbps, I did not think this was true.  So I went out and bought a Roku 3 just to see if it was my internet connection or the firestick itself.  On the Roku, netflix and everything else streams perfectly.  Do not buy this piece of crap.  Get a Roku.  You won't be sorry.", "verified": true, "helpfulness": "0/1", "author": "David Strauss"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Kelvin F."}, {"rating": 5.0, "review": "I have both the fire tv and now the stick. If you are not into gaming the stick is all you need! Don't waste your money on a smart tv. Get yourself a stick.", "verified": true, "helpfulness": "0/0", "author": "Andres Carrera"}, {"rating": 5.0, "review": "The best tool I have purchased to view t.v. with.", "verified": true, "helpfulness": "0/0", "author": "Creative Beauty"}]