[{"rating": 5.0, "review": "Easy to install, worked immediately. Does it all, no need for anything else.", "verified": true, "helpfulness": "0/0", "author": "Carol L Kuck"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Andrea B. Fordyce"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Nonnies"}, {"rating": 5.0, "review": "It's awesome tool for our not so smart TV", "verified": true, "helpfulness": "0/0", "author": "srinivas kadiyala"}, {"rating": 1.0, "review": "I have not ordered this.", "verified": true, "helpfulness": "0/0", "author": "Herbie Davis"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Lowell G."}, {"rating": 2.0, "review": "Wanted it for when we are camping but the internet signal is not strong enough so a waste of money.", "verified": true, "helpfulness": "0/0", "author": "L. S. Byington"}, {"rating": 5.0, "review": "Easy to install.  If I can do this, anyone can! Loving watching what I want at any time of the day.", "verified": true, "helpfulness": "0/0", "author": "Laurie D."}, {"rating": 1.0, "review": "What a disappointment.  First the good stuff.  The packaging was really nicely done, about what you would expect from Apple even.  Conceptually this is a great idea.  The bad stuff.  It just straight up doesn't work.  There are two hints that this product has serious problems: the product was designed to plug directly into an HDMI port, but it is supplied with an extender to move it to a \"better\" location.  Then there is a separate power connection where you have to run a cable to USB style power supply and plug that into the side of the stick.  So it seems that Amazon already realizes that the product has a few short comings, namely it doesn't work well when shielded from the net work and it must require more power than the HDMI port can supply.  In my case the problems did not end there, the device could connect to my network but not maintain a connection to the internet.  I had multiple computers tablets, phones, and other devices running on the network with no issues.  I checked network speed (through other wifi connected devices) and it was always better than 5mbps, low but not unreasonable.  I should also note that my smart TV will stream Netflix flawlessly.  To bad this didn't work as the concept is very appealing.  I think Amazon has to understand what makes Apple products so cool is not the box they come in, but that they work straight out of the box,", "verified": true, "helpfulness": "0/0", "author": "Clearly Thinking"}]