[{"rating": 1.0, "review": "I was not expecting to have to plug it in for optimal performance", "verified": true, "helpfulness": "0/2", "author": "Dan G."}, {"rating": 4.0, "review": "Was surprised to find that it works well on a medium speed DSL Internet line.", "verified": true, "helpfulness": "0/0", "author": "E H Smith"}, {"rating": 5.0, "review": "Easy to use! Love my \"Prime\" on my TV!", "verified": true, "helpfulness": "0/0", "author": "blblackbear"}, {"rating": 2.0, "review": "1) The means of accessing the battery compartment of the remote is not designed for human fingers. The product as delivered therefore is nice and sleak but it's going to be ugly after the batteries are replaced once.2) WAAAAAYYYY too much pay-per-view material mingling with the \"I subscribe to Prime so it's free to me\" material.3) Often the only option when you're looking at a potential viewing choice is \"Add to Watchlist\", when there is no particular reason to delay watching it.3) If the material looks like it might be free, it is old.4) Stubbornly insisted on not sending out 720p60. The cable DVR, bless its heart, does send out 720p. Maybe this is due to the age of my Fujitsu plasma panel, which you must realize was the best thing you could possibly buy when I bought it. I should probably return the Stick for this reason.Get this: The cable system in our area, bless its heart, was out from 7:30 to at least midnight the day this thing arrived and my wife didn't want to watch anything on it because she was put off by old material or by interesting material that might accidently result in a charge to her credit card.Comparisons I can think of to other OTT-enabling devices or setups:I have a Acer Aspire Revo \"nettop\" intended to access media from a server. I have never gotten around to connecting the Revo to the LAN. And when I tried XBMC (which has a different name now) I found its UI pretty but hard to use with a proper keyboard. This thing comes with WiFi, which seemed to be working.I have a Raspberry Pi B with Raspian. It is even less developed in my case as an OTT enabler.Gave an extra star because I couldn't bring myself to say I hate it.", "verified": true, "helpfulness": "0/0", "author": "cardiffman"}, {"rating": 3.0, "review": "I tried to play deer hunter 2014 on tv fire stick didn't work order game controlled on Jan 5 will not ship until April or May Very unhapppy with amazon for first time I have", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it love it love it...all the choices, one small stick...easy to use!!!!", "verified": true, "helpfulness": "0/0", "author": "Robyn Hall"}, {"rating": 5.0, "review": "disappointed it took so long to ship but very impressed with the performance and operation", "verified": true, "helpfulness": "0/0", "author": "Doug Prudek"}, {"rating": 5.0, "review": "This is easy to install. Works well. Meets all of my expectations, and the android app with voice control works well. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Scott Meredith"}, {"rating": 4.0, "review": "Worked beautifully but we live in a somewhat rural area and don't have unlimited internet so it isn't a good option for us. Very sad. I'd give it 5 stars if I could use it.", "verified": true, "helpfulness": "0/0", "author": "avidreader59"}, {"rating": 5.0, "review": "Best stick on the market! Thanks Amazon for again being the best. Can't wait for my Echo!!!!!!", "verified": true, "helpfulness": "0/0", "author": "RachelChef420"}]