[{"rating": 5.0, "review": "Love this.  So far it is a great buy!", "verified": true, "helpfulness": "0/0", "author": "Mary M. Shapek \"bluestar\""}, {"rating": 2.0, "review": "The menu isn't user friendly like the Roku that I have on another tv. I accidentally bought an episode of a program when I pressed the title expecting to get a synopsis of the program and no opportunity to confirm or reject purchase.", "verified": true, "helpfulness": "0/0", "author": "Brenda S. Isaacs"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "poco1949"}, {"rating": 4.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "5134"}, {"rating": 4.0, "review": "We really like this firestick!  It has everything we wanted and more! The only downside is there isn't an off button, it just goes into sleep mode. Other then that it's fantastic!  Has a ton of apps and great quality video playing.", "verified": true, "helpfulness": "0/0", "author": "reviewlady123"}, {"rating": 1.0, "review": "sounds simple and easy to use, but be prepared for the inevitable \"blue screen.\"  i've had this for almost 4 months now.  and tonight is the 3rd time the screen goes blue and tells me that the content i am trying to watch is not authorized.  i am a prime member!  the programs are listed as being available to prime members!if you do an online search for \"amazon fire stick content not authorized\" you will come across blog after blog of people experiencing the same problem.  and the solution is always the same....try unplugging this, try unplugging that, try this, try that.....amazon should not be selling a product that performs this marginally and requires reboots reminiscent of early, cheap computers.  my television is a sony bravia, not some cheap, no-name knockoff.  certainly should be compatible.for what is it worth, my other television is a cheaper brand and has a roku unit attached to it.  guess what?  no problems in 2 years.  ever.amazon failed on this product.", "verified": true, "helpfulness": "0/0", "author": "lookingback"}, {"rating": 1.0, "review": "At first I loved the Amazon fire stick, but then I realized it was a cheap piece of s*** that never works.I constantly receive an error that says \"the device you are using is draw low bandwidth\" and I can't watch any shows without Amazon Prime Buffering every 2 minutes. Amazon Prime is the only service I encounter this problem with and only while using The Amazon fire stick. Net Flix, and numerous other services work (including our Chromecast in another room, all our tablets, computers and other internet devices).I've reset the Amazon Fire Stick, I've reset the internet. It doesn't fix them problem.As soon as another Chromecast gets here, the Fire Stick is going in the garbage.", "verified": true, "helpfulness": "1/1", "author": "Thomas Morabito"}, {"rating": 4.0, "review": "I disconnected my cable and have Hulu Plus and Netflex to watch. I also have an antennae (indoors). I find that sometimes my screen freezes and I have to wait for it to \"boot\" itself when using Hulu Plus. Netflex doesn't have that problem. All in all, I am very happy with the Fire stick. Love the fact that I don't have to spend big bucks on cable!", "verified": true, "helpfulness": "0/0", "author": "Nancy Pagel"}, {"rating": 5.0, "review": "For an existing Amazon customer it's the perfect thing! I love the setup on the firestick, as opposed to my smart tv. Very user friendly, very intuitive.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 1.0, "review": "Very few good movies and a TVs are free.", "verified": true, "helpfulness": "0/1", "author": "Zhifeng Yu"}]