[{"rating": 5.0, "review": "its really cool, this is my first streaming device", "verified": true, "helpfulness": "0/0", "author": "uncler"}, {"rating": 3.0, "review": "after update, it won't stay connected even when sitting beside the router.  while it tries to connect to a very good connection, the connection then shows up as a very weak signal.  things may have been this way even before the update, but I'm not sure anymore.  all I know is the thing was good for 30 minutes, and now it's totally awful.UPDATE:I used the extender, plugged the stick into the wall, and moved the unit to the side hdmi port placing it right above the router this time.  It seems to work like it was meant to now.  Ideally, extender or not shouldn't make too much of a difference.  In this case, it mattered.", "verified": true, "helpfulness": "1/2", "author": "Earl.Jornales"}, {"rating": 5.0, "review": "Arrived before estimated date. Was easy to set up, Works great.", "verified": true, "helpfulness": "0/0", "author": "John K. \"JK\""}, {"rating": 5.0, "review": "Bought this as a Christmas gift for a friend of mine, never seen her so tickled over something, she loves it, great job amazon", "verified": true, "helpfulness": "0/0", "author": "Movie Guru \"3ddude\""}, {"rating": 5.0, "review": "Glad I pre-ordered it on a reduced price.  Great little product.  Setup was pretty straight forward, followed the instructions and had it running in less than 30minute.  Enjoying the HBO series Rome now.  :-)", "verified": true, "helpfulness": "0/1", "author": "Warp8x"}, {"rating": 5.0, "review": "Don't get to use it as much as i would like but it is portable and works well", "verified": true, "helpfulness": "0/0", "author": "EM"}, {"rating": 5.0, "review": "Great product was up and running in minutes", "verified": true, "helpfulness": "0/0", "author": "got riped off"}, {"rating": 5.0, "review": "Easy to set up! We love it!", "verified": true, "helpfulness": "0/0", "author": "Angela S."}, {"rating": 4.0, "review": "It's a nice device but I already have so many others. I like this device well enough but it's still missing some features. I have the Tivo Roamio, Roku 3 and the Chromecast and this guy just isn't compelling enough to make me want to use it full time. The place that I can see this one being useful is on the road. It has a remote (already better than Chromecast for that reason).Pros:Slingplayer for mobile - works with remote and the app is free. Don't need a phone to use it. Just log in and watch.The Remote - who doesn't like that? It helps with so many thingsThe network - save multiple wireless connections. you can't do that on Roku or ChromecastGames - there are several little games to play. You can't do that on the Chromecast and the Roku is very limitedAmazon content - video and music are rock solid on this deviceCons:Missing several apps (google play, vudu, for example. Roku has so many more)Wifi Hotspot not working yet. This will be a big plus when it happens.Can't use your playstation controllers with the games without sideloading apps. This should be officially supported.I used the Amazon Fire Stick on a recent trip but without the hotspot/wifi update for hotels then it's not as useful as it could be. I was able to use it with my TP-Link TL-MR3040 with the wifi bridge for this purpose. It gets past the hotspot login by allowing the device to bridge with a device that has a browser so that you can get past the login page.*** I contacted Amazon support on 3/22/2015 and they still don't have hotspot/hotel update and could not tell me when it will come out. I also asked for firmware update information link so that I could know what has been updated so far but they could not produce it. I don't think they really know anything about their product. At this point....I would say that this is a vapor feature and should not be expected to be implemented. However, if they do they I will change my review to 4 stars.I'll update this post with 4 stars when the update comes out for hotspot/wifi hotel usage. That's really the only reason that I purchased it in the first place.---- Update ----Amazon has added hotspot to the device... so I've changed my rating to 4 stars.", "verified": true, "helpfulness": "0/1", "author": "trek"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "R. Roy"}]