[{"rating": 5.0, "review": "Love it!  It is a great addition to our set up. Are using it more as the weeks go by.  Well worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Gary K. McRoberts"}, {"rating": 3.0, "review": "Disappointed that unable to use it at resort as that was the reason for purchase.", "verified": true, "helpfulness": "0/3", "author": "Dennis"}, {"rating": 2.0, "review": "I purchased the Fire stick specifically to stream sling tv, however it does not do a very good job.  Continuously lags and that's if i'm able to stream at all.  This is on a 50 mb connection as well.  My Roku 3 has no issues at all with Sling.  Going to just get another Roku to replace the Fire stick.  I would avoid if purchasing for sling tv use.", "verified": true, "helpfulness": "1/1", "author": "Mataa"}, {"rating": 5.0, "review": "There is so much to watch with the Prime subscription that the price of Prime is well worth it.  You can see some shows that you would need to pay for on cable and moves as well.  I am into Kung-Fu flicks to see some of the old-school chop socky flicks is a treat.", "verified": true, "helpfulness": "0/1", "author": "Katsudor"}, {"rating": 4.0, "review": "You need to be near router for good wi fi streaming. I feel it is the isp throttling down bandwith", "verified": true, "helpfulness": "1/1", "author": "Jjs37 \"jjs1865\""}, {"rating": 5.0, "review": "Easy to set up & use", "verified": true, "helpfulness": "0/0", "author": "john clancy"}, {"rating": 5.0, "review": "Love this for my television in my kitchen that had no way for me to watch Netflix.  Now I can!  Makes me very happy to be able to watch while working in my kitchen now.  Setup was quite easy.  The only thing I didn't realize was that the stick needs to also be plugged into the wall.  Not a huge deal, I just wasn't expecting to have another cord to deal with.", "verified": true, "helpfulness": "1/1", "author": "Melanie Bess"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Harley A. Jensen \"music lover\""}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Patricia A DiGioia"}]