[{"rating": 2.0, "review": "We tried everything and couldn't get it to work.  Strange thing is our ChromeCast device works just fine.  Returning the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Rock Hound \"Rock Hound\""}, {"rating": 5.0, "review": "Great product. Works as advertised. Super price, too.", "verified": true, "helpfulness": "0/0", "author": "William Kinney \"WLK\""}, {"rating": 5.0, "review": "I have been telling everyone that will listen.", "verified": true, "helpfulness": "0/0", "author": "Marian Medeles"}, {"rating": 5.0, "review": "the fire tv stick is very affordable, user friendly and portable that you can take it with you to another television or home.  WE had originally purchased a SAMSUNG blueray dvd player but it didn't have AMAZON on it.  We ended up returning it and once I saw the FIre TV Stick being advertised we purchased it.. My husband and I just love it and can't say enough good things about it.  Thanks AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Iris Wright"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Melody C."}, {"rating": 4.0, "review": "I purchased this during the sale for Prime members of $19. I wasn't quite familiar with the fire TV and or stick but I'm happy that I purchased this. It has allowed me to give up cable and has offered more channels than cable. I've had a roku for over 4 years and didn't use it as much but since buying the fire TV stick,  I use my fire TV stick daily. Now that I no longer have cable I watch a lot  Amazon Prime movies, Hulu and Netflix via the fire TV stick. this was a great buy especially for the price. The only reason for 4 stars is you still have to use the power USB/AC cord. I was under the impression that it didn't need it, but I'm still happy otherwise", "verified": true, "helpfulness": "0/0", "author": "wen"}, {"rating": 5.0, "review": "How do i mirror the fire stick from my ipad to the tv meaning i want to play my videos from my ipad to the tv through the fire stick", "verified": true, "helpfulness": "0/0", "author": "johnny"}, {"rating": 5.0, "review": "Way too cool!", "verified": true, "helpfulness": "0/0", "author": "DeAnna Piccini"}, {"rating": 5.0, "review": "So far I love it!  Great apps and features.  I also like the simplicity of the remote.  I have had other TV streaming devices and this is by far the best I've owned.", "verified": true, "helpfulness": "0/0", "author": "Kevin Gentleman"}, {"rating": 5.0, "review": "Excellent product. Highly recommend especially for prime members.", "verified": true, "helpfulness": "0/0", "author": "Nikole Willis"}]