[{"rating": 3.0, "review": "Pros: Smooth navigation with very intuitive interaction with the sleek remote. Offers a lot of content such as Netflix that's much easier to work with than Netflix off our Blu-ray player. Netflix comes off great. Cons: HBOGO is out-of-sync with its audio (audio is about a half-second ahead of the content) as it renders HBOGO unwatchable. I researched this and found that dozens of others have posted about this issue over the last few months in an Amazon forum (http://www.amazon.com/HBOGO-Audio-sync-Fire-stick/forum/Fx3THIQES502AOU/Tx3BBSA3JCR2T0P/1?_encoding=UTF8&asin;=B0089BPEZS) and many have posted that the solutions given to them are unsatisfactory. One solution was to turn off Dolby, which, even if it does work it defeats the purpose of HBOGO on the Fire Stick. I myself asked for help regarding this issue and Amazon only sent me a form email in response. I'm not confident I'll use the stick all that much if Amazon continues to ignore the problem.", "verified": true, "helpfulness": "1/1", "author": "Tom Oling"}, {"rating": 4.0, "review": "I LOVE IT! only complaint is it randomly buffers while I am watching a show (not sure if that is my internet) but my mom has a roku and that never happens on her, BUT i paid less than half when I got this (20 dollars) so overall I LOVE IT and strongly recommend! super easy to set up :)", "verified": true, "helpfulness": "0/0", "author": "Maiioo"}, {"rating": 5.0, "review": "Awesome! Better than my other 2 devices!", "verified": true, "helpfulness": "0/0", "author": "Carl Thomas"}, {"rating": 4.0, "review": "Long as have a pretty strong wifi signal it's great.. if have less then very good you may experience issues..", "verified": true, "helpfulness": "0/0", "author": "bald11971"}, {"rating": 5.0, "review": "Love my fire stick", "verified": true, "helpfulness": "0/0", "author": "David Enriquez"}, {"rating": 5.0, "review": "Oh so beautiful...installed Kodi on this....is awesome...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great, but not perfect. I have an overheat issue with it.", "verified": true, "helpfulness": "0/0", "author": "SungJun Lee"}, {"rating": 5.0, "review": "Easy to setup and exceeded my expectations with the apps you can download. Can't beat the price either!", "verified": true, "helpfulness": "0/0", "author": "Tom Elmore"}, {"rating": 4.0, "review": "Our family enjoys the Amazon Fire TV Stick. Wish there was an xfinity app to be able to view more things via Xfinity beyond just HBO Go or Showtime otherwise this has been easy to use.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Eriksen"}, {"rating": 3.0, "review": "Overall a good product. My major gripe is that casting does not work well. Chromecast does a much better job at casting. We have to constantly try to disconnect and cast again. With Chromecast you push the button one time, and whatever you want casted, is! Much more consistent than the Fire Stick.The Fire Stick is responsive, and Netflix loads quickly and works well. Another gripe is the remote is very sensitive. We have it placed near other remotes, and sometimes we accidentally bump the Fire Stick remote and it switches the source to Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "maverickfan22"}]