[{"rating": 4.0, "review": "It works good, just the internet connection constantly disconnects. Usually in the middle of something I'm watching. Just a pain to keep reentering the wifi password and reconnecting.", "verified": true, "helpfulness": "0/0", "author": "aimee hoschar"}, {"rating": 5.0, "review": "Love this gadget!!  Purchased another for bedroom.  Combined with indoor HD antenna I am FINALLY rid of Comcast.", "verified": true, "helpfulness": "0/0", "author": "Pleased in PA \"morning glory\""}, {"rating": 3.0, "review": "I was shocked to learn the VERY limited shows and movies on Amazon Prime. I thought you would not have to pay for so many shows on top of your Prime membership.The stick was easy to set up and use.It is misleading that there are apps on the stick like Showtime that you can not use without Showtime through your cable provider", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 3.0, "review": "It is not as dependable as I would like. I have amazon prime and ended up getting charged for movies that were marked for prime. It cuts out at random times and it is not my wifi. Still not totally sold on product", "verified": true, "helpfulness": "1/1", "author": "JOHN D. DUNCAN"}, {"rating": 2.0, "review": "have not recived my order onorder since jan 1 /1/2015", "verified": true, "helpfulness": "0/1", "author": "Anthony Pike"}, {"rating": 4.0, "review": "Works as advertised, so a solid 3 stars. Flipping through menus is speedy. It did take me a little bit to grasp the interface as I also own/use a Roku 2 XD. The interface confusion is caused by amazon content being accessed though main menu screens while other content can only be accessed once you start an app. When you look at your recent activity you will see Amazon videos you have watched plus other apps.I do not use the supplied power adapter (Cord is too short to reach the surge protector on the other side of entertainment center. Problem is my setup; not cord length) When I power off my TV the Fire stick powers down too. This is a slight annoyance because I have to restart Netflix to get back to what I was watching the night before.Waiting for iOS app and the ability to screen share from any device, including PC. I will add/remove stars accordingly if/when these features are added.", "verified": true, "helpfulness": "0/0", "author": "Joe McVicker"}, {"rating": 5.0, "review": "I love it and so easy to set up", "verified": true, "helpfulness": "0/0", "author": "willik5@mail.auburn.edu  Ed Williams"}, {"rating": 5.0, "review": "Love it!  Took a little while to get hooked up but customer service was awesome and helpful.Got it as a gift and great to view videos on my tv instead of tablet.", "verified": true, "helpfulness": "0/0", "author": "judy Floit"}, {"rating": 5.0, "review": "Great alternative to network TV", "verified": true, "helpfulness": "0/0", "author": "Gale D. Brugh"}, {"rating": 5.0, "review": "it just works", "verified": true, "helpfulness": "0/0", "author": "Gantulga Sumiya"}]