[{"rating": 3.0, "review": "For context, we have been Roku customers for around 2 years. We subscribe to Amazon Prime, Hulu, and Netflix rather than having cable. We also use Spotify almost exclusively for our music listening. We pre-ordered the Fire TV Stick, excited to check out Amazon's offering. After a month of heavy use, we have switched back to our Roku (see downsides below).There are certain features of the Fire TV Stick that I really enjoy:* It is lightning fast in its navigation.* The implementation of Amazon Prime is (of course) fantastic. As heavy Prime users, this is almost enough to keep us using it.* Netflix app works about as well as it did on Roku, pretty good for the most part.* The feel/experience of the interface is overall very nice.* The ability to \"fling\" YouTube content to your big screen is pretty darn awesome.Downside:* Inability to search all installed apps for a movie or show (Roku has this). It's fairly annoying to have to go in and out of every app to find the cheapest way to watch a particular movie.* The menus are somewhat hard to use, particularly the way one gets to apps is not very intuitive. Sure, I can do it, but after a month I should have been able to do it in my sleep.* Hulu is very broken. To be fair, Hulu works poorly at best on any platform I've tried. That said, there are times when it's completely unwatchable on the Fire TV Stick. Sometimes it'll freeze every couple seconds, other times the image will freeze but the sound will keep going. This all happens when our internet is confirmed good and other apps work fine. This may not be the Stick's fault, but ultimately if you're a heavy Hulu user like we are this just doesn't work.* Spotify app requires a smart phone in order to run and is very hit-or-miss in performance, losing connection to your phone pretty regularly. Roku can stream your music right on the device.I hope that helps those who are looking at Fire TV Stick vs. Roku make their decision. It may be that your deal-breakers aren't the same as mine, but these were big enough issues that I really found myself disliking the Fire TV Stick. It has a lot of potential, and I hope there are some updates to help rectify the issues I've mentioned above.", "verified": true, "helpfulness": "2/2", "author": "Amber Baird"}, {"rating": 5.0, "review": "I have a Sony Media Player and I like the Fire TV Stick better.  It is very user friendly and I have not had any problems.  I am thinking about buying another.", "verified": true, "helpfulness": "1/1", "author": "Steven Pike"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "mommac82"}, {"rating": 4.0, "review": "yeah, its quite a neat little stick, does what it promises to do, interface could be better i think but overall pleased with the buy.", "verified": true, "helpfulness": "0/0", "author": "Al Sheik"}, {"rating": 2.0, "review": "If I never owned a ROKU I would have been very pleased with this Fire TV stick, however, I have some issues.1. The power plug did not work and I had to use my Kindle plug to get it to charge. However, Since i could plug the USB code directly into my TV (along with the HDMI) I didn't see any need to return it to Amazon.2.  The Fire TV stick, seems, well, sticky.  It's a bit slower on the ball than the Roku and I find myself having to erase and or re-navigate.  I find myself a little frustrated at times, and disappointed.3.  My passwords seems to get 'lost'.  It's quite annoying to sit down and load netflix and have to continually re-sign in.  My roku saves my password inforamation.  This is a major turn off and annoyance.I have moved my Roku back to replace the Fire TV and was back to normal last night.  I did give Fire TV a long try and well, it's going in the drawer, to be used for travelling and/or if my roku breaks.", "verified": true, "helpfulness": "2/2", "author": "Amazon Buyer \"Roxanne\""}, {"rating": 5.0, "review": "Works great for my needs.  Wi-fi on it is strong and I haven't had any buffering issues.  Only used Netflix and HuluPlus apps, but they work well (better than their counterparts on my bluray or tv).  They really need to add a clock to the software package that you can get to without going into the system menus.  Also could use a power down feature as occasionally it seems to go to sleep and not really want to wake up properly (only happened twice and all you do is unplug it or you can just flip the power strip everything is plugged into).  This thing pretty much demands to be plugged into a power strip in addition to your TV so make sure you have an outlet available.  The remote is so so,  Could be a little sturdier, but so far it works well and is very responsive.", "verified": true, "helpfulness": "0/0", "author": "Daniel R Watkins"}, {"rating": 5.0, "review": "I had been looking for something small and compact but yet still held the power and oomph to surprise me. This is definitely the one! I had previously been looking at the roku stick, but this is so much nice to me. The screen is so fluid and the interface is clean and simple. I LOVE it! It's making me contemplate buying a fire tablet!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent little product. Got it in December on a flash deal, well worth the money. Easy to install, but I had to view a video on You Tube to figure out how to open the remote's battery compartment. Once I did that, the installation of batteries went smoothly. We love the ease of viewing TV and movies on our new big screen TV.", "verified": true, "helpfulness": "0/1", "author": "Doc W8 \"Librarian\""}, {"rating": 3.0, "review": "I only really need this device for the plex app integration and frankly its horrible. The poor streaming quality is a deal breaker. It may be plex's fault, but I have no issues with plex anywhere else except for the fire stick. The fire stick itself also locks up all the time and I have to constantly unplug it.", "verified": true, "helpfulness": "0/0", "author": "mr blah"}, {"rating": 5.0, "review": "I received the Fire Stick sooner than Amazon stated it would arrive which was a plus . I have to say that I'm new to streaming movies on the internet. The Fire Stick was very easy to set up and navigate.  The Fire Stick has so much to choose from; from movies to TV series to you tube videos, and numerous other apps.  Absolutely love it!!!", "verified": true, "helpfulness": "0/1", "author": "Stefan Cervik"}]