[{"rating": 5.0, "review": "Great - used it on our outdoor TV. Excellent and exceeds expectations.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I am sorry we didn't buy this earlier.  Easy to install, easy to use.  Selection of Prime programs excellent.", "verified": true, "helpfulness": "0/0", "author": "Kayakgirl"}, {"rating": 4.0, "review": "Works for Netflix as expected. The other apps were not well developed or \"clips only\" videos that aren't worth the effort and space.", "verified": true, "helpfulness": "0/0", "author": "Kyle Comeau"}, {"rating": 4.0, "review": "Easy to setup reasonable price good buy", "verified": true, "helpfulness": "0/0", "author": "VERONICA MCCASTER"}, {"rating": 3.0, "review": "I can only get prime on the fire stick.  I thought  would be able to get more.  T tried the NetFlick App and so far it has not worked.  It looked so great in your presentation That at last I had found something that would work  for me", "verified": true, "helpfulness": "0/0", "author": "NWY"}, {"rating": 5.0, "review": "What a wonderful, easy solution.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Saralin"}, {"rating": 5.0, "review": "Good buy and enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Tonya Powell"}, {"rating": 5.0, "review": "I am very surprised at all the possibilities I have with this viewing option!!  Thanks Amazon for another great product", "verified": true, "helpfulness": "0/0", "author": "Sara Vriesen"}, {"rating": 5.0, "review": "We have had one for about 2-3 weeks.  It is a great product.  I was looking to lower my cable bill and this is a great alternative.  It does everything that I need.  My kids love this.  They are able to watch what they want to watch whenever they want.  That are some great apps that I loaded on for the kids.  Well worth the money.  I have cable internet so I have no problems with speed and there are no delays.", "verified": true, "helpfulness": "0/0", "author": "Kurt Lathwell"}, {"rating": 5.0, "review": "gonna really look it over more this afternoon, but so far so good it works fine and now i dont need my iphone or tablet to watch tv", "verified": true, "helpfulness": "0/0", "author": "Oreomama"}]