[{"rating": 4.0, "review": "If you like or have Amazon Prime, then you should love it. Biggest complaint I have is the standard on anything connected with Amazon; It is so geared & tied into pushing Amazon's site. I think now i would have perferred the Roku. But i do like the Stick. This was really just to play around with this internet streaming stuff.", "verified": true, "helpfulness": "0/0", "author": "T. Jones"}, {"rating": 5.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "julian pino"}, {"rating": 5.0, "review": "Good quality easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's is little iffy if I really need to connect the power adapter or is the USB supplying enough power.  It states to connect power supply but still works with out it.", "verified": true, "helpfulness": "0/0", "author": "M. Saigal"}, {"rating": 5.0, "review": "A great gadget to convert and almost smart TV to a real smart TV.", "verified": true, "helpfulness": "0/0", "author": "Louis B. Kravitz"}, {"rating": 5.0, "review": "Really great", "verified": true, "helpfulness": "0/0", "author": "Jared Miskoff \"Rock on!\""}, {"rating": 5.0, "review": "This is my second Fire Stick for a second tv in my house.It is very simple to setup and use.  If you have a Prime account it automatically links to it, no additional setup required.Great product!", "verified": true, "helpfulness": "0/0", "author": "Tracy Heath"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa Marfori"}, {"rating": 5.0, "review": "Easy to use and to be able to watch hulu plus Netflix amazom prime on your TV awesome, Love it", "verified": true, "helpfulness": "0/0", "author": "Pelush"}, {"rating": 4.0, "review": "Love it, works great. Adding apps is not as easy as I had hoped. Unless you're just looking at the featured ones you have to search by the specific name you're looking for. A lot of shows that you'd think would be free are charged per show/per season. Kind of disappointing since I cancelled cable and thought we could watch them free of charge, but still less that cable so it is fine.", "verified": true, "helpfulness": "0/0", "author": "J. Lowe"}]