[{"rating": 4.0, "review": "Works great.  The software is not perfect though.", "verified": true, "helpfulness": "0/0", "author": "Just Joe"}, {"rating": 5.0, "review": "Love it .. :)", "verified": true, "helpfulness": "0/0", "author": "fairiesaura"}, {"rating": 4.0, "review": "Good product, only annoying thing is it has to be plugged in to a power outlet.", "verified": true, "helpfulness": "0/0", "author": "LL Collins"}, {"rating": 3.0, "review": "Still get a lot of rebuffering even  though pay for high speed  internet_ Remote is no good but otherwise enjoying product", "verified": true, "helpfulness": "0/0", "author": "J. Maggio"}, {"rating": 1.0, "review": "I'm really disappointed with this stick it doesn't work over half the time it tells me I have very good connection but won't connect or it will say connected with problems I called Amazon and they tried to blame it on my internet connection and had me reset the device back to factory settings i am really considering sending the device back 😔", "verified": true, "helpfulness": "0/1", "author": "Regina S."}, {"rating": 1.0, "review": "Mine does not work. I had it for a while before I got to use it. The stick does not work. Disappointed.", "verified": true, "helpfulness": "0/1", "author": "natawna thompson"}, {"rating": 5.0, "review": "This device blew my Chromecast out of the water.  It works great!  And I don't have to worry about connecting a mobile device to it in order to view movies.  The main reason I picked one up was so I could better stream WWE App shows and events.  No more plugging my PC up to my tv just to watch Wrestlemania.  Connecting to my other streaming media sources like Netflix was also a piece of cake.  Even the fact that I can download apps and games to it with ease was brilliantly done by Amazon.  For anyone who says there are delays in this device when it comes to performance, dont believe the hype.  I've been in IT for 15 years.v if this device is performing slow, it surely has to be the result of your home internet connection.  Im on a 100 MB Xfinity connection.  If youvare on a 1 to 15 MB connection (especially a DSL), then you need to limit the number of additional devices on your network while streaming.  If you don't, then you will probably experuence bufferring delays from time to time as you are maxing out your bandwidth.  This is not Amazon (or even Google's fault for Chromecast users).  But maybe Amazon could have an option for those with slower connections to be able to increase the size of their buffer before streaming begins to help counter this problembfor those with slower connections.  I almost think the Fire Stick has that option, but they may want to look at increasing it some to help overall performance for those with slower connections.My only complaints are that 1) the USB power cable says there is an error everytime I first boot up (which I just ignore it and move on) and 2) I now need to get rid of my Chromecast.  Anyone want to buy a Chromecast?!", "verified": true, "helpfulness": "0/0", "author": "FrequentBuyer"}, {"rating": 4.0, "review": "Was super easy to install and use.  Now I just need faster internet to use it.", "verified": true, "helpfulness": "0/0", "author": "Tish, Ohio"}, {"rating": 4.0, "review": "Great way to watch prime content and other kinds like Netflix, etc. Price competitive and reliable. Would make it a 5 but it doesn't seem to hold a charge and needs to be plugged in, but so does chromecast.", "verified": true, "helpfulness": "0/0", "author": "S. Macchia"}, {"rating": 5.0, "review": "Not had any issues. Easiest streaming device we have in the house. Depending on application user may need a 90 degree hdmi adaptor if tv sits extremely close to the wall. Overall quality is great.", "verified": true, "helpfulness": "0/0", "author": "Tatum A Combs"}]