[{"rating": 5.0, "review": "Fire stick is above and beyond ChromeCast without a doubt!  So much more available on the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "CQ Richardson"}, {"rating": 4.0, "review": "It is aperfect product and i do many things with it but i have some proplemls because in egypt full options not work", "verified": true, "helpfulness": "0/0", "author": "mhmd samier"}, {"rating": 3.0, "review": "Its ok. It would be excellent but for a lot of those apps like watchespn and such, u still need a cable provider. I bought the fire stick to avoid a cable provider. If i could have watchespn without a cable provider, 5 stars!", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 1.0, "review": "This product failed to start a fire. I was very disappointed. :( Now I have nowhere to cook my TV.", "verified": false, "helpfulness": "1/2", "author": "Riley Meacham"}, {"rating": 5.0, "review": "Fire stick is fast and awesome.  As good or better user interface than Apple TV.  As fast as Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Cory Dzbinski"}, {"rating": 3.0, "review": "The \"Fire TV Stick\" is okay, but it does not, in my opinion, live up to the \"hype\" you see on TV.  The TV adds make you think (or at least it did me) that you can watch FREE TV and Videos on \"demand\".  When I received the \"Fire Stick\" I noted that it was very difficult to understand how to get it hooked up and working (You must have a TV with the HDMI port) and then most of the material is that which you have to pay for.", "verified": true, "helpfulness": "0/1", "author": "NS4supermall"}, {"rating": 3.0, "review": "I'm a long time Roku 3 user. I also have a Roku stick and a Roku 2. This thing is MUCH faster than the Roku sick and the Roku 2. It's about the same as the Roku 3. Where it fails, in my opinion, is the apps. There are more, FAR MORE, apps for the Fire TV stick than any of the Roku versions. The issue I have is that there is no way to get to my fairly large VUDU collection. There is a Flixster app, but that doesn't show everything and the app itself is lackluster. Worst of all, there is absolutely no way to get to Disney Movies Anywhere (there are several apps on Roku to get to Disney movies including VUDU and the Google Play Movies app).If you don't have or intend to use VUDU or Disney Movies Anywhere, this is great. If you want those things, go with a Roku!", "verified": true, "helpfulness": "0/1", "author": "E"}, {"rating": 4.0, "review": "Liked the fire stick it took a while to figure out how to use Netflix but we are getting it.", "verified": true, "helpfulness": "0/0", "author": "MK Burk"}, {"rating": 5.0, "review": "Once I got it set up it works great on Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bill Smith"}, {"rating": 4.0, "review": "I like the portability of this and that I can plug it in to any tv I'm at in the house, but there are some glitching issues.  Example: It will pause in the middle of a movie or show even if I didn't push the pause button. It may randomly turn off or flash off and on for a bit before deciding if it is just going to pause the show and stay on or just turn itself off.  Those 2 things occur frequently.", "verified": true, "helpfulness": "2/2", "author": "Dannielle Gehrke \"Dannielle\""}]