[{"rating": 5.0, "review": "I really love the fire TV stick for streaming.  We don't watch a lot of tv, but this is a very convenient way for us to stream the movies we own.  I also use the Prime yoga videos quite a lot, and the kids have really enjoyed watching some of the Prime kids' shows.  A couple of times there's been a little skipping, very infrequently, but I assume that is a connection issue and not due to the processing power in the stick.  I keep losing the remote (by \"I\" I mean, everyone else in my family), but I set up the app on my phone and that works fine too.  I'm very happy with everything I've done with the tv stick.  I particularly like that it doesn't take any time to boot up or whatnot ... I used to not want to stream on our tv because it takes so long for the Wii or whatever else we were using to stream to start up, etc.", "verified": true, "helpfulness": "0/0", "author": "Sarah Carpenter"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "Trudye A. Johnson"}, {"rating": 5.0, "review": "Fire Stick was a great purchase got me, just plug and play.  I basically turned my TV into smart TV in just a few simple steps. Lots of content and great access to Net Flix, Hulu etched. Ilol recommend this great Amazon product to All my friends and relatives.", "verified": true, "helpfulness": "0/0", "author": "john richard baze"}, {"rating": 3.0, "review": "Eh everything is extra money", "verified": true, "helpfulness": "0/0", "author": "brian coffey"}, {"rating": 5.0, "review": "I luv it... wks gud and I enjoy all da movies.", "verified": true, "helpfulness": "0/0", "author": "vanessa"}, {"rating": 5.0, "review": "I have not had as much time to use it as I'd hoped to date, but it's so easy. I have a number of movies and programs saved and ready to watch. I'm seriously considering getting one for my new bedroom tv. I'm looking forward to cutting out cable soon.", "verified": true, "helpfulness": "0/0", "author": "Arrow Sailor"}, {"rating": 5.0, "review": "Just as good as the first. Works so well, much better than a Roku, but need more selection of stations. That is the only drawback.", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 5.0, "review": "It works and 😬I don't need a smart tv 😆", "verified": true, "helpfulness": "0/0", "author": "Anthony Pierulla"}, {"rating": 5.0, "review": "Love the Fire Stick.  It's easy to use and very convenient.  We have Netflix and Hulu and my son loves using Pandora.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "advertizsing sounds great, but unless you spend a fortune on extra memberships to hulu plus, etc,, it does not do anything that cable does not have.  Just one more gadget.  I was not impressed,, then then I installed it,, it automatically signed me up and charged me 99.00 for amazon prime, which I already had,, and I had to spend an hour on the phone getting that credited back(which then did fine,, but it was just the bother of it all)  It had been installed for 2 weeks, and I have only tried it the first day, and not once since,,", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]