[{"rating": 5.0, "review": "Goodbye Dish!", "verified": true, "helpfulness": "0/0", "author": "Brian W."}, {"rating": 5.0, "review": "Every thing as advertised and expected. More than worth the money, especially if you are an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Gloria Chunn"}, {"rating": 5.0, "review": "It skips on the left to right and up and down arrows  but I can get use to this.", "verified": true, "helpfulness": "0/0", "author": "Bea"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "maria"}, {"rating": 4.0, "review": "Faster and more reliable than Google Chromecast. I have both. The remote control is a must!Otherwise, I coudn't have access to Amazon content, like Amazon Video, because I live abroad (Brazil). Shame on you Amazon!", "verified": true, "helpfulness": "1/1", "author": "Leandro B. Carvalho \"Leandro B. Carvalho\""}, {"rating": 3.0, "review": "Did not realize that I had to purchase Prime to get something on my TV...even after purchasing Prime I have to purchase Hulu Plus to get the Network TV shows offered for free on internet.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This device will not make it through one episode of Micky Mouse Clubhouse without rebooting.  It is very difficult to make my kid happy while I am getting ready in the morning due to this.  We have a Roku 3 and would recommend paying the extra for the quality.  I will be attempting to get my money back.", "verified": true, "helpfulness": "1/1", "author": "jeff schak"}, {"rating": 3.0, "review": "It's nice but I'll prolly end up getting google chromecast because I can do more. Plus I can't get spotify to work.", "verified": true, "helpfulness": "0/0", "author": "Jolee"}, {"rating": 5.0, "review": "Works great. Should have bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Charles R. Almond"}, {"rating": 5.0, "review": "For those of you who are prime members and can't afford the expensive gadgets out there, this is the one to get. It's very reliable and gets the job done for your viewing pleasure. Amazon was also very helpful in getting me thru the initial stage of familiarization. I did point out to them that the unit needs to be packed with more clearer instructions.", "verified": true, "helpfulness": "0/0", "author": "Syl Rachel Quinn \"IBelieveInMiracles\""}]