[{"rating": 5.0, "review": "Easy set-up.  Works great with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "jya"}, {"rating": 5.0, "review": "Not as speedy as the Fire TV and I miss the microphone (and more premium feel of the other system's remote) but for the bedroom television this absolutely gets me my Internet-based entertainment.", "verified": true, "helpfulness": "0/0", "author": "Matt Ranlett \"Husband, father of 2, and a software developer moving slowly and unsteadily into management. I love reading, especially fiction & history\""}, {"rating": 4.0, "review": "Pretty good value.  Doesn't seem to have as snappy a response as the regular Fire TV, but then again what would you expect for less than half the price?", "verified": true, "helpfulness": "0/0", "author": "Ken Nalbone"}, {"rating": 3.0, "review": "It's not as easy to set up as advertised!", "verified": true, "helpfulness": "0/0", "author": "Robert C."}, {"rating": 1.0, "review": "If you buy the tv stick and pay for a monthly service or prime why do you still have to pay for some tv shows? Not even worth the $$ if you still have to pay to watch some programs.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "I love it. I travel a lot and next time I rent apartment I'm not getting TV service. I'll get internet only. Wish I had more free movies with prime subscription.", "verified": true, "helpfulness": "0/0", "author": "Mark Hancock"}, {"rating": 3.0, "review": "Pros:Small in sizePre-programmedAndroid basedCons:Remote is too smallMust plug into wall can not use TV integrated USBHome screen very clutteredPersonal settings are virtually non existentMost premium apps supported by Fire Stick do not recognize Time Warner Cable as a provider.Multiple buffering periods during streamingAll in all its OK at best. I also own a Roku Stick. After using both I am going back to the Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Ryan B."}, {"rating": 2.0, "review": "the movie selection is about as lousy as Netflix.", "verified": true, "helpfulness": "0/0", "author": "James S."}, {"rating": 5.0, "review": "I 😍 it used it 24/7 1440 min 86400 Sex", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "Worth it", "verified": true, "helpfulness": "0/0", "author": "Troy"}]