[{"rating": 4.0, "review": "Simple to use. Free stuff old news.", "verified": true, "helpfulness": "0/1", "author": "Humility"}, {"rating": 4.0, "review": "Super easy to install and pretty easy to use.  Requires a wireless internet and an available HDMI port on your TV.  Just plug power plug into wall, plug power cable into the stick, plug the stick onto the HDMI port on your TV (an extension cable is included in case you have trouble with enough room like I did) and turn on your TV. The auto start takes over and guides you through.  I just wanted a way to watch Netflix on my TV and it does just that.  They also give you a free trial of Prime so you can find and watch things on prime.  Some are free some are not, but even then most of the pay items are about the same as redbox so that's nice.", "verified": true, "helpfulness": "0/1", "author": "Susan Stice"}, {"rating": 3.0, "review": "Works great when next to router. 30 to 40 ft nothing but a paper weight.", "verified": true, "helpfulness": "0/1", "author": "jesica barnes"}, {"rating": 5.0, "review": "This item is one off most stream device that work very good", "verified": true, "helpfulness": "0/1", "author": "J. Gonzalez"}, {"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/1", "author": "Edward Erb"}, {"rating": 2.0, "review": "still having issue's with getting it to work like it should....(not a dummy) was going to purchase two more...but think I will be waiting to many issues with this one", "verified": true, "helpfulness": "0/2", "author": "Judy Savage"}, {"rating": 5.0, "review": "Love all the movie choices!", "verified": true, "helpfulness": "0/1", "author": "kter4u \"Catherine Homan\""}, {"rating": 4.0, "review": "Easy to set up and I love it", "verified": true, "helpfulness": "0/1", "author": "Candice-Lee"}, {"rating": 5.0, "review": "Loves it", "verified": true, "helpfulness": "0/1", "author": "Hectordiaz"}, {"rating": 5.0, "review": "Excellent device. We are really enjoying its ease of use.", "verified": true, "helpfulness": "0/1", "author": "Paul H. Pflieger"}]