[{"rating": 5.0, "review": "Love it!! Don't know how I went this long without it.", "verified": true, "helpfulness": "0/0", "author": "Jeneba Weller"}, {"rating": 5.0, "review": "Working as expected", "verified": true, "helpfulness": "0/0", "author": "bisamaster"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Greg W."}, {"rating": 5.0, "review": "Great purchase ... love it !", "verified": true, "helpfulness": "0/0", "author": "Betty V Davis"}, {"rating": 5.0, "review": "Awesome piece of reliable equipment. Amazon keeps producing quality products and that's why I don't hesitate to purchase merchandise from them.", "verified": true, "helpfulness": "0/0", "author": "John Lopez"}, {"rating": 3.0, "review": "Hi. Have problem with mirroring screen of samsung galaxy 6 edge to fire tv stick... And if some aps ,games are free why they need my information about credite card??...have to pay later for somes...?? thanks very much for help", "verified": true, "helpfulness": "0/0", "author": "lukasz"}, {"rating": 3.0, "review": "For the first 8 months or so of owning everything worked great.  I was able to use plex and watch amazon video on demand flawlessly.  There was no stuttering in video and everything played smoothly at 720p.  I never did end up trying 1080p.  There was minimal lag with the menu which was acceptable considering the price point (it was slower than my Roku but the Roku was 2.5x the cost and a standalone box so expected).About 8 months in the device started restarting randomly regardless of what I was doing.  I'd be in the middle of watching something and then would have to wait for 5 minutes for it to reboot.  I called customer service and was told that this is normal processing and it is fully expected that the device will reboot due to random glitches in the system.  At that point I decided that I was done with the product and threw it awayOverall a great device when it works but if things start going south don't count on Amazon to step up to the plate even when your still within the warranty period.  This also ruined any chance of me purchasing an actual Fire TV.  I'll stick with my Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Kevin"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Jill Farmer"}, {"rating": 2.0, "review": "Worked well for months then suddenly snaps and shuts down saying can't find internet. Yet tablet nearby received wifi without difficulty. Are you finding a problem with the fire stick?  Does it have a short lifespan", "verified": true, "helpfulness": "0/0", "author": "Jack Babchik"}, {"rating": 5.0, "review": "I love it. Cancelled my way too expensive cable.", "verified": true, "helpfulness": "0/0", "author": "Carole Purtell"}]