[{"rating": 4.0, "review": "Excellent product!  Just What I've been waiting for.", "verified": true, "helpfulness": "0/0", "author": "Mary Munson"}, {"rating": 2.0, "review": "freezes, loses connection with wifi and have to re-start it frequently.. slow to navigate... you have to have it plugged in to the power outlet and defeats the purpose of being a USB stick. Not too happy with. I also have an Apple TV and like it much better but I thought I gave the USB stick a try for my room.", "verified": true, "helpfulness": "0/0", "author": "Danny Montalvo"}, {"rating": 5.0, "review": "Much better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Austin K."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "denise mack"}, {"rating": 5.0, "review": "I have enjoyed every minute of it. Easy and great access to great movies, viewing prior TV series.  Connects to Internet with ease. No regrets what so ever.", "verified": true, "helpfulness": "0/0", "author": "Daisy"}, {"rating": 5.0, "review": "I'm happily surprised by this product. I usually stream on a ps3 but my girlfriend wanted something for our 20\" tv in the kitchen.There is a short introduction video when you first plug it in. One thing that is really nice is that Amazon pre-programs the Fire Stick with your Amazon info so you can start streaming on Amazon Prime without going through a set-up. I also use this for Netflix.The device is always on so you never wait for it to initiate. It's very small so I doubt you are losing very much on energy costs. (Probably a few cents)I will admit, our tv is not very hi-definition. It is a flat panel but I'd be surprised if it even runs at 720p (we got it from a friend). That said, the Fire Stick provides a good quality stream for what we use it for. I may test it on my better tvs if I decide I need additional streaming devices.The price is very nice. I just picked it up on promo for $34. Not bad in my opinion.I would recommend this to anyone looking for an inexpensive streaming device. It doesn't have any special features like audio commands but you can buy the additional remote with a headphone jack for uninterrupted listening.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "Marilyn Rivadelo"}, {"rating": 5.0, "review": "Awesome....easy....everything included!", "verified": true, "helpfulness": "0/0", "author": "d g"}, {"rating": 5.0, "review": "Easy to install and use. Love it...", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Better than cable", "verified": true, "helpfulness": "0/0", "author": "Duncan Peterson"}]