[{"rating": 5.0, "review": "Awesome! Works great. Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "JimBobAnthony"}, {"rating": 4.0, "review": "works great with plex to stream your computers hard drive. Also good with amazon/netflix.", "verified": true, "helpfulness": "0/0", "author": "Dr. K"}, {"rating": 5.0, "review": "Love it.  Easy to install.  Love the iPhone app that allows voice control.  No issues with connectivity/easy to install (took about 2 mins).  Bought this for an older flatscreen TV in bedroom and works great.", "verified": true, "helpfulness": "0/0", "author": "RobGP"}, {"rating": 5.0, "review": "I love the stick!! I have an Amazon prime account so I get tons of free movies, but I also have Netflix which can be used on the stick too.You do need to have a good internet connection to stream the movies but there are so many options with this tiny little stick. I really need to get another for the kids tv", "verified": true, "helpfulness": "0/0", "author": "Samantha Alspaugh"}, {"rating": 4.0, "review": "I really like the Fire TV Stick. I like all the apps that allow me to stream shows and movies instantly on my TV. I only wished that my service provider (Charter) was on the list so that I could watch live channel stream on the watch ESPN app.", "verified": true, "helpfulness": "0/0", "author": "Carlos Mansel"}, {"rating": 5.0, "review": "I just have the Fire stick and I love it.Use it every day.", "verified": true, "helpfulness": "1/1", "author": "Mary Ann Bell \"Mary Ann Bell\""}, {"rating": 5.0, "review": "Fire TV stick was easy to set up and start using. I was expecting less pauses during shows for buffering (which I experienced often with Chromecast). The actual experience exceeded that expectation as I experience no buffering pauses at all.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick works great! Glad I made this purchase.", "verified": true, "helpfulness": "0/0", "author": "Fab35"}, {"rating": 5.0, "review": "Love this thing! Very responsive and fast. Easy to setup. Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 2.0, "review": "Have a problem with hulu. Stops and Have to restart programs. Help!!!", "verified": true, "helpfulness": "1/1", "author": "charles smith"}]