[{"rating": 5.0, "review": "Worth the money......I would highly recommended it. It's  better than cable TV and way cheaper!", "verified": true, "helpfulness": "0/0", "author": "Brixtro D. Martin"}, {"rating": 5.0, "review": "I am SO glad hubby talked me into this! I almost didn't let him get it, but it replaced this huge thing he had before, I think Google tv? It works fast, and very rarely ever have we had to reboot it because of an issue. The remote is small and gets lost easily, but I'd rather it be small than something massive. The price is really great too!", "verified": true, "helpfulness": "0/0", "author": "Shawna \"Shawna\""}, {"rating": 5.0, "review": "I love it awesome my girls enjoying watching Netflix, YouTube as well going to order another one", "verified": true, "helpfulness": "0/0", "author": "meifa"}, {"rating": 4.0, "review": "This is an awesome piece of equipment.  I enjoy it and am glad I purchased it.  The only reason I gave it 4 stars rather than 5 is because it has to be plugged in to work and the cord is simply not long enough.  Unlike the Chromecast dongle which is just inserted into the TV.  Otherwise, it's all it's cracked up to be and is a great source of entertainment in my family!!!!", "verified": true, "helpfulness": "0/0", "author": "VRougeux \"Rogue\""}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Decoda Clark"}, {"rating": 5.0, "review": "So easy to use even the kids can navigate through it!", "verified": true, "helpfulness": "0/0", "author": "Megan J."}, {"rating": 5.0, "review": "Easy to use, loads of options with all the other available apps. I use this for Prime and Netflix. Both stream well and the picture quality is wonderful. I'd say if you're looking for a cheap way to get your online content through TV, this is the first option to consider.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Trojak"}, {"rating": 5.0, "review": "I've only had it a few days and still figuring out everything it can do, but so far I love it. Before, I used 2 different devices to do everything and now it's all in one place and on a big screen TV.", "verified": true, "helpfulness": "0/0", "author": "Maddie"}, {"rating": 5.0, "review": "It's great other than the Fox Sports Go app", "verified": true, "helpfulness": "0/0", "author": "Jody"}, {"rating": 5.0, "review": "👍🏽", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Fenton"}]