[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Ammie E Smith"}, {"rating": 5.0, "review": "the very best", "verified": true, "helpfulness": "0/0", "author": "gccornell"}, {"rating": 5.0, "review": "The Fire TV Stick is the best thing since sliced cheese", "verified": true, "helpfulness": "0/0", "author": "john askew"}, {"rating": 4.0, "review": "This works very well once you get it set up.  I think the setup instructions could be better.  The remote control was almost impossible to open to put batteries in.  I had to google it to find out how others got it opened.  Definitely needs a new design for the product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "At this price, with this convenient design...this is really a no-brainer, especially if you're buying into the whole streaming content concept for the first time.I cut the cord on expensive cable TV about a year ago.  With the advent of on demand streaming through services like Prime, I couldn't think of a compelling reason to pay $100 or more per month for a bunch of channels that I never watched.  Between Prime, Netflix, and Hulu, there *are* alternatives to cable or satellite television.  And this little guy makes it possible for you.Setup is ridiculously easy, it plugs right into your HDMI (though you will need an available power outlet to supply power to the stick) and you're off to the races.  There is no footprint as with the regular Fire TV box, which is very nice as well.  The interface is intuitive and clean.If you want to get into streaming content...heck, if you just want to see what it's all about...the buy in on this perfect.", "verified": false, "helpfulness": "0/0", "author": "J. Tant"}, {"rating": 4.0, "review": "Great addition to any television, but surprised that a lot of movies I want to watch are not free", "verified": true, "helpfulness": "0/0", "author": "thomas ferrante"}, {"rating": 5.0, "review": "very simple to use", "verified": true, "helpfulness": "0/0", "author": "Antonio"}, {"rating": 4.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "anthony marbury sr"}, {"rating": 5.0, "review": "Great product, exceeded my expectations.", "verified": true, "helpfulness": "0/1", "author": "Smith5d"}, {"rating": 2.0, "review": "Didn't buy it for myself but not a fan of the menu. Laid out poor and with more emphasis on \"Amazon\" shows/purchaseable shows. I would have bought myself a roku, best streaming device out. Id like to see more easily AirPlay from any app or even mirroring from iphone, granted this isn't all fire TV fault it's apples too.", "verified": true, "helpfulness": "1/1", "author": "Albert"}]