[{"rating": 2.0, "review": "Amazon shipped the product super late. Amazon has not made the iOS app available as of yet, despite their promise to do so after a lengthy delay.There's a little lag in the interface. While it's serviceable it not like the zero lag in the current Fire TV. In its current state I wouldn't recommend buying it  unless you were able to receive it for $20 or less.I'd recommend purchasing the Fire TV if you could find a good deal on that. The Fire TV you has voice search built-in via the included remote, therefore you wouldn't have to wait on the ISO app to take advantage of that feature. The Amazon Fire TV would also eliminator the lag issue, however it is not worth purchasing at it's full retail price, so again I'd recommend such a purchase only if you recieve a significant discount from its regular price.The bottom line is, if you're starting from zero and you can get a good price on either the Fire Stick (>$20) or the Fire TV (>$60) they're okay devices. If you already own Chromecast, Apple TV, Roku or something else similar, you're better off just pushing Amazon's apps and service to your device wireless. The slight convince that you gain with a dedicated device is not work the cost in their present state.", "verified": true, "helpfulness": "0/0", "author": "Johnny Walker \"Personal Hoarder\""}, {"rating": 5.0, "review": "Love it. Very impressed at the speed and fluidity of interface. Can't believe how good it is for something in such a small package. Do wish it had Ethernet option, but I guess that's what the FireTV Box is for.", "verified": true, "helpfulness": "0/0", "author": "Stereodan"}, {"rating": 5.0, "review": "Very slick.  Easy to set up and use.  Picture quality is excellent.  No lag or distortion.  Very happy with this.Just wish it would work with my Onkyo A/V receiver from 2008 so I could get 5.1 surround sound working.", "verified": true, "helpfulness": "0/0", "author": "JerseyGMP"}, {"rating": 5.0, "review": "Used it for 2 weeks, and so far beats Roku & both smart TVs on speed, memory, user interface and general design.", "verified": true, "helpfulness": "0/0", "author": "To build a city upon a hill \"Albion, rule the waves\""}, {"rating": 5.0, "review": "We love it and its works great. Got it pre-order for $25 so it was a good deal.", "verified": true, "helpfulness": "0/0", "author": "R. howard"}, {"rating": 4.0, "review": "Works well on one tv a little flakey on another", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very user friendly, clear streaming. A must buy, great value", "verified": true, "helpfulness": "0/0", "author": "jayco \"jayco\""}, {"rating": 5.0, "review": "We love the amazon fire stick!", "verified": true, "helpfulness": "0/0", "author": "Melissa Stier"}, {"rating": 2.0, "review": "Really Disappointed!Now I'm definitely a prime user and a power user of streaming content with Tivo, Roku, etc. boxes already in my daily mix.  I picked up the Fire stick primarily due to the $19 introductory deal for prime users and then ONLY because it was MIRACAST certified which is something I had been wanting to mirror my android and windows displays on the big screen.  Honestly MIRACAST was the one reason it made it worth adding yet another device to my mix as I can get to prime fine from Roku, Tivo or web.It took forever to arrive as it was a pre-order but the usage I read about while waiting didn't look good.  I got it last week but by that time it was fairly clear that to Amazon 'Miracast Certified' means 'we kinda sorted used miracast technology to support screen casting between our devices and only our devices'.  So it sat and the bag unopened... and I wrote an earlier version of this review as a rant to that effect.So, tonight I got it out and put it through its paces.  What it does well but there are two glaring omissions.  But to be fair I'll highlight the good first.The GoodThe install and setup are easy.  Definitely use the USB to power wall-wart. TV USB ports don't have enough power to drive it past the 'Amazon' boot screen.  It came already registered to my amazon account which made setup a breeze but really glad I didn't decide to give it as a gift.  Netflix was a quick and easy setup as well.  The device was slow for the first couple minutes then got zippy.  I'm guessing it was setting things up and downloading content.  After that there was no noticable lag.  The remote is nifty and apple like.  I already notice it caching content... I played a bit of a movie, exited out and went back to it later and it started immediately without having to rebuild the stream cache.  Both the netflix and amazon players use the preferred (by me) method of playing video at lower quality if they have to while building up a cache then improving quality.  Tivo doesn't do this in their streaming apps which can cause pauses early on until it gets a cache established.The BadThe big one for me is that THIS DEVICE IS NOT MIRACAST certified.  It doesn't work with my android or Windows tablets or windows computers that support miracast.  Google this for more info.  Saying this is Miracast Certified amounts to false advertising in my opinion and if I'd paid more than $19 for this it would be going back in a heartbeat on this issue alone.But that's not the other deal breaker for me.  There is no VUDU app or any other way to play ULTRAVIOLET titles on the Fire stick.  I can understand Amazon wanting to keep control of their ecosystem and not offer ways to play movies purchased other places.  Hell, apple lives by that credo... which is why I don't use their products anymore.  But considering that Ultraviolet versions of movies are included with most DVD/BluRay purchase made in the past few years not supporting their libraries is pretty much asking them to go elsewhere.  I have 50+ UV videos and have only been paying attention to them for a year or so.  In Other Words...  IF I CAN'T PLAY MY ULTRAVIOLET MOVIES ON YOUR STREAMING HARDWARE THEN ITS NOT MY STREAMING SOLUTION PERIOD.  Doesn't really matter how much I use prime or want to rewatch the 2 movies I bought the streaming version from Amazon.The GeekyThis is an android OS device at its core.  You can turn on debugging and allowing apps from unknown sources so you may be able to play with development on this thing.  Haven't delved deep enough to try loading an app although it would have to be done via the web as there is only one USB port and its used for power.So the bottom line...  if you want this to Miracast, go elsewhere.  The belkin stick or latest Roku devices.  If you have a UV library you can't play it here, so unless you want 2 solutions look elsewhere.  If you are a prime user and only buy into the amazon eco system then this is great, really cool, go get it.", "verified": true, "helpfulness": "0/0", "author": "D. Ridenhour \"Alchemist\""}, {"rating": 5.0, "review": "The Firestick was extremely easy to install and has been just perfect so far. Wi-fi strength has been better than anything else I have used.", "verified": true, "helpfulness": "0/0", "author": "Hshiner"}]