[{"rating": 4.0, "review": "IT WAS EASY TO GET UP AND GOING.  SMOOTH OPERATING,  NOW THAT YOU HAVE YAHOO AS A SEARCH ENGINE WE LIKE IT BETTER.", "verified": true, "helpfulness": "0/0", "author": "Karen A. Runde"}, {"rating": 2.0, "review": "So I own the Chromecast and a Roku3 and I figured the $19 preorder price to buy into the Amazon ecosystem when I already have a Prime membership was a pretty good deal. So far, this is suffering from the same growing pains that Chromecast did when it originally launched. Few apps. Sluggish video playback. I hope the ecosystem and the device will mature as Chromecast did, but for now it is very much an inferior product.", "verified": true, "helpfulness": "0/0", "author": "Chris Weidner"}, {"rating": 5.0, "review": "Worth the money. Wish I got more at the pre-order price.", "verified": true, "helpfulness": "0/0", "author": "Wes"}, {"rating": 5.0, "review": "All I do on it is watch Netflix, and so far it has delivered flawlessly!", "verified": true, "helpfulness": "0/0", "author": "David Dyck \"ivorytux\""}, {"rating": 5.0, "review": "I just installed the Amazon fireTV stick, and it was one of the easiest installations I've ever done. Congratulations Amazon.The steps are easy:1. Connect USB cable into fireTV stick, and plug in power adapter.2. Connect fireTV stick to HDMI port via HDMI extender.3. Put batteries in the remote.4. Turn on TV and select HDMI port. fireTV stick is already looking for the remote.After installing the Amazon fireTV stick checks for and downloads any needed updates.Another screen then comes up asking if you want to continue with your pre-loaded Amazon account, or change. That's a very nice feature.Then an Amazon fireTV stick Welcome video plays and you see an animated tour of the features of the Amazon fireTV stick. Very impressive.It's great to see Prime Movies that are FREE to watch.", "verified": true, "helpfulness": "423/462", "author": "S. Garfield \"Steve Garfield\""}, {"rating": 4.0, "review": "I am really happy with how this performs, even on a DSL connection. However, be warned that if you are using a DSL connection, this device continuously uses that connection even if you aren't using it at that time, and it may cause some serious network slow downs.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Jelmeland \"Geoffrie\""}, {"rating": 1.0, "review": "Cannot recommend until Miracast is fixed! Its the only reason I got this over Chromecast. My Android 4.4.4 (no not Fire) phone and Surface Pro cannot connect. Bad marketing Amazon..", "verified": true, "helpfulness": "0/0", "author": "Bee Kay"}, {"rating": 5.0, "review": "Great Product that actually exceeded my expectations. It needs a few more apps, but it is well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Takpro"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Carey Jennings"}, {"rating": 5.0, "review": "We love the Fire Stick. Great selection of movies and TV. Also you can view pictures from your Amazon cloud.", "verified": true, "helpfulness": "0/0", "author": "Whitney Powell"}]