[{"rating": 5.0, "review": "no need for cable tv anymore", "verified": true, "helpfulness": "0/0", "author": "Eric B. Eichbauer"}, {"rating": 3.0, "review": "One of the main reasons I made this purchase was to watch live sporting events, but it does not do that.  I am very likely to cancel my prime account because of this.", "verified": true, "helpfulness": "0/0", "author": "James Reed"}, {"rating": 3.0, "review": "I have used the Fire TV stick for a couple of months now and have not been blown away by its performance.  We moved to a new house and are transitioning to wall mounting our TVs, and therefore trying to minimize the amount of wires and additional devices we connect to TVs.  I thought the Fire Stick would be a great all in one solution to replace Apple TV for programming and eliminate additional wires.  In general the Stick does that, but not without its flaws.Flaw 1 - as noted in the instructions, the Stick performs better when plugged in to a constant power source.  This of course requires running the power cord from behind the TV to an outlet, rather than relying on USB power from the TV.  When I looked into the impact of not using the power cord I read that it can take up to 45 seconds for the Stick to power on.  I personally think that is too long, so I use the power cord.Flaw 2 - the HBO Go and Watch ESPN perform terribly on the Stick.  Both apps are slow to load, have choppy navigation, and lose connection often.  HBO Go specifically takes multiple tries before the video actually loads and plays.  And each time it freezes, the Stick kicks back to the home page, forcing you to navigate through the slow and choppy app all over again!  HBO Go also does not have an option to access \"Watchlist\" which further adds to the difficulty of finding what you want to watch.Netflix and Prime Video options play with zero issue and hopefully Amazon can get the HBO and ESPN apps to perform the same.", "verified": true, "helpfulness": "0/0", "author": "rocketsfan007"}, {"rating": 5.0, "review": "absolutely love this product.  It is a very easy way to see Amazon Prime, Netflix or anything else you might be signed up for..Hulu, etc.  I am challenged when it comes to all the electrical nonsense you have to go through to get everything hooked up... but I have to admit this one was so easy.  Just a few simple steps and you are in!  I'm enjoying so much.", "verified": true, "helpfulness": "1/1", "author": "Sharon Graef"}, {"rating": 5.0, "review": "Love it!  Can't say more!  Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Michell P."}, {"rating": 5.0, "review": "Kick ass !", "verified": true, "helpfulness": "0/0", "author": "Wylie thornton"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "Alan in the south"}, {"rating": 5.0, "review": "This has changed the way we watch tv completely. no more commercials, an amazing variety to choose from, I feel like we haven't even scratched the surface of what's available to us through the Fire Stick. It's pretty much the only way we watch tv now.", "verified": true, "helpfulness": "1/1", "author": "Mom"}, {"rating": 4.0, "review": "Easy to install and access to so many shows. Love how when you are watching a TV series it just goes from episode to episode without hesitation. Makes it super easy to binge watch your favorite shows. Just wish there were more hit shows available.", "verified": true, "helpfulness": "1/1", "author": "Crystal Peterman"}, {"rating": 3.0, "review": "It works. Better than the apps on my blu-ray player. My biggest con would be the Amazon centric interface. I understand that it is an Amazon product and I dont believe it is a fault. It's just annoying when wanting to play the other streaming services the extra steps needed to get there. It does have Hulu, Netflix and Am. Prime on one device which was my main goal.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Rydman"}]