[{"rating": 5.0, "review": "Love the flexibility and options.", "verified": true, "helpfulness": "0/0", "author": "Terri Diamond"}, {"rating": 5.0, "review": "Love the portability of it", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "RdRodriguez"}, {"rating": 5.0, "review": "Might just be the greatest thing ever invented.  If I can figure it out...anybody can.  Connected right away to home WiFi and I downloaded the Fire TV stick app to my phone and was using voice commands to search what I wanted to watch.  I think they made it very user friendly and highly recommend this as an alternative to additional cable TV add-on channels that are usually costly.  Very pleased with Amazon Prime overall, but this was the icing on the cake.", "verified": true, "helpfulness": "1/1", "author": "Jeff McCullough"}, {"rating": 5.0, "review": "I love it ! It took a little figuring out and a new router but once I got it working it is pretty cool.", "verified": true, "helpfulness": "1/1", "author": "Terri L. Basso"}, {"rating": 5.0, "review": "I tried Prime a few years back and the content was lacking. The content is very Is very improved. I believe it is now a bargain.", "verified": true, "helpfulness": "1/1", "author": "J. Fowler \"Retireeurope\""}, {"rating": 5.0, "review": "Awesome!  So Fast, love the set-up and love the menu's!", "verified": true, "helpfulness": "0/0", "author": "jeff walrich"}, {"rating": 5.0, "review": "Great works just as advertised. Very simple to operate.", "verified": true, "helpfulness": "0/0", "author": "Don Thornton"}, {"rating": 5.0, "review": "Setup is straightforward - quick and easy.  Works flawlessly on a 32-inch Samsung LED flat screen, on our wireless home network.  There are a lot of apps available, although Netflix, Amazon Prime, and Vudu are the only ones that we currently use.  The compact-sized remote control works well, and conveniently fits in the palm of your hand. Streaming is so much more convenient than discs.  The Fire TV Stick is perfect for our needs, and we will probably purchase 1 or 2 more in the near future.  If you're streaming and need something new or better, the Fire TV Stick is the ticket.", "verified": true, "helpfulness": "0/0", "author": "Marie"}, {"rating": 5.0, "review": "Love the Fire TV stick.  Wish the cord to plug in the Fire Stick was a little bit longer particularly when the stick has to be plugged in to use it.", "verified": true, "helpfulness": "1/1", "author": "DEDogTrainer"}]