[{"rating": 5.0, "review": "Amazing device.... wish we had gotten one along time ago!!  It's so fast and easy to install and it works well on both our hdtv!  Our son-in-law is the one who told us about it and I've thanked him over and over again!", "verified": true, "helpfulness": "0/0", "author": "Connie Heath"}, {"rating": 4.0, "review": "Works as advertised .. No issues", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "I am very pleased with my new Firestick.  Lots of games and apps to choose from.  I wish that I could access my VUDU account through it though.", "verified": true, "helpfulness": "0/0", "author": "Johnny Pacheco"}, {"rating": 2.0, "review": "I bought the Fire TV Stick over Chromecast mostly for the features of phone remote app and mirroring. Neither one works. Did the trouble shooting suggestions from Amazon over and over to no avail. While looking for answers on the internet I came across many other complaints about these features which I wish I saw before purchasing this. It did connect to my network fast and easy, and is good for watching Netflix and Hulu etc., but that is it. I hear some people had luck with the other features, but apparently it is hit or miss, mostly miss. Buyer Beware.", "verified": true, "helpfulness": "0/0", "author": "Donald J. Sullivan \"Worker11811\""}, {"rating": 1.0, "review": "It's not what I thought it was. I don't have an Internet connection, and I was thinking it was an item which an Internet connection was not needed.", "verified": true, "helpfulness": "0/1", "author": "Anthony Mitchell"}, {"rating": 5.0, "review": "As advertised. So far so good.", "verified": true, "helpfulness": "0/0", "author": "Chas"}, {"rating": 5.0, "review": "Great product especially if you have prime.", "verified": true, "helpfulness": "0/0", "author": "Chantil"}, {"rating": 5.0, "review": "More than meets my expectations.The remote control is a very nice asset. Great streaming device.", "verified": true, "helpfulness": "0/0", "author": "Smoke & Michael"}, {"rating": 4.0, "review": "Like the stick but don't like that the \"firestick remote app\" doesn't work. Firestick ask for password n it's 5 digits app ask for it but it's 4 digits. Don't like that movies cost n music isn't loaded right away. Do like that I can play nature sounds n hv access to cool documentaries.", "verified": true, "helpfulness": "0/0", "author": "Sufiy James"}, {"rating": 4.0, "review": "Very nice!  I'd give this 5 stars if I didn't have the FireTV box which is outstanding! it's not quite as quick as the FireTV box but still great to have as an alternative.", "verified": true, "helpfulness": "0/0", "author": "T. Viken"}]