[{"rating": 4.0, "review": "Replaced a old Roku unit.  Much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Richard Cain"}, {"rating": 5.0, "review": "Works very well. A good buy for anyone", "verified": true, "helpfulness": "0/0", "author": "Robert Houghtaling"}, {"rating": 5.0, "review": "A great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Melody"}, {"rating": 5.0, "review": "I thought I was perfectly content with my Chromecast even though I couldn't stream Prime. Then I got the Fire stick and oh my Lord the difference isn't even comparable. The Fire stick is amazing! I loved it so much I bought two more.", "verified": true, "helpfulness": "0/0", "author": "mom of 2"}, {"rating": 5.0, "review": "Great product. +++++", "verified": true, "helpfulness": "0/0", "author": "Joshua McKinney"}, {"rating": 5.0, "review": "great new product.", "verified": true, "helpfulness": "0/0", "author": "Rachael Alhadeff"}, {"rating": 4.0, "review": "Love the Amazon Fire TV Stick. I debated over whether to buy the Fire TV or the TV Stick. At first, it does seem like the box has much more to offer. I was thrilled to find the stick to be very easy to work with. Without doing anything illegal! I'm still not thrilled with a few things - lag time on certain launch options, occasional dropping of my wifi signal, random freezing, but these things are minor and have happened (I think) more as a result of my cable service. The biggest issue I had was with loading - and finding apps to load. The easiest way I've found is by pushing them from my phone directly to the Fire TV Stick using AGK. It works fast, and well. Would give this 4.5 stars, but that doesn't seem to work from my iPad.", "verified": false, "helpfulness": "0/0", "author": "Megan Ailstock"}, {"rating": 4.0, "review": "Works well but not compatible with Harmony remotes", "verified": true, "helpfulness": "0/0", "author": "Hank Pearson"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Jenny Dierck"}, {"rating": 5.0, "review": "I love it! If you don't have a smart tv but love to have all the access to it, buy this.", "verified": true, "helpfulness": "0/0", "author": "Aurelio Gonzales"}]