[{"rating": 2.0, "review": "When it works, it works great. I love that it was inexpensive and is small, but it constantly drops the connection. There are times when a show i am watching on Netflix simply abruptly drops to a static gray screen. Unplugging the device from the TV for several minutes seemed to fix that problem, but, like many people describe, about an hour into another show, my signal drops. My Fire Stick is about 24 inches away from my wifi router. I'm really frustrated with this thing.", "verified": true, "helpfulness": "1/1", "author": "Steph Mom \"Steph\""}, {"rating": 5.0, "review": "Works quite well", "verified": true, "helpfulness": "0/0", "author": "johnsona698"}, {"rating": 2.0, "review": "You get more for your dollar as far as sticks are concerned. Compared to a Roku 3 the fire stick could be placed in a trash bin. The Roku 3 costs $80 double the cost of the fire stick, but you get more than double the benefits.Cons: The fire stick is always on even when sleeping. There are no themes just some very old school screensaver options. The remote feels cheap.Too much Amazon, Amazon prime paid subscription and advertisements play before I can watch. You have to search app after app to see where is the best place to watch your video,unlike Roku's awesome one search feature. The remote does not double as a game controller like a Roku 3. Amazon affiliated services in apps, there is no VUDU or UV. Most games require game controller (sold separately), The Roku 3's remote doubles as a game controller.Pros: It is cheap. It can turn your regular television into a SMART television with less options.Verdict: The amazon fire service as a whole simply is not up to par with the Roku service. You simply can not fall in love with Amazon fire,  like you can with a Roku. If you try a Roku 3 you will see how far amazon is from the competition not even competing at the same level. I will keep it since its here but I regret purchasing it.Happy reviewing beware of the fake reviews on amazon. I recommend you check out a roku 3 before investing.", "verified": true, "helpfulness": "2/2", "author": "Applesauce"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Simly Awesome.  Cancelled my Directv service.", "verified": true, "helpfulness": "0/0", "author": "Carter"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It just doesn't work. When I try to watch a show it wants me to sign up for a free 30 day subscription to Prime. I have been a prime member for years. I have Comcasts fastest internet service but it tells me my internet connection is too slow. When I select a show it brings up a \"loading\" screen and the show never starts. I honestly have been a loyal Prime customer for years and generally have nothing but good things to say for Amazon but this product is simply horrible. I can't recommend it at all.", "verified": true, "helpfulness": "0/0", "author": "Alan \"AEA\""}, {"rating": 5.0, "review": "Easy to set up and quality programs", "verified": true, "helpfulness": "0/0", "author": "Terry Noonan"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Yvonne Ashford-fairwell \"Some times i wonder\""}, {"rating": 1.0, "review": "This item was awesome... For about week. Then it started freezing after watching a few episodes. Now I can't get it to play anything at all. It just freezes. I read some reviews that said plugging the HDMI extender in would help, but this hasn't been the case for me. Besides it sits less than 2 feet from my router. I should've just saved my money for a new BLU Ray player with wifi.", "verified": true, "helpfulness": "1/1", "author": "Reader"}]