[{"rating": 5.0, "review": "I originally purchased the Chrome Cast, but quickly returned it and purchased my Amazon Stick with in days.  I don't know what I was thinking!!!! I didn't find the Chrome Cast user friendly and no comparison. What a breeze to install and use my Amazon Stick.  How could you go wrong especially when you have Prime!!!! I love, love, it!", "verified": true, "helpfulness": "0/0", "author": "Chico#1"}, {"rating": 4.0, "review": "Your documentation is very poor.  The device works part of the time and does not work part of the t ime.  I am going to purchase the competition next week.", "verified": true, "helpfulness": "0/0", "author": "John W."}, {"rating": 4.0, "review": "My family loves the Fire tv stick. We are still learning all of advantages of having it.", "verified": true, "helpfulness": "0/0", "author": "Dwanda Curry"}, {"rating": 5.0, "review": "Lightning fast compared to streaming through our new DVD player and it picks up our wi-fi signal even in the basement.  Couldn't be happier with the performance!", "verified": true, "helpfulness": "0/0", "author": "barbandmark"}, {"rating": 3.0, "review": "Although I ultimately liked the product I purchased it for my Mother due to the alleged easy set up.  The problem was an extremly limited installation manual and virtually nothing about how to connect with such sites as Netflix.  If this (and some other popular sites) had already been loaded ( like in Roku)I would have given this 5 stars.  It was not an easy installation because I had to discover (by going on line) how to add what turned out to be \"apps\". Now that it works I am very pleased...but not an easy installation.", "verified": true, "helpfulness": "0/0", "author": "Bill- Nevada"}, {"rating": 5.0, "review": "Happy with the fire stick watch Netflix and Amazon prime shows have not used any other aspect of it would recommend", "verified": true, "helpfulness": "0/0", "author": "Vernon Bailey"}, {"rating": 5.0, "review": "Even better than I expected! Love it!", "verified": true, "helpfulness": "0/0", "author": "DE4444"}, {"rating": 4.0, "review": "Technology...its a beautiful thing", "verified": true, "helpfulness": "0/0", "author": "Tricia"}, {"rating": 5.0, "review": "I have had only Netflix through my XBox for a few years now, and LOVE that I now have access to Netflix on my other tv for a very reasonable price!", "verified": true, "helpfulness": "0/0", "author": "leopard.woman"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "Steve"}]