[{"rating": 4.0, "review": "I love my new fire stick! I wanted it for an upstairs bedroom for when I wanted to watch netflix or prime upstairs. I like the trivia comes, like you don't know jack. The remote is sensitive and occasionally lags. Startup is fast and simple. I love that I have spotify but I think it's stupid that I still have to play it on my phone instead of logging into my account and syncing my account to the stick. But since I don't have a speaker doc for my phone, it works. For the price this works great for what I want. I can't say that it's probably much better than a roku 3 stick or anything, so it falls in line with all of those others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I liked Google cromecast better then this..., I like casting to my tv. Google has that ability to do from any kind of device like iPhone and Google. Where as, this fire is restricted.", "verified": true, "helpfulness": "1/4", "author": "Lalith Kumar Podduturi"}, {"rating": 5.0, "review": "My family and I are enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "Edna Dejesus \"ednas kindle\""}, {"rating": 3.0, "review": "The fire tv stick has Bluetooth for game controllers and other input peripherals but not for Bluetooth headphones. That was a disappointment because I want to listen with Bluetooth headphones at night. Other than that it is great.", "verified": false, "helpfulness": "2/2", "author": "Lynn Michael Wilde"}, {"rating": 4.0, "review": "It is all it should be. Love it. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Patricia Faria"}, {"rating": 4.0, "review": "Had a hard time getting the remote open to put the batteries installed like the cost 😎", "verified": true, "helpfulness": "0/0", "author": "Dmdov"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jose Antonio Prado"}, {"rating": 5.0, "review": "I brought the Fire TV Stick to use on a non-smart HDTV. I didn't need the Fire TV box, mainly because we only needed it for Prime movies/TV shows. It was very easy to setup, and the streaming has been flawless with Prime, Netflix and Crackle.", "verified": true, "helpfulness": "0/1", "author": "William A. Houston \"blues guitarist\""}, {"rating": 3.0, "review": "Plus 5 stars for being faster/smaller/cheaper than the Roku 3. Requires an update out of the box.  You will have to go into settings and change the data collection settings as soon as you update it.  Do not delete your Apps that are listed on the Homescreen-this deletes them from your Amazon account and they must be again purchased.  *AMAZON NEEDS TO FIX THIS*.Now for the bad news:-minus 1 star because video stutters every few minutes-regardless of my internet connection speed (30Mbs) and after changing the default setting on the Firestick from \"auto\" to 3Mbs. You have to change this setting on the Roku as well to prevent buffering/stuttering when in \"auto\".-minus 1 star because it does not support AcornTv-No way to change the default screensavers to a blank screen to save your TV's screen or allow it to turn dark if you fall asleep while watching a program.  Not worth subtracting a point over but it would be a nice feature.Bottom line:  3 stars and is a good deal in you are invested in Prime.  I will be giving this device to my granddaughter since it limits my viewing choices that I currently pay for-namely AcornTV.Update on 08Dec2014:  Here is the response from a TSR at AcornTv:\"We have not yet developed an app for Amazon Fire TV, but we have commissioned an Android app for later this year that we expect will be compatible.\"", "verified": true, "helpfulness": "0/0", "author": "Jeff Murray"}, {"rating": 5.0, "review": "Great product. Turned my dumb tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Jose Cantarero"}]