[{"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/1", "author": "Ida Hamel"}, {"rating": 2.0, "review": "There are a lot of things that I like about this device however, I recently used it on my jetpack while traveling and it used about 5 Gb of data in one hour of video (half of a movie).  It cost me $45 in data to watch half a movie. I have read that the apps and/or device can sense when you are on a network that is capable of higher bandwidths and will upgrade the video quality automatically. There is no way to turn this off or limit the video quality or data usage as per Amazon representative. The ASAP feature also supposedly uses a ton of data. Kind of funny how much data this device uses and it really doesn't make much sense. Makes one wonder if it isn't collecting data on its users.", "verified": true, "helpfulness": "1/2", "author": "C. Marriott"}, {"rating": 5.0, "review": "Can't beat this.  It's the best streaming device out right now.  I'm actually about to order one for my mother", "verified": true, "helpfulness": "0/1", "author": "Derek L. Carter \"Derek Carter\""}, {"rating": 5.0, "review": "Was easy to set up and use.", "verified": true, "helpfulness": "0/1", "author": "Edith Marquez"}, {"rating": 5.0, "review": "2 thumbs and 8 fingers upWhoa just discovered using my Fire Stick to mirror my devices i.e phone to my T.V...awesome", "verified": true, "helpfulness": "0/1", "author": "Chevaughn S. Clowney"}, {"rating": 5.0, "review": "Nice, easy and small", "verified": true, "helpfulness": "0/1", "author": "Ken LaRue"}, {"rating": 5.0, "review": "Easy to use! Got here fast!", "verified": true, "helpfulness": "0/1", "author": "kate"}, {"rating": 4.0, "review": "It's probably one of the best purchases I've made from Amazon.com.  My only gripe/concern is that sometimes (and it only happens when starting a movie) stutters/slowdown at beginning of movie.  Other than that it's a great item.", "verified": true, "helpfulness": "0/1", "author": "Chance \"chance\""}, {"rating": 5.0, "review": "Great way to watch tv and movies.", "verified": true, "helpfulness": "0/1", "author": "FSamuelu"}, {"rating": 5.0, "review": "Love my fire stick. I was afraid that WiFi vs hardwire would have a lot of lag, but this stream is so smooth. Love all the viewing options!", "verified": true, "helpfulness": "0/1", "author": "Antonio Alvarez \"Alfalfas\""}]