[{"rating": 4.0, "review": "tends to lock up", "verified": true, "helpfulness": "0/1", "author": "JohnnyD"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Candice"}, {"rating": 2.0, "review": "My firestick just stopped working after 7 months of not even heavy use. Going back to apple tv and casting from my Ipad from Amazon prime.", "verified": true, "helpfulness": "0/1", "author": "Signifying Monkey \"The Signifying Monkey\""}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "BigAl4"}, {"rating": 3.0, "review": "this device is not compatible with #DVI or #VGA port, an attempt to use #HDMI adapter also failed!", "verified": true, "helpfulness": "0/1", "author": "Ali Mahdavi"}, {"rating": 5.0, "review": "I've had this a couple of days and we are very happy  with it. So far,  it was worth the money.  We can watch streaming videos and it was easy to install.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Our old, old Roku was on the fritz. I saw the Fire TV Stick on a special Prime deal. Couldn't beat the price. The interface is great. Apps are very smooth. As our other streaming devices age out, we'll be replacing them with the Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "N.G."}, {"rating": 5.0, "review": "I made our fifty inch TV into a smart tv! The family is loving it! Thanks amazon. Fast shipping and great product. Very impressed", "verified": true, "helpfulness": "0/1", "author": "amber"}, {"rating": 2.0, "review": "I have the fastest internet my provider offers (Comcast), and I had nothing but problems with this product. Including constantly loading, it would stop EVERY three to five minutes to buffer; if it would at all. Very unsatisfied with my purchase. Gave it two stars because when it did work for the few minutes it did the picture was good.", "verified": false, "helpfulness": "0/1", "author": "Justin"}, {"rating": 2.0, "review": "Buy this product if u want to watch prime and nothing else. It does not connect to Netflix. All other apps other than amazon prime cannot be added. Furthermore streaming at more than 6mbps is erratic. Compared to Roku, Fire stick sucks!hC", "verified": true, "helpfulness": "0/1", "author": "Haricharan"}]