[{"rating": 5.0, "review": "I pre ordered it when it was $20. However I think it is worth the full $40. It has replaced the computer I had connected to my TV. I love it!", "verified": true, "helpfulness": "0/0", "author": "EchoIV"}, {"rating": 5.0, "review": "Great product really enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Alec Stanners"}, {"rating": 4.0, "review": "great device perfect parring with amazon prime", "verified": true, "helpfulness": "0/0", "author": "Michael Shuler"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "jordan Brown"}, {"rating": 5.0, "review": "Very easy to set up and use right away", "verified": true, "helpfulness": "0/0", "author": "Jaime Hoffmeister"}, {"rating": 4.0, "review": "So far so good!  Very easy to use will be 5 stars once HBO Go is added.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Bartz"}, {"rating": 5.0, "review": "OMG, love this!  I also have the Fire TV which is in the living room. I have the stick on the TV in the kitchen and it works fabulously. i downloaded the Fire Remote App and can use my smartphone as a remote. Will be getting this for a friend for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Rosebud \"Rosebud\""}, {"rating": 5.0, "review": "Awesome - love this product.", "verified": true, "helpfulness": "0/0", "author": "Tracy Vanderlip"}, {"rating": 5.0, "review": "Works well.  Wish it had HBO Go, but I knew it didn't when I bought it.", "verified": true, "helpfulness": "0/0", "author": "Chris Clare"}, {"rating": 3.0, "review": "Easy to install and setup, (update took 10 minutes right off the bat) For amazon prime content the loading is fast to non existent (our internet is 60mb down 4mp up)Our Kindle Fire HD has Disney apps ESPN apps and even our cable company app which all work great. The Fire stick has the same APPS BUT we cannot choose our cable provider (CHARTER) to access them, not , listed (Coming soon).The Fire Stick Remote control application for phones and tablets is not available on AMAZONS OWN KINDLE FIRE HD. (Or my windows 8 phone)Our Roku still beats any streaming device out there I can do all of the above (even amazon prime) on our roku.Couldn't pass up the $20 price, unless they improve access for my cable company soon! then it was a poor purchase even at $20", "verified": true, "helpfulness": "0/0", "author": "Myfender"}]