[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "CHERYL L TIKANEN"}, {"rating": 5.0, "review": "Love this product bought 5 of them", "verified": true, "helpfulness": "0/0", "author": "Rosalinda R."}, {"rating": 1.0, "review": "Often loses connection despite a strong wifi signal. I generally end up getting frustrated after repeated unsuccessful attempts to reconnect and end up watching on my iPad (using the same wifi signal and have no issues)", "verified": true, "helpfulness": "0/0", "author": "Naomi B. Raider"}, {"rating": 3.0, "review": "Selection of movies is skinny (lots of kid movies); also should have read that Amazon and Comcast aren't partnering making HBO GO worthless at this point.  Good speed on downloads, easy to install, like that it's tied to my prime acct.  Hope to see more newer movies available via prime and a Comcast partnership.", "verified": true, "helpfulness": "0/0", "author": "Denni"}, {"rating": 5.0, "review": "I got this as a gift for Mother's Day. My mom and I love it. It's easy to set up and use; it took all of five minutes. My parents and I love it.", "verified": true, "helpfulness": "0/0", "author": "Monqiue S Gaines"}, {"rating": 5.0, "review": "I bought a tv for my bedroom and did not want to pay for them to come out and cable it and for a monthly box rental, our cable bill is high enough.  I was happy with my tv antenna channels, then my daughter gave me Amazon Prime for Mother's day.  So I bought the 3 month Sling tv subscription and got the fire stick for free.  I got the Sling tv to try because it has ESPN and thought my husband would be satisfied with that and we could totally get rid of cable.  But no it turns out he needs a couple more cable channels for his car races and sports.  However, for me the fire stick is great, I watched all the Bosch episodes in the first week.  And the second Hunger Games movie.So easy to just plug it in.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Bonnarino"}, {"rating": 5.0, "review": "It is very easy to set up easy to use. And the android app makes it even easier to use. I had it set up showed me friend how to use it with the phone app and she loves it. She has no technical savieness and after a 15 minute lesson she is off and running it. I don't think I will be able to use this one so I will have to get another for my bedroom tv.So you have a hit on your hands with this awesome product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome product, i love it, easy to use.amazon rules", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "K.B"}, {"rating": 5.0, "review": "Love this thing!", "verified": true, "helpfulness": "0/0", "author": "Alexander Bruscino"}]