[{"rating": 5.0, "review": "Cheaper and easier to use than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Jim Grana"}, {"rating": 5.0, "review": "So far so good! Took all of 10 minutes from opening the box to being logged on.Found a TV episode we had not previously seen and watch it with out a glitch of any kind.We also have a ChromeCast so it is easy to compare the two. The Fire Stick is faster than the ChromeCast and was faster getting setup.Got the Fire Stick because there are movies and other content available on it that aren't available through the ChromeCast. Enjoy both, but think I lean a bit more towards the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "digitalexplr"}, {"rating": 5.0, "review": "My WiFi is located in the basement.  No problem with the signal at this extended distance.  Setup was quick and easy.  Great product...", "verified": true, "helpfulness": "0/0", "author": "Mistermike"}, {"rating": 5.0, "review": "Enjoying my fire stick, I can use it on any television set or my computer.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Coit"}, {"rating": 3.0, "review": "Shows often freeze and cut out. The picture randomly stops moving with the sound.I mean it's a great little device, but I'm kind of bummed that it isn't out-shining my Wii.It isn't the internet causing the problem, because all other electronics in the house have no problem streaming (ipad, computer, etc).", "verified": true, "helpfulness": "0/0", "author": "Cate"}, {"rating": 1.0, "review": "doesn't work to will.. seems every time I turn it on... I need to connect it to the Wi-Fi.. bothersome. and shuts it self off all time..", "verified": true, "helpfulness": "0/0", "author": "terrie miranda"}, {"rating": 5.0, "review": "Very easy to setup and it works great to date  (only used 2 days).This is a better option to buying a \"Smart\" TV.  The problem with \"Smart\" TVs is they do not work as good as this product and \"Smart TVs\" get dumber every day.  By that I mean the \"Smart\" part of the TV cannot be upgraded very easily which means as time passes and technology gets better the \"Smart\" part of today's TVs get dumber.I say one should just buy a good \"dumb\" TV and Fire Stick (or similar).  When technology changes just change the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "simmons"}, {"rating": 5.0, "review": "I enjoy being able to watch shows without commercials.", "verified": true, "helpfulness": "0/0", "author": "Lynn Hudziak"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "martin porro miranda"}, {"rating": 5.0, "review": "I have the Fire TV, so when this went on sale for Prime Day, I grabbed it.  Its such a great device.  I was pretty committed in my house to AppleTV, but now I wish i had gone with the Fire TV in all rooms. With my AppleTV's (we have three of them) we often get poor performance of streaming shows.  I have never had a problem with the Fire TV.This Stick made a nice addition to the system.  Very happy with this.", "verified": true, "helpfulness": "0/0", "author": "faltered"}]