[{"rating": 5.0, "review": "Very happy with the Fire TV Stick ! I was trying to watch Netflix through my bluray player and couldn't because of constant rebuffering and problems. I Switched over to Fire Stick to watch the same program and had NO problems.  Is it me , or is the picture better too ?", "verified": true, "helpfulness": "0/1", "author": "Evelyn Gauthier"}, {"rating": 5.0, "review": "Helped me make my decision for cutting the cable. Easy to use and install!", "verified": true, "helpfulness": "0/1", "author": "Fred Kriss"}, {"rating": 5.0, "review": "Better than Roku and Chromecast!", "verified": true, "helpfulness": "0/1", "author": "william chaple"}, {"rating": 5.0, "review": "WOW, why didn't anyone tell me about this before ?? !!  Fantastic, Love it, opened up a whole new world for me!!", "verified": true, "helpfulness": "0/1", "author": "Anne N. Stoddard \"Nanny\""}, {"rating": 5.0, "review": "LOVE THIS!", "verified": true, "helpfulness": "0/1", "author": "Janet Rae"}, {"rating": 5.0, "review": "A must have if your a Prime member!!! Super Fast!!!", "verified": true, "helpfulness": "0/1", "author": "tredmon"}, {"rating": 5.0, "review": "The Five TV Stick is great.  So many choices to watch on our big screen TV.  LOVED watching the HBO series \"Bosch\" after reading the books.  Stayed true to the character and brought it to life.  Now we can watch all of this at our leisure.", "verified": true, "helpfulness": "0/1", "author": "G. Marting"}, {"rating": 5.0, "review": "The best item for the price. It's not meant for games but the steaming capabilities are unparalleled", "verified": true, "helpfulness": "0/1", "author": "chris jacobs"}, {"rating": 5.0, "review": "We got this for our master bedroom since we don't watch TV in there much, and the Roku wasn't cutting it anymore. We have the full Fire TV Box in our living room which we love, so we went with the smaller stick in the bedroom, and it's awesome. It's just like having the full box but in a tiny package. The remote is a little smaller then the box version, so that took some getting used to, but it's not a big deal. Overall, it's perfect for bedrooms or areas where you don't watch as often.", "verified": true, "helpfulness": "0/1", "author": "Ashley Dirks"}, {"rating": 5.0, "review": "My Great Grandson loved it.", "verified": true, "helpfulness": "0/1", "author": "yellow shoe"}]