[{"rating": 5.0, "review": "I purchased two of these and really like how well it works.  I gave one away as a gift.  I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Richard Fennell"}, {"rating": 5.0, "review": "I've only had it a week but love it so far.", "verified": true, "helpfulness": "0/0", "author": "Ruthie"}, {"rating": 4.0, "review": "Better wifi reception than Chromecast. Nice menus.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Buggy. Frustrating. I love the thing so much, but it's laggy and unresponsive on start up the majority of the time. Currently, all menu's show but not picture when movies play only sound. I will be sending this back unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Ryan Ritchey"}, {"rating": 4.0, "review": "Everything I expected!! Very easy to set up!", "verified": true, "helpfulness": "0/0", "author": "avalon pantin"}, {"rating": 4.0, "review": "have both fire tv and this the \"stick\". fire tv is definitely snappier but this does the job. install kodi and your set. 1 star deducted for lag", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, easy to set up and gets good signal.", "verified": true, "helpfulness": "0/0", "author": "kip bauldry"}, {"rating": 5.0, "review": "Incredible!! I love this!!!", "verified": true, "helpfulness": "0/0", "author": "teresa"}, {"rating": 3.0, "review": "We love the Fire Stick when it works.  We have issues with the programs wanting to buffer all of the time.  sort of irritating.", "verified": true, "helpfulness": "0/0", "author": "Pam Olson"}, {"rating": 4.0, "review": "it's great - have become addicted to it!  only disappointment is that many of the older PBS Masterpiece Mystery shows (i.e. Miss Marple, Poirot, Inspector Morse) are NOT free on PRIME.It was easy to install & worked right away!  I love it.  Now work on providing the above series free to PRIME members.", "verified": true, "helpfulness": "0/0", "author": "Rachelle M. Graff"}]