[{"rating": 5.0, "review": "As Described, Thanks!!", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "The Fire TV Stick is a simple plug and play device. The instructions are straightforward. The setup is pretty easy. I've streamed several TV shows and movies from Amazon, Netflix, and Hulu with this device without any problems.", "verified": true, "helpfulness": "0/0", "author": "Mary D"}, {"rating": 4.0, "review": "I really like my Fire Stick, it arrived quickly and is very easy to set up. I think the remote can be tweaked and improved upon. Other than that, it's awesome!", "verified": true, "helpfulness": "0/0", "author": "thurman smith"}, {"rating": 5.0, "review": "Enjoying the Amazon Fire TV Stick. It was easy to hook up and get started. Everything loaded very quickly. Still checking out all its uses.", "verified": true, "helpfulness": "0/0", "author": "Ina N. Anderson-Voyles"}, {"rating": 5.0, "review": "Kindle Fire TV Stick works great and streams seamlessly. It works just as well as my mom's $90 Roku unit... and I paid only $24 for it!! (Amazon sale in July.) At the time I was a little dubious that a stick would be able to stream wifi seamlessly without buffering, but I thought, \"What the heck... for $24? I'll give it a shot\". So glad I did. It's been a total solution for my home where I have internet, but no expensive cable subscription.", "verified": true, "helpfulness": "0/0", "author": "Lauri S."}, {"rating": 5.0, "review": "So easy to install. I can search on the tv or if I find something on my Kindle that looks interesting the prompts ask if I want to see it via the Fire Stick or online..", "verified": true, "helpfulness": "0/0", "author": "Alberta Hudson"}, {"rating": 5.0, "review": "Love it! Easy to use and install in under a minute.", "verified": true, "helpfulness": "0/0", "author": "Adam Gomez"}, {"rating": 5.0, "review": "Good product, good prce", "verified": true, "helpfulness": "0/0", "author": "Dana Relyea"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Love it. Love that you can use your iPhone app as a remote too as I'm always losing the tiny remotes", "verified": true, "helpfulness": "0/0", "author": "Aww"}]