[{"rating": 4.0, "review": "Absolutely a great product. I'm going to cancel cable and add Sling to have a full viewing pleasure.", "verified": true, "helpfulness": "0/0", "author": "Prime"}, {"rating": 5.0, "review": "Using the Fire Stick is so much easier than connecting the laptop to the TV.  Great product, decent price.", "verified": true, "helpfulness": "0/0", "author": "Shuffelin"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Gerard Duffy, Phila.,Pa."}, {"rating": 4.0, "review": "For the price it is a no-brainer to get if you already have Prime. But it's not as sleek or fast as my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 3.0, "review": "I like the channels, but buffering is a problem, on SlingTV.  I don't use it for anything else because Netflix and Hulu are on the TV.", "verified": true, "helpfulness": "0/0", "author": "Davemartinwood"}, {"rating": 1.0, "review": "The remote for this was almost unusable. It would often jump multiple selection spots ahead when trying to just move it one at a time. Granted I bought the first version for $20 and just recently tried it to much disappointment. I also had connectivity issues as well which didn't make much sense since I also have a roku box and a chromecast that work just fine.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 1.0, "review": "These things will not work anywhere in Canada, we have so much control also Rogers controls the market.No other competitors are allowed to get into Canada without the consent of Rogers.It's not the politicians but Rogers decides.", "verified": false, "helpfulness": "1/1", "author": "Best Buy"}, {"rating": 5.0, "review": "It's great, can watch shows on my time. Some shows must be seen from the beginning. Awesome", "verified": true, "helpfulness": "0/0", "author": "JoAnn Harris"}, {"rating": 3.0, "review": "I have very fast internet with no problems, yet this stick is always having to \"catch up\" to anything I try to stream live.  I can stream the same things on my computer with no problem.  I think that had I known of this issue I would have saved my money and bought a Fire TV console instead of the stick.", "verified": true, "helpfulness": "0/0", "author": "D. M. Osborne"}, {"rating": 5.0, "review": "Great ,easy to use easy to set up love all the movies", "verified": true, "helpfulness": "0/0", "author": "Robert Thompson"}]