[{"rating": 5.0, "review": "Easy to use", "verified": false, "helpfulness": "0/0", "author": "joshua pollock"}, {"rating": 4.0, "review": "Would be a five star but it'd got to be plugged in.", "verified": true, "helpfulness": "0/0", "author": "Kris Kremin"}, {"rating": 5.0, "review": "Very satisfied.  Not difficult to set up.  Lots of good shows ---many classics from PBS, for example ---- and gorgeous clarity on my big screen HDTV.  Nice to download free music from the Amazon Prime website.  Haven't yet accessed all the bells and whistles, but I'm leaning more daily about the benefits as I explore the sites.  Got the Stick for the introductory price so it has proved to be even a better value.", "verified": true, "helpfulness": "0/0", "author": "M. M. Berliner"}, {"rating": 5.0, "review": "Easy setup and works great! I like the remote and the included apps.", "verified": true, "helpfulness": "0/0", "author": "MrG"}, {"rating": 5.0, "review": "Best ever!", "verified": true, "helpfulness": "0/0", "author": "Ruben & Sheri"}, {"rating": 4.0, "review": "Great for the price. Would be better if I could use AirPlay without an additional third party app.", "verified": true, "helpfulness": "0/0", "author": "Ed1978"}, {"rating": 5.0, "review": "I am so in love with my new fire stick! I am able to look at my Netflix and Amazon prime movies without any additional charge. If I miss an episode of Scandal or want to see a newer movie, I can just pay a small fee of like 3 bucks per episode on Amazon! I can also listen to my Spotify music without any problems! There are many other features that I plan to discover soon. It was also super easy to just plug into the back of my TV. I bought two and really regret not getting three. A-M-A-Z-I-N-G!!!", "verified": true, "helpfulness": "0/0", "author": "DBM"}, {"rating": 5.0, "review": "Awesome! Best $20 I ever spent! Wish I had bought more than one.", "verified": true, "helpfulness": "0/0", "author": "Dianne"}, {"rating": 4.0, "review": "I have enjoyed it so far.", "verified": true, "helpfulness": "0/0", "author": "L. Shephard"}, {"rating": 5.0, "review": "Great Price. Fast Shipping!", "verified": true, "helpfulness": "0/0", "author": "Theresa Lopez"}]