[{"rating": 5.0, "review": "As described.some difficulty opening control.good product", "verified": true, "helpfulness": "0/0", "author": "granny"}, {"rating": 5.0, "review": "My little girl lost the remote yesterday but it's definately a great buy!", "verified": true, "helpfulness": "0/0", "author": "Nel Mercado"}, {"rating": 5.0, "review": "Works great.  No  problem on startup.  Very easy to use and you get great movies.", "verified": true, "helpfulness": "0/0", "author": "William McDonald"}, {"rating": 5.0, "review": "I am so glad I decided to give this a shot.  We are a cable free home, have been for about 5 years.  The price is very reasonable for the service it delivers.  I like that it gives our non-WiFi TV the ability to hook up and watch tv/movies with our Prime account and Netflix and many more TV apps.  We've even enjoyed a few games of You Don't Know Jack, which if you haven't played yet, you should :)Its portable and very quick and easy to move from one tv to another, interface is easy to use and navigate.  This is definitely a purchase I do not regret.....and I've had a few of those ;)In my opinion, this is a great entertainment alternative, budget friendly and has something for just about anyone in the family.", "verified": true, "helpfulness": "0/0", "author": "Brandy H"}, {"rating": 5.0, "review": "I love that it gives me the features of a smart TV without the high price tag of one. It eats up GBs fast, we went through 5GB of internet in a two day span. If you don't have unlimited internet pace yourself. Best $40 bucks spent. Yes, I am going to  order another for our other tv", "verified": true, "helpfulness": "0/0", "author": "Paula Reid"}, {"rating": 1.0, "review": "Waste of money!  Had to return it.  Connection problems were not fixable.We bought a second Roku and haven't had one issue with the Roku, so it was definitely a problem with the fire stick.DON'T BUY THIS!  Read all the reviews about connection issues, believe them!", "verified": true, "helpfulness": "1/4", "author": "Tana Perkins Reneau"}, {"rating": 5.0, "review": "I am loving it, best thing I have bought better than cable! Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Anita"}, {"rating": 1.0, "review": "I love the Fire TV, but the Fire TV Stick does not live up to it.  First I bought it thinking it would work with Miracast devices. So far it does not.It also has issues playing back video smooth. You get ripping and ghosting that we don't see with the Fire TV. I think it might have some kind of heat issue as well because the longer you watch in a sitting the worse the video ripping gets.  We have updated to the latest firmware and the issues still seem to occur.  Also there are no parental blocks to speak of on this unit as well (You can block purchases with a code) No safe viewing for kids. This is an issue with both the Fire TV and Fire TV Stick.I like the idea of the product but it's not quite there. I will likey go back to my Roku if Amazon does not clean things up soon with firmware updates.", "verified": true, "helpfulness": "1/4", "author": "Bryant Zimmerman \"It's a Communication Thing\""}, {"rating": 4.0, "review": "Happy with performance and features but the battery installation was a pita.", "verified": true, "helpfulness": "0/0", "author": "Cliff Edwards"}, {"rating": 3.0, "review": "Here is the thing, I already have a PS3, so I use that for all the apps I use, like Amazon, Netflix, and YouTube.I purchased the Fire TV stick for Twitch, and my god is this app horrible.  I don't understand since Amazon now owns Twitch, they could make a decent application.  You can't sign on to the Twitch application, no ability to search for your favorite streamers.  This is how the mobile applications were years ago.Once the work on the Twitch application my review will go up to 5 stars.  It's kind of sad, since this was the only reason I bought this.  The one thing I do have to say that I really like is that I can use my iPhone as a remote, it's really freaking cool.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]