[{"rating": 5.0, "review": "Worked immediately and well", "verified": false, "helpfulness": "0/0", "author": "Carolyn N. Drawert"}, {"rating": 5.0, "review": "LOVE IT!!! I get many channels and can't beat the price!!", "verified": true, "helpfulness": "0/0", "author": "Emily Santiago"}, {"rating": 1.0, "review": "Just bought my second stick as I'm committed to not returning to Time Warner.  The second stick performs miserably.  Buffers and pauses about every 3-5 minutes and then after about 30 minutes it completely boots me out of Netflix or SlingTV.  I'm returning.  What's really sad is the TV I'm using it on is 4' from the wireless router.  The first one I bought, from Best Buy, is on the second level and seldom has buffering problems.", "verified": true, "helpfulness": "0/0", "author": "Venus K"}, {"rating": 5.0, "review": "Amazon you did it again. This is a great product. The 2.4 & 5.0 dual band works great - it gets good signal when most of our devices don't. We use it daily. Cable be gone!", "verified": true, "helpfulness": "0/0", "author": "SolateNite"}, {"rating": 1.0, "review": "I wanted to do something nice for my dad, so I got this for him, thinking it would be simple and sufficient. Sadly, it didn't work at all. We could never even access it via the HDMI port of a Sony HDTV. Amazon's tech support was available but unhelpful. After trying everything, we had to send it back, and I ordered another comparable product from another company. I won't trust Amazon products ever again. They need to stick to shipping.", "verified": false, "helpfulness": "0/0", "author": "brteacher"}, {"rating": 5.0, "review": "Love it easy to use!!!!", "verified": true, "helpfulness": "0/0", "author": "jennifer friend"}, {"rating": 5.0, "review": "Used this on a spare monitor upstairs. Awesome device loads netflix perfectly.", "verified": true, "helpfulness": "0/0", "author": "Dustin Patrick"}, {"rating": 1.0, "review": "This worked well for the first two months ...after that it keeps reseting and never worked well after that ... I don't recommend the purchase", "verified": true, "helpfulness": "0/0", "author": "A. Nalicat \"nalicat\""}, {"rating": 2.0, "review": "Its OK but not great don't like the locked down software why allow installing 3rd party apps if you can't put them on the home screen?", "verified": true, "helpfulness": "0/0", "author": "Skipper Dreyer"}, {"rating": 3.0, "review": "Disappointing & movies are expensive.", "verified": true, "helpfulness": "0/0", "author": "joseph c somers"}]