[{"rating": 4.0, "review": "We love it. But would like to know how.to get fox news live on it and sports.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it works great", "verified": true, "helpfulness": "0/0", "author": "wayne brelsford"}, {"rating": 5.0, "review": "This product is excellent and was very easy to set up and worked well.  I watched movies on both amazon prime and Netflix without difficulty during a recent family trip.  For any future travel I'm taking this with me.", "verified": true, "helpfulness": "0/0", "author": "Gregory A Moffitt"}, {"rating": 5.0, "review": "I'm very happy with my new Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Sandy Cumings"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Lillian Madison"}, {"rating": 5.0, "review": "I picked this up because i like to do a lot of streaming from my home computer to the main entertainment center and my Xbox One seems to have a problem with updating the media library in a timely manner. I've tried fixing that but it requires constant maintenance. I figured i'd try another approach with this device.It works flawlessly. I downloaded the PLEX app and installed the server component on my machine. It took about 20 minutes to set up the app once i got the stick itself set up (a very easy process just to do the stick). I was streaming in 1080p without an issue over wifi. I'm very happy with that.The stick also has several other apps available such as hbo go, netflix and hulu. I've been very impressed thus far with those functions. Be aware that it DOES require a micro USB external power source, but comes with an included adapter.", "verified": true, "helpfulness": "0/0", "author": "James \"James S.\""}, {"rating": 5.0, "review": "I recently purchased the Amazon Fire Tv Stick. It arrived pretty fast than I expected.  The set up is very easy. I am very glad to purchase this. I don't have cable tv. I usually watch all my movies/shows online.  I have been watching them on my Tablet. But this is awesome. I can watch them on the big screen rather than on my Tablet.Thanks Amazon for the great product!Luna", "verified": true, "helpfulness": "0/0", "author": "Pinkbunnie218"}, {"rating": 5.0, "review": "Love this. The remote makes it very user friendly.", "verified": false, "helpfulness": "0/0", "author": "Geerdina Hardman"}, {"rating": 5.0, "review": "I love my Fire stick.  Is easy to set up and easy to use.  Priced right too.", "verified": true, "helpfulness": "0/0", "author": "C. Turner \"cturner\""}, {"rating": 5.0, "review": "Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Buckshot"}]