[{"rating": 5.0, "review": "Worked right out of the box. My other streaming devices never worked with the ease of Amazon's Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Bernard R Pena"}, {"rating": 5.0, "review": "An absolute must have!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Despite the substantial hardware compare to some of its rivals, it has the occasional lags/stutters in Netflix. Every now and then Netflix audio/video would pause/drop for like a second or so, very frustrating. I've experience this shortly after purchasing this last year, hoping that this will be addressed in later firmware, but the issue remained and never got better. I also have a chromecast and it does not have this problem, despite running on inferior hardware.Interestingly, Amazon prime videos does not stutter or lag. I now wonder if this is done (or not fixing it) on purpose. I also noticed other users on reddit/avsforum mentioning the same problem. I don't recommend this for Netflix use.The Apple TV (gen3 is pretty cheap now) provides a vastly superior Netflix experience. No stutter/lag at all.", "verified": true, "helpfulness": "0/0", "author": "R. Chi"}, {"rating": 5.0, "review": "Is very easy to use and have a great performance", "verified": true, "helpfulness": "0/0", "author": "Freddy Garcia Barquero"}, {"rating": 2.0, "review": "IT'S a good product for watching from the amazon store but watching a full hd 1080p video from another website or downloaded one it cant play it at alli even tried a hd 720p didn't work either.", "verified": true, "helpfulness": "0/0", "author": "JACKOP"}, {"rating": 1.0, "review": "Not impressed with the amount and quality of shows on amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Shane Napier"}, {"rating": 5.0, "review": "wonderful", "verified": true, "helpfulness": "0/0", "author": "michael a finch"}, {"rating": 5.0, "review": "Awesome way to use your prime membership. My kids love all the shows and movies for them. My wife and I have watched Bosh and look forward to the next season.", "verified": true, "helpfulness": "0/0", "author": "Eric Firestone"}, {"rating": 5.0, "review": "Works great! Easy install!", "verified": true, "helpfulness": "0/0", "author": "Heather Lester"}, {"rating": 5.0, "review": "I just love it! EASY to install. Works great, good picture.  I haven't even explored all that it can do. Very good price.", "verified": true, "helpfulness": "0/0", "author": "Theresa Cronin"}]