[{"rating": 5.0, "review": "Love it. Watched movies all weekend.  Now I can't say that there's never anything on tv. Very entertaining", "verified": true, "helpfulness": "0/0", "author": "T. Small"}, {"rating": 5.0, "review": "Does what its suppose to do streaming the products", "verified": true, "helpfulness": "0/0", "author": "product user"}, {"rating": 3.0, "review": "I bought this device because I knew/had read it installed KODI/XMBC which is a \"huge value\" and it didn't have over-heating problems unlike other android STICKS they make.. I like the amazon stick.. but I also read that it has incredibly buggy software compared to the roku3 which has a hell of a lot less ram.. and so for my part.. I tried the youtube app (which sucks) and saw it crashed (it did work for a while) I also even saw the \"netflix\" app crash (none of amazon 'prime' apps have crashed that I noticed yet)So for my part I say it's true.. this amazon fire stick's 3rd party or whatever and whoever made these apps are buggy.. which is the only sad/bad thing I have to say about it..I'm now installing kodi and I assume it won't crash much.. but I dunno..? all I can say is I like the amazon fire tv stick.. the software is nice mostly..... but the fact that amazon is running android and the fact that on NORMAL android the netflix or youtube app doesn't crash.. I give them a rating of \"PATHETIC\" when it comes to their apps :( (it's hoped that this will be fixed.. and I too hope so.. so I look forward to playing with kodi and amazon prime apps.. but I'll stay away from a lot of the 3rd party as I expect them to crash be buggy as well) netflix doesn't always crash?I dunno why amazon could just had made this a full android implementation..?? I think I'd been happier if they had.. I have a samsung smarttv in front of me.. it too has some kind of ARM processor and RAM in it.. same technology my phone/fire tv has.. but it's implementation of android and it's app's are too crappy to bother with.. even if it has NETFLIX.. it doesn't have 'prime' and it doesn't have 'kodi'", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Very pleased with the TV firestick.", "verified": true, "helpfulness": "0/0", "author": "Ron Abousleman"}, {"rating": 5.0, "review": "Bought this for my workout room...but liked it so much, going to get one for my main livingroom. This will make it so that my PS3 does not have top be on all the time. Awesome product !!!", "verified": true, "helpfulness": "0/0", "author": "Abel Cruz"}, {"rating": 5.0, "review": "Very fast delivery! Great product!", "verified": true, "helpfulness": "0/0", "author": "Joann Landrau"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was simple to install and is even simpler to use. I really like how it already had my information programmed into it. I would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Christina Parks"}, {"rating": 5.0, "review": "enjoy the movies and the fire stick works great...", "verified": true, "helpfulness": "0/0", "author": "Fred Pringle"}, {"rating": 5.0, "review": "Works great and is easy to use. We ended up buying two.Two things to consider:1. Make sure your wi-fi signal strength is good, otherwise it operates slowly, if at all.2. Use the parental control to require a password for purchases. Accidentally buying a movie is much easier than you might think.", "verified": true, "helpfulness": "0/0", "author": "Sigimund"}, {"rating": 2.0, "review": "It's ok for kid shows but there's not a whole lot of free movies and shows that are good. Also you can't get on he I gerber with it either which stinks. My kids love it tho for their shows!!!", "verified": true, "helpfulness": "0/0", "author": "loveymom"}]