[{"rating": 3.0, "review": "Bought this thinking it would simply plug in to HDMI and not require any power cords, etc (unlike AppleTV). Wrong. The marketing is misleading. You also have to plug this in to a wall outlet/USB for power, so you still have to deal with routing and hiding wires. Not sure if Chromecast is the same or not.  Still a good price for adding smart TV features, but I prefer AppleTV if I have to hide wires anyway.", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "EVERYONE needs one of these. I can't believe how amazing they are. With them being so cheap I didn't have very high expectations, but I was blown away. I want to buy one for every TV in my house now.", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 5.0, "review": "Best. Thing. Ever. Comes with all the typical apps (Netflix, etc.). Plus, being about to control it from a smart phone is, well, FUN. The only thing that would make this better would be having a web browser pre-loaded.", "verified": true, "helpfulness": "0/0", "author": "L. Kelsey"}, {"rating": 3.0, "review": "I thought the stick was a way to have access to more channels and shows without having to pay for each option. So the only thing I have is Netflix.", "verified": true, "helpfulness": "0/0", "author": "D Swann"}, {"rating": 5.0, "review": "Works great and 100 times better than my Sony blu Ray wifi box. Voice activated app is awesome and it's so easy to use and so small I can carry it anywhere", "verified": true, "helpfulness": "0/0", "author": "daddysvtgirl"}, {"rating": 5.0, "review": "Love, love, love the fire stick! I have thoroughly enjoyed watching videos and listening to music! We bought a second one for our bedroom. :)", "verified": true, "helpfulness": "0/0", "author": "Bev Crockett"}, {"rating": 5.0, "review": "Worked perfectly right out of the box! Simple easy-to-use instructions! And very cost-effective. So quick and easy to use, it has become the go to device for our entertainment!", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "So long expensive cable :)", "verified": true, "helpfulness": "0/0", "author": "Michael Reed"}, {"rating": 4.0, "review": "great product, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Frank J Madden"}, {"rating": 5.0, "review": "Wonderful  product  with so many options for my family  to watch.", "verified": true, "helpfulness": "0/0", "author": "linda chojnacki"}]