[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Michael Morales"}, {"rating": 5.0, "review": "It works great, the only thing that should be fixed is the wifi connection. I have my router next to my stick and it disconnects in the middle of a movie while the Internet is working well in my computer and mobilephone", "verified": true, "helpfulness": "0/0", "author": "Candelaria Fraga"}, {"rating": 5.0, "review": "The fire stick is the perfect alternative to slow expense \"smart\" tvs.  Lightening fast, fully customizable, and especially awesome if you are a prime member because you get access to prime free movies and TV as well as netflix and hulu or any other apps you might use.", "verified": true, "helpfulness": "0/0", "author": "Dvynesole"}, {"rating": 5.0, "review": "Love the Fire Stick. I can watch movies and shows with my Amazon Prime any time. Great small device and very easy to use and install. Would recommend to anyone", "verified": false, "helpfulness": "0/0", "author": "Harvey Levine"}, {"rating": 5.0, "review": "Works great, fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Peorggie"}, {"rating": 2.0, "review": "I was very excited to receive the fire stick. When you first start, they hype u up with a video of all you can do with it. But try watching your first movie. That's when things go wrong. Constant re buffering or losing the signal. It's hard to deal with, especially considering this is old technology", "verified": true, "helpfulness": "0/0", "author": "George Albert"}, {"rating": 5.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "Carrie Murray"}, {"rating": 1.0, "review": "No, unfortunately, it did not meet my expectations.  Everything to which the Fire TV Stick gave us access we could already get through our cable and Wii boxes.  The only difference was that using Fire TV costs premium amounts for what we were already getting for free.  I returned the item.", "verified": true, "helpfulness": "0/0", "author": "Pam Lynn Moore"}, {"rating": 5.0, "review": "So far we are very happy with the fire stick. It works great for ordering new movies and we love all the selection from Amazon prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Anne Levy"}, {"rating": 5.0, "review": "Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Tom Stewart"}]