[{"rating": 4.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "S. Brewer"}, {"rating": 4.0, "review": "quick to set up and get going. many apps require account activation via computer which is a bit annoying.", "verified": true, "helpfulness": "0/1", "author": "kcwizfan"}, {"rating": 5.0, "review": "I am absolutely happy that the fire stick allows me to catch up on episodes missed !", "verified": true, "helpfulness": "0/0", "author": "Johnell Todaro"}, {"rating": 5.0, "review": "Perfect.", "verified": true, "helpfulness": "0/0", "author": "mamaserenity"}, {"rating": 3.0, "review": "A bunch of junk", "verified": true, "helpfulness": "0/0", "author": "CATHY"}, {"rating": 4.0, "review": "Although not in US but managed to side load XBMC which i could watch lots of Live TV, you will require steady Internet though to enjoy this.", "verified": true, "helpfulness": "0/0", "author": "Victor"}, {"rating": 1.0, "review": "Until it supports miracast for Windows 8.1 like the certification means this product will be 1 star.  I also expected HBO go support and have yet to see it..", "verified": true, "helpfulness": "1/2", "author": "Tim"}, {"rating": 4.0, "review": "So fat so good a little trouble getting it set up but it is working now", "verified": true, "helpfulness": "0/0", "author": "Robert Hallman"}, {"rating": 2.0, "review": "I don't recommend this.  The first few days it worked great. I was loving how I can easily watch Netflix but then it would disconnect from our Wi-Fi network. This happened frequently throughout the day and it's extremely frustrating. The help page recommended that I reboot my Wi-Fi router but all my other devices were working fine, they also recommended i uninstall the YouTube app, which I couldn't do because I never installed it in the first place and I reboot it several times a day which most of the time fails. I would refund but my high expectations resulted in me throwing away the original box so I'm kinda stuck with it. Such a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Karla Avalos"}, {"rating": 5.0, "review": "Product as advertised and arrived on time, great product....", "verified": true, "helpfulness": "0/0", "author": "dowens21"}]