[{"rating": 5.0, "review": "It's amazing how well this works. If you can set it up for someone who is tech-unfriendly, all you have to teach them is how to point the controller at it and how to get to the apps they use (netflix, hulu, amazon instant most likely).For others who are tech friendly it offers a decent suite of applications of varying quality, plus access to all your photos saved on Amazon's Cloud.", "verified": true, "helpfulness": "0/0", "author": "Pavel Bass \"Jim\""}, {"rating": 5.0, "review": "Absolutely fantastic!", "verified": true, "helpfulness": "0/0", "author": "David Crelia"}, {"rating": 5.0, "review": "I love having the choice of watching anything I want, movies or TV shows, no commercials......", "verified": true, "helpfulness": "0/0", "author": "Vivian Glickman"}, {"rating": 2.0, "review": "The I got had a defective remote, so maybe because of that it didn't do everything I wanted, but I exchanged it for a Chrome Cast and am happier with that.", "verified": true, "helpfulness": "0/0", "author": "EE"}, {"rating": 5.0, "review": "Can't beat it.XBMC loads via side loading", "verified": true, "helpfulness": "0/0", "author": "S. Forcier"}, {"rating": 4.0, "review": "great device. sometimes bugs out or logs you out of amazon prime but in general it works like a charm. would definitely recommend this over chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jean-Remy L."}, {"rating": 5.0, "review": "Great product for the price. Doesn't work as well as the chromecast using apps casting functions but it comes with a remote and allows you to play amazon instant on your tv. definitely worth the price!", "verified": true, "helpfulness": "0/0", "author": "E.H."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Daryl Quaintance"}, {"rating": 5.0, "review": "It's nice", "verified": true, "helpfulness": "0/0", "author": "vicki clayton"}, {"rating": 5.0, "review": "Like! I've only experienced one time where it lost the wifi. I've only used the Prime streaming so far.", "verified": true, "helpfulness": "0/0", "author": "zrwlkrsn"}]