[{"rating": 5.0, "review": "I  am very pleased with my Fire TV Stick.I don't watch a lot of Television so I don't have cable, now when I'm in the mood for TV I know l will be able to find something to watch with my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "DW2"}, {"rating": 5.0, "review": "Works great - little to no buffering at all operating on Comcast Wi-Fi signal. Happy with it!", "verified": true, "helpfulness": "0/0", "author": "Daniel Leach"}, {"rating": 1.0, "review": "Would have been nice if I could use it. There was no stable connection between the stick and my wireless connection. I understand this is a big problem having to do with the security type on wireless networks. I don't want to deal with all that.", "verified": true, "helpfulness": "0/0", "author": "Jaime O."}, {"rating": 5.0, "review": "This is the best streaming stick for the price. I love this thing and you can use both 2.4ghz and 5ghz. Best money ever spent.", "verified": true, "helpfulness": "0/0", "author": "Mannie Fresh"}, {"rating": 5.0, "review": "Works as advertised,super fast and easy to connect.", "verified": true, "helpfulness": "0/0", "author": "Richard Gardner"}, {"rating": 5.0, "review": "Would have liked more directions for an inexperienced couple with hooking things up.  It's helped with the lousy TV shows of reruns this summer.  I can always find something enjoyable to watch.", "verified": true, "helpfulness": "0/0", "author": "Juanita"}, {"rating": 5.0, "review": "Love the use for watching videos.  Nice that the TV series just come up with the next not watched when selecting.Does not make good joy stick in games though.", "verified": true, "helpfulness": "0/0", "author": "Ruth E. Michaud \"Ruth E Michaud\""}, {"rating": 5.0, "review": "Love the fire stick. Free games great surprise.", "verified": true, "helpfulness": "0/0", "author": "Christi"}, {"rating": 4.0, "review": "The fire stick was everything I could have expected, only thing that would make it better if they added HBO Now to the downloadable app list.", "verified": true, "helpfulness": "0/0", "author": "Elliot"}, {"rating": 4.0, "review": "The device is super portable. I like that it provides a way to watch Plex, Netflix, and Amazon content. This device can be a bit slow compared to the actual Fire TV but I can understand that due to it's small size. I got this to take on trips (where we could hook it up to the TV in a hotel and use the free wifi) for cartoons for our kid. I used to have all Apple TV's throughout the house and they have now all been replaced by Fire TV's due to the support for Plex out of the box.", "verified": true, "helpfulness": "0/0", "author": "Iron Pylon"}]