[{"rating": 5.0, "review": "awesome love it!!", "verified": true, "helpfulness": "0/0", "author": "James K. Dezember"}, {"rating": 4.0, "review": "good product, needs more app support.", "verified": true, "helpfulness": "0/0", "author": "Meckshome"}, {"rating": 3.0, "review": "The audio is too low when I play the movies or any video I have to rise the volume in  TV up to 85, I went to setting and still the same. My kids love this thing because of the games a give you a  (is OK) recomendation.", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 1.0, "review": "Nice. But the one I have keeps freezing. I have to constantly unplug the power cord and plug it in over and over to do anything. I'll see if an update fixes it if not I'll return it.", "verified": true, "helpfulness": "202/225", "author": "Jay"}, {"rating": 4.0, "review": "Works great, very portable.", "verified": true, "helpfulness": "0/0", "author": "Karen Hall"}, {"rating": 1.0, "review": "I bought this for easy access to the free prime video content that comes with being a prime member.  Well easy is not the first thing that comes to mind when trying to get to that content.  Sure the interface is easy enough to use and navigation is a breeze, what is not easy is getting to the free content.  I need to go through the website a place the shows I want to watch in my watch list not intuitive at all.  The only good thing about the whole thing is it only cost me $19.95.", "verified": true, "helpfulness": "10/13", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Piss poor WiFi performance. Detects my WiFi strength in my room as 2/4 bars and keeps failing to connect. I moved my router(located in my basement) to a different spot and it started showing 3/4 bars and could finally connect. Amazon advertises it as having superior WiFi performance, but its a lie. All of my phones and tablets have no problem connecting to WiFi in my bedroom.", "verified": true, "helpfulness": "1/2", "author": "undisputed n00b"}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Quan Nguyen"}, {"rating": 4.0, "review": "So much better than watching Netflix on our Wii.  And love being able to watch free shows and movies in Prime.  So far we are very happy with our purchase!", "verified": true, "helpfulness": "1/1", "author": "Lisa Nej"}, {"rating": 5.0, "review": "easy install, works great.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]