[{"rating": 5.0, "review": "The minute this black box showed up, I knew this was going to be a truly enlightening experience. Then I opened the box, and let me tell you, it was beyond enlightening. The inside of the box is coated orange, but not just orange, I mean orange with the brightness of a thousand suns. Years ago I went camping and I got lost in the middle of the woods. Now I'll never go camping without this box - it could light the Valley of the Shadow of Death with it's supernova luminosity.Besides the intensely awesome colors, the FireStick performs wonderfully - especially with the iphone remote control app. I didn't tell my wife about the iphone app right away. I kept telling her she was pressing the wrong button when she asked me how to use the included mini-remote. Even though there's only like 6 buttons. Meanwhile I was secretly controlling things with my iphone just to mess with her. So I'm not sure if the app was designed purely for entertainment purposes or not, but I must admit that it was insanely awesome to watch the resulting confusion.", "verified": true, "helpfulness": "0/0", "author": "TWS \"LH\""}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "shanda"}, {"rating": 5.0, "review": "Compared to that Chromecast we got that broke within a month, the Fire TV Stick fantastic.  Remote is awesome, interface is really fluid and easy to use...great product.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Justin Cook"}, {"rating": 5.0, "review": "I absolutely love my Fire TV Stick... I wonder why I bought a smart TV!", "verified": true, "helpfulness": "0/0", "author": "Alicia RamonKane"}, {"rating": 5.0, "review": "Very pleased with my stick.Am now wondering if I should have gotten the box.Love not having a huge cable bill.", "verified": true, "helpfulness": "0/0", "author": "jan brown"}, {"rating": 3.0, "review": "Only issue we've had is frequent buffering. We have high speed cable internet service, so I didn't expect to have this problem!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "judi spelhaug"}, {"rating": 5.0, "review": "can not saying enough good things about this product, simply amazing", "verified": true, "helpfulness": "0/0", "author": "Joel Vetter"}, {"rating": 1.0, "review": "It's not very good or shall I say a waste of money because it worked for a few days and now just keeps saying cannot connect to server. Tried everything . Extremely frustrating experience . Would not give it one star however had to do it to write this review", "verified": true, "helpfulness": "0/1", "author": "Roshni Siddique"}, {"rating": 5.0, "review": "Even though I had a problem with my Fire TV Stick yesterday, the problem was solved rather simply by unplugging it from the wal and then plugging it back in!!  I enjoy the programs on Netflix and other apps and I am planning to turn off my TV in the morning since I can get my local channels with my rabbit ear antenna!!  I get a total of 9 local channels and even though I might miss some stuff on cable, the programs on Fire Stick help ease the pain of not having cable TV.  I know I am going to catch some flak tomorrow when I go to the cable office, but I know it is time to cut the cord!!  I told a close friend about this device and she has already ordered one!!  Later this year, in a couple of months or so, I plan to try Amazon Prime but I need to make sure I can pay for it when the 30 day trial is up!!", "verified": true, "helpfulness": "0/1", "author": "Larry L Miller"}]