[{"rating": 4.0, "review": "at first it was a little hard for me to navigate through I had to keep reading the prompts for an older person I wish it was just a little simpler but thank you again for fire stick", "verified": true, "helpfulness": "0/0", "author": "martha"}, {"rating": 5.0, "review": "great item-wish i bought 2!", "verified": true, "helpfulness": "0/0", "author": "carol frawley"}, {"rating": 5.0, "review": "Initially it had me very frustrated, forced me to watch a video that couldn't be skipped or fast forwarded, then got super slow(i kept pressing the buttons on the remote, minutes later it finally started moving through the Netflix app following every button press and forced me to unplug it to reset it)After the button incident, I moved the power cable from the USB port on the TV to an outlet and it's given me 0 issues since. I don't own a Chromecast or anything similar so this is great, and tons faster than my Blu-Ray player and it's apps.", "verified": true, "helpfulness": "0/0", "author": "Cliffton Thompson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Debbie Brock"}, {"rating": 5.0, "review": "Amazing and easy to use!!!", "verified": true, "helpfulness": "0/0", "author": "Chai"}, {"rating": 2.0, "review": "Does not live up to my expectations.  We have moved our WiFi router as close as 15 feet away, and it still does not keep a constant signal.  Some days it does not even hook up at all.  And when we do get into Netflix or Hulu it cuts out every few minutes.  Not worth the money, wish I would have just purchased another Roku box instead.  Never any issues with the Roku, even the router farther away now!", "verified": true, "helpfulness": "0/2", "author": "Rich"}, {"rating": 5.0, "review": "Low cost entry-way to a plethora of features when paired with Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "tonyde"}, {"rating": 4.0, "review": "Really easy to use, but must have a good wifi signal to stream across. Hope Amazon adds more content so I can completely disconnect from cable TV. Need to include ESPN and standard television stations so I can still watch sports games live", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "This is a game changer - I amVery impressed!", "verified": true, "helpfulness": "0/0", "author": "Bella in VA"}, {"rating": 5.0, "review": "The Fire TV stick works exactly like I wanted. When I bought this product I was a little nervous to buy this over the more expensive Fire TV box wondering if the slower processor would be a big drawback. I was 100% wrong. It was shipped pre-loaded with my prime account and from there adding apps and programs was incredibly simple. We have since watched many programs through both Prime and Netflix and each time it was very easy to navigate and we never had any issues with slowness or buggyness that we had with a competitor's product. We only really watch TV and movies on here so I cannot comment on the games, but as casual viewers, this product meets all of our needs. I am going to purchase this for my parents that should also be able to use the easily navigable interface.", "verified": true, "helpfulness": "0/0", "author": "Ashley Cline"}]