[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Loree Hickman"}, {"rating": 3.0, "review": "It has problems with Hulu. !", "verified": true, "helpfulness": "0/0", "author": "Chad J. Livingstone \"annapolitan\""}, {"rating": 5.0, "review": "Love this product. We have  in our home and use them all the time now. Hopefully we will be cutting the cord on cable very soon!", "verified": true, "helpfulness": "0/0", "author": "s"}, {"rating": 5.0, "review": "Easy to set up, easy to use and the price was terrific!", "verified": true, "helpfulness": "0/0", "author": "Mike Moore"}, {"rating": 3.0, "review": "Would love to give this five instead of three stars. The good--easy to plug in and start using. Fairly easy to navigate and works great with the app on my phone. The bad--and this is pretty bad--it messed up the screen resolution on our tv. After installing the YouTube app it asks to adjust your screen to optimize for viewing YouTube videos. Like a fool I did it thinking it would go back to normal once out of the app. We did a reset on our TV and our cable box and while it is better it is still not back to normal for widescreen. Tech assistance for our TV says it is something we would have to take in to have recalibrated.", "verified": true, "helpfulness": "2/2", "author": "magentalizarin"}, {"rating": 3.0, "review": "underpowered. waiting for updates.", "verified": true, "helpfulness": "1/2", "author": "Chris Ellis"}, {"rating": 5.0, "review": "I absolutely love this fire stick. My kids can play games with the extra controller you can buy just like the ones they play on their phone. When they saw they could play their shark game it was over! I had to get another one. It's easy to navigate with lots of apps you can add. I don't normally write many reviews but I truly love this little stick. Way better than original roku I have.", "verified": true, "helpfulness": "0/0", "author": "sarah"}, {"rating": 1.0, "review": "Fire stick has not been reliable for me. It works for a while then disconnects from my network.This has happened a number of times.My network is fast (75mbs) with a strong signal. All other devices connect without problems.If I remove power from Fire Stick and restart, it will work...This could be a firmware or software issue.I do think that Amazon will probably come up with a fix after enough people report this.I would not recommend buying at this time until this is resolved.", "verified": true, "helpfulness": "1/2", "author": "RONDO"}, {"rating": 4.0, "review": "I am really enjoying the Fire TV stick since ordering it.  It has a super slick interface to find content.  It is like an improved Roku.  Roku I find to be a more boring and slower version of this.  Scrolling through Roku menus and episodes can be painfully slow.  The opposite on this device.  The remote is also impressively responsive.  I thought there was no way it'd be responsive enough to do well in a game like flappy bird, but alas it was.Now, there are a few reasons I give it 4 stars instead of 5.  One is that it is too biased towards amazon content.  Like voice search only works on their content.  And the main menu stuff is all amazon prime content.  No offense to prime video, I use it from time to time, but I'm using Netflix, Hulu, etc also.  Which isn't a big problem, it just makes an extra click or two to get to those videos than probably necessary.I also find that the fire stick doesn't seem to work perfectly with my hdmi switcher.  When I put it into suspend mode, the switcher seems to think the fire stick is still streaming video.  Not a big problem, but a bit of an annoyance.The lack of HBO Go is also an issue, but I won't penalize fire tv for this, as they've announced its coming soon.  Once it gets HBO I think it's going to be the clear leader in the streaming wars.  Until then I think its a neck and neck race between it and chromecast [with roku slightly behind]", "verified": true, "helpfulness": "0/0", "author": "Mike V"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "John"}]