[{"rating": 5.0, "review": "I can sum it up quickly.  I love it.", "verified": true, "helpfulness": "0/0", "author": "prewby"}, {"rating": 5.0, "review": "Super!!", "verified": true, "helpfulness": "0/0", "author": "Phaniraja"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "sharon d ellis"}, {"rating": 4.0, "review": "Still learning how to use the various apps.Easy installation.... Versatile and well worth the money.\\I am happy to cut the cord!!!!", "verified": true, "helpfulness": "0/0", "author": "Proverb 31"}, {"rating": 4.0, "review": "Worms great! All that you need is in this little stick", "verified": true, "helpfulness": "0/0", "author": "Kah Wah Cheong"}, {"rating": 5.0, "review": "The Fire Stick is a great way to stream video.  We used it in our mountain place with no problems.", "verified": true, "helpfulness": "0/0", "author": "Douglas B. Chappell"}, {"rating": 4.0, "review": "Very easy to setup. Easy to navigate but with just a few spots you have to get used to.  Everybody should try this.", "verified": true, "helpfulness": "0/0", "author": "Robert Edwards"}, {"rating": 4.0, "review": "I got it mainly for Amazon prime videos, youtube and Pandora. I haven't had a chance to explore other apps yet but so far I like the device. It's small and attaches to the TV via the usb port. Not bad for the price.", "verified": true, "helpfulness": "0/0", "author": "Mom of Twins"}, {"rating": 3.0, "review": "Get Chrome Cast if you don't have to use Prime.", "verified": true, "helpfulness": "0/1", "author": "r to the ia"}, {"rating": 5.0, "review": "We are loving our Amazon Fire Stick!  It is quick to follow commands, has a wide variet of apps for both the adults and children in our household. My youngest son especially loves the Disney App.  I like how easy it is to use. We like playing games and watching all the great content available. In fact I have purchased 2 so that my kids can watch something on their TV while we use ours!", "verified": true, "helpfulness": "0/0", "author": "Christy S."}]