[{"rating": 5.0, "review": "Best product I've used in a very long time. The interface is extremely snappy and the device allows a great deal of user control. I am a big fan of the way Amazon has allowed 3rd party apps to be installed. It's as simple as using an android app called \"apps2fire\" to copy over your favorite android apps to the big screen. I've installed Firestarter launcher that brings up all my third party apps at a doubletap of the home button. Not only can I watch my favorite shows, but I also have my favorite classic Nintendo / Sega games to play. All packed into a stick that could fit on a keyring. Unbeatable price point. Getting a chromecast / roku over this beauty would be a mistake.", "verified": true, "helpfulness": "0/0", "author": "Jesse Fleming"}, {"rating": 5.0, "review": "Very impressed", "verified": true, "helpfulness": "0/0", "author": "......"}, {"rating": 5.0, "review": "Has good selections of tv shows and movies. Worth getting especially if you have only very basic cable.", "verified": true, "helpfulness": "0/0", "author": "sammi"}, {"rating": 5.0, "review": "I was impressed with how easy it is to use. I 'll liked the help video that can be accessed. I have watched off several movies on Amazon Prime. I need to subscribe to Netflix to increase my viewing.", "verified": true, "helpfulness": "0/0", "author": "Al Chance"}, {"rating": 5.0, "review": "One of my favorite purchases this year. I want to buy another one!", "verified": true, "helpfulness": "0/0", "author": "norm"}, {"rating": 5.0, "review": "It is a little gem! Brilliant work, Amazon!  The stick is extremely responsive and the prime content, fabulous!", "verified": true, "helpfulness": "0/0", "author": "Hebs"}, {"rating": 5.0, "review": "So far I absolutely love it! There are some really cool apps for the fire (I recommend Pluto TV), pandora, Netflix. The remote app for the iphone is nice too and very functional. I am so glad I bought this over the chromecast", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Easy set up. And very easy to use. Very portable. Lots of movies and programs love it. Who needs cable? Very easy on the budget.", "verified": true, "helpfulness": "0/0", "author": "DAS"}, {"rating": 5.0, "review": "Sideloading capabilities, Runs Kodi flawlessly.", "verified": true, "helpfulness": "0/0", "author": "George Colunga"}, {"rating": 5.0, "review": "Love it. Super easy 2 set up. Would highly recommend", "verified": true, "helpfulness": "0/0", "author": "Loretha Latimer"}]