[{"rating": 5.0, "review": "The fire stick was very easy to install and it worked right immediately!", "verified": true, "helpfulness": "0/0", "author": "NolaJean"}, {"rating": 5.0, "review": "Love it...simple to install and great to use...", "verified": true, "helpfulness": "0/0", "author": "4061"}, {"rating": 2.0, "review": "I use the stick on the computer monitor to stream all the apps and it constantly crashes.  I know I can reset it but if I have to do it several times a week it is really annoying.  We have two Roku boxes and Amazon stick.  I like Roku box a lot more.  Roku only freezes and needs resetting once a year where as I mentioned earlier Amazon stick needs to be reset several times a week.", "verified": false, "helpfulness": "0/0", "author": "Ruslana Monya"}, {"rating": 3.0, "review": "NOT Samsung compatible! I have a Vizio and it works great and loved it! Tried to use in my bedroom (got a Samsung as a present from my son) and it doesn't work at all. I looked it up and it apparently isn't compatible with Samsung. I guess I will have to use my Chromecast for the bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Leah"}, {"rating": 5.0, "review": "Better than expected", "verified": true, "helpfulness": "0/0", "author": "GWEN HARRISON"}, {"rating": 5.0, "review": "The Fire TV Stick is outstanding.  It loads really fast, no buffering. The remote is simple and easy to use.  Love the feature of it being already set up when it arrives, all you do is plug it in and watch.  Love the size, no need for a cabinet, just plug it into the HDMI plug on the tv and plug the power plug into the USB in your tv.  I have to say, I had some trouble with the power plugged into the wall.  It made the stick really hot and one time I had trouble.  I used the remote to scroll through a menu but when I let go of the button, it kept scrolling by itself.  I touched the stick and it was really hot.  I tried using the USB for the power and and it has run just fine for a month now.  Running cool and no trouble.", "verified": true, "helpfulness": "1/1", "author": "Buyer \"Buyer\""}, {"rating": 5.0, "review": "Had the fire stick for a few weeks so have not had time to check out all it has to offer.  I bought so I could watch the Bosch series which we enjoyed a lot.  Also, have watched all the seasons of Justified.  We have been extremely pleased so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Bruce H. Shaw"}, {"rating": 5.0, "review": "Love it, so easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Katie Brown"}, {"rating": 2.0, "review": "Had the stick for a few weeks and worked good and now will not connect to the wifi, keeps \"scanning\" for networks.  Stick is defective and will be returned.", "verified": true, "helpfulness": "0/0", "author": "ctv20"}]