[{"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Josue A. Fernandez"}, {"rating": 3.0, "review": "We like the Firestick for Netflix, but it did not work with the HBO -streaming issue with pauses.  Have already cancelled the HBO subscription.", "verified": true, "helpfulness": "0/1", "author": "Mary W."}, {"rating": 5.0, "review": "Very nice and simple to use. Like the selection of programs available.  Found both US and foreign programming available.  For the money, it is hard to beat.", "verified": true, "helpfulness": "0/0", "author": "Alan Hanigan"}, {"rating": 5.0, "review": "It works like it says it will.", "verified": true, "helpfulness": "0/0", "author": "Virginia"}, {"rating": 5.0, "review": "I like it, it's easy to use.", "verified": true, "helpfulness": "0/1", "author": "silavy"}, {"rating": 1.0, "review": "I was using the HDMI extender that comes with it, and it was plugged into the back of my tv literally about 12 inches away from my router. It kept dropping the network. It would stream video from any app for more than 1 minute before it would drop the network. I looked around online for possible solutions and found a lot of people had the same issue. Couldn't figure it out, everything I tried didn't help. Amazon themselves said that this has been a problem. Looks like I'm going with Roku.", "verified": true, "helpfulness": "0/0", "author": "Jared Crossley"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Johnny2177"}, {"rating": 1.0, "review": "Doesnt pick up my wireless in the next room. My phone does more than a half a block away.", "verified": true, "helpfulness": "0/1", "author": "Gregg Juleen"}, {"rating": 2.0, "review": "Graphics are amazing and device is very functional. Amazon and Netflix work really well but Hulu always buffers and misbehaves, something it doesn't do with my Roku. I've quit using the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Scott A Beck"}, {"rating": 5.0, "review": "Fantastic!!!", "verified": true, "helpfulness": "0/0", "author": "poppy \"lynn Sweikhart\""}]