[{"rating": 2.0, "review": "Fire TV Stick is not compatible with with TV sets over 6 years old (Panasonic at least).  A incident was opened with Amazon technical support two days ago and I've yet to hear response or what the next steps are.  My advise:  go buy a blu-ray player.", "verified": true, "helpfulness": "2/6", "author": "Rocky Inboden"}, {"rating": 4.0, "review": "Setup was easy. Setup of my accounts was simple. Starting watching tv shows and videos within 5 minutes. I bought 2 and the 2nd one was just as easy to setup on my other tv.", "verified": true, "helpfulness": "0/0", "author": "New PL user"}, {"rating": 5.0, "review": "Delivered this morning, I immediately went to work to put this in place. I made the connections, started the set up, but it kept getting hung up on the software upload and kept telling me to unplug and/or try again later. I was pretty sure this was going back in the box but I don't give up easily. Finally the upload was taking place, even with the warning that my Internet connection seemed to be somewhat slow. But it went.And finally, it was there. It really was worth installing. I don't have cable (or want it). I created a watch list, tried out the music from my cloud -- this makes a great karaoke machine, watched a Amazon original television series (Transparent -- loved the 1st episode, can't wait to watch them all). Watched a few cooking videos, checked the weather. I just wish I could find some news (and I am sure I can and will). For the special Prime member offer that I took advantage off, this really was a great deal. And even the regular price would have been worth it.", "verified": true, "helpfulness": "1/1", "author": "J. Keith Tillery"}, {"rating": 1.0, "review": "Hated the mandated intro video, that I seemingly had to watch. Otherwise it's all it says it is. Tons of apps already on the market. Video plays flawless, and I love that I can take and play all my amazon purchased movies anywhere.Edit: So after some time using the product, seems there are a few issues. The majority of them being connection issues. It will randomly loose connection, and only resetting will fix the issue. This has happened with multiple apps, various times. The next biggest issue I'm ran into pretty frequently is my netflix account keeps loosing the account information. This seems to happen every few days, almost as I've never used the netflix app before. It could be an app problem, but I've yet to have the problem on any of the other devices I use or have used the netflix app on. And as stated by some other users, the remote couldn't feel more cheap. I fear if I use it, it may fall apart in my hand.Edit: changed to one star. After months of trying to use it, I've come to realize its basically a piece of junk. Ive had the I love amazon blinders on. It may work if you want to watch one 30 mins show. I can guarantee using netflix on mine its going to stop playing the movie half way through, about 45 mins. Using the plex app it will eventually crash the entire device sending it into a reboot loop forever until I reset it. If you purchase something like a season pass from amazon sometimes the show wont actually show up, but it will have the one from hulu. Hulu in itself is another issue. The device may as well be the hulu device, its totally intergrated into it and no way to get rid of it. Any searches will bring up hulu content. Of course the remote has gotten worse with time, the buttons seem to get stuck, so one click turns into 2 or 3. Youll attempt to push right one selection and it will scroll across the screen.", "verified": true, "helpfulness": "1/1", "author": "Adam Sweeney"}, {"rating": 5.0, "review": "great product to buy amazon.com is the best will never shop nowhere else unless it is amazon.com", "verified": true, "helpfulness": "1/1", "author": "Policarpo Coronado"}, {"rating": 5.0, "review": "Love this product. Works well and was easy to set up. Does more than expected.", "verified": true, "helpfulness": "1/1", "author": "B. J. Davis"}, {"rating": 4.0, "review": "As per only one day of use, I give it 4.5 stars. I might change it the more I get to use it but for now, the set up was easy (it was weird that I had to update itself!).The stick was already linked to my Amazon prime so that was neat.The quality was very good. It is probably lower than BlueRay but I was happy with what I got.The stick and control are nice but not sure if the material used to make them is durable enough.Interesting enough, it also takes control of the TV's input so when the stick it turned on, TV's input automatically switched to it.", "verified": true, "helpfulness": "0/0", "author": "M and M"}, {"rating": 5.0, "review": "Works great so far! Snappy interface.", "verified": true, "helpfulness": "1/1", "author": "David Crosson \"KlytusImBored\""}, {"rating": 5.0, "review": "I love it!  Simple to setup and works great.  I have Apple TV, Chrome Cast, and Roku.  FireTV Stick is best by far.  Wish I had one for each TV.", "verified": true, "helpfulness": "1/1", "author": "D. Squires"}, {"rating": 3.0, "review": "So many differences. I am an Amazon Prime users (for years now). I get all the devices (except the phone - are you kidding me on that one - anywho).  There are so many differences from the Amazon Fire Tablet, Fire TV, Fire TV stick, Amazon App on Roku, Amazon on the web (to watch and listen). That it is really crazy keeping up. Together, they are all great, but each one lacks something. For now I will focus on the Fire TV and Fire TV stickBad Amazon:1) Ads on the Fire TV stick- even for Prime members. This was not mentioned before purchasing. This is not on the Fire TV unit, just the stick. Really, Really Bad Amazon.2) Amazon Music was not originally on the Fire TV console, but they did add it. However, they left off the Amazon Music Prime. It will only play songs you own. Bad Amazon.3) Amazon stick supports voice search, but the remote to use it is by phone app or you have to purchase a separate one. Fire TV console comes with this remote. Not so bad, but Amazon could have been clearer about this in the ad before purchase. (it is there, just not all that clear for my taste).4) The Amazon Roku app is better for Amazon music, the only thing better is the Amazon web site for music. Only the website is the best for finding music you want to purchase. It shows all the options for a title, the others do not.5) Genres selections are pre-set for you. On the Web there are a lot of selections. On Fire products there is a limited number of them. Why not offer me the choice of which ones to show. Plus, why is there no LGBT Genres for Prime (only there for purchasing)?6) Would be nice if you could plug other HDMI devices into it - as a pass through, when not in use. I only have 1 HDMI port, I have to swap it in and out or purchase an HDMI hub. A pass through feature would make it so much better than others.I could go on, but those are the most frustrating for me at the moment.", "verified": true, "helpfulness": "4/6", "author": "do-not-ask-me \"do-not-ask-me\""}]