[{"rating": 5.0, "review": "Very cool, Amazon. Nice touch with the voice remote via the app. I'm a fan.", "verified": true, "helpfulness": "0/0", "author": "Nicole Henderson"}, {"rating": 5.0, "review": "I have a dvd player that offers lots of options like DirecTv, You Tube etc.,  but Amazon Prime is not one of them.  I bought this and love it.  It is easy to install, easy to use, and I am totally impressed with the programming options.  Amazon is continually getting better in this field.  I can't wait until I can cut my Cable/Satellite connection.", "verified": true, "helpfulness": "0/0", "author": "Chazz"}, {"rating": 4.0, "review": "So far i love this gadget, and so does my girl friend.", "verified": true, "helpfulness": "0/0", "author": "paul mark jeglum"}, {"rating": 5.0, "review": "fire stick does everything its supposed to very happy with it", "verified": true, "helpfulness": "0/0", "author": "carl holt"}, {"rating": 5.0, "review": "I love the stick. I was a little confused because there were some new movies at a site but it said to buy or rent  as the new movies get older will they be sent to the prime site. There was a movie I wanted to see. I enjoy watching all the movies on these snowy days", "verified": true, "helpfulness": "0/0", "author": "Dorene"}, {"rating": 5.0, "review": "Excellent investment, great HD quality", "verified": true, "helpfulness": "0/0", "author": "Richard J Rasmussen"}, {"rating": 5.0, "review": "Very good item glad I purchased it", "verified": true, "helpfulness": "0/0", "author": "john ayers"}, {"rating": 5.0, "review": "I plugged it in and shazaam! All of a sudden I had a smart tv! I like the easy menu interface. Few minor complaints but not bad enough to worry about", "verified": true, "helpfulness": "0/0", "author": "Robert Wiley"}, {"rating": 3.0, "review": "Fire TV Stick was a Christmas from a grandson and installed it in our television and my smart phone.........however, we have only 3g in our small town; when we try to stream a movie we get frequent delays as the screen goes into the downloading \"circle\" on the screen which is very annoying so we have reverted to dvds. It's now Amazon's fault the device did not work very well, not Amazon's fault.  Maybe we'll live long enough to see our town install 4g and we'll get to use our Stick.  Sorry. I gave a three star for the Stick because we can't use it properly.", "verified": true, "helpfulness": "0/1", "author": "Betty Majeski"}, {"rating": 5.0, "review": "WE LOVE IT", "verified": true, "helpfulness": "0/0", "author": "RICHARD SMITH"}]