[{"rating": 5.0, "review": "Easy simple to use. Clear interface makes locating what app you want to use easy. New update makes it easier when wanting to put the Fire stick to sleep. Love it! Does everything it says it does.", "verified": false, "helpfulness": "0/0", "author": "Jorge Mondragon"}, {"rating": 5.0, "review": "Super easy to install and great access to Netflix.  Haven't tried it on different TVs yet, but I like that you can also download a remote for your smartphone.", "verified": true, "helpfulness": "0/0", "author": "Kira N Waite"}, {"rating": 5.0, "review": "Have only had it for a few weeks, but am happy with the purchase. I like that my account was already established upon purchase. When I got it, it was ready to use. Seems easy enough to navigate through the options with the remote. I'm sure there is more to discover. The only problem I encountered was putting in the batteries. I know it sounds silly, but there were no instructions on how to open the remote. I had to use a knife blade to pry it open, yes it was that tough to open. Hopefully it's a long time before replacing them.", "verified": true, "helpfulness": "0/0", "author": "Ted lewand"}, {"rating": 2.0, "review": "It's ok but I bought it to stream vudu and I cannot. I guess I'm stuck with it.", "verified": true, "helpfulness": "0/0", "author": "ALEXANDER FINLEY"}, {"rating": 4.0, "review": "I already own the Google Chromecast, so at first I wasn't sure if I would find the Fire TV Stick necessary. But after researching and playing around with it, I found out the Fire TV Stick has a lot of cool features and programs that the Chromecast doesn't! It makes streaming media on my TV so easy and convenient! The image quality is great, much better than hooking up a laptop to the TV with an HDMI cable. I would say the Fire TV stick is superior to the Google Chromecast", "verified": true, "helpfulness": "0/0", "author": "kurt"}, {"rating": 5.0, "review": "I bought this to play with it, if you like to tinkering around this is nice, I have install KODI in this and watch live TV from US and other countries, of course not everything plus it $39 bucks", "verified": true, "helpfulness": "0/0", "author": "Tony Romo"}, {"rating": 2.0, "review": "Constantly freezes. Sometimes freezes, but the audio still continues.  All in all a very frustrating experience.", "verified": true, "helpfulness": "0/1", "author": "Pat Cassella"}, {"rating": 5.0, "review": "TIVO no longer supports Amazon movie rentals which meant my path to Amazon for movie rentals needed to change.  To my surprise, the Fire TV stick does the trick, better than TIVO, for a fraction of the cost.  It's a great product.", "verified": true, "helpfulness": "0/0", "author": "Paul I Rubinfeld"}, {"rating": 5.0, "review": "I bought this for the TV in our bedroom. We like it so much I will buy another for the living room the replace my Net Gear NeoTV box.", "verified": true, "helpfulness": "0/0", "author": "JCW"}, {"rating": 5.0, "review": "i think that this is the best...works perfectly and hasa lot of great free apps. thanks, amazon!", "verified": true, "helpfulness": "0/0", "author": "ed tomecko"}]