[{"rating": 4.0, "review": "It is a good way to know different ways of entertaining but no the best.", "verified": true, "helpfulness": "0/0", "author": "Dario"}, {"rating": 5.0, "review": "Love it. Solved my streaming problems.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "Simple and effective. My wife, my kids, and myself all use this on a regular basis. We primarily stream Netflix, Amazon Prime videos/rentals, and Plex (for content off a pc). It is simple to setup and use. There were some issues with the unit restarting on its own at random times but it seems like an update at some point removed the issue. It is annoying to have to plug the power cable in but that's life.Overall 5 stars from myself and my family. We own two and I plan on giving some away to family who have not dove into streaming yet.", "verified": true, "helpfulness": "0/0", "author": "NOTaBOT"}, {"rating": 3.0, "review": "It was not compatible  with my WIFI", "verified": true, "helpfulness": "0/0", "author": "MARIA RIVERA"}, {"rating": 5.0, "review": "Yes, enjoying every minute of it.", "verified": true, "helpfulness": "0/0", "author": "Ria P."}, {"rating": 3.0, "review": "When I received the Fire TV Stick I expected, led by all the hype, that I would be able to get so many new pictures and to get tv series on demand.  It seems every show that I want to watch, whether it be a Movie or a TV program, I have to pay as it is owned by HBO.  I have watched a few movies through Fire Stick but they were not newer movies or shows.,  I have Netflix and I use Fire as a method of quickly getting into its options.  Netflix has more of the movies and TV shows I want to watch.  Would buy it know what I know now?  Probably not.", "verified": true, "helpfulness": "0/0", "author": "bowarcher52"}, {"rating": 5.0, "review": "Exceeded expectations", "verified": true, "helpfulness": "0/0", "author": "Rdog"}, {"rating": 5.0, "review": "Excellent product; very convenient.  Works as advertised.  Well pleased.", "verified": true, "helpfulness": "0/0", "author": "Larry W."}, {"rating": 5.0, "review": "Love it. So much faster than my old Roku box.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "I'm still working on learning all the in and outs of it but it's great!", "verified": true, "helpfulness": "0/0", "author": "Lisa Iovino"}]