[{"rating": 1.0, "review": "I've had the Amazon Fire TV Stick for 5 months now and I've probably used it a total of twice. Whatever Wi-Fi hardware the stick uses is awful, as the thing can't keep connected to a network (I am about two rooms away from my router). When it does stay connected to the network...you're met with infinitely long \"Loading\" screens that eventually end with your network connection being dropped. I'd be better entertained folding 40 $1.00 bills into paper airplanes and sailing them from my rooftop.", "verified": true, "helpfulness": "1/2", "author": "Brian Slivka"}, {"rating": 5.0, "review": "I love it--easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Deborah M. Hylock \"edeb\""}, {"rating": 4.0, "review": "This is nice Pluto app is great so are other apps . I like it .", "verified": true, "helpfulness": "0/0", "author": "Saymone"}, {"rating": 4.0, "review": "This is a great product. It does what it is supposed to very well. Lots of apps, and a great picture. While I have a ps4, my wife cannot be bothered to use it for streaming because it she would have to use the controller. The menus seem to be \"confusing\" in some way as well on the ps4 . So in order to finally give cable the boot, we got two fire sticks and subscriptions to hulu, sling TV, and Netflix plus the Amazon prime content. We have a powered hd antenna for local, which looks better than our cable for sports/news anyways. Two tiny complaints tho about this product...despite its great interface, the remote is far too miniscule and ninjalike. It defies reason and finds every crevice possible.  The remote has flimsy buttons and the home key sucks since it is easy to hit it all the time accidentally and it kicks you right off your program, which sucks on sling tv. I use my phone instead now; much better. Second issue: no power off other than sleep mode, so you will have to unplug it or use a power strip. Great product despite these little issues.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and easy to use. I love it. I have one on all three of my televisions. The price is great. I love my viewing options and I cut the cable service.  No looking back, I am saving myself over $100.00 a month", "verified": true, "helpfulness": "0/0", "author": "Janice Foster"}, {"rating": 4.0, "review": "Great little device...But works only in USA...I have used it while in Orlando condo. Needed to have IT set up the login..easy done..Now we back to the show...", "verified": true, "helpfulness": "0/0", "author": "John C. Berardo"}, {"rating": 5.0, "review": "It's awesome.  I've recommended it to several people.", "verified": true, "helpfulness": "0/0", "author": "BJ \"Amazon Believer\""}, {"rating": 5.0, "review": "Really responsive and fast", "verified": true, "helpfulness": "0/0", "author": "A. Allkoci \"eager sun\""}, {"rating": 1.0, "review": "It works well with inherent apps and prime video, however, when you load in other apps to view, not so well. For example, with MLB.TV, I can watch it flawlessly in my basement using chromecast or my Sony Blu Ray through wifi, but in the bedroom(10 feet from WiFi transmitter) using firestick, it freezes/buffers continuosly. It must be the latest version since I just added the mlb app today for opening day.", "verified": true, "helpfulness": "0/0", "author": "Salsa"}, {"rating": 2.0, "review": "When it works, it's great. The problem: it doesn't always work.The first days it worked great. Then, inexplicably, it developed issues with the wireless connection. It would stop 15 minutes into viewing a video, claiming the network connection failed or had problems -- even though all of my other wireless tools (apple tv, ipad, phone, pc) worked flawlessly. Sometimes a hard reboot (holding down 'select' and 'play' for several seconds) solved the issue, but too often it didn't -- then I had to either watch apple tv (ok for netflix) or amzon prime video on my ipad.The last few days it has worked well -- that's why I've give it 2 stars instead of 1....", "verified": true, "helpfulness": "0/0", "author": "John McDonough"}]