[{"rating": 1.0, "review": "I bought it in hopes of replacing my current device that requires a wired connection to the internet, but have been terribly disappointed thus far. While the size and ease of use are appealing. This device doesn't even begin to compare to any other devices that I have owned.There are 2 main issues I have had after having this for a couple weeks now, the first is that the device is constantly freezing or getting disconnected from the internet and the second being, and the second is that there is a weird grayish haze on the screen when ever I use this device. For price I paid, I wasn't expecting high quality, but this is just horrible.", "verified": true, "helpfulness": "0/2", "author": "Steph"}, {"rating": 5.0, "review": "Love the fire stick. We used chrome cast until getting this fire stick we thought it was the best but now I see the difference and love the fire stick. Got it for 23 dollars and got three.  One for me and two for gifts. So glad the guy mentioned it.", "verified": true, "helpfulness": "0/0", "author": "Jmcclow"}, {"rating": 5.0, "review": "Well worth it.", "verified": true, "helpfulness": "0/0", "author": "pcatpec"}, {"rating": 3.0, "review": "Works great when it works. Seems to have very low reception to get WiFi. You need to be very close to your router for it to work correctly, disappointed  in this product honestly.", "verified": true, "helpfulness": "0/0", "author": "Joseph Tobias"}, {"rating": 2.0, "review": "inconsistent streaming, authentication to non-amazon services (hulu, netflix) does not save, too easy to accidentally purchase non-prime video", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "Works pretty good. Locks up every now and then, and it needs to be powered down to reset it.", "verified": true, "helpfulness": "0/0", "author": "Ken adams"}, {"rating": 3.0, "review": "It is good for the price I paid", "verified": true, "helpfulness": "0/0", "author": "jason widmann"}, {"rating": 2.0, "review": "Be forewarned: you cannot choose which apps you want to add. You are at the mercy of whatever Amazon has made available. For example, we pay for Acorn TV and watch it on our Roku box, but it is not available with the firestick. We'll be sticking with Roku.", "verified": true, "helpfulness": "0/1", "author": "momof3nsp"}, {"rating": 2.0, "review": "would be great except I need a power cord to it....yet another cord hanging from the back of my television...", "verified": true, "helpfulness": "0/1", "author": "Roy D Parpart"}, {"rating": 5.0, "review": "Got my fire  TV stick yesterday and it was so easy to set up after I got the dang back off to put the batteries in the remote.  It came set up with my amazon account and was super easy to operate.  Downloaded my Netflix account too!  Watched prime movies all yesterday and loved it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"funinthesun\""}]