[{"rating": 1.0, "review": "We tried an Amazon Fire Stick but had to return it because it did not stream properly. It would freeze up and then quickly fly through what had been missed. So we took it back to the store where we purchased it and exchanged it for another one. The second one did the same as the first. We took the second one back and exchanged it for a Roku 3. We have had no problems wih the Roku", "verified": true, "helpfulness": "1/1", "author": "Mimi"}, {"rating": 5.0, "review": "great product thanks.", "verified": true, "helpfulness": "0/0", "author": "R. Rivera"}, {"rating": 1.0, "review": "It worked well for about a month and then I made the mistake of installing a few apps (hbo go, netflix, showtime). Now it barely works - buffering, errors, saying I have bad Internet (I do not). I have to do the app force stop, clear data - sometimes that fixes things. My TV and DVD player both are wireless connected/app capable and they are FINE. I like to test it out by switching from a terrible buffering amazon stick right over to my tv apps where it is perfectly fine. I have removed all additional apps and only use it for Amazon and it works the majority of the time as opposed to none of the time...so I guess thats an improvement? I am considering calling Amazon...maybe I have a bad unit? Though based on the troubleshooting threads I have found I am certainly not the only one.", "verified": true, "helpfulness": "1/1", "author": "Tabitha"}, {"rating": 1.0, "review": "Not at all impressed with the fire TV stick.  I have only had this for 3 months and its not working properly", "verified": true, "helpfulness": "1/1", "author": "itybitty68"}, {"rating": 5.0, "review": "Super easy to install. I love the parental settings and my kids love the games.", "verified": true, "helpfulness": "0/0", "author": "Stacey Niles"}, {"rating": 5.0, "review": "This was so easy to install, I spent more time dreading it than it actually took. It set itself up and when we lost power, it rebooted itself", "verified": true, "helpfulness": "0/0", "author": "A. Crickmer \"Frugal Consumer\""}, {"rating": 5.0, "review": "I am extremely pleased with Amazon Fire TV Stick. It has lived up to my expectations, and more. As a senior, I am not able to install, or understand many of today's technical items. The directions were very clear and easy to follow. Within ten minutes, the Fire Stick was installed, and working. Also, the content is incredible and I still haven't seen much of what the Stick has to offer. My music and photos stored on Amazon Cloud, are on the screen with the touch of a button. The Fire Stick is well worth the price Amazon is charging. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "This was one of the best purchases I made this past year.  I was able to do it all by myself and it is everything I hoped for and then some!  I love this!", "verified": true, "helpfulness": "0/0", "author": "Sharon Glaze"}, {"rating": 2.0, "review": "I don't like that my movies have to load several times when watching them...this doesn't happen with any of my other brand streaming devices....", "verified": true, "helpfulness": "0/0", "author": "M. Foster \"kindle lover\""}, {"rating": 1.0, "review": "Many episodes of The Simpsons. For sale.  What a joke. Too much is for rent or purchase. This is a waste of time and money, why am I paying for Amazon Prime?  In no way do I recommend this money grab.,,", "verified": true, "helpfulness": "2/2", "author": "Dean Wilkinson \"DNO\""}]