[{"rating": 5.0, "review": "AMAZING! I even got 4 more for friends and family for Christmas! We haven't watched regular TV since receiving!", "verified": true, "helpfulness": "0/0", "author": "MrShellToe123"}, {"rating": 4.0, "review": "works well and is pretty fast.was really quick to setup and really easy to use,the music section is not fully built out yet, it doesn't let you build out playlists yet but you can use existing playlists that you built on your computer..i mostly use the remote app on my phone, works really well.really big selection of things to watch, one things its missing is google play..", "verified": true, "helpfulness": "0/0", "author": "kington \"Captain Kangaroo\""}, {"rating": 5.0, "review": "LOVE the Fire Stick!! I find myself using it constantly. I'm seeing apps and things I never expected to cross the plain into amazon's realm! Well done amazon!", "verified": true, "helpfulness": "0/0", "author": "Josh Nieman"}, {"rating": 3.0, "review": "I'm excited to try this device — received it on-time following pre-order, the package is simple and looks nice, and the device looks like it'll be great.Currently, however, I'm waiting for a (separate, $30 or so) HDMI-to-HDMI+Audio converter, because the device I'm hooking this to doesn't process HDMI sound... and the Fire TV Stick doesn't have a separate audio-out jack.", "verified": true, "helpfulness": "0/0", "author": "Gavin W White"}, {"rating": 5.0, "review": "Incredible device!", "verified": true, "helpfulness": "0/0", "author": "Thomas B. Hunnicutt"}, {"rating": 3.0, "review": "Received my impulse purchase ... FireStick recently.  The HDMI extension cable (about 4 inches long) is a nice accessory, makes cramped port locations on the TV a non-issue. - Issue ... on startup - UI balks at the connected power supply stating I need to use the one included.  EVEN when using that one! - Issue ... the channel line up needs to be enhanced.  Partially that is my fault for choosing the FireStick over the Roku. - Issue ... the Stick doesn't just stop after the current episode.  It will play all the episodes from a given show successively.I tried to cancel the order before it shipped.  But evidently the product was probably already packed for shipment.  The device shipped later that day.For my purpose ... I think the Roku (2 or 3) would have been a better choice.", "verified": true, "helpfulness": "0/0", "author": "J. Dlouhy"}, {"rating": 5.0, "review": "Great! - Fast", "verified": true, "helpfulness": "0/0", "author": "B L S"}, {"rating": 5.0, "review": "Awesome product loads fast I just wish the buttons would lid up it's very hard to use on the dark", "verified": true, "helpfulness": "0/0", "author": "chacg"}, {"rating": 1.0, "review": "Slow", "verified": true, "helpfulness": "1/1", "author": "Aaron lyles"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Angela"}]