[{"rating": 2.0, "review": "I like it's but I don't like that you have to connect a power cord into the stick", "verified": true, "helpfulness": "0/1", "author": "William Webb"}, {"rating": 5.0, "review": "very handy", "verified": true, "helpfulness": "0/1", "author": "virginia lyn"}, {"rating": 5.0, "review": "Amazing item. The remote is great. Only thing is, I miss being able to sling videos from my phone to my tv like the chrome cast. But I love the wide variety of apps available. And I'm sure the game controller will be ordered before to long..... Lol", "verified": true, "helpfulness": "0/1", "author": "Angie"}, {"rating": 5.0, "review": "Convenient, easy to use, and well-priced. Would recommend.", "verified": true, "helpfulness": "0/1", "author": "Noah B. French"}, {"rating": 5.0, "review": "Love my fire stick. Wasn't sure about buying one. I'm not tech savey. Glad I did . It is easy to use and gives me so much more.", "verified": true, "helpfulness": "0/1", "author": "Paula"}, {"rating": 5.0, "review": "Very good device", "verified": true, "helpfulness": "0/1", "author": "william leaphart"}, {"rating": 4.0, "review": "The Fire Stick works pretty good, the problem that I had was how to put it to sleep I could not find any information on how to do it. I ended up pulling the Fire Stick from the HDMI, I watched couple movies and the look really good. I would like to see Amazon Prime to have more selection on movies just like Netflix because if you have to pay for every movie even old movies. I think it's not what I expected, but the Stick so far works find, add more tutorials regarding this matter. I could give a 4 star if he wasn't for the problem on how to put it to sleep. I forgot the settings for the Fire Stick was very simple, no problem in that area.", "verified": true, "helpfulness": "1/2", "author": "J. Armando"}, {"rating": 5.0, "review": "LOVE THIS !!", "verified": true, "helpfulness": "0/2", "author": "melanie m maicki"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/2", "author": "SU-MIN  LU"}, {"rating": 5.0, "review": "Easy setup and great video image.", "verified": true, "helpfulness": "0/1", "author": "Kathy Grady"}]