[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Daniela Imbimbo"}, {"rating": 5.0, "review": "Very easy to use once you learn your way around...very quick downloads from Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "KENNETH B. MCKENZIE"}, {"rating": 4.0, "review": "I only use it for Amazon Prime, but it works well. Only issue is that it stutters when paused. I have to mute the tv when I pause because it is so loud.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "It's easy to install has great speed and easy to use, I like it very much.", "verified": true, "helpfulness": "0/0", "author": "Chereise"}, {"rating": 4.0, "review": "I really like it - very easy to set up even for a senior citizen like me -I bought the voice activated remote and it really finds movies  very quickly and I then save them to my Watchlist  - there are some tv shows I wish were included with Prime without them charging but there are also many good free shows - I am happy I bought it - will take me a long time to watch all the movies available -", "verified": true, "helpfulness": "0/0", "author": "marian boggs"}, {"rating": 5.0, "review": "Love it! Ordered two by mistake but decided to keep both.", "verified": true, "helpfulness": "0/0", "author": "Tina C."}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Nadine keane"}, {"rating": 3.0, "review": "Some Applications work well for example music photos and old movies. On the other hand to subscribe to TV stations requires such a large subscription it's not close to being free. There should be some directions that would help a person get started like fires TV for dummies", "verified": true, "helpfulness": "0/0", "author": "jmm"}, {"rating": 1.0, "review": "The stick kept wanting to validate my pin number and would get hung up. After 5-8 attempts I decided to watch the movie I purchased on my laptop.", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 5.0, "review": "Works Great, easy to set up...also a Roku user....", "verified": true, "helpfulness": "0/0", "author": "bud majest"}]