[{"rating": 5.0, "review": "Got this for my parents so they could watch movies. At first it was a little hard for them to figure out how to work it (they are in their 70s and 80s) but once they did they have been watching all the movies they want. We are planning on buying a second for our TV.", "verified": true, "helpfulness": "0/0", "author": "Troy Gordon"}, {"rating": 3.0, "review": "Pros:  Quality viewingSimple, easy to use remoteCons:  TV times out and reverts to a screensaver after a specified periodFrequently has to \"buffer\" or \"catch up,\" prolonging startup time", "verified": true, "helpfulness": "0/0", "author": "Kelly Draper"}, {"rating": 5.0, "review": "It is so nice to have choices to view uplifting shows without incessant commercials. The stick works great. I am old school, but found the device easy to use.", "verified": true, "helpfulness": "0/0", "author": "Hicks"}, {"rating": 5.0, "review": "love it, eveything as described", "verified": true, "helpfulness": "0/0", "author": "Rebekah Doeding"}, {"rating": 3.0, "review": "I'm a sucker for specs, so even though I got my Fire Stick free with my Sling subscription, I probably would have picked this one over Roku or Chromecast anyway. After two months of daily use, I have run into few problems: the stick was easy to connect to my wifi, and it's only lost the connection twice (on the same day, so the problem was probably with my internet). The remote takes a bit of getting used to...the command to exit out of a show without exiting the app should be more intuitive.My big complaint is that there is no available browser, so my use of the Fire stick is limited to videos that have apps on amazon. The yoga website I subscribe to, for example, doesn't have an app on amazon, and they don't put their subscriber vids on youtube, so I still have to plug in my computer to do yoga videos on TV. That just seems silly: there's even a dedicated browser for Kindle Fire, so why isn't it on Fire Stick? Better yet, why aren't Google apps (Chrome, Calendar, etc) available for Amazon devices?  I expect that Amazon wants to coerce customers to stick with Amazon services (shocker!!), but I don't like buying devices that limit the choices of the consumer in order to promote proprietary services (Hi Apple! :D). My annoyance with this limitation will probably make me replace this Fire Stick eventually with a device that has a web browser.  Incidentally, because of this I've also decided to get a Android tablet instead of a Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "Elaine"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Linda Sledge"}, {"rating": 5.0, "review": "It worked just as described.  Easy set up.  I really can't tell the difference in the quality of the play back between the Fire Stick and regular HD cable.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Raven Days"}, {"rating": 5.0, "review": "i used to watch netflix on my cellphone but it was damaging my sight. So I bought this, and it is perfect because i use it only to watch netflix. However it does not have Youtube app, I had to download like a copycat Youtube name Onetube.But other than that, I use this everyday!", "verified": true, "helpfulness": "0/0", "author": "KatMoraga"}, {"rating": 5.0, "review": "Works fine", "verified": true, "helpfulness": "0/0", "author": "Michael J Lambert"}, {"rating": 5.0, "review": "The Fire TV Stick is the resolves the hassle of connecting one's tablet (Kindle Fire HD 8.9) to the television.  This was a major annoyance for me, and I wished I made the purchase sooner.  Now, I can watch my favorite Prime movie and troll FB at the same time.", "verified": true, "helpfulness": "0/0", "author": "Rodney J. Echols"}]