[{"rating": 4.0, "review": "The fire tv stick arrived a month after ordering it on Amazon the first day it went on sale. The initial setup required an Amazon account to use it and mine was already tied up to my account out of the box. The fire tv stick is better than my Chromecast because of the real remote and a searchable user interface. Navigating the UI is easy and the streaming is flawless so far. New apps must be purchased through the Amazon app store. So if you have kids, I recommend setting up a PIN to prevent any surprise charges. Unlike a conventional IR remote, the fire tv remote works on Bluetooth and so it doesn't need to be pointed at the tv to operate - this is great. I give it a 4 star because the connection between the remote and stick seems to be lost at times (navigation goes unresponsive). The other negative is, I never got the miracast to work on my fire tv stick, however Amazon says the stick is miracast enabled.", "verified": true, "helpfulness": "0/0", "author": "Yogi"}, {"rating": 5.0, "review": "Wonderful implementation of the concept of a streaming device. It has a fast processor and it feels like it. My only concern is that HBO GO is not yet available; however, many HBO series are available on Amazon Prime (which I have).I do not know what the experience is without Prime but I suspect it would be fine. I currently don't really use Prime Videos or Music that much with this device but I do use Netflix, Pandora, Youtube, Plex and TWIT and it works great.I own the AppleTV and Roku (1&2 series boxes) and now this. I purchased for $19 as a special for Prime subscribers. They all have strengths and weaknesses but this is a solid placement from Amazon! Roku is still my favorite... but by only a hair.My only cons are that I only wish Plex was not a purchase App. I also hope the app store / Channels get more numerous as time rolls on. The main apps/channels are there but Roku and Apple still has more.", "verified": true, "helpfulness": "0/0", "author": "NJ-Coffee Lover"}, {"rating": 5.0, "review": "later", "verified": true, "helpfulness": "0/0", "author": "George Larsen, AKA Rusty"}, {"rating": 3.0, "review": "does anyone know how to remove the scroll at the bottom of the screen once install the fire stick?", "verified": true, "helpfulness": "0/0", "author": "Melinda Lair"}, {"rating": 4.0, "review": "The ASAP feature (shows/movies start really quickly) is something you may overlook in your decision to purchase a Fire TV / Fire TV Stick.  But it shouldn't be!  It's that little \"oomph\" that makes a real difference as you move around the interface - making it feel much faster than ChromeCast (which I also own) - at least from Amazon Prime Videos.Installation did have some troubles - wi-fi kept dropping out constantly.  But after a day or two, this cleared up (firmware upgrade?  not sure.)Netflix has lost connection a time or two, which forces me to enter my credentials again.  Annoying - especially without a keyboard.It's nice to have Plex on the system, too.  My only complaint is that \"casting\" from the Kindle Fire HDX Plex app to the Fire TV is currently not supported.  Hopefully that will come in time.  You can still get to everything using the remote (when I can find it...)I find myself mostly using the \"casting\" option from my Kindle Fire HDX or iPad instead of the Fire TV interface.  Just seems easier to get to what I want to watch that way.I do wish the remote had a \"locator beep\" on it, even if that was an upgraded option.", "verified": true, "helpfulness": "0/0", "author": "box464 \"zoinkster\""}, {"rating": 5.0, "review": "Awesome product and worth it as long as you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Scott Keller"}, {"rating": 4.0, "review": "I get to watch netflix and amazon instant shows.  Still no HBO GO.  Makes me sad.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "a. frank"}, {"rating": 4.0, "review": "I have a problem no one else mentions.  The firestick is located right next to the cable input.  As soon as installed, the cable started getting interferences and dropping channels.I turned off the firestick and the cable channels became normal again.This was with the HDMI extender.  The TV is built into a wall so the cable and the other elements may be  pressed together.Well, I bought a two foot HDMI cable extender, managed to hide it the metal supporting the TV.  Things have been working fine for three month now.  The firestick had to be reset only once in this time.I like the picture quality.  I like the way it works with my Samsung TV.  You don't have to turn on the TV, then change the input to the firestick.  You just push a button on the firestick's remote and it will turn on the TV and connect to the firestick automatically.  very nice.", "verified": true, "helpfulness": "0/0", "author": "Maotouying \"maotouying\""}, {"rating": 3.0, "review": "Love the Fire TV Stick, but the only think that keeps this from being a 5-Star product for me is that there are no news channels.Bought this in hopes that we can watch everything that is currently on this TV Stick, but also wanted to be able to view CNN or Fox News that this stick does NOT offer.Otherwise, it's great without having to purchase a smart TV or an Apple TV box.", "verified": true, "helpfulness": "0/1", "author": "Rik L. Hix"}]