[{"rating": 5.0, "review": "Easy to set up.  It was exactly what I expected.", "verified": false, "helpfulness": "0/0", "author": "AMY L HYSLIP"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer D. Scates"}, {"rating": 4.0, "review": "Wish we could add more apps! There are lots of apps you can get on Amazon.com but not compatible with Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Persian"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Does exactly what it says.  You can watch the preloaded streaming sites and download others as desired.  In addition, you can download the controller app in order to use your Kindle or Android/iOS device as the remote control.  You can mirror what's on your mobile device onto your TV.  Ihaven't figured out \"Second Screen\" yet, but I've been too busy playing with other features.  Yes, it's slightly more than Google Chromecast, but I wanted the Fire TV Stick to get Amazon Instant Video which isn't on Chromecast.  I didn't realize that I could load games on the Fire TV Stick until I got it.  I'm still learning all that I can do with the stick.", "verified": true, "helpfulness": "0/0", "author": "Charles V Ruffin"}, {"rating": 5.0, "review": "Surprisingly nice device. It's like a chromecast on steroids. Works great with Netflix and with Amazon prime, and also allows you to stream content from your PC using Plex. I love this device. I paid $19 on the early adopter prime deal, but ended up buying another during the Christmas season from Best Buy using their discounted price of $25. It's so great to have a remote that I put away my Chrome cast.The only thing the Amazon fire TV stick doesn't do is cast from a web browser. But I've never found this to work very well using my chrome cast anyway.Oh, and the android app to use your phone as a remote works very well also. Nice job Amazon on designing a very well performing device!", "verified": true, "helpfulness": "0/0", "author": "Mark Gordon"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "Love my fire tv stick. Extra thumbs up for being able to load xbmc onto it.", "verified": true, "helpfulness": "0/0", "author": "Tony G"}, {"rating": 5.0, "review": "I bought 5 Fires sticks  for gifts and for myself .They're everything that we hoped that they would be. Everyone is very pleased with this new  units.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Freezes up frequently and requires a power cycle to get it to work again.", "verified": true, "helpfulness": "0/0", "author": "Barney"}]