[{"rating": 1.0, "review": "The interface for the Fire Stick is the worst of any streaming device I have used. The issue is its 95% focused on the movies and shows sold by Amazon. Want to watch Netflix or YouTube? You may have issues even finding them as they are stashed away in a sub menu for your apps. Thankfully if you use them frequently  they will show up in a recent apps menu but if you are pulling up an app you don't use often you will have to dig for it.  This is unacceptable for someone like me that uses a Roku 3. The Roku allows you to sort apps the way you want and its search feature includes multiple apps like Netflix. Amazon only searches through the content they want to sell you. At the end of the day this is a device designed to sell you Amazon content. It doesn't offer Vudu because Amazon wants you buying everything from them. App support overall is much less than Roku and Chromecast. This is a streamer for someone watching Prime or buying from Amazon only. Using it for Netflix can be done better by multiple devices. Even the Apple TV is a superior experience. Lastly, I was also surprised at the issues I had with streaming quality. I tested it on the same WiFi connection and same room as my Roku3 and Chromecast and had streaming hickups with Netflix, WWE and You Tube. I had none of these issues on the other two. I understand the Roku having stronger WiFi, but the Chromecast is a smaller device and still worked better. Consider the Fire only if you are heavily invested in Amazon content. For everyone else get a Roku.Update: Wifi issues continue. I am still having issues with this device streaming unless it is a few feet away from a router. Not sure if the stick is defective or has issues with Cisco routers. My others streaming devices work just fine in every room. At this point I have completely given up on the Fire TV stick. Thankfully it was only $19.", "verified": false, "helpfulness": "4/5", "author": "A. Gaston"}, {"rating": 5.0, "review": "Whoa... so much better than accessing Prime via my Sony system.... super easy plug and play... and it is literally instant access with no buffering/lag!!  What's not to like??", "verified": true, "helpfulness": "0/0", "author": "KP"}, {"rating": 5.0, "review": "Intuitive controls, very cool smartphone app.  Screen saver defaults to pictures on the cloud.  Very nice touch! Took a chance for $19 first day price, wish I bought two!", "verified": true, "helpfulness": "0/0", "author": "Skydog"}, {"rating": 5.0, "review": "Performed perfectly, as expected.  I also have the Fire TV on another TV upstairs and am very happy with it as well.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "Easy to use. Nice interface. Program content is a work in progress. Casting video from Android phone and tablet jerky and pixilated. I have a Roku but I thought for the intro price it was worth a try.", "verified": true, "helpfulness": "0/0", "author": "Jerry D."}, {"rating": 4.0, "review": "Having Amazon prime, it makes it must easier to navigate. The toughest part was putting the batteries in the remote.", "verified": true, "helpfulness": "0/0", "author": "Gerald Grewats"}, {"rating": 5.0, "review": "I love it!!! It's fast, efficient, and good quality HD.", "verified": true, "helpfulness": "0/0", "author": "empera13"}, {"rating": 3.0, "review": "Funky. Way less streamlined than I had imagined due to the necessity to plug a power cable into it. The power cable blocks other HDMI ports. Very poor design. They included an adapter to work around this obvious problem, so the slick little device pictured winds up looking like a clump of wires hanging off the back of your TV.  Some of us actually make an effort to make sure our AV systems don't look like a rats nest. This looks really messy. Kludgy.  The power cube is oddly shaped and big. It is the kind that cannot be used in a power strip without blocking another outlet. Very poor design. The remote feels very flimsy, yet was difficult to open to insert the included batteries.From a design standpoint, it seems like they had gotten far along the line of design, probably to the point that they were manufacturing them and then discovered some fatal flaw that required it to be plugged in to a power source. Hence the overall kludginess. I hope I like it more, but right now I feel a little underwhelmed.", "verified": true, "helpfulness": "0/1", "author": "C. Riess \"The Jaundiced Eye\""}, {"rating": 5.0, "review": "Excellent interface, very fast & simple. However, it should be free to Prime members...", "verified": true, "helpfulness": "1/1", "author": "Careful Shopper \"GadgetGeek\""}, {"rating": 5.0, "review": "Awesome! I love that it's very fast and easy to use. For the price I got it at I have no complains. I was lucky enough to get it when they released it at a discount price for prime members. It's everything I expected and so much more. If you're having doubts I suggest you go ahead and get it. I'm sure you won't be disappointed. I read some of the negative reviews and they just seem like they are complaining for no reason whatsoever. There's nothing negative to say about this product. Period.", "verified": true, "helpfulness": "0/0", "author": "Daniel Chowdhury"}]