[{"rating": 4.0, "review": "I enjoy it. Great product.", "verified": true, "helpfulness": "0/0", "author": "Michael Colavito"}, {"rating": 4.0, "review": "As a Prime member this is a perfect addition for me. Lots of free programs to watch when there's not much on my cable to watch. Setup was fairly easy and connectivity to my internet was a little sluggish, but finally connected. I have 50Mb speed and the Fire TV stick was only about 5 feet from the router. It has dropped off a couple of times with minimal impact to what I was watching. It takes a little getting used to with pulling the apps I wanted and getting them setup. Fortunately, I have experience from using mu Roku box. I like the idea of having a remote with the unit. Unlike Chromecast. I also like being able to connect my Kindle Fire HDX. Although the picture quality isn't as good as I'd like. Picture quality using the Fire TV stick apps is excellent. The HBO Go and ShowTime Anytime apps are available on the Fire TV stick now. I noticed others complained about not having them available. You do need those channels on your cable or satellite service though. I have 5 TVs in my house with only 3 connected to cable through DVRs or a box. The other two only have OTA antennas, so I get my local stations. With the Fire TV stick I can now see HBO, Showtime, ESPN channels, as well as other stations not found OTA. Basically, this works great for my needs.", "verified": true, "helpfulness": "0/0", "author": "kcallahan47"}, {"rating": 4.0, "review": "I had a ROKU and so I didn't see that I needed this, but I bought it on a whim.  I'm actually impressed and like all of the apps that you can use with it.", "verified": true, "helpfulness": "0/0", "author": "tomcatinlaw \"tomcatinlaw\""}, {"rating": 5.0, "review": "Easy to hook up and use. I am enjoying it alot.", "verified": true, "helpfulness": "0/0", "author": "jayne brobst"}, {"rating": 5.0, "review": "easy to set up.  I have a Leaf so I do not have cable. this gave me access to so much!  love the Pandora, get my Prime movies, Hulu and Netflix without having to bring my laptop down from my office to the tv.  If you do not have \"cable\", or a smart tv this is the way to go!  I added the app to my phone and can request movies or items by voice.  Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Denise Davis"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kirsten Megginson"}, {"rating": 5.0, "review": "as usual Amazon products meet and exceed expectations.", "verified": true, "helpfulness": "0/0", "author": "Michael Frey"}, {"rating": 5.0, "review": "Well worth the money. I have both the stick and the box and both are the best devices on the market.", "verified": true, "helpfulness": "0/0", "author": "Shawn A. Stritz"}, {"rating": 5.0, "review": "I always wanted to be able to watch TV on a machine that is far from the cable in the nether regions of my house.  I hate regular TV with commercials, and I get too many cable channels with not enough variety. Problem solved!I can view my favorite Amazon prime shows like Banshee which I'm totally addicted to,  listen to music, watch Netflix, and many many more options, some of the best $24 I've ever spent .  I bought it on prime day when it was $24, on a whim really wasn't looking for it, but so happy! Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Melissa Contreras"}]