[{"rating": 5.0, "review": "Amazing! Total game changer. Unlimited entertainment from a device that really delivers on its promise.", "verified": true, "helpfulness": "0/0", "author": "Mark Lipman"}, {"rating": 5.0, "review": "It does as described, and I am very satisfied with this purchase.", "verified": true, "helpfulness": "0/1", "author": "Laverne Prater"}, {"rating": 5.0, "review": "Discrete and easy to use.  Very mobile for traveling.  I like the function and control as well as the tasks performed and look forward to trying out some of the other possibilities with this device.", "verified": true, "helpfulness": "0/0", "author": "Kyle M Sinclair"}, {"rating": 2.0, "review": "Sent it back for full refund. Amazon is great but this device was not able to stream any video without constantly having to Buffer. If I hook up my laptop I can stream movies using Amazon prime just fine....so it is more of the capability of this device than my internet speed...which is 25mbps.", "verified": true, "helpfulness": "1/1", "author": "charles e mirabal"}, {"rating": 5.0, "review": "LOVE!!  LOVE!!!  So much easier and offers more apps than my smart tv!!  HIGHLY Recommended!!  Get rid of cable & start streaming!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Christenbury"}, {"rating": 1.0, "review": "Do not waste your money constantly freezes.", "verified": true, "helpfulness": "1/1", "author": "James Irving"}, {"rating": 3.0, "review": "I thought this sounded like a great idea.  I often connect my laptop to the TV to watch my Netflix movies, Amazon streaming, etc.; however, I thought this would be much nicer because I would have a remote and access to additional services (i.e. games).  The problem is that the one game I was excited about - You Don't Know Jack - just doesn't work.  So apparently for the games you need to download an app onto your smart phone.  In this case, an app called JackPad.  Downloaded onto several different phones and not one of them will connect to the device despite going through all of the troubleshooting options.  So that is the big disappointment.", "verified": true, "helpfulness": "0/0", "author": "Barkygirl"}, {"rating": 4.0, "review": "stop restricting apps even from your own market, kodi and other run great on this.UPDATE!!!!Why can't the firetv run amazon apps like echo and prime now?", "verified": true, "helpfulness": "0/0", "author": "Zendick"}, {"rating": 5.0, "review": "I love having this. I can finally catch up on all my shows.", "verified": true, "helpfulness": "0/0", "author": "PAT"}, {"rating": 5.0, "review": "I am in love with this item especially since I got the chance to watch #OITNB this weekend.  I had it for a while and just installed it this weekend and I am very impressed with it and I got it when they had the introductory price for it which means I got a great deal.", "verified": true, "helpfulness": "0/0", "author": "Karamel \"A Kreative Reader\""}]