[{"rating": 3.0, "review": "i bough the stick when it first came out and recently the buttons have gotten stuck scrolling forever to different directions.  At times it feel like i am playing Netflix roulette trying to start a movie.  I've switched to using Netflix on my smart TV for now until i decide to get a remote replacement.I also don't know how the remote broke, we don't have any kids to toss it around and we keep all the remotes next to the nightstand for easy access.", "verified": true, "helpfulness": "0/1", "author": "Marie \":D\""}, {"rating": 5.0, "review": "A perfect complement for my Amazon Prime account.  I can (and have) access to so many shows, movies and games!  All with no additional charges thanks to my Prime membership.  I would highly recommend this product and service to any Prime Member.  I have found no drawbacks to this amazing little device.", "verified": true, "helpfulness": "0/1", "author": "Daniel Honaker"}, {"rating": 5.0, "review": "LOVE IT.  NOW I NEED TO BUY ONE FOR MY DAUGHTER!", "verified": true, "helpfulness": "0/1", "author": "kristi duenne"}, {"rating": 5.0, "review": "It is what it is. I'm so glad I got this on Prime Day, it was even more worth it. Fast and convenient. Really happy with this purchase, esp for only $24.", "verified": true, "helpfulness": "0/1", "author": "B Park"}, {"rating": 5.0, "review": "It was a gift for my husband from our daughter for Father's Day.  I wasn't so sure he would like it, but surprise, he loves it.  We watch it every night.  This is a very picky man.", "verified": true, "helpfulness": "0/1", "author": "Jane Ward \"reader chick\""}, {"rating": 3.0, "review": "Loses connectivity a lot. Great when working though", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 3.0, "review": "Over-all it gives you a lot of entertainment choices. Disappointing that I can get no live sports without a cable provider...whats the point of \"cutting the cord\" if you can get no live feeds? News options are non-existent or very limited.", "verified": true, "helpfulness": "0/1", "author": "Lynda Purvis"}, {"rating": 1.0, "review": "Have been completely unable to utilize this device. The streaming capabilities, for whatever reason, simply fail time and time again. Was hoping to use this tool to replace my previous method of hooking up the ipad to the TV via an HDMI adapter and streaming netflix/hulu. etc through that manner. That's not happening. Every other connected device in my home functions without issue (ipads, iphones, smart DVD player, etc). The fire tv stick simply doesn't measure up.", "verified": true, "helpfulness": "0/1", "author": "Z. Trojak"}, {"rating": 3.0, "review": "So far it has worked fairly well at times it will pause its self ... But all I have had to do is in pause other than that it has worked great....", "verified": true, "helpfulness": "0/1", "author": "chasity"}, {"rating": 5.0, "review": "I really love the Fire TV Stick, very easy to get set up and lots of movies & TV show to watchit's a good buy!", "verified": true, "helpfulness": "0/1", "author": "gram"}]