[{"rating": 2.0, "review": "Product quality is good but remote does not work correctly and specially in the games it fail to respond on time. Also some how it does not ask anything for configuration and it automatically detect your account but it also turned on 1-click option and that was disaster. My kid has order more 5 digital movies order worth more then 75$ :( though it is in refunding state but you have to go through all hassle.", "verified": true, "helpfulness": "0/0", "author": "joji"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "C. Vance"}, {"rating": 4.0, "review": "Couldn't mirror my screen from my 10\" note . Get this working and it will be great.", "verified": true, "helpfulness": "0/0", "author": "Craig Baugh \"cbaugh\""}, {"rating": 1.0, "review": "New firmware bricks device if you are rooted.  Buyer beware.", "verified": false, "helpfulness": "0/1", "author": "<|®©|"}, {"rating": 1.0, "review": "I purchased 3 of these to replace the Roku's I have the hard wired Amazon Fire TV in the living room and it works great. However, all these sticks are horrible. All three freeze-up constantly and buffers like its 1999 - I've had the Roku boxes hooked up and running all together and never a issue. Unfortunately for me I gave my Roku's away when I purchased these because of how awesome the hard wired Amazon Fire TV is - now I'm looking at buying some new Roku's - Amazon has the right-idea but lacking the technology with these - also boxed remote has no talk and text feature like the hard-wired model.", "verified": true, "helpfulness": "0/0", "author": "Scarlette King"}, {"rating": 4.0, "review": "At first I had a lot of problems connecting  but I found out the problem was the power adapter, when plugged into a power strip it was not making a good connection so I tried plugging into a extension cord and then into the power strip and  it worked!  also I just tried plugging the  USB cable into  my Apple Ipad  power adapter and than into the power strip and it worked, so Amazon needs to do something about the power adapter for these things they do not make a real good connection do I HEAR \"RECALL\"", "verified": true, "helpfulness": "0/0", "author": "zumike \"zumike\""}, {"rating": 5.0, "review": "It's now the fastest streaming device we have tried. Menu's are very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Jason Shields"}, {"rating": 4.0, "review": "I bought this for my son's room to access my plex server because it has a remote I don't want him using tablet like I do with my chromecast.  To get the plex working right I had to play with some settings on both my server and the stick now that it works everything is good.  If I could have given another half star I would have but I guess I can also mention the lack of hbo go for the other half of the star.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "I just got this, so these are initial impressions.  Previously I was using my BD player to access my Prime content. This is a huge improvement over that.Installation is about as simple as can be.  Simply plug it into an HDMI port and plug in the power source.  It automatically goes through some checks and setup and all you have to do is put in your password to your wireless network.  A short video plays to introduce you to some features and use of the remote.  Of course, you have figured out the remote a little already because you had to enter a password with the remote.The stick is on all the time so when you want to use it, you do not have to wait for it to boot up like I had to do with the BD player.  Compared to using a BD player, access and start times are pretty much instantaneous.  You can rapidly scan through selections and when you hit play, it starts right up.  There is no spinning wheel while the video loads as there is with the BD player.Picture quality is excellent and seems to be full HD quality.  It is at least as good if not better than I receive from Dishnetwork.You can plug the stick into an HDMI port on your TV, but I plugged mine into an HDMI port on my surround sound receiver.  The stick provides full surround sound through my receiver so I can fully enjoy the videos along with great sound.The menu is a little different than my BD player provided but is simple and straight forward so you will adapt very quickly.My only complaint, and it is a minor one, is the search function.  The search is a general search which means it searches all content-TV, movies, Prime, rentals and purchasing content.  You do not know if your results are a free video or a paid offering until you click on it.  I would like a separate search within Prime for free movies and TV and a different search for rentals.  You can browse through the Prime content and sort by genres but it is more time consuming than a dedicated search.There is an app to use your smart phone as a voice controlled remote, but I have not tried it.  Seems like a gimmick to me and and time saved with voice control would be offset with the time take to load up the app.  Besides, everyone needs one more remote on your end table.Good product at a good price and I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Recorder \"js\""}, {"rating": 3.0, "review": "It duplicates the streaming function that came on my $80 blu-ray player, and the GUI is slicker, except...  the remote sucks (small, not backlit), and since it's bluetooth, I can't integrate with my harmony remote.  It's also wireless, so the resolution isn't as good as my wired blu-ray player.  It also gets hot, so I wonder about leaving it powered up all the time.  For $19 I got what I paid for, but I think more is needed to make it a good experience", "verified": true, "helpfulness": "0/1", "author": "jeffw_00"}]