[{"rating": 1.0, "review": "Limited apps, and UI is sluggish", "verified": false, "helpfulness": "0/0", "author": "sheetal"}, {"rating": 5.0, "review": "Firestorm was easy to install and worked perfectly right away.It was easy to access Netflix and Amazon Prime videos and watch them on my TV set- Much better than on my computer monitor", "verified": true, "helpfulness": "0/0", "author": "Michael Mciver"}, {"rating": 3.0, "review": "Bought this thinking it would be nice to be able to watch Showtime in another room but it doesn't work because of Comcast I guess.", "verified": true, "helpfulness": "0/0", "author": "Stacey Bossler"}, {"rating": 3.0, "review": "Still haven't figured out how to use this !", "verified": true, "helpfulness": "0/0", "author": "Liz morales"}, {"rating": 5.0, "review": "We really enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Cleve Robinson"}, {"rating": 5.0, "review": "Really nice gadget. It was an ideal Christmas gift to receive.", "verified": true, "helpfulness": "0/0", "author": "John P. Mauffray, Jr."}, {"rating": 5.0, "review": "Great product!  Excellent selection of movies & TV. User friendly. Easy installation.  I don't play games so I can't rate that feature, but the selection seems large.", "verified": true, "helpfulness": "0/0", "author": "Judy Noble"}, {"rating": 1.0, "review": "I wish I could honestly \"star\" this item. I haven't been able to use it even once. I have the fire TV box at home and love it. When the fire stick came out I didn't hesitate to purchase. I travel for work so I'm gone more than I'm home and was thrilled to have a portable option that doesn't take up valuable packing space. So disappointed that it won't connect to public wi-fi that requires a log in. Amazon has put a one line blurb on the fire stick page saying they are working on it, but its been there for a while. If your looking for something to travel with, the fire TV stick is not it. I'm hoping its just a software update.", "verified": true, "helpfulness": "0/1", "author": "PentwaterGma"}, {"rating": 1.0, "review": "Stopped working, no way to fix it.  Haven't heard back from tech support.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "QUESTION: My TV only has 1 HDMI port and 1 USB port the HDMI port is plugged into cable box. is there an adaptor for a HDMI to USB port????? is this possible", "verified": true, "helpfulness": "0/0", "author": "Kathy Olinger"}]