[{"rating": 5.0, "review": "We have had Chrome Cast for a couple of years now, and when we needed one for another of our TV's we decided to try the Fire TV Stick.  What a fabulous product.  Everything loads so quickly - no buffering!  And I became a Prime Member (was an associate on an account until then), so we could have access to the prime movies and TV shows.  Our choices are so broad now, none of us will ever be bored!  This is a great product - and very easy to set up and use (and I LOVE the remote!)", "verified": true, "helpfulness": "0/0", "author": "Mary Bulla \"S's Mom\""}, {"rating": 5.0, "review": "Love the stick so versatile I can take it with me from room to room. Loves being able to watch Netflix and amazon show's. Great product for price, will buy more of them and definitely recommend people to purchase.", "verified": true, "helpfulness": "0/0", "author": "Autumn ny"}, {"rating": 5.0, "review": "Absolutely love this. I have DirecTV with all the bells and whistles, but this allows me \"on demand\" with so many other opportunities. I love that it is portable and goes with me when I go to the beach for a month, etc. It was so easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Peggy Woods \"beach gal\""}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "emmanuel urbano"}, {"rating": 5.0, "review": "The only issue I have is the streaming staying active.", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 4.0, "review": "So far so good. It works great with my Sony HD TV. No complications on installing. Just wish HBO Now and Showtime Anytime were available apps..", "verified": true, "helpfulness": "0/0", "author": "Kenya Edwards"}, {"rating": 1.0, "review": "I've not purchased this item yet. I was curious if you had to have internet in order to use this device?", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The zipper, the light bulb, sliced bread. and the Fire TV Stick. All have made our life easier. Seriously, the Fire Stick is FANTASTIC. Truly plug and play very simple. If you do not have a smart TV, this is the best option. I am only sorry that I waited so long to order it.", "verified": true, "helpfulness": "0/0", "author": "Carl Grimes"}, {"rating": 5.0, "review": "The best thing ever", "verified": true, "helpfulness": "0/0", "author": "Filiberto C."}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "bernard"}]