[{"rating": 4.0, "review": "Very powerful device for its size.  I would have given it 5 stars if it allowed me to throw mobile device media the way the Chromecast does.  I was looking to completely replace the Chromecast with this device.., but maybe next model of the Fire TV Stick will have this feature.The only other complaint I have is not knowing if the selected show or movie will cost additional $$ until I open the selection.  There should be an icon showing additional costs before opening the selection.", "verified": true, "helpfulness": "0/0", "author": "NicholasTroyer"}, {"rating": 5.0, "review": "Great little product!", "verified": true, "helpfulness": "0/0", "author": "Felix J. Perez \"Just Felix\""}, {"rating": 5.0, "review": "Loving the fire TV stick for Plex, Netflix, and You Don't Know Jack Party! Definitely a stocking stuffer!", "verified": true, "helpfulness": "0/0", "author": "Dhruv P."}, {"rating": 1.0, "review": "Not happy with the video streaming.  It buffers every few minutes.  I have an amazon prime app on my Playstation 3 and it doesn't behave this way,  the app checks the connection speed up front and then loads a pre-buffer to preveny constantly interrupting playback.  Silly me to assume that the fire tv stick would be as advanced as the app, or more.", "verified": true, "helpfulness": "1/1", "author": "IDBUG \"T\""}, {"rating": 5.0, "review": "Great cheap media player", "verified": true, "helpfulness": "0/0", "author": "Tony C"}, {"rating": 5.0, "review": "Good product.  Now I don't have to run the Xbox constantly to watch netflix.  The only thing I wish these little stick things would do (chromecast included) is draw power from the t.v., it sucks to have to plug it into a power source and the t.v.", "verified": true, "helpfulness": "0/0", "author": "Chris Moriarty"}, {"rating": 5.0, "review": "I pre-ordered this for $19 and am extremely pleased. I would have easily dropped the $39 price for one.", "verified": true, "helpfulness": "0/0", "author": "Brian Sokolowski"}, {"rating": 3.0, "review": "It's pretty good.  I've had my roku for about 5 years now, so I thought it was about time to replace it.  I got the Fire TV stick for $19 so the price was really good.  It works fine, some things about it are nice, others not great.  It was really easy to install, literally just plug n play.  Videos load fast, not that the 5 seconds the roku took was a problem, but this thing starts almost instantly.  What I don't like is the auto play, or the inability to turn it off.  If I'm watching a show, it automatically advances to the next episode when the first one is done. I would like the ability to turn that feature off.  Also, the battery compartment on the remote is really tough to remove.  All I can say is, I hope these batteries last a long time.***Update*** 5-3-15 ****After the firmware update about 2 weeks ago, the sound cuts out for a second or two several times an hour.  I don't know if anyone else is having this problem, but its getting really irritatimg.  I can't find a link on Amazon to talk to customer service or send an email to find out what I can do to fix this.  May have to go back to Roku soon.", "verified": true, "helpfulness": "0/0", "author": "Michael Achorn"}, {"rating": 5.0, "review": "Awesome, incredible value.", "verified": true, "helpfulness": "0/0", "author": "Paul Trapani"}, {"rating": 4.0, "review": "Works well. I have to reboot it occasionally by pulling the power cord. Wish it had a soft reset through software. If it has one I haven't found it. The Android app is a bit cheesie. I'd like to see my options on my phone and not just on the big screen. Overall very satisfied.", "verified": true, "helpfulness": "0/0", "author": "A. Pellerano"}]