[{"rating": 4.0, "review": "Wish we could do more but good system", "verified": true, "helpfulness": "0/0", "author": "thomas simpson"}, {"rating": 4.0, "review": "Great video quality, speed of browsing, seems to run hot and consume energy when on standby.  Cannot be shut-off.", "verified": true, "helpfulness": "0/0", "author": "fabien"}, {"rating": 3.0, "review": "Not as cool as I thought it would be, but ok.  The free Youtube app is better than what I had before.  But I thought for sure there would be a web browser...no such luck.  A newer release movie is $19.99.  That's pretty expensive.  I only watch movies once, why would I want to pay that much?  Only if I lived in a remote location.  Its ok, worth it.", "verified": true, "helpfulness": "1/1", "author": "kevin"}, {"rating": 5.0, "review": "Have just started using it, Moved to new section  of town/city that I live in, Subscribe to A.T. & T-Universe- so able to hook up my Amazon Fire-TV stick and get wonderful networks like Hulu-plus.", "verified": true, "helpfulness": "0/0", "author": "John R. Schwartz"}, {"rating": 5.0, "review": "So easy to use, works great!!", "verified": true, "helpfulness": "0/0", "author": "Cristin Nicole Cox"}, {"rating": 5.0, "review": "Love it! Canceled my cable and only use the Fire TV Stick and an antenna for local channels. Thousands of free movies and TV shows to watch. Remembers the last show you watched so you can see the next in a series. There are so many free shows to watch (if you have Amazon Prime) that I don't even need Netflix. TV is for entertainment and this provides plenty of that. Bought one for the bedroom, living room, and just got another for the basement.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "it keeps disconnecting.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "wilkin mendez"}, {"rating": 5.0, "review": "I am a big Amazon fan and the Fire TV Stick worked out perfectly for me. Easy to install and set up. Thank you!", "verified": true, "helpfulness": "0/0", "author": "MLAChicago"}, {"rating": 5.0, "review": "The Fire TV Stick is so easy to use.  My only regret is that I didn't get it sooner.", "verified": true, "helpfulness": "1/1", "author": "Darlena Estelle"}]