[{"rating": 3.0, "review": "So far.....I have to say that the Fire TV Stick has been underwhelming. The selection of material available to view is more limited than I had hoped.Maybe I just need to spend more time using it.....I hope so. There are so many times watching the programming on TV that I end up watching the rotating circle indicating buffering and waiting for the program to start.....then I give up in frustration. Maybe I will just return it.", "verified": true, "helpfulness": "2/2", "author": "Andrew P"}, {"rating": 5.0, "review": "Bought this for my 70 year old Dad. Set up was very easy and he doesn't have and trouble navigating for use.I'm buying a second one for me!", "verified": true, "helpfulness": "0/0", "author": "Ajtshead3"}, {"rating": 5.0, "review": "It was everything I expected", "verified": true, "helpfulness": "0/0", "author": "Margaret M. Leusch"}, {"rating": 3.0, "review": "Just ok, nothing special", "verified": true, "helpfulness": "0/0", "author": "Patrick W. Davis"}, {"rating": 4.0, "review": "I am loving my Amazon Firestick. It has already changed my viewing habits. I hope to make more changes. I am still making discoveries. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Jeff Vellenga"}, {"rating": 5.0, "review": "It doesn't take the place of cable yet, but hopefully it will soon.  Last to use.  Great to travel with, better than paying for on demand while on the road.", "verified": true, "helpfulness": "0/0", "author": "zab"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tina B."}, {"rating": 5.0, "review": "I cut off my cable and decided to get the Fire TV Stick and I'm so happy that I did. My whole family loves it!!!!", "verified": true, "helpfulness": "0/0", "author": "LaKeisha Madson"}, {"rating": 4.0, "review": "The Fire TV Stick worked as advertised but I was a little disappointed in the selection of free movies. I would prefer to pay an additional $200 annually for total selection of free movies. The Amazon price for movie rentals is higher than the Red Box movie rental service. As the weather gets better and I have a desire to rent a movie, at this point, I think that I will be using the Red Box movie rental service.", "verified": true, "helpfulness": "0/0", "author": "The old one"}, {"rating": 4.0, "review": "Nice product.  Like that it has categories to scroll through. Wish it had a few more current movies for free but that's almost goofy- 40,000 plus and I'm complaining.  No, not really.", "verified": true, "helpfulness": "0/0", "author": "zartiste"}]