[{"rating": 5.0, "review": "love it,easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Schatz"}, {"rating": 3.0, "review": "connected through receiver, sound not as good as I excpected.", "verified": true, "helpfulness": "0/0", "author": "Rick Mazurek"}, {"rating": 5.0, "review": "works fast and it is user friendly", "verified": true, "helpfulness": "0/0", "author": "David P. Swartz"}, {"rating": 5.0, "review": "EASY to install!!!!!!!! and- easy to use! WHY did i wait so long????!!;/)👍", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "This is the greatest technology ever!  It was so easy to set up and operate. Now I can watch all my favorite shows and movies on my TV. It is user friendly in terms the average person can understand. It is easy to navigate thru the menu and functions.  I love it!  Thinking about getting another one for the bedroom TV. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sheba"}, {"rating": 5.0, "review": "Not hard to hook up and works great. I am sorry it took me so long to get this item. SUPER", "verified": true, "helpfulness": "0/0", "author": "james caine"}, {"rating": 1.0, "review": "Purchased as a replacement for the Amazon Fire TV because the Netflix app didn't correctly function. It appears to be a mistake and I will be returning the Stick as well because it isn't compatible with the Stick either. If Amazon can one day resolve the issue, I would reconsider the Stick because it is useful with having Prime. Thank god for the free shipping and returns.", "verified": true, "helpfulness": "0/0", "author": "Matthew Steltz"}, {"rating": 5.0, "review": "Love it. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the fire stick, it's fast and easy to use.  Setup was a breeze and I was up an going in a few minutes.", "verified": true, "helpfulness": "0/0", "author": "Tim Arvey"}, {"rating": 5.0, "review": "I picked up one of these when they were 19 bucks not knowing if I would get any use out of it.  We use it everyday now.  Easy to move from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "The Spunkster"}]