[{"rating": 5.0, "review": "My Fire TV Stick stopped working after 9 months.  Amazon quickly replaced it with a refurbished one.  I haven't had the refurbished one long, but so far it's working fine.  I like the Fire TV Stick much better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "So far works just like the amazon fire box. However we do not use anything else besides netflix/hbo etc on this. No game apps or any of that. Not even sure if it is supported as we bought this just cause it was cheaper that the box for another room since thats all we use it for.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "I absolutely love this little Fire TV Stick it's absolutely awesome!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "V. Roberts"}, {"rating": 5.0, "review": "very easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "sue"}, {"rating": 5.0, "review": "This thing is amazing! Game apps are a bit odd though. I recommend the controller for games.", "verified": true, "helpfulness": "0/0", "author": "deaton.j"}, {"rating": 5.0, "review": "the fire tv stick is so easy to navigate. I have a Roku and I loved it until I go the  fire tv stick. it is so much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Betty L. G"}, {"rating": 5.0, "review": "I really like this product! Super easy to move from one TV to another. Can't beat the price either!!", "verified": true, "helpfulness": "0/0", "author": "deb \"deb\""}, {"rating": 1.0, "review": "It worked just fine the first day, but the next day, it kept taking me back to reconnect to my network. It refuses to reconnect no matter how many times I try, even though it states there is a very good connection and my android app sees the stick on the network, just will not connect. I've reset it, unplugged it...etc. There are a lot of negative reviews for this issue and seems like there have been no updates and it is still not working for many people, myself included. I will be returning this and I will not be recommending this product to anyone.Totally disappointed as I was very happy day 1...", "verified": true, "helpfulness": "2/2", "author": "Christie Ryan"}, {"rating": 5.0, "review": "Easy set up.  Arrived on timeAs usual with prime.  Fantastic benefits if you already have prime. Lots of shows and movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "M C"}, {"rating": 1.0, "review": "This device has a glitch in it that does not allow you to set parental controls. This leaves your kids vulnerable to any content and it leaves your Amazon account vulnerable to unauthorized purchases. And Amazon will say \"screw you; it is your fault'\" when it happens. I have owned it since it came out. Listen to someone that has used it for awhile not people who write reviews out of the box. I have owned Rokus and never had this problem. There are more apps on the Roku, the interface is more intuitive...do not waste your time.", "verified": true, "helpfulness": "0/0", "author": "MJ"}]