[{"rating": 4.0, "review": "very good and nic to use. some movies don't stream so well", "verified": true, "helpfulness": "0/0", "author": "melissa skidmore"}, {"rating": 2.0, "review": "It always skips and locks up when we watch hulu, but this doesn't happen when we watch hulu on my xbox or computer. I checked the storage space and that was not the problem. This started 2 days after we got it.", "verified": true, "helpfulness": "0/0", "author": "Katie Olsen"}, {"rating": 5.0, "review": "Works good but sometimes is stalls when looking at movies", "verified": true, "helpfulness": "0/0", "author": "Lena TOURAY"}, {"rating": 4.0, "review": "When HBO Now is available it will be perfect", "verified": true, "helpfulness": "0/0", "author": "stephanie Lattauzio"}, {"rating": 2.0, "review": "It was a pain to set up. The fire stick would turn on and off  in a loop. Video streaming app are glitchy while watching movies. Remote response is lagging. The Pac Man 256 app is awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup and operate. Took no time at all. I am still discovering more channels and programs available.", "verified": true, "helpfulness": "0/0", "author": "Patrick A. Kennedy"}, {"rating": 5.0, "review": "Super easy to install.  worked like a charm right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Penny"}, {"rating": 5.0, "review": "I received my Amazon Fire TV Stick and simply plugged it in to my TV.  Setting it up could not have been easier as it walks you through the entire process and since I purchased it through Amazon, it already had my info in the system.  The remote that came with it really makes navigating through the different screens quite simple and very convenient.  I am very pleased with all the programs, apps, games and more.", "verified": true, "helpfulness": "0/0", "author": "Donna Klutz"}, {"rating": 5.0, "review": "The fire tv stick is wonderful - worked like magic", "verified": true, "helpfulness": "0/0", "author": "Terry M. Thompson"}, {"rating": 4.0, "review": "the fire stick is great. the only issue i have is that ive had to restart it a few times because it seems to not always grab my wifi connection. after a restart everything works beautifully. id really love to see more improvements made to the menu system.. it seems a little bit less user friendly than the apple tv.", "verified": true, "helpfulness": "0/0", "author": "melissa"}]