[{"rating": 2.0, "review": "Rushed to market - drops wifi connections. ROKU is more mature.", "verified": true, "helpfulness": "0/0", "author": "PeeceeWizard"}, {"rating": 4.0, "review": "My order was placed in October, I didn\"t receive the stick until December.  It\"s okay. The stick reminds me of cable, must pay for extras. This is the reason why I have not had cable since 2006. ESPN always freeezes. Enjoying the Free Prime.", "verified": true, "helpfulness": "0/0", "author": "Miss LMH"}, {"rating": 5.0, "review": "Fantastic little streamer. Reaaly blows away Chromecast!", "verified": true, "helpfulness": "1/1", "author": "H. Wright \"DVD Enthusiast\""}, {"rating": 2.0, "review": "It requires you to plug the USB into the wall. My Chromecast's USB power source plugs right into the TV next to the HDMI outlet, so I don't have to worry about cords or plug overloads. Funny that the advertising always leaves out THAT part... I wanted to love it, but I ended up returning it.", "verified": true, "helpfulness": "0/2", "author": "Jared F. Heath \"Jared\""}, {"rating": 5.0, "review": "Much better than ChromeCast!", "verified": true, "helpfulness": "0/0", "author": "Will Langston"}, {"rating": 5.0, "review": "fantastic little device with tons of features. remote seems to have excellent range and is very responsive.  the device is a little wide and had some trouble fitting it in the tv, next to the bulbous chromecast I have, but the extension/adapter cable the comes with it, allowed it to be used nonetheless.", "verified": true, "helpfulness": "0/0", "author": "L. Briscoe"}, {"rating": 5.0, "review": "The am Amazon Fire TV stick adds the \"smart\" to your not so smart TV. This device lets you add all kinds of content providers via your internet. It has great interfaces for the major services that I've tried. And it's quite easy to setup", "verified": true, "helpfulness": "0/0", "author": "L. D. Johnson"}, {"rating": 5.0, "review": "I like this better than Chromecast. It has Netflix and Amazon built in. Not back for under 40 bucks. If you have Wifi and a HDMI input you're good to go. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "mikeyyyownz"}, {"rating": 2.0, "review": "I think we would have loved this to use with Netflix. Unfortunately, when it arrived we found out that the HDMI on our TV is not compatible with the Fire stick. There was no where in all of the research we did, that mentioned if you have HDMI/DV port it will not work! Customer service at Amazon (who was very helpful and spent a good amount of time trying to figure out our problem) told us that the correct type of HDMI port had only been in TVs about 7 years, so if your TV is a little older, please try to check carefully before you buy. A far as I could see in the specs (admittedly I don't understand them completely) we had everything we needed - HDMI, HDTV, 1020i, etc. It was one devide that looked like it would be really easy to use and we are very disappointed.", "verified": false, "helpfulness": "0/0", "author": "R. Henderson"}, {"rating": 4.0, "review": "Installation was easy, the operation is user friendly.  We enjoy seeing old movies.", "verified": true, "helpfulness": "0/0", "author": "Dan Luthye"}]