[{"rating": 5.0, "review": "The Fire Stick is easy to setup and everything loads in very fast.", "verified": true, "helpfulness": "0/0", "author": "Sean Ryan"}, {"rating": 5.0, "review": "impressive.  as intuitive as netflix and even better at finding similar shows to those you like.  This is a very well thoughout and engineered device/service.  Even the automatic screensaver is beautiful.  got to figure out how to make the screensaver stay showing for longer though!", "verified": true, "helpfulness": "0/0", "author": "Ron Anderson \"BengalTigger\""}, {"rating": 3.0, "review": "its easy to setup and use.  major point, does not allow you to stream content from your computer.", "verified": false, "helpfulness": "0/0", "author": "Eric Miller"}, {"rating": 4.0, "review": "Everything seems to work fine but the synchronization with lips and sound are off a little", "verified": true, "helpfulness": "0/0", "author": "Roger Allen Craddock"}, {"rating": 5.0, "review": "Like it. It is very easy to use, very easy to set up, works on all our TVs, and our PC. Fast, and improved navigation from other products that offer Amazon streaming video.", "verified": true, "helpfulness": "0/0", "author": "blossom"}, {"rating": 4.0, "review": "So It looks real easy to set up but how do you open the remote to insert the batteries?", "verified": true, "helpfulness": "0/0", "author": "SPARKYMOM"}, {"rating": 2.0, "review": "Great interface, really nice. Unfortunately, even at 10mps unimpeded, it says my connection is too slow. FYI: two year old Apple TV still streams fine.  This is a shame, too, because I want to use my Prime membership to watch movies and TV. Thankfully, I can still order DVDs and get them in two days with Prime. But this stick is a non-starter.", "verified": true, "helpfulness": "0/0", "author": "J. Head \"addimac\""}, {"rating": 5.0, "review": "so many programs to look at and hundreds of movies to chose from you will not be disappointed.  AMAZING", "verified": true, "helpfulness": "0/0", "author": "john h pielich"}, {"rating": 5.0, "review": "It is wonderful", "verified": false, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Easy to set up.Worked first time with no problems.", "verified": true, "helpfulness": "0/0", "author": "Michael Johnson"}]