[{"rating": 5.0, "review": "So easy and very cool.  Before getting the Fire TV stick, I used my bluray to stream Amazon and then Roku's, including the Roku stick.  The fire stick so far is the best.  All my Amazon content is there, it's easy to navigate, and the remote features are sleek and fit nicely in my hand.  This was so simple to set up, I took it out of the box, plugged it in, and everything was there.  Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Genie"}, {"rating": 5.0, "review": "It was very easy to get started. No boxes just a plug in. I like the selection of movies and shows. However,  the fact that you need to have cable subscriptions to watch several of the channels of which I don't have makes it a little frustrating.  Other than that it's fun and entertaining to have.", "verified": true, "helpfulness": "1/1", "author": "j.mosley"}, {"rating": 5.0, "review": "slick", "verified": true, "helpfulness": "0/0", "author": "Garry L. Hall"}, {"rating": 5.0, "review": "Wow!Amazing product. Got yesterday. I am not tech savvy but this was so easy to set up. I have done Netflix, Amazon Prime, Showtime and even downliaded pics from my ipad. The remote is so handy.I downloaded the app on an android tablet but the ipad one is coming soon.I have chromecast and good for a couple things but the scope of this is much wider. If u like movies,etc. u need to buy this. A small price for a great device!", "verified": true, "helpfulness": "1/1", "author": "Evelyn Bay \"Big Fan\""}, {"rating": 2.0, "review": "Crashes a lot.  Cannot be used to stream content on Bluetooth or Wifi.  Interface is confusing.", "verified": false, "helpfulness": "0/2", "author": "tw"}, {"rating": 2.0, "review": "I bought this because it was advertised as being comparable to our Chromecast, which has been running a bit choppy lately. The Fire Stick advertises that it's \"Miracast Certified\" but gives no instructions on how to mirror your laptop, phone or computer to the TV. Not even a search on Google will tell me how to mirror on this thing. Just customers complaining that they can't get the mirroring to work. We don't need it for streaming Netflix or Amazon our PS4 does that. Totally disappointed.", "verified": true, "helpfulness": "1/3", "author": "Melissa Bernard"}, {"rating": 1.0, "review": "Great idea. Worked wonderful for the first day. After that it streamed slow, locked up constantly, closed out of my netflicks on its own... Super frustrating & annoying. Loved the idea but sad to say it was too good to be true.", "verified": true, "helpfulness": "1/2", "author": "Laylamommy0917"}, {"rating": 5.0, "review": "awesome addition to family entertainment with great price. I bought a second fire TV stick for another room. If you do not have a smart t v this is the way to go.", "verified": true, "helpfulness": "0/0", "author": "virgel smith"}, {"rating": 5.0, "review": "Where to begin.I have Google Chrome Cast, PS4, and even a computer connected by Hdmi to my TV.The Chrome cast is a great idea but the one draw back is it only cast what is on my phone, tab, and pc which i do not always want to cast. Example is when i want to work and want to watch a show on Amazon, I have to cast my screen to a tv which i do not want to do. Even when using my cell i have to answer calls or text email and i need the whole phone screen for what i am doing.As for my PS4 i love it, but i did not get a PS4 to watch amazon prime, the apps kind of lack also.Fire TV Stick seemed like a great choice especially for $20.So far i love it. Easy to use, does not require turning on a system or casting a screen just change the source on my TV and there it is.I enjoy the apps that have came with it so far, and downloaded more already.The menu layout is large and easy to see. Even started to use the cloud storage because of the Fire TV Stick.The internet speed is great so far, using cable.Set up was quick and easy also. The remote feels cheap and to get the batteries in was a hassle. AMAZON needs a better remote!!!Other then the remote i will be using Fire TV Stick often.", "verified": true, "helpfulness": "1/1", "author": "Eddie T houston"}, {"rating": 5.0, "review": "Love our Fire TV stick!  Allows us to watch so much more as a family.", "verified": true, "helpfulness": "0/0", "author": "db1895"}]