[{"rating": 5.0, "review": "I love this product.  It makes navigating so easy.  I purchased a DVD player to gain access to Netflix and Amazon but it constantly \"timed out\".  No such problems with the Fire TV Stick.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Texasshopper"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Corina A. Morales"}, {"rating": 5.0, "review": "Great product, turns a average TV into a full entertainment center!", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "Excelente.", "verified": true, "helpfulness": "0/0", "author": "Manuel Bolivar"}, {"rating": 1.0, "review": "Not worth it you have to pay for everything on top of the cost of Internet and the stick!", "verified": true, "helpfulness": "0/0", "author": "kaysie marshall"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Kim W."}, {"rating": 2.0, "review": "It was easy to set up but the picture isn't that clear-when I stream net flux the  picture is too dark and I have tried to change the settings.", "verified": true, "helpfulness": "0/0", "author": "Lori D."}, {"rating": 5.0, "review": "Love it!!! Movies, TV shows, games, apps, music. Everything you can think of !! Awesome, especially with Prime membership. Always something to watch. Very easy set up. No more cable TV bill!!!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie McQueen"}, {"rating": 5.0, "review": "This is simple to hook up to your television and the remote is simple, too! I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "punkin"}, {"rating": 5.0, "review": "I received the Fire Stick as a birthday present from my son. He set everything up which didn't take long at all. I love it ! I use it everyday ! You can also download apps and games. If you have a subscription to Netflix, Amazon Prime or Hulu Plus you can enjoy them as well.  Wonderful device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]