[{"rating": 5.0, "review": "Love this device.  I was able to power it using the USB outlet on my television, works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Troy"}, {"rating": 2.0, "review": "The fire TV stick is almost really, really good. As a Roku-like replacement for streaming NetFlix, Amazon-content etc it has a slick interface and works well. There is also a reasonable selection of apps and games that can be played.Personally, I found two significant glitches (I wanted a USB-powered compact device that could do WiFi mirroring) that folk should be aware of:Like the Chromecast stick, the fire TV stick is powered by USB. However, the USB ports on smart TVs (I have a fairly new LG smart TV) may not provide enough power, causing the fire stick to issue a warning to plug in the supplied power dongle, so extra extension cords.Amazon also advertises the fire stick as having WiFi mirroring (miracast) from other smart devices, which was the main reason I purchased the device. Unfortunately currently (December 2014) this mirroring is restricted to other Fire devices, and a specific version of Android. Note that Windows and IOS do not appear to be supported; Windows 8.1 detects the fire TV stick but the connection doesn't complete. Very disappointing, perhaps a later release will fix the miracast Windows issues.For now, back to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Treb Orf"}, {"rating": 4.0, "review": "3 1/2 stars.TL:DR; Its a tv stick like all others, with some key benefits+It is one of the better tv sticks out there as its speedier then the roku 2 and roku stick and a lot more coherent for on-screen menu and information.+PLUS it also rides on the 5ghz spectrum for wifi which allows for streaming to be HD at a much better rate then my old rokus did [2.4ghz]It does fall short in certain departments:-My S5 refuses to screen mirror, this is a reported issue with many phones [search xda].  The hand shake to establish mirror always fails.  It seems to work by downloading additional software at an additional cost [allcast].-I receive an error booting up the stick saying I need to use the original power adapter to supply power to the unit, certain reviewers online [google it] have come up with the same error.  I can't determine if there are features lacking due to that error.-Screen adjustment/calibration needs tweaking.  As you can only contract/expand the 4 triangles to hit the 'edge' of the screen but in doing so I get black bars on either side, the system needs to allow the image to move so its centered.-You get advertised to buy games that the firestick can play, except that the unit by default doesn't come with the controller, the system should 'flag' the fire stick from buying something it cant use IMO", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Great device for TV. I was fortunate to get during the 2-day sale for $19. Very easy to install and use. Remote is easy to use and the remote android app on my tablet gives me access to voice command. The apps on the Fire Stick run much faster than on my WiFi Bluray player. Very much worth the $20 spent.", "verified": true, "helpfulness": "0/0", "author": "Julio Cisneros"}, {"rating": 5.0, "review": "I bought the Fire TV Stick after already owning two Google Chromecasts, and I wish Amazon had come out with this sooner.  The interface is a little confusing at first, but overall, it is a device.  The fact that it has a remote control is a major upgrade from the Chromecast, and I like that it is compatible with Amazon Prime Instant Video.It would be nice if I could download the remote control app on my Kindle Fire HDX, and not just on my Android phone, but maybe that will be included in a future update.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonderful.  Now, if I could just get mu husband to........", "verified": true, "helpfulness": "0/0", "author": "Beverly Sims \"granimal\""}, {"rating": 5.0, "review": "easy to install, and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Chris Hernesman"}, {"rating": 4.0, "review": "As a Prime member it worked well. I'm glad I got it.", "verified": true, "helpfulness": "0/1", "author": "rogerbrad \"Tell us about yourself!\""}, {"rating": 5.0, "review": "This product is grate, for now the best stick a ever use, I buy it in 20 dollars but for the original 40 you never get something like this, work very well, fast interface and brings the remote.", "verified": true, "helpfulness": "0/1", "author": "Ludwing Ruben Ortega Molina"}, {"rating": 1.0, "review": "I love the idea of this item and it's access to Prime Videos. However, there are several reasons we are hating it:1. PERFORMANCE is inconsistent and there have been several instances where we've had to restart it. The remote some times doesn't even work. Today it had crazy, erractic behavior. Press a button on the remote and it would move 50 spaces on the menu. Possessed. I've just had to plug and unplug again. Since we've been using Apple TV for years without issue we are experienced with this type of device. The Fire Stick HAS BUGS that need to be worked out. Beware!2. PARENTAL CONTROLS - this is a great feature in theory but their execution is subpar. If you set the parent control it requires a password be entered before watching ANYTHING and EVERYTHING. This is annoying. It would make sense to require the password for things like: a)shows with anything higher than a G rating, b)purchases. All I want is for kids to be able to scroll and select a kid's show on their own without me needing to come into the room and enter the password. I want their content limited to them and don't want them to be able to buy anything. Netflix does a great job with this by having you set up profiles for each user. Amazon get with the program!If Amazon fixes the bugs to improve performance and adds logical parental controls it'll be great. So far it is a disappointment and currently is unusable due to technical issues.", "verified": true, "helpfulness": "3/3", "author": "PrincessButtercup"}]