[{"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "michael vasquez"}, {"rating": 1.0, "review": "Please dont waste your money on this device.  Save yourself a whole lot of headaches and frustration and just get a Roku3 or some other similar device.  The main problem with this device is it's based on Android....and Android is poorly written and executed.  This device works OK for the first 30-45 minutes of streaming media (Sling, Hulu, Prime Video, TWiT, ITProTV, etc.)  but after that, its either out of memory cache or something, because the rest of the time, it'll be freezing and stuttering and loading and catching up.  Finally I have to go into settings and force it to Restart, then it works OK for 30-45 minutes.  It's ridiculous that a device built solely for streaming media to your TV only works for 30-45 minutes at a time before it suffers massive problems.  And it does it in EVERY app that streams media to it...Sling, Hulu, Prime Video, etc.  Meanwhile, I can go to my bedroom TV that has a Roku3 attached and is on the same WiFi network and it works flawlessly for hours and hours at a time.  A Roku3 costs about twice as much as this device, but believe me, its worth every darn penny.  It's simple and it simply works flawless.", "verified": true, "helpfulness": "0/0", "author": "Derek A. Anderson \"Derek\""}, {"rating": 5.0, "review": "Great product. Meets all my expectations.", "verified": true, "helpfulness": "0/0", "author": "Steven Golden"}, {"rating": 1.0, "review": "At first thought this was the greatest thing ever, but we were only using Amazon prime TV.  Every time we try to use Hulu, Netflix, or pandora it freezes every couple minutes. Making watching or listening to something impossible. We thought it was our internet connection, but every other device in the home works fine. We got rid of direct tv thinking this would be cheaper, but now I can only watch Hulu on my tablet, because the fire stick will only work with Amazon TV. I would not recommend this product to anyone. Very frustrating. We are going to look into google chrome instead.", "verified": true, "helpfulness": "0/0", "author": "Samantha D Price"}, {"rating": 5.0, "review": "I got a question. With this device can I see ESPN or Fox Sport live or some games also live soccer NBA, CHAMPIONS LEAGUE?", "verified": false, "helpfulness": "0/0", "author": "Gerardo Perez V"}, {"rating": 5.0, "review": "Great combination of features from Roku and Chromecast.  The app makes it easy to navigate through content.", "verified": true, "helpfulness": "0/0", "author": "Mark A. Schmidt \"MarkAtEleventh\""}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Quelisha Knight"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "amaury"}, {"rating": 4.0, "review": "THIS STICK DOES NOT PLAY PBS AND I HAVE PBS APP.! AND FOLLOW YOUR INSTRUCTION.! IT WILL NOT TAKE THE CODE YOU GIVE ME THERE IS NO PLACE ON PBS TO RECORD THE CODE.! IM NOT THE ONLY ONE HAVEING THIS PROBLEM..!! IT PLAYS GOOD ON NETFLIX AND UTUBE AND OTHER CH.  PLS. HELP AMAZON.!  WITH THIS PROBLEM I CAN ONLY GO FOR 2 STARS..!!PLS. FIX SOON AMAZON .! I KNOW YOU WILL..!!  THANK YOU  BOB  BROOKS", "verified": true, "helpfulness": "0/0", "author": "ROBERT BROOKS"}, {"rating": 4.0, "review": "If you control the Fire Stick via your regular TV remove (many TV's support some control through the hdmi port) then it always complains when accessing Netflix that it requires the Fire Stick remote which it can't find...  I left the Fire Stick remote next to the stick in hopes that it would detect it and stop prompting me everytime I go to access Netflix, but it doesn't.  The remote probably goes into some sort of sleep mode where if it's only detectable after a button is pressed on it.  Otherwise, it's very responsive and very fast.", "verified": true, "helpfulness": "0/0", "author": "Brandon M Smith"}]