[{"rating": 5.0, "review": "Really fun addition to our entertainment system. Easy to use and very convenient.", "verified": true, "helpfulness": "0/0", "author": "Hailey P"}, {"rating": 5.0, "review": "Love the new fire stick! Let's me stream Amazon prime as well as Netflix!", "verified": true, "helpfulness": "0/0", "author": "kristysp"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Connie GIfford"}, {"rating": 5.0, "review": "Makes streaming media simple. Only downside, binge watching tv shows! That's on me, not the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Randy Holland"}, {"rating": 2.0, "review": "I've had the stick since Christmas so I can give an adequate review.  Pass on this device.It doesn't support most Surround Sound formats and requires the audio be sent via direct play.  This wouldn't really be that big of a deal, but it only support audio passthrough in a single format (MP4).  I have several TBs of MKV files I can't even watch because the Fire Stick is too stupid to just pass the audio to my receiver.  What a joke.Get a Roku Stick.  It's $10 more dollars, but at least it supports a far wider range of audio and video formats.", "verified": true, "helpfulness": "0/0", "author": "Fill in the Blank"}, {"rating": 1.0, "review": "I just couldn't get it to work.  After a few days of trying to connect and even calling the help line I eventually returned it.I eventually got a roku stick to work", "verified": true, "helpfulness": "0/0", "author": "K. R. Simmonds"}, {"rating": 3.0, "review": "I love everything about this product except, there is a little pop sound every few seconds. very very annoying. And forget about listening to music on it, unless it's constant heavy metal, maybe. Will there be a fix some time soon? I know that many others have this same problem. Please HELP. I so want to love this.", "verified": true, "helpfulness": "0/0", "author": "Robert Raymond III"}, {"rating": 1.0, "review": "Doesn't easily connect  with Android phones;  I couldn't get my LG3 phone connected to the device even after advice from tech support people.  This wouldn't be a huge issue except the lack of apps for popular things like HBOgo, comedy central , etc means that it's basically a stick for watching netflix and prime and youtube.  If you're looking for a streaming stick I'd recommend buying any other product.", "verified": true, "helpfulness": "0/0", "author": "Andrew Jacob Steyer"}, {"rating": 2.0, "review": "I bought this to use pretty much only for Plex. the Plex \"app\" that is on this device is pretty much terrible. Hard to find shared libraries, and very slow. I used it for a week and put it back in the box, and went back to a Roku.", "verified": true, "helpfulness": "0/0", "author": "Jonathan E. Carson \"Matrix\""}, {"rating": 1.0, "review": "I have been a loyal Amazon customer for years and have been raving about the company to anyone who will listen.  This will soon stop after my dissatisfaction with finding this product, ordering this product, and then not being able to use this product.I have been trying to purchase this product for months because I love Amazon.  I was excited to choose a product they created thinking it would be as wonderful as my experiences had been with the company.  I was wrong!I looked on the Amazon site for months and it was constantly sold out.  Finally, I decided to order it through Best Buy which was an even bigger hassle because most stores don't have it in stock.  It must be ordered and shipped.  I waited at home to receive my shipment later than promised and then traveled off to work out of town.  I stay in hotels and surprisingly the hotel in this tiny town has terrible cable.  I ordered this product, waited for it, and finally was ready to use it only to find out that it wouldn't connect to the network.  I tried to use the chat feature to resolve my issue and found out that the fire tv department only offers support through out going calls.  They called me only to tell me that there was no resolution to my problem.  This PORTABLE steaming video player will not play on a network that requires authentication.  One of the biggest selling points is the size and thus portability of this product!  That really doesn't help if you can't use it outside of your home!I have had a roku for probably 5 years now.  I have bought them for friends and family because the product was so wonderful.  I should have stuck with what worked and purchased another roku.  The newer ones are flash drive size as well.  I really thought Amazon would offer a superior product though so I went for it!  DO NOT buy this product!  It is not worth the hassle!  The competitors products work as well if not better and are of comparable prices!", "verified": false, "helpfulness": "1/1", "author": "Melissa Tisdale"}]