[{"rating": 5.0, "review": "Saw this product at my brother's home and was amazed at what it could do. Ordered my own, brought it to our seasonal home in Santa Fe where we have internet, but not much else. Followed the simple directions and...what do you know...we have unbelievable television viewing. Not the network channels, of course, but everything else, including Netflix!Can't say enough about this simple, effective product.", "verified": true, "helpfulness": "0/0", "author": "Daniel E."}, {"rating": 5.0, "review": "So much nicer to be able to view my Prime movies and TV shows on the big screen vs my laptop. Not sure why I didn't get this earlier.  Also, Amazon does have a really decent catalog of pay-to-rent/own movies, both new and old, so I use this as a supplement to my PPV, Netflix and Hulu accounts.", "verified": true, "helpfulness": "0/0", "author": "Lola's Mom"}, {"rating": 5.0, "review": "Absolutely am loving my new Amazon Fire stick!! Has turned my HD TV into a Smart TV for just $35.00. Not only can I get Netflix, Amazon Prime, HBO but I use it for YouTube, games and other things! One of the best investments I have made in a long time!! Thank you Amazon!!  AAA+++", "verified": true, "helpfulness": "0/0", "author": "abitosoul \"Jeffery\""}, {"rating": 5.0, "review": "Works great. Very fast shipping. I am very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "dee"}, {"rating": 5.0, "review": "Works much better than Roku", "verified": true, "helpfulness": "0/0", "author": "A. Clark \"TeeCee1234\""}, {"rating": 5.0, "review": "Hands down better than Chromecast. The remote is a great feature!", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 4.0, "review": "Never saw Gary Bussey have to use a USB Power cord to power the Fire Stick - so that is a little misleading.Otherwise a very good product.", "verified": true, "helpfulness": "0/0", "author": "Douglas Simms"}, {"rating": 1.0, "review": "I have been able to use my Fire Stick as there is a clicking noise that get continuesly worse the longer I watch.  Amazon customer support was great and sent me a new one....but it was even worse! It is not my TV/internet/HDMI port as my chromecast works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "taylor"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome. It adds an entirely different dimension to my TV. I have a \"smart\" tv, but the smart features within the tv are not great. I can log into Netflix and Hulu but the search features are pretty slow and tedious. The Fire TV stick solves this problem since it's much faster. Just clicking the middle button on the remote brings me to my HDMI input and I can just start scrolling through my Amazon, Netflix and Hulu accounts' movies and shows. My amazon products are really starting to give my Apple products a run for its money. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Duong"}]