[{"rating": 5.0, "review": "I just got this hooked up. And I love it! Super easy to install and operate...I've never been able to use Amazon prime video and now I can! Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Joan E. Fruth"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "1/1", "author": "John J Maharay"}, {"rating": 5.0, "review": "Wifey likes her Fire TV Stick...  All good!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome and well-priced way to add streaming to a TV or room that doesn't have it. I love that it connects to Amazon Prime Music as well since we use it all the time.  My only complaint is that the micro USB connects to the side of the Fire Stick. If you use this on an AVR, it may interfere with your other HDMI inputs.", "verified": true, "helpfulness": "0/1", "author": "gspfunk"}, {"rating": 2.0, "review": "No download option in any preinstalled app (Netflix / Hulu)", "verified": false, "helpfulness": "0/0", "author": "Alberto I."}, {"rating": 5.0, "review": "I love this.  Works great on my home network.  No issues at all.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "this is the best in the market", "verified": true, "helpfulness": "0/0", "author": "Eusebio del Rio"}, {"rating": 4.0, "review": "Love it.  After we'd had it for about 2 weeks it stopped working.  We tried everything, then our son suggested that we unplug it and wait 30 seconds.  That did the trick.", "verified": true, "helpfulness": "0/0", "author": "dotti"}, {"rating": 2.0, "review": "It's decent enough. But it's weak at picking up and maintaining a WiFi signal.", "verified": true, "helpfulness": "1/1", "author": "MeteorSage"}, {"rating": 4.0, "review": "my problem is  it came with no info how much some of the video we want to watch costs,  we are very ignorant about this stuff and should have realized it was to good to be true.", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Brunner"}]