[{"rating": 5.0, "review": "Great product -- as long as your WiFi is good.", "verified": true, "helpfulness": "0/0", "author": "Dave Flannery"}, {"rating": 5.0, "review": "Buy it. Trust me. I'm a doctor. Works great. Okay, I'm not actually a doctor. But buy it anyway.", "verified": true, "helpfulness": "0/0", "author": "Just Some Dude Who Buys Stuff on Amazon. A lot."}, {"rating": 5.0, "review": "Long story short we only have DVRs in two rooms (living room and our bedroom) and NOTHING for our guests.  We don't have guests enough to pay for an extra DVR box through DirecTV so I got this.  I LOVE, LOVE, LOVE this product.  On days I feel like hibernating, I go into the guest room and watch all of my favorite shoes on my Fire Stick on the tv in there.  Hulu, Amazon, Netflix (I have them all), so it is worth it to me to have a product that let's me (but my guests) always have something great to watch.", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Amazing product. Easy to set up and great price.", "verified": true, "helpfulness": "0/0", "author": "Chris \"Author of Love Hurts: A Spiritual Journey to Wholeness\""}, {"rating": 3.0, "review": "Disappointed in the number of recent prime free movies available.", "verified": true, "helpfulness": "3/3", "author": "E. Einsohn"}, {"rating": 5.0, "review": "Best Streaming  Stick Ever", "verified": true, "helpfulness": "0/0", "author": "Shadz"}, {"rating": 5.0, "review": "Superb!!", "verified": true, "helpfulness": "0/0", "author": "Suraj"}, {"rating": 5.0, "review": "I've never used any type of internet TV so was concerned I'd be smart enough to set it up and use it.  It is so easy!  And I love it!", "verified": true, "helpfulness": "1/1", "author": "Teddi"}, {"rating": 1.0, "review": "The Stick don't do what it's advertised to do. I Can't activate all my apps. When it comes to giving them my provider, SlingTv isn't in any of there list's. So here I sit with a bunch of movies & music. Did I just get SCAMED???  Nancy Reichel", "verified": true, "helpfulness": "0/0", "author": "Nancy Reichel"}, {"rating": 5.0, "review": "Wow.  After all the time i wasted trying t get netflix t work on my dvd player and the curse them for not having an app for (insert favorite app)  this has them all and is very responsive", "verified": true, "helpfulness": "0/0", "author": "rjcpd"}]