[{"rating": 1.0, "review": "😡", "verified": true, "helpfulness": "1/2", "author": "Jennifer Lovelace"}, {"rating": 5.0, "review": "The Fire TV Stick is sweet.  It has turned my tv experience into a theater style screen.  Love it", "verified": true, "helpfulness": "0/0", "author": "Ruth Lucero"}, {"rating": 5.0, "review": "Perfect for my use.  I had been using my PS3 to watch Amazon Prime and this is a perfect alternative.  Start up is quick and streaming has been perfect.  Didn't have to setup my account, since I purchased it with my prime membership account it was already setup.  Plugged it in, it automatically downloaded the latest update, had to watch the mandatory 'welcome' video and then it was ready to go.  I'm really happy with this unit, and for the price it is completely worth it.  Now just waiting for the IOS fire tv remote app to be made available!", "verified": true, "helpfulness": "0/0", "author": "C. Morales"}, {"rating": 5.0, "review": "Best  New thing in the world today ! LOVE IT !", "verified": true, "helpfulness": "0/0", "author": "Huey Rogers"}, {"rating": 4.0, "review": "I have no problems with the stick. It's the remote with terrible buttons. Big fingers and little remotes don't mix well. Easy setup without problems.", "verified": true, "helpfulness": "0/0", "author": "Carol Senary"}, {"rating": 5.0, "review": "Fell in love with. Easy to customize and sideload APK (android software). Excellent package for a very low price. Very stable!", "verified": true, "helpfulness": "0/0", "author": "i-ha"}, {"rating": 5.0, "review": "Absolutely love it! Great device at an even better price!", "verified": true, "helpfulness": "0/0", "author": "Kristen Pooler"}, {"rating": 1.0, "review": "Slow, clunky, freezes a lot. Advertised apps Youtube, Hulu etc not preinstalled. Very odd browsing for Amazon apps. Search is very restrictive when it comes to anything but Amazon video, app search as far as I can tell at this time is non-existant . Sure it's cheap and of you can't afford an Apple TV go for it, just don't expect too much.", "verified": true, "helpfulness": "1/3", "author": "JoelHanson"}, {"rating": 4.0, "review": "It is much faster than the blue ray DVD that I was using but I'm not crazy about the remote.", "verified": true, "helpfulness": "0/0", "author": "David Fort"}, {"rating": 4.0, "review": "I love this, it streams quckly without the usual slow loading that our wii does. The only reason for 4 stars is that you have to stream in HD. Even if my netflix setting is low quality so I don't use all my data, it still uses HD on the Fire Stick. We have only 24 gigs a month, and HD uses 1 gig an hour or more. Amazon, if you want to steal us from netflix and hulu, make SD more accessible. We are cable free, and rural. make a place for us in your plans!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]