[{"rating": 5.0, "review": "It's the most amazing Amazon creation! I carry to every destiny I travel with my family.", "verified": true, "helpfulness": "0/0", "author": "Gaspar L. Villarreal S."}, {"rating": 4.0, "review": "Only the service premium prime no is actived for dominican Repúblic. I would like it. I live R.D.", "verified": true, "helpfulness": "0/0", "author": "Hector Lois Guerrero Zamora"}, {"rating": 2.0, "review": "Couldn't get it to work had to return it.", "verified": true, "helpfulness": "0/0", "author": "Lucy Flaherty"}, {"rating": 5.0, "review": "Love it! Worth the money and Prime subscription!", "verified": true, "helpfulness": "0/0", "author": "shayna hebert"}, {"rating": 5.0, "review": "easy to install - love the ease with Prime!", "verified": true, "helpfulness": "0/0", "author": "Deb Wehrlin"}, {"rating": 5.0, "review": "This is an amazing piece of technology.  I had it up and running in a matter of minutes.  If Amazon Prime were a little less expensive, I would own it too.", "verified": true, "helpfulness": "0/0", "author": "James A Mueller"}, {"rating": 5.0, "review": "WOW!! I have been dying for a smart TV but being that my tv is fairly new I cant buy another one. This product is amazing. There are so may free apps and movie apps that I just love. Seriously, KUNGFu movie app. Drive-In Movie App. Oh and an app for just scary movies...ALL FREE. Initially I had to call amazon because it wasn't working so that was a little frustrating but hang in there if it happens to you.Its definitely worth it.I don't have amazon prime but now I am contemplating getting it just because of all the movie options..", "verified": true, "helpfulness": "0/0", "author": "jazz"}, {"rating": 5.0, "review": "Unfortunately the device was not compatible with my TV. However the return service was excellent. I'm giving five stars for excellent follow-through on the service.", "verified": true, "helpfulness": "0/0", "author": "parag anandpura"}, {"rating": 5.0, "review": "So glad I bought this!! It's absolutely perfect for my room and I can't wait to take it with me this weekend when I travel to see how it holds up in a hotel.", "verified": true, "helpfulness": "0/0", "author": "Kellie"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Deanna"}]