[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "jeri"}, {"rating": 5.0, "review": "It's awsome", "verified": true, "helpfulness": "0/0", "author": "Sun Young Jung"}, {"rating": 1.0, "review": "Before I begin I would like to say that I love Amazon and it's products. I currently have an amazon Fire TV and figured the tv stick would be just as wonderful as its predecessor. It isn't.I pre-ordered it when it was advertised and when it arrived I connected it to the baby's tv which doesn't get a lot of use but I figured I could play Pandora or cartoons for her from there. Almost from the beginning it came with problems it would take FOREVER to load, but again because it didn't get a lot of use it was easy to just disconnect it and wait for it to reload. Lately though, it has getting more use and the problems with it have escalated to monstrous proportions. It drops the wireless connection constantly, whenever it does connect it states that it connects with problems. No matter how many times I disconnected from its charger it doesn't fix itself anymore.I contacted Amazon customer service today and the girl who helped me pretty much told me to do everything that I had already tried. Such as going to the network settings and forgetting my home connection and re-entering the information again. Then she told me to contact my internet provider. REALLY!!!!? All my other devices, including the regular Fire TV box, roku, Echo (yes another Amazon product), laptops, and tablets seem to be working find why would I contact my provider????!!!I told her I wanted a refund or a replacement. She told me I would get only a minor fraction of a refund if I wanted to go that route. I then asked her to send me a replacement. The problem has been the stick since the beginning. She placed me on hold for 10-20 minutes. I told her it was taking to long. She offered to send me an email regarding the status of my replacement. I will be waiting for that email.To say that I am disappointed on this device is a serious understatement.July 17, 2015: Since my last review I have gone through two (TWO) replacement sticks. They keep doing the same thing or to add insult to injury, when I go to settings it shows that I am connected to my wireless network and the setting is strong, yet when I go back to home it sends me back to settings claiming there is no internet connection.One of the several times I had contact with Amazon service (very nice people btw) one lady told me that they were encountering this problem with several sticks and some Fire TV boxes (she mentioned the boxes because I told her I was not having any of these problems with my box). She said that it was a programming (I may be wrong on the correct word she used) issue and that they would be working on the problem to try to correct the problem over the week. It was during this week that my Fire tv box had an update and gave you the ability to turn put the box to sleep, or mirror the image, or go to settings when you pressed the home screen on the remote. Although these new settings were welcomed on my box, it didn't solve my stick problems so I was sent a replacement. ... This new replacement has started acting up, again. I unplugged it and put it aside and forgot to reconnect it. My husband went on a business trip and took it with him. He hasn't had a chance to connect it so I don't know if it is still acting up. As soon as he gets back I'll check and see if it needs an additional replacement...So my one star rating remains. :(", "verified": true, "helpfulness": "0/0", "author": "Csanchez2"}, {"rating": 3.0, "review": "Was very excited when it finally arrived.Then it makes you sign up for prime to receive all movies for free then some free some you still to pay for an dont know i still gotta figure it out.", "verified": true, "helpfulness": "0/0", "author": "Ruddy Clark"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "robert greenbaum"}, {"rating": 5.0, "review": "This is a good thing too have my kids can learn and I and my wife can watch movies and shows on there we like too see", "verified": true, "helpfulness": "0/0", "author": "james baker"}, {"rating": 2.0, "review": "I mistakenly thought this was the equivalent of a Roku but come to find it doesn't stream my favorite channel PBS.  okay, otherwise", "verified": true, "helpfulness": "0/0", "author": "Eliza Sonneland"}, {"rating": 5.0, "review": "Very amazing device", "verified": true, "helpfulness": "0/0", "author": "Christopher Khan"}, {"rating": 5.0, "review": "Only downside is remote is difficult to use too small", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Awesome great product.  So easy to use.  I recommend this product for anyone who is looking for more movie options.", "verified": true, "helpfulness": "0/0", "author": "seabee3542"}]