[{"rating": 5.0, "review": "Easy to use and install. I am a prime member but I only had one TV in the house that I could use it on now I can choose what room I want to watch my Prime videos on or use my Netflix account. I already recommended this to a friend of mine, great purchase.", "verified": true, "helpfulness": "0/0", "author": "Arline Brady"}, {"rating": 5.0, "review": "Love the remote. Much easier than chromecast and gas more games and features and streaming options", "verified": true, "helpfulness": "0/0", "author": "Jake Crosby"}, {"rating": 5.0, "review": "Love it streams perfect!", "verified": true, "helpfulness": "0/0", "author": "Irene Brown"}, {"rating": 5.0, "review": "Love this!! Cut my cable off and saved so much money!!", "verified": true, "helpfulness": "0/0", "author": "Aschley Durham"}, {"rating": 3.0, "review": "Quick Look:+small+inexpensive+easy to set up and use+runs off of USB power+can side-load full android programs-no keyboard option supported-bluetooth audio actively blocked for Netflix and Amazon Instant-no voice remote includedOn the one hand, the Fire TV Stick effortlessly turns any \"dumb TV\" (or, in my case, projector) with an HDMI port smart--able to stream media and even play some basic games. It's fast and easy, and it can even power itself via off most TV's USB ports, which cuts down on the tangle of wires running down the back of an entertainment center. For those interested in getting a little more out of their device, Amazon even made it easy to side-load programs onto a fire TV stick, allowing you to hook up non-traditional bluetooth controllers, do a little word processing, emulate SNES era games, all on a $40, USB-sized stick. As a miniature android proto-PC, you really can't do batter than the Fire TV Stick.On the other hand, Amazon has made a couple of truly baffling decisions that reduce the usability of the fire TV stick for everyone. Earlier this year, the Fire TV received an update allowing users to link previously blocked Bluetooth devices such as headphones and keyboards to their Fire TVs. For the first time owners of the Fire TV could watch a movie with wireless headphones or type in the name of their favorite show with ease. The Fire TV Stick received none of this functionality. Amazon support cites unspecific\"hardware issues\" that prevents Amazon from unlocking the stick's potential. To put it plainly, this is a lie.As I said earlier, with the full android settings apk you can link any bluetooth headphones you like to the Fire TV Stick. Navigation and notification sounds come through just fine. However, if you try to watch something on Netflix or Amazon Instant, bluetooth audio is blocked. We know this isn't a hardware limitation because Kodi (the open-source home theater software suite) can play bluetooth audio while streaming video on Fire TV Stick without difficulty. We also know that it's not a software issue, because the Fire TV (the stick's sister device) supports bluetooth headphones with both programs. I can't imagine why this functionality is intentionally blocked on the Fire TV Stick alone,  unless it's to make the more expensive Fire TV box more appealing.Whatever the reason, the Fire TV Stick is still a neat little gadget; but its usability (especially for projector-users like me) is really hampered by Amazon's refusal to natively support bluetooth devices.", "verified": true, "helpfulness": "0/0", "author": "Z. Richardson \"Zack\""}, {"rating": 5.0, "review": "fast service good price", "verified": true, "helpfulness": "0/0", "author": "john wehausen"}, {"rating": 5.0, "review": "Great. Love it", "verified": true, "helpfulness": "0/0", "author": "Patrick Horning"}, {"rating": 5.0, "review": "Love it !!", "verified": true, "helpfulness": "0/0", "author": "Daniela Blair"}, {"rating": 5.0, "review": "Great way to do streaming of any media.", "verified": true, "helpfulness": "0/0", "author": "Ronald J Stebbins"}, {"rating": 5.0, "review": "so easy to use and great streaming - no disruptions, great quality and sound....easy to switch from Amazon prime to Netflix, etc...", "verified": true, "helpfulness": "0/0", "author": "Jennifer Siebe"}]