[{"rating": 5.0, "review": "It even improves the picture on my TV.  The choice of programs is excellent and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "J. Wiley"}, {"rating": 5.0, "review": "This is an amazing product, most user friendly system I've purchased.  Ensure that you download the app to your phone, makes it even better.  Everything works better than expected.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "Could not watch anything without it buffering every 20-30 minutes.  Currently have Apple TV and Chromecast, neither of those seem to buffer at all. Returned item.", "verified": true, "helpfulness": "1/1", "author": "Chrissy Wilson"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Isaac Klughaupt"}, {"rating": 1.0, "review": "Many functions still do not operate. No advantage over current software display. I do not use my cellphone however.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic!!!  It was sooo easy to use.  I am technically savvy enough to be very dangerous and the entire setup including logging into Amazon account.  The most complicated action is that you now have three remotes to use (if you have cable or direct tv), and you have to use the tv's remote to go to HDML 1 to HDML 2 , then hit the center of the firestorm.  Follow directions.  So easy.  Then when you use it you just go back and forth between  the HDML's.  Lots of free shows.  You do have to pay for quite a few.  Also you can easily use it to go to Netflicks and other streaming videos services.  I just love it.", "verified": true, "helpfulness": "0/0", "author": "Elmo san diego \"ElmoSanDiego\""}, {"rating": 5.0, "review": "I LOVE this!! Excellent for streaming Netflix and Prime... it is exactly what I needed :)", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Works great and I am going to buy another one.", "verified": true, "helpfulness": "0/0", "author": "Virgil Ross"}, {"rating": 5.0, "review": "Over the last year or two I've tried a couple other WiFi/HDMI interfaces for my TV, and this one simply works. The other two weren't functional enough to bother with. The more recent was a Chrome stick, and that was better than the first (brand escapes me right now) but didn't meet my needs for transparency and ease of use. I think Amazon has hit on the right combination of functionality and provider relationships. The Fire TV Stick was impressively easy to set up. The Netflix and Hulu+ set-ups were obvious and easy. And of course the stick came with my Amazon Prime account pre-loaded. I'm enjoying the use of this tool, and considering dropping some of the premium services I have on my [cable] account.", "verified": true, "helpfulness": "0/0", "author": "Frank Paynter"}, {"rating": 4.0, "review": "The only disappointment so far is the large power supply.", "verified": true, "helpfulness": "0/0", "author": "Brad Kueter"}]