[{"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "Mikeridz"}, {"rating": 5.0, "review": "Love it better than smart tv app already on my Vizio.  Bought this for my non-smart tv's. Now want to buy another for the smart tv.", "verified": true, "helpfulness": "0/0", "author": "Matthew L Davis Jr"}, {"rating": 4.0, "review": "MY BROTHER GOT ONE AND TOLD ME THAT IF MY TV HAD AN HDMI PORT I SHOULD GET ONE TOO. SO I FINALLY DID AND IT WORKS GREAT. MY BROTHER SAYS HE CAN EVEN USE INTERNET EXPLORER ON HIS BUT I HAVEN'T BEEN ABLE TO DO THAT YET. I GOT THE ONE MONTH AMAZON PRIME AND AM CURRENTLY WATCH THE ORIGINAL STARGATE TV SERIES WHICH I CAN'T FIND ANYWHERE ELSE. I EVEN DOWNLOADED THE AMAZON FIRESTICK REMOTE APP TO USE INSTEAD OF THE REMOTE IT COMES WITH. ONCE YOU GET THE HANG OF IT, IT BECOMES EASIER TO NAVIGATE AND A KEYBOARD FOR TYPING INSTEAD OF ONE BY ONE SELECTION WITH THE TRADITIONAL REMOVE.", "verified": true, "helpfulness": "0/0", "author": "Sabrina C Rodriguez"}, {"rating": 5.0, "review": "I like it. I have trouble getting the movies but that is not the fire stick problem....it is my DSL", "verified": true, "helpfulness": "0/0", "author": "V. Gaffney"}, {"rating": 5.0, "review": "We have been looking to drop our cable package for a while, so I ordered the Fire Stick. Well I can't believe how easy the fire stick is to use! It came preloaded with my Amazon Prime account info, I set up Netflix in seconds, and was pleased to see all the other free TV services available on the device!Pros:Super Easy set-upPreloaded with Amazon PrimeCompatibility with IPhone/Android remote control Apps.Netflix works great and set up easyVery easy remote functionIt's HD!!Screensaver Built inComes with power cord and HDMI extensionCons:Opening the battery compartment (I nearly had to get a screwdriver to pry)I had no interest in games so I had to delete them off the fire stickOverall: I would buy again in a second because my cons could be pros depending on the user.Update: I have been having some issues with my signal dropping with the fire stick causing some frequent resets. I have also had some issues with sound loss after selecting a movie or show. I may end up exchanging. I still love the fire stick, but want it to work right", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "great!!!", "verified": true, "helpfulness": "0/0", "author": "Christine L. Davis \"aggbatt\""}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "angel cruz"}, {"rating": 5.0, "review": "Very easy to set up and use.  Perfect for older TV's that aren't \"smart\".", "verified": true, "helpfulness": "0/0", "author": "Mulligan Augustus"}, {"rating": 5.0, "review": "This is my second firestick.  Love the convenience.", "verified": true, "helpfulness": "0/1", "author": "ginny anderson"}, {"rating": 5.0, "review": "Love our Fire Stick. Fell in love with Bosch the 1st epiode. We're hooked :) Thanks Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "FLpeach22 \"Jody Brazelton\""}]