[{"rating": 3.0, "review": "The fire TV stick is extremely slow. Our network is fast and we have no issues, but a lot of times we have to wait while games, TV shows, movies, etc load. We also get kicked off a lot while viewing.The wireless controllers are also very costly. For a $40 steaming device, controllers for games that don't compare to Microsoft and Sony gaming consoles should not have controllers that are just as expensive.", "verified": true, "helpfulness": "0/1", "author": "Lynnegerde"}, {"rating": 3.0, "review": "It's pretty alright it just has a few problems", "verified": true, "helpfulness": "0/1", "author": "Sidney Edwards"}, {"rating": 4.0, "review": "I received the TV stick right when I expected to, and the setup was just as simple as it was made out to be (although I was a little surprised that it needed to be plugged in separately).  My only gripe is that while all Amazon Prime content plays flawlessly, and this might just be the app, but sometimes the video and audio don't sync up perfectly on the HBO GO app.  I never have this problem on my computer, though.", "verified": true, "helpfulness": "0/1", "author": "Jeremy Travis \"jeremytravis_2001\""}, {"rating": 5.0, "review": "I love the Fire it works great.", "verified": true, "helpfulness": "0/1", "author": "Dorothy A. Bisson"}, {"rating": 5.0, "review": "Love it, better than expectex", "verified": true, "helpfulness": "0/1", "author": "Paula Moore"}, {"rating": 5.0, "review": "So far it's great. Easy to install, and I haven't explored all the features.", "verified": true, "helpfulness": "0/1", "author": "BT"}, {"rating": 4.0, "review": "GOOD PRODUCT", "verified": true, "helpfulness": "0/1", "author": "Jp"}, {"rating": 4.0, "review": "The software for this stuck works but could have more options. It's very limited and if you don't remain a Prime member, then it's not a great option.", "verified": true, "helpfulness": "0/1", "author": "Avery Tidlund"}, {"rating": 5.0, "review": "Super easy to set up.  Watching free movies with my Amazon Prime account.  Yes, loving this!", "verified": true, "helpfulness": "0/1", "author": "Kelly Pothier"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "mikel"}]