[{"rating": 4.0, "review": "Very pleased with the Amazon fire stick. Stopped my cable and I don't even miss it.", "verified": true, "helpfulness": "0/0", "author": "mary santana"}, {"rating": 1.0, "review": "It was not at all what I wanted.  I will be returning it.  It would have been nice to have more details told to me on the phone, when I call asked questions.  I wanted to lower my TV bills not increase them.  I am very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Marlene Williams"}, {"rating": 2.0, "review": "Was not what I expected I thought it was for regular TV and it was not", "verified": true, "helpfulness": "0/0", "author": "Pearl  E. Clair"}, {"rating": 4.0, "review": "Nice, very nice.", "verified": true, "helpfulness": "0/0", "author": "DEBBIE \"DEBBIE D\""}, {"rating": 1.0, "review": "Can't get the Vudu Movies app, sad.", "verified": true, "helpfulness": "1/1", "author": "Randy M. Baker"}, {"rating": 5.0, "review": "Replaced my Roku with the fire stick and love it!!!  Wish I would have upgraded sooner!!", "verified": true, "helpfulness": "0/0", "author": "TLMNC"}, {"rating": 4.0, "review": "Enjoying this so far. I like having access to some of the shows I couldn't watch before. Though many are available on demand. Paying the one time cost is worth it, however if you already pay the crazy amounts for FiOS or other TV services keep in mind there will be yearly fees for Amazon Prime, Monthly fees for Netflix and whatever other services you will subscribe to.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works very well for Amazon services, and for Netflix. Doesn't work for HBOGO if your service provider is Comcast. Haven't got it to work for Spotify, though it's supposed to work. Each time turn on TV, have to unplug and plug in power cable to restart.", "verified": true, "helpfulness": "1/1", "author": "Clay G. Wescott"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "eric"}, {"rating": 1.0, "review": "I have a six month trial of Amazon Prime as a student so I was under the impression I would have the video services included. The fire TV stick does not give me Amazon Prime video.", "verified": false, "helpfulness": "0/0", "author": "brian keehner"}]