[{"rating": 1.0, "review": "Never Received.please cancel", "verified": true, "helpfulness": "0/3", "author": "luz"}, {"rating": 2.0, "review": "Amazon offered a great deal on the stick but I had too much of a problem trying to get it to connect to our home wi-fi.  We had not experienced any other problems with devices connecting, so I don't know what the issue was, but I tried several times and never could make the connection last.  Tried support and info from other users but no-go.  Bought Roku -- no connectivity problems whatsoever.", "verified": true, "helpfulness": "0/0", "author": "Woodlandslady"}, {"rating": 4.0, "review": "This works well.  My only complaint is the network connection goes down ever week or two.  Then I've got to unplug it from the power supply and plug it back in.  After that it works like a charm again.", "verified": true, "helpfulness": "0/0", "author": "The Park"}, {"rating": 5.0, "review": "Does more than I thought it would.  Great", "verified": true, "helpfulness": "0/0", "author": "John J bolebruch"}, {"rating": 5.0, "review": "Very quick and easy in install!", "verified": true, "helpfulness": "0/0", "author": "holalelog41"}, {"rating": 4.0, "review": "Fully filling my needs", "verified": true, "helpfulness": "0/0", "author": "sree"}, {"rating": 1.0, "review": "My experience with the Fire Stick has been awful.  It constantly shows the Blue Screen \"HDCP unauthorised\" (more that 50% of the times it's used).  Now that it's 45 days old, Amazon won't take it back.This has been the worst Amazon experience I've ever had.", "verified": true, "helpfulness": "0/1", "author": "Christopher M. Giese"}, {"rating": 4.0, "review": "I love the stick! I was a guilt away from getting the Apple Tv but I was happy that i didn't. I would give it a 5 star if it wasn't for the stick to black out? I dunno why it does that ever so frequently.Any advice about this issue I'm all ears. thanks", "verified": true, "helpfulness": "0/0", "author": "R. llamas \"Reydeoo\""}, {"rating": 5.0, "review": "It works so well we are getting a second.", "verified": true, "helpfulness": "0/0", "author": "Angela Simpson"}, {"rating": 5.0, "review": "Easy to use excellent product", "verified": true, "helpfulness": "0/0", "author": "Ernest Bannag"}]