[{"rating": 5.0, "review": "🔥", "verified": true, "helpfulness": "0/1", "author": "Spencer Hill"}, {"rating": 5.0, "review": "Works great!!! Easy to use!", "verified": true, "helpfulness": "0/1", "author": "Paul Mahaffey"}, {"rating": 5.0, "review": "I couldn't be happier with my Fire Stick. The interface is great, the navigation is much easier to use than the Apple TV, and the setup is far easier than any other competitor's device (I've set up a Chromecast, Apple TV, game consoles, etc.). The setup video is actually useful, too, which is nice (and rare). I downloaded the remote control app as well because I have a tendency to lose remotes, and it works great ... much better than the Apple remote app, which is basically useless. The Fire Stick has exceeded my expectations, the original programming is getting better and better (check out Catastrophe for a great comedy series), and the picture quality is fantastic. Well done, Amazon.", "verified": true, "helpfulness": "1/1", "author": "Jason R."}, {"rating": 5.0, "review": "Love it. Get the prime. It gives you so much more. Plus free shipping.", "verified": true, "helpfulness": "0/0", "author": "mark onan"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/1", "author": "J. Angel Saucedo Carrillo \"kitazo\""}, {"rating": 5.0, "review": "Amazing! We have an Xbox that we use to stream different programs but HBOGo does not stream properly making it impossible to watch. But the Fire Stick has solved this issue. Shows seem to load quicker on the stick rather than the Xbox.  It is super easy to set up and use.  My fiance set it up and watched the informational video that plays once you start use.  I did not watch this but easily figured out the remote and how to navigate around. Well worth the small investment!", "verified": true, "helpfulness": "0/0", "author": "D. Briede"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/1", "author": "Ricky Roberts"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Charles Miller"}, {"rating": 5.0, "review": "Love this item !  Easy to install , opens you up to great tv series and movies!  Much better then hbo and tv shows .  Get it !", "verified": true, "helpfulness": "0/0", "author": "susan romano"}, {"rating": 3.0, "review": "The Prime movies are not good.  Yea there are a few worth watching but most of them are old or movies I've never heard of.  There are a plethora of kid friendly things to watch.  This product is for anyone that doesn't have cable and subscribes to Hulu and Netflix...", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]