[{"rating": 5.0, "review": "FANTASTIC!!!!!  Gives you more of your money's worth for PRIME.  Works well,  but the best to be said about it is the CONTENT it allows you to access.  Watching this more and more for free movies and programs on prime and less ordering from directv ant $3-5 a shot.  Even if you don't have prime,  there is some free content for you and you can purchase movies at a reasonable price.  Instalation is just about plug and play and easy to operate with remote", "verified": true, "helpfulness": "0/0", "author": "Mark Bretschneider"}, {"rating": 5.0, "review": "I used to stick in my HDMI slot.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV Stick is great! I am technically challenged but was actually able to install all by myself, sign on and in, have been enjoying it more than I could have imagined. Still exploring all options with other subscriptions but use it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Emily Lee"}, {"rating": 5.0, "review": "So far we are loving it! I have Prime so that enables more features.There is a learning curve.It should INCLUDE an instruction booklet, in reasonably sized print.  There are features we haven't figured out yet. Seventy year old brains are not as\" in tune \" with today's terms or technology.", "verified": true, "helpfulness": "0/0", "author": "Mizmaven"}, {"rating": 5.0, "review": "Really enjoying the Fire Stick. A lot more options with Amazon Prime, but worth is when you purchase items from Amazon too. So many movies, games and shows available.  Like that it works with my WiFi easy set up too.", "verified": true, "helpfulness": "0/0", "author": "Raegan Weber"}, {"rating": 5.0, "review": "The Fire TV Stick is great! I have a non-smart tv in my upstairs bedroom and wanted a way to get media to it. This is the perfect accessory for doing just that. I love the smooth integration, between my Amazon Prime account and the interface of the software. It allows me to have another access point to my Amazon media, without having to spend a bunch of money on bulky equipment. When this is plugged in behind the TV, you have no idea that it is there. Would recommend this to people who have a Prime account.", "verified": true, "helpfulness": "0/0", "author": "dogpile"}, {"rating": 5.0, "review": "Arrived in a promptly matter. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Meriam Gardner"}, {"rating": 5.0, "review": "Enjoying it very much.  Easy to use.  Enjoy the movies and the music.  Wouldn't be without it.", "verified": true, "helpfulness": "0/0", "author": "Philter"}, {"rating": 5.0, "review": "Great alternative to monthly cable!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Morgan"}, {"rating": 5.0, "review": "I am very pleased.  It is working great.", "verified": true, "helpfulness": "0/0", "author": "Margie Kolby"}]