[{"rating": 5.0, "review": "Fabulous technology, works great", "verified": true, "helpfulness": "0/0", "author": "Mrs. Sarah \"Ms. Sarah\""}, {"rating": 4.0, "review": "Having just installed this in the last few days, I found this simple, compared to the Chromecast. It is unclear how much content I will find that I like, but it appears promising.", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Green \"High School Teacher\""}, {"rating": 4.0, "review": "You don't save five dollars because making it $34 takes it below the $35 for the free shipping. Add in the cost of shipping and you are back to the original price.", "verified": false, "helpfulness": "0/1", "author": "AndyD"}, {"rating": 5.0, "review": "Works pretty much as advertised! Had to re-boot the unit a few times now but other than that it works well.", "verified": true, "helpfulness": "0/0", "author": "Anthony N."}, {"rating": 5.0, "review": "Greatest invention ever!", "verified": true, "helpfulness": "0/0", "author": "Octavia J. Jones Sr."}, {"rating": 5.0, "review": "Why do I still pay for cable? It's great. The end.", "verified": true, "helpfulness": "0/0", "author": "Daren"}, {"rating": 4.0, "review": "Updating my review:  I am having a lot less problems with frequent resets than when I first received this.  I do not know if I am just more familiar with the item or if Amazon did some tweaking.  I have upgraded my review from 3 stars to 4 stars.  I really like this thing.  The only problem is that the center button on the controller is much too sensitive.  It is very frustrating when typing.  Otherwise, I would give it 5 stars.Needs to be reset too often.  Thanks to one of the reviewers who mentioned about a hard \"reset\" and how they he/she did it.  Otherwise this would have been a one star review.  If they fix this problem, I will rate it higher.", "verified": true, "helpfulness": "0/0", "author": "MzeeGlenn \"Mzee Wa Kazi\""}, {"rating": 4.0, "review": "Haven't had it long but it seems user friendly and nice options.  Going to try Amazon Prime since it appears a lot of the features require it.", "verified": true, "helpfulness": "0/0", "author": "Desaree Foster"}, {"rating": 5.0, "review": "Easy to install, took my time and still got it installed in under 10 min. Great picture and sound, if you have only over the air stations, this is a great addition. Changes a standard TV into a smart TV. I only use the FireTV Stick for SlingTV and Netflix right now, have not yet gone to Amazon Prime. But the streaming is great, my wife even uses the FireTV Stick.", "verified": true, "helpfulness": "0/0", "author": "James L. Hendrix \"Jim Hendrix\""}, {"rating": 5.0, "review": "the fire tv stick is the best video streaming device. I have other video streaming devices and they do not come close to the fire TV stick. I recommend the fire TV stick", "verified": true, "helpfulness": "0/0", "author": "albert gonzales"}]