[{"rating": 5.0, "review": "When Amazon first offered this at half-price for Prime members, I shrugged and said \"Meh.\"  Then my brother showed me his in operation.  No longer \"Meh,\" I ordered mine that day.  It arrived a good month ahead of schedule, too (kudos, Amazon!).  So, how does it perform?  The Fire TV Stick works *at least* as well as my AppleTV (both are playing through a Denon receiver on a Mitsubishi 65\" 1080p DLP), and it's great having access to my Prime Movies and TV Shows on the big screen in my TV room.  The video is HD and the sound is quality stereo.  So far I have observed no buffering, video, or sound quality defects.  If you're trying to decide between the Fire TV Stick and an AppleTV (at twice the price)... honestly, it may just come down to brand loyalty.  Both have Netflix and other general favorites, so it is a question of which company you've bought more videos from.  If you are starting out fresh, and aren't already heavily invested in Apple Store movies and TV shows, I'd recommend going with the Fire Stick.  It costs less than half what the AppleTV does, and the video quality is on par between the two.  Additionally, Amazon Prime offers a fair amount of free programming (which Apple does not).  And, because the Fire TV Stick is so affordably priced, I'm not even upset that I didn't get this when it was half price! (Ah, who am I kidding?  I'm going to be kicking myself over that for a while!)", "verified": true, "helpfulness": "4/4", "author": "S.M. O'Brien"}, {"rating": 5.0, "review": "what a great product.", "verified": true, "helpfulness": "0/0", "author": "Monique"}, {"rating": 5.0, "review": "Best thing since sliced bread! Super easy to set up, Makes my \"older\" TV just like the new ones. I love being able to watch Amazon Prime right on my televsion.", "verified": true, "helpfulness": "0/0", "author": "Jody"}, {"rating": 3.0, "review": "I REALLY wanted to LOVE this........... But but i've tried 3 times now and first when i tried to plug it in to the wall it said it was not enough power to run the stick.... really? Then when i got everything connected and my verizon fios connection said very good... My movies kept buffering then cutting out saying connection problems and then home screen is not available then it wants me to keep re-logging into my flixster account and restart whatever i was watching over and over again each time it cuts off.......... UGH.... I thought this would be the answer to my cable nightmare prayers. I wanted a box for each room then a prime subscription and finally... NO MORE CABLE. I guess it just wasn't meant to be.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Gregrory"}, {"rating": 1.0, "review": "Don't really work!! One time connect to wifi next time not.  Ask for pin then pin invalid.  Not sure fire tv stick event really work or event know what it doing.So disappointed.Waiting a lot of our time! To set up for not thing.", "verified": true, "helpfulness": "1/1", "author": "von Landry"}, {"rating": 1.0, "review": "The Fire TV Stick will not maintain a network connection thru an entire movie. Actually it stops and tells you \"connected but with problems\" and does not tell you what the problem is or how to fix it. Sometimes unplugging it and plugging back in to the power source fixes the problem sometimes it doesn't. The problem is not my wireless, because I can stream movies to the tv using three other devices without these problems.", "verified": true, "helpfulness": "14/15", "author": "David Patterson"}, {"rating": 4.0, "review": "So far I love the Fire TV stick. It was a quick and simple setup. I quickly began enjoying all the different programs available! The was a XMAS gift and it's just been great!!!!", "verified": true, "helpfulness": "0/0", "author": "Lydia L Christmas"}, {"rating": 5.0, "review": "The fire stick is really nice.  It has higher specs than the Google Chrome-Cast and comes with a remote which is key to people who don't have smartphones or just simply want a separate physical remote.  The price is very good only 4 dollars more than the Chrome-Cast and about 10 dollars less than the Roku stick.  The overall all construction and quality is very good and it performs quite well.  The one thing that I don't really like is that you have to use the power adapter that comes with it instead of just powering it by USB.  But it makes sense considering that you can play games on the Fire TV Stick and games usually require more power.  This is the best streaming stick you can currently buy considering specs and practicality.  Also it can be used by almost anyone (including kids and grandparents).  If you are a Google enthusiast I would recommend sticking with the Chrome-Cast considering that it has it's own unique features like mirroring your Android phone screen and casting from various sources like from your desktop or phone.  Overall, the Fire TV Stick is a great all-in-one media streaming package at a wonderful price.", "verified": true, "helpfulness": "0/0", "author": "Muhammad \"Muhammad Chamas\""}, {"rating": 5.0, "review": "Works great on my home network.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "I bought it for $19. Now My Samsung 32 inch old TV is a SmartTV. I use Netflix and Amazon Prime Instant Video. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "a"}]