[{"rating": 1.0, "review": "It work fine for a weekDuring the second week, it needed resetting oftenIn week 3, it broke down. he one tme I fgot it to working, it told me thatit was not capable of showing the version of Netflix we had been watchig.Since then, when we have received a picture, it has been the Firestick logo", "verified": true, "helpfulness": "0/0", "author": "Dennis Anderson"}, {"rating": 3.0, "review": "It is not as good as the Amazon Fire TV for $99 but it does the job. It stutters on startup and has to buffer several times when watching a movie where my Amazon Fire TV never does.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Pros: Small, well manufactured and packedCons: USB on TV cannot power on it. Thus, the size advantage is hugely discounted. Roku box isn't that big at all. I watch ESPN3 a lot and need to fast forward regularly, for instance skipping first 3 quarters of NBA and watch only the 4th quarter. Fire stick is terrible at this. Fast forward itself is extremely slow, devastatingly it cracks down ESPN3 more than 7 out of 10 and I had to start over again. I had Roku LT box and it worked like a charm in fast forwarding, no issue at all.", "verified": true, "helpfulness": "0/0", "author": "river_ice_boy"}, {"rating": 3.0, "review": "Works great now but it wasn't reading my internet for some reason. Had to call support. They have me put on the extender for some reason even though the wireless modem was  two feet away from it. Seems to be working okay now though. A little difficult to navigate I must say. however its the best one of its type for the price", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Super easy to use!", "verified": true, "helpfulness": "0/0", "author": "PAT A OLSON"}, {"rating": 5.0, "review": "I bought one of these, initially, when they first appeared and were only $19.99. Living alone, I only have two TVs in the house. Well, now that I have discovered what an incredible and very handy little toy this is, I HAD to order another for when the grandsons visit and we gather in the family room! I have NO REGRETS with this purchase!!! Love them both!", "verified": true, "helpfulness": "0/0", "author": "Marty P."}, {"rating": 4.0, "review": "This is a good device but there are few free options, like youtube,crackle,tubitv, I hope some day to see movies direct from ABC,NBC,PBS and etc", "verified": true, "helpfulness": "0/0", "author": "pedrow66"}, {"rating": 5.0, "review": "Makes travelling so much easier.", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 5.0, "review": "Very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "George B. Chu"}, {"rating": 5.0, "review": "so easy!! I love this.", "verified": true, "helpfulness": "0/0", "author": "staci kunesh"}]