[{"rating": 5.0, "review": "I love everything about it!!! Sooo worth the money!", "verified": true, "helpfulness": "0/0", "author": "Aprile"}, {"rating": 5.0, "review": "The second was perfect and so easy to install.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Richardson"}, {"rating": 5.0, "review": "God device", "verified": true, "helpfulness": "0/0", "author": "Rodolfo"}, {"rating": 5.0, "review": "So easy to set up and works very well!", "verified": true, "helpfulness": "0/0", "author": "Nedra Greenwood"}, {"rating": 5.0, "review": "Perfect for my son's room.  My son decided to get rid of his XBOX which is how he was watching TV.  We bought Amazon Fire TV a few months ago and dropped cable-we have NEVER been happier.  We get our local channels using an antenna that we purchased here as well and haven't paid for cable since.  We got this Fire TV Stick so my son could have TV and watch Amazon Prime, Hulu, Netflix, etc on his TV in his room.  it's perfect, he loves it and we love how easy it was to set up!! Don't hesitate!!  You need this!", "verified": true, "helpfulness": "0/0", "author": "Jana Thomas"}, {"rating": 3.0, "review": "I like the concept and so far the actual stick seems like a pretty solid device. The fire stick is easy to use. The setup was brain dead simple which was nice. There are a lot of options with all the games, movies, tv shows, etc. The negatives are that a lot of the tv shows and movies are Pay Per View meaning we have to pay to watch. Also, there was so much buffering that we cancelled it during our free trial.", "verified": false, "helpfulness": "0/0", "author": "Joseph Davis"}, {"rating": 1.0, "review": "Enjoyed the first fire stick while it worked.  I emailed customer service after it stopped working seeing a replacement.  They never contacted me back.  I am disappointed, because I felt that Amazon would be more responsive to one of their products which had simply stopped working.  We tried it on two different televisions and nothing.  I have ordered a new one, and the $35 isn't a big deal, but I just felt they should stand beside their product with a reasonable warranty/replacement.", "verified": true, "helpfulness": "0/0", "author": "yardman531"}, {"rating": 5.0, "review": "This is the best purchase I have ever made on Amazon.I watch Netflix a lot and this is much easier than fooling around with an HDMI cable from TV to Computer. You do need an HDMI port in your TV. I am only sad that It does not support internet browsing", "verified": true, "helpfulness": "0/0", "author": "Elisa Forestier"}, {"rating": 3.0, "review": "I was very upset with the quality of the sound it is worst than regular TV (programs vs. commercial) volume. The music, shootings and explosions are so loud it almost scares you into cardiac arrest then you have to keep lowering it to preserve your ear drums.OK after that ends the talking or whispering starts and it's so low you have to increase the volume again to hear what is being said. It is a frustrating cycle and it takes all the enjoyment out of the program. Also sound related words are muted for no reason during every program I have watched so far, you see lips move but no sound. What's up with that? I Know other people who have the Amazon Fire TV Stick and they have the same problem that I am having. So to me that is a very serious flaw that should get some immediate attention or risk losing some future sales from the all important word of mouth mill. What has happened to equal volume or moderate increases? I realize that there has to be dramatic fluctuations in sound, but lets be real it does not need to be so extreme that the consumer loses interest playing volume roulette. In my opinion the Stick at its current state of quality is not worth the forty dollars that it cost the customer. By the way I just completed my free month am unsure how long I will stay a customer although I do like the variety of choices compared to regular TV and DirecTV. In addition I don't think that we the consumer should have to turn our volume control to the max levels to hear the people speak there has to be a happy medium somehow. Could it be one of the reasons that so many people in this day and age are in need of hearing aids? Thanks", "verified": true, "helpfulness": "0/0", "author": "James Twardesky"}, {"rating": 5.0, "review": "The device is wonderfull.It's pretty fast and steady", "verified": true, "helpfulness": "0/0", "author": "Citibank"}]