[{"rating": 5.0, "review": "I really love it!.  Especially because there are minimum wires to be in the way.Picture quality is really good too! Lots of choices, games, apps!!!!", "verified": true, "helpfulness": "0/0", "author": "kwoods8"}, {"rating": 3.0, "review": "Appears to work well, but am having trouble with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jude"}, {"rating": 4.0, "review": "No offense but to hell with cable!", "verified": true, "helpfulness": "0/0", "author": "Avery Gillespie \"Craig G.\""}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Isa"}, {"rating": 5.0, "review": "Wow wonderful add prime with this never have to leave the house...", "verified": true, "helpfulness": "0/0", "author": "jan"}, {"rating": 2.0, "review": "Does not work. Constantly says internet not available. Yet under setting it says connected with very good signal. I can connect my lap top to the TV and watch movies with no problem so the issue isn't with the internet. Screen saver apps are the only thing that works", "verified": true, "helpfulness": "0/0", "author": "Donna C."}, {"rating": 5.0, "review": "Love Love Love it.  I use this for watching amazon prime and Netflix on my tv.  All you do is plug it in to one of the hdmi ports on the back of the tv and very easy instructions to follow to get it going.  All you need is wifi / internet connection.  Love it.  Much better and faster than ROKU that I had previously.", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 4.0, "review": "Ok it's odd but we decided to cancel our cable and purchase this Fire stick...and...ok.....it's  worth the $39 all day long. The remote isn't worth the roll of toilet paper in your bathroom (batteries die every week and/or its just disconnected) so down load the Amazon Fire TV remote app on your phone/tablet it's just as easy and actually more reliable. I've found so many great shows (alpha house etc) miniseries(John Adams) ,and movies and everything in between I cannot believe I ever paid $100 /mo for cable ....Amazon does it again....just fix the damn remote.", "verified": true, "helpfulness": "0/0", "author": "K.lav"}, {"rating": 5.0, "review": "I love the Amazon videos like Bosch. Much easier to use than other content sticks.", "verified": true, "helpfulness": "0/0", "author": "Barry L. Rubinson"}, {"rating": 1.0, "review": "The item does not work. I returned and got a new one 3 times....I just bought a new 2,000$ TV and it won't work. I upgraded my internet, I called customer service, I updated my tv, I did everything they told me. This product is the worst thing I have ever bought.Amazon pulled Amazon prime app from every TV and device forcing people to buy this stick that does not even work....Amazon prime you to be amazing and something I would brag about, now it just feels like a scam.", "verified": true, "helpfulness": "0/3", "author": "NM"}]