[{"rating": 4.0, "review": "Works really well. Intuitive to use.", "verified": true, "helpfulness": "0/0", "author": "Clover"}, {"rating": 3.0, "review": "It is not \"Just plug and Play\", you have to power the plug in stick...Doesn't do much better than my DVD player did.... oh well, I bought it on the Anniversary sale, could be worse...I would not buy again.", "verified": true, "helpfulness": "0/0", "author": "Attilla"}, {"rating": 3.0, "review": "It works amazingly well.  It's sort of an Apple TV minus a lot of features.The big problem is that if you have an Apple Time Capsule, no matter what you set the TC to, WAP WAP2, Open SSID, the FireStick refuses to connect to it.  Is shows both the b and g bands as strong.  Open networking it won't connect.  So I added a password and created a guest account on the Time Capsule.  This time it asked for the password but would still not connect.I  have a DLink wireless router in my basement and it connects fine to that.  The problem is that the Dlink is on the DMZ of the Firewall so it can't see my internal network. My iPhone is connected to the Time Capsule so the Fire TV app is totally useless.So if you have a Time Capsule, it simply won't work.  I've tried every permutation imaginable, including overriding the IP, DNS and GateWay functions in the FireStick but no joy on the TIme Capsule.  The problem is that the TV is on the 2nd floor and the Dlink is in the basement so I get week signal and also makes the FireTV app on the iPhone totally a brick.", "verified": true, "helpfulness": "0/0", "author": "TB-10 Pilot \"George\""}, {"rating": 5.0, "review": "Super easy to hook up and the picture quality is fantastic. It will be used for outside movie viewing and indoor viewing as well. Great selection of movies and TV shows to choose from. I love the video on how to use it, very helpful. Remote control is straight forward and easy to use. So glad I finally bought this product.", "verified": true, "helpfulness": "0/0", "author": "michele tater \"Michele Tater\""}, {"rating": 5.0, "review": "When this device works, it's so much fun! The only downside that I have seen (which has nothing to do with the Fire Stick itself - hence the 5 stars) is that when your internet is slow, there is a lot of buffering. I have not had to pay for cable in many years because I am a Netflix addict but having this device has brought my TV watching to a whole new level! I can now stream Netflix, and Amazon videos as well as many other streaming options (YouTube, Pandora) from the comfort of ANY TV thanks to the portable Stick.", "verified": true, "helpfulness": "0/0", "author": "Taylor Klar"}, {"rating": 4.0, "review": "Still learning how to use it.  Pleased with what it does.  We are planning a trip to Ireland, and many of the documentaries, or Irish themed movies are one way to prepare for the change in culture. It seems that when I add \"free with Prime\" movies, shows, documentaries to my watch list, within a week there is a fee to watch them.  I suppose what is free and what is only for purchase or rent changes, but when that happened it was a disappointment to me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product!! Met all of my needs!!", "verified": true, "helpfulness": "0/0", "author": "Charles Jayme"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Rose Katterson"}, {"rating": 4.0, "review": "Awesome, no complaints other than not being able to stream from your computer.", "verified": true, "helpfulness": "0/0", "author": "Anthony J Sacco"}, {"rating": 5.0, "review": "Love the firestick, it's so easy to use and love watching all the different shows on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Gina"}]