[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "simone"}, {"rating": 5.0, "review": "It has really made using amazon prime and Netflix easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fabulous!", "verified": true, "helpfulness": "0/0", "author": "bonnie"}, {"rating": 4.0, "review": "Very easy to set up and use.  Works great", "verified": true, "helpfulness": "0/0", "author": "Laurie Guza"}, {"rating": 5.0, "review": "Great little streaming stick. If I wasn't already so wrapped up in Google's world of their OS I'd likely ditch my chromecast and use this full time.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 1.0, "review": "Does not perform well. Will not mirror my tablet. Customer support is useless. Will probably send back.", "verified": true, "helpfulness": "0/1", "author": "dave petersen"}, {"rating": 5.0, "review": "Grrrrreat", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 5.0, "review": "Works as advertised.  Better than an external box.", "verified": true, "helpfulness": "0/0", "author": "Fbill1"}, {"rating": 3.0, "review": "Works well when it works. Freezes up from time to tine.  Unplug and restart.", "verified": true, "helpfulness": "0/0", "author": "Stan Lewandowski"}, {"rating": 5.0, "review": "10 stars for me. I'm cutting cable as soon as this months subscription runs out. I already have a smart TV with lots of apps, but this was what I needed. All my Amazon Prime videos and music in one place. SlingTV...LOVE IT!Plus tons of other apps that my TV doesn't have. And interestingly, far better picture quality than I EVER got with cable's scrambled, descrambled, downgraded resolution. My TV is performing like it was meant to.The FTVS was easy to set up and everything worked right off the bat. The remote looks like it doesn't do much, but it works great! I didn't mind the onscreen keyboard. It's much better than my Sony equipment and is faster to input too.The apps are easy to use, and the interface is much better than my Sony stuff as well. Easy to read, easy to see your choices.I'm in love with TV again. Bye, bye cable. I not even tempted to look back.So far, so GREAT!", "verified": true, "helpfulness": "0/0", "author": "wrknnwf \"wrknnwf\""}]