[{"rating": 5.0, "review": "Great product,  makes my no smart tv a smart tv...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What an easy to install piece of technology. I can't wait till Amazon starts streaming current shows!", "verified": true, "helpfulness": "0/0", "author": "Mary Ann Galvin"}, {"rating": 4.0, "review": "Overall this is a wonderful product that works as advertised straight from the box. Setup is easy. However, there are two big design flaws that require documenting.1. Terrible remote battery latch/slide.As a woman with a muscle disability, I couldn't pry the back of the remote off to get the batteries in - not even with a knife! In fact, I ended up having to wait 24 hours for someone to help me get it off with a tiny screwdriver. At first, I chalked this up to a personal problem but I googled and see that even physically healthy adults are reporting problems with this.2. Short power cable.The power cable from the stick to the outlet is only about two-three feet, which is troublesome on my wall mounted TV. If it was any higher I would have had to buy a replacement cord.Since setup, however, I have enjoyed watching a number of streaming services on the Fire Stick. It's still a wonderful product, it could just use some better physical design.", "verified": true, "helpfulness": "0/0", "author": "Tori Morris"}, {"rating": 5.0, "review": "I like it very much. Works great!", "verified": true, "helpfulness": "0/0", "author": "Patti Guidry"}, {"rating": 3.0, "review": "I liked the RUKU BETTER! Easier to follow guide and more free channels! Remote was bigger but it didn't get stuckike the firestick remote did! Firestick was all hype!  Get the RUKU!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Kwon"}, {"rating": 4.0, "review": "Shipped fast, works great!", "verified": true, "helpfulness": "0/0", "author": "G-XIII"}, {"rating": 1.0, "review": "I ordered this and could not get it programmed as the menu went only so far and would not continue. A call to Amazon resulted in several attempts but the agent admitted they are having a lot of issues with this product. They promised to call back in 48hrs but, of course, never did. I sent it back and will wait until the glitches are ironed out and maybe, try it again.", "verified": true, "helpfulness": "2/2", "author": "Kathleen Gross"}, {"rating": 5.0, "review": "I loved the FireTV, so I knew I would most likely like the stick. As expected it works perfectly and connects to pled, which is why I bought the FireTV in the first place. Far exceeds the AppleTV", "verified": true, "helpfulness": "0/0", "author": "Programgod \"Eric Haensgen\""}, {"rating": 5.0, "review": "Awesome! Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Shamma Shakila Rahman"}, {"rating": 5.0, "review": "This product works great for me. I was skeptical about getting it because I read some reviews of poor internet connections, and my WIFI isn't the strongest and it works just fine!", "verified": true, "helpfulness": "0/0", "author": "Kendra Biel"}]