[{"rating": 5.0, "review": "excellent product that is easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Knaus"}, {"rating": 5.0, "review": "awesome", "verified": false, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "I love it. Its the best", "verified": true, "helpfulness": "0/0", "author": "Suarez"}, {"rating": 5.0, "review": "I love it, easy to install, easy to use, but you won't get the full use out of it if you don't have an Amazon Prime membership. But if you do it's great. And very mobile. *****", "verified": true, "helpfulness": "0/0", "author": "Mary L Dunne"}, {"rating": 4.0, "review": "Just gave up satellite tv and opted to start with the fire stick since I'm already a prime member. Streaming is so easy and there is a good selection of shows. Could use more movies but I would imagine it will come with time. The Netflix and Pandora downloads made this even better! Love it so far.", "verified": true, "helpfulness": "0/0", "author": "Peck"}, {"rating": 5.0, "review": "Every bit of what was advertised and more!", "verified": true, "helpfulness": "0/0", "author": "DID IT!!! \"DID IT!\""}, {"rating": 5.0, "review": "The only thing that can make this install hard is if you don't have your router password.  If you have that, it takes just a few minutes to get working. One other thing, the remote works great! Better than my TV or DVD remotes. The Fire TV works better than the Fire Stick. The Fire TV has voice command to search for shows, the Stick needs you to manually enter your search with awkward keyboard on TV screen.  It works, just slower.I like this product, and have recommended it to friends and relatives. Amazon, this is a winner. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Reamo \"getalonglittledoggie\""}, {"rating": 5.0, "review": "Great tool for enhancing our viewing pleasures!", "verified": true, "helpfulness": "0/0", "author": "Debra Shrader \"teach2play\""}, {"rating": 4.0, "review": "Better navigation than AppleTV although is a little slow and jolly when going through the menus", "verified": true, "helpfulness": "0/0", "author": "Rupert Simonian"}, {"rating": 1.0, "review": "I don't normally write reviews but I will on this one. This product is very disappointing. Number 1 you must use a wall plug to plug it in, therefore if your TV is hanging on the wall and all of your wiring is hidden you still have a lovely black cord coming down to your power receptacle to run that stick. It makes absolutely no sense. Moving on to picture quality. It's absolutely terrible. As you're streaming Netflix you have the most beautiful crystal clear picture you could imagine, then slowly but surely the picture will start to turn to fuzz to the point where you think there is something wrong with your eyesight. The picture comes back clear, and turns back to fuzz again. It's a continuous loop of clarity and fuzz.. I used it 3 times and moved into our master bedroom, I can't take watching TV on this device. I thought I'd keep it and maybe on a sick day when I'm laid up in bed it would work for me because my eyesight at that point wouldn't matter.", "verified": true, "helpfulness": "0/0", "author": "Christopher A."}]