[{"rating": 4.0, "review": "Great, wish it had some of the same apps as the Roku.  But it serves its purpose.", "verified": true, "helpfulness": "0/0", "author": "nlharris"}, {"rating": 4.0, "review": "when it worked it was great but I am too far away from wifi so I had to return to Amazon.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "The Fire TV Stick has works very well for streaming Prime Video and Netflix. However, the Hulu app for the Fire TV Stick is just awful. It freezes constantly, and the video often goes black while audio playback continues. I have given up on using this for steaming Hulu, which is unfortunate, since that was one of the main reasons that I purchased this device. The Fire TV Stick also has less content available than other devices like the Roku, which I use for another TV in the house. However, keep in mind that the Fire TV Stick is slightly cheaper, so that is also a consideration.I would gladly revise this review at a later date if the Hulu app becomes workable and/or more content becomes available. It's not a bad product, but could have been a lot better.Updated  7.24.15Well, I'm not sure what happened, but I tried using Hulu again recently and it worked flawlessly. That and the addition of additional apps (especially HBO Go and Starz Play) turn this in to a 5-star product for me.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Ok so I officially cut the cable cord thanks to this handy little device. I love it and recommend it to everyone! Best investment ever I will save a ton  of money. I currently have sling tv, netflix, and amazon prime subscriptions. I will only be ordering sling during football season. Comcast Beware!", "verified": true, "helpfulness": "0/0", "author": "AMabes"}, {"rating": 4.0, "review": "It works great and is user friendly, but my Century Link internet service is way too slow for streaming. We will be changing to Charter in March. It looks like a tremendous deal for us! You are offering no commercials, tv shows we have missed and new shows, and movies. Great deal, thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "A. Blacksten-plantz"}, {"rating": 4.0, "review": "Have an Apple TV, and this is comparable, took a long time to ship though.", "verified": true, "helpfulness": "0/1", "author": "jeanne obrian"}, {"rating": 5.0, "review": "ATTENTION ATTENTION NOW HEAR THIS SO EASY TO SET UP AND USE,WE ARE LOVING ITBUY IT BUY IT BUY ITTHATS ALL FOLKS", "verified": true, "helpfulness": "0/0", "author": "michael a williams"}, {"rating": 5.0, "review": "So far, very impressed.  Already have Apple TV, picked this up so I could stream with my prime account.  Actually prefer the interface, and the picture quality is right up there with a full size box.  Have not used Fire TV, don't know how they compare.  Will probably start using this more... and use the other one just for HBO Go and streaming from my iOS devices.", "verified": true, "helpfulness": "0/0", "author": "N. J. Maglio"}, {"rating": 4.0, "review": "Easy to set-up.  It locks-up sporadically.  Otherwise, happy with the purchase of the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Keith Walter"}, {"rating": 5.0, "review": "the unit is very nice.", "verified": true, "helpfulness": "0/0", "author": "jeremy"}]