[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Celina Micale"}, {"rating": 5.0, "review": "Excellent. Put more church channels.", "verified": true, "helpfulness": "0/0", "author": "ruth"}, {"rating": 4.0, "review": "bit challenging for me to get started  need to study the video instruction more closely. Haven't tried using voice command yet.Enjoy the variety of material available.", "verified": true, "helpfulness": "0/0", "author": "steven burger"}, {"rating": 5.0, "review": "Product .came quickly. Directions clear. In operation immediately.", "verified": true, "helpfulness": "0/0", "author": "Miriam Hogle"}, {"rating": 1.0, "review": "WiFi must be EXCELLENT for this to work. Ours was at 84% and programming just kept skipping and stalling.", "verified": true, "helpfulness": "0/0", "author": "Heidi Coleman"}, {"rating": 3.0, "review": "This wasn't exactly what I expected. I was under the impression that you could download apps for different TV channels and as long as you had log-ins you could watch TV. This isn't the case as basically every channel doesn't have an app that works with Fire tv stick. There are apps that work for Kindle, but not Fire tv stick. It loses internet connectivity pretty frequently even though my wireless router is sitting right next to it. Hulu Plus works great on it and that's mainly what i use.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "If you are wanting to \"cut the cord\" from your local television provider, this is the best product on the market for you.  Even if you get the Fire TV box, you get the best streaming entertainment, and I would highly recommend it for anyone who wants to watch Sling TV, Netflix, Hulu Plus, etc.", "verified": true, "helpfulness": "0/0", "author": "Kevin R."}, {"rating": 5.0, "review": "Haven't explored all functions but works great to get prime and Netflix on tv in bedroom", "verified": true, "helpfulness": "0/0", "author": "shaun wismer"}, {"rating": 5.0, "review": "Makes ANY TV with HDMI instantly a Smart TV !", "verified": true, "helpfulness": "0/0", "author": "law"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kasey bojo"}]