[{"rating": 5.0, "review": "works great  better than apple", "verified": true, "helpfulness": "0/0", "author": "Ben Seckman"}, {"rating": 5.0, "review": "Very easy to use. I love the Amazon original series.", "verified": true, "helpfulness": "0/0", "author": "Michele H."}, {"rating": 5.0, "review": "This turned our regular TV into a smart TV.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "NYgirl"}, {"rating": 5.0, "review": "Background: I purchased this to replace a Google Chromecast on the living room television (if it works out, I'll do the same with bedroom tv). Primary entertainment channels in use are Netflix, Youtube, Amazon Prime, Hulu, Spotify, and Pandora on laptop, Kindle Fire 7 and Galaxy S5. The Chromecast was great, but impossibly slow and lagging trying to 'throw' from laptop browser and I never consistently got Kindle to work with it. From the GS5 it worked awesome, but I wanted to be able to access everything without having to HDMI laptop to tvSetup for the Fire TV Stick is super easy, but I did have to reset and restart twice to get it on my non-broadcasting home network. Since then I have had sporadic issues with it dropping the network connection. Both are recurring issues for people if you look at the forums. Not necessarily a deal breaker, but VERY frustrating and annoying. I'm in the midst of replacing my Netgear router with a more powerful, newer model and hopeful that will correct that issue for me. If not, I'll be contacting customer service.Using the device couldn't be easier. While you can mirror to it or link from Kindle or Phone (i.e. within Youtube), I'm not finding that typically is not necessary. Pulling up the interface and accessing direct is quick and straightforward. With your service's accounts setup (Netflix, Pandora, etc) once, you don't have to login each time, just access the app and you're good to start something new or pick up something in progress from wherever you left off.Whether it is the right device for you vs. others like Chomecast or Roku will depend on the devices and services you use. If you're an Amazon Prime and/or Kindle user (regardless of other services), then in my opinion this is a logical and hugely beneficial add and let's you tie and navigate through your ALL your entertainment on ALL your devices nicely.Update 05/26/15First, I did continue to have the dropped connection issue even after replacing router. Contacted customer service and ended up replacing the unit. All good since then (fingers crossed)Second, love it so much, I installed a second one on the bedroom TV and will likely add a third before I'm done. It's just great!", "verified": true, "helpfulness": "0/0", "author": "azjmw"}, {"rating": 5.0, "review": "Reasons to purchase this product:1. You want an inexpensive way to enjoy some great TV without the high cost of cable. (I got the Fire Stick free) because I purchased 3 months of Sling TV-another product that offers live, yes live TV for only $20 per month. Check them out too!!)--Yes, you can download the Sling TV app to your Fire TV stick!!2. Connects with my Amazon account.3. I can access my Prime Music, photos all from this fantastic Fire Stick4. If you purchase it for $39 that's the one time flat price. No more monthly cable bills!To get the full pleasure of this device, go ahead and purchase the Prime membership, it is well worth the price. You will have to have subscriptions to Netflix, HuluPlus, and other subscribers to enjoy all the benefits of the FireStick. Those memberships are under $10 a month.Goes without saying, you must have wifi in your home/office also.The picture clarity and sound is much better than what comes from my Roku boxes (I have Roku also on 2 of my TVs in my home)You'll love this product. Come on, give it a try!", "verified": true, "helpfulness": "0/0", "author": "N. E. Haymon"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Flores"}, {"rating": 4.0, "review": "Love the fire stick especially for the price. If you are a prime member this is the best thing to use to watch your prime videos from. The best part you can tuck it away behind the TV no wire mess. The only reason for no 5 star rating is because no shut off button.", "verified": true, "helpfulness": "0/0", "author": "Alex R."}, {"rating": 1.0, "review": "Tv stick heat ip froze and was not able to user it anymore, only days after purchase. Well be returning it this weekend.", "verified": true, "helpfulness": "0/0", "author": "Erika"}, {"rating": 3.0, "review": "This is the best streaming device I have used.  I have a Roku 2, Google Chromecast, and Panasonic Blu-Ray Player.  This sticks feels more capable than my Chromecast and just as powerful (if not more so) than my Roku 2, which is not a stick but the actual box.  Also, it is so much faster than my blu ray player at loading Netflix.The UI on this is my favorite of all my devices, but that is more about personal preference.UPDATE:  While I still think this is a wonderful device, it had issues holding the wifi signal in my home.  It was in the same room as the router.  The Roku upstairs (a floor away from the router) has no trouble hoding the signal and the Chromecast has never had an issue.It's possible mine was just defective or that my internet was having issues, but I upgraded to the FireTV box because I can connect ethernet.  If you can get this device to work for you, it is great.  It would probably work best with internet that is 10Mbps and above.", "verified": true, "helpfulness": "0/0", "author": "Ehud"}, {"rating": 5.0, "review": "Well satisfied with it, Thought I'd be able to to pull in more t.v. stations but  along with getting Hulu Plus it works great..  Could come with alittle more directions tho. Would highly recommend it. :)", "verified": true, "helpfulness": "0/0", "author": "Karen"}]