[{"rating": 4.0, "review": "Love it.  Much better interface than the roku.  I get full HD with this and better sound quality.  My only complaint is the limited availability of some apps. I really miss fx now.  The fire stick is the only platform that does not have it. Even google chrome and Apple TV have all the apps. So if your listening Amazon that's the reason I didn't give it five stars.", "verified": true, "helpfulness": "0/0", "author": "Psfeger"}, {"rating": 5.0, "review": "What a piece of cake to install and use! I received the Fire Stick last night (right after I set up our Wi-Fi) and had it up and running in no time. We watched a couple of programs today and will enjoy more as we learn what programs are available. I did order the speech-enabled remote control, and it works great, and it's easy to switch from our Dish programming to the Amazon menu. The only issue I had was that the cable provided was not very long, so I did have to run out and get a surge protector--not a big deal. We are looking forward to using this regularly.", "verified": true, "helpfulness": "0/0", "author": "David Bookman \"Sir Readsalot\""}, {"rating": 5.0, "review": "This thing is great!I have had a prime account for years but never took advantage of the videos included.  I bought one of these and literally within a few minutes, I had it installed and was watching Justified!  In addition, it is so easy to install that I take it with me when I travel and use it on hotel TV's.  I leave the remote at home and use the (slightly clunky) iPhone App to control it when I am on the road.This is a great value!", "verified": true, "helpfulness": "0/0", "author": "R. H. Barnes"}, {"rating": 5.0, "review": "easy to install", "verified": true, "helpfulness": "0/0", "author": "Brenda Melton"}, {"rating": 5.0, "review": "Working great", "verified": true, "helpfulness": "0/0", "author": "lee guardiola"}, {"rating": 5.0, "review": "Easy setup and easy to use works great", "verified": true, "helpfulness": "0/0", "author": "Wayne sieve"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Licamerc"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Me and my kids LOVE this!!!!", "verified": true, "helpfulness": "0/0", "author": "Kierra Ashby"}, {"rating": 5.0, "review": "Best device ever", "verified": true, "helpfulness": "0/0", "author": "Chelsea Walker"}]