[{"rating": 5.0, "review": "LOVE the remote control. I found pausing, rewinding, etc. very frustrating with Chromecast, but this eliminates that frustration.", "verified": true, "helpfulness": "0/0", "author": "Track Eye"}, {"rating": 5.0, "review": "I got in the on 1/2 price Prime member presale and since it has arrived and I've gotten to use it a bit, my only regret is not buying a couple of them. This makes using the myriad of online TV viewing resources almost as easy as simply watching TV", "verified": true, "helpfulness": "0/0", "author": "Lonewolf"}, {"rating": 3.0, "review": "The picture doesn't make it clear that the stick needs to be connected to a power supply.  Plus, it feels poorly made (very light). While it works fine, it isn't particularly fast.  If you use Amazon Prime on a big TV (vs an App) it is a good deal.Btw - I still don't unders why Amazon won't let you delete videos from your list after you have watched them.", "verified": true, "helpfulness": "0/0", "author": "Happy Billmore"}, {"rating": 5.0, "review": "This is a very cool device. Extremely easy set-up. Very intuitive. Great functionally. I particularly like being able to view photo that are saved on the Amazon cloud drive. The Fire TV Stick was a good deal and I'm quite pleased.", "verified": true, "helpfulness": "0/0", "author": "Inside Job"}, {"rating": 2.0, "review": "Purchased this as it was a promotion item.If you have a smart TV you don't need it.Easy to configure but not easy with remote controller. (might be defective controller)You will need to pay most of the content if you're not a prime member.Was thinking to use it to watch news on my monitor but not much news selections.I don't like it because not much free content.", "verified": true, "helpfulness": "0/1", "author": "H. Shui"}, {"rating": 1.0, "review": "Very disappointed - it won't register(connect) with my Amazon account. Customer service/support has been worthless --- going to return it. They keep telling me to go change things in the properties, but you have to be able to finish the registration process to get to the properties.  When I try to complete registration, by logging into my amazon account, it tells me that there is a problem with my user name or password.  Piece of garbage.", "verified": true, "helpfulness": "1/1", "author": "Brandon M"}, {"rating": 5.0, "review": "Had to order from Best Buy and it arrived yesterday.  I was concerned that the upstairs TV might be out of the range of my router which is in the basement.  In fact I was able to get some very helpful suggestions on line to resolve the problem if that were the case.  As it turned out, this little device works great and connected to my Netgear 300N perfectly.  I already have Amazon prime and Netlex accounts and all I had to do was enter the password.  The buttons on the remote are easy to use.  Easy hook up.  This is a great device and I can see why there has been a delay in ordering them.  I noticed recently that even Best Buy was on back order.  It is worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Pat Shannon"}, {"rating": 4.0, "review": "Can be little difficult to setup, but once you get hang of using it remote it be a breeze. It have more games than the roku.", "verified": true, "helpfulness": "0/0", "author": "cdm"}, {"rating": 5.0, "review": "By far better than any other type of Internet TV.", "verified": true, "helpfulness": "0/0", "author": "Tactical Keychains"}, {"rating": 5.0, "review": "WAY better than the Apple TV. The UI is snappy, the video library is excellent thanks to our Prime subscription. And I love that I can load normal Android apps on it. The only thing I dislike is the lack of native support for local media, such as the Plex server. But obviously the Plex app is available.", "verified": true, "helpfulness": "0/0", "author": "B. Doctor"}]