[{"rating": 5.0, "review": "Haven't had any deal breaking problems with it, installation & menue use are easy", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 2.0, "review": "Pros:Good compatibility and support for streaming appsController is not IR so you don't have to aim itCan run lightweight apps nativelyCons:Only supports miracast for display mirroringPoor memory optimizationCosts more than chromecastReview:I bought this when it was $19 on preorder, so I think that my purchase was worth it. It can use most streaming apps, so as a streaming player it doesn't really lose out to other devices such as the chromecast or roku. It can even run lightweight apps on its own; I've been playing Fibbage with my friends on the TV and it is a load of fun. However, there is a problem with memory. The device doesn't have a large amount of ram, so after using it for a few hours, it noticeably slows down, even if all apps are closed. I don't know if this can be fixed in the future with a software update, but its something to keep in mind.The largest problem with this device, and mainly why I feel its not a compelling value is the fact that it can't mirror my display the same way which chromecast does. Online videos are not only limited to amazon prime, netflix and youtube; the lack of display mirroring functionality reduces the Fire TV stick's value by a lot in relation to the chromecast. At 5 dollars more, I can't think of a reason that it's a compelling value. Unless you really feel that running native apps adds a lot more value for you, I'd recommend the chromecast over this.", "verified": true, "helpfulness": "1/1", "author": "Kelvin Lin"}, {"rating": 5.0, "review": "Love it.  Great HD Quality. Very easy to use. It works with other remotes work with out issues. also works great with Iphone, Ipad and Kindle", "verified": true, "helpfulness": "0/0", "author": "Chad Fowler"}, {"rating": 5.0, "review": "Pros:The UI is smooth like the regular Fire TV.Compact.Best UI and apps of all the streaming sticks on the market.Cons:USB power from our TV is insufficient for full functionality according to the stick. It works, but we got a warning message.Not all FireTV apps will be available on the stick right away. Currently HBo Go is on the Fire TV, but not the stick.Could use a little more storage than it has for apps.The UI is super intuitive and smooth and the apps are top notch. Roku will have a little more streaming content than this, but using the Fire TV stick is far more pleasant. The games available on the FireTV platform are leaps and bounds better than Roku and the rest of the content will likely arrive on FireTV in time.Warning, if you are a Comcast customer you will be blocked from HBO Go when it comes to the stick in the near future as of the time of this writing. They haven't successfully extorted Amazon yet for access to content you're already paying Comcast for access to. I doubt this will be true forever, and especially not when HBO gets their stand alone service up and running, but for now...", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 2.0, "review": "I wanted to love this, but the idea of using wifi for streaming this type of thing is bad.  I have 105 Mbps internet at home and my TV is pretty close to my wireless N router, but I can't stream anything without it pausing every minute or so to buffer.  I ended up returning it.Too bad.  It was a nice idea but it will have to wait for a wired solution.", "verified": true, "helpfulness": "4/4", "author": "G. Farnsworth"}, {"rating": 5.0, "review": "Love this device for it's quality, features and the price I got it for. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Harry T. Joseph"}, {"rating": 5.0, "review": "I purchased this for only $19 during a Prime members only sale. It was kind of a spur of the moment purchase. I'm so glad I did!  I love having easy access to Amazon Prime Video, Netflix, YouTube, and Hulu. My family especially loves accessing our Amazon music onour TV. My only complaint is that we can't add more Prime music via the Fire Stick (have to do that on a computer or smartphone).  Otherwise, I love it...it's fast, easy to use, and super convenient.", "verified": true, "helpfulness": "0/0", "author": "Michelle Cobb"}, {"rating": 5.0, "review": "Love it! Easy to set up, operate and love that it just sticks into HDMI on TV... hidden from sight. Also, it is easy to pack for travel.", "verified": true, "helpfulness": "0/0", "author": "SS"}, {"rating": 3.0, "review": "First, let me state I am a prime member and love it. My wife and I are trying to get our household set up as \"smart\" as we can. Our next tv purchase will be a smart tv but until then we decided to try both roku and the new Fire stick. I would love to say that we'll be going with amazon but I can't, at least not now. So far using netflix has been so much slower with the Fire stick and with roku there is no delay with the same wifi. If Amazon can fix the slow and frequent buffering issue we might change our mind.", "verified": true, "helpfulness": "2/2", "author": "Drew Anderson"}, {"rating": 4.0, "review": "Opening the remote's battery compartment was quite a struggle.  Hopefully don't have to do it for some time.The Android remote app doesn't work ... yet.  Maybe I need to turn on MulticastingAble to fit the stick on the TV's HDMI port with the extension cable provided, nice!Wish I didn't have to sit through the \"Help\" video on first install.SEARCH is your friend when finding your fav show/movie.Streaming quality is good.", "verified": true, "helpfulness": "0/0", "author": "MT \"MT\""}]