[{"rating": 5.0, "review": "I have a Google ChromeCast and now I have the new FireTV Stick as well and it's really awesome. I have both because I look at it like a venn diagram - both do a lot of similar things, but both have things that the other won't do as well.So far the pluses are:1) Much quicker and smoother performance.2) Add-on apps (Spotify, as an example) make the experience even better.3) Amazon Prime content is native to it (of course) - which means, no more do I have to do the janky workaround to get it to play through the ChromeCast - that alone is worth it to me.Cons...The only thing I've come across so far is that the Spotify app does not allow you to just log in and access your content - so most likely other add-on apps will have some similar experience shortcomings. With Spotify, as an example, you have to play the content from your phone or tablet and \"fling\" it to the tv. Not a big deal.. but a fully integrated app would be a better UX (user experience).", "verified": true, "helpfulness": "0/0", "author": "Marc Cyr"}, {"rating": 5.0, "review": "Love this this stick. Very simple to hook up , set up instructions are very helpful. Amazon has a hit here with this product....I did  the pre order deal and got it for $19. I hooked it up on the back of my Yamaha surround receiver that has 4 HDMI inputs. Works well for me that way as my TV does not have any HDMI inputs. I will now sell my Roku and quit using my Blue ray player to stream. Highly recommend purchasing this product .", "verified": true, "helpfulness": "0/0", "author": "J. F. Vogel \"Road Runner\""}, {"rating": 5.0, "review": "I have AppleTV which I love but this is absolutely on par in every way. If you are an amazon lover and Prime user, you will NOT be disappointed. My friend has the Google ChromeCast. Don't even think about getting that compared to this. All your apps are in the stick, not driven by another device. Great stuff!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I took advantage of the Prime sale when the Fire TV Stick was first announced. I received my two units today. I'm extremely impressed with this product. Set-up was incredibly easy. Using the included remote is good, but the Android app is amazing. Streaming quality is terrific, selection is very good, and being able to view pictures and videos from the Amazon Cloud is just a great extra. I'm very impressed.", "verified": true, "helpfulness": "0/0", "author": "David Martella"}, {"rating": 5.0, "review": "Love it,  this little stick has it all. I only had it for a few hours and I am loving it.  The whole family is loving It.  Now my better half can watch her show by clicking a link on the kindle instead of having to hook up the kindle to the TV, given this is not a trivial task but it is for some people.I can listen to a Greek Radio station using  tunin radio, I can stream content from my kindle fire, I can watch history channel, my son can play games.  It is far beyond smart than I imagined it!!  it.", "verified": true, "helpfulness": "0/0", "author": "Sophronis Mantoles"}, {"rating": 2.0, "review": "Good but not if you have DirecTV.  Should list providers on here.  Basically just a Netflix box for me. Can't access any of my paid content like showtime or AE because directv isn't listed.They are on both Apple TV and Roku. This is a major oversight.So DTV users you may want to think twice.  I'll be going back to Apple TV until it's fixed.That is a major provider.  Please disclose this on your page.", "verified": true, "helpfulness": "2/3", "author": "hitdog042"}, {"rating": 5.0, "review": "Works great and loads fast. Works with weak wifi signal on one side of my house.", "verified": true, "helpfulness": "0/0", "author": "R. Martin \"reminvestor\""}, {"rating": 3.0, "review": "Loads very fast,  super sharp picture, but needs more channels, if it had as many channels as ROKU  I would have given it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Poncho"}, {"rating": 5.0, "review": "Seems to be a pretty great device.  As you would think its very tied into the Amazon ecosystem (which I like).", "verified": true, "helpfulness": "0/0", "author": "Pirate Wubbzy"}, {"rating": 1.0, "review": "Really disappointed with this.  I plugged it in and tried connecting to my router but I can't get past the software update screen.  It keeps restarting the device.  I'm not sure if my product is defective or what...", "verified": true, "helpfulness": "0/0", "author": "Rani G."}]