[{"rating": 1.0, "review": "Connects easily but apps -Netflix does not request to login nor does HBOGO so how to I get it to work.  I have a Roku in another TV and works beautifully. What happen to the Pandora app?", "verified": true, "helpfulness": "0/0", "author": "Juan Delgado"}, {"rating": 1.0, "review": "I just put $40 in the trash , i have to reset it every time im watching a program because gets disconected, i have to shut the system off by disconecting the main power for at least 5 minutes. And conected back again, in 1 hr program i have to reset it 5 times...Not worth it.", "verified": true, "helpfulness": "0/0", "author": "oscarito"}, {"rating": 5.0, "review": "I wasn't sure if I should get this and now I am crazy about it. I like that I can bring it either television in my home. It pauses then starts back up even after being unplugged. I'm a couple months in and am still enjoying the prime shows/movies that are included.", "verified": true, "helpfulness": "0/0", "author": "Ashley N Prentice"}, {"rating": 1.0, "review": "Difficult to set up. Had to call help support and it took over an hour.", "verified": true, "helpfulness": "0/2", "author": "Paco Products"}, {"rating": 5.0, "review": "This is my second one. Love it", "verified": true, "helpfulness": "0/0", "author": "D-W-S"}, {"rating": 5.0, "review": "We love this! We were using a PS3 for all of our streaming video.  The video is much higher quality on the Amazon stick.  The remote is a little difficult to get used to, but otherwise this is a perfect product.  It basically turns your TV into a smart tv.  It is especially great for families like mine that do not subscribe to cable, but instead use streaming video services.", "verified": true, "helpfulness": "0/0", "author": "KatieDC"}, {"rating": 5.0, "review": "Great product. Replace my Roku that I was using, night and day difference.", "verified": true, "helpfulness": "0/0", "author": "Patricia K Mapel"}, {"rating": 5.0, "review": "Extremely easy setup....Worth the money.  Makes any of your Tvs a smart tv. The only thing it needs is to be plugged into a HDMI port and let the fun begin.", "verified": true, "helpfulness": "0/0", "author": "cara tamburich"}, {"rating": 5.0, "review": "This is awesome! I haven't had any issues with it so far. I did struggle to open the remote backing but got through it! Ha. The only thing is I wish you can add other TV viewing apps like NBC or ABC so I can catch up on shows that way! But we have a Netflix account and everything was so simple to connect to. I have a Wii and connecting to Netflix is a 30 minute process and even longer when the wireless connection is \"weak.\" But with the stick it surprised me how easy it was! And I love how easy it is to go from one TV to the next. Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Allison"}, {"rating": 4.0, "review": "👍", "verified": true, "helpfulness": "0/0", "author": "Nitin"}]