[{"rating": 1.0, "review": "Poor instruction. Customer service poor.", "verified": true, "helpfulness": "0/1", "author": "divus"}, {"rating": 5.0, "review": "Received as a gift. Works as described.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Loreen Yeater"}, {"rating": 4.0, "review": "I would give it a 5 star rating if it also drew power from the tv and didn't need the additional cord for power. Otherwise love watching prime on tv!! I cancelled my cable. Saved a lot of cash", "verified": true, "helpfulness": "0/0", "author": "scubagirl \"scubagirl\""}, {"rating": 2.0, "review": "I've been using the Fire TV Stick ever since Amazon came out with it and I got it for the $19.99 price. It's a nice little device that's in direct competition with Chromecast, Roku and products alike.Here are some pro's and con's:PRO- Plugs in to HDMI Port- Great amount of content through Amazon Prime- Syncs with your photos from Amazon Cloud Drive- Easy to use remoteCONS- FireTV Stick come with it's own power supply and cord that needs to be plugged in in order for it to work ( more wires everywhere)- The FireTV Stick sometimes lags like crazy- There is no restart option to reboot it (this sucks because in my experience, this thing crashes...ALOT) - Video from Netflix sometimes lags really bad, sometimes it buffers a lot. Interestingly, Amazon Prime videos have been working fine with no issues whatsoever.- The remote is only compatible with some games that are available through the app store- There is no option to set up multiple users so it can be used by multiple members of the family so they can only see content that they need- Even though the router for internet is right next to my TV where the FireTV Stick is plugged in, it constantly loses connection and I have to reconnect it back to the networkOverall, the device is good. I just feel like Amazon rushed the product. It would be more convenient to have a cable-less device like the Chromecast. Also, the lagging and buffering on Netflix is not due to the bandwidth issue at home, I can stream same movie from my PS3 with no buffering or lagging. Hope the second generation will at least adder", "verified": true, "helpfulness": "0/0", "author": "Igor Z"}, {"rating": 5.0, "review": "This was a gift.  The best ever!  I am enjoying its use.", "verified": true, "helpfulness": "0/0", "author": "Jean L."}, {"rating": 4.0, "review": "This stick is wonderful and the price is grwT", "verified": true, "helpfulness": "0/0", "author": "Donna Pletcher"}, {"rating": 5.0, "review": "It works as good \"as shown on TV\". Smartphone app also works well.  Well worth the price since I already had Amazon Prime for the free shipping.", "verified": true, "helpfulness": "0/0", "author": "Jimmy D Wilson"}, {"rating": 5.0, "review": "Easy to install and use.  The menu could be improved but what do you get for $39.00,", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 5.0, "review": "very happy with the fire stick", "verified": true, "helpfulness": "0/0", "author": "Jean Kain"}]