[{"rating": 5.0, "review": "This is the second \"stick\" I bought. First was Chromecast, which is ... OK, and I have to admit, that it would be good enough if it supported Amazon Prime Video.(I don't get Google playing these silly games with its competitors - let your product win on the merits, not by ridiculous, underhanded marketing tactics). The 50% off for Prime members made the Amazon stick hard to resist so... I bought it, and .... LOVE IT.1) It doesn't hang like Chromecast does from time to time (audio goes to Lala lend, without any reason). To this day, I had absolutely NO technical issues.2) The installation was AMAZINGLY simply. In comparison, the \"software\" company Google, made it so painful as I still have nightmares about it.3) FireTV stick interace is MUCH better (in my humble opionion - some disagree, but I don't care). It is snappier than this of Chrmocast and my native \"smart\" Visio TV (granted the latter is 3 years old, so it does have an excuse).4) FireTV gives me all online video accessm, even Google youtube with its chromecast casting, and video queing feature... LUV IT!  This prette much killed Chromecast stick for me.  Don't need it any more. Already disconnected, and probably will gift it to some of my friends.Cons? I simply don't have even one.In a nutshell, my Amazon viewing prime video viewing has improved (when I compare with the Vizio app),  The included remote provides better experience than the one of Chromecast stick (I really don't care about voice recognition, but if I change my mind, I CAN get a new remote in the future).I was seriously thinking about getting a Roku box, but this product made me stop. At least for a while. I am not a gamers, I do not care about this aspect of products like this. Also, I do not see any sense in running a huge 60\" tv to... listen to the musing. It would be like using Microsoft Excel for righting letters. CAN be done, but WHYYYYY!?  I don't watch musing, I only listen to it.", "verified": true, "helpfulness": "0/0", "author": "Boogie Man \"boggieman\""}, {"rating": 5.0, "review": "This is a great way to stream Netflix, Hulu, and all of those shows and movies you bought on Amazon.  We had been using the apps built into our TV, but they were extremely flaky, often slow, and generally unreliable.  This little gadget allows you to flip through everything quickly and plays everything instantly.  The app on the phone allows you to use voice search and control the stick remotely.  This is a great alternative to the Fire box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I like how integrated and easy to use this device is with Amazon but constantly have issues connecting to the Internet. I have no idea what the problem is, but it constantly loses connection, a problem that I don't have with my similar Sony and Roku devices.", "verified": true, "helpfulness": "1/1", "author": "Sandra D."}, {"rating": 1.0, "review": "do this work and car t.v.? ??", "verified": false, "helpfulness": "0/2", "author": "Ricky Dominguez"}, {"rating": 5.0, "review": "I like this", "verified": true, "helpfulness": "0/0", "author": "Joezacky"}, {"rating": 1.0, "review": "Really a bad experience.  Would not detect my hidden Wifi network (SSID not published) after over two hours with technical support and expending time with 2 agents (First one had no idea what a hidden SSID was) they could not solve the problem.  Also they refused to open a case because I was not using the device in the U.S.  Also for future reference if you have a hidden or not published SSID is really easy to setup the device by creating a fake SSID on your device or using a second device with not internet connectivity to make the Fire Stick recognize it and then setup your hidden SSID. (The Fire Stick device will allow you to set it up after it sees another network with a publish SSID)  Also the Amazon technical support sent me an email saying the device is not supported out of the country. Also not true because my routers are pointing to a DNS in the US and I am using not only Netflix but any other app we need to. What about US personel working in another country?  Shame on you Amazon, I have been a Prime member for over 5 years and noticed Amazon is just getting worst and worst.", "verified": true, "helpfulness": "0/1", "author": "Jose Fernandez \"Jose Fernandez\""}, {"rating": 4.0, "review": "Works well with Netflix, Hulu, and Amazon Prime.  The only downside was the software upgrade which was inexplicably slow, despite otherwise speedy network connections at my end.  I've had zero streaming issues, and the menu system is fairly easy to navigate.  Footprint is small, and the remote is very easy to use and well made.  I find this to be infinitely better than Apple TV, especially since it works with Amazon Prime.  The only downside, is there is no YouTube connectivity, which is a minor point.", "verified": true, "helpfulness": "0/0", "author": "J. Johnston"}, {"rating": 4.0, "review": "Wishes it could remember what your user names are", "verified": true, "helpfulness": "0/0", "author": "Karol Stokes"}, {"rating": 5.0, "review": "It has a great picture and is so easy to use.  Our kids bought one.", "verified": true, "helpfulness": "0/0", "author": "Cathy G. Freeman"}, {"rating": 1.0, "review": "does not work!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}]