[{"rating": 5.0, "review": "We use this evryday.", "verified": true, "helpfulness": "0/0", "author": "Josue Miranda"}, {"rating": 5.0, "review": "It is great and I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Malasha Faulkner"}, {"rating": 5.0, "review": "Honestly best streaming device I ever had. Plus added mirroring make this thing must have. Tried Chromecast before and it is worthless compare to Fire TV stick. Not sure if will work on hotel closed internet which need to be activated thru the browser, but can use mirroring instead for my phone to play what ever i need.", "verified": true, "helpfulness": "0/0", "author": "milos evan"}, {"rating": 5.0, "review": "Love this! I had a Roku that gave me issues from the first 5 mins it was plugged in. Fire Stick has been operating A++ since I plugged it in. The \"extras\" - Games, Apps etc are typical Amazon Excellence. As with most of anything you buy with Amazon or by Amazon, you get that and more. This media streamer for the $$ ($10 less than Roku), is wonderful and I recommend it to anyone who is looking for a media streaming device.", "verified": true, "helpfulness": "0/0", "author": "Dani \"Man is the cruelest animal. - Friedrich Nietzsche\""}, {"rating": 5.0, "review": "Excellent.  Great tool and gives me many choices.", "verified": true, "helpfulness": "0/0", "author": "Steve Colella"}, {"rating": 5.0, "review": "We will buy another one for the other tvs. I just love this thing.... It's better than the roku box we have and offers more channels.", "verified": true, "helpfulness": "0/0", "author": "Janice Cannon"}, {"rating": 2.0, "review": "I got this because my Sony blu-ray player with Wi-Fi does not do HBOGO. The fire stick doesn't have nearly the range and quality of picture...", "verified": true, "helpfulness": "0/0", "author": "JohnG \"JohnG\""}, {"rating": 5.0, "review": "I was watching Netflix via the laptop to the TV having to use an HDMI cord ... This alleviates the cord and the laptop and gives numerous other programs.  It does require the use of an HSB port or wall outlet to get power even with several new TV models but not a big deal ... I signed up for the 30 day free trial of Prime .. not sure if I will keep it as I am not a frequent user of Amazon product ordering ...", "verified": true, "helpfulness": "0/0", "author": "L.D.Hockaday"}, {"rating": 4.0, "review": "Very easy to set up. Delivery of the product was quick (It came in 3 days from ordering). It turned my tv into a smart tv. Now I can download apps and watch tons of new content.", "verified": true, "helpfulness": "0/0", "author": "Steve Chung"}, {"rating": 5.0, "review": "I upgraded from Roku LT to this for my TV.  It was very easy setup.  Also I notice a much quicker load time for starting shows on Netflix and Hulu.  The fact its using RF instead if IR is also a plus as with Roku I had to make sure I had a good line of site.  This wasn't always possible unless I was sitting in certain spot in my living room.  It gives an amazing picture in 1080, which the Roku was only doing 720 or sometimes 480 it seemed.  If you don't need all the bells and whistles that the bigger units have this is the perfect device especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}]