[{"rating": 2.0, "review": "I will probably send this product back. It is slow and it glitches all the time. I had the Apple TV before this, and my 2011 version of the Apple TV is exponentially faster. That is saying a ton, that a 4 year old device is way faster than a brand new one. This was a complete waste of money. I'm sure the fire TV is a lot better, but the stick is worthless. You might as well get the Chromecast for $10 cheaper.", "verified": true, "helpfulness": "0/0", "author": "Dylan Barnard"}, {"rating": 5.0, "review": "I love it. Great buy.", "verified": false, "helpfulness": "0/0", "author": "midnight1"}, {"rating": 3.0, "review": "I am sure we would like it better but we have slow internet.", "verified": true, "helpfulness": "0/0", "author": "LaLa"}, {"rating": 5.0, "review": "Nice and simple!!", "verified": true, "helpfulness": "0/0", "author": "Jaime González Canet"}, {"rating": 4.0, "review": "There are a few issues I have with the Firestick. Most involve the interface and the inability to create what amounts to a 'favorite' menu so you don't have to scroll through so many things. It's hard to complain about the functionality of the unit though - it does everything well. Although we are Prime members we use the Fire Stick mostly for Sling.If Amazon would allow Kodi to be installed via the FireTV apps store, it would be a complete unit. But for now, Kodi must be sideloaded, just as it is in the Fire TV box, and found through a rather convoluted menu process. IF Kodi were easy to use with this device it would be a complete product and we'd give it 5 stars. For now, we have to use a media server to interface with Kodi and our media storage.", "verified": true, "helpfulness": "0/0", "author": "A. Ferrin"}, {"rating": 1.0, "review": "not good.", "verified": true, "helpfulness": "0/1", "author": "Richard"}, {"rating": 5.0, "review": "Fantastic, plug and play. Great reception.", "verified": true, "helpfulness": "0/0", "author": "Cathy H."}, {"rating": 5.0, "review": "I'm really enjoying the fire stick in the movies there", "verified": true, "helpfulness": "0/0", "author": "james tbompson"}, {"rating": 3.0, "review": "When it works it is great!!  It does not recognize my internet frequently", "verified": true, "helpfulness": "0/0", "author": "Suzanne omtvedt"}, {"rating": 5.0, "review": "Working fantastic...just not enought time to watch em all!", "verified": true, "helpfulness": "0/0", "author": "Herb"}]