[{"rating": 4.0, "review": "The only thing I don't like about this is that it doesn't have the voice search like my regular Fire TV.  Otherwise, it's awesome!!", "verified": true, "helpfulness": "0/0", "author": "Janet M Neville"}, {"rating": 5.0, "review": "Awesome devise, turn any T.V. with a HDMI port into a smart T.V. as long as you have wifi you CAN take back what you pay for T.V. and what best is it is free with 3 months of paid Sling T.V.", "verified": true, "helpfulness": "0/0", "author": "Eddie Bailey"}, {"rating": 5.0, "review": "This is perfect for my bedroom!  It takes up no extra room and is always ready to go at the push of a button.  I love having Netflix in my room!  :)", "verified": true, "helpfulness": "0/0", "author": "Mickey"}, {"rating": 5.0, "review": "I love my new Fire Stick!It was a breeze to set up (except for opening the battery compartment on the remote - see YouTube for the solution). I really appreciate the HDMI extender, which I needed in order to make the connection on the back of my cramped HDTV.The Fire Stick is very easy to operate. And we really appreciate all the TV and movie choices available for \"free\" as part our Prime account.We never subscribed to HBO and/or Starz and now we have innumerable shows to choose from, plus new Amazon produced shows, like  \"Transparent.\"We already had a  Netflix account and had been accessing it via an old Wii. Its display of shows was so old fashioned compared to how it now works using the Fire Stick. I also sampled some shows on Crackle, like Stenfeld's \"Comedians in Cars Getting Coffee.\" (Funny/strange.)Before purchasing the Fire Stick, I researched the competition and found that Amazon's product got very good reviews from CNET, PC World and other technology websites. It has more memory than both Ruku and Chromecast. That extra memory makes for quick response time and an overall smoother operation.I highly recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "TD2000"}, {"rating": 5.0, "review": "So easy to install  Was up and running in 5 minutes  Going to buy another one for the grandkids tv", "verified": true, "helpfulness": "0/0", "author": "Kathy Weldon"}, {"rating": 1.0, "review": "I have a new Smart tv but I can't get the Fire Tv Stick to work.My Amazon program works fine with Wi-Fi but not Fire TV Stick .Please help ??", "verified": true, "helpfulness": "0/0", "author": "Birgit Campbell"}, {"rating": 1.0, "review": "I purchased this to have prime instant video streamed to my tv and it wasn't available on my chromecast because I have an android device. It hasn't worked since I received it. I can't stream Netflix or Prime Instant Video. My Chromecast works just fine, I've even tried it on 2 other tv's in my house and received the same results.", "verified": true, "helpfulness": "0/0", "author": "James Simpson"}, {"rating": 4.0, "review": "its fantastic when it works....my operation only works sometimes because my modem is in the bedroom and my tv is inthe great room.....some 30 feet away....will eventually get amazon tv", "verified": true, "helpfulness": "0/0", "author": "John S. Norkett \"consultant\""}, {"rating": 5.0, "review": "The Fire TV Stick is a great product.  Just plug it in a you are ready to watch many of the streaming TV shows, as well as, movies, etc.I also have the Fire TV and enjoy them both.  Meets all my expectations.  I have just ordered another one for our TV in the guest room.", "verified": true, "helpfulness": "0/0", "author": "K. Jones"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick to watch Netflix in my room. It was a cheaper alternative than Apple TV. The streaming is great, I never have any problems and the set up is easy. I wish there was a way to put the device to sleep via the remote control instead of going through the settings", "verified": true, "helpfulness": "0/0", "author": "Jasmine"}]