[{"rating": 3.0, "review": "I like the stick. I bought it because I travel a lot for work and wanted to watch my favorite shows when I am away from home. However you cannot use it at hotels because there is no way to login to the Internet without a browser so it defeats the purpose of mobility unless you use your personal computer which I don't bring because its too heavy to carry two computers.", "verified": true, "helpfulness": "0/0", "author": "Happiness is in my grasp"}, {"rating": 5.0, "review": "Very easy to use! Love it", "verified": true, "helpfulness": "0/0", "author": "April Wilcox"}, {"rating": 5.0, "review": "very easy to use, love it.", "verified": true, "helpfulness": "0/0", "author": "jacquie"}, {"rating": 5.0, "review": "easy to install--works like a charm--not sure how I lived without it.", "verified": true, "helpfulness": "0/0", "author": "marilyn chase"}, {"rating": 4.0, "review": "The Fire tv stick is a good product not great , it needs a usb  port and the interface needs work ,it's just not a natural flow . I think u could stand to explore Roku and consider making some changes. But this is still a nice product with a good price. Amazon should also consider adding free to air Network tv to there devices now that in my opinion would be next level and seal the deal for a lot more people , if your using the internet already it would be simpler to get live network programing  without using a tv antenna . Well what i mean is this should be added free just like it was meant to be free over the air . Thanks !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simply plug in and program the wireless passcode then you can log into Netflixs, sling or other content providers.", "verified": true, "helpfulness": "0/0", "author": "Stanley K. Rader"}, {"rating": 5.0, "review": "So far the family is very happy with the fire TV stick, we are able to watch almost all of the shows we all like. Paw Patrol needs to be added to the line up.", "verified": true, "helpfulness": "0/0", "author": "oilcan72"}, {"rating": 4.0, "review": "Worth the price.  Wish it had more apps.  Good enough for our third TV, without paying monthly for another cable box.  Kids like Disney channel.  Parents like YouTube, for exercise videos.", "verified": true, "helpfulness": "1/1", "author": "765 kV"}, {"rating": 5.0, "review": "It's very user friendly and has a ton of features!  My friend has Roku and I much more impressed with the Fire stick!", "verified": true, "helpfulness": "0/0", "author": "Kayla Broughton"}, {"rating": 4.0, "review": "So far so good!", "verified": true, "helpfulness": "0/0", "author": "Omari Baye"}]