[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "rsoneill"}, {"rating": 5.0, "review": "We received the Fire TV Stick on time and by Friday afternoon 2 days later it had paid for itself by the TV series we watched.  I have already put several things on my \"watch list\".  This TV stick should be a no brainer buy for anyone with Prime Membership. We love it.", "verified": true, "helpfulness": "0/0", "author": "Sheila Earley"}, {"rating": 2.0, "review": "The single time it successfully maintained a WiFi connection for more than 3 mins it was wonderful. Unfortunately it is virtually impossible to maintain the connection despite a strong signal strength.  Other devices in the same spot have no problem. No internet connection renders the whole thing useless.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not quite what I was hoping. The apps you can download are just the regular android apps, so built for lower resolutions or don't do what you're going to want from a TV app. The Amazon integration is good, but I would like better TV-type apps supported. Especially things like Twitch because it's an Amazon company.Also, a good quality DLNA client would go a long way. Especially if it's built in.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Very happy with it..no problems with set up.", "verified": true, "helpfulness": "0/0", "author": "anita"}, {"rating": 4.0, "review": "It's great, but my remote only worked for a week.  Phone app is great!", "verified": true, "helpfulness": "0/0", "author": "Carrie Pedersen"}, {"rating": 5.0, "review": "We enjoy it. Portable which means I can finally watch Netflix on my treadmill...", "verified": true, "helpfulness": "0/0", "author": "LFTravels"}, {"rating": 4.0, "review": "Not just a \"internet connection\", but one greater than 1.5Mbps.  Marketing people always leave out important details.  I live in a small time anomaly inside a city were the max. DSL available is 1.5Mbps.  Fire TV Stick in the mud.  I'm sure this is a very fun device if you have faster DSL.", "verified": true, "helpfulness": "0/0", "author": "M. Eckelman"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "al"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Patricia E. Henderson \"pattycakes1718\""}]