[{"rating": 5.0, "review": "LOVE it!", "verified": true, "helpfulness": "0/0", "author": "sally a casselbury"}, {"rating": 1.0, "review": "This shouldn't have a check mark next to Miracast certified on the when it barely supports it. It only works with other Amazon devices and some Android devices. Does not work with Windows or WP8.1 devices despite no compatibility issues (even with the Roku despite Amazon showing that it doesn't support it)I bought it namely for mirroring capability through Miracast and since Miracast is a open standard, I expected no issues. So disappointed.", "verified": true, "helpfulness": "2/3", "author": "Quoc Thy Ngo"}, {"rating": 4.0, "review": "Love it, expect it does not stream wwe network. Only downside.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 3.0, "review": "It's ok, to me having to plug it into power kind of defeats the portability aspect of the device which to me was a defining factor. Doesn't really do anything my Apple TV doesn't except for Prime Content. The software is decent but again it's not really breaking any new ground.", "verified": true, "helpfulness": "0/0", "author": "Dave Hunwick"}, {"rating": 5.0, "review": "The first few days of use it has worked perfectly. I really like the ability to use Plex anywhere, which was a big reason I decided to go with the Fire Stick, but the general interface and the apps all look great as well. Very happy.", "verified": true, "helpfulness": "0/1", "author": "Brian Vazquez"}, {"rating": 4.0, "review": "Just started using it. Works great so far. I will be updating my review as I start using it more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have 2 chromecasts already, they are pretty good for what they are advertised for, and for the price. So, I was excited when fire tv stick was announced that purpoted double the memory and a better wifi(dual-band antenna).  The shipping was fast.When the device was delivered, I was excited and plugged the stick into my TV and was on my way to set it up. Connected to my wireless, then the stick started to download the upgrade, I was waiting, and waiting and waiting, and suddenly there was an error message saying download failed please reboot after a while or call the number.. for support. I rebooted and tried again, it failed again. Tried like 15 times and failed everytime. (my wifi is pretty fast and router is not too far from the TV, chromecast does the updates instantly). After many tries finally, the final download took an hour or so when the progress bar slowly made it to the end, when it successfully finished downloading. My guess is the wifi antenna for some of the sticks is defective. The dual antenna, instead of helping is hurting by interfering with each other.The install was relatively fast.Streaming had some problems initially but now it's pretty smooth but I don't get the HD level detail usually probably because of the wifi antenna issue.I would have returned the item if I had a store nearby, but as it's Amazon, i don't want to go through the hassle of paying for the return shipment and mail it. So, I am forced to keep it instead. This is one reason I am skeptical of shopping from amazon. If there's an equal valued item at a nearby store, i prefer to buy at the store.I gave it 2 stars because it's atleast playing videos.", "verified": true, "helpfulness": "0/1", "author": "Andy Prith \"am\""}, {"rating": 4.0, "review": "Shipped earlier than I expected. Does everything my Fire TV does. I do not notice any speed dips. I'll change my rating to a 5 if I can connect a BT keyboard. I can overlook it not having a USB port if that works.", "verified": true, "helpfulness": "0/0", "author": "Von"}, {"rating": 5.0, "review": "Love it. This was super easy to install and the on screen instruction walk you through the process. My husband can now have access to WatchESPN and catch more sports!?!", "verified": true, "helpfulness": "0/0", "author": "Cat_page"}, {"rating": 5.0, "review": "I didn't want to wait until January so I bought this at a local store for $25. I am so glad I didn't wait! This has already replaced my Chromecast. This does everything that Chromecast does, plus I can watch Prime TV and movies without having to cast my phone screen. If I had known this was coming out, I wouldn't have wasted my money on Chromecast. The remote that comes with it is handy. There is also an app available for download if you would rather use your voice or a keyboard for searching.", "verified": true, "helpfulness": "0/0", "author": "Mandie"}]