[{"rating": 4.0, "review": "Would have given it 5 stars but had one issue with a blue screen error screen saying \"\"HDCP unauthorized....\" when streaming netfilx, which I Googled and got a quick fix for. Otherwise, love this item 100% and have given others a recommendation to buy.", "verified": true, "helpfulness": "0/0", "author": "Martin Mulcahey"}, {"rating": 5.0, "review": "Awesome! Side load capability makes this one of the best deals around.", "verified": true, "helpfulness": "0/0", "author": "DON ARCANGEL"}, {"rating": 2.0, "review": "I am happy that i got smart and using it. Excellent product. Thanks!!!", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 4.0, "review": "Great Product. Works just as advertised. Easy to use with Kindle Fire App. Could use a better search though, No way to refine a search. Makes \"Prime\" much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Michael Miller"}, {"rating": 4.0, "review": "works great.  set up only took a couple of min.", "verified": true, "helpfulness": "0/0", "author": "Rick Brenchley"}, {"rating": 2.0, "review": "It's fine and the price is right but there isn't an app for VUDU yet so I still have to use my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Timothy Spry"}, {"rating": 5.0, "review": "I am really enjoying the fire TV stick.  It meets all my expectations.  No problems hooking it up and the remote is very responsive.", "verified": true, "helpfulness": "0/0", "author": "Live&amp;Learn"}, {"rating": 5.0, "review": "VERY EASY SET UP! I just plugged it in, followed the on screen prompts, and I was surfing in no time. Only had it for about a month, but it has been flawless in video quality and operation.", "verified": true, "helpfulness": "0/0", "author": "Tim Wilms"}, {"rating": 5.0, "review": "I use the Fire Tv  Stick to stream Netflix through my projector. It works great and with its ease of setup I had it working in no time.", "verified": true, "helpfulness": "0/0", "author": "honest review"}, {"rating": 5.0, "review": "So much better than the Chromecast I had to return!  It's so easy to use and there's a lot more you are able to do as opposed the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Pamela B"}]