[{"rating": 4.0, "review": "Very happy with the fire stick. The only problem is I can't figure out how take off the movie or show off after I watch it", "verified": true, "helpfulness": "0/0", "author": "john arsenault"}, {"rating": 5.0, "review": "Superb! Greatly exceeded my expectations! We use it for Prime movies and television shows.", "verified": true, "helpfulness": "0/0", "author": "Polykid \"Polykid\""}, {"rating": 3.0, "review": "At times apps are slow", "verified": false, "helpfulness": "0/0", "author": "Sudhir Krishnan"}, {"rating": 3.0, "review": "Phenomenal product, easy to install, easy to use, exactly as advertised. That would warrant a 5-star rating.Product support: So far, Amazon's earned 0 stars. There seems to be some kind of problem with the authorization process at Amazon; my access to TV shows, movies, etc. that are \"included with Prime\" sometimes disappears. The only solution so far is to unplug everything (HDMI, power) from everything (TV, wall, receiver), wait a few minutes, and start over powering up and reattaching things. I'd think this was my problem alone except that other customers have experienced the same issue. The only helpful advice I received came from other customers' comments. Amazon has done nothing to correct the problem or help me find a work-around.", "verified": true, "helpfulness": "0/0", "author": "SA"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jeanette143"}, {"rating": 5.0, "review": "Thrilled have been able to get the Fire TV Stick at a great price however I have not used it yet I hear wonderful things from others that have it.", "verified": true, "helpfulness": "0/0", "author": "Pamela S"}, {"rating": 1.0, "review": "This thing does a poor job connecting to Internet. It always buffers so watching Amazon or Netflix is brutal.im returning mine unfortunately, maybe it's just this particular device.", "verified": true, "helpfulness": "0/1", "author": "David Ball"}, {"rating": 5.0, "review": "Awesome little stick! Gary Busey was right!", "verified": true, "helpfulness": "0/0", "author": "ben   brick"}, {"rating": 5.0, "review": "I had been streaming Netflix on my old Wii and the picture quality was poor, not to mention accessing it was a bit involved.  I was pleased with the ease of instillation and the amazing picture quality using the Fire TV Stick, with navigation and access so simple.  I would, and have recommended this to anyone interested in a product to stream movies, music, and shows.  Now that I can easily watch Prime titles I will take full advantage of a membership that was previously utilized for shipping.  Get this ... now!!!!", "verified": true, "helpfulness": "1/1", "author": "Michelle Hebner"}, {"rating": 5.0, "review": "I love the fire stick its amazing. I also have Roku 2 but haven't used it since getting the fire stick.", "verified": true, "helpfulness": "0/0", "author": "James Lawton"}]