[{"rating": 4.0, "review": "I like the Fire Stick. It was easy to install and connect to my computer network. The biggest reason I wanted the Fire Stick was to access Netflix, which I can now do easily. In addition, the Fire Stick allows me to watch the movies that I bought for my Kindle on the TV. I am very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Schoolzout"}, {"rating": 5.0, "review": "I love having this. I waited a long time to use it because I was moving and didn't want to have to go through the hassle of setting it up multiple times. Boy was I wrong this is so simple to set up that we take it when we go on trips and stay in hotels with Wifi. We actually have something decent to watch rather than just the basic channels that the hotel has to offer. I thought the remote would be complicated to use but even that is fairly simple and doesn't take long to navigate for typing. If I would ask for one improvement it would be that the remote be backlit so when we are watching tv in bed at night we can see to turn it off or change program. We use our phones as flashlights. (This does not take away from the product in any way)", "verified": true, "helpfulness": "0/0", "author": "RJK"}, {"rating": 5.0, "review": "better than cable", "verified": true, "helpfulness": "0/0", "author": "A. Wanderer \"K.S.\""}, {"rating": 3.0, "review": "This is a convenient tool to save the life of one's laptop battery. But every now and then the video freezes, usually at the start for a few seconds and picks up in real time. This has happened on various apps. So, I think it may be software related.Another negative aspect of the fire stick is lack of access to unlimited apps. Amazon is not an unbiased third party. Pandora is not available for instance, but prime music is.The search function in the fire stick software is lacking. There is no distinction in the search that allows filtering, particularly for free versus paid content (within home search). It's also hard to access the same distinction rubric available online in prime video and Netflix. For instance, in Netflix users are unable to narrow down choices by selecting movie> comedy> classic comedies. The same is true for prime video.One thing I do like that was unexpected are the wallpapers. If you idle for a certain amount of time beautiful, serene landscape photographs cycle through. I do not know how to turn this on, but it is a nice feature.The product design is very elegant. The keyboard user interface is nicer than the wii and a lot of other systems. The remote is intuitive and discreet. The power cable is too short. I feel the fire stick is limiting compared to having a computer hooked up to the TV. But, I would probably buy it again.", "verified": true, "helpfulness": "0/0", "author": "Firefly"}, {"rating": 4.0, "review": "I love the fire stick. Only downside is that Comcast does not support A&E;, the History Channel, or lifetime.", "verified": true, "helpfulness": "0/0", "author": "Christien russell"}, {"rating": 4.0, "review": "We lost the remote because it is so small, But we control it with the app on our phones no problem.", "verified": true, "helpfulness": "0/0", "author": "Bradley Cook"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 5.0, "review": "I got fire tv stick for my daughter and she loves ir. She is disabled and spends a lot of time in her room and she is unable to do much on her own. She prefers it over everything else. I am thinking of getting one for my self.", "verified": true, "helpfulness": "0/0", "author": "uncleron"}, {"rating": 4.0, "review": "We got this because our Wii wasn't working with Netflix anymore. This made a huge different. Sometimes there's a bit of a hiccup with the video transmission, but overall it's been great. My one complaint with the setup for browsing videos is that you have to continually press the button on the remote to go through each individual video. There doesn't appear to be any scroll feature that allows you to scroll through several viewing options (movies/tvshows/etc) at once. That would make it so much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Jason Farrell"}, {"rating": 1.0, "review": "I hate it. Apple and Roku are much easier to use. Slow to respond and terrible interface.", "verified": true, "helpfulness": "0/0", "author": "Jim S \"z23z23z23\""}]