[{"rating": 5.0, "review": "works equally as well if not better than my apple tv and chome stick plus you get amazon prime original programming!", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "All that's needed is a prime membership, wifi, and a t.v. with hdmi ports and you're good to go and I mean that literally; take the stick on vacation, just plug in and you have your watchlist with you.", "verified": true, "helpfulness": "0/0", "author": "and-y"}, {"rating": 5.0, "review": "I received mine as a gift.  Have thoroughly enjoyed it.  Very simple to set up.  They had some of my favorite movies & TV series for free. ;0). That was nice.  Being able to watch them whenever I wanted was great too!  No commercials!  Definitely a bonus.  Like the remote that came with it along with free batteries!  So far I have been very satisfied.  They add more movies & shows all the time too.", "verified": true, "helpfulness": "0/0", "author": "georgiagal"}, {"rating": 5.0, "review": "Love it! Definitely worth the money. Can't imagine going without it now", "verified": true, "helpfulness": "0/0", "author": "morgan"}, {"rating": 5.0, "review": "Love it much better than Chrome !!!", "verified": true, "helpfulness": "0/0", "author": "Celine Verdiales"}, {"rating": 5.0, "review": "Works great and I like the small profile.", "verified": true, "helpfulness": "0/0", "author": "St Anne \"VA Career Woman\""}, {"rating": 5.0, "review": "Absolutely love it!!  It was everything I had hoped it would be.  The smart phone app makes it even better.", "verified": true, "helpfulness": "0/0", "author": "sprite"}, {"rating": 2.0, "review": "As much as I wanted to like it I couldn't because it just simply didn't work well.  For some reason the unit didn't want to connect to Netflix.  After an hour of trial and error, I finally got Netflix to work.  That's when the fatal flaw was found.The unit just wasn't able to stream continuously.  After about five minutes of viewing, the unit would begin buffering.  This process would occur numerous times during an hour-long show, making it an hour and half ordeal.  As busy parents, our TV viewing time is at a premium, so the frustration was just too much.We returned the unit and opted for the roku 3 and do not regret the decision.", "verified": false, "helpfulness": "0/1", "author": "D. W. Elgin"}, {"rating": 5.0, "review": "The Amazon Fire Stick turned out to be more than I had expected! It is perfect and does what it is designed and advertised to do .... I highly recommed it...", "verified": true, "helpfulness": "0/0", "author": "Charles Stanley"}, {"rating": 5.0, "review": "Love that I can watch Naruto on a big screen!", "verified": true, "helpfulness": "0/0", "author": "N. Hauer \"darksaturn9\""}]