[{"rating": 5.0, "review": "THIS IS THE GREATEST THING SINCE CABLE T.V. IN FACT I AM CONSIDERING SAVING MONEY AND GETTING RID OF CABLE. I FIRST BROUGHT THE GOOGLE CHROMECAST THOUGHT IT WAS COOL. USING MY TABLE PICK OUT WHAT I WANT. BUT WITH THE FIRE STICK JUST PLUG UP SIGN IN AND I DO NOT EVEN NEED TO PICK UP MY TABLE ..USE REMOTE OPEN PROGRAM I AM PART OF LIKE HULU OR NETFLIX ALL SET, MY TABLET OR PHONE DOES NOT EVEN NEED TO BE A PART OF IT...BROUGHT ANOTHER ONE FOR THE FIRST HUSBAND WHO IS NOT GADGET SAVY AT ALL AND HE LOVES HIS ALSO.. MAJOR PROBLEM I HAVE IS WHAT TO DO WITH THE GOOGLE CHROMECAST..I LOVE THIS FIRE STICK.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Couldn't be happier with this, easy to use and works great! Very happy with my purchase and definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "this thing works great! i love being able to control the apps from this versus a blu-ray player or gaming console.", "verified": true, "helpfulness": "0/0", "author": "Thomas Partch"}, {"rating": 5.0, "review": "Excellent, easy to install and works just fine.", "verified": true, "helpfulness": "0/0", "author": "Michael E Keating"}, {"rating": 5.0, "review": "We absolutely love the Fire TV Stick in our home.  It has a fair variety of movies of free and great options to rent.  It saves us time from having to run to Redbox since we can stream everything from our home.  Since the service is based off my Prime Membership there is no additional cost.  If you have Netflix, Hulu, or etc. you can stream those libraries through Fire Stick as well.", "verified": true, "helpfulness": "0/0", "author": "rhayes"}, {"rating": 4.0, "review": "So far so good. Only complaints are the remote was EXTREMELY hard to open. And the stick get a little hot but overall I am happy with", "verified": true, "helpfulness": "0/0", "author": "Bre"}, {"rating": 5.0, "review": "This thing is awesome. It's my dongle of choice even though I have 3 chromecasts in my home (my wife likes those)", "verified": true, "helpfulness": "0/0", "author": "Alex R"}, {"rating": 4.0, "review": "I would like it more if Miracast worked for all devices, and not just Kindle devices, sure set up a list of approved devices, but don't block everything else.Besides that: The device is easy to use, the remote is very easy to use. I like the remote app for iPhone, excellent. I've found no problems with video or game playback, though sometimes video studders a bit in the beginning, not sure why.", "verified": true, "helpfulness": "0/0", "author": "Leeds Main"}, {"rating": 1.0, "review": "I didn't realize that in addition to plugging in the stick to the TV, that you also need to connect to a power outlet which makes it more difficult to use easily.", "verified": true, "helpfulness": "0/1", "author": "Laura Valan"}, {"rating": 1.0, "review": "A few months ago, I wrote a rave review and gave the product four stars.  That review is still here, below the divider.More recently, though, I've experienced the same problem many others are reporting: that the stick seems to get \"hung in left rudder,\" leaving me staring at a twirling circle instead of a TV show.  Today has been the worst ever: the thing has hung up several times, enough to make it unusable.  Twice, I've done the trick recommended by Amazon: Unplug the Fire Stick, unplug its power cable, then plug them back in again.  No help.I'm also getting \"lost network connection\" messages -- five or six in the last hour.  Yet my computers  connected to my Comcast cable are working fine, and the Xfinity speed tests shows speeds faster than advertised.What's more, the picture on my second TV, a new Vizio with built-in WiFi, is working perfectly.The Fire Stick runs a little hot, even though it's physically located just below an AC duct.  My theory is, it's slowly degrading with time.  At this point, it's basically a lightweight boat anchor.-------------------------------This thing has changed our lives.  My productivity has gone down dramatically, but the smile on my face continues to grow.With both Fire TV Stick and Amazon Prime, we can and have watched old (and new) movies and TV series that we would never have seen otherwise.Only one problem:  We find it difficult to find the shows or movies we might like.  The Search engine is virtually worthless.  It's not a \"Smart Search\" like DirecTV offers.  If you don't know the name of the movie, you will not find it.Amazon claims there are some 60,000 movies available.  Note to Amazon:  Give us an on-line browser/locator we can use to find the other 59,970.", "verified": true, "helpfulness": "0/0", "author": "Jack W. Crenshaw \"bird lover\""}]