[{"rating": 5.0, "review": "Love it love it love it. One of the best gifts ever! With all of the things that you can get with a prime membership I am getting rid of my cable!", "verified": true, "helpfulness": "1/1", "author": "Victoria Moynihan"}, {"rating": 5.0, "review": "Had trouble connecting my smart phone but other than that, it's great!", "verified": true, "helpfulness": "1/1", "author": "T. Brantner \"gringa908\""}, {"rating": 5.0, "review": "I'm addicted to it. I watch it every day.", "verified": true, "helpfulness": "1/1", "author": "donna a gregory"}, {"rating": 5.0, "review": "Great product, I wish I could have bought another at introductory price, a good value at $39", "verified": true, "helpfulness": "1/1", "author": "Alan Griffin"}, {"rating": 5.0, "review": "wish i could get dish any where to download into it", "verified": true, "helpfulness": "1/1", "author": "carol a gatewood"}, {"rating": 5.0, "review": "Received item quickly and exactly as described.", "verified": true, "helpfulness": "1/1", "author": "RayRay's \"Tell It Like It Is\""}, {"rating": 5.0, "review": "So far I love it.  It makes strolling the streaming world very easy.  Currently loving ARCHER and all that geniusly written hilarity.The ONLY drawback is that they've made the little remote bright black.  Dull black.  Invisible black.  Lose it anywhere and can't see it black.  I recommend spray paint or bright duct tape.  Your friends might think you're a doof, but at least you won't be walking in circles muttering \"Where's The #@%# Remote??\"", "verified": true, "helpfulness": "1/1", "author": "T. JORGENSON \"Pamphleteer\""}, {"rating": 4.0, "review": "Works as well as the \"other\" popular media streaming device, but is missing one of my most desired content (TED talks).  Works as well as the \"other\" popular media streaming device.  Well I'll try again, ROKU has a better search function in that it will deliver results from many sources (at one time that included Amazon).  The first time I reviewed this, Amazon did not post it presumably because I mentioned the competition.I have updated this review and moved my rated from 3 to 5 stars.  Amazon listened and added the TED TALKS app! So, I happy...Really needs a hardwire ethernet connection.  bumping it down one star!", "verified": true, "helpfulness": "0/0", "author": "Drummer Boy"}, {"rating": 4.0, "review": "the description was not clear as to whether or not the remote was included so I ordered another one.  That bites.product is good and works well.", "verified": true, "helpfulness": "0/0", "author": "B. Foss \"nana\""}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "1/1", "author": "moonhyoung cho"}]