[{"rating": 3.0, "review": "It works pretty good. The quality of the picture is good.  We did not choose to pay the extra to for HD quality. I love all of the program options. The reason for the 3 star rating is that it keeps freezing up, and has to be reset by unpluging the power, and allow it to reboot.  The remote all quits working, and you have to take the batteries out and reinstall them to get it to work again.", "verified": true, "helpfulness": "0/0", "author": "Reed Chandler"}, {"rating": 4.0, "review": "This thing is garbage unless all you plan to watch is Amazon Video on Demand. Watching Hulu, Netflix or Plex is impossible. Every video I try to watch on Hulu or Netflix stutters every 15-20 seconds and pauses every 5-10 minutes for a few seconds. When using Plex the video pauses about every 15 seconds for about 5 seconds and constantly loses connection to my Plex server. To get it to reconnect to my server I have to unplug the Fire TV Stick and reboot it. But Amazon VOD video's always play with no problems whatsoever. I have a 3 other Roku devices in my house and none of them have any problems with any of these services. I also have no problems using Plex, Hulu or Netflix from my iPad on the same network. So I know this is a problem with the Fire TV Stick and not with my network or with any of these services.Edit of my previous review:After contacting customer service they suggested that I use the HDMI extender included with the FireTV Stick even though it fit into my TV without it. After connecting the extender I haven't had the playback issues with Plex, Hulu, or Netflix. My only issues with this device now are pretty minor. I wish there were a way to pin the third party apps to the home screen instead of just having them in the recent list. I've updated my review from 1 star to 4 stars. Add a way to pin apps to the home screen and I would gladly give it 5 starts.", "verified": true, "helpfulness": "2/5", "author": "Jeff Elms"}, {"rating": 5.0, "review": "These are GREAT, I purchased two and wish I would have purchased a few more for Christmas Gifts. I use one in my bathroom where I could only watch DVD's, now Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 3.0, "review": "Happy with it overall but while researching did not come across anything that said certain shows through your subscribed apps (like my hulu plus) are web content only. Not being able to watch some of the shows we watch on a regular basis was a disappointment.After looking at the prime listings some of the shows were available through Amazon Prime, but not all of them.I realize that's their way of getting you to subscribe to Prime, but it's not even all of the same shows and it's forcing you to buy Prime if you really want some of those shows and it being the reason for having bought the stick it the first place!", "verified": true, "helpfulness": "0/0", "author": "Joseph Tyra"}, {"rating": 5.0, "review": "I am a fan of this product! I will probably eventually sell off my other devices and just have these.", "verified": true, "helpfulness": "0/0", "author": "J. King \"bobanna\""}, {"rating": 1.0, "review": "We bought two of these when they first came out..and I had high hopes..but unfortunately, it seems to be a bit buggy...they are both constantly dropping our wireless connection (while all the other things on our wireless (including RoKu) have no problem staying connected. They are also often asking to re-authenticate and asking us to reset up again, if and when they finally reconnect.....needless to say, it has been a very unfortunate experience. I am hoping that Amazon may be able to figure out what is wrong with their Fire Sticks, and  with further updates correct the problems......", "verified": true, "helpfulness": "2/3", "author": "Denise"}, {"rating": 5.0, "review": "Very cool, glad I got it", "verified": true, "helpfulness": "0/0", "author": "mamashopper"}, {"rating": 5.0, "review": "Great media streamer.", "verified": true, "helpfulness": "0/0", "author": "John Haley"}, {"rating": 3.0, "review": "It works well and very handy if you don't a smart tv. However, it does experience connection \"lag/freezing\" when watching movies on Netflix. The unit gets hot which might be the cause.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "The Fire TV Stick works very well. We have one of these as well as one of the regular Fire TVs. Both have the same interface and we haven't noticed much difference in terms of usability and performance. We've purchased similar devices from other retailers and this one is much faster and more reliable while providing some great content. As the description says, the device does not come with the same remote as the regular Fire TV does, but that is one of the only noticeable differences between the Stick and the regular Fire TV and you can get that functionality through the remote app.Bottom Line: this product works extremely well and is a must have for amazon prime members.", "verified": true, "helpfulness": "0/0", "author": "Tcstitt5269"}]