[{"rating": 4.0, "review": "I have only had it for a couple of days. But I want people to know that it does work with a 1.5 MB download speed. I was concerned that it would not work with such a slow internet connection, but it does work. It only showed buffering the first time I tried it and then it started to play with no buffering. I am impressed with that. That seems like a very good sign. after I use it for a little while more, I will post an update. But so far so good.", "verified": true, "helpfulness": "0/0", "author": "Steve Ritter"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "REDTOPHOP"}, {"rating": 4.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Miguel E. Diazdelcastillo"}, {"rating": 2.0, "review": "If you have DSL, don't buy this, it keeps stopping and starting.  I have had it over a month, restarted several times and it still isn't any better.", "verified": true, "helpfulness": "0/0", "author": "Deborah J. Street \"50 and over\""}, {"rating": 5.0, "review": "I was a roku box 1 user before the fire tv stick. I love it. I decided to keep the fire stick for my tv and let the little one use the box for his room. It has all the apps I need to watch movies and it was a breeze to install and set up.", "verified": true, "helpfulness": "0/0", "author": "Mel Ro"}, {"rating": 5.0, "review": "Very easy to install, provides a lot of great shows and movies!!", "verified": true, "helpfulness": "0/0", "author": "Cowgirl 30"}, {"rating": 4.0, "review": "As easy to operate as the Roku and so far much more reliable.", "verified": true, "helpfulness": "0/0", "author": "Mary L."}, {"rating": 1.0, "review": "The main reason I got this was to use it with my Windows 8.1/10 devices  but the stick does not support Miracast for PCs.  Please enable Miracast for all devices. Give us the full power of the stick.", "verified": true, "helpfulness": "1/2", "author": "Vivek M"}, {"rating": 5.0, "review": "Purchased during the special promotion Amazon had and I love it. I have used the Chrome stick and had issues keeping it connected to wifi. The fire stick works perfectly and I actually bought two more for my media room and as a gift. Due to the number of movies available, I lowered my Netflix DVD subscription and added the wifi version. My teenage granddaughter loves it and has watched tons of  past TV shows. It is worth the price, even at the regular cost. It is easy to load, use and works great without having to add any wifi extenders.", "verified": true, "helpfulness": "0/0", "author": "JiffyJoe"}]