[{"rating": 5.0, "review": "Love it!! Easy to use right out of the box!", "verified": true, "helpfulness": "0/0", "author": "Andrew Sampley"}, {"rating": 4.0, "review": "This is by far the best way to stream movies and TV shows. No waiting around for a video to buffer - the only reason I didn't give it 5 stars is that I wish there was a wider selection", "verified": true, "helpfulness": "0/0", "author": "Rebecca Ward"}, {"rating": 5.0, "review": "Great for our bedroom tv", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "I love my Fire Stick. So many movies to choose from. Easy to install. Love it.", "verified": true, "helpfulness": "0/0", "author": "Maryjo R.Williams"}, {"rating": 5.0, "review": "It was easy to install and I was surprised to find a voice remote came with it.  Had it working in a few minutes", "verified": true, "helpfulness": "0/0", "author": "VLF"}, {"rating": 5.0, "review": "Perfect product.  Easy to use and connect.", "verified": true, "helpfulness": "0/0", "author": "Wendy Nicolai"}, {"rating": 2.0, "review": "I'm not a big fan of my new Fire Stick. I also have an Apple TV, which I find to be much more user friendly and reliable. The Fire Stick makes you watch an intro video which was kind of annoying. It really should make that optional for those of us that have half a brain and can figure out how to use it on our own. It also didn't acknowledge my Prime account at all. I then opted to try the \"Free 30 day trial\" that they advertise to you and was IMMEDIATELY charged for a full subscription. Some FREE trial... My Netflix is also horribly unreliable. I have had to install and uninstall it in order to keep it operational and the quality of my video is terrible, which I have never had a problem with when using my Apple TV or my Wii for watching Netflix. The interface is also confusing and it is difficult to determine what you have to pay for and what is included with your Prime account until you decide you really want to watch something, click on it, and discover they want you to pay for it. I was initially really excited about a cheaper alternative to another Apple TV but I think I'll just end up buying another one and throwing this thing in the spare room...", "verified": true, "helpfulness": "0/0", "author": "Hans724"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Still working my way through the apps and seeing what's good and what's not.... it's okay. I do like the voice activation that comes with the app. May give a more better rating once I've figured everything out.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "While I was unaware you needed to supply power to the 'stick', it works great!  Buy this instead of paying extra for a 'smart' tv.", "verified": true, "helpfulness": "1/1", "author": "W. Duncan"}]