[{"rating": 5.0, "review": "Firestick lives up to its name. Turns your tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Ann Ochsner"}, {"rating": 5.0, "review": "I Love this item. It works great on my non-smart tv's.", "verified": true, "helpfulness": "0/0", "author": "Lana Anderson"}, {"rating": 5.0, "review": "I am loving it", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 5.0, "review": "Love it! Exactly what I expected. and what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Alice"}, {"rating": 5.0, "review": "Easy to set up and begin using.  Haven't yet really explored all it can do, but looking forward to doing so.  I am currently deep into Downton Abbey so I am a happy camper.", "verified": true, "helpfulness": "0/0", "author": "Donna J. Wessel"}, {"rating": 5.0, "review": "Zero complaints. Beats my chromecast dongle all the way back to the junk drawer. My only regret is not buying 3 of these. The remote makes all the difference in the world, chromecast is reliant on your phone or PC to function. This little guy is a steal at the 39$ price tag. Well played amazon, well played.", "verified": true, "helpfulness": "0/0", "author": "MyProductReview"}, {"rating": 5.0, "review": "Great product and easy to use. Get the most out of movies from Amazon and Netflix, music and more. It's right there at your fingertips. Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Roberta Brown"}, {"rating": 5.0, "review": "Very easy installation.", "verified": true, "helpfulness": "0/0", "author": "Nancy Bloom"}, {"rating": 3.0, "review": "It met our expectations to an extent. We are able to see many interesting \"partials\" of dozens of documentaries, films and TV shows. We really enjoy seeing one to three minutes of an hour-long documentary, so obviously it suits us. An added bonus is that the menu is diabolical; one cannot get back to the main menu of a channel at all. You have to uninstall and reinstall the whole system to get back to each menu every single time. But yes, good apart from that.", "verified": true, "helpfulness": "0/0", "author": "F. C. Hawke \"nzfiona\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Girmantas Urbonas \"Girmis\""}]