[{"rating": 5.0, "review": "Absolutely thrilled with this purchase. Great price too!", "verified": true, "helpfulness": "0/0", "author": "Ann-Marie Weaver"}, {"rating": 3.0, "review": "does not seem to be has many channel choices has Roku. Amazon prime is not has good has it is advertised either.", "verified": true, "helpfulness": "0/3", "author": "Mike"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "james cade"}, {"rating": 1.0, "review": "I want to start by saying I do a lot of business with Amazon and 99% of the time they are great. This experience has not been. This product is garbage, dead on arrival... This product didn't work right out of the box. After troubleshooting w/ included questions such as does your TV have an HDMI input... Are you kidding me!?!?!? They are currently sending me a refurbished stick itself but not the cord... They will replace my brand new item with a refurbished one because \"statistics show I am less likely to have issues with it than a new one\"... I had issues with this due to the fact the problem could be in the power cord but they refused to simply replace the whole unit. Terrible experience and it isn't over yet.", "verified": false, "helpfulness": "0/0", "author": "Chris G"}, {"rating": 5.0, "review": "It works like Apple TV", "verified": true, "helpfulness": "0/0", "author": "Gloria Mahame"}, {"rating": 1.0, "review": "I sent this back without ever getting it to work. I kept getting a message that my wifi was connected, but \"with problems.\" A search online turned up no reasonable solution, and I already had the Fire TV, which works great.", "verified": true, "helpfulness": "0/0", "author": "Anony-mouse"}, {"rating": 4.0, "review": "Better value than Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "G. Basarkar"}, {"rating": 5.0, "review": "Setup was easy, it connected to my new non wireless TV via my wireless router down stairs. I am a Netflix, pandora, and amazon prime member and those apps worked fine.I can sling my tablet and laptop screen to it similar to chromecast. Best of all it is self powered via the TV hdmi port it is in.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pleasantly surprised...Pros:- Fast device- Always on- Wakes up my TV- Great apps- Media plays almost instantaneousCons:- Can't see anyI have it working an my older WIFI router, which is 54Mbps but that's more than enough (HD streams only require a fraction of that bandwidth)My Roku is now in my travel bag (slower, less options).", "verified": true, "helpfulness": "0/0", "author": "Seattle Hiker"}, {"rating": 3.0, "review": "HDCP unauthorized is an error based around the mistaken thought that the signal is being recorded/pirated. After much experimentation I realized there is a quick fix that Amazon help doesn't know about. Unplug your tv for 3 seconds. That's it. Just a quick unplug will clear the buffer or what ever in the TV that is triggering the stick to think the signal is being recorded. This buffer will clear by itself after a while somehow, but I want to watch TV on my time. 5 stars if it worked without fault, 1 star if I didn't spend hours figuring this out, and 3 now that I know. Amazon, I hope this helps you figure out how to fix it.", "verified": true, "helpfulness": "0/0", "author": "Mss. Effect"}]