[{"rating": 2.0, "review": "Virtually no instructions with it.  Still haven't been able to figure out how to connect to my Netflix account through which I have video streaming.  There is a huge delay when using the remote.  Sometimes it take 15-20 seconds before a change on the screen occurs.  Wish I would have gone with a Roku.", "verified": true, "helpfulness": "0/0", "author": "Howard O Ward"}, {"rating": 2.0, "review": "Mine freezes all the time and sometimes even cuts off I also feel like the remote is unresponsive a lot of the time kinda horrible if you ask me", "verified": true, "helpfulness": "0/0", "author": "zach"}, {"rating": 5.0, "review": "Set up was very intuitive. The wifi setup worked immediately. Browsing and selecting movies is also easy. I have not tried it in a hotel yet.", "verified": true, "helpfulness": "0/0", "author": "Josef"}, {"rating": 2.0, "review": "Its decent, but not great. I don't like how they mix paid shows and movies in with actual \"free\" ones (ones that come with Prime membership). I'd prefer to have an option to completely disable / hide any and all paid TV / movies.Most important to me is that you will not be able to stream local content from your local network to this device. It just won't happen.The only way you can get around that is by paying for a separate Plex membership then installing the plex app on this device.Choosing to not allow local media streaming is a big bust for me.", "verified": true, "helpfulness": "0/0", "author": "Adam H"}, {"rating": 5.0, "review": "It was simple to install on our Directv system and Comcast internet. Just followed the directions.", "verified": true, "helpfulness": "0/0", "author": "Paul Saindon"}, {"rating": 2.0, "review": "Amazon's streaming content is too small. The free month is enough time for a person working full time and out of the weekends to get through all of the content worth watching. It does not stream any computer content to your TV either. Buy the Chrome.", "verified": true, "helpfulness": "0/0", "author": "Kjel Horneland"}, {"rating": 5.0, "review": "It's great!!  Easy set up and streaming in no time!!  I Would recommend!!", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 2.0, "review": "Very disappointing. The original and this replacement constantly freeze, especially on Hulu. It's practically useless aside from music.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great.  Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Jiminator"}, {"rating": 4.0, "review": "Good stuff.  Unable to sync with android device?", "verified": true, "helpfulness": "0/0", "author": "Douglas Perrin"}]