[{"rating": 5.0, "review": "I love it! Works fantastic.  Easy install.", "verified": true, "helpfulness": "0/0", "author": "S Sandstrom"}, {"rating": 5.0, "review": "The more I use it, the more I love it.  All the apps that are available on it really surprised me.", "verified": true, "helpfulness": "0/0", "author": "Michelle Tilton"}, {"rating": 5.0, "review": "Worked perfectly.  Better than the Xbox one for music and Netflix. Easy to use . Amazon prime is the way to go. Love it.", "verified": true, "helpfulness": "0/0", "author": "SDC Carpentry"}, {"rating": 5.0, "review": "Fire TV Stick is awesome! I subscribe to Sling TV and get to watch all of my favorite sports. I cancelled cable TV and now pay a mere fraction for Sling TV and Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "D Smith"}, {"rating": 5.0, "review": "Delivered earlier than expected... Awesome...love it", "verified": true, "helpfulness": "0/0", "author": "Bridgette"}, {"rating": 5.0, "review": "I love the fire stick for all it has to offer.better than the \" chromecast \" certainly!  But hate the data charges for having one on all the tv's in our home.  I had no idea how much the data charges for the wifi in our house would be.  This is a hindsight that I offer as advice before", "verified": true, "helpfulness": "1/1", "author": "j.price"}, {"rating": 4.0, "review": "Love the thing!  About the only thing I do not like is Sling, aside from that I'm super pleased.  I was disappointed that the new Kindle HDDX was that that it had no HMDI outlet.  Who needs it with the Fire Stick?  I also use straight antenna TV so that I can get channels that are otherwise not available on cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kreader\""}, {"rating": 1.0, "review": "we thought we could get free movies with it  if we can, please tell us how", "verified": true, "helpfulness": "1/4", "author": "Janice Stuart"}, {"rating": 5.0, "review": "Worked well", "verified": true, "helpfulness": "0/0", "author": "Suzanne Amick"}, {"rating": 5.0, "review": "I. Love. My. Fire stick. It has made watching my favorite shows and movies so much easier. How did I live before I had this thing?!!", "verified": true, "helpfulness": "0/0", "author": "angiwarern"}]