[{"rating": 4.0, "review": "Let me start with I like it a lot. Like a LOT. However I will say I am coming from a chrome cast and the only way on the Fire TV stick I have been able to cast MY media on the TV (for instance to share a recorded video but same issue for YouTube vidios) is screen mirroring but that is easy to accidentally exit from and some videos are not the desired shape and all. Over all though it is a FANTASTIC little device it is better than the chrome cast in almost every way. I like the home, the apps, the the fact it has a remote, and lots of other things that set it apart. I would 100% recommend it but do be warned of the casting issues.", "verified": true, "helpfulness": "1/1", "author": "Kenneth Laster III"}, {"rating": 5.0, "review": "Less than five minutes from opening the shipping box to watching Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amy Towery \"Nonna\""}, {"rating": 5.0, "review": "I just wish I had fast enough broadband to where I could use it. A quality product with super nice features.", "verified": true, "helpfulness": "0/0", "author": "KyGoods"}, {"rating": 3.0, "review": "While it works great for the home, the form factor and size are ripe for travel. However, with no web browser, logging into hotel WiFi is impossible. Hence the low score.", "verified": true, "helpfulness": "0/0", "author": "Alan Stone"}, {"rating": 2.0, "review": "I thought this would be a great thing for me. Currently, I use my Wii to watch Netflix. I thought this would be better; it's smaller and can access Netflix, plus I'd be able to watch the Prime movies. However, I'm not impressed at all. It requires an extremely high speed internet and if something else in the house is using the wifi, it won't load my videos. It buffers every few minutes. My Wii works a million times better. Luckily, I got this during a sale for only $20. Should have saved my $20. I'm extremely disappointed.", "verified": true, "helpfulness": "1/2", "author": "Ariel Raia"}, {"rating": 5.0, "review": "Only used once so far.  Will also try in our other house - with only DSL service.  (Worked very well with FIOS)", "verified": true, "helpfulness": "0/0", "author": "Pines guys"}, {"rating": 5.0, "review": "Bought mine at the $20 price when first launched.  It works well and I like having the included remote.  At the $40 price point I'd probably go with a Chromecast if you don't mind casting.You can side load other apps on this fairly easy.", "verified": true, "helpfulness": "0/0", "author": "Bimmerman"}, {"rating": 5.0, "review": "Greatest thing to TV since the invention of the flat screen! I LOOOOOVE this unit: small, unnoticable and easy to install. Just plug it in, plug the provided USB power cord and adapter in, turn your set on to the apropriate input selection, and follow the prompts! You get complete access to all of your library contents, Prime contents, purchases, music, and New-Release Movie rental. I love that I can use it for my Netflix account, too . . . not that I really NEED it with all the stuff I can access on Prime.", "verified": true, "helpfulness": "0/0", "author": "G. E. Glau"}, {"rating": 5.0, "review": "I ordered my Fire TV Stick because I like using Amazon Prime content on my Kindle Fire HD.  The setup was quick and easy.  My only problem was getting audio to work thru my receiver.  The tech I talked to at Amazon wasn't sure if I could plug the Stick directly into my receiver.  So I searched online, and found that the competitors were able to connect directly to receivers.  So, I gave it a try, and it worked GREAT.This little device is very fast and easy to use.  I was afraid my wifi would not be fast enough.  But movies stream without any buffering or voice lag.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is beyond a doubt the easiest technology device to install and get up and running. WOW!!  It probably took a whole 5 minutes!  We're on our 2nd movie already. LOVE it!!!!", "verified": true, "helpfulness": "0/0", "author": "Pam Shaver"}]