[{"rating": 4.0, "review": "Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Brian Deshazer"}, {"rating": 1.0, "review": "I do not like the fact that I pay for a subscription and still need to rent/purchases TV shows, Movies via Amazon Instant movies. I have the Fire TV Stick on one TV currently and it will be replaced with a ROKU. No subscriptions required to gain access and NETFLIX seems to be the best option I have seen so far. No extra charges required for their movie or TV library. Disappointed with the Amazon portion of streaming movies and TV.", "verified": true, "helpfulness": "0/0", "author": "Michael Manning"}, {"rating": 5.0, "review": "I don't know how I lived without this thing. I was about to by a new $1800 TV so o didn't have to keep my laptop hooked to my TV. Very happy I came across this.", "verified": true, "helpfulness": "0/0", "author": "jay wadino"}, {"rating": 5.0, "review": "So easy to use ...basically plug in and everything is there.  Great purchase for my Amazon Prime since my TV and STB were not compatible.", "verified": true, "helpfulness": "0/0", "author": "roseanne tasso celic"}, {"rating": 5.0, "review": "Just got so far works great.  No problems so far. Only had a week.", "verified": true, "helpfulness": "0/0", "author": "S. DeJaeger"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jim Wall"}, {"rating": 3.0, "review": "I would give it more stars but you can't connect any devices to it like a phone to stream the news but my wife and kids love it", "verified": true, "helpfulness": "0/0", "author": "rob"}, {"rating": 1.0, "review": "It only works on one of my tv's. The other 2 tv's, it comes to the home screen then just blacks out. One TV is an older flat screen, about 6 years old, one TV is brand new- weeks old, and my tv that's about 4 years old it works fine on. I'm annoyed it doesn't work on my main TV in the living room- that's what I got it for since I cancelled cable and am now just streaming. I can only stream in my bedroom. 😔", "verified": true, "helpfulness": "0/0", "author": "Caitlin Krombach"}, {"rating": 5.0, "review": "If you love TV your gonna love this", "verified": true, "helpfulness": "0/0", "author": "jb"}, {"rating": 5.0, "review": "This is an amazing alternative to cable TV!!!", "verified": true, "helpfulness": "0/0", "author": "Stacy"}]