[{"rating": 4.0, "review": "This is undoubtedly a wonderful product, but for whatever reason, we have not used it much since we bought it. We took it on vacation a few months ago and were able to watch shows from our motel, but haven't used it since.", "verified": true, "helpfulness": "0/0", "author": "Chrowl"}, {"rating": 5.0, "review": "I love love love this! It is the first piece of technology I have ever owned that was as simple to set up AND worked the first time!I am looking at getting rid of cable and only having internet, and this allows me to access multiple free and paid subscription options.", "verified": true, "helpfulness": "0/0", "author": "AB"}, {"rating": 5.0, "review": "Works awesome. Easy to use remote and simple setup", "verified": true, "helpfulness": "0/0", "author": "B. Wilson"}, {"rating": 4.0, "review": "works great so far...just wish there weren't so many movies that u have to pay for when you're a Prime Member.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "Great productDoes everything it claims to doI would purchase again if needed", "verified": true, "helpfulness": "0/0", "author": "Anthony Turner"}, {"rating": 4.0, "review": "Great product.  Shipping went very well.", "verified": true, "helpfulness": "0/0", "author": "Jim Griffin"}, {"rating": 2.0, "review": "When it works it's awesome but it tends to lose signal very often....and it is not from my wifi signal because if the fire stick loses signal I use my computer to stream shows and it works just fine.... Not worth the $30", "verified": true, "helpfulness": "0/0", "author": "Marco Manuel"}, {"rating": 1.0, "review": "I had to buy 2 Fire Sticks for my 2 HD TV's. They did noy have enough range, even with a range extender, to be able to access my modem. I returned both of them to Best Buy where I bought them.", "verified": false, "helpfulness": "0/0", "author": "Walter"}, {"rating": 4.0, "review": "Works better than expected! I find myself watching so much more TV now. Wish the FireTV Mobile App's keybord worked better, because typing with the 4 buttons on the actual remote is a bit annoying. Sometimes the interface runs a bit sluggish, but overall it's not bad at all.Definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Brandon Strouphauer"}, {"rating": 5.0, "review": "is the coolest thing", "verified": true, "helpfulness": "0/0", "author": "vicky Lynn Ruppe"}]