[{"rating": 5.0, "review": "Everything and more.  Easy to use, great value, we love it.", "verified": true, "helpfulness": "0/0", "author": "myfaith"}, {"rating": 5.0, "review": "Love my Prime", "verified": true, "helpfulness": "0/0", "author": "Scott Davis"}, {"rating": 1.0, "review": "I can not connect to my paid Spotify connection without an Android or IPhone. Even tried the voice remote. This was the reason I bought firestick. I read it had the best sound quality and wanted to hook Spotify to my surround sound. I was able to just log in and use it with midcontinent. What gives?", "verified": true, "helpfulness": "0/0", "author": "Wendy Burton"}, {"rating": 4.0, "review": "Just wondering when exactly HBO GO will be available on the Stick? Can't decided to either save the 60$ and just get the stick or get Fire TV so I can have HBO GO.", "verified": false, "helpfulness": "0/0", "author": "Presley"}, {"rating": 5.0, "review": "I purchased this because I  wanted to try the prime service and it was the most cost effective way to try it on my TV. I have apple TV as well and since I purchased the Amazon fire stick I have yet to turn on my apple TV this does it all and can play android games on there as well. For the price you can't go wrong. A definite must buy. PRIME SERVICE is also amazing. Shipping in 2 days for free.", "verified": true, "helpfulness": "0/0", "author": "ricardo rosario"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "owenmichaels"}, {"rating": 4.0, "review": "Works well. Would like remote control to have more details on it.", "verified": true, "helpfulness": "0/0", "author": "anna"}, {"rating": 5.0, "review": "Easiest way yet to watch streaming media. Can't believe how easy it was to set up and use.  Worth every penny, the only issues are that it is too easy to purchase something with the remote and the app keeps restarting on my phone and making my phone lag.  Other than that it is an all around win.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "not expecting too much, i have found that the shows and the movies I have seen provided me some great entertainment.The firestick was easy easy easy to install, although they said it would be setup, I had to manually enter all my info for prime.It is simple to use, simple to control, and simple to go thru the menus, even with netflix and hulu.BUT, there is a lot of stuff for free or $1 less than Direct TV movies.I personally like it a lot.", "verified": true, "helpfulness": "0/0", "author": "maddawgmurph"}, {"rating": 5.0, "review": "From the first day it arrived I started using it .It's was very easy to install and starting instructions very easy to follow was watchingamazon prime in minutes.", "verified": true, "helpfulness": "0/0", "author": "margo"}]