[{"rating": 5.0, "review": "Everything I expected and more. Looking forward to trying out the gaming on it.", "verified": true, "helpfulness": "0/0", "author": "Bryan Chen"}, {"rating": 5.0, "review": "Best Christmas present ever bought for the hubby!", "verified": true, "helpfulness": "0/0", "author": "peggy carter"}, {"rating": 3.0, "review": "Allows to finally make use of my Prime membership benefits for movies and shows but I wish that it wSnt just a glorified rental app like Apple TV. No discounts and maybe one season is available for viewing. I mean, I get more bang for my buck with Netflix.", "verified": true, "helpfulness": "1/1", "author": "bcjofre"}, {"rating": 1.0, "review": "My wife gave me a Stick for Christmas. I can't connect it, even though my TV is flat screen, HD, and less than 7 years old. I had to give it to my son. I'm very disappointed!", "verified": false, "helpfulness": "2/6", "author": "P. Pratt"}, {"rating": 1.0, "review": "This device has been a nightmare. The first TV we tried it on it couldn't connect to our WIFI. We figured the signal wasn't strong enough. We moved it to a TV in the same room as our wireless router and it still would not connect. Tried a third TV and it finally connected. (This one was the same distance from the wireless router as the second TV, weird). Pulled up netflix just to try it out. Started playing something and within a minute the TV started screeching and the screen went white. After trying it on three TVs I decided this was not worth the money. I only paid $20 for it, but it was so bad I would prefer to have my $20 back. Forgot to mention before that the stick corrupted to HDMI capabilities on the second TV we used it on and now we can't get our normal TV channels in HD. So in reality it has ended up costing us more than just the $20.", "verified": true, "helpfulness": "1/4", "author": "Ashley M."}, {"rating": 4.0, "review": "Great alternative to traditional HTPC.  Definitely get full use with amazon prime (which is great on its own anyway).  Only issues I have is a few hiccups with WiFi comm, though that could also be partly due to my router, and an easier way to power cycle the device without having to fish for and unplug cords would be nice... built in sleep function is nice for saving power, but does not provide a full reset option.", "verified": true, "helpfulness": "0/0", "author": "Matthew Graeff"}, {"rating": 5.0, "review": "I gave the First TV Stick to my boyfriend for Christmas and absolutely love it.  I'll be honest, at first I had an idea of what it was and what it did but didn't 'get it' 100 percent.  But, I hooked it up in a matter of minutes, and had it figured out and working moments later.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Tracy Toccalino"}, {"rating": 3.0, "review": "I really like the fire stick. However, I have had it for a little over 3 months and the remote is having issues. Basically the buttons are sticking making it difficult to navigate with ease which causes the Fire to select  a program I did not want to select. Of course the warranty is only 3 months so I am out of luck according to Amazon... not the quality I expected.", "verified": true, "helpfulness": "0/0", "author": "G.G. \"As above, so below\""}, {"rating": 1.0, "review": "This is my updated review: since I've had this a bit now and have traveled with it, I have a much lower opinion of it. The whole point of this device versus the Fire TV is its more compact and easier for travel. However, when traveling in hotels and you need to connect to their wifi, you won't be able to. Almost all hotels offer wifi but you still have to log in on a web browser type screen. Amazon hasn't offered this pop up or browser screen capability. So when you connect to the wifi, you will see it connect but with problems because you can't complete the final step. So, for portability/travel this device SUCKS. Especially since it's not even usable.Original review: This is a very neat device, and since I'm a Prime member, I can get a ton of free shows, movies, etc. easily. I love the portability, and ease of setup. I have had no streaming problems or access issues. It works precisely how it says it is supposed to. I didn't see that I'd need a power cord for it initially, and was a bit annoyed at first, but since the cord can be hidden, I don't care.", "verified": true, "helpfulness": "0/0", "author": "Jessss \"I read to find stories that inspire more for my life; more adventures, more expeditions to new places.\""}, {"rating": 2.0, "review": "I use my fire stick for screen mirroring because I don't have Wi-Fi, so I can't really comment on the built in apps.One of the things I can start by commenting on is that figuring out how to screen mirror took a Google search. Even after finding out how to do it, it's still not a very convenient method, multiple menus and options before you get to it..Now for the audio. Sometimes it goes out in the middle of watching something, sometimes it's not there at all. I'll have to disconnect screen mirroring, then reconnect to get it working. Other times it starts to sort of crackle and break up.Other than that, sometimes the scene will freeze on the tv, while it keeps playing on the mirroring device, again having to disconnect and reconnect to make it work.Basically, it's better than nothing, but I wouldn't say it's good.", "verified": true, "helpfulness": "1/3", "author": "Jim"}]