[{"rating": 4.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Joachim E Kumedzro"}, {"rating": 5.0, "review": "It's amazing.", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 5.0, "review": "Opened up our media room experience", "verified": true, "helpfulness": "0/0", "author": "Daniel T Kwelberg"}, {"rating": 2.0, "review": "For this you have to have the patience of a dead snail.  Takes exceedingly long to manuever through various resources, i.e.; summary of a movie; you must select the movie wait for the information to appear which is generally a sentence. Then returning to start process over again.  Should you attempt to go from TV to Firestick takes a long period.  I have seen that written in reviews while not using electrical plug to power stick.Also, I did not buy the Firestick from Amazon.Com.  I purchased it at Staples which was $10 cheaper.I will give this to my daughter and grandchildren see how much patience they have.", "verified": true, "helpfulness": "0/0", "author": "Dale"}, {"rating": 5.0, "review": "I haven't noticed any difference in quality compared to the Fire TV, even with Plex.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey N. Cravener \"El Jefe\""}, {"rating": 5.0, "review": "This lil thing is amazing! I cannot recommend it enough.  Super easy to set up.  Super easy and intuitive to use.  I never have buffering issues like I used to when trying to watch netflix on an older Blue Ray player. If you are having buffering issues while streaming amazon or netflix I would give this a shot!", "verified": true, "helpfulness": "0/0", "author": "JJ Johnson"}, {"rating": 5.0, "review": "Excellent device!!!Does what i expected to!", "verified": true, "helpfulness": "0/0", "author": "wilfredo nunez"}, {"rating": 5.0, "review": "Amazing!! It is a must own. It's so easy and simple to use. It's very well worth the price you pay.", "verified": true, "helpfulness": "0/0", "author": "Mario Cordero"}, {"rating": 5.0, "review": "Great !", "verified": true, "helpfulness": "0/0", "author": "bvaron"}, {"rating": 5.0, "review": "This works great for watching Netflix on the TV. It stopped working one time and all I did was to log out of my Netflix and restart it and it has worked fine since.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]