[{"rating": 2.0, "review": "I love the FireTV stick.....when it works. My device is located about 8 feet from my WiFi router, yet it constantly loses the connection. Some have suggested uninstalling any new apps, but that didn't help.  Restarting the device does help, but having to restart it several times a day is, to me, unacceptable.On the plus side - I love the user interface, and the streaming quality is fantastic.  I own a Roku, a Chromecast and a PS3 and I prefer streaming over the FireTV Stick to all of them - when it's working.If a firmware upgrade could take care of the bugs, I would gladly update my rating to 5 stars.  As it stands, I have to stick with 3.***UPDATE 7/20/2015***The stick has gotten much worse in the last few weeks. The network connection continues to drop, and many apps - like Watch Disney - are useless. I purchased another Roku today to feed my streaming habit.", "verified": true, "helpfulness": "1/1", "author": "BigDad5150 \"BigDad5150\""}, {"rating": 5.0, "review": "I would suggest getting the Fire TV stick over the Chromecast or Roku TV stick (especially if you are a prime member since it ties in prime instant video, music and photos). It is well-built, comes with a remote, and has a lot more power compared to the other streaming sticks.", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 4.0, "review": "Been a nice when to watch both Amazon and Netflix shows without having a smart tv", "verified": true, "helpfulness": "0/0", "author": "matthew woods"}, {"rating": 5.0, "review": "I got it for 20 bucks, great value. Like the interface.", "verified": true, "helpfulness": "1/1", "author": "Simon Guo"}, {"rating": 1.0, "review": "Orefer roku for the price", "verified": true, "helpfulness": "1/4", "author": "Alejandra K. Seluja"}, {"rating": 4.0, "review": "I've never owned the Fire TV box but I have owned several other streaming devices. The Fire TV stick is a strong competitor amongst the others (mainly Chromecast and Roku). The picture quality is truly 1080p - crystal clear wifi streaming.PRO #1: The setup is so easy a 5 yr. old could do it.PRO #3: Very fast interface...other competitors interfaces moved slower.PRO #4: Price cannot be beat.PRO #5: I left the main menu on and left the room for a few minutes just to come back to a stunning - life like - screen saver on the screen. Awesome feature. So much better than the other whose screensaver is their logo - blah boring!CON #1 -  The USB cord that comes with it is on the short side and may be a problem for some whose televisions aren't within 2 - 3 feet of a power outlet. Even the extension they include is super short - not much of an extension at all actually. Solution to this would be to purchase an Amazon mini-USB cord that will reach from your Fire Stick to your electrical outlet (about $5).CON #2 - The ability to mirror Ipad or Iphone is not available. Only available through Miracast which is on Android only. Really wish I could mirror my iPhone but not a deal breaker for me as this feature is coming soon to IOS - how soon - don't know - but at least it's in the  works.OVERALL the Fire Stick is slightly better than other streaming sticks available on the market. The price is what makes this stick a firm competitor. Why pay more!", "verified": true, "helpfulness": "0/0", "author": "S. Steele"}, {"rating": 5.0, "review": "It makes my HDTV act like a Smart TV. I will like it much better when I purchase my new Kindle tablet and can use the second screen function. For now I am just using it with my Prime account to watch movies. It is super easy to use. The grand children think it is awesome. My kindle tablet is one of the 1st generation Kindle Fire HD models with an HDMI output so I cannot fling to a TV. When I Amazon offers an 10' HDX with 32GB or 64GB at the price I want to pay then I will have everything. It is nice to use the Fire TV Stick and a 19\" HDTV on my boat to watch movies at the Lake. I use a 4G Hotspot for Wi-Fi. We are soon going to try using this set-up while traveling in our van to keep the kids entertained.", "verified": true, "helpfulness": "1/1", "author": "Dave Barbara"}, {"rating": 5.0, "review": "Very useful device when you have an Amazon Prime membership. It's also very small and you can't see it behind the TV at all. Many numerous features we haven't even scratched the surface of using. Overall very happy with this purchase. It's been much more useful than the Google Chrome I purchased a year ago.", "verified": true, "helpfulness": "0/0", "author": "Eric English"}, {"rating": 5.0, "review": "Guess room doesnt have cable. This works great.", "verified": true, "helpfulness": "0/0", "author": "jayson"}, {"rating": 5.0, "review": "So far I love it!I just got this fire stick. Installed easily. Make sure you first have an amazon account so you can sign in.Make sure you have a wireless router as this has to hook and works with wireless. I bought two of these, one for me and one for my mom. She does not have a wireless Linksys so I had to buy one of those for her (in addition to the fire stick).Also make sure you have an HDMI port in your TV. Okay, duh ...We all like this fire stick and can't imagine that we waited this long to get it. The movies are great and I like the fact that I can put something I am watching on hold and come back at a later time to see the rest without losing my place.I recommend it.", "verified": true, "helpfulness": "1/1", "author": "Soapy \"Soapy\""}]