[{"rating": 4.0, "review": "So i picked this up as an amazon prime member even though I already have two apple TV's (2nd and 3rd generation).  Still we moved to a new apt and I now have a TV in my office so I figured, why not?  The price was too good not to try it ($19 vs. $99 for another Appletv).  The product works as advertised and plays well.  It feels fast and smooth.  The remote doesn't let you speak into it and I haven't figured out how to connect a laptop to it so right now i'm slow typing onscreen.  Theinterface is very clean and quality of the media it puts out is quite good.  As a prime member, i've been playing with Amazon prime music lists and they show up nicely on it.  I also found that it picked up my PLEX account instantly after I purchased the app for $1.99.  Once done, i found i could stream all of my movies that i have stored on my hard drive (see attached pic).The remote works well and feels FAST.  In the whole experience seems pretty strong.It's hard when you live in one world (aka Apple) and have to bridge to another (aka Amazon).  For the most part I'm an apple mobile user (active on both Iphone and Ipad) but i have to say that Amazon is making a pretty good run at knocking down the barriers.  Their cloud app even uploads my iPhone photos to the amazon cloud so they are all available on the Fire TV Stick (a nice extra win).Pro's:Startup was a breeze and took less than 10 minutes with no written instructions.Plays well with other media such as my PC based movies and photos from my Iphone.Lets me put Netflix on my HDTV without spending hundreds of dollars for a \"smart TV\".Challenges:I don't how to broadcast my PC to it (like i can using airparrot to send me laptop screen to the appletv).I'm not sure how to hook a bluetooth keyboard up to it.Certain menu elements aren't relevant to me and I'd like to be able to turn them off to clean up the screen (like I can with channels in AppleTV).Overall:  At this price, it's hard NOT to recommend it.", "verified": true, "helpfulness": "11/12", "author": "Stuart Kerr"}, {"rating": 2.0, "review": "The apps cover completely the menu on the left, so I never know where I am.As soon as I am done watching something, it immediately starts playing whaterver is next...maybe I dont want to see what is next! Can I choose what to see next?The remote is confusing to use and made out of cheap plastic. The ergonomics is horrible.The icons cover half of the the TV screen horizontaly, leaving a lot of real state unused.It is loaded with useless crappy apps that you have to buy.The only thing that I like is that it is realy easy to install 3rd party apps like Kodi (XBMC) right out of the box but it is not compatible with iOS products.For the price, I give it would give it 3 starts, but for the user interface it deserves 1 as it blocks me to se the main menu with its hughe icons and the poor use of the whole TV screen.", "verified": true, "helpfulness": "1/2", "author": "Poonhunter"}, {"rating": 5.0, "review": "Beyond my expectations.  3 times better than using a DVD/Web player.  Better screen interface than enything I have used.", "verified": false, "helpfulness": "1/1", "author": "William McMillen"}, {"rating": 5.0, "review": "Works well despite marginal WiFi signal strength. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "teeparties"}, {"rating": 4.0, "review": "This design of the so-called \"Chromecast killer\" is not as it is to be expected. First of all, it requires to be perfectly horizontal or vertical if it is NOT that way it will not communicate correctly with your wireless router. This is why they had included the extender it is like the BUMPER of the iPhones for reception.....When it DOES work it is awesome and a lot of fun. It needs some design changes when it comes around for the 2nd version of the fire tv stick.... This is very limiting in the way it works, first of all unless you have a PS3/4, 2013 Samsung HDTV, Their Fire HD tablets, or an android device do not expect to miracast (screen mirroring) your device. I bet Sony and Samsung paid good money during the R&D; part of this device so they can get the ability to work on this device.Update:With this cable http://www.amazon.com/gp/product/B0069R1BCY/ref=od_aui_detailpages00?ie=UTF8&psc;=1 You can get it as far away from your tv and with a double back tape you can tape it vertically to you wall and it will work without flaws. Now it has a real problem with noise of any sort. I have my TV Stick taped to my wall in a perfect vertical (90° orientation) and no flaws in fact this is the fastest I seen it play videos go into HD which was an issue before, playing games are flawless, using apps like YOUTUBE is flawless too.AMAZON What were you thinking that a 3\" cable was going to help. 1 star off for that brilliant idea..... (Sarcasm) So the fix is the cable aforementioned above and I only $10.99 but talk to tech support to see if they can help you with this.There wouldn't of been such an issue if they'd designed the radio part of it better..", "verified": true, "helpfulness": "0/1", "author": "Suntop Kinseeker \"Sometimes you need to question everything you are told...\""}, {"rating": 5.0, "review": "This Fire stick is great. I purchased it when it was half off for $20. I plugged it in yesterday. It was very simple to install.  Everything loaded very quickly. There are a ton of TV and movies to watch on Amazon Instant Video. I see myself using this very often. I think it's great I can use my Prime membership on my TV now instead of just on the Kindle, so I'm really excited to catach up on some TV shows and movies! I would highly recommend this to any Prime member to utilize the membership even more. I'm glad I got it for $20 but I probably would've paid more for it.", "verified": true, "helpfulness": "0/0", "author": "CLM"}, {"rating": 4.0, "review": "Easy set up. Great picture. 1080 picture is nice and crisp. The only reason I give it 4 stars is the remote. First, the remote is extremely sensitive. So when you go to scroll for shows you may end up past where you want to stop. The second problem is you can not use any other remote. This one can not be \"learned\" by another so you are stuck with having to use this or the app ( which is a little bit of a pain to use as well, though the voice search is kind of cool.). I don't like having a bunch of different remotes and enjoy using a universal to control everything. Less to lose. Beyond that it was a steal at the promotional price and not a bad deal at the regular. It is not obtrusive and some of the newer TVs have a special HDMI port that provides power, so on those TVs you may not need the plug. It des include and HDMI extender cable in case the stick can't fit easily in TV. Use full if your HDMI is in the back and there is little clearance when hanging the television. You can stream anything from the cloud as well as the new Prime Music. ( Which you can also do from the Amazon App on the competitor's device.)", "verified": true, "helpfulness": "0/0", "author": "D. Brant"}, {"rating": 4.0, "review": "Great alternative to box top streaming sets. LOVE seeing Amazon shows on a TV screen and not just a computer!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"brianr007\""}, {"rating": 4.0, "review": "Nice and smooth UI...Had issue with remote not working. Amazon replace the remote with no problem.", "verified": true, "helpfulness": "0/0", "author": "Roy Johnson"}, {"rating": 5.0, "review": "Works really well, nice interface and remote works!Streaming quality is good.", "verified": true, "helpfulness": "0/0", "author": "Puneet Jain \"Puneet\""}]