[{"rating": 5.0, "review": "The device works well.  The remote is simple and easy to use.  It can also be run off a mobile phone application. Set up was simple.", "verified": true, "helpfulness": "0/0", "author": "bookreviewer"}, {"rating": 5.0, "review": "use it daily for prime movies. Easy to set up, easy to use, remote works great without missing a beat. I also have the google chrome, which is difficult to set up.", "verified": true, "helpfulness": "0/0", "author": "Den \"Spoke and Strings\""}, {"rating": 5.0, "review": "Set up was super easy. Streaming is flawless with no buffering. ( Note: I have a robust, better quality Wi-Fi router which absolutely makes streaming a better experience).As an Amazon Prime member we now have access to a vast library of content. The remote control is a major plus and it works great.Ready to roll !", "verified": true, "helpfulness": "0/0", "author": "RICKVOO \"Mr Handy\""}, {"rating": 5.0, "review": "Very easy to install, you just plug it in and follow the easy instructions on you TV.", "verified": true, "helpfulness": "0/0", "author": "Phyllis S. Beidler"}, {"rating": 1.0, "review": "If you do not live in the USA, DO NOT BUY!!!! Not only you can't see ANY movies, you also aren't allowed to load the YouTube app or the Crackle app o most any app, even though I have them on my computer and smartphone. The most you can do is load the Netflix app and a couple other apps that aren't really very exciting. I AM FRANKLY VERY DISAPPOINTED WITH THIS PRODUCT AND WITH AMAZON!!!I recommend you buy a Mini PC Google Android TV Dongle instead of the Fire TV Stick, it is a much, much better product!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"interested reader\""}, {"rating": 4.0, "review": "Works great for Amazon. Wish other channels shared features like voice search.Needs multi channel search like Roku.Better picture then my Roku.", "verified": true, "helpfulness": "0/0", "author": "MightyMike"}, {"rating": 5.0, "review": "I received the Fire TV Stick as a Christmas gift from my husband. When he found out that Amazon wouldn't ship the Fire TV Sticks again until January, he ran out to a big box store and purchased one of three that they had left.  Straight out of the box, the device was so easy to install. I plugged the stick into the HDMI port and put the batteries in the remote. I changed the input on my TV to HDMI 3 (The port that I plugged the stick into) Automatically, the Fire TV Stick began loading. I entered my wifi password and the Fire TV Stick started downloading and updating. After about ten minutes, that process was finished and I was ready to watch any movie or TV that I desire.  I have had no skipping, pausing, or loading issues like I experience with my Blu Ray player. I previously have used the Blu Ray player to stream Netflix. It was impossible to stream Hulu Plus on my Blu Ray player. It would skip, pause freeze, and reload. I actually unsubscribed to them after a few day trial using the Blu Ray player. I am now back with Hulu Plus.  So far, I have streamed Netflix, Hulu Plus, Crackle, Amazon Prime, and Showtime Anytime. I am in the process of adding all of the apps that I want to my Fire TV Stick.  I highly recommend the Fire TV Stick and I foresee the purchase of at least one more for my house.", "verified": true, "helpfulness": "0/0", "author": "msrusl"}, {"rating": 2.0, "review": "So many things could be better with a good software update. Amazon, if you're listening, please implement the following:1. Update OS to support 5.1 audio from apps like Plex.2. Implement an alternate screensaver that turns off the TV via HDMI-CEC.", "verified": false, "helpfulness": "0/0", "author": "liebezeit"}, {"rating": 1.0, "review": "Totally no connection with home network? Tried everything and follow instruction many time and still cannot connect through network. Hope that anyone can help me or probably throw in the bin. This is a piece of junk, don't waste your money.", "verified": true, "helpfulness": "0/1", "author": "Stephen"}, {"rating": 3.0, "review": "Will not stay connected to the wireless network even at three feet away.", "verified": true, "helpfulness": "0/1", "author": "Otis G Simmons"}]