[{"rating": 1.0, "review": "Every time I try to use it netflix tells me that I can not see that movie at this time. It's the same with every program, tv show or movie. If I look for the same movie on my fire tablet I can see all without a problem. What is the problem? If I can't see any movies I will have to return it. Any idea what is wrong?.", "verified": true, "helpfulness": "0/0", "author": "Diana Arguinzoni"}, {"rating": 2.0, "review": "I bought the Amazin Fire Stick after reading some great reviews. I have been a roku and chromecast user for a while and needed something to replace my aging roku. I did not want another chromecast as I really wanted access to watch prime movies on the device and wanted to try something other than roku. I received my Amazon Fire stick today and set it up once I got home. I was shocked to find myself blocked out of HBOGo and many other apps that are available for chromecast and roku are not available. I am disappointed to see that Amazon pushes its own content so aggressively that I have to look at their offering on the main screen. I also think the navigation is a bit lousy. The only good thing I can see so far is the processor is quite fast and the remote works nicely... Other than these two positives the Fire Tv is a crappy comparison to roku, Apple TV and chromecast.", "verified": true, "helpfulness": "0/0", "author": "PCS"}, {"rating": 2.0, "review": "We bought this about 2-3 months ago. Worked great at first...then, about 3 weeks ago, Hulu stopped working properly. We looked online, followed forum advice, did the troubleshooting, etc., and couldn't find a fix that lasted more than a day. This is not a problem Hulu (which, admittedly, has its own issues), as we're still able to use Hulu via laptop.Now, today, Netflix isn't working on the Fire stick, either. Just checked the Amazon user forum and it looks like this is a common problem without a real solution. Most people said they had to call Amazon customer service and argue with them until they sent a replacement. Frankly, I'm not up for this, especially for a product that seems to have multiple problems.Overall, the Amazon Fire stick is a great concept, but the execution is pretty poor.", "verified": false, "helpfulness": "0/0", "author": "E. Throesch"}, {"rating": 5.0, "review": "We did not want to purchase a video game console or HDMI monster cable to enjoy Prime streaming. Fire TV Stick went beyond my expectations! Very easy to setup up and use with the remote. I'm finally getting use of my Prime Account without the hassle of getting out the laptop and having the convenience of viewing on a large TV monitor for \"family/friend movie night\". I'm discovering new series to fall in love with every time I use it, like the Veggie Tales series for my little preschooler. Love that I can download apps to enhance the experience, for example I synced my Fire TV stick with my HBO Go account. Lastly, you can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "GloryB"}, {"rating": 2.0, "review": "Didn't pick up wifi worth a damn.  Amazon sent me a replacement, but it had the same issue.  Was less than 15 feet from router and was told these require a VERY strong signal.  When it did work (would cut in and out) the interface seemed ok, not quite as intuitive as I would have liked, but hard to say as it worked less than more.", "verified": true, "helpfulness": "0/0", "author": "TK421"}, {"rating": 5.0, "review": "Love the fire stick! Very easy to use and works well. Setup is easier when the unit is purchased from Amazon because your prime account is pre-loaded.", "verified": true, "helpfulness": "0/0", "author": "Leigh"}, {"rating": 5.0, "review": "Yes it did love it", "verified": true, "helpfulness": "0/0", "author": "Hermelinda Rodriguez"}, {"rating": 5.0, "review": "If your trying to decide between this and a roku definitely go with this its so much faster and Netflix looks awesome also if you load kodi with xmbc it makes this device incredible", "verified": true, "helpfulness": "1/1", "author": "Kevin Wisdom Jr"}, {"rating": 4.0, "review": "This is great for watching movies and TV shows, too bad amazon tv doesn't come with their own free basic TV and movies app for non Prime user's at least with some ad's like other free TV services.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 5.0, "review": "Love this product! Exceeded my expectations. Love that it comes with a remote unlike other similar brands. Cannot believe this product was so cheap.", "verified": true, "helpfulness": "0/0", "author": "Amy Zollars"}]