[{"rating": 5.0, "review": "Great item !", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "It's a lot easier than having to program the Blu-ray/DVD player. Plug it in, enter account information and voila! You're all set to view your Amazon Prime account selections.", "verified": true, "helpfulness": "0/0", "author": "JWW \"ballott\""}, {"rating": 4.0, "review": "Timely delivery,  many options to choose from.The only thing is I wish prime ha newer movies,  so many things have to be rented", "verified": true, "helpfulness": "0/0", "author": "Bradley"}, {"rating": 5.0, "review": "I love it works great and the set up was easy!", "verified": true, "helpfulness": "0/0", "author": "tiffany jones"}, {"rating": 5.0, "review": "Easy to install and use. I'm still figuring out all that it can do. Of the streaming sticks on the market, this seems to be the most powerful (for now). It works seamlessly with my Panasonic TV. I didn't get the voice-activated remote, so can't comment on that. I may buy a second one for the bedroom TV. N.B., If you have a Roku box or other set-top streamer, this is somewhat redundant.", "verified": true, "helpfulness": "1/1", "author": "Thomas \"tomjw217\""}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome device, wish I had tried it earlier - so glad to be part of the fold now", "verified": true, "helpfulness": "0/0", "author": "Lara Honeycutt \"Lara L. Honeycutt\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "muriel l wright"}, {"rating": 2.0, "review": "This is my 2nd go around with the fire tv stick. My first one kept freezing when watching shows, so I got it replaced (which Amazon was very good about), but my new one might be even worse. Sometimes it works perfectly, but more often than not it freezes a lot while watching things which is super annoying. It freezes primarily in hulu, but also does it in netflix. Not so much when watching amazon content, but when I do that the device apparently doesn't realize I'm watching something, so the screensaver goes on after a while. I gave it 2 stars, because it really is very nice when it works, but it just doesn't work well enough often enough.", "verified": true, "helpfulness": "0/0", "author": "Matt Pettis"}, {"rating": 5.0, "review": "I love it. We just use it for Netflix, but it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Autumn"}]