[{"rating": 5.0, "review": "Works great, easy install...Even shipped before original delivery date...", "verified": true, "helpfulness": "0/0", "author": "fireman65737"}, {"rating": 5.0, "review": "It's a perfect option to convert your TV into an Smart TV. I Love It!!!", "verified": true, "helpfulness": "0/0", "author": "plutyc"}, {"rating": 5.0, "review": "Works great in our RV along with a Verizon hotspot. Only issues are with some of the HD images, but that is due to the Hotspot reception.", "verified": true, "helpfulness": "0/0", "author": "David Crabtree"}, {"rating": 1.0, "review": "very disapointed that i am charged for a one hour program. this was not made clear.", "verified": true, "helpfulness": "0/0", "author": "theresa celek"}, {"rating": 3.0, "review": "I own an Apple TV, LG smart tv's, iPads, iPhones,etc. all these devices have no issues connecting from my living room to my router wirelessly. This has a little trouble keeping a good signal, but I can't complain bc it was free via the sling TV promo.", "verified": true, "helpfulness": "0/0", "author": "Elastible"}, {"rating": 5.0, "review": "This thing is sweet! It puts the Apple TV to shame.", "verified": true, "helpfulness": "0/0", "author": "Mike Steska"}, {"rating": 5.0, "review": "Very easy to instal & setup. So far happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Alistair"}, {"rating": 5.0, "review": "I have 2 smart tvs and a Roku, I bought the Fire TV stick so i can watch NBA league pass in my living room. I love the fire stick so much i am going to buy another one. The UI is easy to use and attractive. All of the Apps that I use are in the app store. The ability to load screensaver apps is underrated. You can play music (from your cloud or Pandora) while a gorgeous 1080p view of a waterfall plays on your screen (great for writing or a social gathering at the house).Before I received my FS I wondered if the picture quality when streaming videos would be able to stand up to the quality on my smart tv (which is connected by a fast Ethernet connection) I have been very happy with the quality of videos. I generally get HD or super HD while watching Amazon or Netflix content. Some times league pass content quality will be less than HD but most of the time that is not an issue.I love the fire stick, it does everything that i need it to do and more, it is easy to use and a no brainier if you are a Amazon prime member.The advice i would give is is this:1) Buy a second voice remote control, the control that comes with the FS is good but having the voice option would be awesome. You can use the Amazon TV app but if you are like me and use your phone a lot, it is annoying to keep opening the app2) Use the USB dongle that comes with the fire stick it is much easier than running an outlet to the device (and you get an extra micro USB charger for your phone or kindle)", "verified": true, "helpfulness": "0/0", "author": "Sooner1906"}, {"rating": 4.0, "review": "If I could rate this product 4 1/2 stars I would but it doesn't allow that. Many features with this cool little device and my sons love the PBS Kids app. I don't have the Amazon game controller and I feel as if that would make this product more enjoyable (for games). This is perfect for a spare bedroom or for a TV in the kids room, lots of cool features. If it could totally replace my current cable subscription I'd rate is 5 stars. I'm still playing with it and learning how to use it. So far, I feel very pleased!", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "So far, so good! Works great!!", "verified": true, "helpfulness": "0/0", "author": "DLM"}]