[{"rating": 5.0, "review": "This is the streaming device the world has been waiting for. No lag, great layout and most of all, you can play Spotify on it. THANK YOU AMAZON!!!!", "verified": true, "helpfulness": "0/0", "author": "Tristan 474"}, {"rating": 5.0, "review": "We have the Chromecast already but our Fire TV stick just arrived.  It is so amazing and has much more functionality than the others.  It took seconds to set up (plug it into the wall without complaint - it is WORTH the superior performance) and in the minutes since we have set it up we've played games, streamed Pandora, and started watching Prime video.  We are an Apple family (every parent and child has a MacAir, iPad and iPhone) but I also love Amazon (we have 4-5 kindle and kindle fires) even though the functionality is never as good.  This is the exception.  Plug and Play - amazing product.  Well done Amazon!  Now if only my invitation for the Echo would arrive....We just ordered the game controller too.", "verified": true, "helpfulness": "0/0", "author": "CJ \"Roswell Resident\""}, {"rating": 5.0, "review": "Price was half off...great deal", "verified": true, "helpfulness": "0/0", "author": "J.Marsola"}, {"rating": 5.0, "review": "I have two of the Fire TV Stick and we love them , one of the best things I have ever done , we love watching all the new moves, it is a must have.", "verified": true, "helpfulness": "0/0", "author": "Mike Mills"}, {"rating": 3.0, "review": "This is a nice addition to my streamers and seems to work as well as the FireTV; however, the big reason I bought it was for its portability and \"certified\"  Miracast connectivity. I have been in search of the best and most stable Miracast adapter and hoped this would be it.The Miracast connectivity requires the use of the remote and entry to a special screen that you access through settings at the very end of the scroll down.  Should you have to reconnect it, it cant be done seamlessly.  You cant simply go to display/mirror.  The device can not be located absent a two step process, which makes its value less and process cumbersome.I was able to connect my Fire 7\"HDX without issues and the connection was stable and no lag for movies.I was not able to connect either a Samsung Note 8 or Sony Z3 compact tablet with Android 4.4.  They both showed connected momentarily but I only had a black screen and then disconnected.Conceivably this is a portable device you can take with you on trips, etc.  However, because full power is required beyond a TV USB connection and a remote, if you have an iPhone. It adds two more items to pack or potentially forget or leave behind.As an aside, I was able to power from the TV's USB port but it only filled half the screen.", "verified": true, "helpfulness": "0/1", "author": "Mark J"}, {"rating": 5.0, "review": "Initially ordered from Amazon.com but ......have to wait until January !!!!!, bought from BestBuy....and I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kabelek"}, {"rating": 5.0, "review": "Set up was easy. It does all the functions that are advertised and then some. The picture quality is amazing. I highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "DR Count"}, {"rating": 2.0, "review": "While it is nice to have access to Youtube and Netflix without using a laptop, support for some of the apps is missing from Xfinity.  The device has a habit of losing the network connection requiring a reboot and occasionally loses the login credentials for some apps.The combination of the user interface and limited remote control means that you will spend a lot of time navigating to what you are looking for.", "verified": true, "helpfulness": "2/2", "author": "Broward"}, {"rating": 1.0, "review": "I am a big Amazon customer, Amazon Prime member, owner of two Kindles and just about everything I purchase comes from Amazon.  At $19 I have never been so disappointed in an item.  It just plain does not work.", "verified": true, "helpfulness": "2/3", "author": "Lisa PM"}, {"rating": 3.0, "review": "The firestick itself is a decent product, but I'm really finding out that Amazon doesn't really have the content that I want, so am spending more time on YouTube watching the shows that are posted there legally, for free.  amazon, apple, netflix, hulu all need to get the content straight or your paying as much for 5 different content providers as you are for regular cable and still have to wade through a clunky UI to even find shows.These companies really need to get it together.  Glad this only cost me $20 or I would be very upset.", "verified": true, "helpfulness": "0/0", "author": "HoustonTexansfan"}]