[{"rating": 5.0, "review": "We absolutely love the fire TV stick!", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 4.0, "review": "I actually own a fire stick, roku stick, and chromecast, and I think this might be the best overall package.  Fastest UI I've seen of any media streamer and the kindle UI actually works great for this sort of thing.  Wifi radios are top notch as well.  Only con I'm seeing is the fact you have to pick your Amazon account to register too and you can't switch accounts without deregistering.  Need a user switching system.  Of course that's my issue with Prime Instant Video in general.  Signed up for Prime on my account realizing I can only share the 2 day shipping, not the instant video.  Since My wife has a kindle Fire HD, I ended up switching the Prime account to her account, and I took the free 2 day shipping.  However I have a ton of games on my amazon account I can't access because the firetv is logged into her account so we can watch her instant video.  Overall the fact you can't share your prime instant video with the rest of the family is a major fail on Amazon's part.  Even Netflix has user accounts.  So I'm taking off 1 star just because of that!", "verified": true, "helpfulness": "0/0", "author": "Cory D. Wilson"}, {"rating": 5.0, "review": "Easy to set up. Lots of apps to use! Awesome.", "verified": true, "helpfulness": "0/0", "author": "Dwight Otis"}, {"rating": 5.0, "review": "What a great Christmas present.", "verified": true, "helpfulness": "0/0", "author": "Tracee"}, {"rating": 3.0, "review": "Question what what is the differen between fire TV stick & amozon fire tv?", "verified": false, "helpfulness": "0/0", "author": "fatimo"}, {"rating": 4.0, "review": "I purchased this to use on a Vizio TV where I seem to have trouble getting streaming to work glitch-free using the native controls.  This is an improvement...  but not glitch-free.  For some reason, fairly frequently when I'm watching Hulu content, the picture will freeze while the audio plays on.  I have to back out of the program and go back into it to clear the error.  I use a Roku for Hulu in another room and don't have that issue, so I assume that it isn't caused by my network.  That said, I like the user interface and you can't beat the introductory price to Prime members, so I'm glad that I got it.", "verified": true, "helpfulness": "0/0", "author": "KimberReads"}, {"rating": 4.0, "review": "This really needs to be two reviews, one for the remote and one for the actual stick.First the stick, it's pretty awesome.  We were looking for something to replace our Roku 2.  We weren't terribly fond of the Chromecast as its hard to pick something to watch together since all the interface happens on your phone.  The FireTV stick does Netflix and Amazon and works perfectly acceptably with our TV.  Installation is simple: plug it in, setup Wifi, watch intro video, done.  Mine, at least, came already paired with my Amazon account so I didn't even need to set that up.  The interface is intuitive and the Netflix app allows for multiple profiles (which the Roku app doesn't) so I don't have to see the recommendations for romantic comedies in my profile any more.  About the only thing I could really ask for is a Google Play Music app, but that's probably on Google to provide.Now, the remote: it's terrible.  The directional buttons are, at best, mushy and at worst non-responsive.  I keep hitting the home button when I mean to hit enter which drops me out of whatever I'm doing, though, that's probably a muscle memory issue that I'll get used to.  The remote is also too thin so it isn't terribly comfortable to hold.  I haven't tried playing any games with the remote but, at this point, I'm not sure that I'd want to.  Coming from the Roku remote this feels like a pretty major step backwards (I wonder if I can pair the Roku remote with the FireTV stick... hmm).  Providing a better remote would make this a 5-star device.", "verified": true, "helpfulness": "0/0", "author": "Alex K. Corscadden"}, {"rating": 3.0, "review": "Hulu keeps pausing, don't have that trouble with other applications, just Hulu. Very frustrating, going back to the Apple TV. I bought it on sale for $24.99, so it was fine for the price.  Feel I got what I paid for.", "verified": true, "helpfulness": "0/1", "author": "M. Kressin"}, {"rating": 5.0, "review": "Love this product!fast streaming!lots of aditionals features!!!", "verified": true, "helpfulness": "0/0", "author": "Victor Chalas"}, {"rating": 4.0, "review": "I bought this, pre ordered, to replace a 4 year old obsolete Roku. I just got around to installing it.Technically. it's a five star. Crystal clear HD, no buffering on 5mbs DSL. If you are into Amazon prime video or music, this is the way to go. There are apps for most \"channels\" including HBO and Showtime  and appear to be supported by most large cable and sat networks EXCEPT comcast. I assume this will change.I hit a snag getting it to link to wifi: I don't use a password but instead keep the wifi network hidden. Once I changed the setting on the modem, it hooked right up. I downloaded the iOs app for iPad remote control and that seems to work well, also.This device seems more oriented toward Android devices and OS including the capability of mirrored wireless video between devices. Not so with an iPhone or iPad (yet) For this reason, ONLY, I am deducting one point. I was hoping for this feature but can live without it.All said, it's far superior to my Rokuosaur which was state of the art 4 years ago. I would recommend this, especially for prime users with android phones/tablets... The price is certainly right!", "verified": true, "helpfulness": "1/1", "author": "Alfonzo's Amazon prime directive"}]