[{"rating": 2.0, "review": "It skips, and stutters, and now we can't even get it to connect to wifi anymore. It's telling us it's the wrong password, it's not. Won't connect at all. I'm annoyed, and hope they have some type of update SOON.", "verified": true, "helpfulness": "0/0", "author": "Mike & Jaimie"}, {"rating": 4.0, "review": "Not bad for a stick, but does not compare to the Roku 2 and 3.  I paid for the Plex app and it does not work, but I don't think that is the Fire stick's fault.  However - beware of purchasing apps for this if they do not have a free trial to test with.  I have to assume that because this is so new that the developers don't have the experience that they have with their Roku counterparts.  This comes with a great flexible HDMI adapter in case you only have a side-mounted port on your TV that would make it stick out past the frame.  The remote feels more fragile than does the Roku remote.", "verified": true, "helpfulness": "0/0", "author": "Jim Schuuz"}, {"rating": 5.0, "review": "Exactly what I expected.  Better than Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Frank Robles \"sonicspd\""}, {"rating": 5.0, "review": "Works great, bought during the initial promotion.  Lots of options for kids shows, i would recommend it for that reason alone.", "verified": true, "helpfulness": "0/0", "author": "Barnes"}, {"rating": 3.0, "review": "We  bought the stick to compete with our already owned chromecasts.  We wanted to have the current Plex functions with the added Amazon Prime videos and music.  The first thing I noticed was that the Plex functions are in an app that you have to purchase.  Already being a Plex lifetime subscriber, I was hoping to be able to just log in and use Plex, but alas you have to pay the 5 dollars for the app from the Amazon store.  Five dollars isn't the issue, but it did seem like it was touted as a feature, not a pay feature.  The Amazon video playback is smooth and works well.  The Plex app crashes quite a bit and is about a year behind the actual Plex app that you purchase from Plex.  Other than that, the thing works fine.", "verified": true, "helpfulness": "0/0", "author": "Michael O'Brien"}, {"rating": 5.0, "review": "Set up was simple.  I took the WiFi booster and plugged it into the Fire Stick.  Then I took the power cord and plugged it into the stick and then plugged the power into the wall outlet.  Turned on the TV and placed it on HDMI.  The Fire Stick popped up on the screen and asked if I wanted to continue.  Then it searched for WiFi signals.  I found my Home Network, typed in the Password Paraphrase.  Then I was on the internet and the Fire Stick searched for updates.  It was that simple! ! ! !I am very pleased with my $20 purchase and it workes better than my BluRays.  They are constantly buffering and with the Fire Stick it has only done it a couple times on different show my daughter was watching and it was as quick buffer not 20 or 30 seconds like the BluRays do.The only down fall I see is that it does not have any type of browser pop up to allow me to connect.  The reason I say this if I take it on vacation and try to hook it up to their WiFi.  I have to accept their terms and agree to them by clicking on a browser pop up.  Maybe in the near future Amazon will create this so it is available because that wouled be great to be able to do that while you are on vacation to entertain the kids , Hmmmmmm", "verified": true, "helpfulness": "0/0", "author": "R. Griffin"}, {"rating": 3.0, "review": "I bought during Black Friday and It has met my expectations with the cost of $25.  I have been having trouble with the remote so I have been forced to use the app from the phone.  I didn't renew my subscription to Prime because of the prince increase and the lack of content...I was happy to see the videos I purchased were still in my library. I plan on buying the Chromecast to compare.", "verified": true, "helpfulness": "0/0", "author": "narose \"nar9311\""}, {"rating": 4.0, "review": "Picked this up on the $20 Prime member special when it was first announced. Great for the price. Like the Roku 2 & 3 more - primarily better interface and search. This is nice for the size and portability. I have no experience with the similar Google Chromecast or Roku sticks so can't do an apples to apples comparison with those.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "I really like this compared to my Roku and Samsung smart TV. It is much more responsive when you change of look for apps. My favorite is the selection of nature, fireplace, and snowfall apps. They are better than the Blu-rays I have. Also if you use the radio app, instead of displaying the radio station logo it does a slide show of beautiful pictures. I am hoping  to see more and more apps such as Drama Fever. For a tiny stick that plugs into your HDMI port, this thing rocks.", "verified": true, "helpfulness": "1/1", "author": "Lance"}, {"rating": 5.0, "review": "Easy to install and use. Streams all the things. This is my first Amazon device. I recommend if you have Amazon prime and Hulu or Netflix", "verified": true, "helpfulness": "0/0", "author": "Martinez"}]