[{"rating": 5.0, "review": "I got this for a bedroom tv where I didn't want a blue ray player or any other cumbersome apparatus for picking up Amazon Prime and Netflix.  I haven't really explored any other options since I got hooked on Orange is the New Black.  Maybe when I finish up with that I will explore some more but for my purposes it is perfect!  Wi-fi signal in this bedroom is fairly weak compared to the living room but it picks up just fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What a great product!  This does everything that a roku does but with much more ease of use and has so much more to offer as you can stream to this device also!  I am slowly buying enough of these to replace all of our roku devices!  Great job on this Amazon!", "verified": true, "helpfulness": "0/0", "author": "Coxxy8"}, {"rating": 1.0, "review": "Unfortunately, the connectivity issues are ever present. I was hoping that the update would help, and it did for a bit, but now I'm back to watching a show 30 minutes at a time. Bit annoying when it comes to movies. Sadly, the stick disconnects from my wireless repeatedly and once it start, it does so at more frequent intervals.When it works it's great, but be prepared to be constantly frustrated and having to restart your device frequently.", "verified": true, "helpfulness": "0/0", "author": "Irene Sakellarakis"}, {"rating": 2.0, "review": "I really like the on-screen interface and the remote is very user friendly....BUT...it crashes frequently in the middle of movies or shows. We thought our internet speed might be the problem but we also have a Google Chromecast and it never happens, nor does it happen on our sons's PS3 or our Blu-Ray player. I have updated it each time a \"fix\" is released but no improvement so far.", "verified": true, "helpfulness": "0/0", "author": "Deacondarling"}, {"rating": 5.0, "review": "I love having access to all of my media sources in one place.", "verified": true, "helpfulness": "0/1", "author": "Gloria N. Bean"}, {"rating": 4.0, "review": "a nice easy application", "verified": true, "helpfulness": "0/0", "author": "robie"}, {"rating": 4.0, "review": "Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Derek Morley"}, {"rating": 5.0, "review": "This device works exactly as advertised.  Super easy to set up and allows you access to all of the programming from Amazon.  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Robert R. Bradley"}, {"rating": 5.0, "review": "One of the best purchases I have made.  I will order a second one for my study.  Eventually, I hope to completely replace my cable with this great device. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "RCM"}, {"rating": 1.0, "review": "Returned it.", "verified": true, "helpfulness": "0/0", "author": "Lee"}]