[{"rating": 5.0, "review": "Just what I was hoping for.  Nearly turned our TV into a smart TV.  Highly recommend this to anyone that has Amazon Prime.  It can be somewhat difficult to browse for movies but there is a search option that can be utilized for searching by Title, Actor, Genre etc.  Flexibility to easily move this from one TV to another is nice as well.  Great addition to get even more out of my Prime account.", "verified": true, "helpfulness": "0/0", "author": "Andrew McLallen"}, {"rating": 5.0, "review": "This is my second one and my third is on the way....love it, love it, love it. Easy set up and now I have more choices...Getting rid of the high priced cable package...basic is all I need now.", "verified": true, "helpfulness": "0/0", "author": "jackie"}, {"rating": 5.0, "review": "So far so good! Easy to install even for this non-techie person.", "verified": true, "helpfulness": "0/0", "author": "J. Creamer \"wanttolearn\""}, {"rating": 5.0, "review": "I haven't tested it. What is prime? What are these monthly fees?  I thought I was to seefree movies. I already pay $8 a month for Netflix?  Your information regarding thisproduct is in adequate, I'm no idiot but I don't really know what I bot.  Joe", "verified": true, "helpfulness": "0/0", "author": "Joe.L."}, {"rating": 5.0, "review": "So easy to set up!  Can move it from room to room.  It's great!!", "verified": true, "helpfulness": "0/0", "author": "L. Ortego \"Colby's MeeMee\""}, {"rating": 5.0, "review": "Super simple to use", "verified": true, "helpfulness": "0/0", "author": "~rustin~"}, {"rating": 4.0, "review": "Voice search does not work with the Netflix app. Other than that, the Fire stick TV is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Alan Sizemore"}, {"rating": 1.0, "review": "I was very disappointed by the fire stick.  It should be have indicated that you need to be a prime member to get everything offered on the fire stick. If you aren't a prime member it isn't worth buying.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Fire TV Stick! Have been using it for about two weeks and haven't had any problems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to install and use. We love it.", "verified": true, "helpfulness": "0/0", "author": "Chuck Maro"}]