[{"rating": 5.0, "review": "Exactly as described.Works great no problems.Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 5.0, "review": "I bought this as a gift for a disabled relative that can't use a \"normal\" remote control cable box.This allows her to select/control the TV with her I phone. It works well and was easy to setup.If you have streaming subscriptions, this is a perfect fit. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "kahunascout"}, {"rating": 5.0, "review": "Yeah!", "verified": true, "helpfulness": "0/0", "author": "Geneva"}, {"rating": 5.0, "review": "Very nice!  Very Easy to work with.  No more trips to the Video Store!", "verified": true, "helpfulness": "0/0", "author": "RONALD"}, {"rating": 5.0, "review": "I LOVE IT! So useful to stream netflix and play fun games right on your tv. So happy i bought this!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Ortiz"}, {"rating": 4.0, "review": "The best part of the Fire TV Stick was how easy it was to set-up and connect my different accounts to. However, the search feature is not great within the different 'apps'. In order to search you have to scroll through a linear line of letters and if you want to delete you need to scroll all the way to the right of the letter list. While the search function is dynamic and will pull up titles as you enter in letters so you don't have to type an entire title, I wish that this list was more like Apple TV's search input.  Some of the apps you also have to activate online (using a computer, phone or tablet).", "verified": true, "helpfulness": "0/0", "author": "Kailey R."}, {"rating": 4.0, "review": "I love it !!", "verified": true, "helpfulness": "0/0", "author": "Noelia Araujo"}, {"rating": 5.0, "review": "This is the best device for your TV. Easy and fast interface. We have one at home and one on our boat.", "verified": true, "helpfulness": "0/0", "author": "Caryn Carson"}, {"rating": 3.0, "review": "nice but stick gets pretty hot", "verified": true, "helpfulness": "0/0", "author": "Miguel Ramirez"}, {"rating": 4.0, "review": "working out very well and will make for an easier transition when I cancel my u-verse. there is a bit of lag in some of the movies while watching ever with my high internet speed. does not cause a problem for me.", "verified": true, "helpfulness": "0/0", "author": "none"}]