[{"rating": 4.0, "review": "Sometimes sluggish", "verified": true, "helpfulness": "0/0", "author": "Joseph Nugent"}, {"rating": 5.0, "review": "Better than AppleTV for me!", "verified": true, "helpfulness": "0/0", "author": "William Torres"}, {"rating": 4.0, "review": "I got what I expected and in a timely manner. As a Prime Member this works really well with my personal watching habits (Netflix & Amazon Prime) and at a cheaper price than its competitors. However,  I am disappointed that there is currently no Vudu app, alas I will survive.", "verified": true, "helpfulness": "0/0", "author": "Erica Grado"}, {"rating": 4.0, "review": "Works as expected.  I gave it 4 stars because I have to put the code in to access amazon videos/shows that are already included with my prime. If there is a way to turn this off and only have the code for purchases I'd be happy to update my review to 5 stars.PS, don't use the code 12340, my 4 year old figured that out in about 30 min.", "verified": true, "helpfulness": "0/0", "author": "Mugzie"}, {"rating": 4.0, "review": "I bought the stick for my husband.  He was very pleased with it.  Now I will have to watch TV someplace other than the family room.", "verified": true, "helpfulness": "0/0", "author": "Kay K. Porter"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "william mathes"}, {"rating": 5.0, "review": "How cool is this device!!", "verified": true, "helpfulness": "0/0", "author": "Gail"}, {"rating": 5.0, "review": "Great Quality! And it has all the streaming options you could want", "verified": false, "helpfulness": "0/0", "author": "Emily Tucker"}, {"rating": 1.0, "review": "Do not buy this for a child. Go with Google Chromecast instead! I own both and bought the Fire Stick for my daughter to use because it has a remote and \"Hundreds of Free Shows and Movies\". Unfortunately Amazon does not separate it's paid content from its \"Included with Prime Membership\" content. So, its either restrict ALL or ALLOW ALL purchases. The Fire Stick's programming treats a free INCLUDED show/episode the same way it treats a paid one and they are intermixed. This means you either have to rely on your child (5yo) to make a decision to watch the free seasons of a program and not the paid seasons or you can put a password on that has to be entered before EVERY FREE SHOW! It would be better to have a RENTAL section for all the paid shows and a FREE or \"Included with Prime Membership\" section. Absolutely a fail on the part of Amazon. I will move the Fire Stick from my kids room and replace with a Chromecast as soon as I can. Oh, and the APPS that give you access to Disney & Disney junior require you to have the channel on your cable service provider then you have to log on to the web site associated with the app, create an account, and log into your cable provider. And, the Fire Stick App for your phone is useless still needs a lot of work once again Google does it better.", "verified": true, "helpfulness": "0/0", "author": "M. MCCAREY \"single man boston\""}, {"rating": 5.0, "review": "This thing rocks!!! Great quality and no lag! for what I paid 19.99 cant beat it!!", "verified": true, "helpfulness": "0/0", "author": "Ivan"}]