[{"rating": 5.0, "review": "I absolutely love my Amazon Fire Stick. I previously ordered the Google Chromecast and was extremely disappointed. The Chromecast was not fast took forever to load anything and wasn't available to stream my Amazon Prime videos. The Fire Stick is fast and has everything I needed in a USB cast! Definitely worth it, love my Fire Stick!", "verified": true, "helpfulness": "1/1", "author": "Brianne G."}, {"rating": 1.0, "review": "Since the v1.5 update last month my fire stick rarely works. Most of the time the device cycles between two startup splash screens (first \"Amazon\" logo, the \"Fire Stick TV\" logo) with 15 to 20 seconds of black screen in between. Every 3 to 5 cycles of that the main home screen will flash on the screen for about 3 seconds then go away. After that the cycle starts all over again.I think the update bricked my stick.If I'm lucky when the home screen is up for those 3 seconds I can push all the buttons on the remote and get to a secondary screen to see a prime instant video movie. However, 1 to 2 minutes into the video the whole cycle described in the first paragraph starts all over again. The stick must be in a reboot endless loop.I spent the last 30 minutes trying to find a support page for the stick or a contact person to ask about the problem but the search has been fruitless. That is why I am resorting to a customer review. Hoping customer service will see this and contact me.", "verified": true, "helpfulness": "0/0", "author": "Barry Nay"}, {"rating": 3.0, "review": "The amazon fire stick is alright. I love it because my TV in the bedroom is not a smart TV, but love the fact I can plug this device in and stream amazon prime and netflix. The only thing I do not like is the design where there is no volume button and you have to mange with a second remote.", "verified": true, "helpfulness": "0/0", "author": "sharkstark"}, {"rating": 5.0, "review": "Able to use Plex with no issues.  Enough said", "verified": true, "helpfulness": "0/0", "author": "Fred Mercury"}, {"rating": 1.0, "review": "Has to be reset weekly if not more often.  Freezes up constantly.  Remote buttons \"stick\" and will run up, down, sideways until you pretty much bang it on something to dislodge button.  Loses the wifi connection nonstop even though it says the connection is good to very good. When it will stay connected it buffers and takes forever to load. Thought it was worth the aggravation at first but I'm pretty sure I will be going back with cable/satellite very soon.", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Awesome product. I just wish it allowed me to access the internet with a browser.", "verified": true, "helpfulness": "0/0", "author": "John Manzella"}, {"rating": 5.0, "review": "Perfect for the Price. I have both Chromecast and Fire Stick and after using them quite sometime I think Firestick is quite useful and I use it more than chromecast. The main advantage is handy remote, nicely design and very productive.If you have prime this is the best streaming device you need, the photo feature is pretty good, all the cloud pictures can be watched on your tv.", "verified": true, "helpfulness": "0/0", "author": "S. Alluri \"The Gamer\""}, {"rating": 5.0, "review": "Loved fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Sandeep Shukla"}, {"rating": 4.0, "review": "I am disappointed because I am unable to get it working after installation  all the time!  I check the wiring connections  and it is connected correctly. What can I do? E-mail me at glochec54@yahoo.com", "verified": true, "helpfulness": "0/0", "author": "Gloria Alloggia"}, {"rating": 5.0, "review": "Works as described", "verified": true, "helpfulness": "0/0", "author": "aaron Buelt"}]