[{"rating": 5.0, "review": "I love this product. So far I have not really had time to play with all the features yet but it was super easy to set up and works fantastic.  It shipped really fast too.", "verified": true, "helpfulness": "0/0", "author": "Tina H \"Electricgal\""}, {"rating": 5.0, "review": "I love my Fire TV Stick.  I travel out of town three weeks a month for three nights each week.  Since you can now login to the hotel wireless network with the Amazon Fire and Fire Stick, Iget to watch all my shows with almost no stuttering or video degradation.  Amazon Fire Stick is one of my favorite technology products.  Small, lightweight, inexpensive and exceeded my expectations.  Way to go Amazon!", "verified": true, "helpfulness": "0/0", "author": "Stephen Seay \"projectstepsdotcom\""}, {"rating": 4.0, "review": "it is pretty good, it,s ok but it add up about the same as cable tv after you add all the different apps.", "verified": true, "helpfulness": "0/0", "author": "robert jenkins"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Christine Nunag"}, {"rating": 5.0, "review": "I have a Roku stick and a firestick.  They are both worth the money.  I prefer the firestick but I am glad i have both.  I prefer the sticks to the boxes like Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Robert W. Ritchie \"BobW\""}, {"rating": 5.0, "review": "Works great! Love it!", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 5.0, "review": "I am in love with this!  It has been easy to use.  I love being able to move between laptop, fire and TV with the stick.  I only wish that it came with 2 adapters to move between TV's easily as my HDMI slot is in an awkward spot on both", "verified": true, "helpfulness": "0/0", "author": "S. Roe"}, {"rating": 5.0, "review": "It took a few minutes to learn how to navigate the menu and video/movie choices, but the boot up was painless.  We did opt to buy a rental from Verizon vs. Fire because the SD on Verizon was $.50 cheaper, though it took 3 minutes to save that amount.  Next time will probably go ahead and pay the Fire price.", "verified": true, "helpfulness": "0/0", "author": "Don Long"}, {"rating": 5.0, "review": "Love it, wish I had gotten it sooner.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great, with prime membership a1 no complaints good job", "verified": true, "helpfulness": "0/0", "author": "Patrick O,Connell"}]