[{"rating": 4.0, "review": "As someone who has owned both a Chromecast and a Fire TV Stick:1. The Fire TV Stick is a BETTER BUILT device that is better for streaming video. The 1 GB of memory translates to smoother streaming and fewer lags. I have no issues streaming HD video from youtube, whereas I've had many issues with the Chromecast. It would sometimes take a few minutes for the Chromecast to buffer a short video and the quality was often very poor (240p or less).2. Remote is DEFINITELY a reason why you'd want to consider this device, as the Chromcast does not have one. I love having it so I don't have to find and access my phone or laptop or order to pause or select a video, and it's great for quickly perusing through the menus on youtube or netflix, etc. Keep in mind that the remote does not control volume though.3. As others have mentioned, the Fire TV Stick is not a mirroring device so it's capabilities are NOT perfectly identical to the Chromecast. So if you're looking to use your HDMI stick as a way to project what's showing on your chrome browser, know that Amazon's product will NOT do that.4. One thing I really like is the ability to make a video queue so you won't need to select new content as soon as your current video finishes. If you look at doing through youtube for instance the Chromecast is allows you to watch and make such a video queue simultaneously, while the Fire TV stick simply does not.Overall, I'd go with the Fire TV Stick as it's simply better for the most important feature of these HDMI sticks; streaming video fast and reliably. However, the Chromecast also lets you mirror so it has a few more features (excluding Amazon Prime Video of course), and is great for say, sharing a funny reddit thread on your TV so others can see it.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Great price!", "verified": true, "helpfulness": "0/0", "author": "Clare Kelly"}, {"rating": 2.0, "review": "V disappointing! Read the fine print. I bought a replacement remote that didn't work w the hmdi etc so I've git to manually switch betw tv and stick", "verified": true, "helpfulness": "0/0", "author": "Kathryn Simon \"katsoul11\""}, {"rating": 5.0, "review": "So incredibly awesome. I can watch good tv from any too with a tv in my house.", "verified": true, "helpfulness": "0/0", "author": "Wendy Y. Alas \"wendyalas\""}, {"rating": 5.0, "review": "Love it so far. I listen to Pandora, watch prime, although wish the list of movies included in prime was longer. I'll just use Netflix.", "verified": true, "helpfulness": "0/0", "author": "BroniB"}, {"rating": 5.0, "review": "Love the fire stick!  Set up was a breeze and it's so easy to use.  It's my new go to gadget!", "verified": true, "helpfulness": "0/0", "author": "M. J. Mears"}, {"rating": 1.0, "review": "Ours worked for a moth, but now won't register with the TV. Can I get this replaced via Amazon.", "verified": true, "helpfulness": "0/0", "author": "Shayna R. Adler"}, {"rating": 4.0, "review": "Its good so far", "verified": true, "helpfulness": "0/0", "author": "Donn Swiney"}, {"rating": 5.0, "review": "I love it. It's amazing. Buy one or two", "verified": true, "helpfulness": "0/0", "author": "Sam Bates"}, {"rating": 5.0, "review": "Love the fire stick.  However, the app to turn my cell phone into a remote screwed up my cell phone.  Even after deleting the app, phone not correct.  It deleted some apps pre installed on the phone by LG.  Now I have to back up everything and reset to factory specs and hope that it not only restores the missing apps, but that I can get my contacts, pictures and other stuff back again.", "verified": true, "helpfulness": "1/1", "author": "linda maguire"}]