[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "DRM"}, {"rating": 4.0, "review": "It met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Lynn M Braun"}, {"rating": 4.0, "review": "Works great! 4 stars because Amazon content is not available in Costa Rica, otherwise it would be 5!", "verified": true, "helpfulness": "2/2", "author": "Jose Barrenechea \"Jbarrene\""}, {"rating": 5.0, "review": "In love with my fire stick", "verified": true, "helpfulness": "0/0", "author": "redmama0321"}, {"rating": 4.0, "review": "I love it, other than the reception for wifi is a little short.  I have to have it plugged into the TV that also has our modem attached in order to get a decent signal.  We tried it in a room 30 feet from the modem and couldn't get anything to play.  Other than that it works nicely.", "verified": true, "helpfulness": "0/0", "author": "jab"}, {"rating": 5.0, "review": "Awesome!  Easy to use.  Great value.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Friend in PA"}, {"rating": 5.0, "review": "Bought this to use with an older HDTV. Set up was very simple, I was suprised how fast it responded and the remote works great also. The photo feature and the ability to listen to your music library is great. Looking forward to when it works with iOS. For the price I think this is a great device, especially if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Michael Fantigrassi"}, {"rating": 5.0, "review": "This is great. I originally purchased CromeCast, and it downloaded a lot on my laptop, and slowed it's response time. Fire TV Stick was easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Pammy \"Pam Emerson\""}, {"rating": 5.0, "review": "So in the portable media market you have three big players...  The Google Chromecast, the Roku Stick and the Fire TV Stick.  I happen to own all three and travel 3 our 4 weeks a month.  I'll run down the pros and cons of each.Chromecast:-Pros Smallest \"package\" (due to the lack of a remote) Works with just about anything you can view on your phone or PC-Cons Doesn't have a remote, you'll have to use you phone / PC and heaven help you if you are in a hotel with several WIFI hotspots and your phone hops over to another one. You have to find the media first and then send it to the device Doesn't have a browser, so you may want to bring a wifi router to get around sites with landing pagesRoku Stick:-Pros Has a remote Has a store for finding channels Has a ton of channels for just about every taste Netflix, Amazon, VUDU, HULU, Crackle, HBO GO, Google Play, DishWorld, NBA, MLB, ESPN, etc Can search across most of the main providers Some content is ad supported for free or pay a nominal amount to view it ad free-Cons The interface can freeze on occasion Finding channels can be a daunting task Many channels have OLD content Some content is ad supported for free or pay a nominal amount to view it ad free Doesn't have a browser, so you may want to bring a wifi router to get around sites with landing pagesFire TV Stick:-Pros Has a remote Has a store for finding channels / apps The initial offers of channels / apps seems limited, but it's all wheat, no chaff Netflix, Amazon, Twitch, HULU, Crackle, HBO GO (coming soon), NBA, ESPN, Flixster, Showtime, PLEX, etc The interface seems smoother and faster than the Roku Stick-Cons Finding channels can be a daunting task The initial offers of channels / apps seems limited Doesn't have a browser, so you may want to bring a wifi router to get around sites with landing pagesSo what do I use?I have been mainly using the Roku Stick, but the Fire TV Stick just became my favorite.", "verified": true, "helpfulness": "0/0", "author": "Brian Paige"}, {"rating": 5.0, "review": "this product is great", "verified": true, "helpfulness": "1/1", "author": "Clifford Johnston"}]