[{"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Melody Waters"}, {"rating": 4.0, "review": "works fine.", "verified": true, "helpfulness": "0/0", "author": "ray herron"}, {"rating": 4.0, "review": "i want to point out that i bought mine when that first started sell them and to prime member they where half price.  that being said i like.  work just fine better now the ios remote app is out.  travel better than my other media devices.  now just to compare i own a roku 2 and an apple tv.  so i can say the i uses those two a lot more than the fire stick.  but at the price that i got it it was a steal.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "I LOVE my Fire Stick!!! I use it everyday for streaming Netflix and Amazon Instant Video!!! Great quality, well for the cost!! I'd reccomend it in a heart beat!!! Thank You Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Eternalstormy"}, {"rating": 5.0, "review": "It was extremely easy to set up and I had immediate access to movies, games, TV shows, series and it just goes on. This will probably be replacing my cable service real soon.", "verified": true, "helpfulness": "0/0", "author": "Vicki Spaulding"}, {"rating": 5.0, "review": "I like the plastic so far but I'm still learning how to use. I do like the fact that all I need is Wi-Fi and I can connect my fiire stick anywhere even when I'm traveling..", "verified": true, "helpfulness": "0/0", "author": "Richardjones"}, {"rating": 5.0, "review": "At $20, this for me this was a cheaper, better chromecast. It is nice to have my Netflix, and prime video, and beaming up YouTube is great. The twitch stream app was an unexpected bonus, since we are big esports fans in my house.", "verified": true, "helpfulness": "0/0", "author": "Ari"}, {"rating": 5.0, "review": "Works very good, but a little different than my other 2 Rokus, so I have to operate differently...just took getting used to.", "verified": true, "helpfulness": "0/0", "author": "George Henne \"Submatey\""}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "CONNIE GRANDSTAFF"}, {"rating": 4.0, "review": "A little time consuming signing in and a little confusing, but once we were signed up, it worked great.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Bruce"}]