[{"rating": 5.0, "review": "My family is loving the Fire Stick.  I didn't realize how easy it was.  I would definitely recommend this to those who like to watch TV series but without the commercials.", "verified": true, "helpfulness": "0/0", "author": "D.K."}, {"rating": 5.0, "review": "Best investMent I've ever made. Disconnect cable. Keep Internet. Hello fire stick. I rarely watch tv. It's mainly for my 3 year old to watch cartoons. In which it has everything she watches. If u stay on \"prime tv\" it's all free. It will show u what is available if u are a prime member. You'd be stupid NOT to subscribe to prime. But that's just my opinion. I love it and I've gotten 2 others to drop their providers and go to strictly this too. '", "verified": true, "helpfulness": "0/0", "author": "Terika Reed"}, {"rating": 5.0, "review": "Good product, just what i expected.", "verified": true, "helpfulness": "0/0", "author": "Angrymrs"}, {"rating": 5.0, "review": "This is great! Very user-friendly!", "verified": true, "helpfulness": "0/0", "author": "Justin.Sam"}, {"rating": 5.0, "review": "This is fantastic technology.  I ordered two of these and they worked seemlessly once they connected to the network.  I am going to order a couple of the boxes as well, to free up WIFI space on my routers.  There are iOS like game apps for the kids, which they love (i.e. crossy road- aka \"Frogger\").  One more step towards negating the need for cable or satellite TV service.  If they could just figure out the sports (including PPV), we wouldn't need a TV service provider....", "verified": true, "helpfulness": "0/0", "author": "drmike5000 \"drmike5000\""}, {"rating": 5.0, "review": "I love this product. I also have a google chromecast, and let me tell you, there is no comparison. We use to have a playstation 3 that stopped working and we were devastated because we would use netflix and amazon prime on it. So our friends gave us the chromecast for christmas, and we were excited to try it. Issue with the chromecast, is you need to have the app of whatever you want to use on your phone or tablet or computer. The chromecast would continuously disconnect and using the app version on the phone or tablet, did not have continuous play. And you had to make sure your device was plugged in because this drains your battery. After all the issues, i decided to get the Fire. WOW! what a difference. It has a similar interface like the playstation and the apps are already on the stick. You have continuous play on it and you can see both amazon prime and netflix on the firestick, including youtube. The fact that this comes with a remote is even better because you can maneuver through the apps seamlessly. I would recommend this product to everyone.", "verified": true, "helpfulness": "0/0", "author": "k. pim"}, {"rating": 5.0, "review": "Yes it did", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect for our needs and great for traveling.", "verified": true, "helpfulness": "0/0", "author": "Melissa \"Melissa\""}, {"rating": 5.0, "review": "Better than Netflix", "verified": true, "helpfulness": "0/0", "author": "Gretchen H. Sockwell"}, {"rating": 5.0, "review": "I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]