[{"rating": 5.0, "review": "Love the Amazon Fire TV Stick.  It's a bit slower in the response time than the Set Top Box I originally purchased; but, I love the fact that it doesn't require an MDFI cable.  Just plug the Stick into the MDFI on the back of the TV.  Makes it cheaper too as you don't have the expense of the HDMI cable.  I can easily move the Amazon Stick between the kitchen TV and the bedroom TV.  I do have one small gripe about the Fire Stick.  I had to watch a You Tube video to make sure I was trying to open the remote correctly to insert the batteries.  I found it to be just about impossible to open as the fit is so incredibly tight.  I have RA which makes this process even more difficult so it was a study in frustration.  I bet it took at least 10 minutes to accomplish.  Also, the remote is so small, and short, that there is hardly anything to hang on to when you are trying to push the buttons on the bottom row.  I would guess that the small size will also make this remote easy to misplace/lose.  The Fire Stick is still a great product and the remote issues would not prevent me from purchasing a 2nd unit.", "verified": true, "helpfulness": "0/0", "author": "p zemlin"}, {"rating": 2.0, "review": "The tech works well, the UI is nice, problem is that most of the movies I want to watch are only available for purchase for $18-$20 (HD), very few are available to rent ($6 HD).  The other complaint I have is the per episode charge of $2-$3 for TV shows, that is rediculous, $ 0.99 should be the max charge for a single show.", "verified": true, "helpfulness": "0/0", "author": "F. Minus \"Agent007\""}, {"rating": 5.0, "review": "once again Amazon out does itself  always a great product at as great price", "verified": true, "helpfulness": "0/0", "author": "wesley sterne"}, {"rating": 5.0, "review": "It works awesome .", "verified": true, "helpfulness": "0/0", "author": "cevilla"}, {"rating": 4.0, "review": "The fire stick was easy to install but the offer of free movies for a month cost me 4.99 so I've stop prime.", "verified": true, "helpfulness": "0/0", "author": "stephen wright"}, {"rating": 5.0, "review": "Very easy to use and hook up", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jack Jarrell"}, {"rating": 4.0, "review": "Does what it says, fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Anita Hazeltine"}, {"rating": 4.0, "review": "Received free with Sling subscription.Fire TV Stick had problems finding my wifi and I had to move my tv out a little, even with the extender. The extender  isn't long enough to work, should be at least 6 ft to improve finding wifi away from an additional device (TV). plenty of nice apps for free and I received a year of prime for 49.00 instead of 99.00 because my hubby is a college student. Works better than expected and has screensavers that are nice as well.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 1.0, "review": "Disappointing considering the other offerings in the same price range. It seems to me that the chief function of this device is to sell additional Amazon products. I find the interface inferior and the remote control app problematic. I would think that I will replace this item within the next 6 months. I would replace it sooner but I do not want to go to the trouble of retuning it. It does function and is better than a poke in the eye with a sharp stick", "verified": true, "helpfulness": "0/0", "author": "James D. Kirk"}]