[{"rating": 5.0, "review": "Its the best love it!", "verified": true, "helpfulness": "0/0", "author": "joshua wagner"}, {"rating": 5.0, "review": "This worked great - although it seems to only work when plugged into power, and I thought it would work without.  So far that hasn't been a problem.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Leigh Berdrow"}, {"rating": 5.0, "review": "Love it!!  I was even able to install it myself.  Having Amazon Prime makes it even more special.  So many movies to choose from!", "verified": true, "helpfulness": "0/0", "author": "perfectday"}, {"rating": 5.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "marie carbone"}, {"rating": 5.0, "review": "great stick, extremely fast and makes it easy to access all of your favorite apps. No HBO, though - bummer!", "verified": true, "helpfulness": "0/0", "author": "lpjzsum182"}, {"rating": 5.0, "review": "I like the menu. It's much nicer than my Roku LT.", "verified": true, "helpfulness": "0/0", "author": "New home owner"}, {"rating": 4.0, "review": "Love it so far..kinda turns your TV into a smart one..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Eliminates the need for cable, especially when you are not a big TV viewer and you watch mostly online content. I love that I can use my TV and not my laptop for Netflix and Amazon movies....and YouTube. I like it better than my Apple TV first generation, because I have way more choices with the stick, and it is so small and easy to connect.", "verified": true, "helpfulness": "0/0", "author": "Carolyne P. Mas"}, {"rating": 5.0, "review": "Good product and easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Incredible selection. Extremely fast. Great picture. It's like getting an instantaneous, first-class film and tv collection. Set-up was dirt simple. Performance is beyond expectation. Fire TV Stick rules. Best deal ever seen at this price. So, now go get HBO on board and you're up for canonization!", "verified": true, "helpfulness": "0/0", "author": "JonBear"}]