[{"rating": 4.0, "review": "opens a lot more viewing material.", "verified": true, "helpfulness": "0/0", "author": "Richard H."}, {"rating": 5.0, "review": "This stick is perfect. It works well. I can watch anything. No more need for cable. You have everything you need in this lil stick. Only thing I needs a lil more memory.. But I love it", "verified": true, "helpfulness": "0/0", "author": "Shaminna M. Williams"}, {"rating": 4.0, "review": "Works much better than the so called SmartHub on my Samsung TV", "verified": true, "helpfulness": "0/0", "author": "Glen"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Brenda Perry"}, {"rating": 4.0, "review": "Easy to use but needs an electrical outlet which is a premium since I have a tv, blue ray player, and satellite box already using outlets.  On one TV it worked fine for the first two days then wouldn't connect to the Internet. I guess it just wasn't strong enough to get the signal like my chrome book can. I moved it to another TV and it worked fine.", "verified": true, "helpfulness": "0/0", "author": "Eric  Coulter"}, {"rating": 5.0, "review": "Love it! Canceled one of my direct tv subscriptions now I'm going to do the same with another tv and cancel that subscription. That being said, you have to not mind being slightly behind shows (but you could always watch the current Amazon shows ;-)  ) and have a great wireless set up.", "verified": true, "helpfulness": "0/0", "author": "Noelle"}, {"rating": 1.0, "review": "FireStick is awful. It buffers frequently on Netflix. But HBOGo is even worse. 1 minute of watching for 2 minutes of buffering. Totally Useless. I've done all the usual unplugging and clearing buffer etc. It just does not work.I have a 6 year old Roku box that works much better although it doesn't do higher resolution. I guess I just need to buy a newer Roku.Do yourself a favor and skip the Firestick. Unless you like frequent pauses in your viewing.", "verified": true, "helpfulness": "0/0", "author": "J. Freedman \"sarabandepress\""}, {"rating": 5.0, "review": "Haven't had it long, but so far so good.  VERY easy set up.  Took a few tries to navigate around (what buttons do what) but again, it's simple.  I have Prime, so nice to be able to see shows on the big screen vice my tablet.  It could have bigger buttons.", "verified": true, "helpfulness": "0/0", "author": "Brian A."}, {"rating": 5.0, "review": "really enjoyable on many levels", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was great I really liked it", "verified": true, "helpfulness": "0/0", "author": "Nathan Alston"}]