[{"rating": 3.0, "review": "Two stars less because:1. very difficult to open the remote to replace battery, ended up scratching it.2. It doesn't work with iPAD for streaming like Chromecast. Not sure whose dumb idea was it, when millions of iPads are being used in US.Otherwise, it is very good.", "verified": true, "helpfulness": "0/0", "author": "A. Reddy \"Khiladi\""}, {"rating": 5.0, "review": "Easier to use and much more versatile than my old Roku.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Wilson"}, {"rating": 5.0, "review": "Picture quality is amazing", "verified": true, "helpfulness": "0/0", "author": "johnnie rhodes"}, {"rating": 5.0, "review": "Good so far but restrictive in terms of apps available in comparision to google play store. It works for me as i am a prime member", "verified": true, "helpfulness": "0/0", "author": "MOHIT D."}, {"rating": 1.0, "review": "Minmy fire stick is not working. It says I have very good internet reception but will not download anything.", "verified": true, "helpfulness": "0/1", "author": "Dave"}, {"rating": 4.0, "review": "It's difficult to select photo albums to view, since every single directory is shown.  It would be better if you could go into a directory then subdirectories. For example, one may want to quickly find the Holidays directory, then Thanksgiving and finally the year.  The same could be said for People, then Family, then kids.", "verified": true, "helpfulness": "0/0", "author": "J. Sanctus-Filius \"Johannes\""}, {"rating": 4.0, "review": "Overall a great device. I had some problems with the network connection initially before I used the extender - this is somewhat understandable as our wireless Ethernet is quite far away from our TV. What could have been much better though is the error message we received - \"Connected with Problems\" is not the least actionable! Instead there should have been instructions telling us about the extender and how to \"reboot\" the device.", "verified": true, "helpfulness": "0/0", "author": "Mikael Horal"}, {"rating": 5.0, "review": "I picked up 2 of these during the pre-order sale. THEY ARE AMAZING!Instant access to Hulu, Netflix and obviously all the great media Prime has to offer.Not to mention all the apps you can install on this little thing. I have my plex running perfectly on it.I will never play games on it, so i can't comment on that, but the option is there.Roku is to slow and Chromecast doesn't even compare.i don't think you can beat this thing for $40. let alone the $19 i paid for them.", "verified": true, "helpfulness": "0/0", "author": "JW"}, {"rating": 5.0, "review": "Dual-core CPU and excellent software makes the Fire TV Stick the best of the 3 sticks being sold today.Better than the Roku stick, and Google's Chromecast.", "verified": true, "helpfulness": "0/0", "author": "zonker"}, {"rating": 1.0, "review": "so far...  this hasn't worked for me.  Our TV setup is a Samsung 51\" Plasma but it cannot connect to the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "monk"}]