[{"rating": 4.0, "review": "I've owned a Chromecast for a while and just picked up a Fire TV Stick.  I couldn't wait for my Amazon pre-order to arrive, so I bought one at Best Buy on sale yesterday.  The main reasons I bought it was because of Amazon Prime Videos and the remote, both lacking on the Chromecast.  One of the major annoyances of the Chromecast was trying to pause a movie, which required turning on your phone/tablet, entering your passcode, going into your application, waiting for it to sync, then pressing pause.  Fire TV Stick solves that with the remote, which I prefer for navigating and selecting movies/shows.  I would love to see them add more apps and content in the future.", "verified": true, "helpfulness": "0/0", "author": "True \"Jacobim Mugatu\""}, {"rating": 5.0, "review": "Look out, Apple! Amazon is coming for you...This device is amazing.  Well packaged, easy to set up, extremely fast, huge range of content.Amazon is crushing Apple lately with innovation.  This little Fire TV stick is an example.It's very well-priced and easy to setup and gives you access to Prime movies, music, TV and outside services like Netflix and Pandora.Pros:- Small, easy to attach hardware- good build quality- menus are easy to navigate- beautiful screens- synced with your Amazon account already- Netflix looks better on this than on Apple TV- less buggy than Apple TV- can access Amazon cloud photos if you want- great for musicCons:- no Spotify app (at time of writing)- plays through TV speakers only- voice activated control requires separate hardwareOur Apple TV box went to the island of misfit obsolete gadgets after we set up this amazing Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Paige Turner \"Paige\""}, {"rating": 5.0, "review": "It offers a lot more options than chromecast. Works great. My Fire Stick default to 720p. I need to manually switch to 1080p. Once that is done, the image looks sharp and clear.", "verified": true, "helpfulness": "1/1", "author": "Mingjie Zhu"}, {"rating": 5.0, "review": "one word: XBMC.  Once you sideload this on to it and add Geneis or Icefilm, heaven is found.", "verified": true, "helpfulness": "1/3", "author": "lord invincible"}, {"rating": 4.0, "review": "Well I don't review many item's especially here at Amazon but after my experience with this device and support I just had to share. Since I missed the initial units offered at Amazon there now backordered,  I found them at my local Staples store, so I figured I should have the same support being an Amazon product. I was pretty wrong with that assumption, my first Fire TV stick was \"broken\" (that's what support told me to tell Staples)  The second one works but the remote has messed up buttons (very hard to depress) I was told I need to take it back to Staples a third time and get another one..No if I take it back again it will be for a refund.  Amazon rep kept dinging me for buying it at Staples \"Well Sir you bought it at Staples\"  \"Staples would support the device not Amazon, if the remote doesn't work you need another Fire Tv Stick\"  I'm just too leery to bring it back and see what doesn't work on a third one, at least the stick works.  Then Amazon assumes I have a smart phone I don't \"you can just use any android phone to contral the device\" No this is why I got the Fire TV over Google Play.All that said it's not all bad, it has the streaming services I care about Netflix, Twit, and Amazon Prime...The product packaging is well thought out and makes the device feel a bit more premium then it really is at this price point. There isn't much documentation included but I really didn't find the need to look at any kind of instructions it's fairly simple to figure out.Out of the box and installing the device:  It's not till you go to plug it into your tv do you really just how big this stick is. Thankfully in the box is an HDMI extender cable, without it I don't think I could use my other HDMI port that has a Blue Jeans Tartan HDMI 4 foot White High Speed HDMI Cable with Ethernet, 28 AWG, Tartan Cable brandgoing to my Sony Blu-Ray Player.  I also ran the USB cable to power brick that it came with,  other reviews say the cable is short I have a pretty good run from my TV that sits on a riser all the way down to the floor where my surge protector is.  I had no issues in regards to power cable length.In Use:  The first Fire TV kept freezing and locking up, they it kept displaying little pink dots all over the screen, then when trying to play anything it was extremely pixelated with multi color blocks all over the place.  I like in the settings you can click to have Amazon call you,  saves me from having to look up the number and go through a million voice menu options.  So click to have someone calll and immediately the phone rings and your connected to Fire TV support.The second Fire TV Stick did NOT have these issues and so far seems to be working fine, no blurriness, so far no buffering issues though I need a few more days of testing it.  I'm still on an old G network  (Linksys WRT54G2 router).The Remote: The first remote I had was quit awesome and I wish I would of thought to ask to keep it when I exchanged it at Staples, I didn't think there would be much difference in quality from remote to remote.The remote in my current Fire TV Stick feels cheap over all, the casing is loose/flexes and the buttons require a lot of force to depress them, enough that it bothers my joints.  When I called Fire Support I was told more or less they don't support it since I bought it from Staples and Staples would have to be the one to replace it!  I was also told I could use an Android device or a Kindle device to control the stick.One other thing to note, especially if your having to go through multiple sticks to get one that works...Your forced each time you first install or reset the device to factory defaults,  to sit through a rather long and tedious introduction video there is no way to skip it.  So after 2 devices I hope I don't have to go through it again.UPDATE-----------------April 14I've had trouble for a couple months now, no matter the app this device buffers A LOT..I bought a new N router here from Amazon and that hasn't seemed to help at all. The device is only a few feet from the router  I get 20mb down 1.5 UP and I've done speed tests and tried streaming on my regular wired computer and wireless with my laptop and neither have trouble with buffering.PROS: Nice PackagingWorked with minimal issues out of the boxCONS: Poor quality controlLack of Support if purchased from anywhere other then AMAZON.COMSize (though if you use the extender not much of an issue)Forced to sit through introduction video that's long boring and tedious no way to skip", "verified": true, "helpfulness": "0/0", "author": "Comfortably Numb"}, {"rating": 5.0, "review": "We received ours earlier than expected!!! It is awesome!!! We bought a Fire TV for $99 awhile back and i don't really know what the difference is except for size and voice. I downloaded the remote app to my phone and it works great!!! Another great Amazon product!!! I want to buy more for every TV in the house!!!", "verified": true, "helpfulness": "0/0", "author": "Alicia  Presswood"}, {"rating": 3.0, "review": "The power cord deal is weird. The remote's battery compartment is kinda hard to open. Intro video can't be skipped.", "verified": true, "helpfulness": "0/2", "author": "Casey W."}, {"rating": 4.0, "review": "So far, so good.  I bought 2, one is fairly close to the router the other is a floor away +20 feet and works better than the Chromecast did on the same T.V.In my opinion the remote alone is worth tossing the chromecast off to the side.  But what I wanted was something to watch Prime and Netflix on, and this gets it done.One disappointment was the need for the power cord.  I was able to run my Chromecast directly from the USB port on my TV.  This would cause the TV to switch signals when I cast something to it and made it pretty slick.All in all it's been fast, responsive and streaming very smooth.  I'll update in a few weeks if things change.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Crack Corn"}, {"rating": 1.0, "review": "In the first day it was working good but now im on my third stick and im crossing my fingers. I have sound problem and now playback. In addition to stuttering on any bitrate I seem to experience severe playback issues,with complete freezing sometimes  CPU on the stick, or networking issues. never had a problem with my Roku or Ps3.", "verified": true, "helpfulness": "0/0", "author": "lenny peralta"}, {"rating": 1.0, "review": "Don't know because I won't get it until January!  Not sure why the big ad blitz and all if you don't even have the product ready to sell.  Poor choice, Amazon.", "verified": false, "helpfulness": "1/6", "author": "Amazon Customer"}]