[{"rating": 5.0, "review": "To be honest, I expected to get somewhat slow and downgraded version of Fire TV box... and I was wrong. This little stick works much, much better than Chromecast and Roku stick Actually, after I tried Fire TV Stick, I can't imagine who (and why) would buy Chromecast device for just $5 less or Roku stick for $10 more. I like almost everything about Fire TV stick - interface is really fast and fluid and all the channels are quick to load. Remote control is very responsive and feels good in hand. The only thing I didn't like was the fact that you can't use your TV's available USB port to power the stick (at least Amazon says so) but I can live with that for sure. Thanks, Amazon! Chromecast nightmare is over.", "verified": true, "helpfulness": "1/2", "author": "Alex"}, {"rating": 5.0, "review": "Great little stick.  It’s a little slow on streaming, and I wish amazon had an app to stream directly to it instead of having to go into settings...  But the interface is good, most of my high use apps are ready for use on it. It’s faster than my smart TV, or smart blue ray player, and I like the interface a little better than the Xbox.  It could still use a little work.  A little too much scrolling around but I can live with it.", "verified": true, "helpfulness": "0/1", "author": "como"}, {"rating": 5.0, "review": "A great quality streaming device, super fast and smooth.  Easy to setup too, very happy with the item :-)The remote fits perfectly in the palm of your hands!!!!", "verified": true, "helpfulness": "1/2", "author": "David Cappell \"David Cappell\""}, {"rating": 5.0, "review": "While no one review can tell you which item you should get or skip, my honest, unfiltered opinions have helped many over the years so that is what I will deliver here. Just to be clear, I do not work for Amazon nor did I receive this item for free. Just like the Fire TV for the Fire TV Stick, I paid the same price other customers did. I am also getting nothing from Amazon for writing this review, I write reviews to help customers like myself not waste their time and money on products not worth it.Alright, now that has been said, I will road test this against my Fire TV box ($100), Google's ChromeCast ($35), Roku 3 ($100) and Roku's streaming stick to start because I want to keep this review as simple as possible. (While I am an Apple fan, *personally* I do not feel that Apple TV's current box/ecosystem/value is strong enough to warrant being included. The hardware/performance and features on this Fire TV stick are far superior at almost 1/3rd the price).Comparing this to the Fire TV box, it is clear that there are trade offs to reduce the cost 60%--the question is what are those differences worth to you.PERFORMANCE:The brain (processor) is dual core technology instead of quad core which is featured in Fire TV box. This basically means it can handle 2 tasks at once instead of 4. It also has 1 gb of ram instead of 2 gb which the Fire TV box features.In the real world this seems to mean a little more waiting but not as much as you might think. It still feels generally snappy through menus and you wouldn't call it slow for much of what I tested but I would say after some use of both devices, you can notice some difference. It does limit the games that play smoothly and some apps are slower to open and use--but still it takes being used to the Fire TV box's performance to notice.That being said, it is 3rd in my useable speed after the Fire TV box and Roku 3 (because of their simpler system). It is faster and crisper than Chromecast or Roku's streaming stick which both have less ram, less storage space and a single core processor.Now I would like to say that Amazon's team will keep tweaking their platform to have this Fire TV stick beat Roku 3's performance but I highly doubt they will.While the boot time varies, to me this isn't a huge deal for a budget product and it isn't something you are likely to notice.FEATURES:Some things have been cut from the full Fire TV Box but not as many as you might think. First off the fancy remote with the voice search is gone. Now as I said in my Fire TV box review, this voice search is one of the game changing features of the Fire TV box. It allows you to hold one button down and speak normally, requesting nearly anything you can think of. The game changing part is that it works extremely well understanding people so it is truly useful. The content it pulls up is steadily increasing but it does not include Netflix content currently. I use it for pulling up music videos on the Vevo app, content from Amazon Instant Video, content from Hulu Plus, etc. I can't wait until it expands support for Netflix and other apps as well as simple wikipedia type content.This feature (only found in the Fire TV box) isn't available without you having a smartphone and Amazon's app that will allow you to use your phone to make these type of searches on the Fire TV stick. Even with the app, the ease of use isn't he same which makes it a downgrade from the full Fire TV box. Yes you can also purchase the remote separately ($30) but that brings you to pretty much the Fire TV box price and unless you need the small size of the stick, the full box is a much better value at that point.You also lose the optical output which makes it easier to hook up to your home theater in some cases as well as a wired ethernet connection which can slow down your streaming if you have wired ethernet jacks handy. (I know that wireless speeds are technically faster than you can likely stream content but there is still a practical difference between having it wired and being wireless in terms of speed and reliability). Past that it is similar to a Fire TV box in terms of features (past the slower speed/less ram making it unable to run some games).Now this still doesn't have the ability to stream anything in your browser window (like Chromecast can), nor can it access all the content that Roku 3 & Roku's streaming stick can nor does it have the headphone jack in the remote like the Roku 3 box (for listening to content while someone else is sleeping or doing something else). These are real losses that you need to think about before choosing which streaming device to select. For me, I rarely use my Chromecast to stream from a browser because no matter which device I test it with, the performance is disappointing--even when I lower the quality setting it still drops frames which makes the video choppy. While I also like the headphone jack on the Roku 3 remote, it is really bad at draining battery life which is a shame. I honestly do not miss the Roku only content but I watch more mainstream content. More on that under content.Did I miss a feature that I should cover? Let me know under comments and I will add it to this review.CONTENT:As I said above, as of right now Roku still has more content but most of the stuff that is exclusively on Roku isn't stuff that the average user will miss--unless you have had Roku and watch more unusual channels or watch HBO Go which still doesn't have a Fire TV app. Now that being said, now that Amazon Instant Video with Prime service has all the older (3yr+) content, much of that HBO stuff is available for free on Fire TV box and stick.There is no web browsing like you can on Chromecast on Fire TV. That means you can't watch random websites videos (Fire TV does have full YouTube support) or browse facebook on the big screen. As I said under features, for me Chromecast's performance issues reduce my interest in doing this but I would LOVE to see that feature added to the Fire TV devices with their better hardware.Amazon added Amazon Music to the Fire TV devices--this means that any song you purchased as a digital download from Amazon is also available on your device. Even better? The songs play with the words on the screen so you can sing along. :) I do wish they would add Prime Streaming Music content as well but I bet that is already in the works.Amazon is also adding Amazon Prime photos--all of your photos store for free if you have Prime and they are available on the Fire TV devices as well which is a nice touch.GAMING:No other streaming device can play \"real\" games like the Fire TV box can but this Fire TV stick can play the same sort of games that other devices can and Amazon claims there is more games for this than other devices. You can also use some bluetooth gaming controllers (including Amazon's own) to up the gaming feel but if you want to game with a streaming device, skip the stick and get the Fire TV box (and some controller).VALUE:So comparing this to the full Fire TV box you are paying just 40% of the price for all the content (minus some game support) with (currently) no voice search unless you purchase a ($30) remote or use the app, no optical output and no ethernet jack. You are also sacrificing some of the speed of the full box and well as the \"future proof'ness\" that the full box's hardware provides.For me that is an easier thing to do on secondary TVs (think bedrooms, kitchens, guest rooms, garages, etc) than on the main living room TV that you use the most. For me this Fire TV stick is worth about $50 to $60 compared to the $100 full box. Since it sells for less than that, it is a very good value--IF it meets your needs.Comparing this to Roku 3, you get nearly everything that Roku 3 offers--better performance compared to cheaper devices, a nice non-line of sight remote, some light gaming, etc except the Roku only content like HBO Go and the headphone jack built into the remote (covered under features) for so much less.I do not recommend the Roku streaming stick any longer because of the better value this Fire TV stick offers for less.To me the Chromecast streaming stick is slow and buggy and doesn't even come with a remote for nearly the same price as this Fire TV stick. The one feature it has going for it is the ability to stream nearly anything from a Chrome browser window. This is a nice feature to have but you give up a lot compared to this product so unless you need that feature, skip it until Google releases a better version.GAME CHANGERS:When Roku 3 ($100) was released it was a game changer because:- It WAS much faster performance wise than anything else outside of stand alone home theater pc.- It added decent gaming options in a streaming box (Angry Birds for example) and had a motion sensing remote that made this Wii like gaming possible.- It has a headphone jack IN THE REMOTE that makes it possible to be more respectful to someone else sleeping or working while you are watching TV.- After a while, it returned YouTube compatibility to the Roku ecosystem.When Chromecast ($35) was released it was a game changer because:- Allowed you to stream anything from a Chrome browser window- Allowed you to use your cell phone as a remote (since it didn't come with one) which was unheard of at the price point--Roku also lets you do that on some boxes).When Fire TV ($100) was released it was a game changer because:- It blew the doors off, performance wise. Faster than anything else INCLUDING a stand alone home theater pc. Amazon took a category that made money on the hardware side and decided to lose money on the hardware in effort to sell more content.- First box to all multitasking--listening to music streaming in one app while using another app to  look up movies, see photos, etc.- First box to have voice search- First box to deliver \"real\" gaming with support for bluetooth gaming controllers and the horsepower to really raise the bar.When the Fire TV Stick ($39) (this item) was released it was a SLIGHT game changer because:- It offered more value for the price than anything else currently does. It brought the Fire TV experience with a much lower price tag which means it is easier to justify adding it to secondary TVs.- It offered best in class streaming stick performance.OVERALL:I have two Fire TV boxes and grabbed two of these Fire TV sticks to release my remaining Roku boxes. I do not regret that decision at all--I get the Fire TV experience with less upfront cost on these other TVs. Now I do wish the remotes had voice search built in but that is my only disappointment for the cost--and not enough to drop $30 per TV to add it...at least not yet.Streaming Pandora music while I am surfing Netflix or Plex or Amazon's own content is pretty cool--something that other devices can't do. Controlling that Pandora stream while in other apps--even neater.I never had HBO Go so there is really no content I miss from Roku's channels and I do find that using the Fire TV devices we watch more Prime (Amazon) content which is very fast and reliable to stream which makes me happy.This Fire TV stick is hard to pass up at this price--knowing that it is only going to get better and more useful as Amazon continues adding things (like Amazon Music, Prime Photos, etc). This stick is now my number one recommended streaming device for value and ease of use. (If they have deeper pockets, I would suggest the top of the line performance of the full Fire TV box instead).I am excited to see what Roku does in the future to compete with these Fire TV options past just cutting prices. Competition is a beautiful thing!I hope this review has been helpful. Again, I paid the full (prime discounted) price for this, I do not work for Amazon and I get nothing out of writing reviews except to help others. Anyone who knows me knows I check Amazon's reviews before purchasing almost anything--even in local stores, because I hate to purchase something only to be disappointed later. If I can help others with my reviews like they have helped me, I am glad to return the favor. :)As I use this more and as people ask questions, I will continue to update this review so keep checking back and if you have a question or comment, please make it under the comment section below.", "verified": true, "helpfulness": "602/656", "author": "William Hardin"}, {"rating": 3.0, "review": "The Fire Stick TV USB is only good if you are looking to have everything Amazon has to offer on their website in a USB stick (no more connecting HDMI cable to the TV), it's like an app that has a remote. I have PS4 and it features the Amazon app which lacks on features like games, photos, but it has the feature of playing videos. So when I got it and saw that they just added some stuff to make it better I was disappointed.The biggest advantage of Chromecast is that you can stream any content like video, photos, etc. from tablet, phone, computer etc. to the TV. I don't like that this Android device is not capable to work with more Android devices only Amazon devices and some Android devices running Android 4.2. I have a Samsung Note 2 rooted and it's loaded with Android 4.0 and yet the Chromecast works fine, but the Fire Stick does not. My wife has Samsung Galaxy S5 (Android 4.2) with the mirroring option miracast (all share cast from Samsung) to the TV, but that does not work, it can't find the device my tv is from LG, when I use Chromecast it has no issues. According to this help guide http://www.amazon.com/gp/help/customer/display.html?nodeId=201636640 it should work fine.Basically what Amazon did is taken their website and made it available on the USB stick to keep up with the competition.If you are looking to have Amazon all in 1 at the hands of reach then this is for you.If you are looking to stream from computer, tablet, phone then this is not for you. (All Amazon devices are  capable of streaming to the Fire Stick.) Other devices that run Android are not supported.ProEasy installationPlenty of games, video, radios etc.1 Year warrantyRemote very easy to useThe remote can be eliminated with the Fire Stick TV App, and it's easy to use the app, I like the appNice design, simpleConsPower option could be on the back of the stick,right now it is located in the middle.Power cord could have something to wrap up the unneeded cableSoftware update failedThis is the biggest CON that I found - My wife has Samsung Galaxy S5 (Android 4.2) with the mirroring option miracast (all share cast from Samsung) to the TV, but that does not work, it can't find the device. According to this help guide http://www.amazon.com/gp/help/customer/display.html?nodeId=201636640 it should work fine.I don't need a device that can't stream from my computer, tablet, phone, to the TV.", "verified": true, "helpfulness": "4/8", "author": "Damian Marynski"}, {"rating": 5.0, "review": "I filter access on my network by MAC address so without that string of numbers it will never connect.  To see the MAC address scroll all the way to the right of \"networks\" when you set the stick up.Am watching \"The Wire\" as I type this - everything seems to work just fine.  More later", "verified": true, "helpfulness": "3/15", "author": "MurrDog \"Tango\""}, {"rating": 5.0, "review": "works on my old LCD tv, only takes about 15mins to update then wow la....", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer \"JXL\""}, {"rating": 2.0, "review": "I was intrigued by the thought of this new product.  I was actually on my way to buy Chromecast when I saw this product and decided to compare it and contrast it before I purchased this product.  At the time it was half off the original price and that warranted such an action. When I saw their comparison chart above, I thought that it had everything that Chromecast did, but there was just one item that seemed to be missing.  I thought that I might have overlooked this so I read the whole description page several times and it was not there.  You CANNOT connect your laptop to your screen. I called Amazon on 10-28-14 at 10:30am EST.  First, Amazon did not have a way to select to talk to someone with the Fire TV Stick.  They has a list of newly announced devices, but it was not even mentioned there when it was due to be released in less than a month.  When I got a hold of someone they could not help me so they transferred me to someone else, who in turn could not help me.  Finally, after another transfer, to the USA, to Mary.  After me calling her out on her saying, \"A stick is a stick, isn't it?\"  She finally did some research. She confirmed that this device does NOT connect to your laptop.  I also pointed out that it did not mention that the app would work on Fire devices, which they do work on fire devices. So this is the question you need to ask yourself:Do you want something to connect your laptop(s) to your television screen?If yes buy Google Chromecast.If not, they buy Fire TV Stick because of the better technology and the voice search feature on the apps.I gave this a 2 star for lack of information and lack of mirroring your computer screen.  It would have been a 1 star if the memory and whatnot was equal to that of Chrome.", "verified": false, "helpfulness": "5/24", "author": "J. Morford"}, {"rating": 1.0, "review": "My item did not come registered. I tried for 2 hours to register it and failed failed failed. I gave up last night. Will try again. Maybe they where having issues with their servers since I'm sure many where trying to set up. I'm going to give it another try tonight if not this is going back :(Update: tried again tonight and nothing. Was excited to receive it and it's a shame it doesn't work. Can't get it to register it. Can't get it to update it. Useless. And now to get a replacement I have to wait till January 2015. No thanx! I'll stick to my Apple TV. Glad I only use Apple products. iPhones, iPads, Apple tv, iMac. Apple products just work :)", "verified": true, "helpfulness": "4/15", "author": "J. Solano"}, {"rating": 5.0, "review": "This is an amazing product well worth the money.  I purchased 2 of theses and my daughters love them.Fist ease of use is A+, second set up is simple, after a quick update.  Then if you worried about no Vudu, don't, you can access most Vudu movies you own through Flixster.  The range all the way in the back bedrooms( farthest from router)  has a great strong signal.  The parental controls are simple and easy to navigate too( if needed).The power adapter can run straight from the usb port for power on the T.V so there is no visible cables at all for a mounted television.Its a no-brainier for any one looking for a streaming stick.  I replaced an original Roku, and a streaming blu-ray player and my kids cant be more thrilled.Me (as tech support) am also happy with my purchase.", "verified": true, "helpfulness": "2/3", "author": "SRGT STICKMAN"}]