[{"rating": 4.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "Sandra J. Schneider \"sandyjonow\""}, {"rating": 1.0, "review": "Shame on Amazon......a very uncharacteristic blunder! This does not interface for Comcast Subscribers( or Cox) and thus provides far less usable content then Roku.Granted; Comcast is the true problem here for denying subscribers access....but Amazon should without question specify the approved ISP for their device on their listing.More memory then Roku is a non issue..... when content is not even accessible.", "verified": true, "helpfulness": "0/0", "author": "B.J.T"}, {"rating": 4.0, "review": "I like it because I have about 60' from my router and have tried different items and none worked for streaming I got the fire stick and right out of the box simple setup and I watched a movie from Netflix after I logged in very very  good The only thing is I have to use my cable channel changer to adjust the volume and use the TV remote to go to cable TV after the movie but all in all an excellent product so far Thanks Jim", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 5.0, "review": "Works great.  Wish I was informed about it when I signed up for Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Charlotte Joynt"}, {"rating": 4.0, "review": "A very good product. However the Hulu app has some streaming problems. May renew my subscription when Hulu fixes the problem. Checked my Internet connection and found no issues. Overall, a good alternative to high cable and satellite services.", "verified": true, "helpfulness": "0/0", "author": "Stephen W Fryman \"Steve\""}, {"rating": 2.0, "review": "It's a promising device, but the jerky interface, and all video streaming services (Netflix, HBO Go...etc) with audio out of sync, it's basically useless.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this device!!!!!", "verified": true, "helpfulness": "0/0", "author": "Mrs L Phillips"}, {"rating": 5.0, "review": "The Fire TV Stick has exceeded all expectations. The value, ease of use, and quality are all top notch. For years, I had been messing with items such as the MK802(insert generation here). They were awesome while they worked, but the poor quality control on those products meant many hours bridging connections and flashing its firmware to restore usability. Not the case with the Fire TV. Out the box, there's an extremely long intro that does nothing for me, and I couldn't skip it... But, I can see the value in the not-so-quick crash course for some first time users. Out the box, there are several free and subscription base apps available for streaming pleasure. This device is a must have for anyone with an Amazon Prime account. For those that do not, fear not, the free apps have plenty to offer. If those are not satisfying enough, there is a huge following on sideloading applications to this device. The quality control appears to be great, though one of our remotes were fritzy out the box.Overall, I've recommended this to family and friends. I also gave some away as gifts and the recipients were pleased with their gifts as well.", "verified": true, "helpfulness": "0/0", "author": "J. Lee"}, {"rating": 5.0, "review": "Very intuitive. Set up could not have been easier, and user interface is very fast. I had a Sony bluray player with apps I was using to stream amazon media and was having a miserable experience. It would stall, or stop, not advance fast or took too long to load. The fire stick in comparison is lightening fast and will allow me to stream content in a useable and functional platform. I'm very excited about this product and the service.", "verified": true, "helpfulness": "0/0", "author": "Matthew Schneider"}, {"rating": 5.0, "review": "I bought the Fire TV Stick because I was sick and tired of my PS3 not logging into the PSN network, and not letting me watch my Netflix account.  It works great, early to use, and streams fast.  I'm happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "lizzygilly \"lizzygilly1128\""}]