[{"rating": 5.0, "review": "Tried ROKU and had problems from the beginning.  Returned that and got the Fire Stick.  I love it.  so easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "BACK"}, {"rating": 2.0, "review": "Very choppy. I have very strong internet connection and still have issues streaming.", "verified": true, "helpfulness": "0/0", "author": "Greg Dias"}, {"rating": 4.0, "review": "Clear picture.  Lots of apps.  Still learning best apps. Very good for cutting the cable tv cord.", "verified": true, "helpfulness": "0/0", "author": "Joachim"}, {"rating": 5.0, "review": "Amazing what this little thing can do.  My TV is now smart, lots smarter than I!", "verified": true, "helpfulness": "0/0", "author": "Judy Pulling"}, {"rating": 5.0, "review": "Wow. I may never leave my place again except for food and goodies..this is amazing.And to think I was going to pay for premium cable hahahahaha...So easy take out of box plug into hdmi port on tv an there ya go so simple and easy....tyvm", "verified": true, "helpfulness": "0/0", "author": "Tracy Jones"}, {"rating": 5.0, "review": "Great product. All that I expected of it.", "verified": true, "helpfulness": "0/0", "author": "Curtis Graf \"brother\""}, {"rating": 5.0, "review": "I'm cutting the cable on Comcast this week, that should tell ya something.", "verified": true, "helpfulness": "0/0", "author": "Mike Cubillas"}, {"rating": 5.0, "review": "I LOVE the Fire Stick! Recently I became  obsessed with a show on Netflix, and binged watched the 4 seasons out to prepare for the upcoming 5th season. The only issue was I was tying up the gaming console 24/7 to watch my new favorite show! With the Fire Stick, I can watch any of my favorites on Netflix or Amazon Instant Video while my hubby can play his games on his Playstation 4! So excited to have something so easy to use. The remote is so sleek and easy to use as well.  Again - I love the Amazon Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Danielle Thompson"}, {"rating": 5.0, "review": "It's very good！", "verified": true, "helpfulness": "0/0", "author": "dandan1225_2007"}, {"rating": 5.0, "review": "Awesome entertainment device.. Love it..  Can't say anything negative about it...", "verified": true, "helpfulness": "0/0", "author": "Luis Medrano"}]