[{"rating": 4.0, "review": "Overall happy with this product.  Entering search terms via the remote is tedious but no other complaints!", "verified": true, "helpfulness": "0/0", "author": "l.digiacomo"}, {"rating": 4.0, "review": "works well, easy set up. Best part is you can take it ware ever you have a flat screen tv and wifi. Don't get amazon prime if you plan on watching full seasons of shows. They make you pay more once you get so far in to a series.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "I bought this for my wife and she loves it.  I am so surprised how easy it was to install and it is easy to use.  I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "James Clements"}, {"rating": 5.0, "review": "Excellent !", "verified": true, "helpfulness": "0/0", "author": "Kiflu O. Tecklebirhan"}, {"rating": 5.0, "review": "I was given this for Christmas.  At first I thought, oh well it is the thought that counts, as I have a Samsung Smart TV, which allows me to connect to many services already.  I installed the fire TV stick, and it works GREAT, so much easier, crisper and quicker than using the smart TV functionality.  My only complaint is that I cannot control it with my Logitech Harmony 650 remote.", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 4.0, "review": "Just got one.  Highly recommended by a friend. Its been great so far and was able to watch so many things-movie, tv, music etc. the possibilities are endless.", "verified": true, "helpfulness": "0/0", "author": "Marcia"}, {"rating": 5.0, "review": "I cannot believe how easy this was to install.  However, it helps if you put the batteries in the correct way!  That would have saved me a lot of time.  I am technically inept and I had no trouble figuring it out (except for the batteries).  For the money, this was an excellent purchase.", "verified": true, "helpfulness": "0/0", "author": "lucygirl7"}, {"rating": 5.0, "review": "Fire TV Stick  has made Cable obsolete in my home.  All of my Media Entertainment needs are met with Prime Video and Netflix.  Bravo Amazon!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome...my family loves it", "verified": true, "helpfulness": "0/0", "author": "Carmen L Ortiz"}, {"rating": 5.0, "review": "The Fire T Stick was easy to install and very easy to operate.  Great addition to our TV.", "verified": true, "helpfulness": "0/0", "author": "graciet40"}]