[{"rating": 5.0, "review": "the best", "verified": true, "helpfulness": "0/0", "author": "edward cevicelow"}, {"rating": 5.0, "review": "Excellent alternative to Roku and Chrome stick! Its even cheaper and has on-board memory!", "verified": true, "helpfulness": "0/0", "author": "Doug Baker"}, {"rating": 1.0, "review": "no directions and I do not know how to make it work!", "verified": true, "helpfulness": "0/0", "author": "bonnie clark"}, {"rating": 4.0, "review": "The fire TV stick is a good device, with lots of Good qualities and a few problems.  I have both the for TV stick and the larger Fire TV unit, and I decidedly prefer the larger unit.Both of them have good build quality, but the remote with a microphone for the larger unit is handy.The Fire TV Stick occasionally overheats after a few hours of use and must be unplugged to reset it.  I bought the stuck as an experiment, and it was worth the cost, but I'd rather have another of the larger, more capable, less error prone unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it was one of the easiest device4s to set up and use!!  good work guys!!!!", "verified": true, "helpfulness": "0/0", "author": "Donald E. Ferry"}, {"rating": 4.0, "review": "A lot of power in the stick but it has problems with WiFi connectivity. My Smart-TV already has 99% of the apps that are on the stick but for the price I paid for the Fire TV Stick I'm not going to complain..My only complaint is that my TV doesn't have any WiFi connectivity issues where the stick has to be unplugged and plugged back in to get WiFi to connect again....that's a major problem for me since I'm disabled and the stick is in an awkward place on my TV.If you have a non Smart-TV then I can see the real advantage here provided you don't have the WiFi connectivity issue that I have. Amazon says it's interference from my TV, and it very well may be since my TV is a Smart-TV, I used the adapter and that made the issue occur less but it still happens.", "verified": true, "helpfulness": "0/0", "author": "T. Lam"}, {"rating": 5.0, "review": "My sister loved it", "verified": true, "helpfulness": "0/0", "author": "cathy jibson"}, {"rating": 5.0, "review": "Its awesome! Very easy to use. Do have a few issues with the sound on some of the movies but that could be because I haven't figured out how to set the sound.", "verified": true, "helpfulness": "0/0", "author": "andi"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "barry daniels"}, {"rating": 5.0, "review": "Love all my Amazon Fire products. Tablet Kindle, phone Fire, TV Fire, and all my stuff is the same everywhere.", "verified": true, "helpfulness": "0/0", "author": "Gaylyn Kim Snow-Andrews"}]