[{"rating": 5.0, "review": "I love the Fire TV Stick! It is easy to use and comes prepared with my information. I simply plugged the device into my TV through the HDMI source and was enjoying my prime account instantly. Great product and I would recommend this for anyone.", "verified": true, "helpfulness": "0/0", "author": "PNJ"}, {"rating": 2.0, "review": "cant figure it out", "verified": true, "helpfulness": "0/0", "author": "lori anderson"}, {"rating": 5.0, "review": "better than Apple TV. I love this.", "verified": true, "helpfulness": "0/0", "author": "ANDREW A SKARUPA"}, {"rating": 3.0, "review": "I have a smart tv, so this is really only used when I travel. If I'd know I could access amazon prime subscription through my tv, I probably wouldn't have purchased this.", "verified": true, "helpfulness": "0/0", "author": "Cwilcher \"Charles Wilcher\""}, {"rating": 5.0, "review": "Perfect choice for streaming Netflix, Hulu and Amazon streaming content.  Easy to install and it hides behind TV instead of having a box taking up room.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Geno"}, {"rating": 5.0, "review": "Purchased on sale and it has been great for watching Amazon Prime movies and shows. Still learning other uses.", "verified": true, "helpfulness": "0/0", "author": "PB"}, {"rating": 5.0, "review": "everything i wished and more...", "verified": true, "helpfulness": "0/0", "author": "Sandra Kahl"}, {"rating": 5.0, "review": "I have a Fire TV and two sticks. The only problem I've had with the stick is the memory issues. I have a stick to my sister to checkout and she is already complaining about the memory. I've used the stick myself, but I know how to clear the cache, she doesn't. Because of that, it doesn't make it a bad purchase. It does everything the FireTV does, but just a little slower and without the same amount of memory. It is a good buy because of the cost. I like the Fire Stick and would not hesitate encouraging others to pick one up.", "verified": true, "helpfulness": "0/0", "author": "jwillin"}, {"rating": 5.0, "review": "works great but cant use my harmony remote with it", "verified": true, "helpfulness": "0/0", "author": "Jon Curtis Morris Jr"}, {"rating": 3.0, "review": "Worked okay for a few months, but then constantly froze and buffered every video I ever played. Called the internet company a few times a month for 6 months and after all of the headaches, went out and bought a Roku. Now my videos load perfectly every time.", "verified": true, "helpfulness": "0/0", "author": "Jenna"}]