[{"rating": 3.0, "review": "Terrible connection issue with one out of two devices that I have. Can barely watch an episode or video sometimes and other times I can watch a whole season.", "verified": true, "helpfulness": "0/0", "author": "Alysen Mirth"}, {"rating": 2.0, "review": "Did not care for it. At first, I loved the sleek design but when it comes down to use I had several problems with it performing. Plug wasnt sturdy enough and kept coming out of my power strip, the remote stopped working once I installed the remote app on my iphone, and the actual Fire Stick was flimsy and wobbled in the HDMI port on my TV and would keep turning off until I got up and fiddled around with it. I wanted to love it but it was too tempermental in design, it didnt work half the time. Returning after trying to use it for two days unsuccessfully. Roku time I suppose.", "verified": true, "helpfulness": "0/0", "author": "C. Favilla"}, {"rating": 1.0, "review": "I purchased this device almost exclusively to watch MLB.TV, and it hasn't worked properly in a month. Buffers every 5 seconds, rendering games completely unwatchable. Support from MLB.TV has been a bunch of excuses.  Skip this and purchase a Roku3. We have it on another TV and it works flawlessly. On a positive note, Amazon supported apps, like Prime, work with no hiccups whatsoever. Shocking.", "verified": true, "helpfulness": "1/1", "author": "David McLain"}, {"rating": 4.0, "review": "Great product and price.", "verified": true, "helpfulness": "0/0", "author": "whpcream"}, {"rating": 5.0, "review": "Love it. Works great. Was actually better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Carl W. Frisk"}, {"rating": 5.0, "review": "Just an awesome device for school", "verified": true, "helpfulness": "0/0", "author": "Jesus Lara"}, {"rating": 4.0, "review": "Works well and easy to use. Wish you could rent movies from other sources, not just amazon.", "verified": true, "helpfulness": "0/0", "author": "Nancylg66"}, {"rating": 5.0, "review": "Works great, easy to use, lots of options.", "verified": true, "helpfulness": "0/0", "author": "Nancy Gardner \"DogLovinNurse\""}, {"rating": 3.0, "review": "It is a pretty good product but the only problem is that it tends to freeze in between shows on Hulu and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Uriel J."}, {"rating": 5.0, "review": "I FEEL LIKE I AM CHEATING ON APPLE", "verified": true, "helpfulness": "0/0", "author": "Caroline Storz"}]