[{"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Karen A Wheeler"}, {"rating": 5.0, "review": "Better than advertised. I also downloaded the free app from the Amazon appstore for my smartphone to make it a voice activated remote to use with the Firestick so no need to order theirs and spend extra money. Boosted signal strength and no issue's with buffering at all although I didn't often have an issue before.", "verified": true, "helpfulness": "0/0", "author": "Bruce Jones"}, {"rating": 5.0, "review": "I love my new fire stick! It's amazing how now I can watch my movies, listen to my music and play games anywhere!!!! Yes, ! It's better than using my phone! Now I don't have to use my phone power, and everyone can enjoy off anything with a  hdmi port, hotels,  hospitals, sleep overs, the office, at home, the possibilities are endless!", "verified": true, "helpfulness": "0/0", "author": "Natonya Cook"}, {"rating": 4.0, "review": "Works great but something they don't shown on the commercial is that these require power as HDMI ports do not output it. The stick comes with a USB cord for power and an AC to USB power mini-brick. I have a Samsung TV with a USB \"service\" port. I was able to plug the USB power line in there. Upon boot the stick said that I had plugged into a power source with inadequate power sourcing ability. I believe that the stick says this if it gets power but does not detect their official mini-brick. Obviously if the power was inadequate it wouldn't be able to come on and tell me so.  For this deceptive discretion I have knocked it down to 4 stars. It otherwise works very well and is very fast.", "verified": true, "helpfulness": "1/1", "author": "Jay"}, {"rating": 5.0, "review": "Amazon did it again....another great product. Easy to use. Great to cut the cable company ties. Thanks amazon.", "verified": true, "helpfulness": "0/0", "author": "Pipperz"}, {"rating": 5.0, "review": "Works perfectly from the get-go.", "verified": true, "helpfulness": "0/0", "author": "Lally"}, {"rating": 5.0, "review": "Great alternative to my Roku3!!", "verified": true, "helpfulness": "0/0", "author": "S. Moore"}, {"rating": 4.0, "review": "Good value for a Internet TV streaming device. I wish it had a web browser as most hotels require a sign in that is web page based so you could use this at a motel. Otherwise great for home use.", "verified": true, "helpfulness": "0/0", "author": "oldman"}, {"rating": 4.0, "review": "Works well.  Does everything the more expensive Fire TV does except the more intensive games.  If you're only interested in streaming media, you might as well save money and get this.  (Though, if you want to use the voice search, you need the add-on remote.)Down one star because they're still advertising the hotel support as \"Coming\".  Come on, Amazon, knock this out.  We need this for travel.", "verified": true, "helpfulness": "0/0", "author": "LazyBoy"}, {"rating": 1.0, "review": "Purchased two of these devices for family gifts, so disappointed. We could not use this device on any of our three TVs in the house because the dongle was too long to fit in the nested HDMI port area on the back of the TVs. One small consultation is that I know AMAZON will be great about the return.", "verified": true, "helpfulness": "0/0", "author": "Michelene Decrow"}]