[{"rating": 5.0, "review": "Remote is easy to use and setup a cinch!", "verified": true, "helpfulness": "0/0", "author": "Lillian P."}, {"rating": 5.0, "review": "it is # one in my book", "verified": true, "helpfulness": "0/0", "author": "david fender"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "cynthia"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jerri L Martin"}, {"rating": 5.0, "review": "Product is good and has everything I expected.", "verified": true, "helpfulness": "0/0", "author": "James L Kenney II"}, {"rating": 5.0, "review": "Super easy to use and my cell can be a remote. Works on my TV made in 2011", "verified": true, "helpfulness": "0/0", "author": "Crystal King"}, {"rating": 2.0, "review": "Was really looking forward to receiving the new Fire TV stick, but alas have been disappointed by the performance and quality of the product.First the good:  Easy to set up.  Pulled it out of the box, connected to the TV, and within minutes was connected to the home network and using the product.Now the bad:(1) The UI is not the best.  Navigating from application to application is cumbersome.  Certainly not even close to the competitors such as Apple TV (what I'm comparing it to)(2) The product hangs after periods of inactivity.  Coming back to use the stick after a day of inactivity, I would usually find an error message stating that it had lost the connection to the network and it would freeze in the process of reconnecting.  I have to disconnect the power from the stick and completely reboot to get the thing to work again.(3) The quality of the housing is not good.  The mini-USB power connector port has collapsed thereby not allowing the connection any further.  I now have a small paperweight that was previously a 2 month old fire stick.Returning this thing ASAP and likely buying another Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Chris P"}, {"rating": 5.0, "review": "Works great. love it so far.", "verified": true, "helpfulness": "0/0", "author": "SGELET \"SueJohn\""}, {"rating": 5.0, "review": "Great buy!!", "verified": true, "helpfulness": "0/0", "author": "jenny"}, {"rating": 5.0, "review": "Fantastic!!!", "verified": true, "helpfulness": "0/0", "author": "Emma Hankins-Quince"}]