[{"rating": 3.0, "review": "I was disappointed to learn that the only things you can cast from your mobile devices to the big screen with the stick is limited to local photos, videos, and music.  In addition, there is no web browser application.  So if you wish to stream content from the web, you will need to add on additional equipment (like an Apple TV for screen mirroring for instance). As others have pointed out, the Amazon content dominates the screen but I don't mind as I've a prime membership (for now anyway - not sure it's worth renewing now that I reflect the cost vs the usage over the past calendar year).", "verified": true, "helpfulness": "0/0", "author": "Lora Fulton"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "jonathan p."}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "Dennis R."}, {"rating": 5.0, "review": "This is by far my favorite device to watch streaming content on my TV. I have the Chromecast as well, which works fine, but I find myself watching  the Firestick more often because of the design and interface options it provides. Thank you for making such an outstanding product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazingly simple!", "verified": true, "helpfulness": "0/0", "author": "Therese Roche"}, {"rating": 5.0, "review": "If you don't subscribe to cable as I don't, this has proven to be an excellent alternative. Plenty of music options plenty of videos, TV and anything else you may want.", "verified": true, "helpfulness": "0/0", "author": "Shannon McCoy"}, {"rating": 5.0, "review": "I think this is a pretty cool device. I have a old Roku box and I think this works better.", "verified": true, "helpfulness": "0/0", "author": "JAMES VAUGHAN"}, {"rating": 5.0, "review": "Great value for the money. Loaded full of features with untapped potential just waiting to be discovered!", "verified": true, "helpfulness": "0/0", "author": "Mr. Yewcic"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 4.0, "review": "It does what I wanted it to do. It seems to limit some selections.", "verified": true, "helpfulness": "0/0", "author": "philip v powers"}]