[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Dulce"}, {"rating": 5.0, "review": "Love it! Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Taletha Adkins"}, {"rating": 5.0, "review": "love it!  The only thing about it that frustrates me is that it is super easy to switch from my ATT uverse dvr programs but when I want to go from the fire stick format back to my dvr selections I can't figure out a way to do it..... that has been very frustrating for me, but then again I am definitely not technically savvy.  That's my only complaint.  Otherwise it is WONDERFUL!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Garrison \"bunnybaby\""}, {"rating": 5.0, "review": "Did everything the Apple TV did except sync with Iphone and Ipad. Premium movies as good as Netflix but not as many  A great buy for the price", "verified": true, "helpfulness": "0/0", "author": "leonard axelrod"}, {"rating": 5.0, "review": "Love it!  Got rid of cable and use the fire TV stick now!", "verified": true, "helpfulness": "0/0", "author": "Keri"}, {"rating": 4.0, "review": "Pretty neat device, not the awesomest thing ever, just another way to organize TV apps.", "verified": true, "helpfulness": "0/0", "author": "Michael P Miarecki"}, {"rating": 5.0, "review": "Easy to set up and use and at a fair price.", "verified": true, "helpfulness": "0/0", "author": "MikeyB"}, {"rating": 5.0, "review": "What a great product.  We plugged it in and it worked beautifully. I would recommend this product to anyone. The picture quality of the movies was fantastic.", "verified": true, "helpfulness": "0/0", "author": "anyone"}, {"rating": 5.0, "review": "I love the fire stick! I have 4 tvs in my household, with only 1 being a smart tv and 1 being connected to a smart blue ray player. This comes in handy for my kids tv's if they want to watch some amazon prime items. Works great. Love that I can take this with me when I am traveling.", "verified": true, "helpfulness": "0/0", "author": "Michelle Smith"}, {"rating": 5.0, "review": "Works as expected.....great!  Recommended for your video entertainment.  Set-up is easy, use is easy!  May need to buy another.", "verified": true, "helpfulness": "0/0", "author": "Tom H."}]