[{"rating": 5.0, "review": "Works well, no issues so far", "verified": true, "helpfulness": "0/1", "author": "Sarah"}, {"rating": 5.0, "review": "I am satisfied with my fire stick.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very good.", "verified": true, "helpfulness": "0/1", "author": "Scott Thompson"}, {"rating": 5.0, "review": "love my new fire stick still more to learn about it", "verified": true, "helpfulness": "0/1", "author": "Flutterby"}, {"rating": 2.0, "review": "Amazon being sneaky and not putting the correct software or somewhat blocking other apps so they jump skip so you'll go ahead and buy Amazon stuff instead. I'm returning mine to best buy today to get a Roku", "verified": true, "helpfulness": "0/1", "author": "Cruizeguru"}, {"rating": 5.0, "review": "I have used this without any problems. Love it. Stopped my premium cable subscription. Every day the Fire Stick has something new to offer. I got another FS for my bedroom.", "verified": true, "helpfulness": "0/1", "author": "cmeplay"}, {"rating": 3.0, "review": "It was too slow. The picture got blurry and would freeze and then go really fast. I returned it. We migh try the fire TV.", "verified": true, "helpfulness": "0/1", "author": "Katie Rich"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Maria Claudia Granovsky"}, {"rating": 5.0, "review": "I really love the Fire stick, we usually use chromecast on our house but this is definitely better, more speed, very good HD quality even with regular speed DSL about 5MB/S, is easily to use compared to chromecast since you don't need another device to control the streams, extremely good integration with amazon video.", "verified": true, "helpfulness": "1/2", "author": "Leonardo Tovar"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  I plugged it in and within 5 minutes I was browsing the menu.  It even registered my Amazon Prime account automatically.  I wish I got one a long time ago.", "verified": true, "helpfulness": "0/1", "author": "S. Burks"}]