[{"rating": 3.0, "review": "Fire TV Stick appears to drop the wifi signal even though it is a strong signal all too often.  Returning to where program was dropped is next to impossible, if at all.  Very aggravating.  However, there is a good selection of programs IF YOU can get them to stay on.", "verified": true, "helpfulness": "0/0", "author": "Handyman"}, {"rating": 5.0, "review": "Good Product", "verified": true, "helpfulness": "0/0", "author": "giovanni sandre"}, {"rating": 5.0, "review": "I like it better than the Roku straming player that I have. Picture quality is better and and response is faster. Wish it had the ability to cast from a browser, but I guess that's too much to ask for at this point. Overall, a great streaming device.", "verified": true, "helpfulness": "0/0", "author": "Bobby B"}, {"rating": 5.0, "review": "Easy to install on Toshiba Regza.  We use it to watch amazon prime movies and tv shows.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Librarian"}, {"rating": 5.0, "review": "Best purchase that I have ever made. I used to pay over $100 a month for Direct TV.  Now I pay less than $100 a year for Amazon Prime. I can binge watch more shows and movies than I will ever be able to in my lifetime. I cannot emphasize enough how great this little device is. I am also saving over $1000 a year now that I no longer have Direct TV.", "verified": true, "helpfulness": "0/0", "author": "lizmeyer"}, {"rating": 5.0, "review": "Best device I ever bought thanks amazon", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Netflix makes it worthwhile,  but MLB.tv app is terrible!!", "verified": true, "helpfulness": "0/0", "author": "CHARLES M FISCHER"}, {"rating": 1.0, "review": "I am so extremely disappointed in this item's performance.  Perhaps my expectations were too high??  I own two Samsung streaming BluRay players and consistently have difficulty streaming.  I have tried everything to resolve and still they either won't recognize the wireless signal or they buffer buffer buffer and quit.  I did expect this Fire Stick to work great with both Amazon movies and Netflix but I continue to have buffering issues.  Although when AmazonPrime checks signal speed, I get 2.5+, movies still don't play consistently, don't load at all or buffer every few minutes.  I kept trying and trying to resolve with various equipment changes/rebooting etc but after 3 mos I have given up altogether and now Amazon wont take back their Fire Stick.  Interestingly, the Netflix rep. told me never to use Fire Stick with Netflix, only a Roku but I am not willing to throw any more cash at this issue.", "verified": true, "helpfulness": "0/0", "author": "Wendy B Berry"}, {"rating": 5.0, "review": "Works great, highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Roseanne Caleca"}, {"rating": 5.0, "review": "Love it so far...streams Netflix great near hd quality...only downfall is no vudu app", "verified": true, "helpfulness": "0/0", "author": "Catherine Hurley"}]