[{"rating": 5.0, "review": "The interface is a little clunky and takes one or two extra clicks to get to content compared to AppleTV.  But there is a ton of content available if you put some time in to dig through the available APs. Can't beat it for the price!", "verified": true, "helpfulness": "0/0", "author": "Wayne Welch"}, {"rating": 5.0, "review": "Great new tool for my tv!", "verified": true, "helpfulness": "0/0", "author": "Danny S"}, {"rating": 5.0, "review": "Works as advertised.Good Parts: The included cable adapter was really handy on a TV with an oddly placed HDMI port.Less Good: For a little stick, needing to attach the included power adapter was a surprise. They should be more forthcoming in the marketing.", "verified": true, "helpfulness": "0/0", "author": "Shawn Turner"}, {"rating": 5.0, "review": "Love it!!  We out it in every room and now getting rid of cable", "verified": true, "helpfulness": "0/0", "author": "Aly"}, {"rating": 5.0, "review": "good product no issues so far works smoothly no streaming issues. i would recommend it.", "verified": true, "helpfulness": "0/0", "author": "rayray"}, {"rating": 5.0, "review": "The Fire Stick was the easiest electronic device I've ever set up on an electronic device that I've ever owned! Really! I'm A prime member so it came pre registered and all I needed was a password for the wifi, everything just worked, kinda like Apple and iOS!", "verified": true, "helpfulness": "0/0", "author": "Havasuman"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "clinton e foskey"}, {"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Jazmine"}, {"rating": 5.0, "review": "Love it! I also love the app that turns my Samsung galaxy into a remote for the fire stick!", "verified": true, "helpfulness": "0/0", "author": "MelissaM"}, {"rating": 3.0, "review": "Biggest complait is you have to have it plugged into the wall at all times Inorder to use it. I feel like they mis advertised because the commercials make it look like all you have to do is plug it into the TV. The content of Amazon fire stick is great! We love the streaming and hundreds of apps to download", "verified": true, "helpfulness": "0/0", "author": "Ren Wakefield"}]