[{"rating": 5.0, "review": "A lot easier than streaming from our Xbox. Plus since all of my daughter's shows are on amazon, it's much easier to get her set up with her cartoons in the morning.", "verified": true, "helpfulness": "0/0", "author": "Jessica Marino"}, {"rating": 5.0, "review": "My family and I have very much enjoyed our fire stick.  It's awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little contraption is actually very good.  Way,  way better than Apple TV. I would totally recommend Fire Stick or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It was so crappy the apps would take forever to load extremely slow service and it wasn't the Internet connection because everything else in our house worked perfect so we went and got a Roku instead and that works perfectly", "verified": true, "helpfulness": "0/0", "author": "justine"}, {"rating": 4.0, "review": "Pretty neat, especially for under $40. It lets you search for shows through most of your library, but it doesn't have all shows indexed, like from HBOgo and Starz. That would be awesome and my one drawback from giving 5 stars. Overall very nice.", "verified": true, "helpfulness": "0/0", "author": "Cj"}, {"rating": 3.0, "review": "Was very excited to get this device as we were going to use it for our outside movie projector. I received it today 7-1-15 and went right to setting it up. initial set up was easy simple instructions to follow. all seemed to be going well until I got to the home screen. Once there I was getting network error messages telling me I was not connected to a network, My wireless router was only 12 feet from the tv I was using to set it up. it said it was connected yet would not play anything after finding no help on the \"help\" section of the Fire stick I contacted Amazon and spoke with a CSR. I was initially told my security encryption was not compatible, but upon further research of my actual security it was not an issue.  It was intermittently giving errors messages once I did a factory reset. it was determined that my device was damaged during shipping. A new stick has been shipped out to me and I will receive it in 2 days. Will update my review pending the outcome of the replacement stick.A few notes when you are looking at this item: You need to have an outlet to plug the device power adapter into. Amazon advertises this item as just plug it into your tv and you are ready to go.This item gets extremely hot when plugged into the Tv and the extender also gets very hot while using itUse of the extender that is included is highly recommended to boost wifi connectionThe stick uses HDMI outlet on the TV and NOT a USB connection to plug it into.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 1.0, "review": "Old movies. Unable to download netflix app.", "verified": true, "helpfulness": "0/0", "author": "sIn"}, {"rating": 5.0, "review": "Quick to set up & use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product! We have an Apple TV, but it didn't stream Amazon prime.  So, I bought this, which I am more pleased with than my Apple TV. I can still steam my pictures through my Amazon account. The load time is super fast on cable and even on DSL. I like that it's small enough to take with us on a trip. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "This product has opened so many doors for my family.  It is awesome for any age!  I will have to buy 3 more just so everyone can watch what they want on their own tvs.", "verified": true, "helpfulness": "0/0", "author": "kristy c"}]