[{"rating": 3.0, "review": "liked it alot and its awesome for tv's that dont have or are not smart tv's", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Slow to load. Some apps (particulary SlingTV ) are pretty buggy. Wish it had a quicker respsonse.", "verified": true, "helpfulness": "0/0", "author": "Brandon MD Webb"}, {"rating": 5.0, "review": "I'm totally addicted.", "verified": true, "helpfulness": "0/0", "author": "Irene J. Midgett"}, {"rating": 5.0, "review": "Awesome way of streaming videos and games, now I don't have to buy a smart tv", "verified": true, "helpfulness": "0/0", "author": "Daniel Acosta"}, {"rating": 5.0, "review": "thankssss", "verified": true, "helpfulness": "0/0", "author": "Metin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I haven't used any other streaming devices before, so can't make any comparison. As a college student who does not have a stable income, I think it worth the price. It has all the feature I need with a cheaper price comparing to Amazon Fire TV Box or Roku, even though on day 1 the sys stopped responding for 2-3 times and the remote control reacts slow sometimes. And I'm surprised that Amazon Fire TV Stick CAN actually wirelessly mirror my Win10 laptop screen! I heard complains from other people saying Amazon Fire TV Stick is not compatible with Windows sys. But it works fine with my laptop after I updated my sys from Win7 to Win10. Now I can watch anime with my roomies on a bigger screen.P.s For those who cannot wirelessly mirror Win10 screen, check your laptop's compatibility first if you upgraded from Win7, then update all your Intel drivers and install Intel WiDi from Intel's website: http://www.intel.com/p/en_US/support/highlights/wireless/wireless-displayAnd be patient, it took me a whole afternoon to successfully pair the TV stick with my Win10 laptop. Updating Intel's driver is troublesome.", "verified": true, "helpfulness": "0/0", "author": "Ye Zhang"}, {"rating": 3.0, "review": "I can't get the programs I like to watch like FX, History channel, and A&E.; I go to 'unlock' and get an activation code. I go to the website, as directed, to pick my cable subscriber and input the activation code and direct tv is not listed (even on the full list of cable providers). So I guess it's good for netflix and YouTube if you have direct tv. Annoyed. But listening if anyone can solve this problem.", "verified": true, "helpfulness": "0/0", "author": "Pamela"}, {"rating": 1.0, "review": "Can't get it to work", "verified": true, "helpfulness": "1/2", "author": "Robert Rudd"}, {"rating": 5.0, "review": "Nice", "verified": false, "helpfulness": "0/0", "author": "Terry_aki"}]