[{"rating": 5.0, "review": "Well love it. Well built and very easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Stylus Pen Clip for Apple,iPoid"}, {"rating": 4.0, "review": "Generally very happy with my Fire TV Stick.  However, I wish there were better parental controls.  Supposedly, the Fire TV set-top box has better controls.  Seems like a funny feature to leave off the cheaper model.", "verified": true, "helpfulness": "0/0", "author": "Gaddio"}, {"rating": 5.0, "review": "Great item. Fast delivery.", "verified": true, "helpfulness": "0/0", "author": "Shelley Herrman"}, {"rating": 5.0, "review": "Faster than our game systems for accessing netflix and whatnot. Great size to bring on work travel and use on hotel TVs. It may be less useful if you have a smart TV with all sorts of apps built in, but it works great on ours. One issue that i'm fairly certain is our tv's issue: even if the stick is set to \"sleep\" the TV still thinks it's getting data and doesn't go to sleep the way it normally would if you had the input set to a cablebox or game console that was off.", "verified": true, "helpfulness": "0/0", "author": "kiki"}, {"rating": 5.0, "review": "I LOVE it! The access to everything is great! The remote is the best!", "verified": true, "helpfulness": "0/0", "author": "Sara G."}, {"rating": 5.0, "review": "I love, Love, LOVE it.  Sorry I did not get it sooner.  Nice part of being a Prime member.  Big benefit is that when I go to my beach house in the summer - I can take it with me!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ginger\""}, {"rating": 5.0, "review": "Easy to set up; Even easier to use!", "verified": true, "helpfulness": "0/0", "author": "Don Glaser"}, {"rating": 2.0, "review": "Several months in and still no VUDU support (Flixster sucks, it freezes up, doesn't load your titles, and stutters when playing content). Many of the apps freeze and crash. Load times are ridiculously long on some apps, but quick if you're accessing Amazon content. As far as accessing your Amazon and Amazon Prime content, there's nothing better, unfortunately I expected it to be more on par with Roku and it's not. Hopefully the next couple of months will bring some updates to the stick to make it more stable and bring the features advertised when I purchased it. There's promise with this gadget, but (as my grade school teachers used to say frequently) it isn't meeting its potential.", "verified": true, "helpfulness": "0/0", "author": "Scott T. Smith"}, {"rating": 3.0, "review": "Had trouble initially to download apps due to an extreme delay in an upgrade of fire stick that was not told in setup would need to be done. Had to call customer service for help.  After which, apps downloaded ok, but Netflix buffers a lot, and even get messages, unable to stream your movie at this time, please try again later. Very frustrating to watch movies when interrupted numerous times with buffering. I don't have that problem with Amazon videos. I have a fast broadband network with dual band Wi-Fi and never have that problem with my computer, laptop, or smart phone which are in same room as TV with fire stick. For the money, I probably shouldn't complain, but frustrating none the less.", "verified": true, "helpfulness": "0/0", "author": "soonerbackhome"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Hootbro"}]