[{"rating": 5.0, "review": "Easy to install.  Wokks great", "verified": true, "helpfulness": "0/0", "author": "larry r. wright"}, {"rating": 4.0, "review": "4.5 stars, actually!I watch a lot of series and some movies - with a set budget for tv as my entertainment. I considered for a long time before purchasing this, because I have 2 portable devices and have always just watched on those.  But I wanted to have the experience of a larger screen, with better audio and the benefit of being farther from my face ;).  I had some trepidation because I have a ten year old TV without HD.  I found the Fire Stick installation a snap, and the small remote is straightforward and easy to use.  All the content that's available on my portable device is now viewable on the big(ger) screen!  Awesome.I only wish I could magnify the font size, as an \"over 50\", it's hard to read.  I usually peruse titles on my laptop or kindle and save them to my Prime or Netfilx watchlist, then click easily to it on my TV.  I think picture quality would be better on an HDTV, it's a little dark.Best money I've spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "cec \"Carol\""}, {"rating": 5.0, "review": "Excellent device. Allows me to watch tv without hookup to cable tv.", "verified": true, "helpfulness": "0/0", "author": "Paul Hudson"}, {"rating": 5.0, "review": "I love the amazon fire stick because it combines all my different sources of video (like Netflix and Amazon Prime) into one window and i do not have to keep logging in and out of each one.  love it!  Easy to use too.", "verified": true, "helpfulness": "0/0", "author": "Conservative girl"}, {"rating": 4.0, "review": "Worked as advertised. No problems installing or using. Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Smith"}, {"rating": 5.0, "review": "The wifi reception is less than the chromecast but if you are not too far away from the router it works wonderful", "verified": true, "helpfulness": "0/0", "author": "Carlos Franco"}, {"rating": 4.0, "review": "Starting to catch on to it's use and really like the features. Very happy to have it", "verified": true, "helpfulness": "0/0", "author": "James W Lawler"}, {"rating": 2.0, "review": "Limited app selection hinders this compared to Roku. I have used the Chromecast and a Roku. I am going back to the Roku as the app selection is greater. I can actually watch my movies on Vudu. I was able to see some of my movies on the Firestick using the Flixster app, but the app is not longer working correctly. Amazon movies is very clunky when having used the competitors versions of a movie app.", "verified": true, "helpfulness": "0/0", "author": "Lucky Joker"}, {"rating": 2.0, "review": "It says my wifi connection is slow but that only happens with fire stick", "verified": true, "helpfulness": "0/0", "author": "George Carolan"}, {"rating": 5.0, "review": "I love the Amazon Fire TV stick.  I've recommended it to my friends.  The stick was more than I thought it would be.  I watch this more than I do regular tv.", "verified": true, "helpfulness": "0/0", "author": "Eva DeFiglo"}]