[{"rating": 5.0, "review": "Great item will certainly enjoy. Fast shipping...", "verified": true, "helpfulness": "0/0", "author": "Kenneth R. Lukowski \"Tahoken\""}, {"rating": 5.0, "review": "best thing to come to the TV", "verified": true, "helpfulness": "0/0", "author": "Jerry Chapman"}, {"rating": 5.0, "review": "Easy to set up and use. THANK YOU!!!", "verified": true, "helpfulness": "0/0", "author": "B R"}, {"rating": 5.0, "review": "Wonderful product.  I also have a chromecast, but this seems to just work better, less hiccups and the remote is wonderful.  Coupling with the SlingTV subscription was a no brainer for me.", "verified": true, "helpfulness": "0/0", "author": "Thomas Carpenter"}, {"rating": 4.0, "review": "better than roku and any other streaming stick", "verified": true, "helpfulness": "0/0", "author": "Anilkumar"}, {"rating": 1.0, "review": "Pure bait and switch. I bought this with 5gbs of free storage and now it has been taken away. Absolutely inappropriate move by Amazon. Own 3 and got my parents to get one so I could upload photos of their granddaughter so they could see her in the slideshow and now I'm supposed to pay for a feature that was included originally?  I will no longer suggest this product to anyone. Just wrong!!!", "verified": true, "helpfulness": "0/0", "author": "M. Lein"}, {"rating": 5.0, "review": "One of the best investments I've made in terms of technology.", "verified": true, "helpfulness": "0/0", "author": "zach kasdan"}, {"rating": 3.0, "review": "I purchased this item to cut my cable...The stick was VERY easy to connect...It streams well and tv looks good...the problem that I did not know is that you have to SUBSCRIBE to the different apps...I thought it was \"on\" the stick...depending on how many apps you are subcribing to, this can get costly...All in all good product, but I was looking to cut my cable bills and this could cost as much...", "verified": true, "helpfulness": "0/0", "author": "deho"}, {"rating": 1.0, "review": "Constantly requiring rebooting. Says it is the wireless connection, but it is the stick that is the problem.", "verified": true, "helpfulness": "0/0", "author": "Delbert"}, {"rating": 5.0, "review": "Love this!  Easy to hook up!", "verified": true, "helpfulness": "0/0", "author": "Kathy Ann May"}]