[{"rating": 5.0, "review": "Enjoying the product.", "verified": true, "helpfulness": "0/0", "author": "Johnny  Lee"}, {"rating": 2.0, "review": "DO NOT BUY THIS IF YOU USE DSL. The Fire Stick works very poorly with ATT DSL Ultra.  Even with the newest fastest wireless router and the distance from the TV to the router is 5 feet it still does not work well.  Only low definition videos will work with out constant stopping.  Forget anything remotely high def.  The fire stick does not buffer, so you cannot stop it for awhile and let it \"load\"  a whole show.  Oh well, at least it was fairly cheap.  Too bad because it looks like there are many interesting vids out there for a rainy day.", "verified": true, "helpfulness": "0/0", "author": "CC from Florida"}, {"rating": 4.0, "review": "It definitely gets the job done, thank u amazon", "verified": true, "helpfulness": "0/0", "author": "Franklin Ferreina"}, {"rating": 2.0, "review": "The FireTV Stick draws obvious comparisons to the Chromecast, and it almost universally falls in Amazon's disfavor. The interface is very laggy, taking upward of 500ms to consistently register clicks on the remote. There is very literally a single app which FireTV has and Chromecast doesn't; Spotify Connect, which works so inconsistently and has such poor reviews in the FireTV app store that its surprising it works for anyone. Of course it does, though, as with most technology, and for those whom it doesn't Spotify's support is about as useful as putting a finger in your ear and yelling \"Sorry it works for me!!\". Most people will prefer the user experience on the Chromecast because it is controlled entirely by your phone, whereas this requires *another* remote to add to the pile of remotes you already have, and some apps still require your phone to operate anyway (Spotify for one).Overall, I cannot possibly recommend this over a Chromecast unless you are senile and demand an easy to use interface over the horribly complexity of a modern smartphone. Or if you demand Spotify and are willing to put up with the chutes and ladders necessary to get it working.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Works nice", "verified": true, "helpfulness": "0/0", "author": "ben carter"}, {"rating": 5.0, "review": "So glad we decided to purchase the Fire Stick. Installation and use couldn't be easier.", "verified": true, "helpfulness": "0/0", "author": "lisa valente"}, {"rating": 3.0, "review": "Not always available, but my computers are still working. Plus it shows a strong signal on the Amozon results .when it works its great .Very frustrating when not working.It works 50% of the time.", "verified": true, "helpfulness": "0/0", "author": "David A Chirafisi"}, {"rating": 5.0, "review": "Just got it but easy install and looks like there is a good variety of movies/programs.", "verified": true, "helpfulness": "0/0", "author": "Debra Henn \"Debra H\""}, {"rating": 5.0, "review": "Awesome, easy to set up, gonna get one for each room.", "verified": true, "helpfulness": "0/0", "author": "Trisha Coleman"}, {"rating": 5.0, "review": "I really think the fire stick is worth it if you use amazon prime or Netflix. Those are the only reasons I have it on my kitchen tv that is not a smart tv. I haven't had any problems with and its very portable to bring with you on trips or to a friends. I would recommend!-G", "verified": true, "helpfulness": "0/0", "author": "Gus P"}]