[{"rating": 5.0, "review": "I have only been using this device for the past few days but have encountered no issues. I love the connectivity to Amazon Prime videos, Netflix, Twitch, and Youtube. The only way I've been able to watch Youtube other than on a computer was through the PS3. The internet connection was always choppy. With the fire stick, everything loads quick and easy. I've had it lose internet once but once I unplugged it and plugged it back in, it worked perfectly.Certainly worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tsukikomew"}, {"rating": 5.0, "review": "It works seamless with prime. It has high quality of YouTube streaming. I love it.", "verified": true, "helpfulness": "0/0", "author": "FENG LI"}, {"rating": 5.0, "review": "Bought two of these under another account during the $19 sale.  I was surprised how well this can handle my local library over wifi.  For an XBMC machine it does everything perfectly!  I'm able to stream 20 gig blu ray rips over wifi without any buffering or stuttering.  For a streaming device this is simply fantastic and outperforms the $100 chinese android box I bought just last year.  I'm looking forward to getting some emulators running on the device in the near future.Works great with Plex too!", "verified": false, "helpfulness": "0/0", "author": "d3n3"}, {"rating": 5.0, "review": "I've only used this and the Chromecast.  For watching TV, this and an Amazon Prime account blow the Chromecast out of the water.  The navigation is superior, the controls for watching are better, and the content available is better.  Until Google opens up video on their play subscription service, this is where you want to be.", "verified": true, "helpfulness": "0/0", "author": "Carl Forgey"}, {"rating": 4.0, "review": "We have only been using the fireTV stick for about 2 weeks, but overall we are very impressed by this device.  We have used similar devices including a roku 3 and a google chromecast to primarily view Netflix, Amazon streaming or Hulu.  While this won’t replace a HTPC, I would say the kindle TV stick performance and design wise is comparable to the roku 3 and superior to the google chromecast and is a reat value for the price.The fire TV stick has a fairly large list of compatible applications and so far we haven’t had any issues. Roku currently seems to have a slightly larger library of channels/apps, but I believe the stick has ~99% of the ones we actually use and runs in a similar manner. Not surprisingly where the fire TV stick excels is the integration with the amazon video streaming service.  The roku app for the amazon network works ok, but we occasionally have lags or have to return to the home screen which we have not seen with the kindle tv stick.  I won’t even compare the google chromecast, since you have to mirror a device just to see the amazon video service and that was laggy and almost unwatchable when we have tried it. Speaking of mirroring a tablet, the fire stick seems to sync well to my kindle fire hdx, but we have not used this feature extensively or with other devices.While the stick has less memory and hardware than the fire TV full unit or roku it has not felt like a limitation yet, but again we use the stick mostly for streaming movies and not games or other functions.  Of all of our devices the fire stick has been the easiest to setup, and for a first time user I would think the video tutorial would have been beneficial.The included remote is a strong positive and the simple design meets all of our interface needs. For those who prefer to use their phone or universal remote that apparently is an option, but for us we prefer having the dedicated remote kept with the stick so that kids don’t have to go looking for another device.Our biggest complaint is the design of the stick’s power supply.  This device has a micro-usb input on the side of the device that has to be plugged into an outlet and cannot be plugged directly into the TV USB  (unlike the chromecast).  I am guessing that they did not want the plug on the back of the device since they thought it might create a space constraint, but on all the TV’s having the cord on the side limits which HDMI inlet we can use and looks awkward.  Having to use an outlet wouldn’t be a huge issue, but with the short cord provided it was an extra annoyance and distracts from a device that otherwise would tuck hidden behind a tv.  While not a major complaint, this is something that I think could be improved on and is part of the reason I can’t give this device 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Brian H."}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "ZHAOLIN"}, {"rating": 5.0, "review": "Great little device.  This makes watching prime TV and Movies much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "sym"}, {"rating": 5.0, "review": "This item is amazing. It delivers beautiful content with very little lag time even with 3rd party apps like Netflix. I loved it so much that I bought a handful more for friends and family to enjoy.", "verified": true, "helpfulness": "0/0", "author": "Frank C."}, {"rating": 5.0, "review": "This product is great. I was able to set it up pretty quickly and even the downloads of other apps was seamless.I think its a pretty good competitor to the Google Chrome", "verified": true, "helpfulness": "0/0", "author": "M. Alam \"Tech'ed Out\""}, {"rating": 5.0, "review": "Six stars.  I watched early episodes of The Good wife which I had missed and found our newest passion-The Vikings series.  The fire stick was a breze to install and set up.  We are in our mid 70's and not that technical anymore but we had no problems-just stood closer to the TV and  read the directions. We are also viewing our family pictures from the computer on our big TV screen and that is a joy.  I highly recommend this if you love TV as we do.  No commercials !!!!HOORAY", "verified": true, "helpfulness": "0/0", "author": "Anna M. Leuenberger"}]