[{"rating": 5.0, "review": "I really like this tool. Instead of purchasing a smart tv. I can use my regular HD flat screen.", "verified": true, "helpfulness": "0/0", "author": "Danielle Booker"}, {"rating": 5.0, "review": "Great HD reception!!", "verified": true, "helpfulness": "0/0", "author": "Eden 2265"}, {"rating": 5.0, "review": "Unwrap, insert, connect to Wi-Fi and that's it.  Real easy to use!  Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Well worthwhile the money! I am enjoying the variety of programs I get with my PRIME membership too.", "verified": true, "helpfulness": "0/0", "author": "AJH"}, {"rating": 5.0, "review": "Easy to set up and great content....", "verified": true, "helpfulness": "0/0", "author": "Allie's Dad"}, {"rating": 4.0, "review": "I like the performance of the Fire Stick over the Roku streaming stick. It performs and streams very well and very easy to set up with nice features and has many apps you can add and works well with Prime", "verified": true, "helpfulness": "0/0", "author": "DSL"}, {"rating": 5.0, "review": "Love it! Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Shannon Neely"}, {"rating": 4.0, "review": "Great for Sling TV. Will try to find more way to have fun with it.", "verified": true, "helpfulness": "0/0", "author": "Charlie Shen"}, {"rating": 5.0, "review": "Where has this stick been my whole life?! Best streaming device ever! (And I love Apple products) but nothing compares to this! I recommend it! Easy, simple to use and simply amazing!", "verified": true, "helpfulness": "0/0", "author": "LionsDen27"}, {"rating": 1.0, "review": "Just called Amazon Fire TV customer service and discovered that the Fire Stick does not, repeat DOES NOT receive data from, nor can it be controlled by a laptop or other PC.  This means that the UI cannot be controlled by the computer's mouse or finger pad.  If it did that, I would buy several of them -- today!  What were you thinking Amazon?", "verified": false, "helpfulness": "0/0", "author": "C. Hill \"CHill\""}]