[{"rating": 5.0, "review": "Love it. Use it constantly. Needs rebooted sometimes.", "verified": true, "helpfulness": "0/0", "author": "Kaye"}, {"rating": 5.0, "review": "I love this thing! It's small inconspicuous and provides all the viewing pleasures that I desire. Even the remote is small and pretty intuitive. I've got no complaints. I'm off to use the thing now ;-)", "verified": true, "helpfulness": "0/0", "author": "oPinonateD"}, {"rating": 5.0, "review": "since justified and bosch are over it doesn't have a lot of viewing for me", "verified": true, "helpfulness": "0/0", "author": "Carol D."}, {"rating": 5.0, "review": "Love it and shipping speed has been outstanding", "verified": true, "helpfulness": "0/0", "author": "jaime"}, {"rating": 2.0, "review": "Had this for almost a year now and decided to finally write a review. Unfortunately, it is only because I'm unhappy with the Netflix performance. I bought two of these and both have stuttering playback when it comes to Netflix. Amazon videos play great though and launch with little to no buffering, even when it comes to HD. I've given it enough time and the Netflix performance just has not cleared up. It is just watchable as the videos will briefly pause then resume multiple times and too often start buffering then lower the resolution. This is on BOTH Fire Sticks.How does my Chromecast play Netflix on the same TV, i.e. same location, same wi-fi? Flawlessly. I love how Amazon compares the two. Chromecast, has only one core and single band Wi-Fi, and the Fire Stick, dual-core with dual-band MIMO WiFi. Hey Amazon, this was supposed to be a much better performer than the Chromecast and imo, you blew it despite the extra horsepower. It's not all bad as I like the remote, and very convenient, the Android app is ok, I like watching uploaded videos or pictures on my TV but I use Netflix the most so the Fire Stick is looking bad more than good. I'm sure Amazon wouldn't have any reason for Netflix to play poorly though, lol.", "verified": true, "helpfulness": "0/0", "author": "A. White"}, {"rating": 5.0, "review": "A great addition to my viewing habits.  Love Netflix on my big screen", "verified": true, "helpfulness": "0/0", "author": "Ron Rezzani"}, {"rating": 1.0, "review": "I bought one during the 2 day sale. It worked well so I immediately bought another. I thought this thing was genius and it worked better than our Wii U.I should have waited another week before ordering a second.The first one I bought died. It'll show the home menu but it won't load anything and constantly says that the network has been lost. My network has not been lost. I have pretty decent internet connection and I don't bog it down by connecting tons of devices.The remote stopped working. Nothing I did would pair it again.The stick won't connect to the app or vise versa.Basically my first stick is bricked. It won't do anything.My second stick worked for about 3 months. It had issues connecting but with some disconnecting and reconnecting (about 10 times in a row) it would work. Now it's turning into stick #1.Because of these crappy products, I will never buy another Amazon made product. No kindle, no phone or speaker.I like to lay in bed and watch a 1/2 hour show before sleep. It takes me 1/2 hour to get the stick to work. I'm done. I will take my streaming needs elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Melissa Smith"}, {"rating": 4.0, "review": "Great !", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Monge"}, {"rating": 5.0, "review": "The Fire TV Stick exceeded by expectations. Setting up the Fire Stick was easy. The variety of movies, TV shows is awesome. Very, very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Satisfied Shopper"}, {"rating": 5.0, "review": "Love it. It's fast and simple", "verified": true, "helpfulness": "0/0", "author": "Nolan"}]