[{"rating": 2.0, "review": "This product has been a huge hassle.  It often doesn't want to connect to our internet (even though all other devices in my house are connected fine) so it won't play any movies or shows.  We've restarted it by unplugging the power numerous times. And now tonight, while in the middle of a movie I paid for, I'm getting crazy messages on a blue screen that say it's unauthorized and the content is disabled.  So I'm getting no picture beyond this message  but I do get sound.  This whole thing has been nothing bus a massive annoyance.  Only reason I gave it 2 stars is because when it does actually work it's pretty great.", "verified": true, "helpfulness": "0/0", "author": "Sarah Statham"}, {"rating": 5.0, "review": "Very easy to use and downloading doesn't take long at all! I went from a Xbox to this and I love this. I love that I can take it wherever I want too!", "verified": true, "helpfulness": "0/0", "author": "Andie"}, {"rating": 5.0, "review": "I LOVE IT. MY GRANDDAUGHTER SHOWED ME HOW TO WORK IT.", "verified": true, "helpfulness": "0/0", "author": "Sue Rhoads"}, {"rating": 4.0, "review": "Overall I am happy with this product. Amazing performance, brilliant clarity in user interface. Only thing that comes short is the keyboard interface. I believe the decision to not put keyboard buttons on remote and also not give voice control with remote is not the very best one. At-least one of it could have been provided on remote control. I would have loved it if voice control was built in remote control. Mobile app is ok, but nobody wants to use it when sitting in front of a tv.", "verified": true, "helpfulness": "0/0", "author": "Abhishek Chaturvedi"}, {"rating": 5.0, "review": "The Fire TV Stick exceeded my expectations.  Streaming programs has been flawless.  Content with Amazon Prime has been pretty good but I'm still exploring.  I couldn't be happier with the sticks performance.", "verified": true, "helpfulness": "0/0", "author": "Walter B"}, {"rating": 3.0, "review": "I'm not reading in these reviews what subscriptions I need to order in addition to purchasing the Fire TV Stick.  Yes, I see all the subscription channels that the reviews say I \"could have\" with the Fire TV stick. However, the reviews are not telling my that I have to order these subscriptions.  The reviews not saying what entertain is inclusive with the purchase of the Fire TV Stick, i.e. for free and what is not free! Neither are the reviews saying what subscriptions must you separately pay for in addition to purchasing the Fire TV Stick.", "verified": false, "helpfulness": "1/2", "author": "R. Williams"}, {"rating": 5.0, "review": "Awesome. I am not a techy but tech friendly and find this super easy to use. Before this device I had to borrow my friends play station to stream Netflix and Hulu. If u don't have Amazon prime you'll want it the home screen caters to prime members. I'm canceling my cable because of this device. Excited to save money!", "verified": true, "helpfulness": "0/0", "author": "Bb"}, {"rating": 5.0, "review": "Easy to download apps, remote is very responsive, always connected, it's a great product.", "verified": true, "helpfulness": "0/1", "author": "Timothy McKeown"}, {"rating": 1.0, "review": "Live TV, such as Sling or MLB is about impossible to watch. Continuous buffer, also have the Roku stick and that works just fine. Switched the two around to see if location made a difference, but it didn't matter. Fire stick 10 feet from router with nothing else running doesn't help.  Netflix is fine...", "verified": true, "helpfulness": "1/2", "author": "kevin Swartos"}, {"rating": 1.0, "review": "At first it worked really well (a few feet away from the modem and wifi) but now it barely connects (upstairs in a house). I hardly ever use it now and feel like it was a complete and total waste of money. I thought maybe it was my connection because I was upstairs but when I use my iPad or phone to try and watch Netflix or hulu from the same room where my firestick is, they work perfectly but the fire stick doesn't.", "verified": true, "helpfulness": "1/1", "author": "Maddy Anderson"}]