[{"rating": 5.0, "review": "Love it!!!", "verified": false, "helpfulness": "0/1", "author": "Maurice Lightner"}, {"rating": 5.0, "review": "So cool!  We now have way too many options to watch things off prime, but great that the kids can now sit on the big comfy sofa rather than gather around the iPad or computer screen.", "verified": true, "helpfulness": "0/0", "author": "MCJmom"}, {"rating": 5.0, "review": "Had a small issue with it not licensing movies. The phone support was top notch!Works well well!", "verified": true, "helpfulness": "0/0", "author": "Alan Lamb"}, {"rating": 4.0, "review": "I used to own chromecast but sold it because I can only cast non-amazon content.  FireTV stick is essentially a stick version of FireTV or Kindle tablets.  I can watch amazon prime instant video and amazon mp3 as prime member which I could not do with crhomecast.  I seriously doubt whether it can play game because you need to install the game on stick that only has few gb space.  I wish amazon could've improve in following areas.1. I plug firetv stick into one of the 6 HDMI on my receiver.  Because the usb cable is on the side, it blocks the neighboring hdmi.2. youtube quality is not as good as chromecast.3. I wish kindle ebook reader be added in the future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "does not connect", "verified": true, "helpfulness": "3/4", "author": "Jeff Underhill"}, {"rating": 5.0, "review": "We absolutely love being able to stream prime movies as well as Netflix through this small device.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "These things are amazing I have one on every tv in my house good bye cable bill", "verified": false, "helpfulness": "0/0", "author": "Danny l York"}, {"rating": 5.0, "review": "Awesome!  It has Chromecast beat in ALMOST every aspect.  You gotta love the remote; it works great Eben with the Fire Stick plugged in behind the television.", "verified": true, "helpfulness": "0/1", "author": "mxwx"}, {"rating": 4.0, "review": "I love my new fire stick! I wanted it for an upstairs bedroom for when I wanted to watch netflix or prime upstairs. I like the trivia comes, like you don't know jack. The remote is sensitive and occasionally lags. Startup is fast and simple. I love that I have spotify but I think it's stupid that I still have to play it on my phone instead of logging into my account and syncing my account to the stick. But since I don't have a speaker doc for my phone, it works. For the price this works great for what I want. I can't say that it's probably much better than a roku 3 stick or anything, so it falls in line with all of those others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I liked Google cromecast better then this..., I like casting to my tv. Google has that ability to do from any kind of device like iPhone and Google. Where as, this fire is restricted.", "verified": true, "helpfulness": "1/4", "author": "Lalith Kumar Podduturi"}]