[{"rating": 2.0, "review": "I mainly replaced my Chromecast for the Fire TV Stick for Twitch TV app and unforunately the Fire TV Stick is a disaster for Twitch. It only shows video quality as 480, meanwhile Chromecast is 1080. I'm really surprised especially since Amazon now owns Twitch. Hopefully this improves in the future.", "verified": true, "helpfulness": "2/2", "author": "R. Calderon \"The Duck Knight Rises\""}, {"rating": 3.0, "review": "The sole reason for purchasing this was that it boasted much more powerful hardware specs over competitors and has a Plex app.The Plex app playback is sporadic and stutters. It has been narrowed down to the FireTV Stick and/or Plex app as the network was tested and source device have been ruled out (competitors stream flawlessly through Plex app).Netflix works just fine.", "verified": true, "helpfulness": "0/0", "author": "Tyler Jones"}, {"rating": 3.0, "review": "The interface is great and easy to navigate.  The reason for the 3 stars is that you have to plug it in to run it.  It's advertised as such that you don't need a power source for the stick, when in fact you do.  Not suitlbe for my needs as I wanted it for a wall mounted TV.  The USB cord provided isn't that long and wont run behind the wall.  You do NOT just plug this in and it works, you have to run it on a power cord.  However if this is not a problem for you then you will most likely love it.", "verified": true, "helpfulness": "1/2", "author": "Kfuofa"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Ronald King"}, {"rating": 4.0, "review": "Another Update about a month in with the FireTV Stick:All is well. I really dig this thing now. So much so, I've added one more star. It's still not a five star product in my view (The HDMI stick package is just going to be klugey given that it is an un-powered port, the WiFi reception and setup issue, the lack of any alternative for getting a protected WiFi connection established, and the inability to use the Guest WiFi account on a Cisco Linksys router). But once beyond the WiFi issue, it has a slick UI and a neat unexpected feature- This thing is excellent for viewing your Photos. Upload them to your Amazon Cloud account (free for Prime members), and it is simple to browse them on your TV and you can set the screen saver to use them. The sound is better than my Roku with my surround sound system (an old non-HDMI Onkyo receiver I connect to via Toslink). Spotify connect works well, as does \"casting\" YouTube. I've also just recommended the product to my Mother.Update to my complaint about the USB power constraints: I've come to the conclusion that its unfair to blame Amazon or this product for the need for a wall wart. HDMI doesn't supply power, so external power is a necessity. Mine does work with my TV's USB (initially displayed a warning, but no issues so far), however I'm realizing that un-switched power would have the advantage of leaving the FireTV stick on all the time. The boot up is quite a bit slower than the time it takes for my TV to come on, and I'm, an impatient person. If I pause something to go to bed and watch later, it would be better to still have it on the screen when I turn the TV back on the next day. It just so happens I don't (yet) have a power outlet behind my wall-mounted TV, but this is hardly something I could blame on this product. I suppose some folks will have HDMI ports available on their audio receivers, which would likely be closer to power than the TV might.Update:I've finally successfully connected to WiFi and the Fire TV Stick has earned a few stars back.  I used the short extension provided as recommended by a support article, which ultimately helped, though it still too several attempts. I had to simplify my complex wireless password, which I still find a bit bothersome. It apparently cannot use a LinkSys guest account at all (my e2500 requires guests to open a web browser to enter a password). I assume it will not work with any other WiFi which requires you to enter a password or acknowledge use policy in a browser window prior to getting out to the internet (consider that if buying this to take with you when you travel). I was hoping to be able to remove the guest security, but it is not possible on my router (short of third party firmware). I was tempted to dig out an old router and set it up for unprotected access just to get up and running, in the hopes I could get to where I could switch to my primary using my phone as a keyboard. I suppose you could also attempt to do the same with a cellular hot spot, but I don't have that option on my plan currently.The good:The interface is attractive and snappy. Ships programmed for your Amazon account, so you don't have to enter it, which is great as long as it isn't a gift. Some have complained of issues with surround sound and older receivers. I had full surround with my older non-hdmi Onkyo. I have optical digital running from my TV to my receiver using Amazon Prime video. I have not tested Netflix or others. This is a win over the Roku, which would require the signal routed through my receiver via HDMI. The receiver works fine otherwise, I don't see upgrading it if I don't have to. The remote is pretty slick and I like it much better than the Roku's. You can actually press a button while it is sitting on the coffee table (the rounded back on the Roku remote just about requires you to pick it up to use it).The not-so-good:Cluttered interface. Bad Wifi connectivity with plenty of signal. Touchy about USB power- wish they could have gotten it to run efficiently on the USB ports which are becoming very common on consumer electronics devices. Honestly, if it can't handle run of the mill USB power, the package makes no sense whatsoever. I don't want to have to run ugly wires to my wall hung tv (or figure out how to run an extension cord in-wall, which would be a code violation). I'd honestly rather have a little box like my roku in that case, and route the signal up one of the in-wall HDMI cables I already have (but not at the price point of the original Fire TV, when the Roku is so much more complete for less). The fast forward and rewind are a bit funky in Amazon Prime. Not totally intuitive and needs some work. I predict the slim little remote will disappear in very short order. I expect to find it under the sofa cushions frequently.Below is my original review prior to getting WiFi connected. I'll leave it as I believe it still reflects my initial deep frustration trying to get the Fire TV stick up and running.--------------------------------------------------------------------------------------------------------------I went home for lunch today and with much surprise and excitement discovered My Fire TV had arrived much sooner than expected. I tore into the package and eagerly popped open the cleverly assembled handsome little box. I swung my TV out from the wall, popped it into the last open HDMI port, and plugged the USB cable into the open one on the TV and fired it up. Ick. Doesn't like my USB port. Bummer, going to have to use the supplied wart, but there's no outlet nearby.  Once I had that sorted (temporarily... If I keep it, I'm going to have to install an outlet or locate the stick  elsewhere- the extension cord simply will not do...) I was presented with the challenge of connecting to Wi-Fi, and this is where my blood began to boil.My primary SSID has a fairly complex password created by the password generator in LastPass. I really don't do simple, repeated, memorable passwords. I do copy and paste, which is obviously not an option here. My guest SSID is a little simpler, but I can't use that because it requires you to log in via a web page (Cisco Linksys). The Fire TV finds it, but displays it  as \"open\".Entering the long password which contains upper and lower case letters, numbers and special characters using the on screen keyboard and remote is just about the worst thing ever. Having to do it several times because the Fire TV can't make a connection to my router directly below the TV, less than three feet away is just about a deal breaker. I never got past this point and ran out of time.I've read the suggestion to use the short  extension to try to resolve Wi-Fi connection issues and will try it. I had hoped maybe I could copy and paste the password using the Android or IOS app, but alas, it uses Wi-Fi. I searched the webs to see if I could pair a Bluetooth keyboard, but couldn't find a definitive answer, and even if it's possible, I wouldn't be able to that early in the setup. So it appears my only option is to dumb down my security, or disable it altogether on the guest SSID. I'll try it one more time, but if I can't get connected, I'll stick with my Roku and send this very frustrating little device back.I'd like to give it zero stars, but I suppose the packaging is kind of nice...", "verified": true, "helpfulness": "5/5", "author": "JdoubleH"}, {"rating": 1.0, "review": "It was repeatedly compared to the Chromecast and hailed as a Chromecast competitor but it does not compare at all.  It only runs video streaming  services such as Netflix but it DOES NOT stream your PC screen like Chromecast can.  Very disappointing.  My TV already has the capabilities the Fire TV Stick has.  This gets returned to the store for sure.", "verified": true, "helpfulness": "0/4", "author": "Yumazona"}, {"rating": 5.0, "review": "Awesome streaming device running flawless", "verified": true, "helpfulness": "0/0", "author": "Rob Mackenzie"}, {"rating": 5.0, "review": "So far I love it.  I own a regular Fire TV and used to move it back and forth from living room and my bedroom and now I use the Stick in the bedroom and it works great.  It has Plex which is important to me and all the normal movie and TV watching apps.  It doesn't have access to all the games the original has so don't get it if you want to play some of the higher end games like Minecraft but as a streamer it works great.", "verified": true, "helpfulness": "0/0", "author": "jwaggon"}, {"rating": 1.0, "review": "I initially tried powering this through my TVs USB port, but it apparently didn't provide enough power, so I had to plug it into the wall with the provided adapter.  That was rather frustrating initially.After getting it powered up, it took about 30 minutes to setup and update, you'd think that it would ship with the most recent firmware, or at least not have to download/install such a large patch.  After that, I spent about 5 minutes with it (2 of which involved being forced to watch an intro video) before I became frustrated with it's slow performance.  I'm going to give it a few months for Amazon to work out the software issues before trying it again, may update review then.", "verified": true, "helpfulness": "2/3", "author": "Hagenbuch"}, {"rating": 4.0, "review": "It's a stick! Simple to set up, love the android remote app with voice recognition.  Wish I didn't have to pay per episode of Madmen and Gotham.  Would recommend to others.", "verified": true, "helpfulness": "0/1", "author": "Raymond Dutelle Jr"}]