[{"rating": 5.0, "review": "Oh, I love this thing. No more PC under the TV. I can watch my Prime and youtube and play slots too!", "verified": true, "helpfulness": "0/0", "author": "Michael La Honta \"gassy\""}, {"rating": 5.0, "review": "Easy to use.  We were able to pre-order at a discount as a amazon prime member. It was bought to replace a Roku that suffered lightning damage.  Very happy with it.  Considering purchasing another one to use with our daughter's smart TV, because the apps on her TV are terrible and unreliable.  It is also worth noting that this Fire TV Stick has the best Netflix app of any of our devices (of three different TVs, the Roku, two different phones, two different tablets)!", "verified": true, "helpfulness": "0/0", "author": "T. N. \"wannielynn\""}, {"rating": 5.0, "review": "I have had Chromecast for some time now.  I took advantage of the Fire Stick deal for Prime members and am very pleased that I did  Setup as extremely easy and within a matter of minutes, we were able to stream Prime content to the TV.  The content didn't stutter or pixelate - just as clear as watching a video.", "verified": true, "helpfulness": "0/0", "author": "Sandi Rothman"}, {"rating": 1.0, "review": "Piece of Junk.", "verified": false, "helpfulness": "0/2", "author": "globalproducts"}, {"rating": 5.0, "review": "I have only used this for a few hours but it is much faster than the Chromecast.  The only thing this really needs is the Synology DS apps.", "verified": true, "helpfulness": "0/0", "author": "Kamron Aghataher"}, {"rating": 5.0, "review": "I purchased this Fore Stick TV for my family for Christmas.  I thought I would try it out before Christmas so we don't have disappointments on Christmas morning.  I loved it! And know they will also.  The setup was so easy.  I really didn't know what it was but thought for $19.00 why not try it.  I have watched Netflix, Amazon Prime and played games.  I loved that I could use my galaxy phone app. As a remote. Definitely a deal. Great if you don't have cable TV in every room.  Think I will buy a few more.  Again love it and know my family will to.", "verified": true, "helpfulness": "0/0", "author": "Carol Battaglia"}, {"rating": 5.0, "review": "Installed super easy. Has many channels available, although not HBO GO unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've only had it for a few hours now, but I love it! This thing is so cool! Very glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "T Rosster"}, {"rating": 5.0, "review": "Seriously awesome gadget", "verified": true, "helpfulness": "0/0", "author": "Debbie Campbell"}, {"rating": 5.0, "review": "Easy to install and I love the menus and of course the price!!  You do have to plug the fire stick part into an electrical outlet, which isn't a problem for me, but I did not realize that when I bought it and just thought I would share that with anyone looking into purchasing one.  The remote is great too, which I wasn't expecting to like so well.", "verified": true, "helpfulness": "0/0", "author": "ddouth"}]