[{"rating": 4.0, "review": "It's a handy way to \"cast\" streaming programs to your  TV.  Seems to be high definition, and it can handle captions, etc.  The control unit is a little quirky, and I found it a little difficult to hunt or browse on iTunes and Amazon Prime. (Unlike Chromecast, this one does access Prime). It's less hassle than Chromecast in setup, though, since you do't need your compter to do the casting but work directly through the cable modem and TV.", "verified": true, "helpfulness": "0/0", "author": "W. Rossiter \"Fuzzworth\""}, {"rating": 5.0, "review": "Recieved my fire stick last week. It's very easy to install and very easy to use . Almost all the shows I watch are on here. I haven't found the new season of walking dead yet, hhow. But that's ok. All in all it'll be saving us a lot of money ,not having to deal with cable any more.", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 5.0, "review": "wonderful", "verified": true, "helpfulness": "0/0", "author": "Sharon R Housh"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Ann Carlin"}, {"rating": 1.0, "review": "We continue to have a great amount of trouble with this product. Tech Support helped resolve one issue to get the the Fire TV Stick to actually install and operate properly (the extender cable apparently is faulty on a lot of these), but we constantly get error messages. I wouldn't recommend the Fire TV Stick to anybody.", "verified": true, "helpfulness": "0/0", "author": "dkla"}, {"rating": 4.0, "review": "I travel a fair amount and found this to be a plus vs. hotel TV.  What I don't like is the selection certainly seems to be narrow and the much the same as the endless reruns you see weekend after weekend on TV.  I for one wouldn't mind a larger section of older movies to pick from.  You can also download the android app for your smart phone and to voice search by actor or title.  This could be a certain 5 star if it where just a bit closer in price to the National Rbox rental chain however, it seems to consistently come it at double the price if you are considering renting a 1st run movie.", "verified": true, "helpfulness": "0/0", "author": "The Dude \"printDoc\""}, {"rating": 4.0, "review": "easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "gunter h stein"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "denise simpson"}, {"rating": 5.0, "review": "Easy, plug and play. No major setup instillation problems. I had to use the adaptor because my port was too close to the TV and the fire stick is a bit wide. My husband loves the games function. Have a cheomecast and this is a superior purchase.", "verified": true, "helpfulness": "0/0", "author": "Red"}, {"rating": 5.0, "review": "I love the fire stick and the options and music. I wish I had bought this before", "verified": true, "helpfulness": "0/0", "author": "cheryl ohara jenkinson"}]