[{"rating": 5.0, "review": "Works better than Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Stev2891"}, {"rating": 4.0, "review": "This is a great device and I truly love it.  My only complaint is there is no way to connect to external speakers.  Pandora sounds pretty limp with just the TV speakers.  I was hoping to run it through my Yamaha stereo.  If you are getting this to listen to music I suggest the Grace digital Pro.the Fire TV stick is great for every thing else.", "verified": true, "helpfulness": "0/0", "author": "John Errera"}, {"rating": 4.0, "review": "Just got the Fire Stick, so far I love it, it's just hard figuring out what to watch because of so many movies and shows available, a voice contrôlée would be better, but trying to save some money", "verified": true, "helpfulness": "0/0", "author": "Lespaul"}, {"rating": 5.0, "review": "Amazon Fire Stick works perfectly in a room that doesn't have satellite  tv. The router is upstairs in our house and the fire stick has no problems detecting it. Installation was simple and easy to do. You can get apps from amazon.com and they will automatically download on the Kindle Fire Stick. The audio and video are excellent and many are HD.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "Easy to set up.  Really enjoy what is offered on Amazon Fire and it's nice to have it in more than one room.", "verified": true, "helpfulness": "0/0", "author": "Jeanne Platano"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Daniel Jimenez Chavez"}, {"rating": 5.0, "review": "I brought this stick for my boys play room tv (a non smart flat screen tv). We love it. It's on the other side of the house which I still have a great wifi connection. We have all the apps attached to  our stick connect to our cable provider. We stayed with the regular remote which works great not a fan of the voice devices. My oldest loves the games as well.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "I had a smart TV in my room, but then the one in the living room went up, so I put the smart tv there. I bought a 32 inch emerson basic HDTV for my room and was streaming movies through my BluRay player. Then I seen the Amazon Fire Stick. My primary reason for buying it was so that I could stream my prime music through it. I don't use anything else now! Not even regular air tv!", "verified": true, "helpfulness": "0/0", "author": "John R. Brand"}, {"rating": 5.0, "review": "We have one smart tv in our family room so if I want to watch one of my chick flicks or rewatch old episodes of Grey's or Scandal, it's off to the bedroom to log on to Netflix or Prime on my kindle.  When I saw how the fire stick works, I couldn't wait to order one.  All you need is a tv with an HDMI jack and a fire stick and you have a smart tv.  Lots of apps (I only use Netflix, Prime and a few other popular ones) available and it works beautifully.  The remote control has only a few buttons so it's easy to use.  I'm very happy with my purchase and highly recommend the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "CeeCeeCee"}, {"rating": 5.0, "review": "It is so nice to watch the Prime movies and TV options.  I had been watching them on my Kindle, but now my husband and I can enjoy them together.  Thank you so much for this technology.", "verified": true, "helpfulness": "0/0", "author": "Betty Jane Susbauer"}]