[{"rating": 5.0, "review": "Easy to plug in and set up.  Have already watched a couple of movies.  I'm enjoying the convenience of having it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had a little trouble getting it installed and the tech support people we super. I was up and going quickly. Very nice staff!", "verified": true, "helpfulness": "0/0", "author": "Sandra Nomer"}, {"rating": 4.0, "review": "No one wants to have to use a second controller to turn their TV on and off or control the volume.The product and interface seem great after having it for one day. It needs a programming easy fix to make everyone who has purchased the product happy. Add Universal Remote, power and volume control capability; using the center, up and down buttons on the control.The controller already uses infrared technology and universal remote technology is decades old, so combining the two will greatly improve the produce usability.", "verified": true, "helpfulness": "0/1", "author": "Bernard \"MrJazzTech\""}, {"rating": 1.0, "review": "I bought two of these and plugged in the hardware in various combinatrions (trying to trouble shoot the 4 various components) on two seperate tv sets.  One of the sets is a vizio that has a fios DVR that works fine connected to any of the HDMI slots. The Vizio also has a good wifi connection and is able to play Netflix or Amazon's Prime tv just fine.Still in every combination I have tried the message that comes up as \"No SIgnal\"  I might as well be plugging in nothing. I can think of nothing further to trouble shoot.  Maybe there is a bad batch that got shipped?", "verified": true, "helpfulness": "0/1", "author": "Alice E."}, {"rating": 5.0, "review": "Best streaming device available!  I bought two of them and plan on buying more.  Would make a great gift!", "verified": true, "helpfulness": "0/0", "author": "AmazonMom34"}, {"rating": 5.0, "review": "Love my Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "i love it"}, {"rating": 4.0, "review": "Great device for watching Amazon prime video. So far no complaints. Nice little remote too.", "verified": true, "helpfulness": "0/0", "author": "Trey"}, {"rating": 5.0, "review": "Seems to b great!!!", "verified": true, "helpfulness": "0/0", "author": "Janet Lynn \"luv2read\""}, {"rating": 3.0, "review": "cannot get subtitles", "verified": true, "helpfulness": "0/0", "author": "Marcia Shainsky"}, {"rating": 4.0, "review": "Didn't know what to expect, the price was right, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Frederick Bloemker"}]