[{"rating": 4.0, "review": "Saving money using prime and netflix and cutting cable. The remote isn't so great. Thus, eliminated one star.  Still trying to get the phone app on my Android.", "verified": true, "helpfulness": "0/0", "author": "Mary Raine \"Be Nice\""}, {"rating": 1.0, "review": "Could never get it to connect after several weeks of attempts. I'm throwing in the trash. Too bad I can't rate it with zero stars.", "verified": true, "helpfulness": "2/3", "author": "David Myers"}, {"rating": 1.0, "review": "Worked less than a day.  Won't connect to any WIFI at all on second day.  Connection errors.  Way too weak an WiFi antenna. Never any WIFI problems with ROKU or Chromcast. Very disappointed as the Fire TV Stick menu for Amazon Prime Video looked so awesome for the one day it connected and worked.Should be recalled or discontinued based on all the poor reviews with WIFI issues until issues are resolved.  Amazon customers expect and deserve a better product.  Buyer beware!Update: Talked with Amazon and they are exchanging item.Update: Received the refurbished stick only without power or cord.  Same exact issues as first fire stick (connected until it downloaded the updates, then it wouldn't connect again after updates applied.)  Good thing I hadn't returned the original package yet as I needed the power supply and HDMI extender as Amazon didn't ship that with the exchanged item.I feel like Amazon is using it's customers for beta test of this device as it is definitely not ready for prime time (no pun intended).", "verified": true, "helpfulness": "1/2", "author": "BobB"}, {"rating": 5.0, "review": "Absolutely great!", "verified": true, "helpfulness": "1/1", "author": "jam"}, {"rating": 5.0, "review": "Love the Fire TV Stick.  Able to watch all the new movies at any time.  Clarity is great.", "verified": true, "helpfulness": "1/1", "author": "Diane Woo"}, {"rating": 1.0, "review": "It's simply not reliable.  I think they call it the Fire Stick because when you're done using it you really want to torch your TV! It freezes up often, usually about 50 minutes into a program. We have tried re-setting it etc, and get it going again, only to have it freeze again.  Oh, but sometimes just the picture will freeze and the sound will keep going. Kind of like listening to programs on the radio like how your Grandparents used to listen to programming. Which, I suppose if that's what you're going for...", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this for my husband for Christmas strictly so that he can view Netflix on our TV. And he LOVES it!I will admit that at first I had a bit of trouble trying to install the stick onto the TV itself (but the issue was with the tv, not the stick). However, once I got it in, setting it up was extremely easy. The stick is automatically registered to my Prime Account, so we can also watch Prime Video as well. I also like the fact that we can play games with this as well.The menus are easy to navigate so that my husband can go from Prime Video to Netflix with ease. Another interesting feature is that if you turn off your TV in the middle of a movie (at least on Prime), you can pick up right where you left off once you turn your TV back on WITHOUT having to navigate to it. Of course, that's provided that no one else uses it after you.All-in-all, I highly recommend this stick for those who like to stream movies. And with Amazon's game library growing, it can also be a great addition to any game console you may already have.UPDATE: 5/2/2015I installed this on my HDTV, which is also hooked up to my satellite provider's DVR. Because of the location of the TV in respect to our internet router, sometimes we will lose an internet connection to the stick. According to the Help page on Amazon, using the included HDMI adapter (and unplugging the stick from its power cord for 30 seconds), allows the stick to keep an internet connection better because it's away from the TV.  After using this method, I have no longer had a problem with the Stick connecting to the internet, and can still enjoy streaming and playing games.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Rooobeee\""}, {"rating": 5.0, "review": "This was a surprise Christmas present from my husband, and I love it.  (I even installed it myself, it was easy!)  Now I have so many more viewing options in my own workroom and don't have to venture into the \"man-cave.\"", "verified": true, "helpfulness": "1/1", "author": "Patricia Mora-Coxe"}, {"rating": 4.0, "review": "Ok, I really like the convenience of this.  And I probably should give it 5 stars, but with my cable provider, the internet seems to slow down at night and sometimes cannot stream the video.  Not Amazon's fault though.", "verified": true, "helpfulness": "0/0", "author": "Abby"}, {"rating": 1.0, "review": "I think it sucks! It needs to refresh every other minute. It took me 1.45hr to watch a 45m show.", "verified": true, "helpfulness": "0/1", "author": "Michael J Leyk"}]