[{"rating": 5.0, "review": "Just plugged it into an HD port and then connected power. It prompted me for wifi password. It automatically works with my Bose system. The image, sound and speed are perfect. Much better than the built in apps on my tv and much easier than google chrome I tried. I bought it to stream Amazon prime but now use it for all streaming", "verified": true, "helpfulness": "0/0", "author": "jmadigan"}, {"rating": 5.0, "review": "We bought this for our summer home on an island, where the only choice in television is direct TV.  WE love it!", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 2.0, "review": "Side loaded app should show up on the main page also.Apps and games are lacking in selection", "verified": true, "helpfulness": "0/0", "author": "Ho Yin Cheng"}, {"rating": 5.0, "review": "Super easy to hook up and easy to use , Has so many shows and apps we had one and ordered another for my daughters room , She has Cerebral Palsy and cannot read or write but has no problem using this to get to her shows and music with no help at all from me ...Best thing since PB&J; :)", "verified": true, "helpfulness": "0/0", "author": "KImberley Dorsey"}, {"rating": 5.0, "review": "Love the fire stick! Thinking about getting one for the living room tv too, instead of connecting thru the WII. My granddaughter is thrilled with all the shows and movies we can watch now!", "verified": true, "helpfulness": "0/0", "author": "Michele Reynolds"}, {"rating": 5.0, "review": "Easy to use and perfect for my kids' room.", "verified": true, "helpfulness": "0/0", "author": "Christopher Mosier"}, {"rating": 5.0, "review": "I am so tired of cable and the high cost for channels I don't want or use but have to have with the \"package\".  The stick allows me to watch what I want, maybe not all the shows, but enough.", "verified": true, "helpfulness": "0/0", "author": "cj"}, {"rating": 3.0, "review": "Worked on one TV but not the other.", "verified": true, "helpfulness": "0/0", "author": "CRich \"wick786\""}, {"rating": 1.0, "review": "This is a very good product.", "verified": true, "helpfulness": "0/1", "author": "H.A.S."}, {"rating": 5.0, "review": "we love it; our Wii connection was awfull, but this works like a charm; very very easy to set up. But it!", "verified": true, "helpfulness": "0/0", "author": "john j rankin"}]