[{"rating": 5.0, "review": "Best steaming stick available. Tried them all. This has TONS of potential, if amazon can continue to deliver on the apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Amazing speed and very easy to use. Extremely fast when compared to Chromecast. With Amazon Prime videos subscription, its the best thing to have. Must buy for all movie/TV buffs.The only thing I miss is the fact that they could have provided voice supported remote with the device. Buying that separately makes the existing one redundant..!!", "verified": true, "helpfulness": "0/0", "author": "Sudarshan"}, {"rating": 5.0, "review": "Great productLoads content very quickly", "verified": true, "helpfulness": "0/0", "author": "LAZARO FRANCISCO OLAYON"}, {"rating": 5.0, "review": "So far, so good with Fire TV sticks throughout the house.  The only issue has been that they need an \"update\" out of the box before they work, and you need to be very close for the router for some reason for it to work.  Once updated, everything works great.  I own a couple Roku's and WD TV Live devices, and this certainly seems to be the best all around device as it offers all of the common apps that are lacking with other devices.  We use Netflix, Amazon Instant Video, and Hulu, and everything loads extremely fast and looks great.  I was able to get 2 of these for $20 each with the Prime member offer, but it is certainly worth the $40 price if you have a TV with an HDMI port and decent wifi.  Be aware that these sticks do require an external power supply which is included in the box.  The remote is simple and easy to use, and young kids have no trouble navigating with it.  I'd recommend this to anyone looking for an alternative to expensive cable or satellite packages!", "verified": true, "helpfulness": "0/0", "author": "Chris W."}, {"rating": 5.0, "review": "Awesome entertainment for kids and adults, amazing charity, easy to install and operate, the entire family enjoy it so much", "verified": false, "helpfulness": "0/0", "author": "Marina"}, {"rating": 4.0, "review": "The unit itself works well. Fast and easy to control. Nice menu. Compared to Chromecast it seems faster. Shuffling menu is instant. It freezes up once in a while. Im not sure if this has to do with the stick or my router (it happens when it goes to sleep and drops the wifi).I live in Denmark. Amazon Prime is not available here... at least not without fiddling with DNS settings etc. Please make this available soon. That will make this unit a whole lot more useful. I only use it for Netflix at the moment. This it does well, but purposes are limited... but as I said - the unit itself is very good and cheap!", "verified": true, "helpfulness": "0/0", "author": "kim blidorf"}, {"rating": 5.0, "review": "Easy to install and understand", "verified": true, "helpfulness": "0/0", "author": "Sherricka H."}, {"rating": 5.0, "review": "If you are an Amazon Prime member, the Fire Stick is a great choice....Very efficient way to stream all of your entertainment...You should be able to take this with you on vacation and use in your room/condo, etc...Assuming the wifi isn't locally blocked...Amazon is always good to deal with...", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "I love this gaget!  My Dish Network box is HD, so the Fire TV Stick delivers HDTV and my picture is wonderful. There is so much to watch now that I will cancel my Dish.  I bought Chromecast and was not pleased.  I had to use my computer to connect and my internet did not steam well.  With the same internet, no computer necessary, the Fire TV Stick delivers a perfect picture with no static.", "verified": true, "helpfulness": "0/0", "author": "LakotaDLynn"}, {"rating": 1.0, "review": "> Ordered on October 27, 2014, Arrived on Dec 06 2014 with 2 days shipping on prime account.> its like giving your wallet to a kid. one click you will be charged.> Not for me. i am not amazon prime video fan, Fire TV stick doesnt like much anything other than Prime account.Good things:+Other limited apps to install.+Good if you have prime account.+Worth for money, Bundles you will get are worth the money.++ interesting and graphics Games .+voice search app", "verified": true, "helpfulness": "85/100", "author": "Chetan B"}]