[{"rating": 5.0, "review": "I bought this for my girlfriend and now I'm probably going to have to buy this for myself too.", "verified": true, "helpfulness": "0/0", "author": "s. bauer"}, {"rating": 5.0, "review": "Works well, easy to use, quickly shipped", "verified": true, "helpfulness": "0/0", "author": "sheila shea"}, {"rating": 4.0, "review": "Works great out of the box!", "verified": true, "helpfulness": "0/0", "author": "brian s tienhaara"}, {"rating": 5.0, "review": "Installation was amazingly simple, we have two of them that we move around to different TV's and they all worked perfectly.  The unit is operable very quickly, much faster then built-in Smart TV apps on our newer TV's which is always a nice plus.Great for our kids who love watching movies on repeat. Very happy with the Amazon Prime selection of movies, shows & more.  Been using it since it came out several weeks ago and never had an issue with streaming, connectivity, etc. It just works.Great value for the price, allows you to turn any \"dumb\" TV with an HDMI port into a Smart TV.  Now we can toss some of the cable-tv set top boxes and be 'untethered' from the cable company!", "verified": true, "helpfulness": "0/0", "author": "I. Inc \"Richie's Wares\""}, {"rating": 5.0, "review": "LOVE IT !!!!! ONLY I THOUGHT IT WAS COMPLETELY WIRELESS....NOPE STILL NEEDS TO BE PLUGGED IN TO AN OUTLET.", "verified": true, "helpfulness": "1/1", "author": "DMB"}, {"rating": 5.0, "review": "Great Product, plugged it in, did the setup and it has been working flawlessly.  Its great having access to the Amazon Prime movies. Have been using the voice remote and it works awesome.", "verified": true, "helpfulness": "0/0", "author": "J. Ustick"}, {"rating": 3.0, "review": "I thought you should be able to shop on Amazon with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "John Miller"}, {"rating": 3.0, "review": "it was very easy to install, however, i have to return it because my internet is not the greatest and all it would do is buffer when i tried to watch a movie. so im really disappointed in that!", "verified": true, "helpfulness": "0/0", "author": "julie l. fogle"}, {"rating": 5.0, "review": "Met all my expectations considering I already have a couple of regular Firetv, they still have a lot of catching up to do with content to beat Roku.", "verified": true, "helpfulness": "0/0", "author": "dcbag"}, {"rating": 4.0, "review": "I like it. It's not bad, but I prefer Apple TV.  I prefer how Apple TV integrates with all the other computers and iOS devices in my house. The bluetooth remote on this is superior, though.The interface is okay. Prime Movies work well. Netflix looks good.It's not just a stick though. It's a stick with an outlet that attaches to a cable cord. It's hard to hide on the side of a TV. We have ours plugged in directly to our Onkyo Receiver input which works well.", "verified": true, "helpfulness": "0/1", "author": "Noah Fleming \"Noah Fleming\""}]