[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Chill the Gadget Man"}, {"rating": 5.0, "review": "Great device. Very simple to use.", "verified": true, "helpfulness": "0/0", "author": "Peter A Rodriguez"}, {"rating": 3.0, "review": "Bad receptor which rarely connects to the wifi signal. Getting hot while using", "verified": true, "helpfulness": "0/0", "author": "Khanh Do"}, {"rating": 5.0, "review": "This thing is great!  Plugged it into an available HDMI port on my Pioneer VSX-822-K A/V receiver and couldn't get away from the TV for hours!  Easy setup, nice interface.  My two unexpected surprises were Amazon Music - great to have access to all my music through the Fire TV Stick, and the Remote Control app for my phone - nice to have an alternative to the remote if needed.  I like the interface for Amazon Video--binge-watched 4 episodes of Falling Skies without having to touch the remote.  Dangerous!  I've got a Chromecast as well on another TV and this definitely compares favorably.", "verified": true, "helpfulness": "0/0", "author": "Dan McElroy \"consumer\""}, {"rating": 5.0, "review": "Made my tv a smart tv for way cheap! I love it", "verified": true, "helpfulness": "0/0", "author": "c7660"}, {"rating": 5.0, "review": "It was everything I hope it would be", "verified": true, "helpfulness": "0/0", "author": "dennis"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. FAR exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Pamela Crandall"}, {"rating": 5.0, "review": "Excellent!!! Dropped cable and now I am saving hundreds of dollars.  Thanks to this streaming stick.  The best thing ever!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have a Roku streaming stick ($50) and I have the Amazon Fire TV stick.The Amazon is faster. A lot faster. But the Roku has a little nicer interface. Amazon is also nice because of the games. That's a plus. But in the 2weeks that I've had the Amazon, it has froze/lagged on me more times than I like. For that reason, the Amazon gets a 4star rating.Overall: U can't go wrong choosing the Roku stick OR the Amazon stick. But I prefer the price of the Amazon ($39).", "verified": true, "helpfulness": "0/0", "author": "Duangdee Phommalee"}, {"rating": 5.0, "review": "The Fire TV Stick seems to work quite well with our 42 inch Sony 3D TV.  We are pleased that we can pause the videos and fast forward and reverse.  I could not get the stick itself to insert into the HDMI slot, but it will insert via the HDMI extender that came in the box.  In another room, 10 feet away, we have a Samsung 24 inch TV/computer monitor in which we tried the Fire TV Stick, but a message appears that our internet connection is too slow and it has to buffer too much.  However it is the same Wi-Fi as with the Sony.  It must be that the Samsung doesn't have enough memory to allow streaming of videos.", "verified": true, "helpfulness": "0/0", "author": "Bob Oaks"}]