[{"rating": 5.0, "review": "I'd actually give it a 4.5, but the new update justifies the 5. Now it's easier to 'put to sleep'. Next improvement should be to be able to power of the tv with the remote. I can easily power on but not off. Might also be nice to control volume.Overall I love it.", "verified": true, "helpfulness": "0/0", "author": "Nelly Sabel"}, {"rating": 1.0, "review": "Garbage. This is worst piece of electronics that I have ever purchased anywhere. Awful performance. Freezes, lags, remote never works. I highly recommend that you DO NOT purchase this awful item. I am very disappointed.", "verified": true, "helpfulness": "0/1", "author": "E"}, {"rating": 4.0, "review": "The stick pretty much works as described. I bought the stick specifically because it says it will soon have two important features:1. Coming soon--take Fire TV Stick with you to use with HDTVs in hotels, college dorms, or anywhere with captive portal Internet access that requires entering a password or a log-in.2. HBO GO - Coming spring 2015========================The HBO Go feature (item 2 above) became available on the Fire TV stick on March 18, 2015. I downloaded and installed the app and it works.Not that Amazon did anything to let me know of its finally supporting the HBO Go feature on the stick. I learned about it completely by accident.The \"log in at a hotel\" feature (item 1 above) became available on the Fire TV stick on April 14, 2015.  It works.  I was in a hotel and I was able to satisfy the hotel's access requirements just fine.  This included typing in my room number and my name and picking how many days of Internet access I was signing up for.  The Fire TV stick launched a sort of web browser which allowed me to do all of these things in the hotel.", "verified": true, "helpfulness": "0/0", "author": "carl oppedahl"}, {"rating": 2.0, "review": "I have owned a Roku for 3 years. I wanted to have another one for another T.V. in my house. I was in the process of buying the Roku stick when I saw the Fire Stick. I decided to try it since it looked to be the same when reading about it. Plus it was $10 cheaper. First thing I noticed compared to my Roku is, the home screen is full of crap that I do not want. Reminds me of popups on my computer. Second, it is really hard to find the cursor when trying to setup app log ins.  I never was able to log into WatchESPN.For me, the Roku is much better. It is more like a smart phone. You have your apps on the home page and you only have to see material from the app once you click on it. Another plus is Roku has a tone when you hit a button on your remote. I sent mine back and paid the extra $10 for the Roku 3500R.", "verified": true, "helpfulness": "0/0", "author": "Birddog"}, {"rating": 4.0, "review": "Easy set up. Easy to use. Nice, intuitive remote good option if you don't have smart tv", "verified": true, "helpfulness": "0/0", "author": "Paula Connolly"}, {"rating": 5.0, "review": "More than I expected! Excited to learn all about it.", "verified": true, "helpfulness": "0/0", "author": "Frankie Rodriguez \"fkkrodz15\""}, {"rating": 5.0, "review": "The best streaming player out there ... not problems so far", "verified": true, "helpfulness": "0/0", "author": "myjam \"myjam\""}, {"rating": 1.0, "review": "Doesnt work with my favorite app. Mlb.tv......dont waste your money. Get a roku3", "verified": true, "helpfulness": "0/1", "author": "Christopher Abbott"}, {"rating": 2.0, "review": "I can't believe how useless this is.  They advertise downloadable instant video with prime.  Unless you own a kindle fire don't count on it.  I have tried.  This WILL NOT help you cut the cord unless you have unlimited internet access at very high speed to prevent buffering and picture blurr.  You have a limited access to shows, movies and apps.  Glad I didn't pay for the stick got it free when I signed up for sling tv and that has NOT  been streaming NHRA Racing on ESPN & TNT at all well buffers alot with 10 gig a minute download speed.  Thank goodness for free broadcasting still.  Still not going back to the Cable Company!!!!  It's about time to step up technology to match the high costs.", "verified": true, "helpfulness": "0/0", "author": "Edibean"}, {"rating": 1.0, "review": "Can't use! Causing my 3D TV to flip on and off of 3D uncontrollably when watching Netflix!!", "verified": true, "helpfulness": "0/1", "author": "Johnny D Anderson"}]