[{"rating": 5.0, "review": "Fast as heck!  Way faster than Samsung smarthub.  Android phone app is really cool and works terrific.", "verified": true, "helpfulness": "1/1", "author": "DR_pdx"}, {"rating": 4.0, "review": "With Amazon's backend help, was able to register the product. It's great to be able to access my Prime content on my TV. I haven't noticed any drop in wifi connection, or problems streaming. seems faster than my chromecast. The remote is small, though, and can get easily lost. Well worth the money, just dropped one star because the remote is easily lost.", "verified": true, "helpfulness": "6/11", "author": "Susan Garcia"}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "1/1", "author": "J. Morgado \"Aten\""}, {"rating": 5.0, "review": "This is awesome! We love our Amazon Fire Stick! We've been watching Netflix, Amazon, and Hulu shows nonstop and thoroughly appreciate that each app provides captioning. It's a great price and a great buy for everything it offers!", "verified": true, "helpfulness": "1/1", "author": "Erika Cordero"}, {"rating": 3.0, "review": "It doesn't load as good as the Roku", "verified": true, "helpfulness": "1/2", "author": "Bruce Price"}, {"rating": 5.0, "review": "Setup was easy. Remote works great. No issues.", "verified": true, "helpfulness": "1/1", "author": "marvster"}, {"rating": 3.0, "review": "The reason I am giving this a 3 star is not because of the stick itself, it's more of the included remote. In order for the remote to function, you must be able to point it at the stick, and within 5 feet of the stick. If your HDMI connection is behind the TV, like 99% of all TV's out there, you're out of luck. The remote must be in direct line of sight of the stick for it to work properly. It was very frustrating to see clicks on the remote not being registered or suddenly you see the \"pages\" move all the way to the right or left. (Delayed responses.) To remedy that, I have to use the firetv remote control APP on my phone to control the stick, the APP works great, but the physical remote is reason I picked this over the Chromecast.Pros:- Great interface, good variety of APPs- Very good price if getting yours for <$25. (Prime member discount or other store specials)Cons:- The included remote does not work well- Stick gets burning hot after few minutes of running- No option to turn the stick off if you're plugged into the power source (wall jack or power strip etc), other than unplugging it, no off button. (It goes into screen saver mode)It would be nice to have an option on settings to power the stick off when the TV goes off. (If you're plugged into the USB on the TV, it does that, but not if you're plugged into a non-TV power source.)", "verified": true, "helpfulness": "1/3", "author": "W.J"}, {"rating": 4.0, "review": "The Amazon Fire Stick is very impressive.  I am able to access my Amazon music collection, as well as all Amazon Prime video and movie selections.  Video is displayed in phenomenal HD.  Set up is easy and using the mobile app for your Android device enables voice search and easy control of the stick.I haven't yes explored all of the available options, but this little stick has better specs than my Apple TV and gives it a run for its money.My only complaint would be a sporadic glitch in the audio every once in a while.  Akin to a CD getting stuck in one spot.  These occurrences are rare and really no big deal.  As a matter of fact, if this is my only complaint, I'd say that Amazon has done a great job.  One feature out of Amazon's hands is the fact that this stick has to have a power cable.  HDMI does not have the power to run this stick, unlike some USB devices and their respective ports.The fast-play feature works very well for movies.  I sat the kids down to watch 'Barnyard' and the movie didn't buffer or require loading time at all.As a Prime member, this stick is definitely worth the price.  I can't imagine enjoying it as much if I wasn't a Prime member, however.", "verified": true, "helpfulness": "1/1", "author": "D. Park \"palanark\""}, {"rating": 5.0, "review": "I really loved the Fire TV stick. The display is crisp, had a concern about how is it going to react to the remote. Loving it!!!", "verified": true, "helpfulness": "1/1", "author": "Suresh K. Medimi \"Cricket Lover\""}, {"rating": 5.0, "review": "Worked like a dream right out of the box , took me less then 5 minutes to set it up and it was all right there , my stuff , videos ,movies, It was easy and I think i will be using it quite a bit , plus all my music from prime was there so its easy to play my music from the TV and stereo , I'm buying one for every tv in the house.", "verified": true, "helpfulness": "1/1", "author": "John Augustine"}]