[{"rating": 5.0, "review": "So far I love it! I really only use it for Netflix, Hulu, Pandora, and YouTube (because the other apps require subscriptions or whatever), but so far it has been great. I didn't want to shell out a ton of money for the AppleTV, plus my boyfriend has it, and while it is great and I am a avid Apple fan, this tiny thing does what I need it to do, at half the price.", "verified": true, "helpfulness": "1/1", "author": "Corrie"}, {"rating": 4.0, "review": "We used the Amazon Fire TV stick on a recent trip and it was brilliant. Plug it in, get it set up with the hotel wireless, and go!We'd tried the Roku stick first, but it couldn't handle the hotel wireless system (which required that you click \"agree\" to gain access). Fire TV had no problem with that at all. It was easy as pie to get it up and running.My only complaint is that the Fire TV Stick doesn't get as good of wireless reception as the larger (puck-sized) streaming devices.Otherwise, though, it's the perfect media player while on the road.", "verified": true, "helpfulness": "1/1", "author": "J. Walsh"}, {"rating": 3.0, "review": "should work with tv usb not an extra adapter. Apps should work in all countries", "verified": true, "helpfulness": "0/1", "author": "Nelson Herrera"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Demetria A. Marcelle \"dam\""}, {"rating": 5.0, "review": "No more Directv", "verified": true, "helpfulness": "0/0", "author": "Todd O."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Garrett P."}, {"rating": 5.0, "review": "Great product. You won't regreat it.", "verified": true, "helpfulness": "0/0", "author": "Roberto castro"}, {"rating": 5.0, "review": "This was so SO easy to install and start using. Then we rented our first movie Exodus Gods and Kings because Amazon was the ONLY place we could rent it. We had some slow spots (Internet?) but then today Amazon refunded the cost of the movie because of the trouble we had. And we hadn't even told them! Kudos Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ruth Grimley"}, {"rating": 5.0, "review": "I previously bought the Amazon Fire TV box and was pleased but the Fire Stick is perfect for my smaller TV. It works just as well as the box and it's a lot more condensed. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Sarah Kennedy"}, {"rating": 5.0, "review": "Great product for a fraction of a price!", "verified": true, "helpfulness": "0/0", "author": "Isidro Butch S Calonia Jr"}]