[{"rating": 5.0, "review": "This is a great little streaming device full of content and relevant apps. Plan on buying two more in the near future as gifts for the kids.", "verified": true, "helpfulness": "0/0", "author": "John M Fitzgerald"}, {"rating": 4.0, "review": "Very easy connection. Plug into TV and it does what it needs to do to get you ready! Highly recommended!!!", "verified": true, "helpfulness": "0/0", "author": "annamarie glorioso"}, {"rating": 2.0, "review": "Very disappointed.  Didn't know much about the fire stick just what I saw advertised and that looked promising.  But found out half the stuff I was interested in was a separate purchase and the hbo go had to be on a tablet.  Very few movies to chose from.  If I had known  this about it I would not have purchased the stick.  Seriously thinking about returning.", "verified": true, "helpfulness": "0/0", "author": "picky"}, {"rating": 5.0, "review": "Awesome and so easy to use", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "Awesome little device. Great for the cost. Only problem sometimes it reboots by itself. besides that.. I love it! I wish there was a Time Warner Cable App for it.", "verified": true, "helpfulness": "0/0", "author": "Jorge Hernandez"}, {"rating": 4.0, "review": "So far we have really really enjoyed the fire stick. Its great and easy to use. It just makes me uncomfortable how there is no off button. I don't like things that don't turn off just \"sleep\". And it would to so useful if when you typed into the search on the home menu that it pulls up the results from all the sources you have like Netflix and Hulu and amazon. That way you don't have to go through each individual one. But over all really cool and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Devi"}, {"rating": 5.0, "review": "Great... better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "this is no a review is more a question... this product wont have problems to work in the Dominican Republic (Regional Restriction)", "verified": false, "helpfulness": "0/0", "author": "Orlando"}, {"rating": 5.0, "review": "Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Terry Mikula"}, {"rating": 5.0, "review": "Excellent product. Works and does everything as described and then some. Once again, great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "George S."}]