[{"rating": 4.0, "review": "It's good; but it doesn't support Miracast with Windows 8.1. Please add the support Amazon.", "verified": true, "helpfulness": "0/0", "author": "Sina Gholamnejad Davani"}, {"rating": 4.0, "review": "Great addition to home media setups. I have a Samsung Smart TV, but I prefer to use my Fire Stick. My only gripe is that it lacks screencast capabilities.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "It's almost a Roku, but it's much better than a Chromecast.  The interface is confusing at first.  It's obvious this is designed for Amazon Prime users, which isn't overly surprising.  My biggest gripe, and the reason for only four stars, is it may not work well if you use the USB port on your TV to power the device.  It gave me some cryptic warning when I did the initial setup.  I haven't noticed any issues, but you'd think the engineers could have designed it to work off of the power available in a TV's USB port.", "verified": true, "helpfulness": "0/0", "author": "Ernie Beckley \"Quality will be remembered long after price is forgotten.\""}, {"rating": 5.0, "review": "Great, as the other Kiindles I've had.", "verified": true, "helpfulness": "0/0", "author": "Linda C. Herrold"}, {"rating": 5.0, "review": "Easy setup. Menus look great! Teenage boys love it. If you are Prime, this is a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Icewater144"}, {"rating": 5.0, "review": "It Just Works! Exactly what we have come to expect from Amazon - quality. This was perhaps the easiest thing we did all year.", "verified": true, "helpfulness": "0/0", "author": "Roberta Cumberworth \"Bobbie\""}, {"rating": 5.0, "review": "We own an Apple TV and Xbox and I enjoy the fire stick the most.", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 2.0, "review": "It sorta works. All the claims about performance are overstatements to me. The supposed smooth streaming and holding of favorite show stuff is not there - lots of freeze ups and early on you'd try to pick a network and it would just dump you back at the beginning. Sometimes one network is fine and another terrible - before you say it's the network know I could use a competitor service (Roku if I am allowed to say it) at the very same time and it worked. I am VERY disappointed. I am not \"fired up\" about this product.", "verified": true, "helpfulness": "0/0", "author": "Eryn"}, {"rating": 5.0, "review": "This is an amazing device worth every penny. You have such a varied choice of programs that come in just like my cable channels, although I do wish that more TV programming were offered I am still very pleased. I can't do away with cable but it is a good companion to it.", "verified": true, "helpfulness": "0/0", "author": "Richard Matevish"}, {"rating": 3.0, "review": "We're still getting familiar, but so far I'm disappointed that there is not more free video to Prime members. I assumed I'd get to watch tons without added fees, but it appears the free video inventory is pretty short. I need to review further, but it seems like most of what I can view is already available through my cable provider. However, set-up was simple, the remote is easy to use and has a small footprint. I hope Amazon improves value by adding more free streams without forcing Prime members to add subscriptions to Netflix, Showtime, etc.", "verified": true, "helpfulness": "0/0", "author": "Fred's Reviews"}]