[{"rating": 4.0, "review": "So far so good. I do wish there were more TV app options, but that may not be an Amazon thing.", "verified": true, "helpfulness": "0/0", "author": "Victoria Langlinais \"VictoriaL\""}, {"rating": 3.0, "review": "Seems can't hear audio on some movies I have choose. It  says unsupported audio signal.,check ur device input..please help..!!!!", "verified": true, "helpfulness": "0/0", "author": "ronni"}, {"rating": 5.0, "review": "The Fire TV Stick is AMAZING! I love my fire stick and I take it everywhere I go.  It works wonders when you are at a hotel that do not have a lot of channels or channels you like to watch.  It was kind of tricky connecting it to the TV.  One thing to remember is, if the hotel TV only have the Direct TV remote you will have to connect it manually using the buttons on the side of the TV to navigate to the TV menu to choose the right HDMI selection for the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Wright"}, {"rating": 5.0, "review": "Perfect little device! Works exactly as it says! Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "stacy marsh"}, {"rating": 2.0, "review": "Used a couple times before a purchase a tablet and a apple TV. Download the app for amazon then you are done, much more convenient instead of using the stick, I think.", "verified": true, "helpfulness": "0/1", "author": "Dan M"}, {"rating": 1.0, "review": "This product does not work well with old technology.  I bought it as a gift and tried to install it.  I had the RCA adaptor, power supply, and all parts needed, but when installed this did not work.  The image quality was poorer than cable (I did have the correct converter and power to the converter).  The worse part was the screen image was shifted so badly that you could not see the menus.  I was able to shift the screen somewhat, but there was not enough movement to allow the screen to center on the TV.", "verified": true, "helpfulness": "0/1", "author": "D. E. Sheckler"}, {"rating": 5.0, "review": "Bye Bye Netflix!!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Fleming"}, {"rating": 4.0, "review": "Very happy with our fire stick. Just wish there were newer movies to rent for cheaper.", "verified": true, "helpfulness": "0/0", "author": "Olivia Voisin"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "nike"}, {"rating": 5.0, "review": "Great portable streaming device. Easy setup, no issues so far. Already bought another as a gift.", "verified": true, "helpfulness": "0/0", "author": "SB"}]