[{"rating": 5.0, "review": "Nice peripheral, and not pricey compared to others. Great addition to prime service.", "verified": true, "helpfulness": "0/0", "author": "William F Broomfield"}, {"rating": 5.0, "review": "Love it. Easy to use. Great price. Bought 2 and then bought one more", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 5.0, "review": "easy to install, easy to use, easy to enjoy!", "verified": true, "helpfulness": "0/0", "author": "Clemson Girl \"slm725\""}, {"rating": 4.0, "review": "Have not had that long but I am very pleased thus far with the purchase and has just been catching up on past episodes that I missed on certain programs", "verified": true, "helpfulness": "0/0", "author": "Brenda R Cooper"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Gypsey"}, {"rating": 1.0, "review": "Not impressed at all. We spend more time dealing with network issues, freezing frames, and resetting the device than we do actually viewing shows. I don't recommend this product at all for anyone that is looking for an convenient way to stream shows. We are avid Hulu Plus watchers. I am no sure if Amazon prefers us to watch the Prime shows but since day one there has always been hoops you have to jump through to get through just one show on Hulu. Even though every other device in our home running off the same Internet line works perfectly fine. Very dissatisfied with my purchase. Perhaps Amazon should spend more money on quality of the product and working through glitches and less money on Gary Busey flashing on my screen every 15 minutes. REFUND!!!!!", "verified": true, "helpfulness": "0/2", "author": "ms"}, {"rating": 5.0, "review": "Love it! We were late to the streaming game but this has made it so easy. We never realized Amazon included streaming video with Prime until this arrived. Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Bearsblow"}, {"rating": 3.0, "review": "If I were travelling a lot I'd probably love it getting Netflix at hotels and such. But at home we have better options.", "verified": true, "helpfulness": "0/0", "author": "Daniel Kristjansson"}, {"rating": 5.0, "review": "I received the Amazon Fire TV Stick a week ago.  I installed it in my garage and use it when I work out, working in the garage, and when my daughter is outside with me.  It works perfect! So far I like it a lot more than the Ruku 2 I replaced it with.  Its fast, there is no buffering, and easy to operate.  I love that it cam pre-installed with my account and it easily connected to my home WiFi.  I bought my sister one who turned her large Computer monitor into an additional TV for her bedroom by installing the Fire stick into the monitor.  She loves it as much as we do.  Recommend for everyone who watches or interested in internet TV.", "verified": true, "helpfulness": "0/0", "author": "Joseph Banks \"Romanjoe\""}, {"rating": 5.0, "review": "Has many apps to choose from. Quick response.", "verified": true, "helpfulness": "0/0", "author": "Sansone Hang"}]