[{"rating": 5.0, "review": "Excellent picture quality and speed. Really enjoy the Fire TV Stick so far.", "verified": true, "helpfulness": "0/0", "author": "Mike Collins"}, {"rating": 5.0, "review": "I LOVE THIS! It is so easy to use and navigate and is very fast to respond. There is no delay in loading shows or apps. It is amazing, highly recommend!!!", "verified": true, "helpfulness": "0/0", "author": "Kat \"Kat\""}, {"rating": 4.0, "review": "This is a pretty good little device. I got it on the 20-buck introductory sale, and it's a great deal for that price. At the 40-buck current price, well, I'd probably choose a Chromecast or a Roku.The interface is nice and easy to use. It reminds me a LOT of my Roku, but perhaps slightly more refined. It doesn't have as many \"channel\" options as the Roku, which is why it wouldn't be my first pick at the current price.The Fire TV interface definitely puts the Amazon content first and foremost, which is not at all surprising and is fine by me, since I mostly use my Roku for watching Amazon Prime Instant stuff.When the Roku (which is a couple years old) is streaming HD content, it will eventually--after several hours of binge-watching--get warm and the video will stutter every now and then. So far, the Fire Stick doesn't seem to do that at all.Overall, for someone with Amazon Prime, this is a pretty good choice, particularly if Amazon drops the price back to 20 bucks. For non AP subscribers, a Roku or Chromecast is probably a better option.", "verified": true, "helpfulness": "0/0", "author": "JK"}, {"rating": 2.0, "review": "I would like to give this device a better rating but due to the fact it needs to be rebooted like every other day I have to mark it down.  I've owned Roku's and Chromecasts which never seemed to have an issues like this.  The worst part is there doesn't seem to be option to reboot the device from the software I have to go dig it out from behind my receive and reset the power on it...Hopefully they can sort the bugs or at least add reboot option to the software...If there is one I must be missing it.  The speed of the device is very good and the available content is great as well.  If they sort out the software issues I would rate it probably at least 4 stars....", "verified": true, "helpfulness": "0/1", "author": "nh262011"}, {"rating": 3.0, "review": "My fire stick has connectivity issues even over short distances. My other wi fi gadgets work flawlessly in the same place and time. Not so much for the FireStick", "verified": true, "helpfulness": "1/1", "author": "micwrite"}, {"rating": 5.0, "review": "Fantastic for watching Amazon Prime shows in HD. After you experience Prime TV for a while on a laptop, you forget how much better it is to watch these shows on a real TV, and the Fire TV Stick makes a huge difference. I haven't had cable for almost eight years, and I haven't missed it... this little device will ensure that I won't, either.", "verified": true, "helpfulness": "0/0", "author": "Ryan L. Kopf \"L\""}, {"rating": 2.0, "review": "Unfortunately i am also experiencing the 'HDCP Unauthorised. Content Disabled' error anytime I attempt to watch anything on Netflix or Amazon Prime Instant Video. Only get audio. Using a Samsung HD Plasma Screen TV.... Bummer.", "verified": true, "helpfulness": "1/2", "author": "Eddie Gray"}, {"rating": 4.0, "review": "works great , returned this to amazon purchased at retail store almost half price!", "verified": true, "helpfulness": "0/0", "author": "guy barbato"}, {"rating": 5.0, "review": "If your looking for a small streaming device, this is a good product.  I use it for Amazon prime video and Nexflix - it is very simple to install with very simple remote.It is very small, I thow it in my travel bag and use in hotels (plugs into their tv and used their wifi) - so far Ive been it three different ones fortunately all of which had accessible inputs on the TVs and acceptable Wifi.  Also took to cabin,  and used my phone as hot spot - used lots of data of course but device worked well.Have not tried any of the other capabilities though, sorry.", "verified": true, "helpfulness": "0/0", "author": "KR"}, {"rating": 5.0, "review": "I've been using it non stop since I got it.  I also have chromecast.  I like this one so much better.  Obviously I still have a purpose for the chromecast because I need it for the shows I purchased on google play.  I like this more because of the remote.  I like being able to pick up the remote pressing home and my tv turning home and going straight to amazon prime shows.  I know some people say its just as easy to use the phone but its a lot of extra steps. The remote is definitely the winning factor for me.", "verified": true, "helpfulness": "0/0", "author": "B.N."}]