[{"rating": 5.0, "review": "Very easy to use. I am not tech savvy, and this was a breeze", "verified": true, "helpfulness": "0/0", "author": "Sherrye"}, {"rating": 5.0, "review": "Really like it. Works very well.", "verified": true, "helpfulness": "0/0", "author": "perk"}, {"rating": 5.0, "review": "Love it. No issues.", "verified": true, "helpfulness": "0/0", "author": "JackyAGLUV"}, {"rating": 4.0, "review": "Great buy & great price", "verified": true, "helpfulness": "0/0", "author": "dploy619"}, {"rating": 5.0, "review": "This product is amazing and convenient and easy to install and easy to navigate and worth every penny. Makes every TV a smart tv as long as you have wifi. All your Netflix and Amazon info stays stored so you can take from TV to TV and not have to re login each time. We just took it on vacation and it was so nice to be able to play my kids shows or my own (after they went to bed) at a mountain house that has just basic cable. Love the firestick!", "verified": true, "helpfulness": "0/0", "author": "Alyssa Rose"}, {"rating": 5.0, "review": "Great and easy to use. The access to Prime is what sets it apart form the other systems I used.", "verified": true, "helpfulness": "0/0", "author": "Christopher Gault"}, {"rating": 5.0, "review": "Easy to set up, easy to use. It has all the streaming apps I need, more than some of the competition. The game functions look interesting, but I'll stick with my consoles. Would be good for families, though.", "verified": true, "helpfulness": "0/0", "author": "James Corley"}, {"rating": 5.0, "review": "Wide variety of entertainment options. Easy to get started and use.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Great TV app and easy to use.  Would be nice to make downloading other programs easier.  Still fantastic for the price.", "verified": true, "helpfulness": "0/0", "author": "rob brown"}, {"rating": 5.0, "review": "It's fast and easy to use. I like all the Prime content. Like others I wish it was a little more flexible in terms of content without Prime but overall a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Thomas A. Hernandez"}]