[{"rating": 2.0, "review": "I really wanted to like this item but unfortunately whenever it is static for more than 8 hours it looses connectivity. I'm an IT guy so I already did all the \"fixes\". The big problem is that it will loose connection with PLEX and I have to restart the device before it will connect again....this is the same with all the media on Fire Stick.Also, I run a \"N\" network with all gig wired and the video quality is substandard.", "verified": true, "helpfulness": "0/0", "author": "Robert Turner"}, {"rating": 5.0, "review": "This works great! I had chromecast and I feel like fire stick loads faster. And I liked being able to fast forward and rewind with the remote.  It also has parental blocks (which is part of the guided setup) so kids can't make purchases from prime video. Definitely happy with it.", "verified": true, "helpfulness": "0/0", "author": "Shop mom"}, {"rating": 5.0, "review": "AWESOME ITEM", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 3.0, "review": "The mini USB plug need to go vertically rather than horizontally everything  works pretty good", "verified": true, "helpfulness": "0/0", "author": "Cho L."}, {"rating": 5.0, "review": "Works well. Easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Gary Gale \"ggale\""}, {"rating": 5.0, "review": "Great device! The introduction that walks you through how to use it is amazingly simple, to the point, and extremely helpful. It isn't a difficult device to use by any means but I was impressed by the \"how to\" nonetheless. My only suggestion for improvement - and this is really specific and clearly a first world problem - but it would be great if the photos during the standby section includes where the photo is taken. I bet this would increase tourism to those places ... Who knows, maybe the destinations will pay for the advertising.", "verified": true, "helpfulness": "0/0", "author": "Marcella Agner"}, {"rating": 4.0, "review": "I've used Apple TVs since the first generation, and this is a much better product compared to the long-in-the-tooth Apple TV. For the most part this item suits my needs especially since I use Plex and that is a no go on the Apple TV(without a lot of tinkering). Easy to setup, my only complaint is the remote works over bluetooth or Wifi; therefore I can't use my Harmony remote with it. The price is pretty cheap, and if you use Amazon Prime streaming, Netflix, Plex, WatchESPN, Sling TV, etc this thing will likely have you covered. Nice product... not necessarily great, but pretty nice.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "First things first, it broke my internet. Sounds strange, I know, but it did. I would plug this thing into my HDMI port on my vizio, connect to the the wireless, and then bam! The wireless would all of a sudden have no internet connection. The stick comes with an hdmi extender cable and when I connect the stick with the extender, it does not break my wireless. I have no idea why this is, but it is. Three of the computers in my house, including the fire stick, had zero internet connection on the wireless while the stick was in solo. But those connected via ethernet had no problem. Using the extender made this stop. I pugged, and unplugged three times to make sure that was the problem. It worked everytime.", "verified": true, "helpfulness": "0/0", "author": "Tyler D"}, {"rating": 5.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "drea"}, {"rating": 1.0, "review": "I was so excited to use the fire stick so I could watch all my shows marathon style. What a disappointment! Turns out my 5 yrs old tv isn't compatible with the stick. Had I known that was even a possibility I wouldn't have purchased it and saved myself the trouble of having to return it.", "verified": true, "helpfulness": "1/1", "author": "Nicole"}]