[{"rating": 2.0, "review": "Have to get up and stand right at the TV for remote to work..what good is a remote if you have to get up??", "verified": true, "helpfulness": "0/1", "author": "Nancy Foster"}, {"rating": 4.0, "review": "Definitely lives up to expectations, although I got it cheaper in-store at Best Buy on Black Friday. Only problem has been with connection to Netflix, which works sometimes, fails to work others. Maybe it is a Netflix issue, but my wife and I wanted to have both Prime Video and Netflix with this, and don't quite have them both.", "verified": true, "helpfulness": "0/0", "author": "Stephen J"}, {"rating": 5.0, "review": "We Love, Love, Love it! 😄", "verified": true, "helpfulness": "0/0", "author": "Christine Casey"}, {"rating": 5.0, "review": "Great product, great price.", "verified": true, "helpfulness": "0/0", "author": "Ken Overly"}, {"rating": 5.0, "review": "Love it. Easy to use. I'm very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Tricia Chapman"}, {"rating": 5.0, "review": "I'm tempted to cancel my cable, love it", "verified": true, "helpfulness": "0/0", "author": "melissa pinney"}, {"rating": 5.0, "review": "I love this. It hives me \"big screen\" access to my NETFLIX account.  That alone is worth the price. Prime for me is about the speedy shipping which is outstanding. The other perks are good to have as a bonus should I ever need them. I don't know how I ever functioned without this", "verified": true, "helpfulness": "0/0", "author": "Angel \"Angel\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Marlon leiva"}, {"rating": 3.0, "review": "I thought I would be able to get the local networks after all its free online, their is some free stuff but most episodes you have to purchase. I understand that some things you would have to purchase but I also that that most of it would be free. might as well stick to cable", "verified": true, "helpfulness": "1/2", "author": "James Dalton II"}, {"rating": 3.0, "review": "My Fire Stick has to stay plugged in.  In every picture, it never shows a power plug.", "verified": true, "helpfulness": "1/1", "author": "Jerry Donaldson"}]