[{"rating": 3.0, "review": "I really like its functionality so far.  waiting for the iOS app though.  I also really wish you could stream media to it from a computer.  I guess I should have looked into that before I ordered it.  Kind of a bummer since I still need to use my chromecast for that.I honestly haven't used it a whole bunch but the interface is great and the quality seems pretty good.", "verified": true, "helpfulness": "0/0", "author": "Travis Gallagher"}, {"rating": 5.0, "review": "This s*** is awesome. The controller is handy and small. It loads quickly. With Amazon Prime you get some badass shows. All around a good deal.", "verified": true, "helpfulness": "0/0", "author": "Luis Soto"}, {"rating": 1.0, "review": "There doesn't seem to be any place to enter a username on the \"Connect to Wi-Fi\" screens, which means you can't log into EAP networks.  The Help page does claim that the stick supports it, though:http://www.amazon.com/gp/help/customer/display.html?nodeId=201636570* Make sure you connect your Fire TV Stick to one of these network or router types:  - Open, WEP, WPA/WPA2 PSK, and WPA/WPA2 EAP encrypted networks", "verified": true, "helpfulness": "1/1", "author": "Dan Nelson"}, {"rating": 2.0, "review": "My Fire Stick was just delivered. After an hour of playing with it, I've all but decided to send it back.First it doesn't use my TV's usb port for power. Had to plug into the old fashion way. Annoying, but not a deal killer.Secondly, and most importantly, the picture and audio quality is substandard. I watched 1 TV show and 2 movies (not all the way through) to test it, and then compared it to blu-ray. The audio is flat and sounds muffled while the picture quality seems to be standard definition even though it shows outputting in high definition. I have solid bandwidth, so I know it's not my connection. I could live with lower picture quality if I'm simply streaming, but the audio killed it for me.Personally, I would not suggest this device. My TV, roku, and PS3 all do a better job. The only reason I picked this up is the roku kills my CEC and the Fire Stick was $20. Not worth it in my opinion", "verified": true, "helpfulness": "1/2", "author": "TheCloudX"}, {"rating": 5.0, "review": "Eight Stars not five, five minutes after receiving we were watching Youtube and Amazon Prime movies....Super Great purchase.", "verified": true, "helpfulness": "0/0", "author": "REDTEMP67"}, {"rating": 5.0, "review": "So far so good great price better than the chrome stick they suck", "verified": true, "helpfulness": "0/0", "author": "heidi"}, {"rating": 1.0, "review": "It has a problem staying connected to my WiFi even though nothing else in my house does.", "verified": true, "helpfulness": "2/3", "author": "Mark the Builder"}, {"rating": 4.0, "review": "With Fire TV Stick, Amazon seems to have a winner on its hands.Setup is easy, I was able to power it with my TV's USB port. Though, fire tv stick recommends connecting to a power source, I've had no issues using my TV's USB port. Fire tv stick came configured with my amazon account. Though its new, it still needed a software update which was a surprise.When it comes to hardware, its definitely a step up from competitors like Roku Stick and Chromecast. Dual Core CPU and dual band Wifi is a great plus.Dedicated remote is a great plus as you don't have to look at the remote and use the physical buttons with little practice unlike chromecast where you have to pick up your phone, unlock and open the app to control it. Remote is simple and fast; however the click wheel is not as well designed an apple tv remote which has a depression where your finger naturally rests and feels good, but its definitely not a deal breaker.I felt that UI is definitely better compared to Roku and the voice search feature in the android app is definitely very helpful.Mirroring and flinging videos from phone/tablets is not intuitive and easy as compared to Chromecast. I had to pair the youtube app on the fire tv stick to my phone's youtube for it to get listed in the cast-able devices list on youtube. However, once paired, casting was flawless and worked quite well.Plex works well; allcast can be side loaded as do some of the other apps. Future potential, considering its hardware, really looks good.For anyone invested in amazon's ecosystem, there's really no reason not to consider Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Abhi"}, {"rating": 5.0, "review": "Easy to set up and use. Wish it was easier to search for all available movies.", "verified": true, "helpfulness": "0/0", "author": "Hoop Mom"}, {"rating": 5.0, "review": "I honestly only purchased this to put Pandora and Netflix on a second (non-smart) TV in my house.  I probably would not have purchased it at list price, but Best Buy had a great deal going a few weeks ago so I grabbed one.  It works great, is fairly easy to set up, and provides more than enough free content to waste most of your waking hours with.  It is a little tedious entering search terms with the on-screen keyboard and the remote, but not impossible.", "verified": true, "helpfulness": "0/0", "author": "Ed B."}]