[{"rating": 2.0, "review": "Disappointed. It continuously states I have a low Internet speed, when I have a 20 MB download speed (confirmed with speed test.)  Very frustrating to watch shows when the Fire Stick has to download, play and download more. My Roku has no issue. I cannot recommend the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "P. Hudson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Crystal Gordon"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Richard Vanzandt"}, {"rating": 5.0, "review": "Got this as a gift and the person loves it. Streams tv shows great, wish it had as much power as amazon tv but this costs less and is small. I wish amazon showed in all the pictures that this needed a charger that sticks out the side as they want you to think you just plug in the HDMI and you're good but in reality you need a big charging brick also... plus they recommend extra cord for use as a wifi antenna...", "verified": true, "helpfulness": "0/0", "author": "Ozfer"}, {"rating": 5.0, "review": "Exactly as expected - easy to set up, simple to operate", "verified": true, "helpfulness": "0/0", "author": "Kenneth Marcus"}, {"rating": 5.0, "review": "Great unit. Works well, no problems", "verified": true, "helpfulness": "0/0", "author": "bob40plus"}, {"rating": 3.0, "review": "Freezes often. It's not my signal my ps3 and 4 stream just fine.", "verified": true, "helpfulness": "0/0", "author": "Chris Buchan"}, {"rating": 4.0, "review": "It MUST have an electrical outlet nearby!  Pictures could be a bit misleading in that they only show the remote and stick, not the AC adapter that it must have for power.  Performance wise, it is pretty good!", "verified": true, "helpfulness": "1/1", "author": "Stomp"}, {"rating": 3.0, "review": "Not any good adult movies", "verified": true, "helpfulness": "0/0", "author": "Amiee"}, {"rating": 5.0, "review": "This little device is awesome.  It's rock solid and reliable operation makes it a joy to use.  I've been using two Apple TVs and a Roku HD in our home for about two years now, and there is absolutely no comparison.  Simple, elegant, fast and reliable are the descriptives that come to mind regarding the Fire Stick.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "KBnTB"}]