[{"rating": 4.0, "review": "We added this to watch the WWE network.  Also wanted a more selective movie watching choice.  I was a bit overwhelmed by all the things out there.  The fire stick is doing a great job.  Not hard to understand, son did set up as I can't. Only wish is that there was 1 remote, albeit I can live with the 3 I use now.  Fun to watch some of the movies and enjoy the you tube. Was a good investment for time I will spend during surgery recoup and rehab. Then just knowing it is available is a nice touch.", "verified": true, "helpfulness": "0/1", "author": "Charlene Owen"}, {"rating": 5.0, "review": "Love it love it love it!!!!!", "verified": true, "helpfulness": "0/1", "author": "KT"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "mustI"}, {"rating": 5.0, "review": "#1SELLER", "verified": true, "helpfulness": "0/2", "author": "Antonio Matos"}, {"rating": 5.0, "review": "The set up was very simple and easy to do  The Fire TV stick has lots of cool features", "verified": true, "helpfulness": "0/1", "author": "Michael Newburn"}, {"rating": 1.0, "review": "The hell I am going to,pay for movies like \"Fried Green Tomatoes\" when I have the dvd. The movies that are available suck! Huge disappointment!", "verified": true, "helpfulness": "0/2", "author": "Victoria Magliaro \"Victoria Simmons\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/2", "author": "Ambra Smith"}, {"rating": 2.0, "review": "Purchased this on Prime Day at a great price and was So excited to try it.  I have a ChromeCast purchased a couple years ago, but was going to use FireStick on my 2 other TVs.  What a disappointment!  It would disconnect or not connect at all over 50% of the time.Returning for refund and will stick with ChromeCast which has never had a problem staying connected.", "verified": true, "helpfulness": "1/2", "author": "Msocks"}, {"rating": 4.0, "review": "The Fire TV Stick is the first streaming service I have used so I am no expert by any stretch. Please take my review with a grain of salt.INSTALLATION: Simple. Straightforward. Truly a plug-n-play experience. Just plug it in to an HDMI port and the charger to an wall outlet and your ready to go. The tutorial (once stick is connected) helps as well.CONTENT:  Of course all of Amazon Prime's content is available, so no surprises there. Plenty of content for adults and kids and everything in between. There are a lot of apps available, but some (like ESPN) require an active cable subcription to watch.EXPERIENCE: The menu system is straight forward, with Amazon's content front and center. Evrything you could want to view with the Prime world is available on the stick, so if you're happy with the subscription on your computer you will be pleased with the Fire Stick. There are apps for standalone platforms (Liek HBO G, ESPN, Netfilx, etc.) that can increase your content tremendously.GAMES: This is very similar to android experience in that you download content to your stick and your ready to go. There is an optional controller that you can buy that can increase the number of games you can play (like Sonic!!!), so there should be real growth happening here.CONCLUSION: Everything from the sleek design of the remote to the esae of navigation of the menu makes for an expereince that keeps you entertained for hours upon hours. There is plenty of content for the whole family, and with the addition of apps that require paid subscritions (like HBO Go) this is a hard deal to beat!", "verified": true, "helpfulness": "0/1", "author": "superslidestyle"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/1", "author": "Valued Customer"}]