[{"rating": 5.0, "review": "If you like tons of free movies, this is your buy. $150.00", "verified": true, "helpfulness": "0/0", "author": "dale r blankenship"}, {"rating": 3.0, "review": "Fire TV Stick is alright.  I have not tried the Roku, but it is better than the Chrome Stick in my opinion.  However, this product is terrible unless you buy some sort of hdmi extender.  It does not connect to the WiFi very well unless pointed in the direction of the router.  I was very displeased with this product until I purchased (Aurum Ultra Series - High Speed HDMI Extension Cable Male - Female (10 feet) With Ethernet - Supports 3D and Audio Return Channel).", "verified": true, "helpfulness": "0/0", "author": "Samuel Hayes"}, {"rating": 5.0, "review": "Loved it", "verified": true, "helpfulness": "0/0", "author": "A. Gift For You"}, {"rating": 1.0, "review": "never used, can't get sound thru  with this item", "verified": true, "helpfulness": "0/0", "author": "rich kessler"}, {"rating": 5.0, "review": "Love it!!! Pulled it out of my tv and took it to my neighbors house to show them and they bought one too.  However, don't buy this for someone who doesn't understand apps, or that you really need to have Amazon prime to get all the benefits.  If you intend to use it without Amazon prime, you will be dissatisfied.", "verified": true, "helpfulness": "0/0", "author": "fishgirl45"}, {"rating": 5.0, "review": "Very good interface and convenience. Lot of apps available to select video to watch. The remote is very convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "User1116"}, {"rating": 5.0, "review": "Seems to work great, definitely can tell it has a little more issues messing up than the Fire Tv itself but works great in room", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! I bought a second one two weeks later for the upstairs tv. I like having the dedicated remote. Unlike the Chromecast, the remote makes reviewing programs and selection easier. Plus there are so many apps available.", "verified": true, "helpfulness": "0/0", "author": "Trixie Lu"}, {"rating": 5.0, "review": "Fantastic item.  It is so fast, works great.  A must in every household.", "verified": true, "helpfulness": "0/0", "author": "Bluenight"}, {"rating": 1.0, "review": "Does not work with marginal internet does not buffer, loads every 5 seconds.  visio smart tv works perfect on same system. bad product", "verified": true, "helpfulness": "0/0", "author": "chas"}]