[{"rating": 4.0, "review": "works great most of the time...it will stall occasionally while watching or the little time wheel gets stuck at 25% and states to try again or re watch later which is annoying when trying to watch something, I will try again in several hours or the next day and it will work fine.", "verified": true, "helpfulness": "0/0", "author": "christina lehman"}, {"rating": 5.0, "review": "Easy install, went better than expected.  Installation video helped.", "verified": true, "helpfulness": "0/0", "author": "Peter A. Herzog"}, {"rating": 5.0, "review": "Easy to install, easy to navigate. Lots to choose from; movies, games and more! The only negative thing I have to say is that you have to plug into a wall outlet. Did not know that when I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Nathan Carroll"}, {"rating": 2.0, "review": "It will not mirror my phone it tries to connect but never will", "verified": true, "helpfulness": "0/0", "author": "Charles Sindoni"}, {"rating": 5.0, "review": "I have never taken the time to review a product and I have been an Anazon customer since 1998. But this product has been so impressive. I have been using for about two months. I bought this to enhance my experience with Prime movies and TV. I have a LG Smart TV. Constant interruptions during streaming when using the LG alone.The Firestick has performed flawlessly. Super easy to install. Could not be happier with my purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Steph S \"K\""}, {"rating": 5.0, "review": "Love it, buying  one for my parents", "verified": true, "helpfulness": "0/0", "author": "NICHOL"}, {"rating": 5.0, "review": "Perfect!!!", "verified": true, "helpfulness": "0/0", "author": "simes"}, {"rating": 3.0, "review": "The Fire Stick works very well however I anticipated being able to do more with it. First of all, since I am a Prime member, I thought I could take advantage of Prime movies. Not so since I am the secondary member. I also thought I could listen to the music stored on my PC by uploading it to Amazon Cloud since I purchased unlimited storage. I can't do that either. I ended up purchasing the Fire Stick, Cloud Storage and Netflix. I didn't need the Fire Stick for Netflix and I could have saved on the Cloud storage too since I have backup for my PC. I guess I should have done a little more research. As far as the TV Stick goes, it works well for looking at my pictures.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "I bought this as a gift for my wife. She doesn't like regular tv. Well to my amazement she loved it.", "verified": true, "helpfulness": "0/0", "author": "richard chiarilli"}, {"rating": 2.0, "review": "I bought the Fire stick to replace my faulty Blu-ray player that streams Netflix. The streaming quality from the Fire Stick was terrible and buffered at least 3 times within 5 minutes. I'm returning it and will stick with the streaming Blu-ray player. I really wish it worked better! :(", "verified": true, "helpfulness": "0/0", "author": "RobJ"}]