[{"rating": 5.0, "review": "Easy install and easy to use. Gives me all my TV didn't, now I can see Hulu and Netflix, etc. without any problems..", "verified": true, "helpfulness": "0/0", "author": "Tom Devlin"}, {"rating": 5.0, "review": "Got them fast with in a week but I'm in Canada. I got it and put kodi on it 😏😏 very great device great for the price no lag at all easy to use. At first it took a long time to connect to my internet but called Amazon and they helped with in minutes great product hands down.", "verified": true, "helpfulness": "1/1", "author": "Justin karleen"}, {"rating": 5.0, "review": "It was super easy to installed and it works great!!!", "verified": true, "helpfulness": "0/0", "author": "Shannon Taylor"}, {"rating": 5.0, "review": "Best alternative to movie streaming ever.  Wasted so much money of blueray players.  Happy that I broke down to try this.  For the money can't beat it.", "verified": true, "helpfulness": "0/0", "author": "rebeccagrace"}, {"rating": 4.0, "review": "i have this stick for about a monr or close to an month and i got to say it good. but there are some minor things like when it needed to be taken out of the port over night due to heat from the power source and also it so temper mental when it comes to the wifi  for example i was an show like arrow then flash but during flash it lose wife just because i turn my phone after it get charge... that why of 4 stars", "verified": true, "helpfulness": "0/0", "author": "corey Waldrum"}, {"rating": 5.0, "review": "We hooked it to our TV in minutes, as promised. There were so many choices that all we could do was look for now. Great price for something so useful.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Wow...this thing works better than I thought. Just plug it in to the HDMI jack, change the television output and sign in. You can even watch YouTube on it by using the YouTube app online.  The only problem is that my TV is old and has only two HDMI jacks and one was for my cable and the other for my Blu-Ray/DVD. I solved it easily enough by using a standard Red, Yellow, White RCA cable to attach the Blu-Ray instead. Now all three work fine together perfectly. Now I don't have to squint at my tablet anymore.", "verified": true, "helpfulness": "0/0", "author": "Confederate"}, {"rating": 5.0, "review": "I've been meaning to buy this and was mentally hitting myself on the head for not purchasing it when it was $19. I was delighted to see that it went on sale for $34! I was not disappointed! It's so much better than my previous roku xd since it takes up so little space on my TV table (as in, it doesn't take up space at all since it's as small as a usb thumb drive that attaches to the side of my TV).Nevertheless, it would have been nice if it worked like a usb thumb drive and all I needed to do was plug it to the TV without needing to connect it to a power source as well. I found out my TV doesn't have a usb port and was bummed I had to plug it to a power source. Despite that, it's still a pretty neat gadget! I have amazon prime, netflix, and hulu and it's so much better watching my shows on the big screen instead of my computer!", "verified": true, "helpfulness": "0/0", "author": "colormeviolet"}, {"rating": 5.0, "review": "I had the Roku which I returned 24 hours after buying and bought the Fire Stick instead. Can't believe I waited so long to get one!!! HD is crazy clear, super easy set up and would buy another if I needed to in a 💜beat!!!", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 5.0, "review": "My family is absolutely in love with the Fire TV Stick. It's so easy to use and the remote is conveniently small enough that my 3 year old thinks I bought it just for her to enjoy some tv time in my bed.", "verified": true, "helpfulness": "0/0", "author": "BrittTB7"}]