[{"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Joe Hampton"}, {"rating": 5.0, "review": "This was so easy to hook up. Very easy to navigate the remote. Love the fire stick, just wish Amazon Prime had better movies on Prime!", "verified": true, "helpfulness": "0/0", "author": "Kim Gillette"}, {"rating": 2.0, "review": "While attractively priced it did not work for me for multiple reasons:- the requirements are to have it plugged directly into a TV- It kept failing with the message \"HDCP unauthorized. Content Disabled\" when playing protected movies (worked well for everything else including trailers)I have tried all options whether suggested by customer support or forums, or amazon reviews including:- unplugging and restarting everything (tv unplugged from outlet, HDMI cables unplugged and replugged)- Making sure that it was plugged directly into the TV- switching HDMI ports- plugging it into a wall outlet (suggested by amazon support)and more. Protected content worked in the first day or so and then stopped working and never worked again no matter what I've tried.Finally, I have learnt after buying it that:- It does not officially support plugging it into a receiver (which I imagine is a majority of use cases)- It needs to be plugged in directly into a wall outlet (heard from Amazon support)Which are both in my opinion unreasonable requests for a consumer electronics product.I waited a month for possibly a software update but decided to return it and buy a Roku 3 instead.People may have more luck with the fire TV, but if you're looking for something to plug in your receiver (rather than directly in your TV) and that is trouble free I advise you to pass on this product - the price is attractive and the feature and the UI are great, but it's not worth the time you might waste trying to make the most important feature, watching amazon videos to work.Hopefully future versions will correct the flaws of the first version.", "verified": true, "helpfulness": "1/1", "author": "Dan Serfaty"}, {"rating": 4.0, "review": "Good for the money", "verified": true, "helpfulness": "0/0", "author": "Christy K"}, {"rating": 2.0, "review": "I had hoped to use the Fire stick in a hotel but although connected it could not reach my Amzon account.  I understand that ability is not functioning yet", "verified": true, "helpfulness": "0/0", "author": "MSJ \"Most\""}, {"rating": 1.0, "review": "My Fire TV Stick keeps losing its connection to my wi-fi router and pausing / re-buffering streaming content.  Basically unusable.  I have several streaming capable devices in my house (smart TV, Xbox 360, PS3, etc.), none of which exhibit the same issue.  One minute the connection to the wi-fi router shows up as a \"strong\" signal, the next minute it is \"fair\" and even disconnects from the router.  It's literally 4 feet away from the router!  I'm using the recommended HDMI extender and external power supply.  I will be sending this back to Amazon, as surely it must be defective.", "verified": true, "helpfulness": "2/2", "author": "Gravedee"}, {"rating": 3.0, "review": "it would be nice if it included you-tube", "verified": true, "helpfulness": "0/0", "author": "T. Hayward"}, {"rating": 4.0, "review": "The Fire TV Stick works great. It is easy to figure out and works very well.", "verified": true, "helpfulness": "0/0", "author": "Vera Lanier"}, {"rating": 5.0, "review": "Amazing! Wish I'd known flexible cable had been included with unit. Bought unneeded extension.", "verified": true, "helpfulness": "0/0", "author": "Allen H. Kelson"}, {"rating": 2.0, "review": "Very buggy, but on the rare occasions that it works, it's got a simple, intuitive interface. I have to reboot it (unplug it and plug it back in) frequently to get it to work, and some days it still doesn't want to work no matter what I do, and I end up going back to my Blu-ray player to stream, which always works well, even if it doesn't have as nice of an interface and has few options. I really, really wanted this stick to work, and I still want it to work, which is why I foolishly keep trying to get it to work. I thus spend a lot of time disappointed.", "verified": true, "helpfulness": "0/1", "author": "T. Spackman"}]