[{"rating": 5.0, "review": "great device! totally hooked!", "verified": true, "helpfulness": "0/0", "author": "FungC9"}, {"rating": 2.0, "review": "Ordered two of these when they were under $20. One of them never was able to install the mandatory update. The other worked, but needed to use the supplied power adapter and there is no AC outlet available for my wall mounted TV. Chromecast works from my TV USB supplied power. Location of the micro USB on the unit is on the side, so it was necessary to use the supplied HDMI extender. I did like the Android remote application something that the Nexus Player is lacking. The interface itself was okay, too much non Prime content. Having to weed through the non Prime content is just not worth the time and effort. If you buy/rent content from Amazon this device is probably for you. It is no way a Chromecast or Roku killer.", "verified": true, "helpfulness": "2/2", "author": "David Nettles"}, {"rating": 5.0, "review": "Very good device.  Able to mirror screen from Nexus 7 and Oneplus One.  Also side-loaded XBMC which works perfectly.  Already replaced my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "CYL"}, {"rating": 2.0, "review": "I'm not overly enthused with the user interface.  It's less user friendly than a roku interface.", "verified": false, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to setup and navigate with the remote(RF not IR!). More responsive than I would have expected for the price.  The only disappointment is lack of FreeTime Unlimited support.  Looking forward to the caching of Amazon video content, to make for less lag in the evening while streaming.", "verified": true, "helpfulness": "0/0", "author": "A. Bell"}, {"rating": 4.0, "review": "Fast and responsive. Pretty good selection of apps and streaming services for the price. I like it over similar products because it has a physical remote and it's own interface instead of relying on a smartphone for everything.", "verified": true, "helpfulness": "0/0", "author": "Alex Marsh"}, {"rating": 4.0, "review": "I am terribly disappointed. I just received the Fire stick today and for the past 2 hrs have been trying to get it to connect to my internet. Sometimes it would connect and then it would say, \"checking for software updates\" and it would take. literally, 10 min. and then either it times out or something and then says it has no connection and I have to retry ALL OVER again. Very frustrating!! Well, I'm not happy and glad I only paid $20 for it.***UPDATE**UPDATE**I have changed my mind about the previous review I made. I am pretty sure that my solution and problem, is the same as others that have been having issue with the Fire stick. As I described above, I could not get it to connect wit the internet and when it did it kept cutting off and then saying it couldn't connect to amazon, etc. I couldn't understand because my other internet things worked just fine but I did notice that when I tried to use my dvd player to see if it was connecting ok, it was in fact not and kept disconnecting. BUT, I had an idea. I moved my router and viola! Everything changed! While my smart dvd worked and my other things worked. Fire stick is a high bandwidth product and if you have weak internet, a place in your house where the internet is a little weak because of location, trees, interference, etc.You WILL have issues connecting with Fire stick and also, I found that if your router is a long distance away, around a corner, tucked away, it weakens its strength with certain internet enabled items; Fire stick being one of them. If you move your router either within the same general area, room, or an unobstructed area not more than 5ft away, then you should not have problems. Is that a pain? Kinda? Is it worth it to move it a little bit closer? I would say that is a definite yes. Now, that I have done that, my Fire stick works like a dream and we love it. I can barely get my kid to go to sleep at night because of all the stuff just for him he can watch; and I literally stayed awake til 5am watching movies! If you have some patience, and/or try moving the router closer, then you will love your Fire stick, too. I took off one star because really, should we have to do that? No. I hope that in the next upgrade, they will fix that issue. I hope that this helped someone.", "verified": true, "helpfulness": "2/3", "author": "S. Azzouz"}, {"rating": 5.0, "review": "I've had every model of the Roku boxes. I've only had the Fire TV Stick for a day but I already prefer it over the Roku. First, the fire stick actually connects to my WiFi and plays HD video from the other side of the house as my router. The Rokus for some reason always struggled to hold a strong connection and rarely played HD video from the same location.The speed in navigating menus and for videos to start playing blows all Rokus out of the water, even the latest Roku 3. The only thing I miss is the headphone jack on the Roku remote for night time listening.Miracast on the Fire TV stick was extremely easy to setup, clear, and lag free. Its a great feature but you can't multitask on your casting device while playing video like a Chromecast.The selection of available apps pails in comparison to the Roku channels availability. Major apps like Netflix and Hulu are there and HBO Go is coming soon. Its definitely enough to cover what I watch the most. Of course the Amazon Prime library is front and center. I have no problem with that as Amazon is already my go to movie rental service.Overall I love the Fire TV stick and prefer it over the available Rokus. I've never used a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Brandoshus"}, {"rating": 5.0, "review": "I just received the Fire Stick today, installation was a breeze! It makes a nice addition to my Chrome cast, Roku, Raspberry Pi and Samsung onboard equivalent of these dongles. The Chrome cast is almost useless, the Roku pretty nice, works well, the Raspberry Pi rocks, works great with my home server and the Samsung thing seems cluttered. The Fire Stick on the other hand, works seamlessly. I haven't explored everything yet, but Netflix nor Amazon video have dropped out. Big problem with Roku and Samsung! So far I really like the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 5.0, "review": "After 2 days of use the Fire Stick has surpassed my expectations.  The kids have enjoyed the gaming feature, and love we can get Amazon Prime video and Netflix on the same dongle.  Totally worth the price so far.", "verified": true, "helpfulness": "0/0", "author": "Nolan P Beran"}]