[{"rating": 5.0, "review": "My mom stays with me and watches things on YouTube ALL THE TIME. She had bought some \"box\" for $200 to watch things on the internet, but I  opted to try out this out since, hey I have prime and it's only $35. I tested it out when I got it and was like \"WHAT THE HELL WAS I MISSING ALL MY LIFE?!\" It has the main apps that I want (Netflix, YouTube, Hulu) and it has my Amazon videos! I completely forgot about them until today.Got my mom's YouTube stuff set up so she can watch on the regular sized screen and I just ordered another one for my bedroom. Last time I tried to watch some stuff on NetFlix via my PS3 and for some reason, I couldn't connect. I'm glad this works out great.", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 4.0, "review": "Excellent love this item. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Keri Green"}, {"rating": 5.0, "review": "Simple to use, lots of entertainment value. Happy customer.", "verified": true, "helpfulness": "0/0", "author": "BMo"}, {"rating": 5.0, "review": "This is our second firestick, we have one on the living room TV and now this one on our bedroom TV. Very easy to use bright, clear picture, much better than Roku, takes seconds to hook up and start using.", "verified": true, "helpfulness": "0/0", "author": "Doris Day"}, {"rating": 5.0, "review": "very good product i bought 2 and would recommend to anyone", "verified": true, "helpfulness": "0/0", "author": "shane taylor"}, {"rating": 4.0, "review": "Like a few days after buying it shot down 5 bucks... how annoying. Anyway its decent but gaking is lame for it. A bit sluggish and not too responsive.", "verified": true, "helpfulness": "0/0", "author": "Stiv Kovacic"}, {"rating": 5.0, "review": "i think this has everything that i need so cant complain", "verified": true, "helpfulness": "0/0", "author": "Thor"}, {"rating": 5.0, "review": "Great product!! I don't even need cable anymore. Got rid of it when this came in. And the price, wow what a steal", "verified": true, "helpfulness": "0/0", "author": "Charmagne"}, {"rating": 5.0, "review": "eezy, breezy to install for an 80 year old!!", "verified": true, "helpfulness": "0/0", "author": "Carol Atkinson"}, {"rating": 5.0, "review": "This is so easy to install ! I compared lots of streaming devices and decided on the Firestick because it's small and quickly installs . I have no complaints about the remote it works well also.", "verified": true, "helpfulness": "0/0", "author": "G.MA"}]