[{"rating": 3.0, "review": "Its good when it works but it freezes up alot.  Sometimes the picture freezes with sound still going or sometimes the picture freezes with no sound.", "verified": true, "helpfulness": "1/1", "author": "MsBeverly"}, {"rating": 5.0, "review": "I recommend anyone to order this Amazon fire stick it is wonderful you get to enjoy all your favorite shows and movies and the prime package is even better you should get this is better than cable", "verified": true, "helpfulness": "0/0", "author": "LaDonna Hines"}, {"rating": 1.0, "review": "This is the third TV stick I've purchased. However, the first one through Amazon. It's terrible. I have to reset the Roku to the default every time I tried to use it. It is constantly not working. I hate it.", "verified": true, "helpfulness": "0/2", "author": "Grace A Honore"}, {"rating": 5.0, "review": "Very pleased with Fire TV Stick! We have been using Chrome cast and the Fire Stick is so so much better! I love the way it interfaces with my Prime account right out of the box (no need to do anything). I can watch the movies I have purchased in my library in the past, I love the add to  watch list feature and everything is organized by category within the menu… so easy to use! Tonight we are going to watch a new release that is not even available on our Charter cable VOD yet. It is was painless to set too, ready to go in less than 5 mins.", "verified": true, "helpfulness": "0/0", "author": "mel"}, {"rating": 5.0, "review": "love this for Amazon, Hulu, and NETFLIX.  SEAMLESS.", "verified": true, "helpfulness": "0/0", "author": "Stacy Dean Seymour"}, {"rating": 5.0, "review": "I could not live without this! I have it in my kids playroom and they love having hulu and Netflix in anyroom they want and all they have to do is plug and go. I haven't had any slow connections or crashing. Once it's set up you can plug and unplug it in any room and it never loses it's settings!", "verified": true, "helpfulness": "0/0", "author": "Amber McCraney"}, {"rating": 1.0, "review": "Doesn't work at all. Wish I could get a refund.", "verified": true, "helpfulness": "0/2", "author": "LLMiddleJ"}, {"rating": 5.0, "review": "Great way to stream to one's hdtv.", "verified": true, "helpfulness": "0/1", "author": "BeachBum"}, {"rating": 1.0, "review": "Enjoyed Fire TV Stick for the first couple of weeks but now am having problems.  The past few days it says home is not connected to the internet.  Everything checks out.  We do have internet connection, have checked wires, settings, tried other settings to no avail.  Have tried to get support but so far havent received any.", "verified": true, "helpfulness": "0/0", "author": "Luna Girl"}, {"rating": 1.0, "review": "I was very excited to get this until I got it installed  then it was such a huge disappointment. It fits not stay connected and when it does it lags horribly sometimes it even kicks me out of my apps I  sign into. I am going back to roku I'm just glad I only paid the introductory price.", "verified": true, "helpfulness": "0/0", "author": "Trponce"}]