[{"rating": 3.0, "review": "Seriously love this thing, its awesome plays all of my favorite video streaming services. The 3 stars is because i keep losing internet connection even with the power supply and extension plugged in. Not sure what the deal is with this .", "verified": true, "helpfulness": "1/1", "author": "Maine Reviews \"Maine Reviews\""}, {"rating": 5.0, "review": "I love my Roku's, but after a couple years they both stopped working. I have a ChromeCast but obviously it doesn't provide Amazon Prime. Given the price and the faster CPU / more RAM, the Fire TV Stick was a reasonable risk. It's turned out to be amazing. It's the first TV device that's actually fun. The voice search, via the phone app, is extremely good. You really can play games on it. I always wondered why Netflix looked better on the WiiU than my older Roku - the network was the same. Now I understand streaming video quality is controlled both by network speed and CPU power. That's where the faster, more powerful guts of the Fire stick shines. Video is perfect. This is a great device. Obviously being sold under cost. I would get one while they're still priced to create a market. Oh, I was surprised that I could not run it off the USB on the TV -- not enough power. I guess faster CPU means you need a bit more power. I expect TV makers will adjust accordingly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Michelle Coulter"}, {"rating": 5.0, "review": "Really easy to use and set up.  Lots of great viewing to choose from.  Not sure why people would pay for movie channels on cable when the can get this.", "verified": true, "helpfulness": "0/0", "author": "R. Gettemeier"}, {"rating": 5.0, "review": "if it stops working like it did for me unplug the stick and your tv for a minute or two then plug them back in", "verified": true, "helpfulness": "0/0", "author": "tracy"}, {"rating": 4.0, "review": "Great streaming device.  So many choices of apps, movies, games, TV shows.  Setup took 5 minutes.  Anyone who is a prime member, this is a must! I'm not a prime member but may join.  For those that have to rent a movie or TV show, my only suggestion is to lower the rental cost.  We use the Fire TV Stick almost daily.  There are many free apps to install also.  It's great how Amazon syncs everything across devices.  I can install a Fire Stick app on my office computer and it downloads to my Fire Stick immediately.  Another huge benefit, it's portable!", "verified": true, "helpfulness": "0/0", "author": "Trish"}, {"rating": 5.0, "review": "This product is worth every penny. If you want instant access to Netflix, Amazon Prime and many other streaming choices, the Amazon Fire TV Stick is the only choice. I have other bulky options, but chose to buy the Fire TV Stick and give it a try. I couldn't be happier with my purchase. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "GradyMay"}, {"rating": 1.0, "review": "The Fire Stick works great, but customers should be told that unit uses huge amounts of Bandwith per day.  My normal use is 5 to 7 MB per day.  The first day the Fire Stick used 40 GB.  I do want to watch more than 7 days per month.", "verified": true, "helpfulness": "0/1", "author": "larry w moore"}, {"rating": 5.0, "review": "This works perfectly in our workout room and prevented us from having to add another DirecTV box.  We don't have those stations but this is better anyway for working out - no commercials on Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Anna Martha \"Love Deals\""}, {"rating": 1.0, "review": "I had to wait a month for this piece of junk.I currently had a Roku stick and was considering a second one for the family room. I saw the Fire stick and noticed the specs were much better than the Roku or Cromecast. So I ordered the Fire stick. A month later I received it and tried it out for a few minutes, it seemed to work fine. When I tried to watch a movie that night with the family it only played for a minute and kept freezing up every few seconds. I hooked it up to our other TV (with the supplied power supply) and still the same thing happened. It was very annoying and frustrating.VERY DISAPPOINTED! !", "verified": true, "helpfulness": "0/0", "author": "MinkaMink"}]