[{"rating": 5.0, "review": "Best hardware including THE BEST wireless network card in any of my device... works in the farthest reaches of my home. Plus Amazon Fire is user programmable. Google, Roku, Apple TV, they all fall far short when compared to the Fire TV stick/box. I am dumping my premium channels from cable and have added 6 devices throughout my house. They will pay for themselves in < 6 months. Buy it you will not be disappointed and if you are a Prime member your wasting money by not having it!", "verified": true, "helpfulness": "0/0", "author": "Dion & Catherine Tsourides"}, {"rating": 5.0, "review": "Using the Firestick for Sling TV and it's great. I got the Firestick free by prepaying Sling and now have all the Disney, Espn, and primo cable channels for 25 dollars a month. With the Firestick you even get some on demand movies and shows on Sling (up to channel details). Having Prime also makes it a complete 'cut the cable's solution.", "verified": true, "helpfulness": "0/0", "author": "tgood"}, {"rating": 2.0, "review": "I did not think the quality was very good compared to the AppleTV.  I also didn't like the fact that it required a separate power supply after it was already plugged into the TV.With that said, it did work. . . just not to the standard I was hoping for.", "verified": true, "helpfulness": "0/0", "author": "Jason Meier"}, {"rating": 5.0, "review": "It works really well for turning my \"dumb\" TV into a \"smart\" TV.  It does get hot to the touch when streaming, but so far that hasn't caused an issue.  It was a very easy setup.", "verified": true, "helpfulness": "0/0", "author": "Rebecca J Eckelman"}, {"rating": 5.0, "review": "My wife bought this stick, and I was skeptical. I had used Chromecast and Roku and was deeply unimpressed. This is different. It's fast. The remote works great and the android app works great. We are also able to side-load all our favorite apps. I have been able to do so much more with this stick because it's a fairly open android OS. I had to drop a couple bucks to get the mousepad app and the side-loader app, but this thing is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Billy Kangas\""}, {"rating": 2.0, "review": "Trying to find away to get standard Hulu- Not Hulu plus. Is there a way to do this?", "verified": true, "helpfulness": "0/0", "author": "Fran P."}, {"rating": 5.0, "review": "This is a great product, I got the Amazon fire tv a couple of months ago and got the fire tv stick recently for another room and it just works great. The set up was easy and the menu and functions are so easy to use. Would recommend to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Sims"}, {"rating": 5.0, "review": "I love this! I am able to watch Hulu on any of the tv's in the house. No moving the Xbox around or waiting for the smart tv to free up. Great deal. It even reaches back to the opposite side of the house so it does well in picking up wifi signal! So happy I got this! You can even get the app for your phone and use a voice command when searching for a show.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it it's cool", "verified": true, "helpfulness": "0/0", "author": "frito"}, {"rating": 2.0, "review": "I have the original fire and order this for a friend.  It works perfectly if you are very near your wirless router, however if we tried it on a TV upstairs (2 different homes) the performance was really slow and seemed to consistantly loose the network connection.  I have returned this and re-ordered the original FIRE TV, which I love.  I love my regular FIRE TV so much I am getting rid of all my cable TV once Google fiber comes to my neighborhood.", "verified": true, "helpfulness": "0/0", "author": "new2kindle"}]