[{"rating": 5.0, "review": "Simple to use. Setup was a breeze", "verified": true, "helpfulness": "0/0", "author": "Rebeka Mitchell"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Tori"}, {"rating": 5.0, "review": "Excellent size and has access to all the networks that I care for.", "verified": false, "helpfulness": "0/0", "author": "Joseph Walden"}, {"rating": 3.0, "review": "Wish it had access to network stations...Love the size!  Usually using laptop...always allows two to watch in different rooms (one with Fire and one with laptop).", "verified": true, "helpfulness": "0/0", "author": "Kelnspc"}, {"rating": 5.0, "review": "We love our fire stick.  We recently cut out our other tv options to save money $ bought this for our kitchen tv.  It allows us to watch streaming shows & ensure that we are in control of what the kids watch.  It's awesome!  I highly recommend this product!!!", "verified": true, "helpfulness": "0/0", "author": "Kelli"}, {"rating": 5.0, "review": "Absolutely loving the firestick! Tons of shows,music and movies with Amazon Prime. Works great!", "verified": true, "helpfulness": "0/0", "author": "maria c"}, {"rating": 5.0, "review": "This was a wonderful experience to have one of your representatives suggest this to solve my problem-thank you!", "verified": true, "helpfulness": "0/0", "author": "Barbara Joseph"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Chaser\""}, {"rating": 5.0, "review": "This device is the best ive ever seen, experienced, like some new technology sshh...but seriously please purchased this device you will love it because its so easy to set up, it has so many options, its not too expensive,you get great benefits for great prices, there many selections from movies , music, apps, etc more than i could think of to even mention right now but to just put it plainly, think device is the s***. umm and they have other devices to match the fire stick like game controllers, your smartphone! just buy it!", "verified": true, "helpfulness": "0/0", "author": "chanel"}, {"rating": 1.0, "review": "Won't allow my 5.1 surround sound to work, only TV's speakers work. No tech support from Amazon. Sorry I'll purchase a Roku.", "verified": true, "helpfulness": "1/1", "author": "Steve Dozier"}]