[{"rating": 2.0, "review": "Not impressed, but has to do with my crappy internet connection.  Roku works better for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon_user"}, {"rating": 4.0, "review": "The fire TV stick is wonderful and has allowed me to cut cable (or in my case Directv) out of my life completely.Pros: (1) Its fast and responsive.  (2) What apps are available are nice and have well designed interfaces. Netflix is particularly nice.  (3) The remote is rudimentary but serviceable. It lacks the voice search feature, but I have never used that particular feature on the Fire TV. If you heart is set on the voice search feature you can use the android app, but it is one of the ugliest and least well designed apps that I have ever used.  (4) Streaming your local content works amazingly well even though its wi-fi only.Cons: (1) The UI is horrible. There is no way to search for Amazon Prime Videos, forcing you to go to the website, find the movie, add it to your watchlist, and then return to the Fire Stick and watch the film. This is incredibly frustrating and grounds for dismissal for whoever had this idea.  (2) There are a wide variety of TV apps that are not available for the Amazon ecosystem but are available on the Play Store. Undoubtably this has something to do with Amazon's deal with Sling TV but it hurts the vast majority of users.Note: The Fire Stick is open to sideloading apps for those in the know and this allows many of the TV apps that be installed. The only problem with this solution is that they will not appear in the recently used bar and the remote will not function properly. The remote problem can be fixed with a third party remote app.", "verified": true, "helpfulness": "0/0", "author": "STL \"Sid Littlefield\""}, {"rating": 5.0, "review": "This was a wonderful product!. Highly recommend to anyone with Amazon Prime.  You won't be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Gary Tashima"}, {"rating": 3.0, "review": "Fire stick lags a lot more than my roku stick and doesn't have many good apps..needs improvement...", "verified": true, "helpfulness": "0/0", "author": "Gad Salomon"}, {"rating": 3.0, "review": "I purchased one of these from Best Buy recently, and it's been a bit of a mixed bag. The interface is decent, fairly clean and intuitive, though it can be a little sluggish, but I think that's to be expected from something in this form factor / price point. Streaming content from Amazon works flawlessly, I've had no playback issues at all with Amazon content. However, I've found Netflix, Hulu, and Plex all suffer from occasionally pauses in playback, usually just a second or two, but it can be distracting. I've also had issues with the Hulu app exiting unexpectedly during playback, apparently when it has trouble loading a commercial break.Overall, I'm much happier with my Roku 3 over the Fire TV Stick, but it is over double the cost. For the price, I'd probably recommend a Chromecast over the Fire TV Stick, if you're ok with using your phone as the remote, and don't care about Amazon's streaming content.", "verified": true, "helpfulness": "0/0", "author": "Chip Marshall"}, {"rating": 5.0, "review": "First of all I love Amazon!  I don't know what I would do without it or how I survived before it.  It makes me crazy spending over a $100 a month for dish or cable.  This has made me eliminate that bill.  I have so many things that I can watch, it never buffers the quality is amazing.  My only regret is that I didn't buy several more for gifts when I bought this one for $19. Catching up on HBO shows is probably my most favorite thing about this.  I really feel like Prime can add some better movies to the list for FREE.  That is a bit disappointing.  Although, the TV show selection is pretty good.  All and all it's a fantastic product!", "verified": true, "helpfulness": "1/1", "author": "Nikki J \"Nikki J\""}, {"rating": 1.0, "review": "I have two Roku's and love them. But I needed another device so decided to give the Fire Stick a try. So disappointed. It freezes constantly to the point where I can't really even use it anymore. It's not my internet bandwidth because the Roku's work great and they are using the same internet connection. This is the only Amazon product I've ever been unhappy with but boy am I unhappy with it.", "verified": true, "helpfulness": "1/1", "author": "B. Flynn"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "ERNEST JONES"}, {"rating": 5.0, "review": "its clear, it streams nicely, you have the option of getting some basic cable stations, like TNT, TBS, HGTV, and others for a price of 20 dollars and others for five. there is alot of free streaming. great for the price. oh, easy setup.", "verified": true, "helpfulness": "0/0", "author": "Ronda Meeks"}, {"rating": 5.0, "review": "easy to use and tons of shows!", "verified": true, "helpfulness": "1/1", "author": "Meredith A. Greno"}]