[{"rating": 4.0, "review": "Pro'sEasy to set upworks with both phone and supplied remoteGood video and sound qualityWorks great with streaming media as well as internet based streaming (Amazon Prime, Netflix, Hulu)Great for travelingCon'slimited to only wireless connectionUSB power requirement is high and requires wall plug power from receiver or tv is not good enough", "verified": true, "helpfulness": "0/0", "author": "Patrick M McLaine Jr"}, {"rating": 4.0, "review": "To be completely honest, I probably should give this little guy 3 stars, but I'm trying to be fair. This was given as a Christmas gift and I must say that I am impressed with what I have been able to do at this point. If you are already hooked on Netflix, Hulu, Pandora and the like this gadget will do the job and do it well. I have owned a Vevo streaming stick and used my PS3 for streaming video and I must say that the Fire Tv stick works better than both. I have had less loading time and great picture quality. It's also simple to put together and has a great introductory video for those completely new to streaming devices and/or just the Amazon Fire Tv stick. All of this makes it worth 3 stars in my opinion.The reason I give it 4 is because of what it is capable of doing. I love Amazon, but currently I am not a Prime member. Thus, I can see what I would have the luxury of doing--like playing Amazon movies and tv shows for free on my big screen (of which there is an amazing selection!). It also has the ability to expand the perks of certain channels that you may already enjoy through your tv provider--whether that be A&E;, Disney, History Channel, etc. Some are available to watch (like PBS) without having to go through a tv provider. All in all, if you are already a Prime Member, I wouldn't turn this little guy away.Now the reason why I cannot give it 5 stars. I know this is really obvious to some, but the device really is meant for Amazon Members and not for everybody. If one doesn't have an account with Amazon, even though it is free, it will be required to register the product and/or download apps like Netflix to your library. For some, especially those who are not fond of playing with technology, I would say that it would be much easier to get a Wi-Fi Wireless Smart Blu-Ray player that has the popular apps show up right away upon set-up--without having to go through the process of registration and downloading. On this device, anything other than what Amazon has to offer must be found in the Amazon apps store or \"featured apps\" category to end up on the \"home screen\" and downloaded so that it shows up in your \"apps library\" from that point forward.Also, and I must repeat this, please understand that any channels that normally require spending money on cable or satellite to watch are still required to get the apps to work for those channels on this device. I don't have a tv provider at this point, so that fun perk isn't mine to possess. It will also likely be required of you to sign up on your favorite channel's web page before you can even take advantage of the app. I learned all of this the hard way...so be forewarned. I even had to sign up on the PBS website in order to watch any shows from that channel's app.So there's my story. I hope it has helped some. I will likely give a follow-up review once I've had a chance to get back on to Amazon Prime and take more advantage of what the device has to offer. Thanks for reading!", "verified": true, "helpfulness": "0/0", "author": "missiongirl2087"}, {"rating": 4.0, "review": "Very easy to install and use.  The video and audio quality is excellent.  It was a surprise to me that there were no stop/starts when watching, even though we have the least expensive (ie. slowest) IN service available in this area.Received the pkg. Dec 12, 2014.  Today, 1/25/15 was the first time I had trouble.  The system was unresponsive and would not function or allow me to return to satellite programing in the normal way.  I manipulated the batteries and finally changed for new ones . Still didn't work.  Finally in frustration I smacked the controller against my palm(Yes,  I know!) and it started to work.I will see tomorrow if the system continues to work OK.  If not, I will e back on to change my rating.2/24/15The device is working well.  Still occasionally is difficult to switch back and forth between the dish and  stick.  Just a note to the unwary, the free prime items may change to \"pay to view\" without a noticeable alert.  This happened when I had viewed all but the last episode of Lark Rise to Candleford Season 1 [HD] . When I selected , Ep. 10, I did not notice I was being charged until I was watching.  I called Amazon and they removed the charge.  Be aware that just adding a season to your watchlist doesn't guarantee that it will be still available for free on Prime. I think that changes in the status of watchlist items should be sent as an alert by Amazon.", "verified": true, "helpfulness": "0/0", "author": "SMITH TX"}, {"rating": 1.0, "review": "I ended up having to go ahead and get Direct TV. My wifii is pushing 7 which is plenty for 2 devices. I can turn everything off and the fire stick will not function properly. If it runs for one minute it is a miricale on ESPN. The movies are a little better but not watchable. You get so discussted that you end up turning it off. Sorry but I honestly find it useless.", "verified": true, "helpfulness": "1/1", "author": "michaelfrazier"}, {"rating": 5.0, "review": "I was a big fan of the chromecast, but the fire stick rules.Did you say why?The apps are on the fire stick,you can use your phone or pc etc.But you don't have to.", "verified": true, "helpfulness": "0/1", "author": "Curtis williams"}, {"rating": 2.0, "review": "A little disappointed because I can't leave it plugged in all the time; it causes my TV to act like there's a short.  The content is great, but there is definitely a flaw in the system.", "verified": true, "helpfulness": "0/0", "author": "mnorris"}, {"rating": 1.0, "review": "It was great but now it refuses to connect to wifi. My router is fine and works for my other devices. The fire stick received the different routers. But it won't connect. It's useless without internet and has not worked for me for a couple of weeks.", "verified": true, "helpfulness": "1/1", "author": "Anya"}, {"rating": 5.0, "review": "I've been able to cancel my $278 Comcast subscription and am now enjoying TV so much more. I can't recall the last time I watched a commercial. Add in Netflix and I have thousands of videos, movies, sitcoms, and series a single click away. Super easy to install, just plug and play. Although, using the wand to scroll through the alphabet to type user names and passwords is painful. Luckily you only need to do that to set it up.", "verified": true, "helpfulness": "0/0", "author": "Cyndie Shaffstall \"Cyndie Shaffstall\""}, {"rating": 1.0, "review": "If you are looking for a streaming device which freezes constantly, look for further! The Amazon Fire TV Stick is a delightfully frustrating device! It will require you to get up, reach behind your TV, and unplug the power cable to reboot the device at least twice before you give up and just watch Netflix or Amazon Instant Video on your Xbox. The controls are unresponsive, and navigating the menus will make you want to rip your own arms off.Seriously, this device is garbage. Don’t buy it. The thing constantly disconnects from the internet, force closes apps, and the controller is garbage. Sometimes you click a button on the remote once and it recognizes it as one click. The next time it will recognize it as three. The next it won’t recognize it at all. The next will be 30 clicks. The only way to turn it off or restart it is to unplug it, which is a huge pain if your TV is wall-mounted. The screencasting never works on any device. It does not natively support UMS or any of the similar protocols for streaming media from one device to another, either. I bought mine when it was only $19, and I still feel like I got ripped off.", "verified": true, "helpfulness": "0/0", "author": "jlawsonusmc"}, {"rating": 1.0, "review": "I bought this in December didn't receive it for two weeks only received a two week trail period not very Happy with the limited free moviesThey want the money", "verified": true, "helpfulness": "0/0", "author": "Marcia Robison"}]