[{"rating": 5.0, "review": "LIKE IT", "verified": true, "helpfulness": "0/0", "author": "Buba"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "thatgirl"}, {"rating": 5.0, "review": "This thing is handy.", "verified": true, "helpfulness": "0/0", "author": "Adam Krahl"}, {"rating": 3.0, "review": "Edit:at first i thought this product was great.  but whenever i use netflix, the audio is constantly out of synnch wit the video.  it's not my internet because netflix works perfectly on my apple tv.  stream at your own risk.", "verified": true, "helpfulness": "2/5", "author": "david feldman"}, {"rating": 5.0, "review": "Hook it up was a challenge, but educational for me.", "verified": true, "helpfulness": "0/0", "author": "Karole M. Brown"}, {"rating": 5.0, "review": "I do not have a cable connection in my kitchen and thought this would be a good compromise.  I purchased an inexpensive 22\" Samsung TV and plugged the Fire TV Stick in.  I had everything set up and working in less than five minutes (including the TV :-)).  I love being able to listen to Amazon Music while I work.  I have streaming boxes on two other TVs and this device is better than either of them.  I would never have had the space to set up a Roku or Blue Ray streaming device.  Best impulse purchase ever!", "verified": true, "helpfulness": "0/0", "author": "Leigh"}, {"rating": 5.0, "review": "Purchased one of the Amazon Fire Sticks when they were a special price for Prime members.  I wish I had purchased more than one.  It works great with both Amazon Prime Video and Netflix.  The icing on the cake is that it also allows us to run a program to see our home security cameras on the TV.", "verified": true, "helpfulness": "0/0", "author": "Glenn Duquette"}, {"rating": 4.0, "review": "It's an amazing device and it was so easy to set up.  I simply love it and it will replace my high priced cable bill very shortly!", "verified": true, "helpfulness": "0/1", "author": "Debora Brown"}, {"rating": 1.0, "review": "Not ready for prime time.  The dreaded \"HDCP unauthorized. Content disabled\" appeared, and the Amazon digital device tech support rep said that there's absolutely no way of making it work with my Samsung HL-S5087W DLP HDTV.  Took her advice and returned it.  Unfulfilled expectations.", "verified": true, "helpfulness": "2/5", "author": "Marty3"}, {"rating": 5.0, "review": "Excellent. Easy setup, great way to view photos using the \"free\" cloud service. Movie streaming from \"prime\" is worth the price of the unit.", "verified": true, "helpfulness": "0/0", "author": "Curtis S."}]