[{"rating": 3.0, "review": "So torn on this device...I bought it with the intention of replacing my old Logitech Revue.  One thing I do miss compared to the Logitech is the lack of an HDMI pass-through (which the regular Fire TV does not have either).  The smaller report and lack of keyboard hasn't bothered me yet.  Netflix and Amazon Prime video streaming both seem to work well - good video and audio quality.My biggest complaint is the fact that I cannot get Miracast to work from any device.  I've tried multiple Windows 8.1 computers and Android devices, and I still cannot get it to work properly, not even once.  Miracast support was a big part of why I purchased this device, since in theory, I would be able to replace both my Logitech Revue and my Netgear WiDi/Miracast standalone receiver.  Unfortunately, this seems to be a fairly common issue - a quick search online turns up many forums posts with other users experiencing similar issues.  If they can get this fixed, this thing would get an easy 5 stars from me.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've had a chromecast, xbox 360, xbox one, sony TV box, PS3 and the logitech revue. Simply put, if you are an amazon prime user I can't recommend a better streaming box for the money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I thought it would work like tthe chromecast and have the ability to have my smartphone cast the app in use to the stick.  Unfortunately not the case. It works using the remote only. Looks like an app is coming to use as another remote, but definitely does not a cast from your app to the stick to the tv.At the end of the day, chromecast is better.  The firestick is only nice because you can stream your amazone videos which is something that cant be casted via chromecast.also bit dissappointed this was advertised to be comparable to the chromecast. If it had the same casting ability as chromecast from any app on the smartphone, I would have replaced my existing 3 chromecast i have plugged in throughout the devices in the house with another 3 firesticks.", "verified": true, "helpfulness": "0/0", "author": "yoej8"}, {"rating": 5.0, "review": "Excellent device and it does what are expected.", "verified": true, "helpfulness": "0/0", "author": "MXY"}, {"rating": 2.0, "review": "I want this to be awesome, but right now it's not. It buffers a lot... like several times in a 30 minute episode. I have an AppleTV and a Roku on the same network (50Mbps)... they don't. Sometimes (once or twice per 30 min episode) the sounds stutters or a digital audio artifact will occur. Some \"Apps\" just sit at a black screen indefinitely. The price is great, but I'm disappointed overall.", "verified": true, "helpfulness": "0/0", "author": "Ronno"}, {"rating": 4.0, "review": "I just got this the other day and started playing with it now.  For what its designed to do (media player on your TV), I found it to be very good.  Netflix plays great over 5G wifi router (lets face it, amazon prime still isnt close to the netflix library).  That said, a few things I found worthy of docking a star.#1 You cant display mirror with windows 8.1, even though both devices are said to be miracast enabled and the firestick is expressly stated to have this feature.#2 (obviously) you cant use the firestick (from the limited testing Ive done) without an amazon account.  Sure, I got an amazon prime membership, but my family where this firestick is going doesnt have an account so its not just a simple plug and play (you have to sign up for a new account, but its not like the end of the world).#3 Cant be sure if my (3) tvs are faulty or if the firestick just likes to complain about the USB port power, but seems I have to use the included AC adapter to power this thing rather than my TVs.#4 No audio out, which isnt a big deal as nearly every HDMI TV has speakers, but you cant connect this for example, to an HDMI computer monitor and expect to route the sound somewhere else (yes, I know this is designed for TVs so I shouldnt be complaining, so this is more of a duh, well thats sorta obvious moment you might have after the fact).#5 Good luck trying to enter a complex password for your wifi on this thing.  Not the end of the world, but I wish I could mount this thing via USB to my laptop and just edit a text file for the wifi password.  Maybe it is possible...Anyways, all in all, its a terrific little device for $20, still a terrific device at $40, and can easily turn your non-smart TV into a pretty nice streaming media receiver.  I cant complain for the price paid and if you happen to be the 99% of the target audience who will use this in their own home, its an unbelievable value for less than snacks at a movie theatre.  But, if you are like me and like to tinker around with stuff and/or will be gifting this, just make sure you are aware of the tiny limitations I state above.Also, whats really creepy (or cool, dunno yet), is as soon as you connect to the wifi at home, it automatically knew my amazon account and associated to it...", "verified": true, "helpfulness": "2/2", "author": "ducky"}, {"rating": 2.0, "review": "Netflix constantly buffers. I have my laptop in the same spot and it can stream Netflix perfectly, no buffering, no waiting. Also, what the hell is the spotify \"app\" on here? Mirroring my phone or tablet? Come on. Weak attempt by everybody involved. I'm going back to my laptop+hdmi, it does everything the firestick does but better.", "verified": true, "helpfulness": "0/0", "author": "kathy Milwaukee"}, {"rating": 5.0, "review": "Love it!! Definitely would recommend it & repurchase for any other TV in my home", "verified": true, "helpfulness": "0/0", "author": "MissSunshine"}, {"rating": 4.0, "review": "Much better than chromcast. But I feel roku interface little bit better but there is no match to amazons voice search (in amazon content ).", "verified": true, "helpfulness": "0/0", "author": "Amit Singh"}, {"rating": 2.0, "review": "Runs hot and then loses ability to stream videos....", "verified": true, "helpfulness": "0/0", "author": "D. Hanson"}]