[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Beth Brunson"}, {"rating": 2.0, "review": "Comcast does NOT support any of the TV Apps such as A&E;, History, Lifetime.  At this point the only benefit of Fire TV is I get to have the ease of a remote when watching Netflix or Prime videos.  For the last year I've been doing the same thing by plugging my computer into the HDMI cable...expect when using the computer I can actually watch my Comcast shows as well!  I will return it if I can.", "verified": true, "helpfulness": "0/0", "author": "Bianca"}, {"rating": 1.0, "review": "So, when we try to watch Amazon streaming movies or shows on our Fire Stick----it skips and pauses, especially the sound.  So, we've watched You tube on it fine, but when we use it for what we got it for---I'm a prime member and want to watch streaming---we can't.  We had to go back to watching Amazon streaming on our 4 year old blu ray player.  Is that something anyone else has encountered?  is there something we can do?", "verified": true, "helpfulness": "1/1", "author": "Elizabeth A Haungs"}, {"rating": 5.0, "review": "Works great - so far we have only used it for watching Prime TV but we're very pleased.  Loads way faster than our PS3 did and the remote is a nice little tool.", "verified": true, "helpfulness": "0/0", "author": "Thomas E. Stephens"}, {"rating": 4.0, "review": "Best streaming TV stick. One thing to note is that it is very powerful which may require you to plug into a wall outlet as many TVs have an under powered USB port. Would like to see more apps added soon.", "verified": true, "helpfulness": "0/0", "author": "mcnadnerb"}, {"rating": 5.0, "review": "I've only had this thing for two days and i already love it. It is so easy to use that i am recommending to a friend who is unhappy with her Roku. Great connection, great remote response and good selection of apps.", "verified": true, "helpfulness": "0/0", "author": "Mean Jean \"really good at naps\""}, {"rating": 2.0, "review": "I might change my mind in the future.  However, as of right now the fire tv I purchased is very inconvenient for me.  I use a harmony remote in order to simplify my setup.  The amazon FireTV stick was not built with those people in mind.  I have been trying to add it to my remote and I found the final answer as to why is not going to work.From the Logitech Forums:\"As Harmony 700 is a pure IR remote, it can control only the devices which has IR compatibility. Unfortunately, Amazon FireTV has no IR control and thus cannot be controlled by Harmony One or any other IR model remote.Currently Harmony Smart Keyboard can control Amazon FireTV and we are investigating the compatibility with other Hub based models.\"I believe they had to take this in consideration when creating a new product which is supposed to be part of a home theater environment.On another note,  I haven't have any issues with the WIFI as the other reviews, but I agree that we are still missing plenty of apps.  I know they will be added in the future, just wanted to add it to my comments.", "verified": true, "helpfulness": "0/0", "author": "Ivan O. Reyes"}, {"rating": 5.0, "review": "Amazing! Very nice device. Absolutely simple to use. Exceptional interface. Can't believe it is under $40.", "verified": true, "helpfulness": "0/0", "author": "bluewater"}, {"rating": 5.0, "review": "This product is great!  I really love it.  I normally use XBMC(which I hear you can sideload) in my household, but am switching to plex.  Plex server comes on my NAS, so I thought I'd give it a run.  As much as I like XBMC, I love Plex.  Given that I have a Plex login, I can take the firestick anywhere(hotels, other peoples houses) and just plug it in, hook up to the network and walah, I can stream movies from my house.  I will have to admit, that I do use my Amazon Prime account more often now for the videos and shows hosted on Amazon.  I find myself looking for older movies and tv shows there first.FireTV stick is really great and the price is fantastic.The only thing that I wish it had was the ability to plug a physical network jack into the power plug(which has to be plugged in anyway).  Sometimes when I stream really high def movies, it lags and buffers a little.  I attribute that to the wifi signal.  Would be nice to have the option to plug a physical network cable into it.  I have to throttle the bandwidth on Plex, by changing the transcoding speed,  in order to keep it from buffering sometimes.Overall it''s really great product and worth checking out.", "verified": true, "helpfulness": "0/0", "author": "Jay Howell"}, {"rating": 3.0, "review": "The stick works well streaming content clearly and quickly.  I like that it provides convenient access to Amazon prime video.  However, the stick seems to interfere with over the air tv signals.  I noticed after installing the fire tv stick that the OTA signal became garbled, and cleared up when unplugged.  It seems like it's not properly shielded.", "verified": true, "helpfulness": "0/0", "author": "G8rmike"}]