[{"rating": 5.0, "review": "I purchased the Fire TV Stick when it first came out, at the special Prime Members Price, and it has exceeded my expectations. The stick is compact, and the remote is both responsive, and feels good in your hand. It's light, but does not feel cheap. It's specs allow it to have a really good user experience, as its both snappy and responsive with minimal (nothing to get bothered about) lag. I have the Chromecast, Roku 3 and Roku Stick, and the Fire TV is my main device.The main benefit for me over the Chromecast is the ability to use a remote, it sounds simple, but to me it makes a world of difference. Using phone or tablet as the remote is fine, and works well, but there is something about the tactile feel of the buttons, that cannot be understated. You get used to the button placement, and your fingers know exactly where each button is, and because its so responsive it just feels right. When I had to use the smart phone to control the Chromecast, I was either constantly looking at the screen to see the button, or having to get through the lockscreen to pause or play or seek. If the Chromecast had a remote, I may not have immediately retired it to drawer of forgotten electronics when I got the Fire TV Stick. Also many of the same features that made Chromecast stand out have now been integrated into the Fire TV Stick (such as true screen mirroring). Also not to mention the frequent disconnects, and failures to connect with the device that the Chromecast had, and the because the Fire TV stick has MIMO, it just seems like a more solid faster connection.When you compare it to the Roku platform, it still lags behind Roku in terms of available channels. There are some channels that just cannot be found on the Fire TV platform, that allow the Roku to still be connected to the same TV, and that is the only reason I have my Roku 3 connected to the TV still. Just for those certain channels. I also prefer the Fire TV Stick remote to the Roku 3 remote even with the headphone jack (I dont use the headphone jack, as I have a wireless headset for the TV but it is a great feature). The Fire TV Sticks remote seems to have a longer battery life, even though I use it a lot more, and the buttons feel more responsive. When it comes to pure performance, it cant beat to Roku 3 specs, but things feel just as snappy on the Fire TV stick if not only slightly less snappy when pressing buttons and navigating menus, the Roku 3 is smoother but its not a huge difference. Plex also performs better, on the Roku 3, but I really like the Fire TV Plex interface a lot better. Plex on Roku uses the familiar row and column style of navigation, but on Fire TV both navigation and player control and interface looks and feels a lot more intuitive, I really wish they had the interface they have on the Fire TV on the Roku.When it comes to comparing the Roku Stick and Fire TV Stick, there really is no comparison, the Roku Stick navigation is laggy, to the point where it is noticeable, and the buttons have a noticable lag as well. I would only recommend the Roku Stick if there are channels you want on Roku that are not available on the Fire TV Stick, if not, its a no brainier, go with the Fire TV Stick. The choice between the Fire TV Stick and the Roku set top boxes are harder, but if I had to go with one it would be the Roku set top box. I'm fortunate to be able to have both, and like I said the Fire TV Stick is the one I use the most, mostly because of the remote, I cant count how many times in the the middle of a movie or show, or Plex stream I have accidentally pressed one of the shortcut buttons like Netflix or Hulu, which kicked me out of what I was watching.Some people complain that the Fire TV Stick is too catered too Prime Video. For me this is not really a problem, as I have a Prime Instant Video subscription, which I use often, but for some, they probably prefer a cleaner interface like the Roku Channel Screen, and to be honest, I do as well, I even find that navigation in Prime Instant Video is better on the Roku then it is on the Fire TV Stick.Here's hoping the next version has 802.11ac and more channel/app support for the companies and developers who only have their stuff on Roku.Bottom line: For under $40, you get a great device, which for me blows away the Chromecast, and bests the Roku Stick. The only reason you would get a Roku over this is for the Roku specific channels, and if you do, spend a little more ditch the Roku Stick and go with the Roku set top box for the best experience.", "verified": true, "helpfulness": "0/0", "author": "E. Kim"}, {"rating": 5.0, "review": "This thing is amazing even though you have to buy some of the movies and shows I love it", "verified": true, "helpfulness": "0/0", "author": "Devoraw Hall"}, {"rating": 5.0, "review": "excellent, gets me through the day and night", "verified": true, "helpfulness": "0/0", "author": "Rosalind Grover"}, {"rating": 4.0, "review": "Absolutely love this device! Synced it with my smartphone and now I have voice control.", "verified": true, "helpfulness": "0/0", "author": "CarolG"}, {"rating": 5.0, "review": "Takes a little get use to other than that does ok", "verified": true, "helpfulness": "0/0", "author": "Wendy Gant"}, {"rating": 3.0, "review": "I wish there was a better alphabetical listing by movies, tv shows, etc., it is very onerous to browse til we find something that interests us-- the genre's are combined  it would be nice to put criteria in and then get a search back with a list, such as movie, comedy,Diane Keaton-- we spent more time scrolling through 55 or 100 items before even getting close to selecting something.", "verified": true, "helpfulness": "0/1", "author": "Deborah Devine"}, {"rating": 5.0, "review": "Really nice device. With a prime account, hundreds movies and TV shows can be accessed. Third party app can also be installed to watch other streams. Love it!", "verified": true, "helpfulness": "0/0", "author": "Yinkai"}, {"rating": 1.0, "review": "Interesting concept and would have loved to use this. However the wireless was so weak I couldn't stream Prime or Netflix. This is in a room that I get full signal with my iPhone, iPad, and my Kindle fire and paper white.", "verified": true, "helpfulness": "0/0", "author": "Will T. \"Teacher Man\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "india smith"}, {"rating": 5.0, "review": "Super easy to set up and use. Cant beat the price", "verified": true, "helpfulness": "0/0", "author": "Stefanie Schrauben"}]