[{"rating": 2.0, "review": "Sadly, this Fire Stick does not work as well as I had hoped.  I generally love everything Amazon, but this was a disappointment.  It often stops working and I have to reboot by unplugging the USB from the stick.  I don't like that they don't advertise that there is indeed a wire connecting the stick to an outlet (I was hoping to minimize wires).  Most importantly, I do not like that there are VERY limited apps for Fire Stick.  If you ONLY use Amazon for streaming, this is a good device, but otherwise I would recommend the Roku Stick.", "verified": true, "helpfulness": "1/1", "author": "PPS"}, {"rating": 5.0, "review": "We LOVE IT! We had been using Chromecast,  which was okay. A bit of a hassle using the phone app.Now using the Fire Stick it is fantastic! We  watch a lot more of Amazon than we used too and just started listening to music. Wonderful, wonderful, wonderful!For those of you using a Denon... I used an optical cable from the television's digital audio output into the Denon. Now, my Denon is a much older model, an AVR-3805, so I plugged it into an optical input for a function I'm not using. The sound is fantastic! We have listened to classical and rock and roll and the sound is great!The only thing I would add is being able to search for programs and movies on my phone. I have tried looking on the Amazon app, but it doesn't have a button to look at Prime like the desktop. If a button could be added, or a separate app created, the Fire Stick would be perfect!", "verified": true, "helpfulness": "0/0", "author": "Sailcat"}, {"rating": 5.0, "review": "I received the Fire TV stick as a gift.  It was easy to set up and performed perfectly as advertised.  I have used it both at home and traveling where Wi-Fi is available.  Great results in all cases.", "verified": true, "helpfulness": "0/0", "author": "JPW"}, {"rating": 5.0, "review": "Before this amazing item , I purchased an Apple TV. Absolutely hated the Apple TV. It was cool at one point but now that other companies like Amazon , roku, Google, etc. Have caught up. Apple TV is way behind in the game.  Sure air play is cool but this stick offers that as well. It's just as great as the Amazon TV. So cheap for such a great gadget", "verified": false, "helpfulness": "0/0", "author": "Lisette montanez"}, {"rating": 3.0, "review": "A little disappointed with apps available for fire tv stick. Hopefully more will become available. Glad I only paid 19.00 when it was a promotional sale price.", "verified": true, "helpfulness": "1/1", "author": "Stephanie"}, {"rating": 1.0, "review": "Loved the Fire Stick when we first got it. Plugged it in to our 4 year old Sony and it was awesome...until it wasn't. Then we got an error message that \"HDCP Content Disabled.\" Called Amazon and the customer service rep said, \"Well, If you don't have the latest HDCP on your tv, it won't work.\" What?? Where is that in the specs? And why did it work at all and then stop? We've moved the stock to our 5 year old Sony and it worked last night. Probably will have one more night with it and then it hours back to Amazon. Hugely disappointing.", "verified": true, "helpfulness": "5/5", "author": "Wabu"}, {"rating": 4.0, "review": "I was very excited about the Fire TV Stick as a Prime member.  I am concerned that  several times it seemed to return to home when I went beyond a certain number of recommendations (less than the total indicated).  I am not sure if that is the cloud, my WiFi or the instrument itself.  More disappointing is there seem to be less of the movies and TV programs than when I was using my Kindle Fire HD.  I hadn't sought out programs for a number of months, but now I see there are charges per episodes of programs I previously had access to at no cost through my Prime membership.  Examples: Foyles War and Dr. Martin. So in conclusion: Fire TV stick is good and glad I have it.  May have some glitches to resolve with its use.  Disappointed with Amazon and apparent reduction in Prime membership selection.  Perhaps they rotate what is available.", "verified": true, "helpfulness": "1/1", "author": "Keith McWithey"}, {"rating": 5.0, "review": "It's amazing.  I bought a Roku at the same time (deciding which one to give my mom for Christmas) - Running Netflix on the Roku was very sluggish like the processor couldn't handle it - on Amazon Fire Stick it's like buttah.  Not to mention Amazon has their own wonderful collection of movies and TV shows.  I was spoiled and pre-ordered it for $20 but for anyone out there looking for something that's fast and reliable go for the Amazon Fire Stick (or the Amazon Fire if you can budget it, I'm sure it works just as nice if not better).I was hesitant on trying an Amazon product for streaming content but I am more than satisfied and recommend it to everyone.", "verified": true, "helpfulness": "1/1", "author": "Brett"}, {"rating": 1.0, "review": "Was not very impressed with.", "verified": true, "helpfulness": "1/4", "author": "oertwich"}, {"rating": 4.0, "review": "I like my FireTV Stick very much. I have only had to reboot the thing a couple times in a couple months and really have not experienced issues like some of the other users. My reason for giving it 4 stars instead of 5 is the search function, it needs to search all my content not just the Amazon content. Other that that I have no real problems, it is night and day Faster the my Roku 3. Thinking about getting the full box and stick this on the spare TV.  Best $19 I ever spent...", "verified": true, "helpfulness": "1/1", "author": "Tim Crafton"}]