[{"rating": 5.0, "review": "My nee RV came with a flat screen TV, but it's not a smart TV. This is a perfect solution to access movies and music while out camping.", "verified": true, "helpfulness": "0/0", "author": "PA_RN"}, {"rating": 5.0, "review": "Love it.... save alot of $$$that cable company going out of business for being unju,ified in there prices. They think we don't know there is ways around them.... I say HAHATO YOU COMCAST", "verified": true, "helpfulness": "0/0", "author": "vikki larson"}, {"rating": 4.0, "review": "Great device and very easy to use with included remote or Android App. Only current con is the inability to save different network configurations to make it easier to take along to friends, work, travel, etc.", "verified": true, "helpfulness": "0/0", "author": "Geologist"}, {"rating": 1.0, "review": " If your like me, the primary reason you bought the Fire Stick was for the HBO Go App. Unfortunately, though the app has been released it is extremely broken currently and basically unwatchable. The primary problem is related to an audio/video sync problem, where the audio doesn't match the on-screen picture. Multiple people are experiencing this same problem as seen in this forum post on Amazon.com and also on multiple reviews of the App itself on Amazon.com.http://smile.amazon.com/HBOGO-Audio-sync-Fire-stick/forum/Fx3THIQES502AOU/Tx3BBSA3JCR2T0P/1?_encoding=UTF8&asin;=B0089BPEZShttp://smile.amazon.com/HBO-GO/product-reviews/B0089BPEZS/ref=cm_cr_dp_see_all_summary?ie=UTF8&showViewpoints;=1&sortBy;=byRankDescendingI have contacted Amazon regarding the problem, but all they have done is logged this issue and not yet fixed anything or even stated a timeline for fixing it. This is essentially a paper weight for me, and if it wasn't such a hassle to return it and the extended warranty I bought for it, I'd want a refund.You really dropped the ball on the primary selling feature of this item.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Took a month to ship but worth the wait. Love it", "verified": true, "helpfulness": "0/0", "author": "Mauimama"}, {"rating": 5.0, "review": "Outstanding! I love it - great for home use and while I travel. In fact, I just bought my second Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "William A Heaton"}, {"rating": 5.0, "review": "Just got my Fire Stick TV and I am enjoying it a whole lot.  There is a wide variety of viewing options.  I am catching up on all my series.  I really like this buy and most of all it put my Prime memebership to good use.", "verified": true, "helpfulness": "0/0", "author": "Andrea Anderson"}, {"rating": 5.0, "review": "Absolutely positively love it have to teach my boyfriend how to use two remotes instead of just one oh boy this is going to be one check of a job", "verified": true, "helpfulness": "0/0", "author": "Judie"}, {"rating": 1.0, "review": "Wanted to love it but sadly cannot.  I love my amazon prime account I tell everyone about the free streaming and two day shipping etc, but this product is limiting, there are not many apps I would use for the device and actually the two apps I wanted were not available, both the optimum app and vudu were unavailable.  Additionally the product glitches cutting out parts of what I'm watching, when I called vs they had me switch hdmi ports and said that it wouldn't happen again and that the port was the problem, it happened again in only a few short moments.  After getting the roku stick, I know that both ports work fine, roku has no glitches, it also has vudu and amazon prime streaming as well. Roku is the better choice.", "verified": true, "helpfulness": "1/1", "author": "Melissa \"sita1356\""}, {"rating": 4.0, "review": "Wish we could do more but good system", "verified": true, "helpfulness": "0/0", "author": "thomas simpson"}]