[{"rating": 5.0, "review": "This is my second Amazon Fire purchase!  My first was the bigger model, although it is tiny too.  It's a fantastic option for tuning in to Netflix and Hulu but you can also get Amazon Instant Video, video games, free movies and series through Fire!  100% improvement from the Wii I had been using!  I can't think of ANY drawbacks, only pluses,  AAA++++++. This model is smaller and directly attaches into my TV but it gives the exact same features the bigger one does!  Sometimes I think there is a little lag time with Netflix, but it's on Netflix's end.", "verified": true, "helpfulness": "0/0", "author": "Barbara \"Purplependulum\""}, {"rating": 2.0, "review": "You have to pay for most stuff especially for kids.", "verified": true, "helpfulness": "0/0", "author": "Leann"}, {"rating": 5.0, "review": "Enjoying this purchase and the ability to watch all seasons of the Wire for free with my amazon prime membership", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 4.0, "review": "great little device doesn't take up much space and I've had no connectivity issues thus far", "verified": true, "helpfulness": "0/0", "author": "kay"}, {"rating": 4.0, "review": "Everything worked as described....except for the remote.  It's very cheaply made and was extremely hard to put the batteries in place.  Other than that....I am satisfied.  John (Flip)", "verified": true, "helpfulness": "0/0", "author": "flip"}, {"rating": 5.0, "review": "Wow! Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Harry S. Murr"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Elden S."}, {"rating": 4.0, "review": "looks good to me.", "verified": true, "helpfulness": "0/0", "author": "Paul Harwood"}, {"rating": 4.0, "review": "The Fire Stick is nice, but, I prefer my Fire TV unit better due to processor speed. Or, at least it seems faster to me. However, for the price, the Fire Stick is a nice source of Amazon Prime Video's.I also like the Sling TV over the Stick since I reduced my Time Warner Cable bill by $200.00 a month. I am some what of a news junky and found myself watching Fox News and CNN most of the time and paying a way too much for the service. So, the answer was to cut back to basic cable TV and use the Fire TV Stick and stream movies and Sling TV for ESPN and CNN. I ordered the 50 mips TWC Road Runner internet service and have not experienced any buffering problems with Amazon Prime movie service.", "verified": true, "helpfulness": "0/0", "author": "El Pajaro"}, {"rating": 5.0, "review": "I got the fire stick to go on a second TV because we have Prime and the kids watch their own programs.  It is a lot easier to use the home theater on the main TV.  May have to get a second fire stick to replace that.  Amazon had also set up prior to delivery so it was a plug and go.", "verified": true, "helpfulness": "0/0", "author": "Norma Lindsey"}]