[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Urban"}, {"rating": 2.0, "review": "It completely freezes up about every 36-48 hours and has to be restarted. Since it has no power switch, and is located on the back of the TV which is inaccessible, I had to run a power strip to the front of my TV with the the Fire Stick plugged into it so I could use the switch on the power strip to restart it. My old Roku box had similar problems but it froze up far less often. The user interface is very Amazon centric, but I guess that is to be expected.", "verified": true, "helpfulness": "0/0", "author": "JOHN HARTLEY"}, {"rating": 4.0, "review": "You have to use the plug, it's not really optional as indicated.  Works well.  Some learning curve on getting your digital purchases to show but works well.  Volume seems to be off, too low on most we have watched.", "verified": true, "helpfulness": "0/0", "author": "RRer_JSH"}, {"rating": 5.0, "review": "Great gift Idea for someone who watches a lot of television.", "verified": true, "helpfulness": "0/0", "author": "Denise Brown \"DB\""}, {"rating": 3.0, "review": "Besides change what is the item you lose most in your couch...Yup, your remotes. The remote is tiny, so this is alot easier to lose. When I first got the Fire TV Stick the app wasnt available yet for my iPhone, it is now. With your phone you can do the voice commands, but when your in Netflix it wont search within Netflix it will take you out of Netflix and search on Amazon instead.I honestly like the Chromecast better, which I own as well, the reason I purchased this was because I could access things on Amazon Prime which I couldn't do with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "nobull433"}, {"rating": 5.0, "review": "Most of the time it works just fine but since this device uses wi-fi it tends to run a little slow sometimes. Therefore,I would suggest using it for the bedroom television or the kids room. To speed things up a bit I would suggest getting the full FIRE TV with the direct ETHERNET WIRE for your primary television.", "verified": true, "helpfulness": "0/0", "author": "Paula Evjen \"Daniel Evjen\""}, {"rating": 5.0, "review": "The remote is super easy to use and I love the app. It's very user friendly! Hopefully they add HBO Go to the app lineup, but even without it, the Fire TV Stick is a great way to have all my favorite shows, movies, and apps in the same place!", "verified": true, "helpfulness": "0/0", "author": "Courtney"}, {"rating": 5.0, "review": "I have an amazon TV box already and I bought this was the game room.  It works great, it is fast, easy to setup and use. I have the TV connected to a stereo so this makes a great streaming music device when used with Amazon music prime, Pandora, etc.I did not expect this is work but I was able to utilize the USB port on the TV to power the Stick so one last cord I have to deal with behind the TV.", "verified": true, "helpfulness": "0/0", "author": "L. Palmer"}, {"rating": 5.0, "review": "Side loaded Kodi, works like a champ.", "verified": true, "helpfulness": "0/0", "author": "ITAdminCRBC \"ITAdmin\""}, {"rating": 5.0, "review": "It was very easy to set up once I figured out the code . You use the numbers on the modem if you have comcast cable. Then since I bought it through my smile.amazon account it was already set up in my name. ( this can be changed during set up )  Very easy to use the remote that came with it. and the batteries too. I am very glad to have this new feature to watch movies,tv shows etc. For a measly 39.00 it makes a great gift", "verified": true, "helpfulness": "0/0", "author": "Sharon"}]