[{"rating": 4.0, "review": "The only thing I do not like about Fire TV Stick is no on/off feature. I am not a fan of leaving it on 24/7. Other then that it works well and as expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It was fairly easy to set up -- I guess it depends on your tv and your knowledge of the settings.  Once I had it connected to the tv properly, it was very easy to finish the setup and breeze through the features.  It's quite amazing at all the features offered that I was completely aware of before purchasing -- I thought I was just getting access to tv shows and movies but it is far more.  I have looked at fitness programs, kids shows and games, cooking shows, etc.  There are many networks and channels I was not aware of as well -- I can see how customers would opt to use this as their tv provider and drop their cable provider in the future.  Don't know if I'm ready for that but who knows what will happen in the next few years?", "verified": true, "helpfulness": "0/0", "author": "F. Howard"}, {"rating": 5.0, "review": "It was easy to install, however if you have surround sound, instead of plugging it into the back of the TV where it only uses the TV speakers, plug it into the back of your receiver unit on the auxiliary HDMI port it will use all your surround sound speakers.", "verified": true, "helpfulness": "0/0", "author": "TiffJeff"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Lyann R."}, {"rating": 5.0, "review": "Well worth the money and very easy to install, makes me wonder why I did not try this product sooner.  I would highly recommend it to just about anyone, there are no skills required to get it up and running.", "verified": true, "helpfulness": "0/0", "author": "Thomas T."}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "angel hernandez"}, {"rating": 5.0, "review": "This product is so great! It was extremely easy to set up and use...especially with the handy remote that it comes with! Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 1.0, "review": "Dear Amazon, unfortunately I will be sending all fire sticks back to you. To the fire sticks didn't work, and one of them work but couldn't maintain a Internet connection. I compared it to the AppleTV that already have in the house and Apple TV works flawlessly and very fast.", "verified": true, "helpfulness": "0/0", "author": "Gerrod March"}, {"rating": 1.0, "review": "Not a good a product as I thought it would be. Hate that I can't broadcast from my phone and also it had to have a power adapter. Really disappointed in the product. I also waited a month from ordering to receive it.Love amazon products but this one was a let down.", "verified": true, "helpfulness": "0/0", "author": "Trent Witz"}, {"rating": 5.0, "review": "This device is so much better than Google Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Jacob Ajjarapu"}]