[{"rating": 5.0, "review": "OUTSTANDING!! I cannot say it enough. Delivered on every promise. My seven year old can fully navigate it. You get so much for so little $$.", "verified": true, "helpfulness": "0/0", "author": "Lisanne M Brandt"}, {"rating": 4.0, "review": "Have been having a lot of issues with episodes loading, I always get an error message. It's seems like it is more expensive to purchase the digital copy of Movies and TV seasons than it would be to actually go out and buy the hard copy.", "verified": true, "helpfulness": "0/0", "author": "audrey somerville"}, {"rating": 4.0, "review": "I truly do love this product! My only complaint and why I didn't make it 5 stars - I can't get the ABC and NBC app on here. I watch a lot of shows on my ABC app on the iPad and I'd love to be able to get it to my TV. Otherwise, it's easy to use, it allows me access to my entire Prime library and I am enjoying it very much!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Monteiro"}, {"rating": 4.0, "review": "It's been a good way to get shows but 8 have had a few issues with apps.overall I do like the ease of use", "verified": true, "helpfulness": "0/0", "author": "JT Gant"}, {"rating": 2.0, "review": "Although the device works and has all the features I needed it is slow hiccups a lot in apps such as plex sling hulu and Netflix I wish I would have got the fire TV overall I am quite unhappy with it overall", "verified": true, "helpfulness": "0/0", "author": "Blaine Wigington"}, {"rating": 5.0, "review": "The fire stick has been great. Easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 5.0, "review": "I have an Apple TV in one of the rooms of my house.  I don't really need the Amazon stick to watch Netflix and I am a Prime subscriber.  but I wanted something for other rooms and something I could take with me on the road.  The Amazon Fire stick really fulfills that desire.  It is easy to  hook up and works great.", "verified": true, "helpfulness": "0/0", "author": "John R. Oppenheim"}, {"rating": 5.0, "review": "Have this on two bedroom TV's and love it. So much to choose from. Sometimes loses signal but overall I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "Dawn Wade"}, {"rating": 4.0, "review": "This system has so much to offer, I've thoroughly enjoyed it so far! If I could only surf the web it would get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "J. C. Few"}, {"rating": 5.0, "review": "This is a great piece of hardware and the user interface is nice and simple. For the price the Fire TV Stick is not just a  good purchase, but a no-brainer. One major point for me is that line of sight is not required with the remote. I have the TV mounted on my patio outside and the Fire Stick is plugged into an HDMI jack inside my house (a weird custom setup, no need to go into details about it), and the remote works fine. I love it. I have the RoKu 3 also and it's great but it was like twice the price...", "verified": true, "helpfulness": "0/0", "author": "csramin"}]