[{"rating": 5.0, "review": "When I purchased my first Kindle  Fire HD, all I had to do was buy a simple connection which went from the Kindle into the HDMI of the TV and Voila!  - I could watch movies and such on the big screen.  Then when the Kindle Fire HDX came out, I 'upgraded' to it, assuming the connector would work as well.  Well, it wasn't compatible at all.  What was recommended was called \"Push TV\" from Netgear.  I bought it and struggled to get it to connect, but then once I 'mirrored' the image from my Fire  HDX, there was always a bit of distorted shadow on the background of the TV image.  I EVEN upgraded my router, thinking that would clear up the image.  But it never really was clear so I just tolerated the shadowy image.  Recently, while chatting with a technical representative via the 'Mayday' button on the Fire HDX,  I asked for help with the Push TV and the rep mentioned that she has the Amazon Fire TV Stick and that it works surprisingly well.  So I researched it and thought about it and went ahead and bought it.  I LOVE, LOVE, LOVE IT!  Best thing ever!  It works and was very easy to set-up. I highly recommend it to anyone and everyone.  Good job Amazon!!!  Of course, now I don't know what to do with the Push TV unit ...", "verified": true, "helpfulness": "0/0", "author": "Peggy T. \"Pegs Quest\""}, {"rating": 4.0, "review": "Works as advertised, a great addition to your home", "verified": true, "helpfulness": "0/1", "author": "Ted S."}, {"rating": 4.0, "review": "There is no search bar, I also get kicked off at times", "verified": true, "helpfulness": "1/1", "author": "seymoune"}, {"rating": 5.0, "review": "This thing is awesome! Love being able to watch Netflix, Hulu and Amazon Prime. We take it everywhere!", "verified": true, "helpfulness": "1/1", "author": "Kendra"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Marily G."}, {"rating": 4.0, "review": "Love the stick, we use it daily and even took it on vacation.", "verified": true, "helpfulness": "0/0", "author": "Mommyto3"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Perea"}, {"rating": 4.0, "review": "Excellent product for the price and when combined with Prime you get movies for free.", "verified": true, "helpfulness": "0/0", "author": "jrupertp"}, {"rating": 4.0, "review": "Not as good as I had hope. Quality I think is lower than the Apple TV on some program, but it could be the programs themselves. Interface not as good as the AppleTV either. But it has many more free choice especially for Prime members and lot less expensive.", "verified": true, "helpfulness": "0/0", "author": "R. Louie"}, {"rating": 5.0, "review": "Awesome! We love it!", "verified": true, "helpfulness": "0/0", "author": "joni hubbs"}]