[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandra Pappalardo"}, {"rating": 2.0, "review": "I have to use the extension cable to plug the stick into my television which creates problems because the connections often become loose. The stick will slip out and this causes it to freeze constantly. I have to continually pull the TV out and tighten the connection. It is a great idea, but something was lost in the design. You probably won't have a problem if you have an HDMI port on the side of your TV, but since the one I have the unit connected to is older I only have HDMI slots on the back. My advice is go ahead and spend the extra money and get Fire TV, it will save you headaches in the long run!", "verified": true, "helpfulness": "0/2", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It does not meet the standards of Roku, many shows Fire Stick wants me to pay", "verified": true, "helpfulness": "0/0", "author": "Joanne Doucette"}, {"rating": 4.0, "review": "Arrived on time, Great product.", "verified": true, "helpfulness": "0/0", "author": "quentin cooper"}, {"rating": 5.0, "review": "Great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "M. Schmidt"}, {"rating": 2.0, "review": "I bought 2 Fire TV Sticks for the TV's in my children's bedrooms and have to say I am disappointed with this product. The Fire TV Stick looses the Wifi connection on the regular and the whole optical system is more complicated as by his competitors Apple TV or Roku. We mostly using our entertainment systems for Netflix and Hulu Plus.I wouldn't recommend this product to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Puppyvicky \"Jenny Forth\""}, {"rating": 1.0, "review": "Spend a few bucks more for the box", "verified": true, "helpfulness": "0/0", "author": "Charles R"}, {"rating": 5.0, "review": "So simple .  So reliable.  So rad. Something for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Yebo"}, {"rating": 4.0, "review": "So easy to set up and use! I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it! I've bought at least 10 for family and friends", "verified": true, "helpfulness": "0/0", "author": "Eric Oliver"}]