[{"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Samantha Phillips"}, {"rating": 5.0, "review": "I really love this Fire tv stick", "verified": true, "helpfulness": "0/0", "author": "Luciano"}, {"rating": 5.0, "review": "No", "verified": true, "helpfulness": "0/0", "author": "P.Lambert"}, {"rating": 5.0, "review": "Wow! This was a breeze to set up and get started. And it works great with the Kindle Fire!", "verified": true, "helpfulness": "0/0", "author": "Joan M Trahan"}, {"rating": 5.0, "review": "Amazing! I declare the Fire Stick one of wonders of the world. Only problem is that my grandchildren have sequestered both my TV sets (I own two Sticks) and no regular cable TV can be watched at my house. Every home should have one...the Stick, not grandchildren.", "verified": true, "helpfulness": "0/0", "author": "gloria"}, {"rating": 5.0, "review": "Fire stick is awesome ,  it is fast and clear ! I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "JUAN AND KARI"}, {"rating": 5.0, "review": "I love this product. It's a smart and easy alternative to buying a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Butler"}, {"rating": 4.0, "review": "Works well.  Just have to get used to watching TV a different way.  Was surprised that Amazon picks were mostly ones that you have to purchase.  But, love the Netflix portion.", "verified": true, "helpfulness": "0/0", "author": "Bestlitegirl"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick works perfectly for streaming movies and TV shows on my TV.  Installation of the Stick was quick and simple.  The interface for searching for movies and shows to watch is very easy to use and the remote works well.  I also use my Fire Phone and Fire TV APP as a remote, and it is a little easier than the remote that is included with the Fire Stick.  The TV that I have the Fire Stick installed on is on the opposite side of the apartment as the wireless router, and I have had no issues with buffering or connecting to the internet.  Overall I am very happy with this purchase and would recommend it to anyone that uses streaming services, especially Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Josh Skelton"}, {"rating": 1.0, "review": "It will not stay connected to my internet.  I dont have any problems with any other device that i connect only this one.", "verified": true, "helpfulness": "0/0", "author": "Redwasp"}]