[{"rating": 1.0, "review": "Nice blue screen - thanks for nothing. I get \"hdcp unauthorised\" errors when I try and stream content.", "verified": true, "helpfulness": "0/0", "author": "Steve Montgomerie"}, {"rating": 5.0, "review": "The fire stick works very well,except when the internet gets too slow. It is unable to recover after a slow internet connection msg.", "verified": true, "helpfulness": "0/0", "author": "F. Holcomb"}, {"rating": 3.0, "review": "I ordered two of these and I'm a bit disappointed.  I'm a Prime member, Neflix member and Plex user.  My number on problem is the wifi. The description says 'better wifi' but I'm not sure better than what. I have the TV right next to my wireless router and I have a fiber connection but I constantly get the 'Home screen not available' error and losing connection to the wifi.  I can't get to Netflix anymore on either device and Plex hardly ever works. Last night for example I watched Plex on my tablet which was further from the wifi router instead of on the TV because nothing (not restarting or unplugging) would work.  In short, this might be great for Amazon only users, but the wifi seems to be extremely weak.  So, the device is okay, but I'm going to be giving mine away and buying a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"talia679\""}, {"rating": 2.0, "review": "i bought three fire TV stick working fine but only one have problem 1: remote is not working properly and really lose 2: my WiFi working fine on other devices but on this device i don't know way to slow esp Netflix. in same time Netflix work fine on the computer and mobile device", "verified": true, "helpfulness": "0/0", "author": "Ahmed M Ahad"}, {"rating": 5.0, "review": "I love this item because it saves a lot of time and trips to the Redbox.Great movies for children and adults.", "verified": true, "helpfulness": "0/0", "author": "Sandra Harrison"}, {"rating": 3.0, "review": "Why do we not have an app available for acorn TV?  I have Netflix but also pay for acorn which I LOVE!  It's frustrating that I can only watch it on my iPad. Please do something about this. There's a million stupid apps...lets get acorn too!", "verified": true, "helpfulness": "0/0", "author": "Tlittle"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Tom Swanks"}, {"rating": 5.0, "review": "Excellent and easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cool works great !", "verified": true, "helpfulness": "0/0", "author": "chakla"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Rick Ulrich"}]