[{"rating": 5.0, "review": "Arrived on schedule.  Very easy to set-up.  Had it working within just a few minutes.  Signed up for Amazon Prime, and it's very easy to navigate.  Very Pleased.", "verified": true, "helpfulness": "0/0", "author": "Paul E Blackwell"}, {"rating": 5.0, "review": "great buy", "verified": true, "helpfulness": "0/0", "author": "Shadow"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Harvey"}, {"rating": 5.0, "review": "This is an amazing product for those who don't have a smart TV. I've never had any issues and it works great especially for streaming Netflix! Great product for a great price! I will definitely recommend this to others!", "verified": true, "helpfulness": "0/0", "author": "BethR"}, {"rating": 5.0, "review": "I love it! It has everything my whole family wants and I super easy to use!", "verified": true, "helpfulness": "0/0", "author": "Valerie Harrington"}, {"rating": 4.0, "review": "Amazon fire stick works just like advertised. I prefer this over others because of the remote that's included. Although I was disappointed because my remote doesn't work, I paired up my phone and use it as the remote so I'm fine for now.", "verified": true, "helpfulness": "0/0", "author": "billyloc"}, {"rating": 5.0, "review": "My family loves the Amazon Fire Stick.  The performance for Netflix, Amazon Prime Video, and other apps is on par with my Roku 3.  The menu system is intuitive and looks good.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"imanengineer\""}, {"rating": 4.0, "review": "I love this product but I literally lose the remote every other day.", "verified": true, "helpfulness": "0/0", "author": "JL"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "jones"}, {"rating": 5.0, "review": "This is amazing and more than I expected. I have Roku, Apple TV and the Fire Stick performs as good as or better than the other two. Easy to install, setup and use. I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Two Fifty"}]