[{"rating": 5.0, "review": "so far so good i am still lerning on it", "verified": true, "helpfulness": "0/0", "author": "george partheniou"}, {"rating": 2.0, "review": "It works ok, but it loses signal a lot and I have to unplug it to reboot. it can be a pain to reboot it especially when in the middle of watching a movie.", "verified": true, "helpfulness": "1/3", "author": "Jennifer Caraway"}, {"rating": 4.0, "review": "Great equipment. It was easy to install and works well. The remote feels great in you hand and is very easy to navigate your selections .", "verified": true, "helpfulness": "0/0", "author": "Carl L."}, {"rating": 5.0, "review": "If you have Prime this is great. It is easy to navigate with the remote and the thing I like is it's portable. I can toss in a suite case and have it in a room with me where ever there is a Wi-Fi signal. There was hardly any setup, it came linked to my Prime account. Just select the Wi-Fi signal to use and off you go!", "verified": true, "helpfulness": "0/0", "author": "PaysYourMoneyTakesYourChances \"Gadget Girl\""}, {"rating": 2.0, "review": "I honestly wished I never purchased this device. I consistently have issues with mine telling me it has no internet connection, even though I just searched and browsed through titles. When I am watching videos they occasionally cut off and return to the main screen or the video freezes but the sound to the video continues to play. The device is slow and lags. All in all I am glad that I didn't spend much on this item, however I wouldn't buy another one. DO YOUR SELF A FAVOR AND DO NO BUY THIS DEVICE! With the connectivity problems and not supporting all the content I would like, I would suggest just buying the regular FireTV or the Chromecast. I have a Chromecast and I LOVE it. Hope this is helpful.", "verified": true, "helpfulness": "1/3", "author": "Troy Melvin"}, {"rating": 5.0, "review": "Love it so far. Use it in the living room and I prefer it to my Chromecast at the moment.", "verified": true, "helpfulness": "1/1", "author": "Mahan"}, {"rating": 5.0, "review": "good~! Excellent~!!", "verified": true, "helpfulness": "1/1", "author": "HOSEOCK CHUNG"}, {"rating": 5.0, "review": "very nice, easy set up and much faster than chrome cast. I will recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Hamid Khan"}, {"rating": 5.0, "review": "It does not get any better than this ! Sweet !", "verified": true, "helpfulness": "1/1", "author": "Deb"}, {"rating": 5.0, "review": "I've had a Chromecast since it was released, and I was iffy about it at first. But it was a new product and it's been updated enough that I really like using it. The Fire TV Stick is a similar product to Chromecast, but I would not say that they are identical. I really like having an independent interface and remote to navigate with. Sometimes I don't want to pull something up on my phone/laptop and have to keep it on to be able to watch something via Netflix, so I like the independence of this guy. But I keep and use both of them, as it's nice to be able to cast my computer screen to the TV, and they have a little different offerings.I think it's the better present for someone who's older/less tech savvy, and maybe even for the Average Joe who wants something really simple to work with. For people who like their toys, I would say get both, for they are both interchangeable and unique.", "verified": true, "helpfulness": "1/1", "author": "Wyatt True"}]