[{"rating": 5.0, "review": "I love it. It is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick goes way past my expectations! I haven't used my cable for 3 days! Beautiful picture quality. Great selections with prime! Love the screen saver! Will most likely cancel my cable in the next month or so!!", "verified": true, "helpfulness": "0/0", "author": "mary core"}, {"rating": 5.0, "review": "Super item for home entertainment! Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Edie"}, {"rating": 4.0, "review": "Like the option to rent or buy", "verified": true, "helpfulness": "0/0", "author": "leslie"}, {"rating": 4.0, "review": "I used to use PS3 to play netflix and amazon content before I got this device. The tiny remote is so much better than the PS3 controller! The only problem i have with it is that every once in a while, the wifi drops and the apps fail to connect to the internet. The only way i can get them to work is if I factory reset the device. Have done this twice in a month that I have had the device. But still I do use it everyday and I like it. I am hoping that the bug is resolved in future firmware updates.", "verified": true, "helpfulness": "0/0", "author": "Xen"}, {"rating": 5.0, "review": "This beats the Google chrome by a long shot!", "verified": true, "helpfulness": "0/0", "author": "Drew Simon"}, {"rating": 5.0, "review": "We purchased this item for our christmas present to ourselves.  I love this item.  No complicated set up and once plugged in it lites up your tv screen with sharp clear movies.  What a treat!!!!! I would recommend this to all of my friends.  I hope this item replaces cable absolutely.", "verified": true, "helpfulness": "0/0", "author": "Y.M. Fonville"}, {"rating": 4.0, "review": "Simple to install.  Started using it right away. I wish there were more new shows & movies included with prime but I'm sure they will soon.", "verified": true, "helpfulness": "0/0", "author": "Carlie Cunningham"}, {"rating": 1.0, "review": "I'm extremely disappointed with the Fire TV Stick. It's almost useless. I can't watch anymore than 10 seconds of a show/movie at a time before it starts to buffer. The signal strength is \"very good\" and the TV is 3 feet from the router so I shouldn't be having these problems. Disappointing. I can watch Prime Instant Video on my iPad with no buffering but the second I try using the Fire TV Stick, it's pointless. This was a waste of money.", "verified": true, "helpfulness": "2/2", "author": "cpre"}, {"rating": 1.0, "review": "Drops wifi connection constantly and freezes picture when it finally does connect... not worth the money yet. Our Roku works MUCH better.", "verified": true, "helpfulness": "1/1", "author": "E. Shepherd"}]