[{"rating": 4.0, "review": "Great!  Just wish you guys could provide the internet too!", "verified": true, "helpfulness": "0/0", "author": "jimhayes66"}, {"rating": 4.0, "review": "The Fire TV Stick is way faster than my Roku HD. The UI and the remote itself are very responsive, though I liked the Roku's UI a little better. The included remote does not support voice search, but you can add voice search by buying the fancier remote or installing the Fire TV app on your smartphone or tablet.Usually we watch Amazon Prime on our projector via our smart Blu-Ray player, but when I'm watching something alone or for those rare occasions when we don't want to watch something on the projector, I'll sometimes turn on the TV instead. My favorite feature is that it automatically turns the TV on and switches it to the correct HDMI input through my Toshiba TV's \"Regza-Link\" feature. I assume it's a standard feature with different names on different brands of TVs, but none of our other HDMI devices have done that in the past.", "verified": true, "helpfulness": "0/0", "author": "igen \"igen\""}, {"rating": 4.0, "review": "I love the ease of use.  The only complaint I have is that I have to periodically reset it by unplugging it then plugging it back in.", "verified": true, "helpfulness": "0/0", "author": "krwpackfan"}, {"rating": 5.0, "review": "Exactly what we needed. Has Netflix and prime. A remote app for my phone would be awesome. Maybe next year?", "verified": true, "helpfulness": "0/0", "author": "Matt Bunce"}, {"rating": 5.0, "review": "This is a great product. It was easy to set up and even easier to use. Works great with Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Kelly Miller"}, {"rating": 5.0, "review": "Works great easy to get started", "verified": true, "helpfulness": "0/0", "author": "Gale Fischer"}, {"rating": 5.0, "review": "Set-up was very easy even for an over 60 individual who is not very proficient with technology.  We are greatly enjoying the ease in which we can access Amazon Prime video and Netflix along with the improved quality of picture.  Wish I had purchased this device sooner!", "verified": true, "helpfulness": "0/0", "author": "Bren"}, {"rating": 5.0, "review": "All is good Fire Stick awesome", "verified": true, "helpfulness": "0/0", "author": "Linda N."}, {"rating": 5.0, "review": "Nice product. Very easy to set up. Nicely packaged. Very happy with the item.", "verified": true, "helpfulness": "0/0", "author": "Robin Sweet"}, {"rating": 4.0, "review": "Really good product.... if it had youtube would've been better..", "verified": true, "helpfulness": "0/0", "author": "Marcus momon"}]