[{"rating": 4.0, "review": "Q; Could you surf the web with the fire stick? because I want to be able watch movies on a certain site and I was planning to get Google chromcast but I heard that if you get a email or incoming call it disturbs your videos I want to know if The Fire Stick will let me surf the web", "verified": false, "helpfulness": "0/0", "author": "Bianca Sarmiento"}, {"rating": 5.0, "review": "PRO - Faster than Roku Stick and better user friendly than Google ChromecastPRO - Similar user interface as Roku but with more featuresPRO - Easy to navigate with tons of featurePRO - Very shard HD picturePRO - Able to connect through WIFI ACCON - The remote should be more responsive (not as good as Apple TV remote); when pressing once sometimes resulting double click or delay", "verified": true, "helpfulness": "0/0", "author": "Duty Free"}, {"rating": 5.0, "review": "So Far so good. Does exactly what it should do. We use the Fire Stick on 2 TV's. It's easy to move, and works perfect. Thanks Again Amazon, Big Smiles!!!!", "verified": true, "helpfulness": "0/0", "author": "J. Overmire"}, {"rating": 4.0, "review": "I was so disappointed in the chromecast I bought awhile back that I just decided to chance the Fire TV stick when it was on sale. It's a bit zippier than older Rokus and the UI is solid. I use this on my second TV in the bedroom while my xbox does the media work in the living room.I'd give this 5 stars if it could cast content from my laptop, ipad, or iphone. I'm also looking forward to the iphone voice search app.", "verified": true, "helpfulness": "0/0", "author": "Drew NYC \"Drew NYC\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "patti joyce"}, {"rating": 5.0, "review": "I have both Fire TV stick and Fire TV box for each TV. I don't know the difference between these two. But they are both great.", "verified": true, "helpfulness": "0/0", "author": "365 Days of Happiness"}, {"rating": 5.0, "review": "This thing is incredible!  It blows the chromecast out of the water.  It is a stand alone device so no need for a tablet or phone. The interface is smooth ad easy to use.  There is also an app you can download on your phone to control it and is voice activated as well.", "verified": true, "helpfulness": "0/0", "author": "Michael Venza"}, {"rating": 2.0, "review": "Having trouble getting remote to stay working. Having to change hdmi every day or two, then stops working again.", "verified": true, "helpfulness": "0/1", "author": "Beth Rogers"}, {"rating": 5.0, "review": "I've neve used the Fire TV (original version) before, but have been a long-time Prime member.  I've used Prime Instant Video on my phones, tablets, computers, game consoles, etc. for quite a while.  I never could really see myself spending $100 for the Fire TV, so when this device was announced (I perordered for $20) I couldn't pass up the chance.Setting up the device was super easy and painless, especially since Amazon ships it read to use on my account.  This means all I had to do was provice my internet password ater plugging it in, and I was ready to go!  This is a great feature, and is one I wish I had when I bought my first Kindle devices (which were purchased from Walmart).  The remote is also WiFi, which means no IR interference and I can use the remote from my pocket in the kitchen while I'm finishing my dinner and selecting my show or movie to watch.  Even the phone app remote is amazing, with the voice search built in.  I'm not sure why anyone would buy the voice remote if you have access to this app - on a side note, it's great fun to turn on and mess with the wife when she's watching something sappy I don't want to see!As for the Fire Stick, it's fast and easy.  There's no learning curve at all, if you can navigate up and down, left and right then you can use this product.  Using Netflix or Spotify is also easy and works really well with the remote provided.  I've been using it for only 20 days, but I haven't looked back once.If you're the kind of person who's ready to cut the cable cord or drop the dish, then this is going to be your product. I imagine once HBO releases their GO App to the public we'll see an update that allows its use on the Fire TV devices, which coupled with Netflix and Hulu alread supported, why would anyone need anything else?!I try really hard to come up with cons when talking about products to people. but given the information at hand I can't come up with any.  I suppose the lack of HBO GO could be one, but honestly without a television subscription I can't use it, anyway, so it'd be pointless.  If you're a Prime Member who wants Fire TV but doesn't want to spend $100, this is your device!  If you already have Fire TV in your living room and want another device for a bedroom or den TV, this is all about you.  If you need something easy to use, that requires little or no setup, and you're tired of the cost for TV subscriptions, then look no further.", "verified": true, "helpfulness": "1/1", "author": "CaptObvious"}, {"rating": 5.0, "review": "Fantastic.  It does everything they promise it will do.  Very fast and crystal clear.", "verified": true, "helpfulness": "0/0", "author": "Jim"}]