[{"rating": 4.0, "review": "Works well...the first one wouldn't load netflix.  Customer support was helpful but finally sent new stick out.", "verified": true, "helpfulness": "0/0", "author": "Jenifer Buttz"}, {"rating": 5.0, "review": "The Fire Stick was given to me as a gift and I am really enjoying it. The olny thing that gets a little confusing is what movies are included at no charge in Prime and what needs to be paid for.", "verified": true, "helpfulness": "0/0", "author": "Rickrunn"}, {"rating": 5.0, "review": "Better than expected. Easy to install and make a watch list", "verified": true, "helpfulness": "0/0", "author": "BAR"}, {"rating": 4.0, "review": "The interface is not as intuitive and user friendly as the Roku stick and is definitely geared to an Amazon-centric presentation of content.  I think it's worth the extra $10 to go with the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Brian Kurklin"}, {"rating": 5.0, "review": "I LOVE this thing! It is so easy to use and I love that it's small so I don't need shelf space in order to use it.", "verified": true, "helpfulness": "0/0", "author": "Victoria N Aceto"}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "carlos antonio perez"}, {"rating": 2.0, "review": "Overall I was underwhelmed and would not recommend to friends.When you find something you can watch and actually watch it the experience isn't too bad. Once you step outside of that, not so great.Interface can be slow and somewhat glitchy. The mixing of non-prime video with prime video is super annoying. What ends up happening is you browse tons of things that you can't watch with your prime membership, but have to buy extra. Thats fine to have these separate types of content, but separate them. Don't mix them in as if they are equal when they are not. Most of the so called apps are junk. Overall its a typical android style experience. Almost there, but not quite. And surrounded by a bunch of crap that brings the ecosystem down.", "verified": true, "helpfulness": "0/0", "author": "JWeber"}, {"rating": 4.0, "review": "U need prime to enjoy the stick", "verified": true, "helpfulness": "0/0", "author": "jp claverie"}, {"rating": 1.0, "review": "Noooooo", "verified": true, "helpfulness": "0/1", "author": "juan c ochoa"}, {"rating": 5.0, "review": "Easy to set up. Love the simple remote.", "verified": true, "helpfulness": "0/0", "author": "KCCOOKIE"}]