[{"rating": 2.0, "review": "If I leave this on for an extended period of time, it starts to go in and out. It like looses its signal, like a tv with an antenna. I am not very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Rick Wayne Jr."}, {"rating": 5.0, "review": "Use it EVERY day.", "verified": true, "helpfulness": "0/0", "author": "Cris Tewksbury"}, {"rating": 5.0, "review": "Love the fire stick.  This is second one that ive purchased. Super easy to set up and app on phone works very well for android. If you have prime and no cable tv this is great for watching primw kids shows and other prime movies.  Also easy access to your purchased video library.  If you dont have a smart tv the fire stick is game changer.", "verified": true, "helpfulness": "0/0", "author": "Lisa Barlow"}, {"rating": 5.0, "review": "I have three Apple TV, one broke down. Apple use to charge $95 per item...now the new ones will be starting at $150...Apple always want to make a million dollar on every items they sell🔪 and I find it annoying. I went to Amazon site and read some reviews about the FireTV stick and all sounded good and the price was less than half of what I use to pay with my Apple TVs... I thought why not? And ordered one. It's as good as Apple and when I watch Netflix I don't have to wait as often as I did with Apple while it scrolls. The only thing that Apple has better and I wish Amazon should have is, when I see the name of an actor I like I can click on the name and a new window opens with all the movies available with this actress.. That's all otherwise it's great", "verified": true, "helpfulness": "0/0", "author": "daniel martinez"}, {"rating": 5.0, "review": "Super easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Rochelle Schiebout"}, {"rating": 3.0, "review": "As an Amazon Prime user I found the Prime Stick to be a great value (purchased for $19 during the initial sale for Prime users). It's very simple, nothing fancy but doesn't do quite as many things as my other streaming player, the now 2 year old Apple TV.Pros:- The biggest benefit for me that I see with this device is the ease at moving it from one room to another. My apple TV is stuck within a media cabinet and would probably take me 5-10 minutes to pull out the wires and move but the Prime Stick can simply be unplugged from the TV and brought to another TV.- Prime content available with the click of the power button (TV will turn to the correct input channel when you power on the device).Cons:- Somewhat slow, lags quite a bit. Today's small mobile devices have blazing speeds. As with most cheaper media devices they don't pack the punch you might be used to so you'll definitely notice some lag. Again, for $19 I'll get over that.- No keyboard or voice searching BUT for the price one cannot expect that.- STOPPED WORKING AFTER 9 MONTHS. One day it worked fine, the next day it would not power on. Luckily I am still within my 1 year warranty and after a 5 minute chat session with support they have a new device coming my way.OVERALL - I would rate the device 4 stars because of the value you get (gave it 3 because it kicked the bucket in under a year). It definitely needs voice control or a keyboard on the remote but for the price you get what you get. I'd rather pay $5 more though upfront for that slightly better remote to make searching easier via voice or keyboard. At $40, it's still a good deal but now that Apple TV is $69 retail (Amazon Prime has it for $62 today) anyone who is an avid Apple user might want to consider paying a little more for that and use Airplay to stream your Prime shows/movies from your phone/ipad to your Apple TV. Just my suggestion.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "Really like this product, simple and easy to use. Interacting with the remote is intuitive and easy. I had to use the adapter", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "Love it thanks", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "don't know why I waited so long to get one of these, my tech phobia prevented me from trying it. Then I divorced Comcast and started looking for alternatives. Now I am inundated with new choices, and programs/movies I was paying over $100/month for at Comcast. I love it, picture is great and it was so easy I think you could set up without knowing how to read.", "verified": true, "helpfulness": "0/0", "author": "Tracy Linda"}, {"rating": 5.0, "review": "Wow!  I LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth H. Jones"}]