[{"rating": 5.0, "review": "This exceeded my expectations! I'm replacing several older Roku units and I can't believe how fast the Fire TV Sticks are.  Movie start times, playback, navigation, app launching,etc. are all lighting fast.  Great product at such a low price!", "verified": true, "helpfulness": "0/0", "author": "N. Hickey"}, {"rating": 4.0, "review": "seems to work about as well as is expected. It won't replace my chromecast completely until it has better support for providers with Showtime Anytime, and ANY support for HBO Go. I also find the UI to be a little clumsy, but ultimately I like it.", "verified": true, "helpfulness": "0/1", "author": "Mark A Sherman"}, {"rating": 5.0, "review": "i am enjoying the fire stick...very easy to set up and streams nicely", "verified": true, "helpfulness": "0/0", "author": "Maura E Cronin"}, {"rating": 1.0, "review": "Chromecast: Plug-and-PlayRoku Stick:  Plug-and-PlayAmazon FireTV Stick: Plug-and-Restart-and-Fail-to-Update-and-Restart-and-Fail-to-Update-and-Finally-Connect-and-\"Connect-with-Problems\"-and-Restart-and-Never-Actually-Work.Love Amazon; worst consumer hardware abomination ever.  The Fire Phone launch seems like the iPhone 5 in the wake of this.", "verified": true, "helpfulness": "13/18", "author": "Tomorrow's Man \"Tomorrow's Man\""}, {"rating": 4.0, "review": "I had a Chromecast and I love it so much I immediately picked up a FireTV Stick for $19.99 when it came out. It's quite a superb value for that price. I deducted a star because I've had to reboot mine as it stopped connecting to my Airport Extreme.Full 1080p quality is great and you can tell there's a more beefy processor in this compared to Chromecast. User interface is easily navigable and when you first connect it, you don't have to login! It's already associated with your Amazon account before it ships.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Cristian"}, {"rating": 5.0, "review": "Works great! Unlike it better than the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "S. Forman"}, {"rating": 2.0, "review": "It's a good reliable device, but it streams most everything that other devices (Blu-Ray) already do. Two starts until they get more TV applications to run on it.", "verified": true, "helpfulness": "0/2", "author": "Mind&Body;"}, {"rating": 4.0, "review": "Stream shows really well even on slower DSL", "verified": true, "helpfulness": "0/0", "author": "Sundown"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Joe Walentin"}, {"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "John L"}]