[{"rating": 5.0, "review": "I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Brieanna Wimmer"}, {"rating": 5.0, "review": "Amazing! I was able to set it up within 5 minutes and have had no problems yet. It makes streaming and downloading my favorite movies and TV shows so easy! I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "ABN"}, {"rating": 5.0, "review": "The game apps are lacking, so for now, I would not bother with the extra game pad. But I personally don't play games on it, so no big deal to me.It does work very well with Sling TV though and was my main reason for the purchase.", "verified": true, "helpfulness": "0/0", "author": "Dennis R."}, {"rating": 5.0, "review": "I've had the Fire TV Stick for about a month now and I could not be more pleased! The set up is simple, and the navigation is pretty easy. I've seen some reviews have issues with streaming but I haven't seen any (fingers crossed). It's a great alternative to multiple cable lines in the house and is easily transportable. The only app I would like to see on this interface is HBOGo other than that this device is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Greg Hernandez"}, {"rating": 5.0, "review": "The Fire Stick works very well. Our family enjoys the movies, the games, TV Shows, etc that are basically on demand. We look forward to when  movies, shows, and games in Spanish can be included.", "verified": true, "helpfulness": "0/0", "author": "Simco"}, {"rating": 5.0, "review": "Easy to install. Great picture but the screen went black for just a second several times. That seems to have been fixed. I have enjoyed your Amazon original programs such as Alpha House.", "verified": true, "helpfulness": "0/0", "author": "M. Causey"}, {"rating": 5.0, "review": "I was absolutely amazed with the ease of installing the Amazon Fire TV Stick and how well it works.  The Fire TV Stick locked in to our network as soon as I entered the password. The instructions were brief, accurate and easy to follow. The unit knew that we were already subscribers to Amazon Prime, so there was no problem getting started with Prime viewing.  We have already enjoyed many hours of Amazon Prime programming.  We subscribe to Netflix also, so we can always find something that we want to view.All of this at a great price.", "verified": true, "helpfulness": "0/0", "author": "Carl Tee"}, {"rating": 2.0, "review": "I'm going to return it today. I have WiFi in my home, obviously. But for some reason, the Fire TV Stick kept losing signal, resulting in repeated long delays while it paused to recapture a signal. Way too frustrating. I can't understand why this would happen, as I don't have problems with any other WiFi devices in my home. Besides this, I have a large screen TV, High Definition. But the shows I played through NetFlix were very, very blurry, extremely low quality. The Fire TV Stick is just not worth all these drawbacks.", "verified": true, "helpfulness": "0/0", "author": "Christine E Miller"}, {"rating": 4.0, "review": "Great interface, clear picture--easy access for my viewing pleasure.  The only negative is that it occasionally will not pick up a wifi signal (which I know is strong).  Can I blame the stick?  Yes..I have a Roku and Xbox where I stream, and I do not have this problem with them.  However, this may be because this does deliver a higher quality image.  Worth it.  Overall, would recommend.", "verified": true, "helpfulness": "0/0", "author": "Christopher Shamburg"}, {"rating": 5.0, "review": "Even easier to use than I thought it would be!  Crystal clear picture. Easy to use. We're really liking it!", "verified": true, "helpfulness": "0/0", "author": "grammykate"}]