[{"rating": 5.0, "review": "Very easy to install!  Meets all expectations!", "verified": true, "helpfulness": "0/0", "author": "JoAnn Williams"}, {"rating": 5.0, "review": "Love this! So much better than a Google chromecast!", "verified": true, "helpfulness": "0/0", "author": "Tara Tomlinson"}, {"rating": 4.0, "review": "Good product runs slick and fast.  My only complaint is the menu is a little busy.  Rather than just show all the apps on the front screen it shows apps and recent shows you have watched and always pushes amazon content to the front.", "verified": true, "helpfulness": "0/0", "author": "Jim p."}, {"rating": 5.0, "review": "It's great item to have", "verified": true, "helpfulness": "0/0", "author": "thrghost2012"}, {"rating": 5.0, "review": "It's easy to navigate and set up and all around pretty cool", "verified": true, "helpfulness": "0/0", "author": "Shaun Timmerman"}, {"rating": 5.0, "review": "This is great.  Set up was a snap.  Anyone could do it, only took a few minutes.  I am very satisfied", "verified": true, "helpfulness": "0/0", "author": "Evil Lynn \"Linda\""}, {"rating": 5.0, "review": "This more then meets my expectations.", "verified": true, "helpfulness": "0/0", "author": "Mary Miller"}, {"rating": 5.0, "review": "Very convenient, works great small and easy to transport", "verified": false, "helpfulness": "0/0", "author": "Dakotah Wilcox"}, {"rating": 5.0, "review": "I received the Firestick as a Christmas gift last year and it is my favorite present!  I don't miss cable at all.  Plus, I get  much better value with Amazon Prime.  Love!  Love!  Love!", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 4.0, "review": "I love my Fire TV stick.  It works very fast and it is easy to operate.  I especially like the iPhone remote app.My only complaint is all of the advertisement lead me to believe it was just a simple stick that plugged into the back of my TV.  They failed to mention it had to be plugged into an AC outlet.  This caused my simple two minute installation to turn into a two hour installation.  If your like me, you have your TV neatly mounted on the wall with all of the wires hidden for a nice clean look.  Of course the power outlet is behind the TV mounted on the wall.  Sorry to vent, but it was a pain in my butt.", "verified": true, "helpfulness": "0/0", "author": "J Hamilton"}]