[{"rating": 4.0, "review": "Great for the price. Just missing a few apps like HBO Go. Great UI.", "verified": true, "helpfulness": "0/0", "author": "C. Garcia"}, {"rating": 5.0, "review": "It is wonderful, and very easy to set up. I am very pleased with it and so very glad I bought it. Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Louise J Thompson"}, {"rating": 5.0, "review": "Simple to install.  Easy to use. No buffering.  Exactly what I wanted.  Would Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Richard Pedigo"}, {"rating": 4.0, "review": "Overall I really enjoy the Fire TV Stick. I came from a PS3, Xbox One, and Apple TV set up. Fire TV Stick is easy to set up and works well. I wish it were possible to customize the interface a bit, but for what it is I'm pretty happy with it considering the price. Netflix lost my log in, but that's probably because I'm powering the Stick with my TV's USB instead of the provided power adapter. I'll probably keep testing it. I think $39 is pushing it a bit for this device. But under $30 and this is a solid deal. I bought two for $20 each when it first came out.", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 2.0, "review": "Pre-ordered, being a Kindle Fire fan and a Prime member. Did not even mind the expectation that the the programming would focus on Amazon Prime offers.... HOWEVER, the CHANNELS offered are very limited. My Roku stick has HUNDREDS of channels to choose from, including scores of FREE channels, not offered by the Fire TV Stick. I'm giving it to a friend; it's fine and friendly but no reason to keep it; Roku is still the best on the market.", "verified": true, "helpfulness": "2/2", "author": "Dale Milford"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Real Buyer"}, {"rating": 5.0, "review": "Just what I was looking for. Set up is so simple and with Amazon Prime there is no monthly fees.", "verified": true, "helpfulness": "0/0", "author": "ocgregw"}, {"rating": 5.0, "review": "Excellent value. Very fast and works with USB plugged into television. I did not have to use power outlet as suggested in user manual. Not a gamer so I can't comment on gaming apps.", "verified": true, "helpfulness": "0/0", "author": "Glenn \"Glenn\""}, {"rating": 4.0, "review": "This a good middle between the chromecast and fire TV box/Nexus player. You get the streaming apps netflix, Hulu, Amazon prime video and casual gaming only bad side very hard to search as you need to input every letter manual and slowerer then casting.Great very casual gaming remember this a dual core so even tho you can play some video intense games they lag or freeze up, or having open them up again to play, Small games play smooth. Games are Limited at the moment that support just the remote.There is some lag from time to time flipping thru the OS.", "verified": true, "helpfulness": "0/0", "author": "Mariah Chavez"}, {"rating": 5.0, "review": "Awesome fast device!", "verified": true, "helpfulness": "0/0", "author": "cris"}]