[{"rating": 2.0, "review": "I like it but ,it did not work for me.", "verified": true, "helpfulness": "0/0", "author": "Eddie"}, {"rating": 3.0, "review": "I like the concept, but my internet says \"connected with problems\"  and I cannot watch any programs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "the Amazon stick i received was defective i sent it in for a replacement. But other than that it is amazing strongly recommend it the apps the movies EVERYTHING! Plex App works great with amazon stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is an awesome product! I love being able to access Netflix and Prime video. All my favorites on my tv screen!", "verified": true, "helpfulness": "0/0", "author": "Silvia Rainwater"}, {"rating": 5.0, "review": "I go this for $19.  Enough said!", "verified": true, "helpfulness": "0/0", "author": "Skyhoneybear"}, {"rating": 2.0, "review": "I do not recommend the Fire Stick if you live in an apartment complex or on a block with a busy network. This Fire TV Stick has major connection issues on a busy network. You will be buffering more often, than actually watching a show or movie. STUCK AT 25% - FAIL!  I switched back to Roku and it's streaming fine, so it's not my internet provider.", "verified": true, "helpfulness": "0/0", "author": "stinger2133 \"stinger2133\""}, {"rating": 5.0, "review": "Great product for the price. Does everything it said it would.", "verified": true, "helpfulness": "0/0", "author": "Stuart Lyndon Owsley"}, {"rating": 5.0, "review": "Loving my new Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "jason m wudarski"}, {"rating": 5.0, "review": "Love that it turns my TV into a Smart TV", "verified": true, "helpfulness": "0/0", "author": "Catherine"}, {"rating": 5.0, "review": "Omg I love this! Super easy to hook up. I watched the you tube video on how to open the remote as recommend by a review I read and used a silicone oven mitt to push the cover down to open it. It's hard to open in part because it is small and hard to get leverage.Once that's done you are golden. Remote is super easy and so is navigating the sites. Nice to be able to watch my Netflix in the family room instead going up to my formal living area where my smart TV is.Best purchase! I am trying out Prime and so far love that Too‼️", "verified": true, "helpfulness": "0/0", "author": "Always looking to save a buck! \"Sandi C.\""}]