[{"rating": 1.0, "review": "I'm giving this a 1 until Amazon fixes Miracast for Windows 8 devices.  I tried to connect my DVP8 and it wouldn't work.  I've read online that others can't connect their windows devices either.  All the other stuff does indeed work fine (Netflix, Prime, etc...), but the whole reason I bought this was for the Miracast since I already have 20 different devices that stream Netflix.  The first day I had this, there was one hiccup where it lost wireless signal and I had to unplug/re-plug it to get the signal back.", "verified": true, "helpfulness": "6/11", "author": "Aaron"}, {"rating": 3.0, "review": "The Fire TV Stick performs as advertised, within 5 minutes of unboxing the device I was streaming instant videos.I've seen complaints about it requiring to be plugged in - really everyone?  Come on...My only complaint is that there ARE NO PARENTAL CONTROLS for restricting access to films based on rating R, PG-13, etc.  The only reason I bought this was because I was thinking this would be a way for my daughter to stream children's movies or cartoons over the internet to the TV in her play room.  I cannot believe this day in age, with a service like this, something that has been around for the last 20 years is not on a device that has access to thousands of R rated movies and shows.  It's like when they first released the Amazon Fire Kindle, with no parental controls to prevent kids from downloading and buying apps.  You wonder sometimes if Amazon is run by a bunch of adults who don't have children, because this is a no brainer and it was skipped.So for now, I'm not using this thing for ANYTHING that it was intended for...except maybe my daughter will play a few games on it.I side-loaded XBMC onto the device and I am streaming digital copies of my DVD/Blu-Ray movies over my home network.Add parental controls Amazon, and you'll have a Prime user streaming movies but until then I'll stream from my own network.  Pretty sure that goes for thousands of others.", "verified": true, "helpfulness": "2/8", "author": "jaycmw18"}, {"rating": 4.0, "review": "So far, so good.  The most difficult part of the setup was getting the remote's battery compartment cover open to insert the batteries.  Once that was finally done, the rest of the setup was a piece of cake.  We've used it for about 2 hours and it performs as described.", "verified": true, "helpfulness": "0/1", "author": "IBCSucks"}, {"rating": 4.0, "review": "I will not repeat all the praise, to most of them I do agree, but straight to the reason why I didn't give it a five star.It's simple, the first hand experience could  and should be enhanced. The set up time was artificially prolonged by the system update and an intro video. The first one is semi understandable, however the necessity of the no update no play on a tv stick is at least questionable, considering especially other devices using the same platform doesn't require the latest update for running. The latter, the intro video, is more annoying and somewhat funny. The video can't be skipped which means the very first video played by this great product is as good as a pre internet show commercial, about something you already bought. The content of the video is mostly pointless, for example at one point this video was telling how to use the navi keys on the remote, however to get to the point where this video is playing one has to have used the remote to navigate through the wifi and entered network password (if being used) with it. Just like showing the map at the destination, classic.Like I said, once the hassle of the first boot is over, this small device impressed me. However the impression came late and with a sour pretaste.", "verified": true, "helpfulness": "0/2", "author": "Chris J."}, {"rating": 5.0, "review": "It took only a few minutes to put the batteries in the remote and attach  the stick to the TV . It somehow new my account info without me having to sign in so all of my Amazon content was available right away. Just had to type in my network login code. Up and running in 5 minutes. Only thing I would change is to have the USB connection on the stick at the end instead of the side. Coming out of the side interfered with the adjacent HDMI connections so I had to use the included HDMI extension.", "verified": true, "helpfulness": "2/4", "author": "Larry Williamson"}, {"rating": 3.0, "review": "The interface is clean and easy to use, but Amazon promised a streaming device that was supposed to get rid of all the things people didn't like about the other streaming devices and this is not the case. Still no HBO Go, they promised this by the end of the year and its November and still no app. It's missing Vudu and Starz Play, all the competitors offer this, amazon should have gotten them on board.", "verified": true, "helpfulness": "2/8", "author": "Jose Rodríguez"}, {"rating": 2.0, "review": "Playback is smooth and looks excellent -- when you can actually get online with it.The wireless connectivity is TERRIBLE.  While family members and I were sitting around the TV with smartphones and laptops getting an excellent signal from the brand new ASUS RT-N66U wireless router just up the stairs, the Fire TV Stick was constantly dropping the signal and re-connecting again.I couldn't even download the initial forced 900MB software update!  The ONLY way it would download is to turn on my phone's Wi-Fi hotspot sitting a few feet away and connect to that instead!  What should have been a 10-minute setup ended up taking hours!After I turned off my phone's hotspot my parents couldn't use it anymore because it still couldn't get a consistent network connection which it requires to do literally anything.  I'm being forced to relocate their router to the same room as the fire TV stick with powerline adapters just to make it work.Not impressed.  Not even close.", "verified": true, "helpfulness": "2/5", "author": "Computer Dr. \"Matt\""}, {"rating": 5.0, "review": "I received the new Fire TV Stick on Thursday. I had it up and running in just a few minutes. It downloaded the latest version of its software and we were off and watching. Not as many channels as my Roku or my Apple TV but I knew that before I purchased this item. I also ordered the voice activated remote for my wife to use. I am currently using my android phone as a controller. Being a Prime member I have now uploaded a truck load of pictures of our kids, grandkids, cat, dog, horses and even a few of my wife and I to Amazon Cloud (free for all you want to put there) and my wife can view them anytime using the voice remote.The Fire TV Stick is much quicker than the Roku or Apple TV. Once setup when I click over to the right HDMI connection this bad boy is ready. When I start a program, it starts like now. We watched 4 hours the first night and experienced no hesitation, watched basketball game Friday night no hesitation, watched tons of pictures and played with Amazon music again with no hesitation. These are currently on back order but I would order another one (actually I did order another one) to put on another TV.", "verified": true, "helpfulness": "1/3", "author": "R. W. Sharp"}, {"rating": 2.0, "review": "Have to waste time to watch stupid \"how to use\" video. I do not need to watch how to connect Fire TV Stick. Of course it is already connected.", "verified": true, "helpfulness": "1/13", "author": "TS"}, {"rating": 1.0, "review": "Very disappointed. I cannot believe it has to be powered! Yes you have to plug a separate USB power adapter into the wall. I fully expected I could just throw this little puppy into my pocket and take it anywhere for any TV but no, I have to lug a cable and power adapter with me too. Amazon, I think this was a bait and switch cause nothing on the web talks about power when I bought it.Secondly, everything was good until it updated its software. Now the screen has a bit of \"snow\" (yes for you old schoolers, that analog snow you get from a poor connection) and every once in a while my screen drops off completely as if it was not plugged in at all.I bought 2 for the $19 prime intro price, I wouldn't have bought 1 if I knew it had to be powered.", "verified": true, "helpfulness": "5/41", "author": "nanclus"}]