[{"rating": 5.0, "review": "Everything I wanted and more!", "verified": true, "helpfulness": "0/1", "author": "Amy R"}, {"rating": 4.0, "review": "enjoy using the stick", "verified": true, "helpfulness": "0/1", "author": "DJ"}, {"rating": 3.0, "review": "I bought this in order to MLBTV streaming. There is a serious problem with the app that makes it unwatchable because of constant buffering. Neither Amazon nor MLB have dealt with the issue.  Otherwise the performance is good and I do not have similar problems with any other apps. It's well worth the money unless you want to watch baseball.", "verified": true, "helpfulness": "0/1", "author": "Carey Rogers"}, {"rating": 5.0, "review": "Great product label me to get rid of my cable some of the movie channels less expensive works great", "verified": true, "helpfulness": "0/1", "author": "Reggie kitchen"}, {"rating": 5.0, "review": "This is super easy to use. I had no issues with the setup- it took just minutes and walks you right through. Love having my Netflix and Prime all in one place.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it, but you have to have a strong internet connection and streaming speed to be able to make the best use out of it.", "verified": true, "helpfulness": "0/1", "author": "Sina"}, {"rating": 5.0, "review": "All the entertainment you would ever want in a small little stick. I bought 3 for my house and I have one in my car to take with me were ever I go. I love that you can watch amazon prime videos, netflix, and plex all in the palm of my hands. I also own the fire box and it that is even better and more powerful, Amazon has finally made a product worth buying over and over again.", "verified": true, "helpfulness": "0/1", "author": "Rizwan"}, {"rating": 5.0, "review": "Couldn't be happier.  I have a SmartTV in the living area I bought the Fire Stick for my bedroom and I am enjoying it very much.", "verified": true, "helpfulness": "0/1", "author": "Maryfrances Gillen"}, {"rating": 4.0, "review": "Very Good, but had to pay $2.99 for app to achieve mirroring for iPhone 6 plus. Overall still worth it! Works as advertised. iPhone app for Fire TV stick gets low grades, due to lack of function and control. Fortunately the stick comes with its fully adequate remote.", "verified": true, "helpfulness": "0/1", "author": "Marilyn Robinson"}, {"rating": 5.0, "review": "This is the best stick on the market, love it.  Can't wait until more TV related apps become available from the ABC, NBC, CBS's.", "verified": true, "helpfulness": "0/0", "author": "Dale W. Wilson"}]