[{"rating": 5.0, "review": "This thing is awesome and easy to use.", "verified": true, "helpfulness": "0/0", "author": "JoanneWithHighExpectations"}, {"rating": 4.0, "review": "this fire tv stick met all my requirements.", "verified": true, "helpfulness": "0/0", "author": "James W."}, {"rating": 1.0, "review": "Just providing another data point here.I have been using Roku for years, and got this for the little TV in the guest room since I didn't want to spend a lot.Like the Roku, it works well in the sense that you can use the internet to stream content from places like Amazon Prime or Netflix. (I use internet services for TV and movies, and don't pay Time-Warner for TV cable service.)Things that are wrong:1. Once something is playing, mine hiccups from time to time, skipping a moment of content.2. The interface is amazingly terrible. I always think Hulu is bad, but this is even worse. Amazingly, it's especially bad with accessing Amazon content. I can't imagine what they were thinking.With the Amazon content on the Roku, I can easily navigate to my Watchlist for TVs or Movies. Here -- WTF? -- the movies and TV shows end up in the same listing.The bad user interface is a software issue, so I'm hoping that Amazon will step it up and we'll get updates and the usability of the device will increase.The hiccuping, I'm not sure; maybe it's a firmware thing that can be addressed with an update, or maybe I got a defective unit. Hard to say.", "verified": true, "helpfulness": "0/1", "author": "Mainiac"}, {"rating": 3.0, "review": "I had trouble with the Fire Stick because our internet is too slow. Amazon sends it's programs at very high speeds so there was constant buffering. I was told that Netflix adapts it's speed to the speed of your internet and this streams much better.", "verified": true, "helpfulness": "0/0", "author": "Linda B"}, {"rating": 3.0, "review": "poor instructions if something went wrong. literally had to figure it out on your own.", "verified": true, "helpfulness": "0/0", "author": "Rick Stevens"}, {"rating": 5.0, "review": "I have been too bust to test, but it will probably make my DISK go away!!!!!", "verified": true, "helpfulness": "1/2", "author": "Bill W. Hogge"}, {"rating": 5.0, "review": "Great Netflix supplement", "verified": true, "helpfulness": "0/0", "author": "Rob T"}, {"rating": 1.0, "review": "I ordered the Fire Stick when it was first offered and received it as promised. However, I've not been able to get it to work on either of my televisions or on my friends (who has her own and loves it). I contacted Amazon to ask how to return for a new one, but they passed me off to someone else, who has not answered one of my emails since first contacting after Christmas. So, I've paid for NOTHING. All I want is a new one, since I think mine is defunct, but the customer service with the device is the worst part about it.", "verified": true, "helpfulness": "0/1", "author": "Kristi McKay"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Barbara A. Hoffman"}, {"rating": 5.0, "review": "bought this because the pre-order price was great, and I was not disappointed.  It's nicer than my roku, and I like that I can use my kindle as a remote if I can't find the remote, which is more often than I'd like with two kids in the house.  It loads faster, and the remote is more responsive than the roku player I have.", "verified": true, "helpfulness": "0/1", "author": "sarahy207 \"sarahy207\""}]