[{"rating": 3.0, "review": "Works very well for Netflix, but all Amazon content including Prime is limited to the US, which is a very big disappointment. The device is compact, though still very thick, which can be awkward to connect directly to your TV if you are using your other HDMI inputs. Fortunately it comes with an extension cord that solves that. The remote is also very sleek and useful.", "verified": true, "helpfulness": "0/0", "author": "Jorge Villalobos \"Metal fan\""}, {"rating": 5.0, "review": "Love the Firestick!  As a member of Amazon Prime we are able to view lots of prime movies and tv shows along with Netflix.  Were able to pretty much plug it in and voila!  Entertainment  on our big tv!  Well worth the money!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"daily reader\""}, {"rating": 1.0, "review": "not working wish to sent back", "verified": true, "helpfulness": "0/0", "author": "YVETTE CRUZ"}, {"rating": 4.0, "review": "We like it Its great for entertainment,", "verified": true, "helpfulness": "0/0", "author": "gale Pitasch"}, {"rating": 5.0, "review": "Easy to set up.  Easy to use.  I like the remote compared to Chromecast.  It lets me watch \"BOSCH\"", "verified": true, "helpfulness": "0/0", "author": "Dale"}, {"rating": 5.0, "review": "Great little device!  Outstanding usability with the simple pushbutton remote and excellent video and audio quality.  I bought this to use with my older, pre-smart, Samsung LCD due to the apparent abandonment of support for the Yahoo widget funtionality.  Now I get everything I had before and more.  Great value, I am very pleased with this device.", "verified": true, "helpfulness": "0/0", "author": "J. Ash"}, {"rating": 5.0, "review": "Price is awesome!  I gave two as thank you gifts.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far, so good. I got this free with the Sling promotion, and with my mildly low end internet speeds, the stick runs Sling far better than my desktop. People should definitely know to download the PBS application, as it has a ton of free content which has been my favorite part of the stick so far. It has hiccups, the menus seem as though they could be a little less clunky. While I probably wouldn't have bought this outright, I wouldn't be disappointed if I had.I'm sure other reviewers have noted, the stick actually needs to be plugged into an electrical outlet and it seems best to just leave it plugged in rather than charge it periodically. This was not something I realized just based on the product description, so if you're short on outlets, be aware!", "verified": true, "helpfulness": "0/0", "author": "autumn w."}, {"rating": 2.0, "review": "Easy to set up, discreet. Slow performance, kicks you out of your app during nearly every show to the home screen.", "verified": true, "helpfulness": "0/0", "author": "Lawrence"}, {"rating": 5.0, "review": "BEYOND EXPECTATIONS", "verified": true, "helpfulness": "0/0", "author": "ankarusskaya"}]