[{"rating": 5.0, "review": "Fabulous Device!", "verified": true, "helpfulness": "0/0", "author": "Pana-Retired"}, {"rating": 4.0, "review": "My experience was not good with the fire stick, I have since given it as a gift. The recipients are very happy with it, and have not had any problems.....", "verified": true, "helpfulness": "0/0", "author": "JJbean"}, {"rating": 4.0, "review": "A little more in the way of startup instructions and this would be a 5 star rating.. Took way too long to figure out how to set this up with my TV.. But once done it is great!", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Munn"}, {"rating": 5.0, "review": "this is better than the fire tv works very well own both like this one better", "verified": true, "helpfulness": "0/0", "author": "Helio"}, {"rating": 4.0, "review": "I've only been using it a couple of days and besides setting it up it works great.  For some reason, I thought the top HDMI slot would be #1 but when I put the stick in it, it changed to number #4, who knew.  Finding shows is easy, the remote is easy to use.  This replaces my Roku box and I would recommend this product for people who have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "SANDY GUSTAFSON"}, {"rating": 2.0, "review": "Does not support Miracast (arguably the best feature of this device) from all devices. And because of that, there is nothing that this device does better than an alternative. Dont waste your money.Edited to include more info:The fire stick does what it is advertised to do - but only barely enough to make the claim. Examples:1. Great for gaming, it has a few games on it, maybe as many as 20? It has the potential for gaming on it, but in actuality, it does not support the entire Android/Amazon appstore library.2. Connect your small screen to the big screen (Miracast) - doesnt work for all devices. Namely ANY modern Windows computer, a fair number of android phones (seriously, google: fire stick miracast problems). The ones that work are the fire phone, the kindle fire for sure - maybe some Samsung devices? Definitely no where near the support that you would expect from a Miracast certified device .3. Voice search that actually works (sold seperately - so I wont review that here).4. Powerful performance - when would you really notice this? During streaming? Its the same across all devices - yes it has more hardware but if this doesnt make a noticable impact - what good is it?As far as access to the Prime library of movies and music - you definitely do not need this stick to provide access to those - the chromecast does it, Amazon has apps on the Android for it, most \"smart\" devices have apps for it. So, ultimately, there is nothing this fire stick does that cant be done (possibly even done better) elsewhere.Ultimately yes, it does what it says - just like the MPG rating you see on cars is what you should expect to get, or the space advertised on a harddrive is exactly how much you are going to have available.", "verified": true, "helpfulness": "2/2", "author": "Sarah"}, {"rating": 5.0, "review": "The Fire TV Stick is everything it's advertised to be. It just plugs into your HDMI port, and then you plug into a power source. You can either use the adapter to plug it into an outlet, or if your TV has a powered USB port, you can use that.There are a ton of apps available, but the main reason I bought this was to have Amazon Prime on the big screen. And this tool works at it's best for that, with intuitive search and Prime only playlists. Of course, it's really simple to buy a movie or show too (so I suggest using a Pin to guard it against kids who might go on a buying spree).We also use it for Netflix. Previously, we were using the Wii. The picture is better through the Fire Stick, and it's easier using the remote than the Wiimote.You can download other apps too, like games, some of which work with the included controller and others that require the optional game controller from Amazon. I've tried out Badlands, a popular smartphone game, and it looks gorgeous on the big screen.If you have Prime Music or Cloud Drive (both come with a Prime membership) you can also listen to your playlists or view your photos and videos on your TV.As an iPhone user, I don't yet have an app to control the Fire Stick, though they say one is coming. I can cast YouTube videos, Prime videos, or Netflix videos from my phone to my TV easily right from those apps.All in all, I love this simple device. With just a few buttons on the remote, the kids have not trouble using it. Heck, even my wife can use it. The interface is very easy to use as well.This is a great media player, especially for Prime subscribers.", "verified": true, "helpfulness": "0/0", "author": "B Shimp \"Small business advice blogger at All Business Answers\""}, {"rating": 5.0, "review": "Very good and fast. I didn't expect it to be really fast. It also loads movies fast.", "verified": true, "helpfulness": "0/0", "author": "George Ioannou"}, {"rating": 5.0, "review": "I love it however i can not stream anything ftom my Apple phone. Thst sucks!", "verified": true, "helpfulness": "1/1", "author": "Ruptan"}, {"rating": 5.0, "review": "Good value for money", "verified": true, "helpfulness": "0/0", "author": "nivedita"}]