[{"rating": 5.0, "review": "Love being able to watch all my shows on Netflix, etc. and Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Ro Sandor"}, {"rating": 5.0, "review": "It very wonderful product, but the shipping is very expensive....", "verified": true, "helpfulness": "0/0", "author": "nebiyou"}, {"rating": 5.0, "review": "I originally ordered an amazon fire modem that did not work properly out of the box. Amazon is not set up to call for assistance so I returned the item and ordered a Firestick. The Firestick  hooked up and works perfectly so I am upset that I was not given a full refund for the original modem. I was sent a defective product and was not given a full refund.", "verified": true, "helpfulness": "0/0", "author": "Veronica Amenedo"}, {"rating": 5.0, "review": "Easy to hook up and use.  Outstanding addition to your tv", "verified": true, "helpfulness": "0/0", "author": "tom mcculley"}, {"rating": 5.0, "review": "I absolutley love the Fire TV Stick. it's so simple to install and start using right away that anyone can do it.  I have been using it for a week now and I enjoy the ease of watching my movies on the TV instead of my laptop. I have quite a few on my \"Watch List\" that i'm planning to watch with my granddaughters. The selection on the Amazon library it's great. I have not use the other options on the Fire Stick like streaming my pictures and home videos yet.", "verified": true, "helpfulness": "0/0", "author": "Yhoney"}, {"rating": 5.0, "review": "Much easier to use than Apple TV! A must if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "K. B. Moynihan"}, {"rating": 5.0, "review": "easy to set up and works very well", "verified": true, "helpfulness": "0/0", "author": "Jameson58"}, {"rating": 5.0, "review": "I have both the Fire TV Stick and the Fire TV.  I got both the week they came out and actually enjoy using them both.I can say the Fire TV stick for me has been just as good as the Fire TV for streaming both TV ( I don't play games on these devices)The ONLY thing I like about the Fire TV vs. the Fire TV stick is that the Fire TV has an Ethernet port.  I have good wifi coverage in my home but I always prefer wired when possible.", "verified": true, "helpfulness": "0/0", "author": "Brian McL"}, {"rating": 5.0, "review": "It was easy to set up and we love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Having a remote is nice that way my phone or tablet is being taken by my kids when they want to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Heidi Bisaha"}]