[{"rating": 5.0, "review": "Easy to use, great connection and so many possibilities.Great buy and must have for the single person or the entire family!Games, Music, pictures, movie, tv and more!", "verified": true, "helpfulness": "0/0", "author": "tristan"}, {"rating": 5.0, "review": "I love it. No need to get a smart tv now.", "verified": true, "helpfulness": "1/1", "author": "Jose Camacho"}, {"rating": 5.0, "review": "I've got the fire tv console and now the fire tv stick. While the stick is not quite as quick or powerful, it is much more portable.", "verified": true, "helpfulness": "0/0", "author": "Omni"}, {"rating": 4.0, "review": "Love this set-up! Very easy to install and use. Only downfall is the remote is so super small it is easily lost. Especially with a 3 year old in the house:)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love our new Fire Sticks!!!  Works perfectly as described, we bought 2!!!Thank you Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Great. .....", "verified": true, "helpfulness": "0/0", "author": "LB"}, {"rating": 5.0, "review": "I use it all the time love it", "verified": true, "helpfulness": "0/0", "author": "Krystal Soler"}, {"rating": 5.0, "review": "The Fire TV Stick has worked excellently. It has certainly made Google Prime really a joy for all of the instant video's and rentals. It is a extremely easy to use.  What more can I say.", "verified": true, "helpfulness": "0/0", "author": "JWJ"}, {"rating": 5.0, "review": "Fantastic value.....great little product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I rate this at only 3 out of 5 because, although the product in and of itself is satisfactory, it does not adapt to those subscribers that suffer from a low speed DSL location. My physical address sits near the end of the DSL line, therefore we are stuck with low quality and sometimes interrupted streaming at times. After many years of complaints lodged with our ISP, there is nothing more we can do. We do not live in town, so cable is not an option, and satellite is not the best deal for us either.With my laptop, it adapted by adjusting the quality of the feed, which I can live with.The Stick is not capable of such a function, (hence the on-screen warnings of low speed connection) and should be. It's fortunate I only spent $20 instead of full price.", "verified": true, "helpfulness": "0/0", "author": "Phillip Sumpter"}]