[{"rating": 5.0, "review": "Great!!!! I like it it's nice easy to use easy set up good movies and it work with netflix", "verified": true, "helpfulness": "0/0", "author": "Michael Smith"}, {"rating": 5.0, "review": "This is so easy to use.  Not only could my kids figure it out, I could too!!", "verified": true, "helpfulness": "0/0", "author": "diggataco"}, {"rating": 5.0, "review": "Great product Amazon! Best streaming device for the price.", "verified": true, "helpfulness": "0/0", "author": "Mister"}, {"rating": 4.0, "review": "It works great.", "verified": true, "helpfulness": "0/0", "author": "Lailonie"}, {"rating": 5.0, "review": "very good", "verified": false, "helpfulness": "0/0", "author": "richard hyatt"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "dan ruetz"}, {"rating": 5.0, "review": "Haven't used it yet but came as expected", "verified": true, "helpfulness": "0/0", "author": "Chuck Snider"}, {"rating": 5.0, "review": "My brother in law wanted this for Xmas so he got it.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "madison resident"}, {"rating": 3.0, "review": "I've had the Fire Stick for about a month and have been debating on what rating to give it. Our household has many Chromecasts, which when we first got were a bit buggy, but now are pretty solid after updates. We were excited to give the Fire Sticks a try because of the remote and so we could watch Prime videos. Setup is super nice and easy and the remote works well; it IS nice not to have to use your phone for everything.I was a bit disappointed to have to pay for the Plex app. Overall, things work pretty well. Playback on all apps is a bit glitchy. At first, there would hiccups, and the sound would buzz for a second. This happened in Netflix, Amazon, and Plex. We hooked up the second fire stick we have and it had the same issues.After an update, the sound buzzing has gone away, but the hiccups have not. We also had an odd issue of a video on our Plex not playing sound on the fire stick (pre-update). It played perfectly on our computer, on our phones, and through the Chromecast.Even with all of its flaws, we typically use the fire stick over the Chromecast because of the remote.", "verified": true, "helpfulness": "0/0", "author": "Alicein Wonderland"}]