[{"rating": 5.0, "review": "So far I have two of these and they are amazing.  Plug it in, it connects to your wi-fi.  Amazon Prime and your other entertainment apps are there.  The only negative I can find is I have been unable to download VUDU, but this is ok because most of my VUDU movies are in flixter.  Fire TV stick is portable, so its great .  Comes with a remote, and your phone can also be used as a remote.  Setup is so easy, it's ridiculous.", "verified": true, "helpfulness": "0/0", "author": "ct_nite"}, {"rating": 5.0, "review": "Pretty Cool device, really liked that it was ready t go out of the box! The App for my tablet is useful and so far Love this stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it, I'm having so much fun with it!", "verified": true, "helpfulness": "0/0", "author": "Connie Staley"}, {"rating": 1.0, "review": "At times problem connecting to internet, requiring removing device from TV  and reconnecting.  Happens despite the fact that the internet networkis working properly.", "verified": true, "helpfulness": "0/0", "author": "Catherine Fuchek"}, {"rating": 4.0, "review": "Love it - it doesn't get much simpler than this! And the app to control from your smartphone is the bomb too!", "verified": true, "helpfulness": "0/0", "author": "DAB"}, {"rating": 5.0, "review": "I bought two of these when they were on sale.  Does a great job streaming the Amazon Prime.  No problems for me with the device.", "verified": true, "helpfulness": "0/0", "author": "Chris Waggoner \"waggs\""}, {"rating": 5.0, "review": "The best purchase ever, plus you won't get bord.", "verified": true, "helpfulness": "0/0", "author": "Artur semedo"}, {"rating": 4.0, "review": "Variety of options & look forward to learning about the different features.", "verified": true, "helpfulness": "0/0", "author": "MLS"}, {"rating": 4.0, "review": "if you do not have a smart TV this will make it one I like it but you still have to pay for the apps and some movies even though you have a subscription to prime but it's a great product to make a TV that is not a smart TV one", "verified": true, "helpfulness": "0/0", "author": "Lucann Conyers"}, {"rating": 5.0, "review": "The device and installation instructions are great.  Had a great time first two nights watching. Got all snuggled in to binge watch Paradise tonight and it just wouldn't connect. Kept saying try again. After a half hour I gave up. I hope this doesn't continue as I love the selections available. .....", "verified": true, "helpfulness": "0/0", "author": "Stanlee K Hodsden"}]