[{"rating": 2.0, "review": "Disappointed in the limited TV shows and movies included. Still haven't figured out how to access Netfix from it. Was not what I had expected at all.", "verified": true, "helpfulness": "0/0", "author": "Stacy"}, {"rating": 4.0, "review": "Always had to reset my wifi connection with my smart tv. Much faster and reliable. Very easy to use netflix and amazon prime. If you have netflix and prime well worth it (note you will need to download the apps and they are like zero value purchases). You think you can just click on netflix and go but you need to get the app from amazon first.", "verified": true, "helpfulness": "1/1", "author": "Jeremy Curley"}, {"rating": 5.0, "review": "Very easy-to-use!!  Highly recommend it to anyone!!", "verified": true, "helpfulness": "0/0", "author": "Vicky McKay"}, {"rating": 5.0, "review": "I removed all of my movie channels from Dish .. I'm really enjoying the freedom of only paying for movies I want to watch and it's not costing me an arm and a leg. I ordered another Fire Stick for the living room", "verified": true, "helpfulness": "0/0", "author": "Cocokises"}, {"rating": 5.0, "review": "Sure, it met my expectation and more, therefore, I rate it as a five star.", "verified": true, "helpfulness": "0/0", "author": "Carroll Johnson"}, {"rating": 5.0, "review": "Awesome!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Use it on tv in kids room, loads in a reasonable amount of time and can access apps for channels we have on our cable plan, so if she runs out of prime movies and shows, we have hbo go, Disney and a few others I can't remember off the top of my head. Cheaper than renting another cable box. I also did not realize that I can monitor what's being watched via notification on my fire phone. Definitely worth $40", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  Watching some great movies!", "verified": true, "helpfulness": "1/1", "author": "Rose Bobak"}, {"rating": 5.0, "review": "I really like the fire stick.  We run Netflix through our wireless dvd players in our other rooms, but tried the fire stick for our downstairs tv.  I like it much better than using the dvd players.  There are more options and the prime movies/ tv are great additions to having in addition to Netflix.", "verified": true, "helpfulness": "0/0", "author": "R. Miller"}, {"rating": 4.0, "review": "The Firestick works great and streams the video signals really well. The Amazon content in particular loads very fast. The SlingTV app is a little clunky and is not programmed intuitively like the Amazon content. The controller is good but the click wheel at the top is too sensitive and often overshoots the targeted selection. Overall it has been a good purchase, though.", "verified": true, "helpfulness": "1/1", "author": "Chris Mason"}]