[{"rating": 5.0, "review": "I simply love this item!  I used to have to rig up my Kindle Fire to my TV and then go over to the TV where my fire was in order to pause it or whatever.  With this I now have Netflix, Hulu, Pandora etc.  I am so happy!!!  I use it every day.", "verified": true, "helpfulness": "0/0", "author": "Rebecca S. Robertson"}, {"rating": 5.0, "review": "This is no fuss - no muss TV.  Just connect to your TV, sign on to Amazon (need WiFi to do this) and change to appropriate program setting.  Comes with a help setting if you need help navigating - but I hardly use it because it's pretty straight forward.  No more TV watching on the iPad at home - I can just turn on the TV for commercial free Netflix or Amazon Prime.  My husband has also downloaded a bunch of channel apps to our menu so we have PBS, History Channel and others - all free.I say network TV is trouble - who needs cable?", "verified": true, "helpfulness": "0/0", "author": "J. Canela"}, {"rating": 5.0, "review": "This was a Xmas gift for me and I was delighted to receive it. So far it has delivered as promised. It took me a little longer to get it enabled with Netflix(I admit I am not tech savvy), now it is working well. I am also just about ready to cut the cable cord or at least down grade.", "verified": true, "helpfulness": "0/0", "author": "Freda"}, {"rating": 1.0, "review": "Doesn't work...........", "verified": true, "helpfulness": "1/3", "author": "Annie Beth \"Callie\""}, {"rating": 4.0, "review": "Easy set-up.  Love the easy access to Netflix and pandora through the TV.  Great if you don't already have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "eeeve"}, {"rating": 5.0, "review": "Could not believe how easy it was to install. Started watching movies after I was able to get the remote away from my son. He will be getting one now. I am really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "LBrooks"}, {"rating": 5.0, "review": "Very happy with my Fire TV Stick .Things have realy come along from the 30ties.LOL", "verified": true, "helpfulness": "0/0", "author": "William J Yamen"}, {"rating": 4.0, "review": "Great little hard to hook up tho", "verified": true, "helpfulness": "0/0", "author": "Lorie J. Betlyon"}, {"rating": 5.0, "review": "Works just as advertised.  Easy to use. It gives instant access to Netflix and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Eric Stanford"}, {"rating": 5.0, "review": "I love being able to watch Prime TV and movies on our large HD TV!  Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Reader Ann"}]