[{"rating": 1.0, "review": "Received it today. Plugged it in and it does not work. Hangs on the network screen. You would have thought that the product team did a better job testing it out. From the numerous reviews here it appears they did not. I'm sure it will work fine when I can finally get it to work.", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 4.0, "review": "Pretty cool..", "verified": true, "helpfulness": "0/0", "author": "Kevin Britain"}, {"rating": 3.0, "review": "Waiting a month to get it was unexpected. Worth the 20 I paid. Nothing special about device.", "verified": true, "helpfulness": "0/0", "author": "Phillip Noonkester"}, {"rating": 5.0, "review": "Amazing, easy to use", "verified": true, "helpfulness": "0/0", "author": "Jiamei Li"}, {"rating": 3.0, "review": "Only gives you a little to watchyour choices are very limited", "verified": true, "helpfulness": "0/0", "author": "Len Hedrick"}, {"rating": 5.0, "review": "YES", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "I love it, no comparison to the chromecast", "verified": true, "helpfulness": "0/0", "author": "Andre Burnett Jr. \"Dré\""}, {"rating": 5.0, "review": "Works great. I like using it for Amazon Prime TV better than the Roku I had. Set was easy.", "verified": true, "helpfulness": "0/0", "author": "Please in Ohio"}, {"rating": 5.0, "review": "This is pretty much the same as a Fire TV as far as i can tell, but in a cheaper stick form.  A bit slower of a processor and half the memory of a Fire TV but it has performed flawlessly for everything we want to use it for!", "verified": true, "helpfulness": "0/0", "author": "G. Valentine"}, {"rating": 4.0, "review": "Fairly easy to set up, but battery compartment a little hard to open. Lots of viewing options. The additional power cable used by the Fire TV Stick was a surprise and not advertised...a bit of clutter for this otherwise compact device.", "verified": true, "helpfulness": "0/0", "author": "F. Degroodt"}]