[{"rating": 2.0, "review": "I like the idea of this. Super user friendly and the remote is an upgrade to normal blu ray players when trying to stream content. However, I constantly have issues with it randomly shutting off or not starting at all. When streaming content it sometimes just says it can't connect to the internet but there are no connectivity issues. Never had any problems like this with my blu ray player. Frustrating, wait until an updated version of this comes out with some more bugs fixed.", "verified": true, "helpfulness": "0/0", "author": "brittany mann"}, {"rating": 5.0, "review": "If you have Amazon Prime,  this is a must have!", "verified": true, "helpfulness": "0/0", "author": "luckyajc"}, {"rating": 2.0, "review": "The playback quality is very good but this is where the good ends.  The remote response is poor and this cause stacked commands.  The selection of apps/channels is lacking and many of my favorites are missing. I am going to keep this in the hope that as the product matures both of these issues will be remedied. I have 5 Roku players and if you are happy with your Roku, I would not make a change at this point. These issues are just part of product evolution and I am guilty of being an early adopter so I will soldier on.", "verified": true, "helpfulness": "0/0", "author": "David Robert Dozier"}, {"rating": 5.0, "review": "If you have Amazon Prime, it seems like a real no brainer to have the Fire TV Stick as well.  Much easier to use with the TV than my laptop.  Only complaint is that I would like better search capabilities.  Finding what I'm looking for can sometimes be awkward.", "verified": true, "helpfulness": "0/0", "author": "M. Goldman"}, {"rating": 5.0, "review": "Amazingly easy to set up and use - very intuitive. I returned a Google Chromecast in exchange for this and I have no idea why anyone wouldn't choose Amazon Fire Stick - no need to connect to a tablet or phone, just your wireless internet.", "verified": true, "helpfulness": "0/0", "author": "ThreeTorties"}, {"rating": 3.0, "review": "I will continue to use the fire tv stick but it dose have some bugs that need attention.", "verified": true, "helpfulness": "0/0", "author": "Richard B. Doyle"}, {"rating": 5.0, "review": "I couldn't be happier with it!  I was a bit hesitant to \"cut the cord\" but, considering the cost-to-benefit along with Prime Membership, it can't be beat.First and regarding the Prime Membership (getting the Fire TV Stick pushed me over the edge), the two-day shipping is a great perk if you haven't had it before.  If you were like me, you waited until you had enough stuff in your shopping cart to qualify for free shipping.  Now, it's not a concern and I receive the items post haste.  Add that to free movies, TV shows, and music and we have a winner.  Averaged out over 12 mos, the cost of getting prime is a little over $8 per month--similar to Netflix and other streaming services.  However, add in the music and the free, two-day shipping, and it can't be beat.  While I can't exactly say it has every movie or show--or for that matter, live, local sports--Prime has enough to keep any Movie/TV junkie happy and cable-free (at a greatly reduced cost, I might add).As to the Fire TV Stick itself, while you can use a tablet or smart phone to act as a remote, I prefer the simplicity of the remote and being able to feel buttons (as against an icon on a screen).  Further and for those like myself who listen to music in different rooms, it doesn't require line of sight to work--so you can jump past soundtracks you don't like.  The stick is a neat toy--but to make it something worthwhile, something of value--you need to accompany it with that Prime Membership.And there's nothing like the thought of reducing the amount of scratch you used to pay the cable company for lousy movies.", "verified": true, "helpfulness": "0/0", "author": "Harvey D. Fern"}, {"rating": 5.0, "review": "Love it... Easy setup and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 2.0, "review": "I purchased the Fire Stick to watch Netflix. So far, I haven't been able to watch it. It never loads. It shuts off or just spools and I have to reboot. I wish I had read the other reviews before I purchased it. Everyone seems to be having this problem. I really should have just sent this thing back. I think it's too late now.", "verified": true, "helpfulness": "0/0", "author": "MsS"}, {"rating": 3.0, "review": "I was really excited to get my Fire Stick, however it doesn't seem to work all of the time. It will ask if my internet connection is working, or if it's connected at all, and then like that...I'm kicked off completely.I really don't know what else I should do to trouble shoot a problem that I'm not really having.Help!", "verified": true, "helpfulness": "0/0", "author": "candice elizabeth lane"}]