[{"rating": 5.0, "review": "nice remote, nice setting", "verified": true, "helpfulness": "0/0", "author": "Iris Huang"}, {"rating": 4.0, "review": "I initially had my qualms regarding this product, I have own the chrome cast dongle and really haven't found much use out of it.  However when I saw this item go on sale and saw that it had a remote, I thought why not.  Upon receiving it, the biggest wow factor for me was the remote app that you can download to your cell phone.  This remote app works flawlessly and allows you to control the fire tv stick using your cell phone!!!  Although the product has some limitations in terms of it's usage, especially for those who do not have prime, but overall it is a great product that I hope to see new apps come out.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 1.0, "review": "The device does not work properly if it is not plugged in directly to the TV. What this means is you cannot watch movies using Amazon instant watch or Netflix when the device is plugged in through a receiver. This is not an issue with other devices such as the Roku player or the Chromecast.Bottom line, if you want to use a stereo receiver with the fire stick then it will not work well.", "verified": true, "helpfulness": "0/1", "author": "Philip Schulz \"AudiologyRocks\""}, {"rating": 3.0, "review": "When we first started using it I would have given it a 5.  The ease of hooking up, setting up the wireless connection and having access to the different applications was great.  However, after only a week we've been having problems with the remote control buttons.  The buttons seem to skip and instead of going to the next movie or back one it skips a few or even goes on auto.  The only way it works now is with the phone app which only works on my phone (Android) not my wife's (IPhone).  Overall it still does what it sets out to do but the remote was one of the big reasons we got it (instead of using our WII).Pro:-  Easy access to Amazon Prime, NETFLIX and other applications-  Ease of use and set-up through wirelessCons:-  Remote malfunctions defeat the entire process", "verified": true, "helpfulness": "2/2", "author": "Cgot"}, {"rating": 5.0, "review": "FireTV Stick & AirPlay/DLNA Receiver (Pro) App saved me a bunch of money!I was going to buy additional Apple TVs/Chromecasts to use on my bedroom and office TVs but this helped me save a bunch! $200 for 2 Apple TVs or $70 for 2 Chromecasts? How about $50 for 2 Fire TV Sticks (during the sale) and AirPlay/DLNA Receiver Pro App to do basically everything the Apple TV could do for a fraction of the cost and got a physical UI and remote instead of the lifeless Chromecast.I primarily use my TVs to mirror or beam my music videos from my iPhone or iPad, this and the App helps make that possible.The physical UI is pretty good for what it is and the remote to control it is more practical and useful than the Apple TV remote.  I leave mine on with the aquarium or fireplace apps when i'm not watching anything and it helps create a nice ambience in every room.  Then when I have a party, I do Airplay to mirror music videos on all my TVs...There aren't that many apps that are available for it yet but its more than sufficient for what I use mine for (YouTube, Netflix, Hulu Plus, Prime Videos, etc...)  Prime Videos are front and center and are already included with my Prime Membership so that is good.  The games are ok but I didn't buy this for that purpose.  The form factor is just right for my flat TVs and since they all have built in USB ports, I don't need to run the power cable down and there aren't any clutter.Highly recommended if you want or need to add AirPlay/DLNA capabilities for cross platforms as well.  If there is something that you want to be compatible, they might have an app for it or will have one down the road.  Apple TV, you get what they give you.  Chromecast, most things work with it but no physical UI to work with and no physical remote to use when you have your phone phone or tablet charging....Would buy again if I need more!", "verified": true, "helpfulness": "0/0", "author": "PhiESS"}, {"rating": 1.0, "review": "Setup was painless.  No app to be found that will stream my media is built in.  I thought the plex client was supposed to be bundled.  Guess not.  Found it in apps, $4.99.  Huh?  I own plex pass.  I thought my plex pass, my support of the product while it was still in development, my putting up with alpha software was supposed to be rewarded with free apps.  I guess that that contract is just another lie.  And don't nag me with cheapskate comments about the price.  I'm tired of LIES.Anyway, I sideloaded Kodi on it and now all it does is hang every time I try to stream audio.  Now I have another useless streaming device to stick on a shelf.All I want to do is be able to put on a podcast at night or an audio book, fast forward to where I fell asleep the previous night and let it play.  To date there isn't a single reliable app that will do that outside of my HTPC which has the WORST collection of remotes available to man.  Fast forward, that technology is what, 50, 60 years old or more and the geniuses out there coding can't pull that off.  Oh, wait, I guess I'm in the episode of Black Mirror where I can't fast forward without incuring a penalty.I'm going back to Analog.", "verified": true, "helpfulness": "0/1", "author": "Hard2Please"}, {"rating": 1.0, "review": "The stick connected to my network, but was unable to connect to Amazon. My network is not the issue. I spent 45 minutes on the phone with two Amazon techs who didn't seen to know what to do. Then the phone line went dead--and they never called back. Very frustrating as I waited almost 6 weeks for it to arrive. Not sure what to do at this point...12/30 update: So it took their 2nd level support a week to figure out the next steps and reply to my email. They suggested I used my phone as a hotspot. When I did that, the Fire Stick was able to connect to Amazon and download a software update.  After that, I was able to successfully connect to my home network.  All seemed to be working well.  Then the Fire Stick lost connection with my network every 20-25 minutes.  This was a continual problem, and very annoying when trying to watch a movie.Long story short, the problem could not be resolved, even after sending a replacement device.  I expect the Fire Stick had connectivity issues with my router.  I was very surprised by the skills (or lack thereof) of the Amazon Fire tech support team.  All the first and 2nd level techs did was repeat the same steps over and over --> power down the device, unplug the router, etc. They really seemed to have no idea about what was going on.  After about 6 hours of wasted time, I decided to send it back for a refund.Unfortunate, because I really wanted to use this. When it did work, it was great. Time to buy an AppleTV.", "verified": true, "helpfulness": "8/10", "author": "S.R."}, {"rating": 3.0, "review": "So far, not very impressed. For the hardware this thing has, it should run a lot smoother. It is very choppy, with delays between button press on the remote and actual action on the screen. It also seems to need to buffer a lot. I had a Chromecast before and it actually worked better. I hope the Fire TV Stick is updated and improves because I do like being able to stream the Prime video.", "verified": true, "helpfulness": "1/2", "author": "Michelle H"}, {"rating": 4.0, "review": "Amazon has done a good job by nicely packaging the product and presenting it to the user with a short video that introduces the main features, screens and options available. Next, when the device is ready for use, after it has linked to the WI-FI (user enabled access) and some necessary configurations, then the Main menu screen shows up and makes sense to the user right away.  Everything seems to be shown in Hi definition. That makes a big difference. Wii-Fi Access is user's equipment dependent, so I can't complain much about it. But, I wish I do not get the occasional freezes, like I do get sometimes. For the most part, I enjoy all the additional fun I have found by using this TV stick: Movies, TV programs, Apps and much more. I have kissed the cable company good bye for a long time already, and this device will make my entertaining time for fun every day. I hope one day, I will also get access to PBS, Aljazeera, and some local channels as well. I have CBS news for now, not bad.", "verified": true, "helpfulness": "0/0", "author": "eTech4Hire \"eTech\""}, {"rating": 2.0, "review": "I ordered this stick two months ago because Chromecast didn't support Showtime Anytime.  Since then, Google has added Showtime to their list of compatible services.  I figured I'd still get the Fire Stick and try it out because I have a Prime account (even though I can use my Xbox 360 to access Amazon).  I installed and tried to set up Showtime Anytime.  However, DirecTV isn't supported through this device.  The Amazon app claims that it's DirecTV's fault, but I can cast Showtime to my Chromecast using my DirecTV account.  Xfinity/Comcast is also listed on Showtime's site, but it's not listed as a valid provider through the Amazon app.  Apparently, Amazon doesn't want to support the top two cable/satellite providers in the United States.", "verified": true, "helpfulness": "1/2", "author": "Lawrence Lamb"}]