[{"rating": 5.0, "review": "It's Great! Easy to set up! Easy to use! Affordable!", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 5.0, "review": "Thank you!", "verified": true, "helpfulness": "0/0", "author": "davidj"}, {"rating": 5.0, "review": "Excellent product. Greatly expands your viewer options, is easy to install, has a very simple remote and is inexpensive. I am sorry that I waited so long to make this purchase.  Whether it's movies, kids programming, television shows or original programming-this is the way to go. I'd give it 6 stars, if that were possible.", "verified": true, "helpfulness": "0/0", "author": "Richard E. Berman"}, {"rating": 5.0, "review": "just installed it. I'm impressed.", "verified": true, "helpfulness": "0/0", "author": "zambni"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "cleanjohnny"}, {"rating": 5.0, "review": "I am surprised how well this works.  I use it on my TV that is in my home gym, and the router is on the other side of the house.", "verified": true, "helpfulness": "0/0", "author": "jeffrey holloway"}, {"rating": 5.0, "review": "Awesome! I received this as a Christmas gift and I have been enjoying it with my tv.", "verified": true, "helpfulness": "0/0", "author": "Mary M. Ovalle"}, {"rating": 5.0, "review": "Easy to install and activate; easy to use; minimal physical profile (it's SMALL).  Really like access to Amazon Cloud Storage, as -- with Amazon Prime -- I can store photos for free AND VIEW THEM ON THE TV.", "verified": true, "helpfulness": "0/0", "author": "M. Boyd"}, {"rating": 4.0, "review": "We got two when Amazon sold them for 20 bucks. They worked perfectly ever since. Yes Amazon is trying to push their content (it is an Amazon stick after-all), but it has a good selection of channels (at least by our preferences) and it is quick to connect and play content. For the price paid, this is great gadget. At current price I might think twice before purchasing it.", "verified": true, "helpfulness": "0/0", "author": "Sebas"}, {"rating": 2.0, "review": "The First TV Stick at initial setup was wonderful. It connected to my WiFi just fine, went to sleep, then no longer was able to connect to WiFi. I have a Cisco 1142 with WPA2 and dual band. Tried using a different access point under a different SSID, and it works flawlessly every time.  This is the only device i have ever experienced an issue with and we have tested over 30 different brands/styles of devices on our WiFi.The device has too many features to return, but this truly is an annoyance that i need to run another access point in order to utilize this device.  Please force an update or come up with a fix!I am giving this 2 stars because nobody ever reads 3 star reviews, and this anomaly needs to be resolved!", "verified": true, "helpfulness": "0/1", "author": "Michael Prostka"}]