[{"rating": 5.0, "review": "Amazing. Get one", "verified": true, "helpfulness": "0/0", "author": "john danielson"}, {"rating": 5.0, "review": "Very simple and works well", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 4.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "finger pickin"}, {"rating": 4.0, "review": "Overall...great device for the price.  For those with minimal tech skills...that's us!...it's a great way to get video on Prime, Netflix, etc.  Those with higher skills may find it too basic.  We aren't gamers so cannot speak to that.Pros: Simple to set up.  Simple all around...ideal for us.Cons: A tad glitchy at times...nothing that impacts viewing particularly but a bit odd.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Does everything flawlessly and as described. Only thing I would change is more customization options, other than that best dingle on the market.", "verified": true, "helpfulness": "0/0", "author": "Q Boogie"}, {"rating": 5.0, "review": "Perfect.  Easy set up.  Does everything it says it would.", "verified": true, "helpfulness": "0/0", "author": "Mels23"}, {"rating": 5.0, "review": "Great ! I wish I could bought it earlier. Use it to watch Amazon Prime, NetFlix and Youtube and they all work great.", "verified": true, "helpfulness": "0/0", "author": "bearone"}, {"rating": 5.0, "review": "I was amazed at how simple it was to install and how clear the picture is. Can't wait for my satallite contract to end so that I can really start to save money.", "verified": true, "helpfulness": "0/0", "author": "paula fagan"}, {"rating": 5.0, "review": "The Fire tv stick is amazing I have all the channels I watch and the apps work great.", "verified": true, "helpfulness": "0/0", "author": "shaday adams"}, {"rating": 5.0, "review": "The Best, I tried chromecast and I was not happy too much buffering. i tried the one that came with my samsung tv though it was better than chromcast it still was not seemless. The Amazon Fire Stick is the best very happy with it and for the price you can not lose.", "verified": true, "helpfulness": "0/0", "author": "William Garcia"}]