[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Melissa Johnson"}, {"rating": 5.0, "review": "We only got it hooked up a couple day's ago and we enjoyed two movies thus far... I'm sure we are going to love it.", "verified": true, "helpfulness": "0/0", "author": "Dreamer"}, {"rating": 5.0, "review": "Actually faster than my dvd player/ streaming device that i bought for twice the amount. Very happy with this little gadget and the amount of content included on amazon prime is just amazing. It really is worth the 8 bux a month for free two day shipping nd free tv/movie/music content.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "I love it. Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "kelly emberton"}, {"rating": 4.0, "review": "Very fast and much better interface than my smart TV or blue ray.", "verified": true, "helpfulness": "0/0", "author": "Charles Snellings"}, {"rating": 5.0, "review": "Works great we love it...", "verified": true, "helpfulness": "0/0", "author": "Elisa"}, {"rating": 2.0, "review": "I was very happy with the Fire Stick for the first 3 months I owned it.  Today my grandchildren come over and they want to watch Nicelodeon and all of the streaming shows that were free before are now $2. All Disney streaming $2. Lets see the first (and only the first) season of Dora was free.  I am a Prime member and really not happy with the changes.  Seems like they suck you in with a great deal and then too bad we have now changed.", "verified": true, "helpfulness": "0/0", "author": "Mike D"}, {"rating": 3.0, "review": "This is a good device if you want to turn your tv into a smart TV. If your doing it to get HBO or other programs its pretty much the same price to just add it through your cable provider. I bought two of these one for myself and another as a gift for a prime member. They make good gifts and they are very versatile.", "verified": true, "helpfulness": "0/0", "author": "matt hawkins"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "rachel gongola"}, {"rating": 5.0, "review": "LOVE this, very user friendly. Good layout. WiFi is better than the Sony TV or the PS3.  Blue tooth method is a nice change too.", "verified": true, "helpfulness": "0/0", "author": "Keven VK \"Kev\""}]