[{"rating": 5.0, "review": "I have used every streamer.Western Digital TV Live, Roku, Chromecast, none come close to the FireTV stick.  It runs XBMC flawlessly, so playing movies from my NAS is a breeze.  The remote is very responsive. The mobile app is a must if you want to use the voice feature like the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Tarishma Bruster"}, {"rating": 5.0, "review": "I love using this stick to access the video and prime content that I can access on my kindles.  I have an older kindle and this keeps me from having to use the micro HD cable to hook my kindle to the TV.  I also have newer HDX kindles that allow you to \"fling\" what is playing on the kindle to the TV IF the TV has that capability, which mine do not.  However, with this stick the kindle simply asks me which \"Fire TV\" I would like to \"fling\" it to.  Once \"flung\" the kindle is free for use.  I have a Fire TV box and two of these Fire TV sticks.  Honestly, I can find no differences at all, except the remote that comes with the stick does not have the optional \"voice search\" that the remote for the Fire TV box has.  However, if you need that, you can download an app to your smartphone that is a \"remote control\" for these devices and it includes the voice search capability.  I should mention that I am not sure if these sticks support the game controller that the Fire TV box does.", "verified": true, "helpfulness": "0/0", "author": "ShellyP"}, {"rating": 5.0, "review": "should have purchased 2.", "verified": true, "helpfulness": "0/0", "author": "Frichard"}, {"rating": 4.0, "review": "The fire stick meets my expectations and some.  I'm happy with this product.  Since it is brand new it does seem to have some bugs, but still better than the google chrome AST.", "verified": true, "helpfulness": "0/0", "author": "Neil Patel"}, {"rating": 4.0, "review": "Very easy to set up and get started.  Very intuitive to use.  I have not had any problems so far.  Very happy.", "verified": true, "helpfulness": "0/0", "author": "s walcott"}, {"rating": 5.0, "review": "I love the fire stick. All have to do is connect the stick to the HDMI than plug it to the outlet and update and follow directions on the screen. Really nice just like the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Tobias"}, {"rating": 5.0, "review": "Got the Fire Stick for my daughter and she loves it! Thinking of getting another one when they're not back ordered", "verified": true, "helpfulness": "0/0", "author": "Rafael Hernandez"}, {"rating": 1.0, "review": "didn't like it.", "verified": true, "helpfulness": "2/8", "author": "Lakshmi Narayana Gupta Kollepara"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Robert Martin"}, {"rating": 5.0, "review": "It was a good buy. Good remote and the remote app on smartphone is fantastic. Only drawback is, can't cast videos from chrome based phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]