[{"rating": 5.0, "review": "Great addition to watch movies in other rooms of the house!", "verified": true, "helpfulness": "0/0", "author": "dk"}, {"rating": 3.0, "review": "Will play for awhile an then drop connection. I can be looking at a movie an then it would just stop have to start all over again I fill like I wasted my money but needed something to watch on TV.", "verified": true, "helpfulness": "0/0", "author": "Theodore H."}, {"rating": 3.0, "review": "The network is so slow, my laptop and Fire TV Stick are placed in a same position in the apartment, my laptop can load Netflix at maximum resolution but the Fire TV Stick loads the videos at a really low resolution (pixelated, blur), almost unacceptable to watch on a big TV.", "verified": true, "helpfulness": "0/0", "author": "Nhan Hoang"}, {"rating": 4.0, "review": "I do have a smart TV but this has enhanced my options for watching just about anything.", "verified": true, "helpfulness": "0/0", "author": "Wayne W. Thompson \"waythompson\""}, {"rating": 4.0, "review": "so far so good, fast and easy to navigate", "verified": true, "helpfulness": "0/0", "author": "leah clock"}, {"rating": 2.0, "review": "Wish it worked better! Had to return would not stay connected longer then a minute or two. Continually dropped the wifi signal when just a couple feet away. I could watch with my laptop all day long from the same wifi put the fire stick was useless. Really wanted it for travel, guess I will have to wait until they get all the bugs out..", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "I love my fire stick.", "verified": true, "helpfulness": "0/0", "author": "Olivia Skrimstad"}, {"rating": 4.0, "review": "Easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "gina"}, {"rating": 5.0, "review": "I was using my Sony Blue-ray.  The Fire Stick is a lot faster and easier to use.", "verified": true, "helpfulness": "0/0", "author": "James \"InIdaho\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Thomas Westerberg"}]