[{"rating": 5.0, "review": "The Amazon Fire Stick is better than the Apple TV, ROKU or any other device in its class....simply genious. GREAT JOB, AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Alex Kubik"}, {"rating": 5.0, "review": "easy to install, options, options options for quality viewing, highly recommend", "verified": true, "helpfulness": "0/0", "author": "karen barone"}, {"rating": 5.0, "review": "Fire Stick worked really well with my TV. It is nice to have another option to watch movies n tv shows other than on my computer. Iwould definately recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have all my movies from my plex, Netflix, Hulu and more. Small and out of site. The remote app on my iPhone works great as well. I'd recommend to all", "verified": true, "helpfulness": "0/0", "author": "Earl A Broyles"}, {"rating": 5.0, "review": "Works like a charm.  Set up a piece of cake. Watched Bosch on Amazon Prime. Great!", "verified": true, "helpfulness": "0/0", "author": "VirginiaGuy \"TryNew Music\""}, {"rating": 5.0, "review": "This little gadget is great!  I bought it (on sale, thanks Amazon!) to take the place of my older Roku device.  Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Christine Rowe"}, {"rating": 5.0, "review": "Very easy to use and great purchase", "verified": true, "helpfulness": "0/0", "author": "Jim Rubenstein"}, {"rating": 3.0, "review": "I love it's software, but please make more apps available outside the us. I live in Colombia and I am happy because I use it mostly for Netflix! Luckily it works.", "verified": true, "helpfulness": "0/0", "author": "Laura Duperret"}, {"rating": 4.0, "review": "I pre bought this when it was first available for Prime subscribers fo $19 and have used it for about 6 months.I own or have owned a Roku, Roku 2, Sony Google TV. LG Smart TV and the Firestick. I would rate the firestick above the Smart TV, Google TV and older Roku. In comparing the Roku 2 and Firestick, I find they pretty much the same in ease of use. Roku has better offerings but Firestick is faster and portable. I can easily take it on vacation and plug it into the hotel TV (if it has HDMI) and route through the hotel WIFI. The only downside for me is I can't get google play movies.Bottom line is the Firestick is a good choice for internet TV. Small, Fast and portable with decent channel offerings certainly worth the money if you have a DUMB TV.", "verified": true, "helpfulness": "0/0", "author": "frogwild"}, {"rating": 5.0, "review": "Great for HBO-Go, which has content not on-demand", "verified": true, "helpfulness": "0/0", "author": "Bart"}]