[{"rating": 5.0, "review": "So I bought the Stick when the first $20 deal came out, gave it to my mother for Christmas and she loved it.  She's tech leery, but had no issues using it right away.  After seeing it in action for a few weeks, I decided I needed to get one of myself as well.  My main reason was because I was having issues watching the WWE network on my Xbox 360.  The Fire Stick is running the WWE Network in a higher resolution than either my PC or Xbox, and much smoother play rate as well.Also, works great with my Nyko Playpad, even had instructions displaying for it at the pairing screen.  I think they knew that before the fire game pad was released, the Nyko was the most common Bluetooth used on the tablets.", "verified": true, "helpfulness": "0/0", "author": "MrCrobos"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Emilia G. Almeida"}, {"rating": 5.0, "review": "Still learning how to fully utilize fire stick, but have been watcfhing Amazon original series, movies and free tv!  I love it!", "verified": true, "helpfulness": "0/0", "author": "J. Stakem"}, {"rating": 5.0, "review": "Awesome, exactly what I expected, setup was easy.  The iphone app is good, but could use a bit of refinement.", "verified": true, "helpfulness": "0/0", "author": "Joseppey"}, {"rating": 5.0, "review": "I love it. It was quick and easy to set up and works like a million dollars", "verified": true, "helpfulness": "0/0", "author": "ana castillo"}, {"rating": 5.0, "review": "we Love it so easy to watch...its awesome", "verified": true, "helpfulness": "0/0", "author": "Janet Arnold"}, {"rating": 4.0, "review": "Great thing for someone on disability! Not really enough movies I love but great when you have nothing better to do!", "verified": false, "helpfulness": "0/0", "author": "Traci Sharp"}, {"rating": 5.0, "review": "We received our  Fire Stick today and it is really great!!!  I ordered a voice remote before I received my Fire Stick and It is so much fun to use. This was really a smart purchase......everything works great so far.  Amazon movies and Netflix  are our two favorites plus of course some of the apps.I do not write reviews very often but this was well worth reviewing.", "verified": true, "helpfulness": "0/0", "author": "Hummingbird"}, {"rating": 5.0, "review": "Outstanding!!!!!  This is probably the best \"bang for your buck\" that I have ever bought. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "Way exceeded all my expectations despite the research I did in comparison shopping.", "verified": true, "helpfulness": "0/0", "author": "Abe Chapman"}]