[{"rating": 5.0, "review": "This device works very well, very glad I purchased it. Previous attempts to stream video on the TV through Blue Ray Disk player were haphazard at the best. Wasn't expecting too much improvement on the stream in my older home as wifi streaming is always a challenge. The Fire TV Stick works unbelievably well. I've watched more streaming movies now than in the past. Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"eclectic buyer\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Rafael Gregorich"}, {"rating": 5.0, "review": "So easy to use!  Will buy one for each of our tv's", "verified": true, "helpfulness": "0/0", "author": "Charity T \"Luvinit219\""}, {"rating": 5.0, "review": "Super easy to setup, this is replacing my chromecast. Found it to be much more responsive and setting it up was easy (just like the chromecast). Menus are easy to navigate and overall I am very pleased with this. May get a couple more for birthday/holiday gifts.", "verified": true, "helpfulness": "0/0", "author": "The Oncoming Storm"}, {"rating": 4.0, "review": "Sometimes it buffers but overall good value", "verified": true, "helpfulness": "0/0", "author": "T. B. \"tbweld\""}, {"rating": 5.0, "review": "The item arrived as promised. Need more time to see if it will do ok. So far very nice little thing.", "verified": true, "helpfulness": "0/0", "author": "Marcus Antonio"}, {"rating": 5.0, "review": "I have a amazon prime and I have been using my LG WiFi tv to access Amazon videos.  I purchased this when it was offered at a very low price that was to good to pass up. I'm glad that I did.  My reception is much better the format is better.", "verified": true, "helpfulness": "0/0", "author": "janga"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "Helen M"}, {"rating": 4.0, "review": "It's awesome to watch Netflix on a screen larger than a Kindle or tablet. The selection of what's available on the Fire Stick was astounding. So worth the money!!!!", "verified": true, "helpfulness": "0/0", "author": "S Maberry"}, {"rating": 4.0, "review": "Really like the interface but it looks like it's a hack to get PlayOn to work.", "verified": true, "helpfulness": "0/0", "author": "RockNRollerDad"}]