[{"rating": 1.0, "review": "I have 3 tvs and have been using a Roku on all of them.  I have NEVER had a problem.  I got a new puppy that chewed one of my remotes so I thought I would give the Fire stick a chance.  This item is horrible!  It skips and skips.  The longer you watch tv, the more it skips.  It gets so bad that it resets itself.  Save yourself a headache and just spend a few dollars more and get a ROKU!!!", "verified": true, "helpfulness": "0/1", "author": "Jane"}, {"rating": 1.0, "review": "I already have a NETFLIX viewing agreement and bought this to view NETFLIX on my big TV via wifi, but after connecting to the internet,, I could not access it using the firestick link. I shoud have had a sign in prompt but none was there with no way to access NETFLIX.  VERY DISAPPOINTED only wanted one simple thing and this failed to perform.", "verified": true, "helpfulness": "0/0", "author": "Maurie Scott Getter"}, {"rating": 5.0, "review": "Fantastic! Love this. So compact, easy, and fast. Love the layout. No complaints. I bought two and I am thinking of buying 2 more!", "verified": true, "helpfulness": "0/0", "author": "Chris Saturia"}, {"rating": 2.0, "review": "Never could get it to work", "verified": true, "helpfulness": "0/0", "author": "scott morton"}, {"rating": 5.0, "review": "It works much better than any other streaming device's  I've used.", "verified": true, "helpfulness": "0/0", "author": "tim ramirez"}, {"rating": 5.0, "review": "Installed quickly without problems.  If you do not have a close AC outlet to the back of the TV, you may need an extension cord to connect the power cable of the Fire TV stick.  The remote is nice to use because it does not require line-of-sight to work.", "verified": true, "helpfulness": "0/0", "author": "ssondall"}, {"rating": 5.0, "review": "Great item for the price.", "verified": true, "helpfulness": "0/0", "author": "Sherri C."}, {"rating": 5.0, "review": "Really east to install and use", "verified": true, "helpfulness": "0/0", "author": "James B Vargas"}, {"rating": 5.0, "review": "Amazing.  I love amazon, and I love the firestick.  Moreso, I love that apple no longer has me pinched by the tail overcharging for everything.  Amazon is awesome.", "verified": true, "helpfulness": "0/0", "author": "Ben Dunwell"}, {"rating": 5.0, "review": "love the quality of picture and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Marjorie C. Fattori"}]