[{"rating": 5.0, "review": "easy to use, easy set up. I stopped paying for cable and switched to sling TV. The fire stick helps me save money.", "verified": true, "helpfulness": "0/0", "author": "sarah williams"}, {"rating": 3.0, "review": "It takes some getting use to but I love it so far", "verified": true, "helpfulness": "0/0", "author": "kandigurl"}, {"rating": 5.0, "review": "It was a chance purchase that was too good to pass up and experiment with the Fire TV Stick.  It's definitely better than the Chromecast that it replaced since it's a standalone system and isn't relying on an iPad or other device.  The Fire Stick definitely has given me an avenue to explore and appreciate what's available on Amazon Prime and it is now the gateway to a great deal of entertainment that I never took advantage of, such as Starz Play and Showtime Anytime, of which I'm already subscribed through my cable company.  The Apps are great and have nothing but good things to say.", "verified": true, "helpfulness": "0/0", "author": "Claudio R Vergara"}, {"rating": 5.0, "review": "I love it !!!", "verified": true, "helpfulness": "0/0", "author": "Yvette  Farias"}, {"rating": 5.0, "review": "After the initial install it works great. Streams quick, love the variety.", "verified": true, "helpfulness": "0/0", "author": "Heather Meason"}, {"rating": 5.0, "review": "It's is absolutely great!  I am watching now. Having the access to all the programming is wonderful. Best investment since becoming. Prime member. Thanks Amazon!!!!!", "verified": true, "helpfulness": "0/0", "author": "firstlady08"}, {"rating": 5.0, "review": "Wonderful!!", "verified": true, "helpfulness": "0/0", "author": "Bobby Greene"}, {"rating": 5.0, "review": "Still learning it ,but seems to be a great option to regular tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The Amazon Fire TV Stick was EASY to install and now I can stream.....without commercials!!", "verified": true, "helpfulness": "0/1", "author": "lois hurley"}, {"rating": 5.0, "review": "Love it, with Prime video it's great so many shows and movies to choose from. In my opinion it's way better then the chrome cast because you don't need a second device to send it from and the first stick has a remote", "verified": true, "helpfulness": "0/0", "author": "EMILLIAN ALEXANDER"}]