[{"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "jacrespo"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Cathy Newsom"}, {"rating": 5.0, "review": "Arrived fast, easy and quick setup.  LOVE it!  I was not using my prime video service hardly at all until this came.  I am still exploring all of the features, but it is GREAT!", "verified": true, "helpfulness": "0/0", "author": "george"}, {"rating": 2.0, "review": "It's slow to respond and freezes up. I know it's not the Internet connection because it's next to the router", "verified": true, "helpfulness": "0/0", "author": "Edgar"}, {"rating": 5.0, "review": "Impressive", "verified": true, "helpfulness": "0/0", "author": "Gregory K. Howard \"GK\""}, {"rating": 1.0, "review": "The connection drops constantly. It redirect to the network connection screen every few minutes and shows a strong signal then drops again as soon as you try to view anything. Doesn't work with Xfinity X1 system. According to Amazon Customer Service this is a known issue. Their advice was to downgrade my X1 router by disabling IPv6. All my computers rely in IPv6 for the strongest download speeds so NO I will not downgrade my router settings. Since the fire stick only works using the older IPv4 technology it's useless to me. I spent three weeks with customer support trying to get to the problem and now they tell me it's too late to return it after 4 weeks. WTF. In to the trash it goes. Don't waste your money.", "verified": true, "helpfulness": "1/1", "author": "J. Bostick \"gadget lover\""}, {"rating": 4.0, "review": "I use almost everyday to watch movies I gotta say it's really good for the price", "verified": true, "helpfulness": "0/0", "author": "victor sanchez"}, {"rating": 5.0, "review": "Works great! Turned my dumb TV into a smart TV. Now I can watch Netflix and Amazon Prime movies", "verified": true, "helpfulness": "0/0", "author": "Don Sislowski"}, {"rating": 4.0, "review": "It's great if you don't have a smart tv or gaming console", "verified": true, "helpfulness": "0/0", "author": "Juan lopez"}, {"rating": 4.0, "review": "Easy to install but am just getting familiar with it.  After watching a couple episodes of a program, there is a popup that says internet is slow, which causes the episode to freeze, \"load\", play, freeze, \"load\", etc.  Am on my way to live chat to find out if that's my issue or a norm for this equipment.", "verified": true, "helpfulness": "0/0", "author": "James F. Breeden, Breeden"}]