[{"rating": 5.0, "review": "The Fire TV Stick was easy to install.  It took only a few minutes.  So far I have watched an Amazon Prime movie, watched several You Tube videos, and listened to a few radio stations.  They all worked great.  It's inexpensive enough that I'm going to buy another stick to use on a different TV so that I won't have to disconnect it to move from room to room.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Schloeman"}, {"rating": 5.0, "review": "This is so awesome!!!! Very easy to set up. It works great!!", "verified": true, "helpfulness": "0/0", "author": "Chris Wilkins"}, {"rating": 5.0, "review": "Works great. Plugged directly into my Samsung TV without the HDMI extension cable. I use the iphone app as the remote and never touch the physical remote. The Amazon Instant Video and Cloud Music player apps work seamlessly. I haven't had any issues with WiFi disconnecting or the Fire Stick freezing, like some of the earlier reviewers have experienced. Smooth sailing thus far.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "ez install.....fast.....does everything it promises", "verified": true, "helpfulness": "0/0", "author": "Mid Stater"}, {"rating": 5.0, "review": "Let me start off by saying THIS PRODUCT DOES NOT REQUIRE YOU TO PLUG INTO TV THEN INTO WALL TO OPERATE. You may receive a low power warning when first plugging the stick into your tv with the usb powering it but the stick will continue to function just fine.Picture quality on my now 5yr old SONY Bravia tv is fantastic. Everything loads smoothly and I am currently enjoying my prime membership a lot more now.", "verified": true, "helpfulness": "0/0", "author": "Terence .J"}, {"rating": 5.0, "review": "I love this easy and so far it's great", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Koehne"}, {"rating": 5.0, "review": "The Fire TV Stick does exactly what I hoped it would do.", "verified": true, "helpfulness": "0/0", "author": "Dean Benschoter"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product and all the great services available through Prime on the fires stick!!", "verified": true, "helpfulness": "0/0", "author": "Kimberley Aposporos"}, {"rating": 5.0, "review": "This product is everything advertized.We are very pleased and have recomended it to many friends.", "verified": true, "helpfulness": "0/1", "author": "Sharla D vans"}]