[{"rating": 5.0, "review": "Love it!! Super convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "Really had doubts this would work but it DOES. I have high speed interned and connected to bedroom TV that has no cable connection. I get all my Amazon Prime and Netflix. Quality of movies/videos is great. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Lorilee"}, {"rating": 2.0, "review": "Disappointed. The Pandora app is constantly crashing/hanging. Youtube pairing doesn't work -- it just brings up the app and hangs. Unlike our older Roku, video streaming stutters often.", "verified": true, "helpfulness": "0/0", "author": "DS"}, {"rating": 2.0, "review": "it has netflix on it but it appears that the quantity of movies available is on the short side for example, I wanted to watch Morgan Freeman, Michael Douglas and Robert DeNiro in \"Last Vegas\" and it is not available, also no You Tube, it basically an apparatus for Amazon to try to sell you movies for $12.99 each.", "verified": true, "helpfulness": "0/0", "author": "Mrs Wiz"}, {"rating": 5.0, "review": "Works well Roku is good too", "verified": true, "helpfulness": "0/0", "author": "peter"}, {"rating": 4.0, "review": "i like it haven't gotten to into it to much tho works great", "verified": true, "helpfulness": "0/0", "author": "rick mclernon"}, {"rating": 5.0, "review": "I already had apps on my blue ray player to watch Amazon and Netflicks but I couldn't get the closed captioning to display for Netflicks.  This device gives me that option which is great!  Its fast and very intuitive.", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Joe Hampton"}, {"rating": 5.0, "review": "This was so easy to hook up. Very easy to navigate the remote. Love the fire stick, just wish Amazon Prime had better movies on Prime!", "verified": true, "helpfulness": "0/0", "author": "Kim Gillette"}, {"rating": 2.0, "review": "While attractively priced it did not work for me for multiple reasons:- the requirements are to have it plugged directly into a TV- It kept failing with the message \"HDCP unauthorized. Content Disabled\" when playing protected movies (worked well for everything else including trailers)I have tried all options whether suggested by customer support or forums, or amazon reviews including:- unplugging and restarting everything (tv unplugged from outlet, HDMI cables unplugged and replugged)- Making sure that it was plugged directly into the TV- switching HDMI ports- plugging it into a wall outlet (suggested by amazon support)and more. Protected content worked in the first day or so and then stopped working and never worked again no matter what I've tried.Finally, I have learnt after buying it that:- It does not officially support plugging it into a receiver (which I imagine is a majority of use cases)- It needs to be plugged in directly into a wall outlet (heard from Amazon support)Which are both in my opinion unreasonable requests for a consumer electronics product.I waited a month for possibly a software update but decided to return it and buy a Roku 3 instead.People may have more luck with the fire TV, but if you're looking for something to plug in your receiver (rather than directly in your TV) and that is trouble free I advise you to pass on this product - the price is attractive and the feature and the UI are great, but it's not worth the time you might waste trying to make the most important feature, watching amazon videos to work.Hopefully future versions will correct the flaws of the first version.", "verified": true, "helpfulness": "1/1", "author": "Dan Serfaty"}]