[{"rating": 5.0, "review": "Yes definitely", "verified": true, "helpfulness": "0/0", "author": "Brandon Foreman"}, {"rating": 5.0, "review": "Excelente producto", "verified": true, "helpfulness": "0/0", "author": "Minor C"}, {"rating": 5.0, "review": "Love love love the Fire TV Stick! We rarely watch cable anymore and always some new to watch! We also enjoy the games and apps! The one and only downside is that the remote is so small, we losee it quite often. But having the phone app I'd an awesome and convenient backup!", "verified": true, "helpfulness": "0/0", "author": "Kelly Gibson"}, {"rating": 5.0, "review": "Works great in my opinion.  No complaints.", "verified": true, "helpfulness": "0/0", "author": "kc1koolcat"}, {"rating": 3.0, "review": "Love it most of the time, but this is our second Firestick and at times it is hard to turn on and sometimes streaming stutters even when internet is strong. Not sure what the issue is...and I do miss having a live local news feed.", "verified": true, "helpfulness": "0/0", "author": "Bobbette Gantz"}, {"rating": 5.0, "review": "Exceeded my expectations, which were pretty high. Amazing little device!", "verified": true, "helpfulness": "0/0", "author": "Daniel L Allen"}, {"rating": 5.0, "review": "This works perfectly. So small it hangs behind the tv and we can't even see it.  Have had no issues. Streams all content great, and love the screensaver photos!", "verified": true, "helpfulness": "0/0", "author": "Kyle E. Harding"}, {"rating": 5.0, "review": "Just plugged it into an HD port and then connected power. It prompted me for wifi password. It automatically works with my Bose system. The image, sound and speed are perfect. Much better than the built in apps on my tv and much easier than google chrome I tried. I bought it to stream Amazon prime but now use it for all streaming", "verified": true, "helpfulness": "0/0", "author": "jmadigan"}, {"rating": 5.0, "review": "We bought this for our summer home on an island, where the only choice in television is direct TV.  WE love it!", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 2.0, "review": "Side loaded app should show up on the main page also.Apps and games are lacking in selection", "verified": true, "helpfulness": "0/0", "author": "Ho Yin Cheng"}]