[{"rating": 5.0, "review": "Works well!  No issues installing or using.", "verified": true, "helpfulness": "0/0", "author": "Oscuran"}, {"rating": 3.0, "review": "The Fire stick did not stay sync'd with our FIOS router on the first try, nor the second try, nor the third fourth, or fifth tries.  I was about to return it but, decided to try one last time.  And, it finally stayed sync'd with the router and we were able finish watching a movie.  The first 5 times it would stop anywhere from 5 - 20 minutes into what we were trying to watch.  It was not a signal strength issue we had 5 bars signal strength.  And, the older Sony Blu-Ray player never, ever, had an issue in the years we used it for streaming.  So, we've used the Fire stick a couple more times since and the issue appears to have resolved itself.  But, powering the thing up and down numerous times was not what we expect from any device we purchase.", "verified": true, "helpfulness": "0/0", "author": "Alfred Closson"}, {"rating": 5.0, "review": "it's ok.", "verified": true, "helpfulness": "0/0", "author": "Emilia"}, {"rating": 4.0, "review": "I mean - it's pretty simple and hard to screw this up. It's pretty much a host API for apps... works as it's intended. No lag, easy to use, starts immediately. 10/10 would not buy another one because I only need one but would totally recommend.", "verified": true, "helpfulness": "0/0", "author": "Parzival"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Steve Vecere"}, {"rating": 5.0, "review": "It came on time and I love it .", "verified": true, "helpfulness": "0/0", "author": "Maisha J. Mitchell \"Tech buyer\""}, {"rating": 5.0, "review": "This was super easy to install, I was watching instant videos in no time!", "verified": true, "helpfulness": "0/0", "author": "Catherine L. \"clynn70\""}, {"rating": 5.0, "review": "easy enoug for my 8 yr old grandson to operate.", "verified": true, "helpfulness": "0/0", "author": "eileen s dimartino"}, {"rating": 5.0, "review": "It is AWESOME, everything you want or need for TV", "verified": true, "helpfulness": "0/0", "author": "Julie Curry"}, {"rating": 5.0, "review": "The tv stick is awesome i bought a 2nd one to have it set up on my other tv", "verified": true, "helpfulness": "0/0", "author": "juan"}]