[{"rating": 4.0, "review": "Love it! It's easy and works awesome!", "verified": true, "helpfulness": "0/0", "author": "veronica flores"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is phenomenal! I own 2 Roku 3's, and Amazon Fire TV Box and got this Stick free with a 3 month subscription of SlingTV. This is my GO TO device when I'm on the go. Hotels, in-laws, etc. I no longer take my laptop or ipad when traveling for work. I just grab my AFTS and know that I'll have access to my Plex Media Server, Sling, Netflix, Amazon Prime, and so much more. If you have anything other than a Roku 3 or AFTB and are looking to upgrade for a minimal cost, the AFTS is clearly the best choice. It out performs the Chromecast, older rokus, and most smart TVs. Take it from a computer/electronic junkie and pick this thing up!-WillThis product loses quality in the microwave. :)", "verified": true, "helpfulness": "0/0", "author": "William Hayward \"BoNkErS\""}, {"rating": 1.0, "review": "Was not compatible with our Samsung TV.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Love it. It's simple to use and very cost efficient.", "verified": true, "helpfulness": "0/0", "author": "Maddie J"}, {"rating": 5.0, "review": "Great Device, Everything worked as advertised. Couldn't ask for anything more.", "verified": true, "helpfulness": "0/0", "author": "Assad"}, {"rating": 2.0, "review": "To many buffer issues since it was for a tv upstairs from the router. Replaced with the box and no issues at all", "verified": true, "helpfulness": "0/0", "author": "Yolanda Kennedy"}, {"rating": 3.0, "review": "Not wild about this product.  Its hard to use.  The remote is much too small and, I think, poorly designed.If I was doing it again I think I would look around more, maybe at Roko.", "verified": true, "helpfulness": "0/0", "author": "James E. Fitzgerald"}, {"rating": 5.0, "review": "So simple. Works perfectly. I cut the cord and this was part of the plan.", "verified": true, "helpfulness": "0/0", "author": "Diana S"}, {"rating": 4.0, "review": "this is a great option for older tvs (non Smart) and much cheeper.  my kids enjoy watching prime kids series.", "verified": true, "helpfulness": "0/0", "author": "shontrell"}]