[{"rating": 5.0, "review": "I would say out of the entire year, this by far was probably my favorite purchase!  Set up was easy and it's SO easy to use and it's just great!  I love it and I definitely would recommend this device!", "verified": true, "helpfulness": "0/0", "author": "Jason Fonville"}, {"rating": 5.0, "review": "Works great. Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "David B."}, {"rating": 5.0, "review": "A great lil stick. Portable and responsive.The TV USB, at least mine, causes it to response noticeably slower. Using the wall plug gives it speed.Allcast is compatible, via my Note 3, which was a major selling point for me.The streaming is great, though I suspect it’s coming  in at 720 but it doesn’t make that large of difference for me.I’m glad with this purchase. The Chromecast gives me the ability cast a chrome tab to it. I wish the TV stick could do this but its ability to cast from my Note 3 compensates. I’ll keep the Chromecast but I mostly use the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Paul S."}, {"rating": 5.0, "review": "We have now purchased three of these. Two for our house and one for our daughter and son-in-law. Love the ability to watch Prime without the buffering issues that our cable company had!", "verified": true, "helpfulness": "0/0", "author": "Lori Loves Books! \"Books I Love!\""}, {"rating": 1.0, "review": "first of all i pre ordered this unite in Oct. received 3 days ago wright out of the box  it had problems. scrolling apps would not go to next app in line, would jump 2-3 apps or jump to the end. some apps had video no sound.games with remote hard to control clunky. while watching netflix the picture would jerk and finally fire TV crashed no apps just side bar booted the unite and that did not fix it so the next day i did a factory resit still has problems. called customer service not much help so now returning the unite back to amazon. it is kinda sad i have 2 roku and 1 roku stick in the the house and none of them have given me grief as the fire TV in fact i ordered another roku stick to replace fire TV", "verified": true, "helpfulness": "5/6", "author": "phperdue"}, {"rating": 5.0, "review": "AMAZING!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amber Frederick"}, {"rating": 4.0, "review": "Awesome product. Picture quality is great. Easy setup. Only thing I find wrong is the user interface. It could be setup better and more streamline.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "I was blown away by how great this is.  Side-loads XBMC (Kodi) flawlessly, and appears to work just as well as the (far more expensive) original FireTV.  The remote is missing the voice recognition functionality of its big brother, but is otherwise fantastic.  I played with the remote control app a bit, and it works exactly as advertised, and setup is a breeze.  Amazon hit a home run with this one...and at $20 for pre-orders, it's almost TOO cheap!", "verified": true, "helpfulness": "0/0", "author": "Odin the Dog"}, {"rating": 5.0, "review": "this works great for streaming show and very easy to move from one tv to another..", "verified": true, "helpfulness": "0/0", "author": "Raul Mendoza"}, {"rating": 5.0, "review": "Awesome and now my child wants one for her room.", "verified": true, "helpfulness": "0/0", "author": "Howard B. Becker"}]