[{"rating": 5.0, "review": "This is a great deal. I already had Prime. Just take time to read about all you get with Fire TV Stick and Prime. Too much to list here. It works great with movies and tv shows and if you like you can download app for a tablet or phone to control the stick instead of using the remote that comes with it. Then you can use voice controls to find what you want.", "verified": true, "helpfulness": "0/0", "author": "Miguel"}, {"rating": 3.0, "review": "When it works it's great. Unfortunately very frequently I turn on my TV and I'm told the Fire Stick can't connect to the Internet. I have to unplug it and wait until it reboots. I just don't like having to climb behind furniture to unplug and then wait. I use the extension and the stick is less than 5 feet from the wireless router.", "verified": true, "helpfulness": "1/1", "author": "Colleen O. Kelly"}, {"rating": 4.0, "review": "The fire stick offers a good selection of movies and TV. It is very easy to use.", "verified": false, "helpfulness": "0/0", "author": "Jim R."}, {"rating": 5.0, "review": "Easy to set up and use. Very happy with this device.", "verified": true, "helpfulness": "0/0", "author": "P. Spath"}, {"rating": 5.0, "review": "Love it.  Received it quickly, set it up fast, works great.  Amazing for the price", "verified": true, "helpfulness": "0/0", "author": "Gail Paulus"}, {"rating": 5.0, "review": "I love the fire stick. It works great and was easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Brittany Bland"}, {"rating": 5.0, "review": "The Fire TV stick streams movies without any problems which is more than I could say for my \"smart\" TV.  I've used this on both a newer smart TV and a older TV without HDMI inputs.  For the older TV, I bought a $15 HDMI adaptor from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dennis D."}, {"rating": 5.0, "review": "worked great right out of the box. Setup was easy and fast", "verified": true, "helpfulness": "0/0", "author": "MikeJ \"oldno7\""}, {"rating": 5.0, "review": "Was easy to install.and works just like advertised.I was watching a movie right away.", "verified": true, "helpfulness": "0/0", "author": "rene segura"}, {"rating": 3.0, "review": "Works great. But not really that much free tv shows and movies", "verified": true, "helpfulness": "0/0", "author": "Tim lepley"}]