[{"rating": 5.0, "review": "Love it should have got it sooner. We bring it from place to place and room to room.", "verified": true, "helpfulness": "0/0", "author": "Robyn"}, {"rating": 5.0, "review": "The fire has really made my Amazon prime account so much better. I have to wear readers and didn't like being in bed watching on the iPad now I just put on the tv and watch away. Of course there is always something on prime.", "verified": true, "helpfulness": "0/0", "author": "Faith Barbour"}, {"rating": 5.0, "review": "I actually got this as a replacement for a previous model that appeared to have failed.  I called Amazon customer service, and a very helpful tech walked me through several tests until we exhausted everything.  Finally, she had this new one shipped to me, and I boxed and shipped the broken one to Amazon.  As it turned out that it wasn't the Fire TV Stick that was busted, but my TV.  All four HDMI ports were dead.After purchasing a new TV, everything is working great.  Just sayin', Amazon support is awesome.", "verified": true, "helpfulness": "0/0", "author": "N. C. Weber"}, {"rating": 5.0, "review": "Much better than chromecast, that's I got to say!", "verified": true, "helpfulness": "0/0", "author": "CHRISTOPHER ALSTON"}, {"rating": 4.0, "review": "Very happy. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Sherri Fergen"}, {"rating": 3.0, "review": "was easy to connect to  my LG brand HD TV  but couldn't get it to recognize the TV it was connected to. When plugged in to the downstairs LG TV it recognized only a Smart TV in an upstairs room ( where it was not connected and where I obviously didn't need a Fire Stick.  Could not figure out  this mysterious problem or how to correct it so returned the Fire stick for credit", "verified": true, "helpfulness": "0/0", "author": "M.C."}, {"rating": 5.0, "review": "Love it for traveling - only problem I have this versus my real Fire TV is there is a noticeable lag when using the remote.  2-3 second delays usually instead of the normal sub-second response I'm used to.", "verified": true, "helpfulness": "0/0", "author": "StevePresley"}, {"rating": 2.0, "review": "I've had an issue with the Fire TV stick since day one. When it works, it's awesome... Getting it to work, that's an ordeal. Sometimes it takes me all day to get this thing to turn on. There are only 3 or 4 troubleshooting tips and none of them work the first time I try them. I had high hopes for this thing, but unfortunately, it's extremely unreliable. Sending it back today. Hopefully the fire TV works a little better!", "verified": true, "helpfulness": "0/0", "author": "Austrin"}, {"rating": 4.0, "review": "My wifi reception is so/so. The Fire Stick has helped streaming along substantially and as a Prime Member there is a great selection of free material!!", "verified": true, "helpfulness": "0/0", "author": "Debbie O'Riley"}, {"rating": 5.0, "review": "This is the best product for anyone! Easy to install & use and you cannot beat the low price! We have 2!", "verified": true, "helpfulness": "0/0", "author": "Music Queen \"music all the time\""}]