[{"rating": 3.0, "review": "Having internet/home network connection issues, as a lot of people are I see. Whether it's a server issue, or a hardware/software issue, apparently they don't know either! Very frustrating!! Amazon needs to put out a firmware update, send an automatic resolution to all customers, or recall the product!", "verified": true, "helpfulness": "0/0", "author": "JBall"}, {"rating": 5.0, "review": "ordered 6/6/2015 arrived 6/9/2015took 3 minutes to set upgreat for huluplus and amazon videosnow my laptop does not overheat because of streaming", "verified": true, "helpfulness": "0/0", "author": "Eric Roberts"}, {"rating": 5.0, "review": "The product work really good ,what I did not like is the fact that I had to purchase it from e bay I don’t understand y amazon don deliver this product to Puerto Rico and I have a prime membership", "verified": true, "helpfulness": "0/0", "author": "Edgardo"}, {"rating": 5.0, "review": "this was so simple to install and the best part is it's hidden from view, no ugly box to look at.  Works great", "verified": true, "helpfulness": "0/0", "author": "Diane Brueggemann"}, {"rating": 4.0, "review": "Very convenient. I recently got a fire TV stick after having surgery where I was bed ridden for a few weeks, and I never ran out of things to do with this little guy. I linked my Amazon prime TV account as well as my netflix, and there are a bunch of apps and games you can download on it too! Great little device. The only con I have is that there's not an adequate phone mirroring app yet, which I miss from my old Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Michaela Fleming"}, {"rating": 2.0, "review": "Could not activate my Netflix account and the hassle of trying to connect to them.", "verified": true, "helpfulness": "0/0", "author": "Walter Glifort"}, {"rating": 2.0, "review": "Despite the fact that I have prescribed to amazon prime most of the movies and alot of the Tv shows cost money to watch. Some of the old movies even charge for viewing. The TV shows that charge money are free on the internet! I plan to discontinue my amazon prime and get netflix. You can get new movies for $1.30 at redbox and these movies are $4.99 on amazon fire stick. It is ridiculous.", "verified": true, "helpfulness": "1/1", "author": "Joy McDade"}, {"rating": 5.0, "review": "Why are you reading this review?! Buy it already! Firetv is the #%^%", "verified": true, "helpfulness": "0/0", "author": "Keith D."}, {"rating": 5.0, "review": "I have had this product for a couple of weeks and love it!  I haven't explored all of the options on it yet, but it has been easy to use so far and the picture quality is phenomenal!", "verified": true, "helpfulness": "0/0", "author": "Sarah Vandre"}, {"rating": 5.0, "review": "Love this thing use it all the time.", "verified": true, "helpfulness": "0/0", "author": "jeidson9502"}]