[{"rating": 5.0, "review": "The Amazon Fire Stick exceeded my expectations! Very easy to use. I especially liked how my music preferences just popped onto the screen.", "verified": true, "helpfulness": "0/0", "author": "dmpobg"}, {"rating": 5.0, "review": "worked just like I hope it would  no problems yet", "verified": true, "helpfulness": "0/0", "author": "Michael W."}, {"rating": 5.0, "review": "I don't usually write product reviews but I've been telling all my friends to buy one of these. As an owner of a Apple TV 2, Chromecast, and OUYA, and previous owner of other cheap Android streaming devices, I can say that this little stick is well worth the money. It's fast and easy to use. The Fire TV Android app is well written and works with the Fire Stick very well. The keyboard function recognizes my input and displays to the TV fast (big plus over the competition).My only complaint is not allowing sideloaded apps to display in the main app tray. The device is written on Android, so why make us jump through hoops to use Android apps?", "verified": true, "helpfulness": "0/0", "author": "Josh Walker"}, {"rating": 4.0, "review": "Awesome. Works better than my Chromecast", "verified": true, "helpfulness": "0/0", "author": "Jeremiah"}, {"rating": 5.0, "review": "So far we absolutely adore the Fire Stick.  I have a Smart TV and have always had trouble with the Amazon App never knowing for sure if it was the TV, my cable/internet, or Amazon.  It was such a pain to use that we got to a point where we were not using it hardly at all.  Then a buddy and his wife told us about this and we decided to give it a try.  Well, it's worked almost flawlessly and we are again enjoying movies.  I ordered the remote with voice and would recommend this option to everyone.  It makes everything even easier!  This has been a blessing and want everyone to know it is so worth the money.  I will not be buying a Smart TV again when I need to replace this one, you just don't need it.", "verified": true, "helpfulness": "0/0", "author": "Airborne Daddy \"Tommy Lane\""}, {"rating": 3.0, "review": "I have had similar issues to other reviews. Netflix seems compromised in some way.", "verified": true, "helpfulness": "0/0", "author": "Roger"}, {"rating": 5.0, "review": "This works awesome love it", "verified": true, "helpfulness": "0/0", "author": "Lana Kraus"}, {"rating": 5.0, "review": "Everyone should own one of these.", "verified": true, "helpfulness": "0/0", "author": "Gregory Bragg"}, {"rating": 5.0, "review": "quick & easy did what I was expecting", "verified": true, "helpfulness": "0/0", "author": "michael colbert"}, {"rating": 4.0, "review": "Little bit more of a selection would be nice and/or less $$$ to rent a movie-Cheaper to Rent from RedBox", "verified": true, "helpfulness": "0/0", "author": "Paul Myers"}]