[{"rating": 5.0, "review": "LOVE IT!!!!! Smooth operation, lots of choices.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 4.0, "review": "Awesome, so much better than laptop. Occasionally freezes, but nothing horrible.", "verified": true, "helpfulness": "0/0", "author": "km"}, {"rating": 5.0, "review": "We love it much more than our Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Linds_ywithane \"Lindsey\""}, {"rating": 5.0, "review": "I love my firestick so far..", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "WOW this is one great toy...bringing  the world of all types of entertainment easily to your fingertips...easy to setup just follow the simple directions and your up and running...and don't forget to download the Fire Stick app...it makes easy operation even easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "Rose Clemons"}, {"rating": 5.0, "review": "Full of features, I am using it on a smart tv that just didn't have many app options.", "verified": true, "helpfulness": "0/0", "author": "Chris Smith"}, {"rating": 4.0, "review": "Very good product.  Wish it had the Vudu app.", "verified": true, "helpfulness": "0/0", "author": "John Bartolotta"}, {"rating": 5.0, "review": "Love the Fire Stick! We were previously streaming through our Wii device, which was spotty. Also, our kids kept messing with the Wii. The Fire Stick is streaming great for us thus far and, being plugged into the back of our tv, it's out of sight of our kids, an added bonus! Very happy with the puchase.", "verified": true, "helpfulness": "0/0", "author": "Sarah S"}, {"rating": 5.0, "review": "Ever thought \"I wish I could figure out how to get my Amazon Prime on my TV\"??  Well, wonder no more! I am clueless about anything electronic so I was leery about getting this; but I am SO glad I did!  I got this; plugged it into the side of the TV and 20 minutes later (and for the next week) we watched all 32 episodes of Season 1 Andy Griffith on our big screen tv!SO glad I found it and SO glad for honest reviewers who convinced me I was smart enough to figure it out!Highly recommend to anyone wanting to make their tv a \"Smart TV\"  or to watch enhanced viewing of Prime (or You Tube or the other sites).", "verified": true, "helpfulness": "0/0", "author": "Karen"}]