[{"rating": 5.0, "review": "lives up to expectations", "verified": true, "helpfulness": "0/1", "author": "Jerry"}, {"rating": 5.0, "review": "If you are debating between a roku or a chromecast and this and you want the opinion of someone who has all three then I can give it to you! Fire tv stick hands down! I have noticed lag on mine playing some games so if you want to play games you might want to look at the fire tv instead. That isnt all games though. Most i have played run great. If video as all you want then this thing can give you what you want! I can find all the apps on my roku that i use on here plus more and its half of the price (I got it for 19 bucks on the initial prime members only sale so i payed one fourth of the price of my roku.) so that's how it beats my roku. As far as chromecast goes, Yes it is really cool to control your chromecast from your phone...at first... then you realize how much it needs a remote! This thing has a remote! Plus chromecast, as far as I know doesn't run amazon prime yet ( and maybe never will...). Any way, I have been recommending this to everybody and I would recommend it to anybody. Plus once you install xbmc (kodi) this thing becomes priceless because you can't install that on chromecast or roku.", "verified": true, "helpfulness": "0/0", "author": "Joselujano84"}, {"rating": 1.0, "review": "I love Amazon and Amazon gadgets but fire stick is not worth at all. I bought them when they were first released. Every time my daughters want to watch Netflix or Amazon videos the sticks have to be restarted. Unplug them and plug them back in. They advised me on changing the settings on my router which I did and it didn't fix the problem. They also said the sticks needed to be within 10 feet of the router, seriously? Finally I got a replacement and it was the same thing. Don't buy them.", "verified": true, "helpfulness": "3/4", "author": "J. Leiva"}, {"rating": 4.0, "review": "Works well, nice UI....  Fast, smooth playback.  I'm a Roku & Chromecast user too.  So why did I add a Fire Stick?  Primarily to try the Fire 8.9 HDX mirror/Miracast capabilities and compare the Fire TV stick to my Chromecast & Roku 1st hand.  I'm the tech-geek for my extended family and like trying out different tools & toys.I'd net out the Fire TV Stick as an equivalent to Roku, but not really a breakout, better product.  It's nice to be able to mirror my Kindle 8.9 HDX, but the display mirroring connection is no where near a simple and smooth as a Chromecast connection.  I like the Fire stick, but it's just not \"better than Roku\", and it's not at all as simple and smooth as Chromecast.Here's the one use case where I'd recommend the Fire Stick. A Prime Account, Kindle Fire user who has no other media or display mirroring interests.", "verified": true, "helpfulness": "0/0", "author": "Daddio"}, {"rating": 1.0, "review": "I did mot orfwrntjis amd i looked and you charged my credit card twice!", "verified": true, "helpfulness": "0/1", "author": "Lisa A. Fenton"}, {"rating": 4.0, "review": "Received as Sling tv promotional deal for signing up 3 months. It's not bad once it finally works, as I had to deal with 2 defective units, wasting my time and frustration. It is a great gadget to have, however I prefer my HTPC over Fire stick.", "verified": true, "helpfulness": "0/0", "author": "S.H"}, {"rating": 5.0, "review": "Best streaming device.", "verified": true, "helpfulness": "0/0", "author": "soyalozo"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kim Brown"}, {"rating": 4.0, "review": "Works well, but I prefer my Roku.", "verified": true, "helpfulness": "0/0", "author": "TaiwanJohn"}, {"rating": 5.0, "review": "Love it, now I can look at my movis", "verified": true, "helpfulness": "0/0", "author": "Edna A. Harrell"}]