[{"rating": 5.0, "review": "I have 2 Fire TV sticks and we love them. One word PRICELESS. The best purchase ever. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Maritza Perez"}, {"rating": 4.0, "review": "It is so much easier to use than plugging in my computer. only thing is it didn't wanna stay connected to my Wi-Fi so when I'm searching it keeps cutting out.", "verified": true, "helpfulness": "0/0", "author": "m.cogis"}, {"rating": 5.0, "review": "Bought this for my wife and installed it on a TV I mounted in our florida room. Was very easy to configure and setup and she loves watching it while using our elliptical. Also configured it to work with our Slingbox so it's even better, she can watch anything she wants or listen to Amazon music. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "great compact product!", "verified": true, "helpfulness": "0/0", "author": "Ellen J. Siddiqui \"kindle lover\""}, {"rating": 4.0, "review": "I find it to be a pretty neat, fairly inexpensive device. It works well. Occasionally (not often) it will stop mid-program, for a few seconds and start again, but overall it works seamlessly. I'm eager to take it on vacation. We use it everyday. The only thing I don't know how to do (and this may be me-specific) is how to start it without having to get up and physically put my television on HDMI2 first and return it to component when I want to return to regular tv.", "verified": true, "helpfulness": "0/0", "author": "Stacy L Maryland"}, {"rating": 1.0, "review": "Not very good. Works with Amazon Prime but not with anything else! Roku works much better!!!!", "verified": true, "helpfulness": "0/0", "author": "Norseman"}, {"rating": 5.0, "review": "Better than Chromecast", "verified": true, "helpfulness": "0/0", "author": "Terry E Adams"}, {"rating": 5.0, "review": "I like it so far.  works perfect and quality is great.  picture quality is awesome.  My only criticism is that I thought it would do more.  Obviously it is my fault for not fully researching this item.  I was going to give it four stars for this reason, however I can only blame myself.  It is priced very well and it does what it states that it does.  This is a five star product.  I must say thank you amazon!", "verified": true, "helpfulness": "0/0", "author": "cngodfather"}, {"rating": 5.0, "review": "Quite impressed with the features of the little Fire TV stick. No lags, no delays, performs as expected and best of all, I have access to all Prime content on my TV!", "verified": true, "helpfulness": "0/0", "author": "NadimC"}, {"rating": 5.0, "review": "I was amazed at what was availible to watch and the clear digital picture.", "verified": true, "helpfulness": "0/0", "author": "WAYNE R. AUPPERLE"}]