[{"rating": 4.0, "review": "It's not perfect, but it's effective and has a simple user interface. I am able to download many of the apps that I would like to watch content from, but not all of them. It would be great if there was a web browser style app that would allow me to watch shows from websites like CBS, NBC, USA, etc. That said, for the price I paid and the functionality, I am very happy. I use both of the firesticks we own everyday.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I purchased this when the Samsung \"smart TV' I purchased from became almost worthless  as it  gradually required \"updates\" to access and display content / web streaming. When you attempt to update it fails generally indicating not enough memory.So some comments on the web seemed to indicate some of the services I wanted to stream could be accessed with the Firestick and it had enough memory to it was updatable. So far it seems pretty locked into Amazon and its partners. Frankly I think this device should allow installation of a 3rd party Browser so the customer can you it to browse any content you wish on the net.My fault I didn't really dig for more info on these two purchases before I purchased. Disappointed with Firestick and Samsung.", "verified": true, "helpfulness": "0/0", "author": "JEFF GALBRAITH,"}, {"rating": 5.0, "review": "Really easy to work and love the great selection of programs", "verified": true, "helpfulness": "0/0", "author": "James L Weaver"}, {"rating": 5.0, "review": "Love it!  It is easy to set up and I have so many movies/series to watch without spending additional money.", "verified": true, "helpfulness": "0/0", "author": "Judith A Hearn"}, {"rating": 1.0, "review": "did not work for me", "verified": true, "helpfulness": "0/0", "author": "john rotunno"}, {"rating": 5.0, "review": "Plugged right in and worked.  I wonder why I waited so long.", "verified": false, "helpfulness": "0/0", "author": "Bruce Johnson"}, {"rating": 1.0, "review": "everything costs and the prices are to high No good menus to use to find thingsDOES NOT SAY IF THERE ARE MONTHLY FEES WISH I HAD SOME ONE TO TALKM TOO", "verified": true, "helpfulness": "0/1", "author": "Joan Miller"}, {"rating": 5.0, "review": "Me and my family love it. It`s great for using when you travel, take it with you.", "verified": true, "helpfulness": "0/0", "author": "baob"}, {"rating": 4.0, "review": "Did exactly what it was advertised to do. From box to watching Netflix was less than 10 minutes, and part of that time was maneuvering to get to the back of the TV to plug the stick in. Very simple to switch from regular TV to Netflix, YouTube, etc.", "verified": true, "helpfulness": "0/0", "author": "Kathy Cooke"}, {"rating": 5.0, "review": "Much better than Google Chrome Stick - easier to set up and use and streams to the TV directly", "verified": true, "helpfulness": "0/0", "author": "Jeffrey R Cohen"}]