[{"rating": 4.0, "review": "I purchased the fire stick simply because i was tired of moving my laptop to the tv to watch Netflix.  The remote was an added plus over the chromecast.  I was surprised to see there were apps for channels i already have with cable so those were free with a quick online sign up.  I am happy with this purchase.  The only con I have is that every now and then the picture has a slightly grainy picture almost like you zoomed in.  It clears up quickly.  Im not sure what causes this but it hasnt been a bother enough to me to look into it.", "verified": true, "helpfulness": "0/0", "author": "J. Pilcher"}, {"rating": 5.0, "review": "So far we really love it!! As adults we love the variety of shows to view with Prime, use it for Netflix, and love listening to Prime music. Our 7 year old loves the games and can easily work all of it by herself, from downloading to using remote. I also like the capability to view photos and rent or view movies and shows in HD. We bought two and we love them!", "verified": true, "helpfulness": "0/0", "author": "Erin Al-Mehairi"}, {"rating": 5.0, "review": "Love love love. So much better than the box.", "verified": true, "helpfulness": "0/0", "author": "Monet"}, {"rating": 5.0, "review": "The Fire TV Stick is a truly great streaming stick.  I had narrowed my decision down to it and the Chromecast, and I'm definitely glad I went with the Fire TV Stick.  Being able to access content directly on the stick, such as Prime Instant Video and the Plex app for access to my local files, instead of having to cast content from another device is great.  Still waiting on the HBO Go app for the Stick though.", "verified": true, "helpfulness": "0/0", "author": "Nick Sparks"}, {"rating": 3.0, "review": "I like the fire stick... the only issue i have is that it loses wifi connectivity and you have to unplug it and plug it back again so that it can scan the networks... i have to do this almost daily and thet router is only 5 feet away... other than that it works as it is supposed to... makes my non-smart tv able to watch a lot more..", "verified": true, "helpfulness": "0/0", "author": "Carlo Aquino"}, {"rating": 5.0, "review": "Kindle keeps getting better and better.  It is the best EVER!  This little details ice the cake.  I am a forever fan.  I am homebound a d this kindle is the window to the world.", "verified": true, "helpfulness": "0/0", "author": "boondogg"}, {"rating": 5.0, "review": "Love it!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Eddie J."}, {"rating": 5.0, "review": "I love it! So much more convenient than connecting your laptop and tv using an hdmi!", "verified": true, "helpfulness": "0/0", "author": "liyaa"}, {"rating": 4.0, "review": "Still does not have HBOGO available, although its supposed to be in Spring 2015....no date has been officially announced yet.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "Great way to add netflix to a tv", "verified": true, "helpfulness": "0/0", "author": "Molly Thole"}]