[{"rating": 4.0, "review": "I like this but it is VERY hard to get the batter cover off the back.", "verified": true, "helpfulness": "0/0", "author": "Tami Taylor"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Thomasena"}, {"rating": 5.0, "review": "Quick and easy to set up! Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love I!!", "verified": true, "helpfulness": "0/0", "author": "Mert378"}, {"rating": 5.0, "review": "Good product and price", "verified": true, "helpfulness": "0/0", "author": "keith medlock"}, {"rating": 4.0, "review": "Wasn't quite sure.  The stick is wonderful and has made my TV accepting of Netflix.  Doesn't fit my main TV, but it must be the set not the stick", "verified": true, "helpfulness": "0/0", "author": "Lucille Alzamora \"pandalucy\""}, {"rating": 5.0, "review": "It's the best hands down!", "verified": true, "helpfulness": "0/0", "author": "NELSON SANTIAGO"}, {"rating": 5.0, "review": "I bought this item on Thursday and got it by Saturday because I'm a prime member...but I already love it. I'm not someone who pays for cable or satellite but I do love watching the A & E app and watching cool stuff on prime. But now instead of watching on my computer or my phone I get to watch it on the big screen; which I have to admit is just a little bit awesome. My draw to this item was because the fire tv was so much more expensive. This was only $39 and so far it's been worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Sarah A. Kincaid"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "kisha hairston"}, {"rating": 2.0, "review": "Disappointed that the fine print did not include the fact that it required high speed internet and what speed it is.  I may just return it because I will have to change providers to get higher speed and if it is too costly and I may not do it.  I will have to change my email address I have had for 15 or more years also which is a hassle.  I am shopping around now, but it is time consuming and it is hard to know who and what to believe,", "verified": true, "helpfulness": "0/0", "author": "Kay Sargent"}]