[{"rating": 5.0, "review": "Love the fire stick, retired the chrome cast...well at least for now. I was using the Google Chromecast for a while now and enjoyed it. I really like the Fire stick better because I have the option of watching app like Netflix directly from the fire stick, unlike the Chromecast where you have to cast from your device all the time. The set up was super easy as well, I had no connection/setup issues at all. It took me maybe 10 minutes if that to set it up and I watch it every day. I'm really thinking about canceling my cable and getting one of these for each TV in my house. Everyone watches Netflix and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Aimdoom"}, {"rating": 4.0, "review": "Work only inside USA.Not support worldwide.", "verified": true, "helpfulness": "0/0", "author": "shams eldin"}, {"rating": 5.0, "review": "Great little device. Great value for the money. It works wonderfully with your Prime account. Mine came already set up with my account info so set up was a breeze. Tons of content. So much so that I'm still figuring it out.", "verified": true, "helpfulness": "0/0", "author": "Jason Rockwell \"Respectable Lizard\""}, {"rating": 5.0, "review": "Perfect....", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 5.0, "review": "Watching it right now", "verified": true, "helpfulness": "0/0", "author": "robert m ledbetter"}, {"rating": 5.0, "review": "The fire stick works great but beware that if you don't have good internet connection or limited streaming that the product doesn't preform very good. Unfortunately I have hughnet and only certain times a day it streams worth anything. I do highly recommend this product, its great for streaming movies or playing games. Very easy to install. If you don't get internet connection right off turn off your fire stick and turn it back on. Hope this review was helpful.", "verified": true, "helpfulness": "1/1", "author": "karen penix"}, {"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Pradeep"}, {"rating": 5.0, "review": "So far the Fire TV Stick has been great.  I was worried about reception and use of the remote since the TV I planned on using this on is in a niche above my fireplace and fits perfectly, which means the fire stick hangs behind the TV.  The reception has been wonderful and I have not experienced any loss of function from the remote.  The picture is great.  I do have to get used to the streaming feature since I am not a regular Netflix user, but that is my only complaint.", "verified": true, "helpfulness": "0/0", "author": "Martine Herbst"}, {"rating": 5.0, "review": "I love the firestick! It was easy to use and it works like a dream.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}]