[{"rating": 5.0, "review": "Works great, except for slow internet connections.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my new Fire TV stick. Worth every penny. Have no problems with it. Took me about 5 minutes to set up", "verified": true, "helpfulness": "0/0", "author": "LuAnn McCarty"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Ian Whitfield"}, {"rating": 5.0, "review": "It's excellent now that I got it working", "verified": true, "helpfulness": "0/0", "author": "casslitchfield"}, {"rating": 4.0, "review": "Easy to use and install. Lots of apps to download, if I apply for Prime I will have a lot more use for this. I wished the product  description stated that it included the power charger for the wall as well as a USB cable.", "verified": true, "helpfulness": "0/0", "author": "Jessica Durham"}, {"rating": 5.0, "review": "Super easy to use and the selection of channels is amazing", "verified": true, "helpfulness": "0/0", "author": "Maisoon Suleiman \"Maisoon Suleiman\""}, {"rating": 4.0, "review": "Can't beat the Fire TV Stick for this price point. Interface is great but obviously prefers Amazon content.The only real issue I've had is that it stutters from time to time. For the most part, it works great but occasionally it stutters to the point that it's very distracting. Usually, after pausing and playing again it will stop but sometimes it doesn't right away.", "verified": true, "helpfulness": "0/0", "author": "Israel Soler"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "GLEN BOOKER"}, {"rating": 3.0, "review": "this is my 3rd fire tv product, 2nd stick.  for some reason, i must repeatedly reboot this one; the others don't have these problems.  hulu won't load, afer a reboot, there are multiple hiccoughs during streaming.  the device also goes to sleep midstream.  i haven't contacted customer service yet for a better solution but will do so soon.", "verified": true, "helpfulness": "0/0", "author": "mzmarie"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kris Coffee"}]