[{"rating": 4.0, "review": "It is ok, more looking for things to come.", "verified": true, "helpfulness": "0/0", "author": "carlton p coose"}, {"rating": 5.0, "review": "FANTASTIC! Easy set up and my phone is the remote.", "verified": true, "helpfulness": "0/0", "author": "chad"}, {"rating": 4.0, "review": "Mo", "verified": true, "helpfulness": "0/0", "author": "corey m rang"}, {"rating": 5.0, "review": "I received my fire stick today and it is very impressive.First, it was easy to install and put in operation. Secondly, the device is vey functional and downloads are very quick with little or no buffering. I am a prime member so I can assess more movies and listen to a variety of music for free.Lastly,  the stick is much better than Apple TV.The remote control fits in my hand very nicely and its range seems to be endless. I was outside in the driveway and was able to play and stop music.", "verified": true, "helpfulness": "0/0", "author": "Perry B.West"}, {"rating": 2.0, "review": "I really was liking this product but since their \"update\" ....lag lag lag on all my streaming services. Very frustrating.  HBO, netlifx, Hulu, all lag out on me....guess its time to take advantage of apple TV deal..", "verified": true, "helpfulness": "0/0", "author": "J. S. Gideon"}, {"rating": 5.0, "review": "...excellent!  Thanks!  LTS", "verified": true, "helpfulness": "0/0", "author": "Lexis"}, {"rating": 3.0, "review": "works pretty smoothly however, the remote is easy to slip off your hand, not sure why it's designed this way.", "verified": true, "helpfulness": "0/0", "author": "W. CHANG"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 1.0, "review": "1 is too high.  MLB.TV doesn't work so I get to watch it on my laptop instead. WWE app didn't work either luckily my Roku did too bad it was on my 27 tv not my 47 for Wrestlemania.", "verified": false, "helpfulness": "0/0", "author": "cubsncards"}, {"rating": 5.0, "review": "Works great. Replacing the Apple TV!! Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"justmacman\""}]