[{"rating": 2.0, "review": "Buffers a lot", "verified": true, "helpfulness": "0/0", "author": "Marjorie M. Mccall \"grand mom\""}, {"rating": 5.0, "review": "Great device. I've been using it for a few weeks and, so far, no issues. Other than using my PS3, my other devices that has built in Wi-Fi had streaming issues. But after using the fire stick for a month now, there had been no streaming. So far, it's working great.", "verified": true, "helpfulness": "0/0", "author": "Dre B."}, {"rating": 5.0, "review": "I am loving my Fire TV Stick...best purchase in a year!  I have Chromecast and this one knocks it outta the park. I have cancelled Netflix and with what I save on that subscription, I bought Amazon Prime for $99.00 per year for my Kindle and TVs. I have cancelled my Direct TV and saved $1,400.00 per year. I bought the Avantek HD antenna with amplifier from Amazon for $39.00. It brings in all my main TV channels and a few extras. I am enjoying saving a lot of money in these hard economic times, and enjoying TV and books as never before!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it. just wished it would down load the hole movie at once.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Best $35 dollars I've ever spent.", "verified": true, "helpfulness": "0/0", "author": "Schyler"}, {"rating": 3.0, "review": "So far not near as good as chromecast which is way better", "verified": true, "helpfulness": "0/0", "author": "TG"}, {"rating": 5.0, "review": "Love it!! I can pick and chose what to watch when I want to watch it. My new favorite!", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 4.0, "review": "Great for the price,especially if you have Amazon Prime. It sets up easily, the remote is a much friendlier controller that the Chromecast iPad/iPhone set up and I have experienced no drops during play as I often did with Chromecast . I did experience some initial long delays in reaching full 1080p resolution in Netflix,but that has largely resolved. For the money it's a good choice for streaming.", "verified": true, "helpfulness": "0/0", "author": "Alee"}, {"rating": 5.0, "review": "Product is user friendly with many entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Meagan"}, {"rating": 5.0, "review": "Love it.  Need more prime movies", "verified": true, "helpfulness": "0/0", "author": "RLS"}]