[{"rating": 5.0, "review": "I love this and have all ready told my sisters they need to get it as well. Installing it and setting it up was easy. Navigating is easy and the picture is clear.", "verified": true, "helpfulness": "0/0", "author": "Christina Tomlin"}, {"rating": 5.0, "review": "Love this fire tv stick!!!", "verified": true, "helpfulness": "0/0", "author": "PAULETTE"}, {"rating": 3.0, "review": "Is anyone else having problems with the Netflix app?  It keeps bouncing me back to the previous page every time I click on to it.  It was working fine two days ago", "verified": true, "helpfulness": "0/0", "author": "CKing"}, {"rating": 5.0, "review": "I purchased this product so that I could streamline my WWE Network channel I am so glad I did.  I am thinking about buying one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Soto"}, {"rating": 5.0, "review": "Worked perfectly! Super easy to setup.", "verified": true, "helpfulness": "0/0", "author": "alvinsmama"}, {"rating": 3.0, "review": "The stick works flawlessly ..However, I find that having to pay 99 dollars for prime unacceptable...People on fixed incomes just cant dump 99 bucks all at once ..", "verified": true, "helpfulness": "0/0", "author": "Larry Gardner"}, {"rating": 5.0, "review": "Very good device", "verified": true, "helpfulness": "0/0", "author": "Soledad"}, {"rating": 1.0, "review": "So much desync? I switched back to other devices to watch HBO go and Netflix :(", "verified": true, "helpfulness": "1/1", "author": "bighungry"}, {"rating": 5.0, "review": "I had previously purchased a Fire TV, and liked it so much I thought I'd give this a try on a different TV. Well, I like it just as much. I only used the voice search on the Fire TV a couple of times, so don't miss it, and the performance is not noticeably different from the excellent Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Ray"}, {"rating": 5.0, "review": "This has been one of the easiest and best devices I have purchased for almost any purpose. Simple to install and set up; works perfectly; solves a serious connection issue for a relatively older TV. Extremely satisfied with this product....", "verified": true, "helpfulness": "0/0", "author": "Michael A. DiPierro"}]