[{"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "JANE FILER"}, {"rating": 5.0, "review": "Works great.. easy to setup and I use it all the time to watch movies and TV shows.. Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Karen Bookcat"}, {"rating": 5.0, "review": "It is as good as advertised! With my combination of Amazon Prime and Netflix I am ready to spend many winter days and nights watching TV shows and movies! I just canceled my cable movie pack, this is much better and a whole lot cheaper.", "verified": true, "helpfulness": "0/0", "author": "Bryan from Kansas"}, {"rating": 3.0, "review": "It's not a review, but a questión. What is the difference between the Amazon Fire Stick ($39),  vs the Amazon Fire  TV  ($99). What does  Fire tv can do that the Fire Stick can't ?  And a second questión,  my internet is a wireless wi-fi , with  no cables to atach to anything and no bluetooth. Can both, the Fire TV  and the Fire Stick work with  my WI-FI  ? Thanks .  As  I  have not reviewed the Fire Stick  because I don't owe one, and Iam required to rate it un order to write here,  I just  placed a 3 star", "verified": false, "helpfulness": "0/0", "author": "Aixa Tavarez"}, {"rating": 5.0, "review": "Love this!  Going to cancel my cable and just use the firestick - excellent replacement option for the kind of TV we like to watch!", "verified": true, "helpfulness": "0/0", "author": "Heather Slater"}, {"rating": 5.0, "review": "Super easy to install (even install is just not the right word - you just plug in and start using it) and use it immediately. Picture is crisp and it performs better than my cable-on-demand. No stutter at all. Excellent all around. Although I write computer games for a living, I'm a hardware technophobe...which is why I didn't get it sooner. I've had Amazon Prime for many years, and this just adds even more value. (Probably get Hula Plus and Netflix too....and debating to get rid of Cable-TV entirely now).", "verified": true, "helpfulness": "0/0", "author": "Joseph J. Cassavaugh \"Puzzles By Joe\""}, {"rating": 5.0, "review": "Love it! Its so easy to set up and use. Amazon's original series are amazing!", "verified": true, "helpfulness": "0/0", "author": "K.R."}, {"rating": 4.0, "review": "Works good so far!  Will give 5 stars if it stays working well.", "verified": true, "helpfulness": "0/0", "author": "Cheryl L Gaiero"}, {"rating": 3.0, "review": "Fire stick itself is great! Sad to say that so much of the free programing is really lame :(", "verified": true, "helpfulness": "0/0", "author": "Rev"}, {"rating": 5.0, "review": "This is awesome. Now I can watch in any room other than my living room. Although it tracks a bit when there are heavy loads on the internet, it isn't any different than on the iPad.", "verified": true, "helpfulness": "0/0", "author": "lcohly"}]