[{"rating": 4.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Delberta Storz"}, {"rating": 5.0, "review": "If you're tired of waiting, waiting, waiting for Amazon Prime to come up on your PS3 (And all the other problems of using a PS3 for Amazon Prime), then just spend a few bucks on this device and all those problems will go away.  Setup is easy, and once that's done, every time you use it, its ready in about 20-30 seconds after you plug it in.  Shows and movies load and begin to play in just seconds....EVERY TIME!  Great device.", "verified": true, "helpfulness": "0/0", "author": "T.C."}, {"rating": 5.0, "review": "I'm in love with  this.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "I am not very technologically savvy, but the fire stick is so easy to use...I love it!", "verified": true, "helpfulness": "0/0", "author": "Heather Robinson"}, {"rating": 4.0, "review": "I lv it :)", "verified": true, "helpfulness": "0/0", "author": "Norma palos"}, {"rating": 5.0, "review": "I haven’t had a chance to use until I recently came down with Bronchitis which I’m hoping to get over soon.  Anyway I have been a prime member for years (2010) and I love the amazon prime streaming services that they introduced last year included with prime.  Problem being that with my computer (~1yr old Dell XPS 13) seems to constantly skip or pause every few minutes which after 10 minutes becomes unbearable, hence, why I always check out Netflix first.  Bought this when they introduced (for 19.99) figured why not, and just trying this out this week.  This thing has been a lifesaver through my Bronchitis (Watching “The Americans” good show).  The interface is simple and easy to use and the remote works flawlessly.  The skipping is non-existent with the stick and now I can enjoy the streaming services as they are intended to be enjoyed.  Thank you amazon!!!", "verified": true, "helpfulness": "0/0", "author": "forney"}, {"rating": 4.0, "review": "So Easy! Found the Prime TV much easier to navigate then what I was previously using on the Xbox platform. Still playing with the apps but loving  it so far.Only con is on the Prime TV I would like to see the recently watched with a little less digging.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "It is simple to use and works great on both tv's. We bought two!", "verified": true, "helpfulness": "0/0", "author": "mark wannamaker"}, {"rating": 5.0, "review": "I love the Fire TV Stick!!  I had been using AirPlay to display Amazon content on my TV, and that was loaded with issues.  Speed, buffering, sometime just nothing at all.  I thought, I would pay to fix this...and I did!  The speed on the Fire TV Stick is impressive.  Much, much faster than AirPlay, and seems even faster than my other devices where I'd watch content.  The selection on Prime is just unparalleled, the speed is so satisfying, the overall ease of use is great!  The only thing that I'd like to see updated is the search interface, but it's as good as anything comparable.  And the power - at first I hoped this was a re-chargeable stick, or that it would draw power off the TV directly - it does not, and requires an outlet close by (the cord is too short for my set up so I have this horrible extension cord glaring at me at the moment).  But this is a great product, would strongly recommend to anyone using iOS and AirPlay who is a lover of all things Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Thomas McDermott \"TM\""}, {"rating": 5.0, "review": "Got it hooked up and running (easy to do) and we love it!  Now can access to our TV all our Prime movies, games, etc...", "verified": true, "helpfulness": "0/0", "author": "marcelleedith"}]