[{"rating": 2.0, "review": "I bought this mainly to watch MLB.tv. True to a few of the other reviews, the quality of MLB.tv is pretty lousy. There is a significant amount of buffering -- a lot of buffering. So much so that you can't enjoy the flow of a game when the game is delayed every 20 seconds. If you're buying this to use the MLB.tv app, look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Turcotte"}, {"rating": 5.0, "review": "I bought one of these for my nephew when they first came out and it works great. I love how easy it is to watch Hulu and Netflix, and he enjoys Twitch and the games he can play. Right now I'm looking at buying another Fire TV Stick for myself. It's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Harper Kingsley \"Harper\""}, {"rating": 5.0, "review": "It is very fast with virtually no lag. Great user interface. I debated between this and the Roku 3. I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "randy hayes"}, {"rating": 5.0, "review": "Easy to use, set up and installation took no time at all.", "verified": true, "helpfulness": "0/0", "author": "Mrs.Diane drew Langlais"}, {"rating": 4.0, "review": "I like that you can put this to sleep.  I had a Roku HD and the thing always stayed on. Super irritating. I hope this continues to work well. Lots of apps to choose from.  The layout makes it appear there is more to it than the ROKU. There is and there are more apps as well.", "verified": true, "helpfulness": "0/0", "author": "Three quarters full \"Thanks for Reading - Deekster\""}, {"rating": 5.0, "review": "awesome value", "verified": true, "helpfulness": "0/0", "author": "Real Help"}, {"rating": 5.0, "review": "Overall good, does freeze up kind of often and need to be rebooted.  But great for the price.", "verified": true, "helpfulness": "0/0", "author": "J.G."}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Alivia Johnson"}, {"rating": 1.0, "review": "In the history of terrible tech products--Windows 3.1, Me, Vista, Palm OS, FitBit, Fire TV Stick will surely be remembered as one of the worst.I bought this thing for two reasons: Netflix and YouTube. The YouTube app does not work at all.  When you try to access YouTube content, the stick either crashes and reboots or crashes and shuts off.  Netflix worked fine for the first 5 minutes, then crash, crash, crash.", "verified": true, "helpfulness": "0/0", "author": "Brett England"}, {"rating": 4.0, "review": "Good job.", "verified": true, "helpfulness": "0/0", "author": "Gandalf"}]