[{"rating": 5.0, "review": "Grate my kids love it so do i must get", "verified": true, "helpfulness": "0/0", "author": "matthew minton"}, {"rating": 5.0, "review": "It does exactly what I want it to do.  I wanted it because I didn't want to spend the extra money to have the wifi built into my TV ... this saved me probably $70-100 over the price of a similarly sized TV with Smart capabilities.  If you have a PS4 or a Wii U or whatever ... you'll wonder why you got this (I know I did).  But it rocks for a TV in a room that has no cables run and where I had no inclination to run any cables.  Throw the TV on a mount and you have exactly one cable to hide (the power cable for the TV... because this can get it's power from MOST - not all I found out on my other TV - USB ports)", "verified": true, "helpfulness": "1/1", "author": "Karl R Harmdierks"}, {"rating": 5.0, "review": "Love it! Easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Davis"}, {"rating": 4.0, "review": "Links all our amazon products together ,works great", "verified": true, "helpfulness": "0/0", "author": "Richard P Myers"}, {"rating": 3.0, "review": "I bought this device for $19 when it was first announced. For that price, it was a fantastic deal.This device provides virtually unlimited content for any media display with an HDMI input. When combined with a Netflix or Amazon Prime membership, you can spend all your free time watching movies and TV shows. The controller is easy to use and intuitive. My parents are in their 60s and haven't had much trouble navigating this unit. Very easy to use overall.Unfortunately, the fire stick is hampered by a lackluster wi-fi antenna in this unit. My parents have this unit about 15 feet away from their Verizon Fios router and additionally there is a wi-fi extender about 10 feet away from it and STILL the connection is bad and this is on 100mbps down and up.It is most certainly a hardware flaw. Since I have one of the first units, they may have fixed this, but buyer beware.", "verified": true, "helpfulness": "1/1", "author": "Tyler A."}, {"rating": 4.0, "review": "Works surprisingly fast. Meets my expectations. Looking forward to more channels.", "verified": true, "helpfulness": "0/0", "author": "Cybrsrfr"}, {"rating": 5.0, "review": "Works Great..!!!", "verified": true, "helpfulness": "0/0", "author": "Durwin Humphrey"}, {"rating": 5.0, "review": "we love our fire stick! it has opened a new world for us!", "verified": true, "helpfulness": "0/0", "author": "sally"}, {"rating": 4.0, "review": "Firestick was nicely delivered, and easily connected to my wifi system. However, we have a slow system -- this is a vacation house -- only 3mg download speed. And basically, at that speed the firestick doesn't work. It might download a movie .... not in high def and so not worth watching. Even the TV shows available were hard to download and watch because of the speed issue. Also, at 3mg, it's really slow and takes forever to do much of anything. So will bring it home where we have 20mg of download speed and see what happens. Stay tuned.....  J Stephens", "verified": true, "helpfulness": "0/0", "author": "J Stephens"}, {"rating": 5.0, "review": "Works great.  Having fun with all new access to movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Linda"}]