[{"rating": 5.0, "review": "Just plug it in, let it update and you're ready to rock and roll.  Fantastic video playback on both Amazon Prime and SPMC/XBMC.", "verified": true, "helpfulness": "0/0", "author": "D. Brundage \"Data Dude\""}, {"rating": 5.0, "review": "These are a great solution for TV's in the guest bedrooms, master bathroom, etc.  I picked up two of these at the pre-order price - can't go wrong!I replaced my single FireTV (which was split to feed two TV's) with two Fire Sticks.I use these for Amazon Prime video and with Plex.  Both work great!These both did require the use of the USB power supply (which was included) on my LG TV's.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "All apps work great. Youtube can be cast from my computer and phone. The sideload ability is super. I should have bought more than one.", "verified": true, "helpfulness": "0/0", "author": "imeve"}, {"rating": 5.0, "review": "I'm really impressed with the Fire TV Stick after a couple days of use.  The menus are responsive, and watching amazon prime content couldn't be easier.  It adds a ton of functionality to my dumb TV.  I only wish they were in stock for xmas presents.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Wilk"}, {"rating": 5.0, "review": "Amazing device for its price range", "verified": true, "helpfulness": "0/0", "author": "Mohan"}, {"rating": 5.0, "review": "Works great and the android remote app makes searching and navigation way easier", "verified": true, "helpfulness": "0/0", "author": "Andrew Lucchesi"}, {"rating": 5.0, "review": "Very good unit. Responsive no lag at all and plus be able to sideload xbmc make this unit worth every cents", "verified": true, "helpfulness": "0/0", "author": "Alain Kwee"}, {"rating": 5.0, "review": "Very easy to use.  Remote control makes navigating very simple.  Great Wifi connection.  Will likely buy another for second TV", "verified": true, "helpfulness": "0/0", "author": "Lawrence E. MacStravic"}, {"rating": 5.0, "review": "Enjoying the Fire TV Stick.  Was easy to install has more features then I thought.", "verified": true, "helpfulness": "0/0", "author": "Joan Clarke"}, {"rating": 4.0, "review": "Great addition to my game room TV.", "verified": true, "helpfulness": "0/0", "author": "Paul James Micklos"}]