[{"rating": 5.0, "review": "Economic alternative to chromecast and apple tv. We use it mainly for youtube. Speed is good and never runs into problem", "verified": true, "helpfulness": "0/0", "author": "tamulemon"}, {"rating": 5.0, "review": "If there were 10 \"stars\" to hit, I would! Why did I ever wait so long to get this!? My lovely husband bought be Fire Kindle last Christmas so I could read books on Kindle. Stupidly, we bought the Chrome Stick that I can't connect my Kindle to, but the quality of Chrome Stick is awful! At first I resented having to buy another stick that APPEARED to be the same as the Chrome! BUT IT'S NOT! Using this system with the Amazon Fire TV Stick is fun, easy, responsive with no glitches. Look no more. Make no more comparisons. This is what to buy, without a doubt. I forgot to mention, when using this application, you can control your tv by speaking your requests. Although the stick comes with a remote, adding this app on your Kindle with allow you to talk your requests without using the remote. Just love this!", "verified": true, "helpfulness": "1/1", "author": "DebMcDonald"}, {"rating": 5.0, "review": "Works very well - should have ordered itmonths ago", "verified": true, "helpfulness": "0/0", "author": "Alex R Markley"}, {"rating": 5.0, "review": "Absolutely love Amazon's Fire Stick!  I'm not tech savvy so had a few bumps installing but figured it out without having to call for help.  I loved it so much that my sister ordered one and I helped her install hers. Went easier the second time.  Main problem is remembering user id' and passwords.", "verified": true, "helpfulness": "0/0", "author": "Barbara Mandry"}, {"rating": 5.0, "review": "simple to install and simple to use.", "verified": true, "helpfulness": "0/0", "author": "lobo_man \"lobo_man\""}, {"rating": 5.0, "review": "Easy to install. Does what it advertises. Reception from modem excellent.", "verified": true, "helpfulness": "0/0", "author": "mrep1943"}, {"rating": 4.0, "review": "I like the Fire box better but this one in compact and works great as well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it's small and puny, but it actually performs very well. I don't use it for much. Netflix and the game \"You Don't Know Jack\", but it surpasses my needs. It's also very cool you can download an app to use your phone as a remote. I'd recommend it.", "verified": true, "helpfulness": "0/0", "author": "Brandon Major"}, {"rating": 5.0, "review": "Very great", "verified": true, "helpfulness": "0/0", "author": "anna karides"}, {"rating": 1.0, "review": "I really hoped to use this, but found no use for it.", "verified": true, "helpfulness": "0/0", "author": "Artur Manasyan"}]