[{"rating": 5.0, "review": "This product works exactly as advertised. Set up was simple and seamless.", "verified": true, "helpfulness": "0/0", "author": "Jim Wall, D. Min."}, {"rating": 5.0, "review": "Great so far", "verified": true, "helpfulness": "0/0", "author": "justin bell"}, {"rating": 5.0, "review": "Great I love the fire stick", "verified": true, "helpfulness": "0/0", "author": "Tremayne Lipford"}, {"rating": 3.0, "review": "When watch Youtube it's extremelly slow!!", "verified": true, "helpfulness": "0/0", "author": "liqiang du"}, {"rating": 4.0, "review": "Arrived when promised. Easy installation and lots to chose from by way of content.", "verified": true, "helpfulness": "0/0", "author": "D. Myrick \"Lily D\""}, {"rating": 2.0, "review": "In all honesty I had HIGH expectations for this, and at first it met them, but after a while the issues really start to pile up. It disconnects from the internet almost always(I made sure it was not my WiFi signal already) and channels like Netflix, Hulu, and YouTube are continuously skipping ab buffering. It makes me wish I had spent the extra money and purchased another Roku.", "verified": true, "helpfulness": "1/1", "author": "kyla"}, {"rating": 4.0, "review": "I only give 4 stars because although it did arrive on time and worked as advertised.  My internet connection was not strong enough and I was constantly frustrated by the non stop buffering.  I gifted it to a friend who said it works great in their home.  So my word of warning here is make sure you have a strong internet service provider or you will be in for aggrivation.", "verified": true, "helpfulness": "0/0", "author": "Deeo100"}, {"rating": 5.0, "review": "I am  technologically-challenged and a pessimistic doubting  grouch to boot.  I always assume everything will be less than advertised.  But the Fire stick has been excellent.  Set up was easy - even for 'my own self'.  Combined with Prime it makes an excellent and very affordable (and huge)  movie library.  And I got it for the $19 opening special (long since gone BTW).  If you have a really crappy Internet connection.it could diminish the utility of the stick (or any similar device that uses an Internt signal).", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "I have been enjoying this thing for the past couple of months. This is a great addition with some really good movies.", "verified": true, "helpfulness": "0/0", "author": "smhebert"}, {"rating": 5.0, "review": "this is  an amazing product!!!  very easy...", "verified": true, "helpfulness": "0/0", "author": "isabel"}]