[{"rating": 5.0, "review": "Great!  Super easy to connect.  Great options to view the Amazon library (pay and streaming); great synch with Amazon music.  Definitely a plus that I can use my iPhone as a remote and stream pics from my phone right to the TV through the Stick.  I bought this one when it was a promo to Prime members (for $20).  Glad I made the purchase.  If you have a smart TV it may not be needed, but its great for those TVs (without pre-built apps) that have USB and if you have access to wifi or a direct Ethernet hookup.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "get yours i got mine.", "verified": true, "helpfulness": "0/0", "author": "mcbride493 \"kozmo\""}, {"rating": 4.0, "review": "Overall I like the device.  It is fairly small and user friendly.  I wish the cords were a bit longer though.  Also I was quite disappointed to not be able to access VUDU....that being said it definitely delivers value for the cost.", "verified": true, "helpfulness": "0/0", "author": "KILLERKEV"}, {"rating": 1.0, "review": "The only reason I bought it is to have a standalone App for Spotify, nowhere said that it is Spotify Connect, not the complete app, with this you have to use your phone to stream music. (exactly the way I didnt want to, I aready have an old Apple express, and it sucks)Everything else is worthless for me, because I live in Mexico, and won't let me view the movies or HBO or all the other stuff, because my IP is not in the US. (I bought it knowing this)", "verified": true, "helpfulness": "0/0", "author": "E. A. Manzur"}, {"rating": 5.0, "review": "I really dig this- but need to address my request. I plan on being a member but I can not affored the $99.00 right now. You went into my checking account without my permission you need to reverse the charges NOW or I will take this to the media. You are already in trouble for not doing the right things. REVERSE THE CHARGES THAT YOU STOLE FROM MY ACCOUNT. THIS IS ILLEGAL WHAT YOU DID", "verified": true, "helpfulness": "0/0", "author": "sande smith"}, {"rating": 5.0, "review": "Easy to use and no problems so far...", "verified": true, "helpfulness": "0/0", "author": "Robert Goodnow"}, {"rating": 5.0, "review": "Nice little device, and clever remote design. Great price and value.", "verified": true, "helpfulness": "0/0", "author": "Steven cadena"}, {"rating": 1.0, "review": "Be very very careful in attempting to learn how to use your stick, it is very easy to \"purchase\" items you are trying to watch .I am an  Amazon Prime member and attempted to watch the Vikings on my new \"stick\" and ended upgetting charged for a so called \"purchase\" of an episode of the Vikings that  I should get for freebut was charged nonetheless.  For some reason Amazon does mot make it very clear how to correct thismistake on their web page. So this is the only way I can bring to the attention of Amazon Prime members that be VERY VERY carefulhow you learn to use their product or you may end up \"buying\" a lot of so-called free material.", "verified": true, "helpfulness": "0/0", "author": "sparky"}, {"rating": 5.0, "review": "If you are already a Amazon prime member this is a no brainier to pick this up", "verified": true, "helpfulness": "0/0", "author": "Matt Crocker"}, {"rating": 5.0, "review": "Very easy to use. Just plug in and download the apps that you like and enjoy. I purchased it to use on my daughter's TV in her playroom. Lots of children learning apps and games that are fun and free. Good price for all that you get.", "verified": true, "helpfulness": "0/0", "author": "C. Joseph"}]