[{"rating": 5.0, "review": "Outstanding.  Used at home in USA and decided to take abroad. Traveled to Thailand and now in Auckland New Zealand.  The device works perfect and is easy to use with either the remote control or the iPad/iPhone Ap.  Ability to use with Hotel WiFi is a huge plus. If you travel you should get the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Larry L. Reid"}, {"rating": 4.0, "review": "Excellent product.  The reason I didn't give it five stars is because I can't use it for Xfinity to go and I can't connect it to the hotels Wifi.", "verified": true, "helpfulness": "0/0", "author": "Valarie Ann James"}, {"rating": 2.0, "review": "I haven't been impressed at all. The remote's buttons lasted all of a week before they lost all their liveliness and feeling. The buttons feel like garbage and have zero responsiveness, specially the main circle navigation button. Very difficult to use now.My LG tv for some reason doesn't recognize the signal unless I click a button to wake it from sleep before I turn the TV on.I bought this with the idea of traveling with it, and hear there was a software update to support connecting to hotel WI-Fi, so I guess that's nice. Haven't tried it yet.I bought it for Sling, or got it free for paying for 3-months of Sling. Been happy with that experience for the most part. I understand Sling is working out some things from their system.I enjoy watching Hulu and Netflix better on my old Apple TV that is plugged directly into my router. The HD seems to be way better than the Fire Stick over WI-FI.Would I recommend it? Meh.", "verified": true, "helpfulness": "0/0", "author": "Robert M."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "The stick works great. Have to say there isn't a large selection of movies that I haven't seen already.", "verified": true, "helpfulness": "0/0", "author": "Curtis W Smith"}, {"rating": 5.0, "review": "I have been very happy with how easy this is to use and the sound and picture quality.  It also loads up very fast using my wifi.Easy to use and navigate.  TONS of content to explore.  Amazon is brilliant!  I love being a Prime Member!", "verified": true, "helpfulness": "0/0", "author": "ColoArtist \"hummingbird\""}, {"rating": 3.0, "review": "Works great with prime and good with Netflix.  Other apps, such as MLBTV, Fox sports, NBA, work much better on other platforms.", "verified": true, "helpfulness": "0/0", "author": "Scott Peters"}, {"rating": 5.0, "review": "A must have.", "verified": true, "helpfulness": "0/0", "author": "Esteban Paez Jr."}, {"rating": 2.0, "review": "Didn't work as advertised. NO SOUND but thanks for asking.My apple TV works much better.  Odin", "verified": true, "helpfulness": "0/1", "author": "odin oldenburg"}, {"rating": 4.0, "review": "I have really enjoyed being able to use the fire stick- so many options and always working", "verified": true, "helpfulness": "0/0", "author": "Michele"}]