[{"rating": 5.0, "review": "I travel quite a bit and am often stuck in the evening hotel rooms.  I used to watch Netflix or Amazon Prime Videos on my work laptop.  No more.Now, I when I settle into a hotel room, I hook up my Amazon Fire Stick through the television HDMI connection.  The Fire Stick has no problem logging on the hotel's WiFi.  It will deal easily with passwords and login screens.  Once hooked up, I am no longer forced to skip through hundreds of home shopping channels and endless commercials.  I can watch what I want to watch when I want to watch it.It's also great for listening to Amazon Prime Music or for Amazon Prime Photos.  My wife can take a photo on her smart phone and it automatically uploads to Amazon Prime Photo.  Then, when I get to my hotel room, I can go to the photos on the Fire Stick and see all the stuff she has photographed that day.  It's just that easy.", "verified": true, "helpfulness": "0/0", "author": "The Williams Family"}, {"rating": 5.0, "review": "cannot use the app though", "verified": true, "helpfulness": "0/1", "author": "Veronica Austin"}, {"rating": 4.0, "review": "I bought this to power a Sling TV subscription and it works perfectly. It's similar to a Roku in UI design and works quite similar. The only thing I worry about is the HDMI extender cable. It looks like it could put a lot of stress on the stick and damage either the stick or the port of on the TV.", "verified": true, "helpfulness": "1/2", "author": "Scott Radcliff \"Scott Radcliff\""}, {"rating": 4.0, "review": "Still learning how to use it and what is a free service and a pain service. Thought we would get more with our Amazon Prime but its tricky you may click on what you think is FREE and still see a change. No Fault of Amazon just that learning curve. The Device was quick and easy to set up and the remote comes in very handy. For the price I could not pass it up. So of the downloaded Apps are nice but they seem to be limited on what you would expect.", "verified": true, "helpfulness": "0/1", "author": "Steve of PA"}, {"rating": 5.0, "review": "Best thing I've purchased in awhile!", "verified": true, "helpfulness": "0/1", "author": "Ian"}, {"rating": 5.0, "review": "The TV Stick works great, we just plugged it into the HDM1 port & started watching & enjoying a variety of TV shows & movies. Excellent, quick response to choices, no long wait. We love it.", "verified": true, "helpfulness": "0/1", "author": "EVE SIMPSON"}, {"rating": 4.0, "review": "I would have given 5 stars if all series and shows were available to watch on Prime instead of needing Hulu or Netflix, etc.", "verified": true, "helpfulness": "0/1", "author": "Adriene Goldstein"}, {"rating": 5.0, "review": "Luv it", "verified": true, "helpfulness": "0/1", "author": "Cleveland jones jr"}, {"rating": 4.0, "review": "Worked immediately. Definitely worth it even if you don't have Prime.", "verified": true, "helpfulness": "0/1", "author": "Janelle Chapman"}, {"rating": 5.0, "review": "Great product!! Works exactly as described!!", "verified": true, "helpfulness": "0/1", "author": "Andrew J. Weick"}]