[{"rating": 5.0, "review": "Super easy to use. Love it! Worth the price!", "verified": true, "helpfulness": "0/0", "author": "Nikitta Saunders"}, {"rating": 2.0, "review": "I'm so angry. I received Fire TV for Christmas, works beautifully. I bought a stick for a second tv and the remote wouldn't connect. Amazon sent me a whole new Fire Stick and this one, while the remote registers, it will not hold the WiFi connection even after logging into my router and changing the channel and the remote itself I ALMOST THREW IT ACROSS THE ROOM. Every time I tried to select ANYTHING, it skipped to a complete different option. What should have taken me 20 seconds to do, took me 5 plus minutes. Ridiculous. I might just get another Fire TV and avoid the stick all together.", "verified": true, "helpfulness": "0/0", "author": "alissa c"}, {"rating": 5.0, "review": "Amazing I love my fire stick as much as getting a smart tv! Super easy to use and reasonably priced! Would buy again!", "verified": true, "helpfulness": "0/0", "author": "angel"}, {"rating": 5.0, "review": "I never thought I would say this, but it's so cool!!  Much better than Chromecast", "verified": true, "helpfulness": "0/0", "author": "kk"}, {"rating": 1.0, "review": "Unable to get my working. Loads and freezes. Are they usable in Canada?", "verified": true, "helpfulness": "0/0", "author": "Jane Stewart"}, {"rating": 3.0, "review": "Wouldnt work with my modem in another rm...sheesh.Returned at p.o. and they lost my package....but amazon replaced my refund.Amazon is the greatest 😀But im very angry at the p.o.....2nd package they lost!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Such an amazing tool. Makes even YouTube videos clear as a bell. I have a $2,000 pc that can not display videos as well, it does triple screen, but no videos out in triple anyways.", "verified": true, "helpfulness": "0/0", "author": "Tim Chitwood"}, {"rating": 5.0, "review": "I love it", "verified": false, "helpfulness": "0/1", "author": "Rebecca Orban"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "BadandDirtyBooks"}, {"rating": 5.0, "review": "Alot better than charter tv tks", "verified": true, "helpfulness": "0/0", "author": "Will Blair"}]