[{"rating": 4.0, "review": "This was a gift.  Easy to install.  So far so good.", "verified": true, "helpfulness": "0/0", "author": "Mermaid \"Retired\""}, {"rating": 5.0, "review": "I had the chrome it was great for what it is used for I just felt that this was the next step up and I love it.", "verified": true, "helpfulness": "0/0", "author": "T. Hughes \"TyHughes\""}, {"rating": 4.0, "review": "Like the fact there are no commercials but either internet sucks but it did buffering a few times.", "verified": true, "helpfulness": "0/0", "author": "M. A. Brown"}, {"rating": 4.0, "review": "Works fantastic, way above my expectations!!", "verified": true, "helpfulness": "0/0", "author": "Christine De Vallee \"bookbandit\""}, {"rating": 5.0, "review": "The Fire TV stick has transformed the way I watch TV.  60% of all television now comes through the Fire TV stick.  This is a huge upgrade over the Apple TV I had a few years back.  Super fast processor allows you to rapidly browse and jump around to different apps and features.", "verified": true, "helpfulness": "0/0", "author": "McSizzle"}, {"rating": 5.0, "review": "Love this item! When I got it I couldn't wait to hook it up. Makes viewing my Amazon Prime and Netflix so easy. Way less effort to control compared to the Smart TV features on my Samsung. I also love the portability. I'll be taking this when I travel and hooking up at my hotel.", "verified": true, "helpfulness": "0/0", "author": "PAMELA L. SMITH"}, {"rating": 5.0, "review": "I had the Google Chrome version, but it will not plan Amazon instant video so I got this.  Very easy to setup and get going.  The wifi on it appears a bit better then the other one also.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Before my son got me the FireStick about a month ago I did not take advantage of my Prime membership like I wanted to because of the inconvenience of dragging my laptop in and hooking up to my computer every time I wanted to watch something.  Now that I don't have to do that I am watching more movies and taking advantage of more of the benefits, such as listening to all the music available to me.  I love it. I no longer have cable so this works out perfectly for me as it works with Sling TV, HuluPlus, etc. I also love the beautiful background scenery. Possibilities seem endless.", "verified": true, "helpfulness": "0/0", "author": "cathy"}, {"rating": 5.0, "review": "We love it! The only problem is getting my husband not to talk like the guy on the commercial Gary Busey.", "verified": true, "helpfulness": "0/0", "author": "Hip mom \"Toni B\""}, {"rating": 4.0, "review": "Works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Chad"}]