[{"rating": 5.0, "review": "Very cool product.  So easy to \"install\" and register.  Great performance, tons of options.", "verified": true, "helpfulness": "0/0", "author": "DMc \"DMc\""}, {"rating": 5.0, "review": "Love this thing, its awesome!", "verified": true, "helpfulness": "0/0", "author": "Billy"}, {"rating": 5.0, "review": "Hard to beat for the Prime discount.  I could used it to balance a wobbly table at a cafe and it still might be worth it.", "verified": true, "helpfulness": "0/0", "author": "Pathfinder"}, {"rating": 5.0, "review": "I just received the Fire TV stick.  Set up was easy and navigation was easy as well.Because of the convenience, I will use it instead of the similar features on my Smart TV.", "verified": true, "helpfulness": "0/0", "author": "New Yorker"}, {"rating": 2.0, "review": "I plugged it in it took a while of fiddling for my brand new 60\" TV (less then 3 months old) to recognize it.  Once it did recognize it, the set up took forever.  Once it was set up I didn't realize I wold need a Prime account registered in my name to get any of the Prime streaming.  I bought it under me but the main Prime account holder is my husband.  We hate each other so I guess I need to fork out the money for my own Prime account in order to get any of the streaming benefits.Then it froze up.  Twice.Then I realized that there was no iOS ap for it yet, and you have to use the remote which is fine I guess except I have a universal remote that doesn't pick this up yet.  I'm annoyed I have to keep track of a tiny remote.So far, I don't see it doing anything that my PS3, Xbox, Smart TV and Chromecast don't already do except take up a spot on the HDMI ports on the back of my TV.  I'm not sending it back because I got in on the $19.99 deal, so I'm hoping they will fix all the bugs and release the ap for my Apple home.", "verified": true, "helpfulness": "1/1", "author": "MsFancyPantz \"MsFanctPantz\""}, {"rating": 1.0, "review": "I'm easy to please, especially when it comes to electronics. This however, was such an incredibly frustrating experience.I followed the instructions explicitly, set up the stick on the HDMI port with all the necessary cables, and placed it directly next to my modem/router (with excellent signal/speed and minimal other gadgets using it). I tried it on multiple ports on my TV, but rarely got the device to even register on my TV. Most of the time the screen remained black, though a handful of times it did flash 'Amazon' briefly then immediately went back to black. The remote didn't help turn it on either - even tried several different batteries in case that was the missing link. I tried anything and everything from the booklet and support and the help forum. No luck.I know the stick is getting adequate power because it's warm to the touch. It must be something wrong with the stick itself.I was really excited to get this as a cheaper alternative to Apple TV, but I clearly made a mistake - I should have stuck with a more reputable product.", "verified": true, "helpfulness": "1/2", "author": "Stephanie"}, {"rating": 1.0, "review": "all i get is the message \"cannot connect to amazon\"  which is odd since both my tv and bluray player can connect.  waste of money", "verified": true, "helpfulness": "2/3", "author": "grrrrrbear"}, {"rating": 5.0, "review": "I don’t do a lot of reviews on the things that I purchase on Amazon.  I read them all of the time here, and base many of my purchases on how good the reviews rate something. That being said, I’m balancing out some of the negative ratings on the Amazon Fire Stick because frankly, some of the reviews here are are written by idiots.I haven’t had any issues with speed.  Yes, the stick requires Wi-Fi instead of being able to directly tie it into your internet like the regular Amazon Fire TV.  I don’t have both items, so I can’t compare the speeds between them.  This is primarily used for work travel to be used on hotel televisions, so that the laptop can be used for work related activities.  Even on hotel Wi-Fi is has worked well.  Perhaps some people who have complained about speed aren’t taking in account their own home Wi-Fi and how many items are using their bandwidth.  Complainers like this are typically the same ones who forget that brick walls disrupt their Wi-Fi signal or think that because their car can parallel park itself that it will keep them on the road while they text in rush hour traffic.Fun fact two?  We have this connected to Hulu Plus, Netflix, and our Amazon Prime account.  These are all paid services.  If you think that you are going to get these or any other service free because an advertisement showed someone using it with the Fire TV or TV stick then do us all a favor.  Get a mirror, look at your reflection within it daily, and spend at least thirty minutes a week building up your self-esteem, because like is going to be hard for your otherwise.Finally, like anything else in life, research goes a long way.  Yes you need an internet connection.  No, it might not work with every provider.  Yes, it is similar to Roku, so having both is stupid.  No, it might not work outside of the US.  Yeah, it comes with a power adapter, so guess what?!  It works best with the power adapter!  Research, don’t be stupid, and for the people of tired of reading your life fails.In conclusion, we have had no issues with our Amazon Fire Stick.  We researched, use it effectively, and are really happy with it.  We also got it for 19 bucks, which made it even better.  It is a great deal nonetheless.  I recommend it to everyone.  Even stupid people.", "verified": true, "helpfulness": "1/1", "author": "Michael D. Menendez"}, {"rating": 2.0, "review": "The stick only works if the usb cable is plugged in. Doesn't that defeat the purpose of having a Stick!!??  My outlet is a few feet from my HDMI port so I have a long extention cord running across the floor.  My OCD can't handle this.  However after it is PLUGGED in, it does have a better picture and quality than I recieved with my Roku box.", "verified": true, "helpfulness": "0/0", "author": "E. THOMPSON \"\"luv prettyshoes\"\""}, {"rating": 5.0, "review": "I love the Fire TV stick! I was able to get it at the introductory price of $19. Even so I would still recommend it highly at $39. Pretty much all my media content is on either Amazon or iTunes. I have an Apple TV and two Roku 3 boxes. This would be a great gift for someone who has Amazon Prime and doesn't have a streaming device. For my needs, the price and functionality make it a better bargain than Apple TV. I usually use the Apple TV to show pictures of the kids to grandma. But I've been using the Fire Stick now since you can view your photos in the Amazon cloud. Works great! There are games available too but they aren't anything that the hard core gamer would want. I downloaded a bowling game and had fun playing. Overall, it's a really good buy. Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Edward McGinnis"}]