[{"rating": 5.0, "review": "Oh my gosh - it EXCEEDED our expectations.  We had Chromecast and my husband had no interest in it whatsoever.  However, when the Fire TV Stick arrived and I showed him all that was on it, he commented, please leave that little remote where I can find it.  I guess he's as hooked on Amazon Fire TV Stick as I am!  Bravo, Amazon, once again!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer Deb Swanson"}, {"rating": 5.0, "review": "This is great. Set up was so easy even I could do it. Sure beats streaming in with my laptop. I am enjoying it with  my prime and netflix. Great to find something that you like.", "verified": true, "helpfulness": "0/0", "author": "superreader"}, {"rating": 5.0, "review": "Great experience will make me a couch potato", "verified": true, "helpfulness": "0/0", "author": "kenneth peebles"}, {"rating": 5.0, "review": "so far i love my fire stick. i can watch the movies i like in the comfort of my room", "verified": true, "helpfulness": "0/0", "author": "cindyrella"}, {"rating": 5.0, "review": "Beyond my expectation! I am kicking Directv to the curb.", "verified": true, "helpfulness": "0/0", "author": "Steve Cook"}, {"rating": 5.0, "review": "It does one thing my Apple TV does not do- it switches the input on the TV without my having to do it with the TV remote as with the Apple- a nice feature and the remote is better than the Apple.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 3.0, "review": "It's great but I'm mad I can't stream from the amc or HBO apps..", "verified": true, "helpfulness": "0/0", "author": "Dane Hedmond"}, {"rating": 5.0, "review": "I like it got it as a gift for Christmas, easy to use once you get it set up on your TV. My husband help me.", "verified": true, "helpfulness": "0/0", "author": "Judith Timm"}, {"rating": 5.0, "review": "Very happy!", "verified": true, "helpfulness": "0/0", "author": "James Powell"}, {"rating": 5.0, "review": "I love it. So easy to use. So much to choose from.", "verified": true, "helpfulness": "0/0", "author": "Mary \"Mamaw in Ky\""}]