[{"rating": 5.0, "review": "This thing is great! Pretty much turns your non-smart TV into a smart TV. I Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "bryan groda"}, {"rating": 5.0, "review": "Works as expected and received when promised.", "verified": true, "helpfulness": "0/0", "author": "Robert G."}, {"rating": 3.0, "review": "This is a good product, but I was very disappointed and the lack of apps available for it in the App Store. Some of the movie apps I already have on my android phone are not available in the App Store for this firestick which makes it hard to watch the digital copies of my movies.", "verified": true, "helpfulness": "0/0", "author": "Jason Belcher"}, {"rating": 5.0, "review": "Works great....just what I wanted for my TV in the kitchen....now I have more viewing options to choose from.  Prime movies ,TV and music in addition to my DirecTV.", "verified": true, "helpfulness": "0/0", "author": "Frances Petty"}, {"rating": 5.0, "review": "I have a question to ask! Can any one tell me how to download adthe.eu  on my amazon fire strict tv", "verified": true, "helpfulness": "0/0", "author": "mutiu abdulwahab"}, {"rating": 5.0, "review": "Love it!! ❤️❤️", "verified": true, "helpfulness": "0/0", "author": "maria  luisa"}, {"rating": 5.0, "review": "easy to install, works great!!", "verified": true, "helpfulness": "0/0", "author": "Sonya Fox"}, {"rating": 4.0, "review": "I have a apple TV and 2 firesticks. I am happy with them, i just wish they had more apps. for example, i am subscribed to HBO Now, but the firesticks do not have them, so i have to watch it on my apple TV", "verified": true, "helpfulness": "0/0", "author": "missy"}, {"rating": 1.0, "review": "I didn't like the stick at all. I already had a chromecast and it is much more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Selby Bagale"}, {"rating": 5.0, "review": "A best buy for sure for convenience. Easy to install, works great, the remote is fantastic and a low cost item to boot. Had it up and running in 5 to 10 minutes. The most difficult part was opening the remote to put in the battery. After that small hurdle was met, nothing but convenience and made Prime even easier to use. I like simple things that work well and this did!", "verified": true, "helpfulness": "0/0", "author": "Charles Coffey \"Decorah Lion\""}]