[{"rating": 5.0, "review": "Brand new to this service and loving it so far~!!!!", "verified": true, "helpfulness": "0/0", "author": "Jane Gue"}, {"rating": 3.0, "review": "The auto level need to be improved, we needed to set the level at max on the TV when using the stick but  had to reset to a lower auto level when back on the network.", "verified": true, "helpfulness": "0/0", "author": "robert t tobias"}, {"rating": 5.0, "review": "Great. Love the features. Only constructive feedback would be to improve upon its connectivity issues.Its a bit slow at times and seems to hang at times.", "verified": true, "helpfulness": "0/0", "author": "G. Makin \"Gaurav\""}, {"rating": 2.0, "review": "I liked the interface and the software.I thought the hardware was easy to install.It all worked great for about 3 hours, then would not restart.Read online about problems with power cord overheating so I unplugged itStarted up again next day and went out after about an hour.Read more online, found a similar power cord, plugged it in and it worked for a while, then out again.No online hints seems to fix.  Evidently has been a problem for a long time.Should have looked at reviews on sites other than Amazon.Is totally unreliable.  I'm sorry I bought it just because it was cheap.", "verified": true, "helpfulness": "0/0", "author": "Mac Whatley"}, {"rating": 2.0, "review": "I've had the Fire Stick for six months, and at first I thought it was great. So far though, it has completely stopped working once, and today after I hadn't used it for a week or so, the remote died. It took all kinds of internet navigating to get hold of the Fire Stick support people, and then when they asked for the last digits of my CC and the expiration to verify the account, they dropped the call. When I finally got through to somebody again, they processed the replacement of the \"dead\" remote, and didn't even need the info I was asked for previous. So, I have two issues. Why should I need a replacement remote after six months? And why is it so difficult to get through to a live human? Customer service is, and always has been great once you get ahold of them, but it shouldn't be so difficult. The Fire Stick doesn't work nearly as well as I had hoped, I'm not real happy with the movies on offer, and I won't be reimbursed from my Prime account for the time that my Fire Stick was unavailable. If I have any more issues with it, I'm going to replace it.", "verified": true, "helpfulness": "0/0", "author": "p51djm22"}, {"rating": 5.0, "review": "More than expected", "verified": true, "helpfulness": "0/0", "author": "James C LaFoe"}, {"rating": 3.0, "review": "It's  useful as an alternative to connecting my laptop to the TV for Netflix, etc. but it's very limited in the other choices -- at least in the other choices that are FREE. Nowhere in the literature or in the product description does it mention the extra charges required to view ESPN (i.e. no access to Wimbledon) and other services/channels advertised.", "verified": true, "helpfulness": "0/0", "author": "Bernice Lamey"}, {"rating": 5.0, "review": "We have a DVD with WiFi - we no longer use it because the Amazon Fire TV Stick replaces the need for it! The interface is simple and easy to use. Adding applications is a snap. We're addicted - in a good way, and have dropped our Cable TV service!", "verified": true, "helpfulness": "0/0", "author": "Holly"}, {"rating": 5.0, "review": "Wonderful product", "verified": true, "helpfulness": "0/0", "author": "Olyvya Jackson"}, {"rating": 5.0, "review": "It was all that it was described to be. I have used it everyday since I have had it. I plan on buying additional ones for other TV's at home.", "verified": true, "helpfulness": "0/0", "author": "Freida Conn"}]