[{"rating": 5.0, "review": "It's great . I love it.", "verified": true, "helpfulness": "0/0", "author": "JESUS J SOLIS"}, {"rating": 5.0, "review": "while i wish i could watch the news, this is great for tv shows, movies, and the games are pretty fun..  :) An excellent replacement to jacked up cable prices", "verified": true, "helpfulness": "0/0", "author": "Carolyn Parcheta"}, {"rating": 5.0, "review": "Works perfect no problems at all", "verified": true, "helpfulness": "0/0", "author": "dat"}, {"rating": 5.0, "review": "everything was so easy to install and use I am very excited about my new Firestik. I recommend it highly", "verified": true, "helpfulness": "0/0", "author": "Thomas Burkett"}, {"rating": 3.0, "review": "I had some issues with it working and had to unplug my Dish in order for it to work. Kept saying signal not strong enough though wireless bridge right next to it and 4 bars out of 5 in strength. I did watch a whole movie from Prime list with no problem except it did not fill my whole plasma screen. Haven't tried since because when I switched back to Dish my whole screen was pink background. Had to turn everything off and do full reset on Dish system. I am using an HDMI switch since my Plasma only has one.Only other item of note is you don't know how to work somethings and troubleshoot unless its working since system relies on video tutorials. Little pamphlet doesn't help much.", "verified": true, "helpfulness": "0/0", "author": "Debbie W."}, {"rating": 5.0, "review": "Great product easy to setup and use..", "verified": true, "helpfulness": "0/0", "author": "Jason Joseph"}, {"rating": 3.0, "review": "Works great. Just not as many apps available as I thought there would be. I thought I would be able to connect to HBOgo, Comcast and U-verse, but unfortunately can't (yet).", "verified": true, "helpfulness": "0/0", "author": "bkp14"}, {"rating": 2.0, "review": "Worked great the first night I plugged it in. Now can't get Netflix to work after trying everything Netflix support says to do.  The Amazon prime video still works great, which is 50% of the reason I got it. However, Netflix was the other 50%, which DOES NOT WORK!!!And I did check Netflix on phone and PS3 - both worked. So this is amazon's problem!", "verified": true, "helpfulness": "0/0", "author": "parkgirl"}, {"rating": 3.0, "review": "Okay so far, although not able to connect to the PBS networks as promised. To soon to tell about the rest of it.", "verified": true, "helpfulness": "0/0", "author": "Heather Ramsay"}, {"rating": 5.0, "review": "I would highly recommend this to anyone. We received it as a Christmas gift and are not disappointed! I am wondering if we even need a DVR now!", "verified": true, "helpfulness": "0/0", "author": "jabug \"jabug\""}]