[{"rating": 5.0, "review": "Did not think I would use or enjoy this at first, but I love love the Fire Stick, would recommend to anyone! Even with sooo many other options to choose from these days, so many ways to watch TV and Movies, this is easy, tons of options, and so much more enjoyable then I could have imagined. Use it almost daily :)", "verified": true, "helpfulness": "0/0", "author": "vanessa"}, {"rating": 1.0, "review": "It doesn't  work out of USA  and it doesn't aware  you anywhere", "verified": true, "helpfulness": "0/1", "author": "Roberto Suarez \"Attorney\""}, {"rating": 5.0, "review": "Fantastic for Amazon movies, music, Netflix, Hulu plus, and so much more. Thoroughly reviewed all of them (Apple TV, roku, chromecast, etc. - This is the best! You can use an app on your smartphone for voice control. Unless you are a big gamer, this is all you need and you can take your movies and music anywhere you go!!!!", "verified": true, "helpfulness": "0/0", "author": "DameFan"}, {"rating": 4.0, "review": "Great feature set, gets poor to average WiFi signal, at least in my home (About 15ft from the router.", "verified": true, "helpfulness": "0/0", "author": "BT"}, {"rating": 3.0, "review": "Didn't come with directions on how to use the fire stick.", "verified": true, "helpfulness": "0/0", "author": "James Wiggins"}, {"rating": 5.0, "review": "Very convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mikki \"MikkiD\""}, {"rating": 1.0, "review": "Nice to see all selections, they still charge to view old movies, not impressed", "verified": true, "helpfulness": "0/1", "author": "Grace L.Peterson"}, {"rating": 5.0, "review": "Two words. LOVE IT!!!!!", "verified": true, "helpfulness": "0/0", "author": "Nate Olmstead"}, {"rating": 1.0, "review": "The sound skips and the video keep having to reload.  I watch on my other smart tv without the stick and it works fine but the stick doesn't work so well.  I plan on calling Amazon on Monday.", "verified": true, "helpfulness": "0/0", "author": "photobug \"kfjgtn\""}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "RamaKrishna"}]