[{"rating": 1.0, "review": "If I could give it zero stars I would. Would NOT stay connected to the wifi connection. Wifi connection was fine with all other devices. Bought a Roku 2 instead and have not had any problems since. Do NOT waste the money on an Amazon Firestick. It is worthless!", "verified": true, "helpfulness": "0/0", "author": "James Jones"}, {"rating": 5.0, "review": "We had an Apple before this and it was wonderful, but was getting old and you couldn't get YouTube any more.  We decided to try the Fire TV Stick.  Really, you couldn't go wrong, it was so cheap. The Fire Stick was so easy to hook-up and we were ready to watch a show in less time then it will take me to write this review.  BUT, the best thing of all is not only can we get YouTube again and we of course can watch  Netflix, but Amazon Prime and my music is now available on the TV.  Thank you so much, what a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Boyd Ables"}, {"rating": 5.0, "review": "Great outstanding", "verified": true, "helpfulness": "0/0", "author": "retta saulsberry"}, {"rating": 5.0, "review": "I eventually ordered 4 of these after using the first one for a month. I removed cable from two of the three TV's that I installed them on. Two of our bedrooms are only used when we have house guests so Fire TV is a good option.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Feels very Amazon-centric, which may or may not be a good thing depending on your viewing habits.  For me, it feels limited and constrained because of that.  In addition to the Fire stick, I also have a Chromecast and Roku player and they all have their pros and cons.  What I like about the Fire stick is that it has better hardware, although I have noticed some issues in video playback recently, a remote, and I got it at the pre-order price.  Otherwise, I'd have been fine with my old Roku player (which this replaced but the Roku has a lot more options) and Chromecast, which I still use.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "cynthia turner"}, {"rating": 5.0, "review": "My family and I enjoy this device, trust me you can't go wrong with the Firestick! Shipped on the 6th and I received on the 7th. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Darryll"}, {"rating": 1.0, "review": "I wanted to love the Fire Stick so much! It is sadly unusable, as it has an incredibly slow refresh rate and skips several times a minute. We use the Chromecast and Apple TV with no problems at all, I hope they release an update to fix these issues that make the stick pretty much worthless.", "verified": true, "helpfulness": "0/0", "author": "Danielle Gruberger"}, {"rating": 5.0, "review": "Easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "LH"}, {"rating": 5.0, "review": "My daughter and son-in-law bought this for me. He had it set up and running in 5 minutes and I've already watched two documentaries and two movies. It's great, works simply and has a great selection of videos to choose from. The perfect compliment to my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Melody Snider \"Bookstore Lady\""}]