[{"rating": 1.0, "review": "Hard to use and didn't stream very well.  Constant delays.", "verified": true, "helpfulness": "0/1", "author": "E. Brandt \"E. Brandt-loafer\""}, {"rating": 5.0, "review": "Ditched the $150.00 Direct Tv. Love the Firestick. Live in an area without cable!  This has worked great with out Wifi. Can't wait till cooler weather and leaves off the trees when we get better internet service. So glad we went this way.", "verified": true, "helpfulness": "0/0", "author": "Carolyn B. Kitts \"walker lady\""}, {"rating": 5.0, "review": "Just rec'd. Took five minutes to set up and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Sandra K Beatty"}, {"rating": 4.0, "review": "Works  good, sometimes a little slow, but makes not having cable awesome.", "verified": true, "helpfulness": "0/0", "author": "Tannertt"}, {"rating": 1.0, "review": "Very bad product if you think that you can use to see and probe all the functions. I keep using my google chromcast.", "verified": true, "helpfulness": "0/1", "author": "Giancarlo"}, {"rating": 5.0, "review": "Love, love, love it!  Easy to set up and use.  All ages in my household use it - from age 12 to 68!!!", "verified": true, "helpfulness": "0/0", "author": "Joanna L. Hamilton \"Joanna Lee\""}, {"rating": 5.0, "review": "Have the fire TV and bought the fire stick for my other TV. Both give me exactly what I wanted in this product.", "verified": true, "helpfulness": "0/0", "author": "Michaelvie"}, {"rating": 5.0, "review": "Excellent stick...been using it for a few months and it works great...and super fast. Love the Amazon Prime movies feature which is easy enough to find and use via the stick menu.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing ever invented  :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Any app involving playing music using this device simply does not work.Spotify app? The music stops randomly after a few songs.Pandora? Hops, skips, and jumps.Airplay? See the Spotify.Amazon Music? No thanks.If you have a \"Smart\" TV aka a television that has apps then you certainly do not need this dongle. It is cheap for a reason. I am utterly perplexed as to why anyone would ever claim that this device offers any value to your home entertainment system. It's neither here nor there - period.", "verified": true, "helpfulness": "0/0", "author": "Buddy Howl"}]