[{"rating": 5.0, "review": "Very happy with the quality", "verified": true, "helpfulness": "0/0", "author": "Jsilva"}, {"rating": 2.0, "review": "The unit I received seemed buggy from day one but I figured that I would just have to live with it since it was such a new product that the rough edges just hadn't been smoothed out yet.I only use it for an hour or two a couple of times a week so I fugured with such light use it would las t a while and I could just live with the occasional freeze-ups...well, those \"occasional freeze-ups\" have become more and more frequent and now, not quite a year later, the unit has pretty much dies on me. I will be very liberal and say that it only had about 120 hours of actual use on it before it died.", "verified": true, "helpfulness": "1/1", "author": "T. Moffitt"}, {"rating": 5.0, "review": "super easy to use and great picture.", "verified": true, "helpfulness": "0/0", "author": "michael  gunter"}, {"rating": 5.0, "review": "This product has completely taken the place of my cable- I love it!", "verified": true, "helpfulness": "0/0", "author": "Erin Lynch"}, {"rating": 4.0, "review": "Excellent, Love it!! Beats DirectV bill every month hands down!!", "verified": true, "helpfulness": "0/0", "author": "John Kinney"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "christian"}, {"rating": 3.0, "review": "Missing crunchyroll from my roku. Touted as been faster that roku stick so far not seeing it.", "verified": true, "helpfulness": "0/0", "author": "KYTimelord"}, {"rating": 3.0, "review": "Whish it had more options to work with home automation, like savant, crestron, or control 4", "verified": true, "helpfulness": "0/0", "author": "Carl Seelig"}, {"rating": 1.0, "review": "The Amazon TV Stick created an audio problem in our system.  We found the installation directions confusing and could not easily find out what prime TV programs were cost free.  For these reasons we are returning it.", "verified": true, "helpfulness": "0/2", "author": "Avid Collector \"Colibri\""}, {"rating": 5.0, "review": "It is an Awsome thing to have.  I dont have to go to the Redbox and stand in line to get the movie that I want just to find out that is not awaiable.  The movies are great and recent, the games are nice (the ones the kids play with), and all the extra features are great to have at your finger tips.  Great Choice.", "verified": true, "helpfulness": "0/0", "author": "m.taco"}]