[{"rating": 5.0, "review": "Other than get it.", "verified": true, "helpfulness": "0/0", "author": "savvy shoper"}, {"rating": 1.0, "review": "Glitchy. Bought it to stop the pauses from buffering. Disappointed. Better to stick with the blu ray player. It at least updates frequently.", "verified": true, "helpfulness": "0/0", "author": "HappyMamma Bear"}, {"rating": 5.0, "review": "Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Gerry Bass"}, {"rating": 5.0, "review": "Sometimes there is a loading issue but this small stick so powerful and has so many viewing options its better than Roku, apple tv, and chromecast put together.", "verified": true, "helpfulness": "0/0", "author": "nater"}, {"rating": 4.0, "review": "Yes, it is fine, but the google chromecast is easier to use. I can't seem to download apps to my computer or my kindle fire.", "verified": true, "helpfulness": "0/0", "author": "Peggie B. \"Peggie B\""}, {"rating": 5.0, "review": "very nice thanks", "verified": true, "helpfulness": "0/0", "author": "philip stahl"}, {"rating": 5.0, "review": "Like this amazon fire TV stick ever thing i found here", "verified": true, "helpfulness": "0/0", "author": "pedro"}, {"rating": 5.0, "review": "Love the capabilities! Don't love the fact it has to be plugged into an outlet. It wouldn't be that big of a deal but the recommended power cord is extremely short. If it was at least 2-3 ft longer it would be much better.", "verified": true, "helpfulness": "0/0", "author": "Rachel Woodroof"}, {"rating": 3.0, "review": "The stick is easy to use, we've had it for a couple of weeks. Unfortunately, if you have satellite internet, and therefore a data cap, there is no current way to change the quality from HD to SD. Hopefully they can fix that soon.", "verified": true, "helpfulness": "0/0", "author": "J. Ross \"JR\""}, {"rating": 5.0, "review": "ts great got it set up in minutes, sad not all apps work out of the country", "verified": true, "helpfulness": "0/1", "author": "Andres"}]