[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mary Babin"}, {"rating": 2.0, "review": "It is ok I expected more movies", "verified": true, "helpfulness": "0/0", "author": "ALFREDA L. FAIN"}, {"rating": 5.0, "review": "I am really enjoying watching Amazon prime tv and movies on my fire stick! I wish I knew how to stream free July on the fire stick too!", "verified": true, "helpfulness": "0/0", "author": "ppaul"}, {"rating": 5.0, "review": "Very quick and easy to set up and use!!", "verified": true, "helpfulness": "0/0", "author": "MM 44888"}, {"rating": 4.0, "review": "It's been so nice to have almost everything I need on my tv without fighting with something else.I use it primarily to watch Netflix and Hulu, but I love being able to search and see all of the options on Netflix, Hulu, and Amazon Prime.That being said, there are a few things I would change.First, I would add a web browser option. That's my #1 wish. Add a browser so I can watch my school lectures on my tv.Second, update the mobile app. It's just not much use. Add more visual options so I can literally control it. I already have a basic remote. Give me more with the app.Third, the major unlikely part of my wishlist is screen mirroring from my other devices. Specifically from my phone, tablet, and laptop.Other than that, I love this thing! I use it literally daily.", "verified": true, "helpfulness": "0/0", "author": "M. S. Player \"AlecPlaya\""}, {"rating": 2.0, "review": "Just old movies", "verified": true, "helpfulness": "0/0", "author": "Jamie Pohlman"}, {"rating": 5.0, "review": "Excellent product replaced an Apple easy and great Prime line up .Easy install everyone should consider best I've used😎", "verified": true, "helpfulness": "0/0", "author": "John Edwards"}, {"rating": 5.0, "review": "Bought as a gift. I am going to assume they love it", "verified": true, "helpfulness": "0/0", "author": "Mrs. E"}, {"rating": 5.0, "review": "Easy to use and exceeded expectations", "verified": true, "helpfulness": "0/1", "author": "Nancy Burton"}, {"rating": 5.0, "review": "I love it. Kodi runs really fast on the stick", "verified": true, "helpfulness": "0/0", "author": "Elvis Mendoza"}]