[{"rating": 5.0, "review": "i was skeptical at first having read the reviews on the problems with the Fire TV Stick that were occurring in late 2014 but after Amazon solved the issue, now the Fire TV Stick works like a champ!! what an amazing little tool to make your TV that is dumb, smart, very smart...very very nice...and as an added extra, a handy remote that also works great..the whole concept is killer and Fire tv Stick is the best out there for the low price of $39.00!  Unbelievable!!! i recommend anyone that has one of those \"dumb tv's\"  that they like, has nothing at all wrong with it other than there is no way to have netflix etc etc..  to immediately go out and get a Fire TV Stick before the price goes up!", "verified": true, "helpfulness": "0/0", "author": "mark sheythe"}, {"rating": 5.0, "review": "Love it. Bought it for the den TV so I could play kids shows on it. Bonus is it has a parental code so they can't watch ot order stuff they are not supposed to. Easy to use and operate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Amazon Fire is similar to the Roku, but in some ways better, and other ways not.In my view, the fire stick is a bit faster than Roku, and way faster than a TIVO (even a TIVO mini).It provides the best interface to Amazon prime video.  But that is also the downside.Because it mixes apps like Netflix on the home screen with all the rest of the amazon content up front,it is less organized than Roku.  I have also figured out how to watch Time Waner cable on Roku,but have not found that on the fire stick yet.But did I mention the fire stick is fast... really fast.", "verified": true, "helpfulness": "0/0", "author": "jon"}, {"rating": 5.0, "review": "Bought as a gift for my mom who lives out of state. Arrived on time and she was able to set it up on her own without any problems. She's become a binge watcher now!", "verified": true, "helpfulness": "0/0", "author": "Jessica Vrska"}, {"rating": 5.0, "review": "Great product! A nice, worth it, addition for Prime members!", "verified": true, "helpfulness": "0/0", "author": "Lee Sturm"}, {"rating": 4.0, "review": "Cool things,you know.Quick and easy to use.", "verified": false, "helpfulness": "0/0", "author": "Zondlo Laurence"}, {"rating": 5.0, "review": "No more cable or satellite!!! Combine with indoor antennae for local channels.", "verified": true, "helpfulness": "0/0", "author": "Candace C."}, {"rating": 4.0, "review": "I think the Fire Stick was a good buy. I was afraid to buy the FireTV dur to cost difference. I think I will get it now and use this on another TV. Using it on trips in a TV that has a port was something I didn't think about and another good reason for it. Of course, I already was a Prime member so that was another plus.", "verified": true, "helpfulness": "0/0", "author": "Stephen Feinland"}, {"rating": 3.0, "review": "Comparing Samsung Smart TV (circa 2013) vs Chromecast, TV Stick because SmartTV is so slow. All can access most services.Samsung SmartTVPros - works w- Harmony remote.Cons - Slow. Samsung keeps moving top apps around to suit their marketing agenda. Having to use remotes to enter text.ChromecastPros - ability to seamlessly transition from device to TV. Ability to use keyboard of device to find content.Cons - need for a device to be casting. Often want to do other things with device. Is hard to know what Chromecast is doing (state) because you can't tell who was doing what with it last.Kindle TV StickPro - Interface to all services in one place. Has an app for keyboard.Cons - Overall info architecture is clunky and hard to navigate. Confusing where to look for things in categories - favorites, recents. Hard to access the apps we use frequently. Netflix had problems streaming - fast/slow periods. Can't get Harmony remote to work with it.", "verified": true, "helpfulness": "0/0", "author": "Karl Mochel \"kalmdown\""}, {"rating": 2.0, "review": "The last update makes Hulu stops a lot, I never had the issue before the last update.", "verified": true, "helpfulness": "0/0", "author": "Leonardo"}]