[{"rating": 5.0, "review": "Ever since I ordered the fire stick, I have enjoyed everything. I wish I had known of it sooner. This was a great idea.", "verified": true, "helpfulness": "0/0", "author": "Cle Ester Roberts"}, {"rating": 2.0, "review": "This thing basically sits in a corner collecting dust. Prefer the Chromecast over this any day of the week. Great idea, poor execution. Amazon in general (like HBO or HULU) needs to invest in streaming video to folks with less than optimal connections. Netflix beats the pants off them in this regard.", "verified": true, "helpfulness": "0/1", "author": "B. Tyler Burton"}, {"rating": 1.0, "review": "NOT AS MUCH FREE CONTENT AS I EXPECTED", "verified": true, "helpfulness": "0/2", "author": "King of Burbank \"King Of Burbank\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "povol"}, {"rating": 2.0, "review": "Started using Firestick shortly after I received it.  Set up was easy.  It worked fine the first time. Then I found it did not always work. Network settings was the problem occasionally.  The last 7 times I tried to use it I could not get it to work. \"Connected with problems...\" is the message I receive.  How could this be? My tablet and cell phone connect to my wireless network with no problems.  Researched help steps and nothing seems to work.  I am totally disappointed and frustrated.", "verified": true, "helpfulness": "0/0", "author": "Chatham Girl"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tenica Thompson"}, {"rating": 5.0, "review": "This thing has been wonderful!! So easy to use, can switch around different tvs no problem, and works quickly. My ONLY complaint is that the remote is so dang small and solid black we lose it all...the...time!!!", "verified": true, "helpfulness": "0/0", "author": "S. Parker"}, {"rating": 5.0, "review": "Worked like magic right out of the box.  Incredibly simple to set up and easy to use.  Love the picture quality.  Thrilled to have this!!", "verified": true, "helpfulness": "0/0", "author": "profesora"}, {"rating": 5.0, "review": "Love this thing!", "verified": true, "helpfulness": "0/0", "author": "Richard Morris"}, {"rating": 5.0, "review": "We have both the Roku stick and the fire tv stick. Essentially they both do a similar job, however, i prefer the Fire TV stick as the user interface is better and seems faster to browse the content available. This also runs cooler than the roku.", "verified": true, "helpfulness": "0/0", "author": "Martin Bowman \"Martin\""}]