[{"rating": 5.0, "review": "Amazing product best decision ever.", "verified": true, "helpfulness": "0/0", "author": "wilson fernandez"}, {"rating": 5.0, "review": "best thing I ever purchased. Opened up a whole world of movies for us", "verified": true, "helpfulness": "0/0", "author": "gemini girl"}, {"rating": 5.0, "review": "A perfect addition to cable TV - but the remote is difficult to use for fast forward - very sensitive touch.", "verified": true, "helpfulness": "0/0", "author": "Barbara \"Teacher in Training\""}, {"rating": 1.0, "review": "I bought this to use in the bedroom, but it struggles to connect to a wifi signal that is at full strength on my DVD player and my iPad in the same location.  Unless you can plug this into a TV that is directly on top of your router, spend the extra $$ and get yourself an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Abby F."}, {"rating": 4.0, "review": "I like it.Pros: You can install Kodi.Cons: Remote is too sensitive.", "verified": true, "helpfulness": "0/0", "author": "R Shah"}, {"rating": 5.0, "review": "I have Fire stick & box(2 different TV's) & they both work very well. The Fire stick is for a tv on my back deck & connects to all of the Amazon prime video thru wifi just fine. Very pleased with these purchases & would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "William M. Nichols \"Uncle Bill\""}, {"rating": 5.0, "review": "Works as advertised. Even got it to work over a hot spot in my camper", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a Chrome Cast and the Amazon Fire TV Stick is 20 times better! I have never lost a connection,  I do not have to worry about getting up to go to my device to change the movie, or when I answer my phone to lose the connection- I have literally lost a connection on the Chrome Cast so many times I just turned off the TV and put the thing in a drawer. The Fire TV stick  with the remote is all you need!  Now if those cable TV Apps were made free or have a flat rate then it would be world changing!", "verified": true, "helpfulness": "0/0", "author": "Enid Fire"}, {"rating": 3.0, "review": "The jury is still out for us on the Amazon Fire TV Stick.  We have run into some problems with it being connected to our WiFi.  Sometimes it works great, and other times we can't even get it to work, despite other devices in the house working just fine.  Based on some internet searching, it appears I am not the only person having this problem.  However, when it does work properly, I have been impressed and I really like having the option of watching Amazon prime shows on my non-smart TV.  But for the connectivity issues, I would be giving this a 5.  But when the issues are there, it is extremely frustrating and my rating drops significantly.", "verified": true, "helpfulness": "0/0", "author": "colbs714"}, {"rating": 5.0, "review": "This does exactly what I needed it to do! I love that I can move it throughout my house without any problems. Just plug it in.", "verified": true, "helpfulness": "0/0", "author": "snd"}]