[{"rating": 5.0, "review": "I am pleased with the product.", "verified": true, "helpfulness": "0/1", "author": "Chuck Bush"}, {"rating": 3.0, "review": "I think I got a defective one. I have to constantly unplug it and plug it back in and sometimes it just signs off the network randomly. At first I thought it was my wireless router because I was having issues with that too, but I changed my router and I have even got a new internet provider, every thing else on the new router works just fine but I am still having issues with the stick. I loved it because its small and easy to move from room to room and has all the necessary apps I need. It's just frustrating to have to keep unplugging and plugging.", "verified": true, "helpfulness": "0/0", "author": "Laurene DaRosa"}, {"rating": 4.0, "review": "Wish it was wireless.", "verified": true, "helpfulness": "0/0", "author": "Michael LeWinter"}, {"rating": 5.0, "review": "The Fire TV stick was simple to setup.With a good wireless connection in your home network, the Movies and Music stream without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 5.0, "review": "Best purchase ! Works like a charm", "verified": true, "helpfulness": "0/0", "author": "Charles A Hunter"}, {"rating": 5.0, "review": "This is the best thing I've purchased in a long time, so easy and my family love it!!!", "verified": true, "helpfulness": "0/0", "author": "Mamie"}, {"rating": 4.0, "review": "This is exactly what I was hoping it would be. I purchased the Fire Tv for my living room and the Fire Stick works just as well only $60.00 cheaper.", "verified": true, "helpfulness": "0/0", "author": "Richard Gutierrez"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/1", "author": "Richard E. Gruis"}, {"rating": 3.0, "review": "The product looks well made and has potential if you have a strong signal. We were wanting something more user friendly than going through our older WII to access Netflix. It would not load an episode. Had to plug the old WII back in. The menu and possibilities were impressive, but our basic DSL did not have the strength to make it work.", "verified": true, "helpfulness": "0/0", "author": "beatwalker"}, {"rating": 4.0, "review": "Wonderful product - make sure your internet service is fast enough to support streaming otherwise it's lots of buffering. Easy install and set up!", "verified": true, "helpfulness": "0/0", "author": "Barbara Dziekan"}]