[{"rating": 5.0, "review": "Love, love, love it!!", "verified": true, "helpfulness": "0/0", "author": "Terri A. Lilly"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick!!  It has more than blown me away with the cool features!  AMAZING!!", "verified": true, "helpfulness": "0/0", "author": "David Voy"}, {"rating": 3.0, "review": "It works great, just Amazon Prime has to pay extra for most, not happy with that.", "verified": true, "helpfulness": "0/0", "author": "david b payne"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "MONICA"}, {"rating": 4.0, "review": "Works great. The power cord wasn't an issue for me but one needs a outlet available near by to use. It seems to work for me with the per cord.", "verified": true, "helpfulness": "0/0", "author": "Nightflyer"}, {"rating": 5.0, "review": "Only downside is it does not automatically sleep on no activities and it prevent my TV from sleeping.Upside, I get to continue watching my movie the next day!", "verified": true, "helpfulness": "0/0", "author": "Jency Yang"}, {"rating": 5.0, "review": "I would give the Fire Stick 10 stars if this site would let me.  I purchased it, brought it home, hooked it up and I love it. From the ease of the set-up process, to my first use, it has been great.", "verified": true, "helpfulness": "0/0", "author": "Lesa"}, {"rating": 4.0, "review": "It was just ok", "verified": true, "helpfulness": "0/0", "author": "Barbara Reed"}, {"rating": 1.0, "review": "This was so promising. I've liked amazon branded products in the past. This device is hardly responsive. The remote over predicts and skips 20-30 menus, or doesn't register any key strokes for 30 seconds. I have great difficulty using it comparing to something with as smooth an interface as the apple tv.Additionally, the device will randomly disconnect from it's network indicating poor signal while the signal display indicator indicates very strong.High potential for a product, awful results. A real shame, and a waste of money.", "verified": true, "helpfulness": "0/0", "author": "KMH"}, {"rating": 5.0, "review": "wow what a wonderful item.  Movies, movies,movies", "verified": true, "helpfulness": "0/0", "author": "mac"}]