[{"rating": 5.0, "review": "It's awesome I love it!", "verified": true, "helpfulness": "0/0", "author": "Kamrin"}, {"rating": 3.0, "review": "I wish there were more free options.", "verified": true, "helpfulness": "0/0", "author": "cassie wiegand"}, {"rating": 5.0, "review": "I wrote a review when I first purchased the stick.  Since then the errors have been fixed and this is an awesome device.  I will be putting one on each non-smart tv in my home.", "verified": true, "helpfulness": "0/0", "author": "Simonne Rey"}, {"rating": 3.0, "review": "Already have a Roku, so it really didn't fill a need.", "verified": true, "helpfulness": "0/0", "author": "Rajarshi Guha"}, {"rating": 4.0, "review": "I like the seamless transition between apps. Also using my phone keyboard for searching is a big plus. It would be nice if you could search for movies or shows across all apps with one search.", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 5.0, "review": "It is extremely easy to set up and even my husband is able to figure out how to use it and he's pretty challenged in the electronics department.  I love all the apps you can get on it and I'm so happy to finally be able to watch Netflix in my living room!", "verified": true, "helpfulness": "0/0", "author": "keebers"}, {"rating": 4.0, "review": "Instructions a  little vague for my level of expertise, but I got it done, I think. A little Amazon top heavy, at least don't make the other services as obscure.", "verified": true, "helpfulness": "0/0", "author": "Bert Vinson"}, {"rating": 5.0, "review": "Love it and I am techno limited.  I love my new Fire TV Stick.  Plugged it in, followed on screen questions and it was ready to go.  Great movies and TV series from which to choose.  I was surprised at how much I like the Music from my Amazon Prime music.  For those techno limited as myself, you do have to keep the Fire TV Stick plugged into the electrical outlet while in use.  At first I thought it was like those memory stick which you use on your computer....wrong!  This you have to keep plugged into the port on the TV and the electrical outlet.Congratulations Amazon, this is a winner!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Spencer"}, {"rating": 5.0, "review": "Do enjoy this very much....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great family time!", "verified": true, "helpfulness": "0/0", "author": "Tara Black"}]