[{"rating": 4.0, "review": "It's easy to install and set up.  Great deal for the price.", "verified": true, "helpfulness": "0/0", "author": "Nancy Reininger"}, {"rating": 4.0, "review": "The Fire stick is so easy, so intuitive to set up that even a technophobe can do it.  Now I don't know how got along with out it.  Wednesday is movie night at our house. I used to move my 17\" Dell laptop over to the TV and start-up Netflix, Amazon, or Hulu to select the evening program.  With Fire Stick  it's always movie night and I am seriously considering dropping the Satellite service and saving $95 bucks a month.If you've been thinking about it, just go ahead and do this!  It is definitely worth the time and money,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"THOMAS ORR\""}, {"rating": 5.0, "review": "I absolutely love the fire stick,  it puts cable to shame.", "verified": false, "helpfulness": "0/0", "author": "Kate Keady"}, {"rating": 5.0, "review": "Works Great !!!", "verified": true, "helpfulness": "0/0", "author": "MARK STEELE"}, {"rating": 5.0, "review": "Amazing and fast!!! Unfortunately it doesn't work on my older TV in the living room, so today I had to either buy a new tv or get the roku1 (still has the red white yellow connections) so I got the roku1 cuz my older 50\"lcd TV still works great....", "verified": true, "helpfulness": "0/0", "author": "Judy m."}, {"rating": 5.0, "review": "Love it. I wish I hadn't waited so long. Very easy to install. Great value for the money. I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "revmary"}, {"rating": 5.0, "review": "Excellent purchase", "verified": true, "helpfulness": "0/0", "author": "Efrain O."}, {"rating": 4.0, "review": "It has worked really well on our TV at home and we are really happy with it.  We did have some issues when trying to get it going at my parents house.", "verified": true, "helpfulness": "0/0", "author": "Ross"}, {"rating": 5.0, "review": "Very easy to install and use.  Runs off of local WiFi or WiFi hot spot in remote locations.", "verified": true, "helpfulness": "0/0", "author": "Frame Up"}, {"rating": 5.0, "review": "I bought this for my husband for Fathers Day. He loves it. There are so many options to choose from. Our granddaughter likes it too. Great item and very reasonable!", "verified": true, "helpfulness": "0/0", "author": "jrmullins"}]