[{"rating": 5.0, "review": "The fire tv stick works great for me. I have a sharp aquious led smart tv. The set up could not have been easier. There is quite the list of apps that you can keep adding to it as well. My only regret is that I didn't order the video game control package with it to play the free video games that it gives you access to. The amazon prime streaming library isn't that great, but if you have Netflix and hulu they both work great through the fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "cody"}, {"rating": 5.0, "review": "Don't know why we waited so long to buy this.", "verified": true, "helpfulness": "0/0", "author": "marybeth \"Lover of life\""}, {"rating": 5.0, "review": "I love this technology.  It is simple to use, simple to install, and works every time.  I have one for tvs in 3 rooms.  When taking with friends/family who also have this device, the only common question is, \"how and where do the 2 batteries go?\".  Answer, they are for the remote control and you have to press and slide half of the back cover off.  Its not all that intuitive, so a diagram or sticker on the remote would be useful.  I also travel with my Fire Stick, since it is easy to install anywhere.  I have had it work in hotels and condo rentals.  That is especially great for children who want to see \"their movies\" over and over again.  I think the fire stick is a real bargain.  If you do have children, please note that it is extremely easy for a child to purchase a movie. This is one device where I suggest you turn off 1 click ordering or active the child restrictions.  If not, a child can order just by touching the button on the remote.  The Amazon Fire Stick is one technology that does what it promises, and I love it.", "verified": true, "helpfulness": "0/0", "author": "Martha A. Debiasi \"md\""}, {"rating": 5.0, "review": "Really enjoying the content.", "verified": true, "helpfulness": "0/0", "author": "Vada Hopkins"}, {"rating": 5.0, "review": "easy to install and it works great", "verified": true, "helpfulness": "0/0", "author": "Handy Man \"Handy Man\""}, {"rating": 5.0, "review": "I have 3 Fire TV units and this stick. They all work great for internet access.", "verified": true, "helpfulness": "0/0", "author": "Eric Anderson \"Gage Man\""}, {"rating": 2.0, "review": "The stick dose not have Vudu on it.", "verified": true, "helpfulness": "0/0", "author": "James R Rivera"}, {"rating": 1.0, "review": "I bought it planing to connect  it to echo. But I  can't do it in a easy way. Is too complicate it .It doesn't cover my expectations. I'm ginving one star. Based on the aforementioned But.. I must recognize that is a good product. I could say that is better than the Apple TV, but this last one is more friendly to use in terms of connectivity  with other apple products", "verified": true, "helpfulness": "1/2", "author": "alonso tintos"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Natasha Matkins"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kathleen Butler"}]