[{"rating": 5.0, "review": "I bought the Chromecast first because the fire stick was on back order, but it wasn't really what I was looking for because it relies heavily on your mobile device, the fire stick fire stick odds exactly what I was looking for. You can watch shows independent from your mobile device, and it also allows for casting similar to the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Met my expectations.  Works well and is fast.  Love it.", "verified": true, "helpfulness": "0/0", "author": "NikonLee"}, {"rating": 5.0, "review": "This device brings new life to a 2nd TV that is not internet ready. I have watched a few movies via Amazon using this over my home WiFi and the video quality was great on my 32\" LCD 720P TV. I was especially impressed with the quality of an old B/W John Wayne movie that was adapted to HD format through Amazon's library. The instructions recommend leaving the device attached to the power adapter while its plugged into the TV's HDMI port - a good idea, since some TV's may not be able to supply enough current through the HDMI ports to fully power the device. The remote control, although of an odd size, worked very well.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Works as advertised best buy for the money", "verified": true, "helpfulness": "0/0", "author": "Richard Proctor"}, {"rating": 5.0, "review": "Love this works perfectly and the games are awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Erik Dabach"}, {"rating": 5.0, "review": "This. Is. Awesome.", "verified": true, "helpfulness": "0/0", "author": "josh"}, {"rating": 5.0, "review": "Easy install and setup, instantly streaming movies and more.", "verified": true, "helpfulness": "0/0", "author": "ljm"}, {"rating": 4.0, "review": "It's very useful since I don't own a smart TV but I wish it had more apps like HBO", "verified": true, "helpfulness": "0/0", "author": "Sage"}, {"rating": 3.0, "review": "The Fire TV Stick works fine but it works very slowly.  Not very practical for flipping channels or even for perusing the TV guide channel that comes with our cable system, because even scrolling through the guide is very slow, but it is great if you know what you want to watch.  Much better than paying for an extra cable box every month.", "verified": true, "helpfulness": "1/1", "author": "Helgo Jacobitz \"HJ\""}, {"rating": 5.0, "review": "Really cool. Stuck watching The Americans.", "verified": true, "helpfulness": "0/0", "author": "John O'Toole"}]