[{"rating": 5.0, "review": "good but the only thing i don't like is that the unit needs to charge in order to turn on", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "It was very easy to use,,, LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Frenchy721"}, {"rating": 4.0, "review": "Pairing the remotes between the Fire TV and the stick is a bit of a challenge, but the customer service was great, and it works as intended. Only reason I don't give it 5 stars is that the voice remote should come with it, how much of a cost difference can it really be and I sdon't want to end up with so many remotes; and they should have designed a way to have the connection draw power from the TV rather than having the additional plug for power coming off the back of the stick, kind of defeats the purpose of the more streamline design.....", "verified": true, "helpfulness": "0/0", "author": "YShop"}, {"rating": 5.0, "review": "I love it, but my WiFi sucks. I probably need an amplifier. I won't buy another one for the other televisions until its compatible w/ HBO Now. I don't really care if the next generation is being designed for voice commands. Please update you apps, specifically HBO Now.", "verified": true, "helpfulness": "0/0", "author": "Joan Faye \"Faylene keep\""}, {"rating": 5.0, "review": "This was one of the best purchases I have made in a long time. It was extremely helpful to be able to access so many programs at the click of a button. I did like that when my internet was producing slow speeds, that it warned me ahead of time that the program I was watching may experience buffering in between.", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}, {"rating": 2.0, "review": "Stick is quick.  First impression of content is not real complimentary.2nd lookDesperately needs less graphics.  Lose the fancy crap and give us real menus.Very unimpressive selection of sites, too.Much prefer our old Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as advertised. I purchased at Best Buy. Only four stars as most hotel WiFi not fast enough for streaming. At home it's great, I will purchse more for all of my guest rooms. Paired with local digital TV it's perfect.", "verified": true, "helpfulness": "0/0", "author": "Anthony Cramer Sr"}, {"rating": 5.0, "review": "Great product easy to set up and move from one TV to another", "verified": true, "helpfulness": "0/0", "author": "Dennis Odgers"}, {"rating": 5.0, "review": "The fire stick was easy to set up and we were quickly able to watch Youtube and Amazon Prime content.  We also like it because its simple to view all of our pictures and videos from our Amazon cloud account.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Being a prime member I wish there was a way to see the movies that are with my prime membership with the fire stick", "verified": true, "helpfulness": "0/0", "author": "Nina J. David \"betty crocker\""}]