[{"rating": 5.0, "review": "Exactly what i wanted.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Grea. But i want another language", "verified": true, "helpfulness": "0/0", "author": "JADENWU"}, {"rating": 5.0, "review": "I am very pleased with it.  It was easy to install which is important to a senior citizen like me, and I like not having the previous bulky sony player that took up more room,  It loads quickly and streams well.", "verified": true, "helpfulness": "0/0", "author": "Debbie Byars"}, {"rating": 5.0, "review": "This device is awesome", "verified": false, "helpfulness": "0/0", "author": "Helen Akaluka"}, {"rating": 1.0, "review": "Unlike my kindle fire tablet, the Fire TV Stick is an complete disappointment. The issue is that even though i can use my smartphone, kindle fire tablet, laptop, & iPad anywhere in my house (connect to network and have a dropped-network free experience) the Fire TV Stick just doesn't stay connected to my network. It works for a few minutes (or seconds) then drops me--repeatedly. I checked my cable connections and verified that the Fire Stick was plugged into the appropriate USB port. After my experience tonight with my Fire Stick not even finding my network, i am sending it back. I live in the city and have good Wi-Fi and shouldn't have to put up with this garbage from an Amazon product. I'll never bother with the Fire Stick again. I should have known that if the batteries were so hard to put into the remote control, this product was not going to work for me!", "verified": true, "helpfulness": "0/2", "author": "Island of 3"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Erin C"}, {"rating": 5.0, "review": "Great value for the money. My dad is absolutely obsessed. I love this buy!", "verified": true, "helpfulness": "0/0", "author": "Hazel"}, {"rating": 5.0, "review": "Only set it up a week ago but it works very easily with the remote", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "greatest tool for watching tv I seen thus far.", "verified": true, "helpfulness": "0/0", "author": "tom watford"}, {"rating": 5.0, "review": "I love my netflix!", "verified": true, "helpfulness": "0/0", "author": "Ashley Fritz"}]