[{"rating": 5.0, "review": "Loved it! It was everything I thought it would be and more! Great job Amazon! 😎", "verified": true, "helpfulness": "0/0", "author": "Joshua Higginbotham"}, {"rating": 5.0, "review": "This is so cool , I have the Apple TV and I like this so much better !", "verified": true, "helpfulness": "0/0", "author": "Cabinet man"}, {"rating": 4.0, "review": "We have two TV's one is a SONY Smart TV and the other is an older Panasonic Plasma that we were using the Sony SMP-N200 - Digital multimedia receiver to access streaming video such as NETFLIX and Amazon Prime. Last night when I got home from the office we had received the Amazon Fire TV Stick. It was hooked up and installed in about ten (10) minutes. We have already accessed NETFLIX and Amazon as well as YouTube and some NEWER APPS. Doesn't have VUDU but it had way to much to browse through on a work night but we intend to explore more this weekend.So far though very pleased with the easy to install and use plus we use the APP on our Apple iPhone too.", "verified": true, "helpfulness": "0/0", "author": "Geno Eckley"}, {"rating": 4.0, "review": "Love it. Simple to set up and operate. Only reason it is not perfect is it doesn't have a VUDU app.", "verified": true, "helpfulness": "1/1", "author": "Joe Kinsella"}, {"rating": 4.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "AGWtnt"}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "0/0", "author": "Shell"}, {"rating": 4.0, "review": "On par with google chrome.", "verified": true, "helpfulness": "0/0", "author": "clearpicture \"nikos_mom\""}, {"rating": 5.0, "review": "I think it is better than the Roku Box.", "verified": true, "helpfulness": "0/0", "author": "Diane Emfinger"}, {"rating": 4.0, "review": "I had the Chromecast and I wasn't able to up my Amazon Prime on it, so I ordered the Amazon Fire Stick. I have to say I LOVE the Fire Stick more then Chromecast. I get more apps and it comes with a remote!!! I have a lot more choices of things to watch and games to play. The only thing that I've had a problem with is the buffering every now and then. I highly recommend the Amazon Fire stick if streaming TV is what your alternative to cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not the sticks fault....", "verified": true, "helpfulness": "0/0", "author": "Steve Longacre"}]