[{"rating": 5.0, "review": "Love my Fire TV Stick! I bought my daughter the Fire TV box for Christmas and we loved it so much I got the stick for myself! Highly recommend both!  So much available content and apps, you can never get bored.", "verified": true, "helpfulness": "0/0", "author": "Sheila D. Schutzenhofer \"disneyfan822\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "bellflowermusicfingers"}, {"rating": 5.0, "review": "work better then the roku!!!!!!", "verified": true, "helpfulness": "0/0", "author": "rich aldo"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 5.0, "review": "My Blueray player was supposed to connect me to my online move subscriptions but more than half the time it said idiotic things like \"physical connection established but cannot connect to the Internet. I've been using the Amazon stick for a few weeks now and am thrilled. It's always connected. It never asks for passwords again. I plan to get another one soon for our second TV.", "verified": true, "helpfulness": "0/0", "author": "Galen Warden \"mama galen\""}, {"rating": 2.0, "review": "I would expected can manage some cable signal as HBO GO  and Fox play as Directv user, but I'm seing that this device can't do it.I'm not living in USA and expect develop service for another zone as South America.", "verified": true, "helpfulness": "0/0", "author": "Francisco Zambrano Donoso / 3767"}, {"rating": 5.0, "review": "Easy to install, easy to use.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Zookeeper"}, {"rating": 5.0, "review": "This thing puts my Apple TV to shame.", "verified": true, "helpfulness": "0/0", "author": "Scooter \"Scooter\""}, {"rating": 5.0, "review": "Great alternative if you don't have a \"smart TV\".", "verified": true, "helpfulness": "0/0", "author": "Harry E. Palmer"}, {"rating": 5.0, "review": "This little thing is awesome! All I wanted it for was to have Hulu and Netflix and it works perfect as well as my amazon prime membership I have everything I want. I love the remote and i can't believe something so small can do all that!!!", "verified": true, "helpfulness": "0/0", "author": "Audrey"}]