[{"rating": 1.0, "review": "I didn't buy a fire stick", "verified": true, "helpfulness": "0/2", "author": "David Tatsak"}, {"rating": 5.0, "review": "I have tried both the Google Stick and the Amazon Fire TV Stick, the Fire hands down beats the other sticks out there. There is no need to use another device, like a tablet, laptop or phone, this is super easy to install and use and at $39 it is affordable for every room in the house!!! Love, love Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "Leslie Spaulding"}, {"rating": 2.0, "review": "Disappointed. I'll stick with my Roku boxes.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "This is amazing!  I had it hooked up in about 3 minutes.  This is awesome!  No commercials to fast forward through!  YAY!!", "verified": true, "helpfulness": "0/0", "author": "BRENDA K."}, {"rating": 3.0, "review": "I have a hard time keeping it connected to our network, but when it does work its not bad.", "verified": true, "helpfulness": "0/0", "author": "R. Downey"}, {"rating": 5.0, "review": "The FIRE TV works well, which could improve it by adding subtitles in Spanish to all series and movies from Amazon Instant Video, for Spanish speakers.", "verified": true, "helpfulness": "0/0", "author": "MANUEL ESPINOZA \"MR.\""}, {"rating": 4.0, "review": "I got it last week and connected at once. It started to work right away perfectly. I cannot give 5 stars since I am a new user of the Stick and would need more time to get an experience to give a more objective assessment. However up to this point it is a fantastic tool and less expensive than other options. If your TV set has only one HDMI socket I suggest you buy a device with two or more socket so that you can also use other items such as cable tv without having to connect and disconnect continually.  I already ordered the latter to make transfers easily. Hope will work also fine. Nevertheless, the stick does not allow non USA customers to rent movies which limits the offer of entertainment. I have detected in the menu several movies that I would like to rent but the purchasing process is discontinued automatically. Amazon should straighten this unfortunate limitation.", "verified": true, "helpfulness": "0/0", "author": "Juan B. Mansfield"}, {"rating": 5.0, "review": "Great product...should have gotten this a lot sooner!", "verified": true, "helpfulness": "0/0", "author": "Debra A. Day \"Just Starting\""}, {"rating": 2.0, "review": "I bought this so I would be able to watch Netflix on my tv. After the Netflix plays for about 15 minutes, it just cuts off and doesn't allow me to watch anything from netflix. It continuously blocks me from all use of netflix and i have to end up unpluging the fire stick and restarting it. What an inconvenience. Not pleased with the product. It seems like they fire stick only wants me to sing up for Prime when I clearly do not want to use it. I prefer Netflix. Please just allows me to watch netflix in peace.", "verified": true, "helpfulness": "0/0", "author": "Gabriella"}, {"rating": 4.0, "review": "This is great product but they do not actually make it clear that it is WiFi ONLY (reason for four stars).  My WiFi is not so great in the living room and I do experience a few times in an evening where characters 'slide' (moving without seeing their legs moving) across the screen.  It seems odd that the video is affected but the audio is not.  I have had a fire tv (box) for 15 months and am thrilled with it.  Prior to purchasing the stick I contacted Amazon tech support to inquire about difference(s) between the box and stick and they only mentioned something about processor speed and memory.  This could be a deal breaker for some.It is possible to use your cell phone as a remote control - which contains voice search.  In the past fifteen months the only results ever returned are for Amazon titles.  I had asked tech support about this as well and was told that if you were in, say, Netflix or Hulu, and did a voice search that you ought to receive items in Netflix or Hulu as well as Amazon.  I have never experienced this.All in all this is pretty great, but remember, if your WiFi is not very strong in the room where you will be using this and if you have ethernet in that room - definitely spring for the box instead of the stick.", "verified": true, "helpfulness": "0/0", "author": "critesl"}]