[{"rating": 5.0, "review": "great item much better then google chrome stick,which i returned", "verified": true, "helpfulness": "0/1", "author": "Thomas F. Klein Jr. \"Tom Klein\""}, {"rating": 5.0, "review": "This is a great thing to have and it has come in handy plenty of times since i bought it barely over a month ago, it gets used 3-4 times a week if not more. I would recommend this if you have Amazon Prime and Netflix but if you only have one of the other is still a good deal if you can find it on sale.I originally missed the 2 day sale on Amazon but i bought it at a local store when it was on sale. It works great and it wasn't a hassle to get it working plus is a lot faster than other streaming sticks i have tried in the past. I know you can play games on this however it doesn't seem like it would be convenient using the standard remote.Overall i can say it's great for streaming and is extremely portable and i would highly recommend this to anybody that wants the portability of a streaming stick without too much hassle setting it up.", "verified": true, "helpfulness": "0/0", "author": "E. Villagran"}, {"rating": 5.0, "review": "This is the most awesome thing ever. I love it. Lot's of free content, easy setup and layout. I've been wanting to buy a Chromecast stick for years, but this fire stick is top notch. I love it. Games for the kids and more channels than any Smart TV I've seen. My next tv will be a non-Smart TV and just add a fire stick. Just awesome.", "verified": true, "helpfulness": "0/1", "author": "David E."}, {"rating": 5.0, "review": "Like it better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Wayne R."}, {"rating": 4.0, "review": "I picked this up when it was $19.99. I am impressed.  think I would still be impressed if I had paid full price. It was simple to install and get running. It is easy to use. It has a ton of free application. the streaming is nearly seamless. I do occasionally have glitches when streaming netflix but I suspect that has more to do with my internet service. Only reason I don;t give it five stars is because the gaming apps all tell me they don;t detect a controller when I download which makes me curious if I can play them through the fire stick. I have not explored this further due to lack of time. However, if gaming can not be done through the stick it should say so clearly. If it can be and controller is necessary it should say so clearly and if can be be and controller is not necessary it should be mentioned somewhere in the booklet it comes with it.", "verified": true, "helpfulness": "0/0", "author": "Jenny Maro"}, {"rating": 5.0, "review": "One of the best purchases from Amazon. This will help if I drop cable TV I will save hundreds of dollars a year", "verified": true, "helpfulness": "1/1", "author": "William M Cammarota Sr."}, {"rating": 4.0, "review": "I just wish there were more apps.", "verified": true, "helpfulness": "0/0", "author": "R.B."}, {"rating": 2.0, "review": "Why does it take so long for validating the PIN? Sometimes it takes forever validating the PIN and I have to quit watching a program. I'm on high speed XFINITY @ 50MBPS.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing.  I wish I could simply leave it at that but there's a minimum character limit.  The fire stick is easy to use and allows me to actually take my Kindle Fire tablet to work.  As an added benefit, besides having a remote and being able to use my Fire to control it, it seems to work better than my Fire for watching TV and is certainly easier.Bravo, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "So far so good! Easy installation and very user friendly. Great value", "verified": true, "helpfulness": "0/0", "author": "Claire Troxel"}]