[{"rating": 2.0, "review": "I was disappointed ! takes way  too long time to download something, then the screen is freezing several times and in addition you don't really have to much free stuff to watch. So, I sent it back !", "verified": true, "helpfulness": "1/1", "author": "Lucky6302"}, {"rating": 3.0, "review": "Still deciding if I should return it, so far had blue screen with error message \"HDCP unauthorized. Content disabled\" two times. Tried moving stick to another HDMI input, with or without HDMI extender cable, and removing USB from it's power adapter. Only fix for me was to reset my Sony Bravia TV back to factory settings. Then re-enter time date and scan for channels  again on the TV. I've only had the Fire TV Stick for 2 weeks and reset TV twice.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "Its works really well. It exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Jonita Harris"}, {"rating": 5.0, "review": "A little different to navigate from Apple TV but worth it bc it costs less.", "verified": true, "helpfulness": "0/0", "author": "mp"}, {"rating": 5.0, "review": "No cable, no satellite but I do have radio transmitted hi speed internet. This little plug in makes a world of difference! Great to actually have options for entertainment beside the standard over the air TV.", "verified": true, "helpfulness": "0/0", "author": "Jam Debris"}, {"rating": 4.0, "review": "I love the Fire TV stick. Lots of new apps", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My 7 years old love and she can control it without assistance. I'm getting one for all my tvs.", "verified": true, "helpfulness": "0/0", "author": "Racquel"}, {"rating": 5.0, "review": "Love the fire stick and using my phone as a remote...my 5 year old was using it on her own within an hour!", "verified": true, "helpfulness": "0/0", "author": "leigha scherer"}, {"rating": 1.0, "review": "you still need to plug the ac power cord for the stick work properly ,on the Google Chromecast you dont need that.", "verified": true, "helpfulness": "1/1", "author": "Nestor J Duran"}, {"rating": 4.0, "review": "It was easy to install. Worked immediately. I was dissapointed, however as I understood it would work with Sling TV. Seems that is a future option.", "verified": true, "helpfulness": "0/0", "author": "Shields H."}]