[{"rating": 5.0, "review": "I absolutely love the Fire TV Stick.  Currently using it for Netflix and it works beautiful.  Have not noticed any lag on the system.  Lots of apps available that you can add as well (like youtube).  Well worth the price to be able to stream movies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "Daniel Jimenez"}, {"rating": 4.0, "review": "Worked great.  Only real con is that it is tied to only the Amazon App Store (but there are ways around that).", "verified": true, "helpfulness": "0/0", "author": "Redpow"}, {"rating": 5.0, "review": "Well first of all, I bought this because I was curious. Little did I know how much I would use and enjoy it. I use it a lot more than I thought I would. Its been my go too over every other box I have, including apple tv and roku. The interface is gorgeous and fluid. Apps are pretty snappy as well.Pros.1. Easy setup. Plug in and follow a few steps and you are up and enjoying.2. Fluid. Everything is fairly smooth. The interface offers all the options but is clean and easy to use and understand3. Speed. I was suprised how well it did on my internet. My internet can usually handle streaming pretty well but this thing has never skipped or stopped to buffer for me yet.4. Small. It fit right in behind my TV. Enough said.5. The remote works well. Ive never had it drop signal or show any noticeable lag.Cons.1. AC adapter. I understand something this powerful may need it but it was a little annoying to install. Not hard. Just annoying.2. Remote batteries compartment was very tough to open. I looked it up on Youtube to make sure I was doing it right.Overall, my expectations have been exceeded, earning the five star. The adapter and remote compartment arent enough to take away one star. Then again, no product is ever absolutely flawless. I would highly recommend this over both Roku and Apple TV. Every single time.", "verified": true, "helpfulness": "0/0", "author": "CarlsFriend on YouTube"}, {"rating": 5.0, "review": "I researched multiple devices that I could use at home to stream movies and tv shows easily and efficiently.  I settled on the Fire TV Stick for a few reasons.  1. I have Amazon Prime and enjoy watching the movies offered.  I was using a Nintendo Wii for the longest time to access Amazon for Movies.  That was just too slow and I wanted something that was advertised as easier to use and faster.  2. The portable design.  I have multiple TVs in the house and didn't want to buy multiple devices for the home.  3.  The Price!  Can't beat the price of the device.  While I ordered it through Amazon, it wasn't going to get here quick enough.  I ended up purchasing through the local Best Buy for the same price offered on Amazon.  I brought it home, took it out of the box and plugged it in.  In less than a couple of minutes I was enjoying all that the Fire TV Stick had to offer.  I have read quite a few reviews about movies freezing on people or having setup trouble.  I'm not sure what they were talking about.  Not only is the device easy to set up and use, but the ability to use my android device as a \"voice\" remote was the topping on the cake!!  I just hit the app on my phone and the tv automatically switches from cable to the Fire TV Stick!  I wish there were more games available for the device, but that is my only complaint.  I also find myself renting movies more now through Amazon due to the high quality picture I get through the device.  I could never get a picture that clear when using the Wii to stream movies.  While the movies are a little more expensive to rent than going through Redbox, the quality and convenience are making me a solid backer of Amazon!  Get yourself a Fire TV Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Mark B"}, {"rating": 5.0, "review": "I purchased a Roku Streaming Stick in december because I did not want to wait for the Amazon to be released.  What a mistake!  After installing the Roku and starting a movie, within 5 minutes the movie stopped I got one of those \"buffering\" circles.  After a few minutes, the movie returned.  This repeated itself every 5 to 10 minutes, despite the fact that the device was ahowing that it was receiving a strong wi-fi signal from my router. The next day, I moved the device to a tv in the room right next to where my router is located.  Same deal, strong signal, movie interupted every few minutes.  I went on the Roku help line to see if the problem could be solved.  The technician spent about an hour with me, having me make changes in the configuration of the device, and configuration of my router.  No improvement.  Finally, I was told that I had to move my device closer to the router.  It was in the next room!I returned the Roku, and ordered the  the Amazon FIre Stick, knowing I would have to wait a month for it to arrive.  Well worth the wait.  Set up was a breeze, and no streaming problems.", "verified": true, "helpfulness": "0/0", "author": "Robert Lerman"}, {"rating": 4.0, "review": "works great!  Lots of free content with my Prime maembership", "verified": true, "helpfulness": "0/0", "author": "Balz Wit \"Spots\""}, {"rating": 3.0, "review": "Im a college student who ordered this for my on campus apartment I was so excited for it to come in. When it came in it was working well BESIDES the fact that it doesn't work with college internet logins. It doesn't let you use the username and password interface to log on so it doesn't work with college or hotel wifi. They should have fixed that from the beginning because most college students are the ones who want this device to be able to stream to their tv. there saying there making an update for it soon hopefully they mean it.", "verified": true, "helpfulness": "0/1", "author": "GN"}, {"rating": 3.0, "review": "At first, I was extremely happy with this little device. Very easy to install and set up. However, a few months in, I am having a problem with error messages with it. Oftentimes, I will be in the middle of a show and it will boot me back to the home page, at which point it will freeze up and tell me I am having connectivity problems with wi-fi... However, when it does this, I have no trouble with the wi fi on other devices. So often I will start a show on the TV using the stick, and then have to go finish the episode on my computer. Then several hours later, I will come back to it, and it will be fine...  Sometimes when I unplug it and let it reboot, it works fine again moments later. Unpredictable.", "verified": true, "helpfulness": "0/0", "author": "Eric Rufa"}, {"rating": 5.0, "review": "Love having amazon prime on my tv downstairs I use it all the time", "verified": true, "helpfulness": "0/0", "author": "Jamin"}, {"rating": 4.0, "review": "I would give it 5 stars if you didn't have to pay extra for the voice remote or the gaming controller. I would've paid a little more up front for those things. Other than that I love this little bit of tech. It runs seamlessly with no lagging, and the best part is it brings my older T.V. into the new era.", "verified": true, "helpfulness": "0/0", "author": "Kamara32"}]