[{"rating": 5.0, "review": "I have an Old XD Roku with HD and there is no upgrade software offer, I do not want to spend $100 for their new box and here's Fire Stick with more memory. My old Roku doesn't have You Tube and is so sluggish. The Fire stick is great for me as I can stream Amazon Prime, Hulu Plus, You Tube, Netflix,.. with one device. The first thing you do when you get this device is the software update and then it's fine. Great product, kudos to Amazon for coming with a great product. PS. I do have chromecast, but I am using fire stick more.. hope more channels/Apps come to Fire Stick in the future", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 1.0, "review": "getting \"unable to update your fire tv stick\" error repeatedly.  Initial update took forever and then the stick kept crashing.  Chromecast is much easier to use and much more reliable.  I'm returning this product and cancelling my preorder to the echo.  Amazon simply hasn't figured out how to do hardware yet.", "verified": true, "helpfulness": "1/3", "author": "Henry Jia"}, {"rating": 5.0, "review": "Great little media stick - only had it for a few days but so far it's great", "verified": true, "helpfulness": "0/0", "author": "Scott Smith"}, {"rating": 5.0, "review": "This thing is so cool! Got it today and love it. If you're a Prime member, and/or have a Fire tablet, you shouldn't hesitate to get this.I had been watching Prime and Netflix with my PS3 but won't any more.The Fire Stick does so much more than just let you watch videos. Your cloud photos and videos are instantly accessible on your TV as well as your music and Prime playlists.The only negatives I can see so far is that there's no off switch, only sleep, and it needs to be plugged in.Oh, and the Prime radio stations haven't made it onto the fire tv yet. Hopefully they'll add those in soon.Everything I've started with it, music, videos, prime movies, etc. has started quickly and played back perfectly.The Fire TV remote app is pretty great too. The voice search was able to decipher everything I said on the first try. La Dolce Vita, Alice in Wonderland, Transparent, etc.Amazon did a great job with this one!I've been using mine all day now and haven't had any problems with the wifi dropping.", "verified": true, "helpfulness": "1/1", "author": "stacey"}, {"rating": 5.0, "review": "This item worked great.  All I had to do is plug it into the HDMI on my TV, plug power supply into it and it was ready to operate.  Next I had to connect it to WiFi and it was up & running.  I was pleased with it.", "verified": true, "helpfulness": "1/1", "author": "Wayne"}, {"rating": 4.0, "review": "I will  start this review from the beginning and in real time.11/30/2014got the stick on time on the 50% off prime member special.I just plugged it in. They do slightly hide the fact you need power or usb connection.The initial firmware upgrade is very slow so far....12/1/2014  UPDATEgot by the firmware upgrades, kinda slow but ok.after that I have to say I am impressed, I only looked at Netflix and Prime Videoboth connected very quickly and almost immediately switched to HD quality.I am liking this very much.", "verified": true, "helpfulness": "2/4", "author": "Kevin Woodward \"KW\""}, {"rating": 2.0, "review": "There's a required tutorial video. It doesn't tell me how to get to \"search\" after installing the Netflix app.Wifi is slow and flaky; other devices play HD content well, but this kept dropping to low bit rates. I asked it to show me family friendly games playable with the remote, and it said there are six. The Wii U has more games than that.I got the initial Prime deal, so I'm happy to have an HDMI-stick computer I can root and reuse for $20.  But for $40, I can't imagine being happy with this.", "verified": true, "helpfulness": "1/2", "author": "Brian and Kat Sniffen"}, {"rating": 5.0, "review": "Just getting started, but, great so far", "verified": true, "helpfulness": "0/0", "author": "Paul D Wilford"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Superbart"}, {"rating": 3.0, "review": "I first bought the Fire TV and was very impressed with the experience. The number of apps were limited, but it had just enough to do what I needed it to do. Then the stick goes on pre-order for $20. Not a bad deal for something I already enjoyed using. As far as I could tell, it was just a smaller, less powerful version of the Fire TV. Well, it is but it doesn't hold a candle to its older sibling! My son was a little bummed out to find that Minecraft would not install on the device and one of the apps I use for accessing media via DLNA fails miserably. For streaming Netflix and Amazon Prime, it is very good. But other than that, it isn't worth your attention. I would just buy the Fire TV. If you have tried neither and you are in the market, buy the Fire TV.Update: 12/15/2014 (3 weeks of sporadic use)I've been experiencing buffering issues for a while, but now I can't watch anything without it buffering every 10 seconds. I'm only 20 feet from my DIR-868L 802.11ac router and it buffers horribly! However, 40 feet away and several wall obstructions, I am able to stream just fine with my Fire TV! My final verdict is that the product is not worth the money and you should stay clear of it at cost!! I will be throwing it in a drawer and chalking it up as a mistake.", "verified": true, "helpfulness": "5/5", "author": "C. Todd"}]