[{"rating": 1.0, "review": "Jumping around with the buttons to skip 10 seconds forward or back often causes connection issues. Even more often, it starts rewinding or fast forwarding even when you don't want it to (it thinks you held the button when you most certainly did not). Because the video keeps playing, you often don't realize this until you press it again and accelerate the fast forward or rewind, putting you VERY far away from the simple 10-second skip you wanted. If I want to go back 30 seconds I should be able to press it three times in succession. Rather than forcing me to wait for it to start playing after the first skip, it should queue up any remaining skip requests and then execute them together. It's inefficient and not user friendly to choke on the first skip and then misinterpret subsequent skips as holding the button for FF/RW or faster FF/RW. I don't see how it's possible to not encounter this problem within 10 minutes of testing this product so I see no excuse for it not being fixed. A long press for FF/RW should be a completely different signal generated from the remote so that it couldn't possibly miss that I let go and pressed it again.On top of that, the interface is horrible with black screens, pauses, moments where you are unsure due to a lack of confirmation etc. For the longest time I thought that the YouTube app was made by a third party pretending to be the official YouTube app because they got the publisher wrong (\"YouTube.com\" instead of \"Google\"). I have about as much confidence in something like that downloaded from the Amazon App Store as I have in downloading all the shameless rip-offs from the Windows Store. I should also point out that there's almost nothing useful that isn't a paid app or one that requires an external subscription.The categorization is laughable. When I want to resume something from Amazon Prime Instant Video, I can't find it under Prime Video. Nope. It's under \"Home\" where a bunch of unrelated stuff is. You'd think that was because they tied in other services to the \"Recent\" category, like Netflix and HBO, but NOPE.I wanted to report how well it works as an AirPlay Video receiver but I don't dare buy an app for that to try it out until I've decided whether or not I am going to return the darn thing. My return period is almost up and I have yet to decide. I hope they can fix these issues with an update, but seeing how long the Amazon Prime Instant Video app has sucked on other platforms tells me that they really don't care enough. They need to fire whoever is responsible for UI.", "verified": true, "helpfulness": "0/0", "author": "Julian T."}, {"rating": 4.0, "review": "Works good and does not freeze up. Good movie and show choices. I have not been disappointed with it at all.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Great product.  Streams channels well.  We were able cut the cable with this and save some money.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Monday"}, {"rating": 5.0, "review": "Works great. Fast easy to use. A plus that u can install 3rd party apps. Way better then appletv", "verified": true, "helpfulness": "0/0", "author": "Richard Rodriguez"}, {"rating": 5.0, "review": "Love it!!!!! Totally worth it!!!", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 4.0, "review": "Bueno", "verified": true, "helpfulness": "0/0", "author": "Jose Guerra"}, {"rating": 4.0, "review": "Great, it works very well.I miss more language options, like Spanish.Another thing is why Kodi is not able to download, like any regular apps. Kodi is a huge video partner for the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Rodolfo Gino Curti Embry"}, {"rating": 5.0, "review": "Nice like it", "verified": true, "helpfulness": "0/0", "author": "Oswaldoreyes"}, {"rating": 5.0, "review": "Works great. Lots of options to use.", "verified": true, "helpfulness": "0/0", "author": "Sara Cain"}, {"rating": 5.0, "review": "Great device! I love having netflix on my tv… making it a \"smart tv\".Inserts into an hdmi slot, which most flat screens should have (double check that).Remote is pretty cool, slim, and functions well.", "verified": true, "helpfulness": "0/0", "author": "Z"}]