[{"rating": 4.0, "review": "Would like to see a little better buffering used Xfinity wifi with 55Mbs pipe and it still has some issues. If you have a solution I would appreciate it.Once you have HBO Now and internet for Indy and F1 racing I will more to amazon Fire 100%. We already have Netflix and love it and have tried Hulu and will add that as soon as I can.", "verified": true, "helpfulness": "0/1", "author": "Steven S."}, {"rating": 5.0, "review": "Great piece of entertainment.  It works right out of the box!!!!", "verified": true, "helpfulness": "0/1", "author": "Francisco"}, {"rating": 5.0, "review": "Great purchase...easy to use.", "verified": true, "helpfulness": "0/1", "author": "Scott McNeil"}, {"rating": 5.0, "review": "The love having the stick. The price was good, in my opinion ($39). It's nice having the remote and being able to watch my Amazon Prime without having to connect the TV to my computer. I have watched more because of the stick. Love it.", "verified": true, "helpfulness": "0/1", "author": "Carol E. Rachal"}, {"rating": 5.0, "review": "Great tablet", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "NO FUSS NO MUSS. i pluged it in, gave it a password and it worked first time out of the shute. Completely portable and even worked at motels when we traveled or used it for a family night at out daughters house. Well worth the price", "verified": true, "helpfulness": "1/2", "author": "TJ-STL \"DVD viewer\""}, {"rating": 5.0, "review": "very satisfied. works great.", "verified": true, "helpfulness": "0/1", "author": "Gig"}, {"rating": 5.0, "review": "Enjoy the Fire Stick greatly, so much that this is the second one I ordered.", "verified": true, "helpfulness": "0/1", "author": "James F. Sharp"}, {"rating": 3.0, "review": "This thing often seems to have connectivity problems.  I am frequently having to forget the network and re enter my wifi info. Meanwhile my chromecast never has issues. Also, FireStick + HBO Go thru Charter is not available,  so again I go back to my chromecast. Disappointing as i love the remote and would prefer to do everything with the fire stick.", "verified": true, "helpfulness": "0/1", "author": "litMargin"}, {"rating": 5.0, "review": "Love the firestorm!!easy to use and set up.", "verified": true, "helpfulness": "0/1", "author": "Laurie Guarneri"}]