[{"rating": 5.0, "review": "My husband loves this! It's easy to use and he can watch his YouTube shows as long as he wants. It's a great product and not expensive!", "verified": true, "helpfulness": "0/0", "author": "M.B."}, {"rating": 5.0, "review": "Easiest electronic piece I've ever purchased to install/setup !!", "verified": true, "helpfulness": "0/0", "author": "Bonnie Gearlds"}, {"rating": 5.0, "review": "Love my Fire TV. I'm on this way more than cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "So far, not pleased.  We had to add another WiFi adapter to our TV, because it was too far from the family room for the WiFi signal to reach the TV.  Previously, our Smart TV was \"hard wired\" to our ISP box, but the Fire TV Stick requires a cordless WiFi connection.  We tried a WiFi extender, but it wasn't strong enough.  Also, when we originally purchased the subscription, the movies we were interested in through AMAZON showed $0.00 as the cost.  After we subscribed, we went to choose those same movies, and they were no longer \"free\".  Additionally, my husband has typical \"man's hands\" and the buttons on the controller are small, resulting in entry problems, so, I just ordered and received on Sunday, the Fire TV Stick with voice recognition.  We haven't tried it yet.  Quite frankly, we should have stayed with NETFLIX (which we still have), and not bothered with the Fire TV.  Also, our Cable provider has video on demand, and the cost for \"brand new\" movies is comparable to the cost of the AMAZON movies, when they finally offer them.  Not so sure if I will renew or not next year - we received the whole package as a gift, which included the new Kindle Fire (that is another disappointment, since everything you are interested in also costs a fee).  AMAZON, I hope you read this review and do your homework - I saved the e-mails with the $0.00 movie offers.  Good luck, hope they post this review - do your homework.", "verified": true, "helpfulness": "1/1", "author": "Louise B Louguet"}, {"rating": 5.0, "review": "Awesome! Seems the receive strength may be a little weak but still a 5 star rating. Like the remote better than using a mobile device like the Chromecast requires. You still have the option to control with device though with download of the app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am thrilled with Amazon's Fire TV Stick! The set up is very quick and it's so simple to use! Well done, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Trisha Cogan"}, {"rating": 2.0, "review": "I think I regret this purchase. I cannot figure out how to get the videos I want to see onto my TV with this application. Videos from the internet — there seems to be no way to stream them onto the TV, and the help documents included in Fire TV Stick are pathetic.It also has some serious problems with wifi. I have an excellent, top-rated router and all my devices have perfect wifi at home now, except for this stupid Fire TV stick, which says it’s not connected to wifi — when trying to watch something, that is. Go to the Wifi settings, and it says it “is connected” with “very good” signal (and it should be — it’s 10 feet away from my router). But no dice.There isn't even hardware restart option in the Fire TV stick menus. You have to know the secret combinations on the remote.Lastly, the iPhone app for fire TV is the worst app I can recall using in my entire life. It constantly forgets which device it’s talking to, which is absurd as there is only one fire TV stick in my house or even on my block, as far as I can tell.", "verified": true, "helpfulness": "0/0", "author": "Alan Hogan"}, {"rating": 5.0, "review": "totally met my expectations, i love it woud most definately reccomend it to all of my friends and family!!", "verified": true, "helpfulness": "0/0", "author": "Nona"}, {"rating": 5.0, "review": "This was a breeze to set up...i did it in two minutes. Works as advertised. .", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 4.0, "review": "Although I purchased my Fire Stick from Staples, I have found it to be extremely easy to use andwork with, I unfortunately don't have experience with the larger version or with competitors's product.But I really like it, simple and direct with Amazon Prime or with others works great.Eventually I will get one for every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Leonard R Smith"}]