[{"rating": 3.0, "review": "I have it hooked up to my Onkyo receiver to take some of the wear off my PS3 for streaming Prime.  It consistently drops wifi, whereas the PS3 streams Prime beautifully with no dropped connections or lengthy buffering, sitting 3' away from each other.  I will try the Fire Stick on a different TV and perhaps the wifi will perform better.", "verified": true, "helpfulness": "1/1", "author": "Magnum"}, {"rating": 5.0, "review": "I have been using the FTVS for a couple of months now and I really like it, especially when used together with Amazon Prime.  The remote is intuitive (and a major advantage vs. Chromecast which has no remote).  I also was able to load additional content providers such as PBS (though these providers do not work so well, at least not all the time, with significant buffering problems).  I wish that casting from android and ios devices was a bit easier/more straightforward but this will surely come with system updates.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Great value!!", "verified": true, "helpfulness": "0/0", "author": "Candelario"}, {"rating": 5.0, "review": "Thank you", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 3.0, "review": "I didn't realize that the stick had to be plugged in in order to use it.  Our flat screen TV hangs on the wall and all of the cords run through the wall, not down it.  It would be a major pain to fish the power cord through the wall as well, so in order to use the thing, we have a black cord running down the wall to the electric socket.  Not the worst thing in the world, obviously, but disappointed that the product isn't just an HDMI dongle as featured in the product photos  The product seems to work fine once set up.  Would be nice to be able to exit out of the intro video.  It was a bit long and elementary.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Carson \"Working Mom\""}, {"rating": 1.0, "review": "This thing is a piece of junk. It has terrible WiFi reception. It couldn't connect when attached to the back of the system, so I used an HDMI extension to get it closer to the router. It still won't connect. It's about 25 feet from the router and every other device I try in that same location connects just fine.", "verified": true, "helpfulness": "1/2", "author": "Robert J. Armijo \"barmijo\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "rhonda clarke"}, {"rating": 5.0, "review": "Love it, love it.  This has turned a TV that is seldom used into a Smart TV.At least it is smart enough for me.  Set up was a breeze.I have netflix and prime.........I still can't get over how easy it was to set up.Thanks Amazon for making your products so consumer friendly!", "verified": true, "helpfulness": "0/0", "author": "Ferret Fan"}, {"rating": 5.0, "review": "Love the Fire Stick.  It was easy to set up.  Now it's possible to work on the computer and and watch my online shows on the tv at the same time!", "verified": true, "helpfulness": "0/0", "author": "Gwendolyn Washington"}, {"rating": 5.0, "review": "We are more than happy with the fire stick very easy to use. We plan to gift one to each of our children. The delivery time  was a lot longer than expected availability needs to match the demand.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]