[{"rating": 2.0, "review": "Bought amazon prime it makes you pay for most  TV shows after watching 1st show, not what I expect thought it would be free after paying for membership.", "verified": true, "helpfulness": "1/1", "author": "Joylenn Aragon"}, {"rating": 5.0, "review": "Pro: Price, performance. Streams HD content without a hitch over our 12 MBps connection.Cons: The remote is rudimentary. We haven't tried the phone app yet.", "verified": true, "helpfulness": "0/0", "author": "CautiousOne"}, {"rating": 4.0, "review": "works great...just wish the Prime membership had more free movies and TV channels. Really better with Netflix or something. Better if the fire stick worked more like on demand and you could watch TV shows that just happened. But overall good. Easy to navigate, not glitch and good price.", "verified": true, "helpfulness": "0/0", "author": "Jaimie C Tirado"}, {"rating": 5.0, "review": "I searched a great deal on these things and everywhere the Fire TV Stick came up. There is still a lot I do not understand and I'm sure a lot of you out there do, wish I did, but I decided one day to just order this and give it a try. I am not a rich person but I am home a lot and I enjoy watching TV. This was easy to install and worked right off the bat. Can't say I understand any more than before but I do get to watch a lot of movies I didn't have to buy. I am hoping and waiting for the day when I can have this for every tv in the house and I can shut off the high priced cable bill. Thank you Amazon !", "verified": true, "helpfulness": "1/1", "author": "cinram"}, {"rating": 3.0, "review": "Nice  if your very close to a router  otherwise  stay away, overall not  bad", "verified": true, "helpfulness": "0/0", "author": "Markus Wolfe \"markus\""}, {"rating": 1.0, "review": "The only reason I still have this piece of crap is that it was a gift. I've been a roku user for a few years.  The amazon fire device is much more difficult to set up,  the user interface is a mess,  and there are hardly any channels available.  About the only thing it is good for is to watch amazon prime content - which I can do equally well on my roku.  I'm planning to buy another roku to replace it.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Holter"}, {"rating": 5.0, "review": "The Fire TV Stick is an awesome device!  Not only did it meet, but it exceeded my expectations.  Its very easy to use, and there are a world of apps available for download.  Overall i would recommend this device to everyone.  Its a must have.", "verified": true, "helpfulness": "0/0", "author": "Marlon Smith"}, {"rating": 5.0, "review": "Really like this little thing.  Does it all and the remote is a really nice feature.  Can't beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "dr"}, {"rating": 1.0, "review": "did not meet my requirement", "verified": true, "helpfulness": "0/0", "author": "quang"}, {"rating": 5.0, "review": "Easy set up. Couldn't be happier. Looking forward to viewing new Bosch series.", "verified": true, "helpfulness": "0/0", "author": "Frank"}]