[{"rating": 5.0, "review": "One stick. One price. One flavor.", "verified": true, "helpfulness": "0/0", "author": "Steve Peraza"}, {"rating": 5.0, "review": "I like it, it is really useful. Good product. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Zhehui Wang"}, {"rating": 1.0, "review": "I got the Fire TV stick today, one of the main reasons I got it was for the Display Mirroring, I have a Fire HD 7 inch 4th gen tablet. The web page at the time of ordering and this review says the following about display mirroring:\"Mirror your tablet or phone on your HDTVShare whatever is on your screen—including movies, TV shows, music, and photos—from your compatible tablet or phone with everyone in your living room using display mirroring. What you see on your **Fire OS** or Android device is exactly what you’ll see on your big screen. Includes support for devices from Motorola, LG, and Google without any additional apps or software.\"No where does it state that it only works with the Fire Phone or the HDX line of tablets you can only use the display mirroring on the Fire TV stick. Again this was the major reason I proceeded to order the stick, if I known ahead of time that my tablet was incompatible I would of held off the order for a long while or not ordered at all.I spent 20 to 30 minutes with Amazon support being transferred to three departments, now the reps were professional and clear I do not blame them for this, nor was this their fault.In the use of the Fire TV stick is actually Good, I find it responsive and nice (better the the Roku box I have used)  But I feel the need to give it one star soley because of the misleading advertising. Second Screen does work, but there were things I wanted to use in mirroring mode that I could not use second screen for. Had screen mirroring worked as advertised for Fire OS devices this would easily be 4/5 or 5/5 for me.", "verified": true, "helpfulness": "1/2", "author": "aaron s"}, {"rating": 5.0, "review": "I think it is fabulous. It seems to override all other HDMI plug in devices, not sure if it Fire TV stick or my Sony", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Great picture and fast.  Bette than the wii setup", "verified": true, "helpfulness": "0/0", "author": "Christopher Hartman"}, {"rating": 5.0, "review": "Thanks to this and the availability of Hulu Plus and Netflix, we don't even miss cable anymore. I hated paying $39 for it, but it has been totally worth the price. Keep an eye on the remote though. It is very small and can easily get lost in cushions or pushed under the couch.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 3.0, "review": "Received on time and as advertised. When it works it's great! But the Fire TV Stick keeps loosing the Wi Fi signal for no apparent reason??! The other 3 computers on the Wi Fi still working, bill is paid but the TV Stick does not? Anybody out there know why? If it worked regularly, I would give it a 5 star", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just wonder how I can get my discount after the told me my tv was obsolete and I bought one before the discount. *sigh*", "verified": true, "helpfulness": "0/0", "author": "Dennis M"}, {"rating": 5.0, "review": "Great! fast, simple to use and great user interface. Can't beat the price either. Amazing.", "verified": true, "helpfulness": "0/0", "author": "johnnydoggs"}, {"rating": 5.0, "review": "Simple to install, works great!", "verified": true, "helpfulness": "0/0", "author": "Paul"}]