[{"rating": 5.0, "review": "Easy set up! Great product. Now I don't have to fight with the kids to stream Netflix on their game console! #WINNING", "verified": true, "helpfulness": "0/0", "author": "DTerminedtoBeMe"}, {"rating": 4.0, "review": "It's been a few weeks now since we've been using the Amazon Firestick, and for the price, yes, this was a great deal! It does need to be rebooted every time we want to use it. Next purchase will be something on the higher end.", "verified": true, "helpfulness": "0/0", "author": "K. Martin"}, {"rating": 4.0, "review": "Very happy with this product.  User friendly!!", "verified": true, "helpfulness": "0/0", "author": "Angie73"}, {"rating": 5.0, "review": "So happy with my purchase . It was easy to set up with the instructions both printed & the video. Wish I had gotten it sooner now that I have had prime .I would recommend it over any of the others like Roku if you have a prime account . It was recommended in Money Magazine.", "verified": true, "helpfulness": "0/0", "author": "mary radwell"}, {"rating": 4.0, "review": "Great!!! The only negative thing is that everything seems to be about money. Have to rent movies that have been out for a long time.", "verified": true, "helpfulness": "0/0", "author": "venegas6"}, {"rating": 5.0, "review": "GREAT!!!", "verified": true, "helpfulness": "0/0", "author": "Robert Wojcik"}, {"rating": 5.0, "review": "IN LOVE WITH THIS! EVERYONE IN THE HOUSE HAS ONE IN THEIR ROOM. IT IS SO MUCH MORE CONVENIENT FOR EVERYONE THEN TELEVISION, WELL AND CHEAPER! AS WE NEVER WATCHED CABLE ANYWAYS. THIS WAY YOU WATCH WHAT WE WANT WHEN WE WANT. WE MAKE SURE WE TELL EVERYONE ABOUT THIS. EVEN OUR KIDS TELL PEOPLE ABOUT IT, THATS HOW MUCH THEY LIKE THEIRS.", "verified": true, "helpfulness": "0/0", "author": "gena"}, {"rating": 5.0, "review": "easy to install and fast to setup and wow it was nice it work from the first time I try it.", "verified": true, "helpfulness": "0/0", "author": "Wrong type of cable sent"}, {"rating": 5.0, "review": "Very user friendly.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Lmi31"}, {"rating": 5.0, "review": "We LOVE our fire stick! I bought this because I wanted our Prime shows to play on our upstairs tv. It does so much more than that!! My six year old is ecstatic that he can play games on the tv and I love being able to access our music as well. Such a great product!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]