[{"rating": 5.0, "review": "Worked as well as my Fire TV box. Love the form factor love how well it performed.", "verified": true, "helpfulness": "0/0", "author": "Bobno"}, {"rating": 5.0, "review": "Great Device and a necessity for anyone looking to watch TV or Movies on their schedule!!!", "verified": true, "helpfulness": "0/0", "author": "justin silverstein"}, {"rating": 5.0, "review": "So easy to use. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Darlene A."}, {"rating": 4.0, "review": "I like the multiple show options and the clarity is great. My only complaint is it keeps freezing for some reason. I also have a Google chromecast and it streams easier than the fire stick, but the first stick has more options and shows way better. Overall I'm satisfied.", "verified": true, "helpfulness": "0/0", "author": "Tianna"}, {"rating": 4.0, "review": "Found it easy to install. Easy to access news and other channels, Amazon prime TV videos and youtube videos.", "verified": true, "helpfulness": "0/0", "author": "Joseph Ponnoly"}, {"rating": 5.0, "review": "exceptional value for the price, Prime has many videos to enjoy. I recommend it .", "verified": true, "helpfulness": "0/0", "author": "L. Cab \"LCab\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Ayush"}, {"rating": 4.0, "review": "Great product.  Easy to set up! Works faster than our bluray player.", "verified": true, "helpfulness": "0/0", "author": "Amber Woudema"}, {"rating": 5.0, "review": "I have either a Roku or an Amazon Fire TV or TV stick in/on every TV in the house.  I like the Plex menu best on the Roku but for the money, I love the Amazon Fire TV Stick.  This item is fairly idiot proof and doesn't require cable clutter.  I have seen reviews where people have to remove their Fire Stick to reboot it between uses, if that's the case I would call Amazon and send it back because it sounds like you have a bad one.  Amazon's support is excellent.Aside from just the sheer stupid simplicity of setting up the device, the wide array of additional apps is another big draw for me.  I have the usual streaming suspects but have just discovered other gems like Crackle (Comedians in Cars Getting Coffee) and of course Ted Talks.Did I mention the lack of cable clutter?  Oh, and if and when you lose your remote your smartphone can be used as your remote.  Smart, very smart.  No cable clutter!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"n_eng\""}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick, works Great, very easy to set up and easy to use!I may have to retract my previous statement!", "verified": true, "helpfulness": "0/0", "author": "Charles R. Pires Jr."}]