[{"rating": 1.0, "review": "We've had the Fire Stick for approximately 24 hours.  This was sold to us as a step up from the Google Chromecast.  My experience so far has not shown that to be an accurate assessment.  First issue I had was when I tried to set up Starz Play (which I already had setup on my phone).  I couldn't get the activation to work until the next morning.  Granted that was likely an issue with the activation system, but bottom line was I couldn't use the Fire Stick to watch that night.  Even tried to cast from my phone to no avail...switched back to Chromecast and was able to cast it from my phone.  Tried to get Starz Play working the next morning, was able to activate, things started to look up.  Tried to browse through the movies and started seeing it hang, or at times it would behave as if I was holding down the down button and keep scrolling through to the bottom where it would become unresponsive again.  Tried power cycling, and was able to filter the list and scroll through movies (in Starz Play).  Tried playing a movie and notice the sound is horribly out of sync with the video.  I tried turning off Dolby Digital and the videos are then in slow motion with no audio.  So with no Dolby Digital it's completely unwatchable, and with Dolby Digital it's painfully unwatchable.  Doing some investigation I found a thread on Amazon customer forums where users explain similar behavior with HBO Go for the past several months with no resolution and no help from support.  With a Chromecast, I have yet to see this issue.  Very disappointed with what should have been an upgrade.", "verified": true, "helpfulness": "2/3", "author": "Jennifer Overturf"}, {"rating": 5.0, "review": "easy to set up, reasonable price and kids loved the games.  We remove when not using because it causes TV to default to this versus our satellite.  Recommend changing that but otherwise happy with the product and would definitely recommend", "verified": true, "helpfulness": "0/1", "author": "annie"}, {"rating": 4.0, "review": "still getting use to it but very interesting and lots of options", "verified": true, "helpfulness": "0/1", "author": "Rudy"}, {"rating": 2.0, "review": "it says i have a strong internet signal but yet the movies keep stopping for 10 min at a time, it is so annoying  I gave up my sony player because i hated the wires, i would take that back in a heart beat", "verified": true, "helpfulness": "1/3", "author": "sandra finnegan"}, {"rating": 1.0, "review": "I returned it. It did not have the TWC app available.", "verified": true, "helpfulness": "0/2", "author": "KIP"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Krysta M."}, {"rating": 5.0, "review": "Excellent value.  Easy to set up.  Keep adding movies - the more the better.", "verified": true, "helpfulness": "0/2", "author": "Tammie J"}, {"rating": 2.0, "review": "Ours broke.", "verified": true, "helpfulness": "0/4", "author": "JCW"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/3", "author": "Brenda E. Santoyo \"Gaviota\""}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/2", "author": "lawrence"}]