[{"rating": 5.0, "review": "my granddaughter set it up for me it took no time.", "verified": true, "helpfulness": "0/0", "author": "pheboo"}, {"rating": 4.0, "review": "It is amazing I just wish it had a Dish Network app or connection!", "verified": true, "helpfulness": "0/0", "author": "Nicole Romano"}, {"rating": 1.0, "review": "seem like it should be great but I can't get it to work.", "verified": true, "helpfulness": "1/1", "author": "Joy McFarlane"}, {"rating": 1.0, "review": "I bought the Fire TV Stick to connect to Netflix. It worked great on the first day. Now I have connection issues. I don't know if it's Netflix, the stick or both. I will be calling both for tech support tomorrow.", "verified": true, "helpfulness": "0/0", "author": "Jon M Ayers"}, {"rating": 5.0, "review": "Excellent! No problems- no complaintsDelivers fast reliable streamimg", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "So far, the Fire TV Stick is awesome. I find it slightly easier to use than Google Chromecast because it has a remote control that you use to select the apps/shows right on the TV. I also really like that it is compatible with Amazon Prime videos (of course) and Showtime's on demand app. However, a HUGE deficiency is that it does not support HBO Go. I did not realize this when I purchased it and had I known that, I may have bought the Chromecast again (even though it broke several months into use). Granted, Amazon does offer HBO shows, but not anywhere close to the extent of what you can view on HBO Go. Amazon has a limited number of seasons and does not have the new releases, so unless you want to catch up on old HBO content it's pretty much useless in that regard. Hopefully it lasts longer than the Chromecast....", "verified": true, "helpfulness": "0/0", "author": "Tori"}, {"rating": 5.0, "review": "Easy to set up and use....and cheap!", "verified": true, "helpfulness": "0/0", "author": "Chris Chavez"}, {"rating": 1.0, "review": "Works for two smaller TVs but not our main 56\" Samsung.  We tried everything and it keeps coming up \"Not supported mode\"!  Very disappointed!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 2.0, "review": "Works as described but very let down with the phone app. I already had purchased a Chromecast before the fire stick which I loved! Chromecast seamlessly can stream any content(any videos, songs, web videos) from your phone with the touch of a single button to your tv/home theater system. I Will be buying another chromecast and throwing this in the drawer of other poor purchases.", "verified": true, "helpfulness": "0/0", "author": "Laurie"}, {"rating": 5.0, "review": "Works very well and is a lot faster than the browser on our smart TV.  Tons of stuff to explore and watch.", "verified": true, "helpfulness": "0/0", "author": "Brenda"}]