[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Kylie Willis"}, {"rating": 1.0, "review": "never use it,  shows cost too much, wish I never ordered it", "verified": true, "helpfulness": "0/0", "author": "Chris Becker"}, {"rating": 4.0, "review": "Good product, I have problems with windows 8.1, it crash ever 30 minutes", "verified": true, "helpfulness": "0/0", "author": "Giovanni De Los Reyes"}, {"rating": 5.0, "review": "LOVE, love, love it!!!!!!  I keep asking myself why I didn't buy it sooner.  Everything about it is fantastic.  Available movies, programs, series, are seemingly endless.  I am in AWE!", "verified": true, "helpfulness": "0/0", "author": "Gem's Girl"}, {"rating": 5.0, "review": "Pretty pleased with this low-priced, but full-feature gadget. Streams beautifully and gives me options I don't have on my locked down Samsung Smart TV, notably Amazon Prime Video.", "verified": true, "helpfulness": "0/0", "author": "pddaddy1959"}, {"rating": 5.0, "review": "Another streaming device.  Does a great job.  Just one complaint in that you need another electrical outlet to power the dongle power supply.  Would have been nicer of the TV USB could have supplied the required power.", "verified": true, "helpfulness": "0/0", "author": "Stanley J. Wynman \"Wynman\""}, {"rating": 5.0, "review": "Excellent investment! So much easier than hooking up the laptop!", "verified": true, "helpfulness": "0/0", "author": "Heather M Browne"}, {"rating": 5.0, "review": "I already have the Amazon Fire TV on my main TV in the living room.  Thanks to Amazon Prime Day, I got this one as an addition for my bedroom TV.  It is awesome, as I already knew it would be!!  Has everything from Prime.", "verified": true, "helpfulness": "0/0", "author": "Linda Bondy"}, {"rating": 4.0, "review": "I did read reviews about how frustrating it can be, when sometimes it wont connect. But, I just turn off my tv and turn it back on, and the stick works just fine. It's finicky, but that's probably why there's already a newer version out. It's a good price and makes my dumb tv into a smart tv. AKA netflix device. It's legit a good price and does what it's supposed to, 99% of the time.", "verified": true, "helpfulness": "0/0", "author": "biznatchplz"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "teri castro"}]