[{"rating": 5.0, "review": "Easy to use. Fast to turn on and navigate through. Would recommend not buying the voice remote and just downloading the free phone app!", "verified": true, "helpfulness": "0/0", "author": "CEL"}, {"rating": 4.0, "review": "I'm rating the Fire TV Stick 4 instead of 5 because so far I've been unable to use it on my main TV (which is a large Sony Bravia). My internet modem is upstairs in a bedroom and is apparently too far away for a strong connection downstairs where I'd like to use the Stick. It's working great on my smaller HDTV upstairs, in the same room as the internet modem. If anyone has suggestions for correcting this issue, please let me know. But keep in mind that I can't move the modem.", "verified": true, "helpfulness": "0/0", "author": "Liv Jackson \"SLJ\""}, {"rating": 5.0, "review": "Now I have a smart TV and loving it!", "verified": true, "helpfulness": "0/0", "author": "C. Swallow \"mscheryl700\""}, {"rating": 2.0, "review": "was not happy with product it was returned to best buy where it was purchased", "verified": true, "helpfulness": "0/0", "author": "David Baughman"}, {"rating": 5.0, "review": "Easy to set up and use - works every time - tv content is just ok and same for the movies,  if you use the free shipping of Amazon prime the fire stick content is essentially free which make it a great deal , if you don't use the free shipping then you may be disappointed.  iPhone apps are a nice addition and word well ( video, audio, and remote for the fire stick )", "verified": true, "helpfulness": "0/0", "author": "D. Sapp"}, {"rating": 1.0, "review": "I have used Apple TV and a wired connection from my PC for years. But I wanted more content choices and easy portability. Worked great for a week. Now it refuses to recognize any passwords - ones that it has been using for a week. When I reenter it seems unable to connect.. And as to portability, when I moved it from one set to another it lost all the apps and password info, so that's not worth the hassle. Good idea. Good price. But the technical execution seems pretty shoddy to me. I'd wait 6 months until they put a usable product out.", "verified": true, "helpfulness": "0/0", "author": "Pragmatist"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love how convenient this is. It worked right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Yup", "verified": true, "helpfulness": "0/0", "author": "Jason Franklin"}, {"rating": 5.0, "review": "Omg, this is great! Use daily, but, sometimes need to reset by unplugging power. Otherwise prefect and easy to use", "verified": true, "helpfulness": "0/0", "author": "aryndar \"aryndar\""}]