[{"rating": 5.0, "review": "Easy to install and it works great!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Belenky"}, {"rating": 3.0, "review": "Works great but ,Most you would like to see. You will need to pay extra. There are better options out there.", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 2.0, "review": "I actually purchased mine from Best Buy.  I am not impressed with the Amazon Fire TV Stick.  The number of apps is pitifully small when compared to the Roku devices.  I could not even get the subscription CBS app for the Fire TV stick.  The buffering is most annoying.  The constant freezing and then starting up again is very distracting.  Returning this for a the new Roku 3!", "verified": true, "helpfulness": "0/1", "author": "Curious Reader \"curious reader\""}, {"rating": 5.0, "review": "I have two of these now and use them frequently since we cut the cable. very easy and intuitive to use. Set up was a breeze.", "verified": true, "helpfulness": "0/0", "author": "nikk410"}, {"rating": 5.0, "review": "So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Kelly A Cassise"}, {"rating": 2.0, "review": "It's just an okay vehicle for movie streaming.  I", "verified": true, "helpfulness": "0/0", "author": "Trevon Delisle"}, {"rating": 4.0, "review": "I LOVE this thing, when it works.  And honestly it works, most of the time.  It has a weird habit of randomly dropping the internet connection and then refusing to reconnect until I put it to \"sleep\" and then \"wake\" it up again, but this is a minor annoyance.  When I bought it I wasn't sure that I would really use it.  I had my old PS3 in the bedroom which was perfectly capable of watching Netflix and Prime Video, and most of the other things the Fire TV Stick does, and I had my PS4 in the living room capable of the same things.  But the real advantage came in ease of use, noise, and portability.  The Fire TV Stick remote is a much simpler interface than either iteration of the Playstation, and with the app installed on my phone I can control it even when the little remote comes up missing for a few days here and there (my kids usually blame the dog for this).  It is also completely silent, thanks to no spinning hard drive or whirring fan (this is a big help for late night binge watching in the bedroom while my wife tries to sleep, that PS3 is a noisy machine)!  Last but certainly not least, portability.  You can take it anywhere.  It's small, virtually weightless, and pretty much plug and play.  As long as you have a TV with an HDMI port, a power outlet and a WiFi connection you can access this thing is ready to go.  It remembers your account information, so aside from setting up the new WiFi connection there is no complicated login and setup process.", "verified": true, "helpfulness": "0/0", "author": "BT"}, {"rating": 5.0, "review": "Got this as a Mother's Day gift! Great product. I use this everyday", "verified": true, "helpfulness": "0/0", "author": "Courtney Richardson"}, {"rating": 5.0, "review": "Awesome.. You got it. Fire on the mountain, lighting in the air.Great digital viewing is waiting for you there.", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 5.0, "review": "I enjoy this better than chromecast. Its super fast, works with plex and the remote is key. I use this daily.", "verified": true, "helpfulness": "0/0", "author": "Eric D. Schlaht \"Eric S\""}]