[{"rating": 5.0, "review": "Not sure how I ever lived without this.  Buy this now! It combines so many social media and network outlets in to one.  As a prime member you are able to watch series and movies that are not available of Netflix.  This also arrived sooner than expected. Great purchase!", "verified": true, "helpfulness": "0/0", "author": "K. Puckett \"immeykay\""}, {"rating": 4.0, "review": "Simple, easy to use and opens applications very fast.  You never have delays, lag or wait time though I will say the unit locked up on me a few times 1 day only, after being unplugged for several hours it recovered and has been 24x7 on and plays 4-6 hours of shows per day from Amazon VOD without issue other than that 1 day where it kept crashing and rebooting.", "verified": true, "helpfulness": "0/0", "author": "Justin R. Germino \"-Justin Germino (Dragon Blogger)\""}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Mary Fisher"}, {"rating": 2.0, "review": "your stick ist\"s all money no diffrent then netflix what i can\"t see with the stick i could see it on netflix for free with amazon will cost me not cool at all i paid 99.00 $ for nothing but next year no way sorry will i subcribe again !!!!", "verified": true, "helpfulness": "0/0", "author": "reinaldo quinones"}, {"rating": 5.0, "review": "It works.", "verified": true, "helpfulness": "0/0", "author": "veronika glosky"}, {"rating": 5.0, "review": "Great product in a versatile small package.", "verified": true, "helpfulness": "0/0", "author": "Gary D"}, {"rating": 5.0, "review": "I was very satisfied with it", "verified": true, "helpfulness": "0/0", "author": "Marcela"}, {"rating": 5.0, "review": "very fast and compatible, so many cool features and if you're a Amazon member, this is honestly the best prodrug for you unless you wanna go hard and get the Fire TV instead of the stick", "verified": true, "helpfulness": "0/0", "author": "Austin Cowan"}, {"rating": 5.0, "review": "I really didn't expect much from this, but the You Tube app on my DVD player had gone away so I thought I would give this a shot.  While I haven't investigated this fully yet, I am very pleased with the way it works with Netflix.  I had a lot of trouble streaming Netflix due to slower Internet speed in the evenings.  This lets me watch Netflix all evening without any slowdowns or re-buffering.  Well worth the price!", "verified": true, "helpfulness": "0/0", "author": "LibLady"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rhonda Madison"}]