[{"rating": 1.0, "review": "I can find most of what's already on this stick on-line, so it may be more organized and pretty to look at  but I have a shortcuts bar for that.", "verified": true, "helpfulness": "1/2", "author": "Juan & Cindy Alvarez"}, {"rating": 5.0, "review": "I have both the fire stick and fire TV. If I had it to do over I would get two sticks. The cost is more effective and the stick is more convenient. Both products are great.  I especially loke the fire ap that I dowloaded free on my phone since I always know where my phone is but not so much the remote.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Gotta say I am impressed with the features of this small unit... It's super fast and loaded with great apps.. I did rate this with four stars because the remote at times is non responsive.. Also I wish more movies were on prime, I don't understand why 10 year old movies have to be purchased.. Had to rejoin Netflix due to that fact.. Also I thought this unit was battery operated but came to find out it needs to connected via a short wire... Other than that I like.. I use it every day, and simple to use..", "verified": true, "helpfulness": "0/0", "author": "olga soto"}, {"rating": 5.0, "review": "Great gift for my husband, I am enjoying it , too.", "verified": true, "helpfulness": "0/0", "author": "Karla Wadlington"}, {"rating": 3.0, "review": "Love the device works smooth and fast. Pity about the software though. Would like to be able to customize my home page a bit. Is still a bit buggy, but I do enjoy using it.", "verified": true, "helpfulness": "0/0", "author": "Craig Jones"}, {"rating": 5.0, "review": "Awesome for streaming. Better than chromecast. Love it. Great purchase. We use it all the time. User friendly too.", "verified": true, "helpfulness": "0/0", "author": "Swthme"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "dee zamora"}, {"rating": 5.0, "review": "LOVE MY FIRE STICK", "verified": true, "helpfulness": "0/0", "author": "Trishar"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Pitbull"}, {"rating": 5.0, "review": "Got the fire stick when it was $19.  Was very easy to set up.  I have watched Amazon and Netflix movies with no problems.  Even at the current price of $39 you can't go wrong with this.", "verified": true, "helpfulness": "1/1", "author": "P. Hall"}]