[{"rating": 5.0, "review": "Very easy to unpack and set up.  I enjoy being able to resume watching a video where I left off, whether an hour later or a day later.  Nice feature.  Plus it's always on and cued up for immediate viewing.  The special two day price for prime members made it a killer deal, so I bought two.  I may have to get a voice remote next to make it even easier and more fun.  I have one on my \"Smart\" TV, and it puts the Vizio interface to shame.", "verified": true, "helpfulness": "1/1", "author": "Utah's Dixie"}, {"rating": 2.0, "review": "Like many, I purchased a couple of these at the introductory price of $19 on impulse. I already own a Roku and several Chromecasts and I cut the cable years ago, so they don't fill any particular need. It was curiosity and the low introductory price that motivated me to give one a try. I'll likely keep the other unopened and give it as a stocking stuffer.In addition to some initial impressions after having this for a little over a week I'll also compare it to the Chromecast since Amazon seems to be targeting it as a direct competitor to Google's streaming stick.My first impression upon opening the box was that the Fire Stick is unusually long. It is around an inch longer than either the Chromecast or Roku stick. If you plug it directly into one of your television's HDMI ports you may find that it sticks out more than you wish. You can, however, use the included short extension cable which allows it to lie flat against the television instead. The micro-USB jack (for connecting the power supply cable) is located at an odd location on one of the edges about halfway up the length, unlike the Roku and Chromecast which both have the jack on the outer end. This also should be a non-issue for setup if you use the included HDMI extension.You do need to connect it to an A/C adapter (either the included one or another capable of supplying 1A current) plugged into an outlet rather than a USB data port since the Fire Stick's requirements exceed the maximum current spec for a USB port, which is 500mA or half of the Fire Stick's rating. You may get lucky if you try to use a USB port as some have reported but that's probably not the best way to set it up. You may need a longer USB cable than the 6' one supplied depending on the proximity of your television to a free outlet.I had none of the issues with initial setup as a number of others seem to be having. It found and connected to the Wifi and began its initialization routines without incident. I concur that the video tutorial and software update were annoying, but it was over in twenty minutes and hopefully will not need to be repeated - until the next firmware update that is.The remote has the same functionality as the Roku's: basically just content menu navigation and play/pause controls. It won't turn on the television, switch HDMI inputs if necessary and control playback volume. I had hoped that the Fire Stick would be CEC compliant which would enable these additional functions via the remote but after trying it repeatedly that does not seem to be the case. There is also an android remote app (not iOS yet) but it just emulates the Fire Stick's \"dumb\" remote functions on a smartphone, with the addition of Amazon's proprietary but limited voice search functionality. I found find this voice search function useless since I regularly watch content from other sources that are not included in Amazon's searches.Navigating the Fire Stick's homescreen and menus is fairly straightforward but can get very tedious depending on what you want to do. It will take at least ten clicks to open an app that does not appear on the `Recent' carousel for instance. Amazon content, of course, is much easier to find and launch. Loading new non-Amazon apps (14+ clicks) was not difficult except for having to log in to each individually using only the remote and various on-screen keyboards.I've watched a number of videos from different sources and all performed equally well. The Fire Stick supports maximum 1080P HD video like its competitors and Dolby Digital Plus sound, which I believe is unique to it. The picture quality was very good on everything and it takes similar amounts of time to load and begin playing a selection as the Roku or Chromecast devices. Amazon claims that Amazon videos will sometimes load faster than the others as a result of its `ASAP' prefetching feature, but I'm not a heavy consumer of Amazon Prime video and haven't noticed any difference yet. I also consider that feature to be a huge negative since it consumes extra internet bandwidth and data in order to download content you may not want, with no apparent way to turn it off.It's been stated in several reviews that the Stick doesn't work when plugged directly into an A/V receiver rather than a television. I haven't tried that yet but will update this review when I do. I'm not sure how you can take full advantage of the DD+ (7.1 surround specifically) if you have to plug it into a television since even the ones with optical outputs only support 5.1 surround. If you're considering this for a home theater setup you may want to wait until this is sorted out or explained better than I can.App selection is more than adequate but you may find it limiting if you're used to Roku, Apple TV or Chromecast. It's clearly optimized to make your experience viewing Amazon videos and listening to Amazon music better than with other sources. And if your personal music collection is in either the iTunes or Google clouds you are out of luck unless you first transfer it to the Amazon cloud.One impression I have is that this product feels a little rough and unfinished. The fact that the first devices off the line immediately needed a major firmware upgrade tells me that manufacturing ramped up prematurely before the firmware was fully finished and QA'ed. One of the features that was stated in the ad when I purchased it was the ability to connect to hotel wifi networks with login screens. Now it's listed as \"Coming Soon\". There are also a few odd bugs and quirks. For instance, I can't seem use the back button on the remote to exit from the Netflix or YouTube apps - you can only exit them with the home button. I've run into other minor bugs that are inconsequential but annoying.One feature that I use heavily with other streaming devices is screen mirroring from my phone or tablet. That essentially allows me to cast ANY videos, music, photos, etc that I can see or hear on my other device to the big screen. It's not as convenient as streaming from apps since it ties up the device being mirrored and uses more bandwidth for some things, but it adds a tremendous variety of options for using a streaming device.The Fire Stick will do screen mirroring with some newer Amazon Kindle Fires but also lists compatibility with android devices as a feature. After testing this capability quite a bit I have mixed reactions. The function does exist, and when it is working the video and audio quality are very good. But it's also somewhat difficult to enable, takes a relatively long time to connect with a device and seems to occasionally freeze or display a black screen. And from two different android devices the Fire Stick sometimes shows up in the detected devices list and sometimes doesn't. You may have better luck using this capability with a Kindle Fire HDX device than I've had with android.All in all it's a very capable streaming device and a bargain at $19. At $39 though I don't think I would have purchased it unless I didn't already have other alternatives. There is just nothing really unique or of higher value than the other streaming devices. If Amazon Prime is your primary source of video entertainment and your music collection is on the Amazon cloud then I would highly recommend it. I give it three stars.Fire TV Stick vs ChromecastWith everything considered I don't think this will be a Chromecast killer if that's what Amazon was hoping for. Each device will have its own niche and Chromecast will probably remain amazon.com's bestseller for the time being even though it's nearly a year and a half old at this point. Here are some of the specific  pros, cons and differences for those trying to decide:Wifi: Fire Stick supports dual band wifi, Chromecast supports only 2.4GHz. This may be important if you live in an area with high congestion on the 2.4GHz bands.Core apps: Fire Stick has native Amazon Prime and Amazon Music apps. Chromecast supports these only through screen mirroring (or `tab casting' from a PC). Chromecast has native Google Play Music, Google Play Movies and Television, HBO-Go and Vudu apps. Fire Stick supports these only through screen mirroring. Both support native Netflix, Hulu, Pandora and many other popular apps.Remote: Fire Stick comes with standard Roku-like remote. Chromecast uses an existing PC, tablet or smartphone to \"cast\" videos or music playlists to the screen.Pros (Fire Stick): You can leave the remote by the television and not need cell phone or tablet nearby. People without smartphones or uncomfortable with using apps can learn it more easily. Better for homes with small children (if you want them using the television that is).Pros (Chromecast): Smartphone has more functionality than remote. Can turn on the television and set to correct HDMI input (due to CEC compatibility mentioned earlier). Can control playback volume. Allows multiple users to queue up content and cast to it. Can use Google Voice Search (android only) within ANY video or music app. Multitasking - allows previewing next selection while current one is playing. Less remote clutter in the living room if you are averse to adding to the existing pile of remotes.Cons (Fire Stick): You really need TWO remotes - the Fire Stick remote and another to turn the set on, switch sources and control volume.Cons (Chromecast): Confusing to some. If the person who started the movie leaves you lose the playback controls on their phone (although the movie keeps playing).Screen Mirroring (android): Both have it. Easier and more reliable with Chromecast. Fire Stick requires sixteen additional clicks with the remote just to enable screen mirroring, while Chromecasts are always enabled and visible to mirroring devices. Only a differentiator if you rely heavily on this capability.Power: Fire Stick requires AC adapter, Chromecast can use either adapter or USB port on television. Probably not a big deal to most.Using with home theater surround systems: Chromecast is compatible with A/V receivers, the jury is still out on Fire Stick.And that's about it. I'm sure I will learn more as I continue using it. I'm particularly interested in finding out how well sideloading unsupported apps will work on this device. I've had mixed results doing so with Kindle Fires. Please comment if you see any errors and I will try to keep it up to date. Thanks.Update 1: I forgot to mention that Chromecast also has a huge advantage for those who want to connect to audio-only systems through a streaming device with an audio extractor. It works well with Chromecast but you just can't do it with the Fire Stick. There is no way to navigate menus without an attached television or monitor even if you use the smartphone remote app. Two of my Chromecasts are connected this way to powered speaker systems (one outside on the patio) so there is no way the Fire Stick could replace these.Update 2: Apparently the Fire Stick can also turn on the television and switch it to the correct HDMI input, but only if you first put it into \"sleep\" mode manually or wait 30 minutes after the last use. It would be far more useful if CEC mode were always enabled. You would still need the second remote for volume control though.Update 3: Amazon has reportedly confirmed that the Fire TV Stick is NOT designed to work when plugged directly into A/V receivers. This can be a problem for home theater setups and also would seem to render the Dolby Digital Plus advantage which Amazon touts irrelevant.Update 4: The Wifi performance on the Fire Stick is abysmal. I moved it to a bedroom about 25 feet from the router and it won't connect at all on 5GHz and buffers constantly on 2.4GHz. Other devices have no problem streaming HD video in the same room. I'm downgrading to two stars and contemplating returning it.", "verified": true, "helpfulness": "0/2", "author": "Mark F."}, {"rating": 5.0, "review": "This devise is amazing, we connected the devise and signed up for Netflix. We are set to go.", "verified": true, "helpfulness": "1/1", "author": "Ricky Jones"}, {"rating": 1.0, "review": "This thing is a joke. I put mine three feet from my router and plugged it into an HDMI port. It said I had a very good signal but kept losing connection and only ever said LOADING. I've tried it at multiple houses so the issue wasn't with the router itself. I plan on returning mine and getting something that actually works.", "verified": true, "helpfulness": "1/2", "author": "Anthony McDonald"}, {"rating": 5.0, "review": "Loving the Amazon Fire TV stick so far. Easy setup, took a couple minutes to download updates and reboot. Very nice menu, fast and easy to swift through. I recommend getting the fire TV stick only if you have Amazon Prime, because it's basically everywhere on the device. But hey, doesn't bother me. Never buffered once yet, and streams HD pretty quickly after starting a show. The remote is simple to use BUT as some other reviewers have said, the battery compartment cover is a PAIN to get off (design flaw.) Chromecast is great for casting to your TV, but if your wanting to binge watch shows without getting up on a nice winter day, than I recommend the fire TV stick 100%. This is why I love Amazon!", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 3.0, "review": "So to start off I have a Roku XS, multiple chromecasts and I just got the fire stick with the special pricing to give it a shot. For $20 why not? Lets do the Pros first versus the other devices:Really Fast! lot faster than my RokuNo lag so far streaming videos and loading up new apps faster than both the chromecast and the RokuHas Amazon Prime streaming that the chromecast doesn't have.Very Nice designs, I dislike the Roku interface so muchLike that it has screensaver mode and switches pictures when your not using it.ConsDoesn't have HBO Go, let's see if that changes sometime soonThe Twitch.TV app is terrible! You can't log into your account at all or search for streams! Basically a useless app at this point, hope this gets fixed asap!The stick is longer than a chromecast, so if you have a crowded AV center, it might not fit. The power plug is also on the side instead of the end like the chromecast which could be problematic.Otherwise I really like this device but man that twitch tv app makes me so dissapointed in it. Hope they fix that soon and this could easily be an amazing device.", "verified": true, "helpfulness": "0/0", "author": "Tyler Willey"}, {"rating": 5.0, "review": "I wasn't even in the market for these but I bought 2 of these sticks for $19 (2 day sale for Prime Members). I had 2 TVs in the house that were not connected to the internet but I do have Netflix and Prime so I figured I'd try it.Setup took less than 5 minutes to plug into my TV, power cable, WiFi, and batteries in the remote. I am not extremely tech-savvy but this was a no brainer.The speed at which the videos play/load is amazing. There is no lag what-so-ever. Also, you can do more than just watch videos and shows, there are options to download games/apps. My 3 year old son plays a car game with the remote and loves it.Overall, I am very satisfied with this purchase! Great product, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Bmatt"}, {"rating": 3.0, "review": "Prime video looks great, easy setup, nice remote, Netflix streaming is very grainy, very poor quality. I have a Roku on the same network/speed etc. it has excellent Netflix streaming and Amazon Prime streaming. Roku is much better all in all.", "verified": true, "helpfulness": "0/0", "author": "Gregory E. Myner"}, {"rating": 5.0, "review": "As expected from Amazon. Fast delivery and great product.", "verified": false, "helpfulness": "0/0", "author": "V"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Meg0797"}]