[{"rating": 1.0, "review": "It work great for a couple days then it started to have buffering issues constantly. Now two weeks later its having a bunch of problems and now if I turn the channel on SlingTV it turns my tv off!! I saw other users note that it got really hot and I'm assuming this is where the problem is coming from. Constantly knocking me bout of SlingTV for no reason and constant problems with the Twitch app as well. Can't be my internet because everything else in my apartment runs perfectly fine.", "verified": true, "helpfulness": "0/0", "author": "Brandon Finke"}, {"rating": 3.0, "review": "This worked great for about a month. The  one day it froze with white horizontal lines running through it, must of been an incompatability with my tv and the fire stick because after the great customer service from Amazon had two replacements sent without any fix. So... until I get a newer than 2006 TV I can not use this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "With my kitchen TV has unusable wireless issues (and it's right next to my Chromecast which doesn't have these issues).  The issue?  The fire stick appears to bomb my wireless AP - I see the RTT on my other devices going into the seconds (as in over 1000ms) and it still has problems even showing thumbnails of TV shows, let alone the actual shows.  I switch TVs to one much closer to my wireless AP and it works just fine.  Very weird.", "verified": true, "helpfulness": "1/1", "author": "Bryan J Duff"}, {"rating": 4.0, "review": "Pretty fast for being only a stick...seems to be the full functionality as the Fire TV just without the games and voice control.", "verified": true, "helpfulness": "0/0", "author": "mike theo"}, {"rating": 5.0, "review": "Best of it's kind.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Robert T Gilbert"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Debbie Lindstrom"}, {"rating": 1.0, "review": "I loved the fire tv stick when I first got it BUT after only 4 months, the stick stopped working.  I get a no signal sign when I try to access it.  I realize it's a relatively inexpensive device, but I've come to expect more from Amazon.  Spend your money on something else...maybe it will last longer.", "verified": true, "helpfulness": "0/0", "author": "Michele B"}, {"rating": 5.0, "review": "It works awesome. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "This is easy to install and use. The hardest part was fiquring out which HDMI port it was using. Once I found it then it was fine. I use it to stream Netflix and Hulu as well as watch Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Erin Boyle"}, {"rating": 5.0, "review": "A must have device", "verified": true, "helpfulness": "0/0", "author": "Khanh Vu"}]