[{"rating": 5.0, "review": "I only rate these things on the initial setup and then how easy it is for my kids (4,8,12) to use daily.  Because of course, I don't like to be bothered by complexity and nagging maintenace.  To start, we own all three of the streaming devices, but the kids love this one the best. The other two, Chromecast and Apple TV, each have their flaws.Chromecast might be useful if it was easier to setup, had a seperate remote, and had more processing power.  The kids never used it after it was setup because it required another device to control it and was kind of lost with the other simpler options available.  I eventually gave is away to my brother who is a tech junkie.Apple TV is better, but at twice the price.  I do like this one, though.  You can stream any content from your iPhone or iPad to the TV which the kids love.  The one negative which prevents me from buying another is it doesn't have the Amazon Prime app or a wide selection of other apps.  If I am going to pay for Amamon Prime, then the streaming device better have it installed.  The only plus for Apple TV at this point is its exclusive HBO Now app it enjoys for another 6 months or so.  Of course I like this because we don't subscribe to HBO through our cable provider.Either way, I hope this saves someone some time.", "verified": true, "helpfulness": "0/0", "author": "Shawn Mac \"Here and there.\""}, {"rating": 3.0, "review": "I bought 2 of these and loved them until my Hulu started freezing up all day I can't watch any show without it staying stuck on a scene and no matter what I do it won't fix itself so it's pretty frustrating", "verified": true, "helpfulness": "0/0", "author": "Suleika"}, {"rating": 4.0, "review": "It's pretty easy to use because it is just a stick. I did note that when I plugged the power source into the USB port on my TV, it complained that there was not enough power. It did the same when I plugged it into an electrical outlet, so perhaps the USB port might have been usable. That said, the stick is always on so I don't have to power it up. It's far faster than other methods I've used to access Amazon Prime and Netflix. The interface is pretty decent, but you can't blame the stick for how other companies programmed their applications. The remote control is okay. It was challenging to open the back in order to insert the batteries. I also forget that the main \"enter\" button is the center of a thumb wheel so perhaps labeling it in some way such as \"OK\" would help. There is not a \"stop\" button on the remote, either, which takes some getting used to. Lastly, the remote is not labeled at all, so an outsider to your home might not realize it is the remote control associated with the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Scott Yanoff"}, {"rating": 5.0, "review": "Very user friendly.  Quick, easy set up.  Remote control could be a little bigger though.", "verified": true, "helpfulness": "0/0", "author": "marlene"}, {"rating": 5.0, "review": "What a great tool! We cut the cord to the cable company and saved $174 per month! That's $2K+ per year!", "verified": true, "helpfulness": "0/0", "author": "Ally"}, {"rating": 3.0, "review": "Fire TV stick was easy and quick to set up. Works great for watching Amazon videos, but when I use it to watch Netflix the picture was freezing up, then would fast-forward until the picture and sound synced up again. I took advantage of the Sling TV offer and got the Fire stick for free, the Sling TV App seemed to work okay but is a little sluggish. After using it for a week or so I realized that cutting cable years ago was not just about the money, but also not wanting to spend so much of my free time watching commercials. Now, back to my problem with Netflix freezing up... I decide to use the Factory Reset option found in the Settings Menu. After going through the Setup again, I re-installed Netflix and amazingly it ran flawlessly. I watched over two hours of video without a single freeze or jitter. Then I re-installed Sling TV and my Netflix problem was BACK. So I un-installed Sling TV, problem fixed. Will not renew Sling TV when the 90 days are up... bye bye commercials. Another reason for only giving it 3 stars is, NO Vudu App.", "verified": true, "helpfulness": "0/0", "author": "Denis Th"}, {"rating": 4.0, "review": "Love thus product. I have this in the kids room and it's easy enough for them to use. I wish this had the free time settings the main fire tv had.", "verified": true, "helpfulness": "0/0", "author": "Brad Nicholson"}, {"rating": 5.0, "review": "I am very please with the Fire TV Stick.  I am fully enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Johnnie"}, {"rating": 5.0, "review": "It's as easy to use as they say as long as you have a strong wifi signal to your TV/ fire stick. It's saving us lots of money on movie packages and rentals.", "verified": true, "helpfulness": "0/0", "author": "stacey h hollis"}, {"rating": 1.0, "review": "The performance of these firestick definatly feels like a cheap device.---Cons---The device menu's feel laggyCasting to the device causes constant problemsVoice search from the phone does a global search not a voice search in the app you currently have openThe device will get sluggish as you leave it on for a week or so. A reboot has to be done by pulling the power behind your TV.---Pros---Flappy birds family is kind of fun for a few minutesSling TV is fun to use on this, but it is exclusive to the fire stick right now. The instant it works on chromecast my fire sticks are getting sold.", "verified": true, "helpfulness": "0/0", "author": "David Becker"}]