[{"rating": 5.0, "review": "I am really enjoying the selection available with my fire stick. It has a variety of shows and movies, most of which is free with my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "Love fire TV stick didn't have to go by smart TV", "verified": true, "helpfulness": "0/0", "author": "alfonso woods"}, {"rating": 5.0, "review": "Just what we needed! We were binge watching in no time! Our TV has a USB port but it doesn't have built in apps--thus, it's not the \"smartest\" TV. The Fire Stick was perfect for us because it allowed us access to tons of apps, excellent streaming, and made our TV a tad \"smarter\"! Set up was a breeze! I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "alexandra lacie little"}, {"rating": 5.0, "review": "Fast, Easy and Right!  Can't ask for better than that!", "verified": true, "helpfulness": "0/0", "author": "K. Murray"}, {"rating": 5.0, "review": "So i get this about seven months ago and have loved it ever since. We have had zero issues with it working when it was supposed to. If you want the tech answer on this there are plenty of people that have that review. Here is my take on it. if you want to watch Netflix, amazon prime video and a few other online video formats then this is for you. Our old Bluray used to connect to the network and we could watch the online sources. after a few revisions it no longer connects and allows us to watch online sources. The Fire TV stick solved that in a very simple and easy to use format. You can get lots of apps to fit your needs and if you have a library on your network there are other programs that can be installed to reach formats that Amazon did not design. Do you research and you find that this thing it easy to use, simple for everyone to operate and if you have the additional need to do more it seems easy enough to find a solution for that too.", "verified": true, "helpfulness": "0/0", "author": "Gadget Guy Addict"}, {"rating": 5.0, "review": "Product arrived as described!  😃", "verified": true, "helpfulness": "0/0", "author": "Cynthia Crawford"}, {"rating": 4.0, "review": "I can really work it I think. NOW, all I need is a hard copy list of available MOVIES. Product is all I expected and it works fine and was easy to install as well.", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Buckley, III"}, {"rating": 4.0, "review": "works great for netflix", "verified": true, "helpfulness": "0/0", "author": "Malinda Worley"}, {"rating": 5.0, "review": "I have always used  my blue ray player or another separate device to access internet video,  because my LG  tv even though it is 3D it lacks the capacity or ability to directly access , Until now.  This device was easy to in stall has a simple menu and was detected immediately by my wireless modem", "verified": true, "helpfulness": "0/0", "author": "JAMES A. CIMINO SR."}, {"rating": 5.0, "review": "We love the Fire Stick.  Sorry Redbox - we don't need you anymore.", "verified": true, "helpfulness": "0/0", "author": "Patricia Engler"}]