[{"rating": 5.0, "review": "Very nice pictures!!!Love it !!!", "verified": true, "helpfulness": "0/0", "author": "Sjohn162"}, {"rating": 5.0, "review": "The firestick is great would suggest anyone looking to watch amazon & netflix to buy", "verified": true, "helpfulness": "0/0", "author": "Connie Hester \"Hester\""}, {"rating": 5.0, "review": "Much better than my Chromecast. Pros include:Loads quickly;Seldom buffers or skips due to its greater RAM;Has yet to get stuck in \"loading\" which my Chromecast did often;Includes mini remote plus I can I use my Android tablet and my Kindle Fire 6 to replace the remote;Extremely easy set up; and,Very good assortment of channels to watch (like Netflix, Hulu PLUS, History, Smithsonian, YouTube, PBS, Defense, and more).I am very happy with the Fire Stick and highly recommend it over the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "GrandpaJack \"Grandpa Jack\""}, {"rating": 5.0, "review": "Works like a charm!  Exactly what we wanted!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I try it and it's really good, a few differences compared with others but still good", "verified": true, "helpfulness": "0/0", "author": "Giovanny Andres Gongora Granada"}, {"rating": 3.0, "review": "Not too much that I like to watch Searched for \"Rosary Murders\" to no avail.  Very little to choose in TV shows, nothing contemporary.  Too many items cost money, being retired makes affordability an issue.", "verified": true, "helpfulness": "0/0", "author": "john e. sweo"}, {"rating": 3.0, "review": "Bought this to Mirror my HDX 7. Only succeed twice after trying for over 20+min each day I had it.Works great if you just want to watch Amazon Prine stuff but I have other devices for that.Returning it and getting a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "CH"}, {"rating": 5.0, "review": "The Fire TV Stick was very easy to install and intuitive to use. This is an excellent choice for accessing web-based viewing of Amazon Prime and Netflix. The ability to access my Prime Music is another plus. It is very well designed and a great value.", "verified": true, "helpfulness": "0/0", "author": "Titus"}, {"rating": 5.0, "review": "Dopeeee", "verified": true, "helpfulness": "0/0", "author": "Elvis Oyola"}, {"rating": 5.0, "review": "Powerful little streaming device at a great price. We've dropped cable after purchasing a few.", "verified": true, "helpfulness": "0/0", "author": "Courtney S."}]