[{"rating": 4.0, "review": "Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Eileen"}, {"rating": 5.0, "review": "So easy to install! No brainer, even for me!", "verified": true, "helpfulness": "0/0", "author": "llips1218"}, {"rating": 3.0, "review": "There is a significance difference between the Fire TV Stick and Google's Chromecast. The Chromecast offers more viewing options with external applications. Though the Fire TV stick is limited to outside options, its navigation capabilities within the Prime network is easier when compared to Chromecast. Because of the different options available with streaming movies (my family likes VUDU), it makes more sense to buy the Chromecast (or ROKU which I use at school) than the Fire TV Stick if you are looking for integration of various, non-Amazon applications and integration with non-Fire Tablets/phones. We are going to put the Fire TV Stick in the guest room since it is cheaper to hook this up than it is to run coax and provide guests with tv viewing options from Hulu or Amazon. I understand the purpose of limiting options and pushing folks to Amazon Prime, but if Amazon wants to be competitive with this brand, it needs to open the options available...the entire intent of android (the base operating system to Fire) was to make the software open source and allow more options to the consumer through outside developmentt.", "verified": true, "helpfulness": "0/1", "author": "Brianna Rupkalvis"}, {"rating": 5.0, "review": "Terrific.  Just what I needed.  Very easy to install; you are walked right through it.", "verified": true, "helpfulness": "0/0", "author": "Carole B. Moore"}, {"rating": 5.0, "review": "Love this fire stick . It is much more than I hope for.", "verified": true, "helpfulness": "0/0", "author": "Marcella"}, {"rating": 5.0, "review": "equal to or better than my roku 3", "verified": true, "helpfulness": "0/0", "author": "R \"R.\""}, {"rating": 5.0, "review": "Love this Fire Stick!I'm a Prime member and this works great with that membership.", "verified": true, "helpfulness": "0/0", "author": "skiya"}, {"rating": 5.0, "review": "Fire stick good!", "verified": true, "helpfulness": "0/0", "author": "Michael Arfa"}, {"rating": 3.0, "review": "Good deal. Diaponted that a power source is needed. Good Amazon series.", "verified": true, "helpfulness": "1/1", "author": "Efrain E Montero"}, {"rating": 5.0, "review": "Amazon does it again. I have the Chromecast as well, which is great when you want to flip your PC screen to the TV, but this is better with everything else and faster response.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"GADGET CRAZED\""}]