[{"rating": 1.0, "review": "The features of the Fire TV Stick are great. However, the font size of menu items and descriptions of shows and movies are VERY small. If you have difficulty reading VERY small print from a distance, I would not recommend this product. If there were accessibility options that allow users to increase the fonts of menu items and descriptions of shows, this would be an excellent product. I'm disappointed that Amazon has ignored this drawback that has been mentioned in forums.", "verified": true, "helpfulness": "0/0", "author": "Scott E Whatley"}, {"rating": 5.0, "review": "Best little device for internet access. Super simple to use with no dropped WiFi which requires relogging in.", "verified": true, "helpfulness": "1/1", "author": "Paul J."}, {"rating": 1.0, "review": "We were excited when we received this device and I installed in my living room TV. The first couple of days it work beautifully but them when ever I tried playing any movie either from Netflix or Prime list I am getting an error i think is HDVC error pertaining to content. I have searched and searched for a solution and can not figure it out. Some said to shut off TV and reboot. Others have said to reboot the stick which I have done this thousands of times but to no avail. I now have the Chromecast and it has been working fine. Amazon needs to fix this before offering this stick for $38.", "verified": false, "helpfulness": "1/1", "author": "Jose Laguardia"}, {"rating": 5.0, "review": "I rarely do reviews but I have to say I love this device. It is portable, it is small, it is intuitive, just great. I actually use it on a very old Hitachi Ultravision, circa 2005, through a HDMI-DVI converter (about 35$). I intend to travel with it and believe it will work on most hotel TV's. Still yet to try.", "verified": false, "helpfulness": "1/1", "author": "Will P"}, {"rating": 5.0, "review": "Best ever never no errors", "verified": true, "helpfulness": "1/1", "author": "natalie scott"}, {"rating": 1.0, "review": "No reduced data usage settings for those on data limited ISPs like satellite providers or wireless hotspots. Always uses max quality available and can burn thru your data cap quickly.", "verified": true, "helpfulness": "0/0", "author": "DFP"}, {"rating": 5.0, "review": "Love it!! What more is there to say? 😀", "verified": true, "helpfulness": "0/0", "author": "Michael Rennie"}, {"rating": 2.0, "review": "Apps provided by Amazon are not getting installed on fire stick. Fox now app purchased on Amazon not syncing the purchased app", "verified": true, "helpfulness": "0/0", "author": "Venkata V."}, {"rating": 4.0, "review": "Works great but be careful with 3rd. Party apps.", "verified": true, "helpfulness": "0/0", "author": "Emil Ysona"}, {"rating": 5.0, "review": "This is the greatest since google turned off You tube if your tv was older than 3 years . Really that is scary that they would just do that.", "verified": true, "helpfulness": "0/0", "author": "Paula"}]