[{"rating": 5.0, "review": "Love it!  It's so easy to use and is just a one time fee. I'm seriously getting rid of cable now. We use the movies a lot and I love being able to pull up my pictures or listen to the free amazon music ... I'm totally hooked on this.", "verified": true, "helpfulness": "0/0", "author": "scacko"}, {"rating": 5.0, "review": "We have both Apple TV and Amazon Fire Stick.  I will be upfront and admit that I love both.  I was torn between buying the Fire Stick and the Fire TV.  I went with the least expensive option, and I'm so glad I did.  For less than $50, I was streaming Netflix, Prime Videos, HBO, etc. within 10 minutes of opening the box.  You literally plug the stick into an HDMI port, plug it into an electrical source, and enter your wifi password.  That's it. I have not had the issues others have reported with having to unplug and replug the stick to get it work.  On my home network we have 3 ipads, 2 ipods, 1 Kindle Fire, 1 apple tv, and now the Fire Stick.  No issues with connectivity at all! (Using the Xfinity blast internet from Comcast.)I highly recommend downloading the remote app to control the stick; the tiny remote is limited and takes forever to search or type. My fav perk - Netflix on my ipad gives me a one button option to send the movie/show right to my tv for viewing.  I can then control the pause, fast forward, rewind, changing shows through my ipad instead of the tiny remote.", "verified": true, "helpfulness": "0/0", "author": "Rust and Stardust"}, {"rating": 5.0, "review": "I received my Amazon Fire Stick setup was very simple. Be warned that the remote is very difficult to slide off to put in batteries. Other than that 5 minute setup and you are watching movies. I love it!", "verified": true, "helpfulness": "0/0", "author": "Tashenia"}, {"rating": 2.0, "review": "Fire TV Stick caused severe interference to the television set off-the-air (antenna) signals, breaking them up to the point they were not watchable.  Had to buy a longer HDMI cable to move the Stick away from the TV set to stop the interference. After that it works fine and has a good selection of media..", "verified": true, "helpfulness": "1/1", "author": "jar"}, {"rating": 1.0, "review": "Cant get it to work", "verified": true, "helpfulness": "0/0", "author": "susan sosko"}, {"rating": 4.0, "review": "Works as promised and is easy to learn.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE the firestick.  The app on my Iphone making it a remote is the best.  Highly recommend this to anyone that likes watching movies, tv series, etc.", "verified": true, "helpfulness": "0/0", "author": "libmc1967"}, {"rating": 5.0, "review": "Wow ... this is awesome.  Bought it to use with Sling TV and it works perfectly.  Very fast, no lag.Thumbs up.", "verified": true, "helpfulness": "0/0", "author": "Patrick W. Fletcher"}, {"rating": 5.0, "review": "easy to set up, works perfect", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The first one I purchased had a faulty HDMI extender. It would only work when directly plugged into the TV's USB port. We finally got the replacement and no issues with this one at all. I pre-ordered mine so I'm not sure if there was some QC issues in earlier batches but if you have a problem, don't give up on this thing because it will work! My stepdad is technologically illiterate and was able to install his on their old VIZIO tv and they have been using it non-stop since they got theirs in mid-January.I like that this does the same thing as my Roku but is much smaller!*I purchased this product for personal use*", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]