[{"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "mck"}, {"rating": 5.0, "review": "It's just as great as I thought it would be", "verified": true, "helpfulness": "0/0", "author": "Jhonneri Munoz"}, {"rating": 5.0, "review": "This little dude is the berries and for the price  you cant beat it.If you want youre tv to work its maximum get one of these", "verified": true, "helpfulness": "0/0", "author": "John rose"}, {"rating": 5.0, "review": "it replace my roku hd, so much better , and it runs off my tv's usb portI love it", "verified": true, "helpfulness": "0/0", "author": "David LaCure"}, {"rating": 2.0, "review": "It keeps loosing the wifi signal and then cannot locate any wifi when there are at least 3 in the vicinity. I am able to reconnect by unplugging the Fire TV stick for a few seconds but it does not last longer than 30 min until it looses the signal again. This happened a number of times while I was trying to watch a movie this past weekend.", "verified": true, "helpfulness": "1/2", "author": "sandra m gault"}, {"rating": 4.0, "review": "It is impossible to speak about Fire TV Stick without comparing it to Roku. It looks pretty much the same, works pretty much the same, only remote is slightly better (my opinion). 5 GHz wireless wass pretty much broken and I couldn't get it to work (this seems to be a pretty common complaint). However, 2.4 GHz works ok. USB connector is on the side - some people will love it, some people will hate it - depending on HDMI connector orientation.User interface is reminiscent of Windows Media Center and works reasonably good. If you used anything like this in last few years, you'll adjust easily.Unfortunately, for those hopping to use Miracast, this stick won't be suitable since you need to get into menus to turn it on and it works only while that screen is opened. So forget about spur of the moment sharing - every time you will need to get into settings to turn it on once again.It is not that this stick is bad, but I personally find Roku slightly more comfortable and user friendly so, unless you can get this stick at a cheap price, I would pass.", "verified": true, "helpfulness": "0/0", "author": "Medo \"Josip Medved\""}, {"rating": 5.0, "review": "The Fire TV stick has everything that I loved about the Fire TV, but none of the stuff that made me return the FireTV. I wish Amazon/Plesk would update the Plesk App and that Amazon Prime Video content was easier to search/discover, but hey I got XBMC running on this via sideloading and now have my video library running on every TV in the house. Just cancelled DirecTV.", "verified": true, "helpfulness": "0/0", "author": "s-to-the-h"}, {"rating": 4.0, "review": "works well--- better without difficult keyboard.", "verified": true, "helpfulness": "0/0", "author": "Albert T Steelman"}, {"rating": 5.0, "review": "I love being able to get all my Amazon movies, music, TV shows. PLUS so much more. I have spent more hours than I care to admit watching, listening, playing on my TV these last few weeks. It made being a prime member even more fantastic!!! LOVE this Fire TV Stick", "verified": true, "helpfulness": "0/0", "author": "Dinadub"}, {"rating": 3.0, "review": "Good but some stuff missing:1. Over the air HDTV tab.2. Web browser.3. Flash player installed by default.4. Web navigation support in the remote control.5. Youtube app (not the website link).6. Google services so i can login to my Youtube account.Cheers!", "verified": true, "helpfulness": "1/1", "author": "Alex Reyes"}]