[{"rating": 5.0, "review": "I love this device.  Wow.  Amazing value for the price.", "verified": true, "helpfulness": "0/0", "author": "Neo97"}, {"rating": 5.0, "review": "well worth it, makes it easier to navigate. Will try it on my trip overseas, hope it will work.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "I've been using Chromecast for over a year now with nothing much to complain about. After reading the info on the Fire Tv stick, as soon as I become employed again, I'll be making the switch. Love that it has a little remote, tired of using my phone for this. Btw, Netflix and their hysterical show, Orange is the New Black, is directly related to why I lost my job! Let's just say I missed my calling as a media critic...", "verified": false, "helpfulness": "0/1", "author": "H. E. Lee \"Pixarfan\""}, {"rating": 5.0, "review": "A must for anyone with a wireless network at home.  Use it everyday.", "verified": true, "helpfulness": "0/0", "author": "Notorioius BOB"}, {"rating": 4.0, "review": "This is nice for newer flat screen TV's that aren't SMART TV's.  They need more options that are similar to what you get with SMART TV's though, like YouTube.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "It would be awesome if they got more apps, such as ABC app or other networks so that TV shows could be watched that are not currently available.", "verified": true, "helpfulness": "0/0", "author": "Nathan Todd"}, {"rating": 5.0, "review": "Excellent as usual.", "verified": true, "helpfulness": "0/0", "author": "Victor D. Helzer"}, {"rating": 4.0, "review": "I have question regarding monthly charges. Do we have to pay monthly charges for watching anything on Fire TV??????", "verified": false, "helpfulness": "0/2", "author": "fire fire"}, {"rating": 1.0, "review": "Still no workable Miracast.  Come on.", "verified": true, "helpfulness": "2/4", "author": "owen_meany"}, {"rating": 5.0, "review": "Love it!  Can get rid of some cable channels.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]