[{"rating": 5.0, "review": "Does using one of these require a lot of internet?", "verified": false, "helpfulness": "0/0", "author": "Brett"}, {"rating": 1.0, "review": "I have got the Fire TV stick shipped to Saudi Arabia and it did not work, I thought in the beginning that this is due to Saudi Arabia restriction on internet (despite the fact that i was just trying to play kids and cartoon movies), I have tried it in Egypt and UAE and it did not work.There was no warning that such device si working on in USA.I'm totally dissatisfied from that product and the fact that I have paid its cost and its shipping cost to KSA with no use.", "verified": true, "helpfulness": "0/0", "author": "Ruby"}, {"rating": 5.0, "review": "I have both the fire stick and Roku. I prefer the fire stick over the Roku. Fire stick remote is so light and flat. The control buttons are not sticking out like the Roku. It seems to be quicker than the Roku.", "verified": true, "helpfulness": "0/0", "author": "dean jackson"}, {"rating": 5.0, "review": "I'm surprised how well this little device works. I was debating between this and the Fire TV. My main reason for purchasing was it supports the Plex app. Being a Prime member this was a no brainer when comparing to similar products. I was concerned it wouldn't be able to keep up with streaming HD movies on Plex, but it does surprisingly well. I also really like the Plex app on this device. The interface is clean and it supports all features. It works just as well for HBO Go and Netflix.", "verified": true, "helpfulness": "0/0", "author": "TonyB"}, {"rating": 5.0, "review": "Huge fan - I should be the poster child for Amazon Fire TV. Have you been looking at the Fire TV box and are undecided? Trust me on this one, the stick provides the same features as the box at a fraction of the price and it's portable. With Amazon Prime you have access to the best in television, movies, music, games, books and free shipping on many products. What are you waiting for?", "verified": true, "helpfulness": "0/0", "author": "kathryn dunn"}, {"rating": 3.0, "review": "I like what i have seen so far , was a snap to install (just plug into a regular household electrical oulet then put the stick into a hdmi port on your tv ). I downloaded the remote app to my phone which i prefer to the included basic remote . I purchased this when i became a amazon prime member , a bit disappointed in the selection of free prime choices which is the reason for the 3stars .", "verified": false, "helpfulness": "0/0", "author": "LA"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick! It's the perfect solution for our entertainment needs", "verified": true, "helpfulness": "0/0", "author": "Tripleshot"}, {"rating": 4.0, "review": "While viewing both Amazon and Hulu Plus programs, the screen keeps freezing.  Also on Amazon, the free movie selection has ample room for improvement.  Outdated to be sure.", "verified": true, "helpfulness": "0/0", "author": "tenthn"}, {"rating": 5.0, "review": "I absolutely love it. Streaming is easy and I am able to enjoy my favorite shows and apps at my fingertips.", "verified": true, "helpfulness": "0/0", "author": "Rachel S."}, {"rating": 5.0, "review": "We have had a 55\" Samsung Smart TV for about 3 years and this particular model didn't have the Amazon Prime app and would not let me add it. Amazon fire stick to the rescue! This beats buying a new TV, which is what my husband suggested. I got this on Amazon Prime Day for the sale price of $24 instead of the $39. If you are wondering...it is worth the $39 price. It was easy to install and saved us $$$ on a new Smart TV. We watch it all the time!", "verified": true, "helpfulness": "0/0", "author": "backer"}]