[{"rating": 4.0, "review": "It is just great,a very fine unit for getting more chanels.", "verified": true, "helpfulness": "0/0", "author": "James posey"}, {"rating": 2.0, "review": "It did not work for me.  None of the vedios would play kept getting error code 4601 and since there was no way of getting any assistance this was a waste of money and i have no way of returning", "verified": true, "helpfulness": "1/1", "author": "Spa Cafe"}, {"rating": 5.0, "review": "Where has this been all my life!!!!!!!!!! I'm loving it!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Zvi Leige Sr."}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "dsjmac"}, {"rating": 4.0, "review": "We use it everyday", "verified": true, "helpfulness": "0/0", "author": "Kurt"}, {"rating": 1.0, "review": "It works ok for two days then after it froze and stop working. Horrible waste of money", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am loving this Amazon Fire Stick! Since I have joined Amazon Prime for the first time, I am utilizing all of the prime features. I do not have a smart TV so before I would stream Amazon Instant Video and Nexflix off my PS3 and it would get interrupted all the time. I am excited to say I have not had the red spinning loading symbol pop up since I purchased! (over 2  weeks ago) I have not had any interruptions to that matter! There is such an awesome variety to watch other than Nexflix too. Honestly I have not been watching Nexflix, I have been watching Prime TV and Prime Movies. They are pretty up to date, not to mention I can rent or buy the latest movies that are released. I also love that my music library is available to listen through my TV cleaning is a lot fun now! The clicker is very light weight and easy to use. Overall set up of this was extremely simple. This is saving me a ton of money, I have officially said goodbye to the cable bill! Excellent service and excellent video-streaming quality. I highly recommend this and plan on purchasing another stick! Note-If you have an older TV that does not have a HDMI port, no worries, you can still use this. You would need a HDMI to RCA adapter and set up is just as easy! I cannot stress enough how awesome this is, I love it!", "verified": true, "helpfulness": "0/0", "author": "Kristie"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Magdalena Gutierrez"}, {"rating": 4.0, "review": "Amazon fire stick was a purchase I made because of both my Chromecast never work properly(crashing issues) and the roku I purchased to replace that was terribly slow and their control barely functioned. So far Amazon Fire stick has been superior to both products. No streaming or crashes. You don't even have to point the controller at the tv to make it function. Beyond that the interface with this product is amazing very rarely slows or stalls. Quick and reactive. Love the simple controls(both interface and controller)and variety of apps. Only missing Showtime Anytime and a browser and this could go a long way.", "verified": true, "helpfulness": "1/1", "author": "lonnie jones"}, {"rating": 4.0, "review": "will be better when amazon gets in gear and fixes HBO Now to work on it.", "verified": true, "helpfulness": "0/0", "author": "jerry abercrombie"}]