[{"rating": 5.0, "review": "This is faster than chromecast.  But you can not stream a chrome browser window and many iOS and Android apps are supporting chrome cast to push to TV.Biggest advantage of this is the remote!  It's a pain to fast forward an YouTube video or some smartphone apps (e.g. YuppTV), but it's a a breeze with FireTV Stick.", "verified": true, "helpfulness": "0/1", "author": "S. Ghantasala"}, {"rating": 5.0, "review": "So far so good. I have the Apple TV and the Roku Box. So I am very familiar with these types of sets. I even had the Chromcast before I gave to my sister. This was a really easy one to set up. And the remote is nice and sleek, albeit, a bit to sensitive. I got this when it was on sale for $19 for Prime members. I like that it gives me really easy and fast access to all the video that I have through my Prime account. Before this I used the app on the Roku and it was slow and buggy. I do hope that Amazon expands that app library to include HBO Go and a few other missing ones. The one complaint I have is that I also bought the Fire Tablet 6 Inch and the app for the Fire TV does not work on it (cannot even install it). This is a very strange move by Amazon, which I hope they correct real soon. Besides that, I think that if you are an Amazon Prime member and deciding between this and the others, this one definitely is worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Akiva Zablocki"}, {"rating": 5.0, "review": "Nice and easy to go to Netflix and other now", "verified": true, "helpfulness": "1/1", "author": "Rick"}, {"rating": 4.0, "review": "Pretty good. I like prime better than Netflix; I feel there a lot better quality movies available. Works flawlessly for the one month that I've owned it so far. Limited games and Apps thus far. Streams quickly and haven't experienced any buffering.", "verified": true, "helpfulness": "0/0", "author": "Annabel Lee"}, {"rating": 5.0, "review": "Big hit in our house. Purchased for the kids rooms, and they love them. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Glenn Clouser"}, {"rating": 5.0, "review": "Blows away Roku..... anyone want a used Roku?", "verified": true, "helpfulness": "0/0", "author": "jeff decker"}, {"rating": 4.0, "review": "Much better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Robert Groll"}, {"rating": 5.0, "review": "Very easy to setup and works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to use, great streaming, good picture. Has frozen up a couple times but nothing major. My wife loves it.", "verified": true, "helpfulness": "0/0", "author": "JASON in TX"}, {"rating": 1.0, "review": "As a Prime member I was looking forward to the release of the Fire TV Stick. Unfortunately, it did not work as promoted. Despite using it on the same television as a Chromecast, and knowing how to set the connection, it still did not work. I enjoyed having the controller over using my iphone but every time I selected a television show, movie, or other selection I got a message stating the wi-fi connection was lost or the loading circle would turn and turn but never arrive at the show (even after waiting 15 minutes). The final straw was after a week of trying to watch something using this \"stick\" it began stating that our connection was too slow but it is fast enough for 2 PS4s, a gaming PC, and our Chromecast.Amazon needs to send this item back to the developers and get it fixed before selling any more.", "verified": true, "helpfulness": "3/4", "author": "P. W. Edwards"}]