[{"rating": 1.0, "review": "I was quite dissapointed with this product. The organization in the screen is quite confusing and messy, the tutorials make no sense.  Most of the time i had to use my kidle (which i love) as a remote control, quite annoying.  Also the stick has to be attached to a power source the cable just looks tacky unlike the commercial were it looks wireless.  I am getting a refund but i have to pay for shipping.  Honestly the apple tv is much better and its like $10 more.  Yes you wont be able to watch videos from Amazon Prime but im able to watxh any video from my computer (i just stream it through the apple tv)  sorry but this was just not for me", "verified": true, "helpfulness": "0/1", "author": "raquel"}, {"rating": 4.0, "review": "works great with Netflix but slow with NBC", "verified": true, "helpfulness": "0/0", "author": "Ray A."}, {"rating": 5.0, "review": "Super easy to install; instruction easy to understand and follow; speedy link up.", "verified": true, "helpfulness": "0/0", "author": "dmd26"}, {"rating": 5.0, "review": "Really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "teri priest"}, {"rating": 5.0, "review": "Some time there is problem with the signal or wi-fi due to bad weather but it's ok. I still love it, thank you.", "verified": true, "helpfulness": "0/0", "author": "Nelson Figueroa"}, {"rating": 5.0, "review": "Love it!!! Absolutely", "verified": true, "helpfulness": "0/0", "author": "tiffanie byrd"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "G. Guarin"}, {"rating": 5.0, "review": "Up until my fire tv stick arrived I had been using an apple tv. After using the fire tv for less than a day I can safely say I will never be using the apple tv again. Not only can it do everything the apple tv can and more but it is less than half the price.  I am now considering getting a further 2 more for the other tv's in the house.", "verified": true, "helpfulness": "0/0", "author": "Sam Ramsay"}, {"rating": 5.0, "review": "Love it.  Easy to install and works great", "verified": true, "helpfulness": "0/0", "author": "CYNTHIA A POPOVICH"}, {"rating": 5.0, "review": "Works perfectly!!! It's was very easy to install if you follow the instructions. Primarily bought this so I can watch Netflix and I've been stuck in front of the TV ever since I got this. No problems what so ever. I haven't tried any of the other functions yet but so far so good!", "verified": true, "helpfulness": "0/0", "author": "Brandi Bell"}]