[{"rating": 5.0, "review": "wasn't compatible with my tv so had to attach it to another tv & it worked fine", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "this is a really nice tool.  Be even better who HBO Go is added.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great. imstalled easy", "verified": true, "helpfulness": "0/0", "author": "John W"}, {"rating": 1.0, "review": "When it works it's great, but it is the most aggravating thing I've ever scene the majority of the time. Hangs and freezes to the point that you need to reinitialize which takes about 20 minutes. Wish I had gone with a different product!!!", "verified": true, "helpfulness": "0/0", "author": "Scott McLeod"}, {"rating": 5.0, "review": "I bought this with great hesitation. We had already purchased the google chromecast and weren't very happy with it. So, we thought we would try out the fire stick. WE ABSOLUTELY LOVE IT!!!!!  I love that you can download apps and have access to a larger variety of things that you don't have with the other. It works with no hesitation either. We will be buying one to put in the living room and possibly one to replace the chromcast we have in the gym room.", "verified": true, "helpfulness": "0/0", "author": "Dawn Tisdale"}, {"rating": 5.0, "review": "I own 3 for each part of my house", "verified": true, "helpfulness": "0/0", "author": "Tony Lau"}, {"rating": 5.0, "review": "Fire Stick Is an Excellent Product As Good If Not Better Then The Android Boxes, G Boxes, and Supports Kodi with with Exceptional Performance, Giving It the best box on the market, but no bigger then a thumb drive. Excellent Product!", "verified": true, "helpfulness": "0/0", "author": "James Salvatore"}, {"rating": 5.0, "review": "Exceeded all expectations. Superior to my Chromecast in every way.  Plex is simply beautiful. No root required to sideload apps (Firefox, ESFileExplorer, flash etc...). Will purchase again.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Very easy to install and customize", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent quality!!!Please add the option for us in Chile tu use amazon prime!!!", "verified": true, "helpfulness": "0/0", "author": "Roy L."}]