[{"rating": 4.0, "review": "I was looking for a simple way to get netflix into m  son's bedroom, this delivers. Having the remote and stand alone abilities is well worth the increase in price over the Chromecast", "verified": true, "helpfulness": "0/0", "author": "Brandon Watson"}, {"rating": 5.0, "review": "Like the old TV episodes and the movies.  The Stick compliments my apple tv", "verified": true, "helpfulness": "1/1", "author": "Ted Scalise"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 4.0, "review": "The fire Stick is great, only there was NO mention of how much set up there was to it. The TV commercial only shows the actor plugging the Fire stick into the TV, NOTHING ELSE !!!I", "verified": true, "helpfulness": "0/0", "author": "Otto &#34;Sandy&#34; Sandleben"}, {"rating": 5.0, "review": "Easy, fast.  Perfect access to so much", "verified": false, "helpfulness": "0/0", "author": "David T"}, {"rating": 5.0, "review": "So far, I love it.", "verified": true, "helpfulness": "0/0", "author": "Donna T. Howard"}, {"rating": 5.0, "review": "Easy install, great quality", "verified": true, "helpfulness": "0/0", "author": "Amanda Brinzow"}, {"rating": 3.0, "review": "I like that it is easy to navigate through the apps. Easier than other streaming devices I have used, but it definitely has some bugs. It needs to be rebooted frequently due to streaming issues which means you lose some settings and they have to be re-installed. We end up using our Blue-ray player to watch Netflix and even Amazon prime because the show will stop streaming. I know we have a good Wi-fi connection so it should work fine.", "verified": true, "helpfulness": "1/1", "author": "Jamie Yates \"Kip Yates\""}, {"rating": 5.0, "review": "Wife loves it", "verified": true, "helpfulness": "0/0", "author": "apollo"}, {"rating": 5.0, "review": "Incredibly easy to use. Set up was very quick and simple, and I'm not even good with technology. I haven't tried any games or many of the apps yet but it works great for everything I bought it for. Definitely worth the money.", "verified": true, "helpfulness": "1/1", "author": "Caleena R."}]