[{"rating": 1.0, "review": "IT DOES NOT WORK AS I THOUGHT IT DID ,INFO SAYS Mirror your tablet or phone on your TV , BUT THATS NOT THE CASE FULLY IT HAS TO HAVE INTERNET CONECTION TO EVEN WORK, AND IT USES DATA  .SO IF YOU DONT HAVE WIFI OR INTERNET IT WONT WORK, SO IF YOU WANNA WATCH A TV SHOW OR MOVIE FROM YOUR DEVICE IT HAS TO HOOK UP TO THE INTERNET TO WORK ,CAN NOT GO FROM PHONE TO TV", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very good :).  I'm glad I bought it.  The quality of the materials are good and the materials are of high quality.  WOULD BUY AGAIN! :)", "verified": true, "helpfulness": "0/0", "author": "Steven Chang"}, {"rating": 3.0, "review": "Could be faster and sometimes freezes. Movie archives must be enriched.", "verified": true, "helpfulness": "0/0", "author": "Ali-Ceyda"}, {"rating": 5.0, "review": "I bought two of these sticks because they are so great. It turns any TV with a HDMI and WIFI into a Smart TV. I also have a ChromeCast I hate the fact that with a ChromCast you have to have a device to stream from, this is a self contained device with remote.", "verified": true, "helpfulness": "0/0", "author": "T. Lorenzo \"PennysMom\""}, {"rating": 5.0, "review": "Fire TV Stick did not disappoint - everything functions like expected or better", "verified": true, "helpfulness": "0/0", "author": "Nikolai Gevorkyan"}, {"rating": 5.0, "review": "Absolutely outstanding, after one I went and got three more, the only question I have, will I have aproblem running 4 Sticks at the same time on the same network.... can someone answer that for me.THXLarry Paylor", "verified": true, "helpfulness": "0/0", "author": "Larry Paylor"}, {"rating": 5.0, "review": "Awesome device! I love it!  It does everything I need it to and then some.  Very easy to use and to be honest it is better than my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jason Harbison"}, {"rating": 5.0, "review": "It was easy to set up, works great on my TV. Viewing Amazon Prime with it and Netflix. May explore other stuff as I go.", "verified": true, "helpfulness": "0/0", "author": "susan M. Gourley"}, {"rating": 5.0, "review": "I love it.  Only concern, is who designed the plug?  A square plug is hard to add to the multiple plugs, I already have on my outlet surge protector.  The folding plug is ok, but I would rather have a plug that fits with all the other plugs on my surge protector.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"zzyglass\""}, {"rating": 5.0, "review": "I have an old 55\" dlp and the Fire TV Stick brought it back to the modern day. No more fighting with the Wii controller anymore.", "verified": true, "helpfulness": "0/0", "author": "David E. Pierri \"Dpierri\""}]