[{"rating": 5.0, "review": "I love it. It's easy to use. Easy to hook up. I haven't found one thing I don't like about it. I have a Netflix subscription through it.", "verified": true, "helpfulness": "0/0", "author": "Crystal Crews"}, {"rating": 5.0, "review": "So far, so good. I like the subtitles on most shows, but didn't know how to get them on this stick ( I love them on Netflix which I already had), but my son showed me how to get them on this Fire stick;  they're called captions. I have only had this stick for a couple of days, but so far am very pleased with it. I also like the screensavers, but wish they had a descriptive name, as the photos are so beautiful, I'd like to know where or what part of the world they are from. I love being able to get an entire season of a TV show I've missed in the past. I also like  documentaries but haven't discovered where they are or how to access them.", "verified": true, "helpfulness": "0/0", "author": "Kay Scyphers"}, {"rating": 4.0, "review": "Love my stick!  Works great for just watching Netflix, amazon prime, and whatever app you are interested in. Has a lot of apps to choose from.  The only reason I gave four stars is the remote does not control volume or power on/off for the tv. It is plugged into the hdmi so should be able to contol the tv right?  Otherwise great product. Easy setup and so easy my 5 year old can use it.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Never had streaming before so that's enjoyable and your price was the best.", "verified": true, "helpfulness": "0/0", "author": "Kathi Norgon"}, {"rating": 5.0, "review": "It's awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 2.0, "review": "it really doesn't do a lot.I t also keeps logging off from wi fi and it's the only thing I have that does that.It's not worth the misery to try to operate it.", "verified": true, "helpfulness": "0/0", "author": "Greatoak"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Bernadette"}, {"rating": 5.0, "review": "love it! so easy to hook up and use. I'm hooked!!!", "verified": true, "helpfulness": "0/0", "author": "SMK \"SMK\""}, {"rating": 5.0, "review": "Really nice gadgetIt is a really good choice if you want to quit your cable signal!!", "verified": true, "helpfulness": "0/0", "author": "E. Sanchez \"Erick\""}]