[{"rating": 5.0, "review": "Great product. The service was spectacular.", "verified": true, "helpfulness": "0/0", "author": "roderick Stephens"}, {"rating": 5.0, "review": "Super easy, super quick.  Seamless integration with all Amazon Prime content, Netflix, etc.  Easier than Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Bob \"Beverly Hillbilly\""}, {"rating": 5.0, "review": "We recently bought the Amazon Fire stick and we really love it, with the exception, for some reason Hulu Plus does not work that well on it. It has a tendency to freeze up and one image will stay on the screen for a while, but the audio goes on. I don't know if it is our internet connection, but i don't notice it happening with Netflix or other apps we have on the Fire Stick. It is weird because i can watch the same show on my Kindle and it works just fine. Both Amazon products though, so that is weird. But otherwise, love it tons, will probably buy another for our bedroom!", "verified": true, "helpfulness": "0/0", "author": "Brigid Mangen"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "john h"}, {"rating": 5.0, "review": "Totally great. Easy to install, instructions were simple and accurate. Makes streaming movies from Prime, Netflix, Plex so much easier.", "verified": true, "helpfulness": "0/0", "author": "Rcbfranklin"}, {"rating": 5.0, "review": "Such a great purchase! It's so much fun to use when having a party and you're not sure what to do with your guests. The games available for purchase on it are so much fun!", "verified": true, "helpfulness": "0/0", "author": "Kelly Zdanowicz"}, {"rating": 5.0, "review": "We are still adding apps but are very pleased with our purchase. We formerly accessed Amazon Prime video and Netflix through a Nintendo Wii. We didn't access them very often because this required a very awkward maneuver with the Nintendo remote. Not so with the Fire stick, which I installed myself without difficulty. We have also added Pandora and ITune Radio aops. We have previously accessed these services on other devices. With the new accessibility, we will likely cancel our premium movie channels on Direct TV and may ultimately \"cut the cord\" entirely.", "verified": true, "helpfulness": "0/0", "author": "john \"seeker\""}, {"rating": 5.0, "review": "Great entertainment. I had a few hiccups with set up, but after I upgraded the strength of my wifi signal, I am delighted.", "verified": true, "helpfulness": "0/0", "author": "The Funny Bunny"}, {"rating": 5.0, "review": "It is small, doesn't need any connections ( or hardly any) works great!!!", "verified": true, "helpfulness": "0/0", "author": "Elena Berkery"}, {"rating": 5.0, "review": "Does everything amazingly well for the price. Super fast, everything streams with great quality. I like it better than my friend's roku", "verified": true, "helpfulness": "0/0", "author": "Drew"}]