[{"rating": 5.0, "review": "Chrome-cast was very temperamental and linked to the computer. In contrast, Fire Stick has been reliable and doesn't require setting up the show on the computer first. Just turn on the TV, choose the HDMI port you put the stick in and watch. The remote is so simple it could be a Mac invention. I get Netflix better than my smart TV handled it, and, as a Prime member, the shows available for free member viewing are pretty good.", "verified": true, "helpfulness": "0/0", "author": "Flowerchild2995"}, {"rating": 5.0, "review": "Just received it and set up in minutes. Beautiful interface. Has so much more then Chromecast at a similar price point. Amazon hit it out of the park with this little device. Just not sure what to do with my Chromecast now, anyone interested in buying it.....? Lol", "verified": true, "helpfulness": "0/0", "author": "Lester Combs"}, {"rating": 4.0, "review": "It is the best video streaming device in the market, and I have tried many.  The only issue that I have is the streaming of photos and videos from Amazon Cloud Drive.  Photos are not maintained in the order that one uploads them and cannot be sorted by file name, only by name of folders.  Videos are displayed by their length, not by their file name.  That means if you want to go to a particular video you need to know its length.  These are two serious flaws when streaming photos and videos.", "verified": true, "helpfulness": "0/0", "author": "Dom Perignon \"Carm\""}, {"rating": 5.0, "review": "I am sooooo happy that I purchased the fire stick! I love it!", "verified": true, "helpfulness": "0/0", "author": "Carey Hackett"}, {"rating": 5.0, "review": "I like my first one so much, I ordered two more for my other TV's.  Fast, and I love it syncs with my tablet and phones....I hope they sync it with the Echo also.....", "verified": true, "helpfulness": "0/0", "author": "Rex Baldwin"}, {"rating": 5.0, "review": "Great little device! Very easy to setup and the picture is HD. Can't beat the price and has alot apps as to apple TV that has far less.", "verified": true, "helpfulness": "0/0", "author": "Vince volz"}, {"rating": 5.0, "review": "Perfect for my travel schedule.  Easy to use.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Brian J."}, {"rating": 1.0, "review": "I loved it till it stopped wanting to connect to my avaible wifi.. Says i have 2 anyway. And i have prime.. Says alot for that service too.  I cant watch movies,  listen to mus8c..it even yold my tv the connection diabled.  Now i have no wifi and amazon lost my order when on hold.. So im not happy wiyh them.. Auduble,  i never had a kinfle,  but tbey clam i do.. I have credits everywhete.. But try and use thenHahahaha", "verified": true, "helpfulness": "0/0", "author": "kristina kreese \"kristina salvitti\""}, {"rating": 5.0, "review": "I can't say enough good things about the fire stick.  It is so convenient and really easy to understand.  The home screen allows you to go just where you want with no hassle. The best thing is there is no more buffering.  Just love it and it changed my life.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "I love it! It's great because I don't have smart t.v so this lets me stream everything on my t.v.", "verified": true, "helpfulness": "0/0", "author": "Sabina Appel"}]