[{"rating": 5.0, "review": "I have had my fire stick for a month now and I love it.  Have already suggested it to many friends.", "verified": true, "helpfulness": "0/0", "author": "Brian H."}, {"rating": 4.0, "review": "It works perfect for what I needed!", "verified": true, "helpfulness": "0/0", "author": "Cheetaria \"Tell us about yourself!\""}, {"rating": 5.0, "review": "Good functionality and a great price make this a good option for cutting the cord.", "verified": true, "helpfulness": "0/0", "author": "K Cook"}, {"rating": 5.0, "review": "Better than chromscast and don't crash like chrome cast!", "verified": true, "helpfulness": "0/0", "author": "Nguyen"}, {"rating": 3.0, "review": "Only good at one thing, but it does that thing the best: Amazon Prime Video. None of my favorite Chromecast apps are on here (UFC TV, WWE Network, HBO Go) and the Netflix app seems to just open the Netflix app on my smart TV. The YouTube app is hardly usable. I bought it for Prime Video though, and so far it's a much better experience than the Prime app on my TV.Update: HBO Go and WWE Network have been added. But so have ads before videos. I can't stress this enough: if you pay for a streaming service, nothing is more offensive than seeing ads. That just makes me want to watch non-exclusive titles on Netflix when I would have preferred to watch them on Prime Video. Minus two stars. That's how much I hate ads.", "verified": true, "helpfulness": "0/0", "author": "JV"}, {"rating": 2.0, "review": "I purchased the fire tv stick to replace our broken cromecast. We use it for straming Netflix and YouTube mostly. I'm disappointed in the buffering", "verified": true, "helpfulness": "0/0", "author": "Bryan Crawford"}, {"rating": 4.0, "review": "Yes, it was all that it was advertised to be. The remote control is good too.", "verified": true, "helpfulness": "0/0", "author": "William L. Bowman Sr."}, {"rating": 5.0, "review": "An absolute must for Amazon Prime members!", "verified": true, "helpfulness": "0/0", "author": "Fredrick H. Sowerby"}, {"rating": 5.0, "review": "Love it. Works great", "verified": true, "helpfulness": "0/0", "author": "Marcus Robinson"}, {"rating": 1.0, "review": "Cost of purchasing programs more than I expected!  No trial period offered......not worth the investment overall.", "verified": false, "helpfulness": "0/0", "author": "t.d.west"}]