[{"rating": 5.0, "review": "This product meet all my espectation,exelente, small but  really funcionally", "verified": true, "helpfulness": "0/0", "author": "felix"}, {"rating": 5.0, "review": "A friend recommended this and I am so glad she did.  It was easy to set up and with my Amazon Prime I have lots of options to choose from.  I did not need any additional extension.  Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "NancBinCO"}, {"rating": 5.0, "review": "Awesome product that allows older tvs to watch via the Internet.  Well worth the money!!", "verified": true, "helpfulness": "0/0", "author": "s.reece"}, {"rating": 5.0, "review": "I am in love with this product!", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "way cool", "verified": true, "helpfulness": "0/0", "author": "geraldine cirelli"}, {"rating": 4.0, "review": "Easy to install. Works good. Amazon Prime should set up more brands of televisions to be able to receive Prime video without the use of a Fire stick. Some brands of television don'the need the Fire stick.", "verified": true, "helpfulness": "0/0", "author": "Walter L. Moser"}, {"rating": 4.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 4.0, "review": "Initially had a few problems with our wireless router dropping the bandwidth so we would first lose the  sound and then the picture. We found out it was having interferece issues from our Direct TV dish wiring, our ISP tech did a scan and found the problem once this was resolved all is o.k..", "verified": true, "helpfulness": "0/0", "author": "Richard Doll"}, {"rating": 5.0, "review": "Excellent purchase thus far! I'm pleased", "verified": true, "helpfulness": "0/0", "author": "Tayuanna"}, {"rating": 1.0, "review": "Unfortunately, I cannot get this thing to work. I've had it since Christmas and it I've tried everything to fix it. Although I don't have a Roku, Chrome Stick, or any other simple wifi stick, I would recommend anything else over the Fire stick. It doesn't work well at all. It drops connection regularly to a point where it's unwatchable. My xbox360 worked better.", "verified": true, "helpfulness": "0/0", "author": "Brad Mitchell"}]