[{"rating": 5.0, "review": "I have subscribed to Netflix and Hulu for 3 or 4 years and have not missed cable.  The Fire Stick has enhanced my experience even more with added features.  I love the Amazon Fire Stick and have already suggested it to family and friends.", "verified": true, "helpfulness": "0/0", "author": "Eileen Norman"}, {"rating": 2.0, "review": "I'm thankful I bought this on sale. It has a hard time keeping up during streaming of Netflix, SlingTV, and Hulu.  Video freezes for several seconds while audio plays, then video goes fast to catch up.  My older Roku is more reliable.  I was hoping this device would make the transition to sling TV easier but it has proven to be sporadic at best.  Not surprisingly it works great with Amazon Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product.  Easy to use, lots of free games and stuff that my kids love.  Didn't cost much and does a lot", "verified": true, "helpfulness": "0/0", "author": "Daniel McIsaac"}, {"rating": 3.0, "review": "Still learning. Remote is the pits. Should be universal to control TV \"on/off & volumn\". Should also have some markings on the circle controller.  Hopefully will be able to give it a 4 or 5 after learning more", "verified": true, "helpfulness": "0/0", "author": "larry weller"}, {"rating": 3.0, "review": "This is my second time purchasing it because the other one will not work after 2 months!", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 5.0, "review": "Products was refurbished but looked and was packaged as if Brand New. Instructions and on-screen guides were easy to navigate. Better alternative to Roku players. Have yet to test out Kodi capabilities.", "verified": true, "helpfulness": "0/0", "author": "Frequently Buying Amazon"}, {"rating": 5.0, "review": "The Amazon Fire TV Stock is amazing! Well worth the purchase--we have eliminated Cable TV. My only issue is the menu style; I prefer a list view menu and the Fire Stick uses a scrolling menu. Overall a great product, especially for Amazon Prime members!", "verified": true, "helpfulness": "0/0", "author": "Kriedell"}, {"rating": 1.0, "review": "TyikTy", "verified": false, "helpfulness": "0/1", "author": "gary a rodriguez"}, {"rating": 5.0, "review": "Love it!!! Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "ps0412"}, {"rating": 2.0, "review": "MIRRORING function does not work well. so I returned it because I bought it for mirroring function. for cell phone mirroring, you have to download application on both fire tv stick and your phone. and you have to open app on both tv stick and your phone in order to mirror. it is not like one touch and go. and for the laptop mirroring, you have to go to \"setting menu\" and enable mirroring function and pair your laptop. you have to do this every time you want to use this function. other function and quality is pretty good, but I give 2 stars because all I needed was convenient mirroring function.", "verified": true, "helpfulness": "0/0", "author": "sehooi ko"}]