[{"rating": 5.0, "review": "It works great....easy to use....lots of video type instructions.  Bought it for our guest rooms that don't have cable connections, since it works off our WIFI.", "verified": true, "helpfulness": "0/0", "author": "Tim Talley"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "joseph tallerico"}, {"rating": 5.0, "review": "Love it....can even control it by voice from my phone,", "verified": true, "helpfulness": "0/0", "author": "csantathemom"}, {"rating": 4.0, "review": "It's ok.", "verified": true, "helpfulness": "0/0", "author": "Thomas Brown"}, {"rating": 4.0, "review": "We run our netflix and amazon prime stream through the PS3 in the bedroom. This was a well priced way to have access to these on our main tv in the living room. Set up was very simple. Had it up and running within a few minutes of opening the box.", "verified": true, "helpfulness": "0/0", "author": "Greg Skiles"}, {"rating": 4.0, "review": "I love it.  I don't have to watch Netflix on a small screen anymore.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "In theory I loved it, but in practice it didn't work for me at all. I like the remote better than the one that comes with Roku, because I like the \"ok/go\" button in the center of the directional pad. The menu is easy to navigate, the picture is great, setup was easy... it was perfect. Unfortunately, the remote wouldn't work from more than three feet away. My HDMI plugs are in the center, back of the TV, and even with the little extender that comes with the stick I guess the EM interference was too great. I had to stand near the TV, with my arm out to the side, to get the remote to respond.So, yes, I could have bought an HDMI extender, but I made the aesthetic choice not to go with the \"dongle hanging down\" look. I'm considering the non-stick version of Amazon Fire, pending my experience with the Roku 3.", "verified": true, "helpfulness": "1/1", "author": "R. Huffman"}, {"rating": 5.0, "review": "Absolutely love it, exactly as described", "verified": true, "helpfulness": "0/0", "author": "Barbara Deaton"}, {"rating": 5.0, "review": "The Fire Stick worked as it was intended.", "verified": true, "helpfulness": "0/0", "author": "Michael N. Ryan"}, {"rating": 5.0, "review": "This thing is awesome. I was concerned that it would sit and buffer every so often; which is annoying since it runs through WIFI, but it didn't at all. It plays smoothly with no buffering interruptions. The content, apps, games, etc are awesome. Excellent value and bang for your entertainment buck. I highly recommend this for everyone.", "verified": true, "helpfulness": "0/0", "author": "James Hamilton"}]