[{"rating": 5.0, "review": "My only complaint about my Fire TV Stick is that now I definitely have too many choices. The upside is that I can now pretty much watch anything I want, when I want. In addition to Amazon Prime and Netflix, my Fire TV Stick also allows me to get the most out of my premium channel subscriptions. I can watch all of the best of HBO, Starz and Showtime. My TV is mine again!", "verified": true, "helpfulness": "0/0", "author": "Tim E. Healy"}, {"rating": 5.0, "review": "It was all expectation I really like there is where I watch my tv already thank you", "verified": true, "helpfulness": "0/0", "author": "erika magana"}, {"rating": 2.0, "review": "Very disappointed MLB TV app doesn't work well.  Video for live game freezes every 5 seconds.  I have the regular Fire TV box also.  No issues there w/MLB.TV app.  Not sure why the Fire stick would have the issue.  But must be performance related somehow.", "verified": true, "helpfulness": "0/0", "author": "Kitt Gryskiewicz"}, {"rating": 1.0, "review": "broke after 30days but other than that worked great while it lasted", "verified": true, "helpfulness": "0/0", "author": "fidenciatracy"}, {"rating": 4.0, "review": "Excellent. Still hunting through all the Options", "verified": true, "helpfulness": "0/0", "author": "Jeff/Tammy Hammond"}, {"rating": 5.0, "review": "Now everywhere we go we can show our friends stuff on amazon prime and netflix etc. It's been very handy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great!", "verified": true, "helpfulness": "0/0", "author": "Karyn"}, {"rating": 3.0, "review": "Certain apps lag on the Fire TV Stick but doesn't lag on the PS4/XB1 (most noticeable TV streaming services like Sling TV).  At first I thought it was my Internet connection or the firmware on the Fire TV Stick.  Did the typical 'update firmware and reset back to factory' process but no luck.  Tried different TV, tweaked the home WiFi connection, whatever I could get my hands on to resolve the stutter during stream and ran out of options so now I just use other devices to get around it.  Strangely though, the Amazon Prime app works flawlessly during playback so that's good.", "verified": true, "helpfulness": "0/0", "author": "KHCK512"}, {"rating": 5.0, "review": "Love this gadget.  Fast shipping too.  Reasonable price", "verified": true, "helpfulness": "0/0", "author": "Doreen A. Myers"}, {"rating": 5.0, "review": "Easy to set up, easy to navigate.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Elaine A. Cullen \"CurtainLady\""}]