[{"rating": 1.0, "review": "Did not work well. Constantly buffering. I have very fast internet and it still didn't work well. Switched to a bluray player which works great!", "verified": true, "helpfulness": "0/0", "author": "Frank C."}, {"rating": 5.0, "review": "Endless entertainment possibilities", "verified": true, "helpfulness": "0/0", "author": "Ann A Watkins"}, {"rating": 1.0, "review": "Awful. I'm on my second remote and I'm done. Remote is of the lowest quality and stops working at any given time. It is so sensitive that if you lightly drop it on your sofa to use your tv remote just by hitting the sofa surface it will switch functions. Not worth it at all.", "verified": true, "helpfulness": "0/0", "author": "A. Sullivan"}, {"rating": 5.0, "review": "Excellent product, simple to install and do the set up - awesome device !!!!!", "verified": true, "helpfulness": "0/0", "author": "Rodney P. Leddy"}, {"rating": 4.0, "review": "Works well.  Data entry and program search awkward if you don't use voice control from phone or tablet.  I have all the major brands and find each is a little different, none perfect, none horrible.  It is an adjunct to cable tv, not a replacement.  You get the networks they have arrangements with, not necessarily the ones you want.  A nice addition.  Remember, much of the content is pay to watch, so you will end up spending more than you anticipated until the novelty wears off.  It does what they claim it will do.", "verified": true, "helpfulness": "0/0", "author": "Adolph Menjou"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Matthew Schwartz"}, {"rating": 5.0, "review": "I really like playing my Pandora selectionsAnd my kids love watching Netflix", "verified": true, "helpfulness": "0/0", "author": "Elsa Telles"}, {"rating": 5.0, "review": "Love it!!!  Great purchase!!", "verified": true, "helpfulness": "0/0", "author": "jennifer Banas"}, {"rating": 4.0, "review": "Not as good as a roku but it will do for my kids room", "verified": true, "helpfulness": "0/0", "author": "Bethany Devazier"}, {"rating": 5.0, "review": "Easy to install, straight forward layout, delivered on time and even came with batteries! Very much worth the money.", "verified": true, "helpfulness": "0/0", "author": "Ken"}]