[{"rating": 5.0, "review": "This think is so cool!  My TV just got 'smart'!  I downloaded the i-phone app for it, which works great.It is one of those rare items that fits in the category of 'how did I live without this'? (another thing that fits nicely in that category is Amazon Prime)Thanks!", "verified": true, "helpfulness": "0/0", "author": "FM \"FM\""}, {"rating": 1.0, "review": "I'm sorry, but this is a piece of crap! I have bought 2 sticks, one for me and another to give as a gift to somebody else. When I tried to play some movie, even just the trailer, it shows me the error below. This is happening with both sticks, brand new! Very disappointed and frustrated!", "verified": true, "helpfulness": "0/0", "author": "Ricardo Di Stefano"}, {"rating": 5.0, "review": "We purchased this Fire Stick to go along with our Samsung SmartTV and a subscription to Sling TV after getting rid of cable. It is easy to use and the app menu is great. We also like being able to download movies and shows from Amazon Prime. A wireless extender helps to boost the signal, but this is a TV issue more than the Fire Stick. We did notice a considerably better wireless signal when streaming through the Fire Stick than streaming through the TV's wireless.", "verified": true, "helpfulness": "0/0", "author": "Katie Schalkoff"}, {"rating": 5.0, "review": "It's perfect!", "verified": true, "helpfulness": "0/0", "author": "CLS"}, {"rating": 5.0, "review": "everything I expected it to be", "verified": true, "helpfulness": "0/0", "author": "Carol M"}, {"rating": 4.0, "review": "Works great, if the Internet is fairly fast. Bought it for boat,most marina don't have very fast Internet. At home works great", "verified": true, "helpfulness": "0/0", "author": "gentleman jack"}, {"rating": 5.0, "review": "Love my fire stick!!!  I never realized how different going from a tube TV to my HD LED.  This fire stick is great.  Netflix, Hulu and Amazon Prime.  Who could ask for more?", "verified": true, "helpfulness": "0/0", "author": "Andrea Meaney"}, {"rating": 5.0, "review": "\"The sky is the limit\" ... or not :-)Love it !", "verified": true, "helpfulness": "0/0", "author": "Maria Lucia Marra"}, {"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "This is everything it's promised and with a great price point!", "verified": true, "helpfulness": "0/0", "author": "Holly E Bohn"}]