[{"rating": 3.0, "review": "Wi-Fi disconnects frequently, causes lag in video. I have good quality wifi, can stream from laptops and phones no problem.", "verified": true, "helpfulness": "0/0", "author": "D. Fountain-Jagodzinski"}, {"rating": 5.0, "review": "Faster than our previous generation Roku and it includes the YouTube channel. We are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Pen"}, {"rating": 5.0, "review": "All I can say is that I'm so thankful that I ordered this TV television stick. That is all!", "verified": true, "helpfulness": "0/0", "author": "Daphira Maglo"}, {"rating": 5.0, "review": "I took this gift to India from USA and everyone enjoyed it, I write a blog about best gift ideas to India from USA and recommended this one of the product you should take .Sachin Rajgirehttp://greatindiaescape.com", "verified": false, "helpfulness": "0/0", "author": "Sachin Rajgire"}, {"rating": 3.0, "review": "UPDATE 4/6/15:  I still like the hideability, the sleek remote and ease of using Amazon Prime video.  **BUT** I have found that the HuluPlus app on this device will freeze and stall.  Switched this Fire Stick with the Roku I was using on another TV and no problems with any of the \"channels\" downloaded on the Roku including HuluPlus and Amazon.  Both were in the same place on same TV and same distance from my router, so I can only assume the problem is the different streaming device.  Since I use HuluPlus quite a bit, the Fire is now on the TV in the crafts and exercise room, where it will only be used occasionally.  With both HuluPlus and Vudu not usable or not existing on the Fire, I've taken away a star from my original 4-star review.  I would not recommend this device if you are interested in either of those streaming services.  While the Fire has much quicker response, and it is absolutely great for streaming PrimeVideo,  it makes no difference when you can't get the other services you want.  So, if you aren't interested in Vudu or Hulu+, I don't see a problem.ORIGINAL REVIEW:  Nice, fast, and clear streaming.  My smart tv apps were stalling (had I known it was powered by Yahoo, I would never have bought a Vizio with the smart features) but the picture is great, so I needed a stick for this TV.  I have a Roku on my other TV, but I decided on the Fire Stick because it had more memory and faster processor, etc.  It is all that, and its set up for using Prime.  Prime is very awkward on my smart TV, but much easier on the Roku, and best on Amazon's own device of course.  The biggest disappointment is not being able to get VUDU on the Fire.  Yeah, I know Amazon wants me to buy my movies from them, but until they subscribe to UltraViolet, that's where my movie purchases will come from.  They don't have a problem offering the Netflix app, which has most of the same offerings as Prime.  Vudu allows me to link through UltraViolet with a few family members so we can share our libraries with one another, a BIG draw.  So, if you are not using and not interested in VUDU, this is a great choice.  However, if you do want it, and this purchase would be your one and only streaming device.... get a Roku.", "verified": true, "helpfulness": "0/0", "author": "DeSuTh"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Very pleased with this product!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I am so happy with my choice to buy an Amazon Fire TV stick.  I was disappointed that my 8 year old Sony Bravia HDTV set did not recognize the device.  Lucky for me, my 3 year old Denon video amplifier did.  This stick is amazing because it opens up a world of choices, including cable tv subscriptions like HBO and Showtime.  Music is stunning and sounds fantastic over my speakers system, since the Fire TV stick is plugged into the Denon unit, the sound is from the surround speaker array.  This Amazon Fire TV stick is a great choice for anybody that wants to say goodbye to the cable company.", "verified": true, "helpfulness": "0/0", "author": "Blake Griffin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "It is great to have all my subscription services in one place and all the available apps are fantastic. It is so much faster and easier to use than the game console. Definitely a must have and I love the voice controlled app on my iPhone", "verified": true, "helpfulness": "0/0", "author": "Holly Johnson"}]