[{"rating": 5.0, "review": "Easy installation and set up! It came a few weeks before I expected it! Next step...getting rid of cable!", "verified": true, "helpfulness": "0/0", "author": "Sue J"}, {"rating": 4.0, "review": "I like the Amazon fire stick because of the access to my Amazon prime movies and apps like Hulu. I gave it 4 stars because I expected an all one remote experience. I think that the remote should have quick buttons to maneuver to popular apps like Vudu. I was unhappy that Vudu wasn't available because I have so many movies on my account. Overall it loads faster then the Roku but lacks the apps most movies lovers like to view. Games are a plus and I'll eventually purchase the game controller.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Love it love it! Buying it for others for Christmas!", "verified": false, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "i love it", "verified": false, "helpfulness": "0/0", "author": "ljiljana jankovich"}, {"rating": 4.0, "review": "I truly like this device, but it has not developed into love just yet. There are some issues with video playback - especially in Hulu Plus. However, I'm hoping that with some updates to address these issues, this device will be a five star rating, easy.", "verified": true, "helpfulness": "0/0", "author": "R. Tisdale"}, {"rating": 4.0, "review": "perform as expected. Still learning how to load app into the stick.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 2.0, "review": "Doesn't always work. Have to unplug and then plug in again to the HDMI port for it to work. Glad I only paid $19 for it.", "verified": true, "helpfulness": "1/1", "author": "Dominick Moore"}, {"rating": 5.0, "review": "Does everything I need it too and more!  For the $20 special deal Amazon had, how can you go wrong.  Not as many apps as Roku, but honestly would never use all of them anyway.  Has the essential apps that I use.  Great product so far Amazon.", "verified": true, "helpfulness": "1/1", "author": "Ashley"}, {"rating": 4.0, "review": "Got it at a great price. Got thorough helpful emails. Plugs in easily, easy to figure out and work and I am not sure I will use it a lot but wanted to try it out.", "verified": true, "helpfulness": "1/1", "author": "Charlene Heath"}, {"rating": 4.0, "review": "Easy to use, streaming is faster now. sometime need to reboot.", "verified": true, "helpfulness": "0/0", "author": "The Big Shopper \"T\""}]