[{"rating": 1.0, "review": "Died lasted 5 month even bought a new remote to see if it would work better, worked the same then completely died.", "verified": true, "helpfulness": "0/0", "author": "Ront"}, {"rating": 5.0, "review": "The item works great was easy to install and thank God it takes so little room", "verified": true, "helpfulness": "0/0", "author": "Kent Rubert \"imageryofsound\""}, {"rating": 5.0, "review": "I bought this for my dad, since he's semi - retiring (going from 7 to 2 days a week) and he loves it. It's great because he doesn't have a game system to use as a platform. The Chromecast wasn't an option because he doesn't have a smart phone, and isn't that technologically inclined to use my laptop. It's very similar to a menu like OnDemand, which is simple to follow. We haven't had any trouble with the connection. I'm very happy with this purchase.", "verified": false, "helpfulness": "0/0", "author": "k Stanley"}, {"rating": 5.0, "review": "Its turned my flatscreen tv into a \"Smart\" tv!", "verified": true, "helpfulness": "0/0", "author": "Kevin McFarland"}, {"rating": 5.0, "review": "Prior to me ordering this, I had purchased the Roku. I took Roku back. It cost more but did not offer all the features. Also with Roku the remote did not work very well. We purchased this so that we could cut off our cable. We love it!!!! Very easy to use. Super easy to connect to your TV and Wi-Fi.", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "I love the simplicity of the fire stick and it allows me to watch what i want without having to pay crazy payments to the cable company monthly.  Very mobile and easy for a frequent traveler.", "verified": true, "helpfulness": "0/0", "author": "Kyla"}, {"rating": 5.0, "review": "Love this thing. It can lag on occasion, but I will never return it. Only down side I have found is... Nothing.", "verified": true, "helpfulness": "0/0", "author": "Alec05"}, {"rating": 1.0, "review": "We decided to cut the cord and use Sling TV for ESPN, AMC and other channels, Amazon Prime for movies and other tv, plus an antennae for local channels.  We used a deal through Sling for a \"free\" Fire stick in exchange for prepaying three months of that service.  We had a miserable time trying to watch NCAA basketball on ESPN/TBS via Sling and faced big delays, and catching up or buffering errors watching any programming.  There was a huge lag to switch channels and several basketball games were impossible to follow due to buffering.  The last straw was buffering throughout the Mad Men episodes that started a few weeks ago.  We thought the problem was Sling or our wireless connection but read about Roku's faster processor.  We set up the Roku 2 today and it is an unbelievable difference! The picture is sharper, there are NO lags, no buffering, no pixelation, even with LIVE sports.  I cannot recommend the Fire stick at all and would return it if I could.  Because we got it through the Sling deal, however, I  unfortunately can't get my money back and get a credit against the Roku cost instead.  I highly recommend getting a Roku 2 (for which Sling also provides deals).", "verified": true, "helpfulness": "0/0", "author": "Cariop"}, {"rating": 1.0, "review": "HORRIBLE. biggest waste of time and money. I have comcast high speed internet on a secure network. My firestick is not even 10 feet from my router. It constantly has to stop and load through an episode or movie. I have tried to restart or unplug the firestick as well as my wireless modem and it still lags.", "verified": false, "helpfulness": "0/0", "author": "Adam white"}, {"rating": 1.0, "review": "I got this product as a gift. I have used many other streaming services. Such as Google Chrome cast, Roku, and Netgear. But this by far is the worst out of all devices I have used. It frequently crashes tells me that I have poor signal strength and simply won't work at various times during the day. I'll check my Internet connections. I am getting 30 Mb down I believe simply Amazon is not capable of delivering a compelling or Worthwild device at this time.", "verified": false, "helpfulness": "0/0", "author": "paul daniels"}]