[{"rating": 3.0, "review": "I travel frequently and I purchased the Amazon Fire TV Stick to take along with me to have access to the streaming content I enjoy at home. The Amazon Fire TV Stick allows you to connect to hotel Wi-Fi, which often requires acceptance of term and/or authentication to connect. This is an advantage over the Roku Stick, which does not open a browser to connect to the Wi-Fi landing page. The hardware for the Amazon Fire TV Stick is also better than the Roku Stick.One big disadvantage for the Amazon Fire TV is the UI, which seems to be designed solely to sell you more Amazon services. See here for screenshots of the UI: http://www.engadget.com/gallery/amazon-fire-tv-ui-screenshots/ Missing from the screenshots is the banner advertisement on the Home page. In my opinion, the Home page would be better served offering a landing page for MY content, not redundant links to Amazon services already profusely offered on other menu pages.The search feature is inconsistent and does not always correctly identify that a searched item is available for free from another app (such as HBO Go or Netflix). Instead, the searched item is offered to purchase from Amazon. In comparing the search features between Fire TV and Roku, the Roku search correctly offered the free choice over paid services.Regarding miracast streaming from an external device to the Fire TV stick, all Windows devices are left out. So, if you are a Microsoft Surface owner you are better off with Roku devices that support it.Frankly, I'd return it, but it minimally suits my needs for streaming entertainment when I travel.", "verified": true, "helpfulness": "0/0", "author": "Christopher Shilt"}, {"rating": 5.0, "review": "A good unit in conjunction with your Amazon Prime.  Very easy to use and to hook up. Would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Walt Bates"}, {"rating": 5.0, "review": "Super easy to install and use! I'm thrilled with my purchase and the Amazon Prime service, but need to read up on how to upgrade to Amazon Fire TV, so I don't have a pay-to-view menu. Even without it, though, the Fire TV Stick and Amazon Prime offer a nice variety and linked up to Netflix, I have a lot to choose from for viewing options.", "verified": true, "helpfulness": "0/0", "author": "Shawn MacGregor"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "manny"}, {"rating": 3.0, "review": "While watching something I lose signal at least once and have to reload.  I checked my Internet service and that isn't the problem.", "verified": true, "helpfulness": "0/0", "author": "Adrian Zepeda"}, {"rating": 5.0, "review": "Very easy set up and works like a charm!  Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "J. Nauth"}, {"rating": 4.0, "review": "the fire stick plays much better than my smart TV.  It doesn't cut my shows off.  It does what it should do.  I would recommend this to anyone.  Has a lot of apps and games you can play.  The one thing is tho you have to have a game controller to play most games.", "verified": true, "helpfulness": "0/0", "author": "Brandy Ponder"}, {"rating": 5.0, "review": "love it works great, cool games to.  great price, love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing I could of done. Works great! Love it!", "verified": true, "helpfulness": "0/0", "author": "Berto"}, {"rating": 5.0, "review": "Awesome thank U so much", "verified": true, "helpfulness": "0/0", "author": "kelsey stewart"}]